[{"id": "1210.0026", "submitter": "Artiom Kovnatsky Artiom Kovnatsky", "authors": "A. Kovnatsky, M.M.Bronstein, A.M.Bronstein, K. Glashoff, R. Kimmel", "title": "Coupled quasi-harmonic bases", "comments": "10 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of Laplacian eigenbases has been shown to be fruitful in many\ncomputer graphics applications. Today, state-of-the-art approaches to shape\nanalysis, synthesis, and correspondence rely on these natural harmonic bases\nthat allow using classical tools from harmonic analysis on manifolds. However,\nmany applications involving multiple shapes are obstacled by the fact that\nLaplacian eigenbases computed independently on different shapes are often\nincompatible with each other. In this paper, we propose the construction of\ncommon approximate eigenbases for multiple shapes using approximate joint\ndiagonalization algorithms. We illustrate the benefits of the proposed approach\non tasks from shape editing, pose transfer, correspondence, and similarity.\n", "versions": [{"version": "v1", "created": "Fri, 28 Sep 2012 20:29:37 GMT"}], "update_date": "2012-10-02", "authors_parsed": [["Kovnatsky", "A.", ""], ["Bronstein", "M. M.", ""], ["Bronstein", "A. M.", ""], ["Glashoff", "K.", ""], ["Kimmel", "R.", ""]]}, {"id": "1210.0228", "submitter": "Nabarun Mondal Mr", "authors": "Nabarun Mondal and Partha P. Ghosh", "title": "Invariance And Inner Fractals In Polynomial And Transcendental Fractals", "comments": "22 pages, 22 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS cs.GR nlin.PS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A lot of formal and informal recreational study took place in the fields of\nMeromorphic Maps, since Mandelbrot popularized the map z <- z^2 + c. An\nimmediate generalization of the Mandelbrot z <-z^n + c also known as the\nMultibrot family were also studied. In the current paper, general truncated\npolynomial maps of the form z <- \\sum_{p>=2} a_px^p +c are studied. Two\nfundamental properties of these polynomial maps are hereby presented. One of\nthem is the existence of shape preserving transformations on fractal images,\nand another one is the existence of embedded Multibrot fractals inside a\npolynomial fractal. Any transform expression with transcendental terms also\nshows embedded Multibrot fractals, due to Taylor series expansion possible on\nthe transcendental functions. We present a method by which existence of\nembedded fractals can be predicted. A gallery of images is presented alongside\nto showcase the findings.\n", "versions": [{"version": "v1", "created": "Sun, 30 Sep 2012 18:22:20 GMT"}], "update_date": "2012-10-02", "authors_parsed": [["Mondal", "Nabarun", ""], ["Ghosh", "Partha P.", ""]]}, {"id": "1210.0880", "submitter": "Jose A. Iglesias", "authors": "Jose A. Iglesias, Ron Kimmel", "title": "Schr\\\"{o}dinger Diffusion for Shape Analysis with Texture", "comments": "Extended version of NORDIA'12 paper. Includes one more figure and\n  appendix with proof", "journal-ref": "ECCV 2012. Workshops and Demonstrations, Lecture Notes in Computer\n  Science 7583, pp. 123-132, Springer, 2012", "doi": "10.1007/978-3-642-33863-2_13", "report-no": null, "categories": "cs.CV cs.CG cs.GR math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, quantities derived from the heat equation have become\npopular in shape processing and analysis of triangulated surfaces. Such\nmeasures are often robust with respect to different kinds of perturbations,\nincluding near-isometries, topological noise and partialities. Here, we propose\nto exploit the semigroup of a Schr\\\"{o}dinger operator in order to deal with\ntexture data, while maintaining the desirable properties of the heat kernel. We\ndefine a family of Schr\\\"{o}dinger diffusion distances analogous to the ones\nassociated to the heat kernels, and show that they are continuous under\nperturbations of the data. As an application, we introduce a method for\nretrieval of textured shapes through comparison of Schr\\\"{o}dinger diffusion\ndistance histograms with the earth's mover distance, and present some numerical\nexperiments showing superior performance compared to an analogous method that\nignores the texture.\n", "versions": [{"version": "v1", "created": "Tue, 2 Oct 2012 19:03:04 GMT"}], "update_date": "2021-06-09", "authors_parsed": [["Iglesias", "Jose A.", ""], ["Kimmel", "Ron", ""]]}, {"id": "1210.1192", "submitter": "Sukhpal  Singh", "authors": "Sukhpal Singh", "title": "Reduction of Blocking Artifacts In JPEG Compressed Image", "comments": "10 Pages including 6 figures, Presented in the TECHNOVISION-10 in\n  G.N.D.E.C., Ludhiana, Punjab, India", "journal-ref": "Conference Proceedings of the National Level Technical Symposium\n  on Emerging Trends in Technology, 9th-10th April, 2010, 234-243", "doi": null, "report-no": "idcs-110 10", "categories": "cs.GR cs.MM", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  In JPEG (DCT based) compresses image data by representing the original image\nwith a small number of transform coefficients. It exploits the fact that for\ntypical images a large amount of signal energy is concentrated in a small\nnumber of coefficients. The goal of DCT transform coding is to minimize the\nnumber of retained transform coefficients while keeping distortion at an\nacceptable level.In JPEG, it is done in 8X8 non overlapping blocks. It divides\nan image into blocks of equal size and processes each block independently.\nBlock processing allows the coder to adapt to the local image statistics,\nexploit the correlation present among neighboring image pixels, and to reduce\ncomputational and storage requirements. One of the most degradation of the\nblock transform coding is the blocking artifact. These artifacts appear as a\nregular pattern of visible block boundaries. This degradation is a direct\nresult of the coarse quantization of the coefficients and the independent\nprocessing of the blocks which does not take into account the existing\ncorrelations among adjacent block pixels. In this paper attempt is being made\nto reduce the blocking artifact introduced by the Block DCT Transform in JPEG.\n", "versions": [{"version": "v1", "created": "Wed, 3 Oct 2012 18:53:36 GMT"}, {"version": "v2", "created": "Tue, 10 Sep 2013 19:32:08 GMT"}, {"version": "v3", "created": "Wed, 12 Feb 2014 03:49:50 GMT"}], "update_date": "2014-02-13", "authors_parsed": [["Singh", "Sukhpal", ""]]}, {"id": "1210.3325", "submitter": "Cristian Constantin Lalescu", "authors": "Kai B\\\"urger, Marc Treib, R\\\"udiger Westermann, Suzanne Werner,\n  Cristian C Lalescu, Alexander Szalay, Charles Meneveau, and Gregory L Eyink", "title": "Vortices within vortices: hierarchical nature of vortex tubes in\n  turbulence", "comments": "2 pages, 1 low quality video, 1 high quality video", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.flu-dyn cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The JHU turbulence database [1] can be used with a state of the art\nvisualisation tool [2] to generate high quality fluid dynamics videos. In this\nwork we investigate the classical idea that smaller structures in turbulent\nflows, while engaged in their own internal dynamics, are advected by the larger\nstructures. They are not advected undistorted, however. We see instead that the\nsmall scale structures are sheared and twisted by the larger scales. This\nilluminates the basic mechanisms of the turbulent cascade.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2012 19:14:50 GMT"}, {"version": "v2", "created": "Fri, 22 Mar 2013 22:29:41 GMT"}], "update_date": "2013-03-26", "authors_parsed": [["Bürger", "Kai", ""], ["Treib", "Marc", ""], ["Westermann", "Rüdiger", ""], ["Werner", "Suzanne", ""], ["Lalescu", "Cristian C", ""], ["Szalay", "Alexander", ""], ["Meneveau", "Charles", ""], ["Eyink", "Gregory L", ""]]}, {"id": "1210.6192", "submitter": "Kasturika B Ray", "authors": "Rachita Misra, Kasturika B ray", "title": "Textural Approach to Palmprint Identification", "comments": "9 pages", "journal-ref": "http://www.ijascse.in/publications-2012--2", "doi": null, "report-no": null, "categories": "cs.CV cs.CR cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biometrics which use of human physiological characteristics for identifying\nan individual is now a widespread method of identification and authentication.\nBiometric identification is a technology which uses several image processing\ntechniques and describes the general procedure for identification and\nverification using feature extraction, storage and matching from the digitized\nimage of biometric characters such as Finger Print, Face, Iris or Palm Print.\nThe current paper uses palm print biometrics. Here we have presented an\nidentification approach using textural properties of palm print images. The\nelegance of the method is that the conventional edge detection technique is\nextended to suitably describe the texture features. In this technique all the\ncharacteristics of the palm such as principal lines, edges and wrinkles are\nconsidered with equal importance.\n", "versions": [{"version": "v1", "created": "Tue, 23 Oct 2012 10:52:31 GMT"}], "update_date": "2012-10-24", "authors_parsed": [["Misra", "Rachita", ""], ["ray", "Kasturika B", ""]]}, {"id": "1210.8025", "submitter": "Ka Chun Lam", "authors": "Lok Ming Lui, Ka Chun Lam, Tsz Wai Wong, XianFeng Gu", "title": "Beltrami Representation and its applications to texture map and video\n  compression", "comments": "30 pages, 23 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.GR math.DG", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Surface parameterizations and registrations are important in computer\ngraphics and imaging, where 1-1 correspondences between meshes are computed. In\npractice, surface maps are usually represented and stored as 3D coordinates\neach vertex is mapped to, which often requires lots of storage memory. This\ncauses inconvenience in data transmission and data storage. To tackle this\nproblem, we propose an effective algorithm for compressing surface\nhomeomorphisms using Fourier approximation of the Beltrami representation. The\nBeltrami representation is a complex-valued function defined on triangular\nfaces of the surface mesh with supreme norm strictly less than 1. Under\nsuitable normalization, there is a 1-1 correspondence between the set of\nsurface homeomorphisms and the set of Beltrami representations. Hence, every\nbijective surface map is associated with a unique Beltrami representation.\nConversely, given a Beltrami representation, the corresponding bijective\nsurface map can be exactly reconstructed using the Linear Beltrami Solver\nintroduced in this paper. Using the Beltrami representation, the surface\nhomeomorphism can be easily compressed by Fourier approximation, without\ndistorting the bijectivity of the map. The storage memory can be effectively\nreduced, which is useful for many practical problems in computer graphics and\nimaging. In this paper, we proposed to apply the algorithm to texture map\ncompression and video compression. With our proposed algorithm, the storage\nrequirement for the texture properties of a textured surface can be\nsignificantly reduced. Our algorithm can further be applied to compressing\nmotion vector fields for video compression, which effectively improve the\ncompression ratio.\n", "versions": [{"version": "v1", "created": "Thu, 18 Oct 2012 12:17:12 GMT"}], "update_date": "2012-10-31", "authors_parsed": [["Lui", "Lok Ming", ""], ["Lam", "Ka Chun", ""], ["Wong", "Tsz Wai", ""], ["Gu", "XianFeng", ""]]}]