[{"id": "2001.00610", "submitter": "Justin DeBenedetto", "authors": "Justin DeBenedetto, David Chiang", "title": "Representing Unordered Data Using Complex-Weighted Multiset Automata", "comments": "Thirty-seventh International Conference on Machine Learning (ICML\n  2020)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unordered, variable-sized inputs arise in many settings across multiple\nfields. The ability for set- and multiset-oriented neural networks to handle\nthis type of input has been the focus of much work in recent years. We propose\nto represent multisets using complex-weighted multiset automata and show how\nthe multiset representations of certain existing neural architectures can be\nviewed as special cases of ours. Namely, (1) we provide a new theoretical and\nintuitive justification for the Transformer model's representation of positions\nusing sinusoidal functions, and (2) we extend the DeepSets model to use complex\nnumbers, enabling it to outperform the existing model on an extension of one of\ntheir tasks.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2020 20:04:45 GMT"}, {"version": "v2", "created": "Mon, 29 Jun 2020 21:01:06 GMT"}, {"version": "v3", "created": "Fri, 28 Aug 2020 14:11:26 GMT"}], "update_date": "2020-08-31", "authors_parsed": [["DeBenedetto", "Justin", ""], ["Chiang", "David", ""]]}, {"id": "2001.01324", "submitter": "Rajdeep Mukherjee", "authors": "Rajdeep Mukherjee, Saurabh Joshi, John O'Leary, Daniel Kroening, Tom\n  Melham", "title": "Hardware/Software Co-verification Using Path-based Symbolic Execution", "comments": "6 pages, 3 tables, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Conventional tools for formal hardware/software co-verification use bounded\nmodel checking techniques to construct a single monolithic propositional\nformula. Formulas generated in this way are extremely complex and contain a\ngreat deal of irrelevant logic, hence are difficult to solve even by the\nstate-of-the-art Satis ability (SAT) solvers. In a typical hardware/software\nco-design the firmware only exercises a fraction of the hardware state-space,\nand we can use this observation to generate simpler and more concise formulas.\nIn this paper, we present a novel verification algorithm for hardware/software\nco-designs that identify partitions of the firmware and the hardware logic\npertaining to the feasible execution paths by means of path-based symbolic\nsimulation with custom path-pruning, property-guided slicing and incremental\nSAT solving. We have implemented this approach in our tool COVERIF. We have\nexperimentally compared COVERIF with HW-CBMC, a monolithic BMC based\nco-verification tool, and observed an average speed-up of 5X over HW-CBMC for\nproving safety properties as well as detecting critical co-design bugs in an\nopen-source Universal Asynchronous Receiver Transmitter design and a large SoC\ndesign.\n", "versions": [{"version": "v1", "created": "Sun, 5 Jan 2020 22:39:28 GMT"}], "update_date": "2020-01-07", "authors_parsed": [["Mukherjee", "Rajdeep", ""], ["Joshi", "Saurabh", ""], ["O'Leary", "John", ""], ["Kroening", "Daniel", ""], ["Melham", "Tom", ""]]}, {"id": "2001.02296", "submitter": "Dan Shiebler", "authors": "Dan Shiebler, Alexis Toumi, Mehrnoosh Sadrzadeh", "title": "Incremental Monoidal Grammars", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we define formal grammars in terms of free monoidal categories,\nalong with a functor from the category of formal grammars to the category of\nautomata. Generalising from the Booleans to arbitrary semirings, we extend our\nconstruction to weighted formal grammars and weighted automata. This allows us\nto link the categorical viewpoint on natural language to the standard machine\nlearning notion of probabilistic language model.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2020 22:37:12 GMT"}, {"version": "v2", "created": "Fri, 10 Jan 2020 12:37:53 GMT"}], "update_date": "2020-01-13", "authors_parsed": [["Shiebler", "Dan", ""], ["Toumi", "Alexis", ""], ["Sadrzadeh", "Mehrnoosh", ""]]}, {"id": "2001.02309", "submitter": "Bj{\\o}rn Kjos-Hanssen", "authors": "Bj{\\o}rn Kjos-Hanssen, Clyde James Felix, Sun Young Kim, Ethan Lamb,\n  Davin Takahashi", "title": "VC-dimensions of nondeterministic finite automata for words of equal\n  length", "comments": "ISAIM 2020 (International Symposium on Artificial Intelligence and\n  Mathematics), Fort Lauderdale, FL. January 6--8, 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ishigami and Tani studied VC-dimensions of deterministic finite automata. We\nobtain analogous results for the nondeterministic case by extending a result of\nChamparnaud and Pin, who proved that the maximal deterministic state complexity\nof a set of binary words of length $n$ is \\[\n  \\sum_{i=0}^n\\min(2^i,2^{2^{n-i}}-1). \\] We show that for the nondeterministic\ncase, if we fully restrict attention to words of length $n$, then we at most\nneed the strictly increasing initial terms in this sum.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jan 2020 22:49:55 GMT"}], "update_date": "2020-01-09", "authors_parsed": [["Kjos-Hanssen", "Bjørn", ""], ["Felix", "Clyde James", ""], ["Kim", "Sun Young", ""], ["Lamb", "Ethan", ""], ["Takahashi", "Davin", ""]]}, {"id": "2001.03480", "submitter": "Raphaela L\\\"obel", "authors": "Raphaela L\\\"obel, Michael Luttenberger, Helmut Seidl", "title": "Equivalence of Linear Tree Transducers with Output in the Free Group", "comments": "Minor changes based on some reviews. A short version of this paper\n  will be published in the proceedings of DLT 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that equivalence of deterministic linear tree transducers can be\ndecided in polynomial time when their outputs are interpreted over the free\ngroup. Due to the cancellation properties offered by the free group, the\nrequired constructions are not only more general, but also simpler than the\ncorresponding constructions for proving equivalence of deterministic linear\ntree-to-word transducers.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2020 14:43:21 GMT"}, {"version": "v2", "created": "Fri, 13 Mar 2020 11:29:50 GMT"}], "update_date": "2020-03-16", "authors_parsed": [["Löbel", "Raphaela", ""], ["Luttenberger", "Michael", ""], ["Seidl", "Helmut", ""]]}, {"id": "2001.03894", "submitter": "Mickael Randour", "authors": "Patricia Bouyer and St\\'ephane Le Roux and Youssouf Oualhadj and\n  Mickael Randour and Pierre Vandenhove", "title": "Games Where You Can Play Optimally with Arena-Independent Finite Memory", "comments": "Updated title, full version of CONCUR 2020 conference paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For decades, two-player (antagonistic) games on graphs have been a framework\nof choice for many important problems in theoretical computer science. A\nnotorious one is controller synthesis, which can be rephrased through the\ngame-theoretic metaphor as the quest for a winning strategy of the system in a\ngame against its antagonistic environment. Depending on the specification,\noptimal strategies might be simple or quite complex, for example having to use\n(possibly infinite) memory. Hence, research strives to understand which\nsettings allow for simple strategies.\n  In 2005, Gimbert and Zielonka provided a complete characterization of\npreference relations (a formal framework to model specifications and game\nobjectives) that admit memoryless optimal strategies for both players. In the\nlast fifteen years however, practical applications have driven the community\ntoward games with complex or multiple objectives, where memory -- finite or\ninfinite -- is almost always required. Despite much effort, the exact frontiers\nof the class of preference relations that admit finite-memory optimal\nstrategies still elude us.\n  In this work, we establish a complete characterization of preference\nrelations that admit optimal strategies using arena-independent finite memory,\ngeneralizing the work of Gimbert and Zielonka to the finite-memory case. We\nalso prove an equivalent to their celebrated corollary of great practical\ninterest: if both players have optimal (arena-independent-)finite-memory\nstrategies in all one-player games, then it is also the case in all two-player\ngames. Finally, we pinpoint the boundaries of our results with regard to the\nliterature: our work completely covers the case of arena-independent memory\n(e.g., multiple parity objectives, lower- and upper-bounded energy objectives),\nand paves the way to the arena-dependent case (e.g., multiple lower-bounded\nenergy objectives).\n", "versions": [{"version": "v1", "created": "Sun, 12 Jan 2020 09:27:36 GMT"}, {"version": "v2", "created": "Thu, 7 May 2020 09:20:32 GMT"}, {"version": "v3", "created": "Mon, 20 Jul 2020 06:43:28 GMT"}, {"version": "v4", "created": "Tue, 6 Apr 2021 07:29:27 GMT"}], "update_date": "2021-04-07", "authors_parsed": [["Bouyer", "Patricia", ""], ["Roux", "Stéphane Le", ""], ["Oualhadj", "Youssouf", ""], ["Randour", "Mickael", ""], ["Vandenhove", "Pierre", ""]]}, {"id": "2001.04249", "submitter": "Salman Haider", "authors": "Salman Haider, Dr. Syed Asad Raza Kazmi", "title": "An extended quantum process algebra (eQPAlg) approach for distributed\n  quantum systems", "comments": "4 figures, 16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL quant-ph", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  In this work, we have expounded the communication procedure of quantum\nsystems by means of process algebra. The main objective of our research effort\nis to formally represent the communication between distributed quantum systems.\nIn this new proposed communication model we have ameliorated the existing rules\nof Lalire's quantum process algebra QPAlg. We have brought some important\nmodification in QPAlg by introducing the concept of formally specifying the\nQuantum teleportation protocol. We have further introduced the formal\ndescription of protocol by using programs that best explains its working and\nsatisfies the specification. Examples have been provided to describe the\nworking of the improved algebra that formally explain the sending and receiving\nof both classical as well as quantum data, keeping in mind the principal\nfeatures of quantum mechanics.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jan 2020 11:02:35 GMT"}], "update_date": "2020-01-14", "authors_parsed": [["Haider", "Salman", ""], ["Kazmi", "Dr. Syed Asad Raza", ""]]}, {"id": "2001.04327", "submitter": "Ranko Lazic", "authors": "Wojciech Czerwi\\'nski, S{\\l}awomir Lasota, Ranko Lazi\\'c, J\\'er\\^ome\n  Leroux and Filip Mazowiecki", "title": "Reachability in fixed dimension vector addition systems with states", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The reachability problem is a central decision problem for formal\nverification based on vector addition systems with states (VASS), which are\nequivalent to Petri nets and form one of the most studied and applied models of\nconcurrency. Reachability for VASS is also inter-reducible with a plethora of\nproblems from a number of areas of computer science. In spite of recent\nprogress, the complexity of the reachability problem remains unsettled, and it\nis closely related to the lengths of shortest VASS runs that witness\nreachability.\n  We consider VASS of fixed dimension, and obtain three main results. For the\nfirst two, we assume that the integers in the input are given in unary, and\nthat the control graph of the given VASS is flat (i.e., without nested cycles).\nWe obtain a family of VASS in dimension 3 whose shortest reachability\nwitnessing runs are exponential, and we show that the reachability problem is\nNP-hard in dimension 7. These results resolve negatively questions that had\nbeen posed by the works of Blondin et al. in LICS 2015 and Englert et al. in\nLICS 2016, and contribute a first construction that distinguishes 3-dimensional\nflat VASS from 2-dimensional VASS.\n  Our third result, by means of a novel family of products of integer\nfractions, shows that 4-dimensional VASS can have doubly exponentially long\nshortest reachability witnessing runs. The smallest dimension for which this\nwas previously known is 14.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2020 15:12:34 GMT"}, {"version": "v2", "created": "Thu, 16 Jan 2020 11:43:55 GMT"}, {"version": "v3", "created": "Sun, 10 May 2020 22:00:47 GMT"}], "update_date": "2020-05-12", "authors_parsed": [["Czerwiński", "Wojciech", ""], ["Lasota", "Sławomir", ""], ["Lazić", "Ranko", ""], ["Leroux", "Jérôme", ""], ["Mazowiecki", "Filip", ""]]}, {"id": "2001.04333", "submitter": "Marcin Jurdzi\\'nski", "authors": "Marcin Jurdzi\\'nski, R\\'emi Morvan", "title": "A Universal Attractor Decomposition Algorithm for Parity Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.FL cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An attractor decomposition meta-algorithm for solving parity games is given\nthat generalizes the classic McNaughton-Zielonka algorithm and its recent\nquasi-polynomial variants due to Parys (2019), and to Lehtinen, Schewe, and\nWojtczak (2019). The central concepts studied and exploited are attractor\ndecompositions of dominia in parity games and the ordered trees that describe\nthe inductive structure of attractor decompositions.\n  The main technical results include the embeddable decomposition theorem and\nthe dominion separation theorem that together help establish a precise\nstructural condition for the correctness of the universal algorithm: it\nsuffices that the two ordered trees given to the algorithm as inputs embed the\ntrees of some attractor decompositions of the largest dominia for each of the\ntwo players, respectively.\n  The universal algorithm yields McNaughton-Zielonka, Parys's, and\nLehtinen-Schewe-Wojtczak algorithms as special cases when suitable universal\ntrees are given to it as inputs. The main technical results provide a unified\nproof of correctness and deep structural insights into those algorithms.\n  A symbolic implementation of the universal algorithm is also given that\nimproves the symbolic space complexity of solving parity games in\nquasi-polynomial time from $O(d \\lg n)$---achieved by Chatterjee,\nDvo\\v{r}\\'{a}k, Henzinger, and Svozil (2018)---down to $O(\\lg d)$, where $n$ is\nthe number of vertices and $d$ is the number of distinct priorities in a parity\ngame. This not only exponentially improves the dependence on $d$, but it also\nentirely removes the dependence on $n$.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2020 15:19:05 GMT"}], "update_date": "2020-01-14", "authors_parsed": [["Jurdziński", "Marcin", ""], ["Morvan", "Rémi", ""]]}, {"id": "2001.04347", "submitter": "EPTCS", "authors": "Patricia Bouyer (LSV, CNRS and ENS Paris-Saclay, Universit\\'e\n  Paris-Saclay, France), Thomas Brihaye (UMONS - Universit\\'e de Mons,\n  Belgium), Mickael Randour (F.R.S.-FNRS and UMONS - Universit\\'e de Mons,\n  Belgium), C\\'edric Rivi\\`ere (UMONS - Universit\\'e de Mons, Belgium), Pierre\n  Vandenhove (F.R.S.-FNRS, UMONS - Universit\\'e de Mons, Belgium and LSV, CNRS\n  and ENS Paris-Saclay, Universit\\'e Paris-Saclay, France)", "title": "Decisiveness of Stochastic Systems and its Application to Hybrid Models", "comments": "In Proceedings GandALF 2020, arXiv:2009.09360", "journal-ref": "EPTCS 326, 2020, pp. 149-165", "doi": "10.4204/EPTCS.326.10", "report-no": null, "categories": "cs.LO cs.FL cs.SY eess.SY math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In [ABM07], Abdulla et al. introduced the concept of decisiveness, an\ninteresting tool for lifting good properties of finite Markov chains to\ndenumerable ones. Later, this concept was extended to more general stochastic\ntransition systems (STSs), allowing the design of various verification\nalgorithms for large classes of (infinite) STSs. We further improve the\nunderstanding and utility of decisiveness in two ways. First, we provide a\ngeneral criterion for proving decisiveness of general STSs. This criterion,\nwhich is very natural but whose proof is rather technical, (strictly)\ngeneralizes all known criteria from the literature. Second, we focus on\nstochastic hybrid systems (SHSs), a stochastic extension of hybrid systems. We\nestablish the decisiveness of a large class of SHSs and, under a few classical\nhypotheses from mathematical logic, we show how to decide reachability problems\nin this class, even though they are undecidable for general SHSs. This provides\na decidable stochastic extension of o-minimal hybrid systems. [ABM07] Parosh A.\nAbdulla, Noomene Ben Henda, and Richard Mayr. 2007. Decisive Markov Chains.\nLog. Methods Comput. Sci. 3, 4 (2007).\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2020 15:37:49 GMT"}, {"version": "v2", "created": "Wed, 23 Sep 2020 01:26:29 GMT"}], "update_date": "2020-09-24", "authors_parsed": [["Bouyer", "Patricia", "", "LSV, CNRS and ENS Paris-Saclay, Université\n  Paris-Saclay, France"], ["Brihaye", "Thomas", "", "UMONS - Université de Mons,\n  Belgium"], ["Randour", "Mickael", "", "F.R.S.-FNRS and UMONS - Université de Mons,\n  Belgium"], ["Rivière", "Cédric", "", "UMONS - Université de Mons, Belgium"], ["Vandenhove", "Pierre", "", "F.R.S.-FNRS, UMONS - Université de Mons, Belgium and LSV, CNRS\n  and ENS Paris-Saclay, Université Paris-Saclay, France"]]}, {"id": "2001.04392", "submitter": "Karoliina Lehtinen", "authors": "Karoliina Lehtinen and Martin Zimmermann", "title": "Good-for-games $\\omega$-Pushdown Automata", "comments": "Extended version of LICS'20 paper of the same name (DOI\n  10.1145/3373718.3394737); accepted for publication to LMCS", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce good-for-games $\\omega$-pushdown automata ($\\omega$-GFG-PDA).\nThese are automata whose nondeterminism can be resolved based on the input\nprocessed so far. Good-for-gameness enables automata to be composed with games,\ntrees, and other automata, applications which otherwise require deterministic\nautomata. Our main results are that $\\omega$-GFG-PDA are more expressive than\ndeterministic $\\omega$- pushdown automata and that solving infinite games with\nwinning conditions specified by $\\omega$-GFG-PDA is EXPTIME-complete. Thus, we\nhave identified a new class of $\\omega$-contextfree winning conditions for\nwhich solving games is decidable. It follows that the universality problem for\n$\\omega$-GFG-PDA is in EXPTIME as well. Moreover, we study closure properties\nof the class of languages recognized by $\\omega$-GFG- PDA and decidability of\ngood-for-gameness of $\\omega$-pushdown automata and languages. Finally, we\ncompare $\\omega$-GFG-PDA to $\\omega$-visibly PDA, study the resources necessary\nto resolve the nondeterminism in $\\omega$-GFG-PDA, and prove that the parity\nindex hierarchy for $\\omega$-GFG-PDA is infinite.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2020 16:58:20 GMT"}, {"version": "v2", "created": "Wed, 3 Jun 2020 12:28:18 GMT"}, {"version": "v3", "created": "Fri, 18 Dec 2020 14:16:44 GMT"}, {"version": "v4", "created": "Thu, 24 Jun 2021 10:16:21 GMT"}], "update_date": "2021-06-25", "authors_parsed": [["Lehtinen", "Karoliina", ""], ["Zimmermann", "Martin", ""]]}, {"id": "2001.04458", "submitter": "Rahul Savani", "authors": "John Fearnley, Rasmus Ibsen-Jensen, Rahul Savani", "title": "One-Clock Priced Timed Games are PSPACE-hard", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main result of this paper is that computing the value of a one-clock\npriced timed game (OCPTG) is PSPACE-hard. Along the way, we provide a family of\nOCPTGs that have an exponential number of event points. Both results hold even\nin very restricted classes of games such as DAGs with treewidth three. Finally,\nwe provide a number of positive results, including polynomial-time algorithms\nfor even more restricted classes of OCPTGs such as trees.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2020 18:46:42 GMT"}, {"version": "v2", "created": "Wed, 4 Mar 2020 19:05:44 GMT"}], "update_date": "2020-03-06", "authors_parsed": [["Fearnley", "John", ""], ["Ibsen-Jensen", "Rasmus", ""], ["Savani", "Rahul", ""]]}, {"id": "2001.04743", "submitter": "Dmitry Berdinsky", "authors": "Dmitry Berdinsky and Prohrak Kruengthomya", "title": "Nonstandard Cayley automatic representations of fundamental groups", "comments": "14 pages, a paper for Language and Automata Theory and Applications\n  2020 (extended version)", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GR cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct a new family of Cayley automatic representations of semidirect\nproducts $\\mathbb{Z}^n \\rtimes_A \\mathbb{Z}$ for which none of the projections\nof the normal subgroup $\\mathbb{Z}^n$ onto each of its cyclic components is\nfinite automaton recognizable. For $n=2$ we describe a family of matrices from\n$\\mathrm{GL}(2,\\mathbb{Z})$ corresponding to these representations. We are\nmotivated by a problem of characterization of all possible Cayley automatic\nrepresentations of these groups.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2020 12:37:23 GMT"}], "update_date": "2020-01-15", "authors_parsed": [["Berdinsky", "Dmitry", ""], ["Kruengthomya", "Prohrak", ""]]}, {"id": "2001.05230", "submitter": "Natasha Yogananda Jeppu", "authors": "Natasha Yogananda Jeppu, Tom Melham, Daniel Kroening and John O'Leary", "title": "Learning Concise Models from Long Execution Traces", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Abstract models of system-level behaviour have applications in design\nexploration, analysis, testing and verification. We describe a new algorithm\nfor automatically extracting useful models, as automata, from execution traces\nof a HW/SW system driven by software exercising a use-case of interest. Our\nalgorithm leverages modern program synthesis techniques to generate predicates\non automaton edges, succinctly describing system behaviour. It employs trace\nsegmentation to tackle complexity for long traces. We learn concise models\ncapturing transaction-level, system-wide behaviour--experimentally\ndemonstrating the approach using traces from a variety of sources, including\nthe x86 QEMU virtual platform and the Real-Time Linux kernel.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2020 11:00:07 GMT"}, {"version": "v2", "created": "Wed, 26 Feb 2020 11:12:14 GMT"}, {"version": "v3", "created": "Tue, 5 May 2020 13:46:14 GMT"}], "update_date": "2020-05-06", "authors_parsed": [["Jeppu", "Natasha Yogananda", ""], ["Melham", "Tom", ""], ["Kroening", "Daniel", ""], ["O'Leary", "John", ""]]}, {"id": "2001.05247", "submitter": "Tomoyuki Yamakami", "authors": "Tomoyuki Yamakami", "title": "How Does Adiabatic Quantum Computation Fit into Quantum Automata Theory?", "comments": "(A4, 10pt, pp.30) This version extends and corrects its preliminary\n  report that has appeared in the Proceedings of the 21st IFIP WG 1.02\n  International Conference on Descriptional Complexity of Formal Systems (DCFS\n  2019), Kosice, Slovakia, July 17-19, 2019, Lecture Notes in Computer Science,\n  vol. 11612, pp. 285-297, 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum computation has emerged as a powerful computational medium of our\ntime, having demonstrated the remarkable efficiency in factoring a positive\ninteger and searching databases faster than any currently known classical\ncomputing algorithm. Adiabatic evolution of quantum systems have been studied\nas a potential means that physically realizes quantum computation. Up to now,\nall the research on adiabatic quantum systems has dealt with polynomial\ntime-bounded computation and little attention has been paid to, for instance,\nadiabatic quantum systems consuming only constant memory space. Such quantum\nsystems can be modeled in a form similar to quantum finite automata. This\nexposition dares to ask a bold question of how to make adiabatic quantum\ncomputation fit into the rapidly progressing framework of quantum automata\ntheory. As our answer to this eminent but profound question, we first lay out a\nfundamental platform to carry out adiabatic evolutionary quantum systems\n(AEQSs) with limited computational resources (in size, energy, spectral gap,\netc.) and then establish how to construct such AEQSs by operating suitable\nfamilies of quantum finite automata. We further explore fundamental structural\nproperties of decision problems (as well as promise problems) solved quickly by\nthe appropriately constructed AEQSs.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2020 11:29:59 GMT"}, {"version": "v2", "created": "Wed, 16 Sep 2020 13:18:12 GMT"}, {"version": "v3", "created": "Mon, 14 Dec 2020 09:54:12 GMT"}], "update_date": "2020-12-15", "authors_parsed": [["Yamakami", "Tomoyuki", ""]]}, {"id": "2001.05583", "submitter": "Mateus de Oliveira Oliveira", "authors": "Lars Jaffke, Mateus de Oliveira Oliveira, Hans Raj Tiwary", "title": "Compressing Permutation Groups into Grammars and Polytopes. A Graph\n  Embedding Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It can be shown that each permutation group $G \\sqsubseteq S_n$ can be\nembedded, in a well defined sense, in a connected graph with $O(n+|G|)$\nvertices. Some groups, however, require much fewer vertices. For instance,\n$S_n$ itself can be embedded in the $n$-clique $K_n$, a connected graph with n\nvertices. In this work, we show that the minimum size of a context-free grammar\ngenerating a finite permutation group $G \\sqsubseteq S_n$ can be upper bounded\nby three structural parameters of connected graphs embedding $G$: the number of\nvertices, the treewidth, and the maximum degree. More precisely, we show that\nany permutation group $G \\sqsubseteq S_n$ that can be embedded into a connected\ngraph with $m$ vertices, treewidth k, and maximum degree $\\Delta$, can also be\ngenerated by a context-free grammar of size $2^{O(k\\Delta\\log\\Delta)}\\cdot\nm^{O(k)}$. By combining our upper bound with a connection between the extension\ncomplexity of a permutation group and the grammar complexity of a formal\nlanguage, we also get that these permutation groups can be represented by\npolytopes of extension complexity $2^{O(k \\Delta\\log \\Delta)}\\cdot m^{O(k)}$.\nThe above upper bounds can be used to provide trade-offs between the index of\npermutation groups, and the number of vertices, treewidth and maximum degree of\nconnected graphs embedding these groups. In particular, by combining our main\nresult with a celebrated $2^{\\Omega(n)}$ lower bound on the grammar complexity\nof the symmetric group $S_n$ we have that connected graphs of treewidth\n$o(n/\\log n)$ and maximum degree $o(n/\\log n)$ embedding subgroups of $S_n$ of\nindex $2^{cn}$ for some small constant $c$ must have $n^{\\omega(1)}$ vertices.\nThis lower bound can be improved to exponential on graphs of treewidth\n$n^{\\varepsilon}$ for $\\varepsilon<1$ and maximum degree $o(n/\\log n)$.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2020 22:31:57 GMT"}], "update_date": "2020-01-17", "authors_parsed": [["Jaffke", "Lars", ""], ["Oliveira", "Mateus de Oliveira", ""], ["Tiwary", "Hans Raj", ""]]}, {"id": "2001.05786", "submitter": "Gerco van Heerdt", "authors": "Gerco van Heerdt, Tobias Kapp\\'e, Jurriaan Rot, Matteo Sammartino,\n  Alexandra Silva", "title": "A Categorical Framework for Learning Generalised Tree Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automata learning is a popular technique used to automatically construct an\nautomaton model from queries. Much research went into devising ad hoc\nadaptations of algorithms for different types of automata. The CALF project\nseeks to unify these using category theory in order to ease correctness proofs\nand guide the design of new algorithms. In this paper, we extend CALF to cover\nlearning of algebraic structures that may not have a coalgebraic presentation.\nFurthermore, we provide a detailed algorithmic account of an abstract version\nof the popular L* algorithm, which was missing from CALF. We instantiate the\nabstract theory to a large class of Set functors, by which we recover for the\nfirst time practical tree automata learning algorithms from an abstract\nframework and at the same time obtain new algorithms to learn algebras of\nquotiented polynomial functors.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2020 13:20:43 GMT"}], "update_date": "2020-01-17", "authors_parsed": [["van Heerdt", "Gerco", ""], ["Kappé", "Tobias", ""], ["Rot", "Jurriaan", ""], ["Sammartino", "Matteo", ""], ["Silva", "Alexandra", ""]]}, {"id": "2001.06350", "submitter": "Maira Gatti de Bayser", "authors": "Maira Gatti de Bayser, Melina Alberio Guerra, Paulo Cavalin, Claudio\n  Pinhanez", "title": "A Hybrid Solution to Learn Turn-Taking in Multi-Party Service-based Chat\n  Groups", "comments": "arXiv admin note: text overlap with arXiv:1907.02090", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To predict the next most likely participant to interact in a multi-party\nconversation is a difficult problem. In a text-based chat group, the only\ninformation available is the sender, the content of the text and the dialogue\nhistory. In this paper we present our study on how these information can be\nused on the prediction task through a corpus and architecture that integrates\nturn-taking classifiers based on Maximum Likelihood Expectation (MLE),\nConvolutional Neural Networks (CNN) and Finite State Automata (FSA). The corpus\nis a synthetic adaptation of the Multi-Domain Wizard-of-Oz dataset (MultiWOZ)\nto a multiple travel service-based bots scenario with dialogue errors and was\ncreated to simulate user's interaction and evaluate the architecture. We\npresent experimental results which show that the CNN approach achieves better\nperformance than the baseline with an accuracy of 92.34%, but the integrated\nsolution with MLE, CNN and FSA achieves performance even better, with 95.65%.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2020 22:37:21 GMT"}], "update_date": "2020-01-20", "authors_parsed": [["de Bayser", "Maira Gatti", ""], ["Guerra", "Melina Alberio", ""], ["Cavalin", "Paulo", ""], ["Pinhanez", "Claudio", ""]]}, {"id": "2001.06952", "submitter": "Xiaokang Qiu", "authors": "Xiaokang Qiu", "title": "Streaming Transformations of Infinite Ordered-Data Words", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we define streaming register transducer (SRT), a one-way,\nletter-to-letter, transductional machine model for transformations of infinite\ndata words whose data domain forms a linear group. Comparing with existing data\nword transducers, SRT are able to perform two extra operations on the\nregisters: a linear-order-based comparison and an additive update. We consider\nthe transformations that can be defined by SRT and several subclasses of SRT.\nWe investigate the expressiveness of these languages and several decision\nproblems. Our main results include: 1) SRT are closed under union and\nintersection, and add-free SRT are also closed under composition; 2)\nSRT-definable transformations can be defined in monadic second-order (MSO)\nlogic, but are not comparable with first-order (FO) definable transformations;\n3) the functionality problem is decidable for add-free SRT, the reactivity\nproblem and inclusion problem are decidable for deterministic add-free SRT, but\nnone of these problems is decidable in general for SRT.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2020 02:53:35 GMT"}], "update_date": "2020-01-22", "authors_parsed": [["Qiu", "Xiaokang", ""]]}, {"id": "2001.07205", "submitter": "Zhiyu Liu", "authors": "Zhiyu Liu, Meng Jiang, Hai Lin", "title": "A graph-based spatial temporal logic for knowledge representation and\n  automated reasoning in cognitive robots", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new graph-based spatial temporal logic for knowledge\nrepresentation and automated reasoning in this paper. The proposed logic\nachieves a balance between expressiveness and tractability in applications such\nas cognitive robots. The satisfiability of the proposed logic is decidable. We\napply a Hilbert style axiomatization for the proposed graph-based spatial\ntemporal logic, in which Modus ponens and IRR are the inference rules. We show\nthat the corresponding deduction system is sound and complete and can be\nimplemented through SAT.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2020 18:44:27 GMT"}, {"version": "v2", "created": "Mon, 27 Jan 2020 19:43:21 GMT"}, {"version": "v3", "created": "Wed, 1 Apr 2020 23:08:37 GMT"}], "update_date": "2020-04-03", "authors_parsed": [["Liu", "Zhiyu", ""], ["Jiang", "Meng", ""], ["Lin", "Hai", ""]]}, {"id": "2001.07679", "submitter": "Mohamadreza Ahmadi", "authors": "Mohamadreza Ahmadi, Rangoli Sharan, and Joel W. Burdick", "title": "Stochastic Finite State Control of POMDPs with LTL Specifications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.FL cs.RO cs.SY eess.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Partially observable Markov decision processes (POMDPs) provide a modeling\nframework for autonomous decision making under uncertainty and imperfect\nsensing, e.g. robot manipulation and self-driving cars. However, optimal\ncontrol of POMDPs is notoriously intractable. This paper considers the\nquantitative problem of synthesizing sub-optimal stochastic finite state\ncontrollers (sFSCs) for POMDPs such that the probability of satisfying a set of\nhigh-level specifications in terms of linear temporal logic (LTL) formulae is\nmaximized. We begin by casting the latter problem into an optimization and use\nrelaxations based on the Poisson equation and McCormick envelopes. Then, we\npropose an stochastic bounded policy iteration algorithm, leading to a\ncontrolled growth in sFSC size and an any time algorithm, where the performance\nof the controller improves with successive iterations, but can be stopped by\nthe user based on time or memory considerations. We illustrate the proposed\nmethod by a robot navigation case study.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jan 2020 18:10:47 GMT"}], "update_date": "2020-01-22", "authors_parsed": [["Ahmadi", "Mohamadreza", ""], ["Sharan", "Rangoli", ""], ["Burdick", "Joel W.", ""]]}, {"id": "2001.08846", "submitter": "Jack H. Lutz", "authors": "Jack H. Lutz and Giora Slutzki", "title": "Nonregularity via Ordinal Extensions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a simple new method for proving that languages are not regular. We\nprove the correctness of the method, illustrate the ease of using the method on\nwell-known examples of nonregular languages, and prove two additional theorems\non the power and limitations of the method.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2020 23:24:14 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Lutz", "Jack H.", ""], ["Slutzki", "Giora", ""]]}, {"id": "2001.09029", "submitter": "Daniel Cicala", "authors": "Daniel Cicala", "title": "Rewriting Structured Cospans", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CT cs.FL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To foster the study of networks on an abstract level, we further study the\nformalism of structured cospans. We define a topos of structured cospans and\nestablish its theory of rewriting. For the rewrite relation, we propose a\ndouble categorical semantics to encode the compositionality of the structure\ncospans. For an application, we generalize the inductive viewpoint of graph\nrewriting to rewriting in a wider class of topoi.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2020 14:26:24 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Cicala", "Daniel", ""]]}, {"id": "2001.09198", "submitter": "Maximilien Gadouleau", "authors": "Florian Bridoux and Maximilien Gadouleau and Guillaume Theyssier", "title": "On simulation in automata networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An automata network is a finite graph where each node holds a state from some\nfinite alphabet and is equipped with an update function that changes its state\naccording to the configuration of neighboring states. More concisely, it is\ngiven by a finite map $f:Q^n\\rightarrow Q^n$. In this paper we study how some\n(sets of) automata networks can be simulated by some other (set of) automata\nnetworks with prescribed update mode or interaction graph. Our contributions\nare the following. For non-Boolean alphabets and for any network size, there\nare intrinsically non-sequential transformations (i.e. that can not be obtained\nas composition of sequential updates of some network). Moreover there is no\nuniversal automaton network that can produce all non-bijective functions via\ncompositions of asynchronous updates. On the other hand, we show that there are\nuniversal automata networks for sequential updates if one is allowed to use a\nlarger alphabet and then use either projection onto or restriction to the\noriginal alphabet. We also characterize the set of functions that are generated\nby non-bijective sequential updates. Following Tchuente, we characterize the\ninteraction graphs $D$ whose semigroup of transformations is the full semigroup\nof transformations on $Q^n$, and we show that they are the same if we force\neither sequential updates only, or all asynchronous updates.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2020 21:21:24 GMT"}, {"version": "v2", "created": "Mon, 27 Apr 2020 11:25:35 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Bridoux", "Florian", ""], ["Gadouleau", "Maximilien", ""], ["Theyssier", "Guillaume", ""]]}, {"id": "2001.09591", "submitter": "Murray Elder", "authors": "Laura Ciobanu and Murray Elder", "title": "The complexity of solution sets to equations in hyperbolic groups", "comments": "33 pages, 3 figures, 1 table. Minor edits made. An extended abstract\n  of a preliminary version of this paper was presented at the conference ICALP\n  2019 arXiv:1902.07349", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GR cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the full set of solutions to systems of equations and\ninequations in a hyperbolic group, as shortlex geodesic words (or any regular\nset of quasigeodesic normal forms), is an EDT0L language whose specification\ncan be computed in NSPACE$(n^2\\log n)$ for the torsion-free case and\nNSPACE$(n^4\\log n)$ in the torsion case. Furthermore, in the presence of\nquasi-isometrically embeddable rational constraints, we show that the full set\nof solutions to systems of equations in a hyperbolic group remains EDT0L. Our\nwork combines the geometric results of Rips, Sela, Dahmani and Guirardel on the\ndecidability of the existential theory of hyperbolic groups with the work of\ncomputer scientists including Plandowski, Je\\.z, Diekert and others on PSPACE\nalgorithms to solve equations in free monoids and groups using compression, and\ninvolves an intricate language-theoretic analysis.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jan 2020 05:49:32 GMT"}, {"version": "v2", "created": "Thu, 30 Jan 2020 04:05:41 GMT"}, {"version": "v3", "created": "Mon, 3 Feb 2020 16:04:40 GMT"}, {"version": "v4", "created": "Sun, 25 Oct 2020 03:36:50 GMT"}], "update_date": "2020-10-27", "authors_parsed": [["Ciobanu", "Laura", ""], ["Elder", "Murray", ""]]}, {"id": "2001.09864", "submitter": "Gosta Grahne", "authors": "Gosta Grahne and Alex Thomo", "title": "Provenance for Regular Path Queries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regular path queries (RPQs) the ubiquitous mechanism for querying data graphs\nof partially known structure. RPQs are in essence regular expressions over the\nedge symbols. The answer to an RPQ on a given graph (database) is the set of\npairs of objects, which are connected by paths spelling words in the language\nof the regular path query. Often the database edges come with a weights\nassoaciated to them. Such weights can distances, levels of discomfort,\nmultiplicities, etc. We model weights using semiring frameworks.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jan 2020 15:37:31 GMT"}, {"version": "v2", "created": "Fri, 31 Jan 2020 22:36:47 GMT"}], "update_date": "2020-02-04", "authors_parsed": [["Grahne", "Gosta", ""], ["Thomo", "Alex", ""]]}, {"id": "2001.10799", "submitter": "Rustam Tagiew", "authors": "Rustam Tagiew", "title": "Business Negotiation Definition Language", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.FL cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The target of this paper is to present an industry-ready prototype software\nfor general game playing. This software can also be used as the central element\nfor experimental economics research, interfacing of game-theoretic libraries,\nAI-driven software testing, algorithmic trade, human behavior mining and\nsimulation of (strategic) interactions. The software is based on a\ndomain-specific language for electronic business to business negotiations --\nSIDL3.0. The paper also contains many examples to prove the power of this\nlanguage.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jan 2020 11:07:00 GMT"}], "update_date": "2020-01-30", "authors_parsed": [["Tagiew", "Rustam", ""]]}, {"id": "2001.11218", "submitter": "Marie Lejeune", "authors": "Pamela Fleischmann, Marie Lejeune, Florin Manea, Dirk Nowotka, Michel\n  Rigo", "title": "Reconstructing Words from Right-Bounded-Block Words", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A reconstruction problem of words from scattered factors asks for the minimal\ninformation, like multisets of scattered factors of a given length or the\nnumber of occurrences of scattered factors from a given set, necessary to\nuniquely determine a word. We show that a word $w \\in \\{a, b\\}^{*}$ can be\nreconstructed from the number of occurrences of at most $\\min(|w|_a, |w|_b)+ 1$\nscattered factors of the form $a^{i} b$. Moreover, we generalize the result to\nalphabets of the form $\\{1,\\ldots,q\\}$ by showing that at most $\n\\sum^{q-1}_{i=1} |w|_i (q-i+1)$ scattered factors suffices to reconstruct $w$.\nBoth results improve on the upper bounds known so far. Complexity time bounds\non reconstruction algorithms are also considered here.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2020 09:08:41 GMT"}, {"version": "v2", "created": "Mon, 16 Mar 2020 09:53:32 GMT"}], "update_date": "2020-03-17", "authors_parsed": [["Fleischmann", "Pamela", ""], ["Lejeune", "Marie", ""], ["Manea", "Florin", ""], ["Nowotka", "Dirk", ""], ["Rigo", "Michel", ""]]}, {"id": "2001.11576", "submitter": "Micha{\\l} Skrzypczak", "authors": "Marcin Przyby{\\l}ko, Micha{\\l} Skrzypczak", "title": "The Uniform Measure of Simple Regular Sets of Infinite Trees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of computing the measure of a regular set of infinite\nbinary trees. While the general case remains unsolved, we show that the measure\nof a language can be computed when the set is given in one of the following\nthree formalisms: a first-order formula with no descendant relation; a Boolean\ncombination of conjunctive queries (with descendant relation); or by a\nnon-deterministic safety tree automaton. Additionally, in the first two cases\nthe measure of the set is always rational, while in the third it is an\nalgebraic number. Moreover, we provide an example of a first-order formula that\nuses descendant relation and defines a language of infinite trees having an\nirrational (but algebraic) measure.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2020 21:36:44 GMT"}], "update_date": "2020-02-03", "authors_parsed": [["Przybyłko", "Marcin", ""], ["Skrzypczak", "Michał", ""]]}, {"id": "2001.11732", "submitter": "Marie Lejeune", "authors": "Marie Lejeune, Michel Rigo, Matthieu Rosenfeld", "title": "On the binomial equivalence classes of finite words", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two finite words $u$ and $v$ are $k$-binomially equivalent if, for each word\n$x$ of length at most $k$, $x$ appears the same number of times as a\nsubsequence (i.e., as a scattered subword) of both $u$ and $v$. This notion\ngeneralizes abelian equivalence. In this paper, we study the equivalence\nclasses induced by the $k$-binomial equivalence with a special focus on the\ncardinalities of the classes. We provide an algorithm generating the\n$2$-binomial equivalence class of a word. For $k \\geq 2$ and alphabet of $3$ or\nmore symbols, the language made of lexicographically least elements of every\n$k$-binomial equivalence class and the language of singletons, i.e., the words\nwhose $k$-binomial equivalence class is restricted to a single element, are\nshown to be non context-free. As a consequence of our discussions, we also\nprove that the submonoid generated by the generators of the free nil-$2$ group\non $m$ generators is isomorphic to the quotient of the free monoid $\\{ 1,\n\\ldots , m\\}^{*}$ by the $2$-binomial equivalence.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2020 09:27:41 GMT"}], "update_date": "2020-02-03", "authors_parsed": [["Lejeune", "Marie", ""], ["Rigo", "Michel", ""], ["Rosenfeld", "Matthieu", ""]]}, {"id": "2001.11763", "submitter": "Lucas Mol", "authors": "Lucas Mol and Narad Rampersad", "title": "Lengths of extremal square-free ternary words", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A square-free word $w$ over a fixed alphabet $\\Sigma$ is extremal if every\nword obtained from $w$ by inserting a single letter from $\\Sigma$ (at any\nposition) contains a square. Grytczuk et al. recently introduced the concept of\nextremal square-free word, and demonstrated that there are arbitrarily long\nextremal square-free ternary words. We find all lengths which admit an extremal\nsquare-free ternary word. In particular, we show that there is an extremal\nsquare-free ternary word of every sufficiently large length. We also solve the\nanalogous problem for circular words.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2020 10:51:37 GMT"}], "update_date": "2020-02-03", "authors_parsed": [["Mol", "Lucas", ""], ["Rampersad", "Narad", ""]]}]