[{"id": "0809.0158", "submitter": "Jian Ni", "authors": "Jian Ni, Sekhar Tatikonda", "title": "Network Tomography Based on Additive Metrics", "comments": "35 pages", "journal-ref": "IEEE Transactions on Information Theory, 57(12), December 2011", "doi": "10.1109/TIT.2011.2168901", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inference of the network structure (e.g., routing topology) and dynamics\n(e.g., link performance) is an essential component in many network design and\nmanagement tasks. In this paper we propose a new, general framework for\nanalyzing and designing routing topology and link performance inference\nalgorithms using ideas and tools from phylogenetic inference in evolutionary\nbiology. The framework is applicable to a variety of measurement techniques.\nBased on the framework we introduce and develop several polynomial-time\ndistance-based inference algorithms with provable performance. We provide\nsufficient conditions for the correctness of the algorithms. We show that the\nalgorithms are consistent (return correct topology and link performance with an\nincreasing sample size) and robust (can tolerate a certain level of measurement\nerrors). In addition, we establish certain optimality properties of the\nalgorithms (i.e., they achieve the optimal $l_\\infty$-radius) and demonstrate\ntheir effectiveness via model simulation.\n", "versions": [{"version": "v1", "created": "Sun, 31 Aug 2008 22:27:20 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Ni", "Jian", ""], ["Tatikonda", "Sekhar", ""]]}, {"id": "0809.0417", "submitter": "Nirmal Thyagu N", "authors": "Satyam Mukherjee, Neelima Gupte", "title": "Queue-length synchronization in a communication networks", "comments": "13 Pages, 15 figures", "journal-ref": "Phys. Rev. E Vol. 79, 056105 (2009)", "doi": "10.1103/PhysRevE.79.056105", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study synchronization in the context of network traffic on a $2-d$\ncommunication network with local clustering and geographic separations. The\nnetwork consists of nodes and randomly distributed hubs where the top five hubs\nranked according to their coefficient of betweenness centrality (CBC) are\nconnected by random assortative and gradient mechanisms. For multiple message\ntraffic, messages can trap at the high CBC hubs, and congestion can build up on\nthe network with long queues at the congested hubs. The queue lengths are seen\nto synchronize in the congested phase. Both complete and phase synchronization\nis seen, between pairs of hubs. In the decongested phase, the pairs start\nclearing, and synchronization is lost. A cascading master-slave relation is\nseen between the hubs, with the slower hubs (which are slow to decongest)\ndriving the faster ones. These are usually the hubs of high CBC. Similar\nresults are seen for traffic of constant density. Total synchronization between\nthe hubs of high CBC is also seen in the congested regime. Similar behavior is\nseen for traffic on a network constructed using the Waxman random topology\ngenerator. We also demonstrate the existence of phase synchronization in real\nInternet traffic data.\n", "versions": [{"version": "v1", "created": "Tue, 2 Sep 2008 12:10:37 GMT"}, {"version": "v2", "created": "Sat, 22 Nov 2008 12:41:46 GMT"}, {"version": "v3", "created": "Wed, 20 May 2009 10:37:49 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Mukherjee", "Satyam", ""], ["Gupte", "Neelima", ""]]}, {"id": "0809.0533", "submitter": "Wei Ren", "authors": "Wei Ren, Qing Zhao, Ananthram Swami", "title": "Power Control in Cognitive Radio Networks: How to Cross a Multi-Lane\n  Highway", "comments": "20 pages, 10 figures, to appear in IEEE Journal on Selected Areas in\n  Communications (JSAC): Special Issue on Stochastic Geometry and Random Graphs\n  for Wireless Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider power control in cognitive radio networks where secondary users\nidentify and exploit instantaneous and local spectrum opportunities without\ncausing unacceptable interference to primary users. We qualitatively\ncharacterize the impact of the transmission power of secondary users on the\noccurrence of spectrum opportunities and the reliability of opportunity\ndetection. Based on a Poisson model of the primary network, we quantify these\nimpacts by showing that (i) the probability of spectrum opportunity decreases\nexponentially with respect to the transmission power of secondary users, where\nthe exponential decay constant is given by the traffic load of primary users;\n(ii) reliable opportunity detection is achieved in the two extreme regimes in\nterms of the ratio between the transmission power of secondary users and that\nof primary users. Such analytical characterizations allow us to study power\ncontrol for optimal transport throughput under constraints on the interference\nto primary users. Furthermore, we reveal the difference between detecting\nprimary signals and detecting spectrum opportunities, and demonstrate the\ncomplex relationship between physical layer spectrum sensing and MAC layer\nthroughput. The dependency of this PHY-MAC interaction on the application type\nand the use of handshake signaling such as RTS/CTS is illustrated.\n", "versions": [{"version": "v1", "created": "Wed, 3 Sep 2008 07:40:19 GMT"}, {"version": "v2", "created": "Tue, 17 Mar 2009 00:32:11 GMT"}], "update_date": "2009-03-17", "authors_parsed": [["Ren", "Wei", ""], ["Zhao", "Qing", ""], ["Swami", "Ananthram", ""]]}, {"id": "0809.0686", "submitter": "Animashree Anandkumar", "authors": "Animashree Anandkumar, Joseph E. Yukich, Lang Tong, and Ananthram\n  Swami", "title": "Energy Scaling Laws for Distributed Inference in Random Fusion Networks", "comments": "IEEE JSAC on Stochastic Geometry and Random Graphs for Wireless\n  Networks", "journal-ref": "vol. 27, no. 7, pp.1203-1217, Sept. 2009", "doi": "10.1109/JSAC.2009.090916", "report-no": null, "categories": "cs.IT cs.NI math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The energy scaling laws of multihop data fusion networks for distributed\ninference are considered. The fusion network consists of randomly located\nsensors distributed i.i.d. according to a general spatial distribution in an\nexpanding region. Among the class of data fusion schemes that enable optimal\ninference at the fusion center for Markov random field (MRF) hypotheses, the\nscheme with minimum average energy consumption is bounded below by average\nenergy of fusion along the minimum spanning tree, and above by a suboptimal\nscheme, referred to as Data Fusion for Markov Random Fields (DFMRF). Scaling\nlaws are derived for the optimal and suboptimal fusion policies. It is shown\nthat the average asymptotic energy of the DFMRF scheme is finite for a class of\nMRF models.\n", "versions": [{"version": "v1", "created": "Wed, 3 Sep 2008 18:06:05 GMT"}, {"version": "v2", "created": "Sun, 1 Feb 2009 21:18:34 GMT"}, {"version": "v3", "created": "Tue, 8 Jun 2010 23:01:46 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Anandkumar", "Animashree", ""], ["Yukich", "Joseph E.", ""], ["Tong", "Lang", ""], ["Swami", "Ananthram", ""]]}, {"id": "0809.0833", "submitter": "Fabien Mathieu", "authors": "Fabien Mathieu (INRIA Rocquencourt, FT R&D, INRIA Rocquencourt),\n  Gheorghe Postelnicu, Julien Reynier (INRIA Rocquencourt)", "title": "The stable configuration in acyclic preference-based systems", "comments": null, "journal-ref": null, "doi": null, "report-no": "RR-6628", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Acyclic preferences recently appeared as an elegant way to model many\ndistributed systems. An acyclic instance admits a unique stable configuration,\nwhich can reveal the performance of the system. In this paper, we give the\nstatistical properties of the stable configuration for three classes of acyclic\npreferences: node-based preferences, distance-based preferences, and random\nacyclic systems. Using random overlay graphs, we prove using mean-field and\nfluid-limit techniques that these systems have an asymptotically continuous\nindependent rank distribution for a proper scaling, and the analytical solution\nis compared to simulations. These results provide a theoretical ground for\nvalidating the performance of bandwidth-based or proximity-based unstructured\nsystems.\n", "versions": [{"version": "v1", "created": "Thu, 4 Sep 2008 15:12:00 GMT"}], "update_date": "2008-09-05", "authors_parsed": [["Mathieu", "Fabien", "", "INRIA Rocquencourt, FT R&D, INRIA Rocquencourt"], ["Postelnicu", "Gheorghe", "", "INRIA Rocquencourt"], ["Reynier", "Julien", "", "INRIA Rocquencourt"]]}, {"id": "0809.1061", "submitter": "Massimiliano Laddomada Ph.D.", "authors": "M. Laddomada, F. Mesiti, M. Mondin, and F. Daneshgaran", "title": "A Novel Proportional Fairness Criterion for Throughput Allocation in\n  Multirate IEEE 802.11", "comments": "Submitted to IEEE Transaction on Wireless Communications, September\n  2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper focuses on multirate IEEE 802.11 Wireless LAN employing the\nmandatory Distributed Coordination Function (DCF) option. Its aim is threefold.\nUpon starting from the multi-dimensional Markovian state transition model\nproposed by Malone \\textit{et.al.} for characterizing the behavior of the IEEE\n802.11 protocol at the Medium Access Control layer, it presents an extension\naccounting for packet transmission failures due to channel errors. Second, it\nestablishes the conditions under which a network constituted by $N$ stations,\neach station transmitting with its own bit rate, $R^{(s)}_d$, and packet rate,\n$\\lambda_s$, can be assumed loaded. Finally, it proposes a modified\nProportional Fairness (PF) criterion, suitable for mitigating the \\textit{rate\nanomaly} problem of multirate loaded IEEE 802.11 Wireless LANs, employing the\nmandatory DCF option. Compared to the widely adopted assumption of saturated\nnetwork, the proposed fairness criterion can be applied to general loaded\nnetworks.\n  The throughput allocation resulting from the proposed algorithm is able to\ngreatly increase the aggregate throughput of the DCF, while ensuring fairness\nlevels among the stations of the same order as the ones guaranteed by the\nclassical PF criterion.\n  Simulation results are presented for some sample scenarios, confirming the\neffectiveness of the proposed criterion for optimized throughput allocation.\n", "versions": [{"version": "v1", "created": "Fri, 5 Sep 2008 15:43:14 GMT"}], "update_date": "2008-09-08", "authors_parsed": [["Laddomada", "M.", ""], ["Mesiti", "F.", ""], ["Mondin", "M.", ""], ["Daneshgaran", "F.", ""]]}, {"id": "0809.1258", "submitter": "Salah A. Aly", "authors": "Salah A. Aly, Ahmed E. Kamal", "title": "Network Protection Codes Against Link Failures Using Network Coding", "comments": null, "journal-ref": "Proc. of IEEE Globecom 08, New Orleans, LA, 2008", "doi": "10.1109/GLOCOM.2008.ECP.516", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protecting against link failures in communication networks is essential to\nincrease robustness, accessibility, and reliability of data transmission.\nRecently, network coding has been proposed as a solution to provide agile and\ncost efficient network protection against link failures, which does not require\ndata rerouting, or packet retransmission. To achieve this, separate paths have\nto be provisioned to carry encoded packets, hence requiring either the addition\nof extra links, or reserving some of the resources for this purpose. In this\npaper, we propose network protection codes against a single link failure using\nnetwork coding, where a separate path using reserved links is not needed. In\nthis case portions of the link capacities are used to carry the encoded\npackets.\n  The scheme is extended to protect against multiple link failures and can be\nimplemented at an overlay layer. Although this leads to reducing the network\ncapacity, the network capacity reduction is asymptotically small in most cases\nof practical interest. We demonstrate that such network protection codes are\nequivalent to error correcting codes for erasure channels. Finally, we study\nthe encoding and decoding operations of such codes over the binary field.\n", "versions": [{"version": "v1", "created": "Sun, 7 Sep 2008 23:03:22 GMT"}, {"version": "v2", "created": "Sun, 21 Dec 2008 20:40:01 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Aly", "Salah A.", ""], ["Kamal", "Ahmed E.", ""]]}, {"id": "0809.1366", "submitter": "Lu\\'isa Lima", "authors": "Lu\\'isa Lima, Jo\\~ao P. Vilela, Paulo F. Oliveira and Jo\\~ao Barros", "title": "Network Coding Security: Attacks and Countermeasures", "comments": "8 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By allowing intermediate nodes to perform non-trivial operations on packets,\nsuch as mixing data from multiple streams, network coding breaks with the\nruling store and forward networking paradigm and opens a myriad of challenging\nsecurity questions. Following a brief overview of emerging network coding\nprotocols, we provide a taxonomy of their security vulnerabilities, which\nhighlights the differences between attack scenarios in which network coding is\nparticularly vulnerable and other relevant cases in which the intrinsic\nproperties of network coding allow for stronger and more efficient security\nsolutions than classical routing. Furthermore, we give practical examples where\nnetwork coding can be combined with classical cryptography both for secure\ncommunication and secret key distribution. Throughout the paper we identify a\nnumber of research challenges deemed relevant towards the applicability of\nsecure network coding in practical networks.\n", "versions": [{"version": "v1", "created": "Mon, 8 Sep 2008 15:34:03 GMT"}], "update_date": "2008-09-09", "authors_parsed": [["Lima", "Luísa", ""], ["Vilela", "João P.", ""], ["Oliveira", "Paulo F.", ""], ["Barros", "João", ""]]}, {"id": "0809.1681", "submitter": "Rafael Laufer", "authors": "Rafael Laufer and Leonard Kleinrock", "title": "Multirate Anypath Routing in Wireless Mesh Networks", "comments": "13 pages, 8 figures", "journal-ref": "IEEE INFOCOM 2009", "doi": "10.1109/INFCOM.2009.5061904", "report-no": "UCLA-CSD-TR080025", "categories": "cs.NI cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a new routing paradigm that generalizes\nopportunistic routing in wireless mesh networks. In multirate anypath routing,\neach node uses both a set of next hops and a selected transmission rate to\nreach a destination. Using this rate, a packet is broadcast to the nodes in the\nset and one of them forwards the packet on to the destination. To date, there\nis no theory capable of jointly optimizing both the set of next hops and the\ntransmission rate used by each node. We bridge this gap by introducing a\npolynomial-time algorithm to this problem and provide the proof of its\noptimality. The proposed algorithm runs in the same running time as regular\nshortest-path algorithms and is therefore suitable for deployment in link-state\nrouting protocols. We conducted experiments in a 802.11b testbed network, and\nour results show that multirate anypath routing performs on average 80% and up\nto 6.4 times better than anypath routing with a fixed rate of 11 Mbps. If the\nrate is fixed at 1 Mbps instead, performance improves by up to one order of\nmagnitude.\n", "versions": [{"version": "v1", "created": "Tue, 9 Sep 2008 21:49:04 GMT"}], "update_date": "2010-11-01", "authors_parsed": [["Laufer", "Rafael", ""], ["Kleinrock", "Leonard", ""]]}, {"id": "0809.2322", "submitter": "Veerayya Mallapur", "authors": "Mallapur Veerayya", "title": "An Energy-Aware On-Demand Routing Protocol for Ad-Hoc Wireless Networks", "comments": "65 pages, Master's Thesis, Department of Elecrical Engineering, IIT\n  Bombay", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An ad-hoc wireless network is a collection of nodes that come together to\ndynamically create a network, with no fixed infrastructure or centralized\nadministration. An ad-hoc network is characterized by energy constrained nodes,\nbandwidth constrained links and dynamic topology. With the growing use of\nwireless networks (including ad-hoc networks) for real-time applications, such\nas voice, video, and real-time data, the need for Quality of Service (QoS)\nguarantees in terms of delay, bandwidth, and packet loss is becoming\nincreasingly important. Providing QoS in ad-hoc networks is a challenging task\nbecause of dynamic nature of network topology and imprecise state information.\nHence, it is important to have a dynamic routing protocol with fast re-routing\ncapability, which also provides stable route during the life-time of the flows.\n  In this thesis, we have proposed a novel, energy aware, stable routing\nprotocol named, Stability-based QoS-capable Ad-hoc On-demand Distance Vector\n(SQ-AODV), which is an enhancement of the well-known Ad-hoc On-demand Distance\nVector (AODV) routing protocol for ad-hoc wireless networks. SQ-AODV utilizes a\ncross-layer design approach in which information about the residual energy of a\nnode is used for route selection and maintenance. An important feature of\nSQ-AODV protocol is that it uses only local information and requires no\nadditional communication or co-operation between the network nodes. SQ-AODV\npossesses a make-before-break re-routing capability that enables near-zero\npacket drops and is compatible with the basic AODV data formats and operation,\nmaking it easy to adopt in ad-hoc networks.\n", "versions": [{"version": "v1", "created": "Sat, 13 Sep 2008 08:56:25 GMT"}], "update_date": "2008-09-16", "authors_parsed": [["Veerayya", "Mallapur", ""]]}, {"id": "0809.2730", "submitter": "Julinda Stefa", "authors": "Alessandro Mei (1) and Julinda Stefa (1) ((1) Department of Computer\n  Science, Sapienza University of Rome, Italy)", "title": "SWIM: A Simple Model to Generate Small Mobile Worlds", "comments": "Accepted for publication in IEEE INFOCOM 09, Rio de Janeiro, Brazil,\n  April 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents small world in motion (SWIM), a new mobility model for\nad-hoc networking. SWIM is relatively simple, is easily tuned by setting just a\nfew parameters, and generates traces that look real--synthetic traces have the\nsame statistical properties of real traces. SWIM shows experimentally and\ntheoretically the presence of the power law and exponential decay dichotomy of\ninter-contact time, and, most importantly, our experiments show that it can\npredict very accurately the performance of forwarding protocols.\n", "versions": [{"version": "v1", "created": "Tue, 16 Sep 2008 15:07:58 GMT"}, {"version": "v2", "created": "Thu, 22 Jan 2009 20:26:21 GMT"}], "update_date": "2009-01-22", "authors_parsed": [["Mei", "Alessandro", ""], ["Stefa", "Julinda", ""]]}, {"id": "0809.2995", "submitter": "Marian Boguna", "authors": "Marian Boguna and Dmitri Krioukov", "title": "Navigating ultrasmall worlds in ultrashort time", "comments": "4 pages, 2 figures", "journal-ref": "Phys. Rev. Lett. 102, 058701 (2009)", "doi": "10.1103/PhysRevLett.102.058701", "report-no": null, "categories": "cond-mat.dis-nn cs.NI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Random scale-free networks are ultrasmall worlds. The average length of the\nshortest paths in networks of size N scales as lnlnN. Here we show that these\nultrasmall worlds can be navigated in ultrashort time. Greedy routing on\nscale-free networks embedded in metric spaces finds paths with the average\nlength scaling also as lnlnN. Greedy routing uses only local information to\nnavigate a network. Nevertheless, it finds asymptotically the shortest paths, a\ndirect computation of which requires global topology knowledge. Our findings\nimply that the peculiar structure of complex networks ensures that the lack of\nglobal topological awareness has asymptotically no impact on the length of\ncommunication paths. These results have important consequences for\ncommunication systems such as the Internet, where maintaining knowledge of\ncurrent topology is a major scalability bottleneck.\n", "versions": [{"version": "v1", "created": "Wed, 17 Sep 2008 20:01:04 GMT"}, {"version": "v2", "created": "Sun, 8 Feb 2009 06:56:05 GMT"}], "update_date": "2009-02-08", "authors_parsed": [["Boguna", "Marian", ""], ["Krioukov", "Dmitri", ""]]}, {"id": "0809.3276", "submitter": "Zheng Sun", "authors": "Zheng Sun, Wenjun Xu, Zhiqiang He, Kai Niu", "title": "Criteria on Utility Designing of Convex Optimization in FDMA Networks", "comments": "published in workshop of ICC '08", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate the network utility maximization problem in\nFDMA systems. We summarize with a suite of criteria on designing utility\nfunctions so as to achieve the global optimization convex. After proposing the\ngeneral form of the utility functions, we present examples of commonly used\nutility function forms that are consistent with the criteria proposed in this\npaper, which include the well-known proportional fairness function and the\nsigmoidal-like functions. In the second part of this paper, we use numerical\nresults to demonstrate a case study based on the criteria mentioned above,\nwhich deals with the subcarrier scheduling problem with dynamic rate allocation\nin FDMA system.\n", "versions": [{"version": "v1", "created": "Fri, 19 Sep 2008 01:08:47 GMT"}, {"version": "v2", "created": "Mon, 22 Sep 2008 08:42:03 GMT"}], "update_date": "2008-09-22", "authors_parsed": [["Sun", "Zheng", ""], ["Xu", "Wenjun", ""], ["He", "Zhiqiang", ""], ["Niu", "Kai", ""]]}, {"id": "0809.3279", "submitter": "Zheng Sun", "authors": "Zheng Sun", "title": "Distributed Spiral Optimization in Wireless Sensor Networks without\n  Fusion Centers", "comments": "submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A distributed spiral algorithm for distributed optimization in WSN is\nproposed. By forming a spiral-shape message passing scheme among clusters,\nwithout loss of estimation accuracy and convergence speed, the algorithm is\nproved to converge with a lower total transport cost than the distributed\nin-cluster algorithm.\n", "versions": [{"version": "v1", "created": "Fri, 19 Sep 2008 01:18:16 GMT"}], "update_date": "2008-09-22", "authors_parsed": [["Sun", "Zheng", ""]]}, {"id": "0809.3280", "submitter": "Zheng Sun", "authors": "Zheng Sun, Zhiqiang He, Ruochen Wang, Kai Niu", "title": "A Heuristic Scheduling Scheme in Multiuser OFDMA Networks", "comments": "published in VTC Fall '08", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Conventional heterogeneous-traffic scheduling schemes utilize zero-delay\nconstraint for real-time services, which aims to minimize the average packet\ndelay among real-time users. However, in light or moderate load networks this\nstrategy is unnecessary and leads to low data throughput for non-real-time\nusers. In this paper, we propose a heuristic scheduling scheme to solve this\nproblem. The scheme measures and assigns scheduling priorities to both\nreal-time and non-real-time users, and schedules the radio resources for the\ntwo user classes simultaneously. Simulation results show that the proposed\nscheme efficiently handles the heterogeneous-traffic scheduling with diverse\nQoS requirements and alleviates the unfairness between real-time and\nnon-real-time services under various traffic loads.\n", "versions": [{"version": "v1", "created": "Fri, 19 Sep 2008 01:25:16 GMT"}], "update_date": "2008-09-22", "authors_parsed": [["Sun", "Zheng", ""], ["He", "Zhiqiang", ""], ["Wang", "Ruochen", ""], ["Niu", "Kai", ""]]}, {"id": "0809.3283", "submitter": "Zheng Sun", "authors": "Zheng Sun, Wenjun Xu, Zhiqiang He, Kai Niu", "title": "Performance Comparison of Cooperative and Distributed Spectrum Sensing\n  in Cognitive Radio", "comments": "submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we compare the performances of cooperative and distributed\nspectrum sensing in wireless sensor networks. After introducing the basic\nproblem, we describe two strategies: 1) a cooperative sensing strategy, which\ntakes advantage of cooperation diversity gain to increase probability of\ndetection and 2) a distributed sensing strategy, which by passing the results\nin an inter-node manner increases energy efficiency and fairness among nodes.\nThen, we compare the performances of the strategies in terms of three criteria:\nagility, energy efficiency, and robustness against SNR changes, and summarize\nthe comparison. It shows that: 1) the non-cooperative strategy has the best\nfairness of energy consumption, 2) the cooperative strategy leads to the best\nagility, and 3) the distributed strategy leads to the lowest energy consumption\nand the best robustness against SNR changes.\n", "versions": [{"version": "v1", "created": "Fri, 19 Sep 2008 01:31:55 GMT"}, {"version": "v2", "created": "Mon, 22 Sep 2008 08:39:21 GMT"}], "update_date": "2008-09-22", "authors_parsed": [["Sun", "Zheng", ""], ["Xu", "Wenjun", ""], ["He", "Zhiqiang", ""], ["Niu", "Kai", ""]]}, {"id": "0809.3285", "submitter": "Zheng Sun", "authors": "Zheng Sun, Xiaohong Huang, and Yan Ma", "title": "Load Balancing Strategies to Solve Flowshop Scheduling on Parallel\n  Computing", "comments": "submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper first presents a parallel solution for the Flowshop Scheduling\nProblem in parallel environment, and then proposes a novel load balancing\nstrategy. The proposed Proportional Fairness Strategy (PFS) takes computational\nperformance of computing process sets into account, and assigns additional load\nto computing nodes proportionally to their evaluated performance. In order to\nefficiently utilize the power of parallel resource, we also discuss the data\nstructure used in communications among computational nodes and design an\noptimized data transfer strategy. This data transfer strategy combined with the\nproposed load balancing strategy have been implemented and tested on a super\ncomputer consisted of 86 CPUs using MPI as the middleware. The results show\nthat the proposed PFS achieves better performance in terms of computing time\nthan the existing Adaptive Contracting Within Neighborhood Strategy. We also\nshow that the combination of both the Proportional Fairness Strategy and the\nproposed data transferring strategy achieves additional 13~15% improvement in\nefficiency of parallelism.\n", "versions": [{"version": "v1", "created": "Fri, 19 Sep 2008 01:35:39 GMT"}], "update_date": "2008-09-22", "authors_parsed": [["Sun", "Zheng", ""], ["Huang", "Xiaohong", ""], ["Ma", "Yan", ""]]}, {"id": "0809.3415", "submitter": "Cl\\'emence Magnien", "authors": "Frederic Aidouni, Matthieu Latapy and Clemence Magnien", "title": "Ten weeks in the life of an eDonkey server", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a capture of the queries managed by an eDonkey server\nduring almost 10 weeks, leading to the observation of almost 9 billion messages\ninvolving almost 90 million users and more than 275 million distinct files.\nAcquisition and management of such data raises several challenges, which we\ndiscuss as well as the solutions we developed. We obtain a very rich dataset,\norders of magnitude larger than previously avalaible ones, which we provide for\npublic use. We finally present basic analysis of the obtained data, which\nalready gives evidence of non-trivial features.\n", "versions": [{"version": "v1", "created": "Fri, 19 Sep 2008 16:45:26 GMT"}], "update_date": "2008-09-22", "authors_parsed": [["Aidouni", "Frederic", ""], ["Latapy", "Matthieu", ""], ["Magnien", "Clemence", ""]]}, {"id": "0809.3542", "submitter": "Ivan Voras", "authors": "Ivan Voras, Danko Basch, Mario Zagar", "title": "A High Performance Memory Database for Web Application Caches", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the architecture and characteristics of a memory database\nintended to be used as a cache engine for web applications. Primary goals of\nthis database are speed and efficiency while running on SMP systems with\nseveral CPU cores (four and more). A secondary goal is the support for simple\nmetadata structures associated with cached data that can aid in efficient use\nof the cache. Due to these goals, some data structures and algorithms normally\nassociated with this field of computing needed to be adapted to the new\nenvironment.\n", "versions": [{"version": "v1", "created": "Sun, 21 Sep 2008 01:05:46 GMT"}], "update_date": "2008-09-23", "authors_parsed": [["Voras", "Ivan", ""], ["Basch", "Danko", ""], ["Zagar", "Mario", ""]]}, {"id": "0809.3908", "submitter": "Vinay Joseph", "authors": "Vinod Sharma, Utpal Mukherji, Vinay Joseph, Shrey Gupta", "title": "Optimal Energy Management Policies for Energy Harvesting Sensor Nodes", "comments": "Submitted to the IEEE Transactions on Wireless Communications; 22\n  pages with 10 figures", "journal-ref": null, "doi": "10.1109/TWC.2010.04.080749", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a sensor node with an energy harvesting source. The generated energy\ncan be stored in a buffer. The sensor node periodically senses a random field\nand generates a packet. These packets are stored in a queue and transmitted\nusing the energy available at that time. We obtain energy management policies\nthat are throughput optimal, i.e., the data queue stays stable for the largest\npossible data rate. Next we obtain energy management policies which minimize\nthe mean delay in the queue.We also compare performance of several easily\nimplementable sub-optimal energy management policies. A greedy policy is\nidentified which, in low SNR regime, is throughput optimal and also minimizes\nmean delay.\n", "versions": [{"version": "v1", "created": "Tue, 23 Sep 2008 13:05:22 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Sharma", "Vinod", ""], ["Mukherji", "Utpal", ""], ["Joseph", "Vinay", ""], ["Gupta", "Shrey", ""]]}, {"id": "0809.4194", "submitter": "Benedek Kov\\'acs", "authors": "Benedek Kovacs", "title": "Rate based call gapping with priorities and fairness between traffic\n  classes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a new rate based call gapping method. The main advantage\nis that it provides maximal throughput, priority handling and fairness for\ntraffic classes without queues, unlike Token Bucket which provides only the\nfirst two or Weighted Fair Queuing that uses queues. The Token Bucket is used\nfor call gapping because it has good throughput characteristics. For this\nreason we present a mixture of the two methods keeping the good properties of\nboth. A mathematical model has been developed to support our proposal. It\ndefines the three requirements and proves theorems about if they are satisfied\nwith the different call gapping mechanisms. Simulation, numerical results and\nstatistical discussion are also presented to underpin the findings.\n", "versions": [{"version": "v1", "created": "Wed, 24 Sep 2008 14:09:54 GMT"}, {"version": "v2", "created": "Mon, 8 Dec 2008 09:02:04 GMT"}], "update_date": "2008-12-08", "authors_parsed": [["Kovacs", "Benedek", ""]]}, {"id": "0809.4342", "submitter": "Caihong Kai", "authors": "Caihong Kai, Soung Chang Liew", "title": "Towards a More Accurate Carrier Sensing Model for CSMA Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work calls into question a substantial body of past work on CSMA\nwireless networks. In the majority of studies on CSMA wireless networks, a\ncontention graph is used to model the carrier sensing relationships (CS) among\nlinks. This is a 0-1 model in which two links can either sense each other\ncompletely or not. In real experiments, we observed that this is generally not\nthe case: the CS relationship between the links are often probabilistic and can\nvary dynamically over time. This is the case even if the distance between the\nlinks is fixed and there is no drastic change in the environment. Furthermore,\nthis partial carrier sensing relationship is prevalent and occurs over a wide\nrange of distances between the links. This observation is not consistent with\nthe 0-1 contention graph and implies that many results and conclusions drawn\nfrom previous theoretical studies need to be re-examined. This paper\nestablishes a more accurate CS model with the objective of laying down a\nfoundation for future theoretical studies that reflect reality. Towards that\nend, we set up detailed experiments to investigate the partial carrier sensing\nphenomenon. We discuss the implications and the use of our partial carrier\nsensing model in network analysis.\n", "versions": [{"version": "v1", "created": "Thu, 25 Sep 2008 08:55:26 GMT"}], "update_date": "2008-09-26", "authors_parsed": [["Kai", "Caihong", ""], ["Liew", "Soung Chang", ""]]}, {"id": "0809.4395", "submitter": "Rudi Ball", "authors": "Rudi Ball", "title": "Content Sharing for Mobile Devices", "comments": "98 page, Masters Dissertation, 64 figures, September 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The miniaturisation of computing devices has seen computing devices become\nincreasingly pervasive in society. With this increased pervasiveness, the\ntechnologies of small computing devices have also improved. Mobile devices are\nnow capable of capturing various forms of multimedia and able to communicate\nwirelessly using increasing numbers of communication techniques. The owners and\ncreators of local content are motivated to share this content in ever\nincreasing volume; the conclusion has been that social networks sites are\nseeing a revolution in the sharing of information between communities of\npeople. As load on centralised systems increases, we present a novel\ndecentralised peer-to-peer approach dubbed the Market Contact Protocol (MCP) to\nachieve cost effective, scalable and efficient content sharing using\nopportunistic networking (pocket switched networking), incentive,\ncontext-awareness, social contact and mobile devices. Within the report we\ndescribe how the MCP is simulated with a superimposed geographic framework on\ntop of the JiST (Java in Simulation Time) framework to evaluate and measure its\ncapability to share content between massively mobile peers. The MCP is shown in\nconclusion to be a powerful means by which to share content in a massively\nmobile ad-hoc environment.\n", "versions": [{"version": "v1", "created": "Thu, 25 Sep 2008 12:58:40 GMT"}], "update_date": "2008-09-26", "authors_parsed": [["Ball", "Rudi", ""]]}, {"id": "0809.4576", "submitter": "Emmanuel Lochin", "authors": "Jerome Lacan and Emmanuel Lochin", "title": "On-the-Fly Coding to Enable Full Reliability Without Retransmission", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a new reliability algorithm specifically useful when\nretransmission is either problematic or not possible. In case of multimedia or\nmulticast communications and in the context of the Delay Tolerant Networking\n(DTN), the classical retransmission schemes can be counterproductive in terms\nof data transfer performance or not possible when the acknowledgment path is\nnot always available. Indeed, over long delay links, packets retransmission has\na meaning of cost and must be minimized.In this paper, we detail a novel\nreliability mechanism with an implicit acknowledgment strategy that could be\nused either within these new DTN proposals, for multimedia traffic or in the\ncontext of multicast transport protocols. This proposal is based on a new\non-the-fly erasure coding concept specifically designed to operate efficient\nreliable transfer over bi-directional links. This proposal, named Tetrys,\nallows to unify a full reliability with an error correction scheme. In this\npaper, we model the performance of this proposal and demonstrate with a\nprototype, that we can achieve a full reliability without acknowledgment path\nconfirmation. Indeed, the main findings are that Tetrys is not sensitive to the\nloss of acknowledgments while ensuring a faster data availability to the\napplication compared to other traditional acknowledgment schemes. Finally, we\npave the first step of the integration of such algorithm inside a congestion\ncontrolled protocol.\n", "versions": [{"version": "v1", "created": "Fri, 26 Sep 2008 09:41:26 GMT"}], "update_date": "2008-09-29", "authors_parsed": [["Lacan", "Jerome", ""], ["Lochin", "Emmanuel", ""]]}, {"id": "0809.4924", "submitter": "Feng Xia", "authors": "Feng Xia, Longhua Ma, Chen Peng, Youxian Sun, Jinxiang Dong", "title": "Cross-Layer Adaptive Feedback Scheduling of Wireless Control Systems", "comments": "17 pages, 12 figures; Open Access at\n  http://www.mdpi.org/sensors/papers/s8074265.pdf", "journal-ref": "Sensors, 8(7): 4265-4281, 2008", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is a trend towards using wireless technologies in networked control\nsystems. However, the adverse properties of the radio channels make it\ndifficult to design and implement control systems in wireless environments. To\nattack the uncertainty in available communication resources in wireless control\nsystems closed over WLAN, a cross-layer adaptive feedback scheduling (CLAFS)\nscheme is developed, which takes advantage of the co-design of control and\nwireless communications. By exploiting cross-layer design, CLAFS adjusts the\nsampling periods of control systems at the application layer based on\ninformation about deadline miss ratio and transmission rate from the physical\nlayer. Within the framework of feedback scheduling, the control performance is\nmaximized through controlling the deadline miss ratio. Key design parameters of\nthe feedback scheduler are adapted to dynamic changes in the channel condition.\nAn event-driven invocation mechanism for the feedback scheduler is also\ndeveloped. Simulation results show that the proposed approach is efficient in\ndealing with channel capacity variations and noise interference, thus providing\nan enabling technology for control over WLAN.\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2008 10:18:06 GMT"}], "update_date": "2008-09-30", "authors_parsed": [["Xia", "Feng", ""], ["Ma", "Longhua", ""], ["Peng", "Chen", ""], ["Sun", "Youxian", ""], ["Dong", "Jinxiang", ""]]}, {"id": "0809.4985", "submitter": "Youssef, Joseph Nasser", "authors": "Youssef Nasser (IETR), Jean-Fran\\c{c}ois H\\'elard (IETR), Matthieu\n  Crussi\\`ere (IETR)", "title": "On the Influence of Carrier Frequency Offset and Sampling Frequency\n  Offset in MIMO-OFDM Systems for Future Digital TV", "comments": null, "journal-ref": "International Symposium on Wireless and Pervasive Computing,\n  Gr\\`ece (2008)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the impact of carrier frequency offset (CFO) and\nsampling frequency offset (SFO) on the performance of different MIMO-OFDM\nschemes with high spectral efficiency for next generation of terrestrial\ndigital TV. We analyze particularly orthogonal Alamouti scheme, and\nnon-orthogonal (NO) schemes like VBLAST, linear dispersion (LD) code and Golden\ncode. This analysis gives a global view on the best suitable MIMO-OFDM scheme\nwith respect to CFO and SFO. We show that for high spectral efficiency,\nAlamouti is more sensitive to CFO and SFO. Moreover, we show that all studied\nMIMO-OFDM schemes are sensitive to CFO when it is greater than 1% of\ninter-carrier spacing. Their sensitivity due to SFO is less than that due to\nCFO.\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2008 15:17:31 GMT"}], "update_date": "2008-09-30", "authors_parsed": [["Nasser", "Youssef", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"]]}, {"id": "0809.4986", "submitter": "Youssef, Joseph Nasser", "authors": "Youssef Nasser (IETR), Jean-Fran\\c{c}ois H\\'elard (IETR), Matthieu\n  Crussi\\`ere (IETR), Oudomsack Pasquero (IETR)", "title": "Efficient MIMO-OFDM Schemes for Future Terrestrial Digital TV with\n  Unequal Received Powers", "comments": null, "journal-ref": "IEEE International Conference on Communications, Chine (2008)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article investigates the effect of equal and unequal received powers on\nthe performances of different MIMO-OFDM schemes for terrestrial digital TV.\nMore precisely, we focus on three types of non-orthogonal schemes: the BLAST\nscheme, the Linear Dispersion (LD) code and the Golden code, and we compare\ntheir performances to that of Alamouti scheme. Using two receiving antennas, we\nshow that for moderate attenuation on the second antenna and high spectral\nefficiency, Golden code outperforms other schemes. However, Alamouti scheme\npresents the best performance for low spectral efficiency and equal received\npowers or when one antenna is dramatically damaged. When three antennas are\nused, we show that Golden code offers the highest robustness to power unbalance\nat the receiving side\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2008 15:17:52 GMT"}], "update_date": "2008-09-30", "authors_parsed": [["Nasser", "Youssef", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"], ["Pasquero", "Oudomsack", "", "IETR"]]}, {"id": "0809.4987", "submitter": "Youssef, Joseph Nasser", "authors": "Youssef Nasser (IETR), Jean-Fran\\c{c}ois H\\'elard (IETR), Matthieu\n  Crussi\\`ere (IETR), Oudomsack Pasquero (IETR)", "title": "Efficient 3D Space Time Space Block Code for Future Terrestrial Digital\n  TV", "comments": null, "journal-ref": "Symposium on Signal Processing Advances in Wireless\n  Communications, Recife : Br\\'esil (2008)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article introduces a 3D space-time-space block code for future\nterrestrial digital TV in single frequency networks. The proposed 3D code is\nbased on a double layer structure designed for inter-cell and intra-cell space\ntime coded transmissions. We show that this new structure is particularly\nefficient for SFN environments regardless of the location of the receiver. It\nis then suitable for fixed, portable and mobile receptions.\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2008 15:18:09 GMT"}], "update_date": "2008-09-30", "authors_parsed": [["Nasser", "Youssef", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"], ["Pasquero", "Oudomsack", "", "IETR"]]}, {"id": "0809.4989", "submitter": "Youssef, Joseph Nasser", "authors": "Youssef Nasser (IETR), Jean-Fran\\c{c}ois H\\'elard (IETR), Matthieu\n  Crussi\\`ere (IETR)", "title": "Bit Error Rate Prediction of Coded MIMO-OFDM Systems", "comments": null, "journal-ref": "IEEE Symposium on Signal Processing Advances in Wireless\n  Communications, Recife : Br\\'esil (2008)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bit error rate (BER) prediction over channel realisations has emerged as an\nactive research area. In this paper, we give analytical signal to interference\nand noise ratio (SINR) evaluation of MIMO-OFDM systems using an iterative\nreceiver. Using this analytical SINR expression, we propose an accurate BER\nprediction method based on effective exponential SINR mapping (EESM) method. We\nshow by simulations that our method is independent of the channel realisation\nand of the MIMO scheme. It is only dependent on the modulation and coding\nscheme.\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2008 15:18:37 GMT"}], "update_date": "2008-09-30", "authors_parsed": [["Nasser", "Youssef", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"]]}, {"id": "0809.5016", "submitter": "Youssef, Joseph Nasser", "authors": "Youssef Nasser (IETR), Jean-Fran\\c{c}ois H\\'elard (IETR), Matthieu\n  Crussi\\`ere (IETR)", "title": "Robustness of MIMO-OFDM Schemes for Future Digital TV to Carrier\n  Frequency Offset", "comments": null, "journal-ref": "IEEE Broadband Multimedia Symposium, \\'Etats-Unis d'Am\\'erique\n  (2008)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the impact of carrier frequency offset (CFO) on the\nperformance of different MIMO-OFDM schemes with high spectral efficiency for\nnext generation of terrestrial digital TV. We show that all studied MIMO-OFDM\nschemes are sensitive to CFO when it is greater than 1% of inter-carrier\nspacing. We show also that the Alamouti scheme is the most sensitive MIMO\nscheme to CFO\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2008 16:58:35 GMT"}], "update_date": "2008-09-30", "authors_parsed": [["Nasser", "Youssef", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"]]}, {"id": "0809.5022", "submitter": "Jay Kumar Sundararajan", "authors": "Jay Kumar Sundararajan, Devavrat Shah, Muriel Medard, Michael\n  Mitzenmacher, Joao Barros", "title": "Network coding meets TCP", "comments": "9 pages, 9 figures, submitted to IEEE INFOCOM 2009", "journal-ref": null, "doi": "10.1109/INFCOM.2009.5061931", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a mechanism that incorporates network coding into TCP with only\nminor changes to the protocol stack, thereby allowing incremental deployment.\nIn our scheme, the source transmits random linear combinations of packets\ncurrently in the congestion window. At the heart of our scheme is a new\ninterpretation of ACKs - the sink acknowledges every degree of freedom (i.e., a\nlinear combination that reveals one unit of new information) even if it does\nnot reveal an original packet immediately. Such ACKs enable a TCP-like\nsliding-window approach to network coding. Our scheme has the nice property\nthat packet losses are essentially masked from the congestion control\nalgorithm. Our algorithm therefore reacts to packet drops in a smooth manner,\nresulting in a novel and effective approach for congestion control over\nnetworks involving lossy links such as wireless links. Our experiments show\nthat our algorithm achieves higher throughput compared to TCP in the presence\nof lossy wireless links. We also establish the soundness and fairness\nproperties of our algorithm.\n", "versions": [{"version": "v1", "created": "Mon, 29 Sep 2008 19:51:21 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Sundararajan", "Jay Kumar", ""], ["Shah", "Devavrat", ""], ["Medard", "Muriel", ""], ["Mitzenmacher", "Michael", ""], ["Barros", "Joao", ""]]}, {"id": "0809.5145", "submitter": "Youssef, Joseph Nasser", "authors": "Youssef Nasser (IETR), Jean-Fran\\c{c}ois H\\'elard (IETR), Matthieu\n  Crussi\\`ere (IETR)", "title": "3D MIMO Scheme for Broadcasting Future Digital TV in Single Frequency\n  Networks", "comments": null, "journal-ref": "Electronics Letters / IEE Electronics Letters 44, 13 (2008)\n  829-830", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This letter introduces a 3D space-time-space block code for future digital TV\nsystems. The code is based on a double layer structure for inter-cell and\nintra-cell transmission mode in single frequency networks. Without increasing\nthe complexity of the receiver, the proposed code is very efficient for\ndifferent transmission scenarios.\n", "versions": [{"version": "v1", "created": "Tue, 30 Sep 2008 09:23:19 GMT"}], "update_date": "2010-12-13", "authors_parsed": [["Nasser", "Youssef", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"]]}, {"id": "0809.5188", "submitter": "Ming Liu", "authors": "Ming Liu (IETR), Matthieu Crussi\\`ere (IETR), Jean-Fran\\c{c}ois\n  H\\'elard (IETR), Oudomsack Pasquero (IETR)", "title": "Analysis and Performance Comparison of DVB-T and DTMB Systems for\n  Terrestrial Digital TV", "comments": null, "journal-ref": "IEEE International Conference on Communications Systems (ICCS\n  2008), Guangzhou : Chine (2008)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Orthogonal frequency-division multiplexing (OFDM) is the most popular\ntransmission technology in digital terrestrial broadcasting (DTTB), adopted by\nmany DTTB standards. In this paper, the bit error rate (BER) performance of two\nDTTB systems, namely cyclic prefix OFDM (CP-OFDM) based DVB-T and time domain\nsynchronous OFDM (TDS-OFDM) based DTMB, is evaluated in different channel\nconditions. Spectrum utilization and power efficiency are also discussed to\ndemonstrate the transmission overhead of both systems. Simulation results show\nthat the performances of the two systems are much close. Given the same ratio\nof guard interval (GI), the DVB-T outperforms DTMB in terms of signal to noise\nratio (SNR) in Gaussian and Ricean channels, while DTMB behaves better\nperformance in Rayleigh channel in higher code rates and higher orders of\nconstellation thanks to its efficient channel coding and interleaving scheme.\n", "versions": [{"version": "v1", "created": "Tue, 30 Sep 2008 12:57:12 GMT"}], "update_date": "2008-10-01", "authors_parsed": [["Liu", "Ming", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"], ["Pasquero", "Oudomsack", "", "IETR"]]}, {"id": "0809.5189", "submitter": "Oudomsack Pierre Pasquero", "authors": "Oudomsack Pierre Pasquero (IETR), Matthieu Crussi\\`ere (IETR), Youssef\n  Nasser (IETR), Jean-Fran\\c{c}ois H\\'elard (IETR)", "title": "A novel channel estimation based on spread pilots for terrestrial\n  digital video broadcasting", "comments": null, "journal-ref": "Broadband Multimedia Systems and Broadcasting, Las Vegas :\n  \\'Etats-Unis d'Am\\'erique (2008)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a novel channel estimation technique based on\nspread pilots for digital video broadcasting. This technique consists in adding\na linear preceding function before the OFDM modulation and dedicating one of\nthe preceding sequence to transmit the pilot symbols for the channel\nestimation. The merits of this technique are its simplicity, its flexibility,\nand the gains in terms of spectral efficiency and useful bit rate obtained\ncompared to the classical pilot based estimation schemes used in DVB standards.\nThe performance evaluated over realistic channel models, shows the efficiency\nof this technique which turns out to be a promising channel estimation\ntechnique for the future terrestrial video broadcasting systems.\n", "versions": [{"version": "v1", "created": "Tue, 30 Sep 2008 12:57:53 GMT"}], "update_date": "2008-10-01", "authors_parsed": [["Pasquero", "Oudomsack Pierre", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"], ["Nasser", "Youssef", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"]]}, {"id": "0809.5192", "submitter": "Oudomsack Pierre Pasquero", "authors": "Oudomsack Pierre Pasquero (IETR), Matthieu Crussi\\`ere (IETR), Youssef\n  Nasser (IETR), Jean-Fran\\c{c}ois H\\'elard (IETR)", "title": "2D Linear Precoded OFDM for future mobile Digital Video Broadcasting", "comments": null, "journal-ref": "Signal Processing Advances in Wireless Communications, Recife :\n  Br\\'esil (2008)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a novel channel estimation technique based on 2D\nspread pilots. The merits of this technique are its simplicity, its flexibility\nregarding the transmission scenarios, and the spectral efficiency gain obtained\ncompared to the classical pilot based estimation schemes used in DVB standards.\nWe derive the analytical expression of the mean square error of the estimator\nand show it is a function of the autocorrelation of the channel in both time\nand frequency domains. The performance evaluated over a realistic channel model\nshows the efficiency of this technique which turns out to be a promising\nchannel estimation for the future mobile video broadcasting systems.\n", "versions": [{"version": "v1", "created": "Tue, 30 Sep 2008 13:01:46 GMT"}], "update_date": "2008-10-01", "authors_parsed": [["Pasquero", "Oudomsack Pierre", "", "IETR"], ["Crussière", "Matthieu", "", "IETR"], ["Nasser", "Youssef", "", "IETR"], ["Hélard", "Jean-François", "", "IETR"]]}]