[{"id": "0712.0554", "submitter": "Mathieu Couture", "authors": "Prosenjit Bose, Paz Carmi, Mathieu Couture, Anil Maheshwari, Pat\n  Morin, Michiel Smid", "title": "Spanners of Complete $k$-Partite Geometric Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": null, "abstract": "  We address the following problem: Given a complete $k$-partite geometric\ngraph $K$ whose vertex set is a set of $n$ points in $\\mathbb{R}^d$, compute a\nspanner of $K$ that has a ``small'' stretch factor and ``few'' edges. We\npresent two algorithms for this problem. The first algorithm computes a\n$(5+\\epsilon)$-spanner of $K$ with O(n) edges in $O(n \\log n)$ time. The second\nalgorithm computes a $(3+\\epsilon)$-spanner of $K$ with $O(n \\log n)$ edges in\n$O(n \\log n)$ time. The latter result is optimal: We show that for any $2 \\leq\nk \\leq n - \\Theta(\\sqrt{n \\log n})$, spanners with $O(n \\log n)$ edges and\nstretch factor less than 3 do not exist for all complete $k$-partite geometric\ngraphs.\n", "versions": [{"version": "v1", "created": "Tue, 4 Dec 2007 16:14:07 GMT"}], "update_date": "2007-12-05", "authors_parsed": [["Bose", "Prosenjit", ""], ["Carmi", "Paz", ""], ["Couture", "Mathieu", ""], ["Maheshwari", "Anil", ""], ["Morin", "Pat", ""], ["Smid", "Michiel", ""]]}, {"id": "0712.1959", "submitter": "Tamal Dey", "authors": "Siu-Wing Cheng and Tamal K. Dey", "title": "Delaunay Edge Flips in Dense Surface Triangulations", "comments": "This paper is prelude to \"Maintaining Deforming Surface Meshes\" by\n  Cheng-Dey in SODA 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": null, "abstract": "  Delaunay flip is an elegant, simple tool to convert a triangulation of a\npoint set to its Delaunay triangulation. The technique has been researched\nextensively for full dimensional triangulations of point sets. However, an\nimportant case of triangulations which are not full dimensional is surface\ntriangulations in three dimensions. In this paper we address the question of\nconverting a surface triangulation to a subcomplex of the Delaunay\ntriangulation with edge flips. We show that the surface triangulations which\nclosely approximate a smooth surface with uniform density can be transformed to\na Delaunay triangulation with a simple edge flip algorithm. The condition on\nuniformity becomes less stringent with increasing density of the triangulation.\nIf the condition is dropped completely, the flip algorithm still terminates\nalthough the output surface triangulation becomes \"almost Delaunay\" instead of\nexactly Delaunay.\n", "versions": [{"version": "v1", "created": "Wed, 12 Dec 2007 15:45:53 GMT"}], "update_date": "2007-12-13", "authors_parsed": [["Cheng", "Siu-Wing", ""], ["Dey", "Tamal K.", ""]]}, {"id": "0712.2094", "submitter": "Zachary Abel", "authors": "Timothy G. Abbott, Zachary Abel, David Charlton, Erik D. Demaine,\n  Martin L. Demaine, Scott D. Kominers", "title": "Hinged Dissections Exist", "comments": "22 pages, 14 figures", "journal-ref": "Proceedings of the Twenty-fourth Annual Symposium on Computational\n  Geometry (2008): 110-119.", "doi": "10.1145/1377676.1377695", "report-no": null, "categories": "cs.CG", "license": null, "abstract": "  We prove that any finite collection of polygons of equal area has a common\nhinged dissection. That is, for any such collection of polygons there exists a\nchain of polygons hinged at vertices that can be folded in the plane\ncontinuously without self-intersection to form any polygon in the collection.\nThis result settles the open problem about the existence of hinged dissections\nbetween pairs of polygons that goes back implicitly to 1864 and has been\nstudied extensively in the past ten years. Our result generalizes and indeed\nbuilds upon the result from 1814 that polygons have common dissections (without\nhinges). We also extend our common dissection result to edge-hinged dissections\nof solid 3D polyhedra that have a common (unhinged) dissection, as determined\nby Dehn's 1900 solution to Hilbert's Third Problem. Our proofs are\nconstructive, giving explicit algorithms in all cases. For a constant number of\nplanar polygons, both the number of pieces and running time required by our\nconstruction are pseudopolynomial. This bound is the best possible, even for\nunhinged dissections. Hinged dissections have possible applications to\nreconfigurable robotics, programmable matter, and nanomanufacturing.\n", "versions": [{"version": "v1", "created": "Thu, 13 Dec 2007 04:43:10 GMT"}], "update_date": "2008-06-12", "authors_parsed": [["Abbott", "Timothy G.", ""], ["Abel", "Zachary", ""], ["Charlton", "David", ""], ["Demaine", "Erik D.", ""], ["Demaine", "Martin L.", ""], ["Kominers", "Scott D.", ""]]}, {"id": "0712.2638", "submitter": "Steve Oudot", "authors": "Fr\\'ed\\'eric Chazal (INRIA Sophia Antipolis), Steve Oudot (INRIA\n  Sophia Antipolis)", "title": "Towards Persistence-Based Reconstruction in Euclidean Spaces", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG math.AT", "license": null, "abstract": "  Manifold reconstruction has been extensively studied for the last decade or\nso, especially in two and three dimensions. Recently, significant improvements\nwere made in higher dimensions, leading to new methods to reconstruct large\nclasses of compact subsets of Euclidean space $\\R^d$. However, the complexities\nof these methods scale up exponentially with d, which makes them impractical in\nmedium or high dimensions, even for handling low-dimensional submanifolds. In\nthis paper, we introduce a novel approach that stands in-between classical\nreconstruction and topological estimation, and whose complexity scales up with\nthe intrinsic dimension of the data. Specifically, when the data points are\nsufficiently densely sampled from a smooth $m$-submanifold of $\\R^d$, our\nmethod retrieves the homology of the submanifold in time at most $c(m)n^5$,\nwhere $n$ is the size of the input and $c(m)$ is a constant depending solely on\n$m$. It can also provably well handle a wide range of compact subsets of\n$\\R^d$, though with worse complexities. Along the way to proving the\ncorrectness of our algorithm, we obtain new results on \\v{C}ech, Rips, and\nwitness complex filtrations in Euclidean spaces.\n", "versions": [{"version": "v1", "created": "Mon, 17 Dec 2007 06:30:08 GMT"}, {"version": "v2", "created": "Tue, 18 Dec 2007 10:26:34 GMT"}], "update_date": "2007-12-18", "authors_parsed": [["Chazal", "Frédéric", "", "INRIA Sophia Antipolis"], ["Oudot", "Steve", "", "INRIA\n  Sophia Antipolis"]]}, {"id": "0712.3331", "submitter": "Kunal Talwar", "authors": "Anupam Gupta and Kunal Talwar", "title": "How to Complete a Doubling Metric", "comments": "An extended abstract will appear in proceedings of LATIN 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CG", "license": null, "abstract": "  In recent years, considerable advances have been made in the study of\nproperties of metric spaces in terms of their doubling dimension. This line of\nresearch has not only enhanced our understanding of finite metrics, but has\nalso resulted in many algorithmic applications. However, we still do not\nunderstand the interaction between various graph-theoretic (topological)\nproperties of graphs, and the doubling (geometric) properties of the\nshortest-path metrics induced by them. For instance, the following natural\nquestion suggests itself: \\emph{given a finite doubling metric $(V,d)$, is\nthere always an \\underline{unweighted} graph $(V',E')$ with $V\\subseteq V'$\nsuch that the shortest path metric $d'$ on $V'$ is still doubling, and which\nagrees with $d$ on $V$.} This is often useful, given that unweighted graphs are\noften easier to reason about.\n  We show that for any metric space $(V,d)$, there is an \\emph{unweighted}\ngraph $(V',E')$ with shortest-path metric $d':V'\\times V' \\to \\R_{\\geq 0}$ such\nthat\n  -- for all $x,y \\in V$, the distances $d(x,y) \\leq d'(x,y) \\leq (1+\\eps)\n\\cdot d(x,y)$, and\n  -- the doubling dimension for $d'$ is not much more than that of $d$, where\nthis change depends only on $\\e$ and not on the size of the graph.\n  We show a similar result when both $(V,d)$ and $(V',E')$ are restricted to be\ntrees: this gives a simpler proof that doubling trees embed into constant\ndimensional Euclidean space with constant distortion. We also show that our\nresults are tight in terms of the tradeoff between distortion and dimension\nblowup.\n", "versions": [{"version": "v1", "created": "Thu, 20 Dec 2007 06:12:15 GMT"}, {"version": "v2", "created": "Thu, 27 Dec 2007 12:32:23 GMT"}], "update_date": "2007-12-27", "authors_parsed": [["Gupta", "Anupam", ""], ["Talwar", "Kunal", ""]]}]