[{"id": "2003.03269", "submitter": "Felix Last", "authors": "Felix Last, Max Haeberlein, Ulf Schlichtmann", "title": "Predicting Memory Compiler Performance Outputs using Feed-Forward Neural\n  Networks", "comments": "23 pages, 8 figures, 4 tables; accepted for publication in the ACM\n  TODAES special issue on machine learning for CAD (ML-CAD)", "journal-ref": "ACM Trans. Des. Autom. Electron. Syst. 25, 5 (2020) 39", "doi": "10.1145/3385262", "report-no": null, "categories": "cs.OH cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Typical semiconductor chips include thousands of mostly small memories. As\nmemories contribute an estimated 25% to 40% to the overall power, performance,\nand area (PPA) of a chip, memories must be designed carefully to meet the\nsystem's requirements. Memory arrays are highly uniform and can be described by\napproximately 10 parameters depending mostly on the complexity of the\nperiphery. Thus, to improve PPA utilization, memories are typically generated\nby memory compilers. A key task in the design flow of a chip is to find optimal\nmemory compiler parametrizations which on the one hand fulfill system\nrequirements while on the other hand optimize PPA. Although most compiler\nvendors also provide optimizers for this task, these are often slow or\ninaccurate. To enable efficient optimization in spite of long compiler run\ntimes, we propose training fully connected feed-forward neural networks to\npredict PPA outputs given a memory compiler parametrization. Using an\nexhaustive search-based optimizer framework which obtains neural network\npredictions, PPA-optimal parametrizations are found within seconds after chip\ndesigners have specified their requirements. Average model prediction errors of\nless than 3%, a decision reliability of over 99% and productive usage of the\noptimizer for successful, large volume chip design projects illustrate the\neffectiveness of the approach.\n", "versions": [{"version": "v1", "created": "Thu, 5 Mar 2020 13:11:47 GMT"}], "update_date": "2020-07-13", "authors_parsed": [["Last", "Felix", ""], ["Haeberlein", "Max", ""], ["Schlichtmann", "Ulf", ""]]}, {"id": "2003.04204", "submitter": "Hongbo Zou", "authors": "Hongbo Zou, Hsuanwei Michelle Chen and Sharmistha Dey", "title": "Engaging Users through Social Media in Public Libraries", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.HC cs.LG cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The participatory library is an emerging concept which refers to the idea\nthat an integrated library system must allow users to take part in core\nfunctions of the library rather than engaging on the periphery. To embrace the\nparticipatory idea, libraries have employed many technologies, such as social\nmedia to help them build participatory services and engage users. To help\nlibrarians understand the impact of emerging technologies on a participatory\nservice building, this paper takes social media as an example to explore how to\nuse different engagement strategies that social media provides to engage more\nusers. This paper provides three major contributions to the library system. The\nlibraries can use the resultant engagement strategies to engage its users.\nAdditionally, the best-fit strategy can be inferred and designed based on the\npreferences of users. Lastly, the preferences of users can be understood based\non data analysis of social media. Three such contributions put together to\nfully address the proposed research question of how to use different engagement\nstrategies on social media to build participatory library services and better\nengage more users visiting the library?\n", "versions": [{"version": "v1", "created": "Tue, 25 Feb 2020 00:08:33 GMT"}, {"version": "v2", "created": "Fri, 30 Oct 2020 20:34:21 GMT"}], "update_date": "2020-11-03", "authors_parsed": [["Zou", "Hongbo", ""], ["Chen", "Hsuanwei Michelle", ""], ["Dey", "Sharmistha", ""]]}, {"id": "2003.07719", "submitter": "Tao Gu", "authors": "Liang Wang, Tao Gu, Xianping Tao, Jian Lu", "title": "Toward a Wearable RFID System for Real-Time Activity Recognition Using\n  Radio Patterns", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Elderly care is one of the many applications supported by real-time activity\nrecognition systems. Traditional approaches use cameras, body sensor networks,\nor radio patterns from various sources for activity recognition. However, these\napproaches are limited due to ease-of-use, coverage, or privacy preserving\nissues. In this paper, we present a novel wearable Radio Frequency\nIdentification (RFID) system aims at providing an easy-to-use solution with\nhigh detection coverage. Our system uses passive tags which are\nmaintenance-free and can be embedded into the clothes to reduce the wearing and\nmaintenance efforts. A small RFID reader is also worn on the user's body to\nextend the detection coverage as the user moves. We exploit RFID radio patterns\nand extract both spatial and temporal features to characterize various\nactivities. We also address the issues of false negative of tag readings and\ntag/antenna calibration, and design a fast online recognition system. Antenna\nand tag selection is done automatically to explore the minimum number of\ndevices required to achieve target accuracy. We develop a prototype system\nwhich consists of a wearable RFID system and a smartphone to demonstrate the\nworking principles, and conduct experimental studies with four subjects over\ntwo weeks. The results show that our system achieves a high recognition\naccuracy of 93.6 percent with a latency of 5 seconds. Additionally, we show\nthat the system only requires two antennas and four tagged body parts to\nachieve a high recognition accuracy of 85 percent.\n", "versions": [{"version": "v1", "created": "Sun, 8 Mar 2020 08:08:05 GMT"}], "update_date": "2020-03-18", "authors_parsed": [["Wang", "Liang", ""], ["Gu", "Tao", ""], ["Tao", "Xianping", ""], ["Lu", "Jian", ""]]}, {"id": "2003.07773", "submitter": "Johannes Vrana", "authors": "Johannes Vrana, Ripudaman Singh", "title": "NDE 4.0 From Design Thinking to Strategy", "comments": null, "journal-ref": "J Nondestruct Eval 40, 8 (2021)", "doi": "10.1007/s10921-020-00735-9", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyber technologies are offering new horizons for quality control in\nmanufacturing and safety assurance in-service of physical assets. The line\nbetween non-destructive evaluation (NDE) and Industry 4.0 is getting blurred\nsince both are sensory data-driven domains. This multidisciplinary approach has\nled to the emergence of a new capability: NDE 4.0. The NDT community is coming\ntogether once again to define the purpose, chart the process, and address the\nadoption of emerging technologies. In this paper, the authors have taken a\ndesign thinking approach to spotlight proper objectives for research on this\nsubject. It begins with qualitative research on twenty different perceptions of\nstakeholders and misconceptions around the current state of NDE. The\ninterpretation is used to define ten value propositions or use cases under \"NDE\nfor Industry 4.0\" and \"Industry 4.0 for NDE\" leading up to the clarity of\npurpose for NDE 4.0, enhanced safety and economic value for stakeholders. To\npursue this worthy cause, the paper delves into some of the top adoption\nchallenges, and proposes a journey of managed innovation, conscious skills\ndevelopment, and a new form of leadership required to succeed in the\ncyber-physical world.\n", "versions": [{"version": "v1", "created": "Thu, 5 Mar 2020 12:54:19 GMT"}, {"version": "v2", "created": "Tue, 17 Nov 2020 13:50:51 GMT"}], "update_date": "2021-01-05", "authors_parsed": [["Vrana", "Johannes", ""], ["Singh", "Ripudaman", ""]]}, {"id": "2003.08207", "submitter": "Miriam Enzi", "authors": "Miriam Enzi, Sophie N. Parragh, David Pisinger", "title": "Modeling and solving a vehicle-sharing problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the change in mobility patterns, we present a new modeling\napproach for the vehicle-sharing problem. We aim at assigning vehicles to\nuser-trips so as to maximize savings compared to other modes of transport. We\nbase our formulations on the minimum-cost and the multi-commodity flow problem.\nThese formulations make the problem applicable in daily operations. In the\nanalysis we discuss an optimal composition of a shared fleet, restricted sets\nof modes of transport, and variations of the objective function.\n", "versions": [{"version": "v1", "created": "Tue, 17 Mar 2020 11:12:20 GMT"}], "update_date": "2020-03-20", "authors_parsed": [["Enzi", "Miriam", ""], ["Parragh", "Sophie N.", ""], ["Pisinger", "David", ""]]}, {"id": "2003.09370", "submitter": "Arvind Easwaran", "authors": "Heejong Park, Arvind Easwaran, Sidharta Andalam", "title": "TiLA: Twin-in-the-Loop Architecture for Cyber-Physical Production\n  Systems", "comments": null, "journal-ref": "IEEE International Conference on Computer Design (ICCD), Abu\n  Dhabi, United Arab Emirates, 2019, pages 82-90", "doi": "10.1109/ICCD46524.2019.00019", "report-no": null, "categories": "cs.OH cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Digital twin is a virtual replica of a real-world object that lives\nsimultaneously with its physical counterpart. Since its first introduction in\n2003 by Grieves, digital twin has gained momentum in a wide range of\napplications such as industrial manufacturing, automotive and artificial\nintelligence. However, many digital-twin-related approaches, found in\nindustries as well as literature, mainly focus on modelling individual physical\nthings with high-fidelity methods with limited scalability. In this paper, we\nintroduce a digital-twin architecture called TiLA (Twin-in-the-Loop\nArchitecture). TiLA employs heterogeneous models and online data to create a\ndigital twin, which follows a Globally Asynchronous Locally Synchronous (GALS)\nmodel of computation. It facilitates the creation of a scalable digital twin\nwith different levels of modelling abstraction as well as giving GALS formalism\nfor execution strategy. Furthermore, TiLA provides facilities to develop\napplications around the twin as well as an interface to synchronise the twin\nwith the physical system through an industrial communication protocol. A\ndigital twin for a manufacturing line has been developed as a case study using\nTiLA. It demonstrates the use of digital twin models together with online data\nfor monitoring and analysing failures in the physical system.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2020 03:31:44 GMT"}], "update_date": "2020-03-23", "authors_parsed": [["Park", "Heejong", ""], ["Easwaran", "Arvind", ""], ["Andalam", "Sidharta", ""]]}, {"id": "2003.12463", "submitter": "Marcelo Fernandes", "authors": "Jos\\'e C. V. S. Junior, Matheus F. Torquato, Toktam Mahmoodi, Mischa\n  Dohler and Marcelo A. C. Fernandes", "title": "Reconfigurable Computing Applied to Latency Reduction for the Tactile\n  Internet", "comments": "20 pages, 32 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH eess.SP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Tactile internet applications allow robotic devices to be remotely controlled\nover a communication medium with an unnoticeable time delay. In a bilateral\ncommunication, the acceptable round trip latency is usually in the order of 1ms\nup to 10ms depending on the application requirements. It is estimated that 70%\nof the total latency is generated by the communication network, and the\nremaining 30% is produced by master and slave devices. Thus, this paper aims to\npropose a strategy to reduce 30% of the total latency that is produced by such\ndevices. The strategy is to apply reconfigurable computation using FPGAs to\nminimize the execution time of device-associated algorithms. With this in mind,\nthis work presents a hardware reference model for modules that implement\nnonlinear positioning and force calculations as well as a tactile system formed\nby two robotic manipulators. In addition to presenting the implementation\ndetails, simulations and experimental tests are performed in order to validate\nthe proposed model. Results associated with the FPGA sampling rate, throughput,\nlatency, and post-synthesis occupancy area are analyzed.\n", "versions": [{"version": "v1", "created": "Thu, 12 Mar 2020 03:45:43 GMT"}], "update_date": "2020-03-30", "authors_parsed": [["Junior", "José C. V. S.", ""], ["Torquato", "Matheus F.", ""], ["Mahmoodi", "Toktam", ""], ["Dohler", "Mischa", ""], ["Fernandes", "Marcelo A. C.", ""]]}, {"id": "2003.12670", "submitter": "Michael Taynnan Barros", "authors": "Michael Taynnan Barros, Harun Siljak, Peter Mullen, Constantinos\n  Papadias, Jari Hyttinen and Nicola Marchetti", "title": "Objective Multi-variable Classification and Inference of Biological\n  Neuronal Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Classification of biological neuron types and networks poses challenges to\nthe full understanding of the brain's organisation and functioning. In this\npaper, we develop a novel objective classification model of biological neuronal\ntypes and networks based on the communication metrics of neurons. This presents\nadvantages against the existing approaches since the mutual information or the\ndelay between neurons obtained from spike trains are more abundant data compare\nto conventional morphological data. We firstly designed two open-access\nsupporting computational platforms of various neuronal circuits from the Blue\nBrain Project realistic models, named Neurpy and Neurgen. Then we investigate\nhow the concept of network tomography could be achieved with cortical neuronal\ncircuits for morphological, topological and electrical classification of\nneurons. We extract the simulated data to many different classifiers (including\nSVM, Decision Trees, Random Forest, and Artificial Neuron Networks) classifying\nthe specific cell type (and sub-group types) achieving accuracies of up to\n70\\%. Inference of biological network structures using network tomography\nreached up to 65\\% of accuracy. We also analysed recall, precision and F1score\nof the classification of five layers, 25 cell m-types, and 14 cell e-types. Our\nresearch not only contributes to existing classification efforts but sets the\nroad-map for future usage of cellular-scaled brain-machine interfaces for\nin-vivo objective classification of neurons as a sensing mechanism of the\nbrain's structure.\n", "versions": [{"version": "v1", "created": "Sat, 28 Mar 2020 00:25:49 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Barros", "Michael Taynnan", ""], ["Siljak", "Harun", ""], ["Mullen", "Peter", ""], ["Papadias", "Constantinos", ""], ["Hyttinen", "Jari", ""], ["Marchetti", "Nicola", ""]]}]