[{"id": "0908.0494", "submitter": "Stephan Merz", "authors": "Francisco L\\'opez Fraguas, Stephan Merz (INRIA Lorraine - LORIA), Juan\n  Rodr\\'iguez Hortal\\'a", "title": "A Formalization of the Semantics of Functional-Logic Programming in\n  Isabelle", "comments": null, "journal-ref": "22nd International Conference Theorem Proving for Higher-Order\n  Logics (TPHOLs 2009): emerging trends session (2009)", "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern functional-logic programming languages like Toy or Curry feature\nnon-strict non-deterministic functions that behave under call-time choice\nsemantics. A standard formulation for this semantics is the CRWL logic, that\nspecifies a proof calculus for computing the set of possible results for each\nexpression. In this paper we present a formalization of that calculus in the\nIsabelle/HOL proof assistant. We have proved some basic properties of CRWL:\nclosedness under c-substitutions, polarity and compositionality. We also\ndiscuss some insights that have been gained, such as the fact that left\nlinearity of program rules is not needed for any of these results to hold.\n", "versions": [{"version": "v1", "created": "Tue, 4 Aug 2009 17:01:24 GMT"}], "update_date": "2009-08-05", "authors_parsed": [["Fraguas", "Francisco López", "", "INRIA Lorraine - LORIA"], ["Merz", "Stephan", "", "INRIA Lorraine - LORIA"], ["Hortalá", "Juan Rodríguez", ""]]}, {"id": "0908.1189", "submitter": "Grenville Croll", "authors": "Etienne Vandeput", "title": "Milestones for Teaching the Spreadsheet Program", "comments": "11 Pages", "journal-ref": "Proc. European Spreadsheet Risks Int. Grp. (EuSpRIG) 2009 133-143\n  ISBN 978-1-905617-89-0", "doi": null, "report-no": null, "categories": "cs.HC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are different manners of teaching a spreadsheet program. In any case,\nit is intended that the teacher settles the objectives of the course and adapts\nthem to the particular audience he/she has to deal with. This paper aims at\nproviding any teacher whatever his/her specific objectives and his/her audience\nwith elements to help him/her building a course. It focuses mainly on two\nimportant issues: 1 - select in all that may be said about such complex tools,\nwhat is prior to know and to teach, i.e. what leads to autonomy in using but\nalso to autonomy in learning (because everything cannot be taught) and 2 - show\nhow concepts are closely related to good formatting considerations. A method\nbased on the \"invariants of information processing\" is outlined, partially\nillustrated and an implementation is described throughout a course designed for\nstudents preparing a master in Education Sciences.\n", "versions": [{"version": "v1", "created": "Sat, 8 Aug 2009 21:02:41 GMT"}], "update_date": "2009-08-11", "authors_parsed": [["Vandeput", "Etienne", ""]]}, {"id": "0908.1390", "submitter": "Andrew Gacek", "authors": "Andrew Gacek, Dale Miller, and Gopalan Nadathur", "title": "Nominal Abstraction", "comments": "To appear in the Journal of Information and Computation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recursive relational specifications are commonly used to describe the\ncomputational structure of formal systems. Recent research in proof theory has\nidentified two features that facilitate direct, logic-based reasoning about\nsuch descriptions: the interpretation of atomic judgments through recursive\ndefinitions and an encoding of binding constructs via generic judgments.\nHowever, logics encompassing these two features do not currently allow for the\ndefinition of relations that embody dynamic aspects related to binding, a\ncapability needed in many reasoning tasks. We propose a new relation between\nterms called nominal abstraction as a means for overcoming this deficiency. We\nincorporate nominal abstraction into a rich logic also including definitions,\ngeneric quantification, induction, and co-induction that we then prove to be\nconsistent. We present examples to show that this logic can provide elegant\ntreatments of binding contexts that appear in many proofs, such as those\nestablishing properties of typing calculi and of arbitrarily cascading\nsubstitutions that play a role in reducibility arguments.\n", "versions": [{"version": "v1", "created": "Mon, 10 Aug 2009 20:36:43 GMT"}, {"version": "v2", "created": "Thu, 27 May 2010 11:52:45 GMT"}, {"version": "v3", "created": "Thu, 23 Sep 2010 12:56:36 GMT"}], "update_date": "2010-09-24", "authors_parsed": [["Gacek", "Andrew", ""], ["Miller", "Dale", ""], ["Nadathur", "Gopalan", ""]]}, {"id": "0908.2399", "submitter": "Andreas Witzel", "authors": "Andreas Witzel, Krzysztof R. Apt, Jonathan A. Zvesper", "title": "Distributed iterated elimination of strictly dominated strategies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We characterize epistemic consequences of truthful communication among\nrational agents in a game-theoretic setting. To this end we introduce\nnormal-form games equipped with an interaction structure, which specifies which\ngroups of players can communicate their preferences with each other. We then\nfocus on a specific form of interaction, namely a distributed form of iterated\nelimination of strictly dominated strategies (IESDS), driven by communication\namong the agents. We study the outcome of IESDS after some (possibly all)\nmessages about players' preferences have been sent. The main result of the\npaper provides an epistemic justification of this form of IESDS.\n", "versions": [{"version": "v1", "created": "Mon, 17 Aug 2009 17:20:50 GMT"}, {"version": "v2", "created": "Mon, 2 Nov 2009 16:01:37 GMT"}, {"version": "v3", "created": "Wed, 17 Aug 2011 22:55:11 GMT"}], "update_date": "2011-08-19", "authors_parsed": [["Witzel", "Andreas", ""], ["Apt", "Krzysztof R.", ""], ["Zvesper", "Jonathan A.", ""]]}, {"id": "0908.2707", "submitter": "Edward Hirsch", "authors": "Edward A. Hirsch and Dmitry Itsykson", "title": "On optimal heuristic randomized semidecision procedures, with\n  application to proof complexity", "comments": "11 pages, accepted to STACS 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The existence of a (p-)optimal propositional proof system is a major open\nquestion in (proof) complexity; many people conjecture that such systems do not\nexist. Krajicek and Pudlak (1989) show that this question is equivalent to the\nexistence of an algorithm that is optimal on all propositional tautologies.\nMonroe (2009) recently gave a conjecture implying that such algorithm does not\nexist.\n  We show that in the presence of errors such optimal algorithms do exist. The\nconcept is motivated by the notion of heuristic algorithms. Namely, we allow\nthe algorithm to claim a small number of false \"theorems\" (according to any\nsamplable distribution on non-tautologies) and err with bounded probability on\nother inputs.\n  Our result can also be viewed as the existence of an optimal proof system in\na class of proof systems obtained by generalizing automatizable proof systems.\n", "versions": [{"version": "v1", "created": "Wed, 19 Aug 2009 09:18:25 GMT"}, {"version": "v2", "created": "Mon, 4 Jan 2010 20:14:38 GMT"}, {"version": "v3", "created": "Wed, 3 Feb 2010 12:25:24 GMT"}], "update_date": "2010-02-03", "authors_parsed": [["Hirsch", "Edward A.", ""], ["Itsykson", "Dmitry", ""]]}, {"id": "0908.2793", "submitter": "Dexter Kozen", "authors": "Dexter Kozen, Nicholas Ruozzi", "title": "Applications of Metric Coinduction", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 5, Issue 3 (September\n  16, 2009) lmcs:1168", "doi": "10.2168/LMCS-5(3:10)2009", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metric coinduction is a form of coinduction that can be used to establish\nproperties of objects constructed as a limit of finite approximations. One can\nprove a coinduction step showing that some property is preserved by one step of\nthe approximation process, then automatically infer by the coinduction\nprinciple that the property holds of the limit object. This can often be used\nto avoid complicated analytic arguments involving limits and convergence,\nreplacing them with simpler algebraic arguments. This paper examines the\napplication of this principle in a variety of areas, including infinite\nstreams, Markov chains, Markov decision processes, and non-well-founded sets.\nThese results point to the usefulness of coinduction as a general proof\ntechnique.\n", "versions": [{"version": "v1", "created": "Wed, 19 Aug 2009 17:59:03 GMT"}, {"version": "v2", "created": "Wed, 16 Sep 2009 15:14:20 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Kozen", "Dexter", ""], ["Ruozzi", "Nicholas", ""]]}, {"id": "0908.3430", "submitter": "Yu. I. Manin", "authors": "Yuri I. Manin", "title": "Renormalization and Computation II: Time Cut-off and the Halting Problem", "comments": "28 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.QA cs.CC cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is the second installment to the project initiated in [Ma3]. In the\nfirst Part, I argued that both philosophy and technique of the perturbative\nrenormalization in quantum field theory could be meaningfully transplanted to\nthe theory of computation, and sketched several contexts supporting this view.\n  In this second part, I address some of the issues raised in [Ma3] and provide\ntheir development in three contexts: a categorification of the algorithmic\ncomputations; time cut--off and Anytime Algorithms; and finally, a Hopf algebra\nrenormalization of the Halting Problem.\n", "versions": [{"version": "v1", "created": "Mon, 24 Aug 2009 13:03:38 GMT"}], "update_date": "2009-08-25", "authors_parsed": [["Manin", "Yuri I.", ""]]}, {"id": "0908.3634", "submitter": "Dominique Duval", "authors": "Dominique Duval (LJK), C\\'esar Dominguez", "title": "A parameterization process as a categorical construction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The parameterization process used in the symbolic computation systems Kenzo\nand EAT is studied here as a general construction in a categorical framework.\nThis parameterization process starts from a given specification and builds a\nparameterized specification by transforming some operations into parameterized\noperations, which depend on one additional variable called the parameter. Given\na model of the parameterized specification, each interpretation of the\nparameter, called an argument, provides a model of the given specification.\nMoreover, under some relevant terminality assumption, this correspondence\nbetween the arguments and the models of the given specification is a bijection.\nIt is proved in this paper that the parameterization process is provided by a\nfree functor and the subsequent parameter passing process by a natural\ntransformation. Various categorical notions are used, mainly adjoint functors,\npushouts and lax colimits.\n", "versions": [{"version": "v1", "created": "Tue, 25 Aug 2009 15:31:18 GMT"}], "update_date": "2009-08-26", "authors_parsed": [["Duval", "Dominique", "", "LJK"], ["Dominguez", "César", ""]]}, {"id": "0908.3737", "submitter": "Dominique Duval", "authors": "Cesar Dominguez, Dominique Duval (LJK)", "title": "Diagrammatic logic applied to a parameterization process", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper provides an abstract definition of some kinds of logics, called\ndiagrammatic logics, together with a definition of morphisms and of 2-morphisms\nbetween diagrammatic logics. The definition of the 2-category of diagrammatic\nlogics rely on category theory, mainly on adjunction, categories of fractions\nand limit sketches. This framework is applied to the formalization of a\nparameterization process. This process, which consists in adding a formal\nparameter to some operations in a given specification, is presented as a\nmorphism of logics. Then the parameter passing process, for recovering a model\nof the given specification from a model of the parameterized specification and\nan actual parameter, is seen as a 2-morphism of logics.\n", "versions": [{"version": "v1", "created": "Wed, 26 Aug 2009 06:50:00 GMT"}], "update_date": "2009-08-27", "authors_parsed": [["Dominguez", "Cesar", "", "LJK"], ["Duval", "Dominique", "", "LJK"]]}, {"id": "0908.3994", "submitter": "Samuel Mimram", "authors": "Samuel Mimram (PPS)", "title": "The Structure of First-Order Causality", "comments": null, "journal-ref": "Logic in Computer Science, Los Angeles : United States (2009)", "doi": "10.1109/LICS.2009.19", "report-no": null, "categories": "cs.LO math.CT math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Game semantics describe the interactive behavior of proofs by interpreting\nformulas as games on which proofs induce strategies. Such a semantics is\nintroduced here for capturing dependencies induced by quantifications in\nfirst-order propositional logic. One of the main difficulties that has to be\nfaced during the elaboration of this kind of semantics is to characterize\ndefinable strategies, that is strategies which actually behave like a proof.\nThis is usually done by restricting the model to strategies satisfying subtle\ncombinatorial conditions, whose preservation under composition is often\ndifficult to show. Here, we present an original methodology to achieve this\ntask, which requires to combine advanced tools from game semantics, rewriting\ntheory and categorical algebra. We introduce a diagrammatic presentation of the\nmonoidal category of definable strategies of our model, by the means of\ngenerators and relations: those strategies can be generated from a finite set\nof atomic strategies and the equality between strategies admits a finite\naxiomatization, this equational structure corresponding to a polarized\nvariation of the notion of bialgebra. This work thus bridges algebra and\ndenotational semantics in order to reveal the structure of dependencies induced\nby first-order quantifiers, and lays the foundations for a mechanized analysis\nof causality in programming languages.\n", "versions": [{"version": "v1", "created": "Thu, 27 Aug 2009 12:08:34 GMT"}], "update_date": "2009-08-28", "authors_parsed": [["Mimram", "Samuel", "", "PPS"]]}, {"id": "0908.4491", "submitter": "Dominique Duval", "authors": "C\\'esar Dominguez, Dominique Duval (LJK)", "title": "A parameterization process, functorially", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The parameterization process used in the symbolic computation systems Kenzo\nand EAT is studied here as a general construction in a categorical framework.\nThis parameterization process starts from a given specification and builds a\nparameterized specification by adding a parameter as a new variable to some\noperations. Given a model of the parameterized specification, each\ninterpretation of the parameter, called an argument, provides a model of the\ngiven specification. Moreover, under some relevant terminality assumption, this\ncorrespondence between the arguments and the models of the given specification\nis a bijection. It is proved in this paper that the parameterization process is\nprovided by a functor and the subsequent parameter passing process by a natural\ntransformation. Various categorical notions are used, mainly adjoint functors,\npushouts and lax colimits.\n", "versions": [{"version": "v1", "created": "Mon, 31 Aug 2009 09:45:53 GMT"}], "update_date": "2009-09-01", "authors_parsed": [["Dominguez", "César", "", "LJK"], ["Duval", "Dominique", "", "LJK"]]}, {"id": "0908.4499", "submitter": "Yann Strozecki", "authors": "Yann Strozecki", "title": "Monadic second-order model-checking on decomposable matroids", "comments": "32 pages, journal paper. Revision: the last part has been removed and\n  the writing improved", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A notion of branch-width, which generalizes the one known for graphs, can be\ndefined for matroids. We first give a proof of the polynomial time\nmodel-checking of monadic second-order formulas on representable matroids of\nbounded branch-width, by reduction to monadic second-order formulas on trees.\nThis proof is much simpler than the one previously known. We also provide a\nlink between our logical approach and a grammar that allows to build matroids\nof bounded branch-width. Finally, we introduce a new class of non-necessarily\nrepresentable matroids, described by a grammar and on which monadic\nsecond-order formulas can be checked in linear time.\n", "versions": [{"version": "v1", "created": "Mon, 31 Aug 2009 11:00:44 GMT"}, {"version": "v2", "created": "Sat, 29 Jan 2011 23:43:14 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Strozecki", "Yann", ""]]}]