[{"id": "1009.0574", "submitter": "G Peterson", "authors": "G.J. Peterson, S. Press\\'e, K.A. Dill", "title": "Nonuniversal power law scaling in the probability distribution of\n  scientific citations", "comments": "7 pages, 3 figures, 2 tables", "journal-ref": "PNAS 107 (2010) 16023-16027", "doi": "10.1073/pnas.1010757107", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.DL physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a model for the distribution of scientific citations. The model\ninvolves a dual mechanism: in the direct mechanism, the author of a new paper\nfinds an old paper A and cites it. In the indirect mechanism, the author of a\nnew paper finds an old paper A only via the reference list of a newer\nintermediary paper B, which has previously cited A. By comparison to citation\ndatabases, we find that papers having few citations are cited mainly by the\ndirect mechanism. Papers already having many citations ('classics') are cited\nmainly by the indirect mechanism. The indirect mechanism gives a power-law\ntail. The 'tipping point' at which a paper becomes a classic is about 21\ncitations for papers published in the Institute for Scientific Information\n(ISI) Web of Science database in 1981, 29 for Physical Review D papers\npublished from 1975-1994, and 39 for all publications from a list of high\nh-index chemists assembled in 2007. The power-law exponent is not universal.\nIndividuals who are highly cited have a systematically smaller exponent than\nindividuals who are less cited.\n", "versions": [{"version": "v1", "created": "Fri, 3 Sep 2010 03:02:28 GMT"}, {"version": "v2", "created": "Sat, 11 Dec 2010 22:16:58 GMT"}, {"version": "v3", "created": "Mon, 7 Mar 2011 20:48:13 GMT"}], "update_date": "2011-03-08", "authors_parsed": [["Peterson", "G. J.", ""], ["Pressé", "S.", ""], ["Dill", "K. A.", ""]]}, {"id": "1009.1466", "submitter": "Loet Leydesdorff", "authors": "Alkim Almila Akdag Salah and Loet Leydesdorff", "title": "The Development of the Journal Environment of Leonardo", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present animations based on the aggregated journal-journal citations of\nLeonardo during the period 1974-2008. Leonardo is mainly cited by journals\noutside the arts domain for cultural reasons, for example, in neuropsychology\nand physics. Articles in Leonardo itself cite a large number of journals, but\nwith a focus on the arts. Animations at this level of aggregation enable us to\nshow the history of the journal from a network perspective.\n", "versions": [{"version": "v1", "created": "Wed, 8 Sep 2010 07:36:55 GMT"}], "update_date": "2010-09-09", "authors_parsed": [["Salah", "Alkim Almila Akdag", ""], ["Leydesdorff", "Loet", ""]]}, {"id": "1009.3359", "submitter": "Jerome Vanclay", "authors": "Jerome K. Vanclay", "title": "An evaluation of the Australian Research Council's journal ranking", "comments": "14 pages, 4 figures, 7 tables", "journal-ref": "Journal of Informetrics (2011) 5:265-274", "doi": "10.1016/j.joi.2010.12.001", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As part of its program of 'Excellence in Research for Australia' (ERA), the\nAustralian Research Council ranked journals into four categories (A*, A, B, C)\nin preparation for their performance evaluation of Australian universities. The\nranking is important because it likely to have a major impact on publication\nchoices and research dissemination in Australia. The ranking is problematic\nbecause it is evident that some disciplines have been treated very differently\nthan others. This paper reveals weaknesses in the ERA journal ranking and\nhighlights the poor correlation between ERA rankings and other acknowledged\nmetrics of journal standing. It highlights the need for a reasonable\nrepresentation of journals ranked as A* in each scientific discipline.\n", "versions": [{"version": "v1", "created": "Fri, 17 Sep 2010 08:14:27 GMT"}, {"version": "v2", "created": "Thu, 4 Nov 2010 13:06:00 GMT"}, {"version": "v3", "created": "Sun, 26 Dec 2010 13:02:48 GMT"}], "update_date": "2011-03-15", "authors_parsed": [["Vanclay", "Jerome K.", ""]]}, {"id": "1009.3763", "submitter": "Siegfried Bethke", "authors": "Siegfried Bethke", "title": "Data Preservation in High Energy Physics - why, how and when?", "comments": "5 pages, 3 figures; presentation given at the QCD10, Montpellier,\n  France, June 2010", "journal-ref": "Nucl.Phys.Proc.Suppl.207-208:156-159,2010", "doi": "10.1016/j.nuclphysbps.2010.10.040", "report-no": null, "categories": "hep-ex cs.DL physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Long-term preservation of data and software of large experiments and\ndetectors in high energy physics is of utmost importance to secure the heritage\nof (mostly unique) data and to allow advanced physics (re-)analyses at later\ntimes. Summarising the work of an international study group, motivation, use\ncases and technical details are given for an organised effort to secure and\nenable future use of past, present and future experimental data. As a practical\nuse case and motivation, the revival of JADE data and the corresponding latest\nresults on measuring $\\alpha_s$ in NNLO QCD are reviewed.\n", "versions": [{"version": "v1", "created": "Mon, 20 Sep 2010 10:25:22 GMT"}], "update_date": "2011-02-15", "authors_parsed": [["Bethke", "Siegfried", ""]]}, {"id": "1009.5003", "submitter": "Philipp Mayr", "authors": "Philipp Schaer, Philipp Mayr, Peter Mutschke", "title": "Demonstrating a Service-Enhanced Retrieval System", "comments": "2 pages, 1 figure, ASIST 2010 conference, Pittsburgh, PA, USA", "journal-ref": null, "doi": "10.1002/meet.14504701395", "report-no": null, "categories": "cs.IR cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is a short description of an information retrieval system enhanced\nby three model driven retrieval services: (1) co-word analysis based query\nexpansion, re-ranking via (2) Bradfordizing and (3) author centrality. The\ndifferent services each favor quite other - but still relevant - documents than\npure term-frequency based rankings. Each service can be interactively combined\nwith each other to allow an iterative retrieval refinement.\n", "versions": [{"version": "v1", "created": "Sat, 25 Sep 2010 10:33:42 GMT"}], "update_date": "2017-05-03", "authors_parsed": [["Schaer", "Philipp", ""], ["Mayr", "Philipp", ""], ["Mutschke", "Peter", ""]]}, {"id": "1009.5183", "submitter": "Florian Reitz", "authors": "Florian Reitz", "title": "A Framework for an Ego-centered and Time-aware Visualization of\n  Relations in Arbitrary Data Repositories", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding constellations in large data collections has become a common\ntask. One obstacle a user has to overcome is the internal complexity of these\nrepositories. For example, extracting connected data from a normalized\nrelational database requires knowledge of the table structure which might not\nbe available for the casual user. In this paper we present a visualization\nframework which presents the collection as a set of entities and relations (on\nthe data level). Using rating functions, we divide large relation networks into\nsmall graphs which resemble ego-centered networks. These graphs are connected\nso the user can browse from one to another. To further assist the user, we\npresent two views which embed information on the evolution of the relations\ninto the graphs. Each view emphasizes another aspect of temporal development.\nThe framework can be adapted to any repository by a flexible data interface and\na graph configuration file. We present some first web-based applications\nincluding a visualization of the DBLP data set. We use the DBLP visualization\nto evaluate our approach.\n", "versions": [{"version": "v1", "created": "Mon, 27 Sep 2010 08:16:36 GMT"}], "update_date": "2010-09-28", "authors_parsed": [["Reitz", "Florian", ""]]}, {"id": "1009.5233", "submitter": "Nassib Nassar", "authors": "Nassib Nassar", "title": "A Simple Abstraction for Data Modeling", "comments": "10 pages, 2 figures, LaTeX; added two definitions in section 2", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problems that scientists face in creating well designed databases\nintersect with the concerns of data curation. Entity-relationship modeling and\nits variants have been the basis of most relational data modeling for decades.\nHowever, these abstractions and the relational model itself are intricate and\nhave proved not to be very accessible among scientists with limited resources\nfor data management. This paper explores one aspect of relational data models,\nthe meaning of foreign key relationships. We observe that a foreign key\nproduces a table relationship that generally references either an entity or\nrepeating attributes. This paper proposes constructing foreign keys based on\nthese two cases, and suggests that the method promotes intuitive data modeling\nand normalization.\n", "versions": [{"version": "v1", "created": "Mon, 27 Sep 2010 12:00:32 GMT"}, {"version": "v2", "created": "Wed, 29 Sep 2010 19:11:56 GMT"}, {"version": "v3", "created": "Mon, 4 Oct 2010 16:34:26 GMT"}], "update_date": "2010-10-05", "authors_parsed": [["Nassar", "Nassib", ""]]}, {"id": "1009.5352", "submitter": "Philipp Mayr", "authors": "Philipp Mayr, Benjamin Zapilko, York Sure", "title": "Establishing a Multi-Thesauri-Scenario based on SKOS and\n  Cross-Concordances", "comments": "3 pages, Dublin Core conference 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This case study proposes a scenario with three topic-related thesauri, which\nhave been connected with bilateral cross-concordances as part of a major\nterminology mapping initiative in the project KoMoHe (Mayr & Petras, 2008). The\nthesauri have already been or will be converted to SKOS and in order to not\nomit the relevant crosswalks, the mapping properties of SKOS will be used for\nmodeling them adequately.\n", "versions": [{"version": "v1", "created": "Mon, 27 Sep 2010 18:51:31 GMT"}], "update_date": "2010-09-28", "authors_parsed": [["Mayr", "Philipp", ""], ["Zapilko", "Benjamin", ""], ["Sure", "York", ""]]}]