[{"id": "1108.0141", "submitter": "K.Savitha", "authors": "K.Savitha and C.Chandrasekar", "title": "Trusted Network Selection using SAW and TOPSIS Algorithms for\n  Heterogeneous Wireless Networks", "comments": "arXiv admin note: substantial text overlap with arXiv:1106.2402", "journal-ref": null, "doi": "10.5120/3125-4300", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Seamless continuity is the main goal in fourth generation Wireless networks\n(FGWNs), to achieve this \"HANDOVER\" technique is used, when a mobile\nterminal(MT) is in overlapping area for service continuity, Handover mechanism\nare mainly used. In Heterogeneous wireless networks main challenge is continual\nconnection among the different networks like WiFi, WiMax, WLAN, WPAN etc. In\nthis paper, Vertical handover decision schemes are compared and Multi Attribute\nDecision Making (MADM) is used to choose the best network from the available\nVisitor networks (VTs) for the continuous connection by the mobile terminal. In\nour work we mainly concentrated to the handover decision phase and to reduce\nthe processing delay in the period of handover. MADM algorithms SAW and TOPSIS\nwhere compared to reduce the processing delay by using NS2 to evaluate the\nparameters for processing delay.\n", "versions": [{"version": "v1", "created": "Sun, 31 Jul 2011 05:57:22 GMT"}], "update_date": "2012-04-01", "authors_parsed": [["Savitha", "K.", ""], ["Chandrasekar", "C.", ""]]}, {"id": "1108.0231", "submitter": "EPTCS", "authors": "Chiara Bodei, Viet Dung Dinh, Gian Luigi Ferrari", "title": "Predicting global usages of resources endowed with local policies", "comments": "In Proceedings FOCLASA 2011, arXiv:1107.5847", "journal-ref": "EPTCS 58, 2011, pp. 49-64", "doi": "10.4204/EPTCS.58.4", "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The effective usages of computational resources are a primary concern of\nup-to-date distributed applications. In this paper, we present a methodology to\nreason about resource usages (acquisition, release, revision, ...), and\ntherefore the proposed approach enables to predict bad usages of resources.\nKeeping in mind the interplay between local and global information occurring in\nthe application-resource interactions, we model resources as entities with\nlocal policies and global properties governing the overall interactions.\nFormally, our model takes the shape of an extension of pi-calculus with\nprimitives to manage resources. We develop a Control Flow Analysis computing a\nstatic approximation of process behaviour and therefore of the resource usages.\n", "versions": [{"version": "v1", "created": "Mon, 1 Aug 2011 03:58:16 GMT"}], "update_date": "2011-08-02", "authors_parsed": [["Bodei", "Chiara", ""], ["Dinh", "Viet Dung", ""], ["Ferrari", "Gian Luigi", ""]]}, {"id": "1108.0465", "submitter": "EPTCS", "authors": "Andrei Dorman (Universit\\'e Paris 13) and Tobias Heindel (Universit\\'e\n  Paris 13)", "title": "Structured Operational Semantics for Graph Rewriting", "comments": "In Proceedings ICE 2011, arXiv:1108.0144", "journal-ref": "EPTCS 59, 2011, pp. 37-51", "doi": "10.4204/EPTCS.59.4", "report-no": null, "categories": "cs.LO cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Process calculi and graph transformation systems provide models of reactive\nsystems with labelled transition semantics. While the semantics for process\ncalculi is compositional, this is not the case for graph transformation\nsystems, in general. Hence, the goal of this article is to obtain a\ncompositional semantics for graph transformation system in analogy to the\nstructural operational semantics (SOS) for Milner's Calculus of Communicating\nSystems (CCS).\n  The paper introduces an SOS style axiomatization of the standard labelled\ntransition semantics for graph transformation systems. The first result is its\nequivalence with the so-called Borrowed Context technique. Unfortunately, the\naxiomatization is not compositional in the expected manner as no rule captures\n\"internal\" communication of sub-systems. The main result states that such a\nrule is derivable if the given graph transformation system enjoys a certain\nproperty, which we call \"complementarity of actions\". Archetypal examples of\nsuch systems are interaction nets. We also discuss problems that arise if\n\"complementarity of actions\" is violated.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 02:27:13 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Dorman", "Andrei", "", "Université Paris 13"], ["Heindel", "Tobias", "", "Université\n  Paris 13"]]}, {"id": "1108.0466", "submitter": "EPTCS", "authors": "Viviana Bono (Torino, Italy), Luca Padovani (Torino, Italy)", "title": "Polymorphic Endpoint Types for Copyless Message Passing", "comments": "In Proceedings ICE 2011, arXiv:1108.0144", "journal-ref": "EPTCS 59, 2011, pp. 52-67", "doi": "10.4204/EPTCS.59.5", "report-no": null, "categories": "cs.PL cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present PolySing#, a calculus that models process interaction based on\ncopyless message passing, in the style of Singularity OS. We equip the calculus\nwith a type system that accommodates polymorphic endpoint types, which are a\nvariant of polymorphic session types, and we show that well-typed processes are\nfree from faults, leaks, and communication errors. The type system is\nessentially linear, although linearity alone may leave room for scenarios where\nwell-typed processes leak memory. We identify a condition on endpoint types\nthat prevents these leaks from occurring.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 02:27:18 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Bono", "Viviana", "", "Torino, Italy"], ["Padovani", "Luca", "", "Torino, Italy"]]}, {"id": "1108.0470", "submitter": "EPTCS", "authors": "Laura Bocchi (Department of Computer Science, University of\n  Leicester), Julien Lange (Department of Computer Science, University of\n  Leicester), Emilio Tuosto (Department of Computer Science, University of\n  Leicester)", "title": "Amending Contracts for Choreographies", "comments": "In Proceedings ICE 2011, arXiv:1108.0144", "journal-ref": "EPTCS 59, 2011, pp. 111-129", "doi": "10.4204/EPTCS.59.10", "report-no": null, "categories": "cs.DC cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed interactions can be suitably designed in terms of choreographies.\nSuch abstractions can be thought of as global descriptions of the coordination\nof several distributed parties. Global assertions define contracts for\nchoreographies by annotating multiparty session types with logical formulae to\nvalidate the content of the exchanged messages. The introduction of such\nconstraints is a critical design issue as it may be hard to specify contracts\nthat allow each party to be able to progress without violating the contract. In\nthis paper, we propose three methods that automatically correct inconsistent\nglobal assertions. The methods are compared by discussing their applicability\nand the relationships between the amended global assertions and the original\n(inconsistent) ones.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 02:27:44 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Bocchi", "Laura", "", "Department of Computer Science, University of\n  Leicester"], ["Lange", "Julien", "", "Department of Computer Science, University of\n  Leicester"], ["Tuosto", "Emilio", "", "Department of Computer Science, University of\n  Leicester"]]}, {"id": "1108.0471", "submitter": "EPTCS", "authors": "Massimo Bartoletti (Dipartimento di Matematica e Informatica,\n  Universita' degli Studi di Cagliari, Italy), Emilio Tuosto (Department of\n  Computer Science, University of Leicester, UK), Roberto Zunino\n  (DISI-Universita' degli Studi di Trento and COSBI, Italy)", "title": "Contracts in distributed systems", "comments": "In Proceedings ICE 2011, arXiv:1108.0144", "journal-ref": "EPTCS 59, 2011, pp. 130-147", "doi": "10.4204/EPTCS.59.11", "report-no": null, "categories": "cs.PL cs.DC cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a parametric calculus for contract-based computing in distributed\nsystems. By abstracting from the actual contract language, our calculus\ngeneralises both the contracts-as-processes and contracts-as-formulae\nparadigms. The calculus features primitives for advertising contracts, for\nreaching agreements, and for querying the fulfilment of contracts. Coordination\namong principals happens via multi-party sessions, which are created once\nagreements are reached. We present two instances of our calculus, by modelling\ncontracts as (i) processes in a variant of CCS, and (ii) as formulae in a\nlogic. With the help of a few examples, we discuss the primitives of our\ncalculus, as well as some possible variants.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 02:27:50 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Bartoletti", "Massimo", "", "Dipartimento di Matematica e Informatica,\n  Universita' degli Studi di Cagliari, Italy"], ["Tuosto", "Emilio", "", "Department of\n  Computer Science, University of Leicester, UK"], ["Zunino", "Roberto", "", "DISI-Universita' degli Studi di Trento and COSBI, Italy"]]}, {"id": "1108.0486", "submitter": "Richard Brent", "authors": "Nimalan Nandapalan, Richard P. Brent, Lawrence M. Murray and Alistair\n  Rendell", "title": "High-Performance Pseudo-Random Number Generation on Graphics Processing\n  Units", "comments": "10 pages, submitted to PPAM 2011 (Torun, Poland, 11-14 Sept. 2011).\n  For further information, see http://maths.anu.edu.au/~brent/pub/pub241.html", "journal-ref": "Lecture Notes in Computer Science, Vol. 7203 (2012), 609-618", "doi": null, "report-no": null, "categories": "cs.DC math.NT stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work considers the deployment of pseudo-random number generators (PRNGs)\non graphics processing units (GPUs), developing an approach based on the\nxorgens generator to rapidly produce pseudo-random numbers of high statistical\nquality. The chosen algorithm has configurable state size and period, making it\nideal for tuning to the GPU architecture. We present a comparison of both speed\nand statistical quality with other common parallel, GPU-based PRNGs,\ndemonstrating favourable performance of the xorgens-based approach.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 05:41:44 GMT"}], "update_date": "2013-03-13", "authors_parsed": [["Nandapalan", "Nimalan", ""], ["Brent", "Richard P.", ""], ["Murray", "Lawrence M.", ""], ["Rendell", "Alistair", ""]]}, {"id": "1108.0496", "submitter": "Bogdan Aman", "authors": "Bogdan Aman", "title": "Spatial Dynamic Structures and Mobility in Computation", "comments": "20 pages, 1 figure, PhD Thesis (Extended Abstract)", "journal-ref": null, "doi": null, "report-no": "FML-11-01", "categories": "cs.DC math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Membrane computing is a well-established and successful research field which\nbelongs to the more general area of molecular computing. Membrane computing\naims at defining parallel and non-deterministic computing models, called\nmembrane systems or P Systems, which abstract from the functioning and\nstructure of the cell. A membrane system consists of a spatial structure, a\nhierarchy of membranes which do not intersect, with a distinguishable membrane\ncalled skin surrounding all of them. A membrane without any other membranes\ninside is elementary, while a non-elementary membrane is a composite membrane.\nThe membranes define demarcations between regions; for each membrane there is a\nunique associated region. Since we have a one-to-one correspondence, we\nsometimes use membrane instead of region, and vice-versa. The space outside the\nskin membrane is called the environment.\n  In this thesis we define and investigate variants of systems of mobile\nmembranes as models for molecular computing and as modelling paradigms for\nbiological systems. On one hand, we follow the standard approach of research in\nmembrane computing: defining a notion of computation for systems of mobile\nmembranes, and investigating the computational power of such computing devices.\nSpecifically, we address issues concerning the power of operations for\nmodifying the membrane structure of a system of mobile membranes by mobility:\nendocytosis (moving a membrane inside a neighbouring membrane) and endocytosis\n(moving a membrane outside the membrane where it is placed). On the other hand,\nwe relate systems of mobile membranes to process algebra (mobile ambients,\ntimed mobile ambients, pi-calculus, brane calculus) by providing some encodings\nand adding some concepts inspired from process algebra in the framework of\nmobile membrane computing.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 07:17:06 GMT"}], "update_date": "2011-08-11", "authors_parsed": [["Aman", "Bogdan", ""]]}, {"id": "1108.0599", "submitter": "Ramirez Picarzo Tomas", "authors": "Tomas Ramirez Picarzo, Francisco Fernandez de Vega, Daniel Lombrana\n  Gonzalez", "title": "Proposal for improvement in the transfer and execution of multiple\n  instances of a virtual image", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Virtualization technology allows currently any application run any\napplication complex and expensive computational (the scientific applications\nare a good example) on heterogeneous distributed systems, which make regular\nuse of Grid and Cloud technologies, enabling significant savings in computing\ntime. This model is particularly interesting for the mass execution of\nscientific simulations and calculations, allowing parallel execution of\napplications using the same execution environment (unchanged) used by the\nscientist as usual. However, the use and distribution of large virtual images\ncan be a problem (up to tens of GBytes), which is aggravated when attempting a\nmass mailing on a large number of distributed computers. This work has as main\nobjective to present an analysis of how implementation and a proposal for the\nimprovement (reduction in size) of the virtual images pretending reduce\ndistribution time in distributed systems. This analysis is done very specific\nrequirements that need an operating system (guest OS) on some aspects of its\nexecution.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 15:45:12 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Picarzo", "Tomas Ramirez", ""], ["de Vega", "Francisco Fernandez", ""], ["Gonzalez", "Daniel Lombrana", ""]]}, {"id": "1108.0809", "submitter": "Peter Robinson", "authors": "John Augustine, Gopal Pandurangan, Peter Robinson, Eli Upfal", "title": "Distributed Agreement in Dynamic Peer-to-Peer Networks", "comments": "to appear at the Journal of Computer and System Sciences; preliminary\n  version appeared at SODA 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the need for robust and fast distributed computation in highly\ndynamic Peer-to-Peer (P2P) networks, we study algorithms for the fundamental\ndistributed agreement problem. P2P networks are highly dynamic networks that\nexperience heavy node {\\em churn}. Our goal is to design fast algorithms\n(running in a small number of rounds) that guarantee, despite high node churn\nrate, that almost all nodes reach a stable agreement. Our main contributions\nare randomized distributed algorithms that guarantee {\\em stable\nalmost-everywhere agreement} with high probability even under high adversarial\nchurn in a polylogarithmic number of rounds:\n  1. An $O(\\log^2 n)$-round ($n$ is the stable network size) randomized\nalgorithm that achieves almost-everywhere agreement with high probability under\nup to {\\em linear} churn {\\em per round} (i.e., $\\epsilon n$, for some small\nconstant $\\epsilon > 0$), assuming that the churn is controlled by an oblivious\nadversary (that has complete knowledge and control of what nodes join and leave\nand at what time and has unlimited computational power, but is oblivious to the\nrandom choices made by the algorithm). Our algorithm requires only\npolylogarithmic in $n$ bits to be processed and sent (per round) by each node.\n  2. An $O(\\log m\\log^3 n)$-round randomized algorithm that achieves\nalmost-everywhere agreement with high probability under up to $\\epsilon\n\\sqrt{n}$ churn per round (for some small $\\epsilon > 0$), where $m$ is the\nsize of the input value domain, that works even under an adaptive adversary\n(that also knows the past random choices made by the algorithm). This algorithm\nrequires up to polynomial in $n$ bits (and up to $O(\\log m)$ bits) to be\nprocessed and sent (per round) by each node.\n", "versions": [{"version": "v1", "created": "Wed, 3 Aug 2011 10:09:45 GMT"}, {"version": "v2", "created": "Wed, 10 Sep 2014 08:38:38 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Augustine", "John", ""], ["Pandurangan", "Gopal", ""], ["Robinson", "Peter", ""], ["Upfal", "Eli", ""]]}, {"id": "1108.0972", "submitter": "Jing (Tiffany) Li", "authors": "Phisan Kaewprapha, Jing Li (Tiffany), Nattakan Puttarak", "title": "Network Localization on Unit Disk Graphs", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of cooperative localization of a large network of nodes\nin integer-coordinated unit disk graphs, a simplified but useful version of\ngeneral random graph. Exploiting the property that the radius $r$ sets clear\ncut on the connectivity of two nodes, we propose an essential philosophy that\n\"no connectivity is also useful information just like the information being\nconnected\" in unit disk graphs. Exercising this philosophy, we show that the\nconventional network localization problem can be re-formulated to significantly\nreduce the search space, and that global rigidity, a necessary and sufficient\ncondition for the existence of unique solution in general graphs, is no longer\nnecessary. While the problem is still NP-hard, we show that a (depth-first)\ntree-search algorithm with memory O(N) ($N$ is the network size) can be\ndeveloped, and for practical setups, the search complexity and speed is very\nmanageable, and is magnitudes less than the conventional problem, especially\nwhen the graph is sparse or when only very limited anchor nodes are available.\n", "versions": [{"version": "v1", "created": "Thu, 4 Aug 2011 01:22:53 GMT"}], "update_date": "2011-08-05", "authors_parsed": [["Kaewprapha", "Phisan", "", "Tiffany"], ["Li", "Jing", "", "Tiffany"], ["Puttarak", "Nattakan", ""]]}, {"id": "1108.1321", "submitter": "Vijay Bhaskar Semwal", "authors": "Vijay Bhaskar Semwal, K Susheel Kumar, Vinay S Bhaskar and Meenakshi\n  Sati", "title": "Accurate location estimation of moving object with energy constraint &\n  adaptive update algorithms to save data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In research paper \"Accurate estimation of the target location of object with\nenergy constraint & Adaptive Update Algorithms to Save Data\" one of the central\nissues in sensor networks is track the location, of moving object which have\noverhead of saving data, an accurate estimation of the target location of\nobject with energy constraint .We do not have any mechanism which control and\nmaintain data .The wireless communication bandwidth is also very limited. Some\nfield which is using this technique are flood and typhoon detection, forest\nfire detection, temperature and humidity and ones we have these information use\nthese information back to a central air conditioning and ventilation system. In\nthis research paper, we propose protocol based on the prediction and adaptive\nbased algorithm which is using less sensor node reduced by an accurate\nestimation of the target location. we are using minimum three sensor node to\nget the accurate position .We can extend it upto four or five to find more\naccurate location but we have energy constraint so we are using three with\naccurate estimation of location help us to reduce sensor node..We show that our\ntracking method performs well in terms of energy saving regardless of mobility\npattern of the mobile target .We extends the life time of network with less\nsensor node. Once a new object is detected, a mobile agent will be initiated to\ntrack the roaming path of the object. The agent is mobile since it will choose\nthe sensor closest to the object to stay. The agent may invite some nearby\nslave sensors to cooperatively position the object and inhibit other irrelevant\n(i.e., farther) sensors from tracking the object. As a result, the\ncommunication and sensing overheads are greatly reduced.\n", "versions": [{"version": "v1", "created": "Fri, 5 Aug 2011 12:56:43 GMT"}], "update_date": "2011-08-08", "authors_parsed": [["Semwal", "Vijay Bhaskar", ""], ["Kumar", "K Susheel", ""], ["Bhaskar", "Vinay S", ""], ["Sati", "Meenakshi", ""]]}, {"id": "1108.1462", "submitter": "Nibedita  Adhikari", "authors": "Chitta Ranjan Tripathy and Nibedita Adhikari", "title": "On a New Multicomputer Interconnection Topology for Massively Parallel\n  Systems", "comments": "16 pages, 11 figures", "journal-ref": "International Journal of Distributed and Parallel Systems,Vol2,\n  No.4,July2011", "doi": "10.5121/ijdps.2011.2414", "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces a new interconnection network topology called Balanced\nVarietal Hypercube (BVH), suitable for massively parallel systems. The proposed\ntopology being a hybrid structure retains almost all the attractive properties\nof Balanced Hypercube and Varietal Hypercube. The topology, various parameters,\nrouting and broadcasting of Balanced Varietal Hypercube are presented. The\nperformance of the Balanced Varietal Hypercube is compared with other networks.\nIn terms of diameter, cost and average distance and reliability the proposed\nnetwork is found to be better than the Hypercube, Balanced Hypercube and\nVarietal Hypercube. Also it is more reliable and cost-effective than Hypercube\nand Balanced Hypercube.\n", "versions": [{"version": "v1", "created": "Sat, 6 Aug 2011 08:03:43 GMT"}], "update_date": "2011-08-09", "authors_parsed": [["Tripathy", "Chitta Ranjan", ""], ["Adhikari", "Nibedita", ""]]}, {"id": "1108.1631", "submitter": "Lars Kolb", "authors": "Lars Kolb, Andreas Thor, Erhard Rahm", "title": "Load Balancing for MapReduce-based Entity Resolution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The effectiveness and scalability of MapReduce-based implementations of\ncomplex data-intensive tasks depend on an even redistribution of data between\nmap and reduce tasks. In the presence of skewed data, sophisticated\nredistribution approaches thus become necessary to achieve load balancing among\nall reduce tasks to be executed in parallel. For the complex problem of entity\nresolution, we propose and evaluate two approaches for such skew handling and\nload balancing. The approaches support blocking techniques to reduce the search\nspace of entity resolution, utilize a preprocessing MapReduce job to analyze\nthe data distribution, and distribute the entities of large blocks among\nmultiple reduce tasks. The evaluation on a real cloud infrastructure shows the\nvalue and effectiveness of the proposed load balancing approaches.\n", "versions": [{"version": "v1", "created": "Mon, 8 Aug 2011 08:48:57 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Kolb", "Lars", ""], ["Thor", "Andreas", ""], ["Rahm", "Erhard", ""]]}, {"id": "1108.1865", "submitter": "EPTCS", "authors": "Marco Bernardo (Dipartimento di Scienze di Base e Fondamenti --\n  Universita' di Urbino -- Italy), Rocco De Nicola (IMT -- Institute for\n  Advanced Studies Lucca -- Italy and Dipartimento di Sistemi e Informatica --\n  Universita' di Firenze -- Italy), Michele Loreti (Dipartimento di Sistemi e\n  Informatica -- Universita' di Firenze -- Italy)", "title": "Uniform Labeled Transition Systems for Nondeterministic, Probabilistic,\n  and Stochastic Process Calculi", "comments": "In Proceedings PACO 2011, arXiv:1108.1452", "journal-ref": "EPTCS 60, 2011, pp. 66-75", "doi": "10.4204/EPTCS.60.5", "report-no": null, "categories": "cs.DC cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Labeled transition systems are typically used to represent the behavior of\nnondeterministic processes, with labeled transitions defining a one-step state\nto-state reachability relation. This model has been recently made more general\nby modifying the transition relation in such a way that it associates with any\nsource state and transition label a reachability distribution, i.e., a function\nmapping each possible target state to a value of some domain that expresses the\ndegree of one-step reachability of that target state. In this extended\nabstract, we show how the resulting model, called ULTraS from Uniform Labeled\nTransition System, can be naturally used to give semantics to a fully\nnondeterministic, a fully probabilistic, and a fully stochastic variant of a\nCSP-like process language.\n", "versions": [{"version": "v1", "created": "Tue, 9 Aug 2011 06:38:45 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Bernardo", "Marco", "", "Dipartimento di Scienze di Base e Fondamenti --\n  Universita' di Urbino -- Italy"], ["De Nicola", "Rocco", "", "IMT -- Institute for\n  Advanced Studies Lucca -- Italy and Dipartimento di Sistemi e Informatica --\n  Universita' di Firenze -- Italy"], ["Loreti", "Michele", "", "Dipartimento di Sistemi e\n  Informatica -- Universita' di Firenze -- Italy"]]}, {"id": "1108.1926", "submitter": "Bernhard Haeupler", "authors": "Alejandro Cornejo, Bernhard Haeupler, Fabian Kuhn", "title": "Computing a Maximal Independent Set Using Beeps", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of finding a maximal independent set (MIS) in the\ndiscrete beeping model. At each time, a node in the network can either beep\n(i.e., emit a signal) or be silent. Silent nodes can only differentiate between\nno neighbor beeping, or at least one neighbor beeping. This basic communication\nmodel relies only on carrier-sensing. Furthermore, we assume nothing about the\nunderlying communication graph and allow nodes to wake up (and crash)\narbitrarily.\n  We show that if a polynomial upper bound on the size of the network n is\nknown, then with high probability every node becomes stable in O(\\log^3 n) time\nafter it is woken up. To contrast this, we establish a polynomial lower bound\nwhen no a priori upper bound on the network size is known. This holds even in\nthe much stronger model of local message broadcast with collision detection.\n  Finally, if we assume nodes have access to synchronized clocks or we consider\na somewhat restricted wake up, we can solve the MIS problem in O(\\log^2 n) time\nwithout requiring an upper bound on the size of the network, thereby achieving\nthe same bit complexity as Luby's MIS algorithm.\n", "versions": [{"version": "v1", "created": "Tue, 9 Aug 2011 13:42:00 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Cornejo", "Alejandro", ""], ["Haeupler", "Bernhard", ""], ["Kuhn", "Fabian", ""]]}, {"id": "1108.1928", "submitter": "Yongquan Fu", "authors": "Yongquan Fu, Yijie Wang, Ernst Biersack", "title": "HybridNN: Supporting Network Location Service on Generalized Delay\n  Metrics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed Nearest Neighbor Search (DNNS) locates service nodes that have\nshortest interactive delay towards requesting hosts. DNNS provides an important\nservice for large-scale latency sensitive networked applications, such as VoIP,\nonline network games, or interactive network services on the cloud. Existing\nwork assumes the delay to be symmetric, which does not generalize to\napplications that are sensitive to one-way delays, such as the multimedia video\ndelivery from the servers to the hosts. We propose a relaxed inframetric model\nfor the network delay space that does not assume the triangle inequality and\ndelay symmetry to hold. We prove that the DNNS requests can be completed\nefficiently if the delay space exhibits modest inframetric dimensions, which we\ncan observe empirically. Finally, we propose a DNNS method named HybridNN\n(\\textit{Hybrid} \\textit{N}earest \\textit{N}eighbor search) based on the\ninframetric model for fast and accurate DNNS. For DNNS requests, HybridNN\nchooses closest neighbors accurately via the inframetric modelling, and\nscalably by combining delay predictions with direct probes to a pruned set of\nneighbors. Simulation results show that HybridNN locates nearly optimally the\nnearest neighbor. Experiments on PlanetLab show that HybridNN can provide\naccurate nearest neighbors that are close to optimal with modest query overhead\nand maintenance traffic.\n", "versions": [{"version": "v1", "created": "Tue, 9 Aug 2011 13:57:18 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Fu", "Yongquan", ""], ["Wang", "Yijie", ""], ["Biersack", "Ernst", ""]]}, {"id": "1108.2580", "submitter": "Danny Bickson", "authors": "Yao Wu, Qiang Yan, Danny Bickson, Yucheng Low, Qing Yang", "title": "Efficient Multicore Collaborative Filtering", "comments": "In ACM KDD CUP Workshop 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes the solution method taken by LeBuSiShu team for track1\nin ACM KDD CUP 2011 contest (resulting in the 5th place). We identified two\nmain challenges: the unique item taxonomy characteristics as well as the large\ndata set size.To handle the item taxonomy, we present a novel method called\nMatrix Factorization Item Taxonomy Regularization (MFITR). MFITR obtained the\n2nd best prediction result out of more then ten implemented algorithms. For\nrapidly computing multiple solutions of various algorithms, we have implemented\nan open source parallel collaborative filtering library on top of the GraphLab\nmachine learning framework. We report some preliminary performance results\nobtained using the BlackLight supercomputer.\n", "versions": [{"version": "v1", "created": "Fri, 12 Aug 2011 07:22:08 GMT"}, {"version": "v2", "created": "Wed, 17 Aug 2011 11:14:42 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Wu", "Yao", ""], ["Yan", "Qiang", ""], ["Bickson", "Danny", ""], ["Low", "Yucheng", ""], ["Yang", "Qing", ""]]}, {"id": "1108.3134", "submitter": "Eric J. Korpela", "authors": "Eric J. Korpela (1), David P. Anderson (1), Robert Bankay (1), Jeff\n  Cobb (1), Andrew Howard (1), Matt Lebofsky (1), Andrew P.V. Siemion (1),\n  Joshua von Korff (2), and Dan Werthimer (1) ((1) University of California,\n  Berkeley (2) Kansas State University)", "title": "Status of the UC-Berkeley SETI Efforts", "comments": "8 pages, including 1 figure. Presented at SPIE Conf. 8152, San Diego,\n  CA, Aug 25, 2011", "journal-ref": "Instruments, Methods, and Missions for Astrobiology XIV, Proc.\n  SPIE 8152, pp. 815212--1--815212--8, 2011", "doi": "10.1117/12.894066", "report-no": null, "categories": "astro-ph.IM cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We summarize radio and optical SETI programs based at the University of\nCalifornia, Berkeley. The SEVENDIP optical pulse search looks for ns time scale\npulses at visible wavelengths using an automated 30 inch telescope. The ongoing\nSERENDIP V.v sky survey searches for radio signals at the 300 meter Arecibo\nObservatory. The currently installed configuration supports 128 million\nchannels over a 200 MHz bandwidth with ~1.6 Hz spectral resolution. SETI@home\nuses the desktop computers of volunteers to analyze over 160 TB of data at\ntaken at Arecibo looking for two types of continuous wave signals and two types\nof pulsed signals. A version to be released this summer adds autocorrelation\nanalysis to look for complex wave forms that have been repeated (and overlayed)\nafter a short delay. SETI@home will soon be processing data of Kepler exoplanet\nsystems collected at the GBT. The Astropulse project is the first SETI search\nfor $\\mu$s time scale dispersed pulses in the radio spectrum. We recently\nreobserved 114 sky locations where microsecond pulses were detected. This data\nis in process of being transferred to Berkeley for analysis.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 01:31:30 GMT"}, {"version": "v2", "created": "Wed, 7 Sep 2011 00:52:44 GMT"}], "update_date": "2011-11-30", "authors_parsed": [["Korpela", "Eric J.", ""], ["Anderson", "David P.", ""], ["Bankay", "Robert", ""], ["Cobb", "Jeff", ""], ["Howard", "Andrew", ""], ["Lebofsky", "Matt", ""], ["Siemion", "Andrew P. V.", ""], ["von Korff", "Joshua", ""], ["Werthimer", "Dan", ""]]}, {"id": "1108.3223", "submitter": "Guodong Shi", "authors": "Guodong Shi and Karl Henrik Johansson", "title": "Randomized Optimal Consensus of Multi-agent Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.CG cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we formulate and solve a randomized optimal consensus problem\nfor multi-agent systems with stochastically time-varying interconnection\ntopology. The considered multi-agent system with a simple randomized iterating\nrule achieves an almost sure consensus meanwhile solving the optimization\nproblem $\\min_{z\\in \\mathds{R}^d}\\ \\sum_{i=1}^n f_i(z),$ in which the optimal\nsolution set of objective function $f_i$ can only be observed by agent $i$\nitself. At each time step, simply determined by a Bernoulli trial, each agent\nindependently and randomly chooses either taking an average among its neighbor\nset, or projecting onto the optimal solution set of its own optimization\ncomponent. Both directed and bidirectional communication graphs are studied.\nConnectivity conditions are proposed to guarantee an optimal consensus almost\nsurely with proper convexity and intersection assumptions. The convergence\nanalysis is carried out using convex analysis. We compare the randomized\nalgorithm with the deterministic one via a numerical example. The results\nillustrate that a group of autonomous agents can reach an optimal opinion by\neach node simply making a randomized trade-off between following its neighbors\nor sticking to its own opinion at each time step.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 12:33:07 GMT"}, {"version": "v2", "created": "Sun, 18 Mar 2012 18:08:46 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Shi", "Guodong", ""], ["Johansson", "Karl Henrik", ""]]}, {"id": "1108.3226", "submitter": "Guodong Shi", "authors": "Guodong Shi and Karl Henrik Johansson", "title": "Multi-agent Robust Consensus: Convergence Analysis and Application", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper investigates consensus problem for continuous-time multi-agent\nsystems with time-varying communication graphs subject to process noises.\nBorrowing the ideas from input-to-state stability (ISS) and integral\ninput-to-state stability (iISS), robust consensus and integral robust consensus\nare defined with respect to $L_\\infty$ and $L_1$ norms of the disturbance\nfunctions, respectively. Sufficient and/or necessary connectivity conditions\nare obtained for the system to reach robust consensus or integral robust\nconsensus, which answer the question: how much communication capacity is\nrequired for a multi-agent network to converge despite certain amount of\ndisturbance. The $\\epsilon$-convergence time is then obtained for the network\nas a special case of the robustness analysis. The results are based on quite\ngeneral assumptions on switching graph, weights rule and noise regularity. In\naddition, as an illustration of the applicability of the results, distributed\nevent-triggered coordination is studied.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 12:40:11 GMT"}, {"version": "v2", "created": "Tue, 28 Feb 2012 14:34:17 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Shi", "Guodong", ""], ["Johansson", "Karl Henrik", ""]]}, {"id": "1108.3268", "submitter": "Al-Sakib Khan Pathan", "authors": "Abdelgadir Tageldin Abdelgadir, Al-Sakib Khan Pathan, Mohiuddin Ahmed", "title": "On the Performance of MPI-OpenMP on a 12 nodes Multi-core Cluster", "comments": "11 pages, to appear in ICA3PP'11 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the increasing number of Quad-Core-based clusters and the introduction\nof compute nodes designed with large memory capacity shared by multiple cores,\nnew problems related to scalability arise. In this paper, we analyze the\noverall performance of a cluster built with nodes having a dual Quad-Core\nProcessor on each node. Some benchmark results are presented and some\nobservations are mentioned when handling such processors on a benchmark test. A\nQuad-Core-based cluster's complexity arises from the fact that both local\ncommunication and network communications between the running processes need to\nbe addressed. The potentials of an MPI-OpenMP approach are pinpointed because\nof its reduced communication overhead. At the end, we come to a conclusion that\nan MPI-OpenMP solution should be considered in such clusters since optimizing\nnetwork communications between nodes is as important as optimizing local\ncommunications between processors in a multi-core cluster.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 15:26:44 GMT"}], "update_date": "2011-08-17", "authors_parsed": [["Abdelgadir", "Abdelgadir Tageldin", ""], ["Pathan", "Al-Sakib Khan", ""], ["Ahmed", "Mohiuddin", ""]]}, {"id": "1108.3418", "submitter": "Bogdan Aman", "authors": "Gabriel Ciobanu", "title": "Biologically Inspired Process Calculi, Petri Nets and Membrane Computing", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/01", "categories": "cs.DC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume represents the proceedings of the 5th Workshop on Membrane\nComputing and Biologically Inspired Process Calculi (MeCBIC 2011), held\ntogether with the 12th International Conference on Membrane Computing on 23rd\nAugust 2011 in Fontainebleau, France.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 08:19:56 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Ciobanu", "Gabriel", ""]]}, {"id": "1108.3419", "submitter": "Bogdan Aman", "authors": "Luca Cardelli and Cosimo Laneve", "title": "Reversibility in Massive Concurrent Systems", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/02", "categories": "cs.DC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reversing a (forward) computation history means undoing the history. In\nconcurrent systems, undoing the history is not performed in a deterministic way\nbut in a causally consistent fashion, where states that are reached during a\nbackward computation are states that could have been reached during the\ncomputation history by just performing independent actions in a different\norder.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 08:25:21 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Cardelli", "Luca", ""], ["Laneve", "Cosimo", ""]]}, {"id": "1108.3422", "submitter": "Bogdan Aman", "authors": "Jetty Kleijn, Maciej Koutny, Grzegorz Rozenberg", "title": "Petri Nets and Bio-Modelling - and how to benefit from their synergy", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/03", "categories": "cs.DC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this talk we are concerned with the intrinsic similarities and differences\nbetween Petri nets on the one hand, and membrane systems and reaction systems\non the other hand.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 08:30:03 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Kleijn", "Jetty", ""], ["Koutny", "Maciej", ""], ["Rozenberg", "Grzegorz", ""]]}, {"id": "1108.3430", "submitter": "Bogdan Aman", "authors": "Florentin Ipate, Radu Nicolescu, Ionut-Mihai Niculescu, Cristian\n  Stefan", "title": "Synchronization of P Systems with Simplex Channels", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/07", "categories": "cs.DC cs.ET cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We solve the Firing Squad Synchronization Problem (FSSP), for P systems based\non digraphs with simplex channels, where communication is restricted by the\ndirection of structural arcs. Previous work on FSSP for P systems focused\nexclusively on P systems with duplex channels, where communication between\nparents and children is bidirectional. Our P solution, the first for simplex\nchannels, requires cell IDs, strongly connected digraphs and some awareness of\nthe local topology (such as each cell's outdegree)---we argue that these\nrequirements are necessary. Compared to the known solutions for cellular\nautomata, our solution is substantially simpler and faster.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 09:12:43 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Ipate", "Florentin", ""], ["Nicolescu", "Radu", ""], ["Niculescu", "Ionut-Mihai", ""], ["Stefan", "Cristian", ""]]}, {"id": "1108.3431", "submitter": "Bogdan Aman", "authors": "Rama Raghavan, H. Ramesh, Marian Gheorghe, Shankara Narayanan Krishna", "title": "Further Results on Languages of Membrane Structures", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/08", "categories": "cs.DC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  P systems with active membranes were used to generate languages, in the sense\nof languages associated with the structure of membrane systems. Here, we\nanalyze the power of P systems with membrane creation and dissolution\nrestricted to elementary membranes, P systems without membrane dissolution\noperating according to certain output modes. This leads us to characterizations\nof recursively enumerable languages.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 09:15:32 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Raghavan", "Rama", ""], ["Ramesh", "H.", ""], ["Gheorghe", "Marian", ""], ["Krishna", "Shankara Narayanan", ""]]}, {"id": "1108.3432", "submitter": "Bogdan Aman", "authors": "Antoine Spicher, Sergey Verlan", "title": "Generalized Communicating P Systems Working in Fair Sequential Model", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/09", "categories": "cs.DC cs.ET cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we consider a new derivation mode for generalized\ncommunicating P systems (GCPS) corresponding to the functioning of population\nprotocols (PP) and based on the sequential derivation mode and a fairness\ncondition. We show that PP can be seen as a particular variant of GCPS. We also\nconsider a particular stochastic evolution satisfying the fairness condition\nand obtain that it corresponds to the run of a Gillespie's SSA. This permits to\nfurther describe the dynamics of GCPS by a system of ODEs when the population\nsize goes to the infinity.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 09:21:31 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Spicher", "Antoine", ""], ["Verlan", "Sergey", ""]]}, {"id": "1108.3433", "submitter": "Bogdan Aman", "authors": "L. Jason Steggles", "title": "Abstracting Asynchronous Multi-Valued Networks: An Initial Investigation", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/10", "categories": "cs.DC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-valued networks provide a simple yet expressive qualitative state based\nmodelling approach for biological systems. In this paper we develop an\nabstraction theory for asynchronous multi-valued network models that allows the\nstate space of a model to be reduced while preserving key properties of the\nmodel. The abstraction theory therefore provides a mechanism for coping with\nthe state space explosion problem and supports the analysis and comparison of\nmulti-valued networks. We take as our starting point the abstraction theory for\nsynchronous multi-valued networks which is based on the finite set of traces\nthat represent the behaviour of such a model. The problem with extending this\napproach to the asynchronous case is that we can now have an infinite set of\ntraces associated with a model making a simple trace inclusion test infeasible.\nTo address this we develop a decision procedure for checking asynchronous\nabstractions based on using the finite state graph of an asynchronous\nmulti-valued network to reason about its trace semantics. We illustrate the\nabstraction techniques developed by considering a detailed case study based on\na multi-valued network model of the regulation of tryptophan biosynthesis in\nEscherichia coli.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 09:26:59 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Steggles", "L. Jason", ""]]}, {"id": "1108.3558", "submitter": "Bogdan Aman", "authors": "Gabriel Ciobanu", "title": "Proceedings of the 5th Workshop on Membrane Computing and Biologically\n  Inspired Process Calculi (MeCBIC 2011)", "comments": "Papers presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CE cs.ET cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume represents the proceedings of the 5th Workshop on Membrane\nComputing and Biologically Inspired Process Calculi (MeCBIC 2011), held\ntogether with the 12th International Conference on Membrane Computing on 23rd\nAugust 2011 in Fontainebleau, France.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 19:41:29 GMT"}, {"version": "v2", "created": "Thu, 18 Aug 2011 08:29:07 GMT"}], "update_date": "2011-08-19", "authors_parsed": [["Ciobanu", "Gabriel", ""]]}, {"id": "1108.4466", "submitter": "EPTCS", "authors": "Flavio Corradini (University of Camerino), Maria Rita Di Berardini\n  (University of Camerino), Walter Vogler (University of Augsburg)", "title": "Read Operators and their Expressiveness in Process Algebras", "comments": "In Proceedings EXPRESS 2011, arXiv:1108.4077", "journal-ref": "EPTCS 64, 2011, pp. 31-43", "doi": "10.4204/EPTCS.64.3", "report-no": null, "categories": "cs.LO cs.DC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study two different ways to enhance PAFAS, a process algebra for modelling\nasynchronous timed concurrent systems, with non-blocking reading actions. We\nfirst add reading in the form of a read-action prefix operator. This operator\nis very flexible, but its somewhat complex semantics requires two types of\ntransition relations. We also present a read-set prefix operator with a simpler\nsemantics, but with syntactic restrictions. We discuss the expressiveness of\nread prefixes; in particular, we compare them to read-arcs in Petri nets and\njustify the simple semantics of the second variant by showing that its\nprocesses can be translated into processes of the first with timed-bisimilar\nbehaviour. It is still an open problem whether the first algebra is more\nexpressive than the second; we give a number of laws that are interesting in\ntheir own right, and can help to find a backward translation.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 01:23:16 GMT"}], "update_date": "2011-08-24", "authors_parsed": [["Corradini", "Flavio", "", "University of Camerino"], ["Di Berardini", "Maria Rita", "", "University of Camerino"], ["Vogler", "Walter", "", "University of Augsburg"]]}, {"id": "1108.4471", "submitter": "EPTCS", "authors": "Jens-Wolfhard Schicke (TU Braunschweig), Kirstin Peters (TU Berlin),\n  Ursula Goltz (TU Braunschweig)", "title": "Synchrony vs. Causality in Asynchronous Petri Nets", "comments": "In Proceedings EXPRESS 2011, arXiv:1108.4077", "journal-ref": "EPTCS 64, 2011, pp. 119-131", "doi": "10.4204/EPTCS.64.9", "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a synchronous system, we study the question whether the behaviour of\nthat system can be exhibited by a (non-trivially) distributed and hence\nasynchronous implementation. In this paper we show, by counterexample, that\nsynchronous systems cannot in general be implemented in an asynchronous fashion\nwithout either introducing an infinite implementation or changing the causal\nstructure of the system behaviour.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 01:24:08 GMT"}], "update_date": "2011-08-24", "authors_parsed": [["Schicke", "Jens-Wolfhard", "", "TU Braunschweig"], ["Peters", "Kirstin", "", "TU Berlin"], ["Goltz", "Ursula", "", "TU Braunschweig"]]}, {"id": "1108.5095", "submitter": "Marcin Kik", "authors": "Marcin Kik", "title": "RBO Protocol: Broadcasting Huge Databases for Tiny Receivers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DB cs.DC cs.DM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a protocol (called RBO) for broadcasting long streams of\nsingle-packet messages over radio channel for tiny, battery powered, receivers.\nThe messages are labeled by the keys from some linearly ordered set. The sender\nrepeatedly broadcasts a sequence of many (possibly millions) of messages, while\neach receiver is interested in reception of a message with a specified key\nwithin this sequence. The transmission is arranged so that the receiver can\nwake up in arbitrary moment and find the nearest transmission of its searched\nmessage. Even if it does not know the position of the message in the sequence,\nit needs only to receive a small number of (the headers of) other messages to\nlocate it properly. Thus it can save energy by keeping the radio switched off\nmost of the time. We show that bit-reversal permutation has \"recursive\nbisection properties\" and, as a consequence, RBO can be implemented very\nefficiently with only constant number of $\\log_2 n$-bit variables, where $n$ is\nthe total number of messages in the sequence. The total number of the required\nreceptions is at most $2\\log_2 n +2$ in the model with perfect synchronization.\nThe basic procedure of RBO (computation of the time slot for the next required\nreception) requires only $O(\\log^3 n)$ bit-wise operations. We propose\nimplementation mechanisms for realistic model (with imperfect synchronization),\nfor operating systems (such as e.g. TinyOS).\n", "versions": [{"version": "v1", "created": "Thu, 25 Aug 2011 14:05:30 GMT"}], "update_date": "2011-08-26", "authors_parsed": [["Kik", "Marcin", ""]]}, {"id": "1108.5893", "submitter": "Amitabh Trehan", "authors": "Atish Das Sarma and Amitabh Trehan", "title": "Edge-preserving self-healing: keeping network backbones densely\n  connected", "comments": "Submitted to IEEE InfoComm", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Healing algorithms play a crucial part in distributed P2P networks where\nfailures occur continuously and frequently. Several self-healing algorithms\nhave been suggested recently [IPDPS'08, PODC'08, PODC'09, PODC'11] in a line of\nwork that has yielded gradual improvements in the properties ensured on the\ngraph. This work motivates a strong general phenomenon of edge-preserving\nhealing that aims at obtaining self-healing algorithms with the constraint that\nall original edges in the graph (not deleted by the adversary), be retained in\nevery intermediate graph.\n  The previous algorithms, in their nascent form, are not explicitly edge\npreserving. In this paper, we show they can be suitably modified (We introduce\nXheal+, an edge-preserving version of Xheal[PODC'11]). Towards this end, we\npresent a general self-healing model that unifies the previous models. The main\ncontribution of this paper is not in the technical complexity, rather in the\nsimplicity with which the edge-preserving property can be ensured and the\nmessage that this is a crucial property with several benefits. In particular,\nwe highlight this by showing that, almost as an immediate corollary, subgraph\ndensities are preserved or increased. Maintaining density is a notion motivated\nby the fact that in certain distributed networks, certain nodes may require and\ninitially have a larger number of inter-connections. It is vital that a healing\nalgorithm, even amidst failures, respect these requirements. Our suggested\nmodifications yield such subgraph density preservation as a by product. In\naddition, edge preservation helps maintain any subgraph induced property that\nis monotonic. Also, algorithms that are edge-preserving require minimal\nalteration of edges which can be an expensive cost in healing - something that\nhas not been modeled in any of the past work.\n", "versions": [{"version": "v1", "created": "Tue, 30 Aug 2011 09:51:39 GMT"}], "update_date": "2011-08-31", "authors_parsed": [["Sarma", "Atish Das", ""], ["Trehan", "Amitabh", ""]]}, {"id": "1108.5904", "submitter": "Shailesh Vaya", "authors": "Shailesh Vaya", "title": "Information Dissemination in Unknown Radio networks with Large Labels", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problems of deterministic broadcasting and gossiping in\ncompletely unknown ad-hoc radio networks. We assume that nothing is known to\nthe nodes about the topology or even the size of the network, $n$, except that\n$n > 1$. Protocols for vanilla model, when $n$ is known, may be run for\nincreasingly larger estimates $2^i$ on the size of the network, but one cannot\ndetermine when such a protocol should terminate. Thus, to carry this design\nparadigm, successful completion or in-completion of the process should be\ndetected, and this knowledge circulated in the network. We consider the problem\nof deterministic Acknowledged Broadcasting and Gossiping when nodes can take\npolynomially large labels.\n  For the above setting, we present the following results for strongly\nconnected networks: (a) A deterministic protocol for acknowledged broadcasting\nwhich takes $NRG(n,n^c)$ rounds, where $NRG(n,n^c)$ is the round complexity of\ndeterministic gossiping for vanilla model. (b) A deterministic protocol for\nacknowledged gossiping, which takes $O(n^2 \\lg n)$ rounds when collision\ndetection mechanism is available. The structure of the transmissions of nodes\nin the network, to enable them to infer collisions, and discover existence of\nunknown in-neighborhood as a result, is abstracted as a family of integral sets\ncalled Selecting-Colliding family. We prove the existence of\nSelecting-Colliding families using the probabilistic method and employ them to\ndesign protocol for acknowledged gossiping when no collision detection\nmechanism is available.\n  Finally, we present a deterministic protocol for acknowledged broadcasting\nfor bidirectional networks, with a round complexity of $O(n \\lg n)$ rounds.\n", "versions": [{"version": "v1", "created": "Tue, 30 Aug 2011 10:16:16 GMT"}], "update_date": "2011-08-31", "authors_parsed": [["Vaya", "Shailesh", ""]]}, {"id": "1108.6132", "submitter": "Shiqiang Wang Mr.", "authors": "Shiqiang Wang, Qingyang Song, Xingwei Wang, and Abbas Jamalipour", "title": "Distributed MAC Protocol Supporting Physical-Layer Network Coding", "comments": "Final version", "journal-ref": "IEEE Transactions on Mobile Computing, vol. 12, no. 5, pp.\n  1023-1036, May 2013", "doi": "10.1109/TMC.2012.69", "report-no": null, "categories": "cs.NI cs.DC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Physical-layer network coding (PNC) is a promising approach for wireless\nnetworks. It allows nodes to transmit simultaneously. Due to the difficulties\nof scheduling simultaneous transmissions, existing works on PNC are based on\nsimplified medium access control (MAC) protocols, which are not applicable to\ngeneral multi-hop wireless networks, to the best of our knowledge. In this\npaper, we propose a distributed MAC protocol that supports PNC in multi-hop\nwireless networks. The proposed MAC protocol is based on the carrier sense\nmultiple access (CSMA) strategy and can be regarded as an extension to the IEEE\n802.11 MAC protocol. In the proposed protocol, each node collects information\non the queue status of its neighboring nodes. When a node finds that there is\nan opportunity for some of its neighbors to perform PNC, it notifies its\ncorresponding neighboring nodes and initiates the process of packet exchange\nusing PNC, with the node itself as a relay. During the packet exchange process,\nthe relay also works as a coordinator which coordinates the transmission of\nsource nodes. Meanwhile, the proposed protocol is compatible with conventional\nnetwork coding and conventional transmission schemes. Simulation results show\nthat the proposed protocol is advantageous in various scenarios of wireless\napplications.\n", "versions": [{"version": "v1", "created": "Wed, 31 Aug 2011 06:32:57 GMT"}, {"version": "v2", "created": "Fri, 25 Nov 2011 18:04:44 GMT"}, {"version": "v3", "created": "Sat, 11 May 2013 19:13:39 GMT"}], "update_date": "2013-05-15", "authors_parsed": [["Wang", "Shiqiang", ""], ["Song", "Qingyang", ""], ["Wang", "Xingwei", ""], ["Jamalipour", "Abbas", ""]]}, {"id": "1108.6160", "submitter": "Alfredo Braunstein", "authors": "Fabrizio Altarelli and Alfredo Braunstein and Abolfazl Ramezanpour and\n  Riccardo Zecchina", "title": "Stochastic optimization by message passing", "comments": "31 pages, 8 figures", "journal-ref": "J. Stat. Mech. (2011) P11009", "doi": "10.1088/1742-5468/2011/11/P11009", "report-no": null, "categories": "cond-mat.stat-mech cs.DC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most optimization problems in applied sciences realistically involve\nuncertainty in the parameters defining the cost function, of which only\nstatistical information is known beforehand. In a recent work we introduced a\nmessage passing algorithm based on the cavity method of statistical physics to\nsolve the two-stage matching problem with independently distributed stochastic\nparameters. In this paper we provide an in-depth explanation of the general\nmethod and caveats, show the details of the derivation and resulting algorithm\nfor the matching problem and apply it to a stochastic version of the\nindependent set problem, which is a computationally hard and relevant problem\nin communication networks. We compare the results with some greedy algorithms\nand briefly discuss the extension to more complicated stochastic multi-stage\nproblems.\n", "versions": [{"version": "v1", "created": "Wed, 31 Aug 2011 08:49:21 GMT"}], "update_date": "2013-09-03", "authors_parsed": [["Altarelli", "Fabrizio", ""], ["Braunstein", "Alfredo", ""], ["Ramezanpour", "Abolfazl", ""], ["Zecchina", "Riccardo", ""]]}]