[{"id": "0910.0537", "submitter": "Victor Gluzberg", "authors": "Victor Gluzberg", "title": "A Note On Higher Order Grammar", "comments": "7 pages in single-spaced pdf format", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Both syntax-phonology and syntax-semantics interfaces in Higher Order Grammar\n(HOG) are expressed as axiomatic theories in higher-order logic (HOL), i.e. a\nlanguage is defined entirely in terms of provability in the single logical\nsystem. An important implication of this elegant architecture is that the\nmeaning of a valid expression turns out to be represented not by a single, nor\neven by a few \"discrete\" terms (in case of ambiguity), but by a \"continuous\"\nset of logically equivalent terms. The note is devoted to precise formulation\nand proof of this observation.\n", "versions": [{"version": "v1", "created": "Sat, 3 Oct 2009 12:26:47 GMT"}], "update_date": "2009-10-06", "authors_parsed": [["Gluzberg", "Victor", ""]]}, {"id": "0910.1484", "submitter": "Alain Lecomte", "authors": "Alain Lecomte (INRIA Futurs, SFLTAMP), Myriam Quatrini (IML)", "title": "Ludics and its Applications to natural Language Semantics", "comments": null, "journal-ref": "Lecture Notes in Artificial Intelligence LNAI, 5514 (2009) pp\n  242--255", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Proofs, in Ludics, have an interpretation provided by their counter-proofs,\nthat is the objects they interact with. We follow the same idea by proposing\nthat sentence meanings are given by the counter-meanings they are opposed to in\na dialectical interaction. The conception is at the intersection of a\nproof-theoretic and a game-theoretic accounts of semantics, but it enlarges\nthem by allowing to deal with possibly infinite processes.\n", "versions": [{"version": "v1", "created": "Thu, 8 Oct 2009 12:21:22 GMT"}], "update_date": "2009-10-09", "authors_parsed": [["Lecomte", "Alain", "", "INRIA Futurs, SFLTAMP"], ["Quatrini", "Myriam", "", "IML"]]}, {"id": "0910.1868", "submitter": "N Vunka Jungum", "authors": "Vishal Goyal and Gurpreet Singh Lehal", "title": "Evaluation of Hindi to Punjabi Machine Translation System", "comments": "\"International Journal of Computer Science Issues, IJCSI, Volume 4,\n  Issue 1, pp36-39, September 2009\"", "journal-ref": "V.Goyal and G. Singh Lehal, \"Evaluation of Hindi to Punjabi\n  Machine Translation System\", International Journal of Computer Science\n  Issues, IJCSI, Volume 4, Issue 1, pp36-39, September 2009", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine Translation in India is relatively young. The earliest efforts date\nfrom the late 80s and early 90s. The success of every system is judged from its\nevaluation experimental results. Number of machine translation systems has been\nstarted for development but to the best of author knowledge, no high quality\nsystem has been completed which can be used in real applications. Recently,\nPunjabi University, Patiala, India has developed Punjabi to Hindi Machine\ntranslation system with high accuracy of about 92%. Both the systems i.e.\nsystem under question and developed system are between same closely related\nlanguages. Thus, this paper presents the evaluation results of Hindi to Punjabi\nmachine translation system. It makes sense to use same evaluation criteria as\nthat of Punjabi to Hindi Punjabi Machine Translation System. After evaluation,\nthe accuracy of the system is found to be about 95%.\n", "versions": [{"version": "v1", "created": "Fri, 9 Oct 2009 21:40:26 GMT"}], "update_date": "2009-10-13", "authors_parsed": [["Goyal", "Vishal", ""], ["Lehal", "Gurpreet Singh", ""]]}, {"id": "0910.5410", "submitter": "David Fernandez-Amoros", "authors": "David Fernandez-Amoros, Julio Gonzalo, Felisa Verdejo", "title": "The Uned systems at Senseval-2", "comments": "latex2e, 5 pages, appeared in SENSEVAL-2, held with ACL-02", "journal-ref": "In Proceedings of the Second International Workshop on Evaluating\n  Word Sense Disambiguation Systems (SENSEVAL), Toulouse 2002", "doi": null, "report-no": null, "categories": "cs.CL cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have participated in the SENSEVAL-2 English tasks (all words and lexical\nsample) with an unsupervised system based on mutual information measured over a\nlarge corpus (277 million words) and some additional heuristics. A supervised\nextension of the system was also presented to the lexical sample task.\n  Our system scored first among unsupervised systems in both tasks: 56.9%\nrecall in all words, 40.2% in lexical sample. This is slightly worse than the\nfirst sense heuristic for all words and 3.6% better for the lexical sample, a\nstrong indication that unsupervised Word Sense Disambiguation remains being a\nstrong challenge.\n", "versions": [{"version": "v1", "created": "Wed, 28 Oct 2009 16:58:27 GMT"}], "update_date": "2009-10-29", "authors_parsed": [["Fernandez-Amoros", "David", ""], ["Gonzalo", "Julio", ""], ["Verdejo", "Felisa", ""]]}, {"id": "0910.5419", "submitter": "David Fernandez-Amoros", "authors": "David Fernandez-Amoros", "title": "Word Sense Disambiguation Based on Mutual Information and Syntactic\n  Patterns", "comments": "latex2e, 5 pages, appeared in SENSEVAL-3, Barcelona 2004", "journal-ref": "In proceedings of the Third International Workshop on Evaluating\n  Word Sense Disambiguation Systems (SENSEVAL) 2004, Barcelona", "doi": null, "report-no": null, "categories": "cs.CL cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes a hybrid system for WSD, presented to the English\nall-words and lexical-sample tasks, that relies on two different unsupervised\napproaches. The first one selects the senses according to mutual information\nproximity between a context word a variant of the sense. The second heuristic\nanalyzes the examples of use in the glosses of the senses so that simple\nsyntactic patterns are inferred. This patterns are matched against the\ndisambiguation contexts. We show that the first heuristic obtains a precision\nand recall of .58 and .35 respectively in the all words task while the second\nobtains .80 and .25. The high precision obtained recommends deeper research of\nthe techniques. Results for the lexical sample task are also provided.\n", "versions": [{"version": "v1", "created": "Wed, 28 Oct 2009 17:03:00 GMT"}], "update_date": "2009-10-29", "authors_parsed": [["Fernandez-Amoros", "David", ""]]}, {"id": "0910.5682", "submitter": "David Fernandez-Amoros", "authors": "David Fernandez-Amoros", "title": "Word Sense Disambiguation Using English-Spanish Aligned Phrases over\n  Comparable Corpora", "comments": "latex2e, 8 pages, 1 figure, published in the Proceedings of\n  Cross-Language Knowledge Induction Workshop, 2005 Cluj-Napoca, held during\n  the summer school EUROLAN 2005", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we describe a WSD experiment based on bilingual English-Spanish\ncomparable corpora in which individual noun phrases have been identified and\naligned with their respective counterparts in the other language. The\nevaluation of the experiment has been carried out against SemCor.\n  We show that, with the alignment algorithm employed, potential precision is\nhigh (74.3%), however the coverage of the method is low (2.7%), due to\nalignments being far less frequent than we expected.\n  Contrary to our intuition, precision does not rise consistently with the\nnumber of alignments. The coverage is low due to several factors; there are\nimportant domain differences, and English and Spanish are too close languages\nfor this approach to be able to discriminate efficiently between senses,\nrendering it unsuitable for WSD, although the method may prove more productive\nin machine translation.\n", "versions": [{"version": "v1", "created": "Thu, 29 Oct 2009 17:19:01 GMT"}], "update_date": "2009-10-30", "authors_parsed": [["Fernandez-Amoros", "David", ""]]}]