[{"id": "1012.0011", "submitter": "Deli  Qiao", "authors": "Deli Qiao, Mustafa Cenk Gursoy, and Senem Velipasalar", "title": "Secure Wireless Communication and Optimal Power Control under\n  Statistical Queueing Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, secure transmission of information over fading broadcast\nchannels is studied in the presence of statistical queueing constraints.\nEffective capacity is employed as a performance metric to identify the secure\nthroughput of the system, i.e., effective secure throughput. It is assumed that\nperfect channel side information (CSI) is available at both the transmitter and\nthe receivers. Initially, the scenario in which the transmitter sends common\nmessages to two receivers and confidential messages to one receiver is\nconsidered. For this case, effective secure throughput region, which is the\nregion of constant arrival rates of common and confidential messages that can\nbe supported by the buffer-constrained transmitter and fading broadcast\nchannel, is defined. It is proven that this effective throughput region is\nconvex. Then, the optimal power control policies that achieve the boundary\npoints of the effective secure throughput region are investigated and an\nalgorithm for the numerical computation of the optimal power adaptation schemes\nis provided. Subsequently, the special case in which the transmitter sends only\nconfidential messages to one receiver, is addressed in more detail. For this\ncase, effective secure throughput is formulated and two different power\nadaptation policies are studied. In particular, it is noted that opportunistic\ntransmission is no longer optimal under buffer constraints and the transmitter\nshould not wait to send the data at a high rate until the main channel is much\nbetter than the eavesdropper channel.\n", "versions": [{"version": "v1", "created": "Tue, 30 Nov 2010 21:05:18 GMT"}], "update_date": "2010-12-02", "authors_parsed": [["Qiao", "Deli", ""], ["Gursoy", "Mustafa Cenk", ""], ["Velipasalar", "Senem", ""]]}, {"id": "1012.0018", "submitter": "Jan Ostergaard", "authors": "Jan Ostergaard, Richard Heusdens, and Jesper Jensen", "title": "n-Channel Asymmetric Entropy-Constrained Multiple-Description Lattice\n  Vector Quantization", "comments": "49 pages, 4 figures. Accepted for publication in IEEE Transactions on\n  Information Theory, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is about the design and analysis of an index-assignment (IA) based\nmultiple-description coding scheme for the n-channel asymmetric case. We use\nentropy constrained lattice vector quantization and restrict attention to\nsimple reconstruction functions, which are given by the inverse IA function\nwhen all descriptions are received or otherwise by a weighted average of the\nreceived descriptions. We consider smooth sources with finite differential\nentropy rate and MSE fidelity criterion. As in previous designs, our\nconstruction is based on nested lattices which are combined through a single IA\nfunction. The results are exact under high-resolution conditions and\nasymptotically as the nesting ratios of the lattices approach infinity. For any\nn, the design is asymptotically optimal within the class of IA-based schemes.\nMoreover, in the case of two descriptions and finite lattice vector dimensions\ngreater than one, the performance is strictly better than that of existing\ndesigns. In the case of three descriptions, we show that in the limit of large\nlattice vector dimensions, points on the inner bound of Pradhan et al. can be\nachieved. Furthermore, for three descriptions and finite lattice vector\ndimensions, we show that the IA-based approach yields, in the symmetric case, a\nsmaller rate loss than the recently proposed source-splitting approach.\n", "versions": [{"version": "v1", "created": "Tue, 30 Nov 2010 21:17:26 GMT"}], "update_date": "2010-12-02", "authors_parsed": [["Ostergaard", "Jan", ""], ["Heusdens", "Richard", ""], ["Jensen", "Jesper", ""]]}, {"id": "1012.0065", "submitter": "Pascal Vontobel", "authors": "Pascal O. Vontobel", "title": "Counting in Graph Covers: A Combinatorial Characterization of the Bethe\n  Entropy Function", "comments": "Submitted to IEEE Trans. Inf. Theory, Nov. 20, 2010; rev. Sep. 22,\n  2012; current version, Oct. 9, 2012. Main changes from v1 to v2: new example\n  (Example 34), new lemma (Lemma 35), changed some notation, changed the domain\n  of the Gibbs free energy function and related functions, reordered some\n  sections/appendices, fixed some typos, improved the background discussion,\n  added some new references", "journal-ref": "IEEE Trans. Inf. Theory, vol. 59, pp. 6018-6048, Sept. 2013", "doi": "10.1109/TIT.2013.2264715", "report-no": null, "categories": "cs.IT cond-mat.stat-mech cs.AI math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a combinatorial characterization of the Bethe entropy function of\na factor graph, such a characterization being in contrast to the original,\nanalytical, definition of this function. We achieve this combinatorial\ncharacterization by counting valid configurations in finite graph covers of the\nfactor graph. Analogously, we give a combinatorial characterization of the\nBethe partition function, whose original definition was also of an analytical\nnature. As we point out, our approach has similarities to the replica method,\nbut also stark differences. The above findings are a natural backdrop for\nintroducing a decoder for graph-based codes that we will call symbolwise\ngraph-cover decoding, a decoder that extends our earlier work on blockwise\ngraph-cover decoding. Both graph-cover decoders are theoretical tools that help\ntowards a better understanding of message-passing iterative decoding, namely\nblockwise graph-cover decoding links max-product (min-sum) algorithm decoding\nwith linear programming decoding, and symbolwise graph-cover decoding links\nsum-product algorithm decoding with Bethe free energy function minimization at\ntemperature one. In contrast to the Gibbs entropy function, which is a concave\nfunction, the Bethe entropy function is in general not concave everywhere. In\nparticular, we show that every code picked from an ensemble of regular\nlow-density parity-check codes with minimum Hamming distance growing (with high\nprobability) linearly with the block length has a Bethe entropy function that\nis convex in certain regions of its domain.\n", "versions": [{"version": "v1", "created": "Wed, 1 Dec 2010 00:00:05 GMT"}, {"version": "v2", "created": "Tue, 9 Oct 2012 23:44:16 GMT"}], "update_date": "2013-11-05", "authors_parsed": [["Vontobel", "Pascal O.", ""]]}, {"id": "1012.0081", "submitter": "Andrew Eckford", "authors": "K. V. Srinivas, Raviraj S. Adve, Andrew W. Eckford", "title": "Molecular communication in fluid media: The additive inverse Gaussian\n  noise channel", "comments": "28 pages, 8 figures. Submitted to IEEE Transactions on Information\n  Theory. Corrects minor typos in the first version", "journal-ref": null, "doi": "10.1109/TIT.2012.2193554", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider molecular communication, with information conveyed in the time of\nrelease of molecules. The main contribution of this paper is the development of\na theoretical foundation for such a communication system. Specifically, we\ndevelop the additive inverse Gaussian (IG) noise channel model: a channel in\nwhich the information is corrupted by noise with an inverse Gaussian\ndistribution. We show that such a channel model is appropriate for molecular\ncommunication in fluid media - when propagation between transmitter and\nreceiver is governed by Brownian motion and when there is positive drift from\ntransmitter to receiver. Taking advantage of the available literature on the IG\ndistribution, upper and lower bounds on channel capacity are developed, and a\nmaximum likelihood receiver is derived. Theory and simulation results are\npresented which show that such a channel does not have a single quality measure\nanalogous to signal-to-noise ratio in the AWGN channel. It is also shown that\nthe use of multiple molecules leads to reduced error rate in a manner akin to\ndiversity order in wireless communications. Finally, we discuss some open\nproblems in molecular communications that arise from the IG system model.\n", "versions": [{"version": "v1", "created": "Wed, 1 Dec 2010 02:15:39 GMT"}, {"version": "v2", "created": "Thu, 9 Dec 2010 14:40:41 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Srinivas", "K. V.", ""], ["Adve", "Raviraj S.", ""], ["Eckford", "Andrew W.", ""]]}, {"id": "1012.0112", "submitter": "Theodoros Dikaliotis", "authors": "Theodoros K. Dikaliotis, Tracey Ho, Sidharth Jaggi, Svitlana\n  Vyetrenko, Hongyi Yao, Michelle Effros, Joerg Kliewer, Elona Erez", "title": "Multiple-access Network Information-flow and Correction Codes", "comments": "This journal paper is a continuation of the conference paper written\n  by S. Vyetrenko, T. Ho, M. Effros, J. Kliewer, E Erez, \"Rate regions for\n  coherent and noncoherent multisource network error correction,\" IEEE ISIT,\n  Jun. 2009 and the conference paper written by H. Yao, T. K Dikaliotis, S.\n  Jaggi, and T. Ho, \"Multi-source operator channels: Efficient\n  capacity-achieving codes,\" IEEE ITW, Dublin 2010", "journal-ref": null, "doi": "10.1109/TIT.2010.2095130", "report-no": "10-312", "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work considers the multiple-access multicast error-correction scenario\nover a packetized network with $z$ malicious edge adversaries. The network has\nmin-cut $m$ and packets of length $\\ell$, and each sink demands all information\nfrom the set of sources $\\sources$. The capacity region is characterized for\nboth a \"side-channel\" model (where sources and sinks share some random bits\nthat are secret from the adversary) and an \"omniscient\" adversarial model\n(where no limitations on the adversary's knowledge are assumed). In the\n\"side-channel\" adversarial model, the use of a secret channel allows higher\nrates to be achieved compared to the \"omniscient\" adversarial model, and a\npolynomial-complexity capacity-achieving code is provided. For the \"omniscient\"\nadversarial model, two capacity-achieving constructions are given: the first is\nbased on random subspace code design and has complexity exponential in $\\ell\nm$, while the second uses a novel multiple-field-extension technique and has\n$O(\\ell m^{|\\sources|})$ complexity, which is polynomial in the network size.\nOur code constructions are \"end-to-end\" in that all nodes except the sources\nand sinks are oblivious to the adversaries and may simply implement predesigned\nlinear network codes (random or otherwise). Also, the sources act independently\nwithout knowledge of the data from other sources.\n", "versions": [{"version": "v1", "created": "Wed, 1 Dec 2010 07:08:13 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Dikaliotis", "Theodoros K.", ""], ["Ho", "Tracey", ""], ["Jaggi", "Sidharth", ""], ["Vyetrenko", "Svitlana", ""], ["Yao", "Hongyi", ""], ["Effros", "Michelle", ""], ["Kliewer", "Joerg", ""], ["Erez", "Elona", ""]]}, {"id": "1012.0356", "submitter": "James P. Crutchfield", "authors": "James P. Crutchfield and Christopher J. Ellison", "title": "The Past and the Future in the Present", "comments": "7 pages, 1 figure;\n  http://cse.ucdavis.edu/~cmg/compmech/pubs/pafip.htm", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.CD cs.IT math.DS math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how the shared information between the past and future---the excess\nentropy---derives from the components of directional information stored in the\npresent---the predictive and retrodictive causal states. A detailed proof\nallows us to highlight a number of the subtle problems in estimation and\nanalysis that impede accurate calculation of the excess entropy.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 01:16:20 GMT"}], "update_date": "2010-12-03", "authors_parsed": [["Crutchfield", "James P.", ""], ["Ellison", "Christopher J.", ""]]}, {"id": "1012.0366", "submitter": "Roman Belavkin", "authors": "Roman V. Belavkin", "title": "Optimal measures and Markov transition kernels", "comments": "Replaced with a final and accepted draft; Journal of Global\n  Optimization, Springer, Jan 1, 2012", "journal-ref": null, "doi": "10.1007/s10898-012-9851-1", "report-no": null, "categories": "math.OC cs.CC cs.IT math-ph math.FA math.IT math.MP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study optimal solutions to an abstract optimization problem for measures,\nwhich is a generalization of classical variational problems in information\ntheory and statistical physics. In the classical problems, information and\nrelative entropy are defined using the Kullback-Leibler divergence, and for\nthis reason optimal measures belong to a one-parameter exponential family.\nMeasures within such a family have the property of mutual absolute continuity.\nHere we show that this property characterizes other families of optimal\npositive measures if a functional representing information has a strictly\nconvex dual. Mutual absolute continuity of optimal probability measures allows\nus to strictly separate deterministic and non-deterministic Markov transition\nkernels, which play an important role in theories of decisions, estimation,\ncontrol, communication and computation. We show that deterministic transitions\nare strictly sub-optimal, unless information resource with a strictly convex\ndual is unconstrained. For illustration, we construct an example where, unlike\nnon-deterministic, any deterministic kernel either has negatively infinite\nexpected utility (unbounded expected error) or communicates infinite\ninformation.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 02:08:15 GMT"}, {"version": "v2", "created": "Mon, 13 Dec 2010 22:53:01 GMT"}, {"version": "v3", "created": "Mon, 11 Jul 2011 15:15:14 GMT"}, {"version": "v4", "created": "Fri, 22 Jul 2011 16:42:50 GMT"}, {"version": "v5", "created": "Fri, 3 Feb 2012 03:27:13 GMT"}, {"version": "v6", "created": "Mon, 3 Sep 2012 18:01:59 GMT"}, {"version": "v7", "created": "Wed, 5 Sep 2012 14:56:52 GMT"}], "update_date": "2012-09-06", "authors_parsed": [["Belavkin", "Roman V.", ""]]}, {"id": "1012.0367", "submitter": "Emmanuel Abbe A", "authors": "Emmanuel Abbe", "title": "Universal polar coding and sparse recovery", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates universal polar coding schemes. In particular, a\nnotion of ordering (called convolutional path) is introduced between\nprobability distributions to determine when a polar compression (or\ncommunication) scheme designed for one distribution can also succeed for\nanother one. The original polar decoding algorithm is also generalized to an\nalgorithm allowing to learn information about the source distribution using the\nidea of checkers. These tools are used to construct a universal compression\nalgorithm for binary sources, operating at the lowest achievable rate\n(entropy), with low complexity and with guaranteed small error probability. In\na second part of the paper, the problem of sketching high dimensional discrete\nsignals which are sparse is approached via the polarization technique. It is\nshown that the number of measurements required for perfect recovery is\ncompetitive with the $O(k \\log (n/k))$ bound (with optimal constant for binary\nsignals), meanwhile affording a deterministic low complexity measurement\nmatrix.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 02:10:25 GMT"}], "update_date": "2010-12-03", "authors_parsed": [["Abbe", "Emmanuel", ""]]}, {"id": "1012.0375", "submitter": "Chengling Jiang", "authors": "Yan Liang, Chengling Jiang, Chunliang Yang", "title": "Dynamic Resource Coordination and Interference Management for Femtocell\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Femtocell is emerging as a key technology to secure the coverage and capacity\nin indoor environments. However the deployment of a new femtocell layer may\noriginate undesired interference to the whole system. This paper investigates\nspectrum resource coordination and interference management for the femtocell\nnetworks. A resource coordination scheme based on broadcasting resource\ncoordination request messages by the femto mobile is proposed to reduce the\nsystem interference.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 03:00:20 GMT"}], "update_date": "2010-12-03", "authors_parsed": [["Liang", "Yan", ""], ["Jiang", "Chengling", ""], ["Yang", "Chunliang", ""]]}, {"id": "1012.0384", "submitter": "Wessam Afifi", "authors": "Wessam Afifi, Ahmed Sultan and Mohammed Nafie", "title": "Adaptive Sensing and Transmission Durations for Cognitive Radios", "comments": "9 pages, 9 figures, conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.IT math-ph math.IT math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a cognitive radio setting, secondary users opportunistically access the\nspectrum allocated to primary users. Finding the optimal sensing and\ntransmission durations for the secondary users becomes crucial in order to\nmaximize the secondary throughput while protecting the primary users from\ninterference and service disruption. In this paper an adaptive sensing and\ntransmission scheme for cognitive radios is proposed. We consider a channel\nallocated to a primary user which operates in an unslotted manner switching\nactivity at random times. A secondary transmitter adapts its sensing and\ntransmission durations according to its belief regarding the primary user state\nof activity. The objective is to maximize a secondary utility function. This\nfunction has a penalty term for collisions with primary transmission. It\naccounts for the reliability-throughput tradeoff by explicitly incorporating\nthe impact of sensing duration on secondary throughput and primary activity\ndetection reliability. It also accounts for throughput reduction that results\nfrom data overhead. Numerical simulations of the system performance demonstrate\nthe effectiveness of adaptive sensing and transmission scheme over non-adaptive\napproach in increasing the secondary user utility.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 11:33:10 GMT"}, {"version": "v2", "created": "Fri, 3 Dec 2010 10:04:29 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Afifi", "Wessam", ""], ["Sultan", "Ahmed", ""], ["Nafie", "Mohammed", ""]]}, {"id": "1012.0392", "submitter": "Fei Gao", "authors": "Fei Gao and Gennian Ge", "title": "Supporting Information for the Paper: Optimal Ternary\n  Constant-Composition Codes of Weight Four and Distance Five, IEEE Trans.\n  Inform. Theory, To Appear", "comments": "9 pages, 7 tables. Supporting Information for the Paper: Optimal\n  Ternary Constant-Composition Codes of Weight Four and Distance Five, IEEE\n  Trans. Inform. Theory, To Appear", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Supporting Information for the Paper: Optimal Ternary Constant-Composition\nCodes of Weight Four and Distance Five, IEEE Trans. Inform. Theory, To Appear.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 12:55:56 GMT"}], "update_date": "2010-12-03", "authors_parsed": [["Gao", "Fei", ""], ["Ge", "Gennian", ""]]}, {"id": "1012.0412", "submitter": "Naresh Sharma", "authors": "Naresh Sharma, Smarajit Das and Siddharth Muthukrishnan", "title": "Entropy power inequality for a family of discrete random variables", "comments": "18 pages, 1 figure", "journal-ref": null, "doi": "10.1109/ISIT.2011.6033891", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is known that the Entropy Power Inequality (EPI) always holds if the\nrandom variables have density. Not much work has been done to identify discrete\ndistributions for which the inequality holds with the differential entropy\nreplaced by the discrete entropy. Harremo\\\"{e}s and Vignat showed that it holds\nfor the pair (B(m,p), B(n,p)), m,n \\in \\mathbb{N}, (where B(n,p) is a Binomial\ndistribution with n trials each with success probability p) for p = 0.5. In\nthis paper, we considerably expand the set of Binomial distributions for which\nthe inequality holds and, in particular, identify n_0(p) such that for all m,n\n\\geq n_0(p), the EPI holds for (B(m,p), B(n,p)). We further show that the EPI\nholds for the discrete random variables that can be expressed as the sum of n\nindependent identical distributed (IID) discrete random variables for large n.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 13:27:21 GMT"}], "update_date": "2012-05-22", "authors_parsed": [["Sharma", "Naresh", ""], ["Das", "Smarajit", ""], ["Muthukrishnan", "Siddharth", ""]]}, {"id": "1012.0416", "submitter": "Adnan Raja", "authors": "Adnan Raja, Pramod Viswanath", "title": "Compress-and-Forward Scheme for Relay Networks: Backword Decoding and\n  Connection to Bisubmodular Flows", "comments": "(updated to include layered/backward decoding; submitted revised\n  version for review to IEEE transactions on Information Theory)", "journal-ref": null, "doi": "10.1109/TIT.2014.2334328", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a compress-and-forward scheme with backward decoding is\npresented for the unicast wireless relay network. The encoding at the source\nand relay is a generalization of the noisy network coding scheme (NNC). While\nit achieves the same reliable data rate as noisy network coding scheme, the\nbackward decoding allows for a better decoding complexity as compared to the\njoint decoding of the NNC scheme. Characterizing the layered decoding scheme is\nshown to be equivalent to characterizing an information flow for the wireless\nnetwork. A node-flow for a graph with bisubmodular capacity constraints is\npresented and a max-flow min-cut theorem is proved for it. This generalizes\nmany well-known results of flows over capacity constrained graphs studied in\ncomputer science literature. The results for the unicast relay network are\ngeneralized to the network with multiple sources with independent messages\nintended for a single destination.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 13:38:38 GMT"}, {"version": "v2", "created": "Mon, 10 Jan 2011 09:39:33 GMT"}, {"version": "v3", "created": "Fri, 15 Jun 2012 08:07:13 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Raja", "Adnan", ""], ["Viswanath", "Pramod", ""]]}, {"id": "1012.0452", "submitter": "Umer Salim", "authors": "Umer Salim and Dirk Slock", "title": "Average Minimum Transmit Power to achieve SINR Targets: Performance\n  Comparison of Various User Selection Algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In multi-user communication from one base station (BS) to multiple users, the\nproblem of minimizing the transmit power to achieve some target guaranteed\nperformance (rates) at users has been well investigated in the literature.\nSimilarly various user selection algorithms have been proposed and analyzed\nwhen the BS has to transmit to a subset of the users in the system, mostly for\nthe objective of the sum rate maximization.\n  We study the joint problem of minimizing the transmit power at the BS to\nachieve specific signal-to-interference-and-noise ratio (SINR) targets at users\nin conjunction with user scheduling. The general analytical results for the\naverage transmit power required to meet guaranteed performance at the users'\nside are difficult to obtain even without user selection due to joint\noptimization required over beamforming vectors and power allocation scalars. We\nstudy the transmit power minimization problem with various user selection\nalgorithms, namely semi-orthogonal user selection (SUS), norm-based user\nselection (NUS) and angle-based user selection (AUS). When the SINR targets to\nachieve are relatively large, the average minimum transmit power expressions\nare derived for NUS and SUS for any number of users. For the special case when\nonly two users are selected, similar expressions are further derived for AUS\nand a performance upper bound which serves to benchmark the performance of\nother selection schemes. Simulation results performed under various settings\nindicate that SUS is by far the better user selection criterion.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 15:29:28 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Salim", "Umer", ""], ["Slock", "Dirk", ""]]}, {"id": "1012.0599", "submitter": "Charlotte Hucher", "authors": "Charlotte Hucher and Parastoo Sadeghi", "title": "Towards a Low-Complexity Dynamic Decode-and-Forward Relay Protocol", "comments": "20 pages, 6 figures, submitted to Communications Magazine", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamic decode-and-forward (DDF) relaying protocol is a relatively new\ncooperative scheme which has been shown to achieve promising theoretical\nresults in terms of diversity-multiplexing gain tradeoff and error rates. The\ncase of a single relay has been extensively studied in the literature and\nseveral techniques to approach the optimum performance have been proposed.\nUntil recently, however, a practical implementation for the case of several\nrelays had been considered to be much more challenging. A rotation-based DDF\ntechnique, suitable for any number of relays, has been recently proposed which\npromises to overcome important implementation hurdles. This article provides an\noverview of the DDF protocol, describes different implementation techniques and\ncompares their performance.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 22:50:14 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Hucher", "Charlotte", ""], ["Sadeghi", "Parastoo", ""]]}, {"id": "1012.0602", "submitter": "Pascal Vontobel", "authors": "Alexandros G. Dimakis, Roxana Smarandache, and Pascal O. Vontobel", "title": "LDPC Codes for Compressed Sensing", "comments": "To appear, IEEE Transactions on Information Theory, 2012", "journal-ref": null, "doi": "10.1109/TIT.2011.2181819", "report-no": null, "categories": "cs.IT math.IT math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a mathematical connection between channel coding and compressed\nsensing. In particular, we link, on the one hand, \\emph{channel coding linear\nprogramming decoding (CC-LPD)}, which is a well-known relaxation o\nmaximum-likelihood channel decoding for binary linear codes, and, on the other\nhand, \\emph{compressed sensing linear programming decoding (CS-LPD)}, also\nknown as basis pursuit, which is a widely used linear programming relaxation\nfor the problem of finding the sparsest solution of an under-determined system\nof linear equations. More specifically, we establis a tight connection between\nCS-LPD based on a zero-one measurement matrix over the reals and CC-LPD of the\nbinary linear channel code that is obtained by viewing this measurement matrix\nas a binary parity-check matrix. This connection allows the translation of\nperformance guarantees from one setup to the other. The main message of this\npaper is that parity-check matrices of \"good\" channel codes can be used as\nprovably \"good\" measurement matrices under basis pursuit. In particular, we\nprovide the first deterministic construction of compressed sensing measurement\nmatrices with an order-optimal number of rows using high-girth low-density\nparity-check (LDPC) codes constructed by Gallager.\n", "versions": [{"version": "v1", "created": "Thu, 2 Dec 2010 22:56:59 GMT"}, {"version": "v2", "created": "Mon, 12 Dec 2011 03:47:49 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Dimakis", "Alexandros G.", ""], ["Smarandache", "Roxana", ""], ["Vontobel", "Pascal O.", ""]]}, {"id": "1012.0898", "submitter": "Akihiro Munemasa", "authors": "Masaaki Harada and Akihiro Munemasa", "title": "Classification of quaternary Hermitian self-dual codes of length 20", "comments": "9 pages. To appear in IEEE Transactions on Information Theory", "journal-ref": "IEEE Trans. Inform. Theory 57 (2011), 3758-3762", "doi": null, "report-no": null, "categories": "math.CO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A classification of quaternary Hermitian self-dual codes of length 20 is\ngiven. Using this classification, a classification of extremal quaternary\nHermitian self-dual codes of length 22 is also given.\n", "versions": [{"version": "v1", "created": "Sat, 4 Dec 2010 09:05:36 GMT"}], "update_date": "2012-05-28", "authors_parsed": [["Harada", "Masaaki", ""], ["Munemasa", "Akihiro", ""]]}, {"id": "1012.0955", "submitter": "Soheil Feizi", "authors": "Soheil Feizi, Muriel Medard and Michelle Effros", "title": "Compressive Sensing Over Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we demonstrate some applications of compressive sensing over\nnetworks. We make a connection between compressive sensing and traditional\ninformation theoretic techniques in source coding and channel coding. Our\nresults provide an explicit trade-off between the rate and the decoding\ncomplexity. The key difference of compressive sensing and traditional\ninformation theoretic approaches is at their decoding side. Although optimal\ndecoders to recover the original signal, compressed by source coding have high\ncomplexity, the compressive sensing decoder is a linear or convex optimization.\nFirst, we investigate applications of compressive sensing on distributed\ncompression of correlated sources. Here, by using compressive sensing, we\npropose a compression scheme for a family of correlated sources with a\nmodularized decoder, providing a trade-off between the compression rate and the\ndecoding complexity. We call this scheme Sparse Distributed Compression. We use\nthis compression scheme for a general multicast network with correlated\nsources. Here, we first decode some of the sources by a network decoding\ntechnique and then, we use a compressive sensing decoder to obtain the whole\nsources. Then, we investigate applications of compressive sensing on channel\ncoding. We propose a coding scheme that combines compressive sensing and random\nchannel coding for a high-SNR point-to-point Gaussian channel. We call this\nscheme Sparse Channel Coding. We propose a modularized decoder providing a\ntrade-off between the capacity loss and the decoding complexity. At the\nreceiver side, first, we use a compressive sensing decoder on a noisy signal to\nobtain a noisy estimate of the original signal and then, we apply a traditional\nchannel coding decoder to find the original signal.\n", "versions": [{"version": "v1", "created": "Sat, 4 Dec 2010 22:54:18 GMT"}], "update_date": "2010-12-07", "authors_parsed": [["Feizi", "Soheil", ""], ["Medard", "Muriel", ""], ["Effros", "Michelle", ""]]}, {"id": "1012.1007", "submitter": "Lei Zhang", "authors": "Lei Zhang, Jun Luo and Dongning Guo", "title": "Neighbor Discovery for Wireless Networks via Compressed Sensing", "comments": "29 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the problem of neighbor discovery in wireless networks,\nnamely, each node wishes to discover and identify the network interface\naddresses (NIAs) of those nodes within a single hop. A novel paradigm, called\ncompressed neighbor discovery is proposed, which enables all nodes to\nsimultaneously discover their respective neighborhoods with a single frame of\ntransmission, which is typically of a few thousand symbol epochs. The key\ntechnique is to assign each node a unique on-off signature and let all nodes\nsimultaneously transmit their signatures. Despite that the radios are\nhalf-duplex, each node observes a superposition of its neighbors' signatures\n(partially) through its own off-slots. To identify its neighbors out of a large\nnetwork address space, each node solves a compressed sensing (or sparse\nrecovery) problem.\n  Two practical schemes are studied. The first employs random on-off\nsignatures, and each node discovers its neighbors using a noncoherent detection\nalgorithm based on group testing. The second scheme uses on-off signatures\nbased on a deterministic second-order Reed-Muller code, and applies a chirp\ndecoding algorithm. The second scheme needs much lower signal-to-noise ratio\n(SNR) to achieve the same error performance. The complexity of the chirp\ndecoding algorithm is sub-linear, so that it is in principle scalable to\nnetworks with billions of nodes with 48-bit IEEE 802.11 MAC addresses. The\ncompressed neighbor discovery schemes are much more efficient than conventional\nrandom-access discovery, where nodes have to retransmit over many frames with\nrandom delays to be successfully discovered.\n", "versions": [{"version": "v1", "created": "Sun, 5 Dec 2010 16:09:51 GMT"}, {"version": "v2", "created": "Fri, 31 Dec 2010 19:26:41 GMT"}, {"version": "v3", "created": "Wed, 20 Jul 2011 03:43:02 GMT"}, {"version": "v4", "created": "Tue, 22 May 2012 16:03:54 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Zhang", "Lei", ""], ["Luo", "Jun", ""], ["Guo", "Dongning", ""]]}, {"id": "1012.1258", "submitter": "Ram Rajagopal", "authors": "Ram Rajagopal, XuanLong Nguyen, Sinem Coleri Ergen and Pravin Varaiya", "title": "Simultaneous Sequential Detection of Multiple Interacting Faults", "comments": "38 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.SY math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Single fault sequential change point problems have become important in\nmodeling for various phenomena in large distributed systems, such as sensor\nnetworks. But such systems in many situations present multiple interacting\nfaults. For example, individual sensors in a network may fail and detection is\nperformed by comparing measurements between sensors, resulting in statistical\ndependency among faults. We present a new formulation for multiple interacting\nfaults in a distributed system. The formulation includes specifications of how\nindividual subsystems composing the large system may fail, the information that\ncan be shared among these subsystems and the interaction pattern between\nfaults. We then specify a new sequential algorithm for detecting these faults.\nThe main feature of the algorithm is that it uses composite stopping rules for\na subsystem that depend on the decision of other subsystems. We provide\nasymptotic false alarm and detection delay analysis for this algorithm in the\nBayesian setting and show that under certain conditions the algorithm is\noptimal. The analysis methodology relies on novel detailed comparison\ntechniques between stopping times. We validate the approach with some\nsimulations.\n", "versions": [{"version": "v1", "created": "Mon, 6 Dec 2010 17:54:07 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Rajagopal", "Ram", ""], ["Nguyen", "XuanLong", ""], ["Ergen", "Sinem Coleri", ""], ["Varaiya", "Pravin", ""]]}, {"id": "1012.1295", "submitter": "Siddhartan Govindasamy", "authors": "Siddhartan Govindasamy, Daniel W. Bliss", "title": "On the Spectral Efficiency of Links with Multi-antenna Receivers in\n  Non-homogenous Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An asymptotic technique is developed to find the\nSignal-to-Interference-plus-Noise-Ratio (SINR) and spectral efficiency of a\nlink with N receiver antennas in wireless networks with non-homogeneous\ndistributions of nodes. It is found that with appropriate normalization, the\nSINR and spectral efficiency converge with probability 1 to asymptotic limits\nas N increases. This technique is applied to networks with power-law node\nintensities, which includes homogeneous networks as a special case, to find a\nsimple approximation for the spectral efficiency. It is found that for\nreceivers in dense clusters, the SINR grows with N at rates higher than that of\nhomogeneous networks and that constant spectral efficiencies can be maintained\nif the ratio of N to node density is constant. This result also enables the\nanalysis of a new scaling regime where the distribution of nodes in the network\nflattens rather than increases uniformly. It is found that in many cases in\nthis regime, N needs to grow approximately exponentially to maintain a constant\nspectral efficiency. In addition to strengthening previously known results for\nhomogeneous networks, these results provide insight into the benefit of using\nantenna arrays in non-homogeneous wireless networks, for which few results are\navailable in the literature.\n", "versions": [{"version": "v1", "created": "Mon, 6 Dec 2010 19:40:46 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Govindasamy", "Siddhartan", ""], ["Bliss", "Daniel W.", ""]]}, {"id": "1012.1403", "submitter": "Fanping Du", "authors": "Fanping Du", "title": "Negative frequency communication", "comments": "21 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT physics.pop-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spectrum is the most valuable resource in communication system, but\nunfortunately, so far, a half of the spectrum has been wasted. In this paper,\nwe will see that the negative frequency not only has a physical meaning but\nalso can be used in communication. In fact, the complete description of a\nfrequency signal is a rotating complex-frequency signal, in a complete\ndescription, positive and negative frequency signals are two distinguishable\nand independent frequency signals, they can carry different information. But\nthe current carrier modulation and demodulation do not distinguish positive and\nnegative frequencies, so half of the spectrum resources and signal energy are\nwasted. The complex-carrier modulation and demodulation, proposed by this\npaper, use the complex-frequency signal as a carrier signal, the negative and\npositive frequency can carry different information, so the spectrum resources\nare fully used, the signal energy carried by complex-carrier modulation is\nfocused on a certain band, so the signal energy will not be lost by the\ncomplex-carrier demodulation.\n", "versions": [{"version": "v1", "created": "Tue, 7 Dec 2010 05:46:02 GMT"}, {"version": "v2", "created": "Tue, 28 Dec 2010 01:45:19 GMT"}, {"version": "v3", "created": "Fri, 25 Mar 2011 08:49:39 GMT"}, {"version": "v4", "created": "Mon, 18 Apr 2011 03:10:03 GMT"}, {"version": "v5", "created": "Mon, 26 Sep 2011 08:09:13 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Du", "Fanping", ""]]}, {"id": "1012.1425", "submitter": "Idan Goldenberg", "authors": "David Burshtein, Idan Goldenberg", "title": "Improved linear programming decoding of LDPC codes and bounds on the\n  minimum and fractional distance", "comments": "17 pages, 8 figures, Submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2162224", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine LDPC codes decoded using linear programming (LP). Four\ncontributions to the LP framework are presented. First, a new method of\ntightening the LP relaxation, and thus improving the LP decoder, is proposed.\nSecond, we present an algorithm which calculates a lower bound on the minimum\ndistance of a specific code. This algorithm exhibits complexity which scales\nquadratically with the block length. Third, we propose a method to obtain a\ntight lower bound on the fractional distance, also with quadratic complexity,\nand thus less than previously-existing methods. Finally, we show how the\nfundamental LP polytope for generalized LDPC codes and nonbinary LDPC codes can\nbe obtained.\n", "versions": [{"version": "v1", "created": "Tue, 7 Dec 2010 07:59:47 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Burshtein", "David", ""], ["Goldenberg", "Idan", ""]]}, {"id": "1012.1539", "submitter": "Wenyi Zhang", "authors": "Wenyi Zhang", "title": "A General Framework for Transmission with Transceiver Distortion and\n  Some Applications", "comments": "32 pages (including 4 figures, 5 tables, and auxiliary materials);\n  submitted to IEEE Transactions on Communications", "journal-ref": null, "doi": "10.1109/TCOMM.2011.121211.110222", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A general theoretical framework is presented for analyzing information\ntransmission over Gaussian channels with memoryless transceiver distortion,\nwhich encompasses various nonlinear distortion models including transmit-side\nclipping, receive-side analog-to-digital conversion, and others. The framework\nis based on the so-called generalized mutual information (GMI), and the\nanalysis in particular benefits from the setup of Gaussian codebook ensemble\nand nearest-neighbor decoding, for which it is established that the GMI takes a\ngeneral form analogous to the channel capacity of undistorted Gaussian\nchannels, with a reduced \"effective\" signal-to-noise ratio (SNR) that depends\non the nominal SNR and the distortion model. When applied to specific\ndistortion models, an array of results of engineering relevance is obtained.\nFor channels with transmit-side distortion only, it is shown that a\nconventional approach, which treats the distorted signal as the sum of the\noriginal signal part and a uncorrelated distortion part, achieves the GMI. For\nchannels with output quantization, closed-form expressions are obtained for the\neffective SNR and the GMI, and related optimization problems are formulated and\nsolved for quantizer design. Finally, super-Nyquist sampling is analyzed within\nthe general framework, and it is shown that sampling beyond the Nyquist rate\nincreases the GMI for all SNR. For example, with a binary symmetric output\nquantization, information rates exceeding one bit per channel use are\nachievable by sampling the output at four times the Nyquist rate.\n", "versions": [{"version": "v1", "created": "Tue, 7 Dec 2010 15:45:27 GMT"}, {"version": "v2", "created": "Tue, 12 Apr 2011 13:22:09 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Zhang", "Wenyi", ""]]}, {"id": "1012.1577", "submitter": "Jelani Nelson", "authors": "Daniel M. Kane, Jelani Nelson", "title": "Sparser Johnson-Lindenstrauss Transforms", "comments": "v6: journal version, minor changes, added Remark 23; v5: modified\n  abstract, fixed typos, added open problem section; v4: simplified section 4\n  by giving 1 analysis that covers both constructions; v3: proof of Theorem 25\n  in v2 was written incorrectly, now fixed; v2: Added another construction\n  achieving same upper bound, and added proof of near-tight lower bound for DKS\n  scheme", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CG cs.DM cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give two different and simple constructions for dimensionality reduction\nin $\\ell_2$ via linear mappings that are sparse: only an\n$O(\\varepsilon)$-fraction of entries in each column of our embedding matrices\nare non-zero to achieve distortion $1+\\varepsilon$ with high probability, while\nstill achieving the asymptotically optimal number of rows. These are the first\nconstructions to provide subconstant sparsity for all values of parameters,\nimproving upon previous works of Achlioptas (JCSS 2003) and Dasgupta, Kumar,\nand Sarl\\'{o}s (STOC 2010). Such distributions can be used to speed up\napplications where $\\ell_2$ dimensionality reduction is used.\n", "versions": [{"version": "v1", "created": "Tue, 7 Dec 2010 18:48:12 GMT"}, {"version": "v2", "created": "Thu, 14 Apr 2011 17:24:00 GMT"}, {"version": "v3", "created": "Thu, 28 Apr 2011 12:22:53 GMT"}, {"version": "v4", "created": "Fri, 7 Dec 2012 21:35:40 GMT"}, {"version": "v5", "created": "Wed, 21 Aug 2013 19:01:03 GMT"}, {"version": "v6", "created": "Wed, 5 Feb 2014 22:39:26 GMT"}], "update_date": "2014-02-07", "authors_parsed": [["Kane", "Daniel M.", ""], ["Nelson", "Jelani", ""]]}, {"id": "1012.1776", "submitter": "Elloa B. Guedes", "authors": "Ello\\'a B. Guedes and Francisco Marcos de Assis and Bernardo Lula Jr", "title": "Examples of the Generalized Quantum Permanent Compromise Attack to the\n  Blum-Micali Construction", "comments": "8 pages, 1 figure, 2 attacks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents examples of the quantum permanent compromise attack to\nthe Blum-Micali construction. Such attacks illustrate how a previous attack to\nthe Blum-Micali generator can be extended to the whole Blum-Micali\nconstruction, including the Blum-Blum-Shub and Kaliski generators.\n", "versions": [{"version": "v1", "created": "Wed, 8 Dec 2010 14:50:38 GMT"}], "update_date": "2010-12-09", "authors_parsed": [["Guedes", "Elloá B.", ""], ["de Assis", "Francisco Marcos", ""], ["Lula", "Bernardo", "Jr"]]}, {"id": "1012.1799", "submitter": "Alex Alvarado", "authors": "Md. Jahangir Hossain, Alex Alvarado, Leszek Szczecinski", "title": "Towards Fully Optimized BICM Transceivers", "comments": "Submitted to the IEEE Transactions on Communications", "journal-ref": "IEEE Trans. Commun., vol. 59, no. 11, pp. 3027-3039, 2011", "doi": "10.1109/TCOMM.2011.091411.100746", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bit-interleaved coded modulation (BICM) transceivers often use equally spaced\nconstellations and a random interleaver. In this paper, we propose a new BICM\ndesign, which considers hierarchical (nonequally spaced) constellations, a\nbit-level multiplexer, and multiple interleavers. It is shown that this new\nscheme increases the degrees of freedom that can be exploited in order to\nimprove its performance. Analytical bounds on the bit error rate (BER) of the\nsystem in terms of the constellation parameters and the multiplexing rules are\ndeveloped for the additive white Gaussian Noise (AWGN) and Nakagami-$m$ fading\nchannels. These bounds are then used to design the BICM transceiver. Numerical\nresults show that, compared to conventional BICM designs, and for a target BER\nof $10^{-6}$, gains up to 3 dB in the AWGN channel are obtained. For fading\nchannels, the gains depend on the fading parameter, and reach 2 dB for a target\nBER of $10^{-7}$ and $m=5$.\n", "versions": [{"version": "v1", "created": "Wed, 8 Dec 2010 16:39:04 GMT"}], "update_date": "2013-03-26", "authors_parsed": [["Hossain", "Md. Jahangir", ""], ["Alvarado", "Alex", ""], ["Szczecinski", "Leszek", ""]]}, {"id": "1012.1890", "submitter": "Samer Abdallah", "authors": "Samer A. Abdallah and Mark D. Plumbley", "title": "A measure of statistical complexity based on predictive information", "comments": "4 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT physics.data-an stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an information theoretic measure of statistical structure,\ncalled 'binding information', for sets of random variables, and compare it with\nseveral previously proposed measures including excess entropy, Bialek et al.'s\npredictive information, and the multi-information. We derive some of the\nproperties of the binding information, particularly in relation to the\nmulti-information, and show that, for finite sets of binary random variables,\nthe processes which maximises binding information are the 'parity' processes.\nFinally we discuss some of the implications this has for the use of the binding\ninformation as a measure of complexity.\n", "versions": [{"version": "v1", "created": "Wed, 8 Dec 2010 23:16:04 GMT"}], "update_date": "2010-12-10", "authors_parsed": [["Abdallah", "Samer A.", ""], ["Plumbley", "Mark D.", ""]]}, {"id": "1012.1895", "submitter": "Arya Mazumdar", "authors": "Arya Mazumdar, Alexander Barg, Navin Kashyap", "title": "Coding for High-Density Recording on a 1-D Granular Magnetic Medium", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": "IEEE Transactions on Information Theory, vol. 57, issue 11, pp.\n  7403-7417, 2011", "doi": "10.1109/TIT.2011.2158514", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In terabit-density magnetic recording, several bits of data can be replaced\nby the values of their neighbors in the storage medium. As a result, errors in\nthe medium are dependent on each other and also on the data written. We\nconsider a simple one-dimensional combinatorial model of this medium. In our\nmodel, we assume a setting where binary data is sequentially written on the\nmedium and a bit can erroneously change to the immediately preceding value. We\nderive several properties of codes that correct this type of errors, focusing\non bounds on their cardinality.\n  We also define a probabilistic finite-state channel model of the storage\nmedium, and derive lower and upper estimates of its capacity. A lower bound is\nderived by evaluating the symmetric capacity of the channel, i.e., the maximum\ntransmission rate under the assumption of the uniform input distribution of the\nchannel. An upper bound is found by showing that the original channel is a\nstochastic degradation of another, related channel model whose capacity we can\ncompute explicitly.\n", "versions": [{"version": "v1", "created": "Wed, 8 Dec 2010 23:59:35 GMT"}], "update_date": "2011-11-23", "authors_parsed": [["Mazumdar", "Arya", ""], ["Barg", "Alexander", ""], ["Kashyap", "Navin", ""]]}, {"id": "1012.1909", "submitter": "Manar Mohaisen", "authors": "Manar Mohaisen, KyungHi Chang", "title": "On Transmit Antenna Selection for Multiuser MIMO Systems with Dirty\n  Paper Coding", "comments": "5 pages, 6 figures, 1 table, [The 20th Personal, Indoor and Mobile\n  Radio Communications Symposium 2009 (PIMRC-09)]", "journal-ref": "The 20th Personal, Indoor and Mobile Radio Communications\n  Symposium 2009 (PIMRC-09)", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we address the transmit antenna selection in multi-user MIMO\nsystems with precoding. The optimum and reduced complexity sub-optimum antenna\nselection algorithms are introduced. QR-decomposition (QRD) based antenna\nselection is investigated and the reason behind its sub-optimality is\nanalytically derived. We introduce the conventional QRD-based algorithm and\npropose an efficient QRD-based transmit antenna scheme (maxR) that is both\nimplementation and performance efficient. Moreover, we derive explicit formulae\nfor the computational complexities of the aforementioned algorithms. Simulation\nresults and analysis demonstrate that the proposed maxR algorithm requires only\n1% of the computational efforts required by the optimal algorithm for a\ndegradation of 1dB and 0.1dB in the case of linear zero-forcing and\nTomlinson-Harashima precoding schemes, respectively.\n", "versions": [{"version": "v1", "created": "Thu, 9 Dec 2010 02:03:17 GMT"}], "update_date": "2010-12-10", "authors_parsed": [["Mohaisen", "Manar", ""], ["Chang", "KyungHi", ""]]}, {"id": "1012.1912", "submitter": "Giacomo Como", "authors": "Giacomo Como and Serdar Y\\\"uksel", "title": "On the Capacity of Memoryless Finite-State Multiple-Access Channels with\n  Asymmetric State Information at the Encoders", "comments": "8 pages, 1 figure, accepted for publication, in press", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A single-letter characterization is provided for the capacity region of\nfinite-state multiple-access channels, when the channel state process is an\nindependent and identically distributed sequence, the transmitters have access\nto partial (quantized) state information, and complete channel state\ninformation is available at the receiver. The partial channel state information\nis assumed to be asymmetric at the encoders. As a main contribution, a tight\nconverse coding theorem is presented. The difficulties associated with the case\nwhen the channel state has memory are discussed and connections to\ndecentralized stochastic control theory are presented.\n", "versions": [{"version": "v1", "created": "Thu, 9 Dec 2010 02:55:46 GMT"}], "update_date": "2010-12-10", "authors_parsed": [["Como", "Giacomo", ""], ["Yüksel", "Serdar", ""]]}, {"id": "1012.1919", "submitter": "Yue Deng", "authors": "Yue Deng, Qionghai Dai, Risheng Liu, Zengke Zhang and Sanqing Hu", "title": "Low-Rank Structure Learning via Log-Sum Heuristic Recovery", "comments": "13 pages, 3 figures", "journal-ref": "Neural Networks and Learning Systems, IEEE Transactions on,\n  Volume:24 , Issue: 3, March, 2013", "doi": "10.1109/TNNLS.2012.2235082", "report-no": null, "categories": "cs.NA cs.IT cs.LG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recovering intrinsic data structure from corrupted observations plays an\nimportant role in various tasks in the communities of machine learning and\nsignal processing. In this paper, we propose a novel model, named log-sum\nheuristic recovery (LHR), to learn the essential low-rank structure from\ncorrupted data. Different from traditional approaches, which directly utilize\n$\\ell_1$ norm to measure the sparseness, LHR introduces a more reasonable\nlog-sum measurement to enhance the sparsity in both the intrinsic low-rank\nstructure and in the sparse corruptions. Although the proposed LHR optimization\nis no longer convex, it still can be effectively solved by a\nmajorization-minimization (MM) type algorithm, with which the non-convex\nobjective function is iteratively replaced by its convex surrogate and LHR\nfinally falls into the general framework of reweighed approaches. We prove that\nthe MM-type algorithm can converge to a stationary point after successive\niteration. We test the performance of our proposed model by applying it to\nsolve two typical problems: robust principal component analysis (RPCA) and\nlow-rank representation (LRR).\n  For RPCA, we compare LHR with the benchmark Principal Component Pursuit (PCP)\nmethod from both the perspectives of simulations and practical applications.\nFor LRR, we apply LHR to compute the low-rank representation matrix for motion\nsegmentation and stock clustering. Experimental results on low rank structure\nlearning demonstrate that the proposed Log-sum based model performs much better\nthan the $\\ell_1$-based method on for data with higher rank and with denser\ncorruptions.\n", "versions": [{"version": "v1", "created": "Thu, 9 Dec 2010 03:54:44 GMT"}, {"version": "v2", "created": "Sun, 3 Apr 2011 15:28:58 GMT"}, {"version": "v3", "created": "Sat, 24 Mar 2012 15:37:12 GMT"}], "update_date": "2014-08-13", "authors_parsed": [["Deng", "Yue", ""], ["Dai", "Qionghai", ""], ["Liu", "Risheng", ""], ["Zhang", "Zengke", ""], ["Hu", "Sanqing", ""]]}, {"id": "1012.2073", "submitter": "Amir Rashidinejad Mr.", "authors": "M. Heidari Khoozani, A. Rashidinejad, M. H. Lotfi Froushani, P. Pad\n  and F. Marvasti", "title": "Almost-Optimum Signature Matrices in Binary-Input Synchronous Overloaded\n  CDMA", "comments": "6 Pages, 5 Figures, Submitted to the International Conference on\n  Telecommunications 2011 (ICT-2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The everlasting bandwidth limitations in wireless communication networks has\ndirected the researchers' thrust toward analyzing the prospect of overloaded\nCode Division Multiple Access (CDMA). In this paper, we have proposed a Genetic\nAlgorithm in search of optimum signature matrices for binary-input synchronous\nCDMA. The main measure of optimality considered in this paper, is the per-user\nchannel capacity of the overall multiple access system. Our resulting matrices\ndiffer from the renowned Welch Bound Equality (WBE) codes, regarding the fact\nthat our attention is specifically aimed at binary, rather than Gaussian, input\ndistributions. Since design based on channel capacity is computationally\nexpensive, we have focused on introducing a set of alternative criteria that\nnot only speed up the matrix formation procedure, but also maintain optimality.\nThe Bit Error Rate (BER) and Constellation measures are our main criteria\npropositions. Simulation results also verify our analytical justifications.\n", "versions": [{"version": "v1", "created": "Thu, 9 Dec 2010 18:42:19 GMT"}], "update_date": "2010-12-10", "authors_parsed": [["Khoozani", "M. Heidari", ""], ["Rashidinejad", "A.", ""], ["Froushani", "M. H. Lotfi", ""], ["Pad", "P.", ""], ["Marvasti", "F.", ""]]}, {"id": "1012.2086", "submitter": "Anthony Quas", "authors": "Yuval Peres and Anthony Quas", "title": "Entropy Rate for Hidden Markov Chains with rare transitions", "comments": "To appear in Hidden Markov Processes by Marcus, Petersen and Weissman\n  (eds); CUP", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider Hidden Markov Chains obtained by passing a Markov Chain with rare\ntransitions through a noisy memoryless channel. We obtain asymptotic estimates\nfor the entropy of the resulting Hidden Markov Chain as the transition rate is\nreduced to zero.\n", "versions": [{"version": "v1", "created": "Thu, 9 Dec 2010 19:23:35 GMT"}], "update_date": "2010-12-10", "authors_parsed": [["Peres", "Yuval", ""], ["Quas", "Anthony", ""]]}, {"id": "1012.2164", "submitter": "Chin Choy Chai Dr.", "authors": "Chin Choy Chai, Chau Yuen", "title": "On Two-way Communications for Cooperative Multiple Source Pairs Through\n  a Multi-antenna Relay", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study amplified-and-forward (AF)-based two-way relaying (TWR) with\nmultiple source pairs, which are exchanging information through the relay. Each\nsource has single antenna and the relay has multi-antenna. The optimal\nbeamforming matrix structure that achieves maximum\nsignal-to-interference-plus-noise ratio (SINR) for TWR with multiple source\npairs is derived. We then present two new non-zero-forcing based beamforming\nschemes for TWR, which take into consideration the tradeoff between preserving\nthe desired signals and suppressing inter-pair interference between different\nsource pairs. Joint grouping and beamforming scheme is proposed to achieve a\nbetter signal-to-interference-plus-noise ratio (SINR) when the total number of\nsource pairs is large and the signal-to-noise ratio (SNR) at the relay is low.\n", "versions": [{"version": "v1", "created": "Fri, 10 Dec 2010 02:47:31 GMT"}], "update_date": "2010-12-13", "authors_parsed": [["Chai", "Chin Choy", ""], ["Yuen", "Chau", ""]]}, {"id": "1012.2350", "submitter": "Syed Jafar", "authors": "Tiangao Gou, Syed A. Jafar, Sang-Woon Jeon, Sae-Young Chung", "title": "Aligned Interference Neutralization and the Degrees of Freedom of the\n  2x2x2 Interference Channel", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the 2x2x2 interference channel, i.e., the multihop interference\nchannel formed by concatenation of two 2-user interference channels achieves\nthe min-cut outer bound value of 2 DoF, for almost all values of channel\ncoefficients, for both time-varying or fixed channel coefficients. The key to\nthis result is a new idea, called aligned interference neutralization, that\nprovides a way to align interference terms over each hop in a manner that\nallows them to be cancelled over the air at the last hop.\n", "versions": [{"version": "v1", "created": "Fri, 10 Dec 2010 19:08:39 GMT"}], "update_date": "2010-12-13", "authors_parsed": [["Gou", "Tiangao", ""], ["Jafar", "Syed A.", ""], ["Jeon", "Sang-Woon", ""], ["Chung", "Sae-Young", ""]]}, {"id": "1012.2596", "submitter": "Ferkan Yilmaz", "authors": "Ferkan Yilmaz and Mohamed-Slim Alouini", "title": "A Unified MGF-Based Capacity Analysis of Diversity Combiners over\n  Generalized Fading Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.ST stat.OT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unified exact average capacity results for L-branch coherent diversity\nreceivers including equal-gain combining (EGC) and maximal-ratio combining\n(MRC) are not known. This paper develops a novel generic framework for the\ncapacity analysis of $L$-branch EGC/MRC over generalized fading channels. The\nframework is used to derive new results for the Gamma shadowed generalized\nNakagami-m fading model which can be a suitable model for the fading\nenvironments encountered by high frequency (60 GHz and above) communications.\nThe mathematical formalism is illustrated with some selected numerical and\nsimulation results confirming the correctness of our newly proposed framework.\n", "versions": [{"version": "v1", "created": "Sun, 12 Dec 2010 22:35:47 GMT"}], "update_date": "2010-12-14", "authors_parsed": [["Yilmaz", "Ferkan", ""], ["Alouini", "Mohamed-Slim", ""]]}, {"id": "1012.2598", "submitter": "Ferkan Yilmaz", "authors": "Ferkan Yilmaz and Mohamed-Slim Alouini", "title": "Extended Generalized-K (EGK): A New Simple and General Model for\n  Composite Fading Channels", "comments": "Composite fading distribution, generalized-K distribution,\n  probability density function, cumulative distribution function, fractional\n  moments, level crossing rate, amount of fade duration, moments, amount of\n  fading, average bit error probability, average capacity", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce a generalized composite fading distribution\n(termed extended generalized-K (EGK)) to model the envelope and the power of\nthe received signal in millimeter wave (60 GHz or above) and free-space optical\nchannels. We obtain the first and the second-order statistics of the received\nsignal envelope characterized by the EGK composite fading distribution. In\nparticular, expressions for probability density function, cumulative\ndistribution function, level crossing rate and average fade duration, and\nfractional moments are derived. In addition performance measures such as amount\nof fading, average bit error probability, outage probability, average capacity,\nand outage capacity are offered in closed-form. Selected numerical and computer\nsimulation examples validate the accuracy of the presented mathematical\nanalysis.\n", "versions": [{"version": "v1", "created": "Sun, 12 Dec 2010 22:52:03 GMT"}], "update_date": "2010-12-14", "authors_parsed": [["Yilmaz", "Ferkan", ""], ["Alouini", "Mohamed-Slim", ""]]}, {"id": "1012.2621", "submitter": "Nima Torabkhani", "authors": "Nima Torabkhani, Badri N. Vellambi, Faramarz Fekri", "title": "Throughput and Latency of Acyclic Erasure Networks with Feedback in a\n  Finite Buffer Regime", "comments": "5 pages, 5 figures, ITW2010 Dublin", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The exact Markov modeling analysis of erasure networks with finite buffers is\nan extremely hard problem due to the large number of states in the system. In\nsuch networks, packets are lost due to either link erasures or blocking by the\nfull buffers. In this paper, we propose a novel method that iteratively\nestimates the performance parameters of the network and more importantly\nreduces the computational complexity compared to the exact analysis. This is\nthe first work that analytically studies the effect of finite memory on the\nthroughput and latency in general wired acyclic networks with erasure links. As\na case study, a random packet routing scheme with ideal feedback on the links\nis used. The proposed framework yields a fairly accurate estimate of the\nprobability distribution of buffer occupancies at the intermediate nodes using\nwhich we can not only identify the congested and starving nodes but also obtain\nanalytical expressions for throughput and average delay of a packet in the\nnetwork. The theoretical framework presented here can be applied to many wired\nnetworks, from Internet to more futuristic applications such as\nnetworks-on-chip under various communication and network coding scenarios.\n", "versions": [{"version": "v1", "created": "Mon, 13 Dec 2010 03:40:39 GMT"}], "update_date": "2010-12-14", "authors_parsed": [["Torabkhani", "Nima", ""], ["Vellambi", "Badri N.", ""], ["Fekri", "Faramarz", ""]]}, {"id": "1012.2622", "submitter": "Nima Torabkhani", "authors": "Nima Torabkhani, Badri N. Vellambi, Faramarz Fekri", "title": "Study of Throughput and Latency in Finite-buffer Coded Networks", "comments": "5 pages, 4 figures, Asilomar 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exact queueing analysis of erasure networks with network coding in a finite\nbuffer regime is an extremely hard problem due to the large number of states in\nthe network. In such networks, packets are lost due to either link erasures or\ndue to blocking due to full buffers. In this paper, a block-by-block random\nlinear network coding scheme with feedback on the links is selected for\nreliability and more importantly guaranteed decoding of each block. We propose\na novel method that iteratively estimates the performance parameters of the\nnetwork and more importantly reduces the computational complexity compared to\nthe exact analysis. The proposed framework yields an accurate estimate of the\ndistribution of buffer occupancies at the intermediate nodes using which we\nobtain analytical expressions for network throughput and delay distribution of\na block of packets.\n", "versions": [{"version": "v1", "created": "Mon, 13 Dec 2010 03:41:10 GMT"}], "update_date": "2010-12-14", "authors_parsed": [["Torabkhani", "Nima", ""], ["Vellambi", "Badri N.", ""], ["Fekri", "Faramarz", ""]]}, {"id": "1012.2628", "submitter": "Nima Torabkhani", "authors": "Badri N. Vellambi, Nima Torabkhani, Faramarz Fekri", "title": "Throughput and Latency in Finite-Buffer Line Networks", "comments": "19 pages, 14 figures, accepted in IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2137070", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work investigates the effect of finite buffer sizes on the throughput\ncapacity and packet delay of line networks with packet erasure links that have\nperfect feedback. These performance measures are shown to be linked to the\nstationary distribution of an underlying irreducible Markov chain that models\nthe system exactly. Using simple strategies, bounds on the throughput capacity\nare derived. The work then presents two iterative schemes to approximate the\nsteady-state distribution of node occupancies by decoupling the chain to\nsmaller queueing blocks. These approximate solutions are used to understand the\neffect of buffer sizes on throughput capacity and the distribution of packet\ndelay. Using the exact modeling for line networks, it is shown that the\nthroughput capacity is unaltered in the absence of hop-by-hop feedback provided\npacket-level network coding is allowed. Finally, using simulations, it is\nconfirmed that the proposed framework yields accurate estimates of the\nthroughput capacity and delay distribution and captures the vital trends and\ntradeoffs in these networks.\n", "versions": [{"version": "v1", "created": "Mon, 13 Dec 2010 04:14:12 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Vellambi", "Badri N.", ""], ["Torabkhani", "Nima", ""], ["Fekri", "Faramarz", ""]]}, {"id": "1012.2673", "submitter": "Jesper Sorensen", "authors": "Jesper H. S{\\o}rensen, Petar Popovski, Jan {\\O}stergaard", "title": "On the Role of Feedback in LT Codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper concerns application of feedback in LT codes. The considered type\nof feedback is acknowledgments, where information on which symbols have been\ndecoded is given to the transmitter. We identify an important adaptive\nmechanism in standard LT codes, which is crucial to their ability to perform\nwell under any channel conditions. We show how precipitate application of\nacknowledgments can interfere with this adaptive mechanism and lead to\nsignificant performance degradation. Moreover, our analysis reveals that even\nsensible use of acknowledgments has very low potential in standard LT codes.\nMotivated by this, we analyze the impact of acknowledgments on multi layer LT\ncodes, i.e. LT codes with unequal error protection. In this case, feedback\nproves advantageous. We show that by using only a single feedback message, it\nis possible to achieve a noticeable performance improvement compared to\nstandard LT codes.\n", "versions": [{"version": "v1", "created": "Mon, 13 Dec 2010 09:47:16 GMT"}], "update_date": "2010-12-14", "authors_parsed": [["Sørensen", "Jesper H.", ""], ["Popovski", "Petar", ""], ["Østergaard", "Jan", ""]]}, {"id": "1012.2751", "submitter": "Yuval Lomnitz", "authors": "Yuval Lomnitz, Meir Feder", "title": "Universal communication part I: modulo additive channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Which communication rates can be attained over a channel whose output is an\nunknown (possibly stochastic) function of the input that may vary arbitrarily\nin time with no a-priori model? Following the spirit of the finite-state\ncompressibility of a sequence, defined by Lempel and Ziv, a \"capacity\" is\ndefined for such a channel as the highest rate achievable by a designer knowing\nthe particular relation that indeed exists between the input and output for all\ntimes, yet is constrained to use a fixed finite-length block communication\nscheme without feedback, i.e. use the same encoder and decoder over each block.\nIn the case of the modulo additive channel, where the output sequence is\nobtained by modulo addition of an unknown individual sequence to the input\nsequence, this capacity is upper bounded by a function of the finite state\ncompressibility of the noise sequence. A universal communication scheme with\nfeedback that attains this capacity universally, without prior knowledge of the\nnoise sequence, is presented.\n", "versions": [{"version": "v1", "created": "Mon, 13 Dec 2010 15:02:43 GMT"}, {"version": "v2", "created": "Mon, 7 May 2012 13:45:48 GMT"}, {"version": "v3", "created": "Wed, 20 Mar 2013 15:19:29 GMT"}], "update_date": "2013-03-21", "authors_parsed": [["Lomnitz", "Yuval", ""], ["Feder", "Meir", ""]]}, {"id": "1012.3059", "submitter": "Daniil Ryabko", "authors": "Boris Ryabko, Daniil Ryabko", "title": "Confidence Sets in Time-Series Filtering", "comments": "some of the results were reported at ISIT2011, St. Petersburg,\n  Russia, pp. 2436-2438", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of filtering of finite-alphabet stationary ergodic time series is\nconsidered. A method for constructing a confidence set for the (unknown) signal\nis proposed, such that the resulting set has the following properties: First,\nit includes the unknown signal with probability $\\gamma$, where $\\gamma$ is a\nparameter supplied to the filter. Second, the size of the confidence sets grows\nexponentially with the rate that is asymptotically equal to the conditional\nentropy of the signal given the data. Moreover, it is shown that this rate is\noptimal.\n", "versions": [{"version": "v1", "created": "Tue, 14 Dec 2010 15:30:35 GMT"}, {"version": "v2", "created": "Sat, 31 Dec 2011 06:04:02 GMT"}, {"version": "v3", "created": "Mon, 9 Jul 2012 13:18:00 GMT"}], "update_date": "2012-07-10", "authors_parsed": [["Ryabko", "Boris", ""], ["Ryabko", "Daniil", ""]]}, {"id": "1012.3198", "submitter": "Hoon Huh", "authors": "Hoon Huh, Antonia M. Tulino, and Giuseppe Caire", "title": "Network MIMO with Linear Zero-Forcing Beamforming: Large System\n  Analysis, Impact of Channel Estimation and Reduced-Complexity Scheduling", "comments": "52 pages, 7 figures, revised and submitted to IEEE Trans. on Inform.\n  Theory (under the 2nd review)", "journal-ref": null, "doi": "10.1109/TIT.2011.2178230", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the downlink of a multi-cell system with multi-antenna base\nstations and single-antenna user terminals, arbitrary base station cooperation\nclusters, distance-dependent propagation pathloss, and general \"fairness\"\nrequirements. Base stations in the same cooperation cluster employ joint\ntransmission with linear zero-forcing beamforming, subject to sum or per-base\nstation power constraints. Inter-cluster interference is treated as noise at\nthe user terminals. Analytic expressions for the system spectral efficiency are\nfound in the large-system limit where both the numbers of users and antennas\nper base station tend to infinity with a given ratio. In particular, for the\nper-base station power constraint, we find new results in random matrix theory,\nyielding the squared Frobenius norm of submatrices of the Moore-Penrose\npseudo-inverse for the structured non-i.i.d. channel matrix resulting from the\ncooperation cluster, user distribution, and path-loss coefficients. The\nanalysis is extended to the case of non-ideal Channel State Information at the\nTransmitters (CSIT) obtained through explicit downlink channel training and\nuplink feedback. Specifically, our results illuminate the trade-off between the\nbenefit of a larger number of cooperating antennas and the cost of estimating\nhigher-dimensional channel vectors. Furthermore, our analysis leads to a new\nsimplified downlink scheduling scheme that pre-selects the users according to\nprobabilities obtained from the large-system results, depending on the desired\nfairness criterion. The proposed scheme performs close to the optimal\n(finite-dimensional) opportunistic user selection while requiring significantly\nless channel state feedback, since only a small fraction of pre-selected users\nmust feed back their channel state information.\n", "versions": [{"version": "v1", "created": "Wed, 15 Dec 2010 00:28:43 GMT"}, {"version": "v2", "created": "Mon, 12 Sep 2011 03:46:57 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Huh", "Hoon", ""], ["Tulino", "Antonia M.", ""], ["Caire", "Giuseppe", ""]]}, {"id": "1012.3201", "submitter": "Qin Huang", "authors": "Qin Huang, Qiuju Diao, Shu Lin and Khaled Abdel-Ghaffar", "title": "Cyclic and Quasi-Cyclic LDPC Codes on Row and Column Constrained\n  Parity-Check Matrices and Their Trapping Sets", "comments": "70 pages, submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is concerned with construction and structural analysis of both\ncyclic and quasi-cyclic codes, particularly LDPC codes. It consists of three\nparts. The first part shows that a cyclic code given by a parity-check matrix\nin circulant form can be decomposed into descendant cyclic and quasi-cyclic\ncodes of various lengths and rates. Some fundamental structural properties of\nthese descendant codes are developed, including the characterizations of the\nroots of the generator polynomial of a cyclic descendant code. The second part\nof the paper shows that cyclic and quasi-cyclic descendant LDPC codes can be\nderived from cyclic finite geometry LDPC codes using the results developed in\nfirst part of the paper. This enlarges the repertoire of cyclic LDPC codes. The\nthird part of the paper analyzes the trapping sets of regular LDPC codes whose\nparity-check matrices satisfy a certain constraint on their rows and columns.\nSeveral classes of finite geometry and finite field cyclic and quasi-cyclic\nLDPC codes with large minimum weights are shown to have no harmful trapping\nsets with size smaller than their minimum weights. Consequently, their\nperformance error-floors are dominated by their minimum weights.\n", "versions": [{"version": "v1", "created": "Wed, 15 Dec 2010 00:39:43 GMT"}], "update_date": "2010-12-16", "authors_parsed": [["Huang", "Qin", ""], ["Diao", "Qiuju", ""], ["Lin", "Shu", ""], ["Abdel-Ghaffar", "Khaled", ""]]}, {"id": "1012.3323", "submitter": "Horia Cornean", "authors": "Francois Bentosela, Horia D. Cornean, Bernard Fleury, Nicola Marchetti", "title": "On the transfer matrix of a MIMO system", "comments": "Accepted for publication in Mathematical Methods in the Applied\n  Sciences", "journal-ref": null, "doi": "10.1002/mma.1415", "report-no": null, "categories": "cs.IT math-ph math.IT math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a deterministic ab-initio model for the input-output relationship\nof a multiple-input multiple-output (MIMO) wireless channel, starting from the\nMaxwell equations combined with Ohm's Law. The main technical tools are\nscattering and geometric perturbation theories. The derived relationship can\nlead us to a deep understanding of how the propagation conditions and the\ncoupling effects between the elements of multiple-element arrays affect the\nproperties of a MIMO channel, e.g. its capacity and its number of degrees of\nfreedom.\n", "versions": [{"version": "v1", "created": "Wed, 15 Dec 2010 13:13:05 GMT"}], "update_date": "2015-10-28", "authors_parsed": [["Bentosela", "Francois", ""], ["Cornean", "Horia D.", ""], ["Fleury", "Bernard", ""], ["Marchetti", "Nicola", ""]]}, {"id": "1012.3439", "submitter": "Daniel Augot", "authors": "Daniel Augot (INRIA Saclay - Ile de France), Morgan Barbier (INRIA\n  Saclay - Ile de France), Alain Couvreur (IMB)", "title": "List-decoding of binary Goppa codes up to the binary Johnson bound", "comments": null, "journal-ref": null, "doi": null, "report-no": "RR-7490", "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the list-decoding problem of alternant codes, with the notable case\nof classical Goppa codes. The major consideration here is to take into account\nthe size of the alphabet, which shows great influence on the list-decoding\nradius. This amounts to compare the \\emph{generic} Johnson bound to the\n\\emph{$q$-ary} Johnson bound. This difference is important when $q$ is very\nsmall. Essentially, the most favourable case is $q=2$, for which the decoding\nradius is greatly improved, notably when the relative minimum distance gets\nclose to 1/2. Even though the announced result, which is the list-decoding\nradius of binary Goppa codes, is new, it can be rather easily made up from\nprevious sources (V. Guruswami, R. M. Roth and I. Tal, R .M. Roth), which may\nbe a little bit unknown, and in which the case of binary Goppa codes has\napparently not been thought at. Only D. J. Bernstein treats the case of binary\nGoppa codes in a preprint. References are given in the introduction. We propose\nan autonomous treatment and also a complexity analysis of the studied\nalgorithm, which is quadratic in the blocklength $n$, when decoding at some\ndistance of the relative maximum decoding radius, and in $O(n^7)$ when reaching\nthe maximum radius.\n", "versions": [{"version": "v1", "created": "Wed, 15 Dec 2010 19:44:13 GMT"}], "update_date": "2010-12-17", "authors_parsed": [["Augot", "Daniel", "", "INRIA Saclay - Ile de France"], ["Barbier", "Morgan", "", "INRIA\n  Saclay - Ile de France"], ["Couvreur", "Alain", "", "IMB"]]}, {"id": "1012.3506", "submitter": "Widad Machmouchi", "authors": "Widad Machmouchi", "title": "Local-Testability and Self-Correctability of q-ary Sparse Linear Codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that q-ary sparse codes with small bias are self-correctable and\nlocally testable. We generalize a result of Kaufman and Sudan that proves the\nlocal testability and correctability of binary sparse codes with small bias. We\nuse properties of q-ary Krawtchouk polynomials and the McWilliams identity\n-that relates the weight distribution of a code to the weight distribution of\nits dual- to derive bounds on the error probability of the randomized tester\nand self-corrector we are analyzing.\n", "versions": [{"version": "v1", "created": "Thu, 16 Dec 2010 03:23:20 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Machmouchi", "Widad", ""]]}, {"id": "1012.3638", "submitter": "Javier Haboba", "authors": "Salvador Javier Haboba, Riccardo Rovatti and Gianluca Setti", "title": "Determination of the Integrated Sidelobe Level of Sets of Rotated\n  Legendre Sequences", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sequences sets with low aperiodic auto- and cross-correlations play an\nimportant role in many applications like communications, radar and other active\nsensing applications. The use of antipodal sequences reduces hardware\nrequirements while increases the difficult of the task of signal design. In\nthis paper we present a method for the computation of the Integrated Sidelobe\nLevel (ISL), and we use it to calculate the asymptotic expression for the ISL\nof a set of sequences formed by different rotations of a Legendre sequence.\n", "versions": [{"version": "v1", "created": "Thu, 16 Dec 2010 15:28:26 GMT"}, {"version": "v2", "created": "Mon, 14 Feb 2011 09:32:45 GMT"}], "update_date": "2011-02-15", "authors_parsed": [["Haboba", "Salvador Javier", ""], ["Rovatti", "Riccardo", ""], ["Setti", "Gianluca", ""]]}, {"id": "1012.3788", "submitter": "Imran Ansari", "authors": "Imran Shafique Ansari and Saad Al-Ahmadi and Ferkan Yilmaz and\n  Mohamed-Slim Alouini and Halim Yanikomeroglu", "title": "A New Formula for the BER of Binary Modulations with Dual-Branch\n  Selection over Generalized-K Composite Fading Channels", "comments": "Diversity schemes, selection combining, dual-branch selection\n  diversity, binary modulation schemes, generalized-K (GK) model, composite\n  fading, bit error rate (BER), and Meijer G-function distribution", "journal-ref": null, "doi": "10.1109/TCOMM.2011.063011.100303A", "report-no": null, "categories": "cs.IT math.IT math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Error performance is one of the main performance measures and derivation of\nits closed-form expression has proved to be quite involved for certain systems.\nIn this letter, a unified closed-form expression, applicable to different\nbinary modulation schemes, for the bit error rate of dual-branch selection\ndiversity based systems undergoing independent but not necessarily identically\ndistributed generalized-K fading is derived in terms of the extended\ngeneralized bivariate Meijer G-function.\n", "versions": [{"version": "v1", "created": "Fri, 17 Dec 2010 00:22:12 GMT"}], "update_date": "2012-05-15", "authors_parsed": [["Ansari", "Imran Shafique", ""], ["Al-Ahmadi", "Saad", ""], ["Yilmaz", "Ferkan", ""], ["Alouini", "Mohamed-Slim", ""], ["Yanikomeroglu", "Halim", ""]]}, {"id": "1012.3790", "submitter": "Yichuan Hu", "authors": "Yichuan Hu, Jianzhong (Charlie) Zhang, Farooq Khan and Ying Li", "title": "Improving PPM Algorithm Using Dictionaries", "comments": "7 pages, 4 figures, longer version for DCC 2011 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a method to improve traditional character-based PPM text\ncompression algorithms. Consider a text file as a sequence of alternating words\nand non-words, the basic idea of our algorithm is to encode non-words and\nprefixes of words using character-based context models and encode suffixes of\nwords using dictionary models. By using dictionary models, the algorithm can\nencode multiple characters as a whole, and thus enhance the compression\nefficiency. The advantages of the proposed algorithm are: 1) it does not\nrequire any text preprocessing; 2) it does not need any explicit codeword to\nidentify switch between context and dictionary models; 3) it can be applied to\nany character-based PPM algorithms without incurring much additional\ncomputational cost. Test results show that significant improvements can be\nobtained over character-based PPM, especially in low order cases.\n", "versions": [{"version": "v1", "created": "Fri, 17 Dec 2010 00:38:58 GMT"}, {"version": "v2", "created": "Sat, 15 Jan 2011 15:12:55 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Hu", "Yichuan", "", "Charlie"], ["Jianzhong", "", "", "Charlie"], ["Zhang", "", ""], ["Khan", "Farooq", ""], ["Li", "Ying", ""]]}, {"id": "1012.3875", "submitter": "Qiang Li", "authors": "Qiang Li and Wing-Kin Ma", "title": "Optimal and Robust Transmit Designs for MISO Channel Secrecy by\n  Semidefinite Programming", "comments": "32 pages, 5 figures; to appear, IEEE Transactions on Signal\n  Processing, 2011", "journal-ref": null, "doi": "10.1109/TSP.2011.2146775", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years there has been growing interest in study of multi-antenna\ntransmit designs for providing secure communication over the physical layer.\nThis paper considers the scenario of an intended multi-input single-output\nchannel overheard by multiple multi-antenna eavesdroppers. Specifically, we\naddress the transmit covariance optimization for secrecy-rate maximization\n(SRM) of that scenario. The challenge of this problem is that it is a nonconvex\noptimization problem. This paper shows that the SRM problem can actually be\nsolved in a convex and tractable fashion, by recasting the SRM problem as a\nsemidefinite program (SDP). The SRM problem we solve is under the premise of\nperfect channel state information (CSI). This paper also deals with the\nimperfect CSI case. We consider a worst-case robust SRM formulation under\nspherical CSI uncertainties, and we develop an optimal solution to it, again\nvia SDP. Moreover, our analysis reveals that transmit beamforming is generally\nthe optimal transmit strategy for SRM of the considered scenario, for both the\nperfect and imperfect CSI cases. Simulation results are provided to illustrate\nthe secrecy-rate performance gains of the proposed SDP solutions compared to\nsome suboptimal transmit designs.\n", "versions": [{"version": "v1", "created": "Fri, 17 Dec 2010 13:13:40 GMT"}, {"version": "v2", "created": "Sun, 17 Apr 2011 12:31:28 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Li", "Qiang", ""], ["Ma", "Wing-Kin", ""]]}, {"id": "1012.4072", "submitter": "Kaibin Huang", "authors": "Kaibin Huang, Vincent K. N. Lau, and Dongku Kim", "title": "Stochastic Control of Event-Driven Feedback in Multi-Antenna\n  Interference Channels", "comments": null, "journal-ref": "IEEE Trans. on Signal Proc., vol. 59, no. 12, pp. 6112 - 6126,\n  Dec. 2011", "doi": "10.1109/TSP.2011.2165063", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spatial interference avoidance is a simple and effective way of mitigating\ninterference in multi-antenna wireless networks. The deployment of this\ntechnique requires channel-state information (CSI) feedback from each receiver\nto all interferers, resulting in substantial network overhead. To address this\nissue, this paper proposes the method of distributive control that\nintelligently allocates CSI bits over multiple feedback links and adapts\nfeedback to channel dynamics. For symmetric channel distributions, it is\noptimal for each receiver to equally allocate the average sum-feedback rate for\ndifferent feedback links, thereby decoupling their control. Using the criterion\nof minimum sum-interference power, the optimal feedback-control policy is shown\nusing stochastic-optimization theory to exhibit opportunism. Specifically, a\nspecific feedback link is turned on only when the corresponding transmit-CSI\nerror is significant or interference-channel gain large, and the optimal number\nof feedback bits increases with this gain. For high mobility and considering\nthe sphere-cap-quantized-CSI model, the optimal feedback-control policy is\nshown to perform water-filling in time, where the number of feedback bits\nincreases logarithmically with the corresponding interference-channel gain.\nFurthermore, we consider asymmetric channel distributions with heterogeneous\npath losses and high mobility, and prove the existence of a unique optimal\npolicy for jointly controlling multiple feedback links. Given the\nsphere-cap-quantized-CSI model, this policy is shown to perform water-filling\nover feedback links. Finally, simulation demonstrates that feedback-control\nyields significant throughput gains compared with the conventional\ndifferential-feedback method.\n", "versions": [{"version": "v1", "created": "Sat, 18 Dec 2010 09:11:36 GMT"}, {"version": "v2", "created": "Sat, 6 Aug 2011 16:54:46 GMT"}, {"version": "v3", "created": "Mon, 27 Feb 2012 04:01:50 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Huang", "Kaibin", ""], ["Lau", "Vincent K. N.", ""], ["Kim", "Dongku", ""]]}, {"id": "1012.4161", "submitter": "Fr\\'ed\\'erique Oggier", "authors": "Jean-Claude Belfiore and Frederique Oggier", "title": "Lattice Code Design for the Rayleigh Fading Wiretap Channel", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has been shown recently that coding for the Gaussian Wiretap Channel can\nbe done with nested lattices. A fine lattice intended to the legitimate user\nmust be designed as a usual lattice code for the Gaussian Channel, while a\ncoarse lattice is added to introduce confusion at the eavesdropper, whose theta\nseries must be minimized. We present a design criterion for both the fine and\ncoarse lattice to obtain wiretap lattice codes for the Rayleigh fading Wiretap\nChannel.\n", "versions": [{"version": "v1", "created": "Sun, 19 Dec 2010 12:23:54 GMT"}], "update_date": "2010-12-21", "authors_parsed": [["Belfiore", "Jean-Claude", ""], ["Oggier", "Frederique", ""]]}, {"id": "1012.4225", "submitter": "Ofer Shayevitz", "authors": "Ofer Shayevitz, Eado Meron, Meir Feder and Ram Zamir", "title": "Delay and Redundancy in Lossless Source Coding", "comments": "IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2014.2331954", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The penalty incurred by imposing a finite delay constraint in lossless source\ncoding of a memoryless source is investigated. It is well known that for the\nso-called block-to-variable and variable-to-variable codes, the redundancy\ndecays at best polynomially with the delay, where in this case the delay is\nidentified with the source block length or maximal source phrase length,\nrespectively. In stark contrast, it is shown that for sequential codes (e.g., a\ndelay-limited arithmetic code) the redundancy can be made to decay\nexponentially with the delay constraint. The corresponding redundancy-delay\nexponent is shown to be at least as good as the R\\'enyi entropy of order 2 of\nthe source, but (for almost all sources) not better than a quantity depending\non the minimal source symbol probability and the alphabet size.\n", "versions": [{"version": "v1", "created": "Mon, 20 Dec 2010 00:54:04 GMT"}, {"version": "v2", "created": "Wed, 23 Jul 2014 11:10:34 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Shayevitz", "Ofer", ""], ["Meron", "Eado", ""], ["Feder", "Meir", ""], ["Zamir", "Ram", ""]]}, {"id": "1012.4241", "submitter": "Udita N Katugampola", "authors": "Udita N. Katugampola", "title": "A New Technique for Text Data Compression", "comments": "Submitted to IJKEDM", "journal-ref": "2012 International Symposium on Computer, Consumer and Control,\n  2012, pp.405-409", "doi": "10.1109/IS3C.2012.109", "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we use ternary representation of numbers for compressing text\ndata. We use a binary map for ternary digits and introduce a way to use the\nbinary 11-pair, which has never been use for coding data before, and we futher\nuse 4-Digits ternary representation of alphabet with lowercase and uppercase\nwith some extra symbols that are most commonly used in day to day life. We find\na way to minimize the length of the bits string, which is only possible in\nternary representation thus drastically reducing the length of the code. We\nalso find some connection between this technique of coding dat and Fibonacci\nnumbers.\n", "versions": [{"version": "v1", "created": "Mon, 20 Dec 2010 05:21:03 GMT"}], "update_date": "2012-06-27", "authors_parsed": [["Katugampola", "Udita N.", ""]]}, {"id": "1012.4250", "submitter": "Catuscia Palamidessi", "authors": "M\\'ario S. Alvim (INRIA Saclay - Ile de France), Konstantinos\n  Chatzikokolakis (TUE), Pierpaolo Degano (DI), Catuscia Palamidessi (INRIA\n  Saclay - Ile de France)", "title": "Differential Privacy versus Quantitative Information Flow", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.DB math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Differential privacy is a notion of privacy that has become very popular in\nthe database community. Roughly, the idea is that a randomized query mechanism\nprovides sufficient privacy protection if the ratio between the probabilities\nof two different entries to originate a certain answer is bound by e^\\epsilon.\nIn the fields of anonymity and information flow there is a similar concern for\ncontrolling information leakage, i.e. limiting the possibility of inferring the\nsecret information from the observables. In recent years, researchers have\nproposed to quantify the leakage in terms of the information-theoretic notion\nof mutual information. There are two main approaches that fall in this\ncategory: One based on Shannon entropy, and one based on R\\'enyi's min entropy.\nThe latter has connection with the so-called Bayes risk, which expresses the\nprobability of guessing the secret. In this paper, we show how to model the\nquery system in terms of an information-theoretic channel, and we compare the\nnotion of differential privacy with that of mutual information. We show that\nthe notion of differential privacy is strictly stronger, in the sense that it\nimplies a bound on the mutual information, but not viceversa.\n", "versions": [{"version": "v1", "created": "Mon, 20 Dec 2010 07:55:35 GMT"}], "update_date": "2010-12-22", "authors_parsed": [["Alvim", "Mário S.", "", "INRIA Saclay - Ile de France"], ["Chatzikokolakis", "Konstantinos", "", "TUE"], ["Degano", "Pierpaolo", "", "DI"], ["Palamidessi", "Catuscia", "", "INRIA\n  Saclay - Ile de France"]]}, {"id": "1012.4290", "submitter": "Andrea Carlo Giuseppe Mennucci", "authors": "Andrea C. G. Mennucci", "title": "Bit recycling for scaling random number generators", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.NA math.PR", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Many Random Number Generators (RNG) are available nowadays; they are divided\nin two categories, hardware RNG, that provide \"true\" random numbers, and\nalgorithmic RNG, that generate pseudo random numbers (PRNG). Both types usually\ngenerate random numbers $(X_n)$ as independent uniform samples in a range\n$0,\\cdots,2^{b-1}$, with $b = 8, 16, 32$ or $b = 64$. In applications, it is\ninstead sometimes desirable to draw random numbers as independent uniform\nsamples $(Y_n)$ in a range $1, \\cdots, M$, where moreover M may change between\ndrawings. Transforming the sequence $(X_n)$ to $(Y_n)$ is sometimes known as\nscaling. We discuss different methods for scaling the RNG, both in term of\nmathematical efficiency and of computational speed.\n", "versions": [{"version": "v1", "created": "Mon, 20 Dec 2010 11:27:57 GMT"}, {"version": "v2", "created": "Thu, 27 Sep 2018 12:36:38 GMT"}], "update_date": "2018-09-28", "authors_parsed": [["Mennucci", "Andrea C. G.", ""]]}, {"id": "1012.4401", "submitter": "Ofer Shayevitz", "authors": "Ofer Shayevitz", "title": "A Note on a Characterization of R\\'enyi Measures and its Relation to\n  Composite Hypothesis Testing", "comments": "Technical report (expanded version of ISIT conference paper\n  ieeexplore.ieee.org/xpls/abs_all.jsp?arnumber=6034266)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The R\\'enyi information measures are characterized in terms of their Shannon\ncounterparts, and properties of the former are recovered from first principle\nvia the associated properties of the latter. Motivated by this\ncharacterization, a two-sensor composite hypothesis testing problem is\npresented, and the optimal worst case miss-detection exponent is obtained in\nterms of a R\\'enyi divergence.\n", "versions": [{"version": "v1", "created": "Mon, 20 Dec 2010 16:50:29 GMT"}, {"version": "v2", "created": "Fri, 11 Mar 2016 09:39:39 GMT"}], "update_date": "2016-03-14", "authors_parsed": [["Shayevitz", "Ofer", ""]]}, {"id": "1012.4519", "submitter": "Philip Schniter", "authors": "Philip Schniter", "title": "Belief-propagation-based joint channel estimation and decoding for\n  spectrally efficient communication over unknown sparse channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider spectrally-efficient communication over a Rayleigh N-block-fading\nchannel with a K- sparse L-length discrete-time impulse response (for 0<K<L<N),\nwhere neither the transmitter nor receiver know the channel's coefficients nor\nits support. Since the high-SNR ergodic capacity of this channel has been shown\nto obey C(SNR) = (1-K/N)log2(SNR)+O(1), any pilot-aided scheme that sacrifices\nmore than K dimensions per fading block to pilots will be spectrally\ninefficient. This causes concern about the conventional \"compressed channel\nsensing\" approach, which uses O(K polylog L) pilots. In this paper, we\ndemonstrate that practical spectrally-efficient communication is indeed\npossible. For this, we propose a novel belief-propagation-based reception\nscheme to use with a standard bit- interleaved coded orthogonal frequency\ndivision multiplexing (OFDM) transmitter. In particular, we leverage the\n\"relaxed belief propagation\" methodology, which allows us to perform joint\nsparse-channel estimation and data decoding with only O(LN) complexity.\nEmpirical results show that our receiver achieves the desired capacity pre-log\nfactor of 1 - K/N and performs near genie-aided bounds at both low and high\nSNR.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 00:57:35 GMT"}, {"version": "v2", "created": "Tue, 31 May 2011 19:42:11 GMT"}], "update_date": "2011-06-01", "authors_parsed": [["Schniter", "Philip", ""]]}, {"id": "1012.4542", "submitter": "Chunhua  Geng", "authors": "Chunhua Geng, Yukui Pei, Jiaqi Zhang and Ning Ge", "title": "Impact of Mistiming on the Achievable Information Rate of Rake Receivers\n  in DS-UWB Systems", "comments": "5 pages, 7 figures, submitted to IEEE VTC 2011 spring in Sept.2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper, we investigate the impact of mistiming on the performance of\nRake receivers in direct-sequence ultra-wideband (DS-UWB) systems from the\nperspective of the achievable information rate. A generalized expression for\nthe performance degradation due to mistiming is derived. Monte Carlo\nsimulations based on this expression are then conducted, which demonstrate that\nthe performance loss has little relationship with the target achievable\ninformation rate, but varies significantly with the system bandwidth and the\nmultipath diversity order, which reflects design trade-offs among the system\ntiming requirement, the bandwidth and the implementation complexity. In\naddition, the performance degradations of Rake receivers with different\nmultipath component selection schemes and combining techniques are compared.\nAmong these receivers, the widely used maximal ratio combining (MRC)\nselective-Rake (S-Rake) suffers the largest performance loss in the presence of\nmistiming.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 04:28:18 GMT"}], "update_date": "2010-12-22", "authors_parsed": [["Geng", "Chunhua", ""], ["Pei", "Yukui", ""], ["Zhang", "Jiaqi", ""], ["Ge", "Ning", ""]]}, {"id": "1012.4552", "submitter": "Xiangyun Zhou", "authors": "Xiangyun Zhou, Radha Krishna Ganti, Jeffrey G. Andrews, Are\n  Hj{\\o}rungnes", "title": "On the Throughput Cost of Physical Layer Security in Decentralized\n  Wireless Networks", "comments": "Accepted for publication in IEEE Transactions on Wireless\n  Communications", "journal-ref": null, "doi": "10.1109/TWC.2011.061511.102257", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the throughput of large-scale decentralized wireless\nnetworks with physical layer security constraints. In particular, we are\ninterested in the question of how much throughput needs to be sacrificed for\nachieving a certain level of security. We consider random networks where the\nlegitimate nodes and the eavesdroppers are distributed according to independent\ntwo-dimensional Poisson point processes. The transmission capacity framework is\nused to characterize the area spectral efficiency of secure transmissions with\nconstraints on both the quality of service (QoS) and the level of security.\nThis framework illustrates the dependence of the network throughput on key\nsystem parameters, such as the densities of legitimate nodes and eavesdroppers,\nas well as the QoS and security constraints. One important finding is that the\nthroughput cost of achieving a moderate level of security is quite low, while\nthroughput must be significantly sacrificed to realize a highly secure network.\nWe also study the use of a secrecy guard zone, which is shown to give a\nsignificant improvement on the throughput of networks with high security\nrequirements.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 06:12:44 GMT"}, {"version": "v2", "created": "Wed, 30 Mar 2011 13:20:39 GMT"}, {"version": "v3", "created": "Mon, 6 Jun 2011 11:15:28 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Zhou", "Xiangyun", ""], ["Ganti", "Radha Krishna", ""], ["Andrews", "Jeffrey G.", ""], ["Hjørungnes", "Are", ""]]}, {"id": "1012.4583", "submitter": "Francois Le Gall", "authors": "Hirotada Kobayashi, Fran\\c{c}ois Le Gall, Harumichi Nishimura, Martin\n  Roetteler", "title": "Constructing Quantum Network Coding Schemes from Classical Nonlinear\n  Protocols", "comments": "14 pages", "journal-ref": "Proceedings 2011 IEEE International Symposium on Information\n  Theory (ISIT 2011), pp. 109-113", "doi": "10.1109/ISIT.2011.6033701", "report-no": null, "categories": "quant-ph cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The k-pair problem in network coding theory asks to send k messages\nsimultaneously between k source-target pairs over a directed acyclic graph. In\na previous paper [ICALP 2009, Part I, pages 622--633] the present authors\nshowed that if a classical k-pair problem is solvable by means of a linear\ncoding scheme, then the quantum k-pair problem over the same graph is also\nsolvable, provided that classical communication can be sent for free between\nany pair of nodes of the graph. Here we address the main case that remained\nopen in our previous work, namely whether nonlinear classical network coding\nschemes can also give rise to quantum network coding schemes. This question is\nmotivated by the fact that there are networks for which there are no linear\nsolutions to the k-pair problem, whereas nonlinear solutions exist. In the\npresent paper we overcome the limitation to linear protocols and describe a new\ncommunication protocol for perfect quantum network coding that improves over\nthe previous one as follows: (i) the new protocol does not put any condition on\nthe underlying classical coding scheme, that is, it can simulate nonlinear\ncommunication protocols as well, and (ii) the amount of classical communication\nsent in the protocol is significantly reduced.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 09:50:34 GMT"}], "update_date": "2016-05-30", "authors_parsed": [["Kobayashi", "Hirotada", ""], ["Gall", "François Le", ""], ["Nishimura", "Harumichi", ""], ["Roetteler", "Martin", ""]]}, {"id": "1012.4668", "submitter": "Dragana Bajovic", "authors": "Dragana Bajovic, Dusan Jakovetic, Joao Xavier, Bruno Sinopoli and Jose\n  M. F. Moura", "title": "Distributed Detection over Random Networks: Large Deviations Performance\n  Analysis", "comments": "30 pages, journal, submitted on December 3rd, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the large deviations performance, i.e., the exponential decay rate\nof the error probability, of distributed detection algorithms over random\nnetworks. At each time step $k$ each sensor: 1) averages its decision variable\nwith the neighbors' decision variables; and 2) accounts on-the-fly for its new\nobservation. We show that distributed detection exhibits a \"phase change\"\nbehavior. When the rate of network information flow (the speed of averaging) is\nabove a threshold, then distributed detection is asymptotically equivalent to\nthe optimal centralized detection, i.e., the exponential decay rate of the\nerror probability for distributed detection equals the Chernoff information.\nWhen the rate of information flow is below a threshold, distributed detection\nachieves only a fraction of the Chernoff information rate; we quantify this\nachievable rate as a function of the network rate of information flow.\nSimulation examples demonstrate our theoretical findings on the behavior of\ndistributed detection over random networks.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 14:21:54 GMT"}], "update_date": "2010-12-22", "authors_parsed": [["Bajovic", "Dragana", ""], ["Jakovetic", "Dusan", ""], ["Xavier", "Joao", ""], ["Sinopoli", "Bruno", ""], ["Moura", "Jose M. F.", ""]]}, {"id": "1012.4715", "submitter": "Yuval Kochman", "authors": "Anatoly Khina, Yuval Kochman and Uri Erez", "title": "Joint Unitary Triangularization for MIMO Networks", "comments": "Submitted to IEEE Tran. Signal Processing. Revised version", "journal-ref": null, "doi": "10.1109/TSP.2011.2171684", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work considers communication networks where individual links can be\ndescribed as MIMO channels. Unlike orthogonal modulation methods (such as the\nsingular-value decomposition), we allow interference between sub-channels,\nwhich can be removed by the receivers via successive cancellation. The degrees\nof freedom earned by this relaxation are used for obtaining a basis which is\nsimultaneously good for more than one link. Specifically, we derive necessary\nand sufficient conditions for shaping the ratio vector of sub-channel gains of\ntwo broadcast-channel receivers. We then apply this to two scenarios: First, in\ndigital multicasting we present a practical capacity-achieving scheme which\nonly uses scalar codes and linear processing. Then, we consider the joint\nsource-channel problem of transmitting a Gaussian source over a two-user MIMO\nchannel, where we show the existence of non-trivial cases, where the optimal\ndistortion pair (which for high signal-to-noise ratios equals the optimal\npoint-to-point distortions of the individual users) may be achieved by\nemploying a hybrid digital-analog scheme over the induced equivalent channel.\nThese scenarios demonstrate the advantage of choosing a modulation basis based\nupon multiple links in the network, thus we coin the approach \"network\nmodulation\".\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 16:12:09 GMT"}, {"version": "v2", "created": "Sat, 14 May 2011 20:08:41 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Khina", "Anatoly", ""], ["Kochman", "Yuval", ""], ["Erez", "Uri", ""]]}, {"id": "1012.4755", "submitter": "Emmanuel Abbe A", "authors": "Emmanuel Abbe", "title": "Mutual information, matroids and extremal dependencies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, it is shown that the rank function of a matroid can be\nrepresented by a \"mutual information function\" if and only if the matroid is\nbinary. The mutual information function considered is the one measuring the\namount of information between the inputs (binary uniform) and the output of a\nmultiple access channel (MAC). Moreover, it is shown that a MAC whose mutual\ninformation function is integer valued is \"equivalent\" to a linear\ndeterministic MAC, in the sense that it essentially contains at the output no\nmore information than some linear forms of the inputs. These notes put emphasis\non the connection between mutual information functionals and rank functions in\nmatroid theory, without assuming prior knowledge on these two subjects. The\nfirst section introduces mutual information functionals, the second section\nintroduces basic notions of matroid theory, and the third section connects\nthese two subjects. It is also shown that entropic matroids studied in the\nliterature correspond to specific cases of MAC matroids.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 18:18:13 GMT"}], "update_date": "2010-12-22", "authors_parsed": [["Abbe", "Emmanuel", ""]]}, {"id": "1012.4814", "submitter": "Joseph M. Renes", "authors": "Joseph M. Renes and Renato Renner", "title": "Noisy channel coding via privacy amplification and information\n  reconciliation", "comments": "8 pages, 2 figures. v2: final version for publication", "journal-ref": "IEEE Transactions on Information Theory 57, 7377 (2011)", "doi": "10.1109/TIT.2011.2162226", "report-no": null, "categories": "quant-ph cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that optimal protocols for noisy channel coding of public or private\ninformation over either classical or quantum channels can be directly\nconstructed from two more primitive information-theoretic tools: privacy\namplification and information reconciliation, also known as data compression\nwith side information. We do this in the one-shot scenario of structureless\nresources, and formulate our results in terms of the smooth min- and\nmax-entropy. In the context of classical information theory, this shows that\nessentially all two-terminal protocols can be reduced to these two primitives,\nwhich are in turn governed by the smooth min- and max-entropies, respectively.\nIn the context of quantum information theory, the recently-established duality\nof these two protocols means essentially all two-terminal protocols can be\nconstructed using just a single primitive.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 21:25:44 GMT"}, {"version": "v2", "created": "Sat, 24 Mar 2012 13:39:55 GMT"}], "update_date": "2012-03-27", "authors_parsed": [["Renes", "Joseph M.", ""], ["Renner", "Renato", ""]]}, {"id": "1012.4905", "submitter": "Francisco J. Plaza Martin", "authors": "J. I. Iglesias Curto, J. M. Mu\\~noz Porras, F. J. Plaza Mart\\'in, and\n  G Serrano Sotelo", "title": "Convolutional Goppa codes defined on fibrations", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a new class of Convolutional Codes in terms of fibrations of\nalgebraic varieties generalizaing our previous constructions of Convolutional\nGoppa Codes. Using this general construction we can give several examples of\nMaximum Distance Separable (MDS) Convolutional Codes.\n", "versions": [{"version": "v1", "created": "Wed, 22 Dec 2010 08:40:10 GMT"}], "update_date": "2010-12-23", "authors_parsed": [["Curto", "J. I. Iglesias", ""], ["Porras", "J. M. Muñoz", ""], ["Martín", "F. J. Plaza", ""], ["Sotelo", "G Serrano", ""]]}, {"id": "1012.4924", "submitter": "Francois Baccelli", "authors": "Venkat Anantharam and Francois Baccelli", "title": "Information-Theoretic Capacity and Error Exponents of Stationary Point\n  Processes under Random Additive Displacements", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the Shannon regime for the random displacement of\nstationary point processes. Let each point of some initial stationary point\nprocess in $\\R^n$ give rise to one daughter point, the location of which is\nobtained by adding a random vector to the coordinates of the mother point, with\nall displacement vectors independently and identically distributed for all\npoints. The decoding problem is then the following one: the whole mother point\nprocess is known as well as the coordinates of some daughter point; the\ndisplacements are only known through their law; can one find the mother of this\ndaughter point? The Shannon regime is that where the dimension $n$ tends to\ninfinity and where the logarithm of the intensity of the point process is\nproportional to $n$. We show that this problem exhibits a sharp threshold: if\nthe sum of the proportionality factor and of the differential entropy rate of\nthe noise is positive, then the probability of finding the right mother point\ntends to 0 with $n$ for all point processes and decoding strategies. If this\nsum is negative, there exist mother point processes, for instance Poisson, and\ndecoding strategies, for instance maximum likelihood, for which the probability\nof finding the right mother tends to 1 with $n$. We then use large deviations\ntheory to show that in the latter case, if the entropy spectrum of the noise\nsatisfies a large deviation principle, then the error probability goes\nexponentially fast to 0 with an exponent that is given in closed form in terms\nof the rate function of the noise entropy spectrum. This is done for two\nclasses of mother point processes: Poisson and Mat\\'ern. The practical interest\nto information theory comes from the explicit connection that we also establish\nbetween this problem and the estimation of error exponents in Shannon's\nadditive noise channel with power constraints on the codewords.\n", "versions": [{"version": "v1", "created": "Wed, 22 Dec 2010 10:13:40 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Anantharam", "Venkat", ""], ["Baccelli", "Francois", ""]]}, {"id": "1012.4928", "submitter": "Reza  Parhizkar", "authors": "Reza Parhizkar, Amin Karbasi, Sewoong Oh, Martin Vetterli", "title": "Calibration Using Matrix Completion with Application to Ultrasound\n  Tomography", "comments": "submitted to IEEE Transaction on Signal Processing", "journal-ref": null, "doi": "10.1109/TSP.2013.2272925", "report-no": null, "categories": "cs.LG cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the calibration process in circular ultrasound tomography devices\nwhere the sensor positions deviate from the circumference of a perfect circle.\nThis problem arises in a variety of applications in signal processing ranging\nfrom breast imaging to sensor network localization. We introduce a novel method\nof calibration/localization based on the time-of-flight (ToF) measurements\nbetween sensors when the enclosed medium is homogeneous. In the presence of all\nthe pairwise ToFs, one can easily estimate the sensor positions using\nmulti-dimensional scaling (MDS) method. In practice however, due to the\ntransitional behaviour of the sensors and the beam form of the transducers, the\nToF measurements for close-by sensors are unavailable. Further, random\nmalfunctioning of the sensors leads to random missing ToF measurements. On top\nof the missing entries, in practice an unknown time delay is also added to the\nmeasurements. In this work, we incorporate the fact that a matrix defined from\nall the ToF measurements is of rank at most four. In order to estimate the\nmissing ToFs, we apply a state-of-the-art low-rank matrix completion algorithm,\nOPTSPACE . To find the correct positions of the sensors (our ultimate goal) we\nthen apply MDS. We show analytic bounds on the overall error of the whole\nprocess in the presence of noise and hence deduce its robustness. Finally, we\nconfirm the functionality of our method in practice by simulations mimicking\nthe measurements of a circular ultrasound tomography device.\n", "versions": [{"version": "v1", "created": "Wed, 22 Dec 2010 10:30:26 GMT"}, {"version": "v2", "created": "Tue, 11 Oct 2011 23:42:37 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Parhizkar", "Reza", ""], ["Karbasi", "Amin", ""], ["Oh", "Sewoong", ""], ["Vetterli", "Martin", ""]]}, {"id": "1012.5041", "submitter": "Pablo S\\'anchez-Moreno", "authors": "P. S\\'anchez-Moreno, A. Zarzo and J.S. Dehesa", "title": "Jensen divergence based on Fisher's information", "comments": "8 pages, 8 figures", "journal-ref": "J. Phys. A: Math. Theor. 45 (2012) 125305", "doi": "10.1088/1751-8113/45/12/125305", "report-no": null, "categories": "cs.IT math.IT physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The measure of Jensen-Fisher divergence between probability distributions is\nintroduced and its theoretical grounds set up. This quantity, in contrast to\nthe remaining Jensen divergences, is very sensitive to the fluctuations of the\nprobability distributions because it is controlled by the (local) Fisher\ninformation, which is a gradient functional of the distribution. So, it is\nappropriate and informative when studying the similarity of distributions,\nmainly for those having oscillatory character. The new Jensen-Fisher divergence\nshares with the Jensen-Shannon divergence the following properties:\nnon-negativity, additivity when applied to an arbitrary number of probability\ndensities, symmetry under exchange of these densities, vanishing if and only if\nall the densities are equal, and definiteness even when these densities present\nnon-common zeros. Moreover, the Jensen-Fisher divergence is shown to be\nexpressed in terms of the relative Fisher information as the Jensen-Shannon\ndivergence does in terms of the Kullback-Leibler or relative Shannon entropy.\nFinally the Jensen-Shannon and Jensen-Fisher divergences are compared for the\nfollowing three large, non-trivial and qualitatively different families of\nprobability distributions: the sinusoidal, generalized gamma-like and\nRakhmanov-Hermite distributions.\n", "versions": [{"version": "v1", "created": "Wed, 22 Dec 2010 17:15:17 GMT"}], "update_date": "2013-01-08", "authors_parsed": [["Sánchez-Moreno", "P.", ""], ["Zarzo", "A.", ""], ["Dehesa", "J. S.", ""]]}, {"id": "1012.5071", "submitter": "Iddo Naiss", "authors": "Iddo Naiss and Haim Permuter", "title": "Extension of the Blahut-Arimoto algorithm for maximizing directed\n  information", "comments": "28 pages, 13 figures, 34 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend the Blahut-Arimoto algorithm for maximizing Massey's directed\ninformation. The algorithm can be used for estimating the capacity of channels\nwith delayed feedback, where the feedback is a deterministic function of the\noutput. In order to do so, we apply the ideas from the regular Blahut-Arimoto\nalgorithm, i.e., the alternating maximization procedure, onto our new problem.\nWe provide both upper and lower bound sequences that converge to the optimum\nvalue. Our main insight in this paper is that in order to find the maximum of\nthe directed information over causal conditioning probability mass function\n(PMF), one can use a backward index time maximization combined with the\nalternating maximization procedure. We give a detailed description of the\nalgorithm, its complexity, the memory needed, and several numerical examples.\n", "versions": [{"version": "v1", "created": "Wed, 22 Dec 2010 18:50:41 GMT"}, {"version": "v2", "created": "Mon, 27 Dec 2010 10:44:49 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Naiss", "Iddo", ""], ["Permuter", "Haim", ""]]}, {"id": "1012.5174", "submitter": "Salah A. Aly", "authors": "Salah A. Aly, Nirwan Ansari, H. Vincent Poor", "title": "SNEED: Enhancing Network Security Services Using Network Coding and\n  Joint Capacity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional network security protocols depend mainly on developing\ncryptographic schemes and on using biometric methods. These have led to several\nnetwork security protocols that are unbreakable based on difficulty of solving\nuntractable mathematical problems such as factoring large integers.\n  In this paper, Security of Networks Employing Encoding and Decoding (SNEED)\nis developed to mitigate single and multiple link attacks. Network coding and\nshared capacity among the working paths are used to provide data protection and\ndata integrity against network attackers and eavesdroppers.\n  SNEED can be incorporated into various applications in on-demand TV,\nsatellite communications and multimedia security. Finally, It is shown that\nSNEED can be implemented easily where there are k edge disjoint paths between\ntwo core nodes (routers or switches) in an enterprize network.\n", "versions": [{"version": "v1", "created": "Thu, 23 Dec 2010 11:04:35 GMT"}], "update_date": "2010-12-24", "authors_parsed": [["Aly", "Salah A.", ""], ["Ansari", "Nirwan", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1012.5197", "submitter": "Xiujie Huang", "authors": "Xiujie Huang, Xiao Ma, Lei Lin, Baoming Bai", "title": "Accessible Capacity of Secondary Users", "comments": "42 pages, 12 figures, 2 tables; Submitted to IEEE Transactions on\n  Information Theory on December, 2010, Revised on November, 2013", "journal-ref": null, "doi": "10.1109/TIT.2014.2328584", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new problem formulation is presented for the Gaussian interference channels\n(GIFC) with two pairs of users, which are distinguished as primary users and\nsecondary users, respectively. The primary users employ a pair of encoder and\ndecoder that were originally designed to satisfy a given error performance\nrequirement under the assumption that no interference exists from other users.\nIn the scenario when the secondary users attempt to access the same medium, we\nare interested in the maximum transmission rate (defined as {\\em accessible\ncapacity}) at which secondary users can communicate reliably without affecting\nthe error performance requirement by the primary users under the constraint\nthat the primary encoder (not the decoder) is kept unchanged. By modeling the\nprimary encoder as a generalized trellis code (GTC), we are then able to treat\nthe secondary link and the cross link from the secondary transmitter to the\nprimary receiver as finite state channels (FSCs). Based on this, upper and\nlower bounds on the accessible capacity are derived. The impact of the error\nperformance requirement by the primary users on the accessible capacity is\nanalyzed by using the concept of interference margin. In the case of\nnon-trivial interference margin, the secondary message is split into common and\nprivate parts and then encoded by superposition coding, which delivers a lower\nbound on the accessible capacity. For some special cases, these bounds can be\ncomputed numerically by using the BCJR algorithm. Numerical results are also\nprovided to gain insight into the impacts of the GTC and the error performance\nrequirement on the accessible capacity.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 06:26:38 GMT"}, {"version": "v2", "created": "Fri, 20 Sep 2013 01:00:23 GMT"}, {"version": "v3", "created": "Thu, 5 Dec 2013 13:10:24 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Huang", "Xiujie", ""], ["Ma", "Xiao", ""], ["Lin", "Lei", ""], ["Bai", "Baoming", ""]]}, {"id": "1012.5224", "submitter": "Soren Riis", "authors": "Soren Riis and Maximilien Gadouleau", "title": "Max-Flow Min-Cut Theorems for Multi-User Communication Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.LO math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents four distinct new ideas and results for communication\nnetworks:\n  1) We show that relay-networks (i.e. communication networks where different\nnodes use the same coding functions) can be used to model dynamic networks.\n  2) We introduce {\\em the term model}, which is a simple, graph-free symbolic\napproach to communication networks.\n  3) We state and prove variants of a theorem concerning the dispersion of\ninformation in single-receiver communications.\n  4) We show that the solvability of an abstract multi-user communication\nproblem is equivalent to the solvability of a single-target communication in a\nsuitable relay network.\n  In the paper, we develop a number of technical ramifications of these ideas\nand results. One technical result is a max-flow min-cut theorem for the R\\'enyi\nentropy with order less than one, given that the sources are equiprobably\ndistributed; conversely, we show that the max-flow min-cut theorem fails for\nthe R\\'enyi entropy with order greater than one. We leave the status of the\ntheorem with regards to the ordinary Shannon Entropy measure (R\\'enyi entropy\nof order one and the limit case between validity or failure of the theorem) as\nan open question. In non-dynamic static communication networks with a single\nreceiver, a simple application of Menger's theorem shows that the optimal\nthroughput can be achieved without proper use of network coding i.e. just by\nusing ordinary packet-switching. This fails dramatically in relay networks with\na single receiver. We show that even a powerful method like linear network\ncoding fails miserably for relay networks. With that in mind, it is noticeable\nthat our rather weak form of network coding (routing with dynamic headers) is\nasymptotically sufficient to reach capacity.\n", "versions": [{"version": "v1", "created": "Thu, 23 Dec 2010 15:09:14 GMT"}, {"version": "v2", "created": "Tue, 1 Mar 2011 15:39:06 GMT"}, {"version": "v3", "created": "Wed, 15 Oct 2014 23:46:43 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Riis", "Soren", ""], ["Gadouleau", "Maximilien", ""]]}, {"id": "1012.5318", "submitter": "Sergei Viznyuk", "authors": "Sergei Viznyuk", "title": "Condensation into ground state in binary string models", "comments": "6 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ensemble of binary strings defined via strong-interaction model exhibits\nenhanced condensation (collapse) into ground state below certain temperature.\nThe non-interaction model shows gradual accumulation into ground state as\ntemperature approaches zero\n", "versions": [{"version": "v1", "created": "Thu, 23 Dec 2010 23:35:10 GMT"}], "update_date": "2010-12-27", "authors_parsed": [["Viznyuk", "Sergei", ""]]}, {"id": "1012.5327", "submitter": "Paulo Urriza", "authors": "Paulo Urriza, Eric Rebeiz, Przemys{\\l}aw Pawe{\\l}czak, and Danijela\n  \\v{C}abri\\'c", "title": "Computationally Efficient Modulation Level Classification Based on\n  Probability Distribution Distance Functions", "comments": "3 pages, resubmitted to IEEE Communication Letters (modified based on\n  reviewer comments)", "journal-ref": null, "doi": "10.1109/LCOMM.2011.032811.110316", "report-no": null, "categories": "cs.IT cs.PF math.IT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a novel modulation level classification (MLC) method based on\nprobability distribution distance functions. The proposed method uses modified\nKuiper and Kolmogorov-Smirnov distances to achieve low computational complexity\nand outperforms the state of the art methods based on cumulants and\ngoodness-of-fit tests. We derive the theoretical performance of the proposed\nMLC method and verify it via simulations. The best classification accuracy,\nunder AWGN with SNR mismatch and phase jitter, is achieved with the proposed\nMLC method using Kuiper distances.\n", "versions": [{"version": "v1", "created": "Fri, 24 Dec 2010 00:22:12 GMT"}, {"version": "v2", "created": "Mon, 27 Dec 2010 07:37:00 GMT"}, {"version": "v3", "created": "Sat, 19 Feb 2011 03:51:24 GMT"}], "update_date": "2011-09-05", "authors_parsed": [["Urriza", "Paulo", ""], ["Rebeiz", "Eric", ""], ["Pawełczak", "Przemysław", ""], ["Čabrić", "Danijela", ""]]}, {"id": "1012.5339", "submitter": "Hongchao Zhou", "authors": "Hongchao Zhou and Jehoshua Bruck", "title": "Efficient Generation of Random Bits from Finite State Markov Chains", "comments": "14 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of random number generation from an uncorrelated random source\n(of unknown probability distribution) dates back to von Neumann's 1951 work.\nElias (1972) generalized von Neumann's scheme and showed how to achieve optimal\nefficiency in unbiased random bits generation. Hence, a natural question is\nwhat if the sources are correlated? Both Elias and Samuelson proposed methods\nfor generating unbiased random bits in the case of correlated sources (of\nunknown probability distribution), specifically, they considered finite Markov\nchains. However, their proposed methods are not efficient or have\nimplementation difficulties. Blum (1986) devised an algorithm for efficiently\ngenerating random bits from degree-2 finite Markov chains in expected linear\ntime, however, his beautiful method is still far from optimality on\ninformation-efficiency. In this paper, we generalize Blum's algorithm to\narbitrary degree finite Markov chains and combine it with Elias's method for\nefficient generation of unbiased bits. As a result, we provide the first known\nalgorithm that generates unbiased random bits from an arbitrary finite Markov\nchain, operates in expected linear time and achieves the information-theoretic\nupper bound on efficiency.\n", "versions": [{"version": "v1", "created": "Fri, 24 Dec 2010 03:44:36 GMT"}], "update_date": "2010-12-27", "authors_parsed": [["Zhou", "Hongchao", ""], ["Bruck", "Jehoshua", ""]]}, {"id": "1012.5340", "submitter": "Jun Zhang Dr.", "authors": "Jun Zhang, Jun Wang, and Guangwu Xu", "title": "Relations between $\\beta$ and $\\delta$ for QP and LP in Compressed\n  Sensing Computations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many compressed sensing applications, linear programming (LP) has been\nused to reconstruct a sparse signal. When observation is noisy, the LP\nformulation is extended to allow an inequality constraint and the solution is\ndependent on a parameter $\\delta$, related to the observation noise level.\nRecently, some researchers also considered quadratic programming (QP) for\ncompressed sensing signal reconstruction and the solution in this case is\ndependent on a Lagrange multiplier $\\beta$. In this work, we investigated the\nrelation between $\\delta$ and $\\beta$ and derived an upper and a lower bound on\n$\\beta$ in terms of $\\delta$. For a given $\\delta$, these bounds can be used to\napproximate $\\beta$. Since $\\delta$ is a physically related quantity and easy\nto determine for an application while there is no easy way in general to\ndetermine $\\beta$, our results can be used to set $\\beta$ when the QP is used\nfor compressed sensing. Our results and experimental verification also provide\nsome insight into the solutions generated by compressed sensing.\n", "versions": [{"version": "v1", "created": "Fri, 24 Dec 2010 04:11:42 GMT"}], "update_date": "2010-12-27", "authors_parsed": [["Zhang", "Jun", ""], ["Wang", "Jun", ""], ["Xu", "Guangwu", ""]]}, {"id": "1012.5430", "submitter": "Moshe Schwartz", "authors": "Anxiao (Andrew) Jiang, Michael Langberg, Moshe Schwartz, and Jehoshua\n  Bruck", "title": "Trajectory Codes for Flash Memory", "comments": "Submitted to IEEE Trans. on Inform. Theory", "journal-ref": null, "doi": "10.1109/TIT.2013.2251755", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flash memory is well-known for its inherent asymmetry: the flash-cell charge\nlevels are easy to increase but are hard to decrease. In a general rewriting\nmodel, the stored data changes its value with certain patterns. The patterns of\ndata updates are determined by the data structure and the application, and are\nindependent of the constraints imposed by the storage medium. Thus, an\nappropriate coding scheme is needed so that the data changes can be updated and\nstored efficiently under the storage-medium's constraints.\n  In this paper, we define the general rewriting problem using a graph model.\nIt extends many known rewriting models such as floating codes, WOM codes,\nbuffer codes, etc. We present a new rewriting scheme for flash memories, called\nthe trajectory code, for rewriting the stored data as many times as possible\nwithout block erasures. We prove that the trajectory code is asymptotically\noptimal in a wide range of scenarios.\n  We also present randomized rewriting codes optimized for expected performance\n(given arbitrary rewriting sequences). Our rewriting codes are shown to be\nasymptotically optimal.\n", "versions": [{"version": "v1", "created": "Fri, 24 Dec 2010 20:34:37 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Anxiao", "", "", "Andrew"], ["Jiang", "", ""], ["Langberg", "Michael", ""], ["Schwartz", "Moshe", ""], ["Bruck", "Jehoshua", ""]]}, {"id": "1012.5454", "submitter": "Mohammed Eltayeb", "authors": "Syed Qaseem, Tareq Al-Naffouri, Mohammed Eltayeb, Hamid Reza Bahrami", "title": "Compressed Sensing for Feedback Reduction in MIMO Broadcast Channels", "comments": "This paper has been withdrawn by the author due to a crucial sign\n  error in equation 1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a generalized feedback model and compressive sensing based\nopportunistic feedback schemes for feedback resource reduction in MIMO\nBroadcast Channels under the assumption that both uplink and downlink channels\nundergo block Rayleigh fading. Feedback resources are shared and are\nopportunistically accessed by users who are strong, i.e. users whose channel\nquality information is above a certain fixed threshold. Strong users send the\nsame feedback information on all shared channels. They are identified by the\nbase station via compressive sensing. Both analog and digital feedbacks are\nconsidered. The proposed analog & digital opportunistic feedback schemes are\nshown to achieve the same sum-rate throughput as that achieved by dedicated\nfeedback schemes, but with feedback channels growing only logarithmically with\nnumber of users. Moreover, there is also a reduction in the feedback load. In\nthe analog feedback case, we show that the proposed scheme reduces the feedback\nnoise which eventually results in better throughput, whereas in the digital\nfeedback case the proposed scheme in a noisy scenario achieves almost the\nthroughput obtained in a noiseless dedicated feedback scenario. We also show\nthat for a given fixed budget of feedback bits, there exists a trade-off\nbetween the number of shared channels and thresholds accuracy of the fed back\nSNR.\n", "versions": [{"version": "v1", "created": "Sat, 25 Dec 2010 05:54:06 GMT"}, {"version": "v2", "created": "Fri, 13 Feb 2015 21:50:22 GMT"}], "update_date": "2015-02-17", "authors_parsed": [["Qaseem", "Syed", ""], ["Al-Naffouri", "Tareq", ""], ["Eltayeb", "Mohammed", ""], ["Bahrami", "Hamid Reza", ""]]}, {"id": "1012.5464", "submitter": "Akihiro Munemasa", "authors": "Masaaki Harada and Akihiro Munemasa", "title": "Classification of self-dual codes of length 36", "comments": "10 pages, minor revision", "journal-ref": "Advances Math. Communications 6 (2012), 229-235", "doi": null, "report-no": null, "categories": "math.CO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A complete classification of binary self-dual codes of length 36 is given.\n", "versions": [{"version": "v1", "created": "Sat, 25 Dec 2010 11:59:37 GMT"}, {"version": "v2", "created": "Thu, 22 Mar 2012 08:47:43 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Harada", "Masaaki", ""], ["Munemasa", "Akihiro", ""]]}, {"id": "1012.5498", "submitter": "Somphong Jitman", "authors": "Somphong Jitman, San Ling, Hongwei Liu, and Xiaoli Xie", "title": "Checkable Codes from Group Rings", "comments": "9 pages, 4 tables, Submitted to IEEE Transactions on Information\n  Theory, December 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.AC math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study codes with a single check element derived from group rings, namely,\ncheckable codes. The notion of a code-checkable group ring is introduced.\nNecessary and sufficient conditions for a group ring to be code-checkable are\ngiven in the case where the group is a finite abelian group and the ring is a\nfinite field. This characterization leads to many good examples, among which\ntwo checkable codes and two shortened codes have minimum distance better than\nthe lower bound given in Grassl's online table. Furthermore, when a group ring\nis code-checkable, it is shown that every code in such a group ring admits a\ngenerator, and that its dual is also generated by an element which may be\ndeduced directly from a check element of the original code. These are analogous\nto the generator and parity-check polynomials of cyclic codes. In addition, the\nstructures of reversible and complementary dual checkable codes are established\nas generalizations of reversible and complementary dual cyclic codes.\n", "versions": [{"version": "v1", "created": "Sun, 26 Dec 2010 08:34:06 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Jitman", "Somphong", ""], ["Ling", "San", ""], ["Liu", "Hongwei", ""], ["Xie", "Xiaoli", ""]]}, {"id": "1012.5553", "submitter": "Uri Erez", "authors": "Or Ordentlich and Uri Erez", "title": "Cyclic-Coded Integer-Forcing Equalization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A discrete-time intersymbol interference channel with additive Gaussian noise\nis considered, where only the receiver has knowledge of the channel impulse\nresponse. An approach for combining decision-feedback equalization with channel\ncoding is proposed, where decoding precedes the removal of intersymbol\ninterference. This is accomplished by combining the recently proposed\ninteger-forcing equalization approach with cyclic block codes. The channel\nimpulse response is linearly equalized to an integer-valued response. This is\nthen utilized by leveraging the property that a cyclic code is closed under\n(cyclic) integer-valued convolution. Explicit bounds on the performance of the\nproposed scheme are also derived.\n", "versions": [{"version": "v1", "created": "Mon, 27 Dec 2010 01:04:30 GMT"}, {"version": "v2", "created": "Wed, 5 Jan 2011 20:31:49 GMT"}, {"version": "v3", "created": "Thu, 23 Jun 2011 13:51:04 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Ordentlich", "Or", ""], ["Erez", "Uri", ""]]}, {"id": "1012.5693", "submitter": "Guoqiang Mao Dr", "authors": "Guoqiang Mao and Brian DO Anderson", "title": "On the Asymptotic Connectivity of Random Networks under the Random\n  Connection Model", "comments": "9 pages, to appear in IEEE INFOCOM 2011, Shanghai, China", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a network where all nodes are distributed on a unit square following\na Poisson distribution with known density $\\rho$ and a pair of nodes separated\nby an Euclidean distance $x$ are directly connected with probability\n$g(\\frac{x}{r_{\\rho}})$, where $g:[0,\\infty)\\rightarrow[0,1]$ satisfies three\nconditions: rotational invariance, non-increasing monotonicity and integral\nboundedness, $r_{\\rho}=\\sqrt{\\frac{\\log\\rho+b}{C\\rho}}$,\n$C=\\int_{\\Re^{2}}g(\\Vert \\boldsymbol{x}\\Vert)d\\boldsymbol{x}$ and $b$ is a\nconstant, independent of the event that another pair of nodes are directly\nconnected. In this paper, we analyze the asymptotic distribution of the number\nof isolated nodes in the above network using the Chen-Stein technique and the\nimpact of the boundary effect on the number of isolated nodes as\n$\\rho\\rightarrow\\infty$. On that basis we derive a necessary condition for the\nabove network to be asymptotically almost surely connected. These results form\nan important link in expanding recent results on the connectivity of the random\ngeometric graphs from the commonly used unit disk model to the more generic and\nmore practical random connection model.\n", "versions": [{"version": "v1", "created": "Tue, 28 Dec 2010 04:18:02 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Mao", "Guoqiang", ""], ["Anderson", "Brian DO", ""]]}, {"id": "1012.5723", "submitter": "Guoqiang Mao Dr", "authors": "Guoqiang Mao and Brian DO Anderson", "title": "Towards a Better Understanding of Large Scale Network Models", "comments": "This is an extended version of a paper with the same title that has\n  been accepted for publication at IEEE/ACM Transactions on Networking (Proof\n  of Theorem 4 was not included in the paper.)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Connectivity and capacity are two fundamental properties of wireless\nmulti-hop networks. The scalability of these properties has been a primary\nconcern for which asymptotic analysis is a useful tool. Three related but\nlogically distinct network models are often considered in asymptotic analyses,\nviz. the dense network model, the extended network model and the infinite\nnetwork model, which consider respectively a network deployed in a fixed finite\narea with a sufficiently large node density, a network deployed in a\nsufficiently large area with a fixed node density, and a network deployed in\n$\\Re^{2}$ with a sufficiently large node density. The infinite network model\noriginated from continuum percolation theory and asymptotic results obtained\nfrom the infinite network model have often been applied to the dense and\nextended networks. In this paper, through two case studies related to network\nconnectivity on the expected number of isolated nodes and on the vanishing of\ncomponents of finite order k>1 respectively, we demonstrate some subtle but\nimportant differences between the infinite network model and the dense and\nextended network models. Therefore extra scrutiny has to be used in order for\nthe results obtained from the infinite network model to be applicable to the\ndense and extended network models. Asymptotic results are also obtained on the\nexpected number of isolated nodes, the vanishingly small impact of the boundary\neffect on the number of isolated nodes and the vanishing of components of\nfinite order k>1 in the dense and extended network models using a generic\nrandom connection model.\n", "versions": [{"version": "v1", "created": "Tue, 28 Dec 2010 08:56:30 GMT"}, {"version": "v2", "created": "Sun, 2 Jan 2011 10:01:51 GMT"}, {"version": "v3", "created": "Wed, 22 Jun 2011 00:05:26 GMT"}], "update_date": "2011-06-23", "authors_parsed": [["Mao", "Guoqiang", ""], ["Anderson", "Brian DO", ""]]}, {"id": "1012.5774", "submitter": "Yimin Pang", "authors": "Yimin Pang and Thomas Honold", "title": "Towards the Capacity Region of Multiplicative Linear Operator Broadcast\n  Channels", "comments": "7 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.AG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent research indicates that packet transmission employing random linear\nnetwork coding can be regarded as transmitting subspaces over a linear operator\nchannel (LOC). In this paper we propose the framework of linear operator\nbroadcast channels (LOBCs) to model packet broadcasting over LOCs, and we do\ninitial work on the capacity region of constant-dimension multiplicative\nLOBCs(CMLOBCs), a generalization of broadcast erasure channels. Two fundamental\nproblems regarding CMLOBCs are addressed-finding necessary and sufficient\nconditions for degradation and deciding whether time sharing suffices to\nachieve the boundary of the capacity region in the degraded case.\n", "versions": [{"version": "v1", "created": "Tue, 28 Dec 2010 14:57:17 GMT"}, {"version": "v2", "created": "Sat, 14 May 2011 17:15:56 GMT"}], "update_date": "2011-05-17", "authors_parsed": [["Pang", "Yimin", ""], ["Honold", "Thomas", ""]]}, {"id": "1012.5846", "submitter": "Ghosheh Abed Hodtani", "authors": "Ghosheh Abed Hodtani", "title": "Improvement of the Han-Kobayashi Rate Region for General Interference\n  Channel-v2", "comments": "Submitted to IEEE Trans. on Information Theory as version 2, on 28\n  Dec.2010,presented in part at ICT 2010,April,Doha,Qatar and at IT\n  workshop,June 2010,Sharif Univ. of Tech", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Allowing the input auxiliary random variables to be correlated and using the\nbinning scheme, the Han-Kobayashi (HK) rate region for general interference\nchannel is partially improved. The obtained partially new achievable rate\nregion (i) is compared to the HK region and its simplified description, i.e.,\nChong-Motani-Garg (CMG) region, in a detailed and favorable manner, by\nconsidering different versions of the regions, and (ii) has an interesting and\neasy interpretation: as expected, any rate in our region has generally two\nadditional terms in comparison with the HK region (one due to the input\ncorrelation and the other as a result of the binning scheme). Keywords.\nInterference channel, Input correlation, Binning scheme\n", "versions": [{"version": "v1", "created": "Tue, 28 Dec 2010 21:45:11 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Hodtani", "Ghosheh Abed", ""]]}, {"id": "1012.5947", "submitter": "Cong Ling", "authors": "Kezhi Li, Lu Gan, Cong Ling", "title": "Orthogonal symmetric Toeplitz matrices for compressed sensing:\n  Statistical isometry property", "comments": "This paper has been withdrawn by the authors due to an error. It will\n  be replaced with a new paper shortly", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, the statistical restricted isometry property (RIP) has been\nformulated to analyze the performance of deterministic sampling matrices for\ncompressed sensing. In this paper, we propose the usage of orthogonal symmetric\nToeplitz matrices (OSTM) for compressed sensing and study their statistical RIP\nby taking advantage of Stein's method. In particular, we derive the statistical\nRIP performance bound in terms of the largest value of the sampling matrix and\nthe sparsity level of the input signal. Based on such connections, we show that\nOSTM can satisfy the statistical RIP for an overwhelming majority of signals\nwith given sparsity level, if a Golay sequence used to generate the OSTM. Such\nsensing matrices are deterministic, Toeplitz, and efficient to implement.\nSimulation results show that OSTM can offer reconstruction performance similar\nto that of random matrices.\n", "versions": [{"version": "v1", "created": "Wed, 29 Dec 2010 14:35:16 GMT"}, {"version": "v2", "created": "Wed, 24 Oct 2012 15:14:47 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Li", "Kezhi", ""], ["Gan", "Lu", ""], ["Ling", "Cong", ""]]}, {"id": "1012.5956", "submitter": "Cong Ling", "authors": "Sunjoo Moon and Cong Ling", "title": "A New Noncoherent Decoder for Wireless Network Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work deals with the decoding aspect of wireless network coding in the\ncanonical two-way relay channel where two senders exchange messages via a\ncommon relay and they receive the mixture of two messages. One of the recent\nworks on wireless network coding was well explained by Katti \\textit{et al.} in\nSIGCOMM'07. In this work, we analyze the issue with one of their decoders when\nminimum-shift keying (MSK) is employed as the modulation format, and propose a\nnew noncoherent decoder in the presence of two interfering signals.\n", "versions": [{"version": "v1", "created": "Wed, 29 Dec 2010 15:06:57 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Moon", "Sunjoo", ""], ["Ling", "Cong", ""]]}, {"id": "1012.5997", "submitter": "Salah A. Aly", "authors": "Salah A. Aly, Nirwan Ansari, H. Vincent Poor, Anwar I. Walid", "title": "Protection Over Asymmetric Channels, S-MATE: Secure Multipath Adaptive\n  Traffic Engineering", "comments": "4 figures, 9 pages, journal paper of S-MATE", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several approaches have been proposed to the problem of provisioning traffic\nengineering between core network nodes in Internet Service Provider (ISP)\nnetworks. Such approaches aim to minimize network delay, increase capacity, and\nenhance security services between two core (relay) network nodes, an ingress\nnode and an egress node. MATE (Multipath Adaptive Traffic Engineering) has been\nproposed for multipath adaptive traffic engineering between an ingress node\n(source) and an egress node (destination) to distribute the network flow among\nmultiple disjoint paths. Its novel idea is to avoid network congestion and\nattacks that might exist in edge and node disjoint paths between two core\nnetwork nodes.\n  This paper proposes protection schemes over asymmetric channels. Precisely,\nthe paper aims to develop an adaptive, robust, and reliable traffic engineering\nscheme to improve performance and reliability of communication networks. This\nscheme will also provision Quality of Server (QoS) and protection of traffic\nengineering to maximize network efficiency. Specifically, S-MATE (secure MATE)\nis proposed to protect the network traffic between two core nodes (routers,\nswitches, etc.) in a cloud network. S-MATE secures against a single link\nattack/failure by adding redundancy in one of the operational redundant paths\nbetween the sender and receiver nodes. It is also extended to secure against\nmultiple attacked links. The proposed scheme can be applied to secure core\nnetworks such as optical and IP networks.\n", "versions": [{"version": "v1", "created": "Wed, 29 Dec 2010 18:29:52 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Aly", "Salah A.", ""], ["Ansari", "Nirwan", ""], ["Poor", "H. Vincent", ""], ["Walid", "Anwar I.", ""]]}, {"id": "1012.6012", "submitter": "Ofer Shayevitz", "authors": "Ofer Shayevitz and Michele Wigger", "title": "On the Capacity of the Discrete Memoryless Broadcast Channel with\n  Feedback", "comments": "Accepted to the IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A coding scheme for the discrete memoryless broadcast channel with\n{noiseless, noisy, generalized} feedback is proposed, and the associated\nachievable region derived. The scheme is based on a block-Markov strategy\ncombining the Marton scheme and a lossy version of the Gray-Wyner scheme with\nside-information. In each block the transmitter sends fresh data and update\ninformation that allows the receivers to improve the channel outputs observed\nin the previous block. For a generalization of Dueck's broadcast channel our\nscheme achieves the noiseless-feedback capacity, which is strictly larger than\nthe no-feedback capacity. For a generalization of Blackwell's channel and when\nthe feedback is noiseless our new scheme achieves rate points that are outside\nthe no-feedback capacity region. It follows by a simple continuity argument\nthat for both these channels and when the feedback noise is sufficiently low,\nour scheme improves on the no-feedback capacity even when the feedback is\nnoisy.\n", "versions": [{"version": "v1", "created": "Wed, 29 Dec 2010 19:48:40 GMT"}, {"version": "v2", "created": "Wed, 30 Nov 2011 16:51:09 GMT"}, {"version": "v3", "created": "Sun, 25 Nov 2012 15:15:38 GMT"}], "update_date": "2012-11-27", "authors_parsed": [["Shayevitz", "Ofer", ""], ["Wigger", "Michele", ""]]}]