[{"id": "1010.0011", "submitter": "Nam Yul Yu", "authors": "Nam Yul Yu", "title": "Deterministic Compressed Sensing Matrices from Additive Character\n  Sequences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Compressed sensing is a novel technique where one can recover sparse signals\nfrom the undersampled measurements. In this correspondence, a $K \\times N$\nmeasurement matrix for compressed sensing is deterministically constructed via\nadditive character sequences. The Weil bound is then used to show that the\nmatrix has asymptotically optimal coherence for $N=K^2$, and to present a\nsufficient condition on the sparsity level for unique sparse recovery. Also,\nthe restricted isometry property (RIP) is statistically studied for the\ndeterministic matrix. Using additive character sequences with small alphabets,\nthe compressed sensing matrix can be efficiently implemented by linear feedback\nshift registers. Numerical results show that the deterministic compressed\nsensing matrix guarantees reliable matching pursuit recovery performance for\nboth noiseless and noisy measurements.\n", "versions": [{"version": "v1", "created": "Thu, 30 Sep 2010 20:09:23 GMT"}], "update_date": "2010-10-04", "authors_parsed": [["Yu", "Nam Yul", ""]]}, {"id": "1010.0041", "submitter": "Przemyslaw Pawelczak", "authors": "Wesam Gabran, Przemys{\\l}aw Pawe{\\l}czak, and Danijela \\v{C}abri\\'c", "title": "Throughput and Collision Analysis of Multi-Channel Multi-Stage Spectrum\n  Sensing Algorithms", "comments": null, "journal-ref": "IEEE Transations on Vehicular Technology, vol. 60, no. 7, pp.\n  3309-3323, 2011", "doi": "10.1109/TVT.2011.2160210", "report-no": null, "categories": "cs.PF cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-stage sensing is a novel concept that refers to a general class of\nspectrum sensing algorithms that divide the sensing process into a number of\nsequential stages. The number of sensing stages and the sensing technique per\nstage can be used to optimize performance with respect to secondary user\nthroughput and the collision probability between primary and secondary users.\nSo far, the impact of multi-stage sensing on network throughput and collision\nprobability for a realistic network model is relatively unexplored. Therefore,\nwe present the first analytical framework which enables performance evaluation\nof different multi-channel multi-stage spectrum sensing algorithms for\nOpportunistic Spectrum Access networks. The contribution of our work lies in\nstudying the effect of the following parameters on performance: number of\nsensing stages, physical layer sensing techniques and durations per each stage,\nsingle and parallel channel sensing and access, number of available channels,\nprimary and secondary user traffic, buffering of incoming secondary user\ntraffic, as well as MAC layer sensing algorithms. Analyzed performance metrics\ninclude the average secondary user throughput and the average collision\nprobability between primary and secondary users. Our results show that when the\nprobability of primary user mis-detection is constrained, the performance of\nmulti-stage sensing is, in most cases, superior to the single stage sensing\ncounterpart. Besides, prolonged channel observation at the first stage of\nsensing decreases the collision probability considerably, while keeping the\nthroughput at an acceptable level. Finally, in realistic primary user traffic\nscenarios, using two stages of sensing provides a good balance between\nsecondary users throughput and collision probability while meeting successful\ndetection constraints subjected by Opportunistic Spectrum Access communication.\n", "versions": [{"version": "v1", "created": "Fri, 1 Oct 2010 00:45:03 GMT"}, {"version": "v2", "created": "Sun, 21 Nov 2010 20:36:43 GMT"}, {"version": "v3", "created": "Thu, 7 Apr 2011 23:21:10 GMT"}, {"version": "v4", "created": "Wed, 29 Aug 2012 08:37:05 GMT"}], "update_date": "2012-08-30", "authors_parsed": [["Gabran", "Wesam", ""], ["Pawełczak", "Przemysław", ""], ["Čabrić", "Danijela", ""]]}, {"id": "1010.0060", "submitter": "Hironori Uchikawa", "authors": "Hironori Uchikawa, Kenta Kasai and Kohichi Sakaniwa", "title": "Design and Performance of Rate-compatible Non-Binary LDPC Convolutional\n  Codes", "comments": "8 pages, submitted to IEICE transaction", "journal-ref": null, "doi": "10.1587/transfun.E94.A.2135", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a construction method of non-binary low-density\nparity-check (LDPC) convolutional codes. Our construction method is an\nextension of Felstroem and Zigangirov construction for non-binary LDPC\nconvolutional codes. The rate-compatibility of the non-binary convolutional\ncode is also discussed. The proposed rate-compatible code is designed from one\nsingle mother (2,4)-regular non-binary LDPC convolutional code of rate 1/2.\nHigher-rate codes are produced by puncturing the mother code and lower-rate\ncodes are produced by multiplicatively repeating the mother code. Simulation\nresults show that non-binary LDPC convolutional codes of rate 1/2 outperform\nstate-of-the-art binary LDPC convolutional codes with comparable constraint bit\nlength. Also the derived low-rate and high-rate non-binary LDPC convolutional\ncodes exhibit good decoding performance without loss of large gap to the\nShannon limits.\n", "versions": [{"version": "v1", "created": "Fri, 1 Oct 2010 04:27:29 GMT"}, {"version": "v2", "created": "Sun, 19 Jun 2011 05:55:40 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Uchikawa", "Hironori", ""], ["Kasai", "Kenta", ""], ["Sakaniwa", "Kohichi", ""]]}, {"id": "1010.0177", "submitter": "Alexandre Pierrot", "authors": "Alexandre J. Pierrot and Matthieu R. Bloch", "title": "Strongly Secure Communications Over the Two-Way Wiretap Channel", "comments": "11 pages, 7 figures, submitted to IEEE Transactions on Information\n  Forensics and Security, Special Issue: \"Using the Physical Layer for Securing\n  the Next Generation of Communication Systems\"", "journal-ref": "IEEE Transactions on Information Forensics and Security, Sept.\n  2011", "doi": "10.1109/TIFS.2011.2158422", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of secure communications over the two-way wiretap\nchannel under a strong secrecy criterion. We improve existing results by\ndeveloping an achievable region based on strategies that exploit both the\ninterference at the eavesdropper's terminal and cooperation between legitimate\nusers. We leverage the notion of channel resolvability for the multiple-access\nchannel to analyze cooperative jamming and we show that the artificial noise\ncreated by cooperative jamming induces a source of common randomness that can\nbe used for secret-key agreement. We illustrate the gain provided by this\ncoding technique in the case of the Gaussian two-way wiretap channel, and we\nshow significant improvements for some channel configurations.\n", "versions": [{"version": "v1", "created": "Fri, 1 Oct 2010 14:55:57 GMT"}, {"version": "v2", "created": "Thu, 12 May 2011 16:26:13 GMT"}, {"version": "v3", "created": "Tue, 10 Apr 2012 16:29:51 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Pierrot", "Alexandre J.", ""], ["Bloch", "Matthieu R.", ""]]}, {"id": "1010.0182", "submitter": "Natasha Devroye", "authors": "Yiwei Song, Natasha Devroye", "title": "List decoding for nested lattices and applications to relay channels", "comments": "8 pages; presented at Allerton 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate a decoding scheme for nested lattice codes which is able to\ndecode a list of a particular size which contains the transmitted codeword with\nhigh probability. This list decoder is analogous to that used in random coding\narguments in achievability schemes of relay channels, and allows for the\neffective combination of information from the relay and source node. Using this\nlist decoding result, we demonstrate 1) that lattice codes may achieve the\ncapacity of the physically degraded AWGN relay channel, 2) an achievable rate\nregion for the two-way relay channel with direct links using lattice codes, and\n3) that we may improve the constant gap to capacity for specific cases of the\ntwo-way relay channel with direct links.\n", "versions": [{"version": "v1", "created": "Fri, 1 Oct 2010 15:15:28 GMT"}], "update_date": "2010-10-04", "authors_parsed": [["Song", "Yiwei", ""], ["Devroye", "Natasha", ""]]}, {"id": "1010.0189", "submitter": "Nam Yul Yu", "authors": "Nam Yul Yu", "title": "Reed-Muller Codes for Peak Power Control in Multicarrier CDMA", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reed-Muller codes are studied for peak power control in multicarrier\ncode-division multiple access (MC-CDMA) communication systems. In a coded\nMC-CDMA system, the information data multiplexed from users is encoded by a\nReed-Muller subcode and the codeword is fully-loaded to Walsh-Hadamard\nspreading sequences. The polynomial representation of a coded MC-CDMA signal is\nestablished for theoretical analysis of the peak-to-average power ratio (PAPR).\nThe Reed-Muller subcodes are defined in a recursive way by the Boolean\nfunctions providing the transmitted MC-CDMA signals with the bounded PAPR as\nwell as the error correction capability. A connection between the code rates\nand the maximum PAPR is theoretically investigated in the coded MC-CDMA.\nSimulation results present the statistical evidence that the PAPR of the coded\nMC-CDMA signal is not only theoretically bounded, but also statistically\nreduced. In particular, the coded MC-CDMA solves the major PAPR problem of\nuncoded MC-CDMA by dramatically reducing its PAPR for the small number of\nusers. Finally, the theoretical and statistical studies show that the\nReed-Muller subcodes are effective coding schemes for peak power control in\nMC-CDMA with small and moderate numbers of users, subcarriers, and spreading\nfactors.\n", "versions": [{"version": "v1", "created": "Fri, 1 Oct 2010 15:59:54 GMT"}], "update_date": "2010-10-04", "authors_parsed": [["Yu", "Nam Yul", ""]]}, {"id": "1010.0200", "submitter": "Yue Wang", "authors": "Yue Wang and Justin P. Coon", "title": "Difference Antenna Selection and Power Allocation for Wireless Cognitive\n  Systems", "comments": "29 pages, 9 figures, to be submitted to IEEE Transactions on\n  Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose an antenna selection method in a wireless cognitive\nradio (CR) system, namely difference selection, whereby a single transmit\nantenna is selected at the secondary transmitter out of $M$ possible antennas\nsuch that the weighted difference between the channel gains of the data link\nand the interference link is maximized. We analyze mutual information and\noutage probability of the secondary transmission in a CR system with difference\nantenna selection, and propose a method of optimizing these performance metrics\nof the secondary data link subject to practical constraints on the peak\nsecondary transmit power and the average interference power as seen by the\nprimary receiver. The optimization is performed over two parameters: the peak\nsecondary transmit power and the difference selection weight $\\delta\\in [0,\n1]$. We show that, difference selection using the optimized parameters\ndetermined by the proposed method can be, in many cases of interest, superior\nto a so called ratio selection method disclosed in the literature, although\nratio selection has been shown to be optimal, when impractically, the secondary\ntransmission power constraint is not applied. We address the effects that the\nconstraints have on mutual information and outage probability, and discuss the\npractical implications of the results.\n", "versions": [{"version": "v1", "created": "Fri, 1 Oct 2010 16:33:22 GMT"}, {"version": "v2", "created": "Fri, 15 Oct 2010 15:31:25 GMT"}], "update_date": "2010-10-18", "authors_parsed": [["Wang", "Yue", ""], ["Coon", "Justin P.", ""]]}, {"id": "1010.0226", "submitter": "Lalitha Sankar", "authors": "Lalitha Sankar, S. Raj Rajagopalan, and H. Vincent Poor", "title": "An Information-theoretic Approach to Privacy", "comments": "in Proc. 48th Annual Allerton Conf. on Commun., Control, and\n  Computing, Monticello, IL, Sep 29-Oct 1, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ensuring the usefulness of electronic data sources while providing necessary\nprivacy guarantees is an important unsolved problem. This problem drives the\nneed for an overarching analytical framework that can quantify the safety of\npersonally identifiable information (privacy) while still providing a\nquantifable benefit (utility) to multiple legitimate information consumers.\nState of the art approaches have predominantly focused on privacy. This paper\npresents the first information-theoretic approach that promises an analytical\nmodel guaranteeing tight bounds of how much utility is possible for a given\nlevel of privacy and vice-versa.\n", "versions": [{"version": "v1", "created": "Fri, 1 Oct 2010 18:05:03 GMT"}], "update_date": "2010-10-04", "authors_parsed": [["Sankar", "Lalitha", ""], ["Rajagopalan", "S. Raj", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1010.0280", "submitter": "Yeow Meng Chee", "authors": "Yeow Meng Chee, Xiande Zhang, Hui Zhang", "title": "Infinite Families of Optimal Splitting Authentication Codes Secure\n  Against Spoofing Attacks of Higher Order", "comments": "to appear in Advances in Mathematics of Communications (accepted\n  September 2010)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DM cs.IT math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of constructing optimal authentication codes with\nsplitting. New infinite families of such codes are obtained. In particular, we\nestablish the first known infinite family of optimal authentication codes with\nsplitting that are secure against spoofing attacks of order two.\n", "versions": [{"version": "v1", "created": "Sat, 2 Oct 2010 00:30:10 GMT"}], "update_date": "2010-10-05", "authors_parsed": [["Chee", "Yeow Meng", ""], ["Zhang", "Xiande", ""], ["Zhang", "Hui", ""]]}, {"id": "1010.0316", "submitter": "Abhinav G", "authors": "G. Abhinav and B. Sundar Rajan", "title": "Two-User Gaussian Interference Channel with Finite Constellation Input\n  and FDMA", "comments": "12 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the two-user Gaussian Strong Interference Channel (GSIC) with finite\nconstellation inputs, it is known that relative rotation between the\nconstellations of the two users enlarges the Constellation Constrained (CC)\ncapacity region. In this paper, a metric for finding the approximate angle of\nrotation (with negligibly small error) to maximally enlarge the CC capacity for\nthe two-user GSIC is presented. In the case of Gaussian input alphabets with\nequal powers for both the users and the modulus of both the cross-channel gains\nbeing equal to unity, it is known that the FDMA rate curve touches the capacity\ncurve of the GSIC. It is shown that, with unequal powers for both the users\nalso, when the modulus of one of the cross-channel gains being equal to one and\nthe modulus of the other cross-channel gain being greater than or equal to one,\nthe FDMA rate curve touches the capacity curve of the GSIC. On the contrary, it\nis shown that, under finite constellation inputs, with both the users using the\nsame constellation, the FDMA rate curve strictly lies within (never touches)\nthe enlarged CC capacity region throughout the strong-interference regime. This\nmeans that using FDMA it is impossible to go close to the CC capacity. It is\nwell known that for the Gaussian input alphabets, the FDMA inner-bound, at the\noptimum sum-rate point, is always better than the simultaneous-decoding\ninner-bound throughout the weak-interference regime. For a portion of the weak\ninterference regime, it is shown that with identical finite constellation\ninputs for both the users, the simultaneous-decoding inner-bound, enlarged by\nrelative rotation between the constellations, is strictly better than the FDMA\ninner-bound.\n", "versions": [{"version": "v1", "created": "Sat, 2 Oct 2010 09:26:54 GMT"}, {"version": "v2", "created": "Tue, 5 Oct 2010 05:20:25 GMT"}, {"version": "v3", "created": "Wed, 6 Oct 2010 13:03:19 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Abhinav", "G.", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "1010.0333", "submitter": "Ryuhei Mori", "authors": "Ryuhei Mori, Toshiyuki Tanaka, Kenta Kasai, and Kohichi Sakaniwa", "title": "Effects of Single-Cycle Structure on Iterative Decoding for Low-Density\n  Parity-Check Codes", "comments": "16 pages, 7 figures, submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": "10.1109/TIT.2012.2216252", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider communication over the binary erasure channel (BEC) using\nlow-density parity-check (LDPC) codes and belief propagation (BP) decoding. For\nfixed numbers of BP iterations, the bit error probability approaches a limit as\nblocklength tends to infinity, and the limit is obtained via density evolution.\nOn the other hand, the difference between the bit error probability of codes\nwith blocklength $n$ and that in the large blocklength limit is asymptotically\n$\\alpha(\\epsilon,t)/n + \\Theta(n^{-2})$ where $\\alpha(\\epsilon,t)$ denotes a\nspecific constant determined by the code ensemble considered, the number $t$ of\niterations, and the erasure probability $\\epsilon$ of the BEC. In this paper,\nwe derive a set of recursive formulas which allows evaluation of the constant\n$\\alpha(\\epsilon,t)$ for standard irregular ensembles. The dominant difference\n$\\alpha(\\epsilon,t)/n$ can be considered as effects of cycle-free and\nsingle-cycle structures of local graphs. Furthermore, it is confirmed via\nnumerical simulations that estimation of the bit error probability using\n$\\alpha(\\epsilon,t)$ is accurate even for small blocklengths.\n", "versions": [{"version": "v1", "created": "Sat, 2 Oct 2010 13:08:01 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Mori", "Ryuhei", ""], ["Tanaka", "Toshiyuki", ""], ["Kasai", "Kenta", ""], ["Sakaniwa", "Kohichi", ""]]}, {"id": "1010.0344", "submitter": "Xi Liu", "authors": "Xi Liu and Elza Erkip", "title": "Alternating-Offer Bargaining Games over the Gaussian Interference\n  Channel", "comments": "8 pages, 6 figures, to appear in Proceedings of Forty-Eighth Annual\n  Allerton Conference on Communication, Control, and Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper tackles the problem of how two selfish users jointly determine the\noperating point in the achievable rate region of a two-user Gaussian\ninterference channel through bargaining. In previous work, incentive conditions\nfor two users to cooperate using a simple version of Han-Kobayashi scheme was\nstudied and the Nash bargaining solution (NBS) was used to obtain a fair\noperating point. Here a noncooperative bargaining game of alternating offers is\nadopted to model the bargaining process and rates resulting from the\nequilibrium outcome are analyzed. In particular, it is shown that the operating\npoint resulting from the formulated bargaining game depends on the cost of\ndelay in bargaining and how bargaining proceeds. If the associated bargaining\nproblem is regular, a unique perfect equilibrium exists and lies on the\nindividual rational efficient frontier of the achievable rate region. Besides,\nthe equilibrium outcome approaches the NBS if the bargaining costs of both\nusers are negligible.\n", "versions": [{"version": "v1", "created": "Sat, 2 Oct 2010 15:04:14 GMT"}], "update_date": "2010-10-05", "authors_parsed": [["Liu", "Xi", ""], ["Erkip", "Elza", ""]]}, {"id": "1010.0412", "submitter": "Inder Jeet Taneja", "authors": "Inder Jeet Taneja", "title": "Sequences of Inequalities Among New Divergence Measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are three classical divergence measures exist in the literature on\ninformation theory and statistics. These are namely, Jeffryes-Kullback-Leiber\nJ-divergence. Sibson-Burbea-Rao Jensen-Shannon divegernce and Taneja\narithemtic-geometric mean divergence. These three measures bear an interesting\nrelationship among each other and are based on logarithmic expressions. The\ndivergence measures like Hellinger discrimination, symmetric chi-square\ndivergence, and triangular discrimination are also known in the literature and\nare not based on logarithmic expressions. Past years Dragomir et al., Kumar and\nJohnson and Jain and Srivastava studied different kind of divergence measures.\nIn this paper, we have presented some more new divergence measures and obtained\ninequalities relating these new measures and also made connections with\nprevious ones. The idea of exponential divergence is also introduced.\n", "versions": [{"version": "v1", "created": "Sun, 3 Oct 2010 14:58:21 GMT"}, {"version": "v2", "created": "Mon, 26 Sep 2011 17:56:26 GMT"}], "update_date": "2011-09-27", "authors_parsed": [["Taneja", "Inder Jeet", ""]]}, {"id": "1010.0418", "submitter": "Janis Noetzel", "authors": "Rudolf Ahlswede, Igor Bjelakovic, Holger Boche, Janis Noetzel", "title": "Quantum capacity under adversarial quantum noise: arbitrarily varying\n  quantum channels", "comments": "49 pages, no figures, final version of our papers arXiv:1010.0418v2\n  and arXiv:1010.0418. Published \"Online First\" in Communications in\n  Mathematical Physics, 2012", "journal-ref": null, "doi": "10.1007/s00220-012-1613-x", "report-no": "Mittag-Leffler-2010fall", "categories": "quant-ph cs.IT math-ph math.IT math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate entanglement transmission over an unknown channel in the\npresence of a third party (called the adversary), which is enabled to choose\nthe channel from a given set of memoryless but non-stationary channels without\ninforming the legitimate sender and receiver about the particular choice that\nhe made. This channel model is called arbitrarily varying quantum channel\n(AVQC). We derive a quantum version of Ahlswede's dichotomy for classical\narbitrarily varying channels. This includes a regularized formula for the\ncommon randomness-assisted capacity for entanglement transmission of an AVQC.\nQuite surprisingly and in contrast to the classical analog of the problem\ninvolving the maximal and average error probability, we find that the capacity\nfor entanglement transmission of an AVQC always equals its strong subspace\ntransmission capacity. These results are accompanied by different notions of\nsymmetrizability (zero-capacity conditions) as well as by conditions for an\nAVQC to have a capacity described by a single-letter formula. In he final part\nof the paper the capacity of the erasure-AVQC is computed and some light shed\non the connection between AVQCs and zero-error capacities. Additionally, we\nshow by entirely elementary and operational arguments motivated by the theory\nof AVQCs that the quantum, classical, and entanglement-assisted zero-error\ncapacities of quantum channels are generically zero and are discontinuous at\nevery positivity point.\n", "versions": [{"version": "v1", "created": "Sun, 3 Oct 2010 16:01:28 GMT"}, {"version": "v2", "created": "Thu, 3 Feb 2011 12:59:15 GMT"}, {"version": "v3", "created": "Mon, 10 Dec 2012 22:22:07 GMT"}], "update_date": "2012-12-12", "authors_parsed": [["Ahlswede", "Rudolf", ""], ["Bjelakovic", "Igor", ""], ["Boche", "Holger", ""], ["Noetzel", "Janis", ""]]}, {"id": "1010.0433", "submitter": "Mahdi Cheraghchi", "authors": "Mahdi Cheraghchi", "title": "Derandomization and Group Testing", "comments": "Invited Paper in Proceedings of 48th Annual Allerton Conference on\n  Communication, Control, and Computing, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid development of derandomization theory, which is a fundamental area\nin theoretical computer science, has recently led to many surprising\napplications outside its initial intention. We will review some recent such\ndevelopments related to combinatorial group testing. In its most basic setting,\nthe aim of group testing is to identify a set of \"positive\" individuals in a\npopulation of items by taking groups of items and asking whether there is a\npositive in each group.\n  In particular, we will discuss explicit constructions of optimal or\nnearly-optimal group testing schemes using \"randomness-conducting\" functions.\nAmong such developments are constructions of error-correcting group testing\nschemes using randomness extractors and condensers, as well as threshold group\ntesting schemes from lossless condensers.\n", "versions": [{"version": "v1", "created": "Sun, 3 Oct 2010 19:29:55 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Cheraghchi", "Mahdi", ""]]}, {"id": "1010.0476", "submitter": "Dimitris S. Papailiopoulos", "authors": "Dimitris S. Papailiopoulos and Alexandros G. Dimakis", "title": "Interference Alignment as a Rank Constrained Rank Minimization", "comments": "27 pages, single column, 7 figures, TSP submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the maximization of the sum degrees-of-freedom for the static\nflat-fading multiple-input multiple-output (MIMO) interference channel is\nequivalent to a rank constrained rank minimization problem (RCRM), when the\nsignal spaces span all available dimensions. The rank minimization corresponds\nto maximizing interference alignment (IA) so that interference spans the lowest\ndimensional subspace possible. The rank constraints account for the useful\nsignal spaces spanning all available spatial dimensions. That way, we\nreformulate all IA requirements to requirements involving ranks. Then, we\npresent a convex relaxation of the RCRM problem inspired by recent results in\ncompressed sensing and low-rank matrix completion theory that rely on\napproximating rank with the nuclear norm. We show that the convex envelope of\nthe sum of ranks of the interference matrices is the normalized sum of their\ncorresponding nuclear norms and introduce tractable constraints that are\nasymptotically equivalent to the rank constraints for the initial problem. We\nalso show that our heuristic relaxation can be tuned for the multi-cell\ninterference channel. Furthermore, we experimentally show that in many cases\nthe proposed algorithm attains perfect interference alignment and in some cases\noutperforms previous approaches for finding precoding and zero-forcing matrices\nfor interference alignment.\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 05:52:34 GMT"}, {"version": "v2", "created": "Tue, 7 Dec 2010 17:37:22 GMT"}, {"version": "v3", "created": "Wed, 16 Mar 2011 06:55:33 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Papailiopoulos", "Dimitris S.", ""], ["Dimakis", "Alexandros G.", ""]]}, {"id": "1010.0485", "submitter": "Dimitris Papailiopoulos", "authors": "Dimitris S. Papailiopoulos and Alexandros G. Dimakis", "title": "Distributed Storage Codes Meet Multiple-Access Wiretap Channels", "comments": "10 pages, allerton 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider {\\it i)} the overhead minimization of maximum-distance separable\n(MDS) storage codes for the repair of a single failed node and {\\it ii)} the\ntotal secure degrees-of-freedom (S-DoF) maximization in a multiple-access\ncompound wiretap channel. We show that the two problems are connected.\nSpecifically, the overhead minimization for a single node failure of an {\\it\noptimal} MDS code, i.e. one that can achieve the information theoretic overhead\nminimum, is equivalent to maximizing the S-DoF in a multiple-access compound\nwiretap channel. Additionally, we show that maximizing the S-DoF in a\nmultiple-access compound wiretap channel is equivalent to minimizing the\noverhead of an MDS code for the repair of a departed node. An optimal MDS code\nmaps to a full S-DoF channel and a full S-DoF channel maps to an MDS code with\nminimum repair overhead for one failed node. We also state a general framework\nfor code-to-channel and channel-to-code mappings and performance bounds between\nthe two settings. The underlying theme for all connections presented is\ninterference alignment (IA). The connections between the two problems become\napparent when we restate IA as an optimization problem. Specifically, we\nformulate the overhead minimization and the S-DoF maximization as rank\nconstrained, sum-rank and max-rank minimization problems respectively. The\nderived connections allow us to map repair strategies of recently discovered\nrepair codes to beamforming matrices and characterize the maximum S-DoF for the\nsingle antenna multiple-access compound wiretap channel.\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 07:15:48 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Papailiopoulos", "Dimitris S.", ""], ["Dimakis", "Alexandros G.", ""]]}, {"id": "1010.0522", "submitter": "Rahul Jain", "authors": "Rahul Jain", "title": "Strong direct product conjecture holds for all relations in public coin\n  randomized one-way communication complexity", "comments": "ver 2. 11 pages, proofs simplified", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let f subset of X x Y x Z be a relation. Let the public coin one-way\ncommunication complexity of f, with worst case error 1/3, be denoted\nR^{1,pub}_{1/3}(f). We show that if for computing f^k (k independent copies of\nf), o(k R^{1,pub}_{1/3}(f)) communication is provided, then the success is\nexponentially small in k. This settles the strong direct product conjecture for\nall relations in public coin one-way communication complexity.\n  We show a new tight characterization of public coin one-way communication\ncomplexity which strengthens on the tight characterization shown in [J.,\nKlauck, Nayak 08]. We use the new characterization to show our direct product\nresult and this may also be of independent interest.\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 09:57:55 GMT"}, {"version": "v2", "created": "Thu, 14 Oct 2010 14:34:47 GMT"}], "update_date": "2010-10-15", "authors_parsed": [["Jain", "Rahul", ""]]}, {"id": "1010.0558", "submitter": "Bernhard Haeupler", "authors": "Bernhard Haeupler", "title": "Analyzing Network Coding Gossip Made Easy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DS cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a new technique to analyze the stopping time of gossip protocols that\nare based on random linear network coding (RLNC). Our analysis drastically\nsimplifies, extends and strengthens previous results. We analyze RLNC gossip in\na general framework for network and communication models that encompasses and\nunifies the models used previously in this context. We show, in most settings\nfor the first time, that it converges with high probability in the\ninformation-theoretically optimal time. Most stopping times are of the form O(k\n+ T) where k is the number of messages to be distributed and T is the time it\ntakes to disseminate one message. This means RLNC gossip achieves \"perfect\npipelining\". Our analysis directly extends to highly dynamic networks in which\nthe topology can change completely at any time. This remains true even if the\nnetwork dynamics are controlled by a fully adaptive adversary that knows the\ncomplete network state. Virtually nothing besides simple O(kT) sequential\nflooding protocols was previously known for such a setting. While RLNC gossip\nworks in this wide variety of networks its analysis remains the same and\nextremely simple. This contrasts with more complex proofs that were put forward\nto give less strong results for various special cases.\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 12:21:21 GMT"}], "update_date": "2010-10-05", "authors_parsed": [["Haeupler", "Bernhard", ""]]}, {"id": "1010.0601", "submitter": "Gabriel Tucci", "authors": "Thomas L. Marzetta, Gabriel H. Tucci and Steven H. Simon", "title": "A Random Matrix--Theoretic Approach to Handling Singular Covariance\n  Estimates", "comments": "Submitted to Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.IT math.IT math.ST physics.data-an stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many practical situations we would like to estimate the covariance matrix\nof a set of variables from an insufficient amount of data. More specifically,\nif we have a set of $N$ independent, identically distributed measurements of an\n$M$ dimensional random vector the maximum likelihood estimate is the sample\ncovariance matrix. Here we consider the case where $N<M$ such that this\nestimate is singular and therefore fundamentally bad. We present a radically\nnew approach to deal with this situation. Let $X$ be the $M\\times N$ data\nmatrix, where the columns are the $N$ independent realizations of the random\nvector with covariance matrix $\\Sigma$. Without loss of generality, we can\nassume that the random variables have zero mean. We would like to estimate\n$\\Sigma$ from $X$. Let $K$ be the classical sample covariance matrix. Fix a\nparameter $1\\leq L\\leq N$ and consider an ensemble of $L\\times M$ random\nunitary matrices, $\\{\\Phi\\}$, having Haar probability measure. Pre and post\nmultiply $K$ by $\\Phi$, and by the conjugate transpose of $\\Phi$ respectively,\nto produce a non--singular $L\\times L$ reduced dimension covariance estimate. A\nnew estimate for $\\Sigma$, denoted by $\\mathrm{cov}_L(K)$, is obtained by a)\nprojecting the reduced covariance estimate out (to $M\\times M$) through pre and\npost multiplication by the conjugate transpose of $\\Phi$, and by $\\Phi$\nrespectively, and b) taking the expectation over the unitary ensemble. Another\nnew estimate (this time for $\\Sigma^{-1}$), $\\mathrm{invcov}_L(K)$, is obtained\nby a) inverting the reduced covariance estimate, b) projecting the inverse out\n(to $M\\times M$) through pre and post multiplication by the conjugate transpose\nof $\\Phi$, and by $\\Phi$ respectively, and c) taking the expectation over the\nunitary ensemble. We have a closed analytical expression for\n$\\mathrm{invcov}_L(K)$ and $\\mathrm{cov}_L(K)$ in terms of its eigenvalue\ndecomposition.\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 14:25:59 GMT"}], "update_date": "2010-10-05", "authors_parsed": [["Marzetta", "Thomas L.", ""], ["Tucci", "Gabriel H.", ""], ["Simon", "Steven H.", ""]]}, {"id": "1010.0608", "submitter": "Chenlu Qiu", "authors": "Chenlu Qiu and Namrata Vaswani", "title": "Real-time Robust Principal Components' Pursuit", "comments": "8 pages, 4 figures, Allerton 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the recent work of Candes et al, the problem of recovering low rank matrix\ncorrupted by i.i.d. sparse outliers is studied and a very elegant solution,\nprincipal component pursuit, is proposed. It is motivated as a tool for video\nsurveillance applications with the background image sequence forming the low\nrank part and the moving objects/persons/abnormalities forming the sparse part.\nEach image frame is treated as a column vector of the data matrix made up of a\nlow rank matrix and a sparse corruption matrix. Principal component pursuit\nsolves the problem under the assumptions that the singular vectors of the low\nrank matrix are spread out and the sparsity pattern of the sparse matrix is\nuniformly random. However, in practice, usually the sparsity pattern and the\nsignal values of the sparse part (moving persons/objects) change in a\ncorrelated fashion over time, for e.g., the object moves slowly and/or with\nroughly constant velocity. This will often result in a low rank sparse matrix.\n  For video surveillance applications, it would be much more useful to have a\nreal-time solution. In this work, we study the online version of the above\nproblem and propose a solution that automatically handles correlated sparse\noutliers. The key idea of this work is as follows. Given an initial estimate of\nthe principal directions of the low rank part, we causally keep estimating the\nsparse part at each time by solving a noisy compressive sensing type problem.\nThe principal directions of the low rank part are updated every-so-often. In\nbetween two update times, if new Principal Components' directions appear, the\n\"noise\" seen by the Compressive Sensing step may increase. This problem is\nsolved, in part, by utilizing the time correlation model of the low rank part.\nWe call the proposed solution \"Real-time Robust Principal Components' Pursuit\".\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 14:50:43 GMT"}, {"version": "v2", "created": "Wed, 6 Oct 2010 14:36:12 GMT"}, {"version": "v3", "created": "Sat, 12 Feb 2011 15:12:50 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Qiu", "Chenlu", ""], ["Vaswani", "Namrata", ""]]}, {"id": "1010.0624", "submitter": "Gabriel Tucci", "authors": "Gabriel H. Tucci and Philip A. Whiting", "title": "Eigenvalue Results for Large Scale Random Vandermonde Matrices with Unit\n  Complex Entries", "comments": "Submitted to Transactions of Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.IT math.IT physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper centers on the limit eigenvalue distribution for random\nVandermonde matrices with unit magnitude complex entries. The phases of the\nentries are chosen independently and identically distributed from the interval\n$[-\\pi,\\pi]$. Various types of distribution for the phase are considered and we\nestablish the existence of the empirical eigenvalue distribution in the large\nmatrix limit on a wide range of cases. The rate of growth of the maximum\neigenvalue is examined and shown to be no greater than $O(\\log N)$ and no\nslower than $O(\\log N/\\log\\log N)$ where $N$ is the dimension of the matrix.\nAdditional results include the existence of the capacity of the Vandermonde\nchannel (limit integral for the expected log determinant).\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 15:32:20 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Tucci", "Gabriel H.", ""], ["Whiting", "Philip A.", ""]]}, {"id": "1010.0642", "submitter": "Jie Luo", "authors": "Zheng Wang, Jie Luo", "title": "Error Performance of Channel Coding in Random Access Communication", "comments": "submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2012.2190580", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new channel coding approach was proposed in [1] for random multiple access\ncommunication over the discrete-time memoryless channel. The coding approach\nallows users to choose their communication rates independently without sharing\nthe rate information among each other or with the receiver. The receiver will\neither decode the message or report a collision depending on whether reliable\nmessage recovery is possible. It was shown that, asymptotically as the codeword\nlength goes to infinity, the set of communication rates supporting reliable\nmessage recovery can be characterized by an achievable region which equals\nShannon's information rate region possibly without a convex hull operation. In\nthis paper, we derive achievable bounds on error probabilities, including the\ndecoding error probability and the collision miss detection probability, of\nrandom multiple access systems with a finite codeword length. Achievable error\nexponents are obtained by taking the codeword length to infinity.\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 17:06:10 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Wang", "Zheng", ""], ["Luo", "Jie", ""]]}, {"id": "1010.0654", "submitter": "Shirin Jalali", "authors": "Michelle Effros, Tracey Ho and Shirin Jalali", "title": "On Equivalence Between Network Topologies", "comments": "8 pages, 12 figures, 48th Annual Allerton Conference on\n  Communication, Control, and Computing, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One major open problem in network coding is to characterize the capacity\nregion of a general multi-source multi-demand network. There are some existing\ncomputational tools for bounding the capacity of general networks, but their\ncomputational complexity grows very quickly with the size of the network. This\nmotivates us to propose a new hierarchical approach which finds upper and lower\nbounding networks of smaller size for a given network. This approach\nsequentially replaces components of the network with simpler structures, i.e.,\nwith fewer links or nodes, so that the resulting network is more amenable to\ncomputational analysis and its capacity provides an upper or lower bound on the\ncapacity of the original network. The accuracy of the resulting bounds can be\nbounded as a function of the link capacities. Surprisingly, we are able to\nsimplify some families of network structures without any loss in accuracy.\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 18:31:44 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Effros", "Michelle", ""], ["Ho", "Tracey", ""], ["Jalali", "Shirin", ""]]}, {"id": "1010.0670", "submitter": "Ye Wang", "authors": "Ye Wang, Shantanu Rane, Prakash Ishwar, Wei Sun", "title": "Unconditionally Secure Computation on Large Distributed Databases with\n  Vanishing Cost", "comments": "12 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a network of k parties, each holding a long sequence of n entries (a\ndatabase), with minimum vertex-cut greater than t. We show that any empirical\nstatistic across the network of databases can be computed by each party with\nperfect privacy, against any set of t < k/2 passively colluding parties, such\nthat the worst-case distortion and communication cost (in bits per database\nentry) both go to zero as n, the number of entries in the databases, goes to\ninfinity. This is based on combining a striking dimensionality reduction result\nfor random sampling with unconditionally secure multi-party computation\nprotocols.\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 19:46:26 GMT"}, {"version": "v2", "created": "Tue, 5 Oct 2010 04:41:21 GMT"}, {"version": "v3", "created": "Tue, 18 Feb 2014 14:59:46 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Wang", "Ye", ""], ["Rane", "Shantanu", ""], ["Ishwar", "Prakash", ""], ["Sun", "Wei", ""]]}, {"id": "1010.0694", "submitter": "David R. Bickel", "authors": "David R. Bickel", "title": "Statistical inference optimized with respect to the observed sample for\n  single or multiple comparisons", "comments": "Typo in equation (7) of v2 corrected in equation (6) of v3; clarity\n  improved", "journal-ref": "Bickel, D. R. (2011). A predictive approach to measuring the\n  strength of statistical evidence for single and multiple comparisons.\n  Canadian Journal of Statistics, 39, 610-631", "doi": "10.1002/cjs.10109", "report-no": null, "categories": "math.ST cs.IT math.IT q-bio.BM stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The normalized maximum likelihood (NML) is a recent penalized likelihood that\nhas properties that justify defining the amount of discrimination information\n(DI) in the data supporting an alternative hypothesis over a null hypothesis as\nthe logarithm of an NML ratio, namely, the alternative hypothesis NML divided\nby the null hypothesis NML. The resulting DI, like the Bayes factor but unlike\nthe p-value, measures the strength of evidence for an alternative hypothesis\nover a null hypothesis such that the probability of misleading evidence\nvanishes asymptotically under weak regularity conditions and such that evidence\ncan support a simple null hypothesis. Unlike the Bayes factor, the DI does not\nrequire a prior distribution and is minimax optimal in a sense that does not\ninvolve averaging over outcomes that did not occur. Replacing a (possibly\npseudo-) likelihood function with its weighted counterpart extends the scope of\nthe DI to models for which the unweighted NML is undefined. The likelihood\nweights leverage side information, either in data associated with comparisons\nother than the comparison at hand or in the parameter value of a simple null\nhypothesis. Two case studies, one involving multiple populations and the other\ninvolving multiple biological features, indicate that the DI is robust to the\ntype of side information used when that information is assigned the weight of a\nsingle observation. Such robustness suggests that very little adjustment for\nmultiple comparisons is warranted if the sample size is at least moderate.\n", "versions": [{"version": "v1", "created": "Mon, 4 Oct 2010 20:21:49 GMT"}, {"version": "v2", "created": "Wed, 6 Oct 2010 21:46:59 GMT"}, {"version": "v3", "created": "Tue, 2 Nov 2010 10:33:12 GMT"}], "update_date": "2012-05-02", "authors_parsed": [["Bickel", "David R.", ""]]}, {"id": "1010.0743", "submitter": "Ryutaroh Matsumoto", "authors": "Ryutaroh Matsumoto and Masahito Hayashi", "title": "Strong security and separated code constructions for the broadcast\n  channels with confidential messages", "comments": "LaTeX2e, two column, 9 pages, no figure, improved version registered\n  as arXiv:1101.4036", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the capacity region of the broadcast channel with confidential\nmessages does not change when the strong security criterion is adopted instead\nof the weak security criterion traditionally used. We also show a construction\nmethod of coding for the broadcast channel with confidential messages by using\nan arbitrary given coding for the broadcast channel with degraded message sets.\n", "versions": [{"version": "v1", "created": "Tue, 5 Oct 2010 01:04:09 GMT"}, {"version": "v2", "created": "Tue, 24 May 2011 06:38:48 GMT"}], "update_date": "2011-05-25", "authors_parsed": [["Matsumoto", "Ryutaroh", ""], ["Hayashi", "Masahito", ""]]}, {"id": "1010.0781", "submitter": "Rahul Vaze", "authors": "Rahul Vaze", "title": "Transmission Capacity of Spectrum Sharing Ad-hoc Networks with Multiple\n  Antennas", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two coexisting ad-hoc networks, primary and secondary, are considered, where\neach node of the primary network has a single antenna, while each node of the\nsecondary network is equipped with multiple antennas. Using multiple antennas,\neach secondary transmitter uses some of its spatial transmit degrees of freedom\n(STDOF) to null its interference towards the primary receivers, while each\nsecondary receiver employs interference cancelation using some of its spatial\nreceive degrees of freedom (SRDOF). This paper derives the optimal STDOF for\nnulling and SRDOF for interference cancelation that maximize the scaling of the\ntransmission capacity of the secondary network with respect to the number of\nantennas, when the secondary network operates under an outage constraint at the\nprimary receivers. With a single receive antenna, using a fraction of the total\nSTDOF for nulling at each secondary transmitter maximizes the transmission\ncapacity. With multiple transmit and receive antennas and fixing all but one\nSTDOF for nulling, using a fraction of the total SRDOF to cancel the nearest\ninterferers maximizes the transmission capacity of the secondary network.\n", "versions": [{"version": "v1", "created": "Tue, 5 Oct 2010 07:16:52 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Vaze", "Rahul", ""]]}, {"id": "1010.0846", "submitter": "Rahul Jain", "authors": "Rahul Jain", "title": "A strong direct product theorem for two-way public coin communication\n  complexity", "comments": "ver 2, 12 pages, application to set disjointness added", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show a direct product result for two-way public coin communication\ncomplexity of all relations in terms of a new complexity measure that we\ndefine. Our new measure is a generalization to non-product distributions of the\ntwo-way product subdistribution bound of [J, Klauck and Nayak 08], thereby our\nresult implying their direct product result in terms of the two-way product\nsubdistribution bound.\n  We show that our new complexity measure gives tight lower bound for the\nset-disjointness problem, as a result we reproduce strong direct product result\nfor this problem, which was previously shown by [Klauck 00].\n", "versions": [{"version": "v1", "created": "Tue, 5 Oct 2010 11:38:19 GMT"}, {"version": "v2", "created": "Fri, 26 Nov 2010 06:30:49 GMT"}], "update_date": "2010-11-29", "authors_parsed": [["Jain", "Rahul", ""]]}, {"id": "1010.0933", "submitter": "Namyoon Lee", "authors": "Namyoon Lee, Wonjae Shin and Bruno Clerckx", "title": "Interference Alignment with Limited Feedback on Two-cell Interfering\n  Two-User MIMO-MAC", "comments": "6 pages, 2 figures, Submitted ICC 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a two-cell interfering two-user multiple-input\nmultiple-output multiple access channel (MIMO-MAC) with limited feedback. We\nfirst investigate the multiplexing gain of such channel when users have perfect\nchannel state information at transmitter (CSIT) by exploiting an interference\nalignment scheme. In addition, we propose a feedback framework for the\ninterference alignment in the limited feedback system. On the basis of the\nproposed feedback framework, we analyze the rate gap loss and it is shown that\nin order to keep the same multiplexing gain with the case of perfect CSIT, the\nnumber of feedback bits per receiver scales as $B \\geq\n(M\\!-1\\!)\\!\\log_{2}(\\textsf{SNR})+C$, where $M$ and $C$ denote the number of\ntransmit antennas and a constant, respectively. Throughout the simulation\nresults, it is shown that the sum-rate performance coincides with the derived\nresults.\n", "versions": [{"version": "v1", "created": "Tue, 5 Oct 2010 16:22:39 GMT"}], "update_date": "2010-10-06", "authors_parsed": [["Lee", "Namyoon", ""], ["Shin", "Wonjae", ""], ["Clerckx", "Bruno", ""]]}, {"id": "1010.0937", "submitter": "Namyoon Lee", "authors": "Namyoon Lee and Joohwan Chun", "title": "Signal Space Alignment for an Encryption Message and Successive Network\n  Code Decoding on the MIMO K-way Relay Channel", "comments": "5 pages, 3 figures, and submitted ICC 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates a network information flow problem for a\nmultiple-input multiple-output (MIMO) Gaussian wireless network with $K$-users\nand a single intermediate relay having $M$ antennas. In this network, each user\nintends to convey a multicast message to all other users while receiving $K-1$\nindependent messages from the other users via an intermediate relay. This\nnetwork information flow is termed a MIMO Gaussian $K$-way relay channel. For\nthis channel, we show that $\\frac{K}{2}$ degrees of freedom is achievable if\n$M=K-1$. To demonstrate this, we come up with an encoding and decoding strategy\ninspired from cryptography theory. The proposed encoding and decoding strategy\ninvolves a \\textit{signal space alignment for an encryption message} for the\nmultiple access phase (MAC) and \\textit{zero forcing with successive network\ncode decoding} for the broadcast (BC) phase. The idea of the \\emph{signal space\nalignment for an encryption message} is that all users cooperatively choose the\nprecoding vectors to transmit the message so that the relay can receive a\nproper encryption message with a special structure, \\textit{network code chain\nstructure}. During the BC phase, \\emph{zero forcing combined with successive\nnetwork code decoding} enables all users to decipher the encryption message\nfrom the relay despite the fact that they all have different self-information\nwhich they use as a key.\n", "versions": [{"version": "v1", "created": "Tue, 5 Oct 2010 16:40:13 GMT"}], "update_date": "2010-10-06", "authors_parsed": [["Lee", "Namyoon", ""], ["Chun", "Joohwan", ""]]}, {"id": "1010.1016", "submitter": "Brett Hern", "authors": "Brett Hern, Krishna Narayanan", "title": "Multilevel Coding Schemes for Compute-and-Forward", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate techniques for designing modulation/coding schemes for the\nwireless two-way relaying channel. The relay is assumed to have perfect channel\nstate information, but the transmitters are assumed to have no channel state\ninformation. We consider physical layer network coding based on multilevel\ncoding techniques. Our multilevel coding framework is inspired by the\ncompute-and-forward relaying protocol. Indeed, we show that the framework\ndeveloped here naturally facilitates decoding of linear combinations of\ncodewords for forwarding by the relay node. We develop our framework with\ngeneral modulation formats in mind, but numerical results are presented for the\ncase where each node transmits using the QPSK constellation with gray labeling.\nWe focus our discussion on the rates at which the relay may reliably decode\nlinear combinations of codewords transmitted from the end nodes.\n", "versions": [{"version": "v1", "created": "Tue, 5 Oct 2010 20:40:07 GMT"}, {"version": "v2", "created": "Wed, 27 Jul 2011 22:52:38 GMT"}], "update_date": "2011-07-29", "authors_parsed": [["Hern", "Brett", ""], ["Narayanan", "Krishna", ""]]}, {"id": "1010.1024", "submitter": "Ferdinando Cicalese", "authors": "Ferdinando Cicalese and Ugo Vaccaro", "title": "Superselectors: Efficient Constructions and Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new combinatorial structure: the superselector. We show that\nsuperselectors subsume several important combinatorial structures used in the\npast few years to solve problems in group testing, compressed sensing,\nmulti-channel conflict resolution and data security. We prove close upper and\nlower bounds on the size of superselectors and we provide efficient algorithms\nfor their constructions. Albeit our bounds are very general, when they are\ninstantiated on the combinatorial structures that are particular cases of\nsuperselectors (e.g., (p,k,n)-selectors, (d,\\ell)-list-disjunct matrices,\nMUT_k(r)-families, FUT(k, a)-families, etc.) they match the best known bounds\nin terms of size of the structures (the relevant parameter in the\napplications). For appropriate values of parameters, our results also provide\nthe first efficient deterministic algorithms for the construction of such\nstructures.\n", "versions": [{"version": "v1", "created": "Tue, 5 Oct 2010 21:20:31 GMT"}], "update_date": "2010-10-07", "authors_parsed": [["Cicalese", "Ferdinando", ""], ["Vaccaro", "Ugo", ""]]}, {"id": "1010.1042", "submitter": "James Y. Zhao", "authors": "James Y. Zhao", "title": "Hidden Markov Models with Multiple Observation Processes", "comments": "Masters Thesis, 79 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.IT cs.LG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a hidden Markov model with multiple observation processes, one of\nwhich is chosen at each point in time by a policy---a deterministic function of\nthe information state---and attempt to determine which policy minimises the\nlimiting expected entropy of the information state. Focusing on a special case,\nwe prove analytically that the information state always converges in\ndistribution, and derive a formula for the limiting entropy which can be used\nfor calculations with high precision. Using this fomula, we find\ncomputationally that the optimal policy is always a threshold policy, allowing\nit to be easily found. We also find that the greedy policy is almost optimal.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 00:36:04 GMT"}, {"version": "v2", "created": "Wed, 26 Jan 2011 00:58:25 GMT"}, {"version": "v3", "created": "Thu, 5 May 2011 08:34:07 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Zhao", "James Y.", ""]]}, {"id": "1010.1044", "submitter": "Lei Zhou", "authors": "Lei Zhou and Wei Yu", "title": "On the Capacity of the $K$-User Cyclic Gaussian Interference Channel", "comments": "To appear at IEEE Transactions on Information Theory. arXiv admin\n  note: substantial text overlap with arXiv:1103.5789", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This paper studies the capacity region of a $K$-user cyclic Gaussian\ninterference channel, where the $k$th user interferes with only the $(k-1)$th\nuser (mod $K$) in the network. Inspired by the work of Etkin, Tse and Wang, who\nderived a capacity region outer bound for the two-user Gaussian interference\nchannel and proved that a simple Han-Kobayashi power splitting scheme can\nachieve to within one bit of the capacity region for all values of channel\nparameters, this paper shows that a similar strategy also achieves the capacity\nregion of the $K$-user cyclic interference channel to within a constant gap in\nthe weak interference regime. Specifically, for the $K$-user cyclic Gaussian\ninterference channel, a compact representation of the Han-Kobayashi achievable\nrate region using Fourier-Motzkin elimination is first derived, a capacity\nregion outer bound is then established. It is shown that the Etkin-Tse-Wang\npower splitting strategy gives a constant gap of at most 2 bits in the weak\ninterference regime. For the special 3-user case, this gap can be sharpened to\n1 1/2 bits by time-sharing of several different strategies. The capacity result\nof the $K$-user cyclic Gaussian interference channel in the strong interference\nregime is also given. Further, based on the capacity results, this paper\nstudies the generalized degrees of freedom (GDoF) of the symmetric cyclic\ninterference channel. It is shown that the GDoF of the symmetric capacity is\nthe same as that of the classic two-user interference channel, no matter how\nmany users are in the network.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 00:54:02 GMT"}, {"version": "v2", "created": "Thu, 20 Jan 2011 04:22:52 GMT"}, {"version": "v3", "created": "Tue, 8 May 2012 17:53:48 GMT"}, {"version": "v4", "created": "Fri, 31 Aug 2012 05:32:44 GMT"}], "update_date": "2012-09-03", "authors_parsed": [["Zhou", "Lei", ""], ["Yu", "Wei", ""]]}, {"id": "1010.1052", "submitter": "Peiliang Xu", "authors": "Peiliang Xu, Elizabeth Cannon and Gerard Lachapelle", "title": "Mixed integer programming for the resolution of GPS carrier phase\n  ambiguities", "comments": "this is the unaltered version of our paper presented at the General\n  Assembly of the International Union of Geodesy and Geophysics, Boulder, 1995", "journal-ref": null, "doi": null, "report-no": "Technical Report Nr.2000.2, Department of Geodesy and\n  Geoinformatics, Stuttgart University", "categories": "cs.IT cs.DM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This arXiv upload is to clarify that the now well-known sorted QR MIMO\ndecoder was first presented in the 1995 IUGG General Assembly. We clearly go\nmuch further in the sense that we directly incorporated reduction into this one\nstep, non-exact suboptimal integer solution. Except for these first few lines\nup to this point, this paper is an unaltered version of the paper presented at\nthe IUGG1995 Assembly in Boulder.\n  Ambiguity resolution of GPS carrier phase observables is crucial in high\nprecision geodetic positioning and navigation applications. It consists of two\naspects: estimating the integer ambiguities in the mixed integer observation\nmodel and examining whether they are sufficiently accurate to be fixed as known\nnonrandom integers. We shall discuss the first point in this paper from the\npoint of view of integer programming. A one-step nonexact approach is proposed\nby employing minimum diagonal pivoting Gaussian decompositions, which may be\nthought of as an improvement of the simple rounding-off method, since the\nweights and correlations of the floating-estimated ambiguities are fully taken\ninto account. The second approach is to reformulate the mixed integer least\nsquares problem into the standard 0-1 linear integer programming model, which\ncan then be solved by using, for instance, the practically robust and efficient\nsimplex algorithm for linear integer programming. It is exact, if proper bounds\nfor the ambiguities are given. Theoretical results on decorrelation by\nunimodular transformation are given in the form of a theorem.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 03:02:20 GMT"}], "update_date": "2010-10-07", "authors_parsed": [["Xu", "Peiliang", ""], ["Cannon", "Elizabeth", ""], ["Lachapelle", "Gerard", ""]]}, {"id": "1010.1060", "submitter": "Vaneet Aggarwal", "authors": "Alireza Vahid, Vaneet Aggarwal, Amir Salman Avestimehr, Ashutosh\n  Sabharwal", "title": "On the Capacity of Multi-Hop Wireless Networks with Partial Network\n  Knowledge", "comments": "proceedings of Allerton conference 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In large wireless networks, acquiring full network state information is\ntypically infeasible. Hence, nodes need to flow the information and manage the\ninterference based on partial information about the network. In this paper, we\nconsider multi-hop wireless networks and assume that each source only knows the\nchannel gains that are on the routes from itself to other destinations in the\nnetwork. We develop several distributed strategies to manage the interference\namong the users and prove their optimality in maximizing the achievable\nnormalized sum-rate for some classes of networks.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 04:37:20 GMT"}, {"version": "v2", "created": "Thu, 7 Oct 2010 19:19:01 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Vahid", "Alireza", ""], ["Aggarwal", "Vaneet", ""], ["Avestimehr", "Amir Salman", ""], ["Sabharwal", "Ashutosh", ""]]}, {"id": "1010.1069", "submitter": "Jithin K. Sreedharan", "authors": "Jithin K S, Vinod Sharma, Raghav Gopalarathnam", "title": "Cooperative Distributed Sequential Spectrum Sensing", "comments": "This paper has been withdrawn by the author due to the submission of\n  detailed journal version of the same paper, to arXiv", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider cooperative spectrum sensing for cognitive radios. We develop an\nenergy efficient detector with low detection delay using sequential hypothesis\ntesting. Sequential Probability Ratio Test (SPRT) is used at both the local\nnodes and the fusion center. We also analyse the performance of this algorithm\nand compare with the simulations. Modelling uncertainties in the distribution\nparameters are considered. Slow fading with and without perfect channel state\ninformation at the cognitive radios is taken into account.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 06:46:21 GMT"}, {"version": "v2", "created": "Fri, 23 Nov 2012 22:39:40 GMT"}], "update_date": "2012-11-27", "authors_parsed": [["S", "Jithin K", ""], ["Sharma", "Vinod", ""], ["Gopalarathnam", "Raghav", ""]]}, {"id": "1010.1071", "submitter": "Jithin K. Sreedharan", "authors": "Jithin K S, Vinod Sharma", "title": "A Novel Algorithm for Cooperative Distributed Sequential Spectrum\n  Sensing in Cognitive Radio", "comments": "This paper has been withdrawn by the author due to the submission of\n  detailed journal version of the same paper, to arXiv", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers cooperative spectrum sensing in Cognitive Radios. In our\nprevious work we have developed DualSPRT, a distributed algorithm for\ncooperative spectrum sensing using Sequential Probability Ratio Test (SPRT) at\nthe Cognitive Radios as well as at the fusion center. This algorithm works\nwell, but is not optimal. In this paper we propose an improved algorithm-\nSPRT-CSPRT, which is motivated from Cumulative Sum Procedures (CUSUM). We\nanalyse it theoretically. We also modify this algorithm to handle uncertainties\nin SNR's and fading.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 06:51:56 GMT"}, {"version": "v2", "created": "Fri, 23 Nov 2012 22:39:23 GMT"}], "update_date": "2012-11-27", "authors_parsed": [["S", "Jithin K", ""], ["Sharma", "Vinod", ""]]}, {"id": "1010.1163", "submitter": "Raghava G D", "authors": "G. D. Raghava and B. Sundar Rajan", "title": "Secrecy Capacity of the Gaussian Wire-Tap Channel with Finite Complex\n  Constellation Input", "comments": "7 pages and 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The secrecy capacity of a discrete memoryless Gaussian Wire-Tap Channel when\nthe input is from a finite complex constellation is studied. It is shown that\nthe secrecy capacity curves of a finite constellation plotted against the SNR,\nfor a fixed noise variance of the eavesdropper's channel has a global maximum\nat an internal point. This is in contrast to what is known in the case of\nGaussian codebook input where the secrecy capacity curve is a bounded,\nmonotonically increasing function of SNR. Secrecy capacity curves for some well\nknown constellations like BPSK, 4-QAM, 16-QAM and 8-PSK are plotted and the SNR\nat which the maximum occurs is found through simulation. It is conjectured that\nthe secrecy capacity curves for finite constellations have a single maximum.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 14:25:47 GMT"}], "update_date": "2010-10-07", "authors_parsed": [["Raghava", "G. D.", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "1010.1256", "submitter": "Mark Wilde", "authors": "Mark M. Wilde, Min-Hsiu Hsieh, and Zunaira Babar", "title": "Entanglement-assisted quantum turbo codes", "comments": "31 pages, software for simulating EA turbo codes is available at\n  http://code.google.com/p/ea-turbo/ and a presentation is available at\n  http://markwilde.com/publications/10-10-EA-Turbo.ppt ; v2, revisions based on\n  feedback from journal; v3, modification of the quantum turbo decoding\n  algorithm that leads to improved performance over results in v2 and the\n  results of Poulin et al. in arXiv:0712.2888", "journal-ref": "IEEE Transactions on Information Theory vol. 60, no. 2, pages\n  1203-1222 (February 2014)", "doi": "10.1109/TIT.2013.2292052", "report-no": null, "categories": "quant-ph cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An unexpected breakdown in the existing theory of quantum serial turbo coding\nis that a quantum convolutional encoder cannot simultaneously be recursive and\nnon-catastrophic. These properties are essential for quantum turbo code\nfamilies to have a minimum distance growing with blocklength and for their\niterative decoding algorithm to converge, respectively. Here, we show that the\nentanglement-assisted paradigm simplifies the theory of quantum turbo codes, in\nthe sense that an entanglement-assisted quantum (EAQ) convolutional encoder can\npossess both of the aforementioned desirable properties. We give several\nexamples of EAQ convolutional encoders that are both recursive and\nnon-catastrophic and detail their relevant parameters. We then modify the\nquantum turbo decoding algorithm of Poulin et al., in order to have the\nconstituent decoders pass along only \"extrinsic information\" to each other\nrather than a posteriori probabilities as in the decoder of Poulin et al., and\nthis leads to a significant improvement in the performance of unassisted\nquantum turbo codes. Other simulation results indicate that\nentanglement-assisted turbo codes can operate reliably in a noise regime 4.73\ndB beyond that of standard quantum turbo codes, when used on a memoryless\ndepolarizing channel. Furthermore, several of our quantum turbo codes are\nwithin 1 dB or less of their hashing limits, so that the performance of quantum\nturbo codes is now on par with that of classical turbo codes. Finally, we prove\nthat entanglement is the resource that enables a convolutional encoder to be\nboth non-catastrophic and recursive because an encoder acting on only\ninformation qubits, classical bits, gauge qubits, and ancilla qubits cannot\nsimultaneously satisfy them.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 20:03:44 GMT"}, {"version": "v2", "created": "Sat, 1 Dec 2012 17:54:20 GMT"}, {"version": "v3", "created": "Wed, 15 May 2013 14:56:55 GMT"}], "update_date": "2014-01-28", "authors_parsed": [["Wilde", "Mark M.", ""], ["Hsieh", "Min-Hsiu", ""], ["Babar", "Zunaira", ""]]}, {"id": "1010.1286", "submitter": "John Kieffer", "authors": "John Kieffer, Yu Liao", "title": "Exact Hamming Distortion Analysis of Viterbi Encoded Trellis Coded\n  Quantizers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let G be a finite strongly connected aperiodic directed graph in which each\nedge carries a label from a finite alphabet A. Then G induces a trellis coded\nquantizer for encoding an alphabet A memoryless source. A source sequence of\nlong finite length is encoded by finding a path in G of that length whose\nsequence of labels is closest in Hamming distance to the source sequence;\nfinding the minimum distance path is a dynamic programming problem that is\nsolved using the Viterbi algorithm. We show how a Markov chain can be used to\nobtain a closed form expression for the asymptotic expected Hamming distortion\nper sample that results as the number of encoded source samples increases\nwithout bound.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 21:27:35 GMT"}], "update_date": "2010-10-08", "authors_parsed": [["Kieffer", "John", ""], ["Liao", "Yu", ""]]}, {"id": "1010.1295", "submitter": "Jing Yang", "authors": "Jing Yang and Sennur Ulukus", "title": "Optimal Packet Scheduling in an Energy Harvesting Communication System", "comments": "Submitted to IEEE Transactions on Communications, June 2010.\n  Conference version appeared in CISS 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the optimal packet scheduling problem in a single-user energy\nharvesting wireless communication system. In this system, both the data packets\nand the harvested energy are modeled to arrive at the source node randomly. Our\ngoal is to adaptively change the transmission rate according to the traffic\nload and available energy, such that the time by which all packets are\ndelivered is minimized. Under a deterministic system setting, we assume that\nthe energy harvesting times and harvested energy amounts are known before the\ntransmission starts. For the data traffic arrivals, we consider two different\nscenarios. In the first scenario, we assume that all bits have arrived and are\nready at the transmitter before the transmission starts. In the second\nscenario, we consider the case where packets arrive during the transmissions,\nwith known arrival times and sizes. We develop optimal off-line scheduling\npolicies which minimize the time by which all packets are delivered to the\ndestination, under causality constraints on both data and energy arrivals.\n", "versions": [{"version": "v1", "created": "Wed, 6 Oct 2010 22:33:00 GMT"}], "update_date": "2010-10-08", "authors_parsed": [["Yang", "Jing", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1010.1303", "submitter": "Ali Nazari", "authors": "Ali Nazari, Achilleas Anastasopoulos and S. Sandeep Pradhan", "title": "Error Exponent for Multiple-Access Channels:Lower Bounds", "comments": "46 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A unified framework to obtain all known lower bounds (random coding, typical\nrandom coding and expurgated bound) on the reliability function of a\npoint-to-point discrete memoryless channel (DMC) is presented. By using a\nsimilar idea for a two-user discrete memoryless (DM) multiple-access channel\n(MAC), three lower bounds on the reliability function are derived. The first\none (random coding) is identical to the best known lower bound on the\nreliability function of DM-MAC. It is shown that the random coding bound is the\nperformance of the average code in the constant composition code ensemble. The\nsecond bound (Typical random coding) is the typical performance of the constant\ncomposition code ensemble. To derive the third bound (expurgated), we eliminate\nsome of the codewords from the codebook with larger rate. This is the first\nbound of this type that explicitly uses the method of expurgation for MACs. It\nis shown that the exponent of the typical random coding and the expurgated\nbounds are greater than or equal to the exponent of the known random coding\nbounds for all rate pairs. Moreover, an example is given where the exponent of\nthe expurgated bound is strictly larger. All these bounds can be universally\nobtained for all discrete memoryless MACs with given input and output\nalphabets.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 00:08:41 GMT"}], "update_date": "2010-10-08", "authors_parsed": [["Nazari", "Ali", ""], ["Anastasopoulos", "Achilleas", ""], ["Pradhan", "S. Sandeep", ""]]}, {"id": "1010.1309", "submitter": "Himanshu Asnani", "authors": "Himanshu Asnani, Haim Permuter, Tsachy Weissman", "title": "Probing Capacity", "comments": "20 pages, Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2162089", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of optimal probing of states of a channel by\ntransmitter and receiver for maximizing rate of reliable communication. The\nchannel is discrete memoryless (DMC) with i.i.d. states. The encoder takes\nprobing actions dependent on the message. It then uses the state information\nobtained from probing causally or non-causally to generate channel input\nsymbols. The decoder may also take channel probing actions as a function of the\nobserved channel output and use the channel state information thus acquired,\nalong with the channel output, to estimate the message. We refer to the maximum\nachievable rate for reliable communication for such systems as the 'Probing\nCapacity'. We characterize this capacity when the encoder and decoder actions\nare cost constrained. To motivate the problem, we begin by characterizing the\ntrade-off between the capacity and fraction of channel states the encoder is\nallowed to observe, while the decoder is aware of channel states. In this\nsetting of 'to observe or not to observe' state at the encoder, we compute\ncertain numerical examples and note a pleasing phenomenon, where encoder can\nobserve a relatively small fraction of states and yet communicate at maximum\nrate, i.e. rate when observing states at encoder is not cost constrained.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 01:12:45 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Asnani", "Himanshu", ""], ["Permuter", "Haim", ""], ["Weissman", "Tsachy", ""]]}, {"id": "1010.1317", "submitter": "Ali Nazari", "authors": "Ali Nazari, Ramji Venkataramanan, Dinesh Krithivasan, S. Sandeep\n  Pradhan, Achilleas Anastasopoulos", "title": "Typicality Graphs:Large Deviation Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $\\mathcal{X}$ and $\\mathcal{Y}$ be finite alphabets and $P_{XY}$ a joint\ndistribution over them, with $P_X$ and $P_Y$ representing the marginals. For\nany $\\epsilon > 0$, the set of $n$-length sequences $x^n$ and $y^n$ that are\njointly typical \\cite{ckbook} according to $P_{XY}$ can be represented on a\nbipartite graph. We present a formal definition of such a graph, known as a\n\\emph{typicality} graph, and study some of its properties.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 02:39:54 GMT"}, {"version": "v2", "created": "Fri, 8 Oct 2010 18:03:35 GMT"}], "update_date": "2010-10-11", "authors_parsed": [["Nazari", "Ali", ""], ["Venkataramanan", "Ramji", ""], ["Krithivasan", "Dinesh", ""], ["Pradhan", "S. Sandeep", ""], ["Anastasopoulos", "Achilleas", ""]]}, {"id": "1010.1322", "submitter": "Ali Nazari", "authors": "Ali Nazari, S. Sandeep Pradhan and Achilleas Anastasopoulos", "title": "A New Upper Bound on the Average Error Exponent for Multiple-Access\n  Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new lower bound for the average probability or error for a two-user\ndiscrete memoryless (DM) multiple-access channel (MAC) is derived. This bound\nhas a structure very similar to the well-known sphere packing packing bound\nderived by Haroutunian. However, since explicitly imposes independence of the\nusers' input distributions (conditioned on the time-sharing auxiliary variable)\nresults in a tighter sphere-packing exponent in comparison to Haroutunian's.\nAlso, the relationship between average and maximal error probabilities is\nstudied. Finally, by using a known sphere packing bound on the maximal\nprobability of error, a lower bound on the average error probability is\nderived.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 04:00:47 GMT"}], "update_date": "2010-10-08", "authors_parsed": [["Nazari", "Ali", ""], ["Pradhan", "S. Sandeep", ""], ["Anastasopoulos", "Achilleas", ""]]}, {"id": "1010.1328", "submitter": "Hector Zenil", "authors": "Joost J. Joosten, Fernando Soler-Toscano, Hector Zenil", "title": "Complejidad descriptiva y computacional en maquinas de Turing pequenas", "comments": "Art\\'iculo en espa\\~nol. Actas de las V Jornadas Ib\\'ericas, L\\'ogica\n  Universal e Unidade da Ciencia, CFCUL, 2010. 20 pages, 22 figures, 3 tables;\n  Keywords: small Turing machines, Program-size complexity, Kolmogorov-Chaitin\n  complexity, space-time complexity, computational complexity, algorithmic\n  complexity, geometric complexity", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We start by an introduction to the basic concepts of computability theory and\nthe introduction of the concept of Turing machine and computation universality.\nThen se turn to the exploration of trade-offs between different measures of\ncomplexity, particularly algorithmic (program-size) and computational (time)\ncomplexity as a mean to explain these measure in a novel manner. The\ninvestigation proceeds by an exhaustive exploration and systematic study of the\nfunctions computed by a large set of small Turing machines with 2 and 3 states\nwith particular attention to runtimes, space-usages and patterns corresponding\nto the computed functions when the machines have access to larger resources\n(more states).\n  We report that the average runtime of Turing machines computing a function\nincreases as a function of the number of states, indicating that non-trivial\nmachines tend to occupy all the resources at hand. General slow-down was\nwitnessed and some incidental cases of (linear) speed-up were found. Throughout\nour study various interesting structures were encountered. We unveil a study of\nstructures in the micro-cosmos of small Turing machines.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 04:13:26 GMT"}, {"version": "v2", "created": "Fri, 15 Apr 2011 20:18:57 GMT"}], "update_date": "2011-04-19", "authors_parsed": [["Joosten", "Joost J.", ""], ["Soler-Toscano", "Fernando", ""], ["Zenil", "Hector", ""]]}, {"id": "1010.1331", "submitter": "Cuizhu Shi", "authors": "Cuizhu Shi and Aditya Ramamoorthy", "title": "Improved Combinatorial Algorithms for Wireless Information Flow", "comments": "6 pages, 2 figures, presented at Allerton 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The work of Avestimehr et al. '07 has recently proposed a deterministic model\nfor wireless networks and characterized the unicast capacity C of such networks\nas the minimum rank of the adjacency matrices describing all possible\nsource-destination cuts. Amaudruz & Fragouli first proposed a polynomial-time\nalgorithm for finding the unicast capacity of a linear deterministic wireless\nnetwork in their 2009 paper. In this work, we improve upon Amaudruz &\nFragouli's work and further reduce the computational complexity of the\nalgorithm by fully exploring the useful combinatorial features intrinsic in the\nproblem. Our improvement applies generally with any size of finite fields\nassociated with the channel model. Comparing with other algorithms on solving\nthe same problem, our improved algorithm is very competitive in terms of\ncomplexity.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 04:28:25 GMT"}], "update_date": "2010-10-08", "authors_parsed": [["Shi", "Cuizhu", ""], ["Ramamoorthy", "Aditya", ""]]}, {"id": "1010.1358", "submitter": "Masahito Hayashi", "authors": "Masahito Hayashi", "title": "Tight exponential analysis of universally composable privacy\n  amplification and its applications", "comments": "Several errors are fixed. The title is slightly changed. The topic\n  and protocol are similar to those in arXiv:0904.0308. However, the security\n  criterion of this paper is different from arXiv:0904.0308. This paper adopts\n  the universal composability while arXiv:0904.0308 adopts the mutual\n  information criterion", "journal-ref": "IEEE Transactions on Information Theory, Vol. 59, No. 11,\n  7728-7746 (2013)", "doi": "10.1109/TIT.2013.2278971", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the desirability of universal composability, we analyze in terms\nof L_1 distinguishability the task of secret key generation from a joint random\nvariable. Under this secrecy criterion, using the Renyi entropy of order 1+s\nfor s in [0,1, we derive a new upper bound of Eve's distinguishability under\nthe application of the universal2 hash functions. It is also shown that this\nbound gives the tight exponential rate of decrease in the case of independent\nand identical distributions. The result is applied to the wire-tap channel\nmodel and to secret key generation (distillation) by public discussion.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 07:25:20 GMT"}, {"version": "v2", "created": "Mon, 14 Feb 2011 05:16:17 GMT"}, {"version": "v3", "created": "Fri, 7 Oct 2011 08:13:46 GMT"}, {"version": "v4", "created": "Fri, 3 Feb 2012 03:27:33 GMT"}, {"version": "v5", "created": "Sat, 10 Aug 2013 20:52:14 GMT"}], "update_date": "2016-09-28", "authors_parsed": [["Hayashi", "Masahito", ""]]}, {"id": "1010.1391", "submitter": "Karthik Muralidhar Dr", "authors": "Kathik Muralidhar, Kwok Hung Li", "title": "On the Full Column-Rank Condition of the Channel Estimation Matrix in\n  Doubly-Selective MIMO-OFDM Systems", "comments": "19 Pages, 4 figures, currently under review in IEEE Transactions\n  Signal Processing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, this journal has published a paper which dealt with basis expansion\nmodel (BEM) based least-squares (LS) channel estimation in doubly-selective\northogonal frequency-division multiplexing (DS-OFDM) systems. The least-squares\nchannel estimator computes the pseudo-inverse of a channel estimation matrix.\nFor the existence of the pseudo-inverse, it is necessary that the channel\nestimation matrix be of full column rank. In this paper, we investigate the\nconditions that need to be satisfied that ensures the full column-rank\ncondition of the channel estimation matrix. In particular, we derive conditions\nthat the BEM and pilot pattern designs should satisfy to ensure that the\nchannel estimation matrix is of full column rank. We explore the polynomial BEM\n(P-BEM), complex exponential BEM (CE-BEM), Slepian BEM (S-BEM) and generalized\ncomplex exponential BEM (GCE-BEM). We present one possible way to design the\npilot patterns which satisfy the full column-rank conditions. Furthermore, the\nproposed method is extended to the case of multiple-input multiple-output\n(MIMO) DS-OFDM systems as well. Examples of pilot pattern designs are\npresented, that ensure the channel estimation matrix is of full column rank for\na large DS-MIMO-OFDM system with as many as six transmitters, six receivers and\n1024 subcarriers.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 10:36:21 GMT"}], "update_date": "2010-10-08", "authors_parsed": [["Muralidhar", "Kathik", ""], ["Li", "Kwok Hung", ""]]}, {"id": "1010.1438", "submitter": "Walid Saad", "authors": "Walid Saad and Zhu Han and Are Hj{\\o}rungnes and Dusit Niyato and\n  Ekram Hossain", "title": "Coalition Formation Games for Distributed Cooperation Among Roadside\n  Units in Vehicular Networks", "comments": "accepted and to appear in IEEE Journal on Selected Areas in\n  Communications (JSAC), Special issue on Vehicular Communications and Networks", "journal-ref": "IEEE Journal on Selected Areas in Communications (JSAC), 2010", "doi": null, "report-no": null, "categories": "cs.IT cs.GT cs.SY math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicle-to-roadside (V2R) communications enable vehicular networks to support\na wide range of applications for enhancing the efficiency of road\ntransportation. While existing work focused on non-cooperative techniques for\nV2R communications between vehicles and roadside units (RSUs), this paper\ninvestigates novel cooperative strategies among the RSUs in a vehicular\nnetwork. We propose a scheme whereby, through cooperation, the RSUs in a\nvehicular network can coordinate the classes of data being transmitted through\nV2R communications links to the vehicles. This scheme improves the diversity of\nthe information circulating in the network while exploiting the underlying\ncontent-sharing vehicle-to-vehicle communication network. We model the problem\nas a coalition formation game with transferable utility and we propose an\nalgorithm for forming coalitions among the RSUs. For coalition formation, each\nRSU can take an individual decision to join or leave a coalition, depending on\nits utility which accounts for the generated revenues and the costs for\ncoalition coordination. We show that the RSUs can self-organize into a\nNash-stable partition and adapt this partition to environmental changes.\nSimulation results show that, depending on different scenarios, coalition\nformation presents a performance improvement, in terms of the average payoff\nper RSU, ranging between 20.5% and 33.2%, relative to the non-cooperative case.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 14:18:26 GMT"}], "update_date": "2010-10-08", "authors_parsed": [["Saad", "Walid", ""], ["Han", "Zhu", ""], ["Hjørungnes", "Are", ""], ["Niyato", "Dusit", ""], ["Hossain", "Ekram", ""]]}, {"id": "1010.1499", "submitter": "Mohammad Ali Maddah-Ali Mr.", "authors": "Mohammad Ali Maddah-Ali and David Tse", "title": "Completely Stale Transmitter Channel State Information is Still Very\n  Useful", "comments": "Initially reported as Technical Report No. UCB/EECS-2010-122 at the\n  University of California--Berkeley, Sept. 6, 2010. Presented at the\n  Forty-Eighth Annual Allerton Conference, Sept. 2010. Accepted for IEEE\n  Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transmitter channel state information (CSIT) is crucial for the multiplexing\ngains offered by advanced interference management techniques such as multiuser\nMIMO and interference alignment. Such CSIT is usually obtained by feedback from\nthe receivers, but the feedback is subject to delays. The usual approach is to\nuse the fed back information to predict the current channel state and then\napply a scheme designed assuming perfect CSIT. When the feedback delay is large\ncompared to the channel coherence time, such a prediction approach completely\nfails to achieve any multiplexing gain. In this paper, we show that even in\nthis case, the completely stale CSI is still very useful. More concretely, we\nshow that in a MIMO broadcast channel with $K$ transmit antennas and $K$\nreceivers each with 1 receive antenna, $\\frac{K}{1+1/2+ ...+ \\frac{1}{K}} (> 1)\n$ degrees of freedom is achievable even when the fed back channel state is\ncompletely independent of the current channel state. Moreover, we establish\nthat if all receivers have independent and identically distributed channels,\nthen this is the optimal number of degrees of freedom achievable. In the\noptimal scheme, the transmitter uses the fed back CSI to learn the side\ninformation that the receivers receive from previous transmissions rather than\nto predict the current channel state. Our result can be viewed as the first\nexample of feedback providing a degree-of-freedom gain in memoryless channels.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 18:00:46 GMT"}, {"version": "v2", "created": "Mon, 26 Sep 2011 13:41:28 GMT"}, {"version": "v3", "created": "Fri, 29 Jun 2012 16:38:17 GMT"}], "update_date": "2012-07-02", "authors_parsed": [["Maddah-Ali", "Mohammad Ali", ""], ["Tse", "David", ""]]}, {"id": "1010.1508", "submitter": "Sudhakar Prasad", "authors": "Sudhakar Prasad", "title": "Certain Relations between Mutual Information and Fidelity of Statistical\n  Estimation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I present several new relations between mutual information (MI) and\nstatistical estimation error for a system that can be regarded simultaneously\nas a communication channel and as an estimator of an input parameter. I first\nderive a second-order result between MI and Fisher information (FI) that is\nvalid for sufficiently narrow priors, but arbitrary channels. A second relation\nfurnishes a lower bound on the MI in terms of the minimum mean-squared error\n(MMSE) on the Bayesian estimation of the input parameter from the channel\noutput, one that is valid for arbitrary channels and priors. The existence of\nsuch a lower bound, while extending previous work relating the MI to the FI\nthat is valid only in the asymptotic and high-SNR limits, elucidates further\nthe fundamental connection between information and estimation theoretic\nmeasures of fidelity. The remaining relations I present are inequalities and\ncorrespondences among MI, FI, and MMSE in the presence of nuisance parameters.\n", "versions": [{"version": "v1", "created": "Thu, 7 Oct 2010 18:42:36 GMT"}], "update_date": "2010-10-08", "authors_parsed": [["Prasad", "Sudhakar", ""]]}, {"id": "1010.1584", "submitter": "RadhaKrishna Ganti", "authors": "Radha Krishna Ganti, Jeffrey G. Andrews, and Martin Haenggi", "title": "High-SIR Transmission Capacity of Wireless Networks with General Fading\n  and Node Distribution", "comments": "Submitted to IEEE Trans. Info Theory special issue", "journal-ref": null, "doi": "10.1109/TIT.2011.2120230", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many wireless systems, interference is the main performance-limiting\nfactor, and is primarily dictated by the locations of concurrent transmitters.\nIn many earlier works, the locations of the transmitters is often modeled as a\nPoisson point process for analytical tractability. While analytically\nconvenient, the PPP only accurately models networks whose nodes are placed\nindependently and use ALOHA as the channel access protocol, which preserves the\nindependence. Correlations between transmitter locations in non-Poisson\nnetworks, which model intelligent access protocols, makes the outage analysis\nextremely difficult. In this paper, we take an alternative approach and focus\non an asymptotic regime where the density of interferers $\\eta$ goes to 0. We\nprove for general node distributions and fading statistics that the success\nprobability $\\p \\sim 1-\\gamma \\eta^{\\kappa}$ for $\\eta \\rightarrow 0$, and\nprovide values of $\\gamma$ and $\\kappa$ for a number of important special\ncases. We show that $\\kappa$ is lower bounded by 1 and upper bounded by a value\nthat depends on the path loss exponent and the fading. This new analytical\nframework is then used to characterize the transmission capacity of a very\ngeneral class of networks, defined as the maximum spatial density of active\nlinks given an outage constraint.\n", "versions": [{"version": "v1", "created": "Fri, 8 Oct 2010 02:59:01 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Ganti", "Radha Krishna", ""], ["Andrews", "Jeffrey G.", ""], ["Haenggi", "Martin", ""]]}, {"id": "1010.1605", "submitter": "Rahul Vaze", "authors": "Naqueeb Warsi, Rahul Vaze, Tapan Shah", "title": "Communicating Under Channel Uncertainty", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a single transmit and receive antenna system, a new constellation design\nis proposed to combat errors in the phase estimate of the channel coefficient.\nThe proposed constellation is a combination of PSK and PAM constellations,\nwhere PSK is used to provide protection against phase errors, while PAM is used\nto increase the transmission rate using the knowledge of the magnitude of the\nchannel coefficient. The performance of the proposed constellation is shown to\nbe significantly better than the widely used QAM in terms of probability of\nerror. The proposed strategy can also be extended to systems using multiple\ntransmit and receive antennas.\n", "versions": [{"version": "v1", "created": "Fri, 8 Oct 2010 06:34:33 GMT"}], "update_date": "2010-10-11", "authors_parsed": [["Warsi", "Naqueeb", ""], ["Vaze", "Rahul", ""], ["Shah", "Tapan", ""]]}, {"id": "1010.1648", "submitter": "Adri\\`a Tauste Campo", "authors": "Adri\\`a Tauste Campo, Albert Guill\\'en i F\\`abregas and Ezio Biglieri", "title": "Large-System Analysis of Multiuser Detection with an Unknown Number of\n  Users: A High-SNR Approach", "comments": "to appear in IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2132410", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze multiuser detection under the assumption that the number of users\naccessing the channel is unknown by the receiver. In this environment, users'\nactivity must be estimated along with any other parameters such as data, power,\nand location. Our main goal is to determine the performance loss caused by the\nneed for estimating the identities of active users, which are not known a\npriori. To prevent a loss of optimality, we assume that identities and data are\nestimated jointly, rather than in two separate steps. We examine the\nperformance of multiuser detectors when the number of potential users is large.\nStatistical-physics methodologies are used to determine the macroscopic\nperformance of the detector in terms of its multiuser efficiency. Special\nattention is paid to the fixed-point equation whose solution yields the\nmultiuser efficiency of the optimal (maximum a posteriori) detector in the\nlarge signal-to-noise ratio regime. Our analysis yields closed-form approximate\nbounds to the minimum mean-squared error in this regime. These illustrate the\nset of solutions of the fixed-point equation, and their relationship with the\nmaximum system load. Next, we study the maximum load that the detector can\nsupport for a given quality of service (specified by error probability).\n", "versions": [{"version": "v1", "created": "Fri, 8 Oct 2010 10:19:52 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Campo", "Adrià Tauste", ""], ["Fàbregas", "Albert Guillén i", ""], ["Biglieri", "Ezio", ""]]}, {"id": "1010.1669", "submitter": "Vishwambhar Rathi", "authors": "Vishwambhar Rathi, Ruediger Urbanke, Mattias Andersson, Mikael\n  Skoglund", "title": "Rate-Equivocation Optimal Spatially Coupled LDPC Codes for the BEC\n  Wiretap Channel", "comments": "Working paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider transmission over a wiretap channel where both the main channel\nand the wiretapper's channel are Binary Erasure Channels (BEC). We use\nconvolutional LDPC ensembles based on the coset encoding scheme. More\nprecisely, we consider regular two edge type convolutional LDPC ensembles. We\nshow that such a construction achieves the whole rate-equivocation region of\nthe BEC wiretap channel.\n  Convolutional LDPC ensemble were introduced by Felstr\\\"om and Zigangirov and\nare known to have excellent thresholds. Recently, Kudekar, Richardson, and\nUrbanke proved that the phenomenon of \"Spatial Coupling\" converts MAP threshold\ninto BP threshold for transmission over the BEC.\n  The phenomenon of spatial coupling has been observed to hold for general\nbinary memoryless symmetric channels. Hence, we conjecture that our\nconstruction is a universal rate-equivocation achieving construction when the\nmain channel and wiretapper's channel are binary memoryless symmetric channels,\nand the wiretapper's channel is degraded with respect to the main channel.\n", "versions": [{"version": "v1", "created": "Fri, 8 Oct 2010 11:50:43 GMT"}, {"version": "v2", "created": "Mon, 18 Jul 2011 21:23:14 GMT"}], "update_date": "2011-07-20", "authors_parsed": [["Rathi", "Vishwambhar", ""], ["Urbanke", "Ruediger", ""], ["Andersson", "Mattias", ""], ["Skoglund", "Mikael", ""]]}, {"id": "1010.1800", "submitter": "John Tadrous Mr.", "authors": "Hesham El-Gamal, John Tadrous and Atilla Eryilmaz", "title": "Proactive Resource Allocation: Turning Predictable Behavior into\n  Spectral Gain", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI cs.SI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces the novel concept of proactive resource allocation in\nwhich the predictability of user behavior is exploited to balance the wireless\ntraffic over time, and hence, significantly reduce the bandwidth required to\nachieve a given blocking/outage probability. We start with a simple model in\nwhich the smart wireless devices are assumed to predict the arrival of new\nrequests and submit them to the network T time slots in advance. Using tools\nfrom large deviation theory, we quantify the resulting prediction diversity\ngain to establish that the decay rate of the outage event probabilities\nincreases linearly with the prediction duration T. This model is then\ngeneralized to incorporate the effect of prediction errors and the randomness\nin the prediction lookahead time T. Remarkably, we also show that, in the\ncognitive networking scenario, the appropriate use of proactive resource\nallocation by the primary users results in more spectral opportunities for the\nsecondary users at a marginal, or no, cost in the primary network outage.\nFinally, we conclude by a discussion of the new research questions posed under\nthe umbrella of the proposed proactive (non-causal) wireless networking\nframework.\n", "versions": [{"version": "v1", "created": "Sat, 9 Oct 2010 01:34:14 GMT"}], "update_date": "2010-10-12", "authors_parsed": [["El-Gamal", "Hesham", ""], ["Tadrous", "John", ""], ["Eryilmaz", "Atilla", ""]]}, {"id": "1010.1847", "submitter": "Holger Rauhut", "authors": "Holger Rauhut, Justin Romberg, Joel A. Tropp", "title": "Restricted Isometries for Partial Random Circulant Matrices", "comments": null, "journal-ref": "Probab. Theory Related Fields, Vol. 156, num. 3--4, pp. 707-737,\n  Aug. 2013", "doi": "10.1007/s00440-012-0441-4", "report-no": null, "categories": "cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the theory of compressed sensing, restricted isometry analysis has become\na standard tool for studying how efficiently a measurement matrix acquires\ninformation about sparse and compressible signals. Many recovery algorithms are\nknown to succeed when the restricted isometry constants of the sampling matrix\nare small. Many potential applications of compressed sensing involve a\ndata-acquisition process that proceeds by convolution with a random pulse\nfollowed by (nonrandom) subsampling. At present, the theoretical analysis of\nthis measurement technique is lacking. This paper demonstrates that the $s$th\norder restricted isometry constant is small when the number $m$ of samples\nsatisfies $m \\gtrsim (s \\log n)^{3/2}$, where $n$ is the length of the pulse.\nThis bound improves on previous estimates, which exhibit quadratic scaling.\n", "versions": [{"version": "v1", "created": "Sat, 9 Oct 2010 13:37:02 GMT"}], "update_date": "2014-04-29", "authors_parsed": [["Rauhut", "Holger", ""], ["Romberg", "Justin", ""], ["Tropp", "Joel A.", ""]]}, {"id": "1010.1865", "submitter": "Yin  Sun", "authors": "Yin Sun, Arpad Baricz and Shidong Zhou", "title": "Corrections to \"Unified Laguerre polynomial-series-based distribution of\n  small-scale fading envelopes''", "comments": "2 pages, to be published in the IEEE Transactions on Vehicular\n  Technology as a Correspondence", "journal-ref": "Transactions on Vehicular Technology 60(1) (2011) 347-349", "doi": "10.1109/TVT.2010.2087368", "report-no": null, "categories": "math.PR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this correspondence, we point out two typographical errors in Chai and\nTjhung's paper and we offer the correct formula of the unified Laguerre\npolynomial-series-based cumulative distribution function (cdf) for small-scale\nfading distributions. A Laguerre polynomial-series-based cdf formula for\nnon-central chi-square distribution is also provided as a special case of our\nunified cdf result.\n", "versions": [{"version": "v1", "created": "Sat, 9 Oct 2010 19:05:34 GMT"}], "update_date": "2011-02-10", "authors_parsed": [["Sun", "Yin", ""], ["Baricz", "Arpad", ""], ["Zhou", "Shidong", ""]]}, {"id": "1010.1899", "submitter": "Guang Xuan", "authors": "Xuan Guang, Fang-Wei Fu", "title": "The Failure Probability at Sink Node of Random Linear Network Coding", "comments": "4 pages, 1 figure, to appear in Proceedings of ICITIS 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In practice, since many communication networks are huge in scale or\ncomplicated in structure even dynamic, the predesigned network codes based on\nthe network topology is impossible even if the topological structure is known.\nTherefore, random linear network coding was proposed as an acceptable coding\ntechnique. In this paper, we further study the performance of random linear\nnetwork coding by analyzing the failure probabilities at sink node for\ndifferent knowledge of network topology and get some tight and asymptotically\ntight upper bounds of the failure probabilities. In particular, the worst cases\nare indicated for these bounds. Furthermore, if the more information about the\nnetwork topology is utilized, the better upper bounds are obtained. These\nbounds improve on the known ones. Finally, we also discuss the lower bound of\nthis failure probability and show that it is also asymptotically tight.\n", "versions": [{"version": "v1", "created": "Sun, 10 Oct 2010 07:50:07 GMT"}], "update_date": "2010-10-12", "authors_parsed": [["Guang", "Xuan", ""], ["Fu", "Fang-Wei", ""]]}, {"id": "1010.1911", "submitter": "Iryna Andriyanova", "authors": "Iryna Andriyanova and Jean-Pierre Tillich", "title": "On a Low-Rate TLDPC Code Ensemble and the Necessary Condition on the\n  Linear Minimum Distance for Sparse-Graph Codes", "comments": "submitted to IEEE Trans. on Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the issue of design of low-rate sparse-graph codes with\nlinear minimum distance in the blocklength. First, we define a necessary\ncondition which needs to be satisfied when the linear minimum distance is to be\nensured. The condition is formulated in terms of degree-1 and degree-2 variable\nnodes and of low-weight codewords of the underlying code, and it generalizies\nresults known for turbo codes [8] and LDPC codes. Then, we present a new\nensemble of low-rate codes, which itself is a subclass of TLDPC codes [4], [5],\nand which is designed under this necessary condition. The asymptotic analysis\nof the ensemble shows that its iterative threshold is situated close to the\nShannon limit. In addition to the linear minimum distance property, it has a\nsimple structure and enjoys a low decoding complexity and a fast convergence.\n", "versions": [{"version": "v1", "created": "Sun, 10 Oct 2010 11:35:45 GMT"}], "update_date": "2010-10-12", "authors_parsed": [["Andriyanova", "Iryna", ""], ["Tillich", "Jean-Pierre", ""]]}, {"id": "1010.1973", "submitter": "Stefano Galli", "authors": "Stefano Galli, Anna Scaglione, Zhifang Wang", "title": "For the Grid and Through the Grid: The Role of Power Line Communications\n  in the Smart Grid", "comments": "26 pages, 6 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT cs.SY math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Is Power Line Communications (PLC) a good candidate for Smart Grid\napplications? The objective of this paper is to address this important\nquestion. To do so we provide an overview of what PLC can deliver today by\nsurveying its history and describing the most recent technological advances in\nthe area. We then address Smart Grid applications as instances of sensor\nnetworking and network control problems and discuss the main conclusion one can\ndraw from the literature on these subjects. The application scenario of PLC\nwithin the Smart Grid is then analyzed in detail. Since a necessary ingredient\nof network planning is modeling, we also discuss two aspects of engineering\nmodeling that relate to our question. The first aspect is modeling the PLC\nchannel through fading models. The second aspect we review is the Smart Grid\ncontrol and traffic modeling problem which allows us to achieve a better\nunderstanding of the communications requirements. Finally, this paper reports\nrecent studies on the electrical and topological properties of a sample power\ndistribution network. Power grid topological studies are very important for PLC\nnetworking as the power grid is not only the information source \\textit{but\nalso} the information delivery system - a unique feature when PLC is used for\nthe Smart Grid.\n", "versions": [{"version": "v1", "created": "Sun, 10 Oct 2010 23:32:11 GMT"}, {"version": "v2", "created": "Wed, 12 Jan 2011 19:33:27 GMT"}], "update_date": "2011-01-13", "authors_parsed": [["Galli", "Stefano", ""], ["Scaglione", "Anna", ""], ["Wang", "Zhifang", ""]]}, {"id": "1010.1985", "submitter": "Peyman Razaghi", "authors": "Peyman Razaghi and Giuseppe Caire", "title": "Relay Strategies Based on Cross-Determinism for the Broadcast Relay\n  Channel", "comments": "Presented at 42nd Allerton Conference on Communications, Control, and\n  Computing, Allerton, IL, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  We consider a two-user Gaussian multiple-input multiple-output (MIMO)\nbroadcast channel with a common multiple-antenna relay, and a shared digital\n(noiseless) link between the relay and the two destinations. For this channel,\nthis paper introduces an asymptotically sum-capacity-achieving\nquantize-and-forward (QF) relay strategy. Our technique to design an\nasymptotically optimal relay quantizer is based on identifying a\ncross-deterministic relation between the relay observation, the source signal,\nand the destination observation. In a relay channel, an approximate cross\ndeterministic relation corresponds to an approximately deterministic relation,\nwhere the relay observation is to some extent a deterministic function of the\nsource and destination signals. We show that cross determinism can serve as a\nmeasure for quantization penalty. By identifying an analogy between a\ndeterministic broadcast relay channel and a Gaussian MIMO relay channel, we\npropose a three-stage dirty paper coding strategy, along with receiver\nbeamforming and quantization at the relay, to asymptotically achieve an\nextended achievable rate region for the MIMO broadcast channel with a common\nmultiple-antenna relay.\n", "versions": [{"version": "v1", "created": "Mon, 11 Oct 2010 01:44:20 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Razaghi", "Peyman", ""], ["Caire", "Giuseppe", ""]]}, {"id": "1010.2030", "submitter": "Shengtian Yang", "authors": "Shengtian Yang, Thomas Honold, Yan Chen, Zhaoyang Zhang, Peiliang Qiu", "title": "Weight Distributions of Regular Low-Density Parity-Check Codes over\n  Finite Fields", "comments": "15 pages, 5 figures, accepted for publication in IEEE Transactions on\n  Information Theory, July 2011", "journal-ref": "IEEE Trans. Inf. Theory 57 (2011) 7507-7521", "doi": "10.1109/TIT.2011.2162642", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The average weight distribution of a regular low-density parity-check (LDPC)\ncode ensemble over a finite field is thoroughly analyzed. In particular, a\nprecise asymptotic approximation of the average weight distribution is derived\nfor the small-weight case, and a series of fundamental qualitative properties\nof the asymptotic growth rate of the average weight distribution are proved.\nBased on this analysis, a general result, including all previous results as\nspecial cases, is established for the minimum distance of individual codes in a\nregular LDPC code ensemble.\n", "versions": [{"version": "v1", "created": "Mon, 11 Oct 2010 08:12:10 GMT"}, {"version": "v2", "created": "Wed, 25 May 2011 01:26:36 GMT"}, {"version": "v3", "created": "Fri, 15 Jul 2011 10:43:30 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Yang", "Shengtian", ""], ["Honold", "Thomas", ""], ["Chen", "Yan", ""], ["Zhang", "Zhaoyang", ""], ["Qiu", "Peiliang", ""]]}, {"id": "1010.2067", "submitter": "Michael Stay", "authors": "John C. Baez and Mike Stay", "title": "Algorithmic Thermodynamics", "comments": "20 pages, one encapsulated postscript figure", "journal-ref": "Computability of the Physical, Mathematical Structures in Computer\n  Science 22 (2012), 771--787", "doi": null, "report-no": null, "categories": "math-ph cs.IT math.IT math.MP quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Algorithmic entropy can be seen as a special case of entropy as studied in\nstatistical mechanics. This viewpoint allows us to apply many techniques\ndeveloped for use in thermodynamics to the subject of algorithmic information\ntheory. In particular, suppose we fix a universal prefix-free Turing machine\nand let X be the set of programs that halt for this machine. Then we can regard\nX as a set of 'microstates', and treat any function on X as an 'observable'.\nFor any collection of observables, we can study the Gibbs ensemble that\nmaximizes entropy subject to constraints on expected values of these\nobservables. We illustrate this by taking the log runtime, length, and output\nof a program as observables analogous to the energy E, volume V and number of\nmolecules N in a container of gas. The conjugate variables of these observables\nallow us to define quantities which we call the 'algorithmic temperature' T,\n'algorithmic pressure' P and algorithmic potential' mu, since they are\nanalogous to the temperature, pressure and chemical potential. We derive an\nanalogue of the fundamental thermodynamic relation dE = T dS - P d V + mu dN,\nand use it to study thermodynamic cycles analogous to those for heat engines.\nWe also investigate the values of T, P and mu for which the partition function\nconverges. At some points on the boundary of this domain of convergence, the\npartition function becomes uncomputable. Indeed, at these points the partition\nfunction itself has nontrivial algorithmic entropy.\n", "versions": [{"version": "v1", "created": "Mon, 11 Oct 2010 11:31:09 GMT"}, {"version": "v2", "created": "Mon, 25 Feb 2013 21:11:30 GMT"}], "update_date": "2013-02-27", "authors_parsed": [["Baez", "John C.", ""], ["Stay", "Mike", ""]]}, {"id": "1010.2157", "submitter": "Moslem Rashidi  Avendi", "authors": "Moslem Rashidi, Kasra Haghighi, Arash Owrang, Mats Viberg", "title": "A Wideband Spectrum Sensing Method for Cognitive Radio using Sub-Nyquist\n  Sampling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spectrum sensing is a fundamental component in cognitive radio. A major\nchallenge in this area is the requirement of a high sampling rate in the\nsensing of a wideband signal. In this paper a wideband spectrum sensing model\nis presented that utilizes a sub-Nyquist sampling scheme to bring substantial\nsavings in terms of the sampling rate. The correlation matrix of a finite\nnumber of noisy samples is computed and used by a subspace estimator to detect\nthe occupied and vacant channels of the spectrum. In contrast with common\nmethods, the proposedmethod does not need the knowledge of signal properties\nthat mitigates the uncertainty problem. We evaluate the performance of this\nmethod by computing the probability of detecting signal occupancy in terms of\nthe number of samples and the SNR of randomly generated signals. The results\nshow a reliable detection even in low SNR and small number of samples.\n", "versions": [{"version": "v1", "created": "Mon, 11 Oct 2010 16:53:33 GMT"}], "update_date": "2010-10-12", "authors_parsed": [["Rashidi", "Moslem", ""], ["Haghighi", "Kasra", ""], ["Owrang", "Arash", ""], ["Viberg", "Mats", ""]]}, {"id": "1010.2158", "submitter": "Moslem Rashidi  Avendi", "authors": "Moslem Rashidi", "title": "Non-uniform sampling and reconstruction of multi-band signals and its\n  application in wideband spectrum sensing of cognitive radio", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sampling theories lie at the heart of signal processing devices and\ncommunication systems. To accommodate high operating rates while retaining low\ncomputational cost, efficient analog-to digital (ADC) converters must be\ndeveloped. Many of limitations encountered in current converters are due to a\ntraditional assumption that the sampling state needs to acquire the data at the\nNyquist rate, corresponding to twice the signal bandwidth. In this thesis a\nmethod of sampling far below the Nyquist rate for sparse spectrum multiband\nsignals is investigated. The method is called periodic non-uniform sampling,\nand it is useful in a variety of applications such as data converters, sensor\narray imaging and image compression. Firstly, a model for the sampling system\nin the frequency domain is prepared. It relates the Fourier transform of\nobserved compressed samples with the unknown spectrum of the signal. Next, the\nreconstruction process based on the topic of compressed sensing is provided. We\nshow that the sampling parameters play an important role on the average sample\nratio and the quality of the reconstructed signal. The concept of condition\nnumber and its effect on the reconstructed signal in the presence of noise is\nintroduced, and a feasible approach for choosing a sample pattern with a low\ncondition number is given. We distinguish between the cases of known spectrum\nand unknown spectrum signals respectively. One of the model parameters is\ndetermined by the signal band locations that in case of unknown spectrum\nsignals should be estimated from sampled data. Therefore, we applied both\nsubspace methods and non-linear least square methods for estimation of this\nparameter. We also used the information theoretic criteria (Akaike and MDL) and\nthe exponential fitting test techniques for model order selection in this case.\n", "versions": [{"version": "v1", "created": "Mon, 11 Oct 2010 17:00:00 GMT"}], "update_date": "2010-10-12", "authors_parsed": [["Rashidi", "Moslem", ""]]}, {"id": "1010.2198", "submitter": "Akram Aldroubi", "authors": "Akram Aldroubi and Ali Sekmen", "title": "Nearness to Local Subspace Algorithm for Subspace and Motion\n  Segmentation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is a growing interest in computer science, engineering, and mathematics\nfor modeling signals in terms of union of subspaces and manifolds. Subspace\nsegmentation and clustering of high dimensional data drawn from a union of\nsubspaces are especially important with many practical applications in computer\nvision, image and signal processing, communications, and information theory.\nThis paper presents a clustering algorithm for high dimensional data that comes\nfrom a union of lower dimensional subspaces of equal and known dimensions. Such\ncases occur in many data clustering problems, such as motion segmentation and\nface recognition. The algorithm is reliable in the presence of noise, and\napplied to the Hopkins 155 Dataset, it generates the best results to date for\nmotion segmentation. The two motion, three motion, and overall segmentation\nrates for the video sequences are 99.43%, 98.69%, and 99.24%, respectively.\n", "versions": [{"version": "v1", "created": "Mon, 11 Oct 2010 19:47:41 GMT"}, {"version": "v2", "created": "Mon, 14 May 2012 22:57:33 GMT"}], "update_date": "2012-05-16", "authors_parsed": [["Aldroubi", "Akram", ""], ["Sekmen", "Ali", ""]]}, {"id": "1010.2236", "submitter": "Weiyu Xu", "authors": "Weiyu Xu, Ao Tang", "title": "On the Scaling Law for Compressive Sensing and its Applications", "comments": "Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  $\\ell_1$ minimization can be used to recover sufficiently sparse unknown\nsignals from compressed linear measurements. In fact, exact thresholds on the\nsparsity (the size of the support set), under which with high probability a\nsparse signal can be recovered from i.i.d. Gaussian measurements, have been\ncomputed and are referred to as \"weak thresholds\" \\cite{D}. It was also known\nthat there is a tradeoff between the sparsity and the $\\ell_1$ minimization\nrecovery stability. In this paper, we give a \\emph{closed-form}\ncharacterization for this tradeoff which we call the scaling law for\ncompressive sensing recovery stability. In a nutshell, we are able to show that\nas the sparsity backs off $\\varpi$ ($0<\\varpi<1$) from the weak threshold of\n$\\ell_1$ recovery, the parameter for the recovery stability will scale as\n$\\frac{1}{\\sqrt{1-\\varpi}}$. Our result is based on a careful analysis through\nthe Grassmann angle framework for the Gaussian measurement matrix. We will\nfurther discuss how this scaling law helps in analyzing the iterative\nreweighted $\\ell_1$ minimization algorithms. If the nonzero elements over the\nsignal support follow an amplitude probability density function (pdf)\n$f(\\cdot)$ whose $t$-th derivative $f^{t}(0) \\neq 0$ for some integer $t \\geq\n0$, then a certain iterative reweighted $\\ell_1$ minimization algorithm can be\nanalytically shown to lift the phase transition thresholds (weak thresholds) of\nthe plain $\\ell_1$ minimization algorithm.\n", "versions": [{"version": "v1", "created": "Mon, 11 Oct 2010 20:59:13 GMT"}, {"version": "v2", "created": "Wed, 16 Mar 2011 04:45:30 GMT"}], "update_date": "2011-03-17", "authors_parsed": [["Xu", "Weiyu", ""], ["Tang", "Ao", ""]]}, {"id": "1010.2285", "submitter": "Maxim Raginsky", "authors": "Maxim Raginsky and Alexander Rakhlin", "title": "Information-based complexity, feedback and dynamics in convex\n  programming", "comments": "final version; to appear in IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.SY math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the intrinsic limitations of sequential convex optimization through\nthe lens of feedback information theory. In the oracle model of optimization,\nan algorithm queries an {\\em oracle} for noisy information about the unknown\nobjective function, and the goal is to (approximately) minimize every function\nin a given class using as few queries as possible. We show that, in order for a\nfunction to be optimized, the algorithm must be able to accumulate enough\ninformation about the objective. This, in turn, puts limits on the speed of\noptimization under specific assumptions on the oracle and the type of feedback.\nOur techniques are akin to the ones used in statistical literature to obtain\nminimax lower bounds on the risks of estimation procedures; the notable\ndifference is that, unlike in the case of i.i.d. data, a sequential\noptimization algorithm can gather observations in a {\\em controlled} manner, so\nthat the amount of information at each step is allowed to change in time. In\nparticular, we show that optimization algorithms often obey the law of\ndiminishing returns: the signal-to-noise ratio drops as the optimization\nalgorithm approaches the optimum. To underscore the generality of the tools, we\nuse our approach to derive fundamental lower bounds for a certain active\nlearning problem. Overall, the present work connects the intuitive notions of\ninformation in optimization, experimental design, estimation, and active\nlearning to the quantitative notion of Shannon information.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 02:19:43 GMT"}, {"version": "v2", "created": "Tue, 26 Apr 2011 15:08:35 GMT"}, {"version": "v3", "created": "Fri, 9 Sep 2011 15:57:54 GMT"}], "update_date": "2011-09-12", "authors_parsed": [["Raginsky", "Maxim", ""], ["Rakhlin", "Alexander", ""]]}, {"id": "1010.2286", "submitter": "Maxim Raginsky", "authors": "Maxim Raginsky", "title": "Divergence-based characterization of fundamental limitations of adaptive\n  dynamical systems", "comments": "8 pages, uses ieeeconf.cls; to appear in Proc. 48th Annual Allerton\n  Conf. on Communication, Control and Computing (2010)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adaptive dynamical systems arise in a multitude of contexts, e.g.,\noptimization, control, communications, signal processing, and machine learning.\nA precise characterization of their fundamental limitations is therefore of\nparamount importance. In this paper, we consider the general problem of\nadaptively controlling and/or identifying a stochastic dynamical system, where\nour {\\em a priori} knowledge allows us to place the system in a subset of a\nmetric space (the uncertainty set). We present an information-theoretic\nmeta-theorem that captures the trade-off between the metric complexity (or\nrichness) of the uncertainty set, the amount of information acquired online in\nthe process of controlling and observing the system, and the residual\nuncertainty remaining after the observations have been collected. Following the\napproach of Zames, we quantify {\\em a priori} information by the Kolmogorov\n(metric) entropy of the uncertainty set, while the information acquired online\nis expressed as a sum of information divergences. The general theory is used to\nderive new minimax lower bounds on the metric identification error, as well as\nto give a simple derivation of the minimum time needed to stabilize an\nuncertain stochastic linear system.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 02:27:59 GMT"}], "update_date": "2010-10-13", "authors_parsed": [["Raginsky", "Maxim", ""]]}, {"id": "1010.2382", "submitter": "Georg B\\\"ocherer", "authors": "Georg B\\\"ocherer, Fabian Altenbach, Rudolf Mathar", "title": "Capacity Achieving Modulation for Fixed Constellations with Average\n  Power Constraint", "comments": "Strict concavity assumption added to Propositions 2 and 3. This\n  assumption is missing in the ICC 2011 proceedings version of this paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The capacity achieving probability mass function (PMF) of a finite signal\nconstellation with an average power constraint is in most cases non-uniform. A\ncommon approach to generate non-uniform input PMFs is Huffman shaping, which\nconsists of first approximating the capacity achieving PMF by a sampled\nGaussian density and then to calculate the Huffman code of the sampled Gaussian\ndensity. The Huffman code is then used as a prefix-free modulation code. This\napproach showed good results in practice, can however lead to a significant gap\nto capacity. In this work, a method is proposed that efficiently constructs\noptimal prefix-free modulation codes for any finite signal constellation with\naverage power constraint in additive noise. The proposed codes operate as close\nto capacity as desired. The major part of this work elaborates an analytical\nproof of this property. The proposed method is applied to 64-QAM in AWGN and\nnumeric results are given, which show that, opposed to Huffman shaping, by\nusing the proposed method, it is possible to operate very close to capacity\nover the whole range of parameters.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 13:13:07 GMT"}, {"version": "v2", "created": "Mon, 27 Jun 2011 06:35:25 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Böcherer", "Georg", ""], ["Altenbach", "Fabian", ""], ["Mathar", "Rudolf", ""]]}, {"id": "1010.2433", "submitter": "Chih-Chun Wang", "authors": "Chih-Chun Wang", "title": "Capacity of 1-to-K Broadcast Packet Erasure Channels with Channel Output\n  Feedback", "comments": "8 pages, 2 figures. Published in Allerton 2010. The journal version\n  of this work was submitted to IEEE Trans IT in May, 2010", "journal-ref": null, "doi": "10.1109/ALLERTON.2010.5707070", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper focuses on the 1-to-K broadcast packet erasure channel (PEC),\nwhich is a generalization of the broadcast binary erasure channel from the\nbinary symbol to that of arbitrary finite fields GF(q) with sufficiently large\nq. We consider the setting in which the source node has instant feedback of the\nchannel outputs of the K receivers after each transmission. Such a setting\ndirectly models network coded packet transmission in the downlink direction\nwith integrated feedback mechanisms (such as Automatic Repeat reQuest (ARQ)).\n  The main results of this paper are: (i) The capacity region for general\n1-to-3 broadcast PECs, and (ii) The capacity region for two classes of 1-to-K\nbroadcast PECs: the symmetric PECs, and the spatially independent PECs with\none-sided fairness constraints. This paper also develops (iii) A pair of outer\nand inner bounds of the capacity region for arbitrary 1-to-K broadcast PECs,\nwhich can be evaluated by any linear programming solver. For most practical\nscenarios, the outer and inner bounds meet and thus jointly characterize the\ncapacity.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 16:16:58 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Wang", "Chih-Chun", ""]]}, {"id": "1010.2436", "submitter": "Chih-Chun Wang", "authors": "Chih-Chun Wang", "title": "Capacity of 1-to-K Broadcast Packet Erasure Channels with Channel Output\n  Feedback (Full Version)", "comments": "29 pages, 10 figures. This manuscript was submitted to IEEE Trans IT\n  in May 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper focuses on the 1-to-K broadcast packet erasure channel (PEC),\nwhich is a generalization of the broadcast binary erasure channel from the\nbinary symbol to that of arbitrary finite fields GF(q) with sufficiently large\nq. We consider the setting in which the source node has instant feedback of the\nchannel outputs of the K receivers after each transmission. The capacity region\nof the 1-to-K PEC with COF was previously known only for the case K=2. Such a\nsetting directly models network coded packet transmission in the downlink\ndirection with integrated feedback mechanisms (such as Automatic Repeat reQuest\n(ARQ)).\n  The main results of this paper are: (i) The capacity region for general\n1-to-3 broadcast PECs, and (ii) The capacity region for two types of 1-to-$K$\nbroadcast PECs: the symmetric PECs, and the spatially independent PECs with\none-sided fairness constraints. This paper also develops (iii) A pair of outer\nand inner bounds of the capacity region for arbitrary 1-to-K broadcast PECs,\nwhich can be easily evaluated by any linear programming solver. The proposed\ninner bound is proven by a new class of intersession network coding schemes,\ntermed the packet evolution schemes, which is based on the concept of code\nalignment in GF(q) that is in parallel with the interference alignment\ntechniques for the Euclidean space. Extensive numerical experiments show that\nthe outer and inner bounds meet for almost all broadcast PECs encountered in\npractical scenarios and thus effectively bracket the capacity of general 1-to-K\nbroadcast PECs with COF.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 16:38:55 GMT"}], "update_date": "2010-10-13", "authors_parsed": [["Wang", "Chih-Chun", ""]]}, {"id": "1010.2437", "submitter": "Omar Mehanna", "authors": "Omar Mehanna, John Marcos and Nihar Jindal", "title": "On Achievable Rates of the Two-user Symmetric Gaussian Interference\n  Channel", "comments": "7 pages, to appear in Allerton 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the Han-Kobayashi (HK) achievable sum rate for the two-user\nsymmetric Gaussian interference channel. We find the optimal power split ratio\nbetween the common and private messages (assuming no time-sharing), and derive\na closed form expression for the corresponding sum rate. This provides a finer\nunderstanding of the achievable HK sum rate, and allows for precise comparisons\nbetween this sum rate and that of orthogonal signaling. One surprising finding\nis that despite the fact that the channel is symmetric, allowing for asymmetric\npower split ratio at both users (i.e., asymmetric rates) can improve the sum\nrate significantly. Considering the high SNR regime, we specify the\ninterference channel value above which the sum rate achieved using asymmetric\npower splitting outperforms the symmetric case.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 16:42:06 GMT"}], "update_date": "2010-10-13", "authors_parsed": [["Mehanna", "Omar", ""], ["Marcos", "John", ""], ["Jindal", "Nihar", ""]]}, {"id": "1010.2441", "submitter": "Dino Sejdinovic", "authors": "Dino Sejdinovic, Oliver Johnson", "title": "Note on Noisy Group Testing: Asymptotic Bounds and Belief Propagation\n  Reconstruction", "comments": "5 pages, 3 figures, presented at the Forty-Eighth Annual Allerton\n  Conference on Communication, Control, and Computing, September 29 - October\n  1, 2010, Monticello, IL, USA", "journal-ref": null, "doi": "10.1109/ALLERTON.2010.5707018", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An information theoretic perspective on group testing problems has recently\nbeen proposed by Atia and Saligrama, in order to characterise the optimal\nnumber of tests. Their results hold in the noiseless case, where only false\npositives occur, and where only false negatives occur. We extend their results\nto a model containing both false positives and false negatives, developing\nsimple information theoretic bounds on the number of tests required. Based on\nthese bounds, we obtain an improved order of convergence in the case of false\nnegatives only. Since these results are based on (computationally infeasible)\njoint typicality decoding, we propose a belief propagation algorithm for the\ndetection of defective items and compare its actual performance to the\ntheoretical bounds.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 16:58:05 GMT"}], "update_date": "2013-03-20", "authors_parsed": [["Sejdinovic", "Dino", ""], ["Johnson", "Oliver", ""]]}, {"id": "1010.2457", "submitter": "Yohann de Castro", "authors": "Yohann de Castro (LM-Orsay)", "title": "Optimal designs for Lasso and Dantzig selector using Expander Codes", "comments": "Last version with optimal bounds", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT math.PR stat.ME stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the high-dimensional regression problem using adjacency\nmatrices of unbalanced expander graphs. In this frame, we prove that the\n$\\ell_{2}$-prediction error and the $\\ell_{1}$-risk of the lasso and the\nDantzig selector are optimal up to an explicit multiplicative constant. Thus we\ncan estimate a high-dimensional target vector with an error term similar to the\none obtained in a situation where one knows the support of the largest\ncoordinates in advance.\n  Moreover, we show that these design matrices have an explicit restricted\neigenvalue. Precisely, they satisfy the restricted eigenvalue assumption and\nthe compatibility condition with an explicit constant.\n  Eventually, we capitalize on the recent construction of unbalanced expander\ngraphs due to Guruswami, Umans, and Vadhan, to provide a deterministic\npolynomial time construction of these design matrices.\n", "versions": [{"version": "v1", "created": "Tue, 12 Oct 2010 18:03:23 GMT"}, {"version": "v2", "created": "Fri, 5 Nov 2010 10:43:31 GMT"}, {"version": "v3", "created": "Thu, 18 Nov 2010 09:19:54 GMT"}, {"version": "v4", "created": "Thu, 14 Apr 2011 09:57:04 GMT"}, {"version": "v5", "created": "Wed, 19 Jun 2013 15:07:26 GMT"}, {"version": "v6", "created": "Tue, 22 Jul 2014 08:56:44 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["de Castro", "Yohann", "", "LM-Orsay"]]}, {"id": "1010.2551", "submitter": "Salim El Rouayheb", "authors": "Salim El Rouayheb and Kannan Ramchandran", "title": "Fractional Repetition Codes for Repair in Distributed Storage Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new class of exact Minimum-Bandwidth Regenerating (MBR) codes\nfor distributed storage systems, characterized by a low-complexity uncoded\nrepair process that can tolerate multiple node failures. These codes consist of\nthe concatenation of two components: an outer MDS code followed by an inner\nrepetition code. We refer to the inner code as a Fractional Repetition code\nsince it consists of splitting the data of each node into several packets and\nstoring multiple replicas of each on different nodes in the system.\n  Our model for repair is table-based, and thus, differs from the random access\nmodel adopted in the literature. We present constructions of Fractional\nRepetition codes based on regular graphs and Steiner systems for a large set of\nsystem parameters. The resulting codes are guaranteed to achieve the storage\ncapacity for random access repair. The considered model motivates a new\ndefinition of capacity for distributed storage systems, that we call Fractional\nRepetition capacity. We provide upper bounds on this capacity while a precise\nexpression remains an open problem.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 00:27:06 GMT"}], "update_date": "2010-10-14", "authors_parsed": [["Rouayheb", "Salim El", ""], ["Ramchandran", "Kannan", ""]]}, {"id": "1010.2571", "submitter": "Kaibin Huang", "authors": "Kaibin Huang and Rui Zhang", "title": "Cooperative Precoding with Limited Feedback for MIMO Interference\n  Channels", "comments": "23 pages; 5 figures; this work was presented in part at Asilomar 2011\n  and will appear in IEEE Trans. on Wireless Comm", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-antenna precoding effectively mitigates the interference in wireless\nnetworks. However, the resultant performance gains can be significantly\ncompromised in practice if the precoder design fails to account for the\ninaccuracy in the channel state information (CSI) feedback. This paper\naddresses this issue by considering finite-rate CSI feedback from receivers to\ntheir interfering transmitters in the two-user multiple-input-multiple-output\n(MIMO) interference channel, called cooperative feedback, and proposing a\nsystematic method for designing transceivers comprising linear precoders and\nequalizers. Specifically, each precoder/equalizer is decomposed into inner and\nouter components for nulling the cross-link interference and achieving array\ngain, respectively. The inner precoders/equalizers are further optimized to\nsuppress the residual interference resulting from finite-rate cooperative\nfeedback. Further- more, the residual interference is regulated by additional\nscalar cooperative feedback signals that are designed to control transmission\npower using different criteria including fixed interference margin and maximum\nsum throughput. Finally, the required number of cooperative precoder feedback\nbits is derived for limiting the throughput loss due to precoder quantization.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 04:11:41 GMT"}, {"version": "v2", "created": "Mon, 27 Feb 2012 03:46:18 GMT"}], "update_date": "2012-02-28", "authors_parsed": [["Huang", "Kaibin", ""], ["Zhang", "Rui", ""]]}, {"id": "1010.2595", "submitter": "Marie Ferbus-Zanda", "authors": "Marie Ferbus-Zanda (LIAFA)", "title": "Kolmogorov Complexity in perspective. Part II: Classification,\n  Information Processing and Duality", "comments": "43 pages", "journal-ref": "Synthese / Synth\\`ese (2010) 00", "doi": null, "report-no": null, "categories": "cs.LO cs.CC cs.IT math.IT physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We survey diverse approaches to the notion of information: from Shannon\nentropy to Kolmogorov complexity. Two of the main applications of Kolmogorov\ncomplexity are presented: randomness and classification. The survey is divided\nin two parts published in a same volume. Part II is dedicated to the relation\nbetween logic and information system, within the scope of Kolmogorov\nalgorithmic information theory. We present a recent application of Kolmogorov\ncomplexity: classification using compression, an idea with provocative\nimplementation by authors such as Bennett, Vitanyi and Cilibrasi. This stresses\nhow Kolmogorov complexity, besides being a foundation to randomness, is also\nrelated to classification. Another approach to classification is also\nconsidered: the so-called \"Google classification\". It uses another original and\nattractive idea which is connected to the classification using compression and\nto Kolmogorov complexity from a conceptual point of view. We present and unify\nthese different approaches to classification in terms of Bottom-Up versus\nTop-Down operational modes, of which we point the fundamental principles and\nthe underlying duality. We look at the way these two dual modes are used in\ndifferent approaches to information system, particularly the relational model\nfor database introduced by Codd in the 70's. This allows to point out diverse\nforms of a fundamental duality. These operational modes are also reinterpreted\nin the context of the comprehension schema of axiomatic set theory ZF. This\nleads us to develop how Kolmogorov's complexity is linked to intensionality,\nabstraction, classification and information system.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 08:35:24 GMT"}], "update_date": "2010-10-15", "authors_parsed": [["Ferbus-Zanda", "Marie", "", "LIAFA"]]}, {"id": "1010.2619", "submitter": "Maximilien Gadouleau", "authors": "Maximilien Gadouleau and Soren Riis", "title": "Graph-theoretical Constructions for Graph Entropy and Network Coding\n  Based Communications", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The guessing number of a directed graph (digraph), equivalent to the entropy\nof that digraph, was introduced as a direct criterion on the solvability of a\nnetwork coding instance. This paper makes two contributions on the guessing\nnumber. First, we introduce an undirected graph on all possible configurations\nof the digraph, referred to as the guessing graph, which encapsulates the\nessence of dependence amongst configurations. We prove that the guessing number\nof a digraph is equal to the logarithm of the independence number of its\nguessing graph. Therefore, network coding solvability is no more a problem on\nthe operations made by each node, but is simplified into a problem on the\nmessages that can transit through the network. By studying the guessing graph\nof a given digraph, and how to combine digraphs or alphabets, we are thus able\nto derive bounds on the guessing number of digraphs. Second, we construct\nspecific digraphs with high guessing numbers, yielding network coding instances\nwhere a large amount of information can transit. We first propose a\nconstruction of digraphs with finite parameters based on cyclic codes, with\nguessing number equal to the degree of the generator polynomial. We then\nconstruct an infinite class of digraphs with arbitrary girth for which the\nratio between the linear guessing number and the number of vertices tends to\none, despite these digraphs being arbitrarily sparse. These constructions yield\nsolvable network coding instances with a relatively small number of\nintermediate nodes for which the node operations are known and linear, although\nthese instances are sparse and the sources are arbitrarily far from their\ncorresponding sinks.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 10:15:47 GMT"}, {"version": "v2", "created": "Mon, 18 Apr 2011 14:11:39 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Gadouleau", "Maximilien", ""], ["Riis", "Soren", ""]]}, {"id": "1010.2667", "submitter": "Dongning Guo", "authors": "Dongning Guo and Lei Zhang", "title": "Virtual Full-Duplex Wireless Communication via Rapid On-Off-Division\n  Duplex", "comments": "8 pages; Forty-Eighth Annual Allerton Conference on Communication,\n  Control, and Computing, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces a novel paradigm for design- ing the physical and\nmedium access control (MAC) layers of mobile ad hoc or peer-to-peer networks\nformed by half-duplex radios. A node equipped with such a radio cannot\nsimultaneously transmit and receive useful signals at the same frequency.\nUnlike in conventional designs, where a node's transmission frames are\nscheduled away from its reception, each node transmits its signal through a\nrandomly generated on-off duplex mask (or signature) over every frame interval,\nand receive a signal through each of its own off-slots. This is called rapid\non-off- division duplex (RODD). Over the period of a single frame, every node\ncan transmit a message to some or all of its peers, and may simultaneously\nreceive a message from each peer. Thus RODD achieves virtual full-duplex\ncommunication using half-duplex radios and can simplify the design of higher\nlayers of a network protocol stack significantly. The throughput of RODD is\nevaluated under some general settings, which is significantly larger than that\nof ALOHA. RODD is especially efficient in case the dominant traffic is\nsimultaneous broadcast from nodes to their one-hop peers, such as in\nspontaneous wireless social networks, emergency situations or on battlefield.\nImportant design issues of peer discovery, distribution of on-off signatures,\nsynchronization and error-control coding are also addressed.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 14:18:52 GMT"}], "update_date": "2010-10-14", "authors_parsed": [["Guo", "Dongning", ""], ["Zhang", "Lei", ""]]}, {"id": "1010.2686", "submitter": "Jean-Claude Belfiore", "authors": "Lina Mroueh and Jean-Claude Belfiore", "title": "How to Achieve the Optimal DMT of Selective Fading MIMO Channels?", "comments": "22 pages, 6 figures, submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a particular class of selective fading channel\ncorresponding to a channel that is selective either in time or in frequency.\nFor this class of channel, we propose a systematic way to achieve the optimal\nDMT derived in Coronel and B\\\"olcskei, IEEE ISIT, 2007 by extending the\nnon-vanishing determinant (NVD) criterion to the selective channel case. A new\ncode construction based on split NVD parallel codes is then proposed to satisfy\nthe NVD parallel criterion. This result is of significant interest not only in\nits own right, but also because it settles a long-standing debate in the\nliterature related to the optimal DMT of selective fading channels.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 15:52:47 GMT"}], "update_date": "2010-10-14", "authors_parsed": [["Mroueh", "Lina", ""], ["Belfiore", "Jean-Claude", ""]]}, {"id": "1010.2692", "submitter": "Hina Tabassum", "authors": "Hina Tabassum, Zaher Dawy, Mohamed Slim Alouini", "title": "Resource Allocation via Sum-Rate Maximization in the Uplink of\n  Multi-Cell OFDMA Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider maximizing the sum-rate in the uplink of a\nmulti-cell OFDMA network. The problem has a non-convex combinatorial structure\nand is known to be NP hard. Due to the inherent complexity of implementing the\noptimal solution, firstly, we derive an upper and lower bound to the optimal\naverage network throughput. Moreover, we investigate the performance of a near\noptimal single cell resource allocation scheme in the presence of ICI which\nleads to another easily computable lower bound. We then develop a centralized\nsub-optimal scheme that is composed of a geometric programming based power\ncontrol phase in conjunction with an iterative subcarrier allocation phase.\nAlthough, the scheme is computationally complex, it provides an effective\nbenchmark for low complexity schemes even without the power control phase.\nFinally, we propose less complex centralized and distributed schemes that are\nwell-suited for practical scenarios. The computational complexity of all\nschemes is analyzed and performance is compared through simulations. Simulation\nresults demonstrate that the proposed low complexity schemes can achieve\ncomparable performance to the centralized sub-optimal scheme in various\nscenarios. Moreover, comparisons with the upper and lower bounds provide\ninsight on the performance gap between the proposed schemes and the optimal\nsolution.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 16:14:47 GMT"}, {"version": "v2", "created": "Sun, 7 Nov 2010 14:41:48 GMT"}, {"version": "v3", "created": "Tue, 16 Aug 2011 07:35:48 GMT"}, {"version": "v4", "created": "Tue, 20 Sep 2011 04:53:50 GMT"}, {"version": "v5", "created": "Wed, 21 Sep 2011 08:17:31 GMT"}], "update_date": "2011-09-22", "authors_parsed": [["Tabassum", "Hina", ""], ["Dawy", "Zaher", ""], ["Alouini", "Mohamed Slim", ""]]}, {"id": "1010.2731", "submitter": "Sahand N. Negahban", "authors": "Sahand N. Negahban, Pradeep Ravikumar, Martin J. Wainwright, Bin Yu", "title": "A Unified Framework for High-Dimensional Analysis of M-Estimators with\n  Decomposable Regularizers", "comments": "Published in at http://dx.doi.org/10.1214/12-STS400 the Statistical\n  Science (http://www.imstat.org/sts/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Statistical Science 2012, Vol. 27, No. 4, 538-557", "doi": "10.1214/12-STS400", "report-no": "IMS-STS-STS400", "categories": "math.ST cs.IT math.IT stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High-dimensional statistical inference deals with models in which the the\nnumber of parameters p is comparable to or larger than the sample size n. Since\nit is usually impossible to obtain consistent procedures unless\n$p/n\\rightarrow0$, a line of recent work has studied models with various types\nof low-dimensional structure, including sparse vectors, sparse and structured\nmatrices, low-rank matrices and combinations thereof. In such settings, a\ngeneral approach to estimation is to solve a regularized optimization problem,\nwhich combines a loss function measuring how well the model fits the data with\nsome regularization function that encourages the assumed structure. This paper\nprovides a unified framework for establishing consistency and convergence rates\nfor such regularized M-estimators under high-dimensional scaling. We state one\nmain theorem and show how it can be used to re-derive some existing results,\nand also to obtain a number of new results on consistency and convergence\nrates, in both $\\ell_2$-error and related norms. Our analysis also identifies\ntwo key properties of loss and regularization functions, referred to as\nrestricted strong convexity and decomposability, that ensure corresponding\nregularized M-estimators have fast convergence rates and which are optimal in\nmany well-studied cases.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 19:05:27 GMT"}, {"version": "v2", "created": "Wed, 14 Mar 2012 14:28:14 GMT"}, {"version": "v3", "created": "Tue, 12 Mar 2013 11:17:04 GMT"}], "update_date": "2013-03-13", "authors_parsed": [["Negahban", "Sahand N.", ""], ["Ravikumar", "Pradeep", ""], ["Wainwright", "Martin J.", ""], ["Yu", "Bin", ""]]}, {"id": "1010.2741", "submitter": "Behrang Nosrat Makouei", "authors": "Behrang Nosrat-Makouei, Jeffrey G. Andrews and Robert W. Heath Jr", "title": "MIMO Interference Alignment Over Correlated Channels with Imperfect CSI", "comments": "21 pages, 7 figures, submitted to IEEE Transactions on Signal\n  Processing", "journal-ref": "IEEE Transactions on Signal Processing, vol.59, no.6, pp.\n  2783-2794, June 2011", "doi": "10.1109/TSP.2011.2124458", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interference alignment (IA), given uncorrelated channel components and\nperfect channel state information, obtains the maximum degrees of freedom in an\ninterference channel. Little is known, however, about how the sum rate of IA\nbehaves at finite transmit power, with imperfect channel state information, or\nantenna correlation. This paper provides an approximate closed-form\nsignal-to-interference-plus-noise-ratio (SINR) expression for IA over\nmultiple-input-multiple-output (MIMO) channels with imperfect channel state\ninformation and transmit antenna correlation. Assuming linear processing at the\ntransmitters and zero-forcing receivers, random matrix theory tools are\nutilized to derive an approximation for the post-processing SINR distribution\nof each stream for each user. Perfect channel knowledge and i.i.d. channel\ncoefficients constitute special cases. This SINR distribution not only allows\neasy calculation of useful performance metrics like sum rate and symbol error\nrate, but also permits a realistic comparison of IA with other transmission\ntechniques. More specifically, IA is compared with spatial multiplexing and\nbeamforming and it is shown that IA may not be optimal for some performance\ncriteria.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 19:38:45 GMT"}], "update_date": "2012-07-19", "authors_parsed": [["Nosrat-Makouei", "Behrang", ""], ["Andrews", "Jeffrey G.", ""], ["Heath", "Robert W.", "Jr"]]}, {"id": "1010.2787", "submitter": "Omar El Ayach", "authors": "Omar El Ayach and Robert W. Heath Jr", "title": "Interference Alignment with Analog Channel State Feedback", "comments": "accepted, to appear in IEEE Transactions on Wireless Communications", "journal-ref": "IEEE Transactions on Wireless Communications, vol. 11, no. 2, pp.\n  626-636, February 2012", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interference alignment (IA) is a multiplexing gain optimal transmission\nstrategy for the interference channel. While the achieved sum rate with IA is\nmuch higher than previously thought possible, the improvement often comes at\nthe cost of requiring network channel state information at the transmitters.\nThis can be achieved by explicit feedback, a flexible yet potentially costly\napproach that incurs large overhead. In this paper we propose analog feedback\nas an alternative to limited feedback or reciprocity based alignment. We show\nthat the full multiplexing gain observed with perfect channel knowledge is\npreserved by analog feedback and that the mean loss in sum rate is bounded by a\nconstant when signal-to-noise ratio is comparable in both forward and feedback\nchannels. When signal-to-noise ratios are not quite symmetric, a fraction of\nthe multiplexing gain is achieved. We consider the overhead of training and\nfeedback and use this framework to optimize the system's effective throughput.\nWe present simulation results to demonstrate the performance of IA with analog\nfeedback, verify our theoretical analysis, and extend our conclusions on\noptimal training and feedback length.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 22:40:23 GMT"}, {"version": "v2", "created": "Tue, 28 Jun 2011 03:54:17 GMT"}, {"version": "v3", "created": "Sun, 20 Nov 2011 00:15:59 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Ayach", "Omar El", ""], ["Heath", "Robert W.", "Jr"]]}, {"id": "1010.2789", "submitter": "Sergey Loyka", "authors": "Victoria Kostina, Sergey Loyka", "title": "Optimum Power and Rate Allocation for Coded V-BLAST: Average\n  Optimization", "comments": "accepted by IEEE Transactions on Communications", "journal-ref": null, "doi": "10.1109/TCOMM.2011.010411.090561", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An analytical framework for performance analysis and optimization of coded\nV-BLAST is developed. Average power and/or rate allocations to minimize the\noutage probability as well as their robustness and dual problems are\ninvestigated. Compact, closed-form expressions for the optimum allocations and\ncorresponding system performance are given. The uniform power allocation is\nshown to be near optimum in the low outage regime in combination with the\noptimum rate allocation. The average rate allocation provides the largest\nperformance improvement (extra diversity gain), and the average power\nallocation offers a modest SNR gain limited by the number of transmit antennas\nbut does not increase the diversity gain. The dual problems are shown to have\nthe same solutions as the primal ones. All these allocation strategies are\nshown to be robust. The reported results also apply to coded multiuser\ndetection and channel equalization systems relying on successive interference\ncancelation.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 22:58:56 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Kostina", "Victoria", ""], ["Loyka", "Sergey", ""]]}, {"id": "1010.2830", "submitter": "Zilong Wang", "authors": "Zilong Wang, Guang Gong, and Rongquan Feng", "title": "A Generalized Construction of OFDM M-QAM Sequences With Low\n  Peak-to-Average Power Ratio", "comments": "published by Advances in Mathematics of Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A construction of $2^{2n}$-QAM sequences is given and an upper bound of the\npeak-to-mean envelope power ratio (PMEPR) is determined. Some former works can\nbe viewed as special cases of this construction.\n", "versions": [{"version": "v1", "created": "Thu, 14 Oct 2010 05:35:42 GMT"}], "update_date": "2010-10-15", "authors_parsed": [["Wang", "Zilong", ""], ["Gong", "Guang", ""], ["Feng", "Rongquan", ""]]}, {"id": "1010.2831", "submitter": "Zilong Wang", "authors": "Rongquan Feng, Zhenhua Gu, Zilong Wang, Hongfeng Wu, and Kai Zhou", "title": "On the Construction of Finite Oscillator Dictionary", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A finite oscillator dictionary which has important applications in sequences\ndesigns and the compressive sensing was introduced by Gurevich, Hadani and\nSochen. In this paper, we first revisit closed formulae of the finite split\noscillator dictionary $\\mathfrak{S}^s$ by a simple proof. Then we study the\nnon-split tori of the group $SL(2,\\mathbb{F}_p)$. Finally, An explicit\nalgorithm for computing the finite non-split oscillator dictionary\n$\\mathfrak{S}^{ns}$ is described.\n", "versions": [{"version": "v1", "created": "Thu, 14 Oct 2010 05:45:24 GMT"}], "update_date": "2010-10-15", "authors_parsed": [["Feng", "Rongquan", ""], ["Gu", "Zhenhua", ""], ["Wang", "Zilong", ""], ["Wu", "Hongfeng", ""], ["Zhou", "Kai", ""]]}, {"id": "1010.2955", "submitter": "Guangcan Liu", "authors": "Guangcan Liu, Zhouchen Lin, Shuicheng Yan, Ju Sun, Yong Yu, Yi Ma", "title": "Robust Recovery of Subspace Structures by Low-Rank Representation", "comments": "IEEE Trans. Pattern Analysis and Machine Intelligence", "journal-ref": "IEEE Trans. Pattern Analysis and Machine Intelligence, 35(2013)\n  171-184", "doi": "10.1109/TPAMI.2012.88", "report-no": null, "categories": "cs.IT cs.CV cs.LG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we address the subspace recovery problem. Given a set of data\nsamples (vectors) approximately drawn from a union of multiple subspaces, our\ngoal is to segment the samples into their respective subspaces and correct the\npossible errors as well. To this end, we propose a novel method termed Low-Rank\nRepresentation (LRR), which seeks the lowest-rank representation among all the\ncandidates that can represent the data samples as linear combinations of the\nbases in a given dictionary. It is shown that LRR well solves the subspace\nrecovery problem: when the data is clean, we prove that LRR exactly captures\nthe true subspace structures; for the data contaminated by outliers, we prove\nthat under certain conditions LRR can exactly recover the row space of the\noriginal data and detect the outlier as well; for the data corrupted by\narbitrary errors, LRR can also approximately recover the row space with\ntheoretical guarantees. Since the subspace membership is provably determined by\nthe row space, these further imply that LRR can perform robust subspace\nsegmentation and error correction, in an efficient way.\n", "versions": [{"version": "v1", "created": "Thu, 14 Oct 2010 15:38:48 GMT"}, {"version": "v2", "created": "Tue, 9 Nov 2010 14:07:04 GMT"}, {"version": "v3", "created": "Mon, 22 Nov 2010 09:27:15 GMT"}, {"version": "v4", "created": "Thu, 8 Sep 2011 09:02:03 GMT"}, {"version": "v5", "created": "Wed, 28 Mar 2012 05:09:27 GMT"}, {"version": "v6", "created": "Sun, 6 May 2012 08:23:16 GMT"}], "update_date": "2013-01-29", "authors_parsed": [["Liu", "Guangcan", ""], ["Lin", "Zhouchen", ""], ["Yan", "Shuicheng", ""], ["Sun", "Ju", ""], ["Yu", "Yong", ""], ["Ma", "Yi", ""]]}, {"id": "1010.2992", "submitter": "Ravi Mazumdar Dr", "authors": "A.V. Balakrishnan and Ravi R. Mazumdar", "title": "On Powers of Gaussian White Noise", "comments": "10 pages", "journal-ref": "IEEE Trans. on Information Theory, Vol 57 (11), 2011 pp. 7629-7634", "doi": "10.1109/TIT.2011.2158062", "report-no": null, "categories": "cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Classical Gaussian white noise in communications and signal processing is\nviewed as the limit of zero mean second order Gaussian processes with a\ncompactly supported flat spectral density as the support goes to infinity. The\ndifficulty of developing a theory to deal with nonlinear transformations of\nwhite noise has been to interpret the corresponding limits. In this paper we\nshow that a renormalization and centering of powers of band-limited Gaussian\nprocesses is Gaussian white noise and as a consequence, homogeneous polynomials\nunder suitable renormalization remain white noises.\n", "versions": [{"version": "v1", "created": "Thu, 14 Oct 2010 17:49:10 GMT"}], "update_date": "2013-11-19", "authors_parsed": [["Balakrishnan", "A. V.", ""], ["Mazumdar", "Ravi R.", ""]]}, {"id": "1010.2993", "submitter": "Omur Ozel", "authors": "Jing Yang, Omur Ozel, Sennur Ulukus", "title": "Broadcasting with an Energy Harvesting Rechargeable Transmitter", "comments": "Submitted to IEEE Transactions on Wireless Communications, October\n  2010", "journal-ref": null, "doi": "10.1109/TWC.2011.120911.101813", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate the transmission completion time minimization\nproblem in a two-user additive white Gaussian noise (AWGN) broadcast channel,\nwhere the transmitter is able to harvest energy from the nature, using a\nrechargeable battery. The harvested energy is modeled to arrive at the\ntransmitter randomly during the course of transmissions. The transmitter has a\nfixed number of packets to be delivered to each receiver. Our goal is to\nminimize the time by which all of the packets for both users are delivered to\ntheir respective destinations. To this end, we optimize the transmit powers and\ntransmission rates intended for both users. We first analyze the structural\nproperties of the optimal transmission policy. We prove that the optimal total\ntransmit power has the same structure as the optimal single-user transmit\npower. We also prove that there exists a cut-off power level for the stronger\nuser. If the optimal total transmit power is lower than this cut-off level, all\ntransmit power is allocated to the stronger user, and when the optimal total\ntransmit power is larger than this cut-off level, all transmit power above this\nlevel is allocated to the weaker user. Based on these structural properties of\nthe optimal policy, we propose an algorithm that yields the globally optimal\noff-line scheduling policy. Our algorithm is based on the idea of reducing the\ntwo-user broadcast channel problem into a single-user problem as much as\npossible.\n", "versions": [{"version": "v1", "created": "Thu, 14 Oct 2010 17:58:12 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Yang", "Jing", ""], ["Ozel", "Omur", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1010.3033", "submitter": "Ramya Bhagavatula", "authors": "Ramya Bhagavatula and Robert W. Heath, Jr", "title": "Adaptive Bit Partitioning for Multicell Intercell Interference Nulling\n  with Delayed Limited Feedback", "comments": "Submitted to IEEE Transactions on Signal Processing, July 2010", "journal-ref": null, "doi": "10.1109/TSP.2011.2146777", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Base station cooperation can exploit knowledge of the users' channel state\ninformation (CSI) at the transmitters to manage co-channel interference. Users\nhave to feedback CSI of the desired and interfering channels using\nfinite-bandwidth backhaul links. Existing codebook designs for single-cell\nlimited feedback can be used for multicell cooperation by partitioning the\navailable feedback resources between the multiple channels. In this paper, a\nnew feedback-bit allocation strategy is proposed, as a function of the delays\nin the communication links and received signal strengths in the downlink.\nChannel temporal correlation is modeled as a function of delay using the\nGauss-Markov model. Closed-form expressions for bit partitions are derived to\nallocate more bits to quantize the stronger channels with smaller delays and\nfewer bits to weaker channels with larger delays, assuming random vector\nquantization. Cellular network simulations are used to show that the proposed\nalgorithm yields higher sum-rates than an equal-bit allocation technique.\n", "versions": [{"version": "v1", "created": "Thu, 14 Oct 2010 21:17:15 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Bhagavatula", "Ramya", ""], ["Heath,", "Robert W.", "Jr"]]}, {"id": "1010.3071", "submitter": "Zhengdao Wang", "authors": "Neevan Ramalingam and Zhengdao Wang", "title": "On the Rate Achievable for Gaussian Relay Channels Using Superposition\n  Forwarding", "comments": "19 pages. 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the achievable rate of the superposition of block Markov encoding\n(decode-and-forward) and side information encoding (compress-and-forward) for\nthe three-node Gaussian relay channel. It is generally believed that the\nsuperposition can out perform decode-and-forward or compress-and-forward due to\nits generality. We prove that within the class of Gaussian distributions, this\nis not the case: the superposition scheme only achieves a rate that is equal to\nthe maximum of the rates achieved by decode-and-forward or compress-and-forward\nindividually. We also present a superposition scheme that combines broadcast\nwith decode-and-forward, which even though does not achieve a higher rate than\ndecode-and-forward, provides us the insight to the main result mentioned above.\n", "versions": [{"version": "v1", "created": "Fri, 15 Oct 2010 04:37:02 GMT"}], "update_date": "2010-10-18", "authors_parsed": [["Ramalingam", "Neevan", ""], ["Wang", "Zhengdao", ""]]}, {"id": "1010.3132", "submitter": "Ewa Matusiak", "authors": "Ewa Matusiak and Yonina C. Eldar", "title": "Sub-Nyquist Sampling of Short Pulses", "comments": "28 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop sub-Nyquist sampling systems for analog signals comprised of\nseveral, possibly overlapping, finite duration pulses with unknown shapes and\ntime positions. Efficient sampling schemes when either the pulse shape or the\nlocations of the pulses are known have been previously developed. To the best\nof our knowledge, stable and low-rate sampling strategies for continuous\nsignals that are superpositions of unknown pulses without knowledge of the\npulse locations have not been derived. The goal in this paper is to fill this\ngap. We propose a multichannel scheme based on Gabor frames that exploits the\nsparsity of signals in time and enables sampling multipulse signals at\nsub-Nyquist rates. Moreover, if the signal is additionally essentially\nmultiband, then the sampling scheme can be adapted to lower the sampling rate\nwithout knowing the band locations. We show that, with proper preprocessing,\nthe necessary Gabor coefficients, can be recovered from the samples using\nstandard methods of compressed sensing. In addition, we provide error estimates\non the reconstruction and analyze the proposed architecture in the presence of\nnoise.\n", "versions": [{"version": "v1", "created": "Fri, 15 Oct 2010 11:45:16 GMT"}, {"version": "v2", "created": "Mon, 11 Apr 2011 08:44:04 GMT"}, {"version": "v3", "created": "Tue, 20 Dec 2011 11:56:35 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Matusiak", "Ewa", ""], ["Eldar", "Yonina C.", ""]]}, {"id": "1010.3150", "submitter": "Yong Fang", "authors": "Yong Fang", "title": "Application of DAC Codeword Spectrum: Expansion Factor", "comments": "12 pages, 3 figures, submitted to IEEE Trans. Inf. Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed Arithmetic Coding (DAC) proves to be an effective implementation\nof Slepian-Wolf Coding (SWC), especially for short data blocks. To study the\nproperty of DAC codewords, the author has proposed the concept of DAC codeword\nspectrum. For equiprobable binary sources, the problem was formatted as solving\na system of functional equations. Then, to calculate DAC codeword spectrum in\ngeneral cases, three approximation methods have been proposed. In this paper,\nthe author makes use of DAC codeword spectrum as a tool to answer an important\nquestion: how many (including proper and wrong) paths will be created during\nthe DAC decoding, if no path is pruned? The author introduces the concept of\nanother kind of DAC codeword spectrum, i.e. time spectrum, while the\noriginally-proposed DAC codeword spectrum is called path spectrum from now on.\nTo measure how fast the number of decoding paths increases, the author\nintroduces the concept of expansion factor which is defined as the ratio of\npath numbers between two consecutive decoding stages. The author reveals the\nrelation between expansion factor and path/time spectrum, and proves that the\nnumber of decoding paths of any DAC codeword increases exponentially as the\ndecoding proceeds. Specifically, when symbols `0' and `1' are mapped onto\nintervals [0, q) and [(1-q), 1), where 0.5<q<1, the author proves that\nexpansion factor converges to 2q as the decoding proceeds.\n", "versions": [{"version": "v1", "created": "Fri, 15 Oct 2010 13:08:20 GMT"}], "update_date": "2010-10-18", "authors_parsed": [["Fang", "Yong", ""]]}, {"id": "1010.3201", "submitter": "Marie Ferbus-Zanda", "authors": "Marie Ferbus-Zanda (LIAFA), Serge Grigorieff (LIAFA)", "title": "Kolmogorov Complexity in perspective. Part I: Information Theory and\n  Randomnes", "comments": "40 pages", "journal-ref": "Synthese / Synth\\`ese (2010) 00", "doi": null, "report-no": null, "categories": "cs.LO cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We survey diverse approaches to the notion of information: from Shannon\nentropy to Kolmogorov complexity. Two of the main applications of Kolmogorov\ncomplexity are presented: randomness and classification. The survey is divided\nin two parts in the same volume. Part I is dedicated to information theory and\nthe mathematical formalization of randomness based on Kolmogorov complexity.\nThis last application goes back to the 60's and 70's with the work of\nMartin-L\\\"of, Schnorr, Chaitin, Levin, and has gained new impetus in the last\nyears.\n", "versions": [{"version": "v1", "created": "Fri, 15 Oct 2010 15:58:13 GMT"}], "update_date": "2010-10-20", "authors_parsed": [["Ferbus-Zanda", "Marie", "", "LIAFA"], ["Grigorieff", "Serge", "", "LIAFA"]]}, {"id": "1010.3294", "submitter": "Mohamed Elsabagh", "authors": "Mohamed Elsabagh, Yara Abdallah, Moustafa Youssef, Hesham El Gamal", "title": "ARQ Security in Wi-Fi and RFID Networks", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present two practical ARQ-Based security schemes for Wi-Fi\nand RFID networks. Our proposed schemes enhance the confidentiality and\nauthenticity functions of these networks, respectively. Both schemes build on\nthe same idea; by exploiting the statistical independence between the multipath\nfading experienced by the legitimate nodes and potential adversaries, secret\nkeys are established and then are continuously updated. The continuous key\nupdate property of both schemes makes them capable of defending against all of\nthe passive eavesdropping attacks and most of the currently-known active\nattacks against either Wi-Fi or RFID networks. However, each scheme is tailored\nto best suit the requirements of its respective paradigm. In Wi-Fi networks, we\noverlay, rather than completely replace, the current Wi-Fi security protocols.\nThus, our Wi-Fi scheme can be readily implemented via only minor modifications\nover the IEEE 802.11 standards. On the other hand, the proposed RFID scheme\nintroduces the first provably secure low cost RFID authentication protocol. The\nproposed schemes impose a throughput-security tradeoff that is shown, through\nour analytical and experimental results, to be practically acceptable.\n", "versions": [{"version": "v1", "created": "Fri, 15 Oct 2010 23:06:22 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Elsabagh", "Mohamed", ""], ["Abdallah", "Yara", ""], ["Youssef", "Moustafa", ""], ["Gamal", "Hesham El", ""]]}, {"id": "1010.3312", "submitter": "Yeow Meng Chee", "authors": "Yeow Meng Chee, Gennian Ge, Lijun Ji, San Ling, Jianxing Yin", "title": "List Decodability at Small Radii", "comments": "to appear in Designs, Codes, and Cryptography (accepted October 2010)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  $A'(n,d,e)$, the smallest $\\ell$ for which every binary error-correcting code\nof length $n$ and minimum distance $d$ is decodable with a list of size $\\ell$\nup to radius $e$, is determined for all $d\\geq 2e-3$. As a result, $A'(n,d,e)$\nis determined for all $e\\leq 4$, except for 42 values of $n$.\n", "versions": [{"version": "v1", "created": "Sat, 16 Oct 2010 03:44:07 GMT"}], "update_date": "2010-10-19", "authors_parsed": [["Chee", "Yeow Meng", ""], ["Ge", "Gennian", ""], ["Ji", "Lijun", ""], ["Ling", "San", ""], ["Yin", "Jianxing", ""]]}, {"id": "1010.3319", "submitter": "Muhammad Shakir", "authors": "M. Zeeshan Shakir, Tariq S. Durrani and Mohamed-Slim Alouini", "title": "Hadamard Upper Bound (HUB) on Optimum Joint Decoding Capacity of Wyner\n  Gaussian Cellular MAC", "comments": "This paper has been withdrawn by the authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn by the authors.\n", "versions": [{"version": "v1", "created": "Sat, 16 Oct 2010 05:04:02 GMT"}, {"version": "v2", "created": "Mon, 28 Feb 2011 14:23:12 GMT"}], "update_date": "2011-03-01", "authors_parsed": [["Shakir", "M. Zeeshan", ""], ["Durrani", "Tariq S.", ""], ["Alouini", "Mohamed-Slim", ""]]}, {"id": "1010.3337", "submitter": "Marco Chiani Dr.", "authors": "Marco Chiani", "title": "How to use our talents based on Information Theory - or spending time\n  wisely", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.OC physics.soc-ph stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss the allocation of finite resources in the presence of a\nlogarithmic diminishing return law, in analogy to some results from Information\nTheory. To exemplify the problem we assume that the proposed logarithmic law is\napplied to the problem of how to spend our time.\n", "versions": [{"version": "v1", "created": "Sat, 16 Oct 2010 10:39:26 GMT"}], "update_date": "2010-10-19", "authors_parsed": [["Chiani", "Marco", ""]]}, {"id": "1010.3348", "submitter": "Arpad Baricz", "authors": "Szil\\'ard Andr\\'as, \\'Arp\\'ad Baricz, Yin Sun", "title": "The generalized Marcum $Q-$function: an orthogonal polynomial approach", "comments": "11 pages", "journal-ref": "Acta Universitatis Sapientiae Mathematica 3(1) (2011) 60-76", "doi": null, "report-no": null, "categories": "math.CA cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A novel power series representation of the generalized Marcum $Q-$function of\npositive order involving generalized Laguerre polynomials is presented. The\nabsolute convergence of the proposed power series expansion is showed, together\nwith a convergence speed analysis by means of truncation error. A brief review\nof related studies and some numerical results are also provided.\n", "versions": [{"version": "v1", "created": "Sat, 16 Oct 2010 12:53:38 GMT"}, {"version": "v2", "created": "Wed, 22 Dec 2010 20:39:02 GMT"}, {"version": "v3", "created": "Wed, 9 Feb 2011 09:50:55 GMT"}], "update_date": "2011-08-09", "authors_parsed": [["András", "Szilárd", ""], ["Baricz", "Árpád", ""], ["Sun", "Yin", ""]]}, {"id": "1010.3469", "submitter": "Shuping Gong", "authors": "Shuping Gong, Husheng Li, Lifeng Lai and Robert. C. Qiu", "title": "Decoding the `Nature Encoded' Messages for Distributed Energy Generation\n  Control in Microgrid", "comments": "It has been submitted to IEEE International Conference on\n  Communications (ICC)", "journal-ref": null, "doi": "10.1109/icc.2011.5963048", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The communication for the control of distributed energy generation (DEG) in\nmicrogrid is discussed. Due to the requirement of realtime transmission, weak\nor no explicit channel coding is used for the message of system state. To\nprotect the reliability of the uncoded or weakly encoded messages, the system\ndynamics are considered as a `nature encoding' similar to convolution code, due\nto its redundancy in time. For systems with or without explicit channel coding,\ntwo decoding procedures based on Kalman filtering and Pearl's Belief\nPropagation, in a similar manner to Turbo processing in traditional data\ncommunication systems, are proposed. Numerical simulations have demonstrated\nthe validity of the schemes, using a linear model of electric generator dynamic\nsystem.\n", "versions": [{"version": "v1", "created": "Mon, 18 Oct 2010 02:57:41 GMT"}, {"version": "v2", "created": "Tue, 19 Oct 2010 14:40:31 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Gong", "Shuping", ""], ["Li", "Husheng", ""], ["Lai", "Lifeng", ""], ["Qiu", "Robert. C.", ""]]}, {"id": "1010.3519", "submitter": "Zichong Chen", "authors": "Zichong Chen, Guillermo Barrenetxea, and Martin Vetterli", "title": "Distributed Successive Approximation Coding using Broadcast Advantage:\n  The Two-Encoder Case", "comments": "In Proceedings of the 48th Annual Allerton Conference on\n  Communication, Control and Computing, University of Illinois, Monticello, IL,\n  September 29 - October 1, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional distributed source coding rarely considers the possible link\nbetween separate encoders. However, the broadcast nature of wireless\ncommunication in sensor networks provides a free gossip mechanism which can be\nused to simplify encoding/decoding and reduce transmission power. Using this\nbroadcast advantage, we present a new two-encoder scheme which imitates the\nping-pong game and has a successive approximation structure. For the quadratic\nGaussian case, we prove that this scheme is successively refinable on the\n{sum-rate, distortion pair} surface, which is characterized by the\nrate-distortion region of the distributed two-encoder source coding. A\npotential energy saving over conventional distributed coding is also\nillustrated. This ping-pong distributed coding idea can be extended to the\nmultiple encoder case and provides the theoretical foundation for a new class\nof distributed image coding method in wireless scenarios.\n", "versions": [{"version": "v1", "created": "Mon, 18 Oct 2010 08:35:41 GMT"}], "update_date": "2010-10-19", "authors_parsed": [["Chen", "Zichong", ""], ["Barrenetxea", "Guillermo", ""], ["Vetterli", "Martin", ""]]}, {"id": "1010.3601", "submitter": "Gianluigi Liva", "authors": "Gianluigi Liva, Enrico Paolini, Marco Chiani", "title": "High-Throughput Random Access via Codes on Graphs", "comments": "Presented at the Future Network and MobileSummit 2010 Conference,\n  Florence (Italy), June 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, contention resolution diversity slotted ALOHA (CRDSA) has been\nintroduced as a simple but effective improvement to slotted ALOHA. It relies on\nMAC burst repetitions and on interference cancellation to increase the\nnormalized throughput of a classic slotted ALOHA access scheme. CRDSA allows\nachieving a larger throughput than slotted ALOHA, at the price of an increased\naverage transmitted power. A way to trade-off the increment of the average\ntransmitted power and the improvement of the throughput is presented in this\npaper. Specifically, it is proposed to divide each MAC burst in k sub-bursts,\nand to encode them via a (n,k) erasure correcting code. The n encoded\nsub-bursts are transmitted over the MAC channel, according to specific\ntime/frequency-hopping patterns. Whenever n-e>=k sub-bursts (of the same burst)\nare received without collisions, erasure decoding allows recovering the\nremaining e sub-bursts (which were lost due to collisions). An interference\ncancellation process can then take place, removing in e slots the interference\ncaused by the e recovered sub-bursts, possibly allowing the correct decoding of\nsub-bursts related to other bursts. The process is thus iterated as for the\nCRDSA case.\n", "versions": [{"version": "v1", "created": "Mon, 18 Oct 2010 14:03:33 GMT"}, {"version": "v2", "created": "Tue, 19 Oct 2010 07:14:11 GMT"}], "update_date": "2010-10-20", "authors_parsed": [["Liva", "Gianluigi", ""], ["Paolini", "Enrico", ""], ["Chiani", "Marco", ""]]}, {"id": "1010.3613", "submitter": "Wei Liu", "authors": "Wei Liu, Ge Xu and Biao Chen", "title": "The Common Information of N Dependent Random Variables", "comments": "8 pages, 4 figures,presented at the Forty-Eighth Annual Allerton\n  Conference on Communication, Control, and Computing, September 29 - October\n  1, 2010, Monticello, IL, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper generalizes Wyner's definition of common information of a pair of\nrandom variables to that of $N$ random variables. We prove coding theorems that\nshow the same operational meanings for the common information of two random\nvariables generalize to that of $N$ random variables. As a byproduct of our\nproof, we show that the Gray-Wyner source coding network can be generalized to\n$N$ source squences with $N$ decoders. We also establish a monotone property of\nWyner's common information which is in contrast to other notions of the common\ninformation, specifically Shannon's mutual information and G\\'{a}cs and\nK\\\"{o}rner's common randomness. Examples about the computation of Wyner's\ncommon information of $N$ random variables are also given.\n", "versions": [{"version": "v1", "created": "Mon, 18 Oct 2010 14:36:13 GMT"}], "update_date": "2010-10-19", "authors_parsed": [["Liu", "Wei", ""], ["Xu", "Ge", ""], ["Chen", "Biao", ""]]}, {"id": "1010.3726", "submitter": "Yeow-Khiang Chia", "authors": "Yeow Khiang Chia, Haim Permuter, Tsachy Weissman", "title": "Cascade, Triangular and Two Way Source Coding with degraded side\n  information at the second user", "comments": "29 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the Cascade and Triangular rate-distortion problems where the\nsame side information is available at the source node and User 1, and the side\ninformation available at User 2 is a degraded version of the side information\nat the source node and User 1. We characterize the rate-distortion region for\nthese problems. For the Cascade setup, we showed that, at User 1, decoding and\nre-binning the codeword sent by the source node for User 2 is optimum. We then\nextend our results to the Two way Cascade and Triangular setting, where the\nsource node is interested in lossy reconstruction of the side information at\nUser 2 via a rate limited link from User 2 to the source node. We characterize\nthe rate distortion regions for these settings. Complete explicit\ncharacterizations for all settings are also given in the Quadratic Gaussian\ncase. We conclude with two further extensions: A triangular source coding\nproblem with a helper, and an extension of our Two Way Cascade setting in the\nQuadratic Gaussian case.\n", "versions": [{"version": "v1", "created": "Mon, 18 Oct 2010 20:41:15 GMT"}], "update_date": "2010-10-20", "authors_parsed": [["Chia", "Yeow Khiang", ""], ["Permuter", "Haim", ""], ["Weissman", "Tsachy", ""]]}, {"id": "1010.3810", "submitter": "Hao Yu", "authors": "Hao Yu and Shunqing Zhang and Vincent K. N. Lau", "title": "Game Theoretical Power Control for Open-Loop Overlaid Network MIMO\n  Systems with Partial Cooperation", "comments": "18pages, 7 figures, IEEE Transactions on Wireless Communication,\n  accepted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network MIMO is considered to be a key solution for the next generation\nwireless systems in breaking the interference bottleneck in cellular systems.\nIn the MIMO systems, open-loop transmission scheme is used to support mobile\nstations (MSs) with high mobilities because the base stations (BSs) do not need\nto track the fast varying channel fading. In this paper, we consider an\nopen-loop network MIMO system with $K$ BSs serving K private MSs and $M^c$\ncommon MS based on a novel partial cooperation overlaying scheme. Exploiting\nthe heterogeneous path gains between the private MSs and the common MSs, each\nof the $K$ BSs serves a private MS non-cooperatively and the $K$ BSs also serve\nthe $M^c$ common MSs cooperatively. The proposed scheme does not require closed\nloop instantaneous channel state information feedback, which is highly\ndesirable for high mobility users. Furthermore, we formulate the long-term\ndistributive power allocation problem between the private MSs and the common\nMSs at each of the $K$ BSs using a partial cooperative game. We show that the\nlong-term power allocation game has a unique Nash Equilibrium (NE) but standard\nbest response update may not always converge to the NE. As a result, we propose\na low-complexity distributive long-term power allocation algorithm which only\nrelies on the local long-term channel statistics and has provable convergence\nproperty. Through numerical simulations, we show that the proposed open-loop\nSDMA scheme with long-term distributive power allocation can achieve\nsignificant performance advantages over the other reference baseline schemes.\n", "versions": [{"version": "v1", "created": "Tue, 19 Oct 2010 06:38:13 GMT"}], "update_date": "2010-10-20", "authors_parsed": [["Yu", "Hao", ""], ["Zhang", "Shunqing", ""], ["Lau", "Vincent K. N.", ""]]}, {"id": "1010.3981", "submitter": "Arash Behboodi", "authors": "Arash Behboodi, Pablo Piantanida", "title": "Broadcasting over the Relay Channel with Oblivious Cooperative Strategy", "comments": "6 pages, presented at Allerton 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the problem of information transmission over the\nsimultaneous relay channel with two users (or two possible channel outcomes)\nwhere for one of them the more suitable strategy is Decode-and-Forward (DF)\nwhile for the other one is Compress-and-Forward (CF). In this setting, it is\nassumed that the source wishes to send common and private informations to each\nof the users (or channel outcomes). This problem is relevant to: (i) the\ntransmission of information over the broadcast relay channel (BRC) with\ndifferent relaying strategies and (ii) the transmission of information over the\nconventional relay channel where the source is oblivious to the coding strategy\nof relay. A novel coding that integrates simultaneously DF and CF schemes is\nproposed and an inner bound on the capacity region is derived for the case of\ngeneral memoryless BRCs. As special case, the Gaussian BRC is studied where it\nis shown that by means of the suggested broadcast coding the common rate can be\nimproved compared to existing strategies. Applications of these results arise\nin broadcast scenarios with relays or in wireless scenarios where the source\ndoes not know whether the relay is collocated with the source or with the\ndestination.\n", "versions": [{"version": "v1", "created": "Tue, 19 Oct 2010 17:12:46 GMT"}], "update_date": "2010-10-20", "authors_parsed": [["Behboodi", "Arash", ""], ["Piantanida", "Pablo", ""]]}, {"id": "1010.3983", "submitter": "R Devarakonda", "authors": "Ranjeet Devarakonda, Giri Palanisamy, Jim Green", "title": "Digitizing scientific data and data retrieval techniques", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Storing data is easy, but finding and using data is not. It is desirable that\nthe data is stored in a structured format, which can be preserved and retrieved\nin future. Creating Metadata for the data is one way of creating structured\ndata formats. Metadata can provide Multidisciplinary data access and will\nfoster more robust scientific discoveries. In the recent years, there has been\nsignificant advancement in the areas of scientific data management and\nretrieval techniques, particularly in terms of standards and protocols for\narchiving data and metadata. New search technologies are being implemented\naround these protocols, which makes searching easy, fast and yet robust.\nScientific data is generally rich, not easy to understand, and spread across\ndifferent places. In order to integrate these pieces together, a data archive\nand an associated metadata is generated. This data should be stored in a format\nthat can be locatable, retrievable and understandable, more importantly it\nshould be in a form that will continue to be accessible as technology changes,\nsuch as XML.\n", "versions": [{"version": "v1", "created": "Tue, 19 Oct 2010 17:22:55 GMT"}, {"version": "v2", "created": "Mon, 3 Jan 2011 17:20:51 GMT"}], "update_date": "2011-01-04", "authors_parsed": [["Devarakonda", "Ranjeet", ""], ["Palanisamy", "Giri", ""], ["Green", "Jim", ""]]}, {"id": "1010.4160", "submitter": "Konstantinos Nikitopoulos", "authors": "Konstantinos Nikitopoulos, Gerd Ascheid", "title": "MIMO APP Receiver Processing with Performance-Determined Complexity", "comments": "An extended version of this work has been submitted for publication\n  consideration", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Typical receiver processing, targeting always the best achievable bit error\nrate performance, can result in a waste of resources, especially, when the\ntransmission conditions are such that the best performance is orders of\nmagnitude better than the required. In this work, a processing framework is\nproposed which allows adjusting the processing requirements to the transmission\nconditions and the required bit error rate. It applies a-posteriori probability\nreceivers operating over multiple-input multiple-output channels. It is\ndemonstrated that significant complexity savings can be achieved both at the\nsoft, sphere-decoder based detector and the channel decoder with only minor\nmodifications.\n", "versions": [{"version": "v1", "created": "Wed, 20 Oct 2010 11:04:37 GMT"}, {"version": "v2", "created": "Mon, 15 Aug 2011 18:28:19 GMT"}, {"version": "v3", "created": "Fri, 20 Jan 2012 00:53:21 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Nikitopoulos", "Konstantinos", ""], ["Ascheid", "Gerd", ""]]}, {"id": "1010.4205", "submitter": "Riyazuddin Mohammed", "authors": "Riyazuddin Mohammed", "title": "Information Analysis of DNA Sequences", "comments": "22 pages doc", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of differentiating the informational content of coding (exons)\nand non-coding (introns) regions of a DNA sequence is one of the central\nproblems of genomics. The introns are estimated to be nearly 95% of the DNA and\nsince they do not seem to participate in the process of transcription of\namino-acids, they have been termed \"junk DNA.\" Although it is believed that the\nnon-coding regions in genomes have no role in cell growth and evolution,\ndemonstration that these regions carry useful information would tend to falsify\nthis belief. In this paper, we consider entropy as a measure of information by\nmodifying the entropy expression to take into account the varying length of\nthese sequences. Exons are usually much shorter in length than introns;\ntherefore the comparison of the entropy values needs to be normalized. A length\ncorrection strategy was employed using randomly generated nucleonic base\nstrings built out of the alphabet of the same size as the exons under question.\nOur analysis shows that introns carry nearly as much of information as exons,\ndisproving the notion that they do not carry any information. The entropy\nfindings of this paper are likely to be of use in further study of other\nchallenging works like the analysis of symmetry models of the genetic code.\n", "versions": [{"version": "v1", "created": "Fri, 15 Oct 2010 22:49:21 GMT"}], "update_date": "2010-10-21", "authors_parsed": [["Mohammed", "Riyazuddin", ""]]}, {"id": "1010.4237", "submitter": "Constantine Caramanis", "authors": "Huan Xu, Constantine Caramanis and Sujay Sanghavi", "title": "Robust PCA via Outlier Pursuit", "comments": "26 pages, appeared in NIPS 2010. v2 has typos corrected, some\n  re-writing. results essentially unchanged", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.IT math.IT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Singular Value Decomposition (and Principal Component Analysis) is one of the\nmost widely used techniques for dimensionality reduction: successful and\nefficiently computable, it is nevertheless plagued by a well-known,\nwell-documented sensitivity to outliers. Recent work has considered the setting\nwhere each point has a few arbitrarily corrupted components. Yet, in\napplications of SVD or PCA such as robust collaborative filtering or\nbioinformatics, malicious agents, defective genes, or simply corrupted or\ncontaminated experiments may effectively yield entire points that are\ncompletely corrupted.\n  We present an efficient convex optimization-based algorithm we call Outlier\nPursuit, that under some mild assumptions on the uncorrupted points (satisfied,\ne.g., by the standard generative assumption in PCA problems) recovers the exact\noptimal low-dimensional subspace, and identifies the corrupted points. Such\nidentification of corrupted points that do not conform to the low-dimensional\napproximation, is of paramount interest in bioinformatics and financial\napplications, and beyond. Our techniques involve matrix decomposition using\nnuclear norm minimization, however, our results, setup, and approach,\nnecessarily differ considerably from the existing line of work in matrix\ncompletion and matrix decomposition, since we develop an approach to recover\nthe correct column space of the uncorrupted matrix, rather than the exact\nmatrix itself. In any problem where one seeks to recover a structure rather\nthan the exact initial matrices, techniques developed thus far relying on\ncertificates of optimality, will fail. We present an important extension of\nthese methods, that allows the treatment of such problems.\n", "versions": [{"version": "v1", "created": "Wed, 20 Oct 2010 16:05:28 GMT"}, {"version": "v2", "created": "Fri, 31 Dec 2010 18:36:49 GMT"}], "update_date": "2011-01-04", "authors_parsed": [["Xu", "Huan", ""], ["Caramanis", "Constantine", ""], ["Sanghavi", "Sujay", ""]]}, {"id": "1010.4484", "submitter": "Jean-Claude Belfiore", "authors": "Jean-Claude Belfiore and Patrick Sol\\'e", "title": "A Type II lattice of norm 8 in dimension 72", "comments": "withdrawn, result incorrect", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Type II lattice of norm 8 in dimension 72 is obtained by Construction A\napplied to an extended Quadratic Residue code over Z8. Its automorphism group\ncontains a subgroup isomorphic to PSL(2,71).\n", "versions": [{"version": "v1", "created": "Thu, 21 Oct 2010 14:35:05 GMT"}, {"version": "v2", "created": "Tue, 26 Oct 2010 18:36:52 GMT"}], "update_date": "2010-10-27", "authors_parsed": [["Belfiore", "Jean-Claude", ""], ["Solé", "Patrick", ""]]}, {"id": "1010.4499", "submitter": "Walid Saad", "authors": "Walid Saad, Zhu Han, Tamer Basar, Merouane Debbah, Are Hj{\\o}rungnes", "title": "Hedonic Coalition Formation for Distributed Task Allocation among\n  Wireless Agents", "comments": "to appear, IEEE Transactions on Mobile Computing", "journal-ref": "IEEE Transactions on Mobile Computing, 2011", "doi": "10.1109/TMC.2010.242", "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Autonomous wireless agents such as unmanned aerial vehicles or mobile base\nstations present a great potential for deployment in next-generation wireless\nnetworks. While current literature has been mainly focused on the use of agents\nwithin robotics or software applications, we propose a novel usage model for\nself-organizing agents suited to wireless networks. In the proposed model, a\nnumber of agents are required to collect data from several arbitrarily located\ntasks. Each task represents a queue of packets that require collection and\nsubsequent wireless transmission by the agents to a central receiver. The\nproblem is modeled as a hedonic coalition formation game between the agents and\nthe tasks that interact in order to form disjoint coalitions. Each formed\ncoalition is modeled as a polling system consisting of a number of agents which\nmove between the different tasks present in the coalition, collect and transmit\nthe packets. Within each coalition, some agents can also take the role of a\nrelay for improving the packet success rate of the transmission. The proposed\nalgorithm allows the tasks and the agents to take distributed decisions to join\nor leave a coalition, based on the achieved benefit in terms of effective\nthroughput, and the cost in terms of delay. As a result of these decisions, the\nagents and tasks structure themselves into independent disjoint coalitions\nwhich constitute a Nash-stable network partition. Moreover, the proposed\nalgorithm allows the agents and tasks to adapt the topology to environmental\nchanges such as the arrival/removal of tasks or the mobility of the tasks.\nSimulation results show how the proposed algorithm improves the performance, in\nterms of average player (agent or task) payoff, of at least 30.26% (for a\nnetwork of 5 agents with up to 25 tasks) relatively to a scheme that allocates\nnearby tasks equally among agents.\n", "versions": [{"version": "v1", "created": "Thu, 21 Oct 2010 15:32:03 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Saad", "Walid", ""], ["Han", "Zhu", ""], ["Basar", "Tamer", ""], ["Debbah", "Merouane", ""], ["Hjørungnes", "Are", ""]]}, {"id": "1010.4501", "submitter": "Walid Saad", "authors": "Walid Saad, Zhu Han, Tamer Basar, Merouane Debbah, Are Hj{\\o}rungnes", "title": "Coalition Formation Games for Collaborative Spectrum Sensing", "comments": "IEEE Transactions on Vehicular Technology, to appear", "journal-ref": "IEEE Transactions on Vehicular Technology, 2011", "doi": "10.1109/TVT.2010.2089477", "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Collaborative Spectrum Sensing (CSS) between secondary users (SUs) in\ncognitive networks exhibits an inherent tradeoff between minimizing the\nprobability of missing the detection of the primary user (PU) and maintaining a\nreasonable false alarm probability (e.g., for maintaining a good spectrum\nutilization). In this paper, we study the impact of this tradeoff on the\nnetwork structure and the cooperative incentives of the SUs that seek to\ncooperate for improving their detection performance. We model the CSS problem\nas a non-transferable coalitional game, and we propose distributed algorithms\nfor coalition formation. First, we construct a distributed coalition formation\n(CF) algorithm that allows the SUs to self-organize into disjoint coalitions\nwhile accounting for the CSS tradeoff. Then, the CF algorithm is complemented\nwith a coalitional voting game for enabling distributed coalition formation\nwith detection probability guarantees (CF-PD) when required by the PU. The\nCF-PD algorithm allows the SUs to form minimal winning coalitions (MWCs), i.e.,\ncoalitions that achieve the target detection probability with minimal costs.\nFor both algorithms, we study and prove various properties pertaining to\nnetwork structure, adaptation to mobility and stability. Simulation results\nshow that CF reduces the average probability of miss per SU up to 88.45%\nrelative to the non-cooperative case, while maintaining a desired false alarm.\nFor CF-PD, the results show that up to 87.25% of the SUs achieve the required\ndetection probability through MWC\n", "versions": [{"version": "v1", "created": "Thu, 21 Oct 2010 15:37:33 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Saad", "Walid", ""], ["Han", "Zhu", ""], ["Basar", "Tamer", ""], ["Debbah", "Merouane", ""], ["Hjørungnes", "Are", ""]]}, {"id": "1010.4548", "submitter": "Aravind Iyengar", "authors": "Aravind Iyengar, Marco Papaleo, Paul Siegel, Jack Wolf, Alessandro\n  Vanelli-Coralli, Giovanni Corazza", "title": "Windowed Decoding of Protograph-based LDPC Convolutional Codes over\n  Erasure Channels", "comments": "18 pages, 9 figures, accepted for publication in the IEEE\n  Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2177439", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a windowed decoding scheme for LDPC convolutional codes that is\nbased on the belief-propagation (BP) algorithm. We discuss the advantages of\nthis decoding scheme and identify certain characteristics of LDPC convolutional\ncode ensembles that exhibit good performance with the windowed decoder. We will\nconsider the performance of these ensembles and codes over erasure channels\nwith and without memory. We show that the structure of LDPC convolutional code\nensembles is suitable to obtain performance close to the theoretical limits\nover the memoryless erasure channel, both for the BP decoder and windowed\ndecoding. However, the same structure imposes limitations on the performance\nover erasure channels with memory.\n", "versions": [{"version": "v1", "created": "Thu, 21 Oct 2010 18:19:17 GMT"}, {"version": "v2", "created": "Sat, 22 Oct 2011 18:18:54 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Iyengar", "Aravind", ""], ["Papaleo", "Marco", ""], ["Siegel", "Paul", ""], ["Wolf", "Jack", ""], ["Vanelli-Coralli", "Alessandro", ""], ["Corazza", "Giovanni", ""]]}, {"id": "1010.4603", "submitter": "Aravind Iyengar", "authors": "Aravind R. Iyengar, Paul H. Siegel, Jack K. Wolf", "title": "Write Channel Model for Bit-Patterned Media Recording", "comments": "11 pages, 12 figures, journal", "journal-ref": null, "doi": "10.1109/TMAG.2010.2080667", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new write channel model for bit-patterned media recording that\nreflects the data dependence of write synchronization errors. It is shown that\nthis model accommodates both substitution-like errors and insertion-deletion\nerrors whose statistics are determined by an underlying channel state process.\nWe study information theoretic properties of the write channel model, including\nthe capacity, symmetric information rate, Markov-1 rate and the zero-error\ncapacity.\n", "versions": [{"version": "v1", "created": "Fri, 22 Oct 2010 02:28:04 GMT"}], "update_date": "2011-06-02", "authors_parsed": [["Iyengar", "Aravind R.", ""], ["Siegel", "Paul H.", ""], ["Wolf", "Jack K.", ""]]}, {"id": "1010.4612", "submitter": "Hassan Mansour", "authors": "Michael P. Friedlander and Hassan Mansour and Rayan Saab and Ozgur\n  Yilmaz", "title": "Recovering Compressively Sampled Signals Using Partial Support\n  Information", "comments": "22 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.SY math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study recovery conditions of weighted $\\ell_1$ minimization\nfor signal reconstruction from compressed sensing measurements when partial\nsupport information is available. We show that if at least 50% of the (partial)\nsupport information is accurate, then weighted $\\ell_1$ minimization is stable\nand robust under weaker conditions than the analogous conditions for standard\n$\\ell_1$ minimization. Moreover, weighted $\\ell_1$ minimization provides better\nbounds on the reconstruction error in terms of the measurement noise and the\ncompressibility of the signal to be recovered. We illustrate our results with\nextensive numerical experiments on synthetic data and real audio and video\nsignals.\n", "versions": [{"version": "v1", "created": "Fri, 22 Oct 2010 04:32:08 GMT"}, {"version": "v2", "created": "Fri, 22 Jul 2011 22:46:42 GMT"}], "update_date": "2011-07-26", "authors_parsed": [["Friedlander", "Michael P.", ""], ["Mansour", "Hassan", ""], ["Saab", "Rayan", ""], ["Yilmaz", "Ozgur", ""]]}, {"id": "1010.4690", "submitter": "Wei-Chiang Li", "authors": "Wei-Chiang Li and Tsung-Hui Chang and Che Lin and Chong-Yung Chi", "title": "A convex approximation approach to Weighted Sum Rate Maximization of\n  Multiuser MISO Interference Channel under outage constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers weighted sum rate maximization of multiuser\nmultiple-input single-output interference channel (MISO-IFC) under outage\nconstraints. The outage-constrained weighted sum rate maximization problem is a\nnonconvex optimization problem and is difficult to solve. While it is possible\nto optimally deal with this problem in an exhaustive search manner by finding\nall the Pareto-optimal rate tuples in the (discretized) outage-constrained\nachievable rate region, this approach, however, suffers from a prohibitive\ncomputational complexity and is feasible only when the number of\ntransmitter-receive pairs is small. In this paper, we propose a convex\noptimization based approximation method for efficiently handling the\noutage-constrained weighted sum rate maximization problem. The proposed\napproximation method consists of solving a sequence of convex optimization\nproblems, and thus can be efficiently implemented by interior-point methods.\nSimulation results show that the proposed method can yield near-optimal\nsolutions.\n", "versions": [{"version": "v1", "created": "Fri, 22 Oct 2010 12:35:43 GMT"}], "update_date": "2010-10-25", "authors_parsed": [["Li", "Wei-Chiang", ""], ["Chang", "Tsung-Hui", ""], ["Lin", "Che", ""], ["Chi", "Chong-Yung", ""]]}, {"id": "1010.4726", "submitter": "Peter Thomas PhD", "authors": "Edward K. Agarwala, Hillel J. Chiel, Peter J. Thomas", "title": "Information Maximization Fails to Maximize Expected Utility in a Simple\n  Foraging Model", "comments": "52 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT cs.IT math.IT physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information theory has explained the organization of many biological\nphenomena, from the physiology of sensory receptive fields to the variability\nof certain DNA sequence ensembles. Some scholars have proposed that information\nshould provide the central explanatory principle in biology, in the sense that\nany behavioral strategy that is optimal for an organism's survival must\nnecessarily involve efficient information processing. We challenge this view by\nproviding a counterexample. We present an analytically tractable model for a\nparticular instance of a perception-action loop: a creature searching for a\nfood source confined to a one-dimensional ring world. The model incorporates\nthe statistical structure of the creature's world, the effects of the\ncreature's actions on that structure, and the creature's strategic decision\nprocess. The model takes the form of a Markov process on an infinite\ndimensional state space. To analyze it we construct an exact coarse graining\nthat reduces the model to a Markov process on a finite number of \"information\nstates\". This technique allows us to make quantitative comparisons between the\nperformance of an information-theoretically optimal strategy with other\ncandidate strategies on a food gathering task. We find that: 1. Information\noptimal search does not necessarily optimize utility (expected food gain). 2.\nThe rank ordering of search strategies by information performance does not\npredict their ordering by expected food obtained. 3. The relative advantage of\ndifferent strategies depends on the statistical structure of the environment,\nin particular the variability of motion of the source. We conclude that there\nis no simple relationship between information and utility. Behavioral\noptimality does not imply information efficiency, nor is there a simple\ntradeoff between gaining information about a food source versus obtaining the\nfood itself.\n", "versions": [{"version": "v1", "created": "Fri, 22 Oct 2010 14:33:46 GMT"}], "update_date": "2010-10-25", "authors_parsed": [["Agarwala", "Edward K.", ""], ["Chiel", "Hillel J.", ""], ["Thomas", "Peter J.", ""]]}, {"id": "1010.4751", "submitter": "Ignacio Ramirez", "authors": "Ignacio Ram\\'irez and Guillermo Sapiro (University of Minnesota)", "title": "Sparse coding and dictionary learning based on the MDL principle", "comments": "4 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The power of sparse signal coding with learned dictionaries has been\ndemonstrated in a variety of applications and fields, from signal processing to\nstatistical inference and machine learning. However, the statistical properties\nof these models, such as underfitting or overfitting given sets of data, are\nstill not well characterized in the literature. This work aims at filling this\ngap by means of the Minimum Description Length (MDL) principle -- a well\nestablished information-theoretic approach to statistical inference. The\nresulting framework derives a family of efficient sparse coding and modeling\n(dictionary learning) algorithms, which by virtue of the MDL principle, are\ncompletely parameter free. Furthermore, such framework allows to incorporate\nadditional prior information in the model, such as Markovian dependencies, in a\nnatural way. We demonstrate the performance of the proposed framework with\nresults for image denoising and classification tasks.\n", "versions": [{"version": "v1", "created": "Fri, 22 Oct 2010 16:31:01 GMT"}], "update_date": "2010-10-25", "authors_parsed": [["Ramírez", "Ignacio", "", "University of Minnesota"], ["Sapiro", "Guillermo", "", "University of Minnesota"]]}, {"id": "1010.4820", "submitter": "Serdar Y\\\"uksel", "authors": "Serdar Y\\\"uksel, Sean P. Meyn", "title": "Random-Time, State-Dependent Stochastic Drift for Markov Chains and\n  Application to Stochastic Stabilization Over Erasure Channels", "comments": "To appear in IEEE Transactions on Automatic Control", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.IT cs.SY math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is known that state-dependent, multi-step Lyapunov bounds lead to greatly\nsimplified verification theorems for stability for large classes of Markov\nchain models. This is one component of the \"fluid model\" approach to stability\nof stochastic networks. In this paper we extend the general theory to\nrandomized multi-step Lyapunov theory to obtain criteria for stability and\nsteady-state performance bounds, such as finite moments.\n  These results are applied to a remote stabilization problem, in which a\ncontroller receives measurements from an erasure channel with limited capacity.\nBased on the general results in the paper it is shown that stability of the\nclosed loop system is assured provided that the channel capacity is greater\nthan the logarithm of the unstable eigenvalue, plus an additional correction\nterm. The existence of a finite second moment in steady-state is established\nunder additional conditions.\n", "versions": [{"version": "v1", "created": "Fri, 22 Oct 2010 22:15:19 GMT"}, {"version": "v2", "created": "Tue, 3 Jan 2012 16:13:11 GMT"}, {"version": "v3", "created": "Thu, 17 May 2012 15:11:43 GMT"}], "update_date": "2012-05-18", "authors_parsed": [["Yüksel", "Serdar", ""], ["Meyn", "Sean P.", ""]]}, {"id": "1010.4824", "submitter": "Serdar Y\\\"uksel", "authors": "Serdar Y\\\"uksel", "title": "On Optimal Causal Coding of Partially Observed Markov Sources in Single\n  and Multi-Terminal Settings", "comments": "To appear in IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The optimal causal coding of a partially observed Markov process is studied,\nwhere the cost to be minimized is a bounded, non-negative, additive, measurable\nsingle-letter function of the source and the receiver output. A structural\nresult is obtained extending Witsenhausen's and Walrand-Varaiya's structural\nresults on optimal real-time coders to a partially observed setting. The\ndecentralized (multi-terminal) setup is also considered. For the case where the\nsource is an i.i.d. process, it is shown that the optimal decentralized causal\ncoding of correlated observations problem admits a solution which is\nmemoryless. For Markov sources, a counterexample to a natural separation\nconjecture is presented.\n", "versions": [{"version": "v1", "created": "Fri, 22 Oct 2010 22:52:01 GMT"}, {"version": "v2", "created": "Tue, 26 Oct 2010 03:06:28 GMT"}, {"version": "v3", "created": "Sat, 4 Aug 2012 13:05:04 GMT"}, {"version": "v4", "created": "Thu, 23 Aug 2012 15:24:56 GMT"}], "update_date": "2012-08-24", "authors_parsed": [["Yüksel", "Serdar", ""]]}, {"id": "1010.4854", "submitter": "Pulkit Grover", "authors": "Pulkit Grover and Anant Sahai", "title": "Implicit and explicit communication in decentralized control", "comments": "Presented at Allerton'10", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.SY math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There has been substantial progress recently in understanding toy problems of\npurely implicit signaling. These are problems where the source and the channel\nare implicit -- the message is generated endogenously by the system, and the\nplant itself is used as a channel. In this paper, we explore how implicit and\nexplicit communication can be used synergistically to reduce control costs. The\nsetting is an extension of Witsenhausen's counterexample where a rate-limited\nexternal channel connects the two controllers. Using a semi-deterministic\nversion of the problem, we arrive at a binning-based strategy that can\noutperform the best known strategies by an arbitrarily large factor. We also\nshow that our binning-based strategy attains within a constant factor of the\noptimal cost for an asymptotically infinite-length version of the problem\nuniformly over all problem parameters and all rates on the external channel.\nFor the scalar case, although our results yield approximate optimality for each\nfixed rate, we are unable to prove approximately-optimality uniformly over all\nrates.\n", "versions": [{"version": "v1", "created": "Sat, 23 Oct 2010 07:34:37 GMT"}], "update_date": "2010-10-26", "authors_parsed": [["Grover", "Pulkit", ""], ["Sahai", "Anant", ""]]}, {"id": "1010.4855", "submitter": "Pulkit Grover", "authors": "Pulkit Grover, Kristen Ann Woyach and Anant Sahai", "title": "Towards a communication-theoretic understanding of system-level power\n  consumption", "comments": "24 pages, 13 figures, revision of our submission to JSAC Special\n  issue on energy-efficient wireless communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CC math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional communication theory focuses on minimizing transmit power.\nHowever, communication links are increasingly operating at shorter ranges where\ntransmit power can be significantly smaller than the power consumed in\ndecoding. This paper models the required decoding power and investigates the\nminimization of total system power from two complementary perspectives.\n  First, an isolated point-to-point link is considered. Using new lower bounds\non the complexity of message-passing decoding, lower bounds are derived on\ndecoding power. These bounds show that 1) there is a fundamental tradeoff\nbetween transmit and decoding power; 2) unlike the implications of the\ntraditional \"waterfall\" curve which focuses on transmit power, the total power\nmust diverge to infinity as error probability goes to zero; 3) Regular LDPCs,\nand not their known capacity-achieving irregular counterparts, can be shown to\nbe power order optimal in some cases; and 4) the optimizing transmit power is\nbounded away from the Shannon limit.\n  Second, we consider a collection of links. When systems both generate and\nface interference, coding allows a system to support a higher density of\ntransmitter-receiver pairs (assuming interference is treated as noise).\nHowever, at low densities, uncoded transmission may be more power-efficient in\nsome cases.\n", "versions": [{"version": "v1", "created": "Sat, 23 Oct 2010 07:53:18 GMT"}, {"version": "v2", "created": "Wed, 16 Feb 2011 20:49:35 GMT"}], "update_date": "2011-02-17", "authors_parsed": [["Grover", "Pulkit", ""], ["Woyach", "Kristen Ann", ""], ["Sahai", "Anant", ""]]}, {"id": "1010.4858", "submitter": "Salah A. Aly", "authors": "Salah A. Aly, Nirwan Ansari, Anwar I. Walid, H. Vincent Poor", "title": "S-MATE: Secure Coding-based Multipath Adaptive Traffic Engineering", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There have been several approaches to provisioning traffic between core\nnetwork nodes in Internet Service Provider (ISP) networks. Such approaches aim\nto minimize network delay, increase network capacity, and enhance network\nsecurity services. MATE (Multipath Adaptive Traffic Engineering) protocol has\nbeen proposed for multipath adaptive traffic engineering between an ingress\nnode (source) and an egress node (destination). Its novel idea is to avoid\nnetwork congestion and attacks that might exist in edge and node disjoint paths\nbetween two core network nodes.\n  This paper builds an adaptive, robust, and reliable traffic engineering\nscheme for better performance of communication network operations. This will\nalso provision quality of service (QoS) and protection of traffic engineering\nto maximize network efficiency. Specifically, we present a new approach, S-MATE\n(secure MATE) is developed to protect the network traffic between two core\nnodes (routers or switches) in a cloud network. S-MATE secures against a single\nlink attack/failure by adding redundancy in one of the operational paths\nbetween the sender and receiver. The proposed scheme can be built to secure\ncore networks such as optical and IP networks.\n", "versions": [{"version": "v1", "created": "Sat, 23 Oct 2010 08:24:01 GMT"}], "update_date": "2010-11-12", "authors_parsed": [["Aly", "Salah A.", ""], ["Ansari", "Nirwan", ""], ["Walid", "Anwar I.", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1010.4876", "submitter": "Hakan Erkal", "authors": "Mehmet Akif Antepli, Elif Uysal-Biyikoglu, Hakan Erkal", "title": "Optimal Packet Scheduling on an Energy Harvesting Broadcast Link", "comments": "25 pages, 6 figures, added lemma and theorems, added reference,\n  corrected typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The minimization of transmission completion time for a given number of bits\nper user in an energy harvesting communication system, where energy harvesting\ninstants are known in an offline manner is considered. An achievable rate\nregion with structural properties satisfied by the 2-user AWGN Broadcast\nChannel capacity region is assumed. It is shown that even though all data are\navailable at the beginning, a non-negative amount of energy from each energy\nharvest is deferred for later use such that the transmit power starts at its\nlowest value and rises as time progresses. The optimal scheduler ends the\ntransmission to both users at the same time. Exploiting the special structure\nin the problem, the iterative offline algorithm, FlowRight, from earlier\nliterature, is adapted and proved to solve this problem. The solution has\npolynomial complexity in the number of harvests used, and is observed to\nconverge quickly on numerical examples.\n", "versions": [{"version": "v1", "created": "Sat, 23 Oct 2010 13:06:47 GMT"}, {"version": "v2", "created": "Thu, 24 Feb 2011 21:12:44 GMT"}], "update_date": "2011-02-28", "authors_parsed": [["Antepli", "Mehmet Akif", ""], ["Uysal-Biyikoglu", "Elif", ""], ["Erkal", "Hakan", ""]]}, {"id": "1010.4911", "submitter": "Anas Chaaban", "authors": "Anas Chaaban and Aydin Sezgin", "title": "The Capacity Region of the 3-User Gaussian Interference Channel with\n  Mixed Strong-Very Strong Interference", "comments": "5 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the 3-user Gaussian interference channel and provide an outer\nbound on its capacity region. Under some conditions, which we call the mixed\nstrong-very strong interference conditions, this outer bound is achievable.\nThese conditions correspond to the case where at each receiver, one transmitter\nis causing strong interference and the other is causing very strong\ninterference. Therefore, we characterize the capacity region of the 3-user\ninterference channel with mixed strong-very strong interference.\n", "versions": [{"version": "v1", "created": "Sat, 23 Oct 2010 20:51:53 GMT"}], "update_date": "2010-10-26", "authors_parsed": [["Chaaban", "Anas", ""], ["Sezgin", "Aydin", ""]]}, {"id": "1010.4920", "submitter": "Min Dong", "authors": "Mahdi Hajiaghayi, Min Dong, Ben Liang", "title": "Jointly Optimal Channel Pairing and Power Allocation for Multichannel\n  Multihop Relaying", "comments": "15 pages. IEEE Transactions on Signal Processing", "journal-ref": "IEEE Transactions on Signal Processing, vol. 59, pp.4998-5012,\n  October 2011", "doi": "10.1109/TSP.2011.2161475", "report-no": null, "categories": "cs.IT cs.NI cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of channel pairing and power allocation in a\nmultichannel multihop relay network to enhance the end-to-end data rate. Both\namplify-and-forward (AF) and decode-and-forward (DF) relaying strategies are\nconsidered. Given fixed power allocation to the channels, we show that channel\npairing over multiple hops can be decomposed into independent pairing problems\nat each relay, and a sorted-SNR channel pairing strategy is sum-rate optimal,\nwhere each relay pairs its incoming and outgoing channels by their SNR order.\nFor the joint optimization of channel pairing and power allocation under both\ntotal and individual power constraints, we show that the problem can be\ndecoupled into two subproblems solved separately. This separation principle is\nestablished by observing the equivalence between sorting SNRs and sorting\nchannel gains in the jointly optimal solution. It significantly reduces the\ncomputational complexity in finding the jointly optimal solution. It follows\nthat the channel pairing problem in joint optimization can be again decomposed\ninto independent pairing problems at each relay based on sorted channel gains.\nThe solution for optimizing power allocation for DF relaying is also provided,\nas well as an asymptotically optimal solution for AF relaying. Numerical\nresults are provided to demonstrate substantial performance gain of the jointly\noptimal solution over some suboptimal alternatives. It is also observed that\nmore gain is obtained from optimal channel pairing than optimal power\nallocation through judiciously exploiting the variation among multiple\nchannels. Impact of the variation of channel gain, the number of channels, and\nthe number of hops on the performance gain is also studied through numerical\nexamples.\n", "versions": [{"version": "v1", "created": "Sun, 24 Oct 2010 00:30:15 GMT"}, {"version": "v2", "created": "Tue, 26 Oct 2010 21:11:12 GMT"}, {"version": "v3", "created": "Sun, 19 Dec 2010 20:41:09 GMT"}, {"version": "v4", "created": "Fri, 11 Dec 2015 08:54:44 GMT"}], "update_date": "2015-12-14", "authors_parsed": [["Hajiaghayi", "Mahdi", ""], ["Dong", "Min", ""], ["Liang", "Ben", ""]]}, {"id": "1010.4965", "submitter": "Atsumi Ohara", "authors": "Atsumi Ohara, Hiroshi Matsuzoe and Shun-ichi Amari", "title": "Dually flat structure with escort probability and its application to\n  alpha-Voronoi diagrams", "comments": "Several results in this paper can be found in the conference paper\n  [36] without complete proofs", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.stat-mech cs.IT math.DG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies geometrical structure of the manifold of escort\nprobability distributions and shows its new applicability to information\nscience. In order to realize escort probabilities we use a conformal\ntransformation that flattens so-called alpha-geometry of the space of discrete\nprobability distributions, which well characterizes nonadditive statistics on\nthe space. As a result escort probabilities are proved to be flat coordinates\nof the usual probabilities for the derived dually flat structure. Finally, we\ndemonstrate that escort probabilities with the new structure admits a simple\nalgorithm to compute Voronoi diagrams and centroids with respect to\nalpha-divergences.\n", "versions": [{"version": "v1", "created": "Sun, 24 Oct 2010 14:26:56 GMT"}], "update_date": "2010-10-26", "authors_parsed": [["Ohara", "Atsumi", ""], ["Matsuzoe", "Hiroshi", ""], ["Amari", "Shun-ichi", ""]]}, {"id": "1010.4980", "submitter": "Meng Zeng", "authors": "Meng Zeng, Rui Zhang, and Shuguang Cui", "title": "On Design of Collaborative Beamforming for Two-Way Relay Networks", "comments": "new version of the previously posted, single column double spacing,\n  24 pages", "journal-ref": null, "doi": "10.1109/TSP.2011.2107906", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a two-way relay network, where two source nodes, S1 and S2,\nexchange information through a cluster of relay nodes. The relay nodes receive\nthe sum signal from S1 and S2 in the first time slot. In the second time slot,\neach relay node multiplies its received signal by a complex coefficient and\nretransmits the signal to the two source nodes, which leads to a collaborative\ntwo-way beamforming system. By applying the principle of analog network coding,\neach receiver at S1 and S2 cancels the \"self-interference\" in the received\nsignal from the relay cluster and decodes the message. This paper studies the\n2-dimensional achievable rate region for such a two-way relay network with\ncollaborative beamforming. With different assumptions of channel reciprocity\nbetween the source-relay and relay-source channels, the achievable rate region\nis characterized under two setups. First, with reciprocal channels, we\ninvestigate the achievable rate regions when the relay cluster is subject to a\nsum-power constraint or individual-power constraints. We show that the optimal\nbeamforming vectors obtained from solving the weighted sum inverse-SNR\nminimization (WSISMin) problems are sufficient to characterize the\ncorresponding achievable rate region. Furthermore, we derive the closed form\nsolutions for those optimal beamforming vectors and consequently propose the\npartially distributed algorithms to implement the optimal beamforming, where\neach relay node only needs the local channel information and one global\nparameter. Second, with the non-reciprocal channels, the achievable rate\nregions are also characterized for both the sum-power constraint case and the\nindividual-power constraint case. Although no closed-form solutions are\navailable under this setup, we present efficient numerical algorithms.\n", "versions": [{"version": "v1", "created": "Sun, 24 Oct 2010 16:51:52 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Zeng", "Meng", ""], ["Zhang", "Rui", ""], ["Cui", "Shuguang", ""]]}, {"id": "1010.5092", "submitter": "Olivier Rivoire", "authors": "Olivier Rivoire, Stanislas Leibler", "title": "The Value of Information for Populations in Varying Environments", "comments": null, "journal-ref": null, "doi": "10.1007/s10955-011-0166-2", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The notion of information pervades informal descriptions of biological\nsystems, but formal treatments face the problem of defining a quantitative\nmeasure of information rooted in a concept of fitness, which is itself an\nelusive notion. Here, we present a model of population dynamics where this\nproblem is amenable to a mathematical analysis. In the limit where any\ninformation about future environmental variations is common to the members of\nthe population, our model is equivalent to known models of financial\ninvestment. In this case, the population can be interpreted as a portfolio of\nfinancial assets and previous analyses have shown that a key quantity of\nShannon's communication theory, the mutual information, sets a fundamental\nlimit on the value of information. We show that this bound can be violated when\naccounting for features that are irrelevant in finance but inherent to\nbiological systems, such as the stochasticity present at the individual level.\nThis leads us to generalize the measures of uncertainty and information usually\nencountered in information theory.\n", "versions": [{"version": "v1", "created": "Mon, 25 Oct 2010 11:20:36 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Rivoire", "Olivier", ""], ["Leibler", "Stanislas", ""]]}, {"id": "1010.5141", "submitter": "Sundeep Rangan", "authors": "Sundeep Rangan", "title": "Generalized Approximate Message Passing for Estimation with Random\n  Linear Mixing", "comments": "22 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the estimation of an i.i.d.\\ random vector observed through a\nlinear transform followed by a componentwise, probabilistic (possibly\nnonlinear) measurement channel. A novel algorithm, called generalized\napproximate message passing (GAMP), is presented that provides computationally\nefficient approximate implementations of max-sum and sum-problem loopy belief\npropagation for such problems. The algorithm extends earlier approximate\nmessage passing methods to incorporate arbitrary distributions on both the\ninput and output of the transform and can be applied to a wide range of\nproblems in nonlinear compressed sensing and learning.\n  Extending an analysis by Bayati and Montanari, we argue that the asymptotic\ncomponentwise behavior of the GAMP method under large, i.i.d. Gaussian\ntransforms is described by a simple set of state evolution (SE) equations. From\nthe SE equations, one can \\emph{exactly} predict the asymptotic value of\nvirtually any componentwise performance metric including mean-squared error or\ndetection accuracy. Moreover, the analysis is valid for arbitrary input and\noutput distributions, even when the corresponding optimization problems are\nnon-convex. The results match predictions by Guo and Wang for relaxed belief\npropagation on large sparse matrices and, in certain instances, also agree with\nthe optimal performance predicted by the replica method. The GAMP methodology\nthus provides a computationally efficient methodology, applicable to a large\nclass of non-Gaussian estimation problems with precise asymptotic performance\nguarantees.\n", "versions": [{"version": "v1", "created": "Mon, 25 Oct 2010 14:24:48 GMT"}, {"version": "v2", "created": "Mon, 13 Aug 2012 21:46:45 GMT"}], "update_date": "2012-08-15", "authors_parsed": [["Rangan", "Sundeep", ""]]}, {"id": "1010.5163", "submitter": "Dusan Jakovetic", "authors": "Dragana Bajovic, Dusan Jakovetic, Joao Xavier, Bruno Sinopoli, Jose M.\n  F. Moura", "title": "Distributed Detection over Time Varying Networks: Large Deviations\n  Analysis", "comments": "8 pages, in 48th Allerton Conference on Communication, Control, and\n  Computing, Oct. 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply large deviations theory to study asymptotic performance of running\nconsensus distributed detection in sensor networks. Running consensus is a\nstochastic approximation type algorithm, recently proposed. At each time step\nk, the state at each sensor is updated by a local averaging of the sensor's own\nstate and the states of its neighbors (consensus) and by accounting for the new\nobservations (innovation). We assume Gaussian, spatially correlated\nobservations. We allow the underlying network be time varying, provided that\nthe graph that collects the union of links that are online at least once over a\nfinite time window is connected. This paper shows through large deviations\nthat, under stated assumptions on the network connectivity and sensors'\nobservations, the running consensus detection asymptotically approaches in\nperformance the optimal centralized detection. That is, the Bayes probability\nof detection error (with the running consensus detector) decays exponentially\nto zero as k goes to infinity at the Chernoff information rate-the best\nachievable rate of the asymptotically optimal centralized detector.\n", "versions": [{"version": "v1", "created": "Mon, 25 Oct 2010 15:25:32 GMT"}], "update_date": "2010-10-26", "authors_parsed": [["Bajovic", "Dragana", ""], ["Jakovetic", "Dusan", ""], ["Xavier", "Joao", ""], ["Sinopoli", "Bruno", ""], ["Moura", "Jose M. F.", ""]]}, {"id": "1010.5278", "submitter": "Christian Koller", "authors": "Christian Koller, Alexandre Graell i Amat, Joerg Kliewer, Francesca\n  Vatta, Kamil S. Zigangirov, and Daniel J. Costello Jr", "title": "Analysis and Design of Tuned Turbo Codes", "comments": "Accepted for publication in IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2012.2195711", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has been widely observed that there exists a fundamental trade-off between\nthe minimum (Hamming) distance properties and the iterative decoding\nconvergence behavior of turbo-like codes. While capacity achieving code\nensembles typically are asymptotically bad in the sense that their minimum\ndistance does not grow linearly with block length, and they therefore exhibit\nan error floor at moderate-to-high signal to noise ratios, asymptotically good\ncodes usually converge further away from channel capacity. In this paper, we\nintroduce the concept of tuned turbo codes, a family of asymptotically good\nhybrid concatenated code ensembles, where asymptotic minimum distance growth\nrates, convergence thresholds, and code rates can be traded-off using two\ntuning parameters, {\\lambda} and {\\mu}. By decreasing {\\lambda}, the asymptotic\nminimum distance growth rate is reduced in exchange for improved iterative\ndecoding convergence behavior, while increasing {\\lambda} raises the asymptotic\nminimum distance growth rate at the expense of worse convergence behavior, and\nthus the code performance can be tuned to fit the desired application. By\ndecreasing {\\mu}, a similar tuning behavior can be achieved for higher rate\ncode ensembles.\n", "versions": [{"version": "v1", "created": "Mon, 25 Oct 2010 22:39:09 GMT"}, {"version": "v2", "created": "Wed, 11 Apr 2012 15:25:51 GMT"}], "update_date": "2012-05-10", "authors_parsed": [["Koller", "Christian", ""], ["Amat", "Alexandre Graell i", ""], ["Kliewer", "Joerg", ""], ["Vatta", "Francesca", ""], ["Zigangirov", "Kamil S.", ""], ["Costello", "Daniel J.", "Jr"]]}, {"id": "1010.5291", "submitter": "Wenping Ma", "authors": "Wenping Ma and Shaohui Sun", "title": "New Class of Optimal Frequency-Hopping Sequences by Polynomial Residue\n  Class Rings", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper, using the theory of polynomial residue class rings, a new\nconstruction is proposed for frequency hopping patterns having optimal Hamming\nautocorrelation with respect to the well-known $Lempel$-$Greenberger$ bound.\nBased on the proposed construction, many new $Peng$-$Fan$ optimal families of\nfrequency hopping sequences are obtained. The parameters of these sets of\nfrequency hopping sequences are new and flexible.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 00:44:54 GMT"}], "update_date": "2010-10-27", "authors_parsed": [["Ma", "Wenping", ""], ["Sun", "Shaohui", ""]]}, {"id": "1010.5382", "submitter": "Amos Lapidoth", "authors": "Shahab Asoodeh, Amos Lapidoth, and Ligong Wang", "title": "It takes half the energy of a photon to send one bit reliably on the\n  Poisson channel with feedback", "comments": "A slightly extended version of a paper that appeared in the\n  Proceedings of the Sixth Joint Workshop on Coding and Communications (JWCC),\n  Relais San Maurizio, Santo Stefano Belbo, Italy, October 17-19, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the transmission of a single bit over the continuous-time Poisson\nchannel with noiseless feedback. We show that to send the bit reliably\nrequires, on the average, half the energy of a photon. In the absence of\npeak-power constraints this holds irrespective of the intensity of the dark\ncurrent. We also solve for the energy required to send $log_{2} M$ bits.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 12:50:53 GMT"}], "update_date": "2010-10-27", "authors_parsed": [["Asoodeh", "Shahab", ""], ["Lapidoth", "Amos", ""], ["Wang", "Ligong", ""]]}, {"id": "1010.5388", "submitter": "Alberto Vigato", "authors": "Gianfranco Cariolaro and Alberto Vigato", "title": "Helstrom's Theory on Quantum Binary Decision Revisited", "comments": "5 pages, 0 figures, submitted to conference ISIT2011", "journal-ref": null, "doi": null, "report-no": "1569374959", "categories": "cs.IT math.IT quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a binary system specified by the density operators r0 and r1 and by the\nprior probabilities q0 and q1, Helstrom's theory permits the evaluation of the\noptimal measurement operators and of the corresponding maximum correct\ndetection probability. The theory is based on the eigendecomposition (EID) of\nthe operator, given by the difference of the weighted density operators, namely\nD = q1r1-q0r0. In general, this EID is obtained explicitly only with pure\nstates, whereas with mixed states it must be carried out numerically. In this\nletter we show that the same evaluation can be performed on the basis of a\nmodified version of the Gram matrix. The advantage is due to the fact that the\nouter products of density operators are replaced by inner product, with a\nconsiderable dimensionality reduction. At the limit, in quantum optical\ncommunications the density operators have infinite dimensions, whereas the\ninner products are simply scalar quantities. The Gram matrix approach permits\nthe explicit (not numerical) evaluation of a binary system performance in cases\nnot previously developed.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 13:15:16 GMT"}], "update_date": "2010-10-27", "authors_parsed": [["Cariolaro", "Gianfranco", ""], ["Vigato", "Alberto", ""]]}, {"id": "1010.5416", "submitter": "Rajesh Ramachandran", "authors": "R. Rajesh, Vinod Sharma and Pramod Viswanath", "title": "Capacity of Fading Gaussian Channel with an Energy Harvesting Sensor\n  Node", "comments": "6 Pages, To be presented at IEEE GLOBECOM 2011", "journal-ref": null, "doi": "10.1109/GLOCOM.2011.6133901", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network life time maximization is becoming an important design goal in\nwireless sensor networks. Energy harvesting has recently become a preferred\nchoice for achieving this goal as it provides near perpetual operation. We\nstudy such a sensor node with an energy harvesting source and compare various\narchitectures by which the harvested energy is used. We find its Shannon\ncapacity when it is transmitting its observations over a fading AWGN channel\nwith perfect/no channel state information provided at the transmitter. We\nobtain an achievable rate when there are inefficiencies in energy storage and\nthe capacity when energy is spent in activities other than transmission.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 14:35:32 GMT"}, {"version": "v2", "created": "Thu, 3 Nov 2011 18:15:14 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Rajesh", "R.", ""], ["Sharma", "Vinod", ""], ["Viswanath", "Pramod", ""]]}, {"id": "1010.5497", "submitter": "Guanfeng Liang", "authors": "Guanfeng Liang and Nitin Vaidya", "title": "Multiparty Equality Function Computation in Networks with Point-to-Point\n  Links", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DC math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this report, we study the multiparty communication complexity problem of\nthe multiparty equality function (MEQ): EQ(x_1,...,x_n) = 1 if x_1=...=x_n, and\n0 otherwise. The input vector (x_1,...,x_n) is distributed among n>=2 nodes,\nwith x_i known to node i, where x_i is chosen from the set {1,...,M}, for some\ninteger M>0.\n  Instead of the \"number on the forehand\" model, we consider a point-to-point\ncommunication model (similar to the message passing model), which we believe is\nmore realistic in networking settings. We assume a synchronous fully connected\nnetwork of n nodes, the node IDs (identifiers) are common knowledge. We assume\nthat all point-to-point communication channels/links are private such that when\na node transmits, only the designated recipient can receive the message. The\nidentity of the sender is known to the recipient.\n  We demonstrate that traditional techniques generalized from two-party\ncommunication complexity problem are not sufficient to obtain tight bounds\nunder the point-to-point communication model. We then introduce techniques\nwhich significantly reduce the space of protocols to study. These techniques\nare used to study some instances of the MEQ problem.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 19:47:12 GMT"}], "update_date": "2010-10-27", "authors_parsed": [["Liang", "Guanfeng", ""], ["Vaidya", "Nitin", ""]]}, {"id": "1010.5506", "submitter": "Ching-Yi Lai", "authors": "Ching-Yi Lai, Todd A. Brun, and Mark M. Wilde", "title": "Dualities and Identities for Entanglement-Assisted Quantum Codes", "comments": "24 pages, 3 figures, to be published in Quantum Information\n  Processing. A new section about EA hashing bound is included in the new\n  version", "journal-ref": "Quantum Information Processing, vol. 13, no. 4, pages 957-990\n  (April 2014)", "doi": "10.1007/s11128-013-0704-8", "report-no": null, "categories": "quant-ph cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dual of an entanglement-assisted quantum error-correcting (EAQEC) code is\nthe code resulting from exchanging the original code's information qubits with\nits ebits. To introduce this notion, we show how entanglement-assisted (EA)\nrepetition codes and accumulator codes are dual to each other, much like their\nclassical counterparts, and we give an explicit, general quantum shift-register\ncircuit that encodes both classes of codes.We later show that our constructions\nare optimal, and this result completes our understanding of these dual classes\nof codes. We also establish the Gilbert-Varshamov bound and the Plotkin bound\nfor EAQEC codes, and we use these to examine the existence of some EAQEC codes.\nFinally, we provide upper bounds on the block error probability when\ntransmitting maximal-entanglement EAQEC codes over the depolarizing channel,\nand we derive variations of the hashing bound for EAQEC codes, which is a lower\nbound on the maximum rate at which reliable communication over Pauli channels\nis possible with the use of pre-shared entanglement.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 20:05:08 GMT"}, {"version": "v2", "created": "Fri, 21 Jan 2011 07:18:40 GMT"}, {"version": "v3", "created": "Sun, 9 Jun 2013 07:20:13 GMT"}, {"version": "v4", "created": "Tue, 19 Nov 2013 14:32:18 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Lai", "Ching-Yi", ""], ["Brun", "Todd A.", ""], ["Wilde", "Mark M.", ""]]}, {"id": "1010.5524", "submitter": "Amine Mezghani", "authors": "Amine Mezghani and Josef A. Nossek", "title": "Analysis of 1-bit Output Noncoherent Fading Channels in the Low SNR\n  Regime", "comments": "6 pages, 3 figures, 2009 IEEE International Symposium on Information\n  Theory, ISIT 2009, Seoul, Korea", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider general multi-antenna fading channels with coarsely quantized\noutputs, where the channel is unknown to the transmitter and receiver. This\nanalysis is of interest in the context of sensor network communication where\nlow power and low cost are key requirements (e.g. standard IEEE 802.15.4\napplications). This is also motivated by highly energy constrained\ncommunications devices where sampling the signal may be more energy consuming\nthan processing or transmitting it. Therefore the analog-to-digital converters\n(ADCs) for such applications should be low-resolution, in order to reduce their\ncost and power consumption. In this paper, we consider the extreme case of only\n1-bit ADC for each receive signal component. We derive asymptotics of the\nmutual information up to the second order in the signal-to-noise ratio (SNR)\nunder average and peak power constraints and study the impact of quantization.\nWe show that up to second order in SNR, the mutual information of a system with\ntwo-level (sign) output signals incorporates only a power penalty factor of\nalmost 1.96 dB compared to the system with infinite resolution for all channels\nof practical interest. This generalizes a recent result for the coherent case.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 21:19:27 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Mezghani", "Amine", ""], ["Nossek", "Josef A.", ""]]}, {"id": "1010.5526", "submitter": "Amine Mezghani", "authors": "Amine Mezghani, Michel T. Ivrlac and Josef A. Nossek", "title": "Achieving near-Capacity on Large Discrete Memoryless Channels", "comments": "6 pages, 4 figures, 2008 International Symposium on Information\n  Theory and its Applications (ISITA2008), Auckland, New Zealand", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a method to increase the capacity achieved by uniform prior in\ndiscrete memoryless channels (DMC) with high input cardinality. It consists in\nappropriately reducing the input set. Different design criteria of the input\nsubset are discussed. We develop an efficient algorithm to solve this problem\nbased on the maximization of the cut-off rate. The method is applied to a\nmono-bit transceiver MIMO system, and it is shown that the capacity can be\napproached within tenths of a dB by employing standard binary codes while\navoiding the use of distribution shapers.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 21:39:16 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Mezghani", "Amine", ""], ["Ivrlac", "Michel T.", ""], ["Nossek", "Josef A.", ""]]}, {"id": "1010.5529", "submitter": "Amine Mezghani", "authors": "Amine Mezghani and Josef A. Nossek", "title": "Belief Propagation based MIMO Detection Operating on Quantized Channel\n  Output", "comments": "6 pages, 4 figure, 2010 IEEE International Symposium on Information\n  Theory (ISIT 2010), Austin, Texas", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In multiple-antenna communications, as bandwidth and modulation order\nincrease, system components must work with demanding tolerances. In particular,\nhigh resolution and high sampling rate analog-to-digital converters (ADCs) are\noften prohibitively challenging to design. Therefore ADCs for such applications\nshould be low-resolution. This paper provides new insights into the problem of\noptimal signal detection based on quantized received signals for multiple-input\nmultiple-output (MIMO) channels. It capitalizes on previous works which\nextensively analyzed the unquantized linear vector channel using graphical\ninference methods. In particular, a \"loopy\" belief propagation-like (BP) MIMO\ndetection algorithm, operating on quantized data with low complexity, is\nproposed. In addition, we study the impact of finite receiver resolution in\nfading channels in the large-system limit by means of a state evolution\nanalysis of the BP algorithm, which refers to the limit where the number of\ntransmit and receive antennas go to infinity with a fixed ratio. Simulations\nshow that the theoretical findings might give accurate results even with\nmoderate number of antennas.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 21:58:23 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Mezghani", "Amine", ""], ["Nossek", "Josef A.", ""]]}, {"id": "1010.5532", "submitter": "Amine Mezghani", "authors": "Amine Mezghani, Felix Antreich and Josef A. Nossek", "title": "Multiple Parameter Estimation With Quantized Channel Output", "comments": "9 pages, 9 figures, International ITG Workshop on Smart Antennas -\n  WSA 2010, Bremen, Germany", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a general problem formulation for optimal parameter estimation\nbased on quantized observations, with application to antenna array\ncommunication and processing (channel estimation, time-of-arrival (TOA) and\ndirection-of-arrival (DOA) estimation). The work is of interest in the case\nwhen low resolution A/D-converters (ADCs) have to be used to enable higher\nsampling rate and to simplify the hardware. An Expectation-Maximization (EM)\nbased algorithm is proposed for solving this problem in a general setting.\nBesides, we derive the Cramer-Rao Bound (CRB) and discuss the effects of\nquantization and the optimal choice of the ADC characteristic. Numerical and\nanalytical analysis reveals that reliable estimation may still be possible even\nwhen the quantization is very coarse.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 22:31:44 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Mezghani", "Amine", ""], ["Antreich", "Felix", ""], ["Nossek", "Josef A.", ""]]}, {"id": "1010.5537", "submitter": "Andriy Miranskyy", "authors": "A. V. Miranskyy, M. Davison, M. Reesor, S. S. Murtaza", "title": "Using entropy measures for comparison of software traces", "comments": "Extended version appears in Information Sciences", "journal-ref": "Information Sciences 203 (2012) pp. 59-72", "doi": "10.1016/j.ins.2012.03.017", "report-no": null, "categories": "cs.SE cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The analysis of execution paths (also known as software traces) collected\nfrom a given software product can help in a number of areas including software\ntesting, software maintenance and program comprehension. The lack of a scalable\nmatching algorithm operating on detailed execution paths motivates the search\nfor an alternative solution.\n  This paper proposes the use of word entropies for the classification of\nsoftware traces. Using a well-studied defective software as an example, we\ninvestigate the application of both Shannon and extended entropies\n(Landsberg-Vedral, R\\'{e}nyi and Tsallis) to the classification of traces\nrelated to various software defects. Our study shows that using entropy\nmeasures for comparisons gives an efficient and scalable method for comparing\ntraces. The three extended entropies, with parameters chosen to emphasize rare\nevents, all perform similarly and are superior to the Shannon entropy.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 23:24:02 GMT"}, {"version": "v2", "created": "Wed, 25 Apr 2012 20:06:50 GMT"}], "update_date": "2012-05-14", "authors_parsed": [["Miranskyy", "A. V.", ""], ["Davison", "M.", ""], ["Reesor", "M.", ""], ["Murtaza", "S. S.", ""]]}, {"id": "1010.5545", "submitter": "James P. Crutchfield", "authors": "Ryan G. James and John R. Mahoney and Christopher J. Ellison and James\n  P. Crutchfield", "title": "Many Roads to Synchrony: Natural Time Scales and Their Algorithms", "comments": "17 pages, 16 figures:\n  http://cse.ucdavis.edu/~cmg/compmech/pubs/kro.htm. Santa Fe Institute Working\n  Paper 10-11-025", "journal-ref": "Phys. Rev. E 89, 042135 (2014)", "doi": "10.1103/PhysRevE.89.042135", "report-no": null, "categories": "nlin.CD cs.FL cs.IT math.DS math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider two important time scales---the Markov and cryptic orders---that\nmonitor how an observer synchronizes to a finitary stochastic process. We show\nhow to compute these orders exactly and that they are most efficiently\ncalculated from the epsilon-machine, a process's minimal unifilar model.\nSurprisingly, though the Markov order is a basic concept from stochastic\nprocess theory, it is not a probabilistic property of a process. Rather, it is\na topological property and, moreover, it is not computable from any\nfinite-state model other than the epsilon-machine. Via an exhaustive survey, we\nclose by demonstrating that infinite Markov and infinite cryptic orders are a\ndominant feature in the space of finite-memory processes. We draw out the roles\nplayed in statistical mechanical spin systems by these two complementary length\nscales.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 00:55:18 GMT"}, {"version": "v2", "created": "Fri, 20 Dec 2013 23:00:48 GMT"}], "update_date": "2014-04-23", "authors_parsed": [["James", "Ryan G.", ""], ["Mahoney", "John R.", ""], ["Ellison", "Christopher J.", ""], ["Crutchfield", "James P.", ""]]}, {"id": "1010.5608", "submitter": "Weiyu Xu", "authors": "Weiyu Xu and Ao Kevin Tang", "title": "A Generalized Coupon Collector Problem", "comments": "20 pages, 6 figures, preprint", "journal-ref": "J. Appl. Probab. 48 (2011) 1081-1094", "doi": "10.1239/jap/1324046020", "report-no": null, "categories": "cs.IT cs.DM cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper provides analysis to a generalized version of the coupon collector\nproblem, in which the collector gets $d$ distinct coupons each run and she\nchooses the one that she has the least so far. On the asymptotic case when the\nnumber of coupons $n$ goes to infinity, we show that on average $\\frac{n\\log\nn}{d} + \\frac{n}{d}(m-1)\\log\\log{n}+O(mn)$ runs are needed to collect $m$ sets\nof coupons. An efficient exact algorithm is also developed for any finite case\nto compute the average needed runs exactly. Numerical examples are provided to\nverify our theoretical predictions.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 08:56:31 GMT"}, {"version": "v2", "created": "Thu, 18 Nov 2010 21:37:26 GMT"}], "update_date": "2019-07-10", "authors_parsed": [["Xu", "Weiyu", ""], ["Tang", "Ao Kevin", ""]]}, {"id": "1010.5644", "submitter": "Camilla Hollanti", "authors": "Roope Vehkalahti, Camilla Hollanti, and Fr\\'ed\\'erique Oggier", "title": "Fast-Decodable Asymmetric Space-Time Codes from Division Algebras", "comments": "26 pages, 1 figure, submitted to IEEE Trans. Inf. Theory, October\n  2010", "journal-ref": null, "doi": "10.1109/TIT.2011.2176310", "report-no": null, "categories": "cs.IT math.IT math.RA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple-input double-output (MIDO) codes are important in the near-future\nwireless communications, where the portable end-user device is physically small\nand will typically contain at most two receive antennas. Especially tempting is\nthe 4 x 2 channel due to its immediate applicability in the digital video\nbroadcasting (DVB). Such channels optimally employ rate-two space-time (ST)\ncodes consisting of (4 x 4) matrices. Unfortunately, such codes are in general\nvery complex to decode, hence setting forth a call for constructions with\nreduced complexity.\n  Recently, some reduced complexity constructions have been proposed, but they\nhave mainly been based on different ad hoc methods and have resulted in\nisolated examples rather than in a more general class of codes. In this paper,\nit will be shown that a family of division algebra based MIDO codes will always\nresult in at least 37.5% worst-case complexity reduction, while maintaining\nfull diversity and, for the first time, the non-vanishing determinant (NVD)\nproperty. The reduction follows from the fact that, similarly to the Alamouti\ncode, the codes will be subsets of matrix rings of the Hamiltonian quaternions,\nhence allowing simplified decoding. At the moment, such reductions are among\nthe best known for rate-two MIDO codes. Several explicit constructions are\npresented and shown to have excellent performance through computer simulations.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 11:03:01 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Vehkalahti", "Roope", ""], ["Hollanti", "Camilla", ""], ["Oggier", "Frédérique", ""]]}, {"id": "1010.5661", "submitter": "Minqi Shen", "authors": "Minqi Shen, Anders H{\\o}st-Madsen", "title": "The Wideband Slope of Interference Channels: The Large Bandwidth Case", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known that minimum received energy per bit in the interference\nchannel is -1.59dB as if there were no interference. Thus, the best way to\nmitigate interference is to operate the interference channel in the low-SNR\nregime. However, when the SNR is small but non-zero, minimum energy per bit\nalone does not characterize performance. Verdu introduced the wideband slope\nS_0 to characterize the performance in this regime. We show that a wideband\nslope of S_0/S_{0,no interference}=1/2 is achievable. This result is similar to\nrecent results on degrees of freedom in the high SNR regime, and we use a type\nof interference alignment using delays to obtain the result. We also show that\nin many cases the wideband slope is upper bounded by S_0/S_{0,no\ninterference}<=1/2 for large number of users K .\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 12:03:31 GMT"}, {"version": "v2", "created": "Fri, 11 Nov 2011 22:21:56 GMT"}], "update_date": "2011-11-15", "authors_parsed": [["Shen", "Minqi", ""], ["Høst-Madsen", "Anders", ""]]}, {"id": "1010.5691", "submitter": "Chia-Shiang Tseng", "authors": "Chia-Shiang Tseng and Chang-Ching Chen and Che Lin", "title": "A Bio-Inspired Robust Adaptive Random Search Algorithm for Distributed\n  Beamforming", "comments": "6 pages, 5 figures, In proc. ICC 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A bio-inspired robust adaptive random search algorithm (BioRARSA), designed\nfor distributed beamforming for sensor and relay networks, is proposed in this\nwork. It has been shown via a systematic framework that BioRARSA converges in\nprobability and its convergence time scales linearly with the number of\ndistributed transmitters. More importantly, extensive simulation results\ndemonstrate that the proposed BioRARSA outperforms existing adaptive\ndistributed beamforming schemes by as large as 29.8% on average. This increase\nin performance results from the fact that BioRARSA can adaptively adjust its\nsampling stepsize via the \"swim\" behavior inspired by the bacterial foraging\nmechanism. Hence, the convergence time of BioRARSA is insensitive to the\ninitial sampling stepsize of the algorithm, which makes it robust against the\ndynamic nature of distributed wireless networks.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 14:02:52 GMT"}, {"version": "v2", "created": "Tue, 15 Feb 2011 08:59:58 GMT"}], "update_date": "2011-02-16", "authors_parsed": [["Tseng", "Chia-Shiang", ""], ["Chen", "Chang-Ching", ""], ["Lin", "Che", ""]]}, {"id": "1010.5720", "submitter": "Bastian Steudel", "authors": "Bastian Steudel and Nihat Ay", "title": "Information-theoretic inference of common ancestors", "comments": "18 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A directed acyclic graph (DAG) partially represents the conditional\nindependence structure among observations of a system if the local Markov\ncondition holds, that is, if every variable is independent of its\nnon-descendants given its parents. In general, there is a whole class of DAGs\nthat represents a given set of conditional independence relations. We are\ninterested in properties of this class that can be derived from observations of\na subsystem only. To this end, we prove an information theoretic inequality\nthat allows for the inference of common ancestors of observed parts in any DAG\nrepresenting some unknown larger system. More explicitly, we show that a large\namount of dependence in terms of mutual information among the observations\nimplies the existence of a common ancestor that distributes this information.\nWithin the causal interpretation of DAGs our result can be seen as a\nquantitative extension of Reichenbach's Principle of Common Cause to more than\ntwo variables. Our conclusions are valid also for non-probabilistic\nobservations such as binary strings, since we state the proof for an\naxiomatized notion of mutual information that includes the stochastic as well\nas the algorithmic version.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 15:45:13 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Steudel", "Bastian", ""], ["Ay", "Nihat", ""]]}, {"id": "1010.5734", "submitter": "Tomer Peleg", "authors": "Tomer Peleg, Yonina C. Eldar and Michael Elad", "title": "Exploiting Statistical Dependencies in Sparse Representations for Signal\n  Recovery", "comments": "18 pages, 6 figures, to appear in IEEE Trans. on Signal Processing", "journal-ref": null, "doi": "10.1109/TSP.2012.2188520", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Signal modeling lies at the core of numerous signal and image processing\napplications. A recent approach that has drawn considerable attention is sparse\nrepresentation modeling, in which the signal is assumed to be generated as a\ncombination of a few atoms from a given dictionary. In this work we consider a\nBayesian setting and go beyond the classic assumption of independence between\nthe atoms. The main goal of this paper is to introduce a statistical model that\ntakes such dependencies into account and show how this model can be used for\nsparse signal recovery. We follow the suggestion of two recent works and assume\nthat the sparsity pattern is modeled by a Boltzmann machine, a commonly used\ngraphical model. For general dependency models, exact MAP and MMSE estimation\nof the sparse representation becomes computationally complex. To simplify the\ncomputations, we propose greedy approximations of the MAP and MMSE estimators.\nWe then consider a special case in which exact MAP is feasible, by assuming\nthat the dictionary is unitary and the dependency model corresponds to a\ncertain sparse graph. Exploiting this structure, we develop an efficient\nmessage passing algorithm that recovers the underlying signal. When the model\nparameters defining the underlying graph are unknown, we suggest an algorithm\nthat learns these parameters directly from the data, leading to an iterative\nscheme for adaptive sparse signal recovery. The effectiveness of our approach\nis demonstrated on real-life signals - patches of natural images - where we\ncompare the denoising performance to that of previous recovery methods that do\nnot exploit the statistical dependencies.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 16:30:12 GMT"}, {"version": "v2", "created": "Thu, 28 Oct 2010 08:20:04 GMT"}, {"version": "v3", "created": "Tue, 13 Mar 2012 12:40:16 GMT"}, {"version": "v4", "created": "Thu, 15 Mar 2012 08:22:50 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Peleg", "Tomer", ""], ["Eldar", "Yonina C.", ""], ["Elad", "Michael", ""]]}, {"id": "1010.5764", "submitter": "Hugues Randriam", "authors": "Hugues Randriambololona", "title": "(2,1)-separating systems beyond the probabilistic bound", "comments": "Version 7 is a shortened version, so that numbering should match with\n  the journal version (to appear soon). Material on convexity and separation in\n  discrete and continuous spaces has been removed. Readers interested in this\n  material should consult version 6 instead", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.IT math.AG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Building on previous results of Xing, we give new lower bounds on the rate of\nintersecting codes over large alphabets. The proof is constructive, and uses\nalgebraic geometry, although nothing beyond the basic theory of linear systems\non curves. Then, using these new bounds within a concatenation argument, we\nconstruct binary (2,1)-separating systems of asymptotic rate exceeding the one\ngiven by the probabilistic method, which was the best lower bound available up\nto now. This answers (negatively) the question of whether this probabilistic\nbound was exact, which has remained open for more than 30 years. (By the way,\nwe also give a formulation of the separation property in terms of metric\nconvexity, which may be an inspirational source for new research problems.)\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 18:53:01 GMT"}, {"version": "v2", "created": "Fri, 29 Oct 2010 16:04:43 GMT"}, {"version": "v3", "created": "Mon, 15 Nov 2010 19:13:23 GMT"}, {"version": "v4", "created": "Tue, 21 Dec 2010 20:43:25 GMT"}, {"version": "v5", "created": "Thu, 30 Dec 2010 19:23:38 GMT"}, {"version": "v6", "created": "Wed, 6 Apr 2011 14:32:55 GMT"}, {"version": "v7", "created": "Tue, 10 Jan 2012 11:54:03 GMT"}], "update_date": "2012-01-11", "authors_parsed": [["Randriambololona", "Hugues", ""]]}, {"id": "1010.5806", "submitter": "Stefano Rini", "authors": "Stefano Rini, Daniela Tuninetti, and Natasha Devroye", "title": "Inner and Outer Bounds for the Gaussian Cognitive Interference Channel\n  and New Capacity Results", "comments": "submitted to IEEE transaction of Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2168382", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The capacity of the Gaussian cognitive interference channel, a variation of\nthe classical two-user interference channel where one of the transmitters\n(referred to as cognitive) has knowledge of both messages, is known in several\nparameter regimes but remains unknown in general. In this paper we provide a\ncomparative overview of this channel model as we proceed through our\ncontributions: we present a new outer bound based on the idea of a broadcast\nchannel with degraded message sets, and another series of outer bounds obtained\nby transforming the cognitive channel into channels with known capacity. We\nspecialize the largest known inner bound derived for the discrete memoryless\nchannel to the Gaussian noise channel and present several simplified schemes\nevaluated for Gaussian inputs in closed form which we use to prove a number of\nresults. These include a new set of capacity results for the a) \"primary\ndecodes cognitive\" regime, a subset of the \"strong interference\" regime that is\nnot included in the \"very strong interference\" regime for which capacity was\nknown, and for the b) \"S-channel\" in which the primary transmitter does not\ninterfere with the cognitive receiver. Next, for a general Gaussian cognitive\ninterference channel, we determine the capacity to within one bit/s/Hz and to\nwithin a factor two regardless of channel parameters, thus establishing rate\nperformance guarantees at high and low SNR, respectively. We also show how\ndifferent simplified transmission schemes achieve a constant gap between inner\nand outer bound for specific channels. Finally, we numerically evaluate and\ncompare the various simplified achievable rate regions and outer bounds in\nparameter regimes where capacity is unknown, leading to further insight on the\ncapacity region of the Gaussian cognitive interference channel.\n", "versions": [{"version": "v1", "created": "Wed, 27 Oct 2010 20:53:17 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Rini", "Stefano", ""], ["Tuninetti", "Daniela", ""], ["Devroye", "Natasha", ""]]}, {"id": "1010.5938", "submitter": "Han Lun Yap", "authors": "Han Lun Yap, Christopher J. Rozell", "title": "Stable Takens' Embeddings for Linear Dynamical Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.IT math.DS math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Takens' Embedding Theorem remarkably established that concatenating M\nprevious outputs of a dynamical system into a vector (called a delay coordinate\nmap) can be a one-to-one mapping of a low-dimensional attractor from the system\nstate space. However, Takens' theorem is fragile in the sense that even small\nimperfections can induce arbitrarily large errors in this attractor\nrepresentation. We extend Takens' result to establish deterministic, explicit\nand non-asymptotic sufficient conditions for a delay coordinate map to form a\nstable embedding in the restricted case of linear dynamical systems and\nobservation functions. Our work is inspired by the field of Compressive Sensing\n(CS), where results guarantee that low-dimensional signal families can be\nrobustly reconstructed if they are stably embedded by a measurement operator.\nHowever, in contrast to typical CS results, i) our sufficient conditions are\nindependent of the size of the ambient state space, and ii) some system and\nmeasurement pairs have fundamental limits on the conditioning of the embedding\n(i.e., how close it is to an isometry), meaning that further measurements\nbeyond some point add no further significant value. We use several simple\nsimulations to explore the conditions of the main results, including the\ntightness of the bounds and the convergence speed of the stable embedding. We\nalso present an example task of estimating the attractor dimension from\ntime-series data to highlight the value of stable embeddings over traditional\nTakens' embeddings.\n", "versions": [{"version": "v1", "created": "Thu, 28 Oct 2010 12:20:43 GMT"}, {"version": "v2", "created": "Fri, 1 Apr 2011 14:43:03 GMT"}, {"version": "v3", "created": "Sat, 18 Jun 2011 12:57:06 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Yap", "Han Lun", ""], ["Rozell", "Christopher J.", ""]]}, {"id": "1010.6020", "submitter": "Shrinivas Kudekar Mr.", "authors": "Shrinivas Kudekar, Henry D. Pfister", "title": "The Effect of Spatial Coupling on Compressive Sensing", "comments": "8 Pages, 7 figures. This is a slightly modified version of the paper\n  which appeared in the 48th Annual Allerton Conference on Communication,\n  Control, and Computing September 29 - October 1, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, it was observed that spatially-coupled LDPC code ensembles approach\nthe Shannon capacity for a class of binary-input memoryless symmetric (BMS)\nchannels. The fundamental reason for this was attributed to a \"threshold\nsaturation\" phenomena derived by Kudekar, Richardson and Urbanke. In\nparticular, it was shown that the belief propagation (BP) threshold of the\nspatially coupled codes is equal to the maximum a posteriori (MAP) decoding\nthreshold of the underlying constituent codes. In this sense, the BP threshold\nis saturated to its maximum value. Moreover, it has been empirically observed\nthat the same phenomena also occurs when transmitting over more general classes\nof BMS channels. In this paper, we show that the effect of spatial coupling is\nnot restricted to the realm of channel coding. The effect of coupling also\nmanifests itself in compressed sensing. Specifically, we show that\nspatially-coupled measurement matrices have an improved sparsity to sampling\nthreshold for reconstruction algorithms based on verification decoding. For\nBP-based reconstruction algorithms, this phenomenon is also tested empirically\nvia simulation. At the block lengths accessible via simulation, the effect is\nquite small and it seems that spatial coupling is not providing the gains one\nmight expect. Based on the threshold analysis, however, we believe this\nwarrants further study.\n", "versions": [{"version": "v1", "created": "Thu, 28 Oct 2010 17:14:14 GMT"}], "update_date": "2010-10-29", "authors_parsed": [["Kudekar", "Shrinivas", ""], ["Pfister", "Henry D.", ""]]}, {"id": "1010.6057", "submitter": "Raef Bassily", "authors": "Raef Bassily and Sennur Ulukus", "title": "Ergodic Secret Alignment", "comments": "Submitted to IEEE Transactions on Information Theory, October 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce two new achievable schemes for the fading\nmultiple access wiretap channel (MAC-WT). In the model that we consider, we\nassume that perfect knowledge of the state of all channels is available at all\nthe nodes in a causal fashion. Our schemes use this knowledge together with the\ntime varying nature of the channel model to align the interference from\ndifferent users at the eavesdropper perfectly in a one-dimensional space while\ncreating a higher dimensionality space for the interfering signals at the\nlegitimate receiver hence allowing for better chance of recovery. While we\nachieve this alignment through signal scaling at the transmitters in our first\nscheme (scaling based alignment (SBA)), we let nature provide this alignment\nthrough the ergodicity of the channel coefficients in the second scheme\n(ergodic secret alignment (ESA)). For each scheme, we obtain the resulting\nachievable secrecy rate region. We show that the secrecy rates achieved by both\nschemes scale with SNR as 1/2log(SNR). Hence, we show the sub-optimality of the\ni.i.d. Gaussian signaling based schemes with and without cooperative jamming by\nshowing that the secrecy rates achieved using i.i.d. Gaussian signaling with\ncooperative jamming do not scale with SNR. In addition, we introduce an\nimproved version of our ESA scheme where we incorporate cooperative jamming to\nachieve higher secrecy rates. Moreover, we derive the necessary optimality\nconditions for the power control policy that maximizes the secrecy sum rate\nachievable by our ESA scheme when used solely and with cooperative jamming.\n", "versions": [{"version": "v1", "created": "Thu, 28 Oct 2010 19:15:23 GMT"}], "update_date": "2010-10-29", "authors_parsed": [["Bassily", "Raef", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1010.6165", "submitter": "Goetz Pfander", "authors": "G\\\"otz E. Pfander", "title": "Sampling of operators", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.FA cs.IT math.CA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sampling and reconstruction of functions is a central tool in science. A key\nresult is given by the sampling theorem for bandlimited functions attributed to\nWhittaker, Shannon, Nyquist, and Kotelnikov. We develop an analogous sampling\ntheory for operators which we call bandlimited if their Kohn-Nirenberg symbols\nare bandlimited. We prove sampling theorems for such operators and show that\nthey are extensions of the classical sampling theorem.\n", "versions": [{"version": "v1", "created": "Fri, 29 Oct 2010 09:38:13 GMT"}], "update_date": "2010-11-01", "authors_parsed": [["Pfander", "Götz E.", ""]]}, {"id": "1010.6247", "submitter": "LeRoy Johnson Professor", "authors": "L. F. Johnson", "title": "Symmetry in Shannon's Noiseless Coding Theorem", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Statements of Shannon's Noiseless Coding Theorem by various authors,\nincluding the original, are reviewed and clarified. Traditional statements of\nthe theorem are often unclear as to when it applies. A new notation is\nintroduced and the domain of application is clarified. An examination of the\nbounds of the Theorem leads to a new symmetric restatement. It is shown that\nthe extended upper bound is an acheivable upper bound, giving symmetry to the\ntheorem.The relation of information entropy to the physical entropy of Gibbs\nand Boltmann is illustrated. Consequently, the study of Shannon Entropy is\nstrongly related to physics and there is a physical theory of information. This\npaper is the beginning of of an attempt to clarify these relationships.\n", "versions": [{"version": "v1", "created": "Fri, 29 Oct 2010 15:25:33 GMT"}], "update_date": "2010-11-01", "authors_parsed": [["Johnson", "L. F.", ""]]}, {"id": "1010.6255", "submitter": "Anas Chaaban", "authors": "Anas Chaaban and Aydin Sezgin", "title": "On the Capacity of the 2-user Gaussian MAC Interfering with a P2P Link", "comments": "6 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A multiple access channel and a point-to-point channel sharing the same\nmedium for communications are considered. We obtain an outer bound for the\ncapacity region of this setup, and we show that this outer bound is achievable\nin some cases. These cases are mainly when interference is strong or very\nstrong. A sum capacity upper bound is also obtained, which is nearly tight if\nthe interference power at the receivers is low. In this case, using Gaussian\ncodes and treating interference as noise achieves a sum rate close to the upper\nbound.\n", "versions": [{"version": "v1", "created": "Fri, 29 Oct 2010 15:48:32 GMT"}], "update_date": "2010-11-01", "authors_parsed": [["Chaaban", "Anas", ""], ["Sezgin", "Aydin", ""]]}, {"id": "1010.6280", "submitter": "Kaya Tutuncuoglu", "authors": "Kaya Tutuncuoglu and Aylin Yener", "title": "Optimum Transmission Policies for Battery Limited Energy Harvesting\n  Nodes", "comments": "Submitted to IEEE Transactions on Wireless Communications, September\n  2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless networks with energy harvesting battery powered nodes are quickly\nemerging as a viable option for future wireless networks with extended\nlifetime. Equally important to their counterpart in the design of energy\nharvesting radios are the design principles that this new networking paradigm\ncalls for. In particular, unlike wireless networks considered up to date, the\nenergy replenishment process and the storage constraints of the rechargeable\nbatteries need to be taken into account in designing efficient transmission\nstrategies. In this work, we consider such transmission policies for\nrechargeable nodes, and identify the optimum solution for two related problems.\nSpecifically, the transmission policy that maximizes the short term throughput,\ni.e., the amount of data transmitted in a finite time horizon is found. In\naddition, we show the relation of this optimization problem to another, namely,\nthe minimization of the transmission completion time for a given amount of\ndata, and solve that as well. The transmission policies are identified under\nthe constraints on energy causality, i.e., energy replenishment process, as\nwell as the energy storage, i.e., battery capacity. The power-rate relationship\nfor this problem is assumed to be an increasing concave function, as dictated\nby information theory. For battery replenishment, a model with discrete packets\nof energy arrivals is considered. We derive the necessary conditions that the\nthroughput-optimal allocation satisfies, and then provide the algorithm that\nfinds the optimal transmission policy with respect to the short-term throughput\nand the minimum transmission completion time. Numerical results are presented\nto confirm the analytical findings.\n", "versions": [{"version": "v1", "created": "Fri, 29 Oct 2010 17:24:52 GMT"}, {"version": "v2", "created": "Wed, 8 Jun 2011 00:16:24 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Tutuncuoglu", "Kaya", ""], ["Yener", "Aylin", ""]]}, {"id": "1010.6290", "submitter": "Ye Tian", "authors": "Ye Tian and Aylin Yener", "title": "Symmetric Capacity of the Gaussian Interference Channel with an\n  Out-of-Band Relay to within 1.15 Bits", "comments": "IEEE Transactions on Information Theory, accepted March 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work studies the Gaussian interference channel (IC) with a relay, which\ntransmits and receives in a band that is orthogonal to the IC. The channel\nassociated with the relay is thus an out-of-band relay channel (OBRC). The\nfocus is on a symmetric channel model, in order to assess the fundamental\nimpact of the OBRC on the signal interaction of the IC, in the simplest\npossible setting. First, the linear deterministic model is investigated and the\nsum capacity of this channel is established for all possible channel\nparameters. In particular, it is observed that the impact of OBRC, as its links\nget stronger, is similar to that of output feedback for the IC. The insights\nobtained from the deterministic model are then used to design achievable\nschemes for the Gaussian model. The interference links are classified as\nextremely strong, very strong, strong, moderate, weak, and very weak. For\nstrong and moderate interference, separate encoding is near optimal. For very\nstrong and extremely strong interference, the interference links provide side\ninformation to the destinations, which can help the transmission through the\nOBRC. For weak or very weak interference, an extension of the Han-Kobayashi\nscheme for the IC is utilized, where the messages are split into common and\nprivate. To achieve higher rates, it is beneficial to further split the common\nmessage into two parts, and the OBRC plays an important role in decoding the\ncommon message. It is shown that our strategy achieves the symmetric capacity\nto within 1.14625 bits per channel use with duplexing factor 0.5, and 1.27125\nbits per channel use for arbitrary duplexing factors, for all channel\nparameters. An important observation from the constant gap result is that\nstrong interference can be beneficial with the presence of an OBR.\n", "versions": [{"version": "v1", "created": "Fri, 29 Oct 2010 18:39:04 GMT"}, {"version": "v2", "created": "Wed, 21 Mar 2012 01:31:05 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Tian", "Ye", ""], ["Yener", "Aylin", ""]]}]