[{"id": "0710.0736", "submitter": "Alessandro Tomasi", "authors": "David A Kay (Oxford University Computational Laboratory), Alessandro\n  Tomasi (University of Sussex)", "title": "Colour image segmentation by the vector-valued Allen-Cahn phase-field\n  model: a multigrid solution", "comments": "17 pages, 9 figures", "journal-ref": "IEEE Trans. Im. Proc. 18.10 (2009)", "doi": "10.1109/TIP.2009.2026678", "report-no": null, "categories": "cs.CV cs.NA", "license": null, "abstract": "  We propose a new method for the numerical solution of a PDE-driven model for\ncolour image segmentation and give numerical examples of the results. The\nmethod combines the vector-valued Allen-Cahn phase field equation with initial\ndata fitting terms. This method is known to be closely related to the\nMumford-Shah problem and the level set segmentation by Chan and Vese. Our\nnumerical solution is performed using a multigrid splitting of a finite element\nspace, thereby producing an efficient and robust method for the segmentation of\nlarge images.\n", "versions": [{"version": "v1", "created": "Wed, 3 Oct 2007 08:51:44 GMT"}], "update_date": "2018-06-08", "authors_parsed": [["Kay", "David A", "", "Oxford University Computational Laboratory"], ["Tomasi", "Alessandro", "", "University of Sussex"]]}, {"id": "0710.3170", "submitter": "Louis Yu Lu", "authors": "Louis Yu Lu", "title": "Fast Intrinsic Mode Decomposition of Time Series Data with Sawtooth\n  Transform", "comments": "Add details to extend the sawtooth function for boundary points\n  calculation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": null, "abstract": "  An efficient method is introduced in this paper to find the intrinsic mode\nfunction (IMF) components of time series data. This method is faster and more\npredictable than the Empirical Mode Decomposition (EMD) method devised by the\nauthor of Hilbert Huang Transform (HHT). The approach is to transforms the\noriginal data function into a piecewise linear sawtooth function (or triangle\nwave function), then directly constructs the upper envelope by connecting the\nmaxima and construct lower envelope by connecting minima with straight line\nsegments in the sawtooth space, the IMF is calculated as the difference between\nthe sawtooth function and the mean of the upper and lower envelopes. The\nresults found in the sawtooth space are reversely transformed into the original\ndata space as the required IMF and envelopes mean. This decomposition method\nprocess the data in one pass to obtain a unique IMF component without the time\nconsuming repetitive sifting process of EMD method. An alternative\ndecomposition method with sawtooth function expansion is also presented.\n", "versions": [{"version": "v1", "created": "Tue, 16 Oct 2007 20:19:27 GMT"}, {"version": "v2", "created": "Wed, 14 Nov 2007 15:58:10 GMT"}], "update_date": "2007-11-14", "authors_parsed": [["Lu", "Louis Yu", ""]]}, {"id": "0710.4486", "submitter": "Michel Fliess", "authors": "Michel Fliess (INRIA Futurs), C\\'edric Join (INRIA Futurs, CRAN),\n  Hebertt Sira-Ramirez", "title": "Non-linear estimation is easy", "comments": null, "journal-ref": "Int. J. Modelling Identification and Control 4, 1 (2008) 12-27", "doi": "10.1504/IJMIC.2008.020996", "report-no": null, "categories": "cs.CE cs.NA cs.PF math.AC math.NA math.OC", "license": null, "abstract": "  Non-linear state estimation and some related topics, like parametric\nestimation, fault diagnosis, and perturbation attenuation, are tackled here via\na new methodology in numerical differentiation. The corresponding basic system\ntheoretic definitions and properties are presented within the framework of\ndifferential algebra, which permits to handle system variables and their\nderivatives of any order. Several academic examples and their computer\nsimulations, with on-line estimations, are illustrating our viewpoint.\n", "versions": [{"version": "v1", "created": "Wed, 24 Oct 2007 14:48:39 GMT"}], "update_date": "2008-11-06", "authors_parsed": [["Fliess", "Michel", "", "INRIA Futurs"], ["Join", "Cédric", "", "INRIA Futurs, CRAN"], ["Sira-Ramirez", "Hebertt", ""]]}, {"id": "0710.4508", "submitter": "Gregorio Malajovich", "authors": "Felipe Cucker, Teresa Krick, Gregorio Malajovich and Mario Wschebor", "title": "A Numerical Algorithm for Zero Counting. I: Complexity and Accuracy", "comments": "We made minor but necessary improvements in the presentation", "journal-ref": "Journal of Complexity 24 Issues 5-6, pp 582-605 (Oct-Dec 2008)", "doi": "10.1016/j.jco.2008.03.001", "report-no": null, "categories": "cs.CC cs.NA cs.SC math.NA", "license": null, "abstract": "  We describe an algorithm to count the number of distinct real zeros of a\npolynomial (square) system f. The algorithm performs O(n D kappa(f)) iterations\nwhere n is the number of polynomials (as well as the dimension of the ambient\nspace), D is a bound on the polynomials' degree, and kappa(f) is a condition\nnumber for the system. Each iteration uses an exponential number of operations.\nThe algorithm uses finite-precision arithmetic and a polynomial bound for the\nprecision required to ensure the returned output is correct is exhibited. This\nbound is a major feature of our algorithm since it is in contrast with the\nexponential precision required by the existing (symbolic) algorithms for\ncounting real zeros. The algorithm parallelizes well in the sense that each\niteration can be computed in parallel polynomial time with an exponential\nnumber of processors.\n", "versions": [{"version": "v1", "created": "Wed, 24 Oct 2007 16:33:07 GMT"}, {"version": "v2", "created": "Wed, 19 Mar 2008 20:28:15 GMT"}], "update_date": "2010-07-12", "authors_parsed": [["Cucker", "Felipe", ""], ["Krick", "Teresa", ""], ["Malajovich", "Gregorio", ""], ["Wschebor", "Mario", ""]]}]