[{"id": "1504.01020", "submitter": "Arupratan Ray", "authors": "Arupratan Ray (1), Debmalya Mandal (2), Y. Narahari (1) ((1)\n  Department of Computer Science and Automation, Indian Institute of Science,\n  Bangalore, India, (2) Harvard School of Engineering and Applied Sciences,\n  Cambridge, MA)", "title": "Profit Maximizing Prior-free Multi-unit Procurement Auctions with\n  Capacitated Sellers", "comments": "16 pages, short version of the paper to be published in the\n  Proceedings of International Conference on Autonomous Agents and Multiagent\n  Systems 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we derive bounds for profit maximizing prior-free procurement\nauctions where a buyer wishes to procure multiple units of a homogeneous item\nfrom n sellers who are strategic about their per unit valuation. The buyer\nearns the profit by reselling these units in an external consumer market. The\npaper looks at three scenarios of increasing complexity. First, we look at unit\ncapacity sellers where per unit valuation is private information of each seller\nand the revenue curve is concave. For this setting, we define two benchmarks.\nWe show that no randomized prior free auction can be constant competitive\nagainst any of these two benchmarks. However, for a lightly constrained\nbenchmark we design a prior-free auction PEPA (Profit Extracting Procurement\nAuction) which is 4-competitive and we show this bound is tight. Second, we\nstudy a setting where the sellers have non-unit capacities that are common\nknowledge and derive similar results. In particular, we propose a prior free\nauction PEPAC (Profit Extracting Procurement Auction with Capacity) which is\ntruthful for any concave revenue curve. Third, we obtain results in the\ninherently harder bi-dimensional case where per unit valuation as well as\ncapacities are private information of the sellers. We show that PEPAC is\ntruthful and constant competitive for the specific case of linear revenue\ncurves. We believe that this paper represents the first set of results on\nsingle dimensional and bi-dimensional profit maximizing prior-free multi-unit\nprocurement auctions.\n", "versions": [{"version": "v1", "created": "Sat, 4 Apr 2015 16:48:13 GMT"}], "update_date": "2015-04-07", "authors_parsed": [["Ray", "Arupratan", ""], ["Mandal", "Debmalya", ""], ["Narahari", "Y.", ""]]}, {"id": "1504.01033", "submitter": "Zhiwei Steven Wu", "authors": "Aaron Roth, Jonathan Ullman, Zhiwei Steven Wu", "title": "Watch and Learn: Optimizing from Revealed Preferences Feedback", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Stackelberg game is played between a leader and a follower. The leader\nfirst chooses an action, then the follower plays his best response. The goal of\nthe leader is to pick the action that will maximize his payoff given the\nfollower's best response. In this paper we present an approach to solving for\nthe leader's optimal strategy in certain Stackelberg games where the follower's\nutility function (and thus the subsequent best response of the follower) is\nunknown.\n  Stackelberg games capture, for example, the following interaction between a\nproducer and a consumer. The producer chooses the prices of the goods he\nproduces, and then a consumer chooses to buy a utility maximizing bundle of\ngoods. The goal of the seller here is to set prices to maximize his\nprofit---his revenue, minus the production cost of the purchased bundle. It is\nquite natural that the seller in this example should not know the buyer's\nutility function. However, he does have access to revealed preference\nfeedback---he can set prices, and then observe the purchased bundle and his own\nprofit. We give algorithms for efficiently solving, in terms of both\ncomputational and query complexity, a broad class of Stackelberg games in which\nthe follower's utility function is unknown, using only \"revealed preference\"\naccess to it. This class includes in particular the profit maximization\nproblem, as well as the optimal tolling problem in nonatomic congestion games,\nwhen the latency functions are unknown. Surprisingly, we are able to solve\nthese problems even though the optimization problems are non-convex in the\nleader's actions.\n", "versions": [{"version": "v1", "created": "Sat, 4 Apr 2015 18:13:15 GMT"}, {"version": "v2", "created": "Wed, 18 Nov 2015 03:34:42 GMT"}], "update_date": "2015-11-19", "authors_parsed": [["Roth", "Aaron", ""], ["Ullman", "Jonathan", ""], ["Wu", "Zhiwei Steven", ""]]}, {"id": "1504.01093", "submitter": "Alon Eden", "authors": "Ilan Reuven Cohen, Alon Eden, Amos Fiat, {\\L}ukasz Je\\.z", "title": "Pricing Online Decisions: Beyond Auctions", "comments": "Appeared in the ACM-SIAM Symposium on Discrete Algorithms (SODA),\n  2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider dynamic pricing schemes in online settings where selfish agents\ngenerate online events. Previous work on online mechanisms has dealt almost\nentirely with the goal of maximizing social welfare or revenue in an auction\nsettings. This paper deals with quite general settings and minimizing social\ncosts. We show that appropriately computed posted prices allow one to achieve\nessentially the same performance as the best online algorithm. This holds in a\nwide variety of settings. Unlike online algorithms that learn about the event,\nand then make enforceable decisions, prices are posted without knowing the\nfuture events or even the current event, and are thus inherently dominant\nstrategy incentive compatible.\n  In particular we show that one can give efficient posted price mechanisms for\nmetrical task systems, some instances of the $k$-server problem, and metrical\nmatching problems. We give both deterministic and randomized algorithms. Such\nposted price mechanisms decrease the social cost dramatically over selfish\nbehavior where no decision incurs a charge. One alluring application of this is\nreducing the social cost of free parking exponentially.\n", "versions": [{"version": "v1", "created": "Sun, 5 Apr 2015 07:47:58 GMT"}], "update_date": "2015-04-07", "authors_parsed": [["Cohen", "Ilan Reuven", ""], ["Eden", "Alon", ""], ["Fiat", "Amos", ""], ["Jeż", "Łukasz", ""]]}, {"id": "1504.01557", "submitter": "No\\'emie Meunier", "authors": "Thomas Brihaye, V\\'eronique Bruy\\`ere, No\\'emie Meunier,\n  Jean-Fran\\c{c}ois Raskin", "title": "Weak Subgame Perfect Equilibria and their Application to Quantitative\n  Reachability", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study $n$-player turn-based games played on a finite directed graph. For\neach play, the players have to pay a cost that they want to minimize. Instead\nof the well-known notion of Nash equilibrium (NE), we focus on the notion of\nsubgame perfect equilibrium (SPE), a refinement of NE well-suited in the\nframework of games played on graphs. We also study natural variants of SPE,\nnamed weak (resp. very weak) SPE, where players who deviate cannot use the full\nclass of strategies but only a subclass with a finite number of (resp. a\nunique) deviation step(s).\n  Our results are threefold. Firstly, we characterize in the form of a Folk\ntheorem the set of all plays that are the outcome of a weak SPE. Secondly, for\nthe class of quantitative reachability games, we prove the existence of a\nfinite-memory SPE and provide an algorithm for computing it (only existence was\nknown with no information regarding the memory). Moreover, we show that the\nexistence of a constrained SPE, i.e. an SPE such that each player pays a cost\nless than a given constant, can be decided. The proofs rely on our Folk theorem\nfor weak SPEs (which coincide with SPEs in the case of quantitative\nreachability games) and on the decidability of MSO logic on infinite words.\nFinally with similar techniques, we provide a second general class of games for\nwhich the existence of a (constrained) weak SPE is decidable.\n", "versions": [{"version": "v1", "created": "Tue, 7 Apr 2015 11:40:31 GMT"}, {"version": "v2", "created": "Fri, 10 Apr 2015 16:05:11 GMT"}], "update_date": "2015-04-13", "authors_parsed": [["Brihaye", "Thomas", ""], ["Bruyère", "Véronique", ""], ["Meunier", "Noémie", ""], ["Raskin", "Jean-François", ""]]}, {"id": "1504.01708", "submitter": "Guillermo P\\'erez", "authors": "Paul Hunter, Guillermo A. P\\'erez, Jean-Fran\\c{c}ois Raskin", "title": "Reactive Synthesis Without Regret", "comments": "Removed some text that was redundant", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two-player zero-sum games of infinite duration and their quantitative\nversions are used in verification to model the interaction between a controller\n(Eve) and its environment (Adam). The question usually addressed is that of the\nexistence (and computability) of a strategy for Eve that can maximize her\npayoff against any strategy of Adam. In this work, we are interested in\nstrategies of Eve that minimize her regret, i.e. strategies that minimize the\ndifference between her actual payoff and the payoff she could have achieved if\nshe had known the strategy of Adam in advance. We give algorithms to compute\nthe strategies of Eve that ensure minimal regret against an adversary whose\nchoice of strategy is (i) unrestricted, (ii) limited to positional strategies,\nor (iii) limited to word strategies. We also establish relations between the\nlatter version and other problems studied in the literature.\n", "versions": [{"version": "v1", "created": "Tue, 7 Apr 2015 19:14:29 GMT"}, {"version": "v2", "created": "Mon, 4 May 2015 08:54:46 GMT"}, {"version": "v3", "created": "Tue, 15 Nov 2016 19:06:26 GMT"}, {"version": "v4", "created": "Sun, 8 Oct 2017 15:27:18 GMT"}, {"version": "v5", "created": "Mon, 19 Feb 2018 16:30:21 GMT"}], "update_date": "2018-02-20", "authors_parsed": [["Hunter", "Paul", ""], ["Pérez", "Guillermo A.", ""], ["Raskin", "Jean-François", ""]]}, {"id": "1504.01780", "submitter": "Omri Weinstein", "authors": "Noga Alon, Noam Nisan, Ran Raz, Omri Weinstein", "title": "Welfare Maximization with Limited Interaction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We continue the study of welfare maximization in unit-demand (matching)\nmarkets, in a distributed information model where agent's valuations are\nunknown to the central planner, and therefore communication is required to\ndetermine an efficient allocation. Dobzinski, Nisan and Oren (STOC'14) showed\nthat if the market size is $n$, then $r$ rounds of interaction (with\nlogarithmic bandwidth) suffice to obtain an $n^{1/(r+1)}$-approximation to the\noptimal social welfare. In particular, this implies that such markets converge\nto a stable state (constant approximation) in time logarithmic in the market\nsize.\n  We obtain the first multi-round lower bound for this setup. We show that even\nif the allowable per-round bandwidth of each agent is $n^{\\epsilon(r)}$, the\napproximation ratio of any $r$-round (randomized) protocol is no better than\n$\\Omega(n^{1/5^{r+1}})$, implying an $\\Omega(\\log \\log n)$ lower bound on the\nrate of convergence of the market to equilibrium.\n  Our construction and technique may be of interest to round-communication\ntradeoffs in the more general setting of combinatorial auctions, for which the\nonly known lower bound is for simultaneous ($r=1$) protocols [DNO14].\n", "versions": [{"version": "v1", "created": "Tue, 7 Apr 2015 23:25:16 GMT"}], "update_date": "2015-04-09", "authors_parsed": [["Alon", "Noga", ""], ["Nisan", "Noam", ""], ["Raz", "Ran", ""], ["Weinstein", "Omri", ""]]}, {"id": "1504.02052", "submitter": "George Iosifidis Mr", "authors": "Leonidas Georgiadis, George Iosifidis, Leandros Tassiulas", "title": "Exchange of Services in Networks: Competition, Cooperation, and Fairness", "comments": "to appear in ACM Sigmetrics 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exchange of services and resources in, or over, networks is attracting\nnowadays renewed interest. However, despite the broad applicability and the\nextensive study of such models, e.g., in the context of P2P networks, many\nfundamental questions regarding their properties and efficiency remain\nunanswered. We consider such a service exchange model and analyze the users'\ninteractions under three different approaches. First, we study a centrally\ndesigned service allocation policy that yields the fair total service each user\nshould receive based on the service it others to the others. Accordingly, we\nconsider a competitive market where each user determines selfishly its\nallocation policy so as to maximize the service it receives in return, and a\ncoalitional game model where users are allowed to coordinate their policies. We\nprove that there is a unique equilibrium exchange allocation for both game\ntheoretic formulations, which also coincides with the central fair service\nallocation. Furthermore, we characterize its properties in terms of the\ncoalitions that emerge and the equilibrium allocations, and analyze its\ndependency on the underlying network graph. That servicing policy is the\nnatural reference point to the various mechanisms that are currently proposed\nto incentivize user participation and improve the efficiency of such networked\nservice (or, resource) exchange markets.\n", "versions": [{"version": "v1", "created": "Wed, 8 Apr 2015 17:51:41 GMT"}], "update_date": "2015-04-09", "authors_parsed": [["Georgiadis", "Leonidas", ""], ["Iosifidis", "George", ""], ["Tassiulas", "Leandros", ""]]}, {"id": "1504.02089", "submitter": "Tomer Koren", "authors": "Elad Hazan, Tomer Koren", "title": "The Computational Power of Optimization in Online Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the fundamental problem of prediction with expert advice where\nthe experts are \"optimizable\": there is a black-box optimization oracle that\ncan be used to compute, in constant time, the leading expert in retrospect at\nany point in time. In this setting, we give a novel online algorithm that\nattains vanishing regret with respect to $N$ experts in total\n$\\widetilde{O}(\\sqrt{N})$ computation time. We also give a lower bound showing\nthat this running time cannot be improved (up to log factors) in the oracle\nmodel, thereby exhibiting a quadratic speedup as compared to the standard,\noracle-free setting where the required time for vanishing regret is\n$\\widetilde{\\Theta}(N)$. These results demonstrate an exponential gap between\nthe power of optimization in online learning and its power in statistical\nlearning: in the latter, an optimization oracle---i.e., an efficient empirical\nrisk minimizer---allows to learn a finite hypothesis class of size $N$ in time\n$O(\\log{N})$. We also study the implications of our results to learning in\nrepeated zero-sum games, in a setting where the players have access to oracles\nthat compute, in constant time, their best-response to any mixed strategy of\ntheir opponent. We show that the runtime required for approximating the minimax\nvalue of the game in this setting is $\\widetilde{\\Theta}(\\sqrt{N})$, yielding\nagain a quadratic improvement upon the oracle-free setting, where\n$\\widetilde{\\Theta}(N)$ is known to be tight.\n", "versions": [{"version": "v1", "created": "Wed, 8 Apr 2015 19:54:27 GMT"}, {"version": "v2", "created": "Fri, 17 Apr 2015 12:15:37 GMT"}, {"version": "v3", "created": "Mon, 2 Nov 2015 20:30:50 GMT"}, {"version": "v4", "created": "Wed, 27 Jan 2016 09:07:59 GMT"}], "update_date": "2016-01-28", "authors_parsed": [["Hazan", "Elad", ""], ["Koren", "Tomer", ""]]}, {"id": "1504.02395", "submitter": "Giulio Chiribella", "authors": "Giulio Chiribella and Xiao Yuan", "title": "Bridging the gap between general probabilistic theories and the\n  device-independent framework for nonlocality and contextuality", "comments": "61 pages, no figures, published version", "journal-ref": "Information and Computation, 250, 15-49 (2016)", "doi": "10.1016/j.ic.2016.02.006", "report-no": null, "categories": "quant-ph cs.CR cs.GT cs.LO math-ph math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Characterizing quantum correlations in terms of information-theoretic\nprinciples is a popular chapter of quantum foundations. Traditionally, the\nprinciples adopted for this scope have been expressed in terms of conditional\nprobability distributions, specifying the probability that a black box produces\na certain output upon receiving a certain input. This framework is known as\n\"device-independent\". Another major chapter of quantum foundations is the\ninformation-theoretic characterization of quantum theory, with its sets of\nstates and measurements, and with its allowed dynamics. The different\nframeworks adopted for this scope are known under the umbrella term \"general\nprobabilistic theories\". With only a few exceptions, the two programmes on\ncharacterizing quantum correlations and characterizing quantum theory have so\nfar proceeded on separate tracks, each one developing its own methods and its\nown agenda. This paper aims at bridging the gap, by comparing the two\nframeworks and illustrating how the two programmes can benefit each other.\n", "versions": [{"version": "v1", "created": "Thu, 9 Apr 2015 17:19:17 GMT"}, {"version": "v2", "created": "Sun, 12 Apr 2015 15:18:17 GMT"}, {"version": "v3", "created": "Thu, 30 Apr 2015 02:43:43 GMT"}, {"version": "v4", "created": "Fri, 11 Mar 2016 16:47:43 GMT"}], "update_date": "2017-04-20", "authors_parsed": [["Chiribella", "Giulio", ""], ["Yuan", "Xiao", ""]]}, {"id": "1504.02411", "submitter": "Aviad Rubinstein", "authors": "Yakov Babichenko and Christos Papadimitriou and Aviad Rubinstein", "title": "Can Almost Everybody be Almost Happy? PCP for PPAD and the\n  Inapproximability of Nash", "comments": "Revision 2 derandomizes the main reduction", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We conjecture that PPAD has a PCP-like complete problem, seeking a near\nequilibrium in which all but very few players have very little incentive to\ndeviate. We show that, if one assumes that this problem requires exponential\ntime, several open problems in this area are settled. The most important\nimplication, proved via a \"birthday repetition\" reduction, is that the n^O(log\nn) approximation scheme of [LMM03] for the Nash equilibrium of two-player games\nis essentially optimum. Two other open problems in the area are resolved once\none assumes this conjecture, establishing that certain approximate equilibria\nare PPAD-complete: Finding a relative approximation of two-player Nash\nequilibria (without the well-supported restriction of [Das13]), and an\napproximate competitive equilibrium with equal incomes [Bud11] with small\nclearing error and near-optimal Gini coefficient.\n", "versions": [{"version": "v1", "created": "Thu, 9 Apr 2015 18:23:13 GMT"}, {"version": "v2", "created": "Mon, 8 Jun 2015 18:55:30 GMT"}], "update_date": "2015-06-09", "authors_parsed": [["Babichenko", "Yakov", ""], ["Papadimitriou", "Christos", ""], ["Rubinstein", "Aviad", ""]]}, {"id": "1504.02514", "submitter": "Edward Lui", "authors": "Samantha Leung, Edward Lui, Rafael Pass", "title": "Stronger Impossibility Results for Strategy-Proof Voting with i.i.d.\n  Beliefs", "comments": "arXiv admin note: substantial text overlap with arXiv:1405.5827", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The classic Gibbard-Satterthwaite theorem says that every strategy-proof\nvoting rule with at least three possible candidates must be dictatorial. In\n\\cite{McL11}, McLennan showed that a similar impossibility result holds even if\nwe consider a weaker notion of strategy-proofness where voters believe that the\nother voters' preferences are i.i.d.~(independent and identically distributed):\nIf an anonymous voting rule (with at least three candidates) is strategy-proof\nw.r.t.~all i.i.d.~beliefs and is also Pareto efficient, then the voting rule\nmust be a random dictatorship. In this paper, we strengthen McLennan's result\nby relaxing Pareto efficiency to $\\epsilon$-Pareto efficiency where Pareto\nefficiency can be violated with probability $\\epsilon$, and we further relax\n$\\epsilon$-Pareto efficiency to a very weak notion of efficiency which we call\n$\\epsilon$-super-weak unanimity. We then show the following: If an anonymous\nvoting rule (with at least three candidates) is strategy-proof w.r.t.~all\ni.i.d.~beliefs and also satisfies $\\epsilon$-super-weak unanimity, then the\nvoting rule must be $O(\\epsilon)$-close to random dictatorship.\n", "versions": [{"version": "v1", "created": "Thu, 9 Apr 2015 22:57:26 GMT"}], "update_date": "2015-04-13", "authors_parsed": [["Leung", "Samantha", ""], ["Lui", "Edward", ""], ["Pass", "Rafael", ""]]}, {"id": "1504.02627", "submitter": "Martin Zimmermann", "authors": "Felix Klein and Martin Zimmermann", "title": "What are Strategies in Delay Games? Borel Determinacy for Games with\n  Lookahead", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate determinacy of delay games with Borel winning conditions,\ninfinite-duration two-player games in which one player may delay her moves to\nobtain a lookahead on her opponent's moves.\n  First, we prove determinacy of such games with respect to a fixed evolution\nof the lookahead. However, strategies in such games may depend on information\nabout the evolution. Thus, we introduce different notions of universal\nstrategies for both players, which are evolution-independent, and determine the\nexact amount of information a universal strategy needs about the history of a\nplay and the evolution of the lookahead to be winning. In particular, we show\nthat delay games with Borel winning conditions are determined with respect to\nuniversal strategies. Finally, we consider decidability problems, e.g., \"Does a\nplayer have a universal winning strategy for delay games with a given winning\ncondition?\", for omega-regular and omega-context-free winning conditions.\n", "versions": [{"version": "v1", "created": "Fri, 10 Apr 2015 10:05:58 GMT"}], "update_date": "2015-04-13", "authors_parsed": [["Klein", "Felix", ""], ["Zimmermann", "Martin", ""]]}, {"id": "1504.02799", "submitter": "Michael Menz", "authors": "Michael Menz, Justin Wang, Jiyang Xie", "title": "Discrete All-Pay Bidding Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In an all-pay auction, only one bidder wins but all bidders must pay the\nauctioneer. All-pay bidding games arise from attaching a similar bidding\nstructure to traditional combinatorial games to determine which player moves\nnext. In contrast to the established theory of single-pay bidding games,\noptimal play involves choosing bids from some probability distribution that\nwill guarantee a minimum probability of winning. In this manner, all-pay\nbidding games wed the underlying concepts of economic and combinatorial games.\nWe present several results on the structures of optimal strategies in these\ngames. We then give a fast algorithm for computing such strategies for a large\nclass of all-pay bidding games. The methods presented provide a framework for\nfurther development of the theory of all-pay bidding games.\n", "versions": [{"version": "v1", "created": "Fri, 3 Apr 2015 03:13:01 GMT"}, {"version": "v2", "created": "Wed, 13 May 2015 23:29:51 GMT"}], "update_date": "2015-05-15", "authors_parsed": [["Menz", "Michael", ""], ["Wang", "Justin", ""], ["Xie", "Jiyang", ""]]}, {"id": "1504.02926", "submitter": "Arnob Ghosh", "authors": "Arnob Ghosh and Saswati Sarkar", "title": "Strategic Interaction Among Different Entities in Internet of Things", "comments": "Submitted in IEEE Transactions on Automatic Control", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The economic model of the Internet of Things (IoT) consists of end users,\nadvertisers and three different kinds of providers--IoT service provider\n(IoTSP), Wireless service provider (WSP) and cloud service provider (CSP). We\ninvestigate three different kinds of interactions among the providers. First,\nwe consider that the IoTSP prices a bundled service to the end-users, and the\nWSP and CSP pay the IoTSP (push model). Next, we consider the model where the\nend-users independently pay the each provider (pull model). Finally, we\nconsider a hybrid model of the above two where the IoTSP and WSP quote their\nprices to the end-users, but the CSP quotes its price to the IoTSP.\n  We characterize and quantify the impact of the advertisement revenue on the\nequilibrium pricing strategy and payoff of providers, and corresponding demands\nof end users in each of the above interaction models. Our analysis reveals that\nthe demand of end-users, and the payoffs of the providers are non decreasing\nfunctions of the advertisement revenue. For sufficiently high advertisement\nrevenue, the IoTSP will offer its service free of cost in each interaction\nmodel. However, the payoffs of the providers, and the demand of end-users vary\nacross different interaction models. Our analysis shows that the demand of\nend-users, and the payoff of the WSP are the highest in the pull (push, resp.)\nmodel in the low (high, resp.) advertisement revenue regime. The payoff of the\nIoTSP is always higher in the pull model irrespective of the advertisement\nrevenue. The payoff of the CSP is the highest in the hybrid model in the low\nadvertisement revenue regime. However, in the high advertisement revenue regime\nthe payoff of the CSP in the hybrid model or in the push model can be higher\ndepending on the equilibrium chosen in the push model.\n", "versions": [{"version": "v1", "created": "Sun, 12 Apr 2015 02:14:31 GMT"}, {"version": "v2", "created": "Tue, 14 Jul 2015 17:22:53 GMT"}, {"version": "v3", "created": "Sun, 6 Dec 2015 08:24:25 GMT"}, {"version": "v4", "created": "Fri, 20 May 2016 22:04:35 GMT"}], "update_date": "2016-05-24", "authors_parsed": [["Ghosh", "Arnob", ""], ["Sarkar", "Saswati", ""]]}, {"id": "1504.02947", "submitter": "Guillermo P\\'erez", "authors": "Paul Hunter, Guillermo A. P\\'erez, Jean-Fran\\c{c}ois Raskin", "title": "Looking at Mean-Payoff through Foggy Windows", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mean-payoff games (MPGs) are infinite duration two-player zero-sum games\nplayed on weighted graphs. Under the hypothesis of perfect information, they\nadmit memoryless optimal strategies for both players and can be solved in\nNP-intersect-coNP. MPGs are suitable quantitative models for open reactive\nsystems. However, in this context the assumption of perfect information is not\nalways realistic. For the partial-observation case, the problem that asks if\nthe first player has an observation-based winning strategy that enforces a\ngiven threshold on the mean-payoff, is undecidable. In this paper, we study the\nwindow mean-payoff objectives that were introduced recently as an alternative\nto the classical mean-payoff objectives. We show that, in sharp contrast to the\nclassical mean-payoff objectives, some of the window mean-payoff objectives are\ndecidable in games with partial-observation.\n", "versions": [{"version": "v1", "created": "Sun, 12 Apr 2015 09:25:13 GMT"}], "update_date": "2015-04-14", "authors_parsed": [["Hunter", "Paul", ""], ["Pérez", "Guillermo A.", ""], ["Raskin", "Jean-François", ""]]}, {"id": "1504.03257", "submitter": "Nick Arnosti", "authors": "Nick Arnosti, Nicole Immorlica, Brendan Lucier", "title": "The (Non)-Existence of Stable Mechanisms in Incomplete Information\n  Environments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider two-sided matching markets, and study the incentives of agents to\ncircumvent a centralized clearing house by signing binding contracts with one\nanother. It is well-known that if the clearing house implements a stable match\nand preferences are known, then no group of agents can profitably deviate in\nthis manner.\n  We ask whether this property holds even when agents have incomplete\ninformation about their own preferences or the preferences of others. We find\nthat it does not. In particular, when agents are uncertain about the\npreferences of others, every mechanism is susceptible to deviations by groups\nof agents. When, in addition, agents are uncertain about their own preferences,\nevery mechanism is susceptible to deviations in which a single pair of agents\nagrees in advance to match to each other.\n", "versions": [{"version": "v1", "created": "Mon, 13 Apr 2015 17:01:58 GMT"}], "update_date": "2015-04-14", "authors_parsed": [["Arnosti", "Nick", ""], ["Immorlica", "Nicole", ""], ["Lucier", "Brendan", ""]]}, {"id": "1504.03586", "submitter": "Christoph D\\\"urr", "authors": "Christoph D\\\"urr and {\\L}ukasz Je\\.z and \\'Oscar C. V\\'asquez", "title": "Mechanism design for aggregating energy consumption and quality of\n  service in speed scaling scheduling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a strategic game, where players submit jobs to a machine that\nexecutes all jobs in a way that minimizes energy while respecting the given\ndeadlines. The energy consumption is then charged to the players in some way.\nEach player wants to minimize the sum of that charge and of their job's\ndeadline multiplied by a priority weight. Two charging schemes are studied, the\nproportional cost share which does not always admit pure Nash equilibria, and\nthe marginal cost share, which does always admit pure Nash equilibria, at the\nprice of overcharging by a constant factor.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2015 15:30:50 GMT"}, {"version": "v2", "created": "Mon, 10 Jul 2017 09:41:07 GMT"}], "update_date": "2017-07-11", "authors_parsed": [["Dürr", "Christoph", ""], ["Jeż", "Łukasz", ""], ["Vásquez", "Óscar C.", ""]]}, {"id": "1504.03602", "submitter": "Sergey Norin", "authors": "Yogesh Anbalagan, Hao Huang, Shachar Lovett, Sergey Norin, Adrian\n  Vetta and Hehui Wu", "title": "Large Supports are required for Well-Supported Nash Equilibria", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that for any constant $k$ and any $\\epsilon<1$, there exist bimatrix\nwin-lose games for which every $\\epsilon$-WSNE requires supports of cardinality\ngreater than $k$. To do this, we provide a graph-theoretic characterization of\nwin-lose games that possess $\\epsilon$-WSNE with constant cardinality supports.\nWe then apply a result in additive number theory of Haight to construct\nwin-lose games that do not satisfy the requirements of the characterization.\nThese constructions disprove graph theoretic conjectures of Daskalakis, Mehta\nand Papadimitriou, and Myers.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2015 16:07:57 GMT"}], "update_date": "2015-04-15", "authors_parsed": [["Anbalagan", "Yogesh", ""], ["Huang", "Hao", ""], ["Lovett", "Shachar", ""], ["Norin", "Sergey", ""], ["Vetta", "Adrian", ""], ["Wu", "Hehui", ""]]}, {"id": "1504.03625", "submitter": "Adi Vardi", "authors": "Alon Eden and Michal Feldman and Adi Vardi", "title": "Truthful Secretaries with Budgets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study online auction settings in which agents arrive and depart\ndynamically in a random (secretary) order, and each agent's private type\nconsists of the agent's arrival and departure times, value and budget. We\nconsider multi-unit auctions with additive agents for the allocation of both\ndivisible and indivisible items. For both settings, we devise truthful\nmechanisms that give a constant approximation with respect to the auctioneer's\nrevenue, under a large market assumption. For divisible items, we devise in\naddition a truthful mechanism that gives a constant approximation with respect\nto the liquid welfare --- a natural efficiency measure for budgeted settings\nintroduced by Dobzinski and Paes Leme [ICALP'14]. Our techniques provide\nhigh-level principles for transforming offline truthful mechanisms into online\nones, with or without budget constraints. To the best of our knowledge, this is\nthe first work that addresses the non-trivial challenge of combining online\nsettings with budgeted agents.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2015 16:55:08 GMT"}], "update_date": "2015-04-15", "authors_parsed": [["Eden", "Alon", ""], ["Feldman", "Michal", ""], ["Vardi", "Adi", ""]]}, {"id": "1504.03903", "submitter": "Panayotis Mertikopoulos", "authors": "Panayotis Mertikopoulos, E. Veronica Belmega", "title": "Learning to be green: robust energy efficiency maximization in dynamic\n  MIMO-OFDM systems", "comments": "25 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we examine the maximization of energy efficiency (EE) in\nnext-generation multi-user MIMO-OFDM networks that evolve dynamically over time\n- e.g. due to user mobility, fluctuations in the wireless medium, modulations\nin the users' load, etc. Contrary to the static/stationary regime, the system\nmay evolve in an arbitrary manner so, targeting a fixed optimum state (either\nstatic or in the mean) becomes obsolete; instead, users must adjust to changes\nin the system \"on the fly\", without being able to predict the state of the\nsystem in advance. To tackle these issues, we propose a simple and distributed\nonline optimization policy that leads to no regret, i.e. it allows users to\nmatch (and typically outperform) even the best fixed transmit policy in\nhindsight, irrespective of how the system varies with time. Moreover, to\naccount for the scarcity of perfect channel state information (CSI) in massive\nMIMO systems, we also study the algorithm's robustness in the presence of\nmeasurement errors and observation noise. Importantly, the proposed policy\nretains its no-regret properties under very mild assumptions on the error\nstatistics and, on average, it enjoys the same performance guarantees as in the\nnoiseless, deterministic case. Our analysis is supplemented by extensive\nnumerical simulations which show that, in realistic network environments, users\ntrack their individually optimum transmit profile even under rapidly changing\nchannel conditions, achieving gains of up to 600% in energy efficiency over\nuniform power allocation policies.\n", "versions": [{"version": "v1", "created": "Wed, 15 Apr 2015 13:32:07 GMT"}], "update_date": "2015-04-16", "authors_parsed": [["Mertikopoulos", "Panayotis", ""], ["Belmega", "E. Veronica", ""]]}, {"id": "1504.03965", "submitter": "Simon Lentner", "authors": "Elisabeth Kraus and Simon D. Lentner", "title": "Nash Equilibria And Partition Functions Of Games With Many Dependent\n  Players", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss and solve a model for a game with many players, where a subset of\ntruely deciding players is embedded into a hierarchy of dependent agents.\n  These interdependencies modify the game matrix and the Nash equilibria for\nthe deciding players. In a concrete example, we recognize the partition\nfunction of the Ising model and for high dependency we observe a phase\ntransition to a new Nash equilibrium, which is the Pareto-efficient outcome.\n  An example we have in mind is the game theory for major shareholders in a\nstock market, where intermediate companies decide according to a majority vote\nof their owners and compete for the final profit. In our model, these\ninterdependency eventually forces cooperation.\n", "versions": [{"version": "v1", "created": "Wed, 15 Apr 2015 16:54:29 GMT"}], "update_date": "2015-04-16", "authors_parsed": [["Kraus", "Elisabeth", ""], ["Lentner", "Simon D.", ""]]}, {"id": "1504.04359", "submitter": "Matjaz Perc", "authors": "Zhen Wang, Lin Wang, Attila Szolnoki, Matjaz Perc", "title": "Evolutionary games on multilayer networks: A colloquium", "comments": "14 two-column pages, 8 figures; accepted for publication in European\n  Physical Journal B", "journal-ref": "Eur. Phys. J. B 88 (2015) 124", "doi": "10.1140/epjb/e2015-60270-7", "report-no": null, "categories": "physics.soc-ph cs.GT cs.SI nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Networks form the backbone of many complex systems, ranging from the Internet\nto human societies. Accordingly, not only is the range of our interactions\nlimited and thus best described and modeled by networks, it is also a fact that\nthe networks that are an integral part of such models are often interdependent\nor even interconnected. Networks of networks or multilayer networks are\ntherefore a more apt description of social systems. This colloquium is devoted\nto evolutionary games on multilayer networks, and in particular to the\nevolution of cooperation as one of the main pillars of modern human societies.\nWe first give an overview of the most significant conceptual differences\nbetween single-layer and multilayer networks, and we provide basic definitions\nand a classification of the most commonly used terms. Subsequently, we review\nfascinating and counterintuitive evolutionary outcomes that emerge due to\ndifferent types of interdependencies between otherwise independent populations.\nThe focus is on coupling through the utilities of players, through the flow of\ninformation, as well as through the popularity of different strategies on\ndifferent network layers. The colloquium highlights the importance of pattern\nformation and collective behavior for the promotion of cooperation under\nadverse conditions, as well as the synergies between network science and\nevolutionary game theory.\n", "versions": [{"version": "v1", "created": "Thu, 16 Apr 2015 19:52:14 GMT"}], "update_date": "2015-05-15", "authors_parsed": [["Wang", "Zhen", ""], ["Wang", "Lin", ""], ["Szolnoki", "Attila", ""], ["Perc", "Matjaz", ""]]}, {"id": "1504.04735", "submitter": "Sergio G\\'omez", "authors": "Joan T. Matamalas, Julia Poncela-Casasnovas, Sergio G\\'omez, Alex\n  Arenas", "title": "Strategical incoherence regulates cooperation in social dilemmas on\n  multiplex networks", "comments": "28 pages, 10 figures, to appear in Scientific Reports", "journal-ref": "Scientific Reports 5 (2015) 9519", "doi": "10.1038/srep09519", "report-no": null, "categories": "physics.soc-ph cs.GT cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperation is a very common, yet not fully-understood phenomenon in natural\nand human systems. The introduction of a network within the population is known\nto affect the outcome of cooperative dynamics, allowing for the survival of\ncooperation in adverse scenarios. Recently, the introduction of multiplex\nnetworks has yet again modified the expectations for the outcome of the\nPrisoner's Dilemma game, compared to the monoplex case. However, much remains\nunstudied regarding other social dilemmas on multiplex, as well as the\nunexplored microscopic underpinnings of it. In this paper, we systematically\nstudy the evolution of cooperation in all four games in the $T-S$ plane on\nmultiplex. More importantly, we find some remarkable and previously unknown\nfeatures in the microscopic organization of the strategies, that are\nresponsible for the important differences between cooperative dynamics in\nmonoplex and multiplex. Specifically, we find that in the stationary state,\nthere are individuals that play the same strategy in all layers (coherent), and\nothers that don't (incoherent). This second group of players is responsible for\nthe surprising fact of a non full-cooperation in the Harmony Game on multiplex,\nnever observed before, as well as a higher-than-expected cooperation rates in\nsome regions of the other three social dilemmas.\n", "versions": [{"version": "v1", "created": "Sat, 18 Apr 2015 15:39:13 GMT"}], "update_date": "2015-04-28", "authors_parsed": [["Matamalas", "Joan T.", ""], ["Poncela-Casasnovas", "Julia", ""], ["Gómez", "Sergio", ""], ["Arenas", "Alex", ""]]}, {"id": "1504.04920", "submitter": "Soummya Kar", "authors": "Brian Swenson, Soummya Kar, and Joao Xavier", "title": "From Weak Learning to Strong Learning in Fictitious Play Type Algorithms", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper studies the highly prototypical Fictitious Play (FP) algorithm, as\nwell as a broad class of learning processes based on best-response dynamics,\nthat we refer to as FP-type algorithms. A well-known shortcoming of FP is that,\nwhile players may learn an equilibrium strategy in some abstract sense, there\nare no guarantees that the period-by-period strategies generated by the\nalgorithm actually converge to equilibrium themselves. This issue is\nfundamentally related to the discontinuous nature of the best response\ncorrespondence and is inherited by many FP-type algorithms. Not only does it\ncause problems in the interpretation of such algorithms as a mechanism for\neconomic and social learning, but it also greatly diminishes the practical\nvalue of these algorithms for use in distributed control. We refer to forms of\nlearning in which players learn equilibria in some abstract sense only (to be\ndefined more precisely in the paper) as weak learning, and we refer to forms of\nlearning where players' period-by-period strategies converge to equilibrium as\nstrong learning. An approach is presented for modifying an FP-type algorithm\nthat achieves weak learning in order to construct a variant that achieves\nstrong learning. Theoretical convergence results are proved.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2015 02:22:58 GMT"}], "update_date": "2015-04-21", "authors_parsed": [["Swenson", "Brian", ""], ["Kar", "Soummya", ""], ["Xavier", "Joao", ""]]}, {"id": "1504.05670", "submitter": "Abhinav  Sinha", "authors": "Abhinav Sinha and Achilleas Anastasopoulos", "title": "Mechanism Design for Fair Allocation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mechanism design for a social utility being the sum of agents' utilities\n(SoU) is a well-studied problem. There are, however, a number of problems of\ntheoretical and practical interest where a designer may have a different\nobjective than maximization of the SoU. One motivation for this is the desire\nfor more equitable allocation of resources among agents. A second, more subtle,\nmotivation is the fact that a fairer allocation indirectly implies less\nvariation in taxes which can be desirable in a situation where (implicit)\nindividual agent budgetary constraints make payment of large taxes unrealistic.\nIn this paper we study a family of social utilities that provide fair\nallocation (with SoU being subsumed as an extreme case) and derive conditions\nunder which Bayesian and Dominant strategy implementation is possible.\nFurthermore, it is shown how a simple modification of the above mechanism can\nguarantee full Bayesian implementation. Through a numerical example it is shown\nthat the proposed method can result in significant gains both in allocation\nfairness and tax reduction.\n", "versions": [{"version": "v1", "created": "Wed, 22 Apr 2015 06:54:47 GMT"}, {"version": "v2", "created": "Thu, 23 Apr 2015 21:18:14 GMT"}, {"version": "v3", "created": "Thu, 30 Apr 2015 08:57:14 GMT"}, {"version": "v4", "created": "Fri, 1 May 2015 01:32:56 GMT"}, {"version": "v5", "created": "Mon, 28 Sep 2015 13:02:05 GMT"}], "update_date": "2015-09-29", "authors_parsed": [["Sinha", "Abhinav", ""], ["Anastasopoulos", "Achilleas", ""]]}, {"id": "1504.05932", "submitter": "Lirong Xia", "authors": "Erika Mackin, Lirong Xia", "title": "Allocating Indivisible Items in Categorized Domains", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We formulate a general class of allocation problems called categorized domain\nallocation problems (CDAPs), where indivisible items from multiple categories\nare allocated to agents without monetary transfer and each agent gets at least\none item per category.\n  We focus on basic CDAPs, where the number of items in each category is equal\nto the number of agents. We characterize serial dictatorships for basic CDAPs\nby a minimal set of three axiomatic properties: strategy-proofness,\nnon-bossiness, and category-wise neutrality. Then, we propose a natural\nextension of serial dictatorships called categorial sequential allocation\nmechanisms (CSAMs), which allocate the items in multiple rounds: in each round,\nthe active agent chooses an item from a designated category. We fully\ncharacterize the worst-case rank efficiency of CSAMs for optimistic and\npessimistic agents, and provide a bound for strategic agents. We also conduct\nexperiments to compare expected rank efficiency of various CSAMs w.r.t. random\ngenerated data.\n", "versions": [{"version": "v1", "created": "Wed, 22 Apr 2015 19:27:28 GMT"}], "update_date": "2015-04-23", "authors_parsed": [["Mackin", "Erika", ""], ["Xia", "Lirong", ""]]}, {"id": "1504.06058", "submitter": "Haifeng Xu", "authors": "Haifeng Xu, Albert X. Jiang, Arunesh Sinha, Zinovi Rabinovich, Shaddin\n  Dughmi, Milind Tambe", "title": "Security Games with Information Leakage: Modeling and Computation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most models of Stackelberg security games assume that the attacker only knows\nthe defender's mixed strategy, but is not able to observe (even partially) the\ninstantiated pure strategy. Such partial observation of the deployed pure\nstrategy -- an issue we refer to as information leakage -- is a significant\nconcern in practical applications. While previous research on patrolling games\nhas considered the attacker's real-time surveillance, our settings, therefore\nmodels and techniques, are fundamentally different. More specifically, after\ndescribing the information leakage model, we start with an LP formulation to\ncompute the defender's optimal strategy in the presence of leakage. Perhaps\nsurprisingly, we show that a key subproblem to solve this LP (more precisely,\nthe defender oracle) is NP-hard even for the simplest of security game models.\nWe then approach the problem from three possible directions: efficient\nalgorithms for restricted cases, approximation algorithms, and heuristic\nalgorithms for sampling that improves upon the status quo. Our experiments\nconfirm the necessity of handling information leakage and the advantage of our\nalgorithms.\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2015 06:49:49 GMT"}, {"version": "v2", "created": "Mon, 4 May 2015 05:08:52 GMT"}], "update_date": "2015-05-05", "authors_parsed": [["Xu", "Haifeng", ""], ["Jiang", "Albert X.", ""], ["Sinha", "Arunesh", ""], ["Rabinovich", "Zinovi", ""], ["Dughmi", "Shaddin", ""], ["Tambe", "Milind", ""]]}, {"id": "1504.06314", "submitter": "Siddharth Barman", "authors": "Siddharth Barman and Katrina Ligett", "title": "Finding Any Nontrivial Coarse Correlated Equilibrium Is Hard", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the most appealing aspects of the (coarse) correlated equilibrium\nconcept is that natural dynamics quickly arrive at approximations of such\nequilibria, even in games with many players. In addition, there exist\npolynomial-time algorithms that compute exact (coarse) correlated equilibria.\nIn light of these results, a natural question is how good are the (coarse)\ncorrelated equilibria that can arise from any efficient algorithm or dynamics.\n  In this paper we address this question, and establish strong negative\nresults. In particular, we show that in multiplayer games that have a succinct\nrepresentation, it is NP-hard to compute any coarse correlated equilibrium (or\napproximate coarse correlated equilibrium) with welfare strictly better than\nthe worst possible. The focus on succinct games ensures that the underlying\ncomplexity question is interesting; many multiplayer games of interest are in\nfact succinct. Our results imply that, while one can efficiently compute a\ncoarse correlated equilibrium, one cannot provide any nontrivial welfare\nguarantee for the resulting equilibrium, unless P=NP. We show that analogous\nhardness results hold for correlated equilibria, and persist under the\negalitarian objective or Pareto optimality.\n  To complement the hardness results, we develop an algorithmic framework that\nidentifies settings in which we can efficiently compute an approximate\ncorrelated equilibrium with near-optimal welfare. We use this framework to\ndevelop an efficient algorithm for computing an approximate correlated\nequilibrium with near-optimal welfare in aggregative games.\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2015 19:54:51 GMT"}], "update_date": "2015-04-24", "authors_parsed": [["Barman", "Siddharth", ""], ["Ligett", "Katrina", ""]]}, {"id": "1504.06341", "submitter": "Burkhard C. Schipper", "authors": "Burkhard C. Schipper", "title": "Strategic Teaching and Learning in Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is known that there are uncoupled learning heuristics leading to Nash\nequilibrium in all finite games. Why should players use such learning\nheuristics and where could they come from? We show that there is no uncoupled\nlearning heuristic leading to Nash equilibrium in all finite games that a\nplayer has an incentive to adopt, that would be evolutionary stable or that\ncould \"learn itself\". Rather, a player has an incentive to strategically teach\nsuch a learning opponent in order secure at least the Stackelberg leader\npayoff. The impossibility result remains intact when restricted to the classes\nof generic games, two-player games, potential games, games with strategic\ncomplements or 2x2 games, in which learning is known to be \"nice\". More\ngenerally, it also applies to uncoupled learning heuristics leading to\ncorrelated equilibria, rationalizable outcomes, iterated admissible outcomes,\nor minimal curb sets. A possibility result restricted to \"strategically\ntrivial\" games fails if some generic games outside this class are considered as\nwell.\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2015 20:49:16 GMT"}], "update_date": "2015-04-27", "authors_parsed": [["Schipper", "Burkhard C.", ""]]}, {"id": "1504.06607", "submitter": "Luca Sanguinetti", "authors": "Giacomo Bacci, Luca Sanguinetti, Marco Luise", "title": "Understanding Game Theory via Wireless Power Control", "comments": "Accepted for publication as lecture note in IEEE Signal Processing\n  Magazine, 13 pages, 4 figures. The results can be reproduced using the\n  following Matlab code: https://github.com/lucasanguinetti/ ln-game-theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this lecture note, we introduce the basic concepts of game theory (GT), a\nbranch of mathematics traditionally studied and applied in the areas of\neconomics, political science, and biology, which has emerged in the last\nfifteen years as an effective framework for communications, networking, and\nsignal processing (SP). The real catalyzer has been the blooming of all issues\nrelated to distributed networks, in which the nodes can be modeled as players\nin a game competing for system resources. Some relevant notions of GT are\nintroduced by elaborating on a simple application in the context of wireless\ncommunications, notably the power control in an interference channel (IC) with\ntwo transmitters and two receivers.\n", "versions": [{"version": "v1", "created": "Wed, 15 Apr 2015 15:21:47 GMT"}], "update_date": "2015-04-27", "authors_parsed": [["Bacci", "Giacomo", ""], ["Sanguinetti", "Luca", ""], ["Luise", "Marco", ""]]}, {"id": "1504.06744", "submitter": "Benjamin Monmege", "authors": "Thomas Brihaye, Gilles Geeraerts, Axel Haddad, Benjamin Monmege,\n  Guillermo A. P\\'erez, and Gabriel Renault", "title": "Quantitative Games under Failures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a generalisation of sabotage games, a model of dynamic network games\nintroduced by van Benthem. The original definition of the game is inherently\nfinite and therefore does not allow one to model infinite processes. We propose\nan extension of the sabotage games in which the first player (Runner) traverses\nan arena with dynamic weights determined by the second player (Saboteur). In\nour model of quantitative sabotage games, Saboteur is now given a budget that\nhe can distribute amongst the edges of the graph, whilst Runner attempts to\nminimise the quantity of budget witnessed while completing his task. We show\nthat, on the one hand, for most of the classical cost functions considered in\nthe literature, the problem of determining if Runner has a strategy to ensure a\ncost below some threshold is EXPTIME-complete. On the other hand, if the budget\nof Saboteur is fixed a priori, then the problem is in PTIME for most cost\nfunctions. Finally, we show that restricting the dynamics of the game also\nleads to better complexity.\n", "versions": [{"version": "v1", "created": "Sat, 25 Apr 2015 17:20:54 GMT"}, {"version": "v2", "created": "Wed, 15 Jul 2015 07:29:19 GMT"}], "update_date": "2015-07-16", "authors_parsed": [["Brihaye", "Thomas", ""], ["Geeraerts", "Gilles", ""], ["Haddad", "Axel", ""], ["Monmege", "Benjamin", ""], ["Pérez", "Guillermo A.", ""], ["Renault", "Gabriel", ""]]}, {"id": "1504.06828", "submitter": "Vinayaka Yaji", "authors": "Vinayaka Yaji and Shalabh Bhatnagar", "title": "A bi-convex optimization problem to compute Nash equilibrium in n-player\n  games and an algorithm", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present optimization problems with biconvex objective\nfunction and linear constraints such that the set of global minima of the\noptimization problems is the same as the set of Nash equilibria of a n-player\ngeneral-sum normal form game. We further show that the objective function is an\ninvex function and consider a projected gradient descent algorithm. We prove\nthat the projected gradient descent scheme converges to a partial optimum of\nthe objective function. We also present simulation results on certain test\ncases showing convergence to a Nash equilibrium strategy.\n", "versions": [{"version": "v1", "created": "Sun, 26 Apr 2015 14:24:14 GMT"}], "update_date": "2015-04-28", "authors_parsed": [["Yaji", "Vinayaka", ""], ["Bhatnagar", "Shalabh", ""]]}, {"id": "1504.07308", "submitter": "Niangjun Chen", "authors": "Niangjun Chen, Xiaoqi Ren, Shaolei Ren and Adam Wierman", "title": "Greening Multi-Tenant Data Center Demand Response", "comments": "34 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Data centers have emerged as promising resources for demand response,\nparticularly for emergency demand response (EDR), which saves the power grid\nfrom incurring blackouts during emergency situations. However, currently, data\ncenters typically participate in EDR by turning on backup (diesel) generators,\nwhich is both expensive and environmentally unfriendly. In this paper, we focus\non \"greening\" demand response in multi-tenant data centers, i.e., colocation\ndata centers, by designing a pricing mechanism through which the data center\noperator can efficiently extract load reductions from tenants during emergency\nperiods to fulfill energy reduction requirement for EDR. In particular, we\npropose a pricing mechanism for both mandatory and voluntary EDR programs,\nColoEDR, that is based on parameterized supply function bidding and provides\nprovably near-optimal efficiency guarantees, both when tenants are price-taking\nand when they are price-anticipating. In addition to analytic results, we\nextend the literature on supply function mechanism design, and evaluate ColoEDR\nusing trace-based simulation studies. These validate the efficiency analysis\nand conclude that the pricing mechanism is both beneficial to the environment\nand to the data center operator (by decreasing the need for backup diesel\ngeneration), while also aiding tenants (by providing payments for load\nreductions).\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2015 23:52:10 GMT"}], "update_date": "2015-04-29", "authors_parsed": [["Chen", "Niangjun", ""], ["Ren", "Xiaoqi", ""], ["Ren", "Shaolei", ""], ["Wierman", "Adam", ""]]}, {"id": "1504.07342", "submitter": "Jiandong Zhu", "authors": "Xinyun Liu, Jiandong Zhu", "title": "On Potential Equations of Finite Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, some new criteria for detecting whether a finite game is\npotential are proposed by solving potential equations. The verification\nequations with the minimal number for checking a potential game are obtained\nfor the first time. Some connections between the potential equations and the\nexisting characterizations of potential games are established. It is revealed\nthat a finite game is potential if and only if its every bi-matrix sub-game is\npotential.\n", "versions": [{"version": "v1", "created": "Tue, 28 Apr 2015 04:41:31 GMT"}], "update_date": "2015-04-29", "authors_parsed": [["Liu", "Xinyun", ""], ["Zhu", "Jiandong", ""]]}, {"id": "1504.07518", "submitter": "Mona Rahn", "authors": "Mona Rahn, Guido Sch\\\"afer", "title": "Efficient Equilibria in Polymatrix Coordination Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider polymatrix coordination games with individual preferences where\nevery player corresponds to a node in a graph who plays with each neighbor a\nseparate bimatrix game with non-negative symmetric payoffs. In this paper, we\nstudy $\\alpha$-approximate $k$-equilibria of these games, i.e., outcomes where\nno group of at most $k$ players can deviate such that each member increases his\npayoff by at least a factor $\\alpha$. We prove that for $\\alpha \\ge 2$ these\ngames have the finite coalitional improvement property (and thus\n$\\alpha$-approximate $k$-equilibria exist), while for $\\alpha < 2$ this\nproperty does not hold. Further, we derive an almost tight bound of\n$2\\alpha(n-1)/(k-1)$ on the price of anarchy, where $n$ is the number of\nplayers; in particular, it scales from unbounded for pure Nash equilibria ($k =\n1)$ to $2\\alpha$ for strong equilibria ($k = n$). We also settle the complexity\nof several problems related to the verification and existence of these\nequilibria. Finally, we investigate natural means to reduce the inefficiency of\nNash equilibria. Most promisingly, we show that by fixing the strategies of $k$\nplayers the price of anarchy can be reduced to $n/k$ (and this bound is tight).\n", "versions": [{"version": "v1", "created": "Tue, 28 Apr 2015 15:03:30 GMT"}], "update_date": "2015-04-29", "authors_parsed": [["Rahn", "Mona", ""], ["Schäfer", "Guido", ""]]}, {"id": "1504.07545", "submitter": "Tobias Harks", "authors": "Satoru Fujishige, Michel X. Goemans, Tobias Harks, Britta Peis and\n  Rico Zenklusen", "title": "Matroids are Immune to Braess Paradox", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The famous Braess paradox describes the following phenomenon: It might happen\nthat the improvement of resources, like building a new street within a\ncongested network, may in fact lead to larger costs for the players in an\nequilibrium. In this paper we consider general nonatomic congestion games and\ngive a characterization of the maximal combinatorial property of strategy\nspaces for which Braess paradox does not occur. In a nutshell, bases of\nmatroids are exactly this maximal structure. We prove our characterization by\ntwo novel sensitivity results for convex separable optimization problems over\npolymatroid base polyhedra which may be of independent interest.\n", "versions": [{"version": "v1", "created": "Tue, 28 Apr 2015 16:07:08 GMT"}, {"version": "v2", "created": "Tue, 10 Jan 2017 11:31:45 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Fujishige", "Satoru", ""], ["Goemans", "Michel X.", ""], ["Harks", "Tobias", ""], ["Peis", "Britta", ""], ["Zenklusen", "Rico", ""]]}, {"id": "1504.07687", "submitter": "Parikshit Gopalan", "authors": "Parikshit Gopalan, Noam Nisan, Tim Roughgarden", "title": "Public projects, Boolean functions and the borders of Border's theorem", "comments": "Accepted to ACM EC 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Border's theorem gives an intuitive linear characterization of the feasible\ninterim allocation rules of a Bayesian single-item environment, and it has\nseveral applications in economic and algorithmic mechanism design. All known\ngeneralizations of Border's theorem either restrict attention to relatively\nsimple settings, or resort to approximation. This paper identifies a\ncomplexity-theoretic barrier that indicates, assuming standard complexity class\nseparations, that Border's theorem cannot be extended significantly beyond the\nstate-of-the-art. We also identify a surprisingly tight connection between\nMyerson's optimal auction theory, when applied to public project settings, and\nsome fundamental results in the analysis of Boolean functions.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2015 00:24:39 GMT"}], "update_date": "2015-04-30", "authors_parsed": [["Gopalan", "Parikshit", ""], ["Nisan", "Noam", ""], ["Roughgarden", "Tim", ""]]}, {"id": "1504.07702", "submitter": "Ayca Balkan", "authors": "Ayca Balkan, Moshe Vardi and Paulo Tabuada", "title": "Mode-Target Games: Reactive Synthesis for Control Applications", "comments": "This version is an extension of the conference version of the\n  original paper titled \"Controller Synthesis for Mode-Target Games\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.LO cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a class of Linear Temporal Logic (LTL)\nspecifications for which the problem of synthesizing controllers can be solved\nin polynomial time. The new class of specifications is an LTL fragment that we\nterm Mode-Target (MT) and is inspired by numerous control applications where\nthere are modes and corresponding (possibly multiple) targets for each mode. We\nformulate the problem of synthesizing a controller enforcing an MT\nspecification as a game and provide an algorithm that requires $O(\\sum_i t_i\nn^2)$ symbolic steps, where $n$ is the number of states in the game graph, and\n$t_i$ is the number of targets corresponding to mode $i$.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2015 02:13:22 GMT"}, {"version": "v2", "created": "Wed, 25 Nov 2015 23:26:05 GMT"}, {"version": "v3", "created": "Sat, 13 Aug 2016 22:34:30 GMT"}, {"version": "v4", "created": "Sat, 17 Dec 2016 02:11:17 GMT"}], "update_date": "2016-12-20", "authors_parsed": [["Balkan", "Ayca", ""], ["Vardi", "Moshe", ""], ["Tabuada", "Paulo", ""]]}, {"id": "1504.08211", "submitter": "Lorenzo Clemente", "authors": "Lorenzo Clemente, Jean-Fran\\c{c}ois Raskin", "title": "Multidimensional beyond worst-case and almost-sure problems for\n  mean-payoff objectives", "comments": "Technical report a paper accepted to LICS'15", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The beyond worst-case threshold problem (BWC), recently introduced by\nBruy\\`ere et al., asks given a quantitative game graph for the synthesis of a\nstrategy that i) enforces some minimal level of performance against any\nadversary, and ii) achieves a good expectation against a stochastic model of\nthe adversary. They solved the BWC problem for finite-memory strategies and\nunidimensional mean-payoff objectives and they showed membership of the problem\nin NP$\\cap$coNP. They also noted that infinite-memory strategies are more\npowerful than finite-memory ones, but the respective threshold problem was left\nopen. We extend these results in several directions. First, we consider\nmultidimensional mean-payoff objectives. Second, we study both finite-memory\nand infinite-memory strategies. We show that the multidimensional BWC problem\nis coNP-complete in both cases. Third, in the special case when the worst-case\nobjective is unidimensional (but the expectation objective is still\nmultidimensional) we show that the complexity decreases to NP$\\cap$coNP. This\nsolves the infinite-memory threshold problem left open by Bruy\\`ere et al., and\nthis complexity cannot be improved without improving the currently known\ncomplexity of classical mean-payoff games. Finally, we introduce a natural\nrelaxation of the BWC problem, the beyond almost-sure threshold problem (BAS),\nwhich asks for the synthesis of a strategy that ensures some minimal level of\nperformance with probability one and a good expectation against the stochastic\nmodel of the adversary. We show that the multidimensional BAS threshold problem\nis solvable in P.\n", "versions": [{"version": "v1", "created": "Thu, 30 Apr 2015 13:16:48 GMT"}, {"version": "v2", "created": "Tue, 21 Nov 2017 10:02:44 GMT"}], "update_date": "2017-11-22", "authors_parsed": [["Clemente", "Lorenzo", ""], ["Raskin", "Jean-François", ""]]}, {"id": "1504.08333", "submitter": "Zheng Wen", "authors": "Zheng Wen, Eric Bax, James Li", "title": "Revenue-Maximizing Mechanism Design for Quasi-Proportional Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In quasi-proportional auctions, each bidder receives a fraction of the\nallocation equal to the weight of their bid divided by the sum of weights of\nall bids, where each bid's weight is determined by a weight function. We study\nthe relationship between the weight function, bidders' private values, number\nof bidders, and the seller's revenue in equilibrium. It has been shown that if\none bidder has a much higher private value than the others, then a nearly flat\nweight function maximizes revenue. Essentially, threatening the bidder who has\nthe highest valuation with having to share the allocation maximizes the\nrevenue. We show that as bidder private values approach parity, steeper weight\nfunctions maximize revenue by making the quasi-proportional auction more like a\nwinner-take-all auction. We also show that steeper weight functions maximize\nrevenue as the number of bidders increases. For flatter weight functions, there\nis known to be a unique pure-strategy Nash equilibrium. We show that a\npure-strategy Nash equilibrium also exists for steeper weight functions, and we\ngive lower bounds for bids at an equilibrium. For a special case that includes\nthe two-bidder auction, we show that the pure-strategy Nash equilibrium is\nunique, and we show how to compute the revenue at equilibrium. We also show\nthat selecting a weight function based on private value ratios and number of\nbidders is necessary for a quasi-proportional auction to produce more revenue\nthan a second-price auction.\n", "versions": [{"version": "v1", "created": "Thu, 30 Apr 2015 18:38:22 GMT"}, {"version": "v2", "created": "Sat, 25 Jul 2015 21:48:26 GMT"}], "update_date": "2015-07-28", "authors_parsed": [["Wen", "Zheng", ""], ["Bax", "Eric", ""], ["Li", "James", ""]]}]