[{"id": "1102.2422", "submitter": "Bobby Scurlock", "authors": "Bob Scurlock", "title": "Use of root in vehicular accident reconstruction", "comments": null, "journal-ref": "Accident Reconstruction Journal, Vol. 21, No. 3, 2011", "doi": null, "report-no": null, "categories": "physics.pop-ph cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this article is to introduce the reader to the ROOT data\nanalysis software package, and demonstrate how it may be used to complement\none's accident reconstruction analyses.\n", "versions": [{"version": "v1", "created": "Fri, 11 Feb 2011 20:22:35 GMT"}, {"version": "v2", "created": "Wed, 2 Mar 2011 20:29:27 GMT"}], "update_date": "2014-04-09", "authors_parsed": [["Scurlock", "Bob", ""]]}, {"id": "1102.3112", "submitter": "Serge Samper", "authors": "Abdessalem Hassani, Nizar Aifaoui, Abdelmajid Benamara (LGM), Serge\n  Samper (SYMME)", "title": "Computer Aided Tolerancing Based on Analysis and Synthetizes of\n  Tolerances Method", "comments": null, "journal-ref": "ICAMEM 2008, Sousse : Tunisia (2008)", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The tolerancing step has a great importance in the design process. It\ncharacterises the relationship between the different sectors of the product\nlife cycle: Design, Manufacturing and Control. We can distinguish several\nmethods to assist the tolerancing process in the design. Based on arithmetic\nand statistical method, this paper presents a new approach of analysis and\nverification of tolerances. The chosen approach is based on the Worst Case\nMethod as an arithmetic method and Monte Carlo method as a statistical method.\nIn this paper, we compare these methods and we present our main approach, which\nis validated using an example of 1 D tolerancing.\n", "versions": [{"version": "v1", "created": "Sun, 13 Feb 2011 07:28:46 GMT"}], "update_date": "2011-02-16", "authors_parsed": [["Hassani", "Abdessalem", "", "LGM"], ["Aifaoui", "Nizar", "", "LGM"], ["Benamara", "Abdelmajid", "", "LGM"], ["Samper", "Serge", "", "SYMME"]]}, {"id": "1102.3968", "submitter": "Voronov Vladimir K.", "authors": "V. K. Voronov (Irkutsk State Technical University, Irkutsk, Russia)", "title": "Cluster quantum computer on the basis of quasi-part", "comments": "4 pages", "journal-ref": "Natural Science, vol. 2, no. 8, August 2010, pp.923 - 927", "doi": "10.4236/ns.2010.28114", "report-no": "EFI-94-11", "categories": "quant-ph cs.ET cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present paper deals with the possibility of creation of the quantum\ncomputer in which the role of q-bits is played by quasi-particles. In such a\ncomputer, the elementary computation block should represent a cluster created\non the basis of the paramagnetic molecules. The latter form heterogeneous spin\nstates in the cluster owing to the presence of interelectron correlations.\n", "versions": [{"version": "v1", "created": "Sat, 19 Feb 2011 05:06:36 GMT"}], "update_date": "2011-03-16", "authors_parsed": [["Voronov", "V. K.", "", "Irkutsk State Technical University, Irkutsk, Russia"]]}, {"id": "1102.4241", "submitter": "Petros Zimourtopoulos E", "authors": "Nikolitsa Yannopoulou, Petros Zimourtopoulos", "title": "Support of Interactive 3D/4D Presentations by the Very First Ever Made\n  Virtual Laboratories of Antennas", "comments": "Inadequately justified rejection (with reviewers' grades: [4, 4, 3,\n  4] + [4, 4, 4, 4] + [2, 4, 4, 4] out of 3 x [5, 5, 5, 5]) from publication to\n  the Proceedings of 21st International Conference Radioelektronika 2011, April\n  19-20, Brno, Czech Republic - No changes in the paper since [v1] Mon, 21 Feb\n  2011 14:52:34 GMT (412kb): [v3] = [v2] = [v1]", "journal-ref": "FunkTechnikPlus # Journal, Issue 3 - Year 1, 31 January 2014, v1,\n  7-18, otoiser ftp#j", "doi": null, "report-no": null, "categories": "cs.OH physics.comp-ph", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Based on the experience we have gained so far, as independent reviewers of\nRadioengineering journal, we thought that may be proved useful to publicly\nshare with the interested author, especially the young one, some practical\nimplementations of our ideas for the interactive representation of data using\n3D/4D movement and animation, in an attempt to motivate and support her/him in\nthe development of similar dynamic presentations, when s/he is looking for a\nway to locate the stronger aspects of her/his research results in order to\nprepare a clear, most appropriate for publication, static presentation figure.\nFor this purpose, we selected to demonstrate a number of presentations, from\nthe simplest to the most complicated, concerning well-known antenna issues with\nrather hard to imagine details, as it happens perhaps in cases involving\nSpherical Coordinates and Polarization, which we created to enrich the very\nfirst ever made Virtual Laboratories of Antennas, that we distribute over the\nOpen Internet through our website Virtual Antennas. These presentations were\ndeveloped in a general way, without using antenna simulators, to handle output\ntext and image data from third-party CAS Computer Algebra Systems, such as the\nMathematica commercial software we use or the Maxima FLOSS we track its\nevolution.\n", "versions": [{"version": "v1", "created": "Mon, 21 Feb 2011 14:52:34 GMT"}, {"version": "v2", "created": "Thu, 17 Mar 2011 17:45:27 GMT"}, {"version": "v3", "created": "Wed, 17 Oct 2012 09:18:07 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Yannopoulou", "Nikolitsa", ""], ["Zimourtopoulos", "Petros", ""]]}, {"id": "1102.4522", "submitter": "Tahmasb Kashani", "authors": "S. Sadodin and T. T. Kashani", "title": "Numerical investigation of a solar greenhouse tunnel drier for drying of\n  copra", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A numerical investigation of a solar greenhouse tunnel drier (SGTD) has been\nperformed. In the present study, the geometry of the tunnel roof is assumed\nsemi-circular which is covered with a UV (200\\mu) stabilized polyethylene film.\nThe simulated SGTD reduces moisture of copra from 52.2% to 8% in 55 h under\nfull load conditions. A system of partial differential equations describing\nheat and moisture transfer during drying copra in the solar greenhouse dryer\nwas developed and this system of non-linear partial differential equations was\nsolved numerically using the finite difference method (FDM). The numerical\nsolution was programmed in Compaq Visual FORTRAN version 6.5. The simulated\nresults reasonably agreed with the experimental data for solar drying copra.\nThis model can be used to provide the design data and is also essential for\noptimal design of the dryer. For instance the user is able to change the\nradiation properties of the roof cover for different materials of roof cover.\n", "versions": [{"version": "v1", "created": "Sat, 19 Feb 2011 16:51:24 GMT"}], "update_date": "2011-02-23", "authors_parsed": [["Sadodin", "S.", ""], ["Kashani", "T. T.", ""]]}, {"id": "1102.4684", "submitter": "Vincent Mahe", "authors": "Vincent Mahe (INRIA - EMN), Salvador Martinez Perez (INRIA - EMN),\n  Guillaume Doux (INRIA - EMN), Hugo Bruneli\\`ere (INRIA - EMN), Jordi Cabot\n  (INRIA - EMN)", "title": "P ORTOLAN: a Model-Driven Cartography Framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Processing large amounts of data to extract useful information is an\nessential task within companies. To help in this task, visualization techniques\nhave been commonly used due to their capacity to present data in synthesized\nviews, easier to understand and manage. However, achieving the right\nvisualization display for a data set is a complex cartography process that\ninvolves several transformation steps to adapt the (domain) data to the\n(visualization) data format expected by visualization tools. To maximize the\nbenefits of visualization we propose Portolan, a generic model-driven\ncartography framework that facilitates the discovery of the data to visualize,\nthe specification of view definitions for that data and the transformations to\nbridge the gap with the visualization tools. Our approach has been implemented\non top of the Eclipse EMF modeling framework and validated on three different\nuse cases.\n", "versions": [{"version": "v1", "created": "Wed, 23 Feb 2011 08:21:43 GMT"}], "update_date": "2011-02-24", "authors_parsed": [["Mahe", "Vincent", "", "INRIA - EMN"], ["Perez", "Salvador Martinez", "", "INRIA - EMN"], ["Doux", "Guillaume", "", "INRIA - EMN"], ["Brunelière", "Hugo", "", "INRIA - EMN"], ["Cabot", "Jordi", "", "INRIA - EMN"]]}, {"id": "1102.5670", "submitter": "Emanuele Lindo Secco", "authors": "Matteo Lanati, Davide Curone, Emanuele Lindo Secco, Giovanni Magenes\n  and Paolo Gamba", "title": "An Autonomous Long Range Monitoring System For Emergency Operators", "comments": "13 pages, 7 figures, 1 table", "journal-ref": "International Journal of Wireless & Mobile Networks, vol. 3, no.\n  1, pp. 10-23, 2011", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Miniaturization and portability of new electronics lead up to wearable\ndevices embedded within garments: a European program called ProeTEX developed\nmulti-purpose sensors integrated within emergency operators' garments in order\nto monitor their health state and the surrounding environment. This work deals\nwith the development of an autonomous Long Range communication System (LRS),\nsuitable to transmit data between operators' equipment and the local command\npost, where remote monitoring software is set up. The LRS infrastructure is\nbased on Wi-Fi protocol and modular architecture. Field tests carried out on\nthe developed prototype showed a high reliability in terms of correctly\nexchanged data and recovering capabilities in case of temporary disconnection,\ndue to the operator's movements.\n", "versions": [{"version": "v1", "created": "Mon, 28 Feb 2011 14:19:28 GMT"}], "update_date": "2011-03-01", "authors_parsed": [["Lanati", "Matteo", ""], ["Curone", "Davide", ""], ["Secco", "Emanuele Lindo", ""], ["Magenes", "Giovanni", ""], ["Gamba", "Paolo", ""]]}]