[{"id": "0911.0089", "submitter": "Melda Yuksel", "authors": "Melda Yuksel, Xi Liu, Elza Erkip", "title": "A Secure Communication Game with a Relay Helping the Eavesdropper", "comments": "5 pages, 4 figures, published in proceedings of IEEE Information\n  Theory Workshop, Taormina, Italy, October 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work a four terminal Gaussian network composed of a source, a\ndestination, an eavesdropper and a jammer relay is studied. The jammer relay\ndoes not hear the source transmission. It assists the eavesdropper and aims to\ndecrease the achievable secrecy rates. The source, on the other hand, aims to\nincrease the achievable secrecy rates. Assuming Gaussian strategies at the\nsource and the jammer relay, this problem is formulated as a two-player\nzero-sum continuous game, where the payoff is the achieved secrecy rate. For\nthis game the Nash Equilibrium is generally achieved with mixed strategies. The\noptimal cumulative distribution functions for the source and the jammer relay\nthat achieve the value of the game, which is the equilibrium secrecy rate, are\nfound.\n", "versions": [{"version": "v1", "created": "Sat, 31 Oct 2009 15:58:08 GMT"}], "update_date": "2009-11-03", "authors_parsed": [["Yuksel", "Melda", ""], ["Liu", "Xi", ""], ["Erkip", "Elza", ""]]}, {"id": "0911.0090", "submitter": "Tullio Ceccherini-Silberstein", "authors": "Tullio Ceccherini-Silberstein and Wolfgang Woess", "title": "Context-free pairs of groups I: Context-free pairs and graphs", "comments": null, "journal-ref": "European J. Combin. 33 (2012) 1449-1466", "doi": "10.1016/j.ejc.2012.03.011", "report-no": null, "categories": "math.GR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $G$ be a finitely generated group, $A$ a finite set of generators and $K$\na subgroup of $G$. We call the pair $(G,K)$ context-free if the set of all\nwords over $A$ that reduce in $G$ to an element of $K$ is a context-free\nlanguage. When $K$ is trivial, $G$ itself is called context-free; context-free\ngroups have been classified more than 20 years ago in celebrated work of Muller\nand Schupp as the virtually free groups.\n  Here, we derive some basic properties of such group pairs. Context-freeness\nis independent of the choice of the generating set. It is preserved under\nfinite index modifications of $G$ and finite index enlargements of $K$. If $G$\nis virtually free and $K$ is finitely generated then $(G,K)$ is context-free. A\nbasic tool is the following: $(G,K)$ is context-free if and only if the\nSchreier graph of $(G,K)$ with respect to $A$ is a context-free graph.\n", "versions": [{"version": "v1", "created": "Sat, 31 Oct 2009 16:03:41 GMT"}], "update_date": "2012-12-05", "authors_parsed": [["Ceccherini-Silberstein", "Tullio", ""], ["Woess", "Wolfgang", ""]]}, {"id": "0911.0130", "submitter": "Graham Norton", "authors": "Graham H. Norton", "title": "Minimal Polynomial Algorithms for Finite Sequences", "comments": "Section 2 added, remarks and references expanded. To appear in IEEE\n  Transactions on Information Theory.", "journal-ref": null, "doi": "10.1109/TIT.2010.2054150", "report-no": null, "categories": "cs.IT cs.DM cs.SC math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that a straightforward rewrite of a known minimal polynomial\nalgorithm yields a simpler version of a recent algorithm of A. Salagean.\n", "versions": [{"version": "v1", "created": "Mon, 2 Nov 2009 04:06:37 GMT"}, {"version": "v2", "created": "Mon, 9 Nov 2009 01:45:52 GMT"}, {"version": "v3", "created": "Wed, 17 Mar 2010 05:12:49 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Norton", "Graham H.", ""]]}, {"id": "0911.0143", "submitter": "Gagan Garg", "authors": "Reza Omrani, Gagan Garg, P. Vijay Kumar, Petros Elia, and Pankaj\n  Bhambhani", "title": "Large Families of Optimal Two-Dimensional Optical Orthogonal Codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nine new 2-D OOCs are presented here, all sharing the common feature of a\ncode size that is much larger in relation to the number of time slots than\nthose of constructions appearing previously in the literature. Each of these\nconstructions is either optimal or asymptotically optimal with respect to\neither the original Johnson bound or else a non-binary version of the Johnson\nbound introduced in this paper.\n  The first 5 codes are constructed using polynomials over finite fields - the\nfirst construction is optimal while the remaining 4 are asymptotically optimal.\nThe next two codes are constructed using rational functions in place of\npolynomials and these are asymptotically optimal. The last two codes, also\nasymptotically optimal, are constructed by composing two of the above codes\nwith a constant weight binary code.\n  Also presented, is a three-dimensional OOC that exploits the polarization\ndimension.\n  Finally, phase-encoded optical CDMA is considered and construction of two\nefficient codes are provided.\n", "versions": [{"version": "v1", "created": "Sun, 1 Nov 2009 09:27:29 GMT"}], "update_date": "2009-11-03", "authors_parsed": [["Omrani", "Reza", ""], ["Garg", "Gagan", ""], ["Kumar", "P. Vijay", ""], ["Elia", "Petros", ""], ["Bhambhani", "Pankaj", ""]]}, {"id": "0911.0183", "submitter": "Erdal Panayirci", "authors": "Erdal Panayirci, Hakan Dogan, H. Vincent Poor", "title": "A Gibbs Sampling Based MAP Detection Algorithm for OFDM Over Rapidly\n  Varying Mobile Radio Channels", "comments": "6 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.AC math.IT", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  In orthogonal frequency-division multiplexing (OFDM) systems operating over\nrapidly time-varying channels, the orthogonality between subcarriers is\ndestroyed leading to inter-carrier interference (ICI) and resulting in an\nirreducible error floor. In this paper, a new and low-complexity maximum {\\em a\nposteriori} probability (MAP) detection algorithm is proposed for OFDM systems\noperating over rapidly time-varying multipath channels. The detection algorithm\nexploits the banded structure of the frequency-domain channel matrix whose\nbandwidth is a parameter to be adjusted according to the speed of the mobile\nterminal. Based on this assumption, the received signal vector is decomposed\ninto reduced dimensional sub-observations in such a way that all components of\nthe observation vector contributing to the symbol to be detected are included\nin the decomposed observation model. The data symbols are then detected by the\nMAP algorithm by means of a Markov chain Monte Carlo (MCMC) technique in an\noptimal and computationally efficient way. Computational complexity\ninvestigation as well as simulation results indicate that this algorithm has\nsignificant performance and complexity advantages over existing suboptimal\ndetection and equalization algorithms proposed earlier in the literature.\n", "versions": [{"version": "v1", "created": "Sun, 1 Nov 2009 18:25:31 GMT"}], "update_date": "2009-11-03", "authors_parsed": [["Panayirci", "Erdal", ""], ["Dogan", "Hakan", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0911.0351", "submitter": "Philippe Loubaton", "authors": "Cedric Artigue, Philippe Loubaton", "title": "On the precoder design of flat fading MIMO systems equipped with MMSE\n  receivers: a large system approach", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2145710", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is devoted to the design of precoders maximizing the ergodic\nmutual information (EMI) of bi-correlated flat fading MIMO systems equiped with\nMMSE receivers. The channel state information and the second order statistics\nof the channel are assumed available at the receiver side and at the\ntransmitter side respectively. As the direct maximization of the EMI needs the\nuse of non attractive algorithms, it is proposed to optimize an approximation\nof the EMI, introduced recently, obtained when the number of transmit and\nreceive antennas $t$ and $r$ converge to $\\infty$ at the same rate. It is\nestablished that the relative error between the actual EMI and its\napproximation is a $O(\\frac{1}{t^{2}})$ term. It is shown that the left\nsingular eigenvectors of the optimum precoder coincide with the eigenvectors of\nthe transmit covariance matrix, and its singular values are solution of a\ncertain maximization problem. Numerical experiments show that the mutual\ninformation provided by this precoder is close from what is obtained by\nmaximizing the true EMI, but that the algorithm maximizing the approximation is\nmuch less computationally intensive.\n", "versions": [{"version": "v1", "created": "Mon, 2 Nov 2009 16:32:25 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Artigue", "Cedric", ""], ["Loubaton", "Philippe", ""]]}, {"id": "0911.0467", "submitter": "Tracey Ho", "authors": "Tao Cui, Tracey Ho, Joerg Kliewer", "title": "On Secure Network Coding with Nonuniform or Restricted Wiretap Sets", "comments": "24 pages, revision submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": "10.1109/TIT.2012.2216936", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The secrecy capacity of a network, for a given collection of permissible\nwiretap sets, is the maximum rate of communication such that observing links in\nany permissible wiretap set reveals no information about the message. This\npaper considers secure network coding with nonuniform or restricted wiretap\nsets, for example, networks with unequal link capacities where a wiretapper can\nwiretap any subset of $k$ links, or networks where only a subset of links can\nbe wiretapped. Existing results show that for the case of uniform wiretap sets\n(networks with equal capacity links/packets where any $k$ can be wiretapped),\nthe secrecy capacity is given by the cut-set bound, and can be achieved by\ninjecting $k$ random keys at the source which are decoded at the sink along\nwith the message. This is the case whether or not the communicating users have\ninformation about the choice of wiretap set. In contrast, we show that for the\nnonuniform case, the cut-set bound is not achievable in general when the\nwiretap set is unknown, whereas it is achievable when the wiretap set is made\nknown. We give achievable strategies where random keys are canceled at\nintermediate non-sink nodes, or injected at intermediate non-source nodes.\nFinally, we show that determining the secrecy capacity is a NP-hard problem.\n", "versions": [{"version": "v1", "created": "Tue, 3 Nov 2009 01:21:39 GMT"}, {"version": "v2", "created": "Wed, 26 Oct 2011 18:39:15 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Cui", "Tao", ""], ["Ho", "Tracey", ""], ["Kliewer", "Joerg", ""]]}, {"id": "0911.0519", "submitter": "Moshe Mishali", "authors": "Moshe Mishali, Yonina C. Eldar and Asaf Elron", "title": "Xampling: Signal Acquisition and Processing in Union of Subspaces", "comments": "16 pages, 9 figures, submitted to IEEE for possible publication", "journal-ref": null, "doi": "10.1109/TSP.2011.2161472", "report-no": "CCIT Report #747 Oct-09, EE Pub No. 1704, EE Dept., Technion -\n  Israel Institute of Technology (refers to v1)", "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce Xampling, a unified framework for signal acquisition and\nprocessing of signals in a union of subspaces. The main functions of this\nframework are two. Analog compression that narrows down the input bandwidth\nprior to sampling with commercial devices. A nonlinear algorithm then detects\nthe input subspace prior to conventional signal processing. A representative\nunion model of spectrally-sparse signals serves as a test-case to study these\nXampling functions. We adopt three metrics for the choice of analog\ncompression: robustness to model mismatch, required hardware accuracy and\nsoftware complexities. We conduct a comprehensive comparison between two\nsub-Nyquist acquisition strategies for spectrally-sparse signals, the random\ndemodulator and the modulated wideband converter (MWC), in terms of these\nmetrics and draw operative conclusions regarding the choice of analog\ncompression. We then address lowrate signal processing and develop an algorithm\nfor that purpose that enables convenient signal processing at sub-Nyquist rates\nfrom samples obtained by the MWC. We conclude by showing that a variety of\nother sampling approaches for different union classes fit nicely into our\nframework.\n", "versions": [{"version": "v1", "created": "Tue, 3 Nov 2009 09:06:03 GMT"}, {"version": "v2", "created": "Sat, 25 Sep 2010 18:52:59 GMT"}, {"version": "v3", "created": "Tue, 8 Mar 2011 08:21:36 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Mishali", "Moshe", ""], ["Eldar", "Yonina C.", ""], ["Elron", "Asaf", ""]]}, {"id": "0911.0660", "submitter": "Ramy Gohary", "authors": "Ramy H. Gohary and Timothy N. Davidson", "title": "The capacity region of a product of two unmatched Gaussian broadcast\n  channels with three particular messages and a common message", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a Gaussian broadcast channel with two unmatched degraded\ncomponents, three particular messages, and a common message that is intended\nfor all three receivers. It is shown that for this channel superposition coding\nand Gaussian signalling is sufficient to achieve every point in the capacity\nregion.\n", "versions": [{"version": "v1", "created": "Tue, 3 Nov 2009 19:39:07 GMT"}], "update_date": "2009-11-04", "authors_parsed": [["Gohary", "Ramy H.", ""], ["Davidson", "Timothy N.", ""]]}, {"id": "0911.0696", "submitter": "Leonid Gurvits", "authors": "Leonid Gurvits", "title": "A proof of the log-concavity conjecture related to the computation of\n  the ergodic capacity of MIMO channels", "comments": "6 pages, a proof of a conjecture posed in arXiv:0903.1952. We used\n  techniques, developed in arXiv:0711.3496", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An upper bound on the ergodic capacity of {\\bf MIMO} channels was introduced\nrecently in arXiv:0903.1952. This upper bound amounts to the maximization on\nthe simplex of some multilinear polynomial $p(\\lambda_1,...,\\lambda_n)$ with\nnon-negative coefficients. Interestingly, the coefficients are subpermanents of\nsome non-negative matrix. In general, such maximizations problems are {\\bf\nNP-HARD}. But if say, the functional $\\log(p)$ is concave on the simplex and\ncan be efficiently evaluated, then the maximization can also be done\nefficiently. Such log-concavity was conjectured in arXiv:0903.1952. We give in\nthis paper self-contained proof of the conjecture, based on the theory of {\\bf\nH-Stable} polynomials.\n", "versions": [{"version": "v1", "created": "Tue, 3 Nov 2009 22:03:46 GMT"}], "update_date": "2009-11-05", "authors_parsed": [["Gurvits", "Leonid", ""]]}, {"id": "0911.0709", "submitter": "Hong Ju Park", "authors": "Hong Ju Park, Boyu Li, and Ender Ayanoglu", "title": "Constellation Precoded Multiple Beamforming", "comments": "submitted to journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Beamforming techniques that employ Singular Value Decomposition (SVD) are\ncommonly used in Multi-Input Multi-Output (MIMO) wireless communication\nsystems. In the absence of channel coding, when a single symbol is transmitted,\nthese systems achieve the full diversity order provided by the channel; whereas\nwhen multiple symbols are simultaneously transmitted, this property is lost.\nWhen channel coding is employed, full diversity order can be achieved. For\nexample, when Bit-Interleaved Coded Modulation (BICM) is combined with this\ntechnique, full diversity order of NM in an MxN MIMO channel transmitting S\nparallel streams is possible, provided a condition on S and the BICM\nconvolutional code rate is satisfied. In this paper, we present constellation\nprecoded multiple beamforming which can achieve the full diversity order both\nwith BICM-coded and uncoded SVD systems. We provide an analytical proof of this\nproperty. To reduce the computational complexity of Maximum Likelihood (ML)\ndecoding in this system, we employ Sphere Decoding (SD). We report an SD\ntechnique that reduces the computational complexity beyond commonly used\napproaches to SD. This technique achieves several orders of magnitude reduction\nin computational complexity not only with respect to conventional ML decoding\nbut also, with respect to conventional SD.\n", "versions": [{"version": "v1", "created": "Tue, 3 Nov 2009 23:23:53 GMT"}], "update_date": "2009-11-05", "authors_parsed": [["Park", "Hong Ju", ""], ["Li", "Boyu", ""], ["Ayanoglu", "Ender", ""]]}, {"id": "0911.0736", "submitter": "Mark Davenport", "authors": "Mark A. Davenport, Jason N. Laska, Petros T. Boufounos, and Richard G.\n  Baraniuk", "title": "A simple proof that random matrices are democratic", "comments": null, "journal-ref": null, "doi": null, "report-no": "Rice University Department of Electrical and Computer Engineering\n  Technical Report TREE0906", "categories": "math.NA cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recently introduced theory of compressive sensing (CS) enables the\nreconstruction of sparse or compressible signals from a small set of\nnonadaptive, linear measurements. If properly chosen, the number of\nmeasurements can be significantly smaller than the ambient dimension of the\nsignal and yet preserve the significant signal information. Interestingly, it\ncan be shown that random measurement schemes provide a near-optimal encoding in\nterms of the required number of measurements. In this report, we explore\nanother relatively unexplored, though often alluded to, advantage of using\nrandom matrices to acquire CS measurements. Specifically, we show that random\nmatrices are democractic, meaning that each measurement carries roughly the\nsame amount of signal information. We demonstrate that by slightly increasing\nthe number of measurements, the system is robust to the loss of a small number\nof arbitrary measurements. In addition, we draw connections to oversampling and\ndemonstrate stability from the loss of significantly more measurements.\n", "versions": [{"version": "v1", "created": "Wed, 4 Nov 2009 06:09:36 GMT"}], "update_date": "2009-11-05", "authors_parsed": [["Davenport", "Mark A.", ""], ["Laska", "Jason N.", ""], ["Boufounos", "Petros T.", ""], ["Baraniuk", "Richard G.", ""]]}, {"id": "0911.0737", "submitter": "Shirin Jalali", "authors": "Shirin Jalali and Tsachy Weissman", "title": "Multiple Description Coding of Discrete Ergodic Sources", "comments": "6 pages, 3 figures, presented at 2009 Allerton Conference on\n  Communication, Control and Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the problem of Multiple Description (MD) coding of discrete\nergodic processes. We introduce the notion of MD stationary coding, and\ncharacterize its relationship to the conventional block MD coding. In\nstationary coding, in addition to the two rate constraints normally considered\nin the MD problem, we consider another rate constraint which reflects the\nconditional entropy of the process generated by the third decoder given the\nreconstructions of the two other decoders. The relationship that we establish\nbetween stationary and block MD coding enables us to devise a universal\nalgorithm for MD coding of discrete ergodic sources, based on simulated\nannealing ideas that were recently proven useful for the standard rate\ndistortion problem.\n", "versions": [{"version": "v1", "created": "Wed, 4 Nov 2009 06:04:58 GMT"}], "update_date": "2009-11-05", "authors_parsed": [["Jalali", "Shirin", ""], ["Weissman", "Tsachy", ""]]}, {"id": "0911.0820", "submitter": "Marw Ali Ms", "authors": "Ahmed Ahmedin, Marwa Ali, Ahmed Sultan and Mohammed Nafie", "title": "Power and Transmission Duration Control for Un-Slotted Cognitive Radio\n  Networks", "comments": "submitted to DySPAN 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an unslotted primary channel with alternating on/off activity and\nprovide a solution to the problem of finding the optimal secondary transmission\npower and duration given some sensing outcome. The goal is to maximize a\nweighted sum of the primary and secondary throughput where the weight is\ndetermined by the minimum rate required by the primary terminals. The primary\ntransmitter sends at a fixed power and a fixed rate. Its on/off durations\nfollow an exponential distribution. Two sensing schemes are considered: perfect\nsensing in which the actual state of the primary channel is revealed, and soft\nsensing in which the secondary transmission power and time are determined based\non the sensing metric directly. We use an upperbound for the secondary\nthroughput assuming that the secondary receiver tracks the instantaneous\nsecondary channel state information. The objective function is non-convex and,\nhence, the optimal solution is obtained via exhaustive search. Our results show\nthat an increase in the overall weighted throughput can be obtained by allowing\nthe secondary to transmit even when the channel is found to be busy. For the\nexamined system parameter values, the throughput gain from soft sensing is\nmarginal. Further investigation is needed for assessing the potential of soft\nsensing.\n", "versions": [{"version": "v1", "created": "Wed, 4 Nov 2009 13:23:40 GMT"}, {"version": "v2", "created": "Wed, 11 Nov 2009 08:46:18 GMT"}], "update_date": "2009-11-11", "authors_parsed": [["Ahmedin", "Ahmed", ""], ["Ali", "Marwa", ""], ["Sultan", "Ahmed", ""], ["Nafie", "Mohammed", ""]]}, {"id": "0911.0844", "submitter": "Qiyu Sun", "authors": "M. Zuhair Nashed and Qiyu Sun", "title": "Sampling and Reconstruction of Signals in a Reproducing Kernel Subspace\n  of $L^p({\\Bbb R}^d)$", "comments": null, "journal-ref": "Journal of Functional Analysis Volume 258, Issue 7, 1 April 2010,\n  Pages 2422-2452", "doi": "10.1016/j.jfa.2009.12.012", "report-no": null, "categories": "cs.IT math.FA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider sampling and reconstruction of signals in a\nreproducing kernel subspace of $L^p(\\Rd), 1\\le p\\le \\infty$, associated with an\nidempotent integral operator whose kernel has certain off-diagonal decay and\nregularity. The space of $p$-integrable non-uniform splines and the\nshift-invariant spaces generated by finitely many localized functions are our\nmodel examples of such reproducing kernel subspaces of $L^p(\\Rd)$. We show that\na signal in such reproducing kernel subspaces can be reconstructed in a stable\nway from its samples taken on a relatively-separated set with sufficiently\nsmall gap. We also study the exponential convergence, consistency, and the\nasymptotic pointwise error estimate of the iterative approximation-projection\nalgorithm and the iterative frame algorithm for reconstructing a signal in\nthose reproducing kernel spaces from its samples with sufficiently small gap.\n", "versions": [{"version": "v1", "created": "Wed, 4 Nov 2009 14:59:35 GMT"}], "update_date": "2010-08-26", "authors_parsed": [["Nashed", "M. Zuhair", ""], ["Sun", "Qiyu", ""]]}, {"id": "0911.0874", "submitter": "Paul Cuff", "authors": "Paul Cuff (Princeton University)", "title": "State Information in Bayesian Games", "comments": "Presented at Allerton 2009, 6 pages, 5 eps figures, uses IEEEtran.cls", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two-player zero-sum repeated games are well understood. Computing the value\nof such a game is straightforward. Additionally, if the payoffs are dependent\non a random state of the game known to one, both, or neither of the players,\nthe resulting value of the game has been analyzed under the framework of\nBayesian games. This investigation considers the optimal performance in a game\nwhen a helper is transmitting state information to one of the players.\n  Encoding information for an adversarial setting (game) requires a different\nresult than rate-distortion theory provides. Game theory has accentuated the\nimportance of randomization (mixed strategy), which does not find a significant\nrole in most communication modems and source coding codecs. Higher rates of\ncommunication, used in the right way, allow the message to include the\nnecessary random component useful in games.\n", "versions": [{"version": "v1", "created": "Wed, 4 Nov 2009 16:46:13 GMT"}], "update_date": "2009-11-05", "authors_parsed": [["Cuff", "Paul", "", "Princeton University"]]}, {"id": "0911.0905", "submitter": "Umer Salim", "authors": "Umer Salim, David Gesbert and Dirk Slock", "title": "Combining Training and Quantized Feedback in Multi-Antenna Reciprocal\n  Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The communication between a multiple-antenna transmitter and multiple\nreceivers (users) with either a single or multiple-antenna each can be\nsignificantly enhanced by providing the channel state information at the\ntransmitter (CSIT) of the users, as this allows for scheduling, beamforming and\nmultiuser multiplexing gains. The traditional view on how to enable CSIT has\nbeen as follows so far: In time-division duplexed (TDD) systems, uplink (UL)\nand downlink (DL) channel reciprocity allows the use of a training sequence in\nthe UL direction, which is exploited to obtain an UL channel estimate. This\nestimate is in turn recycled in the next downlink slot. In frequency-division\nduplexed (FDD) systems, which lack the UL and DL reciprocity, the CSIT is\nprovided via the use of a dedicated feedback link of limited capacity between\nthe receivers and the transmitter. In this paper, we focus on TDD systems and\nput this classical approach in question. In particular, we show that the\ntraditional TDD setup above fails to fully exploit the channel reciprocity in\nits true sense. In fact, we show that the system can benefit from a combined\nCSIT acquisition strategy mixing the use of limited feedback and that of a\ntraining sequence. This combining gives rise to a very interesting joint\nestimation and detection problem for which we propose two iterative algorithms.\nAn outage rate based framework is also developed which gives the optimal\nresource split between training and feedback. We demonstrate the potential of\nthis hybrid combining in terms of the improved CSIT quality under a global\ntraining and feedback resource constraint.\n", "versions": [{"version": "v1", "created": "Wed, 4 Nov 2009 18:51:18 GMT"}], "update_date": "2009-11-05", "authors_parsed": [["Salim", "Umer", ""], ["Gesbert", "David", ""], ["Slock", "Dirk", ""]]}, {"id": "0911.0971", "submitter": "Hans J{\\o}rgen Bang", "authors": "H. J. Bang, D. Gesbert", "title": "Multicell Zero-Forcing and User Scheduling on the Downlink of a Linear\n  Cell Array", "comments": "15 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coordinated base station (BS) transmission has attracted much interest for\nits potential to increase the capacity of wireless networks. Yet at the same\ntime, the achievable sum-rate with single-cell processing (SCP) scales\noptimally with the number of users under Rayleigh fading conditions. One may\ntherefore ask if the value of BS coordination is limited in the many-user\nregime from a sum-rate perspective. With this in mind we consider multicell\nzero-forcing beamforming (ZFBF) on the downlink of a linear cell-array. We\nfirst identify the beamforming weights and the optimal scheduling policy under\na per-base power constraint. We then compare the number of users m and n\nrequired per-cell to achieve the same mean SINR, after optimal scheduling, with\nSCP and ZFBF respectively. Specifically, we show that the ratio m/n grows\nlogarithmically with n. Finally, we demonstrate that the gain in sum-rate\nbetween ZFBF and SCP is significant for all practical values of number of\nusers.\n", "versions": [{"version": "v1", "created": "Thu, 5 Nov 2009 20:29:23 GMT"}, {"version": "v2", "created": "Fri, 6 Nov 2009 09:38:39 GMT"}], "update_date": "2009-11-06", "authors_parsed": [["Bang", "H. J.", ""], ["Gesbert", "D.", ""]]}, {"id": "0911.1054", "submitter": "Adeel Razi", "authors": "Adeel Razi, Daniel J. Ryan, Iain B. Collings, Jinhong Yuan", "title": "Sum Rates, Rate Allocation, and User Scheduling for Multi-User MIMO\n  Vector Perturbation Precoding", "comments": "27 pages with 6 figures and 2 tables. Accepted for publication in\n  IEEE Trans. Wireless Commu", "journal-ref": null, "doi": "10.1109/TWC.2010.01.090649", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the multiuser multiple-input multiple-output (MIMO)\nbroadcast channel. We consider the case where the multiple transmit antennas\nare used to deliver independent data streams to multiple users via vector\nperturbation. We derive expressions for the sum rate in terms of the average\nenergy of the precoded vector, and use this to derive a high signal-to-noise\nratio (SNR) closed-form upper bound, which we show to be tight via simulation.\nWe also propose a modification to vector perturbation where different rates can\nbe allocated to different users. We conclude that for vector perturbation\nprecoding most of the sum rate gains can be achieved by reducing the rate\nallocation problem to the user selection problem. We then propose a\nlow-complexity user selection algorithm that attempts to maximize the high-SNR\nsum rate upper bound. Simulations show that the algorithm outperforms other\nuser selection algorithms of similar complexity.\n", "versions": [{"version": "v1", "created": "Thu, 5 Nov 2009 15:20:32 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Razi", "Adeel", ""], ["Ryan", "Daniel J.", ""], ["Collings", "Iain B.", ""], ["Yuan", "Jinhong", ""]]}, {"id": "0911.1072", "submitter": "Nicolas Bitouz\\'e", "authors": "Nicolas Bitouze, Alexandre Graell i Amat, Eirik Rosnes", "title": "Error Correcting Coding for a Non-symmetric Ternary Channel", "comments": "Submitted to IEEE Transactions on Information Theory. Part of this\n  work was presented at the Information Theory and Applications Workshop 2009", "journal-ref": "IEEE Trans. Inf. Theory, vol. 56, no. 11, pp. 5715-5729, Nov. 2010", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ternary channels can be used to model the behavior of some memory devices,\nwhere information is stored in three different levels. In this paper, error\ncorrecting coding for a ternary channel where some of the error transitions are\nnot allowed, is considered. The resulting channel is non-symmetric, therefore\nclassical linear codes are not optimal for this channel. We define the\nmaximum-likelihood (ML) decoding rule for ternary codes over this channel and\nshow that it is complex to compute, since it depends on the channel error\nprobability. A simpler alternative decoding rule which depends only on code\nproperties, called $\\da$-decoding, is then proposed. It is shown that\n$\\da$-decoding and ML decoding are equivalent, i.e., $\\da$-decoding is optimal,\nunder certain conditions. Assuming $\\da$-decoding, we characterize the error\ncorrecting capabilities of ternary codes over the non-symmetric ternary\nchannel. We also derive an upper bound and a constructive lower bound on the\nsize of codes, given the code length and the minimum distance. The results\narising from the constructive lower bound are then compared, for short sizes,\nto optimal codes (in terms of code size) found by a clique-based search. It is\nshown that the proposed construction method gives good codes, and that in some\ncases the codes are optimal.\n", "versions": [{"version": "v1", "created": "Thu, 5 Nov 2009 16:15:29 GMT"}], "update_date": "2011-05-31", "authors_parsed": [["Bitouze", "Nicolas", ""], ["Amat", "Alexandre Graell i", ""], ["Rosnes", "Eirik", ""]]}, {"id": "0911.1082", "submitter": "Yan Zhu", "authors": "Yan Zhu and Dongning Guo", "title": "Ergodic Fading One-sided Interference Channels without State Information\n  at Transmitters", "comments": "Submitted to IEEE Transaction on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work studies the capacity region of a two-user ergodic interference\nchannel with fading, where only one of the users is subject to interference\nfrom the other user, and the channel state information (CSI) is only available\nat the receivers. A layered erasure model with one-sided interference and with\narbitrary fading statistics is studied first, whose capacity region is\ncompletely determined as a polygon. Each dominant rate pair can be regarded as\nthe outcome of a trade-off between the rate gain of the interference-free user\nand the rate loss of the other user due to interference. Using insights from\nthe layered erasure model, inner and outer bounds of the capacity region are\nprovided for the one-sided fading Gaussian interference channels. In\nparticular, the inner bound is achieved by artificially creating layers in the\nsignaling of the interference-free user. The outer bound is developed by\ncharacterizing a similar trade-off as in the erasure model by taking a\n\"layered\" view using the incremental channel approach. Furthermore, the gap\nbetween the inner and outer bounds is no more than 12.772 bits per channel use\nper user, regardless of the signal-to-noise ratios and fading statistics.\n", "versions": [{"version": "v1", "created": "Thu, 5 Nov 2009 17:26:32 GMT"}], "update_date": "2009-11-06", "authors_parsed": [["Zhu", "Yan", ""], ["Guo", "Dongning", ""]]}, {"id": "0911.1090", "submitter": "Georg B\\\"ocherer", "authors": "Georg B\\\"ocherer and Valdemar Cardoso da Rocha Junior and Cecilio\n  Pimentel", "title": "On the Capacity of Constrained Systems", "comments": "6 pages, to be presented at SCC 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the first chapter of Shannon's \"A Mathematical Theory of Communication,\"\nit is shown that the maximum entropy rate of an input process of a constrained\nsystem is limited by the combinatorial capacity of the system. Shannon\nconsiders systems where the constraints define regular languages and uses\nresults from matrix theory in his derivations. In this work, the regularity\nconstraint is dropped. Using generating functions, it is shown that the maximum\nentropy rate of an input process is upper-bounded by the combinatorial capacity\nin general. The presented results also allow for a new approach to systems with\nregular constraints. As an example, the results are applied to binary sequences\nthat fulfill the (j,k) run-length constraint and by using the proposed\nframework, a simple formula for the combinatorial capacity is given and a\nmaxentropic input process is defined.\n", "versions": [{"version": "v1", "created": "Thu, 5 Nov 2009 18:13:26 GMT"}, {"version": "v2", "created": "Fri, 20 Nov 2009 13:28:45 GMT"}], "update_date": "2009-11-20", "authors_parsed": [["Böcherer", "Georg", ""], ["Junior", "Valdemar Cardoso da Rocha", ""], ["Pimentel", "Cecilio", ""]]}, {"id": "0911.1275", "submitter": "Yuri Suhov", "authors": "Mark Kelbert and Yuri Suhov", "title": "Continuity of mutual entropy in the large signal-to-noise ratio limit", "comments": "This paper has been withdrawn since it has been already published,\n  in: {\\it Stochastic Analysis 2010.} Springer-Verlag: Berlin, 2010, pp.\n  281--299; arXiv:0911", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.IR math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article addresses the issue of the proof of the entropy power inequality\n(EPI), an important tool in the analysis of Gaussian channels of information\ntransmission, proposed by Shannon.\n  We analyse continuity properties of the mutual entropy of the input and\noutput signals in an additive memoryless channel and discuss assumptions under\nwhich the entropy-power inequality holds true.\n", "versions": [{"version": "v1", "created": "Fri, 6 Nov 2009 15:20:54 GMT"}, {"version": "v2", "created": "Mon, 21 Jun 2010 11:43:41 GMT"}, {"version": "v3", "created": "Tue, 2 Apr 2013 20:32:51 GMT"}], "update_date": "2013-04-04", "authors_parsed": [["Kelbert", "Mark", ""], ["Suhov", "Yuri", ""]]}, {"id": "0911.1298", "submitter": "Sudhir R. Ghorpade", "authors": "Peter Beelen, Sudhir R. Ghorpade, and Tom Hoeholdt", "title": "Affine Grassmann Codes", "comments": "Slightly Revised Version; 18 pages", "journal-ref": "IEEE Trans. Inform. Theory 56 (2010), no. 7, 3166-3176", "doi": "10.1109/TIT.2010.2048470", "report-no": null, "categories": "cs.IT math.AG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a new class of linear codes, called affine Grassmann codes. These\ncan be viewed as a variant of generalized Reed-Muller codes and are closely\nrelated to Grassmann codes. We determine the length, dimension, and the minimum\ndistance of any affine Grassmann code. Moreover, we show that affine Grassmann\ncodes have a large automorphism group and determine the number of minimum\nweight codewords.\n", "versions": [{"version": "v1", "created": "Fri, 6 Nov 2009 16:58:09 GMT"}, {"version": "v2", "created": "Fri, 11 Jun 2010 13:25:32 GMT"}], "update_date": "2010-06-22", "authors_parsed": [["Beelen", "Peter", ""], ["Ghorpade", "Sudhir R.", ""], ["Hoeholdt", "Tom", ""]]}, {"id": "0911.1368", "submitter": "Sina Jafarpour", "authors": "Sina Jafarpour, Rebecca Willett, Maxim Raginsky, Robert Calderbank", "title": "Performance Bounds for Expander-based Compressed Sensing in the presence\n  of Poisson Noise", "comments": "Received the best student paper award in Asilomar 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper provides performance bounds for compressed sensing in the presence\nof Poisson noise using expander graphs. The Poisson noise model is appropriate\nfor a variety of applications, including low-light imaging and digital\nstreaming, where the signal-independent and/or bounded noise models used in the\ncompressed sensing literature are no longer applicable. In this paper, we\ndevelop a novel sensing paradigm based on expander graphs and propose a MAP\nalgorithm for recovering sparse or compressible signals from Poisson\nobservations. The geometry of the expander graphs and the positivity of the\ncorresponding sensing matrices play a crucial role in establishing the bounds\non the signal reconstruction error of the proposed algorithm. The geometry of\nthe expander graphs makes them provably superior to random dense sensing\nmatrices, such as Gaussian or partial Fourier ensembles, for the Poisson noise\nmodel. We support our results with experimental demonstrations.\n", "versions": [{"version": "v1", "created": "Fri, 6 Nov 2009 22:23:30 GMT"}, {"version": "v2", "created": "Tue, 10 Nov 2009 19:20:28 GMT"}, {"version": "v3", "created": "Wed, 25 Nov 2009 08:02:02 GMT"}], "update_date": "2009-11-25", "authors_parsed": [["Jafarpour", "Sina", ""], ["Willett", "Rebecca", ""], ["Raginsky", "Maxim", ""], ["Calderbank", "Robert", ""]]}, {"id": "0911.1383", "submitter": "Marc Harper", "authors": "Marc Harper", "title": "Information Geometry and Evolutionary Game Theory", "comments": "Added references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.DS math.IT nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Shahshahani geometry of evolutionary game theory is realized as the\ninformation geometry of the simplex, deriving from the Fisher information\nmetric of the manifold of categorical probability distributions. Some essential\nconcepts in evolutionary game theory are realized information-theoretically.\nResults are extended to the Lotka-Volterra equation and to multiple population\nsystems.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2009 19:16:22 GMT"}], "update_date": "2009-11-10", "authors_parsed": [["Harper", "Marc", ""]]}, {"id": "0911.1388", "submitter": "Victor Miller", "authors": "Don Coppersmith, Victor S. Miller", "title": "Binary Non-tiles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.IT math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A subset V of GF(2)^n is a tile if GF(2)^n can be covered by disjoint\ntranslates of V. In other words, V is a tile if and only if there is a subset A\nof GF(2)^n such that V+A = GF(2)^n uniquely (i.e., v + a = v' + a' implies that\nv=v' and a=a' where v,v' in V and a,a' in A). In some problems in coding theory\nand hashing we are given a putative tile V, and wish to know whether or not it\nis a tile. In this paper we give two computational criteria for certifying that\nV is not a tile. The first involves impossibility of a bin-packing problem, and\nthe second involves infeasibility of a linear program. We apply both criteria\nto a list of putative tiles given by Gordon, Miller, and Ostapenko in that none\nof them are, in fact, tiles.\n", "versions": [{"version": "v1", "created": "Sat, 7 Nov 2009 03:25:40 GMT"}, {"version": "v2", "created": "Mon, 1 Aug 2011 02:53:14 GMT"}], "update_date": "2011-08-02", "authors_parsed": [["Coppersmith", "Don", ""], ["Miller", "Victor S.", ""]]}, {"id": "0911.1426", "submitter": "Hossein Bagheri", "authors": "Hossein Bagheri, Abolfazl S. Motahari, and Amir K. Khandani", "title": "On the Capacity of the Half-Duplex Diamond Channel", "comments": "25 pages, 2 figures, submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": "10.1109/ISIT.2010.5513566", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a dual-hop communication system composed of a source S and a\ndestination D connected through two non-interfering half-duplex relays, R1 and\nR2, is considered. In the literature of Information Theory, this configuration\nis known as the diamond channel. In this setup, four transmission modes are\npresent, namely: 1) S transmits, and R1 and R2 listen (broadcast mode), 2) S\ntransmits, R1 listens, and simultaneously, R2 transmits and D listens. 3) S\ntransmits, R2 listens, and simultaneously, R1 transmits and D listens. 4) R1,\nR2 transmit, and D listens (multiple-access mode). Assuming a constant power\nconstraint for all transmitters, a parameter $\\Delta$ is defined, which\ncaptures some important features of the channel. It is proven that for\n$\\Delta$=0 the capacity of the channel can be attained by successive relaying,\ni.e, using modes 2 and 3 defined above in a successive manner. This strategy\nmay have an infinite gap from the capacity of the channel when $\\Delta\\neq$0.\nTo achieve rates as close as 0.71 bits to the capacity, it is shown that the\ncases of $\\Delta$>0 and $\\Delta$<0 should be treated differently. Using new\nupper bounds based on the dual problem of the linear program associated with\nthe cut-set bounds, it is proven that the successive relaying strategy needs to\nbe enhanced by an additional broadcast mode (mode 1), or multiple access mode\n(mode 4), for the cases of $\\Delta$<0 and $\\Delta$>0, respectively.\nFurthermore, it is established that under average power constraints the\naforementioned strategies achieve rates as close as 3.6 bits to the capacity of\nthe channel.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2009 20:58:23 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Bagheri", "Hossein", ""], ["Motahari", "Abolfazl S.", ""], ["Khandani", "Amir K.", ""]]}, {"id": "0911.1564", "submitter": "Guangwu Xu", "authors": "T. Tony Cai, Lie Wang, Guangwu Xu", "title": "New Bounds for Restricted Isometry Constants", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we show that if the restricted isometry constant $\\delta_k$ of\nthe compressed sensing matrix satisfies \\[ \\delta_k < 0.307, \\] then $k$-sparse\nsignals are guaranteed to be recovered exactly via $\\ell_1$ minimization when\nno noise is present and $k$-sparse signals can be estimated stably in the noisy\ncase. It is also shown that the bound cannot be substantively improved. An\nexplicitly example is constructed in which $\\delta_{k}=\\frac{k-1}{2k-1} < 0.5$,\nbut it is impossible to recover certain $k$-sparse signals.\n", "versions": [{"version": "v1", "created": "Sun, 8 Nov 2009 21:58:47 GMT"}], "update_date": "2009-11-10", "authors_parsed": [["Cai", "T. Tony", ""], ["Wang", "Lie", ""], ["Xu", "Guangwu", ""]]}, {"id": "0911.1713", "submitter": "Mathieu Bogaerts", "authors": "Mathieu Bogaerts", "title": "Isometries and Construction of Permutation Arrays", "comments": "6 pages, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An (n,d)-permutation code is a subset C of Sym(n) such that the Hamming\ndistance d_H between any two distinct elements of C is at least equal to d. In\nthis paper, we use the characterisation of the isometry group of the metric\nspace (Sym(n),d_H) in order to develop generating algorithms with rejection of\nisomorphic objects. To classify the (n,d)-permutation codes up to isometry, we\nconstruct invariants and study their efficiency. We give the numbers of\nnon-isometric (4,3)- and (5,4)- permutation codes. Maximal and balanced\n(n,d)-permutation codes are enumerated in a constructive way.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2009 16:19:15 GMT"}], "update_date": "2009-11-10", "authors_parsed": [["Bogaerts", "Mathieu", ""]]}, {"id": "0911.1743", "submitter": "Ryan Hinton", "authors": "Ryan Hinton (University of Virginia and L-3 Communications CSW) and\n  Stephen G. Wilson (University of Virginia)", "title": "Analysis of peeling decoder for MET ensembles", "comments": "Preprint of submission to Information Theory Workshop (ITW) 2010. 5\n  pages, two figures (from seven files). Processed with PDFLaTeX including\n  IEEEtran style, amsmath, amsfonts, cite, array, graphicx, and amsthm packages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The peeling decoder introduced by Luby, et al. allows analysis of LDPC\ndecoding for the binary erasure channel (BEC). For irregular ensembles, they\nanalyze the decoder state as a Markov process and present a solution to the\ndifferential equations describing the process mean. Multi-edge type (MET)\nensembles allow greater precision through specifying graph connectivity. We\ngeneralize the the peeling decoder for MET ensembles and derive analogous\ndifferential equations. We offer a new change of variables and solution to the\nnode fraction evolutions in the general (MET) case. This result is preparatory\nto investigating finite-length ensemble behavior.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2009 18:38:53 GMT"}], "update_date": "2009-11-10", "authors_parsed": [["Hinton", "Ryan", "", "University of Virginia and L-3 Communications CSW"], ["Wilson", "Stephen G.", "", "University of Virginia"]]}, {"id": "0911.1745", "submitter": "Tuvi Etzion", "authors": "Tuvi Etzion", "title": "Sequence Folding, Lattice Tiling, and Multidimensional Coding", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Folding a sequence $S$ into a multidimensional box is a well-known method\nwhich is used as a multidimensional coding technique. The operation of folding\nis generalized in a way that the sequence $S$ can be folded into various shapes\nand not just a box. The new definition of folding is based on a lattice tiling\nfor the given shape $\\cS$ and a direction in the $D$-dimensional integer grid.\nNecessary and sufficient conditions that a lattice tiling for $\\cS$ combined\nwith a direction define a folding of a sequence into $\\cS$ are derived. The\nimmediate and most impressive application is some new lower bounds on the\nnumber of dots in two-dimensional synchronization patterns. This can be also\ngeneralized for multidimensional synchronization patterns. The technique and\nits application for two-dimensional synchronization patterns, raise some\ninteresting problems in discrete geometry. We will also discuss these problems.\nIt is also shown how folding can be used to construct multidimensional\nerror-correcting codes. Finally, by using the new definition of folding,\nmultidimensional pseudo-random arrays with various shapes are generated.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2009 18:55:24 GMT"}], "update_date": "2009-11-10", "authors_parsed": [["Etzion", "Tuvi", ""]]}, {"id": "0911.1763", "submitter": "Marc Harper", "authors": "Marc Harper", "title": "The Replicator Equation as an Inference Dynamic", "comments": "Added a discussion of the discrete dynamic.", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The replicator equation is interpreted as a continuous inference equation and\na formal similarity between the discrete replicator equation and Bayesian\ninference is described. Further connections between inference and the\nreplicator equation are given including a discussion of information divergences\nand exponential families as solutions for the replicator dynamic, using Fisher\ninformation and information geometry.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2009 20:38:46 GMT"}, {"version": "v2", "created": "Tue, 1 Dec 2009 19:12:38 GMT"}, {"version": "v3", "created": "Mon, 3 May 2010 21:53:31 GMT"}], "update_date": "2010-05-05", "authors_parsed": [["Harper", "Marc", ""]]}, {"id": "0911.1764", "submitter": "Marc Harper", "authors": "Marc Harper", "title": "Escort Evolutionary Game Theory", "comments": "Minor typo correction", "journal-ref": "Physica D: Nonlinear Phenomena, Volume 240, Issue 18, 1 September\n  2011, Pages 1411-1415", "doi": "10.1016/j.physd.2011.04.008", "report-no": null, "categories": "math.DS cs.IT math.DG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A family of replicator-like dynamics, called the escort replicator equation,\nis constructed using information-geometric concepts and generalized information\nentropies and diverenges from statistical thermodynamics. Lyapunov functions\nand escort generalizations of basic concepts and constructions in evolutionary\ngame theory are given, such as an escorted Fisher's Fundamental theorem and\ngeneralizations of the Shahshahani geometry.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2009 20:41:48 GMT"}, {"version": "v2", "created": "Tue, 1 Dec 2009 19:14:40 GMT"}, {"version": "v3", "created": "Fri, 7 May 2010 20:27:20 GMT"}, {"version": "v4", "created": "Tue, 18 May 2010 00:06:49 GMT"}, {"version": "v5", "created": "Fri, 24 Feb 2012 07:53:20 GMT"}], "update_date": "2012-02-27", "authors_parsed": [["Harper", "Marc", ""]]}, {"id": "0911.1826", "submitter": "William Martin", "authors": "J. H. Koolen (USTC), W. S. Lee (POSTECH), W. J. Martin (WPI), H.\n  Tanaka (Tohoku)", "title": "Arithmetic completely regular codes", "comments": "26 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we explore completely regular codes in the Hamming graphs and\nrelated graphs. Experimental evidence suggests that many completely regular\ncodes have the property that the eigenvalues of the code are in arithmetic\nprogression. In order to better understand these \"arithmetic completely regular\ncodes\", we focus on cartesian products of completely regular codes and products\nof their corresponding coset graphs in the additive case. Employing earlier\nresults, we are then able to prove a theorem which nearly classifies these\ncodes in the case where the graph admits a completely regular partition into\nsuch codes (e.g, the cosets of some additive completely regular code).\nConnections to the theory of distance-regular graphs are explored and several\nopen questions are posed.\n", "versions": [{"version": "v1", "created": "Tue, 10 Nov 2009 04:32:59 GMT"}, {"version": "v2", "created": "Tue, 28 Jan 2014 19:50:32 GMT"}, {"version": "v3", "created": "Thu, 11 Feb 2016 00:35:24 GMT"}], "update_date": "2016-02-12", "authors_parsed": [["Koolen", "J. H.", "", "USTC"], ["Lee", "W. S.", "", "POSTECH"], ["Martin", "W. J.", "", "WPI"], ["Tanaka", "H.", "", "Tohoku"]]}, {"id": "0911.1849", "submitter": "Omar El Ayach", "authors": "Omar El Ayach, Steven W. Peters, and Robert W. Heath Jr", "title": "The Feasibility of Interference Alignment over Measured MIMO-OFDM\n  Channels", "comments": "13 double column pages, 16 figures, accepted for publication in IEEE\n  Transactions on Vehicular Technology", "journal-ref": "IEEE Transactions on Vehicular Technology, vol. 59, no. 9, pp.\n  4309-4321, November 2010", "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interference alignment (IA) has been shown to achieve the maximum achievable\ndegrees of freedom in the interference channel. This results in sum rate\nscaling linearly with the number of users in the high signal-to-noise-ratio\n(SNR) regime. Linear scaling is achieved by precoding transmitted signals to\nalign interference subspaces at the receivers, given channel knowledge of all\ntransmit-receive pairs, effectively reducing the number of discernible\ninterferers. The theory of IA was derived under assumptions about the richness\nof scattering in the propagation channel; practical channels do not guarantee\nsuch ideal characteristics. This paper presents the first experimental study of\nIA in measured multiple-input multiple-output orthogonal frequency-division\nmultiplexing (MIMO-OFDM) interference channels. Our measurement campaign\nincludes a variety of indoor and outdoor measurement scenarios at The\nUniversity of Texas at Austin. We show that IA achieves the claimed scaling\nfactors, or degrees of freedom, in several measured channel settings for a 3\nuser, 2 antennas per node setup. In addition to verifying the claimed\nperformance, we characterize the effect of Kronecker spatial correlation on sum\nrate and present two other correlation measures, which we show are more tightly\nrelated to the achieved sum rate.\n", "versions": [{"version": "v1", "created": "Tue, 10 Nov 2009 18:36:04 GMT"}, {"version": "v2", "created": "Fri, 26 Feb 2010 06:42:10 GMT"}, {"version": "v3", "created": "Wed, 13 Oct 2010 23:01:48 GMT"}], "update_date": "2013-04-15", "authors_parsed": [["Ayach", "Omar El", ""], ["Peters", "Steven W.", ""], ["Heath", "Robert W.", "Jr"]]}, {"id": "0911.1934", "submitter": "Gustavo L. Gilardoni", "authors": "Gustavo L. Gilardoni", "title": "On a Gel'fand-Yaglom-Peres theorem for f-divergences", "comments": "1+4 pages, no figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is shown that the $f$-divergence between two probability measures $P$ and\n$R$ equals the supremum of the same $f$-divergence computed over all finite\nmeasurable partitions of the original space, thus generalizing results\npreviously proved by Gel'fand and Yaglom and by Peres for the Information\nDivergence and more recently by Dukkipati, Bhatnagar and Murty for the Tsallis'\nand Renyi's divergences.\n", "versions": [{"version": "v1", "created": "Tue, 10 Nov 2009 15:58:57 GMT"}], "update_date": "2009-11-11", "authors_parsed": [["Gilardoni", "Gustavo L.", ""]]}, {"id": "0911.2022", "submitter": "Wei Liu", "authors": "Wei Liu and Biao Chen", "title": "Interference Channels With Arbitrarily Correlated Sources", "comments": "Submitted to IEEE Transaction on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Communicating arbitrarily correlated sources over interference channels is\nconsidered in this paper. A sufficient condition is found for the lossless\ntransmission of a pair of correlated sources over a discrete memoryless\ninterference channel. With independent sources, the sufficient condition\nreduces to the Han-Kobayashi achievable rate region for the interference\nchannel. For a special correlation structure (in the sense of Slepian-Wolf,\n1973), the proposed region reduces to the known achievable region for\ninterference channels with common information. A simple example is given to\nshow that the separation approach, with Slepian-Wolf encoding followed by\noptimal channel coding, is strictly suboptimal.\n", "versions": [{"version": "v1", "created": "Tue, 10 Nov 2009 22:42:13 GMT"}], "update_date": "2009-11-12", "authors_parsed": [["Liu", "Wei", ""], ["Chen", "Biao", ""]]}, {"id": "0911.2023", "submitter": "Aditya Mahajan", "authors": "Aditya Mahajan and Sekhar Tatikonda", "title": "Opportunistic capacity and error exponent regions for compound channel\n  with feedback", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Variable length communication over a compound channel with feedback is\nconsidered. Traditionally, capacity of a compound channel without feedback is\ndefined as the maximum rate that is determined before the start of\ncommunication such that communication is reliable. This traditional definition\nis pessimistic. In the presence of feedback, an opportunistic definition is\ngiven. Capacity is defined as the maximum rate that is determined at the end of\ncommunication such that communication is reliable. Thus, the transmission rate\ncan adapt to the channel chosen by nature. Under this definition, feedback\ncommunication over a compound channel is conceptually similar to multi-terminal\ncommunication. Transmission rate is a vector rather than a scalar; channel\ncapacity is a region rather than a scalar; error exponent is a region rather\nthan a scalar. In this paper, variable length communication over a compound\nchannel with feedback is formulated, its opportunistic capacity region is\ncharacterized, and lower bounds for its error exponent region are provided..\n", "versions": [{"version": "v1", "created": "Tue, 10 Nov 2009 22:52:23 GMT"}, {"version": "v2", "created": "Tue, 6 Apr 2010 20:35:30 GMT"}, {"version": "v3", "created": "Wed, 29 Jun 2011 18:10:44 GMT"}], "update_date": "2011-06-30", "authors_parsed": [["Mahajan", "Aditya", ""], ["Tatikonda", "Sekhar", ""]]}, {"id": "0911.2053", "submitter": "I-Hsiang Wang", "authors": "I-Hsiang Wang and David N. C. Tse", "title": "Interference Mitigation Through Limited Receiver Cooperation", "comments": "Submitted to IEEE Transactions on Information Theory. 69 pages, 14\n  figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interference is a major issue limiting the performance in wireless networks.\nCooperation among receivers can help mitigate interference by forming\ndistributed MIMO systems. The rate at which receivers cooperate, however, is\nlimited in most scenarios. How much interference can one bit of receiver\ncooperation mitigate? In this paper, we study the two-user Gaussian\ninterference channel with conferencing decoders to answer this question in a\nsimple setting. We identify two regions regarding the gain from receiver\ncooperation: linear and saturation regions. In the linear region receiver\ncooperation is efficient and provides a degrees-of-freedom gain, which is\neither one cooperation bit buys one more bit or two cooperation bits buy one\nmore bit until saturation. In the saturation region receiver cooperation is\ninefficient and provides a power gain, which is at most a constant regardless\nof the rate at which receivers cooperate. The conclusion is drawn from the\ncharacterization of capacity region to within two bits. The proposed strategy\nconsists of two parts: (1) the transmission scheme, where superposition\nencoding with a simple power split is employed, and (2) the cooperative\nprotocol, where one receiver quantize-bin-and-forwards its received signal, and\nthe other after receiving the side information decode-bin-and-forwards its\nreceived signal.\n", "versions": [{"version": "v1", "created": "Wed, 11 Nov 2009 05:08:39 GMT"}], "update_date": "2009-11-12", "authors_parsed": [["Wang", "I-Hsiang", ""], ["Tse", "David N. C.", ""]]}, {"id": "0911.2197", "submitter": "P. G. L. Porta Mana", "authors": "P. G. L. Porta Mana", "title": "On the relation between plausibility logic and the maximum-entropy\n  principle: a numerical study", "comments": "24 pages of main text and references, 8 pages of tables, 7 pages of\n  additional references", "journal-ref": null, "doi": null, "report-no": "Perimeter Institute pi-other-154", "categories": "math.PR cs.IT math.IT physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  What is the relationship between plausibility logic and the principle of\nmaximum entropy? When does the principle give unreasonable or wrong results?\nWhen is it appropriate to use the rule `expectation = average'? Can\nplausibility logic give the same answers as the principle, and better answers\nif those of the principle are unreasonable? To try to answer these questions,\nthis study offers a numerical collection of plausibility distributions given by\nthe maximum-entropy principle and by plausibility logic for a set of fifteen\nsimple problems: throwing dice.\n", "versions": [{"version": "v1", "created": "Wed, 11 Nov 2009 20:38:23 GMT"}], "update_date": "2016-05-19", "authors_parsed": [["Mana", "P. G. L. Porta", ""]]}, {"id": "0911.2346", "submitter": "Soheil Mohajer", "authors": "Soheil Mohajer, Chao Tian, Suhas N. Diggavi", "title": "Asymmetric Multilevel Diversity Coding and Asymmetric Gaussian Multiple\n  Descriptions", "comments": "42 pages, 9 figures, submitted to IEEE transactions on Information\n  Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the asymmetric multilevel diversity (A-MLD) coding problem, where\na set of $2^K-1$ information sources, ordered in a decreasing level of\nimportance, is encoded into $K$ messages (or descriptions). There are $2^K-1$\ndecoders, each of which has access to a non-empty subset of the encoded\nmessages. Each decoder is required to reproduce the information sources up to a\ncertain importance level depending on the combination of descriptions available\nto it. We obtain a single letter characterization of the achievable rate region\nfor the 3-description problem. In contrast to symmetric multilevel diversity\ncoding, source-separation coding is not sufficient in the asymmetric case, and\nideas akin to network coding need to be used strategically. Based on the\nintuitions gained in treating the A-MLD problem, we derive inner and outer\nbounds for the rate region of the asymmetric Gaussian multiple description (MD)\nproblem with three descriptions. Both the inner and outer bounds have a similar\ngeometric structure to the rate region template of the A-MLD coding problem,\nand moreover, we show that the gap between them is small, which results in an\napproximate characterization of the asymmetric Gaussian three description rate\nregion.\n", "versions": [{"version": "v1", "created": "Thu, 12 Nov 2009 10:15:08 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Mohajer", "Soheil", ""], ["Tian", "Chao", ""], ["Diggavi", "Suhas N.", ""]]}, {"id": "0911.2551", "submitter": "Jayakrishnan Unnikrishnan", "authors": "Jayakrishnan Unnikrishnan, Venugopal V. Veeravalli, Sean Meyn", "title": "Minimax Robust Quickest Change Detection", "comments": "Submitted to IEEE Transactions on Information Theory, Nov. 2009.\n  Revised May 2010", "journal-ref": null, "doi": "10.1109/TIT.2011.2104993", "report-no": null, "categories": "cs.IT math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The popular criteria of optimality for quickest change detection procedures\nare the Lorden criterion, the Shiryaev-Roberts-Pollak criterion, and the\nBayesian criterion. In this paper a robust version of these quickest change\ndetection problems is considered when the pre-change and post-change\ndistributions are not known exactly but belong to known uncertainty classes of\ndistributions. For uncertainty classes that satisfy a specific condition, it is\nshown that one can identify least favorable distributions (LFDs) from the\nuncertainty classes, such that the detection rule designed for the LFDs is\noptimal for the robust problem in a minimax sense. The condition is similar to\nthat required for the identification of LFDs for the robust hypothesis testing\nproblem originally studied by Huber. An upper bound on the delay incurred by\nthe robust test is also obtained in the asymptotic setting under the Lorden\ncriterion of optimality. This bound quantifies the delay penalty incurred to\nguarantee robustness. When the LFDs can be identified, the proposed test is\neasier to implement than the CUSUM test based on the Generalized Likelihood\nRatio (GLR) statistic which is a popular approach for such robust change\ndetection problems. The proposed test is also shown to give better performance\nthan the GLR test in simulations for some parameter values.\n", "versions": [{"version": "v1", "created": "Fri, 13 Nov 2009 07:07:50 GMT"}, {"version": "v2", "created": "Tue, 1 Jun 2010 03:57:48 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Unnikrishnan", "Jayakrishnan", ""], ["Veeravalli", "Venugopal V.", ""], ["Meyn", "Sean", ""]]}, {"id": "0911.2564", "submitter": "Walid Saad", "authors": "Walid Saad, Zhu Han, Tamer Basar, Merouane Debbah, and Are\n  Hj{\\o}rungnes", "title": "Distributed Coalition Formation Games for Secure Wireless Transmission", "comments": "Invited paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperation among wireless nodes has been recently proposed for improving the\nphysical layer (PHY) security of wireless transmission in the presence of\nmultiple eavesdroppers. While existing PHY security literature answered the\nquestion ``what are the link-level secrecy rate gains from cooperation?'', this\npaper attempts to answer the question of ``how to achieve those gains in a\npractical decentralized wireless network and in the presence of a cost for\ninformation exchange?''. For this purpose, we model the PHY security\ncooperation problem as a coalitional game with non-transferable utility and\npropose a distributed algorithm for coalition formation. Through the proposed\nalgorithm, the wireless users can cooperate and self-organize into disjoint\nindependent coalitions, while maximizing their secrecy rate taking into account\nthe security costs during information exchange. We analyze the resulting\ncoalitional structures for both decode-and-forward and amplify-and-forward\ncooperation and study how the users can adapt the network topology to\nenvironmental changes such as mobility. Through simulations, we assess the\nperformance of the proposed algorithm and show that, by coalition formation\nusing decode-and-forward, the average secrecy rate per user is increased of up\nto 25.3 % and 24.4 % (for a network with 45 users) relative to the\nnon-cooperative and amplify-and-forward cases, respectively.\n", "versions": [{"version": "v1", "created": "Fri, 13 Nov 2009 08:37:54 GMT"}], "update_date": "2009-11-16", "authors_parsed": [["Saad", "Walid", ""], ["Han", "Zhu", ""], ["Basar", "Tamer", ""], ["Debbah", "Merouane", ""], ["Hjørungnes", "Are", ""]]}, {"id": "0911.2746", "submitter": "Waheed Bajwa", "authors": "Waheed U. Bajwa, Robert Calderbank, and Sina Jafarpour", "title": "Model Selection: Two Fundamental Measures of Coherence and Their\n  Algorithmic Significance", "comments": "5 pages; Accepted for Proc. 2010 IEEE International Symposium on\n  Information Theory (ISIT 2010)", "journal-ref": "Proc. IEEE Int. Symp. Information Theory, Austin, TX, Jun. 13-18,\n  2010, pp. 1568-1572", "doi": "10.1109/ISIT.2010.5513474", "report-no": null, "categories": "cs.IT math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of model selection arises in a number of contexts, such as\ncompressed sensing, subset selection in linear regression, estimation of\nstructures in graphical models, and signal denoising. This paper generalizes\nthe notion of \\emph{incoherence} in the existing literature on model selection\nand introduces two fundamental measures of coherence---termed as the worst-case\ncoherence and the average coherence---among the columns of a design matrix. In\nparticular, it utilizes these two measures of coherence to provide an in-depth\nanalysis of a simple one-step thresholding (OST) algorithm for model selection.\nOne of the key insights offered by the ensuing analysis is that OST is feasible\nfor model selection as long as the design matrix obeys an easily verifiable\nproperty. In addition, the paper also characterizes the model-selection\nperformance of OST in terms of the worst-case coherence, \\mu, and establishes\nthat OST performs near-optimally in the low signal-to-noise ratio regime for N\nx C design matrices with \\mu = O(N^{-1/2}). Finally, in contrast to some of the\nexisting literature on model selection, the analysis in the paper is\nnonasymptotic in nature, it does not require knowledge of the true model order,\nit is applicable to generic (random or deterministic) design matrices, and it\nneither requires submatrices of the design matrix to have full rank, nor does\nit assume a statistical prior on the values of the nonzero entries of the data\nvector.\n", "versions": [{"version": "v1", "created": "Sun, 15 Nov 2009 06:22:30 GMT"}, {"version": "v2", "created": "Fri, 15 Jan 2010 22:50:00 GMT"}, {"version": "v3", "created": "Thu, 29 Apr 2010 22:06:36 GMT"}], "update_date": "2018-03-06", "authors_parsed": [["Bajwa", "Waheed U.", ""], ["Calderbank", "Robert", ""], ["Jafarpour", "Sina", ""]]}, {"id": "0911.2784", "submitter": "Wolfgang Stummer", "authors": "Wolfgang Stummer and Igor Vajda", "title": "On Bregman Distances and Divergences of Probability Measures", "comments": "12 two-column pages, 2 figures", "journal-ref": "IEEE Transactions on Information Theory 58(3), 1277-1288 (2012)", "doi": "10.1109/TIT.2011.2178139", "report-no": null, "categories": "cs.IT math.IT math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper introduces scaled Bregman distances of probability distributions\nwhich admit non-uniform contributions of observed events. They are introduced\nin a general form covering not only the distances of discrete and continuous\nstochastic observations, but also the distances of random processes and\nsignals. It is shown that the scaled Bregman distances extend not only the\nclassical ones studied in the previous literature, but also the information\ndivergence and the related wider class of convex divergences of probability\nmeasures. An information processing theorem is established too, but only in the\nsense of invariance w.r.t. statistically sufficient transformations and not in\nthe sense of universal monotonicity. Pathological situations where coding can\nincrease the classical Bregman distance are illustrated by a concrete example.\nIn addition to the classical areas of application of the Bregman distances and\nconvex divergences such as recognition, classification, learning and evaluation\nof proximity of various features and signals, the paper mentions a new\napplication in 3D-exploratory data analysis. Explicit expressions for the\nscaled Bregman distances are obtained in general exponential families, with\nconcrete applications in the binomial, Poisson and Rayleigh families, and in\nthe families of exponential processes such as the Poisson and diffusion\nprocesses including the classical examples of the Wiener process and geometric\nBrownian motion.\n", "versions": [{"version": "v1", "created": "Sat, 14 Nov 2009 16:23:39 GMT"}, {"version": "v2", "created": "Wed, 5 Oct 2011 22:27:31 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Stummer", "Wolfgang", ""], ["Vajda", "Igor", ""]]}, {"id": "0911.2847", "submitter": "Sergiy Vorobyov", "authors": "Jie Gao, Sergiy A. Vorobyov, and Hai Jiang", "title": "Cooperative Precoding/Resource Allocation Games under Spectral Mask and\n  Total Power Constraints", "comments": "33 pages, 8 figures, Submitted to the IEEE Trans. Signal Processing\n  in Oct. 2009", "journal-ref": "J. Gao, S.A. Vorobyov, and H. Jiang, \"Cooperative resource\n  allocation games under spectral mask and total power constraints,\" IEEE\n  Trans. Signal Processing, vol. 58, no. 8, pp. 4379-4395, Aug. 2010", "doi": "10.1109/TSP.2010.2048320", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of orthogonal signaling schemes such as time-, frequency-, or\ncode-division multiplexing (T-, F-, CDM) in multi-user systems allows for\npower-efficient simple receivers. It is shown in this paper that by using\northogonal signaling on frequency selective fading channels, the cooperative\nNash bargaining (NB)-based precoding games for multi-user systems, which aim at\nmaximizing the information rates of all users, are simplified to the\ncorresponding cooperative resource allocation games. The latter provides\nadditional practically desired simplifications to transmitter design and\nsignificantly reduces the overhead during user cooperation. The complexity of\nthe corresponding precoding/resource allocation games, however, depends on the\nconstraints imposed on the users. If only spectral mask constraints are\npresent, the corresponding cooperative NB problem can be formulated as a convex\noptimization problem and solved efficiently in a distributed manner using dual\ndecomposition based algorithm. However, the NB problem is non-convex if total\npower constraints are also imposed on the users. In this case, the complexity\nassociate with finding the NB solution is unacceptably high. Therefore, the\nmulti-user systems are categorized into bandwidth- and power-dominant based on\na bottleneck resource, and different manners of cooperation are developed for\neach type of systems for the case of two-users. Such classification guarantees\nthat the solution obtained in each case is Pareto-optimal and actually can be\nidentical to the optimal solution, while the complexity is significantly\nreduced. Simulation results demonstrate the efficiency of the proposed\ncooperative precoding/resource allocation strategies and the reduced complexity\nof the proposed algorithms.\n", "versions": [{"version": "v1", "created": "Sun, 15 Nov 2009 09:50:50 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Gao", "Jie", ""], ["Vorobyov", "Sergiy A.", ""], ["Jiang", "Hai", ""]]}, {"id": "0911.2873", "submitter": "Pierre-Olivier Amblard", "authors": "Pierre-Olivier Amblard and Olivier J. J. Michel", "title": "Relating Granger causality to directed information theory for networks\n  of stochastic processes", "comments": "submitted, completely rehaul, new title, added recent references,\n  more emphasis on general case", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the problem of inferring circulation of information\nbetween multiple stochastic processes. We discuss two possible frameworks in\nwhich the problem can be studied: directed information theory and Granger\ncausality. The main goal of the paper is to study the connection between these\ntwo frameworks. In the case of directed information theory, we stress the\nimportance of Kramer's causal conditioning. This type of conditioning is\nnecessary not only in the definition of the directed information but also for\nhandling causal side information. We also show how directed information\ndecomposes into the sum of two measures, the first one related to Schreiber's\ntransfer entropy quantifies the dynamical aspects of causality, whereas the\nsecond one, termed instantaneous information exchange, quantifies the\ninstantaneous aspect of causality. After having recalled the definition of\nGranger causality, we establish its connection with directed information\ntheory. The connection is particularly studied in the Gaussian case, showing\nthat Geweke's measures of Granger causality correspond to the transfer entropy\nand the instantaneous information exchange. This allows to propose an\ninformation theoretic formulation of Granger causality.\n", "versions": [{"version": "v1", "created": "Sun, 15 Nov 2009 14:47:45 GMT"}, {"version": "v2", "created": "Fri, 27 Nov 2009 17:24:33 GMT"}, {"version": "v3", "created": "Wed, 8 Dec 2010 00:48:56 GMT"}, {"version": "v4", "created": "Tue, 1 Nov 2011 05:00:01 GMT"}], "update_date": "2011-11-02", "authors_parsed": [["Amblard", "Pierre-Olivier", ""], ["Michel", "Olivier J. J.", ""]]}, {"id": "0911.2922", "submitter": "William Bradley", "authors": "William F. Bradley", "title": "Sparse Eigenvectors of the Discrete Fourier Transform", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct a basis of sparse eigenvectors for the N-dimensional discrete\nFourier transform. The sparsity differs from the optimal by at most a factor of\nfour. When N is a perfect square, the basis is orthogonal.\n", "versions": [{"version": "v1", "created": "Sun, 15 Nov 2009 21:32:22 GMT"}], "update_date": "2009-11-17", "authors_parsed": [["Bradley", "William F.", ""]]}, {"id": "0911.2948", "submitter": "RadhaKrishna Ganti", "authors": "Radha Krishna Ganti and Martin Haenggi", "title": "Spatial Analysis of Opportunistic Downlink Relaying in a Two-Hop\n  Cellular System", "comments": "Submitted to IEEE Transactions on Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a two-hop cellular system in which the mobile nodes help the base\nstation by relaying information to the dead spots. While two-hop cellular\nschemes have been analyzed previously, the distribution of the node locations\nhas not been explicitly taken into account. In this paper, we model the node\nlocations of the base stations and the mobile stations as a point process on\nthe plane and then analyze the performance of two different two-hop schemes in\nthe downlink. In one scheme the node nearest to the destination that has\ndecoded information from the base station in the first hop is used as the\nrelay. In the second scheme the node with the best channel to the relay that\nreceived information in the first hop acts as a relay. In both these schemes we\nobtain the success probability of the two hop scheme, accounting for the\ninterference from all other cells. We use tools from stochastic geometry and\npoint process theory to analyze the two hop schemes. Besides the results\nobtained a main contribution of the paper is to introduce a mathematical\nframework that can be used to analyze arbitrary relaying schemes. Some of the\nmain contributions of this paper are the analytical techniques introduced for\nthe inclusion of the spatial locations of the nodes into the mathematical\nanalysis.\n", "versions": [{"version": "v1", "created": "Mon, 16 Nov 2009 04:09:54 GMT"}], "update_date": "2009-11-19", "authors_parsed": [["Ganti", "Radha Krishna", ""], ["Haenggi", "Martin", ""]]}, {"id": "0911.2952", "submitter": "Kaibin Huang", "authors": "Kaibin Huang and Rui Zhang", "title": "Cooperative Feedback for Multi-Antenna Cognitive Radio Networks", "comments": "26 pages; to appear in IEEE Trans. Signal Processing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cognitive beamforming (CB) is a multi-antenna technique for efficient\nspectrum sharing between primary users (PUs) and secondary users (SUs) in a\ncognitive radio network. Specifically, a multi-antenna SU transmitter applies\nCB to suppress the interference to the PU receivers as well as enhance the\ncorresponding SU-link performance. In this paper, for a\nmultiple-input-single-output (MISO) SU channel coexisting with a\nsingle-input-single-output (SISO) PU channel, we propose a new and practical\nparadigm for designing CB based on the finite-rate cooperative feedback from\nthe PU receiver to the SU transmitter. Specifically, the PU receiver\ncommunicates to the SU transmitter the quantized SU-to-PU channel direction\ninformation (CDI) for computing the SU transmit beamformer, and the\ninterference power control (IPC) signal that regulates the SU transmission\npower according to the tolerable interference margin at the PU receiver. Two CB\nalgorithms based on cooperative feedback are proposed: one restricts the SU\ntransmit beamformer to be orthogonal to the quantized SU-to-PU channel\ndirection and the other relaxes such a constraint. In addition, cooperative\nfeedforward of the SU CDI from the SU transmitter to the PU receiver is\nexploited to allow more efficient cooperative feedback. The outage\nprobabilities of the SU link for different CB and cooperative\nfeedback/feedforward algorithms are analyzed, from which the optimal\nbit-allocation tradeoff between the CDI and IPC feedback is characterized.\n", "versions": [{"version": "v1", "created": "Mon, 16 Nov 2009 05:09:40 GMT"}, {"version": "v2", "created": "Fri, 15 Oct 2010 09:48:34 GMT"}], "update_date": "2010-10-18", "authors_parsed": [["Huang", "Kaibin", ""], ["Zhang", "Rui", ""]]}, {"id": "0911.3213", "submitter": "Neri Merhav", "authors": "Neri Merhav", "title": "Optimum estimation via gradients of partition functions and information\n  measures: a statistical-mechanical perspective", "comments": "21 pages; submitted to the IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2132590", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In continuation to a recent work on the statistical--mechanical analysis of\nminimum mean square error (MMSE) estimation in Gaussian noise via its relation\nto the mutual information (the I-MMSE relation), here we propose a simple and\nmore direct relationship between optimum estimation and certain information\nmeasures (e.g., the information density and the Fisher information), which can\nbe viewed as partition functions and hence are amenable to analysis using\nstatistical--mechanical techniques. The proposed approach has several\nadvantages, most notably, its applicability to general sources and channels, as\nopposed to the I-MMSE relation and its variants which hold only for certain\nclasses of channels (e.g., additive white Gaussian noise channels). We then\ndemonstrate the derivation of the conditional mean estimator and the MMSE in a\nfew examples. Two of these examples turn out to be generalizable to a fairly\nwide class of sources and channels. For this class, the proposed approach is\nshown to yield an approximate conditional mean estimator and an MMSE formula\nthat has the flavor of a single-letter expression. We also show how our\napproach can easily be generalized to situations of mismatched estimation.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 06:24:52 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Merhav", "Neri", ""]]}, {"id": "0911.3241", "submitter": "Francesco De Pellegrini Dr.", "authors": "Eitan Altman, Tamer Basar and Francesco De Pellegrini", "title": "Optimal Control in Two-Hop Relay Routing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the optimal control of propagation of packets in delay tolerant\nmobile ad-hoc networks. We consider a two-hop forwarding policy under which the\nexpected number of nodes carrying copies of the packets obeys a linear\ndynamics. We exploit this property to formulate the problem in the framework of\nlinear quadratic optimal control which allows us to obtain closed-form\nexpressions for the optimal control and to study numerically the tradeoffs by\nvarying various parameters that define the cost.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 09:29:50 GMT"}], "update_date": "2009-11-18", "authors_parsed": [["Altman", "Eitan", ""], ["Basar", "Tamer", ""], ["De Pellegrini", "Francesco", ""]]}, {"id": "0911.3256", "submitter": "Natalia Silberstein", "authors": "Natalia Silberstein and Tuvi Etzion", "title": "Enumerative Coding for Grassmannian Space", "comments": "to appear in IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Grassmannian space $\\Gr$ is the set of all $k-$dimensional subspaces of\nthe vector space~\\smash{$\\F_q^n$}. Recently, codes in the Grassmannian have\nfound an application in network coding. The main goal of this paper is to\npresent efficient enumerative encoding and decoding techniques for the\nGrassmannian. These coding techniques are based on two different orders for the\nGrassmannian induced by different representations of $k$-dimensional subspaces\nof $\\F_q^n$. One enumerative coding method is based on a Ferrers diagram\nrepresentation and on an order for $\\Gr$ based on this representation. The\ncomplexity of this enumerative coding is $O(k^{5/2} (n-k)^{5/2})$ digit\noperations. Another order of the Grassmannian is based on a combination of an\nidentifying vector and a reduced row echelon form representation of subspaces.\nThe complexity of the enumerative coding, based on this order, is\n$O(nk(n-k)\\log n\\log\\log n)$ digits operations. A combination of the two\nmethods reduces the complexity on average by a constant factor.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 10:28:21 GMT"}, {"version": "v2", "created": "Sat, 28 Aug 2010 12:09:17 GMT"}], "update_date": "2010-08-31", "authors_parsed": [["Silberstein", "Natalia", ""], ["Etzion", "Tuvi", ""]]}, {"id": "0911.3262", "submitter": "Samuel Ouzan", "authors": "Samuel Ouzan, Yair Be'ery", "title": "Moderate-Density Parity-Check Codes", "comments": "Submitted to the IEEE Transactions on Communications, September 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new type of short to moderate block-length, linear\nerror-correcting codes, called moderate-density parity-check (MDPC) codes. The\nnumber of ones of the parity-check matrix of the codes presented is typically\nhigher than the number of ones of the parity-check matrix of low-density\nparity-check (LDPC) codes. But, still lower than those of the parity-check\nmatrix of classical block codes. The proposed MDPC codes are cyclic and are\ndesigned by constructing idempotents using cyclotomic cosets. The construction\nis simple and allows finding short block-length, high-rate codes with good\nminimum distance. Inspired by some recent iterative soft-input soft-output\n(SISO) decoders used in a context of classical block codes, we propose a low\ncomplexity, efficient, iterative decoder called Auto-Diversity (AD) decoder. AD\ndecoder is based on belief propagation (BP) decoder and takes advantage of the\nfundamental property of automorphism group of the constructed cyclic code.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 10:59:29 GMT"}], "update_date": "2009-11-18", "authors_parsed": [["Ouzan", "Samuel", ""], ["Be'ery", "Yair", ""]]}, {"id": "0911.3347", "submitter": "Hemant Kowshik", "authors": "Hemant Kowshik and P. R. Kumar", "title": "Optimal strategies for computing symmetric Boolean functions in\n  collocated networks", "comments": "5 pages, To appear in Proceedings of the IEEE Information Theory\n  Workshop, Cairo, January 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the problem of finding optimal strategies for computing Boolean\nsymmetric functions. We consider a collocated network, where each node's\ntransmissions can be heard by every other node. Each node has a Boolean\nmeasurement and we wish to compute a given Boolean function of these\nmeasurements with zero error. We allow for block computation to enhance data\nfusion efficiency, and determine the minimum worst-case total bits to be\ncommunicated to perform the desired computation. We restrict attention to the\nclass of symmetric Boolean functions, which only depend on the number of 1s\namong the n measurements.\n  We define three classes of functions, namely threshold functions, delta\nfunctions and interval functions. We provide exactly optimal strategies for the\nfirst two classes, and an order-optimal strategy with optimal preconstant for\ninterval functions. Using these results, we can characterize the complexity of\ncomputing percentile type functions, which is of great interest. In our\nanalysis, we use lower bounds from communication complexity theory, and provide\nan achievable scheme using information theoretic tools.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 16:56:15 GMT"}], "update_date": "2009-11-18", "authors_parsed": [["Kowshik", "Hemant", ""], ["Kumar", "P. R.", ""]]}, {"id": "0911.3357", "submitter": "Hemant Kowshik", "authors": "Nikolaos M. Freris, Hemant Kowshik and P. R. Kumar", "title": "Fundamentals of Large Sensor Networks: Connectivity, Capacity, Clocks\n  and Computation", "comments": "10 pages, 3 figures, Submitted to the Proceedings of the IEEE", "journal-ref": null, "doi": "10.1109/JPROC.2010.2065790", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sensor networks potentially feature large numbers of nodes that can sense\ntheir environment over time, communicate with each other over a wireless\nnetwork, and process information. They differ from data networks in that the\nnetwork as a whole may be designed for a specific application. We study the\ntheoretical foundations of such large scale sensor networks, addressing four\nfundamental issues- connectivity, capacity, clocks and function computation.\n  To begin with, a sensor network must be connected so that information can\nindeed be exchanged between nodes. The connectivity graph of an ad-hoc network\nis modeled as a random graph and the critical range for asymptotic connectivity\nis determined, as well as the critical number of neighbors that a node needs to\nconnect to. Next, given connectivity, we address the issue of how much data can\nbe transported over the sensor network. We present fundamental bounds on\ncapacity under several models, as well as architectural implications for how\nwireless communication should be organized.\n  Temporal information is important both for the applications of sensor\nnetworks as well as their operation.We present fundamental bounds on the\nsynchronizability of clocks in networks, and also present and analyze\nalgorithms for clock synchronization. Finally we turn to the issue of gathering\nrelevant information, that sensor networks are designed to do. One needs to\nstudy optimal strategies for in-network aggregation of data, in order to\nreliably compute a composite function of sensor measurements, as well as the\ncomplexity of doing so. We address the issue of how such computation can be\nperformed efficiently in a sensor network and the algorithms for doing so, for\nsome classes of functions.\n", "versions": [{"version": "v1", "created": "Tue, 17 Nov 2009 17:50:12 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Freris", "Nikolaos M.", ""], ["Kowshik", "Hemant", ""], ["Kumar", "P. R.", ""]]}, {"id": "0911.3482", "submitter": "Russell K. Standish", "authors": "Russell K. Standish", "title": "Complexity of Networks (reprise)", "comments": "Accepted in Complexity", "journal-ref": "Complexity, v 17, 50-61, (2012)", "doi": "10.1002/cplx.20393", "report-no": null, "categories": "cs.IT math.IT nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network or graph structures are ubiquitous in the study of complex systems.\nOften, we are interested in complexity trends of these system as it evolves\nunder some dynamic. An example might be looking at the complexity of a food web\nas species enter an ecosystem via migration or speciation, and leave via\nextinction.\n  In a previous paper, a complexity measure of networks was proposed based on\nthe {\\em complexity is information content} paradigm. To apply this paradigm to\nany object, one must fix two things: a representation language, in which\nstrings of symbols from some alphabet describe, or stand for the objects being\nconsidered; and a means of determining when two such descriptions refer to the\nsame object. With these two things set, the information content of an object\ncan be computed in principle from the number of equivalent descriptions\ndescribing a particular object.\n  The previously proposed representation language had the deficiency that the\nfully connected and empty networks were the most complex for a given number of\nnodes. A variation of this measure, called zcomplexity, applied a compression\nalgorithm to the resulting bitstring representation, to solve this problem.\nUnfortunately, zcomplexity proved too computationally expensive to be\npractical.\n  In this paper, I propose a new representation language that encodes the\nnumber of links along with the number of nodes and a representation of the\nlinklist. This, like zcomplexity, exhibits minimal complexity for fully\nconnected and empty networks, but is as tractable as the original measure.\n  ...\n", "versions": [{"version": "v1", "created": "Wed, 18 Nov 2009 09:03:59 GMT"}, {"version": "v2", "created": "Thu, 19 Nov 2009 11:22:40 GMT"}, {"version": "v3", "created": "Mon, 23 Aug 2010 11:29:39 GMT"}, {"version": "v4", "created": "Wed, 19 Jan 2011 03:49:20 GMT"}, {"version": "v5", "created": "Wed, 27 Jul 2011 23:55:09 GMT"}], "update_date": "2012-01-23", "authors_parsed": [["Standish", "Russell K.", ""]]}, {"id": "0911.3514", "submitter": "Thomas Blumensath", "authors": "Thomas Blumensath", "title": "Sampling and reconstructing signals from a union of linear subspaces", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this note we study the problem of sampling and reconstructing signals\nwhich are assumed to lie on or close to one of several subspaces of a Hilbert\nspace. Importantly, we here consider a very general setting in which we allow\ninfinitely many subspaces in infinite dimensional Hilbert spaces. This general\napproach allows us to unify many results derived recently in areas such as\ncompressed sensing, affine rank minimisation and analog compressed sensing.\n  Our main contribution is to show that a conceptually simple iterative\nprojection algorithms is able to recover signals from a union of subspaces\nwhenever the sampling operator satisfies a bi-Lipschitz embedding condition.\nImportantly, this result holds for all Hilbert spaces and unions of subspaces,\nas long as the sampling procedure satisfies the condition for the set of\nsubspaces considered. In addition to recent results for finite unions of finite\ndimensional subspaces and infinite unions of subspaces in finite dimensional\nspaces, we also show that this bi-Lipschitz property can hold in an analog\ncompressed sensing setting in which we have an infinite union of infinite\ndimensional subspaces living in infinite dimensional space.\n", "versions": [{"version": "v1", "created": "Wed, 18 Nov 2009 11:53:50 GMT"}, {"version": "v2", "created": "Wed, 2 Dec 2009 16:45:02 GMT"}], "update_date": "2009-12-02", "authors_parsed": [["Blumensath", "Thomas", ""]]}, {"id": "0911.3668", "submitter": "Mark McDonnell", "authors": "Mark D. McDonnell and Adrian P. Flitney", "title": "Signal acquisition via polarization modulation in single photon sources", "comments": "7 pages, 2 figures, accepted by Physical Review E. This version adds\n  a reference", "journal-ref": "Physical Review E 80, 060102(R) (2009)", "doi": "10.1103/PhysRevE.80.060102", "report-no": null, "categories": "quant-ph cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A simple model system is introduced for demonstrating how a single photon\nsource might be used to transduce classical analog information. The theoretical\nscheme results in measurements of analog source samples that are (i) quantized\nin the sense of analog-to-digital conversion and (ii) corrupted by random noise\nthat is solely due to the quantum uncertainty in detecting the polarization\nstate of each photon. This noise is unavoidable if more than one bit per sample\nis to be transmitted, and we show how it may be exploited in a manner inspired\nby suprathreshold stochastic resonance. The system is analyzed information\ntheoretically, as it can be modeled as a noisy optical communication channel,\nalthough unlike classical Poisson channels, the detector's photon statistics\nare binomial. Previous results on binomial channels are adapted to demonstrate\nnumerically that the classical information capacity, and thus the accuracy of\nthe transduction, increases logarithmically with the square root of the number\nof photons, N. Although the capacity is shown to be reduced when an additional\ndetector nonideality is present, the logarithmic increase with N remains.\n", "versions": [{"version": "v1", "created": "Wed, 18 Nov 2009 22:05:28 GMT"}, {"version": "v2", "created": "Thu, 26 Nov 2009 04:01:19 GMT"}], "update_date": "2016-09-26", "authors_parsed": [["McDonnell", "Mark D.", ""], ["Flitney", "Adrian P.", ""]]}, {"id": "0911.3676", "submitter": "Gerhard Kramer", "authors": "Gerhard Kramer", "title": "Pipelined Encoding for Deterministic and Noisy Relay Networks", "comments": "6 pages, 2 figures, 1 table; Presented at the 2009 Workshop on\n  Network Coding, Theory, and Applications, EPFL, Lausanne, Switzerland, June\n  15-16, 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent coding strategies for deterministic and noisy relay networks are\nrelated to the pipelining of block Markov encoding. For deterministic networks,\nit is shown that pipelined encoding improves encoding delay, as opposed to\nend-to-end delay. For noisy networks, it is observed that decode-and-forward\nexhibits good rate scaling when the signal-to-noise ratio (SNR) increases.\n", "versions": [{"version": "v1", "created": "Wed, 18 Nov 2009 23:21:06 GMT"}], "update_date": "2009-11-20", "authors_parsed": [["Kramer", "Gerhard", ""]]}, {"id": "0911.3872", "submitter": "Mukul Agarwal", "authors": "Mukul Agarwal, Anant Sahai, Sanjoy Mitter", "title": "Equivalence perspectives in communication, source-channel connections\n  and universal source-channel separation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An operational perspective is used to understand the relationship between\nsource and channel coding. This is based on a direct reduction of one problem\nto another that uses random coding (and hence common randomness) but unlike all\nprior work, does not involve any functional computations, in particular, no\nmutual-information computations. This result is then used to prove a universal\nsource-channel separation theorem in the rate-distortion context where\nuniversality is in the sense of a compound ``general channel.''\n", "versions": [{"version": "v1", "created": "Thu, 19 Nov 2009 19:08:41 GMT"}], "update_date": "2009-11-20", "authors_parsed": [["Agarwal", "Mukul", ""], ["Sahai", "Anant", ""], ["Mitter", "Sanjoy", ""]]}, {"id": "0911.3921", "submitter": "Sergey Loyka", "authors": "Sergey Loyka, Victoria Kostina, Francois Gagnon", "title": "Error Rates of the Maximum-Likelihood Detector for Arbitrary\n  Constellations: Convex/Concave Behavior and Applications", "comments": "accepted by IEEE IT Transactions", "journal-ref": "IEEE Transactions on Information Theory, v. 56, N. 4, pp.\n  1948-1960, Apr. 2010", "doi": "10.1109/TIT.2010.2040965", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by a recent surge of interest in convex optimization techniques,\nconvexity/concavity properties of error rates of the maximum likelihood\ndetector operating in the AWGN channel are studied and extended to\nfrequency-flat slow-fading channels. Generic conditions are identified under\nwhich the symbol error rate (SER) is convex/concave for arbitrary\nmulti-dimensional constellations. In particular, the SER is convex in SNR for\nany one- and two-dimensional constellation, and also in higher dimensions at\nhigh SNR. Pairwise error probability and bit error rate are shown to be convex\nat high SNR, for arbitrary constellations and bit mapping. Universal bounds for\nthe SER 1st and 2nd derivatives are obtained, which hold for arbitrary\nconstellations and are tight for some of them. Applications of the results are\ndiscussed, which include optimum power allocation in spatial multiplexing\nsystems, optimum power/time sharing to decrease or increase (jamming problem)\nerror rate, an implication for fading channels (\"fading is never good in low\ndimensions\") and optimization of a unitary-precoded OFDM system. For example,\nthe error rate bounds of a unitary-precoded OFDM system with QPSK modulation,\nwhich reveal the best and worst precoding, are extended to arbitrary\nconstellations, which may also include coding. The reported results also apply\nto the interference channel under Gaussian approximation, to the bit error rate\nwhen it can be expressed or approximated as a non-negative linear combination\nof individual symbol error rates, and to coded systems.\n", "versions": [{"version": "v1", "created": "Thu, 19 Nov 2009 22:13:51 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Loyka", "Sergey", ""], ["Kostina", "Victoria", ""], ["Gagnon", "Francois", ""]]}, {"id": "0911.3992", "submitter": "Eitan Yaakobi", "authors": "Anxiao (Andrew) Jiang, Robert Mateescu, Eitan Yaakobi, Jehoshua Bruck,\n  Paul H. Siegel, Alexander Vardy, Jack K. Wolf", "title": "Storage Coding for Wear Leveling in Flash Memories", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flash memory is a non-volatile computer memory comprised of blocks of cells,\nwherein each cell is implemented as either NAND or NOR floating gate. NAND\nflash is currently the most widely used type of flash memory. In a NAND flash\nmemory, every block of cells consists of numerous pages; rewriting even a\nsingle page requires the whole block to be erased and reprogrammed. Block\nerasures determine both the longevity and the efficiency of a flash memory.\nTherefore, when data in a NAND flash memory are reorganized, minimizing the\ntotal number of block erasures required to achieve the desired data movement is\nan important goal. This leads to the flash data movement problem studied in\nthis paper. We show that coding can significantly reduce the number of block\nerasures required for data movement, and present several optimal or nearly\noptimal data-movement algorithms based upon ideas from coding theory and\ncombinatorics. In particular, we show that the sorting-based (non-coding)\nschemes require at least O(nlogn) erasures to move data among n blocks, whereas\ncoding-based schemes require only O(n) erasures. Furthermore, coding-based\nschemes use only one auxiliary block, which is the best possible, and achieve a\ngood balance between the number of erasures in each of the n+1 blocks.\n", "versions": [{"version": "v1", "created": "Fri, 20 Nov 2009 09:01:26 GMT"}], "update_date": "2009-11-23", "authors_parsed": [["Anxiao", "", "", "Andrew"], ["Jiang", "", ""], ["Mateescu", "Robert", ""], ["Yaakobi", "Eitan", ""], ["Bruck", "Jehoshua", ""], ["Siegel", "Paul H.", ""], ["Vardy", "Alexander", ""], ["Wolf", "Jack K.", ""]]}, {"id": "0911.4167", "submitter": "Ertem Tuncel", "authors": "Jayanth Nayak, Ertem Tuncel, and Deniz Gunduz", "title": "Wyner-Ziv Coding over Broadcast Channels: Digital Schemes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses lossy transmission of a common source over a broadcast\nchannel when there is correlated side information at the receivers, with\nemphasis on the quadratic Gaussian and binary Hamming cases. A digital scheme\nthat combines ideas from the lossless version of the problem, i.e.,\nSlepian-Wolf coding over broadcast channels, and dirty paper coding, is\npresented and analyzed. This scheme uses layered coding where the common layer\ninformation is intended for both receivers and the refinement information is\ndestined only for one receiver. For the quadratic Gaussian case, a quantity\ncharacterizing the overall quality of each receiver is identified in terms of\nchannel and side information parameters. It is shown that it is more\nadvantageous to send the refinement information to the receiver with \"better\"\noverall quality. In the case where all receivers have the same overall quality,\nthe presented scheme becomes optimal. Unlike its lossless counterpart, however,\nthe problem eludes a complete characterization.\n", "versions": [{"version": "v1", "created": "Sat, 21 Nov 2009 08:20:59 GMT"}], "update_date": "2009-11-24", "authors_parsed": [["Nayak", "Jayanth", ""], ["Tuncel", "Ertem", ""], ["Gunduz", "Deniz", ""]]}, {"id": "0911.4207", "submitter": "Rafael S.  Calsaverini", "authors": "Rafael S. Calsaverini, Renato Vicente", "title": "An information theoretic approach to statistical dependence: copula\n  information", "comments": "to appear in Europhysics Letters", "journal-ref": "Europ. Phys. Lett. 88 68003 (2009)", "doi": "10.1209/0295-5075/88/68003", "report-no": null, "categories": "q-fin.ST cs.IT math.IT physics.data-an stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss the connection between information and copula theories by showing\nthat a copula can be employed to decompose the information content of a\nmultivariate distribution into marginal and dependence components, with the\nlatter quantified by the mutual information. We define the information excess\nas a measure of deviation from a maximum entropy distribution. The idea of\nmarginal invariant dependence measures is also discussed and used to show that\nempirical linear correlation underestimates the amplitude of the actual\ncorrelation in the case of non-Gaussian marginals. The mutual information is\nshown to provide an upper bound for the asymptotic empirical log-likelihood of\na copula. An analytical expression for the information excess of T-copulas is\nprovided, allowing for simple model identification within this family. We\nillustrate the framework in a financial data set.\n", "versions": [{"version": "v1", "created": "Sat, 21 Nov 2009 22:41:35 GMT"}], "update_date": "2011-10-26", "authors_parsed": [["Calsaverini", "Rafael S.", ""], ["Vicente", "Renato", ""]]}, {"id": "0911.4219", "submitter": "Andrea Montanari", "authors": "David L. Donoho and Arian Maleki and Andrea Montanari", "title": "Message Passing Algorithms for Compressed Sensing: I. Motivation and\n  Construction", "comments": "5 pages, IEEE Information Theory Workshop, Cairo 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper, the authors proposed a new class of low-complexity\niterative thresholding algorithms for reconstructing sparse signals from a\nsmall set of linear measurements \\cite{DMM}. The new algorithms are broadly\nreferred to as AMP, for approximate message passing. This is the first of two\nconference papers describing the derivation of these algorithms, connection\nwith the related literature, extensions of the original framework, and new\nempirical evidence.\n  In particular, the present paper outlines the derivation of AMP from standard\nsum-product belief propagation, and its extension in several directions. We\nalso discuss relations with formal calculations based on statistical mechanics\nmethods.\n", "versions": [{"version": "v1", "created": "Sun, 22 Nov 2009 03:00:43 GMT"}], "update_date": "2009-11-24", "authors_parsed": [["Donoho", "David L.", ""], ["Maleki", "Arian", ""], ["Montanari", "Andrea", ""]]}, {"id": "0911.4222", "submitter": "Andrea Montanari", "authors": "David L. Donoho and Arian Maleki and Andrea Montanari", "title": "Message Passing Algorithms for Compressed Sensing: II. Analysis and\n  Validation", "comments": "5 pages, 3 pdf figures, IEEE Information Theory Workshop, Cairo 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper, the authors proposed a new class of low-complexity\niterative thresholding algorithms for reconstructing sparse signals from a\nsmall set of linear measurements \\cite{DMM}. The new algorithms are broadly\nreferred to as AMP, for approximate message passing. This is the second of two\nconference papers describing the derivation of these algorithms, connection\nwith related literature, extensions of original framework, and new empirical\nevidence.\n  This paper describes the state evolution formalism for analyzing these\nalgorithms, and some of the conclusions that can be drawn from this formalism.\nWe carried out extensive numerical simulations to confirm these predictions. We\npresent here a few representative results.\n", "versions": [{"version": "v1", "created": "Sun, 22 Nov 2009 02:54:51 GMT"}], "update_date": "2009-11-24", "authors_parsed": [["Donoho", "David L.", ""], ["Maleki", "Arian", ""], ["Montanari", "Andrea", ""]]}, {"id": "0911.4432", "submitter": "Aylin Yener", "authors": "Xiang He, Aylin Yener", "title": "The Role of Feedback in Two-way Secure Communications", "comments": "51 pages. Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most practical communication links are bi-directional. In these models, since\nthe source node also receives signals, its encoder has the option of computing\nits output based on the signals it received in the past. On the other hand,\nfrom a practical point of view, it would also be desirable to identify the\ncases where such an encoder design may not improve communication rates. This\nquestion is particularly interesting for the case where the transmitted\nmessages and the feedback signals are subject to eavesdropping. In this work,\nwe investigate the question of how much impact the feedback has on the secrecy\ncapacity by studying two fundamental models. First, we consider the Gaussian\ntwo-way wiretap channel and derive an outer bound for its secrecy capacity\nregion. We show that the secrecy rate loss can be unbounded when feedback\nsignals are not utilized except for a special case we identify, and thus\nconclude that utilizing feedback can be highly beneficial in general. Second,\nwe consider a half-duplex Gaussian two-way relay channel where the relay node\nis also an eavesdropper, and find that the impact of feedback is less\npronounced compared to the previous scenario. Specifically, the loss in secrecy\nrate, when ignoring the feedback, is quantified to be less than 0.5 bit per\nchannel use when the relay power goes to infinity. This achievable rate region\nis obtained with simple time sharing along with cooperative jamming, which,\nwith its simplicity and near optimum performance, is a viable alternative to an\nencoder that utilizes feedback signals.\n", "versions": [{"version": "v1", "created": "Mon, 23 Nov 2009 15:54:53 GMT"}], "update_date": "2009-11-24", "authors_parsed": [["He", "Xiang", ""], ["Yener", "Aylin", ""]]}, {"id": "0911.4507", "submitter": "Cenk M. Yetis", "authors": "Cenk M. Yetis, Tiangao Gou, Syed A. Jafar and Ahmet H. Kayran", "title": "On Feasibility of Interference Alignment in MIMO Interference Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the feasibility of interference alignment in signal vector space\n-- based only on beamforming -- for K-user MIMO interference channels. Our main\ncontribution is to relate the feasibility issue to the problem of determining\nthe solvability of a multivariate polynomial system, considered extensively in\nalgebraic geometry. It is well known, e.g. from Bezout's theorem, that generic\npolynomial systems are solvable if and only if the number of equations does not\nexceed the number of variables. Following this intuition, we classify signal\nspace interference alignment problems as either proper or improper based on the\nnumber of equations and variables. Rigorous connections between feasible and\nproper systems are made through Bernshtein's theorem for the case where each\ntransmitter uses only one beamforming vector. The multi-beam case introduces\ndependencies among the coefficients of a polynomial system so that the system\nis no longer generic in the sense required by both theorems. In this case, we\nshow that the connection between feasible and proper systems can be further\nstrengthened (since the equivalency between feasible and proper systems does\nnot always hold) by including standard information theoretic outer bounds in\nthe feasibility analysis.\n", "versions": [{"version": "v1", "created": "Mon, 23 Nov 2009 22:36:15 GMT"}], "update_date": "2009-11-25", "authors_parsed": [["Yetis", "Cenk M.", ""], ["Gou", "Tiangao", ""], ["Jafar", "Syed A.", ""], ["Kayran", "Ahmet H.", ""]]}, {"id": "0911.4511", "submitter": "Gowtham Bellala", "authors": "Gowtham Bellala, Suresh Bhavnani and Clayton Scott", "title": "Group-based Query Learning for rapid diagnosis in time-critical\n  situations", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In query learning, the goal is to identify an unknown object while minimizing\nthe number of \"yes or no\" questions (queries) posed about that object. We\nconsider three extensions of this fundamental problem that are motivated by\npractical considerations in real-world, time-critical identification tasks such\nas emergency response. First, we consider the problem where the objects are\npartitioned into groups, and the goal is to identify only the group to which\nthe object belongs. Second, we address the situation where the queries are\npartitioned into groups, and an algorithm may suggest a group of queries to a\nhuman user, who then selects the actual query. Third, we consider the problem\nof query learning in the presence of persistent query noise, and relate it to\ngroup identification. To address these problems we show that a standard\nalgorithm for query learning, known as the splitting algorithm or generalized\nbinary search, may be viewed as a generalization of Shannon-Fano coding. We\nthen extend this result to the group-based settings, leading to new algorithms.\nThe performance of our algorithms is demonstrated on simulated data and on a\ndatabase used by first responders for toxic chemical identification.\n", "versions": [{"version": "v1", "created": "Tue, 24 Nov 2009 19:53:54 GMT"}], "update_date": "2009-11-25", "authors_parsed": [["Bellala", "Gowtham", ""], ["Bhavnani", "Suresh", ""], ["Scott", "Clayton", ""]]}, {"id": "0911.4521", "submitter": "Bruno Bauwens", "authors": "Bruno Bauwens", "title": "On the equivalence between minimal sufficient statistics, minimal\n  typical models and initial segments of the Halting sequence", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is shown that the length of the algorithmic minimal sufficient statistic\nof a binary string x, either in a representation of a finite set, computable\nsemimeasure, or a computable function, has a length larger than the\ncomputational depth of x, and can solve the Halting problem for all programs\nwith length shorter than the m-depth of x. It is also shown that there are\nstrings for which the algorithmic minimal sufficient statistics can contain a\nsubstantial amount of information that is not Halting information. The weak\nsufficient statistic is introduced, and it is shown that a minimal weak\nsufficient statistic for x is equivalent to a minimal typical model of x, and\nto the Halting problem for all strings shorter than the BB-depth of x.\n", "versions": [{"version": "v1", "created": "Mon, 23 Nov 2009 23:57:53 GMT"}], "update_date": "2009-11-25", "authors_parsed": [["Bauwens", "Bruno", ""]]}, {"id": "0911.4522", "submitter": "Arya Mazumdar", "authors": "Alexander Barg, Arya Mazumdar", "title": "On the Number of Errors Correctable with Codes on Graphs", "comments": "Published in the Ralf Koetter Memorial Issue of IEEE Transactions on\n  Information Theory", "journal-ref": "IEEE Transactions on Information Theory, Vol. 57, No. 2, February\n  2011", "doi": "10.1109/TIT.2010.2094812", "report-no": null, "categories": "cs.IT cs.DM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study ensembles of codes on graphs (generalized low-density parity-check,\nor LDPC codes) constructed from random graphs and fixed local constrained\ncodes, and their extension to codes on hypergraphs. It is known that the\naverage minimum distance of codes in these ensembles grows linearly with the\ncode length. We show that these codes can correct a linearly growing number of\nerrors under simple iterative decoding algorithms. In particular, we show that\nthis property extends to codes constructed by parallel concatenation of Hamming\ncodes and other codes with small minimum distance. Previously known results\nthat proved this property for graph codes relied on graph expansion and\nrequired the choice of local codes with large distance relative to their\nlength.\n", "versions": [{"version": "v1", "created": "Mon, 23 Nov 2009 23:49:13 GMT"}, {"version": "v2", "created": "Mon, 21 Feb 2011 19:56:18 GMT"}], "update_date": "2011-02-22", "authors_parsed": [["Barg", "Alexander", ""], ["Mazumdar", "Arya", ""]]}, {"id": "0911.4530", "submitter": "Xiaohu Shang", "authors": "Xiaohu Shang, Biao Chen, Gerhard Kramer, H. Vincent Poor", "title": "MIMO Z-Interference Channels: Capacity Under Strong and Noisy\n  Interference", "comments": "5 pages, presented at Asilomar 09", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The capacity regions of multiple-input multiple-output Gaussian\nZ-interference channels are established for the very strong interference and\naligned strong interference cases. The sum-rate capacity of such channels is\nestablished under noisy interference. These results generalize known results\nfor scalar Gaussian Z-interference channels.\n", "versions": [{"version": "v1", "created": "Tue, 24 Nov 2009 02:49:56 GMT"}], "update_date": "2009-11-25", "authors_parsed": [["Shang", "Xiaohu", ""], ["Chen", "Biao", ""], ["Kramer", "Gerhard", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0911.4640", "submitter": "Ananthanarayanan Chockalingam", "authors": "N. Srinidhi, Saif K. Mohammed, A. Chockalingam, and B. Sundar Rajan", "title": "Near-ML Signal Detection in Large-Dimension Linear Vector Channels Using\n  Reactive Tabu Search", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Low-complexity near-optimal signal detection in large dimensional\ncommunication systems is a challenge. In this paper, we present a reactive tabu\nsearch (RTS) algorithm, a heuristic based combinatorial optimization technique,\nto achieve low-complexity near-maximum likelihood (ML) signal detection in\nlinear vector channels with large dimensions. Two practically important\nlarge-dimension linear vector channels are considered: i) multiple-input\nmultiple-output (MIMO) channels with large number (tens) of transmit and\nreceive antennas, and ii) severely delay-spread MIMO inter-symbol interference\n(ISI) channels with large number (tens to hundreds) of multipath components.\nThese channels are of interest because the former offers the benefit of\nincreased spectral efficiency (several tens of bps/Hz) and the latter offers\nthe benefit of high time-diversity orders. Our simulation results show that,\nwhile algorithms including variants of sphere decoding do not scale well for\nlarge dimensions, the proposed RTS algorithm scales well for signal detection\nin large dimensions while achieving increasingly closer to ML performance for\nincreasing number of dimensions.\n", "versions": [{"version": "v1", "created": "Tue, 24 Nov 2009 15:04:52 GMT"}], "update_date": "2009-11-25", "authors_parsed": [["Srinidhi", "N.", ""], ["Mohammed", "Saif K.", ""], ["Chockalingam", "A.", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "0911.4704", "submitter": "Abdellatif Zaidi", "authors": "Abdellatif Zaidi, Shiva Prasad Kotagiri, J. Nicholas Laneman, Luc\n  Vandendorpe", "title": "Cooperative Relaying with State Available Non-Causally at the Relay", "comments": "62 pages. To appear in IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a three-terminal state-dependent relay channel with the channel\nstate noncausally available at only the relay. Such a model may be useful for\ndesigning cooperative wireless networks with some terminals equipped with\ncognition capabilities, i.e., the relay in our setup. In the discrete\nmemoryless (DM) case, we establish lower and upper bounds on channel capacity.\nThe lower bound is obtained by a coding scheme at the relay that uses a\ncombination of codeword splitting, Gel'fand-Pinsker binning, and\ndecode-and-forward relaying. The upper bound improves upon that obtained by\nassuming that the channel state is available at the source, the relay, and the\ndestination. For the Gaussian case, we also derive lower and upper bounds on\nthe capacity. The lower bound is obtained by a coding scheme at the relay that\nuses a combination of codeword splitting, generalized dirty paper coding, and\ndecode-and-forward relaying; the upper bound is also better than that obtained\nby assuming that the channel state is available at the source, the relay, and\nthe destination. In the case of degraded Gaussian channels, the lower bound\nmeets with the upper bound for some special cases, and, so, the capacity is\nobtained for these cases. Furthermore, in the Gaussian case, we also extend the\nresults to the case in which the relay operates in a half-duplex mode.\n", "versions": [{"version": "v1", "created": "Tue, 24 Nov 2009 20:15:43 GMT"}], "update_date": "2009-11-25", "authors_parsed": [["Zaidi", "Abdellatif", ""], ["Kotagiri", "Shiva Prasad", ""], ["Laneman", "J. Nicholas", ""], ["Vandendorpe", "Luc", ""]]}, {"id": "0911.4752", "submitter": "Yao Yu", "authors": "Yao Yu, Athina P. Petropulu and H. Vincent Poor", "title": "MIMO Radar Using Compressive Sampling", "comments": "39 pages and 14 figures. Y. Yu, A. P. Petropulu and H. V. Poor, \"MIMO\n  Radar Using Compressive Sampling,\" IEEE Journal of Selected Topics in Signal\n  Processing, to appear in Feb. 2010", "journal-ref": null, "doi": "10.1109/JSTSP.2009.2038973", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A MIMO radar system is proposed for obtaining angle and Doppler information\non potential targets. Transmitters and receivers are nodes of a small scale\nwireless network and are assumed to be randomly scattered on a disk. The\ntransmit nodes transmit uncorrelated waveforms. Each receive node applies\ncompressive sampling to the received signal to obtain a small number of\nsamples, which the node subsequently forwards to a fusion center. Assuming that\nthe targets are sparsely located in the angle- Doppler space, based on the\nsamples forwarded by the receive nodes the fusion center formulates an\nl1-optimization problem, the solution of which yields target angle and Doppler\ninformation. The proposed approach achieves the superior resolution of MIMO\nradar with far fewer samples than required by other approaches. This implies\npower savings during the communication phase between the receive nodes and the\nfusion center. Performance in the presence of a jammer is analyzed for the case\nof slowly moving targets. Issues related to forming the basis matrix that spans\nthe angle-Doppler space, and for selecting a grid for that space are discussed.\nExtensive simulation results are provided to demonstrate the performance of the\nproposed approach at difference jammer and noise levels.\n", "versions": [{"version": "v1", "created": "Wed, 25 Nov 2009 03:19:13 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Yu", "Yao", ""], ["Petropulu", "Athina P.", ""], ["Poor", "H. Vincent", ""]]}, {"id": "0911.4880", "submitter": "Ali Hormati", "authors": "Ali Hormati, Amin Karbasi, Soheil Mohajer, Martin Vetterli", "title": "An Estimation Theoretic Approach for Sparsity Pattern Recovery in the\n  Noisy Setting", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Compressed sensing deals with the reconstruction of sparse signals using a\nsmall number of linear measurements. One of the main challenges in compressed\nsensing is to find the support of a sparse signal. In the literature, several\nbounds on the scaling law of the number of measurements for successful support\nrecovery have been derived where the main focus is on random Gaussian\nmeasurement matrices. In this paper, we investigate the noisy support recovery\nproblem from an estimation theoretic point of view, where no specific\nassumption is made on the underlying measurement matrix. The linear\nmeasurements are perturbed by additive white Gaussian noise. We define the\noutput of a support estimator to be a set of position values in increasing\norder. We set the error between the true and estimated supports as the\n$\\ell_2$-norm of their difference. On the one hand, this choice allows us to\nuse the machinery behind the $\\ell_2$-norm error metric and on the other hand,\nconverts the support recovery into a more intuitive and geometrical problem.\nFirst, by using the Hammersley-Chapman-Robbins (HCR) bound, we derive a\nfundamental lower bound on the performance of any \\emph{unbiased} estimator of\nthe support set. This lower bound provides us with necessary conditions on the\nnumber of measurements for reliable $\\ell_2$-norm support recovery, which we\nspecifically evaluate for uniform Gaussian measurement matrices. Then, we\nanalyze the maximum likelihood estimator and derive conditions under which the\nHCR bound is achievable. This leads us to the number of measurements for the\noptimum decoder which is sufficient for reliable $\\ell_2$-norm support\nrecovery. Using this framework, we specifically evaluate sufficient conditions\nfor uniform Gaussian measurement matrices.\n", "versions": [{"version": "v1", "created": "Wed, 25 Nov 2009 15:27:39 GMT"}], "update_date": "2009-11-26", "authors_parsed": [["Hormati", "Ali", ""], ["Karbasi", "Amin", ""], ["Mohajer", "Soheil", ""], ["Vetterli", "Martin", ""]]}, {"id": "0911.4896", "submitter": "Ali Tajer", "authors": "Ali Tajer and Aria Nosratinia", "title": "Diversity Order in ISI Channels with Single-Carrier Frequency-Domain\n  Equalizers", "comments": "30 pages, 6 figures, to appear in the IEEE Transactions on Wireless\n  Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyzes the diversity gain achieved by single-carrier\nfrequency-domain equalizer (SC-FDE) in frequency selective channels, and\nuncovers the interplay between diversity gain $d$, channel memory length $\\nu$,\ntransmission block length $L$, and the spectral efficiency $R$. We specifically\nshow that for the class of minimum means-square error (MMSE) SC-FDE receivers,\nfor rates $R\\leq\\log\\frac{L}{\\nu}$ full diversity of $d=\\nu+1$ is achievable,\nwhile for higher rates the diversity is given by $d=\\lfloor2^{-R}L\\rfloor+1$.\nIn other words, the achievable diversity gain depends not only on the channel\nmemory length, but also on the desired spectral efficiency and the transmission\nblock length. A similar analysis reveals that for zero forcing SC-FDE, the\ndiversity order is always one irrespective of channel memory length and\nspectral efficiency. These results are supported by simulations.\n", "versions": [{"version": "v1", "created": "Wed, 25 Nov 2009 16:08:59 GMT"}], "update_date": "2009-11-26", "authors_parsed": [["Tajer", "Ali", ""], ["Nosratinia", "Aria", ""]]}, {"id": "0911.4910", "submitter": "Tao Zhou", "authors": "Ci-Hang Jin, Jian-Guo Liu, Yi-Cheng Zhang, Tao Zhou", "title": "Adaptive information filtering for dynamic recommender systems", "comments": "6 pages, 5 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamic environment in the real world calls for the adaptive techniques\nfor information filtering, namely to provide real-time responses to the changes\nof system data. Where many incremental algorithms are designed for this\npurpose, they are usually challenged by the worse and worse performance\nresulted from the cumulative errors over time. In this Letter, we propose two\nincremental diffusion-based algorithms for the personalized recommendations,\nwhich integrate some pieces of local and fast updatings to achieve the\napproximate results. In addition to the fast responses, the errors of the\nproposed algorithms do not cumulate over time, that is to say, the global\nrecomputing is unnecessary. This remarkable advantage is demonstrated by\nseveral metrics on algorithmic accuracy for two movie recommender systems and a\nsocial bookmarking system.\n", "versions": [{"version": "v1", "created": "Wed, 25 Nov 2009 16:34:13 GMT"}], "update_date": "2009-11-26", "authors_parsed": [["Jin", "Ci-Hang", ""], ["Liu", "Jian-Guo", ""], ["Zhang", "Yi-Cheng", ""], ["Zhou", "Tao", ""]]}, {"id": "0911.5067", "submitter": "Ralf Mueller", "authors": "Laura Cottatellucci, Ralf R. Mueller, and Merouane Debbah", "title": "Asynchronous CDMA Systems with Random Spreading-Part II: Design Criteria", "comments": null, "journal-ref": "IEEE Transactions on Information Theory, vol. 56, no. 4, pp.\n  1498-1520, Apr. 2010", "doi": "10.1109/TIT.2010.2040898", "report-no": null, "categories": "cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Totally asynchronous code-division multiple-access (CDMA) systems are\naddressed. In Part I, the fundamental limits of asynchronous CDMA systems are\nanalyzed in terms of spectral efficiency and SINR at the output of the optimum\nlinear detector. The focus of Part II is the design of low-complexity\nimplementations of linear multiuser detectors in systems with many users that\nadmit a multistage representation, e.g. reduced rank multistage Wiener filters,\npolynomial expansion detectors, weighted linear parallel interference\ncancellers. The effects of excess bandwidth, chip-pulse shaping, and time delay\ndistribution on CDMA with suboptimum linear receiver structures are\ninvestigated. Recursive expressions for universal weight design are given. The\nperformance in terms of SINR is derived in the large-system limit and the\nperformance improvement over synchronous systems is quantified. The\nconsiderations distinguish between two ways of forming discrete-time\nstatistics: chip-matched filtering and oversampling.\n", "versions": [{"version": "v1", "created": "Thu, 26 Nov 2009 12:01:57 GMT"}], "update_date": "2010-07-13", "authors_parsed": [["Cottatellucci", "Laura", ""], ["Mueller", "Ralf R.", ""], ["Debbah", "Merouane", ""]]}, {"id": "0911.5106", "submitter": "Pedro Alejandro Ortega", "authors": "Pedro A. Ortega, Daniel A. Braun", "title": "A conversion between utility and information", "comments": "AGI-2010. 6 pages, 1 figure", "journal-ref": "AGI-2010", "doi": null, "report-no": null, "categories": "cs.AI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rewards typically express desirabilities or preferences over a set of\nalternatives. Here we propose that rewards can be defined for any probability\ndistribution based on three desiderata, namely that rewards should be\nreal-valued, additive and order-preserving, where the latter implies that more\nprobable events should also be more desirable. Our main result states that\nrewards are then uniquely determined by the negative information content. To\nanalyze stochastic processes, we define the utility of a realization as its\nreward rate. Under this interpretation, we show that the expected utility of a\nstochastic process is its negative entropy rate. Furthermore, we apply our\nresults to analyze agent-environment interactions. We show that the expected\nutility that will actually be achieved by the agent is given by the negative\ncross-entropy from the input-output (I/O) distribution of the coupled\ninteraction system and the agent's I/O distribution. Thus, our results allow\nfor an information-theoretic interpretation of the notion of utility and the\ncharacterization of agent-environment interactions in terms of entropy\ndynamics.\n", "versions": [{"version": "v1", "created": "Thu, 26 Nov 2009 15:56:38 GMT"}, {"version": "v2", "created": "Wed, 30 Dec 2009 23:30:35 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Ortega", "Pedro A.", ""], ["Braun", "Daniel A.", ""]]}, {"id": "0911.5300", "submitter": "William Matthews", "authors": "Toby S. Cubitt, Debbie Leung, William Matthews, Andreas Winter", "title": "Improving zero-error classical communication with entanglement", "comments": "6 pages, 2 figures. Version 2 is the same as the journal version plus\n  figure 1 and the non-signalling box example", "journal-ref": "Phys. Rev. Lett. 104, 230503 (2010)", "doi": "10.1103/PhysRevLett.104.230503", "report-no": "NSF-KITP-09-210", "categories": "quant-ph cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given one or more uses of a classical channel, only a certain number of\nmessages can be transmitted with zero probability of error. The study of this\nnumber and its asymptotic behaviour constitutes the field of classical\nzero-error information theory, the quantum generalisation of which has started\nto develop recently. We show that, given a single use of certain classical\nchannels, entangled states of a system shared by the sender and receiver can be\nused to increase the number of (classical) messages which can be sent with no\nchance of error. In particular, we show how to construct such a channel based\non any proof of the Bell-Kochen-Specker theorem. This is a new example of the\nuse of quantum effects to improve the performance of a classical task. We\ninvestigate the connection between this phenomenon and that of\n``pseudo-telepathy'' games. The use of generalised non-signalling correlations\nto assist in this task is also considered. In this case, a particularly elegant\ntheory results and, remarkably, it is sometimes possible to transmit\ninformation with zero-error using a channel with no unassisted zero-error\ncapacity.\n", "versions": [{"version": "v1", "created": "Fri, 27 Nov 2009 16:45:00 GMT"}, {"version": "v2", "created": "Fri, 29 Oct 2010 15:28:39 GMT"}], "update_date": "2010-11-01", "authors_parsed": [["Cubitt", "Toby S.", ""], ["Leung", "Debbie", ""], ["Matthews", "William", ""], ["Winter", "Andreas", ""]]}, {"id": "0911.5385", "submitter": "Ralf Mueller", "authors": "Laura Cottatellucci, Ralf R. Mueller, and Merouane Debbah", "title": "Asynchronous CDMA Systems with Random Spreading-Part I: Fundamental\n  Limits", "comments": null, "journal-ref": "IEEE Transactions on Information Theory, vol. 56, no. 4, pp.\n  1477-1497, Apr. 2010", "doi": "10.1109/TIT.2010.2040890", "report-no": null, "categories": "cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spectral efficiency for asynchronous code division multiple access (CDMA)\nwith random spreading is calculated in the large system limit allowing for\narbitrary chip waveforms and frequency-flat fading. Signal to interference and\nnoise ratios (SINRs) for suboptimal receivers, such as the linear minimum mean\nsquare error (MMSE) detectors, are derived. The approach is general and\noptionally allows even for statistics obtained by under-sampling the received\nsignal.\n  All performance measures are given as a function of the chip waveform and the\ndelay distribution of the users in the large system limit. It turns out that\nsynchronizing users on a chip level impairs performance for all chip waveforms\nwith bandwidth greater than the Nyquist bandwidth, e.g., positive roll-off\nfactors. For example, with the pulse shaping demanded in the UMTS standard,\nuser synchronization reduces spectral efficiency up to 12% at 10 dB normalized\nsignal-to-noise ratio. The benefits of asynchronism stem from the finding that\nthe excess bandwidth of chip waveforms actually spans additional dimensions in\nsignal space, if the users are de-synchronized on the chip-level. The analysis\nof linear MMSE detectors shows that the limiting interference effects can be\ndecoupled both in the user domain and in the frequency domain such that the\nconcept of the effective interference spectral density arises. This generalizes\nand refines Tse and Hanly's concept of effective interference.\n  In Part II, the analysis is extended to any linear detector that admits a\nrepresentation as multistage detector and guidelines for the design of low\ncomplexity multistage detectors with universal weights are provided.\n", "versions": [{"version": "v1", "created": "Sat, 28 Nov 2009 09:11:25 GMT"}], "update_date": "2010-07-13", "authors_parsed": [["Cottatellucci", "Laura", ""], ["Mueller", "Ralf R.", ""], ["Debbah", "Merouane", ""]]}, {"id": "0911.5459", "submitter": "Graham Norton", "authors": "Graham H. Norton", "title": "Shortest Two-way Linear Recurrences", "comments": "This paper has been withdrawn by the author as the proof of Part (b)\n  of Theorem 4.10(ii) is incorrect", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.SC math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $s$ be a finite sequence over a field of length $n$. It is well-known\nthat if $s$ satisfies a linear recurrence of order $d$ with non-zero constant\nterm, then the reverse of $s$ also satisfies a recurrence of order $d$ (with\ncoefficients in reverse order). A recent article of A. Salagean proposed an\nalgorithm to find such a shortest 'two-way' recurrence -- which may be longer\nthan a linear recurrence for $s$ of shortest length $\\LC_n$.\n  We give a new and simpler algorithm to compute a shortest two-way linear\nrecurrence. First we show that the pairs of polynomials we use to construct a\nminimal polynomial iteratively are always relatively prime; we also give the\nextended multipliers. Then we combine degree lower bounds with a\nstraightforward rewrite of a published algorithm due to the author to obtain\nour simpler algorithm. The increase in shortest length is\n$\\max\\{n+1-2\\LC_n,0\\}$.\n", "versions": [{"version": "v1", "created": "Sun, 29 Nov 2009 04:36:32 GMT"}, {"version": "v2", "created": "Thu, 3 Dec 2009 03:12:58 GMT"}, {"version": "v3", "created": "Thu, 22 Jul 2010 22:27:50 GMT"}], "update_date": "2010-07-26", "authors_parsed": [["Norton", "Graham H.", ""]]}, {"id": "0911.5487", "submitter": "Jinshan Zhang", "authors": "Jinshan Zhang, Heng Liang, Fengshan Bai", "title": "Strong Spatial Mixing for Binary Markov Random Fields", "comments": "13pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gibbs distribution of binary Markov random fields on a sparse on average\ngraph is considered in this paper. The strong spatial mixing is proved under\nthe condition that the `external field' is uniformly large or small. Such\ncondition on `external field' is meaningful in physics.\n", "versions": [{"version": "v1", "created": "Sun, 29 Nov 2009 14:10:36 GMT"}], "update_date": "2009-12-01", "authors_parsed": [["Zhang", "Jinshan", ""], ["Liang", "Heng", ""], ["Bai", "Fengshan", ""]]}, {"id": "0911.5508", "submitter": "G David Forney Jr.", "authors": "G. David Forney Jr", "title": "Codes on graphs: Duality and MacWilliams identities", "comments": "30 pages, 20 figures. Accepted for IEEE Transactions on Information\n  Theory. Preliminary versions presented at IEEE Information Theory Workshop,\n  Taormina, Italy, October 2009 and 2010 IEEE International Symposium on\n  Information Theory, Austin, TX, June 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A conceptual framework involving partition functions of normal factor graphs\nis introduced, paralleling a similar recent development by Al-Bashabsheh and\nMao. The partition functions of dual normal factor graphs are shown to be a\nFourier transform pair, whether or not the graphs have cycles. The original\nnormal graph duality theorem follows as a corollary. Within this framework,\nMacWilliams identities are found for various local and global weight generating\nfunctions of general group or linear codes on graphs; this generalizes and\nprovides a concise proof of the MacWilliams identity for linear time-invariant\nconvolutional codes that was recently found by Gluesing-Luerssen and Schneider.\nFurther MacWilliams identities are developed for terminated convolutional\ncodes, particularly for tail-biting codes, similar to those studied recently by\nBocharova, Hug, Johannesson and Kudryashov.\n", "versions": [{"version": "v1", "created": "Sun, 29 Nov 2009 19:03:01 GMT"}, {"version": "v2", "created": "Mon, 10 May 2010 18:10:58 GMT"}, {"version": "v3", "created": "Sun, 1 Aug 2010 20:47:56 GMT"}, {"version": "v4", "created": "Sat, 20 Nov 2010 16:53:47 GMT"}], "update_date": "2010-11-23", "authors_parsed": [["Forney", "G. David", "Jr"]]}, {"id": "0911.5509", "submitter": "Rajesh Krishnamachari", "authors": "Rajesh T Krishnamachari and Mahesh K Varanasi", "title": "Interference Alignment Under Limited Feedback for MIMO Interference\n  Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While interference alignment schemes have been employed to realize the full\nmultiplexing gain of $K$-user interference channels, the analyses performed so\nfar have predominantly focused on the case when global channel knowledge is\navailable at each node of the network. This paper considers the problem where\neach receiver knows its channels from all the transmitters and feeds back this\ninformation using a limited number of bits to all other terminals. In\nparticular, channel quantization over the composite Grassmann manifold is\nproposed and analyzed. It is shown, for $K$-user multiple-input,\nmultiple-output (MIMO) interference channels, that when the transmitters use an\ninterference alignment strategy as if the quantized channel estimates obtained\nvia this limited feedback are perfect, the full sum degrees of freedom of the\ninterference channel can be achieved as long as the feedback bit rate scales\nsufficiently fast with the signal-to-noise ratio. Moreover, this is only one\nextreme point of a continuous tradeoff between achievable degrees of freedom\nregion and user feedback rate scalings which are allowed to be non-identical.\nIt is seen that a slower scaling of feedback rate for any one user leads to\ncommensurately fewer degrees of freedom for that user alone.\n", "versions": [{"version": "v1", "created": "Sun, 29 Nov 2009 19:26:59 GMT"}], "update_date": "2009-12-01", "authors_parsed": [["Krishnamachari", "Rajesh T", ""], ["Varanasi", "Mahesh K", ""]]}, {"id": "0911.5515", "submitter": "{\\O}yvind Ryan", "authors": "{\\O}. Ryan, A. Masucci, S. Yang, M. Debbah", "title": "Finite Dimensional Statistical Inference", "comments": "14 pages, 13 figures. Submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2112010", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we derive the explicit series expansion of the eigenvalue\ndistribution of various models, namely the case of non-central Wishart\ndistributions, as well as correlated zero mean Wishart distributions. The tools\nused extend those of the free probability framework, which have been quite\nsuccessful for high dimensional statistical inference (when the size of the\nmatrices tends to infinity), also known as free deconvolution. This\ncontribution focuses on the finite Gaussian case and proposes algorithmic\nmethods to compute the moments. Cases where asymptotic results fail to apply\nare also discussed.\n", "versions": [{"version": "v1", "created": "Sun, 29 Nov 2009 21:00:28 GMT"}, {"version": "v2", "created": "Fri, 9 Jul 2010 12:52:43 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Ryan", "Ø.", ""], ["Masucci", "A.", ""], ["Yang", "S.", ""], ["Debbah", "M.", ""]]}, {"id": "0911.5524", "submitter": "Namrata Vaswani", "authors": "Namrata Vaswani", "title": "LS-CS-residual (LS-CS): Compressive Sensing on Least Squares Residual", "comments": "Accepted (with mandatory minor revisions) to IEEE Trans. Signal\n  Processing. 12 pages, 5 figures", "journal-ref": "IEEE Trans. Signal Processing, pages 4108 - 4120, vol. 58(8),\n  August 2010", "doi": "10.1109/TSP.2010.2048105", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of recursively and causally reconstructing time\nsequences of sparse signals (with unknown and time-varying sparsity patterns)\nfrom a limited number of noisy linear measurements. The sparsity pattern is\nassumed to change slowly with time. The idea of our proposed solution,\nLS-CS-residual (LS-CS), is to replace compressed sensing (CS) on the\nobservation by CS on the least squares (LS) residual computed using the\nprevious estimate of the support. We bound CS-residual error and show that when\nthe number of available measurements is small, the bound is much smaller than\nthat on CS error if the sparsity pattern changes slowly enough. We also obtain\nconditions for \"stability\" of LS-CS over time for a signal model that allows\nsupport additions and removals, and that allows coefficients to gradually\nincrease (decrease) until they reach a constant value (become zero). By\n\"stability\", we mean that the number of misses and extras in the support\nestimate remain bounded by time-invariant values (in turn implying a\ntime-invariant bound on LS-CS error). The concept is meaningful only if the\nbounds are small compared to the support size. Numerical experiments backing\nour claims are shown.\n", "versions": [{"version": "v1", "created": "Sun, 29 Nov 2009 22:40:47 GMT"}, {"version": "v2", "created": "Wed, 20 Jan 2010 17:00:12 GMT"}], "update_date": "2010-07-28", "authors_parsed": [["Vaswani", "Namrata", ""]]}, {"id": "0911.5527", "submitter": "Kamyar Moshksar", "authors": "Kamyar Moshksar, Alireza Bayesteh, Amir K. Khandani", "title": "A model for randomized resource allocation in decentralized wireless\n  networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a decentralized wireless communication network\nwith a fixed number $u$ of frequency sub-bands to be shared among $N$\ntransmitter-receiver pairs. It is assumed that the number of active users is a\nrandom variable with a given probability mass function. Moreover, users are\nunaware of each other's codebooks and hence, no multiuser detection is\npossible. We propose a randomized Frequency Hopping (FH) scheme in which each\ntransmitter randomly hops over a subset of $u$ sub-bands from transmission to\ntransmission. We derive lower and upper bounds on the mutual information of\neach user and demonstrate that, for large Signal-to-Noise Ratio (SNR) values,\nthe two bounds coincide. This observation enables us to compute the sum\nmultiplexing gain of the system and obtain the optimum hopping strategy for\nmaximizing this quantity. We compare the performance of the FH system with that\nof the Frequency Division (FD) system in terms of several performance measures\nand show that (depending on the probability mass function of the number of\nactive users) the FH system can offer a significant improvement implying a more\nefficient usage of the spectrum.\n", "versions": [{"version": "v1", "created": "Sun, 29 Nov 2009 23:43:43 GMT"}], "update_date": "2009-12-01", "authors_parsed": [["Moshksar", "Kamyar", ""], ["Bayesteh", "Alireza", ""], ["Khandani", "Amir K.", ""]]}, {"id": "0911.5553", "submitter": "Kamyar Moshksar", "authors": "Kamyar Moshksar, Alireza Bayesteh, Amir K. Khandani", "title": "Randomized vs. orthogonal spectrum allocation in decentralized networks:\n  Outage Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address a decentralized wireless communication network with a fixed number\n$u$ of frequency sub-bands to be shared among $N$ transmitter-receiver pairs.\nIt is assumed that the number of users $N$ is a random variable with a given\ndistribution and the channel gains are quasi-static Rayleigh fading. The\ntransmitters are assumed to be unaware of the number of active users in the\nnetwork as well as the channel gains and not capable of detecting the presence\nof other users in a given frequency sub-band. Moreover, the users are unaware\nof each other's codebooks and hence, no multiuser detection is possible. We\nconsider a randomized Frequency Hopping (FH) scheme in which each transmitter\nrandomly hops over a subset of the $u$ sub-bands from transmission to\ntransmission. Developing a new upper bound on the differential entropy of a\nmixed Gaussian random vector and using entropy power inequality, we offer a\nseries of lower bounds on the achievable rate of each user. Thereafter, we\nobtain lower bounds on the maximum transmission rate per user to ensure a\nspecified outage probability at a given Signal-to-Noise Ratio (SNR) level. We\ndemonstrate that the so-called outage capacity can be considerably higher in\nthe FH scheme than in the Frequency Division (FD) scenario for reasonable\ndistributions on the number of active users. This guarantees a higher spectral\nefficiency in FH compared to FD.\n", "versions": [{"version": "v1", "created": "Mon, 30 Nov 2009 07:01:19 GMT"}], "update_date": "2009-12-01", "authors_parsed": [["Moshksar", "Kamyar", ""], ["Bayesteh", "Alireza", ""], ["Khandani", "Amir K.", ""]]}, {"id": "0911.5667", "submitter": "Christian Senger", "authors": "Christian Senger, Steffen Schober, Tong Mao, Alexander Zeh", "title": "End-to-End Algebraic Network Coding for Wireless TCP/IP Networks", "comments": "Accepted for the 17th International Conference on Telecommunications\n  2010 (ICT2010), Doha, Qatar, April 4 - 7, 2010. 6 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Transmission Control Protocol (TCP) was designed to provide reliable\ntransport services in wired networks. In such networks, packet losses mainly\noccur due to congestion. Hence, TCP was designed to apply congestion avoidance\ntechniques to cope with packet losses. Nowadays, TCP is also utilized in\nwireless networks where, besides congestion, numerous other reasons for packet\nlosses exist. This results in reduced throughput and increased transmission\nround-trip time when the state of the wireless channel is bad. We propose a new\nnetwork layer, that transparently sits below the transport layer and hides non\ncongestion-imposed packet losses from TCP. The network coding in this new layer\nis based on the well-known class of Maximum Distance Separable (MDS) codes.\n", "versions": [{"version": "v1", "created": "Mon, 30 Nov 2009 15:18:39 GMT"}, {"version": "v2", "created": "Tue, 20 Apr 2010 08:09:40 GMT"}], "update_date": "2010-04-21", "authors_parsed": [["Senger", "Christian", ""], ["Schober", "Steffen", ""], ["Mao", "Tong", ""], ["Zeh", "Alexander", ""]]}]