[{"id": "1004.0050", "submitter": "Andr\\'es Arcia-Moret", "authors": "Andres Arcia-Moret and Yubo Yang and Nicolas Montavont and David Ros", "title": "A Study of Bandwidth-Perception Management Mechanisms in IEEE 802.16\n  Networks", "comments": "10 pages, 20 figs.", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bandwidth request-grant mechanisms are used in 802.16 networks to manage the\nuplink bandwidth needs of subscriber stations (SSs). Requests may be sent by\nSSs to the base station (BS) by means of several mechanisms defined in the\nstandard. Based on the incoming requests, the BS (which handles most of the\nbandwidth scheduling in the system) schedules the transmission of uplink\ntraffic, by assigning transmission opportunities to the SSs in an\nimplementation-dependent manner. In this paper we present a study of some\nbandwidth allocation issues, arising from the management of the perception of\nsubscriber stations' bandwidth needs at the base station. We illustrate how the\nbandwidth perception varies depending on the policy used to handle requests and\ngrants. By means of ns-2 simulations, we evaluate the potential impact of such\npolicies on the system's aggregate throughput when the traffic is composed of\nBest-Effort TCP flows.\n", "versions": [{"version": "v1", "created": "Thu, 1 Apr 2010 04:17:32 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Arcia-Moret", "Andres", ""], ["Yang", "Yubo", ""], ["Montavont", "Nicolas", ""], ["Ros", "David", ""]]}, {"id": "1004.0152", "submitter": "Joseph Blomer", "authors": "Joseph Blomer, Nihar Jindal", "title": "Opportunistic Routing in Ad Hoc Networks: How many relays should there\n  be? What rate should nodes use?", "comments": "5 pages, 8 figures, Submitted to IEEE GLOBECOM 2010", "journal-ref": null, "doi": "10.1109/GLOCOM.2010.5684338", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Opportunistic routing is a multi-hop routing scheme which allows for\nselection of the best immediately available relay. In blind opportunistic\nrouting protocols, where transmitters blindly broadcast without knowledge of\nthe surrounding nodes, two fundamental design parameters are the node\ntransmission probability and the transmission spectral efficiency. In this\npaper these parameters are selected to maximize end-to-end performance,\ncharacterized by the product of transmitter density, hop distance and rate. Due\nto the intractability of the problem as stated, an approximation function is\nexamined which proves reasonably accurate. Our results show how the above\ndesign parameters should be selected based on inherent system parameters such\nas the path loss exponent and the noise level.\n", "versions": [{"version": "v1", "created": "Thu, 1 Apr 2010 15:15:09 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Blomer", "Joseph", ""], ["Jindal", "Nihar", ""]]}, {"id": "1004.0204", "submitter": "Julien Henaut", "authors": "Julien Henaut (LAAS), Aubin Lecointre (LAAS), Daniela Dragomirescu\n  (LAAS), Robert Plana (LAAS)", "title": "Radio Interface for High Data Rate Wireless Sensor Networks", "comments": null, "journal-ref": "International Conference on Computing, Communications and Control\n  Technologies, Orlando, Fl : \\'Etats-Unis d'Am\\'erique (2008)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper gives an overview of radio interfaces devoted for high data rate\nWireless Sensor Networks. Four aerospace applications of WSN are presented to\nunderline the importance of achieving high data rate. Then, two modulation\nschemes by which High Data Rate can be achieved are compared : Multi carrier\napproaches, represented by the popular Orthogonal Frequency Division\nMultiplexing (OFDM) and Single carrier methods, represented by Single Carrier\nFrequency division Equalization and its application for multiple access Single\nCarrier Frequency division multiple Access (SC-FDMA). SC-FDMA, with a very low\nPeak Average Power Ratio (PAPR), is as strong alternative to the OFDM scheme\nfor highly power constraint application. The Chosen radio interface will be,\nfinally, tested by a model based design approach based on Simulink and FPGA\nrealization. SC-FDMA, with a very low Peak Average Power Ratio (PAPR), is as\nstrong alternative to the OFDM scheme for highly power constraint application.\nThe Chosen radio interface will be, finally, tested by a model based design\napproach based on Simulink and FPGA realization.\n", "versions": [{"version": "v1", "created": "Thu, 1 Apr 2010 18:45:36 GMT"}], "update_date": "2010-04-08", "authors_parsed": [["Henaut", "Julien", "", "LAAS"], ["Lecointre", "Aubin", "", "LAAS"], ["Dragomirescu", "Daniela", "", "LAAS"], ["Plana", "Robert", "", "LAAS"]]}, {"id": "1004.0263", "submitter": "Vincenzo Pellegrini", "authors": "Vincenzo Pellegrini, Luca Rose, and Mario Di Dio", "title": "On Memory Accelerated Signal Processing within Software Defined Radios", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Since J. Mitola's work in 1992, Software Defined Radios (SDRs) have been\nquite a hot topic in wireless systems research. Though many notable\nachievements were reported in the field, the scarcity of computational power on\ngeneral purpose CPUs has always constrained their wide adoption in production\nenvironments. If conveniently applied within an SDR context, classical concepts\nknown in computer science as space/time tradeoffs can be extremely helpful when\ntrying to mitigate this problem. Inspired by and building on those concepts,\nthis paper presents a novel SDR implementation technique which we call Memory\nAcceleration (MA) that makes extensive use of the memory resources available on\na general purpose computing system, in order to accelerate signal computation.\nMA can provide substantial acceleration factors when applied to conventional\nSDRs without reducing their peculiar flexibility. As a practical proof of this,\nan example of MA applied in the real world to the ETSI DVB-T Viterbi decoder is\nprovided. Actually MA is shown able to provide, when applied to such Viterbi\ndecoder, an acceleration factor of 10.4x, with no impact on error correction\nperformances of the decoder and by making no use of any other typical\nperformance enhancement techniques such as low level (Assembler) programming or\nparallel computation, which though remain compatible with MA. Opportunity for\nextending the MA approach to the entire radio system, thus implementing what we\ncall a Memory-Based Software Defined Radio (MB-SDR) is finally considered and\ndiscussed.\n", "versions": [{"version": "v1", "created": "Fri, 2 Apr 2010 00:31:28 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Pellegrini", "Vincenzo", ""], ["Rose", "Luca", ""], ["Di Dio", "Mario", ""]]}, {"id": "1004.0313", "submitter": "Majed Haddad", "authors": "Salah Eddine Elayoubi, Eitan Altman, Majed Haddad, Zwi Altman", "title": "A hybrid decision approach for the association problem in heterogeneous\n  networks", "comments": "5 pages, 4 figures, IEEE Infocom, San Diego, USA, March 2010.", "journal-ref": null, "doi": "10.1109/INFCOM.2010.5462204", "report-no": null, "categories": "cs.GT cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The area of networking games has had a growing impact on wireless networks.\nThis reflects the recognition in the important scaling advantages that the\nservice providers can benefit from by increasing the autonomy of mobiles in\ndecision making. This may however result in inefficiencies that are inherent to\nequilibria in non-cooperative games. Due to the concern for efficiency,\ncentralized protocols keep being considered and compared to decentralized ones.\nFrom the point of view of the network architecture, this implies the\nco-existence of network-centric and terminal centric radio resource management\nschemes. Instead of taking part within the debate among the supporters of each\nsolution, we propose in this paper hybrid schemes where the wireless users are\nassisted in their decisions by the network that broadcasts aggregated load\ninformation. We derive the utilities related to the Quality of Service (QoS)\nperceived by the users and develop a Bayesian framework to obtain the\nequilibria. Numerical results illustrate the advantages of using our hybrid\ngame framework in an association problem in a network composed of HSDPA and 3G\nLTE systems.\n", "versions": [{"version": "v1", "created": "Fri, 2 Apr 2010 10:39:06 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Elayoubi", "Salah Eddine", ""], ["Altman", "Eitan", ""], ["Haddad", "Majed", ""], ["Altman", "Zwi", ""]]}, {"id": "1004.0395", "submitter": "Daniel Menasche", "authors": "Daniel S. Menasche, Antonio A. A. Rocha, Edmundo A. de Souza e Silva,\n  Rosa M. Leao, Don Towsley, Arun Venkataramani", "title": "Estimating Self-Sustainability in Peer-to-Peer Swarming Systems", "comments": "27 pages, 5 figures", "journal-ref": "Performance Evaluation, 67(11), 1243-1258 (2010)", "doi": "10.1016/j.peva.2010.08.013", "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer-to-peer swarming is one of the \\emph{de facto} solutions for distributed\ncontent dissemination in today's Internet. By leveraging resources provided by\nclients, swarming systems reduce the load on and costs to publishers. However,\nthere is a limit to how much cost savings can be gained from swarming; for\nexample, for unpopular content peers will always depend on the publisher in\norder to complete their downloads. In this paper, we investigate this\ndependence. For this purpose, we propose a new metric, namely \\emph{swarm\nself-sustainability}. A swarm is referred to as self-sustaining if all its\nblocks are collectively held by peers; the self-sustainability of a swarm is\nthe fraction of time in which the swarm is self-sustaining. We pose the\nfollowing question: how does the self-sustainability of a swarm vary as a\nfunction of content popularity, the service capacity of the users, and the size\nof the file? We present a model to answer the posed question. We then propose\nefficient solution methods to compute self-sustainability. The accuracy of our\nestimates is validated against simulation. Finally, we also provide closed-form\nexpressions for the fraction of time that a given number of blocks is\ncollectively held by peers.\n", "versions": [{"version": "v1", "created": "Fri, 2 Apr 2010 21:55:11 GMT"}, {"version": "v2", "created": "Tue, 6 Apr 2010 16:38:28 GMT"}, {"version": "v3", "created": "Mon, 9 Aug 2010 19:53:50 GMT"}], "update_date": "2019-03-07", "authors_parsed": [["Menasche", "Daniel S.", ""], ["Rocha", "Antonio A. A.", ""], ["Silva", "Edmundo A. de Souza e", ""], ["Leao", "Rosa M.", ""], ["Towsley", "Don", ""], ["Venkataramani", "Arun", ""]]}, {"id": "1004.0397", "submitter": "Jian Ni", "authors": "Mathieu Leconte, Jian Ni, R. Srikant", "title": "Mixing Time of Glauber Dynamics With Parallel Updates and Heterogeneous\n  Fugacities", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.DM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Glauber dynamics is a powerful tool to generate randomized, approximate\nsolutions to combinatorially difficult problems. Applications include Markov\nChain Monte Carlo (MCMC) simulation and distributed scheduling for wireless\nnetworks. In this paper, we derive bounds on the mixing time of a\ngeneralization of Glauber dynamics where multiple vertices are allowed to\nupdate their states in parallel and the fugacity of each vertex can be\ndifferent. The results can be used to obtain various conditions on the system\nparameters such as fugacities, vertex degrees and update probabilities, under\nwhich the mixing time grows polynomially in the number of vertices.\n", "versions": [{"version": "v1", "created": "Fri, 2 Apr 2010 22:08:18 GMT"}], "update_date": "2010-04-06", "authors_parsed": [["Leconte", "Mathieu", ""], ["Ni", "Jian", ""], ["Srikant", "R.", ""]]}, {"id": "1004.0421", "submitter": "Secretary Aircc Journal", "authors": "Jasmine Norman (1), J.Paulraj Joseph (2) and P.Prapoorna Roja\n  (3)((1)Measi Institute of Information Technology, India, (2)Manonmaniam\n  Sundaranar University, India and (3)Jerusalem College of Engineering, India)", "title": "A Faster Routing Scheme for Stationary Wireless Sensor Networks - A\n  Hybrid Approach", "comments": "10 pages", "journal-ref": "International Journal of Ad hoc, Sensor & Ubiquitous Computing 1.1\n  (2010) 1-10", "doi": "10.5121/ijasuc.2010.1101", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  A wireless sensor network consists of light-weight, low power, small size\nsensor nodes. Routing in wireless sensor networks is a demanding task. This\ndemand has led to a number of routing protocols which efficiently utilize the\nlimited resources available at the sensor nodes. Most of these protocols are\neither based on single hop routing or multi hop routing and typically find the\nminimum energy path without addressing other issues such as time delay in\ndelivering a packet, load balancing, and redundancy of data. Response time is\nvery critical in environment monitoring sensor networks where typically the\nsensors are stationary and transmit data to a base station or a sink node. In\nthis paper a faster load balancing routing protocol based on location with a\nhybrid approach is proposed.\n", "versions": [{"version": "v1", "created": "Sat, 3 Apr 2010 06:09:29 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Norman", "Jasmine", ""], ["Joseph", "J. Paulraj", ""], ["Roja", "P. Prapoorna", ""]]}, {"id": "1004.0422", "submitter": "Secretary Aircc Journal", "authors": "Anwar Hossain, Mohammed Tarique and Rumana Islam, (American\n  International University-Bangladesh)", "title": "Shadowing Effects on Routing Protocol of Multihop Ad Hoc Networks", "comments": "16 Pages", "journal-ref": "International Journal of Ad hoc, Sensor & Ubiquitous Computing 1.1\n  (2010) 12-28", "doi": "10.5121/ijasuc.2010.1102", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Two-ray ground reflection model has been widely used as the propagation model\nto investigate the performance of an ad hoc network. But two-ray model is too\nsimple to represent a real world network. A more realistic model namely\nshadowing propagation model has been used in this investigation. Under\nshadowing propagation model, a mobile node may receive a packet at a signal\nlevel that is below a required threshold level. This low signal level affects\nthe routing protocol as well as the medium access control protocol of a\nnetwork. An analytical model has been presented in this paper to investigate\nthe shadowing effects on the network performance. The analytical model has been\nverified via simulation results. Simulation results show that the performance\nof a network becomes very poor if shadowing propagation model is used in\ncompare to the simple two-ray model. Two solutions have also been proposed in\nthis paper to overcome the effects of shadowing. One solution is a physical\nlayer solution and the other one is a Medium Access Control (MAC) layer\nsolution. Simulation results show that these two solutions reduce the shadowing\neffect and improve network performance.\n", "versions": [{"version": "v1", "created": "Sat, 3 Apr 2010 06:16:30 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Hossain", "Anwar", ""], ["Tarique", "Mohammed", ""], ["Islam", "Rumana", ""]]}, {"id": "1004.0534", "submitter": "Przemyslaw Pawelczak", "authors": "Przemys{\\l}aw Pawe{\\l}czak, Shaunak Joshi, Sateesh Addepalli, John\n  Villasenor, and Danijela \\v{C}abri\\'c", "title": "Impact of Connection Admission Process on the Direct Retry Load\n  Balancing Algorithm in Cellular Network", "comments": "accepted to IEEE Transactions on Mobile Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an analytical framework for modeling a priority-based load\nbalancing scheme in cellular networks based on a new algorithm called direct\nretry with truncated offloading channel resource pool (DR$_{K}$). The model,\ndeveloped for a baseline case of two cell network, differs in many respects\nfrom previous works on load balancing. Foremost, it incorporates the call\nadmission process, through random access. In specific, the proposed model\nimplements the Physical Random Access Channel used in 3GPP network standards.\nFurthermore, the proposed model allows the differentiation of users based on\ntheir priorities. The quantitative results illustrate that, for example,\ncellular network operators can control the manner in which traffic is offloaded\nbetween neighboring cells by simply adjusting the length of the random access\nphase. Our analysis also allows for the quantitative determination of the\nblocking probability individual users will experience given a specific length\nof random access phase. Furthermore, we observe that the improvement in\nblocking probability per shared channel for load balanced users using DR$_{K}$\nis maximized at an intermediate number of shared channels, as opposed to the\nmaximum number of these shared resources. This occurs because a balance is\nachieved between the number of users requesting connections and those that are\nalready admitted to the network. We also present an extension of our analytical\nmodel to a multi-cell network (by means of an approximation) and an application\nof the proposed load balancing scheme in the context of opportunistic spectrum\naccess.\n", "versions": [{"version": "v1", "created": "Sun, 4 Apr 2010 21:09:37 GMT"}, {"version": "v2", "created": "Wed, 2 Jun 2010 23:34:40 GMT"}, {"version": "v3", "created": "Thu, 30 Sep 2010 22:16:54 GMT"}, {"version": "v4", "created": "Sun, 6 Feb 2011 06:27:38 GMT"}, {"version": "v5", "created": "Tue, 8 May 2012 14:53:10 GMT"}, {"version": "v6", "created": "Fri, 31 Aug 2012 13:42:03 GMT"}], "update_date": "2015-03-14", "authors_parsed": [["Pawełczak", "Przemysław", ""], ["Joshi", "Shaunak", ""], ["Addepalli", "Sateesh", ""], ["Villasenor", "John", ""], ["Čabrić", "Danijela", ""]]}, {"id": "1004.0567", "submitter": "Secretary Aircc Journal", "authors": "Rung-Ching Chen, Kai-Fan Cheng and Chia-Fen Hsieh (Chaoyang University\n  of Technology, Taiwan)", "title": "Using Rough Set and Support Vector Machine for Network Intrusion\n  Detection", "comments": "13 Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.1\n  (2009) 1-13", "doi": null, "report-no": null, "categories": "cs.LG cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The main function of IDS (Intrusion Detection System) is to protect the\nsystem, analyze and predict the behaviors of users. Then these behaviors will\nbe considered an attack or a normal behavior. Though IDS has been developed for\nmany years, the large number of return alert messages makes managers maintain\nsystem inefficiently. In this paper, we use RST (Rough Set Theory) and SVM\n(Support Vector Machine) to detect intrusions. First, RST is used to preprocess\nthe data and reduce the dimensions. Next, the features were selected by RST\nwill be sent to SVM model to learn and test respectively. The method is\neffective to decrease the space density of data. The experiments will compare\nthe results with different methods and show RST and SVM schema could improve\nthe false positive rate and accuracy.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2010 06:12:47 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Chen", "Rung-Ching", "", "Chaoyang University\n  of Technology, Taiwan"], ["Cheng", "Kai-Fan", "", "Chaoyang University\n  of Technology, Taiwan"], ["Hsieh", "Chia-Fen", "", "Chaoyang University\n  of Technology, Taiwan"]]}, {"id": "1004.0570", "submitter": "Secretary Aircc Journal", "authors": "Natarajan Meghanathan, Sumanth Reddy Allam and Loretta A. Moore\n  (Jackson State University)", "title": "Tools and techniques for Network Forensics", "comments": "12Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.1\n  (2009) 14-25", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Network forensics deals with the capture, recording and analysis of network\nevents in order to discover evidential information about the source of security\nattacks in a court of law. This paper discusses the different tools and\ntechniques available to conduct network forensics. Some of the tools discussed\ninclude: eMailTrackerPro to identify the physical location of an email sender;\nWeb Historian to find the duration of each visit and the files uploaded and\ndownloaded from the visited website; packet sniffers like Etherea to capture\nand analyze the data exchanged among the different computers in the network.\nThe second half of the paper presents a survey of different IP traceback\ntechniques like packet marking that help a forensic investigator to identify\nthe true sources of the attacking IP packets. We also discuss the use of\nHoneypots and Honeynets that gather intelligence about the enemy and the tools\nand tactics of network intruders.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2010 06:38:22 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Meghanathan", "Natarajan", "", "Jackson State University"], ["Allam", "Sumanth Reddy", "", "Jackson State University"], ["Moore", "Loretta A.", "", "Jackson State University"]]}, {"id": "1004.0587", "submitter": "Secretary Aircc Journal", "authors": "Debdutta Barman Roy(1), Rituparna Chaki(2), Nabendu Chaki(3),\n  ((1)Calcutta Institute of Engineering and Management, India, (2) West Bengal\n  University of Technology, India, (3)University of Calcutta, A.P.C. Road,\n  India)", "title": "A New Cluster-based Wormhole Intrusion detection algorithm for Mobile\n  Ad-Hoc Networks", "comments": "9Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.1\n  (2009) 44-52", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In multi-hop wireless systems, the need for cooperation among nodes to relay\neach other's packets exposes them to a wide range of security attacks. A\nparticularly devastating attack is the wormhole attack, where a malicious node\nrecords control traffic at one location and tunnels it to another compromised\nnode, possibly far away, which replays it locally. Routing security in ad hoc\nnetworks is often equated with strong and feasible node authentication and\nlightweight cryptography. Unfortunately, the wormhole attack can hardly be\ndefeated by crypto graphical measures, as wormhole attackers do not create\nseparate packets. They simply replay packets already existing on the network,\nwhich pass the cryptographic checks. Existing works on wormhole detection have\noften focused on detection using specialized hardware, such as directional\nantennas, etc. In this paper, we present a cluster based counter-measure for\nthe wormhole attack, that alleviates these drawbacks and efficiently mitigates\nthe wormhole attack in MANET. Simulation results on MATLab exhibit the\neffectiveness of the proposed algorithm in detecting wormhole attacks.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2010 08:18:31 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Roy", "Debdutta Barman", ""], ["Chaki", "Rituparna", ""], ["Chaki", "Nabendu", ""]]}, {"id": "1004.0591", "submitter": "Secretary Aircc Journal", "authors": "Eric Ke Wang, Lucas C.K.Hui and S.M.Yiu, (The University of Hong Kong,\n  Hong Kong)", "title": "A new key establishment scheme for wireless sensor networks", "comments": "11Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.2\n  (2009) 17-27", "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Traditional key management techniques, such as public key cryptography or key\ndistribution center (e.g., Kerberos), are often not effective for wireless\nsensor networks for the serious limitations in terms of computational power,\nenergy supply, network bandwidth. In order to balance the security and\nefficiency, we propose a new scheme by employing LU Composition techniques for\nmutual authenticated pairwise key establishment and integrating LU Matrix with\nElliptic Curve Diffie-Hellman for anonymous pathkey establishment. At the\nmeantime, it is able to achieve efficient group key agreement and management.\nAnalysis shows that the new scheme has better performance and provides\nauthenticity and anonymity for sensor to establish multiple kinds of keys,\ncompared with previous related works.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2010 08:38:27 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Wang", "Eric Ke", ""], ["Hui", "Lucas C. K.", ""], ["Yiu", "S. M.", ""]]}, {"id": "1004.0596", "submitter": "Secretary Aircc Journal", "authors": "G.M.Tamilselvan and A.Shanmugam,(Bannariamman Institute of Technology,\n  Tamilnadu, India)", "title": "Effect of Inter Packet Delay in performance analysis of coexistence\n  heterogeneous Wireless Packet Networks", "comments": "10Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.2\n  (2009) 40-49", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  As the explosive growth of the ISM band usage continues, there are many\nscenarios where different systems operate in the same place at the same time.\nOne of growing concerns is the coexistence of heterogeneous wireless network\nsystems. For the successful deployment of mission-critical systems such as\nwireless sensor networks, it is required to provide a solution for the\ncoexistence. In this paper, we propose a new scheme using inter packet delay\nfor the coexistence of IEEE 802.15.4 LRWPAN and IEEE 802.11b WLAN. To evaluate\nthe effectiveness of the proposed scheme, measurement and simulation study are\nconducted using Qualnet 4.5 simulation software. The simulation results show\nthat the proposed scheme is effective in performance improvement for\ncoexistence network of IEEE 802.15.4 for various topologies.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2010 08:58:44 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Tamilselvan", "G. M.", ""], ["Shanmugam", "A.", ""]]}, {"id": "1004.0598", "submitter": "Secretary Aircc Journal", "authors": "Mohammed Abuhelaleh, Khaled Elleithy and Thabet Mismar, (University of\n  Bridgeport USA)", "title": "Clustered Hierarchy in Sensor Networks: Performance and Security", "comments": "12Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.2\n  (2009) 51-62", "doi": null, "report-no": "Vol 1, No 2, July 2009", "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Many papers have been proposed in order to increase the wireless sensor\nnetworks performance; This kind of network has limited resources, where the\nenergy in each sensor came from a small battery that sometime is hard to be\nreplaced or recharged. Transmission energy is the most concern part where the\nhigher energy consumption takes place. Clustered hierarchy has been proposed in\nmany papers; in most cases, it provides the network with better performance\nthan other protocols. In our paper, first we discuss some of techniques,\nrelates to this protocol, that have been proposed for energy efficiency; some\nof them were proposed to provide the network with more security level. Our\nproposal then suggests some modifications to some of these techniques to\nprovide the network with more energy saving that should lead to high\nperformance; also we apply our technique on an existing one that proposed to\nincrease the security level of cluster sensor networks.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2010 09:06:33 GMT"}], "update_date": "2010-08-11", "authors_parsed": [["Abuhelaleh", "Mohammed", ""], ["Elleithy", "Khaled", ""], ["Mismar", "Thabet", ""]]}, {"id": "1004.0602", "submitter": "Secretary Aircc Journal", "authors": "N.Jaisankar(1), R.Saravanan(1), K. Durai Swamy(2), ((1)VIT University,\n  India,(2)Dean, K.S.R.C.T., Tiruchengodu, India)", "title": "Intelligent Detection System framework using Mobile agents", "comments": "17Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.2\n  (2009) 72-88", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  An intrusion detection system framework using mobile agents is a layered\nframework mechanism designed to support heterogeneous network environments to\nidentify intruders at its best. Traditional computer misuse detection\ntechniques can identify known attacks efficiently, but perform very poorly in\nother cases. Anomaly detection has the potential to detect unknown attacks;\nhowever, it is a very challenging task since its aim is to detect unknown\nattacks without any priori knowledge about specific intrusions. This technology\nis still at its early stage. The objective of this paper is that the system can\ndetect anomalous user activity. Existing research in this area focuses either\non user activity or on program operation but not on both simultaneously. In\nthis paper, an attempt to look at both concurrently is presented. Based on an\nintrusion detection framework [1], a novel user anomaly detection system has\nbeen implemented and conducted several intrusion detection experiments in a\nsimulated environment by analyzing user activity and program operation\nactivities. The proposed framework is a layered framework, which is designed to\nsatisfy the core purpose of IDS, and allows detecting the intrusion as quickly\nas possible with available data using mobile agents. This framework was mainly\ndesigned to provide security for the network using mobile agent mechanisms to\nadd mobility features to monitor the user processes from different\ncomputational systems. The experimental results have shown that the system can\ndetect anomalous user activity effectively.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2010 09:39:51 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Jaisankar", "N.", ""], ["Saravanan", "R.", ""], ["Swamy", "K. Durai", ""]]}, {"id": "1004.0769", "submitter": "Secretary Aircc Journal", "authors": "Yasir Arfat Malkani and Lachhman Das Dhomeja (University of Sussex,\n  Brighton, UK)", "title": "PSIM: A tool for analysis of device pairing methods", "comments": "12Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.3\n  (2009) 39-50", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Wireless networks are a common place nowadays and almost all of the modern\ndevices support wireless communication in some form. These networks differ from\nmore traditional computing systems due to the ad-hoc and spontaneous nature of\ninteractions among devices. These systems are prone to security risks, such as\neavesdropping and require different techniques as compared to traditional\nsecurity mechanisms. Recently, secure device pairing in wireless environments\nhas got substantial attention from many researchers. As a result, a significant\nset of techniques and protocols have been proposed to deal with this issue.\nSome of these techniques consider devices equipped with infrared, laser,\nultrasound transceivers or 802.11 network interface cards; while others require\nembedded accelerometers, cameras and/or LEDs, displays, microphones and/or\nspeakers. However, many of the proposed techniques or protocols have not been\nimplemented at all; while others are implemented and evaluated in a stand-alone\nmanner without being compared with other related work [1]. We believe that it\nis because of the lack of specialized tools that provide a common platform to\ntest the pairing methods. As a consequence, we designed such a tool. In this\npaper, we are presenting design and development of the Pairing Simulator (PSim)\nthat can be used to perform the analysis of device pairing methods.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2010 04:05:44 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Malkani", "Yasir Arfat", "", "University of Sussex,\n  Brighton, UK"], ["Dhomeja", "Lachhman Das", "", "University of Sussex,\n  Brighton, UK"]]}, {"id": "1004.0770", "submitter": "Secretary Aircc Journal", "authors": "M Prabu Kumar and K Praneesh Kumar Yadav (VIT University, India)", "title": "Data security in mobile devices by geo locking", "comments": "10Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.3\n  (2009) 52-61", "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this paper we present a way of hiding the data in mobile devices from\nbeing compromised. We use two level data hiding technique, where in its first\nlevel data is encrypted and stored in special records and the second level\nbeing a typical password protection scheme. The second level is for secure\naccess of information from the device. In the first level, encryption of the\ndata is done using the location coordinates as key. Location Coordinates are\nrounded up figures of longitude and latitude information. In the second phase\nthe password entry differs from conventional schemes. Here we have used the\npatterns of traditional Rangoli for specifying the password and gaining access,\nthus minimising the chances of data leak in hostile situations. The proposed\nstructure would be a better trade off in comparison with the previous models\nwhich use Bio Metric authentication -- a relatively costly way of\nauthentication.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2010 04:15:13 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Kumar", "M Prabu", "", "VIT University, India"], ["Yadav", "K Praneesh Kumar", "", "VIT University, India"]]}, {"id": "1004.0771", "submitter": "Secretary Aircc Journal", "authors": "Moheb R Girgis, Tarek M Mahmoud, Youssef S Takroni and Hassan S Hassan\n  (Minia University, Egypt)", "title": "Performance evaluation of a new route optimization technique for mobile\n  IP", "comments": "11Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.3\n  (2009) 63-73", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Mobile ip (mip) is an internet protocol that allows mobile nodes to have\ncontinuous network connectivity to the internet without changing their ip\naddresses while moving to other networks. The packets sent from correspondent\nnode (cn) to a mobile node (mn) go first through the mobile node's home agent\n(ha), then the ha tunnels them to the mn's foreign network. One of the main\nproblems in the original mip is the triangle routing problem. Triangle routing\nproblem appears when the indirect path between cn and mn through the ha is\nlonger than the direct path. This paper proposes a new technique to improve the\nperformance of the original mip during the handoff. The proposed technique\nreduces the delay, the packet loss and the registration time for all the\npackets transferred between the cn and the mn. In this technique, tunneling\noccurs at two levels above the ha in a hierarchical network. To show the\neffectiveness of the proposed technique, it is compared with the original mip\nand another technique for solving the same problem in which tunneling occurs at\none level above the ha. Simulation results presented in this paper are based on\nthe ns2 mobility software on linux platform. The simulations results show that\nour proposed technique achieves better performance than the others, considering\nthe packet delay, the packet losses during handoffs and the registration time,\nin different scenarios for the location of the mn with respect to the ha and\nfas.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2010 04:37:34 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Girgis", "Moheb R", "", "Minia University, Egypt"], ["Mahmoud", "Tarek M", "", "Minia University, Egypt"], ["Takroni", "Youssef S", "", "Minia University, Egypt"], ["Hassan", "Hassan S", "", "Minia University, Egypt"]]}, {"id": "1004.0772", "submitter": "Secretary Aircc Journal", "authors": "Jean-Francois Lalande, David Rodriguez and Christian Toinard (Ensi de\n  Bourges, France)", "title": "Security properties in an open peer-to-peer network", "comments": "17Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.3\n  (2009) 73-89", "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper proposes to address new requirements of confidentiality, integrity\nand availability properties fitting to peer-to-peer domains of resources. The\nenforcement of security properties in an open peer-topeer network remains an\nopen problem as the literature have mainly proposed contribution on\navailability of resources and anonymity of users. That paper proposes a novel\narchitecture that eases the administration of a peer-to-peer network. It\nconsiders a network of safe peer-to-peer clients in the sense that it is a\ncommune client software that is shared by all the participants to cope with the\nsharing of various resources associated with different security requirements.\nHowever, our proposal deals with possible malicious peers that attempt to\ncompromise the requested security properties. Despite the safety of an open\npeer-to-peer network cannot be formally guaranteed, since a end user has\nprivileges on the target host, our solution provides several advanced security\nenforcement. First, it enables to formally define the requested security\nproperties of the various shared resources. Second, it evaluates the trust and\nthe reputation of the requesting peer by sending challenges that test the\nfairness of its peer-to-peer security policy. Moreover, it proposes an advanced\nMandatory Access Control that enforces the required peer-to-peer security\nproperties through an automatic projection of the requested properties onto\nSELinux policies. Thus, the SELinux system of the requesting peer is\nautomatically configured with respect to the required peer-to-peer security\nproperties.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2010 04:49:49 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Lalande", "Jean-Francois", "", "Ensi de\n  Bourges, France"], ["Rodriguez", "David", "", "Ensi de\n  Bourges, France"], ["Toinard", "Christian", "", "Ensi de\n  Bourges, France"]]}, {"id": "1004.0774", "submitter": "Secretary Aircc Journal", "authors": "Johnneth Fonseca, Zair Abdelouahab, Denivaldo Lopes and Sofiane Labidi", "title": "A security framework for SOA applications in mobile environment", "comments": "18Pages", "journal-ref": "International Journal of Network Security & Its Applications 1.3\n  (2009) 90-107", "doi": null, "report-no": null, "categories": "cs.SE cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  A Rapid evolution of mobile technologies has led to the development of more\nsophisticated mobile devices with better storage, processing and transmission\npower. These factors enable support to many types of application but also give\nrise to a necessity to find a model of service development. Actually, SOA\n(Service Oriented Architecture) is a good option to support application\ndevelopment. This paper presents a framework that allows the development of SOA\nbased application in mobile environment. The objective of the framework is to\ngive developers with tools for provision of services in this environment with\nthe necessary security characteristics.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2010 05:32:22 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Fonseca", "Johnneth", ""], ["Abdelouahab", "Zair", ""], ["Lopes", "Denivaldo", ""], ["Labidi", "Sofiane", ""]]}, {"id": "1004.0777", "submitter": "arXiv Admin", "authors": "Kamaljit Lakhtaria (1), Bhaskar N. Patel (2), Satish G. Prajapati (2),\n  N. N. Jani (3),((1) Rajkot Gujarat, India,(2) Ganpat Vidyanagar, Kherava,\n  Gujarat, India,(3) Kadi Vishvadiva Vidyalaya (Deemed University), S K Patel\n  Gandhinagar, India)", "title": "Securing AODV for MANETs using Message Digest with Secret Key", "comments": "This article has been withdrawn by arXiv admins because it contains\n  plagiarized content from International Conference on Computer Networks and\n  Security (ICCNS 2008, September 27-28, 2008): \"Securing AODV for MANETs using\n  Message Digest with Secret Key\", by Sunil J. Soni and Prashant B. Swadas", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This article has been withdrawn by arXiv admins because it contains\nplagiarized content from International Conference on Computer Networks and\nSecurity (ICCNS 2008, September 27-28, 2008): \"Securing AODV for MANETs using\nMessage Digest with Secret Key\", by Sunil J. Soni and Prashant B. Swadas.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2010 05:49:56 GMT"}, {"version": "v2", "created": "Mon, 4 Jun 2012 15:14:26 GMT"}], "update_date": "2012-06-05", "authors_parsed": [["Lakhtaria", "Kamaljit", ""], ["Patel", "Bhaskar N.", ""], ["Prajapati", "Satish G.", ""], ["Jani", "N. N.", ""]]}, {"id": "1004.0785", "submitter": "Mohammadreza Ghanavati", "authors": "Soroush Akhlaghi, Abbas Kiani and Mohammad Reza Ghanavati", "title": "Cost-Bandwidth Tradeoff In Distributed Storage Systems", "comments": "8 pages,8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed storage systems are mainly justified due to the limited amount of\nstorage capacity and improving the reliability through distributing data over\nmultiple storage nodes. On the other hand, it may happen the data is stored in\nunreliable nodes, while it is desired the end user to have a reliable access to\nthe stored data. So, in an event that a node is damaged, to prevent the system\nreliability to regress, it is necessary to regenerate a new node with the same\namount of stored data as the damaged node to retain the number of storage\nnodes, thereby having the previous reliability. This requires the new node to\nconnect to some of existing nodes and downloads the required information,\nthereby occupying some bandwidth, called the repair bandwidth. On the other\nhand, it is more likely the cost of downloading varies across different nodes.\nThis paper aims at investigating the theoretical cost-bandwidth tradeoff, and\nmore importantly, it is demonstrated that any point on this curve can be\nachieved through the use of the so called generalized regenerating codes which\nis an enhancement of the regeneration codes introduced by Dimakis et al. in\n[1].\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2010 07:11:31 GMT"}, {"version": "v2", "created": "Wed, 14 Apr 2010 11:12:32 GMT"}], "update_date": "2010-04-15", "authors_parsed": [["Akhlaghi", "Soroush", ""], ["Kiani", "Abbas", ""], ["Ghanavati", "Mohammad Reza", ""]]}, {"id": "1004.0930", "submitter": "Arnaud Legout", "authors": "Stevens Le Blond (INRIA Sophia Antipolis / INRIA Rh\\^one-Alpes),\n  Arnaud Legout (INRIA Sophia Antipolis / INRIA Rh\\^one-Alpes), Fabrice Le\n  Fessant (INRIA Saclay - Ile de France), Walid Dabbous (INRIA Sophia Antipolis\n  / INRIA Rh\\^one-Alpes), Mohamed Ali Kaafar (INRIA Sophia Antipolis / INRIA\n  Rh\\^one-Alpes)", "title": "Spying the World from your Laptop -- Identifying and Profiling Content\n  Providers and Big Downloaders in BitTorrent", "comments": null, "journal-ref": "3rd USENIX Workshop on Large-Scale Exploits and Emergent Threats\n  (LEET'10), San Jose, CA : United States (2010)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a set of exploits an adversary can use to continuously\nspy on most BitTorrent users of the Internet from a single machine and for a\nlong period of time. Using these exploits for a period of 103 days, we\ncollected 148 million IPs downloading 2 billion copies of contents. We identify\nthe IP address of the content providers for 70% of the BitTorrent contents we\nspied on. We show that a few content providers inject most contents into\nBitTorrent and that those content providers are located in foreign data\ncenters. We also show that an adversary can compromise the privacy of any peer\nin BitTorrent and identify the big downloaders that we define as the peers who\nsubscribe to a large number of contents. This infringement on users' privacy\nposes a significant impediment to the legal adoption of BitTorrent.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2010 19:01:58 GMT"}], "update_date": "2010-04-08", "authors_parsed": [["Blond", "Stevens Le", "", "INRIA Sophia Antipolis / INRIA Rhône-Alpes"], ["Legout", "Arnaud", "", "INRIA Sophia Antipolis / INRIA Rhône-Alpes"], ["Fessant", "Fabrice Le", "", "INRIA Saclay - Ile de France"], ["Dabbous", "Walid", "", "INRIA Sophia Antipolis\n  / INRIA Rhône-Alpes"], ["Kaafar", "Mohamed Ali", "", "INRIA Sophia Antipolis / INRIA\n  Rhône-Alpes"]]}, {"id": "1004.1042", "submitter": "Peter Van de Ven", "authors": "P.M. van de Ven, J.S.H. van Leeuwaarden, D. Denteneer, A.J.E.M.\n  Janssen", "title": "Spatial fairness in linear wireless multi-access networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-access networks may exhibit severe unfairness in throughput. Recent\nstudies show that this unfairness is due to local differences in the\nneighborhood structure: Nodes with less neighbors receive better access. We\nstudy the unfairness in saturated linear networks, and adapt the multi-access\nCSMA protocol to remove the unfairness completely, by choosing the activation\nrates of nodes appropriately as a function of the number of neighbors. We then\ninvestigate the consequences of this choice of activation rates on the\nnetwork-average saturated throughput, and we show that these rates perform well\nin a non-saturated setting.\n", "versions": [{"version": "v1", "created": "Wed, 7 Apr 2010 10:04:02 GMT"}], "update_date": "2010-04-08", "authors_parsed": [["van de Ven", "P. M.", ""], ["van Leeuwaarden", "J. S. H.", ""], ["Denteneer", "D.", ""], ["Janssen", "A. J. E. M.", ""]]}, {"id": "1004.1058", "submitter": "Peter Van de Ven", "authors": "P.M. van de Ven, A.J.E.M. Janssen, J.S.H. van Leeuwaarden", "title": "Optimal Tradeoff Between Exposed and Hidden Nodes in Large Wireless\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless networks equipped with the CSMA protocol are subject to collisions\ndue to interference. For a given interference range we investigate the tradeoff\nbetween collisions (hidden nodes) and unused capacity (exposed nodes). We show\nthat the sensing range that maximizes throughput critically depends on the\nactivation rate of nodes. For infinite line networks, we prove the existence of\na threshold: When the activation rate is below this threshold the optimal\nsensing range is small (to maximize spatial reuse). When the activation rate is\nabove the threshold the optimal sensing range is just large enough to preclude\nall collisions. Simulations suggest that this threshold policy extends to more\ncomplex linear and non-linear topologies.\n", "versions": [{"version": "v1", "created": "Wed, 7 Apr 2010 11:41:52 GMT"}], "update_date": "2010-04-08", "authors_parsed": [["van de Ven", "P. M.", ""], ["Janssen", "A. J. E. M.", ""], ["van Leeuwaarden", "J. S. H.", ""]]}, {"id": "1004.1236", "submitter": "Seyed M. Sadegh Tabatabaei Yazdi", "authors": "Ali Kakhbod and S. M. Sadegh Tabatabaei Yazdi", "title": "On Describing the Routing Capacity Regions of Networks", "comments": null, "journal-ref": "Mathematical Methods of Operations Research (MMOR), vol 72, no. 1,\n  pp. 95-106, 2010", "doi": null, "report-no": null, "categories": "math.OC cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The routing capacity region of networks with multiple unicast sessions can be\ncharacterized using Farkas' lemma as an infinite set of linear inequalities. In\nthis paper this result is sharpened by exploiting properties of the solution\nsatisfied by each rate-tuple on the boundary of the capacity region, and a\nfinite description of the routing capacity region which depends on network\nparameters is offered. For the special case of undirected ring networks\nadditional results on the complexity of the description are provided.\n", "versions": [{"version": "v1", "created": "Thu, 8 Apr 2010 03:43:15 GMT"}, {"version": "v2", "created": "Fri, 10 Feb 2012 05:29:44 GMT"}], "update_date": "2012-02-13", "authors_parsed": [["Kakhbod", "Ali", ""], ["Yazdi", "S. M. Sadegh Tabatabaei", ""]]}, {"id": "1004.1267", "submitter": "Arnaud Legout", "authors": "Stevens Le Blond, Pere Manils, Abdelberi Chaabane, Mohamed Ali Kaafar,\n  Arnaud Legout, Claude Castellucia, Walid Dabbous (INRIA Sophia Antipolis /\n  INRIA Rh\\^one-Alpes)", "title": "De-anonymizing BitTorrent Users on Tor", "comments": "Poster accepted at the 7th USENIX Symposium on Network Design and\n  Implementation (NSDI '10), San Jose, CA : United States (2010)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Some BitTorrent users are running BitTorrent on top of Tor to preserve their\nprivacy. In this extended abstract, we discuss three different attacks to\nreveal the IP address of BitTorrent users on top of Tor. In addition, we\nexploit the multiplexing of streams from different applications into the same\ncircuit to link non-BitTorrent applications to revealed IP addresses.\n", "versions": [{"version": "v1", "created": "Thu, 8 Apr 2010 07:23:04 GMT"}], "update_date": "2010-04-09", "authors_parsed": [["Blond", "Stevens Le", "", "INRIA Sophia Antipolis /\n  INRIA Rhône-Alpes"], ["Manils", "Pere", "", "INRIA Sophia Antipolis /\n  INRIA Rhône-Alpes"], ["Chaabane", "Abdelberi", "", "INRIA Sophia Antipolis /\n  INRIA Rhône-Alpes"], ["Kaafar", "Mohamed Ali", "", "INRIA Sophia Antipolis /\n  INRIA Rhône-Alpes"], ["Legout", "Arnaud", "", "INRIA Sophia Antipolis /\n  INRIA Rhône-Alpes"], ["Castellucia", "Claude", "", "INRIA Sophia Antipolis /\n  INRIA Rhône-Alpes"], ["Dabbous", "Walid", "", "INRIA Sophia Antipolis /\n  INRIA Rhône-Alpes"]]}, {"id": "1004.1461", "submitter": "Mohamed Ali Kaafar", "authors": "Pere Manils, Chaabane Abdelberri, Stevens Le Blond, Mohamed Ali\n  Kaafar, Claude Castelluccia, Arnaud Legout, Walid Dabbous (All - INRIA Sophia\n  Antipolis / INRIA Rh\\^one-Alpes)", "title": "Compromising Tor Anonymity Exploiting P2P Information Leakage", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Privacy of users in P2P networks goes far beyond their current usage and is a\nfundamental requirement to the adoption of P2P protocols for legal usage. In a\nclimate of cold war between these users and anti-piracy groups, more and more\nusers are moving to anonymizing networks in an attempt to hide their identity.\nHowever, when not designed to protect users information, a P2P protocol would\nleak information that may compromise the identity of its users. In this paper,\nwe first present three attacks targeting BitTorrent users on top of Tor that\nreveal their real IP addresses. In a second step, we analyze the Tor usage by\nBitTorrent users and compare it to its usage outside of Tor. Finally, we depict\nthe risks induced by this de-anonymization and show that users' privacy\nviolation goes beyond BitTorrent traffic and contaminates other protocols such\nas HTTP.\n", "versions": [{"version": "v1", "created": "Fri, 9 Apr 2010 06:08:08 GMT"}], "update_date": "2010-04-12", "authors_parsed": [["Manils", "Pere", "", "All - INRIA Sophia\n  Antipolis / INRIA Rhône-Alpes"], ["Abdelberri", "Chaabane", "", "All - INRIA Sophia\n  Antipolis / INRIA Rhône-Alpes"], ["Blond", "Stevens Le", "", "All - INRIA Sophia\n  Antipolis / INRIA Rhône-Alpes"], ["Kaafar", "Mohamed Ali", "", "All - INRIA Sophia\n  Antipolis / INRIA Rhône-Alpes"], ["Castelluccia", "Claude", "", "All - INRIA Sophia\n  Antipolis / INRIA Rhône-Alpes"], ["Legout", "Arnaud", "", "All - INRIA Sophia\n  Antipolis / INRIA Rhône-Alpes"], ["Dabbous", "Walid", "", "All - INRIA Sophia\n  Antipolis / INRIA Rhône-Alpes"]]}, {"id": "1004.1674", "submitter": "Rdv Ijcsis", "authors": "Adiline Macriga. T, Dr. P. Anandha Kumar", "title": "Seamless Data Services for Real Time Communication in a Heterogeneous\n  Networks using Network Tracking and Management", "comments": "IEEE Publication format, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "IJCSIS, Vol. 7 No. 3, March 2010, 84-91", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Heterogeneous Networks is the integration of all existing networks under a\nsingle environment with an understanding between the functional operations and\nalso includes the ability to make use of multiple broadband transport\ntechnologies and to support generalized mobility. It is a challenging feature\nfor Heterogeneous networks to integrate several IP-based access technologies in\na seamless way. The focus of this paper is on the requirements of a mobility\nmanagement scheme for multimedia real-time communication services - Mobile\nVideo Conferencing. Nowadays, the range of available wireless access network\ntechnologies includes cellular or wide-area wireless systems, such as cellular\nnetworks (GSM/GPRS/UMTS) or Wi-Max, local area Network or personal area\nwireless systems, comprising for example, WLAN (802.11 a/b/g) and Bluetooth. As\nthe mobile video conferencing is considered, the more advanced mobile terminals\nare capable of having more than one interface active at the same time. In\naddition, the heterogeneity of access technologies and also the seamless flow\nof information will increase in the future, making the seamless integration of\nthe access network a key challenge for mobility management in a heterogeneous\nnetwork environment. Services must be provided to the user regardless of the\nparticular access technology and also the type of service provider or the\nnetwork used.\n", "versions": [{"version": "v1", "created": "Sat, 10 Apr 2010 03:29:07 GMT"}], "update_date": "2010-04-13", "authors_parsed": [["T", "Adiline Macriga.", ""], ["Kumar", "Dr. P. Anandha", ""]]}, {"id": "1004.1678", "submitter": "Rdv Ijcsis", "authors": "Arabinda Nanda, Amiya Kumar Rath, Saroj Kumar Rout", "title": "Node Sensing & Dynamic Discovering Routes for Wireless Sensor Networks", "comments": "IEEE Publication format, International Journal of Computer Science\n  and Information Security, IJCSIS, Vol. 7 No. 3, March 2010, USA. ISSN 1947\n  5500, http://sites.google.com/site/ijcsis/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The applications of Wireless Sensor Networks (WSN) contain a wide variety of\nscenarios. In most of them, the network is composed of a significant number of\nnodes deployed in an extensive area in which not all nodes are directly\nconnected. Then, the data exchange is supported by multihop communications.\nRouting protocols are in charge of discovering and maintaining the routes in\nthe network. However, the correctness of a particular routing protocol mainly\ndepends on the capabilities of the nodes and on the application requirements.\nThis paper presents a dynamic discover routing method for communication between\nsensor nodes and a base station in WSN. This method tolerates failures of\narbitrary individual nodes in the network (node failure) or a small part of the\nnetwork (area failure). Each node in the network does only local routing\npreservation, needs to record only its neighbor nodes' information, and incurs\nno extra routing overhead during failure free periods. It dynamically discovers\nnew routes when an intermediate node or a small part of the network in the path\nfrom a sensor node to a base station fails. In our planned method, every node\ndecides its path based only on local information, such as its parent node and\nneighbor nodes' routing information. So, it is possible to form a loop in the\nrouting path. We believe that the loop problem in sensor network routing is not\nas serious as that in the Internet routing or traditional mobile ad-hoc\nrouting. We are trying to find all possible loops and eliminate the loops as\nfar as possible in WSN.\n", "versions": [{"version": "v1", "created": "Sat, 10 Apr 2010 03:57:58 GMT"}], "update_date": "2010-04-13", "authors_parsed": [["Nanda", "Arabinda", ""], ["Rath", "Amiya Kumar", ""], ["Rout", "Saroj Kumar", ""]]}, {"id": "1004.1683", "submitter": "Rdv Ijcsis", "authors": "Sudhakar Sengan, S.Chenthur Pandian", "title": "Enhanced Authentication and Locality Aided - Destination Mobility in\n  Dynamic Routing Protocol for MANET", "comments": "IEEE Publication format, International Journal of Computer Science\n  and Information Security, IJCSIS, Vol. 7 No. 3, March 2010, USA. ISSN 1947\n  5500, http://sites.google.com/site/ijcsis/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In our proposed model, the route selection is a function of following\nparameters: hop count, trust level of node and security level of application.\nIn this paper, to focus on secure neighbor detection, trust factor evaluation,\noperational mode, route discovery and route selection. The paper mainly address\nthe security of geographic routing. The watchdog identifies misbehaving nodes,\nwhile the Pathselector avoids routing packets through these nodes. The\nwatchdog, the pathselector is run by each server. In order to keep the source\ninformed about the destination's mobility, the destination keeps sending the\nalert message to its previous hop telling that it has changed its position and\nany reference to it for data packet forwarding be informed to the VHR server.\n", "versions": [{"version": "v1", "created": "Sat, 10 Apr 2010 04:49:44 GMT"}], "update_date": "2010-04-13", "authors_parsed": [["Sengan", "Sudhakar", ""], ["Pandian", "S. Chenthur", ""]]}, {"id": "1004.1706", "submitter": "Rdv Ijcsis", "authors": "Sujata V. Mallapur, Sujata Terdal", "title": "Enhanced Ad-Hoc on Demand Multipath Distance Vector Routing protocol", "comments": "IEEE Publication format, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "IJCSIS, Vol. 7 No. 3, March 2010, 166-170", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Due to mobility in Ad-Hoc network the topology of the network may change\nrandomly, rapidly and unexpectedly, because of these aspects, the routes in the\nnetwork often disappear and new to arise. To avoid frequent route discovery and\nroute failure EAOMDV was proposed based on existing routing protocol AOMDV. The\nEAOMDV (Enhanced Ad-Hoc on Demand Multipath Distance Vector) Routing protocol\nwas proposed to solve the \"route failure\" problem in AOMDV. EAOMDV protocol\nreduces the route failure problem by preemptively predicting the link failure\nby the signal power received by the receiver (pr). This proposed protocol\ncontrols overhead, increases throughput and reduces the delay. The EAOMDV\nprotocol was implemented on NS-2 and evaluation results show that the EAOMDV\noutperformed AOMDV.\n", "versions": [{"version": "v1", "created": "Sat, 10 Apr 2010 10:53:32 GMT"}], "update_date": "2010-04-13", "authors_parsed": [["Mallapur", "Sujata V.", ""], ["Terdal", "Sujata", ""]]}, {"id": "1004.1729", "submitter": "Maciej Kurant", "authors": "Maciej Kurant, Athina Markopoulou, Patrick Thiran", "title": "On the bias of BFS", "comments": "9 pages", "journal-ref": "International Teletraffic Congress (ITC 22), 2010", "doi": null, "report-no": null, "categories": "cs.DM cs.DS cs.NI cs.SI stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Breadth First Search (BFS) and other graph traversal techniques are widely\nused for measuring large unknown graphs, such as online social networks. It has\nbeen empirically observed that an incomplete BFS is biased toward high degree\nnodes. In contrast to more studied sampling techniques, such as random walks,\nthe precise bias of BFS has not been characterized to date. In this paper, we\nquantify the degree bias of BFS sampling. In particular, we calculate the node\ndegree distribution expected to be observed by BFS as a function of the\nfraction of covered nodes, in a random graph $RG(p_k)$ with a given degree\ndistribution $p_k$. Furthermore, we also show that, for $RG(p_k)$, all commonly\nused graph traversal techniques (BFS, DFS, Forest Fire, and Snowball Sampling)\nlead to the same bias, and we show how to correct for this bias. To give a\nbroader perspective, we compare this class of exploration techniques to random\nwalks that are well-studied and easier to analyze. Next, we study by simulation\nthe effect of graph properties not captured directly by our model. We find that\nthe bias gets amplified in graphs with strong positive assortativity. Finally,\nwe demonstrate the above results by sampling the Facebook social network, and\nwe provide some practical guidelines for graph sampling in practice.\n", "versions": [{"version": "v1", "created": "Sat, 10 Apr 2010 17:36:43 GMT"}], "update_date": "2011-02-23", "authors_parsed": [["Kurant", "Maciej", ""], ["Markopoulou", "Athina", ""], ["Thiran", "Patrick", ""]]}, {"id": "1004.1744", "submitter": "Rdv Ijcsis", "authors": "A. Kumar, P. Chakrabarti, P. Saini", "title": "Node inspection and analysis thereof in the light of area estimation and\n  curve fitting", "comments": "IEEE Publication format, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "IJCSIS, Vol. 7 No. 3, March 2010, 191-197", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this paper, we have given an idea of area specification and its\ncorresponding sensing of nodes in a dynamic network. We have applied the\nconcept of Monte Carlo methods in this respect. We have cited certain\nstatistical as well as artificial intelligence based techniques for realizing\nthe position of a node. We have also applied curve fitting concept for node\ndetection and relative verification.\n", "versions": [{"version": "v1", "created": "Sat, 10 Apr 2010 22:05:22 GMT"}], "update_date": "2010-04-19", "authors_parsed": [["Kumar", "A.", ""], ["Chakrabarti", "P.", ""], ["Saini", "P.", ""]]}, {"id": "1004.1757", "submitter": "Rdv Ijcsis", "authors": "N. Saravana Selvam, S. Radhakrishnan", "title": "Processor Based Active Queue Management for providing QoS in Multimedia\n  Application", "comments": "IEEE Publication format, International Journal of Computer Science\n  and Information Security, IJCSIS, Vol. 7 No. 3, March 2010, USA. ISSN 1947\n  5500, http://sites.google.com/site/ijcsis/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The objective of this paper is to implement the Active Network based Active\nQueue Management Technique for providing Quality of Service (QoS) using Network\nProcessor(NP) based router to enhance multimedia applications. The performance\nis evaluated using Intel IXP2400 NP Simulator. The results demonstrate that,\nActive Network based Active Queue Management has better performance than RED\nalgorithm in case of congestion and is well suited to achieve high speed packet\nclassification to support multimedia applications with minimum delay and Queue\nloss. Using simulation, we show that the proposed system can provide assurance\nfor prioritized flows with improved network utilization where bandwidth is\nshared among the flows according to the levels of priority. We first analyze\nthe feasibility and optimality of the load distribution schemes and then\npresent separate solutions for non-delay sensitive streams and delay-sensitive\nstreams. Rigorous simulations and experiments have been carried out to evaluate\nthe performance.\n", "versions": [{"version": "v1", "created": "Sun, 11 Apr 2010 03:44:30 GMT"}], "update_date": "2010-04-13", "authors_parsed": [["Selvam", "N. Saravana", ""], ["Radhakrishnan", "S.", ""]]}, {"id": "1004.1774", "submitter": "Rdv Ijcsis", "authors": "K.Valarmathi, N. Malmurugan", "title": "Joint Design of Congestion Control Routing With Distributed Multi\n  Channel Assignment in Wireless Mesh Networks", "comments": "IEEE Publication format, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "IJCSIS, Vol. 7 No. 3, March 2010, 261-266", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In Wireless Mesh Networks (WMN), a channel assignment has to balance the\nobjectives of maintaining connectivity and increasing the aggregate bandwidth.\nThe main aim of the channel assignment algorithm is to assign the channels to\nthe network interfaces, from the given expected load on each virtual link. From\nthe existing work done so far, we can examine that there is no combined\nsolution of multi-channel assignment with routing and congestion control. In\nthis paper, we propose a congestion control routing protocol along with\nmulti-channel assignment. We use a traffic aware metric in this protocol in\norder to provide quality of service. The proposed protocol can improve the\nthroughput and channel utilization to very high extent because it provides\nsolution for multi-channel assignment and congestion control. The proposed\nalgorithm assigns the channels in a way that, congestion is avoided and\nco-channel interference levels among links with same channel are reduced. By\nour simulation results in NS2, we show that the proposed protocol attains high\nthroughput and channel utilization along with reduced latency.\n", "versions": [{"version": "v1", "created": "Sun, 11 Apr 2010 08:23:46 GMT"}], "update_date": "2010-04-13", "authors_parsed": [["Valarmathi", "K.", ""], ["Malmurugan", "N.", ""]]}, {"id": "1004.1788", "submitter": "Rdv Ijcsis", "authors": "Nafiz Imtiaz Bin Hamid, Md. Zakir Hossain, Md. R. H. Khandokar, Taskin\n  Jamal, Md.A. Shoeb", "title": "Mobile Broadband Possibilities considering the Arrival of IEEE 802.16m &\n  LTE with an Emphasis on South Asia", "comments": "IEEE Publication format, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "IJCSIS, Vol. 7 No. 3, March 2010, 267-275", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper intends to look deeper into finding an ideal mobile broadband\nsolution. Special stress has been put in the South Asian region through some\ncomparative analysis. Proving their competency in numerous aspects, WiMAX and\nLTE already have already made a strong position in telecommunication industry.\nBoth WiMAX and LTE are 4G technologies designed to move data rather than voice\nhaving IP networks based on OFDM technology. So, they aren't like typical\ntechnological rivals as of GSM and CDMA. But still a gesture of hostility seems\nto outburst long before the stable commercial launch of LTE. In this paper\nvarious aspects of WiMAX and LTE for deployment have been analyzed. Again, we\ntried to make every possible consideration with respect to south Asia i.e. how\nmass people of this region may be benefited. As a result, it might be regarded\nas a good source in case of making major BWA deployment decisions in this\nregion. Besides these, it also opens the path for further research and in depth\nthinking in this issue.\n", "versions": [{"version": "v1", "created": "Sun, 11 Apr 2010 10:59:44 GMT"}], "update_date": "2010-04-13", "authors_parsed": [["Hamid", "Nafiz Imtiaz Bin", ""], ["Hossain", "Md. Zakir", ""], ["Khandokar", "Md. R. H.", ""], ["Jamal", "Taskin", ""], ["Shoeb", "Md. A.", ""]]}, {"id": "1004.1842", "submitter": "Pengkai Zhao", "authors": "Pengkai Zhao, Babak Daneshrad (Electrical Engineering Department,\n  University of California, Los Angeles, USA)", "title": "Throughput Enhancement Using Multiple Antennas in OFDM-based Ad Hoc\n  Networks under Transceiver Impairments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Transceiver impairments, including phase noise, residual frequency offset,\nand imperfect channel estimation, significantly affect the performance of\nMultiple-Input Multiple-Output (MIMO) system. However, these impairments are\nnot well addressed when analyzing the throughput performance of MIMO Ad Hoc\nnetworks. In this paper, we present an analytical framework to evaluate the\nthroughput of MIMO OFDM system under the impairments of phase noise, residual\nfrequency offset, and imperfect channel estimation. Using this framework, we\nevaluate the Maximum Sum Throughput (MST) in Ad Hoc networks by optimizing the\npower and modulation schemes of each user. Simulations are conducted to\ndemonstrate not only the improvement in the MST from using multiple antennas,\nbut also the loss in the MST due to the transceiver impairments. The proposed\nanalytical framework is further applied for the distributed implementation of\nMST in Ad Hoc networks, where the loss caused by impairments is also evaluated.\n", "versions": [{"version": "v1", "created": "Sun, 11 Apr 2010 20:56:28 GMT"}], "update_date": "2010-04-13", "authors_parsed": [["Zhao", "Pengkai", "", "Electrical Engineering Department,\n  University of California, Los Angeles, USA"], ["Daneshrad", "Babak", "", "Electrical Engineering Department,\n  University of California, Los Angeles, USA"]]}, {"id": "1004.1995", "submitter": "Devavrat Shah", "authors": "Devavrat Shah, Damon Wischik", "title": "Switched networks with maximum weight policies: Fluid approximation and\n  multiplicative state space collapse", "comments": "Published in at http://dx.doi.org/10.1214/11-AAP759 the Annals of\n  Applied Probability (http://www.imstat.org/aap/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Probability 2012, Vol. 22, No. 1, 70-127", "doi": "10.1214/11-AAP759", "report-no": "IMS-AAP-AAP759", "categories": "math.PR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a queueing network in which there are constraints on which queues\nmay be served simultaneously; such networks may be used to model input-queued\nswitches and wireless networks. The scheduling policy for such a network\nspecifies which queues to serve at any point in time. We consider a family of\nscheduling policies, related to the maximum-weight policy of Tassiulas and\nEphremides [IEEE Trans. Automat. Control 37 (1992) 1936--1948], for single-hop\nand multihop networks. We specify a fluid model and show that fluid-scaled\nperformance processes can be approximated by fluid model solutions. We study\nthe behavior of fluid model solutions under critical load, and characterize\ninvariant states as those states which solve a certain network-wide\noptimization problem. We use fluid model results to prove multiplicative state\nspace collapse. A notable feature of our results is that they do not assume\ncomplete resource pooling.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2010 15:57:58 GMT"}, {"version": "v2", "created": "Thu, 14 Oct 2010 04:03:28 GMT"}, {"version": "v3", "created": "Tue, 6 Mar 2012 09:54:52 GMT"}], "update_date": "2012-03-07", "authors_parsed": [["Shah", "Devavrat", ""], ["Wischik", "Damon", ""]]}, {"id": "1004.2322", "submitter": "Feng Xia", "authors": "Guowei Wu, Chi Lin, Feng Xia, Lin Yao, He Zhang, Bing Liu", "title": "Dynamical Jumping Real-Time Fault-Tolerant Routing Protocol for Wireless\n  Sensor Networks", "comments": "22 pages, 9 figures", "journal-ref": "Sensors, 10(3):2416-2437, 2010", "doi": "10.3390/s100302416", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In time-critical wireless sensor network (WSN) applications, a high degree of\nreliability is commonly required. A dynamical jumping real-time fault-tolerant\nrouting protocol (DMRF) is proposed in this paper. Each node utilizes the\nremaining transmission time of the data packets and the state of the forwarding\ncandidate node set to dynamically choose the next hop. Once node failure,\nnetwork congestion or void region occurs, the transmission mode will switch to\njumping transmission mode, which can reduce the transmission time delay,\nguaranteeing the data packets to be sent to the destination node within the\nspecified time limit. By using feedback mechanism, each node dynamically\nadjusts the jumping probabilities to increase the ratio of successful\ntransmission. Simulation results show that DMRF can not only efficiently reduce\nthe effects of failure nodes, congestion and void region, but also yield higher\nratio of successful transmission, smaller transmission delay and reduced number\nof control packets.\n", "versions": [{"version": "v1", "created": "Wed, 14 Apr 2010 06:35:04 GMT"}], "update_date": "2010-04-15", "authors_parsed": [["Wu", "Guowei", ""], ["Lin", "Chi", ""], ["Xia", "Feng", ""], ["Yao", "Lin", ""], ["Zhang", "He", ""], ["Liu", "Bing", ""]]}, {"id": "1004.2993", "submitter": "Saumay Pushp", "authors": "Saumay Pushp, Priya Ranjan", "title": "Hybrid CDN structure with a P2P based streaming protocol", "comments": "9 Pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the last decade, internet has seen an exponential increase in its\ngrowth.With more and more people using it, efficient data delivery over the\ninternet has become a key issue. Peer-to-peer (P2P)/seed sharing based networks\nhave several desirable features for content distribution, such as low costs,\nscalability, and fault tolerance. While the invention of each of such\nspecialized systems has improved the user experience, some fundamental\nshortcomings of these systems have often been neglected. These shortcomings of\ncontent distribution systems have become severe bottlenecks in scalability of\nthe internet.In order to combine the desired features of classical Content\nDistribution Networks (CDNs) and P2P/seed sharing based networks, we propose a\nhybrid CDN structure with a P2P/seed sharing based streaming protocol in the\naccess network . In this work, we focus on the problem of data redundancy (at\neach node) and show how severely it impacts the network economics and the\nexperience of end-user and hence leads to low traffic load and redundancy\n", "versions": [{"version": "v1", "created": "Sun, 18 Apr 2010 03:34:47 GMT"}], "update_date": "2010-04-20", "authors_parsed": [["Pushp", "Saumay", ""], ["Ranjan", "Priya", ""]]}, {"id": "1004.3164", "submitter": "Moustafa Youssef", "authors": "Waleed Ammar, Ahmed ElDawy, Moustafa Youssef", "title": "Secure Localization in Wireless Sensor Networks: A Survey", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks (WSNs) have gained researchers' attention in the\nlast several years. Small sensors powered by miniaturized microprocessors are\ncapable of supporting several applications for civil and military domains.\nDetermining the location of sensors is a basic and essential knowledge for most\nWSN algorithms and protocols including data tagging, routing, node\nidentification, among others. This paper surveys the different algorithms that\nhave been proposed to securely determine the location of a sensor node. By\n\"secure\", we mean that adversaries cannot easily affect the accuracy of the\nlocalized sensors. In other words, the localization algorithm must be robust\nunder several attacks. We provide a taxonomy for classifying different secure\nlocalization schemes and describe possible attacks that can harm localization.\nIn addition, we survey different secure localization schemes and show how they\nmap to the proposed taxonomy. We also give a comparison between the different\nschemes, showing the attacks addressed by each.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2010 11:46:40 GMT"}], "update_date": "2015-03-14", "authors_parsed": [["Ammar", "Waleed", ""], ["ElDawy", "Ahmed", ""], ["Youssef", "Moustafa", ""]]}, {"id": "1004.3174", "submitter": "Moustafa Youssef", "authors": "Moustafa Youssef, Mohamed Amir Yosef, Mohamed El-Derini", "title": "GAC: Energy-Efficient Hybrid GPS-Accelerometer-Compass GSM Localization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adding location to the available information enables a new category of\napplications. With the constrained battery on cell phones, energy-efficient\nlocalization becomes an important challenge. In this paper we introduce a\nlow-energy calibration-free localization scheme based on the available internal\nsensors in many of today's phones. We start by energy profiling the different\nsensors that can be used for localization. Based on that, we propose GAC: a\nhybrid GPS/accelerometer/compass scheme that depends mainly on using the\nlow-energy accelerometer and compass sensors and uses the GPS infrequently for\nsynchronization. We implemented our system on Android-enabled cell phones and\nevaluated it in both highways and intra-city driving environments. Our results\nshow that the proposed hybrid scheme has an exponential saving in energy, with\na linear loss in accuracy compared to the GPS accuracy. We also evaluate the\neffect of the different parameters on the energy-accuracy tradeoff.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2010 12:30:36 GMT"}], "update_date": "2015-03-14", "authors_parsed": [["Youssef", "Moustafa", ""], ["Yosef", "Mohamed Amir", ""], ["El-Derini", "Mohamed", ""]]}, {"id": "1004.3178", "submitter": "Mohamed  Ibrahim", "authors": "Mohamed Ibrahim, Moustafa Youssef", "title": "CellSense: A Probabilistic RSSI-based GSM Positioning System", "comments": "6 pages, 6 figures, Submitted to Globe-com 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Context-aware applications have been gaining huge interest in the last few\nyears. With cell phones becoming ubiquitous computing devices, cell phone\nlocalization has become an important research problem. In this paper, we\npresent CellSense, a prob- abilistic RSSI-based fingerprinting location\ndetermina- tion system for GSM phones.We discuss the challenges of implementing\na probabilistic fingerprinting local- ization technique in GSM networks and\npresent the details of the CellSense system and how it addresses the\nchallenges. To evaluate our proposed system, we implemented CellSense on\nAndroid-based phones. Re- sults for two different testbeds, representing urban\nand rural environments, show that CellSense provides at least 23.8% enhancement\nin accuracy in rural areas and at least 86.4% in urban areas compared to other\nRSSI-based GSMlocalization systems. This comes with a minimal increase in\ncomputational requirements. We also evaluate the effect of changing the\ndifferent system parameters on the accuracy-complexity tradeoff.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2010 12:50:39 GMT"}], "update_date": "2010-04-20", "authors_parsed": [["Ibrahim", "Mohamed", ""], ["Youssef", "Moustafa", ""]]}, {"id": "1004.3256", "submitter": "Vishal Goyal", "authors": "Fatima-Zahra Belouadha, Hajar Omrana, Ounsa Roudies", "title": "A model-driven approach for composing SAWSDL semantic Web services", "comments": "International Journal of Computer Science Issues at\n  http://ijcsi.org/articles/A-model-driven-approach-for-composing-SAWSDL-semantic-Web-services.php", "journal-ref": "IJCSI, Volume 7, Issue 2, March 2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Composing Web services is a convenient means of dealing with complex\nrequests. However, the number of Web services on the Internet is increasing.\nThis explains the growing interest in composing Web services automatically.\nNevertheless, the Web services' semantics is necessary for any dynamic\ncomposition process. In this article, we present an MDA approach to develop and\ncompose SAWSDL semantic Web services. To model Web services, we use a UML\nprofile which is independent of the description standards. The SAWSDL interface\nfiles are generated by using transformation rules. To model the behavior of a\ncomposite Web service and generate its executable BPEL file, we use the BPMN\nnotation in a platform of modeling and implementing business process. The main\ncontribution of this work is the easy and extensible solution to a model-driven\ndevelopment of the semantic atomic and composite Web services.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2010 17:45:40 GMT"}], "update_date": "2010-04-20", "authors_parsed": [["Belouadha", "Fatima-Zahra", ""], ["Omrana", "Hajar", ""], ["Roudies", "Ounsa", ""]]}, {"id": "1004.3268", "submitter": "Vishal Goyal", "authors": "Amir Mollanejad, Leili Mohammad Khanli, Mohammad Zeynali", "title": "DBSR: Dynamic base station Repositioning using Genetic algorithm in\n  wireless sensor network", "comments": "International Journal of Computer Science Issues online at\n  http://ijcsi.org/articles/DBSR-Dynamic-base-station-Repositioning-using-Genetic-algorithm-in-wireless-sensor-network.php", "journal-ref": "IJCSI, Volume 7, Issue 2, March 2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks (WSNs) are commonly used in various ubiquitous and\npervasive applications. Due to limited power resources, the optimal dynamic\nbase station (BS) replacement could be Prolong the sensor network lifetime. In\nthis paper we'll present a dynamic optimum method for base station replacement\nso that can save energy in sensors and increases network lifetime. Because\npositioning problem is a NPhard problem [1], therefore we'll use genetic\nalgorithm to solve positioning problem. We've considered energy and distance\nparameters for finding BS optimized position. In our represented algorithm base\nstation position is fixed just during each round and its positioning is done at\nthe start of next round then it'll be placed in optimized position. Evaluating\nour proposed algorithm, we'll execute DBSR algorithm on LEACH & HEED Protocols.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2010 18:10:13 GMT"}], "update_date": "2010-04-20", "authors_parsed": [["Mollanejad", "Amir", ""], ["Khanli", "Leili Mohammad", ""], ["Zeynali", "Mohammad", ""]]}, {"id": "1004.3327", "submitter": "Ayon Chakraborty", "authors": "Ayon Chakraborty, Swarup Kumar Mitra, M.K. Naskar", "title": "An Efficient Hybrid Data Gathering Scheme in Wireless Sensor Networks", "comments": "This paper has been withdrawn by the author due to a crucial sign\n  error in equation 1", "journal-ref": "T. Janowski, H. Mohanty, and E. Estevez (Eds.): ICDCIT 2010, LNCS\n  5966, pp. 98-103, 2010. copyright Springer-Verlag Berlin Heidelberg 2010", "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn by the author due to a crucial sign error in\nequation 1\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2010 01:37:05 GMT"}, {"version": "v2", "created": "Sun, 26 Jun 2011 05:54:57 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Chakraborty", "Ayon", ""], ["Mitra", "Swarup Kumar", ""], ["Naskar", "M. K.", ""]]}, {"id": "1004.3407", "submitter": "Ayon Chakraborty", "authors": "Ayon Chakraborty, Kaushik Chakraborty, Swarup Kumar Mitra and M.K.\n  Naskar", "title": "An Optimized Lifetime Enhancement Scheme for Data Gathering in Wireless\n  Sensor Networks", "comments": "This paper has been withdrawn by the author due to a crucial sign\n  error in equation 1", "journal-ref": "Proceedings ICWCSN - 2009, 978-1-4244-5877-06/09, 41-46", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn by the author due to a crucial sign error in\nequation 1\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2010 11:02:53 GMT"}, {"version": "v2", "created": "Sun, 26 Jun 2011 05:54:44 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Chakraborty", "Ayon", ""], ["Chakraborty", "Kaushik", ""], ["Mitra", "Swarup Kumar", ""], ["Naskar", "M. K.", ""]]}, {"id": "1004.3408", "submitter": "Ayon Chakraborty", "authors": "Ayon Chakraborty, Kaushik Chakraborty, Swarup Kumar Mitra and M.K.\n  Naskar", "title": "An Energy Efficient Scheme for Data Gathering in Wireless Sensor\n  Networks Using Particle Swarm Optimization", "comments": "This paper has been withdrawn by the author due to a crucial sign\n  error in equation 1", "journal-ref": "Journal of Applied Computer Science, no. 6 (3) /2009, Suceava", "doi": null, "report-no": null, "categories": "cs.NI cs.DC cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn by the author due to a crucial sign error in\nequation 1\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2010 11:09:46 GMT"}, {"version": "v2", "created": "Sun, 26 Jun 2011 05:54:27 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Chakraborty", "Ayon", ""], ["Chakraborty", "Kaushik", ""], ["Mitra", "Swarup Kumar", ""], ["Naskar", "M. K.", ""]]}, {"id": "1004.3452", "submitter": "Mugurel Ionut Andreica", "authors": "Mugurel Ionut Andreica, Vasile Deac, Stelian Tipa", "title": "Towards Providing Low-Risk and Economically Feasible Network Data\n  Transfer Services", "comments": "Proceedings of the 9th WSEAS International Conference on Multimedia,\n  Internet & Video Technologies (MIV), Budapest, Hungary, 3-5 September, 2009.\n  (ISBN: 978-960-474-114-4 / ISSN: 1790-5109)", "journal-ref": "Recent Advances in Signals & Systems, pp. 204-209, 2009. (ISBN:\n  978-960-474-114-4 / ISSN: 1790-5109)", "doi": null, "report-no": null, "categories": "cs.NI cs.DC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the first part of this paper we present the first steps towards providing\nlow-risk and economically feasible network data transfer services. We introduce\nthree types of data transfer services and present general guidelines and\nalgorithms for managing service prices, risks and schedules. In the second part\nof the paper we solve two packet scheduling cost optimization problems and\npresent efficient algorithms for identifying maximum weight (k-level-)\ncaterpillar subtrees in tree networks.\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2010 13:58:06 GMT"}], "update_date": "2010-04-21", "authors_parsed": [["Andreica", "Mugurel Ionut", ""], ["Deac", "Vasile", ""], ["Tipa", "Stelian", ""]]}, {"id": "1004.3555", "submitter": "Vishal Goyal", "authors": "Sukhvinder S. Bamber, Ajay K. Sharma", "title": "Comparative Performance Investigations of different scenarios for\n  802.15.4 WPAN", "comments": "International Journal of Computer Science Issues online at\n  http://ijcsi.org/articles/Comparative-Performance-Investigations-of-different-scenarios-for-802-15-4-WPAN.php", "journal-ref": "IJCSI, Volume 7, Issue 2, March 2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the performance of WPAN based on various topological\nscenarios like: cluster, star and ring. The comparative results have been\nreported for the performance metrics like: Throughput, Traffic sent, Traffic\nreceived and Packets dropped. Cluster topology is best in comparison with star\nand ring topologies as it has been shown that the throughput in case of cluster\ntopology (79.887 kbits / sec) as compared to star (31.815 kbits / sec) and ring\n(1.179 kbits / sec).\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2010 20:10:49 GMT"}], "update_date": "2010-04-22", "authors_parsed": [["Bamber", "Sukhvinder S.", ""], ["Sharma", "Ajay K.", ""]]}, {"id": "1004.3563", "submitter": "Vishal Goyal", "authors": "Ramesh Babu H.S., Gowrishankar, Satyanarayana P.S", "title": "A QoS Provisioning Recurrent Neural Network based Call Admission Control\n  for beyond 3G Networks", "comments": "International Journal of Computer Science Issues online at\n  http://ijcsi.org/articles/A-QoS-Provisioning-Recurrent-Neural-Network-based-Call-Admission-Control-for-beyond-3G-Networks.php", "journal-ref": "IJCSI, Volume 7, Issue 2, March 2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Call admission control (CAC) is one of the Radio Resource Management\n(RRM) techniques that plays influential role in ensuring the desired Quality of\nService (QoS) to the users and applications in next generation networks. This\npaper proposes a fuzzy neural approach for making the call admission control\ndecision in multi class traffic based Next Generation Wireless Networks (NGWN).\nThe proposed Fuzzy Neural call admission control (FNCAC) scheme is an\nintegrated CAC module that combines the linguistic control capabilities of the\nfuzzy logic controller and the learning capabilities of the neural networks.\nThe model is based on recurrent radial basis function networks which have\nbetter learning and adaptability that can be used to develop intelligent system\nto handle the incoming traffic in an heterogeneous network environment. The\nsimulation results are optimistic and indicates that the proposed FNCAC\nalgorithm performs better than the other two methods and the call blocking\nprobability is minimal when compared to other two methods.\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2010 20:24:51 GMT"}], "update_date": "2010-04-22", "authors_parsed": [["S.", "Ramesh Babu H.", ""], ["Gowrishankar", "", ""], ["S", "Satyanarayana P.", ""]]}, {"id": "1004.3617", "submitter": "Qingshuo Song", "authors": "Qingshuo Song, Guanrong Chen, Daniel W. C. Ho", "title": "Consensus over a Random Network Generated by i.i.d. Stochastic Matrices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our goal is to find a necessary and sufficient condition on the consensus\nover a random network, generated by i.i.d. stochastic matrices. We show that\nthe consensus problem in three different convergence modes (almost surely, in\nprobability, and in L1) are equivalent, thus have the same necessary and\nsufficient condition. We obtain the necessary and sufficient condition through\nthe stability in a projected subspace.\n", "versions": [{"version": "v1", "created": "Wed, 21 Apr 2010 04:39:56 GMT"}], "update_date": "2010-04-22", "authors_parsed": [["Song", "Qingshuo", ""], ["Chen", "Guanrong", ""], ["Ho", "Daniel W. C.", ""]]}, {"id": "1004.3745", "submitter": "Mahmoud  Moussa", "authors": "M. Ibrahim Moussa (Benha University, Benha, Egypt)", "title": "An Algorithm for Odd Graceful Labeling of the Union of Paths and Cycles", "comments": "9 Pages, JGraph-Hoc Journal", "journal-ref": "Vol.2, No.1, March 2010", "doi": "10.5121/jgraphhoc.2010.2108", "report-no": "0007736", "categories": "cs.IT cs.NI math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In 1991, Gnanajothi [4] proved that the path graph P_n with n vertex and n-1\nedge is odd graceful, and the cycle graph C_m with m vertex and m edges is odd\ngraceful if and only if m even, she proved the cycle graph is not graceful if m\nodd. In this paper, firstly, we studied the graph C_m $\\cup$ P_m when m = 4,\n6,8,10 and then we proved that the graph C_ $\\cup$ P_n is odd graceful if m is\neven. Finally, we described an algorithm to label the vertices and the edges of\nthe vertex set V(C_m $\\cup$ P_n) and the edge set E(C_m $\\cup$ P_n).\n", "versions": [{"version": "v1", "created": "Wed, 21 Apr 2010 16:58:37 GMT"}], "update_date": "2010-04-22", "authors_parsed": [["Moussa", "M. Ibrahim", "", "Benha University, Benha, Egypt"]]}, {"id": "1004.3890", "submitter": "Sana Ullah", "authors": "Sana Ullah, Bin Shen, S.M. Riazul Islam, Pervez Khan, Shahnaz Saleem,\n  and Kyung Sup Kwak", "title": "A Study of Medium Access Control Protocols for Wireless Body Area\n  Networks", "comments": "13 pages, 8 figures, 7 tables", "journal-ref": "Sensors, vol. 10, no. 1, pp. 128-145, 2010", "doi": "10.3390/s100100128", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The seamless integration of low-power, miniaturised, invasive/non-invasive\nlightweight sensor nodes have contributed to the development of a proactive and\nunobtrusive Wireless Body Area Network (WBAN). A WBAN provides long-term health\nmonitoring of a patient without any constraint on his/her normal dailylife\nactivities. This monitoring requires low-power operation of\ninvasive/non-invasive sensor nodes. In other words, a power-efficient Medium\nAccess Control (MAC) protocol is required to satisfy the stringent WBAN\nrequirements including low-power consumption. In this paper, we first outline\nthe WBAN requirements that are important for the design of a low-power MAC\nprotocol. Then we study low-power MAC protocols proposed/investigated for WBAN\nwith emphasis on their strengths and weaknesses. We also review different\npower-efficient mechanisms for WBAN. In addition, useful suggestions are given\nto help the MAC designers to develop a low-power MAC protocol that will satisfy\nthe stringent WBAN requirements.\n", "versions": [{"version": "v1", "created": "Thu, 22 Apr 2010 11:26:44 GMT"}, {"version": "v2", "created": "Sat, 31 Jul 2010 08:43:12 GMT"}], "update_date": "2010-08-03", "authors_parsed": [["Ullah", "Sana", ""], ["Shen", "Bin", ""], ["Islam", "S. M. Riazul", ""], ["Khan", "Pervez", ""], ["Saleem", "Shahnaz", ""], ["Kwak", "Kyung Sup", ""]]}, {"id": "1004.4154", "submitter": "Ayon Chakraborty", "authors": "Swarup kumar Mitra, Ayon Chakraborty, Subhajit Mandal and M.K.Naskar", "title": "Simulation of Wireless Sensor Networks Using TinyOS- A case Study", "comments": "This paper has been withdrawn by the author due to a crucial sign\n  error in equation 1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn by the author due to a crucial sign error in\nequation 1\n", "versions": [{"version": "v1", "created": "Fri, 23 Apr 2010 15:00:19 GMT"}, {"version": "v2", "created": "Sun, 26 Jun 2011 05:54:11 GMT"}], "update_date": "2011-06-28", "authors_parsed": [["Mitra", "Swarup kumar", ""], ["Chakraborty", "Ayon", ""], ["Mandal", "Subhajit", ""], ["Naskar", "M. K.", ""]]}, {"id": "1004.4297", "submitter": "Pengkai Zhao", "authors": "Pengkai Zhao Babak Daneshrad", "title": "Bounds on the Maximum Number of Concurrent Links in MIMO Ad Hoc Networks\n  with QoS Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple-Input Multiple-Output (MIMO) based Medium Access Control (MAC)\nprotocols have received a good deal of attention as researchers look to enhance\noverall performance of Ad Hoc networks by leveraging multi antenna enabled\nnodes. To date such MAC protocols have been evaluated through comparative\nsimulation based studies that report on the number of concurrent links the\nprotocol can support. However, a bound on the maximum number of concurrent\nlinks (MNCL) that a MIMO based MAC protocol should strive to achieve has\nhitherto been unavailable. In this paper we present a theoretical formulation\nfor calculating the bound on the MNCL in a Mobile Ad Hoc Network (MANET) where\nthe nodes have multiple antenna capability, while guaranteeing a minimum\nQuality of Service (QoS). In an attempt to make our findings as practical and\nrealistic as possible, the study incorporates models for the following PHY\nlayer and channel dependent elements: (a) path loss and fast fading effects, in\norder to accurately model adjacent link interference; (b) a Minimum Mean\nSquared Error (MMSE) based detector in the receiver which provides a balance\nbetween completely nulling of neighboring interference and hardware complexity.\nIn calculating the bound on the MNCL our work also delivers the optimal power\ncontrol solution for the network as well as the optimal link selection. The\nresults are readily applicable to MIMO systems using Receive Diversity, Space\nTime Block Coding (STBC), and Transmit Beamforming and show that with a 4\nelement antenna system, as much as 3x improvement in the total number of\nconcurrent links can be achieved relative to a SISO based network. The results\nalso show diminishing improvement as the number of antennas is increased beyond\n4, and the maximum allowable transmit power is increased beyond 10 dBm (for the\nsimulated parameters).\n", "versions": [{"version": "v1", "created": "Sat, 24 Apr 2010 17:52:57 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Daneshrad", "Pengkai Zhao Babak", ""]]}, {"id": "1004.4326", "submitter": "Udayan Kumar", "authors": "Udayan Kumar, Gautam Thakur, Ahmed Helmy", "title": "PROTECT: Proximity-based Trust-advisor using Encounters for Mobile\n  Societies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many interactions between network users rely on trust, which is becoming\nparticularly important given the security breaches in the Internet today. These\nproblems are further exacerbated by the dynamics in wireless mobile networks.\nIn this paper we address the issue of trust advisory and establishment in\nmobile networks, with application to ad hoc networks, including DTNs. We\nutilize encounters in mobile societies in novel ways, noticing that mobility\nprovides opportunities to build proximity, location and similarity based trust.\nFour new trust advisor filters are introduced - including encounter frequency,\nduration, behavior vectors and behavior matrices - and evaluated over an\nextensive set of real-world traces collected from a major university. Two sets\nof statistical analyses are performed; the first examines the underlying\nencounter relationships in mobile societies, and the second evaluates DTN\nrouting in mobile peer-to-peer networks using trust and selfishness models. We\nfind that for the analyzed trace, trust filters are stable in terms of growth\nwith time (3 filters have close to 90% overlap of users over a period of 9\nweeks) and the results produced by different filters are noticeably different.\nIn our analysis for trust and selfishness model, our trust filters largely undo\nthe effect of selfishness on the unreachability in a network. Thus improving\nthe connectivity in a network with selfish nodes.\n  We hope that our initial promising results open the door for further research\non proximity-based trust.\n", "versions": [{"version": "v1", "created": "Sun, 25 Apr 2010 05:42:14 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Kumar", "Udayan", ""], ["Thakur", "Gautam", ""], ["Helmy", "Ahmed", ""]]}, {"id": "1004.4356", "submitter": "Gautam Thakur", "authors": "Gautam S. Thakur, Mukul Sharma, Ahmed Helmy", "title": "SHIELD: Social sensing and Help In Emergency using mobiLe Devices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  School and College campuses face a perceived threat of violent crimes and\nrequire a realistic plan against unpredictable emergencies and disasters.\nExisting emergency systems (e.g., 911, campus-wide alerts) are quite useful,\nbut provide delayed response (often tens of minutes) and do not utilize\nproximity or locality. There is a need to augment such systems with\nproximity-based systems for more immediate response to attempt to prevent and\ndeter crime. In this paper we propose SHIELD, an on-campus emergency rescue and\nalert management service. It is a fully distributed infrastructure-less\nplatform based on proximity-enabled trust and cooperation. It relies on\nlocalized responses, sent using Bluetooth and/or WiFi on the fly to achieve\nminimal response time and maximal availability thereby augmenting the\ntraditional notion of emergency services. Analysis of campus crime statistics\nand WLAN traces surprisingly show a strong positive correlation (over 55%)\nbetween on-campus crime statistics and spatio-temporal density distribution of\non-campus mobile users. This result provides a motivation to develop such\nplatform and points to the promise in reducing crime incidences. We also show\nan implementation of a prototype application to be used in such scenarios.\n", "versions": [{"version": "v1", "created": "Sun, 25 Apr 2010 15:10:56 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Thakur", "Gautam S.", ""], ["Sharma", "Mukul", ""], ["Helmy", "Ahmed", ""]]}, {"id": "1004.4437", "submitter": "Sungwook Moon", "authors": "Sungwook Moon, Ahmed Helmy", "title": "Understanding periodicity and regularity of nodal encounters in mobile\n  networks: A spectral analysis", "comments": "Shorter version has been accepted to IEEE GlobeCom 2010", "journal-ref": null, "doi": "10.1109/GLOCOM.2010.5684252", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Study on human mobility is gaining increasing attention from the research\ncommunity with its multiple applications to use in mobile networks,\nparticularly for the purpose of message delivery in the Delay Tolerant\nNetworks. To better understand the potential of mobile nodes as message relays,\nour study investigates the encounter pattern of mobile devices. Specifically,\nwe examine the extensive network traces that reflect mobility of communication\ndevices. We analyze the periodicity in encounter pattern by using power\nspectral analysis. Strong periodicity was observed among rarely encountering\nmobile nodes while the periodicity was weaker among frequently encountering\nnodes. Further, we present a method to search regularly encountering pairs and\ndiscuss the findings. To our knowledge, we are the first to analyze the\nperiodicity of encounter pattern with large network traces, which is a critical\nbasis for designing an efficient delivery scheme using mobile nodes.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 08:54:29 GMT"}, {"version": "v2", "created": "Tue, 17 Aug 2010 22:19:44 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Moon", "Sungwook", ""], ["Helmy", "Ahmed", ""]]}, {"id": "1004.4438", "submitter": "Alexandros Dimakis", "authors": "Alexandros G. Dimakis, Kannan Ramchandran, Yunnan Wu, Changho Suh", "title": "A Survey on Network Codes for Distributed Storage", "comments": "13 pages, 11 figures.", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DC cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed storage systems often introduce redundancy to increase\nreliability. When coding is used, the repair problem arises: if a node storing\nencoded information fails, in order to maintain the same level of reliability\nwe need to create encoded information at a new node. This amounts to a partial\nrecovery of the code, whereas conventional erasure coding focuses on the\ncomplete recovery of the information from a subset of encoded packets. The\nconsideration of the repair network traffic gives rise to new design\nchallenges. Recently, network coding techniques have been instrumental in\naddressing these challenges, establishing that maintenance bandwidth can be\nreduced by orders of magnitude compared to standard erasure codes. This paper\nprovides an overview of the research results on this topic.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 08:59:38 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Dimakis", "Alexandros G.", ""], ["Ramchandran", "Kannan", ""], ["Wu", "Yunnan", ""], ["Suh", "Changho", ""]]}, {"id": "1004.4444", "submitter": "William Jackson", "authors": "Ramesh Babu H.S., Gowrishankar, Satyanarayana P.S", "title": "An Intelligent Call Admission Control Decision Mechanism for Wireless\n  Networks", "comments": "Journal of Computing online at\n  https://sites.google.com/site/journalofcomputing/", "journal-ref": "Journal of Computing, Volume 2, Issue 4, April 2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Call admission control (CAC) is one of the Radio Resource Management\n(RRM) techniques plays instrumental role in ensuring the desired Quality of\nService (QoS) to the users working on different applications which have\ndiversified nature of QoS requirements. This paper proposes a fuzzy neural\napproach for call admission control in a multi class traffic based Next\nGeneration Wireless Networks (NGWN). The proposed Fuzzy Neural Call Admission\nControl (FNCAC) scheme is an integrated CAC module that combines the linguistic\ncontrol capabilities of the fuzzy logic controller and the learning\ncapabilities of the neural networks .The model is based on Recurrent Radial\nBasis Function Networks (RRBFN) which have better learning and adaptability\nthat can be used to develop the intelligent system to handle the incoming\ntraffic in the heterogeneous network environment. The proposed FNCAC can\nachieve reduced call blocking probability keeping the resource utilisation at\nan optimal level. In the proposed algorithm we have considered three classes of\ntraffic having different QoS requirements. We have considered the heterogeneous\nnetwork environment which can effectively handle this traffic. The traffic\nclasses taken for the study are Conversational traffic, Interactive traffic and\nback ground traffic which are with varied QoS parameters. The paper also\npresents the analytical model for the CAC .The paper compares the call blocking\nprobabilities for all the three types of traffic in both the models. The\nsimulation results indicate that compared to Fuzzy logic based CAC,\nConventional CAC, The simulation results are optimistic and indicates that the\nproposed FNCAC algorithm performs better where the call blocking probability is\nminimal when compared to other two methods.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 09:26:32 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["S.", "Ramesh Babu H.", ""], ["Gowrishankar", "", ""], ["S", "Satyanarayana P.", ""]]}, {"id": "1004.4465", "submitter": "William Jackson", "authors": "Er. Anantdeep, Er. Sandeep kaur and Er. Balpreet Kaur", "title": "Mobile Zigbee Sensor Networks", "comments": "https://sites.google.com/site/journalofcomputing/", "journal-ref": "Journal of Computing, Volume 2, Issue 4, April 2010, 95-99", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  OPNET Modeler accelerates network R&D and improves product quality through\nhigh-fidelity modeling and scalable simulation. It provides a virtual\nenvironment for designing protocols and devices, and for testing and\ndemonstrating designs in realistic scenarios prior to production. OPNET Modeler\nsupports 802.15.4 standard and has been used to make a model of PAN. Iterations\nhave been performed by changing the Power of the transmitter and the throughput\nwill has been analyzed to arrive at optimal values.An energy-efficient wireless\nhome network based on IEEE 802.15.4, a novel architecture has been proposed. In\nthis architecture, all nodes are classified into stationary nodes and mobile\nnodes according to the functionality of each node. Mobile nodes are usually\nbattery-powered, and therefore need low-power operation. In order to improve\npower consumption of mobile nodes, effective handover sequence based on MAC\nbroadcast and transmission power control based on LQ (link quality) are\nemployed. Experimental results demonstrate that by using the proposed\narchitecture, communication time and power consumption of mobile nodes can be\nreduced by 1.2 seconds and 42.8%, respectively.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 10:13:09 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Anantdeep", "Er.", ""], ["kaur", "Er. Sandeep", ""], ["Kaur", "Er. Balpreet", ""]]}, {"id": "1004.4466", "submitter": "William Jackson", "authors": "Er. Sandeep Kaur, Er. Anantdeep and Er. Deepak Aggarwal", "title": "Effect of Crosstalk on Permutation in Optical Multistage Interconnection\n  Networks", "comments": "Journal of Computing online at\n  https://sites.google.com/site/journalofcomputing/", "journal-ref": "Journal of Computing, Volume 2, Issue 4, April 2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optical MINs hold great promise and have advantages over their electronic\nnetworks.they also hold their own challenges. More research has been done on\nElectronic Multistage Interconnection Networks, (EMINs) but these days optical\ncommunication is a good networking choice to meet the increasing demands of\nhigh-performance computing communication applications for high bandwidth\napplications. The electronic Multistage Interconnection Networks (EMINs) and\nthe Optical Multistage Interconnection Networks (OMINs) have many similarities,\nbut there are some fundamental differences between them such as the\noptical-loss during switching and the crosstalk problem in the optical\nswitches. To reduce the negative effect of crosstalk, various approaches which\napply the concept of dilation in either the space or time domain have been\nproposed. With the space domain approach, extra SEs are used to ensure that at\nmost one input and one output of every SE will be used at any given time. For\nan Optical network without crosstalk, it is needed to divide the messages into\nseveral groups, and then deliver the messages using one time slot (pass) for\neach group, which is called the time division multiplexing. This Paper\ndiscusses the permutation passability behavior of optical MINs. The bandwidth\nof optical MINs with or without crosstalk has also been explained. The results\nthus obtained shows that the performance of the networks improves by allowing\ncrosstalk to some extent.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 10:15:37 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Kaur", "Er. Sandeep", ""], ["Anantdeep", "Er.", ""], ["Aggarwal", "Er. Deepak", ""]]}, {"id": "1004.4481", "submitter": "William Jackson", "authors": "Ravinder Yadav and Rinkle Rani Aggarwal", "title": "Survey and Comparison of Optical Switch Fabrication Techniques and\n  Architectures", "comments": "https://sites.google.com/site/journalofcomputing/", "journal-ref": "Journal of Computing, Volume 2, Issue 4, April 2010, 133-137", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main issue in the optical transmission is switching speed. The optical\npacket switching faces many significant challenges in processing and buffering.\nThe generalized multilevel protocol switching seeks to eliminate the\nasynchronous transfer mode and synchronous optical network layer, hence the\nimplementation of IP over WDM (wave length division multiplexing). Optical\nburst switching attempts to minimize the need for processing and buffering by\naggregating flow of data packets in to burst. In this paper there is an\nextensive overview on current technologies and techniques concerning optical\nswitching.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 11:04:14 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Yadav", "Ravinder", ""], ["Aggarwal", "Rinkle Rani", ""]]}, {"id": "1004.4554", "submitter": "Michele Weigle", "authors": "Hadi Arbabi and Michele C. Weigle", "title": "Highway Mobility and Vehicular Ad-Hoc Networks in NS-3", "comments": "Accepted to 2010 Winter Simulation Conference, new version addresses\n  reviewers' comments, updated source code URLs, 12 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The study of vehicular ad-hoc networks (VANETs) requires efficient and\naccurate simulation tools. As the mobility of vehicles and driver behavior can\nbe affected by network messages, these tools must include a vehicle mobility\nmodel integrated with a quality network simulator. We present the first\nimplementation of a well-known vehicle mobility model to ns-3, the next\ngeneration of the popular ns-2 networking simulator. Vehicle mobility and\nnetwork communication are integrated through events. User-created event\nhandlers can send network messages or alter vehicle mobility each time a\nnetwork message is received and each time vehicle mobility is updated by the\nmodel. To aid in creating simulations, we have implemented a straight highway\nmodel that manages vehicle mobility, while allowing for various user\ncustomizations. We show that the results of our implementation of the mobility\nmodel matches that of the model's author and provide an example of using our\nimplementation in ns-3.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 15:43:26 GMT"}, {"version": "v2", "created": "Wed, 23 Jun 2010 15:16:35 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Arbabi", "Hadi", ""], ["Weigle", "Michele C.", ""]]}, {"id": "1004.4583", "submitter": "Ashley Smith", "authors": "Iwan Adhicandra", "title": "Measuring Data and VoIP Traffic in WiMAX Networks", "comments": "Iwan Adhicandra, \"Measuring Data and VoIP Traffic in WiMAX Networks\",\n  Journal of Telecommunications, Volume 2, Issue 1, p1-6, April 2010", "journal-ref": "Journal of Telecommunications, Volume 2, Issue 1, p1-6, April 2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to its large coverage area, low cost of deployment and high speed data\nrates, WiMAX is a promising technology for providing wireless last-mile\nconnectivity. Physical and MAC layer of this technology refer to the IEEE\n802.16e standard, which defines 5 different data delivery service classes that\ncan be used in order to satisfy Quality of Service (QoS) requirements of\ndifferent applications, such as VoIP, videoconference, FTP, Web, etc. The main\naim of the paper is to examine a case of QoS deployment over a cellular WiMAX\nnetwork. In particular, the paper compares the performance obtained using two\ndifferent QoS configurations differing from the delivery service class used to\ntransport VoIP traffic, i.e. UGS or ertPS. Results indicate that for\ndelay-sensitive traffic that fluctuates beyond its nominal rate, having the\npossibility to give back some of its reserved bandwidth, ertPS has the\nadvantage to permit the transmission of BE traffic.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 18:00:35 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Adhicandra", "Iwan", ""]]}, {"id": "1004.4586", "submitter": "Ashley Smith", "authors": "A. Ahmed Jedidi and B. Mohamed Abid", "title": "Optimal Crosstalk Detection and Localization Method for Optical Time\n  Division Multiplexed Transmission Systems", "comments": "A. Ahmed Jedidi and B. Mohamed Abid, \"Optimal Crosstalk Detection and\n  Localization Method for Optical Time Division Multiplexed Transmission\n  Systems\", Journal of Telecommunications, Volume 2, Issue 1, p7-11, April 2010", "journal-ref": "Journal of Telecommunications, Volume 2, Issue 1, p7-11, April\n  2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  All-Optical Network (AON) is a network where the user-network interface is\noptical and the data does undergo optical to electrical conversion within the\nnetwork. AONs are attractive because they promise very high rates, flexible\nswitching and broad application support. There are two technologies for AON:\nWavelength Division Multiplexed (WDM) and Optical Time Division Multiplexed\n(OTDM). OTDM transmission systems are becoming increasingly important as one of\nthe key technologies satisfying the growing demand for large capacity optical\nnetworks. Although OTDM has several advantages in terms of operation system,\nsuch as natural accommodation of higher bit rate payloads, it introduces many\nsecurity vulnerabilities, which do not exist in traditional networks. One of\nthe serious problems with OTDM is the fact that optical crosstalk is additive,\nand thus the aggregate effect of crosstalk over a whole all-optical network\n(AON) may be more nefarious than a single point of crosstalk. This is because\ncrosstalk can spread rapidly through the network, causing additional awkward\nfailures and triggering multiple undesirable alarms. This results in the\ncontinuous monitoring and identification of the impairments becoming\nchallenging in the event of transmission failures. In this paper we propose a\nnovel approach for detecting and localizing crosstalk in OTDM transmission\nsystems that can participate in some tasks for fault management in optical\nnetwork.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 18:06:00 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Jedidi", "A. Ahmed", ""], ["Abid", "B. Mohamed", ""]]}, {"id": "1004.4588", "submitter": "Ashley Smith", "authors": "Norrozila Sulaiman and Che Yahaya Yaakub", "title": "Investigation on QoS of Campus-wide WiFi Networks", "comments": "Norrozila Sulaiman and Che Yahaya Yaakub, \"Investigation on QoS of\n  Campus-wide WiFi Networks\", Journal of Telecommunications, Volume 2, Issue 1,\n  p12-16, April 2010", "journal-ref": "Journal of Telecommunications, Volume 2, Issue 1, p12-16, April\n  2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  WiFi is widely implemented in campus wide including administrative, teaching\nand student's accommodation. Wireless communications are associated with\ninterconnect devices which includes cellular networks, infrared, bluetooth and\nWiFi enabled devices. It involves mobility and freedom of assessing information\nanytime and anywhere. A study on WiFi networks in a campus environment is\npresented in this paper. The aim of the research was to investigate the\nconnectivity problems to WiFi networks. The study includes WiFi performance\nanalysis as well as network auditing. Channel overlapping and saturation\ncondition were some of the problems encountered. Different types of software\nwere used for analyzing the results.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 18:10:20 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Sulaiman", "Norrozila", ""], ["Yaakub", "Che Yahaya", ""]]}, {"id": "1004.4598", "submitter": "Ashley Smith", "authors": "M. Sadiq Ali Khan", "title": "Revealing Method for the Intrusion Detection System", "comments": "M. Sadiq Ali Khan, \"Revealing Method for the Intrusion Detection\n  System\", Journal of Telecommunications, Volume 2, Issue 1, p36-41, April 2010", "journal-ref": "Journal of Telecommunications, Volume 2, Issue 1, p36-41, April\n  2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of an Intrusion Detection is inadequate to detect errors and unusual\nactivity on a network or on the hosts belonging to a local network by\nmonitoring network activity. Algorithms for building detection models are\nbroadly classified into two categories, Misuse Detection and Anomaly Detection.\nThe proposed approach should be taken into account, as the security system\nviolations caused by both incompliance with the security policy and attacks on\nthe system resulting in the need to describe models. However, it is based on\nunified mathematical formalism which is provided for subsequent merger of the\nmodels. The above formalism in this paper presents a state machine describing\nthe behavior of a system subject. The set of intrusion description models is\nused by the evaluation module and determines the likelihood of undesired\nactions the system is capable of detecting. The number of attacks which are not\ndescribed by models determining the completeness of detection by the IDS linked\nto the ability of detecting security violations.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 18:34:19 GMT"}, {"version": "v2", "created": "Mon, 31 May 2010 14:58:39 GMT"}, {"version": "v3", "created": "Wed, 27 Oct 2010 17:10:54 GMT"}], "update_date": "2010-10-28", "authors_parsed": [["Khan", "M. Sadiq Ali", ""]]}, {"id": "1004.4600", "submitter": "Ashley Smith", "authors": "Lamia Chaari and Lotfi Kamoun", "title": "Wireless sensors networks MAC protocols analysis", "comments": "Lamia Chaari and Lotfi Kamoun, \"Wireless sensors networks MAC\n  protocols analysis\", Journal of Telecommunications, Volume 2, Issue 1,\n  p42-48, April 2010", "journal-ref": "Journal of Telecommunications, Volume 2, Issue 1, p42-48, April\n  2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensors networks performance are strictly related to the medium\naccess mechanism. An effective one, require non-conventional paradigms for\nprotocol design due to several constraints. An adequate equilibrium between\ncommunication improvement and data processing capabilities must be\naccomplished. To achieve low power operation, several MAC protocols already\nproposed for WSN. The aim of this paper is to survey and to analyze the most\nenergy efficient MAC protocol in order to categorize them and to compare their\nperformances. Furthermore we have implemented some of WSN MAC protocol under\nOMNET++ with the purpose to evaluate their performances.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 18:41:32 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Chaari", "Lamia", ""], ["Kamoun", "Lotfi", ""]]}, {"id": "1004.4614", "submitter": "Ashley Smith", "authors": "Vitthal J. Gond and Aditya Goel", "title": "Performance Evaluation of Wavelength Routed Optical Network with\n  Wavelength Conversion", "comments": "Vitthal J. Gond and Aditya Goel, \"Performance Evaluation of\n  Wavelength Routed Optical Network with Wavelength Conversion\", Journal of\n  Telecommunications, Volume 2, Issue 1, p110-114, April 2010", "journal-ref": "Journal of Telecommunications, Volume 2, Issue 1, p110-114, April\n  2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid development of telecommunication networks is driven by user demands\nfor new applications and advances in technologies. The explosive growth of the\ninternet traffic is due to its use for collecting the information,\ncommunication, multimedia application, entertainment, etc. These applications\nare imposing a tremendous demand for bandwidth capacity on telecommunication\nnetwork. The introduction of fiber optics had proved to meet the huge demand of\nbandwidth. These requirement can be meet by all optical network which is\ncapable of transmitting enormous data at very high speed, around 50 Tera bits\nper seconds (Tbps) A wavelength conversion technique is addressed in this paper\nto reduced the blocking probability in wavelength routed networks. It is seen\nthat the blocking probability of traffic requests decreases as the wavelength\nconversion factor increases. We explode the possibility for network with\ndifferent size with variation in wavelength per link. In this work the\nevaluation of wavelength routed optical network with varying number of\nwavelength converters, different traffic types are carried out and results are\nshown that the blocking probability is minimum with 50% to 60% wavelength\nconvertible nodes. Wavelength convertible nodes more than 60% are not showing\nmuch effect on reduction in blocking probability rather it results in increase\nin overall cost of network.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 19:29:59 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Gond", "Vitthal J.", ""], ["Goel", "Aditya", ""]]}, {"id": "1004.4616", "submitter": "Ashley Smith", "authors": "Lamia Chaari, Rim Ayadi and Lotfi Kamoun", "title": "Conception and FPGA implementation of IEEE 802.11s mesh network MAC\n  layer transmitter", "comments": "Lamia Chaari, Rim Ayadi and Lotfi Kamoun, \"Conception and FPGA\n  implementation of IEEE 802.11s mesh network MAC layer transmitter\"", "journal-ref": "Journal of Telecommunications, Volume 2, Issue 1, p115-123, April\n  2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes, a hardware implementation of Wireless Mesh Networks\n(WMN) medium Access Controller (MAC) layer transmitter. In the literature a lot\nof works are focused on WMN routing protocol as well as performance analysis\nand software integration of WMN units, however few works deals with WMN\nhardware implementation. In this field our contribution is to conceive and to\nimplements on FPGA a WMN MAC transmitter module. Our implementation, written in\nhardware description language (HDL) is based on the IEEE 802.11 s standard. The\nhardware implementation retains a good performance in speed.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 19:35:56 GMT"}], "update_date": "2010-04-27", "authors_parsed": [["Chaari", "Lamia", ""], ["Ayadi", "Rim", ""], ["Kamoun", "Lotfi", ""]]}, {"id": "1004.4690", "submitter": "Weiping Zhu", "authors": "Weiping Zhu", "title": "Explicit Maximum Likelihood Loss Estimator in Multicast Tomography", "comments": "submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the tree topology, previous studies show the maximum likelihood estimate\n(MLE) of a link/path takes a polynomial form with a degree that is one less\nthan the number of descendants connected to the link/path. Since then, the main\nconcern is focused on searching for methods to solve the high degree polynomial\nwithout using iterative approximation. An explicit estimator based on the Law\nof Large Numbers has been proposed to speed up the estimation. However, the\nestimate obtained from the estimator is not a MLE. When $n<\\infty$, the\nestimate may be noticeable different from the MLE. To overcome this, an\nexplicit MLE estimator is presented in this paper and a comparison between the\nMLE estimator and the explicit estimator proposed previously is presented to\nunveil the insight of the MLE estimator and point out the pitfall of the\nprevious one.\n", "versions": [{"version": "v1", "created": "Tue, 27 Apr 2010 01:35:10 GMT"}], "update_date": "2010-04-28", "authors_parsed": [["Zhu", "Weiping", ""]]}, {"id": "1004.4709", "submitter": "Bo Tan", "authors": "Bo (Rambo) Tan, Laurent Massoulie", "title": "Optimal Content Placement for Peer-to-Peer Video-on-Demand Systems", "comments": "18 pages (double column), 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC cs.PF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we address the problem of content placement in peer-to-peer\nsystems, with the objective of maximizing the utilization of peers' uplink\nbandwidth resources. We consider system performance under a many-user\nasymptotic. We distinguish two scenarios, namely \"Distributed Server Networks\"\n(DSN) for which requests are exogenous to the system, and \"Pure P2P Networks\"\n(PP2PN) for which requests emanate from the peers themselves. For both\nscenarios, we consider a loss network model of performance, and determine\nasymptotically optimal content placement strategies in the case of a limited\ncontent catalogue. We then turn to an alternative \"large catalogue\" scaling\nwhere the catalogue size scales with the peer population. Under this scaling,\nwe establish that storage space per peer must necessarily grow unboundedly if\nbandwidth utilization is to be maximized. Relating the system performance to\nproperties of a specific random graph model, we then identify a content\nplacement strategy and a request acceptance policy which jointly maximize\nbandwidth utilization, provided storage space per peer grows unboundedly,\nalthough arbitrarily slowly, with system size.\n", "versions": [{"version": "v1", "created": "Tue, 27 Apr 2010 04:26:40 GMT"}, {"version": "v2", "created": "Sun, 1 Aug 2010 07:52:29 GMT"}, {"version": "v3", "created": "Sat, 29 Jan 2011 14:38:27 GMT"}, {"version": "v4", "created": "Wed, 17 Aug 2011 20:17:18 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Bo", "", "", "Rambo"], ["Tan", "", ""], ["Massoulie", "Laurent", ""]]}, {"id": "1004.4759", "submitter": "Mikkel Baun Kj{\\ae}rgaard", "authors": "Mikkel Baun Kj{\\ae}rgaard", "title": "Indoor Positioning with Radio Location Fingerprinting", "comments": "PhD Dissertation, Aarhus University", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An increasingly important requirement for many novel applications is sensing\nthe positions of people, equipment, etc. GPS technology has proven itself as a\nsuccessfull technology for positioning in outdoor environments but indoor no\ntechnology has yet gained a similar wide-scale adoption. A promising indoor\npositioning technique is radio-based location fingerprinting, having the major\nadvantage of exploiting already existing radio infrastructures, like IEEE\n802.11, which avoids extra deployment costs and effort. The research goal of\nthis thesis is to address the limitations of current indoor location\nfingerprinting systems. In particular the aim is to advance location\nfingerprinting techniques for the challenges of handling heterogeneous clients,\nscalability to many clients, and interference between communication and\npositioning. The wireless clients used for location fingerprinting are\nheterogeneous even when only considering clients for the same technology.\nHeterogeneity is a challenge for location fingerprinting because it severely\ndecreases the precision of location fingerprinting. To support many clients\nlocation fingerprinting has to address how to scale estimate calculation,\nmeasurement distribution, and distribution of position estimates. This is a\nchallenge because of the number of calculations involved and the frequency of\nmeasurements and position updates. Positioning using location fingerprinting\nrequires the measurement of, for instance, signal strength for nearby base\nstations. However, many wireless communication technologies block communication\nwhile collecting such measurements. This interference is a challenge because it\nis not desirable that positioning disables communication. An additional goal is\nto improve the conceptual foundation of location fingerprinting. A better\nfoundation will aid researchers to better survey and design location\nfingerprinting systems.\n", "versions": [{"version": "v1", "created": "Tue, 27 Apr 2010 10:47:21 GMT"}], "update_date": "2010-04-28", "authors_parsed": [["Kjærgaard", "Mikkel Baun", ""]]}, {"id": "1004.4809", "submitter": "Vincent Lucas", "authors": "Vincent Lucas, Jean-Jacques Pansiot, Dominique Grad and Beno\\^it Hilt", "title": "Efficient multicast data transfer with congestion control using dynamic\n  source channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The most efficient receiver-driven multicast congestion control protocols use\ndynamic channels. This means that each group has a cyclic rate variation with a\ncontinuously decreasing phase. Despite promising results in terms of fairness,\nusing efficiently these dynamic groups could be a challenging task for\napplication programmers. This paper presents a sequencer which maps out\napplication data to dynamic groups in an optimal way. Multiple applications\nsuch as file transfer or video streaming, can use this sequencer, thanks to a\nsimple API usable with any buffer containing the most important data first. To\nevaluate this solution, we designed a file transfer software using a FEC\nencoding. Results show the sequencer optimal behavior and the file transfer\nefficiency, as a single download generates only little more overhead than TCP .\nMoreover, download time is almost independent of the number of receivers, and\nis already faster than TCP with 2 competing downloads.\n", "versions": [{"version": "v1", "created": "Tue, 27 Apr 2010 14:11:23 GMT"}], "update_date": "2010-04-28", "authors_parsed": [["Lucas", "Vincent", ""], ["Pansiot", "Jean-Jacques", ""], ["Grad", "Dominique", ""], ["Hilt", "Benoît", ""]]}, {"id": "1004.4821", "submitter": "Ashley Smith", "authors": "Wriddhi Bhowmik and Shweta Srivastava", "title": "Optimum Design of a 4x4 Planar Butler Matrix Array for WLAN Application", "comments": "Wriddhi Bhowmik and Shweta Srivastava, \"Optimum Design of a 4x4\n  Planar Butler Matrix Array for WLAN Application\", Journal of\n  Telecommunications, Volume 2, Issue 1, p68-74, April 2010", "journal-ref": "Journal of Telecommunications, Volume 2, Issue 1, p68-74, April\n  2010", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, high-speed wireless communication is in vogue. In wireless\ncommunication systems, multipath fading, delay and interference occurres by\nreflection or diffraction. In a high-speed wireless communication, it becomes a\nnecessary to separate desired signal from delay or interference signal. Thus to\novercome these problems Smart antenna systems have been developed. Basically\nthere are two types of smart antenna systems, one is Switched beam system and\nanother Adaptive array system.This paper presents the optimum design of a 4x4\nplannar Butler matrix array as a key component of a switched beam smart antenna\nsystem, operating at 5.2 GHz for WLAN with a dielectric substrate, FR4 of er\n=4.9 and h=1.6mm. Conception details, simulation results and measurements are\nalso given for the components (microstrip antenna, hybrid couplers,\ncross-coupler, phase shifter) used to implement the matrix. In this\ndissertation, mathematical calculations for all the components using MATLAB is\ndone and then every individual component is designed using the commercial\nsoftware SONNET. Then these entire components have been combined on a single\nsubstrate and simulated using SONNET.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2010 19:09:17 GMT"}], "update_date": "2010-04-28", "authors_parsed": [["Bhowmik", "Wriddhi", ""], ["Srivastava", "Shweta", ""]]}, {"id": "1004.5108", "submitter": "Dan Zhang", "authors": "Dan Zhang and Narayan B. Mandayam", "title": "Analyzing Random Network Coding with Differential Equations and\n  Differential Inclusions", "comments": "A more up-to-date version has been published on IEEE Trans. Inform.\n  Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.DS math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a framework based on differential equations (DE) and differential\ninclusions (DI) for analyzing Random Network Coding (RNC), as well as a\nnonlinear variant referred to as Random Coupon (RC), in a wireless network. The\nDEDI framework serves as a powerful numerical and analytical tool to study RNC.\nWe demonstrate its versatility by proving theoretical results on multicast\ninformation flows in a wireless network using RNC or RC. We also demonstrate\nthe accuracy and flexibility of the performance analysis enabled by this\nframework via illustrative examples of networks with multiple multicast\nsessions, user cooperation and arbitrary topologies.\n", "versions": [{"version": "v1", "created": "Wed, 28 Apr 2010 18:56:39 GMT"}, {"version": "v2", "created": "Sat, 7 Jan 2012 18:15:13 GMT"}], "update_date": "2012-01-10", "authors_parsed": [["Zhang", "Dan", ""], ["Mandayam", "Narayan B.", ""]]}, {"id": "1004.5495", "submitter": "Somnath Mukherjee", "authors": "Somnath Mukherjee, Pabitra Kumar Ghosh", "title": "The Role of Boolean Function in Fractal Formation and it s Application\n  to CDMA Wireless Communication", "comments": "8 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a new transformation is generated from a three variable\nBoolean function 3, which is used to produce a self-similar fractal pattern of\ndimension 1.58. This very fractal pattern is used to reconstruct the whole\nstructural position of resources in wireless CDMA network. This reconstruction\nminimizes the number of resources in the network and so naturally network\nconsumption costs are getting reduced. Now -a -days resource controlling and\ncost minimization are still a severe problem in wireless CDMA network. To\novercome this problem fractal pattern produced in our research provides a\ncomplete solution of structural position of resources in this Wireless CDMA\nNetwork.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2010 10:35:48 GMT"}, {"version": "v2", "created": "Thu, 6 May 2010 08:59:39 GMT"}, {"version": "v3", "created": "Mon, 10 May 2010 07:50:28 GMT"}, {"version": "v4", "created": "Tue, 11 May 2010 04:47:21 GMT"}, {"version": "v5", "created": "Wed, 19 May 2010 17:29:26 GMT"}], "update_date": "2010-05-20", "authors_parsed": [["Mukherjee", "Somnath", ""], ["Ghosh", "Pabitra Kumar", ""]]}, {"id": "1004.5570", "submitter": "Hemant Kowshik", "authors": "Hemant Kowshik and P. R. Kumar", "title": "Optimal computation of symmetric Boolean functions in Tree networks", "comments": "Accepted to 2010 IEEE International Symposium on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we address the scenario where nodes with sensor data are\nconnected in a tree network, and every node wants to compute a given symmetric\nBoolean function of the sensor data. We first consider the problem of computing\na function of two nodes with integer measurements. We allow for block\ncomputation to enhance data fusion efficiency, and determine the minimum\nworst-case total number of bits to be exchanged to perform the desired\ncomputation. We establish lower bounds using fooling sets, and provide a novel\nscheme which attains the lower bounds, using information theoretic tools. For a\nclass of functions called sum-threshold functions, this scheme is shown to be\noptimal. We then turn to tree networks and derive a lower bound for the number\nof bits exchanged on each link by viewing it as a two node problem. We show\nthat the protocol of recursive innetwork aggregation achieves this lower bound\nin the case of sumthreshold functions. Thus we have provided a communication\nand in-network computation strategy that is optimal for each link. All the\nresults can be extended to the case of non-binary alphabets. In the case of\ngeneral graphs, we present a cut-set lower bound, and an achievable scheme\nbased on aggregation along trees. For complete graphs, the complexity of this\nscheme is no more than twice that of the optimal scheme.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2010 16:26:10 GMT"}], "update_date": "2010-05-03", "authors_parsed": [["Kowshik", "Hemant", ""], ["Kumar", "P. R.", ""]]}, {"id": "1004.5571", "submitter": "Hemant Kowshik", "authors": "Hemant Kowshik and P. R. Kumar", "title": "Optimal ordering of transmissions for computing Boolean threhold\n  functions", "comments": "Accepted to 2010 IEEE International Symposium on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address a sequential decision problem that arises in the computation of\nsymmetric Boolean functions of distributed data. We consider a collocated\nnetwork, where each node's transmissions can be heard by every other node. Each\nnode has a Boolean measurement and we wish to compute a given Boolean function\nof these measurements. We suppose that the measurements are independent and\nBernoulli distributed. Thus, the problem of optimal computation becomes the\nproblem of optimally ordering node's transmissions so as to minimize the total\nexpected number of bits. We solve the ordering problem for the class of Boolean\nthreshold functions. The optimal ordering is dynamic, i.e., it could\npotentially depend on the values of previously transmitted bits. Further, it\ndepends only on the ordering of the marginal probabilites, but not on their\nexact values. This provides an elegant structure for the optimal strategy. For\nthe case where each node has a block of measurements, the problem is\nsignificantly harder, and we conjecture the optimal strategy.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2010 16:32:07 GMT"}], "update_date": "2010-05-03", "authors_parsed": [["Kowshik", "Hemant", ""], ["Kumar", "P. R.", ""]]}]