[{"id": "0808.1343", "submitter": "Holger Kienle", "authors": "Holger M. Kienle, Andreas Lober, Hausi A. M\\\"uller", "title": "Policy and Legal Challenges of Virtual Worlds and Social Network Sites", "comments": "5 pages, 1 table, First International Workshop on Requirements\n  Engineering and Law (RELAW 2008), Barcelona, Spain.\n  http://www4.ncsu.edu/~tdbreaux/relaw/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses policy challenges of complex virtual environments such\nas virtual worlds, social network sites, and massive multiplayer online games.\nThe complexity of these environments--apparent by the rich user interactions\nand sophisticated user-generated content that they offer--poses unique\nchallenges for policy management and compliance. These challenges are also\nimpacting the life cycle of the software system that implements the virtual\nenvironment. The goal of this paper is to identify and sketch important legal\nand policy challenges of virtual environments and how they affect stakeholders\n(i.e., operators, users, and lawmakers). Given the increasing significance of\nvirtual environments, we expect that tackling these challenges will become\nincreasingly important in the future.\n", "versions": [{"version": "v1", "created": "Sat, 9 Aug 2008 10:15:38 GMT"}], "update_date": "2008-08-12", "authors_parsed": [["Kienle", "Holger M.", ""], ["Lober", "Andreas", ""], ["Müller", "Hausi A.", ""]]}, {"id": "0808.2431", "submitter": "Frederic Connes", "authors": "Frederic Connes", "title": "A Simple E-Voting Protocol", "comments": "8 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an e-voting protocol that seems to allow citizens to verify that\ntheir vote has been accurately taken into account while preserving its secrecy,\nwithout requiring the use of a complex process. The main idea is to give each\nvoter a receipt on which her choice is mixed with the choices of other voters.\n", "versions": [{"version": "v1", "created": "Mon, 18 Aug 2008 17:19:40 GMT"}], "update_date": "2008-08-19", "authors_parsed": [["Connes", "Frederic", ""]]}]