[{"id": "0707.2341", "submitter": "Amac Herdagdelen", "authors": "Amac Herdagdelen, Haluk Bingol", "title": "A Cultural Market Model", "comments": null, "journal-ref": "International Journal of Modern Physics C Vol. 19, No. 2, 271-282\n  (2008)", "doi": "10.1142/S012918310801208X", "report-no": null, "categories": "q-fin.GN cs.CY nlin.AO physics.soc-ph", "license": null, "abstract": "  Social interactions and personal tastes shape our consumption behavior of\ncultural products. In this study, we present a computational model of a\ncultural market and we aim to analyze the behavior of the consumer population\nas an emergent phenomena. Our results suggest that the final market shares of\ncultural products dramatically depend on consumer heterogeneity and social\ninteraction pressure. Furthermore, the relation between the resulting market\nshares and social interaction is robust with respect to a wide range of\nvariation in the parameter values and the type of topology.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jul 2007 15:30:32 GMT"}, {"version": "v2", "created": "Sat, 19 Apr 2008 00:09:06 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Herdagdelen", "Amac", ""], ["Bingol", "Haluk", ""]]}, {"id": "0707.2934", "submitter": "Christine Michel", "authors": "Christine Michel (LIESP), Elise Garrot (LIESP), Sebastien George\n  (LIESP)", "title": "Instrumented Collective Learning Situations (ICLS): the Gap between\n  Theoretical Research and Observed Practices", "comments": null, "journal-ref": "18th Internationale Conference on Society for Information\n  Technology and Teacher Education (SITE 2007) Proceddings (26/03/2007) 895-901", "doi": null, "report-no": null, "categories": "cs.CY", "license": null, "abstract": "  According to socio-constructivism approach, collective situations are\npromoted to favor learning in classroom, at a distance or in a blended\neducational context. So, many Information and Communication Technologies (ICT)\nare provided to teachers but there are no clear studies about the way they are\nused and perceived. Our research is based on the hypothesis that practices of\neducational actors (instructional designers and tutors) are far away from\ntheoretical results of research in education technologies. In this paper, we\nconsider a precise kind of situation: Instrumented Collective Learning\nSituations (ICLS). By a survey on 13 fields in higher education in France,\nSwitzerland and Canada, we present how ICLS are designed and how teachers used\nthem. Conclusions give an indication on the gap between the way information\ntechnologies are prescribed and the way they are actually used and perceived by\nteachers.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2007 16:18:54 GMT"}], "update_date": "2007-07-20", "authors_parsed": [["Michel", "Christine", "", "LIESP"], ["Garrot", "Elise", "", "LIESP"], ["George", "Sebastien", "", "LIESP"]]}, {"id": "0707.3014", "submitter": "Christine Michel", "authors": "Christine Michel (LIESP), Elise Garrot (LIESP), Sebastien George\n  (LIESP)", "title": "Situations d'apprentissage collectives instrument\\'ees : \\'etude de\n  pratiques dans l'enseignement sup\\'erieur", "comments": null, "journal-ref": "Actes de la Conf\\'erence en EIAH 2007 (27/06/2007) 185-196", "doi": null, "report-no": null, "categories": "cs.CY", "license": null, "abstract": "  Currently, educational platforms propose many tools of communication,\nproduction, labour division or collective work management in order to support\ncollective activities. But it is not guaranteed that actors (instructional\ndesigners, tutors or learner) are really using them. Our work, describe\ncharacteristics of instrumented learning situations (ICLS) in the higher\neducation. Our intention is to determine: if ICLS are really existing; which\nform they take (in terms of scenario, tools, type of activity...) ; if\nrecommendations resulting from research tasks are taken into account by\ninstructional designers and if the instructional designer prescribed activities\nare really follow by learners or tutors? To answer these questions, we have\nmade a survey about ICLS actors uses.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jul 2007 08:28:00 GMT"}], "update_date": "2007-07-23", "authors_parsed": [["Michel", "Christine", "", "LIESP"], ["Garrot", "Elise", "", "LIESP"], ["George", "Sebastien", "", "LIESP"]]}]