[{"id": "1211.0053", "submitter": "David Shuman", "authors": "David I Shuman, Sunil K. Narang, Pascal Frossard, Antonio Ortega, and\n  Pierre Vandergheynst", "title": "The Emerging Field of Signal Processing on Graphs: Extending\n  High-Dimensional Data Analysis to Networks and Other Irregular Domains", "comments": "To appear in the IEEE Signal Processing Magazine", "journal-ref": null, "doi": "10.1109/MSP.2012.2235192", "report-no": null, "categories": "cs.DM cs.LG cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In applications such as social, energy, transportation, sensor, and neuronal\nnetworks, high-dimensional data naturally reside on the vertices of weighted\ngraphs. The emerging field of signal processing on graphs merges algebraic and\nspectral graph theoretic concepts with computational harmonic analysis to\nprocess such signals on graphs. In this tutorial overview, we outline the main\nchallenges of the area, discuss different ways to define graph spectral\ndomains, which are the analogues to the classical frequency domain, and\nhighlight the importance of incorporating the irregular structures of graph\ndata domains when processing signals on graphs. We then review methods to\ngeneralize fundamental operations such as filtering, translation, modulation,\ndilation, and downsampling to the graph setting, and survey the localized,\nmultiscale transforms that have been proposed to efficiently extract\ninformation from high-dimensional data on graphs. We conclude with a brief\ndiscussion of open issues and possible extensions.\n", "versions": [{"version": "v1", "created": "Wed, 31 Oct 2012 23:18:43 GMT"}, {"version": "v2", "created": "Sun, 10 Mar 2013 15:04:40 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Shuman", "David I", ""], ["Narang", "Sunil K.", ""], ["Frossard", "Pascal", ""], ["Ortega", "Antonio", ""], ["Vandergheynst", "Pierre", ""]]}, {"id": "1211.0297", "submitter": "Paraskevas Lekeas", "authors": "Paraskevas V. Lekeas", "title": "A Note on Circular Arc Online Coloring using First Fit", "comments": "9 pages, 3 figures, Figure 3 corrected from previous version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Raman (2007), using a column construction technique it is proved that\nevery interval graph can be colored online with First Fit with at most $8w(G)$\ncolors, where $w(G)$ is the size of the maximum clique of $G$. Since the column\nconstruction can not be adapted to circular arc graphs we give a different\nproof to establish an upper bound of $9w(G)$ for online coloring a circular arc\ngraph $G$ with the First Fit algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2012 20:17:37 GMT"}, {"version": "v2", "created": "Wed, 4 Dec 2013 14:50:19 GMT"}], "update_date": "2013-12-05", "authors_parsed": [["Lekeas", "Paraskevas V.", ""]]}, {"id": "1211.0303", "submitter": "Yann Ponty", "authors": "Andy Lorenz, Yann Ponty (LIX, INRIA Saclay - Ile de France)", "title": "Non-redundant random generation algorithms for weighted context-free\n  languages", "comments": "arXiv admin note: text overlap with arXiv:1012.4560", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the non-redundant random generation of $k$ words of length $n$ in\na context-free language. Additionally, we want to avoid a predefined set of\nwords. We study a rejection-based approach, whose worst-case time complexity is\nshown to grow exponentially with $k$ for some specifications and in the limit\ncase of a coupon collector. We propose two algorithms respectively based on the\nrecursive method and on an unranking approach. We show how careful\nimplementations of these algorithms allow for a non-redundant generation of $k$\nwords of length $n$ in $\\mathcal{O}(k\\cdot n\\cdot \\log{n})$ arithmetic\noperations, after a precomputation of $\\Theta(n)$ numbers. The overall\ncomplexity is therefore dominated by the generation of $k$ words, and the\nnon-redundancy comes at a negligible cost.\n", "versions": [{"version": "v1", "created": "Thu, 1 Nov 2012 20:33:15 GMT"}], "update_date": "2012-11-05", "authors_parsed": [["Lorenz", "Andy", "", "LIX, INRIA Saclay - Ile de France"], ["Ponty", "Yann", "", "LIX, INRIA Saclay - Ile de France"]]}, {"id": "1211.0331", "submitter": "Shubhangi Saraf", "authors": "Albert Ai, Zeev Dvir, Shubhangi Saraf, Avi Wigderson", "title": "Sylvester-Gallai type theorems for approximate collinearity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CC cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study questions in incidence geometry where the precise position of points\nis `blurry' (e.g. due to noise, inaccuracy or error). Thus lines are replaced\nby narrow tubes, and more generally affine subspaces are replaced by their\nsmall neighborhood. We show that the presence of a sufficiently large number of\napproximately collinear triples in a set of points in d dimensional complex\nspace implies that the points are close to a low dimensional affine subspace.\nThis can be viewed as a stable variant of the Sylvester-Gallai theorem and its\nextensions.\n  Building on the recently found connection between Sylvester-Gallai type\ntheorems and complex Locally Correctable Codes (LCCs), we define the new notion\nof stable LCCs, in which the (local) correction procedure can also handle small\nperturbations in the euclidean metric. We prove that such stable codes with\nconstant query complexity do not exist. No impossibility results were known in\nany such local setting for more than 2 queries.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2012 00:19:26 GMT"}], "update_date": "2012-11-05", "authors_parsed": [["Ai", "Albert", ""], ["Dvir", "Zeev", ""], ["Saraf", "Shubhangi", ""], ["Wigderson", "Avi", ""]]}, {"id": "1211.0463", "submitter": "Ben Seamone", "authors": "Ben Seamone, Brett Stevens", "title": "Sequence variations of the 1-2-3 Conjecture and irregularity strength", "comments": "Accepted to Discrete Mathematics and Theoretical Computer Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Karonski, Luczak, and Thomason (2004) conjectured that, for any connected\ngraph G on at least three vertices, there exists an edge weighting from {1,2,3}\nsuch that adjacent vertices receive different sums of incident edge weights.\nBartnicki, Grytczuk, and Niwcyk (2009) made a stronger conjecture, that each\nedge's weight may be chosen from an arbitrary list of size 3 rather than\n{1,2,3}. We examine a variation of these conjectures, where each vertex is\ncoloured with a sequence of edge weights. Such a colouring relies on an\nordering of the graph's edges, and so two variations arise -- one where we may\nchoose any ordering of the edges and one where the ordering is fixed. In the\nformer case, we bound the list size required for any graph. In the latter, we\nobtain a bound on list sizes for graphs with sufficiently large minimum degree.\nWe also extend our methods to a list variation of irregularity strength, where\neach vertex receives a distinct sequence of edge weights.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2012 14:55:40 GMT"}], "update_date": "2012-11-22", "authors_parsed": [["Seamone", "Ben", ""], ["Stevens", "Brett", ""]]}, {"id": "1211.0515", "submitter": "Po-Shen Loh", "authors": "Jennifer Iglesias, Nathaniel Ince, Po-Shen Loh", "title": "Computing with voting trees", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The classical paradox of social choice theory asserts that there is no fair\nway to deterministically select a winner in an election among more than two\ncandidates; the only definite collective preferences are between individual\npairs of candidates. Combinatorially, one may summarize this information with a\ngraph-theoretic tournament on N vertices (one per candidate), placing an edge\nfrom U to V if U would beat V in an election between only those two candidates\n(no ties are permitted). One well-studied procedure for selecting a winner is\nto specify a complete binary tree whose leaves are labeled by the candidates,\nand evaluate it by running pairwise elections between the pairs of leaves,\nsending the winners to successive rounds of pairwise elections which ultimately\nterminate with a single winner. This structure is called a voting tree.\n  Much research has investigated which functions on tournaments are computable\nin this way. Fischer, Procaccia, and Samorodnitsky quantitatively studied the\ncomputability of the Copeland rule, which returns a vertex of maximum\nout-degree in the given tournament. Perhaps surprisingly, the best previously\nknown voting tree could only guarantee a returned out-degree of at least log_2\nN, despite the fact that every tournament has a vertex of degree at least\n(N-1)/2. In this paper, we present three constructions, the first of which\nsubstantially improves this guarantee to \\Theta(sqrt{N}). The other two\ndemonstrate the richness of the voting tree universe, with a tree that resists\nmanipulation, and a tree which implements arithmetic modulo three.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2012 18:31:03 GMT"}], "update_date": "2012-11-05", "authors_parsed": [["Iglesias", "Jennifer", ""], ["Ince", "Nathaniel", ""], ["Loh", "Po-Shen", ""]]}, {"id": "1211.0524", "submitter": "Michael Lampis", "authors": "Michael Lampis", "title": "Local Improvement Gives Better Expanders", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has long been known that random regular graphs are with high probability\ngood expanders. This was first established in the 1980s by Bollob\\'as by\ndirectly calculating the probability that a set of vertices has small expansion\nand then applying the union bound.\n  In this paper we improve on this analysis by relying on a simple high-level\nobservation: if a graph contains a set of vertices with small expansion then it\nmust also contain such a set of vertices that is locally optimal, that is, a\nset whose expansion cannot be made smaller by exchanging a vertex from the set\nwith one from the set's complement. We show that the probability that a set of\nvertices satisfies this additional property is significantly smaller. Thus,\nafter again applying the union bound, we obtain improved lower bounds on the\nexpansion of random $\\Delta$-regular graphs for $\\Delta\\ge 4$. In fact, the\ngains from this analysis increase as $\\Delta$ grows, a fact we explain by\nextending our technique to general $\\Delta$. Thus, in the end we obtain an\nimprovement not only for some small special cases but on the general asymptotic\nbound on the expansion of $\\Delta$-regular graphs given by Bollob\\'as.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2012 19:09:52 GMT"}], "update_date": "2012-11-05", "authors_parsed": [["Lampis", "Michael", ""]]}, {"id": "1211.0589", "submitter": "Shayan Oveis Gharan", "authors": "Russell Lyons and Shayan Oveis Gharan", "title": "Sharp Bounds on Random Walk Eigenvalues via Spectral Embedding", "comments": null, "journal-ref": "IMRN (2017), rnx082", "doi": null, "report-no": null, "categories": "math.PR cs.DM cs.DS math.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spectral embedding of graphs uses the top k non-trivial eigenvectors of the\nrandom walk matrix to embed the graph into R^k. The primary use of this\nembedding has been for practical spectral clustering algorithms [SM00,NJW02].\nRecently, spectral embedding was studied from a theoretical perspective to\nprove higher order variants of Cheeger's inequality [LOT12,LRTV12].\n  We use spectral embedding to provide a unifying framework for bounding all\nthe eigenvalues of graphs. For example, we show that for any finite graph with\nn vertices and all k >= 2, the k-th largest eigenvalue is at most\n1-Omega(k^3/n^3), which extends the only other such result known, which is for\nk=2 only and is due to [LO81]. This upper bound improves to 1-Omega(k^2/n^2) if\nthe graph is regular. We generalize these results, and we provide sharp bounds\non the spectral measure of various classes of graphs, including\nvertex-transitive graphs and infinite graphs, in terms of specific graph\nparameters like the volume growth.\n  As a consequence, using the entire spectrum, we provide (improved) upper\nbounds on the return probabilities and mixing time of random walks with\nconsiderably shorter and more direct proofs. Our work introduces spectral\nembedding as a new tool in analyzing reversible Markov chains. Furthermore,\nbuilding on [Lyo05], we design a local algorithm to approximate the number of\nspanning trees of massive graphs.\n", "versions": [{"version": "v1", "created": "Sat, 3 Nov 2012 02:03:41 GMT"}, {"version": "v2", "created": "Mon, 15 Aug 2016 01:45:36 GMT"}, {"version": "v3", "created": "Fri, 13 Jan 2017 20:42:13 GMT"}], "update_date": "2018-09-10", "authors_parsed": [["Lyons", "Russell", ""], ["Gharan", "Shayan Oveis", ""]]}, {"id": "1211.0654", "submitter": "Elie Adam", "authors": "Elie M. Adam, Munther A. Dahleh and Asuman Ozdaglar", "title": "On Threshold Models over Finite Networks", "comments": "49 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a model for cascade effects over finite networks based on a\ndeterministic binary linear threshold model. Our starting point is a networked\ncoordination game where each agent's payoff is the sum of the payoffs coming\nfrom pairwise interactions with each of the neighbors. We first establish that\nthe best response dynamics in this networked game is equivalent to the linear\nthreshold dynamics with heterogeneous thresholds over the agents. While the\nprevious literature has studied such linear threshold models under the\nassumption that each agent may change actions at most once, a study of best\nresponse dynamics in such networked games necessitates an analysis that allows\nfor multiple switches in actions. In this paper, we develop such an analysis\nand construct a combinatorial framework to understand the behavior of the\nmodel. To this end, we establish that the agents behavior cycles among\ndifferent actions in the limit and provide three sets of results.\n  We first characterize the limiting behavioral properties of the dynamics. We\ndetermine the length of the limit cycles and reveal bounds on the time steps\nrequired to reach such cycles for different network structures. We then study\nthe complexity of decision/counting problems that arise within the context.\nSpecifically, we consider the tractability of counting the number of limit\ncycles and fixed-points, and deciding the reachability of action profiles. We\nfinally propose a measure of network resilience that captures the nature of the\ninvolved dynamics. We prove bounds and investigate the resilience of different\nnetwork structures under this measure.\n", "versions": [{"version": "v1", "created": "Sun, 4 Nov 2012 00:35:44 GMT"}, {"version": "v2", "created": "Thu, 3 Jan 2013 01:55:54 GMT"}], "update_date": "2013-01-04", "authors_parsed": [["Adam", "Elie M.", ""], ["Dahleh", "Munther A.", ""], ["Ozdaglar", "Asuman", ""]]}, {"id": "1211.0750", "submitter": "Oliver Knill", "authors": "Frank Josellis and Oliver Knill", "title": "The Lusternik-Schnirelmann theorem for graphs", "comments": "29 pages, 7 figures. Main results unchanged but cat(G) had not yet\n  been homotopy invariant. 3 more references, smaller typos and a figure\n  correction", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AT cs.DM math.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove the discrete Lusternik-Schnirelmann theorem telling that tcat(G)\nless or equal to crit(G) for a general simple graph G=(V,E). It relates the\nminimal number tcat(G) of in G contractible graphs covering G, with crit(G),\nthe minimal number of critical points which an injective function f on the\nvertex set V can have. We also prove that the cup length cup(G) is less or\nequal to tcat(G) which is valid also for any finite simple graph. If cat(G) is\nthe minimal tcat(H) among all graphs H homotopic to G and cri(G) is the minimal\ncrit(H) among all graphs H homotopic to G, we get a relation between three\nhomotopy invariants: an algebraic quantity (cup), a topological quantity (cat)\nand an analytic quantity (cri).\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2012 03:10:25 GMT"}, {"version": "v2", "created": "Wed, 14 Nov 2012 03:57:10 GMT"}], "update_date": "2012-11-15", "authors_parsed": [["Josellis", "Frank", ""], ["Knill", "Oliver", ""]]}, {"id": "1211.0752", "submitter": "Cheng Wang", "authors": "Cheng Wang", "title": "Faster Approximation of Max Flow for Directed Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I extend the methods in \"Electrical Flows, Laplacian Systems, and Faster\nApproximation of Maximum Flow in Undirected Graphs, with Paul Christiano,\nJonathan Kelner, Daniel Spielman, and Shang-Hua Teng\" to directed graphs with a\nvariation of the framework in the paper, which lead to an algorithm that\napproximately solves the directed max flow problem in nearly-linear time.\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2012 03:34:45 GMT"}, {"version": "v2", "created": "Sun, 18 Nov 2012 02:58:59 GMT"}], "update_date": "2012-11-20", "authors_parsed": [["Wang", "Cheng", ""]]}, {"id": "1211.0895", "submitter": "Maria Bras-Amor\\'os", "authors": "Maria Bras-Amor\\'os, Pedro A. Garc\\'ia-S\\'anchez, Albert Vico-Oton", "title": "Nonhomogeneous patterns on numerical semigroups", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.DM math.AC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Patterns on numerical semigroups are multivariate linear polynomials, and\nthey are said to be admissible if there exists a numerical semigroup such that\nevaluated at any nonincreasing sequence of elements of the semigroup gives\nintegers belonging to the semigroup. In a first approach, only homogeneous\npatterns where analized. In this contribution we study conditions for an\neventually non-homogeneous pattern to be admissible, and particularize this\nstudy to the case the independent term of the pattern is a multiple of the\nmultiplicity of the semigroup. Moreover, for the so called strongly admissible\npatterns, the set of numerical semigroups admitting these patterns with fixed\nmultiplicity $m$ form an $m$-variety, which allows us to represent this set in\na tree and to describe minimal sets of generators of the semigroups in the\nvariety with respect to the pattern. Furthermore, we characterize strongly\nadmissible patterns having a finite associated tree.\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2012 15:44:27 GMT"}], "update_date": "2012-11-06", "authors_parsed": [["Bras-Amorós", "Maria", ""], ["García-Sánchez", "Pedro A.", ""], ["Vico-Oton", "Albert", ""]]}, {"id": "1211.1299", "submitter": "Ren\\'e van Bevern", "authors": "Ren\\'e van Bevern, Rodney G. Downey, Michael R. Fellows, Serge\n  Gaspers, Frances A. Rosamond", "title": "Myhill-Nerode methods for hypergraphs", "comments": "A preliminary version of this article appeared in the proceedings of\n  ISAAC 2013. This extended and revised version contains the full proof\n  details, more figures, and corollaries to make the application of the\n  Myhill-Nerode theorem for hypergraphs easier in an algorithmic setting.\n  Moreover, it provides a fix to the proof of the Myhill-Nerode theorem for\n  graphs in the books of Downey and Fellows", "journal-ref": "Algorithmica 73(4):696-729, 2015", "doi": "10.1007/s00453-015-9977-x", "report-no": null, "categories": "cs.DM cs.DS cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give an analog of the Myhill-Nerode methods from formal language theory\nfor hypergraphs and use it to derive the following results for two NP-hard\nhypergraph problems:\n  * We provide an algorithm for testing whether a hypergraph has cutwidth at\nmost k that runs in linear time for constant k. In terms of parameterized\ncomplexity theory, the problem is fixed-parameter linear parameterized by k.\n  * We show that it is not expressible in monadic second-order logic whether a\nhypergraph has bounded (fractional, generalized) hypertree width. The proof\nleads us to conjecture that, in terms of parameterized complexity theory, these\nproblems are W[1]-hard parameterized by the incidence treewidth (the treewidth\nof the incidence graph).\n  Thus, in the form of the Myhill-Nerode theorem for hypergraphs, we obtain a\nmethod to derive linear-time algorithms and to obtain indicators for\nintractability for hypergraph problems parameterized by incidence treewidth.\n  In an appendix, we point out an error and a fix to the proof of the\nMyhill-Nerode theorem for graphs in Downey and Fellow's book on parameterized\ncomplexity.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2012 16:36:55 GMT"}, {"version": "v2", "created": "Tue, 23 Apr 2013 15:26:06 GMT"}, {"version": "v3", "created": "Thu, 25 Jul 2013 09:06:54 GMT"}, {"version": "v4", "created": "Wed, 5 Feb 2014 19:58:02 GMT"}, {"version": "v5", "created": "Tue, 6 Jan 2015 15:25:36 GMT"}], "update_date": "2016-01-12", "authors_parsed": [["van Bevern", "René", ""], ["Downey", "Rodney G.", ""], ["Fellows", "Michael R.", ""], ["Gaspers", "Serge", ""], ["Rosamond", "Frances A.", ""]]}, {"id": "1211.1301", "submitter": "Jeffrey Shallit", "authors": "Daniel Goc, Hamoon Mousavi, Jeffrey Shallit", "title": "On the Number of Unbordered Factors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We illustrate a general technique for enumerating factors of k-automatic\nsequences by proving a conjecture on the number f(n) of unbordered factors of\nthe Thue-Morse sequence. We show that f(n) <= n for n >= 4 and that f(n) = n\ninfinitely often. We also give examples of automatic sequences having exactly 2\nunbordered factors of every length.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2012 16:38:02 GMT"}], "update_date": "2012-11-07", "authors_parsed": [["Goc", "Daniel", ""], ["Mousavi", "Hamoon", ""], ["Shallit", "Jeffrey", ""]]}, {"id": "1211.1319", "submitter": "L\\'aszl\\'o Kozma", "authors": "Laszlo Kozma, Shay Moran", "title": "Shattering, Graph Orientations, and Connectivity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a connection between two seemingly disparate fields: VC-theory and\ngraph theory. This connection yields natural correspondences between\nfundamental concepts in VC-theory, such as shattering and VC-dimension, and\nwell-studied concepts of graph theory related to connectivity, combinatorial\noptimization, forbidden subgraphs, and others.\n  In one direction, we use this connection to derive results in graph theory.\nOur main tool is a generalization of the Sauer-Shelah Lemma. Using this tool we\nobtain a series of inequalities and equalities related to properties of\norientations of a graph. Some of these results appear to be new, for others we\ngive new and simple proofs.\n  In the other direction, we present new illustrative examples of\nshattering-extremal systems - a class of set-systems in VC-theory whose\nunderstanding is considered by some authors to be incomplete. These examples\nare derived from properties of orientations related to distances and flows in\nnetworks.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2012 17:36:15 GMT"}], "update_date": "2012-11-07", "authors_parsed": [["Kozma", "Laszlo", ""], ["Moran", "Shay", ""]]}, {"id": "1211.1343", "submitter": "Nicolas Broutin", "authors": "Nicolas Broutin, Henning Sulzbach", "title": "The dual tree of a recursive triangulation of the disk", "comments": "Published in at http://dx.doi.org/10.1214/13-AOP894 the Annals of\n  Probability (http://www.imstat.org/aop/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Annals of Probability 2015, Vol. 43, 738-781", "doi": "10.1214/13-AOP894", "report-no": "IMS-AOP-AOP894", "categories": "math.PR cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the recursive lamination of the disk, one tries to add chords one after\nanother at random; a chord is kept and inserted if it does not intersect any of\nthe previously inserted ones. Curien and Le Gall [Ann. Probab. 39 (2011)\n2224-2270] have proved that the set of chords converges to a limit\ntriangulation of the disk encoded by a continuous process $\\mathscr{M}$. Based\non a new approach resembling ideas from the so-called contraction method in\nfunction spaces, we prove that, when properly rescaled, the planar dual of the\ndiscrete lamination converges almost surely in the Gromov-Hausdorff sense to a\nlimit real tree $\\mathscr{T}$, which is encoded by $\\mathscr{M}$. This confirms\na conjecture of Curien and Le Gall.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2012 18:31:12 GMT"}, {"version": "v2", "created": "Wed, 7 Nov 2012 06:49:54 GMT"}, {"version": "v3", "created": "Mon, 7 Oct 2013 19:21:09 GMT"}, {"version": "v4", "created": "Tue, 17 Mar 2015 08:21:15 GMT"}], "update_date": "2015-03-18", "authors_parsed": [["Broutin", "Nicolas", ""], ["Sulzbach", "Henning", ""]]}, {"id": "1211.1410", "submitter": "Andrew King", "authors": "Andrew D. King and Bruce A. Reed", "title": "A short proof that $\\chi$ can be bounded $\\epsilon$ away from $\\Delta+1$\n  towards $\\omega$", "comments": "10 pages. arXiv admin note: text overlap with arXiv:0911.1741", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 1998 the second author proved that there is an $\\epsilon>0$ such that\nevery graph satisfies $\\chi \\leq \\lceil\n(1-\\epsilon)(\\Delta+1)+\\epsilon\\omega\\rceil$. The first author recently proved\nthat any graph satisfying $\\omega > \\frac 23(\\Delta+1)$ contains a stable set\nintersecting every maximum clique. In this note we exploit the latter result to\ngive a much shorter, simpler proof of the former. We include, as a certificate\nof simplicity, an appendix that proves all intermediate results with the\nexception of Hall's Theorem, Brooks' Theorem, the Lov\\'asz Local Lemma, and\nTalagrand's Inequality.\n", "versions": [{"version": "v1", "created": "Tue, 6 Nov 2012 22:02:27 GMT"}], "update_date": "2012-11-08", "authors_parsed": [["King", "Andrew D.", ""], ["Reed", "Bruce A.", ""]]}, {"id": "1211.1442", "submitter": "Federico Ardila", "authors": "Federico Ardila, Tia Baker, Rika Yatchak", "title": "Moving robots efficiently using the combinatorics of CAT(0) cubical\n  complexes", "comments": "25 pages, 19 figures. (Version 2 incorporates minor changes.)", "journal-ref": "SIAM J. Discrete Math. 28(2) (2014) 986-1007", "doi": null, "report-no": null, "categories": "math.CO cs.CG cs.DM math.MG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a reconfigurable system X, such as a robot moving on a grid or a set of\nparticles traversing a graph without colliding, the possible positions of X\nnaturally form a cubical complex S(X). When S(X) is a CAT(0) space, we can\nexplicitly construct the shortest path between any two points, for any of the\nfour most natural metrics: distance, time, number of moves, and number of steps\nof simultaneous moves.\n  CAT(0) cubical complexes are in correspondence with posets with inconsistent\npairs (PIPs), so we can prove that a state complex S(X) is CAT(0) by\nidentifying the corresponding PIP. We illustrate this very general strategy\nwith one known and one new example: Abrams and Ghrist's positive robotic arm on\na square grid, and the robotic arm in a strip. We then use the PIP as a\ncombinatorial \"remote control\" to move these robots efficiently from one\nposition to another.\n", "versions": [{"version": "v1", "created": "Wed, 7 Nov 2012 03:34:44 GMT"}, {"version": "v2", "created": "Wed, 27 Aug 2014 22:40:17 GMT"}], "update_date": "2014-08-29", "authors_parsed": [["Ardila", "Federico", ""], ["Baker", "Tia", ""], ["Yatchak", "Rika", ""]]}, {"id": "1211.1467", "submitter": "Dan Vilenchik", "authors": "Michael Langberg and Dan Vilenchik", "title": "Edge distribution in generalized graph products", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.IT math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a graph $G=(V,E)$, an integer $k$, and a function $f_G:V^k \\times V^k\n\\to {0,1}$, the $k^{th}$ graph product of $G$ w.r.t $f_G$ is the graph with\nvertex set $V^k$, and an edge between two vertices $x=(x_1,...,x_k)$ and\n$y=(y_1,...,y_k)$ iff $f_G(x,y)=1$. Graph products are a basic combinatorial\nobject, widely studied and used in different areas such as hardness of\napproximation, information theory, etc. We study graph products for functions\n$f_G$ of the form $f_G(x,y)=1$ iff there are at least $t$ indices $i \\in [k]$\ns.t. $(x_i,y_i)\\in E$, where $t \\in [k]$ is a fixed parameter in $f_G$. This\nframework generalizes the well-known graph tensor-product (obtained for $t=k$)\nand the graph or-product (obtained for $t=1$). The property that interests us\nis the edge distribution in such graphs. We show that if $G$ has a spectral\ngap, then the number of edges connecting \"large-enough\" sets in $G^k$ is\n\"well-behaved\", namely, it is close to the expected value, had the sets been\nrandom. We extend our results to bi-partite graph products as well. For a\nbi-partite graph $G=(X,Y,E)$, the $k^{th}$ bi-partite graph product of $G$\nw.r.t $f_G$ is the bi-partite graph with vertex sets $X^k$ and $Y^k$ and edges\nbetween $x \\in X^k$ and $y \\in Y^k$ iff $f_G(x,y)=1$. Finally, for both types\nof graph products, optimality is asserted using the \"Converse to the Expander\nMixing Lemma\" obtained by Bilu and Linial in 2006. A byproduct of our proof\ntechnique is a new explicit construction of a family of co-spectral graphs.\n", "versions": [{"version": "v1", "created": "Wed, 7 Nov 2012 06:54:27 GMT"}, {"version": "v2", "created": "Thu, 8 Nov 2012 09:42:56 GMT"}, {"version": "v3", "created": "Thu, 29 Aug 2013 14:05:48 GMT"}, {"version": "v4", "created": "Wed, 4 Sep 2013 13:59:53 GMT"}], "update_date": "2013-09-05", "authors_parsed": [["Langberg", "Michael", ""], ["Vilenchik", "Dan", ""]]}, {"id": "1211.1505", "submitter": "Jesper Nederlof", "authors": "Hans L. Bodlaender, Marek Cygan, Stefan Kratsch and Jesper Nederlof", "title": "Solving weighted and counting variants of connectivity problems\n  parameterized by treewidth deterministically in single exponential time", "comments": "36 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known that many local graph problems, like Vertex Cover and\nDominating Set, can be solved in 2^{O(tw)}|V|^{O(1)} time for graphs G=(V,E)\nwith a given tree decomposition of width tw. However, for nonlocal problems,\nlike the fundamental class of connectivity problems, for a long time we did not\nknow how to do this faster than tw^{O(tw)}|V|^{O(1)}. Recently, Cygan et al.\n(FOCS 2011) presented Monte Carlo algorithms for a wide range of connectivity\nproblems running in time $c^{tw}|V|^{O(1)} for a small constant c, e.g., for\nHamiltonian Cycle and Steiner tree. Naturally, this raises the question whether\nrandomization is necessary to achieve this runtime; furthermore, it is\ndesirable to also solve counting and weighted versions (the latter without\nincurring a pseudo-polynomial cost in terms of the weights).\n  We present two new approaches rooted in linear algebra, based on matrix rank\nand determinants, which provide deterministic c^{tw}|V|^{O(1)} time algorithms,\nalso for weighted and counting versions. For example, in this time we can solve\nthe traveling salesman problem or count the number of Hamiltonian cycles. The\nrank-based ideas provide a rather general approach for speeding up even\nstraightforward dynamic programming formulations by identifying \"small\" sets of\nrepresentative partial solutions; we focus on the case of expressing\nconnectivity via sets of partitions, but the essential ideas should have\nfurther applications. The determinant-based approach uses the matrix tree\ntheorem for deriving closed formulas for counting versions of connectivity\nproblems; we show how to evaluate those formulas via dynamic programming.\n", "versions": [{"version": "v1", "created": "Wed, 7 Nov 2012 10:38:52 GMT"}], "update_date": "2012-11-08", "authors_parsed": [["Bodlaender", "Hans L.", ""], ["Cygan", "Marek", ""], ["Kratsch", "Stefan", ""], ["Nederlof", "Jesper", ""]]}, {"id": "1211.1506", "submitter": "Jesper Nederlof", "authors": "Marek Cygan, Stefan Kratsch and Jesper Nederlof", "title": "Fast Hamiltonicity checking via bases of perfect matchings", "comments": "39 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For an even integer t \\geq 2, the Matchings Connecivity matrix H_t is a\nmatrix that has rows and columns both labeled by all perfect matchings of the\ncomplete graph K_t on t vertices; an entry H_t[M_1,M_2] is 1 if M_1\\cup M_2 is\na Hamiltonian cycle and 0 otherwise. Motivated by the computational study of\nthe Hamiltonicity problem, we present three results on the structure of H_t: We\nfirst show that H_t has rank at most 2^{t/2-1} over GF(2) via an appropriate\nfactorization that explicitly provides families of matchings X_t forming bases\nfor H_t. Second, we show how to quickly change representation between such\nbases. Third, we notice that the sets of matchings X_t induce permutation\nmatrices within H_t.\n  Subsequently, we use the factorization to obtain an 1.888^n n^{O(1)} time\nMonte Carlo algorithm that solves the Hamiltonicity problem in directed\nbipartite graphs. Our algorithm as well counts the number of Hamiltonian cycles\nmodulo two in directed bipartite or undirected graphs in the same time bound.\nMoreover, we use the fast basis change algorithm from the second result to\npresent a Monte Carlo algorithm that given an undirected graph on n vertices\nalong with a path decomposition of width at most pw decides Hamiltonicity in\n(2+\\sqrt{2})^{pw}n^{O(1)} time. Finally, we use the third result to show that\nfor every \\epsilon >0 this cannot be improved to\n(2+\\sqrt{2}-\\epsilon)^{pw}n^{O(1)} time unless the Strong Exponential Time\nHypothesis fails, i.e., a faster algorithm for this problem would imply the\nbreakthrough result of a (2-\\epsilon)^n time algorithm for CNF-Sat.\n", "versions": [{"version": "v1", "created": "Wed, 7 Nov 2012 10:39:24 GMT"}], "update_date": "2012-11-08", "authors_parsed": [["Cygan", "Marek", ""], ["Kratsch", "Stefan", ""], ["Nederlof", "Jesper", ""]]}, {"id": "1211.1628", "submitter": "Krasimir Yordzhev", "authors": "Krasimir Yankov Yordzhev", "title": "On the Number of Disjoint Pairs of S-permutation Matrices", "comments": "14 pages, 1 figure. arXiv admin note: substantial text overlap with\n  arXiv:1202.0401", "journal-ref": "Discrete Applied Mathematics 161 (2013) 3072-3079", "doi": "10.1016/j.dam.2013.06.007", "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In [Journal of Statistical Planning and Inference (141) (2011) 3697-3704],\nRoberto Fontana offers an algorithm for obtaining Sudoku matrices. Introduced\nby Geir Dahl concept disjoint pairs of S-permutation matrices [Linear Algebra\nand its Applications (430) (2009) 2457-2463] is used in this algorithm.\nAnalyzing the works of G. Dahl and R. Fontana, the question of finding a\ngeneral formula for counting disjoint pairs of $n^2 \\times n^2$ S-permutation\nmatrices as a function of the integer $n$ naturally arises. This is an\ninteresting combinatorial problem that deserves its consideration. The present\nwork solves this problem. To do that, the graph theory techniques have been\nused. It has been shown that to count the number of disjoint pairs of $n^2\n\\times n^2$ S-permutation matrices, it is sufficient to obtain some numerical\ncharacteristics of the set of all bipartite graphs of the type $g=<R_g \\cup\nC_g, E_g>$, where $V=R_g \\cup C_g$ is the set of vertices, and $E_g$ is the set\nof edges of the graph $g$, $R_g \\cap C_g =\\emptyset$, $|R_g|=|C_g|=n$.\n", "versions": [{"version": "v1", "created": "Wed, 7 Nov 2012 18:28:14 GMT"}], "update_date": "2014-04-28", "authors_parsed": [["Yordzhev", "Krasimir Yankov", ""]]}, {"id": "1211.1999", "submitter": "Jonathan Noel", "authors": "Jonathan A. Noel and Bruce A. Reed and Hehui Wu", "title": "A Proof of a Conjecture of Ohba", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove a conjecture of Ohba which says that every graph $G$ on at most\n$2\\chi(G)+1$ vertices satisfies $\\chi_\\ell(G)=\\chi(G)$.\n", "versions": [{"version": "v1", "created": "Thu, 8 Nov 2012 21:48:33 GMT"}, {"version": "v2", "created": "Tue, 4 Feb 2014 13:28:52 GMT"}], "update_date": "2014-02-05", "authors_parsed": [["Noel", "Jonathan A.", ""], ["Reed", "Bruce A.", ""], ["Wu", "Hehui", ""]]}, {"id": "1211.2020", "submitter": "Ruy Fabila-Monroy", "authors": "J. M. D\\'iaz-B\\'a\\~nez, R. Fabila-Monroy, P. P\\'erez-Lantero and I.\n  Ventura", "title": "New results on the coarseness of bicolored point sets", "comments": "Presented at the Mexican Conference on Discrete Mathematics and\n  Computational Geometry 2013, Oaxaca, Mexico", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM math.MG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $S$ be a 2-colored (red and blue) set of $n$ points in the plane. A\nsubset $I$ of $S$ is an island if there exits a convex set $C$ such that\n$I=C\\cap S$. The discrepancy of an island is the absolute value of the number\nof red minus the number of blue points it contains. A convex partition of $S$\nis a partition of $S$ into islands with pairwise disjoint convex hulls. The\ndiscrepancy of a convex partition is the discrepancy of its island of minimum\ndiscrepancy. The coarseness of $S$ is the discrepancy of the convex partition\nof $S$ with maximum discrepancy. This concept was recently defined by Bereg et\nal. [CGTA 2013]. In this paper we study the following problem: Given a set $S$\nof $n$ points in general position in the plane, how to color each of them (red\nor blue) such that the resulting 2-colored point set has small coarseness? We\nprove that every $n$-point set $S$ can be colored such that its coarseness is\n$O(n^{1/4}\\sqrt{\\log n})$. This bound is almost tight since there exist\n$n$-point sets such that every 2-coloring gives coarseness at least\n$\\Omega(n^{1/4})$. Additionally, we show that there exists an approximation\nalgorithm for computing the coarseness of a 2-colored point set, whose ratio is\nbetween $1/128$ and $1/64$, solving an open problem posted by Bereg et al.\n[CGTA 2013]. All our results consider $k$-separable islands of $S$, for some\n$k$, which are those resulting from intersecting $S$ with at most $k$\nhalfplanes.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2012 00:54:29 GMT"}, {"version": "v2", "created": "Fri, 29 Nov 2013 10:57:53 GMT"}], "update_date": "2013-12-02", "authors_parsed": [["Díaz-Báñez", "J. M.", ""], ["Fabila-Monroy", "R.", ""], ["Pérez-Lantero", "P.", ""], ["Ventura", "I.", ""]]}, {"id": "1211.2151", "submitter": "Aaron Dutle", "authors": "Aaron Dutle and Bill Kay", "title": "Graph Odometry", "comments": "14 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address problem of determining edge weights on a graph using\nnon-backtracking closed walks from a vertex. We show that the weights of all of\nthe edges can be determined from any starting vertex exactly when the graph has\nminimum degree at least three. We also determine the minimum number of walks\nrequired to reveal all edge weights.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2012 14:59:43 GMT"}], "update_date": "2012-11-12", "authors_parsed": [["Dutle", "Aaron", ""], ["Kay", "Bill", ""]]}, {"id": "1211.2169", "submitter": "Agnes Cseh", "authors": "Agnes Cseh, Martin Skutella", "title": "Paths to stable allocations", "comments": "28 pages, it is the full version of the paper with the same title\n  appeared at SAGT14", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The stable allocation problem is one of the broadest extensions of the\nwell-known stable marriage problem. In an allocation problem, edges of a\nbipartite graph have capacities and vertices have quotas to fill. Here we\ninvestigate the case of uncoordinated processes in stable allocation instances.\nIn this setting, a feasible allocation is given and the aim is to reach a\nstable allocation by raising the value of the allocation along blocking edges\nand reducing it on worse edges if needed. Do such myopic changes lead to a\nstable solution?\n  In our present work, we analyze both better and best response dynamics from\nan algorithmic point of view. With the help of two deterministic algorithms we\nshow that random procedures reach a stable solution with probability one for\nall rational input data in both cases. Surprisingly, while there is a\npolynomial path to stability when better response strategies are played (even\nfor irrational input data), the more intuitive best response steps may require\nexponential time. We also study the special case of correlated markets. There,\nrandom best response strategies lead to a stable allocation in expected\npolynomial time.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2012 16:05:57 GMT"}, {"version": "v2", "created": "Fri, 11 Jul 2014 19:40:59 GMT"}], "update_date": "2014-07-14", "authors_parsed": [["Cseh", "Agnes", ""], ["Skutella", "Martin", ""]]}, {"id": "1211.2177", "submitter": "Jannik Matuschke", "authors": "Jan-Philipp W. Kappmeier, Jannik Matuschke, Britta Peis", "title": "Abstract flows over time: A first step towards solving dynamic packing\n  problems", "comments": "ISAAC 2012 001-2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flows over time generalize classical network flows by introducing a notion of\ntime. Each arc is equipped with a transit time that specifies how long flow\ntakes to traverse it, while flow rates may vary over time within the given edge\ncapacities. In this paper, we extend this concept of a dynamic optimization\nproblem to the more general setting of abstract flows. In this model, the\nunderlying network is replaced by an abstract system of linearly ordered sets,\ncalled \"paths\" satisfying a simple switching property: Whenever two paths P and\nQ intersect, there must be another path that is contained in the beginning of P\nand the end of Q.\n  We show that a maximum abstract flow over time can be obtained by solving a\nweighted abstract flow problem and constructing a temporally repeated flow from\nits solution. In the course of the proof, we also show that the relatively\nmodest switching property of abstract networks already captures many essential\nproperties of classical networks.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2012 16:19:13 GMT"}, {"version": "v2", "created": "Mon, 12 Nov 2012 12:20:50 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Kappmeier", "Jan-Philipp W.", ""], ["Matuschke", "Jannik", ""], ["Peis", "Britta", ""]]}, {"id": "1211.2189", "submitter": "Jannik Matuschke", "authors": "Jannik Matuschke and Britta Peis", "title": "Lattices and maximum flow algorithms in planar graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the left/right relation on the set of s-t-paths of a plane graph\ninduces a so-called submodular lattice. If the embedding of the graph is\ns-t-planar, this lattice is even consecutive. This implies that Ford and\nFulkerson's uppermost path algorithm for maximum flow in such graphs is indeed\na special case of a two-phase greedy algorithm on lattice polyhedra. We also\nshow that the properties submodularity and consecutivity cannot be achieved\nsimultaneously by any partial order on the paths if the graph is planar but not\ns-t-planar, thus providing a characterization of this class of graphs.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2012 17:02:11 GMT"}], "update_date": "2012-11-12", "authors_parsed": [["Matuschke", "Jannik", ""], ["Peis", "Britta", ""]]}, {"id": "1211.2251", "submitter": "Pietro Codara", "authors": "Pietro Codara, Ottavio M. D'Antona", "title": "Independent subsets of powers of paths, and Fibonacci cubes", "comments": "Preprint submitted to Electronic Notes in Discrete Mathematics", "journal-ref": "Electronic Notes in Discrete Mathematics 40 (2013) 65-69", "doi": "10.1016/j.endm.2013.05.013", "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a formula for the number of edges of the Hasse diagram of the\nindependent subsets of the h-th power of a path ordered by inclusion. For h=1\nsuch a value is the number of edges of a Fibonacci cube. We show that, in\ngeneral, the number of edges of the diagram is obtained by convolution of a\nFibonacci-like sequence with itself.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2012 21:30:06 GMT"}], "update_date": "2014-01-22", "authors_parsed": [["Codara", "Pietro", ""], ["D'Antona", "Ottavio M.", ""]]}, {"id": "1211.2365", "submitter": "Sylvester Eriksson-Bique", "authors": "Sylvester Eriksson-Bique (University of Washington and University of\n  Helsinki) and David Kirkpatrick (University of British Columbia) and Valentin\n  Polishchuk (University of Helsinki)", "title": "Discrete Dubins Paths", "comments": "26 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CG math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Dubins path is a shortest path with bounded curvature. The seminal result\nin non-holonomic motion planning is that (in the absence of obstacles) a Dubins\npath consists either from a circular arc followed by a segment followed by\nanother arc, or from three circular arcs [Dubins, 1957]. Dubins original proof\nuses advanced calculus; later, Dubins result was reproved using control theory\ntechniques [Reeds and Shepp, 1990], [Sussmann and Tang, 1991], [Boissonnat,\nC\\'er\\'ezo, and Leblond, 1994].\n  We introduce and study a discrete analogue of curvature-constrained motion.\nWe show that shortest \"bounded-curvature\" polygonal paths have the same\nstructure as Dubins paths. The properties of Dubins paths follow from our\nresults as a limiting case---this gives a new, \"discrete\" proof of Dubins\nresult.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 01:45:17 GMT"}], "update_date": "2012-11-14", "authors_parsed": [["Eriksson-Bique", "Sylvester", "", "University of Washington and University of\n  Helsinki"], ["Kirkpatrick", "David", "", "University of British Columbia"], ["Polishchuk", "Valentin", "", "University of Helsinki"]]}, {"id": "1211.2376", "submitter": "Piyush Srivastava", "authors": "Alistair Sinclair, Piyush Srivastava", "title": "Lee-Yang theorems and the complexity of computing averages", "comments": "30 pages, 3 figures. This version adds definitions of\n  complexity-theoretic terms", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cond-mat.stat-mech cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the complexity of computing average quantities related to spin\nsystems, such as the mean magnetization and susceptibility in the ferromagnetic\nIsing model, and the average dimer count (or average size of a matching) in the\nmonomer-dimer model. By establishing connections between the complexity of\ncomputing these averages and the location of the complex zeros of the partition\nfunction, we show that these averages are #P-hard to compute. In case of the\nIsing model, our approach requires us to prove an extension of the famous\nLee-Yang Theorem from the 1950s.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 07:05:39 GMT"}, {"version": "v2", "created": "Wed, 6 Mar 2013 04:19:44 GMT"}], "update_date": "2013-03-07", "authors_parsed": [["Sinclair", "Alistair", ""], ["Srivastava", "Piyush", ""]]}, {"id": "1211.2662", "submitter": "Arash Rafiey", "authors": "Arash Rafiey", "title": "Recognizing Interval Bigraphs by Forbidden Patterns", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let H be a connected bipartite graph with n nodes and m edges. We give an\nO(nm) time algorithm to decide whether H is an interval bigraph. The best known\nalgorithm has time complexity O(nm^6(m + n) \\log n) and it was developed in\n1997 [18]. Our approach is based on an ordering characterization of interval\nbigraphs introduced by Hell and Huang [13]. We transform the problem of finding\nthe desired ordering to choosing strong components of a pair-digraph without\ncreating conflicts. We make use of the structure of the pair-digraph as well as\ndecomposition of bigraph H based on the special components of the pair-digraph.\nThis way we make explicit what the difficult cases are and gain efficiency by\nisolating such situations.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2012 15:38:44 GMT"}, {"version": "v2", "created": "Wed, 4 Dec 2013 01:24:15 GMT"}, {"version": "v3", "created": "Tue, 2 Feb 2016 02:37:29 GMT"}, {"version": "v4", "created": "Sat, 19 May 2018 06:16:15 GMT"}], "update_date": "2018-05-22", "authors_parsed": [["Rafiey", "Arash", ""]]}, {"id": "1211.2734", "submitter": "Jasine Babu", "authors": "Jasine Babu, Ahmad Biniaz, Anil Maheshwari, Michiel Smid", "title": "Fixed-Orientation Equilateral Triangle Matching of Point Sets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a point set $P$ and a class $\\mathcal{C}$ of geometric objects,\n$G_\\mathcal{C}(P)$ is a geometric graph with vertex set $P$ such that any two\nvertices $p$ and $q$ are adjacent if and only if there is some $C \\in\n\\mathcal{C}$ containing both $p$ and $q$ but no other points from $P$. We study\n$G_{\\bigtriangledown}(P)$ graphs where $\\bigtriangledown$ is the class of\ndownward equilateral triangles (ie. equilateral triangles with one of their\nsides parallel to the x-axis and the corner opposite to this side below that\nside). For point sets in general position, these graphs have been shown to be\nequivalent to half-$\\Theta_6$ graphs and TD-Delaunay graphs.\n  The main result in our paper is that for point sets $P$ in general position,\n$G_{\\bigtriangledown}(P)$ always contains a matching of size at least\n$\\lceil\\frac{n-2}{3}\\rceil$ and this bound cannot be improved above\n$\\lceil\\frac{n-1}{3}\\rceil$.\n  We also give some structural properties of $G_{\\davidsstar}(P)$ graphs, where\n$\\davidsstar$ is the class which contains both upward and downward equilateral\ntriangles. We show that for point sets in general position, the block cut point\ngraph of $G_{\\davidsstar}(P)$ is simply a path. Through the equivalence of\n$G_{\\davidsstar}(P)$ graphs with $\\Theta_6$ graphs, we also derive that any\n$\\Theta_6$ graph can have at most $5n-11$ edges, for point sets in general\nposition.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2012 19:02:06 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Babu", "Jasine", ""], ["Biniaz", "Ahmad", ""], ["Maheshwari", "Anil", ""], ["Smid", "Michiel", ""]]}, {"id": "1211.2926", "submitter": "M. Oguzhan Kulekci", "authors": "M. Oguzhan Kulekci", "title": "Enumeration of sequences with large alphabets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study focuses on efficient schemes for enumerative coding of\n$\\sigma$--ary sequences by mainly borrowing ideas from \\\"Oktem & Astola's\n\\cite{Oktem99} hierarchical enumerative coding and Schalkwijk's\n\\cite{Schalkwijk72} asymptotically optimal combinatorial code on binary\nsequences. By observing that the number of distinct $\\sigma$--dimensional\nvectors having an inner sum of $n$, where the values in each dimension are in\nrange $[0...n]$ is $K(\\sigma,n) = \\sum_{i=0}^{\\sigma-1} {{n-1} \\choose\n{\\sigma-1-i}} {{\\sigma} \\choose {i}}$, we propose representing $C$ vector via\nenumeration, and present necessary algorithms to perform this task. We prove\n$\\log K(\\sigma,n)$ requires approximately $ (\\sigma -1) \\log (\\sigma-1) $ less\nbits than the naive $(\\sigma-1)\\lceil \\log (n+1) \\rceil$ representation for\nrelatively large $n$, and examine the results for varying alphabet sizes\nexperimentally. We extend the basic scheme for the enumerative coding of\n$\\sigma$--ary sequences by introducing a new method for large alphabets. We\nexperimentally show that the newly introduced technique is superior to the\nbasic scheme by providing experiments on DNA sequences.\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2012 09:30:08 GMT"}], "update_date": "2012-11-14", "authors_parsed": [["Kulekci", "M. Oguzhan", ""]]}, {"id": "1211.2980", "submitter": "Shay Moran", "authors": "Shay Moran", "title": "Shattering-Extremal Systems", "comments": "42 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG cs.DM cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Shatters relation and the VC dimension have been investigated since the\nearly seventies. These concepts have found numerous applications in statistics,\ncombinatorics, learning theory and computational geometry. Shattering extremal\nsystems are set-systems with a very rich structure and many different\ncharacterizations. The goal of this thesis is to elaborate on the structure of\nthese systems.\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2012 13:16:48 GMT"}], "update_date": "2012-11-14", "authors_parsed": [["Moran", "Shay", ""]]}, {"id": "1211.3000", "submitter": "Daniel Gerbner", "authors": "D\\'aniel Gerbner, Bal\\'azs Keszegh, D\\\"om\\\"ot\\\"or P\\'alv\\\"olgyi,\n  G\\\"unter Rote, G\\'abor Wiener", "title": "Search for the end of a path in the d-dimensional grid and in other\n  graphs", "comments": null, "journal-ref": "Ars Mathematica Contemporanea 12 (no. 2) (2017), 301-314", "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the worst-case query complexity of some variants of certain\n\\cl{PPAD}-complete search problems. Suppose we are given a graph $G$ and a\nvertex $s \\in V(G)$. We denote the directed graph obtained from $G$ by\ndirecting all edges in both directions by $G'$. $D$ is a directed subgraph of\n$G'$ which is unknown to us, except that it consists of vertex-disjoint\ndirected paths and cycles and one of the paths originates in $s$. Our goal is\nto find an endvertex of a path by using as few queries as possible. A query\nspecifies a vertex $v\\in V(G)$, and the answer is the set of the edges of $D$\nincident to $v$, together with their directions. We also show lower bounds for\nthe special case when $D$ consists of a single path. Our proofs use the theory\nof graph separators. Finally, we consider the case when the graph $G$ is a grid\ngraph. In this case, using the connection with separators, we give\nasymptotically tight bounds as a function of the size of the grid, if the\ndimension of the grid is considered as fixed. In order to do this, we prove a\nseparator theorem about grid graphs, which is interesting on its own right.\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2012 14:31:47 GMT"}, {"version": "v2", "created": "Thu, 1 Sep 2016 11:43:31 GMT"}], "update_date": "2017-07-28", "authors_parsed": [["Gerbner", "Dániel", ""], ["Keszegh", "Balázs", ""], ["Pálvölgyi", "Dömötör", ""], ["Rote", "Günter", ""], ["Wiener", "Gábor", ""]]}, {"id": "1211.3049", "submitter": "Alessandro De Luca", "authors": "Michelangelo Bucci, Alessandro De Luca, Luca Q. Zamboni", "title": "Reversible Christoffel factorizations", "comments": "12 pages, submitted. Previous draft presented at RuFiDiM 2011", "journal-ref": "Theoretical Computer Science 495 (2013) 17-24", "doi": "10.1016/j.tcs.2013.05.042", "report-no": null, "categories": "cs.DM cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a family of natural decompositions of Sturmian words in Christoffel\nwords, called *reversible Christoffel* (RC) factorizations. They arise from the\nobservation that two Sturmian words with the same language have (almost always)\narbitrarily long Abelian equivalent prefixes. Using the three gap theorem, we\nprove that in each RC factorization, only 2 or 3 distinct Christoffel words may\noccur. We begin the study of such factorizations, considered as infinite words\nover 2 or 3 letters, and show that in the general case they are either Sturmian\nwords, or obtained by a three-interval exchange transformation.\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2012 16:51:28 GMT"}, {"version": "v2", "created": "Thu, 11 Jul 2013 13:48:59 GMT"}], "update_date": "2013-07-12", "authors_parsed": [["Bucci", "Michelangelo", ""], ["De Luca", "Alessandro", ""], ["Zamboni", "Luca Q.", ""]]}, {"id": "1211.3428", "submitter": "Robert Ogden Dr.", "authors": "R. D. Ogden (Computer Science Dept. Texas State University)", "title": "The Encoding of Natural Numbers as Nested Parentheses Strings with\n  Associated Probability Distributions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide an efficient encoding of the natural numbers {0,1,2,3,...} as\nstrings of nested parentheses {(),(()),(()()),((())),...}, or considered\ninversely, an efficient enumeration of such strings. The technique is based on\nthe recursive definition of the Catalan numbers. The probability distributions\narising from this encoding are explored. Applications of this encoding to\nprefix-free data encoding and recursive function theory are briefly considered.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2012 21:10:11 GMT"}], "update_date": "2012-11-16", "authors_parsed": [["Ogden", "R. D.", "", "Computer Science Dept. Texas State University"]]}, {"id": "1211.3487", "submitter": "Jacob Fox", "authors": "David Conlon and Jacob Fox", "title": "Graph removal lemmas", "comments": "35 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The graph removal lemma states that any graph on n vertices with o(n^{v(H)})\ncopies of a fixed graph H may be made H-free by removing o(n^2) edges. Despite\nits innocent appearance, this lemma and its extensions have several important\nconsequences in number theory, discrete geometry, graph theory and computer\nscience. In this survey we discuss these lemmas, focusing in particular on\nrecent improvements to their quantitative aspects.\n", "versions": [{"version": "v1", "created": "Thu, 15 Nov 2012 03:19:36 GMT"}], "update_date": "2012-11-16", "authors_parsed": [["Conlon", "David", ""], ["Fox", "Jacob", ""]]}, {"id": "1211.3812", "submitter": "Li Chen", "authors": "Li M. Chen", "title": "Determining the Number of Holes of a 2D Digital Component is Easy", "comments": "7 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM math.CO", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The number of holes in a connected component in 2D images is a basic\ninvariant. In this note, a simple formula was proven using our previous results\nin digital topology (Chen 2004, Chen and Rong (2010). The new is: $h =1+\n(|C_4|-|C_2|)/4$, where h is the number of holes, and $C_i$ indicate the set of\ncorner points having $i$ direct adjacent points in the component.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2012 07:30:53 GMT"}], "update_date": "2012-11-19", "authors_parsed": [["Chen", "Li M.", ""]]}, {"id": "1211.3929", "submitter": "Yoshio Sano Ph.D.", "authors": "Akihiro Munemasa, Yoshio Sano, and Tetsuji Taniguchi", "title": "Fat Hoffman graphs with smallest eigenvalue greater than -3", "comments": "21+5 pages", "journal-ref": "Discrete Applied Mathematics 176 (2014) 78-88", "doi": "10.1016/j.dam.2014.01.008", "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we give a combinatorial characterization of the special graphs\nof fat Hoffman graphs containing $\\mathfrak{K}_{1,2}$ with smallest eigenvalue\ngreater than -3, where $\\mathfrak{K}_{1,2}$ is the Hoffman graph having one\nslim vertex and two fat vertices.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2012 15:49:59 GMT"}, {"version": "v2", "created": "Fri, 31 May 2013 17:48:12 GMT"}, {"version": "v3", "created": "Wed, 23 Oct 2013 14:50:28 GMT"}, {"version": "v4", "created": "Tue, 24 Dec 2013 00:10:08 GMT"}], "update_date": "2014-08-12", "authors_parsed": [["Munemasa", "Akihiro", ""], ["Sano", "Yoshio", ""], ["Taniguchi", "Tetsuji", ""]]}, {"id": "1211.3981", "submitter": "Bernard Lidick\\'y", "authors": "Oleg V. Borodin, Alexandr V. Kostochka, Bernard Lidick\\'y and Matthew\n  Yancey", "title": "Short proofs of coloring theorems on planar graphs", "comments": "13 pages, 4 figures", "journal-ref": null, "doi": "10.1016/j.ejc.2013.05.002", "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A recent lower bound on the number of edges in a k-critical n-vertex graph by\nKostochka and Yancey yields a half-page proof of the celebrated Gr\\\"otzsch\nTheorem that every planar triangle-free graph is 3-colorable. In this paper we\nuse the same bound to give short proofs of other known theorems on 3-coloring\nof planar graphs, among whose is the Gr\\\"unbaum-Aksenov Theorem that every\nplanar with at most three triangles is 3-colorable. We also prove the new\nresult that every graph obtained from a triangle-free planar graph by adding a\nvertex of degree at most four is 3-colorable.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2012 18:19:43 GMT"}], "update_date": "2016-12-16", "authors_parsed": [["Borodin", "Oleg V.", ""], ["Kostochka", "Alexandr V.", ""], ["Lidický", "Bernard", ""], ["Yancey", "Matthew", ""]]}, {"id": "1211.4049", "submitter": "Glenn Hurlbert", "authors": "Liliana Alc\\'on, Marisa Gutierrez, and Glenn Hurlbert", "title": "Pebbling in Split Graphs", "comments": "33 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Graph pebbling is a network optimization model for transporting discrete\nresources that are consumed in transit: the movement of two pebbles across an\nedge consumes one of the pebbles. The pebbling number of a graph is the fewest\nnumber of pebbles t so that, from any initial configuration of t pebbles on its\nvertices, one can place a pebble on any given target vertex via such pebbling\nsteps. It is known that deciding if a given configuration on a particular graph\ncan reach a specified target is NP-complete, even for diameter two graphs, and\nthat deciding if the pebbling number has a prescribed upper bound is\n\\Pi_2^P-complete.\n  On the other hand, for many families of graphs there are formulas or\npolynomial algorithms for computing pebbling numbers; for example, complete\ngraphs, products of paths (including cubes), trees, cycles, diameter two\ngraphs, and more. Moreover, graphs having minimum pebbling number are called\nClass 0, and many authors have studied which graphs are Class 0 and what graph\nproperties guarantee it, with no characterization in sight.\n  In this paper we investigate an important family of diameter three chordal\ngraphs called split graphs; graphs whose vertex set can be partitioned into a\nclique and an independent set. We provide a formula for the pebbling number of\na split graph, along with an algorithm for calculating it that runs in\nO(n^\\beta) time, where \\beta=2\\omega/(\\omega+1)\\cong 1.41 and \\omega\\cong 2.376\nis the exponent of matrix multiplication. Furthermore we determine that all\nsplit graphs with minimum degree at least 3 are Class 0.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2012 21:57:32 GMT"}], "update_date": "2012-11-20", "authors_parsed": [["Alcón", "Liliana", ""], ["Gutierrez", "Marisa", ""], ["Hurlbert", "Glenn", ""]]}, {"id": "1211.4056", "submitter": "Daniel Cullina", "authors": "Daniel Cullina, Ankur A. Kulkarni, and Negar Kiyavash", "title": "Two Approaches to the Construction of Deletion Correcting Codes: Weight\n  Partitioning and Optimal Colorings", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of constructing deletion correcting codes over a\nbinary alphabet and take a graph theoretic view. An $n$-bit $s$-deletion\ncorrecting code is an independent set in a particular graph. We propose\nconstructing such a code by taking the union of many constant Hamming weight\ncodes. This results in codes that have additional structure. Searching for\ncodes in constant Hamming weight induced subgraphs is computationally easier\nthan searching the original graph. We prove a lower bound on size of a codebook\nconstructed this way for any number of deletions and show that it is only a\nsmall factor below the corresponding lower bound on unrestricted codes. In the\nsingle deletion case, we find optimal colorings of the constant Hamming weight\ninduced subgraphs. We show that the resulting code is asymptotically optimal.\nWe discuss the relationship between codes and colorings and observe that the VT\ncodes are optimal in a coloring sense. We prove a new lower bound on the\nchromatic number of the deletion channel graphs. Colorings of the deletion\nchannel graphs that match this bound do not necessarily produce asymptotically\noptimal codes.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2012 22:30:24 GMT"}], "update_date": "2012-11-20", "authors_parsed": [["Cullina", "Daniel", ""], ["Kulkarni", "Ankur A.", ""], ["Kiyavash", "Negar", ""]]}, {"id": "1211.4193", "submitter": "Xin Zhang", "authors": "Jian-Liang Wu, Xin Zhang, Hailun Li", "title": "Equitable vertex arboricity of graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An equitable $(t,k,d)$-tree-coloring of a graph $G$ is a coloring to vertices\nof $G$ such that the sizes of any two color classes differ by at most one and\nthe subgraph induced by each color class is a forest of maximum degree at most\n$k$ and diameter at most $d$. The minimum $t$ such that $G$ has an equitable\n$(t',k,d)$-tree-coloring for every $t'\\geq t$ is called the strong equitable\n$(k,d)$-vertex-arboricity and denoted by $va^{\\equiv}_{k,d}(G)$. In this paper,\nwe give sharp upper bounds for $va^{\\equiv}_{1,1}(K_{n,n})$ and\n$va^{\\equiv}_{k,\\infty}(K_{n,n})$ by showing that\n$va^{\\equiv}_{1,1}(K_{n,n})=O(n)$ and\n$va^{\\equiv}_{k,\\infty}(K_{n,n})=O(n^{\\1/2})$ for every $k\\geq 2$. It is also\nproved that $va^{\\equiv}_{\\infty,\\infty}(G)\\leq 3$ for every planar graph $G$\nwith girth at least 5 and $va^{\\equiv}_{\\infty,\\infty}(G)\\leq 2$ for every\nplanar graph $G$ with girth at least 6 and for every outerplanar graph. We\nconjecture that $va^{\\equiv}_{\\infty,\\infty}(G)=O(1)$ for every planar graph\nand $va^{\\equiv}_{\\infty,\\infty}(G)\\leq \\lceil\\frac{\\Delta(G)+1}{2}\\rceil$ for\nevery graph $G$.\n", "versions": [{"version": "v1", "created": "Sun, 18 Nov 2012 03:59:42 GMT"}], "update_date": "2012-11-20", "authors_parsed": [["Wu", "Jian-Liang", ""], ["Zhang", "Xin", ""], ["Li", "Hailun", ""]]}, {"id": "1211.4433", "submitter": "Baigong Zheng", "authors": "Baigong Zheng, Yuansheng Yang, Xirong Xu", "title": "An upper bound for the crossing number of bubble-sort graph Bn", "comments": "20 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The crossing number of a graph G is the minimum number of pairwise\nintersections of edges in a drawing of G. Motivated by the recent work [Faria,\nL., Figueiredo, C.M.H. de, Sykora, O., Vrt'o, I.: An improved upper bound on\nthe crossing number of the hypercube. J. Graph Theory 59, 145-161 (2008)], we\ngive an upper bound of the crossing number of n-dimensional bubble-sort graph\nBn.\n", "versions": [{"version": "v1", "created": "Mon, 19 Nov 2012 14:19:38 GMT"}], "update_date": "2012-11-20", "authors_parsed": [["Zheng", "Baigong", ""], ["Yang", "Yuansheng", ""], ["Xu", "Xirong", ""]]}, {"id": "1211.4437", "submitter": "Baigong Zheng", "authors": "Yuansheng Yang, Baigong Zheng, Xiaohui Lin, Xirong Xu", "title": "The crossing numbers of $K_{n,n}-nK_2$, $K_{n}\\times P_2$, $K_{n}\\times\n  P_3$ and $K_n\\times C_4$", "comments": "14 pages, 33 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The crossing number of a graph $G$ is the minimum number of pairwise\nintersections of edges among all drawings of $G$. In this paper, we study the\ncrossing number of $K_{n,n}-nK_2$, $K_n\\times P_2$, $K_n\\times P_3$ and\n$K_n\\times C_4$.\n", "versions": [{"version": "v1", "created": "Mon, 19 Nov 2012 14:36:17 GMT"}], "update_date": "2012-11-20", "authors_parsed": [["Yang", "Yuansheng", ""], ["Zheng", "Baigong", ""], ["Lin", "Xiaohui", ""], ["Xu", "Xirong", ""]]}, {"id": "1211.4438", "submitter": "Baigong Zheng", "authors": "Yuansheng Yang, Baigong Zheng, Xirong Xu", "title": "The crossing number of the generalized Petersen graph P(10, 3) is six", "comments": "11 pages, 31 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The crossing number of a graph is the least number of crossings of edges\namong all drawings of the graph in the plane. In this article, we prove that\nthe crossing number of the generalized Petersen graph P(10, 3) is equal to 6.\n", "versions": [{"version": "v1", "created": "Mon, 19 Nov 2012 14:37:11 GMT"}], "update_date": "2012-11-20", "authors_parsed": [["Yang", "Yuansheng", ""], ["Zheng", "Baigong", ""], ["Xu", "Xirong", ""]]}, {"id": "1211.4629", "submitter": "Arash Rafiey", "authors": "Arash Rafiey", "title": "Single Exponential FPT Algorithm for Interval Vertex Deletion and\n  Interval Completion Problem", "comments": "There are faster algorithms available", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let G be an input graph with n vertices and m edges and let k be a fixed\nparameter. We provide a single exponential FPT algorithm with running time\nO(c^kn(n+m)), c= min {18,k} that turns graph G into an interval graph by\ndeleting at most k vertices from G. This solves an open problem posed by D.Marx\n[19]. We also provide a single exponential FPT algorithm with running time\nO(c^kn(n+m)), c= min {17,k} that turns G into an interval graph by adding at\nmost$k edges. The first FPT algorithm with run time O(k^{2k}n^3m) appeared in\nSTOC 2007 [24]. Our algorithm is the the first single exponential FPT algorithm\nthat improves the running time of the previous algorithm. The algorithms are\nbased on a structural decomposition of G into smaller subgraphs when G is free\nfrom small interval graph obstructions. The decomposition allows us to manage\nthe search tree more efficiently.\n", "versions": [{"version": "v1", "created": "Mon, 19 Nov 2012 23:55:21 GMT"}, {"version": "v2", "created": "Fri, 5 Feb 2016 22:23:45 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Rafiey", "Arash", ""]]}, {"id": "1211.4641", "submitter": "Baigong Zheng", "authors": "Yuansheng Yang, Baigong Zheng, Xirong Xu, Xiaohui Lin", "title": "The crossing numbers of $K_m\\times P_n$ and $K_m\\times C_n$", "comments": "16 pages, 30 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The {\\it crossing number} of a graph $G$ is the minimum number of pairwise\nintersections of edges in a drawing of $G$. In this paper, we study the\ncrossing numbers of $K_{m}\\times P_n$ and $K_{m}\\times C_n$.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2012 01:03:09 GMT"}], "update_date": "2012-11-21", "authors_parsed": [["Yang", "Yuansheng", ""], ["Zheng", "Baigong", ""], ["Xu", "Xirong", ""], ["Lin", "Xiaohui", ""]]}, {"id": "1211.4642", "submitter": "Baigong Zheng", "authors": "Yuansheng Yang, Bo Lv, Baigong Zheng, Xirong Xu, Ke Zhang", "title": "The crossing number of pancake graph $P_4$ is six", "comments": "10 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The {\\it crossing number} of a graph $G$ is the least number of pairwise\ncrossings of edges among all the drawings of $G$ in the plane. The pancake\ngraph is an important topology for interconnecting processors in parallel\ncomputers. In this paper, we prove the exact value of the crossing number of\npancake graph $P_4$ is six.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2012 01:03:50 GMT"}], "update_date": "2012-11-21", "authors_parsed": [["Yang", "Yuansheng", ""], ["Lv", "Bo", ""], ["Zheng", "Baigong", ""], ["Xu", "Xirong", ""], ["Zhang", "Ke", ""]]}, {"id": "1211.4728", "submitter": "Hajime Matsui", "authors": "Hajime Matsui", "title": "Lemma for Linear Feedback Shift Registers and DFTs Applied to Affine\n  Variety Codes", "comments": "37 pages, 1 column, 10 figures, 2 tables, resubmitted to IEEE\n  Transactions on Information Theory on Jan. 8, 2014", "journal-ref": null, "doi": "10.1109/TIT.2014.2311042", "report-no": null, "categories": "cs.IT cs.DM math.AC math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we establish a lemma in algebraic coding theory that\nfrequently appears in the encoding and decoding of, e.g., Reed-Solomon codes,\nalgebraic geometry codes, and affine variety codes. Our lemma corresponds to\nthe non-systematic encoding of affine variety codes, and can be stated by\ngiving a canonical linear map as the composition of an extension through linear\nfeedback shift registers from a Grobner basis and a generalized inverse\ndiscrete Fourier transform. We clarify that our lemma yields the error-value\nestimation in the fast erasure-and-error decoding of a class of dual affine\nvariety codes. Moreover, we show that systematic encoding corresponds to a\nspecial case of erasure-only decoding. The lemma enables us to reduce the\ncomputational complexity of error-evaluation from O(n^3) using Gaussian\nelimination to O(qn^2) with some mild conditions on n and q, where n is the\ncode length and q is the finite-field size.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2012 12:51:19 GMT"}, {"version": "v2", "created": "Mon, 20 Jan 2014 05:15:40 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Matsui", "Hajime", ""]]}, {"id": "1211.4853", "submitter": "Gwena\\\"el Joret", "authors": "Gwena\\\"el Joret and Adrian Vetta", "title": "Reducing the rank of a matroid", "comments": "v2: Minor changes made following helpful comments by the referees", "journal-ref": "Discrete Mathematics and Theoretical Computer Science,\n  17/2:143--156, 2015", "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the rank reduction problem for matroids: Given a matroid M and an\ninteger k, find a minimum size subset of elements of M whose removal reduces\nthe rank of M by at least k. When M is a graphical matroid this problem is the\nminimum k-cut problem, which admits a 2-approximation algorithm. In this paper\nwe show that the rank reduction problem for transversal matroids is essentially\nat least as hard to approximate as the densest k-subgraph problem. We also\nprove that, while the problem is easily solvable in polynomial time for\npartition matroids, it is NP-hard when considering the intersection of two\npartition matroids. Our proof shows, in particular, that the maximum vertex\ncover problem is NP-hard on bipartite graphs, which answers an open problem of\nB. Simeone.\n", "versions": [{"version": "v1", "created": "Tue, 20 Nov 2012 20:38:25 GMT"}, {"version": "v2", "created": "Sat, 5 Sep 2015 07:49:26 GMT"}], "update_date": "2015-09-18", "authors_parsed": [["Joret", "Gwenaël", ""], ["Vetta", "Adrian", ""]]}, {"id": "1211.4949", "submitter": "Shinnosuke Seki", "authors": "Shinnosuke Seki and Yasushi Okuno", "title": "On the behavior of tile assembly system at high temperatures", "comments": "This paper is an extended version of the following paper: S. Seki and\n  Y. Okuno. On the behavior of tile assembly system at high temperatures. In\n  CiE 2012: How the World Computes - Turing Centenary Conference and 8th\n  Conference on Computability in Europe, LNCS 7318, pages 549-559, Springer,\n  2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Behaviors of Winfree's tile assembly systems (TASs) at high temperatures are\ninvestigated in combination with integer programming of a specific form called\nthreshold programming. First, we propose a way to build bridges from the\nBoolean satisfiability problem (SAT) to threshold programming, and further to\nTAS's behavior, in order to prove the NP-hardness of optimizing temperatures of\nTASs that behave in a way given as input. These bridges will take us further to\ntwo important results on the behavior of TASs at high temperatures. The first\nsays that arbitrarily high temperatures are required to assemble some shape by\na TAS of \"reasonable\" size. The second is that for any temperature at least 4\ngiven as a parameter, it is NP-hard to find the minimum size TAS that\nself-assembles a given shape and works at the given temperature or below.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2012 07:28:42 GMT"}], "update_date": "2012-11-22", "authors_parsed": [["Seki", "Shinnosuke", ""], ["Okuno", "Yasushi", ""]]}, {"id": "1211.4998", "submitter": "Xin Zhang", "authors": "Xin Zhang, Jian-Liang Wu", "title": "A conjecture on equitable vertex arboricity of graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wu, Zhang and Li [4] conjectured that the set of vertices of any simple graph\n$G$ can be equitably partitioned into $\\lceil(\\Delta(G)+1)/2\\rceil$ subsets so\nthat each of them induces a forest of $G$. In this note, we prove this\nconjecture for graphs $G$ with $\\Delta(G)\\geq |G|/2$.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2012 11:06:06 GMT"}], "update_date": "2012-11-22", "authors_parsed": [["Zhang", "Xin", ""], ["Wu", "Jian-Liang", ""]]}, {"id": "1211.5031", "submitter": "Lukasz Kowalik", "authors": "Marcin Kami\\'nski and {\\L}ukasz Kowalik", "title": "Beyond the Vizing's bound for at most seven colors", "comments": "34 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $G=(V,E)$ be a simple graph of maximum degree $\\Delta$. The edges of $G$\ncan be colored with at most $\\Delta +1$ colors by Vizing's theorem. We study\nlower bounds on the size of subgraphs of $G$ that can be colored with $\\Delta$\ncolors.\n  Vizing's Theorem gives a bound of $\\frac{\\Delta}{\\Delta+1}|E|$. This is known\nto be tight for cliques $K_{\\Delta+1}$ when $\\Delta$ is even. However, for\n$\\Delta=3$ it was improved to $26/31|E|$ by Albertson and Haas [Parsimonious\nedge colorings, Disc. Math. 148, 1996] and later to $6/7|E|$ by Rizzi\n[Approximating the maximum 3-edge-colorable subgraph problem, Disc. Math. 309,\n2009]. It is tight for $B_3$, the graph isomorphic to a $K_4$ with one edge\nsubdivided.\n  We improve previously known bounds for $\\Delta\\in{3,...,7}$, under the\nassumption that for $\\Delta=3,4,6$ graph $G$ is not isomorphic to $B_3$, $K_5$\nand $K_7$, respectively. For $\\Delta \\geq 4$ these are the first results which\nimprove over the Vizing's bound. We also show a new bound for subcubic\nmultigraphs not isomorphic to $K_3$ with one edge doubled.\n  In the second part, we give approximation algorithms for the Maximum\nk-Edge-Colorable Subgraph problem, where given a graph G (without any bound on\nits maximum degree or other restrictions) one has to find a k-edge-colorable\nsubgraph with maximum number of edges. In particular, when G is simple for\nk=3,4,5,6,7 we obtain approximation ratios of 13/15, 9/11, 19/22, 23/27 and\n22/25, respectively. We also present a 7/9-approximation for k=3 when G is a\nmultigraph. The approximation algorithms follow from a new general framework\nthat can be used for any value of k.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2012 13:52:26 GMT"}, {"version": "v2", "created": "Tue, 27 Nov 2012 19:41:38 GMT"}, {"version": "v3", "created": "Thu, 29 Aug 2013 07:53:38 GMT"}, {"version": "v4", "created": "Sun, 2 Mar 2014 13:36:27 GMT"}], "update_date": "2014-03-04", "authors_parsed": [["Kamiński", "Marcin", ""], ["Kowalik", "Łukasz", ""]]}, {"id": "1211.5122", "submitter": "Ben Seamone", "authors": "Ben Seamone", "title": "The 1-2-3 Conjecture and related problems: a survey", "comments": "30 pages, 2 tables, submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The 1-2-3 Conjecture, posed in 2004 by Karonski, Luczak, and Thomason, is as\nfollows: \"If G is a graph with no connected component having exactly 2\nvertices, then the edges of G may be assigned weights from the set {1,2,3} so\nthat, for any adjacent vertices u and v, the sum of weights of edges incident\nto u differs from the sum of weights of edges incident to v.\" This survey paper\npresents the current state of research on the 1-2-3 Conjecture and the many\nvariants that have been proposed in its short but active history.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2012 19:37:42 GMT"}], "update_date": "2012-11-22", "authors_parsed": [["Seamone", "Ben", ""]]}, {"id": "1211.5307", "submitter": "Petros Petrosyan", "authors": "P. A. Petrosyan, R. R. Kamalian", "title": "On sum edge-coloring of regular, bipartite and split graphs", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  An edge-coloring of a graph $G$ with natural numbers is called a sum\nedge-coloring if the colors of edges incident to any vertex of $G$ are distinct\nand the sum of the colors of the edges of $G$ is minimum. The edge-chromatic\nsum of a graph $G$ is the sum of the colors of edges in a sum edge-coloring of\n$G$. It is known that the problem of finding the edge-chromatic sum of an\n$r$-regular ($r\\geq 3$) graph is $NP$-complete. In this paper we give a\npolynomial time $(1+\\frac{2r}{(r+1)^{2}})$-approximation algorithm for the\nedge-chromatic sum problem on $r$-regular graphs for $r\\geq 3$. Also, it is\nknown that the problem of finding the edge-chromatic sum of bipartite graphs\nwith maximum degree 3 is $NP$-complete. We show that the problem remains\n$NP$-complete even for some restricted class of bipartite graphs with maximum\ndegree 3. Finally, we give upper bounds for the edge-chromatic sum of some\nsplit graphs.\n", "versions": [{"version": "v1", "created": "Thu, 22 Nov 2012 15:16:03 GMT"}], "update_date": "2012-11-26", "authors_parsed": [["Petrosyan", "P. A.", ""], ["Kamalian", "R. R.", ""]]}, {"id": "1211.5311", "submitter": "Petros Petrosyan", "authors": "Petros A. Petrosyan", "title": "Interval colorings of complete balanced multipartite graphs", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  A graph $G$ is called a complete $k$-partite ($k\\geq 2$) graph if its\nvertices can be partitioned into $k$ independent sets $V_{1},...,V_{k}$ such\nthat each vertex in $V_{i}$ is adjacent to all the other vertices in $V_{j}$\nfor $1\\leq i<j\\leq k$. A complete $k$-partite graph $G$ is a complete balanced\n$k$-partite graph if $|V_{1}| = |V_{2}| =... = |V_{k}|$. An edge-coloring of a\ngraph $G$ with colors $1,...,t$ is an interval $t$-coloring if all colors are\nused, and the colors of edges incident to each vertex of $G$ are distinct and\nform an interval of integers. A graph $G$ is interval colorable if $G$ has an\ninterval $t$-coloring for some positive integer $t$. In this paper we show that\na complete balanced $k$-partite graph $G$ with $n$ vertices in each part is\ninterval colorable if and only if $nk$ is even. We also prove that if $nk$ is\neven and $(k-1)n\\leq t\\leq ((3/2)k-1)n-1$, then a complete balanced $k$-partite\ngraph $G$ admits an interval $t$-coloring. Moreover, if $k=p2^{q}$, where $p$\nis odd and $q\\in \\mathbb{N}$, then a complete balanced $k$-partite graph $G$\nhas an interval $t$-coloring for each positive integer $t$ satisfying\n$(k-1)n\\leq t\\leq (2k-p-q)n-1$.\n", "versions": [{"version": "v1", "created": "Thu, 22 Nov 2012 15:33:36 GMT"}], "update_date": "2012-11-26", "authors_parsed": [["Petrosyan", "Petros A.", ""]]}, {"id": "1211.5389", "submitter": "Gabriele Fici", "authors": "Gabriele Fici, Thierry Lecroq, Arnaud Lefebvre and Elise Prieur-Gaston", "title": "Algorithms for Computing Abelian Periods of Words", "comments": "Accepted for publication in Discrete Applied Mathematics", "journal-ref": "Discrete Applied Mathematics 163: 287-297 (2014)", "doi": "10.1016/j.dam.2013.08.021", "report-no": null, "categories": "cs.DS cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Constantinescu and Ilie (Bulletin EATCS 89, 167--170, 2006) introduced the\nnotion of an \\emph{Abelian period} of a word. A word of length $n$ over an\nalphabet of size $\\sigma$ can have $\\Theta(n^{2})$ distinct Abelian periods.\nThe Brute-Force algorithm computes all the Abelian periods of a word in time\n$O(n^2 \\times \\sigma)$ using $O(n \\times \\sigma)$ space. We present an off-line\nalgorithm based on a $\\sel$ function having the same worst-case theoretical\ncomplexity as the Brute-Force one, but outperforming it in practice. We then\npresent on-line algorithms that also enable to compute all the Abelian periods\nof all the prefixes of $w$.\n", "versions": [{"version": "v1", "created": "Thu, 22 Nov 2012 22:32:07 GMT"}, {"version": "v2", "created": "Mon, 10 Jun 2013 17:24:29 GMT"}], "update_date": "2013-12-05", "authors_parsed": [["Fici", "Gabriele", ""], ["Lecroq", "Thierry", ""], ["Lefebvre", "Arnaud", ""], ["Prieur-Gaston", "Elise", ""]]}, {"id": "1211.5656", "submitter": "Martin Otto", "authors": "Martin Otto", "title": "On Groupoids and Hypergraphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a novel construction of finite groupoids whose Cayley graphs have\nlarge girth even w.r.t. a discounted distance measure that contracts\narbitrarily long sequences of edges from the same colour class (sub-groupoid),\nand only counts transitions between colour classes (cosets). These groupoids\nare employed towards a generic construction method for finite hypergraphs that\nrealise specified overlap patterns and avoid small cyclic configurations. The\nconstructions are based on reduced products with groupoids generated by the\nelementary local extension steps, and can be made to preserve the symmetries of\nthe given overlap pattern. In particular, we obtain highly symmetric, finite\nhypergraph coverings without short cycles. The groupoids and their application\nin reduced products are sufficiently generic to be applicable to other\nconstructions that are specified in terms of local glueing operations and\nrequire global finite closure.\n", "versions": [{"version": "v1", "created": "Sat, 24 Nov 2012 10:17:20 GMT"}], "update_date": "2012-11-27", "authors_parsed": [["Otto", "Martin", ""]]}, {"id": "1211.5874", "submitter": "Giancarlo Rinaldo", "authors": "Marilena Crupi, Giancarlo Rinaldo", "title": "Closed graphs are proper interval graphs", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this note we prove that every closed graph $G$ is up to isomorphism a\nproper interval graph. As a consequence we obtain that there exist linear-time\nalgorithms for closed graph recognition.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2012 07:53:41 GMT"}], "update_date": "2012-11-27", "authors_parsed": [["Crupi", "Marilena", ""], ["Rinaldo", "Giancarlo", ""]]}, {"id": "1211.5933", "submitter": "Yixin Cao", "authors": "Yixin Cao and D\\'aniel Marx", "title": "Interval Deletion is Fixed-Parameter Tractable", "comments": "Final version, to appear in ACM Transactions on Algorithms", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the minimum \\emph{interval deletion} problem, which asks for the\nremoval of a set of at most $k$ vertices to make a graph of $n$ vertices into\nan interval graph. We present a parameterized algorithm of runtime $10^k \\cdot\nn^{O(1)}$ for this problem, that is, we show the problem is fixed-parameter\ntractable.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2012 12:42:52 GMT"}, {"version": "v2", "created": "Tue, 14 May 2013 14:53:58 GMT"}, {"version": "v3", "created": "Tue, 6 May 2014 19:33:50 GMT"}], "update_date": "2014-05-07", "authors_parsed": [["Cao", "Yixin", ""], ["Marx", "Dániel", ""]]}, {"id": "1211.6182", "submitter": "David Galvin", "authors": "Antonio Blanca, David Galvin, Dana Randall and Prasad Tetali", "title": "Phase Coexistence and Slow Mixing for the Hard-Core Model on Z^2", "comments": "23 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM math-ph math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the hard-core model on a finite graph we are given a parameter lambda>0,\nand an independent set I arises with probability proportional to lambda^|I|. On\ninfinite graphs a Gibbs distribution is defined as a suitable limit with the\ncorrect conditional probabilities. In the infinite setting we are interested in\ndetermining when this limit is unique and when there is phase coexistence,\ni.e., existence of multiple Gibbs states. On finite graphs we are interested in\ndetermining the mixing time of local Markov chains.\n  On Z^2 it is conjectured that these problems are related and that both\nundergo a phase transition at some critical point lambda_c approx 3.79. For\nphase coexistence, much of the work to date has focused on the regime of\nuniqueness, with the best result being recent work of Restrepo et al. showing\nthat there is a unique Gibbs state for all lambda < 2.3882. Here we give the\nfirst non-trivial result in the other direction, showing that there are\nmultiple Gibbs states for all lambda > 5.3646. Our proof adds two significant\ninnovations to the standard Peierls argument. First, building on the idea of\nfault lines introduced by Randall, we construct an event that distinguishes two\nboundary conditions and always has long contours associated with it, obviating\nthe need to accurately enumerate short contours. Second, we obtain vastly\nimproved bounds on the number of contours by relating them to a new class of\nself-avoiding walks on an oriented version of Z^2.\n  We extend our characterization of fault lines to show that local Markov\nchains will mix slowly when lambda > 5.3646 on lattice regions with periodic\n(toroidal) boundary conditions and when lambda > 7.1031 with non-periodic\n(free) boundary conditions. The arguments here rely on a careful analysis that\nrelates contours to taxi walks and represent a sevenfold improvement to the\npreviously best known values of \\lambda.\n", "versions": [{"version": "v1", "created": "Tue, 27 Nov 2012 02:25:53 GMT"}], "update_date": "2016-11-04", "authors_parsed": [["Blanca", "Antonio", ""], ["Galvin", "David", ""], ["Randall", "Dana", ""], ["Tetali", "Prasad", ""]]}, {"id": "1211.6466", "submitter": "Aurosish Mishra", "authors": "Aurosish Mishra and Pavol Hell", "title": "Small H-coloring problems for bounded degree digraphs", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An NP-complete coloring or homomorphism problem may become polynomial time\nsolvable when restricted to graphs with degrees bounded by a small number, but\nremain NP-complete if the bound is higher. For instance, 3-colorability of\ngraphs with degrees bounded by 3 can be decided by Brooks' theorem, while for\ngraphs with degrees bounded by 4, the 3-colorability problem is NP-complete. We\ninvestigate an analogous phenomenon for digraphs, focusing on the three\nsmallest digraphs H with NP-complete H-colorability problems. It turns out that\nin all three cases the H-coloring problem is polynomial time solvable for\ndigraphs with degree bounds $\\Delta^{+} \\leq 1$, $\\Delta^{-} \\leq 2$ (or\n$\\Delta^{+} \\leq 2$, $\\Delta^{-} \\leq 1$). On the other hand with degree bounds\n$\\Delta^{+} \\leq 2$, $\\Delta^{-} \\leq 2$, all three problems are again\nNP-complete. A conjecture proposed for graphs H by Feder, Hell and Huang states\nthat any variant of the $H$-coloring problem which is NP-complete without\ndegree constraints is also NP-complete with degree constraints, provided the\ndegree bounds are high enough. Our study is the first confirmation that the\nconjecture may also apply to digraphs.\n", "versions": [{"version": "v1", "created": "Tue, 27 Nov 2012 22:15:52 GMT"}], "update_date": "2012-11-29", "authors_parsed": [["Mishra", "Aurosish", ""], ["Hell", "Pavol", ""]]}, {"id": "1211.6553", "submitter": "Kurt Mehlhorn", "authors": "Kurt Mehlhorn and Adrian Neumann and Jens M. Schmidt", "title": "Certifying 3-Edge-Connectivity", "comments": "29 pages in Algorithmica, 2015", "journal-ref": null, "doi": "10.1007/s00453-015-0075-x", "report-no": null, "categories": "cs.DS cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a certifying algorithm that tests graphs for 3-edge-connectivity;\nthe algorithm works in linear time. If the input graph is not 3-edge-connected,\nthe algorithm returns a 2-edge-cut. If it is 3-edge-connected, it returns a\nconstruction sequence that constructs the input graph from the graph with two\nvertices and three parallel edges using only operations that (obviously)\npreserve 3-edge-connectivity. Additionally, we show how compute and certify the\n3-edge-connected components and a cactus representation of the 2-cuts in linear\ntime. For 3-vertex-connectivity, we show how to compute the 3-vertex-connected\ncomponents of a 2-connected graph.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2012 09:27:24 GMT"}, {"version": "v2", "created": "Mon, 4 Nov 2013 12:04:05 GMT"}, {"version": "v3", "created": "Wed, 7 Oct 2015 15:46:05 GMT"}], "update_date": "2015-10-08", "authors_parsed": [["Mehlhorn", "Kurt", ""], ["Neumann", "Adrian", ""], ["Schmidt", "Jens M.", ""]]}, {"id": "1211.6660", "submitter": "Michael Langberg", "authors": "Michelle Effros and Salim El Rouayheb and Michael Langberg", "title": "An Equivalence between Network Coding and Index Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the network coding and index coding problems are equivalent.\nThis equivalence holds in the general setting which includes linear and\nnon-linear codes. Specifically, we present an efficient reduction that maps a\nnetwork coding instance to an index coding one while preserving feasibility.\nPrevious connections were restricted to the linear case.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2012 17:03:10 GMT"}], "update_date": "2012-11-29", "authors_parsed": [["Effros", "Michelle", ""], ["Rouayheb", "Salim El", ""], ["Langberg", "Michael", ""]]}, {"id": "1211.6715", "submitter": "Demitri Plessas", "authors": "George McRae, Demitri Plessas, Liam Rafferty", "title": "On the Concrete Categories of Graphs", "comments": "42 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the standard Category of Graphs, the graphs allow only one edge to be\nincident to any two vertices, not necessarily distinct, and the graph morphisms\nmust map edges to edges and vertices to vertices while preserving incidence. We\nrefer to these graph morphisms as Strict Morphisms. We relax the condition on\nthe graphs allowing any number of edges to be incident to any two vertices, as\nwell as relaxing the condition on graph morphisms by allowing edges to be\nmapped to vertices, provided that incidence is still preserved. We call this\nbroader graph category The Category of Conceptual Graphs, and define four other\ngraph categories created by combinations of restrictions of the graph morphisms\nas well as restrictions on the allowed graphs. We investigate which Lawvere\naxioms for the category of Sets and Functions apply to each of these Categories\nof Graphs, as well as the other categorial constructions of free objects,\nprojective objects, generators, and their categorial duals.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2012 19:41:04 GMT"}], "update_date": "2012-11-29", "authors_parsed": [["McRae", "George", ""], ["Plessas", "Demitri", ""], ["Rafferty", "Liam", ""]]}, {"id": "1211.6724", "submitter": "Bhaskar DasGupta", "authors": "Bhaskar DasGupta and Lakshmi Kaligounder", "title": "On Approximating Graph Bipartization via Node Deletion", "comments": "Although the results are correct, it was pointed out that the results\n  follow from some previously known results. Accordingly, this version of the\n  paper is withdrawn by the authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although the results are correct, it was pointed out that the results follow\nfrom some previously known results. Accordingly, this version of the paper is\nwithdrawn by the authors.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2012 20:05:10 GMT"}, {"version": "v2", "created": "Thu, 29 Nov 2012 22:10:19 GMT"}], "update_date": "2012-12-03", "authors_parsed": [["DasGupta", "Bhaskar", ""], ["Kaligounder", "Lakshmi", ""]]}, {"id": "1211.6786", "submitter": "Ziv Scully", "authors": "Tian-Yi Jiang, Ziv Scully, Yan X Zhang", "title": "Motors and Impossible Firing Patterns in the Parallel Chip-Firing Game", "comments": "19 pages; added higher-level explanation of main theorem's proof,\n  typo corrections", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The parallel chip-firing game is an automaton on graphs in which vertices\n\"fire\" chips to their neighbors when they have enough chips to do so. The game\nis always periodic, and we concern ourselves with the firing sequences of\nvertices. We introduce the concepts of motorized parallel chip-firing games and\nmotor vertices, study the effects of motors connected to a tree and show that\nmotorized games can be transformed into ordinary games if the motors' firing\nsequences occur in some ordinary game. We then characterize exactly which\nperiodic firing patterns can occur in an ordinary game and state some\nimplications of the finding.\n", "versions": [{"version": "v1", "created": "Thu, 29 Nov 2012 00:07:56 GMT"}, {"version": "v2", "created": "Tue, 20 Aug 2013 03:30:07 GMT"}, {"version": "v3", "created": "Thu, 20 Nov 2014 09:09:50 GMT"}], "update_date": "2014-11-21", "authors_parsed": [["Jiang", "Tian-Yi", ""], ["Scully", "Ziv", ""], ["Zhang", "Yan X", ""]]}, {"id": "1211.7110", "submitter": "Henning Ulfarsson", "authors": "Hjalti Magnusson, Henning Ulfarsson", "title": "Algorithms for discovering and proving theorems about permutation\n  patterns", "comments": "13 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.DS cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an algorithm, called BiSC, that describes the patterns avoided by\na given set of permutations. It automatically conjectures the statements of\nknown theorems such as the descriptions of stack-sortable (Knuth 1975) and\nWest-2-stack-sortable permutations (West 1990), smooth (Lakshmibai and Sandhya\n1990) and forest-like permutations (Bousquet-Melou and Butler 2007), and simsun\npermutations (Branden and Claesson 2011). The algorithm has also been used to\ndiscover new theorems and conjectures related to Young tableaux,\nWilf-equivalences and sorting devices. We further give algorithms to prove a\ncomplete description of preimages of pattern classes under certain sorting\ndevices. These generalize an algorithm of Claesson and Ulfarsson (2012) and\nallow us to prove a linear time algorithm for finding occurrences of the\npattern 4312.\n", "versions": [{"version": "v1", "created": "Thu, 29 Nov 2012 22:38:57 GMT"}], "update_date": "2012-12-03", "authors_parsed": [["Magnusson", "Hjalti", ""], ["Ulfarsson", "Henning", ""]]}, {"id": "1211.7353", "submitter": "Reinhard Diestel", "authors": "Reinhard Diestel and Malte M\\\"uller", "title": "Connected tree-width", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The connected tree-width of a graph is the minimum width of a\ntree-decomposition whose parts induce connected subgraphs. Long cycles are\nexamples of graphs that have small tree-width but large connected tree-width.\nWe show that a graph has small connected tree-width if and only if it has small\ntree-width and contains no long geodesic cycle.\n  We further prove a connected analogue of the duality theorem for tree-width:\na finite graph has small connected tree-width if and only if it has no bramble\nwhose connected covers are all large. Both these results are qualitative: the\nbounds are good but not tight.\n  We show that graphs of connected tree-width $k$ are $k$-hyperbolic, which is\ntight, and that graphs of tree-width $k$ whose geodesic cycles all have length\nat most $\\ell$ are $\\lfloor{3\\over2}\\ell(k-1)\\rfloor$-hyperbolic. The existence\nof such a function $h(k,\\ell)$ had been conjectured by Sullivan.\n", "versions": [{"version": "v1", "created": "Fri, 30 Nov 2012 19:50:07 GMT"}, {"version": "v2", "created": "Sat, 8 Nov 2014 17:15:37 GMT"}, {"version": "v3", "created": "Wed, 14 Oct 2015 11:25:18 GMT"}], "update_date": "2015-10-15", "authors_parsed": [["Diestel", "Reinhard", ""], ["Müller", "Malte", ""]]}]