[{"id": "0802.0116", "submitter": "Lutz Schr\\\"oder", "authors": "Lutz Schr\\\"oder and Dirk Patinson", "title": "Shallow Models for Non-Iterative Modal Logics", "comments": null, "journal-ref": null, "doi": null, "report-no": "Imperial College TR Computing 2008/3", "categories": "cs.LO cs.AI cs.CC cs.MA", "license": null, "abstract": "  The methods used to establish PSPACE-bounds for modal logics can roughly be\ngrouped into two classes: syntax driven methods establish that exhaustive proof\nsearch can be performed in polynomial space whereas semantic approaches\ndirectly construct shallow models. In this paper, we follow the latter approach\nand establish generic PSPACE-bounds for a large and heterogeneous class of\nmodal logics in a coalgebraic framework. In particular, no complete\naxiomatisation of the logic under scrutiny is needed. This does not only\ncomplement our earlier, syntactic, approach conceptually, but also covers a\nwide variety of new examples which are difficult to harness by purely syntactic\nmeans. Apart from re-proving known complexity bounds for a large variety of\nstructurally different logics, we apply our method to obtain previously unknown\nPSPACE-bounds for Elgesem's logic of agency and for graded modal logic over\nreflexive frames.\n", "versions": [{"version": "v1", "created": "Fri, 1 Feb 2008 13:11:09 GMT"}, {"version": "v2", "created": "Thu, 20 Mar 2008 20:48:05 GMT"}, {"version": "v3", "created": "Thu, 3 Apr 2008 09:34:18 GMT"}], "update_date": "2008-04-03", "authors_parsed": [["Schröder", "Lutz", ""], ["Patinson", "Dirk", ""]]}, {"id": "0802.0212", "submitter": "Christine C\\'ordula Dantas", "authors": "Miriam C. B. Alves, Christine C. Dantas, Nanci N. Arai, Rovedy B. da\n  Silva (Institute of Aeronautics and Space - IAE/CTA, Brazil)", "title": "A topological formal treatment for scenario-based software specification\n  of concurrent real-time systems", "comments": "20th International Conference on Software and Systems Engineering and\n  their Applications, Conservatoire des Arts & Metiers, Paris, France, 4-6\n  December 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.LO", "license": null, "abstract": "  Real-time systems are computing systems in which the meeting of their\nrequirements is vital for their correctness. Consequently, if the real-time\nrequirements of these systems are poorly understood and verified, the results\ncan be disastrous and lead to irremediable project failures at the early phases\nof development. The present work addresses the problem of detecting deadlock\nsituations early in the requirements specification phase of a concurrent real\ntime system, proposing a simple proof-of-concepts prototype that joins\nscenario-based requirements specifications and techniques based on topology.\nThe efforts are concentrated in the integration of the formal representation of\nMessage Sequence Chart scenarios into the deadlock detection algorithm of\nFajstrup et al., based on geometric and algebraic topology.\n", "versions": [{"version": "v1", "created": "Fri, 1 Feb 2008 22:12:47 GMT"}], "update_date": "2008-02-05", "authors_parsed": [["Alves", "Miriam C. B.", "", "Institute of Aeronautics and Space - IAE/CTA, Brazil"], ["Dantas", "Christine C.", "", "Institute of Aeronautics and Space - IAE/CTA, Brazil"], ["Arai", "Nanci N.", "", "Institute of Aeronautics and Space - IAE/CTA, Brazil"], ["da Silva", "Rovedy B.", "", "Institute of Aeronautics and Space - IAE/CTA, Brazil"]]}, {"id": "0802.0820", "submitter": "Jonathan Hayman", "authors": "Jonathan Hayman and Glynn Winskel", "title": "Independence and concurrent separation logic", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 4, Issue 1 (March 19,\n  2008) lmcs:1100", "doi": "10.2168/LMCS-4(1:6)2008", "report-no": null, "categories": "cs.LO cs.PL", "license": null, "abstract": "  A compositional Petri net-based semantics is given to a simple language\nallowing pointer manipulation and parallelism. The model is then applied to\ngive a notion of validity to the judgements made by concurrent separation logic\nthat emphasizes the process-environment duality inherent in such rely-guarantee\nreasoning. Soundness of the rules of concurrent separation logic with respect\nto this definition of validity is shown. The independence information retained\nby the Petri net model is then exploited to characterize the independence of\nparallel processes enforced by the logic. This is shown to permit a refinement\noperation capable of changing the granularity of atomic actions.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2008 15:39:20 GMT"}, {"version": "v2", "created": "Wed, 19 Mar 2008 15:26:51 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Hayman", "Jonathan", ""], ["Winskel", "Glynn", ""]]}, {"id": "0802.0865", "submitter": "Andrew Gacek", "authors": "Andrew Gacek, Dale Miller, and Gopalan Nadathur", "title": "Combining generic judgments with recursive definitions", "comments": "To appear in LICS 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many semantical aspects of programming languages, such as their operational\nsemantics and their type assignment calculi, are specified by describing\nappropriate proof systems. Recent research has identified two proof-theoretic\nfeatures that allow direct, logic-based reasoning about such descriptions: the\ntreatment of atomic judgments as fixed points (recursive definitions) and an\nencoding of binding constructs via generic judgments. However, the logics\nencompassing these two features have thus far treated them orthogonally: that\nis, they do not provide the ability to define object-logic properties that\nthemselves depend on an intrinsic treatment of binding. We propose a new and\nsimple integration of these features within an intuitionistic logic enhanced\nwith induction over natural numbers and we show that the resulting logic is\nconsistent. The pivotal benefit of the integration is that it allows recursive\ndefinitions to not just encode simple, traditional forms of atomic judgments\nbut also to capture generic properties pertaining to such judgments. The\nusefulness of this logic is illustrated by showing how it can provide elegant\ntreatments of object-logic contexts that appear in proofs involving typing\ncalculi and of arbitrarily cascading substitutions that play a role in\nreducibility arguments.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2008 19:18:57 GMT"}, {"version": "v2", "created": "Mon, 14 Apr 2008 13:25:42 GMT"}], "update_date": "2008-04-14", "authors_parsed": [["Gacek", "Andrew", ""], ["Miller", "Dale", ""], ["Nadathur", "Gopalan", ""]]}, {"id": "0802.1226", "submitter": "Qiqi Yan", "authors": "Qiqi Yan", "title": "Lower Bounds for Complementation of omega-Automata Via the Full Automata\n  Technique", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 4, Issue 1 (March 19,\n  2008) lmcs:992", "doi": "10.2168/LMCS-4(1:5)2008", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we first introduce a lower bound technique for the state\ncomplexity of transformations of automata. Namely we suggest first considering\nthe class of full automata in lower bound analysis, and later reducing the size\nof the large alphabet via alphabet substitutions. Then we apply such technique\nto the complementation of nondeterministic \\omega-automata, and obtain several\nlower bound results. Particularly, we prove an \\omega((0.76n)^n) lower bound\nfor B\\\"uchi complementation, which also holds for almost every complementation\nor determinization transformation of nondeterministic omega-automata, and prove\nan optimal (\\omega(nk))^n lower bound for the complementation of generalized\nB\\\"uchi automata, which holds for Streett automata as well.\n", "versions": [{"version": "v1", "created": "Fri, 8 Feb 2008 23:13:52 GMT"}, {"version": "v2", "created": "Wed, 19 Mar 2008 15:05:48 GMT"}, {"version": "v3", "created": "Wed, 22 Oct 2008 21:01:52 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Yan", "Qiqi", ""]]}, {"id": "0802.1884", "submitter": "Henning Schnoor", "authors": "Edith Hemaspaandra and Henning Schnoor", "title": "On the Complexity of Elementary Modal Logics", "comments": "Full version of STACS 2008 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO", "license": null, "abstract": "  Modal logics are widely used in computer science. The complexity of modal\nsatisfiability problems has been investigated since the 1970s, usually proving\nresults on a case-by-case basis. We prove a very general classification for a\nwide class of relevant logics: Many important subclasses of modal logics can be\nobtained by restricting the allowed models with first-order Horn formulas. We\nshow that the satisfiability problem for each of these logics is either\nNP-complete or PSPACE-hard, and exhibit a simple classification criterion.\nFurther, we prove matching PSPACE upper bounds for many of the PSPACE-hard\nlogics.\n", "versions": [{"version": "v1", "created": "Wed, 13 Feb 2008 18:57:26 GMT"}], "update_date": "2008-02-14", "authors_parsed": [["Hemaspaandra", "Edith", ""], ["Schnoor", "Henning", ""]]}, {"id": "0802.2127", "submitter": "Alexandre Riazanov", "authors": "Alexandre Riazanov", "title": "New Implementation Framework for Saturation-Based Reasoning", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": null, "abstract": "  The saturation-based reasoning methods are among the most theoretically\ndeveloped ones and are used by most of the state-of-the-art first-order logic\nreasoners. In the last decade there was a sharp increase in performance of such\nsystems, which I attribute to the use of advanced calculi and the intensified\nresearch in implementation techniques. However, nowadays we are witnessing a\nslowdown in performance progress, which may be considered as a sign that the\nsaturation-based technology is reaching its inherent limits. The position I am\ntrying to put forward in this paper is that such scepticism is premature and a\nsharp improvement in performance may potentially be reached by adopting new\narchitectural principles for saturation. The top-level algorithms and\ncorresponding designs used in the state-of-the-art saturation-based theorem\nprovers have (at least) two inherent drawbacks: the insufficient flexibility of\nthe used inference selection mechanisms and the lack of means for intelligent\nprioritising of search directions. In this position paper I analyse these\ndrawbacks and present two ideas on how they could be overcome. In particular, I\npropose a flexible low-cost high-precision mechanism for inference selection,\nintended to overcome problems associated with the currently used instances of\nclause selection-based procedures. I also outline a method for intelligent\nprioritising of search directions, based on probing the search space by\nexploring generalised search directions. I discuss some technical issues\nrelated to implementation of the proposed architectural principles and outline\npossible solutions.\n", "versions": [{"version": "v1", "created": "Fri, 15 Feb 2008 01:51:29 GMT"}], "update_date": "2008-02-18", "authors_parsed": [["Riazanov", "Alexandre", ""]]}, {"id": "0802.2853", "submitter": "Pascal Weil", "authors": "Jean-Fran\\c{c}ois Dufourd (LSIIT)", "title": "Discrete Jordan Curve Theorem: A proof formalized in Coq with hypermaps", "comments": null, "journal-ref": "Dans Proceedings of the 25th Annual Symposium on the Theoretical\n  Aspects of Computer Science - STACS 2008, Bordeaux : France (2008)", "doi": null, "report-no": null, "categories": "cs.LO cs.DM", "license": null, "abstract": "  This paper presents a formalized proof of a discrete form of the Jordan Curve\nTheorem. It is based on a hypermap model of planar subdivisions, formal\nspecifications and proofs assisted by the Coq system. Fundamental properties\nare proven by structural or noetherian induction: Genus Theorem, Euler's\nFormula, constructive planarity criteria. A notion of ring of faces is\ninductively defined and a Jordan Curve Theorem is stated and proven for any\nplanar hypermap.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2008 14:23:01 GMT"}], "update_date": "2008-02-21", "authors_parsed": [["Dufourd", "Jean-François", "", "LSIIT"]]}, {"id": "0802.2862", "submitter": "Pascal Weil", "authors": "Dietrich Kuske", "title": "Compatibility of Shelah and Stupp's and Muchnik's iteration with\n  fragments of monadic second order logic", "comments": null, "journal-ref": "Dans Proceedings of the 25th Annual Symposium on the Theoretical\n  Aspects of Computer Science - STACS 2008, Bordeaux : France (2008)", "doi": null, "report-no": null, "categories": "cs.LO", "license": null, "abstract": "  We investigate the relation between the theory of the iterations in the sense\nof Shelah-Stupp and of Muchnik, resp., and the theory of the base structure for\nseveral logics. These logics are obtained from the restriction of set\nquantification in monadic second order logic to certain subsets like, e.g.,\nfinite sets, chains, and finite unions of chains. We show that these theories\nof the Shelah-Stupp iteration can be reduced to corresponding theories of the\nbase structure. This fails for Muchnik's iteration.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2008 14:33:04 GMT"}], "update_date": "2008-02-21", "authors_parsed": [["Kuske", "Dietrich", ""]]}, {"id": "0802.2866", "submitter": "Pascal Weil", "authors": "Lukasz Kaiser, Sasha Rubin, Vince B\\'ar\\'any", "title": "Cardinality and counting quantifiers on omega-automatic structures", "comments": null, "journal-ref": "Dans Proceedings of the 25th Annual Symposium on the Theoretical\n  Aspects of Computer Science - STACS 2008, Bordeaux : France (2008)", "doi": null, "report-no": null, "categories": "cs.LO", "license": null, "abstract": "  We investigate structures that can be represented by omega-automata, so\ncalled omega-automatic structures, and prove that relations defined over such\nstructures in first-order logic expanded by the first-order quantifiers `there\nexist at most $\\aleph_0$ many', 'there exist finitely many' and 'there exist\n$k$ modulo $m$ many' are omega-regular. The proof identifies certain algebraic\nproperties of omega-semigroups. As a consequence an omega-regular equivalence\nrelation of countable index has an omega-regular set of representatives. This\nimplies Blumensath's conjecture that a countable structure with an\n$\\omega$-automatic presentation can be represented using automata on finite\nwords. This also complements a very recent result of Hj\\\"orth, Khoussainov,\nMontalban and Nies showing that there is an omega-automatic structure which has\nno injective presentation.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2008 14:37:32 GMT"}], "update_date": "2008-02-21", "authors_parsed": [["Kaiser", "Lukasz", ""], ["Rubin", "Sasha", ""], ["Bárány", "Vince", ""]]}, {"id": "0802.2871", "submitter": "Pascal Weil", "authors": "Diana Fischer, Erich Gr\\\"adel, Lukasz Kaiser", "title": "Model Checking Games for the Quantitative mu-Calculus", "comments": null, "journal-ref": "Dans Proceedings of the 25th Annual Symposium on the Theoretical\n  Aspects of Computer Science - STACS 2008, Bordeaux : France (2008)", "doi": null, "report-no": null, "categories": "cs.LO cs.GT", "license": null, "abstract": "  We investigate quantitative extensions of modal logic and the modal\nmu-calculus, and study the question whether the tight connection between logic\nand games can be lifted from the qualitative logics to their quantitative\ncounterparts. It turns out that, if the quantitative mu-calculus is defined in\nan appropriate way respecting the duality properties between the logical\noperators, then its model checking problem can indeed be characterised by a\nquantitative variant of parity games. However, these quantitative games have\nquite different properties than their classical counterparts, in particular\nthey are, in general, not positionally determined. The correspondence between\nthe logic and the games goes both ways: the value of a formula on a\nquantitative transition system coincides with the value of the associated\nquantitative game, and conversely, the values of quantitative parity games are\ndefinable in the quantitative mu-calculus.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2008 14:57:24 GMT"}], "update_date": "2008-02-21", "authors_parsed": [["Fischer", "Diana", ""], ["Grädel", "Erich", ""], ["Kaiser", "Lukasz", ""]]}, {"id": "0802.3137", "submitter": "Wolfgang Faber", "authors": "Wolfgang Faber, Gerald Pfeifer, Nicola Leone, Tina Dell'Armi, Giuseppe\n  Ielpa", "title": "Design and Implementation of Aggregate Functions in the DLV System", "comments": "34 pages, 7 figures. This article has been accepted for publication\n  in Theory and Practice of Logic Programming, Cambridge University Press", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Disjunctive Logic Programming (DLP) is a very expressive formalism: it allows\nfor expressing every property of finite structures that is decidable in the\ncomplexity class SigmaP2 (= NP^NP). Despite this high expressiveness, there are\nsome simple properties, often arising in real-world applications, which cannot\nbe encoded in a simple and natural manner. Especially properties that require\nthe use of arithmetic operators (like sum, times, or count) on a set or\nmultiset of elements, which satisfy some conditions, cannot be naturally\nexpressed in classic DLP.\n  To overcome this deficiency, we extend DLP by aggregate functions in a\nconservative way. In particular, we avoid the introduction of constructs with\ndisputed semantics, by requiring aggregates to be stratified. We formally\ndefine the semantics of the extended language (called DLP^A), and illustrate\nhow it can be profitably used for representing knowledge. Furthermore, we\nanalyze the computational complexity of DLP^A, showing that the addition of\naggregates does not bring a higher cost in that respect. Finally, we provide an\nimplementation of DLP^A in DLV -- a state-of-the-art DLP system -- and report\non experiments which confirm the usefulness of the proposed extension also for\nthe efficiency of computation.\n", "versions": [{"version": "v1", "created": "Thu, 21 Feb 2008 15:44:09 GMT"}], "update_date": "2008-02-22", "authors_parsed": [["Faber", "Wolfgang", ""], ["Pfeifer", "Gerald", ""], ["Leone", "Nicola", ""], ["Dell'Armi", "Tina", ""], ["Ielpa", "Giuseppe", ""]]}, {"id": "0802.3444", "submitter": "Bruno Blanchet", "authors": "Bruno Blanchet", "title": "Automatic Verification of Correspondences for Security Protocols", "comments": "95 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new technique for verifying correspondences in security\nprotocols. In particular, correspondences can be used to formalize\nauthentication. Our technique is fully automatic, it can handle an unbounded\nnumber of sessions of the protocol, and it is efficient in practice. It\nsignificantly extends a previous technique for the verification of secrecy. The\nprotocol is represented in an extension of the pi calculus with fairly\narbitrary cryptographic primitives. This protocol representation includes the\nspecification of the correspondence to be verified, but no other annotation.\nThis representation is then translated into an abstract representation by Horn\nclauses, which is used to prove the desired correspondence. Our technique has\nbeen proved correct and implemented. We have tested it on various protocols\nfrom the literature. The experimental results show that these protocols can be\nverified by our technique in less than 1 s.\n", "versions": [{"version": "v1", "created": "Sat, 23 Feb 2008 14:03:56 GMT"}], "update_date": "2008-02-26", "authors_parsed": [["Blanchet", "Bruno", ""]]}, {"id": "0802.3617", "submitter": "Mark van der Zwaag", "authors": "Jan A. Bergstra, Sanne Nolst Trenit\\'e, Mark B. van der Zwaag", "title": "Towards a formalization of budgets", "comments": null, "journal-ref": null, "doi": null, "report-no": "PRG0712", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We go into the need for, and the requirements on, a formal theory of budgets.\nWe present a simple algebraic theory of rational budgets, i.e., budgets in\nwhich amounts of money are specified by functions on the rational numbers. This\ntheory is based on the tuplix calculus. We go into the importance of using\ntotalized models for the rational numbers. We present a case study on the\neducational budget of a university department offering master programs.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2008 13:11:32 GMT"}], "update_date": "2008-02-26", "authors_parsed": [["Bergstra", "Jan A.", ""], ["Trenité", "Sanne Nolst", ""], ["van der Zwaag", "Mark B.", ""]]}, {"id": "0802.3626", "submitter": "Sudhakar Sahoo", "authors": "Birendra Kumar Nayak, Sudhakar Sahoo, Sushant Kumar Rout", "title": "Color Graphs: An Efficient Model For Two-Dimensional Cellular Automata\n  Linear Rules", "comments": "14 pages, presented at Orissa Mathematical Society Conference, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two-dimensional nine neighbor hood rectangular Cellular Automata rules can be\nmodeled using many different techniques like Rule matrices, State Transition\nDiagrams, Boolean functions, Algebraic Normal Form etc. In this paper, a new\nmodel is introduced using color graphs to model all the 512 linear rules. The\ngraph theoretic properties therefore studied in this paper simplifies the\nanalysis of all linear rules in comparison with other ways of its study.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2008 13:54:50 GMT"}], "update_date": "2008-02-28", "authors_parsed": [["Nayak", "Birendra Kumar", ""], ["Sahoo", "Sudhakar", ""], ["Rout", "Sushant Kumar", ""]]}, {"id": "0802.3881", "submitter": "Jorge Sousa Pinto", "authors": "Jos\\'e Bacelar Almeida, Jorge Sousa Pinto", "title": "Deriving Sorting Algorithms", "comments": "Technical Report", "journal-ref": null, "doi": null, "report-no": "DI-PURe-06.04.01", "categories": "cs.DS cs.LO", "license": null, "abstract": "  This paper proposes new derivations of three well-known sorting algorithms,\nin their functional formulation. The approach we use is based on three main\ningredients: first, the algorithms are derived from a simpler algorithm, i.e.\nthe specification is already a solution to the problem (in this sense our\nderivations are program transformations). Secondly, a mixture of inductive and\ncoinductive arguments are used in a uniform, algebraic style in our reasoning.\nFinally, the approach uses structural invariants so as to strengthen the\nequational reasoning with logical arguments that cannot be captured in the\nalgebraic framework.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2008 19:47:57 GMT"}], "update_date": "2008-02-27", "authors_parsed": [["Almeida", "José Bacelar", ""], ["Pinto", "Jorge Sousa", ""]]}, {"id": "0802.3974", "submitter": "Vladimir Lapshin A", "authors": "Vladimir Lapshin", "title": "Syntax diagrams as a formalism for representation of syntactic relations\n  of formal languages", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The new approach to representation of syntax of formal languages-- a\nformalism of syntax diagrams is offered. Syntax diagrams look a convenient\nlanguage for the description of syntactic relations in the languages having\nnonlinear representation of texts, for example, for representation of syntax\nlows of the language of structural chemical formulas. The formalism of\nneighbourhood grammar is used to describe the set of correct syntax constructs.\nThe neighbourhood the grammar consists of a set of families of\n\"neighbourhoods\"-- the diagrams defined for each symbol of the language's\nalphabet. The syntax diagram is correct if each symbol is included into this\ndiagram together with some neighbourhood. In other words, correct diagrams are\nneeded to be covered by elements of the neighbourhood grammar. Thus, the\ngrammar of formal language can be represented as system of the covers defined\nfor each correct syntax diagram.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2008 08:59:58 GMT"}, {"version": "v2", "created": "Thu, 28 Feb 2008 09:28:59 GMT"}], "update_date": "2008-02-28", "authors_parsed": [["Lapshin", "Vladimir", ""]]}, {"id": "0802.4057", "submitter": "Andrea Masini", "authors": "Andrea Masini, Luca Vigan\\`o, Margherita Zorzi", "title": "A Qualitative Modal Representation of Quantum Register Transformations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": null, "abstract": "  We introduce two modal natural deduction systems that are suitable to\nrepresent and reason about transformations of quantum registers in an abstract,\nqualitative, way. Quantum registers represent quantum systems, and can be\nviewed as the structure of quantum data for quantum operations. Our systems\nprovide a modal framework for reasoning about operations on quantum registers\n(unitary transformations and measurements), in terms of possible worlds (as\nabstractions of quantum registers) and accessibility relations between these\nworlds. We give a Kripke--style semantics that formally describes quantum\nregister transformations and prove the soundness and completeness of our\nsystems with respect to this semantics.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2008 17:43:23 GMT"}, {"version": "v2", "created": "Wed, 5 Mar 2008 11:10:41 GMT"}], "update_date": "2008-03-05", "authors_parsed": [["Masini", "Andrea", ""], ["Viganò", "Luca", ""], ["Zorzi", "Margherita", ""]]}, {"id": "0802.4131", "submitter": "Sudhakar Sahoo", "authors": "Birendra Kumar Nayak (1), Sudhakar Sahoo (2)", "title": "Language of Boolean functions its Grammar and Machine", "comments": "5 pages, two tables, presented in Orissa Mathematical Society\n  Conference, January, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper an algorithm is designed which generates in-equivalent Boolean\nfunctions of any number of variables from the four Boolean functions of single\nvariable. The grammar for such set of Boolean function is provided. The Turing\nMachine that accepts such set is constructed.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2008 06:21:49 GMT"}], "update_date": "2008-02-29", "authors_parsed": [["Nayak", "Birendra Kumar", ""], ["Sahoo", "Sudhakar", ""]]}, {"id": "0802.4237", "submitter": "Ranko Lazic", "authors": "Ranko Lazic", "title": "Safety alternating automata on data words", "comments": "23 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A data word is a sequence of pairs of a letter from a finite alphabet and an\nelement from an infinite set, where the latter can only be compared for\nequality. Safety one-way alternating automata with one register on infinite\ndata words are considered, their nonemptiness is shown EXPSPACE-complete, and\ntheir inclusion decidable but not primitive recursive. The same complexity\nbounds are obtained for satisfiability and refinement, respectively, for the\nsafety fragment of linear temporal logic with freeze quantification. Dropping\nthe safety restriction, adding past temporal operators, or adding one more\nregister, each causes undecidability.\n", "versions": [{"version": "v1", "created": "Thu, 28 Feb 2008 16:54:31 GMT"}, {"version": "v2", "created": "Tue, 31 Mar 2009 18:52:17 GMT"}, {"version": "v3", "created": "Fri, 9 Apr 2010 15:20:30 GMT"}], "update_date": "2010-04-12", "authors_parsed": [["Lazic", "Ranko", ""]]}]