[{"id": "2105.02774", "submitter": "Carlos Maldonado Prof. Dr.", "authors": "Carlos Eduardo Maldonado", "title": "Total Novel and Complexity. Literature and Complexity Science", "comments": "3 figures, ABM", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A strong link between complexity theory and literature is possible, i.e.\nfeasible, under one proviso, namely that total novels be considered. However,\nneither in literature at large nor in complexity science has been literature\nseriously taken into consideration. This paper argues that a total novel is\nmost conspicuous example of a complex system. The argument is supported by a\nclear characterization of what a total novel is and entails. Science and\nliterature can be thus complemented and developed, hand in hand.\n", "versions": [{"version": "v1", "created": "Sat, 3 Apr 2021 19:03:50 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Maldonado", "Carlos Eduardo", ""]]}, {"id": "2105.03254", "submitter": "Benoit Goussen", "authors": "Tjalling Jager, Marie Trijau, Neil Sherborne, Benoit Goussen, Roman\n  Ashauer", "title": "Considerations for using reproduction data in\n  toxicokinetic-toxicodynamic modelling", "comments": "13 pages", "journal-ref": "Integr Environ Assess Manag. (2021)", "doi": "10.1002/ieam.4476", "report-no": null, "categories": "q-bio.QM cs.OH q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Toxicokinetic-toxicodynamic (TKTD) modelling is essential to make sense of\nthe time dependence of toxic effects, and to interpret and predict consequences\nof time-varying exposure. These advantages have been recognised in the\nregulatory arena, especially for environmental risk assessment (ERA) of\npesticides, where time-varying exposure is the norm. We critically evaluate the\nlink between the modelled variables in TKTD models and the observations from\nlaboratory ecotoxicity tests. For the endpoint reproduction, this link is far\nfrom trivial. The relevant TKTD models for sub-lethal effects are based on\nDynamic-Energy Budget (DEB) theory, which specifies a continuous investment\nflux into reproduction. In contrast, experimental tests score egg or offspring\nrelease by the mother. The link between model and data is particularly\ntroublesome when a species reproduces in discrete clutches, and even more so\nwhen eggs are incubated in the mother's brood pouch (and release of neonates is\nscored in the test). This situation is quite common among aquatic invertebrates\n(e.g., cladocerans, amphipods, mysids), including many popular test species. We\ndiscuss these and other issues with reproduction data, reflect on their\npotential impact on DEB-TKTD analysis, and provide preliminary recommendations\nto correct them. Both modellers and users of model results need to be aware of\nthese complications, as ignoring them could easily lead to unnecessary failure\nof DEB-TKTD models during calibration, or when validating them against\nindependent data for other exposure scenarios.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2021 10:13:04 GMT"}], "update_date": "2021-06-15", "authors_parsed": [["Jager", "Tjalling", ""], ["Trijau", "Marie", ""], ["Sherborne", "Neil", ""], ["Goussen", "Benoit", ""], ["Ashauer", "Roman", ""]]}, {"id": "2105.05017", "submitter": "Michael Barry Dr", "authors": "Michael Barry, Claudio Gambella, Fabio Lorenzi, John Sheehan and Joern\n  Ploennigs", "title": "Optimal Seat Allocation Under Social Distancing Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH math.OC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Covid-19 pandemic introduces new challenges and constraints for return to\nwork business planning. We describe a space allocation problem that\nincorporates social distancing constraints while optimising the number of\navailable safe workspaces in a return to work scenario. We propose and\ndemonstrate a graph based approach that solves the optimisation problem via\nmodelling as a bipartite graph of disconnected components over a graph of\nconstraints. We compare results obtained with a constrained random walk and a\nlinear programming approach.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 13:25:15 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Barry", "Michael", ""], ["Gambella", "Claudio", ""], ["Lorenzi", "Fabio", ""], ["Sheehan", "John", ""], ["Ploennigs", "Joern", ""]]}, {"id": "2105.06552", "submitter": "Goerschwin Fey", "authors": "Fin Hendrik Bahnsen and Goerschwin Fey", "title": "YAPS -- Your Open Examination System for Activating and emPowering\n  Students", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are numerous e-assessment systems devoted to specific domains under\ndiverse license models. Cost, extensibility, and maintainability are relevant\nissues for an institution. Ease of use and inclusion into courses are\neducator's main concerns. For students the user experience and fast transparent\nfeedback plus \"better\" tests are most important. Many exams still focus on\ntesting memorized knowledge, instead of improving and testing skills with\ncompetence-oriented learning support and examinations, respectively. We discuss\ndesign decisions and present the resulting architecture of YAPS - Your open\nAssessment system for emPowering Students. YAPS has been used for very diverse\nlectures in logistics, computer engineering, and algorithms for exams, but also\nfor empowering students by fast feedback during the learning period. We report\non results in a basic lecture on Computer Science for Mechanical Engineers.\n", "versions": [{"version": "v1", "created": "Tue, 27 Apr 2021 09:52:43 GMT"}], "update_date": "2021-05-17", "authors_parsed": [["Bahnsen", "Fin Hendrik", ""], ["Fey", "Goerschwin", ""]]}, {"id": "2105.11248", "submitter": "Martin Trefzer", "authors": "Linan Cao, Simon J. Bale, Martin A. Trefzer", "title": "Multi-objective Digital Design Optimisation via Improved Drive\n  Granularity Standard Cells", "comments": "This work has been submitted to the IEEE for possible publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To tackle the complexity of state-of-the-art electronic systems, silicon\nfoundries continuously shrink the technology nodes and electronic design\nautomation (EDA) vendors offer hierarchical design flows to decompose systems\ninto smaller blocks. However, such a staged design methodology consists of\nvarious levels of abstraction, where margins will be accumulated and result in\ndegradation of the overall design quality. This limits the full use of\ncapabilities of both the technology and EDA tools. In this work, a study of\ndrive granularity of standard cells is performed and an interpolation method is\nproposed for drive option expansion within original cell libraries. These aim\nto investigate how industrial synthesis tools deal with the drive strength\nselection using different granularity sets. In addition, a fully-automated,\nmulti-objective (MO) EDA digital flow is introduced for power, performance,\narea (PPA) optimisation based on drive strength refinement. This\npopulation-based search method better handles the increased difficulty of cell\nselection when using larger logic libraries, producing better optimised\nsolutions than standard tool flow in this case. The achieved experimental\nresults demonstrate how the improved drive granularity cells overall enhance\nthe quality of designs and how a significant improvement in trading off PPA is\nachieved by the MOEDA flow.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 15:37:22 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Cao", "Linan", ""], ["Bale", "Simon J.", ""], ["Trefzer", "Martin A.", ""]]}, {"id": "2105.12654", "submitter": "Henderik Alex Proper", "authors": "Alistair P. Barros, Arthur H. M. ter Hofstede, Henderik A. Proper,\n  Peter N. Creasy", "title": "Business Suitability Principles for Workflow Modelling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.SE", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  By incorporating aspects of coordination and collaboration, workflow\nimplementations of information systems require a sound conceptualisation of\n\\EM{business processing} semantics. Traditionally, the success of conceptual\nmodelling techniques has depended largely on the adequacy of conceptualisation,\nexpressive power, comprehensibility and formal foundation. An equally important\nrequirement, particularly with the increased conceptualisation of business\naspects, is \\EM{business suitability}. In this paper, the focus is on the\nbusiness suitability of workflow modelling for a commonly encountered class of\n(operational) business processing, e.g. those of insurance claims, bank loans\nand land conveyancing. A general assessment is first conducted on some\n\\EM{integrated} techniques characterising well-known paradigms - structured\nprocess modelling, object-oriented modelling, behavioural process modelling and\nbusiness-oriented modelling. Through this, an insight into business suitability\nwithin the broader perspective of technique adequacy, is gained. A specific\nbusiness suitability diagnosis then follows using a particular characterisation\nof business processing, i.e.\\ one where the intuitive semantics and\ninter-relationship of business services and business processes are nuanced. As\na result, five business suitability principles are elicited. These are proposed\nfor a more detailed understanding and (synthetic) development of workflow\nmodelling techniques. Accordingly, further insight into workflow specification\nlanguages and workflow globalisation in open distributed architectures may also\nbe gained.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2021 16:12:10 GMT"}], "update_date": "2021-05-27", "authors_parsed": [["Barros", "Alistair P.", ""], ["ter Hofstede", "Arthur H. M.", ""], ["Proper", "Henderik A.", ""], ["Creasy", "Peter N.", ""]]}, {"id": "2105.14817", "submitter": "Marc Zeller", "authors": "Chee Hung Koo, Stefan Rothbauer, Marian Vorderer, Kai Hoefig, Marc\n  Zeller", "title": "SQUADfps: Integrated Model-Based Machine Safety and Product Quality for\n  Flexible Production Systems", "comments": null, "journal-ref": "Papadopoulos Y., Aslansefat K., Katsaros P., Bozzano M. (eds)\n  Model-Based Safety and Assessment. IMBSA 2019. Lecture Notes in Computer\n  Science, vol 11842. Springer, Cham", "doi": "10.1007/978-3-030-32872-6_15", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Growing individualization of products up to lot-size-1 and high volatility of\nproduct mixes lead to new challenges in the manufacturing domain, including the\nneed for frequent reconfiguration of the system and reacting to changing\norders. Thus, apart from functional aspects, safety aspects of the production\nsystem as well as product quality assurance aspects must be addressed for\nflexible and reconfigurable manufacturing systems at runtime. To cope with the\nmentioned challenges, we present an integrated model-based approach SQUADfps\n(machine Safety and product QUAlity for flexible proDuction systems) to support\nthe automatic conduct of the risk assessment of flexible production scenarios\nin terms of safety as well as the process-FMEA to ensure that the requirements\nw.r.t. the quality of the production process and the resulting product are met.\nOur approach is based on a meta-model which captures all information needed to\nconduct both risk assessment and process-FMEA dynamically during the runtime,\nand thus enables flexible manufacturing scenarios with frequent changes of the\nproduction system and orders up to a lot-size of one while guaranteeing safety\nand product quality requirements. The automatically generated results will\nassist human in making further decisions. To demonstrate the feasibility of our\napproach, we apply it to a case study.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 09:28:38 GMT"}, {"version": "v2", "created": "Fri, 4 Jun 2021 05:42:48 GMT"}], "update_date": "2021-06-07", "authors_parsed": [["Koo", "Chee Hung", ""], ["Rothbauer", "Stefan", ""], ["Vorderer", "Marian", ""], ["Hoefig", "Kai", ""], ["Zeller", "Marc", ""]]}, {"id": "2105.14984", "submitter": "Marc Zeller", "authors": "Daniel Schneider, Mario Trapp, Yiannis Papadopoulos, Eric Armengaud,\n  Marc Zeller, Kai Hoefig", "title": "WAP: Digital Dependability Identities", "comments": null, "journal-ref": "2015 IEEE 26th International Symposium on Software Reliability\n  Engineering (ISSRE)", "doi": "10.1109/ISSRE.2015.7381825", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyber-Physical Systems (CPS) provide enormous potential for innovation but a\nprecondition for this is that the issue of dependability has been addressed.\nThis paper presents the concept of a Digital Dependability Identity (DDI) of a\ncomponent or system as foundation for assuring the dependability of CPS. A DDI\nis an analyzable and potentially executable model of information about the\ndependability of a component or system. We argue that DDIs must fulfill a\nnumber of properties including being universally useful across supply chains,\nenabling off-line certification of systems where possible, and providing\ncapabilities for in-field certification of safety of CPS. In this paper, we\nfocus on system safety as one integral part of dependability and as a practical\ndemonstration of the concept, we present an initial implementation of DDIs in\nthe form of Conditional Safety Certificates (also known as ConSerts). We\nexplain ConSerts and their practical operationalization based on an\nillustrative example.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 14:13:25 GMT"}], "update_date": "2021-06-03", "authors_parsed": [["Schneider", "Daniel", ""], ["Trapp", "Mario", ""], ["Papadopoulos", "Yiannis", ""], ["Armengaud", "Eric", ""], ["Zeller", "Marc", ""], ["Hoefig", "Kai", ""]]}, {"id": "2105.14992", "submitter": "Marc Zeller", "authors": "Marc Zeller, Kai Hoefig", "title": "INSiDER: Incorporation of system and safety analysis models using a\n  dedicated reference model", "comments": null, "journal-ref": "2016 Annual Reliability and Maintainability Symposium (RAMS)", "doi": "10.1109/RAMS.2016.7448074", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to enable model-based, iterative design of safety-relevant systems,\nan efficient incorporation of safety and system engineering is a pressing need.\nOur approach interconnects system design and safety analysis models efficiently\nusing a dedicated reference model. Since all information are available in a\nstructured way, traceability between the model elements and consistency checks\nenable automated synchronization to guarantee that information within both kind\nof models are consistent during the development life-cycle.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 14:23:53 GMT"}], "update_date": "2021-06-02", "authors_parsed": [["Zeller", "Marc", ""], ["Hoefig", "Kai", ""]]}]