[{"id": "0802.1218", "submitter": "Santo Fortunato Dr", "authors": "Andrea Lancichinetti, Santo Fortunato, Janos Kertesz", "title": "Detecting the overlapping and hierarchical community structure of\n  complex networks", "comments": "20 pages, 8 figures. Final version published on New Journal of\n  Physics", "journal-ref": "New Journal of Physics 11, 033015 (2009)", "doi": "10.1088/1367-2630/11/3/033015", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech physics.comp-ph stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many networks in nature, society and technology are characterized by a\nmesoscopic level of organization, with groups of nodes forming tightly\nconnected units, called communities or modules, that are only weakly linked to\neach other. Uncovering this community structure is one of the most important\nproblems in the field of complex networks. Networks often show a hierarchical\norganization, with communities embedded within other communities; moreover,\nnodes can be shared between different communities. Here we present the first\nalgorithm that finds both overlapping communities and the hierarchical\nstructure. The method is based on the local optimization of a fitness function.\nCommunity structure is revealed by peaks in the fitness histogram. The\nresolution can be tuned by a parameter enabling to investigate different\nhierarchical levels of organization. Tests on real and artificial networks give\nexcellent results.\n", "versions": [{"version": "v1", "created": "Fri, 8 Feb 2008 21:30:51 GMT"}, {"version": "v2", "created": "Wed, 11 Mar 2009 09:53:44 GMT"}], "update_date": "2009-03-11", "authors_parsed": [["Lancichinetti", "Andrea", ""], ["Fortunato", "Santo", ""], ["Kertesz", "Janos", ""]]}, {"id": "0802.1357", "submitter": "Jean-Michel Marin", "authors": "Lionel Cucala, Jean-Michel Marin, Christian Robert and Mike\n  Titterington", "title": "A Bayesian reassessment of nearest-neighbour classification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.CO math.ST stat.TH", "license": null, "abstract": "  The k-nearest-neighbour procedure is a well-known deterministic method used\nin supervised classification. This paper proposes a reassessment of this\napproach as a statistical technique derived from a proper probabilistic model;\nin particular, we modify the assessment made in a previous analysis of this\nmethod undertaken by Holmes and Adams (2002,2003), and evaluated by Manocha and\nGirolami (2007), where the underlying probabilistic model is not completely\nwell-defined. Once a clear probabilistic basis for the k-nearest-neighbour\nprocedure is established, we derive computational tools for conducting Bayesian\ninference on the parameters of the corresponding model. In particular, we\nassess the difficulties inherent to pseudo-likelihood and to path sampling\napproximations of an intractable normalising constant, and propose a perfect\nsampling strategy to implement a correct MCMC sampler associated with our\nmodel. If perfect sampling is not available, we suggest using a Gibbs sampling\napproximation. Illustrations of the performance of the corresponding Bayesian\nclassifier are provided for several benchmark datasets, demonstrating in\nparticular the limitations of the pseudo-likelihood approximation in this\nset-up.\n", "versions": [{"version": "v1", "created": "Sun, 10 Feb 2008 23:28:34 GMT"}], "update_date": "2008-02-12", "authors_parsed": [["Cucala", "Lionel", ""], ["Marin", "Jean-Michel", ""], ["Robert", "Christian", ""], ["Titterington", "Mike", ""]]}, {"id": "0802.1521", "submitter": "Stephanie Allassonniere", "authors": "St\\'ephanie Allassonni\\`ere (CMAP), Estelle Kuhn (LAGA)", "title": "Stochastic Algorithm For Parameter Estimation For Dense Deformable\n  Template Mixture Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.CO math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Estimating probabilistic deformable template models is a new approach in the\nfields of computer vision and probabilistic atlases in computational anatomy. A\nfirst coherent statistical framework modelling the variability as a hidden\nrandom variable has been given by Allassonni\\`ere, Amit and Trouv\\'e in [1] in\nsimple and mixture of deformable template models. A consistent stochastic\nalgorithm has been introduced in [2] to face the problem encountered in [1] for\nthe convergence of the estimation algorithm for the one component model in the\npresence of noise. We propose here to go on in this direction of using some\n\"SAEM-like\" algorithm to approximate the MAP estimator in the general Bayesian\nsetting of mixture of deformable template model. We also prove the convergence\nof this algorithm toward a critical point of the penalised likelihood of the\nobservations and illustrate this with handwritten digit images.\n", "versions": [{"version": "v1", "created": "Mon, 11 Feb 2008 20:08:27 GMT"}, {"version": "v2", "created": "Fri, 16 Jan 2009 15:48:38 GMT"}], "update_date": "2009-01-16", "authors_parsed": [["Allassonnière", "Stéphanie", "", "CMAP"], ["Kuhn", "Estelle", "", "LAGA"]]}, {"id": "0802.2581", "submitter": "Hisayuki Hara", "authors": "Hisayuki Hara and Akimichi Takemura", "title": "A Localization Approach to Improve Iterative Proportional Scaling in\n  Gaussian Graphical Models", "comments": "12 pages", "journal-ref": "Communications in Statistics Theory and Methods, 39, No.8,\n  1643-1654, 2010", "doi": "10.1080/03610920802238662", "report-no": null, "categories": "stat.CO stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss an efficient implementation of the iterative proportional scaling\nprocedure in the multivariate Gaussian graphical models. We show that the\ncomputational cost can be reduced by localization of the update procedure in\neach iterative step by using the structure of a decomposable model obtained by\ntriangulation of the graph associated with the model. Some numerical\nexperiments demonstrate the competitive performance of the proposed algorithm.\n", "versions": [{"version": "v1", "created": "Tue, 19 Feb 2008 03:00:55 GMT"}, {"version": "v2", "created": "Wed, 28 May 2008 01:07:24 GMT"}], "update_date": "2010-07-22", "authors_parsed": [["Hara", "Hisayuki", ""], ["Takemura", "Akimichi", ""]]}, {"id": "0802.3455", "submitter": "Xinjia Chen", "authors": "Xinjia Chen", "title": "A Truncation Approach for Fast Computation of Distribution Functions", "comments": "9 pages, no figure, revised Theorem 3", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a general approach for improving the efficiency of\ncomputing distribution functions. The idea is to truncate the domain of\nsummation or integration.\n", "versions": [{"version": "v1", "created": "Sat, 23 Feb 2008 19:13:10 GMT"}, {"version": "v2", "created": "Wed, 27 Feb 2008 15:34:42 GMT"}, {"version": "v3", "created": "Fri, 29 Feb 2008 01:01:34 GMT"}, {"version": "v4", "created": "Thu, 19 Jun 2008 19:25:11 GMT"}, {"version": "v5", "created": "Wed, 6 Aug 2008 23:02:38 GMT"}], "update_date": "2008-08-07", "authors_parsed": [["Chen", "Xinjia", ""]]}, {"id": "0802.3690", "submitter": "Jean-Michel Marin", "authors": "Alessandra Iacobucci, Jean-Michel Marin and Christian Robert", "title": "On variance stabilisation by double Rao-Blackwellisation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Population Monte Carlo has been introduced as a sequential importance\nsampling technique to overcome poor fit of the importance function. In this\npaper, we compare the performances of the original Population Monte Carlo\nalgorithm with a modified version that eliminates the influence of the\ntransition particle via a double Rao-Blackwellisation. This modification is\nshown to improve the exploration of the modes through an large simulation\nexperiment on posterior distributions of mean mixtures of distributions.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2008 20:13:58 GMT"}], "update_date": "2008-02-26", "authors_parsed": [["Iacobucci", "Alessandra", ""], ["Marin", "Jean-Michel", ""], ["Robert", "Christian", ""]]}]