[{"id": "1211.0749", "submitter": "Indriana Hidayah", "authors": "Indriana Hidayah, Alvi Syahrina, Adhistya Erna Permanasari", "title": "Student Modeling using Case-Based Reasoning in Conventional Learning\n  System", "comments": "4 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Conventional face-to-face classrooms are still the main learning system\napplied in Indonesia. In assisting such conventional learning towards an\noptimal learning, formative evaluations are needed to monitor the progress of\nthe class. This task can be very hard when the size of the class is large.\nHence, this research attempted to create a classroom monitoring system based on\nstudent data of Department of Electrical Engineering and Information\nTechnology. In order to achieve the goal, a student modeling using Case-Based\nReasoning was proposed. A generic student model based on a framework was\ndeveloped. The model represented student knowledge of a subject. The result\nshowed that the system was able to store and retrieve student data for\nsuggestion of the current situation and formative evaluation for one of the\nsubject in the Department.\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2012 03:09:33 GMT"}], "update_date": "2012-11-06", "authors_parsed": [["Hidayah", "Indriana", ""], ["Syahrina", "Alvi", ""], ["Permanasari", "Adhistya Erna", ""]]}, {"id": "1211.0938", "submitter": "Murphy Choy", "authors": "Murphy Choy, Michelle Cheong, Ma Nang Laik, Koo Ping Shung", "title": "US Presidential Election 2012 Prediction using Census Corrected Twitter\n  Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  US Presidential Election 2012 has been a very tight race between the two key\ncandidates. There were intense battle between the two key candidates. The\nelection reflects the sentiment of the electorate towards the achievements of\nthe incumbent President Obama. The campaign lasted several months and the\neffects can be felt in the internet and twitter. The presidential debates\ninjected new vigor in the challenger's campaign and successfully captured the\nelectorate of several states posing a threat to the incumbent's position. Much\nof the sentiment in the election has been captured in the online discussions.\nIn this paper, we will be using the original model described in Choy et. al.\n(2011) using twitter data to forecast the next US president.\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2012 17:29:46 GMT"}, {"version": "v2", "created": "Tue, 6 Nov 2012 17:37:29 GMT"}, {"version": "v3", "created": "Sun, 11 Nov 2012 11:41:09 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Choy", "Murphy", ""], ["Cheong", "Michelle", ""], ["Laik", "Ma Nang", ""], ["Shung", "Koo Ping", ""]]}, {"id": "1211.0970", "submitter": "Taha Yasseri", "authors": "M\\'arton Mesty\\'an, Taha Yasseri and J\\'anos Kert\\'esz", "title": "Early Prediction of Movie Box Office Success based on Wikipedia Activity\n  Big Data", "comments": "13 pages, Including Supporting Information, 7 Figures, Download the\n  dataset from: http://wwm.phy.bme.hu/SupplementaryDataS1.zip", "journal-ref": "PLoS ONE 8(8): e71226 (2013)", "doi": "10.1371/journal.pone.0071226", "report-no": null, "categories": "physics.soc-ph cs.CY cs.SI physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Use of socially generated \"big data\" to access information about collective\nstates of the minds in human societies has become a new paradigm in the\nemerging field of computational social science. A natural application of this\nwould be the prediction of the society's reaction to a new product in the sense\nof popularity and adoption rate. However, bridging the gap between \"real time\nmonitoring\" and \"early predicting\" remains a big challenge. Here we report on\nan endeavor to build a minimalistic predictive model for the financial success\nof movies based on collective activity data of online users. We show that the\npopularity of a movie can be predicted much before its release by measuring and\nanalyzing the activity level of editors and viewers of the corresponding entry\nto the movie in Wikipedia, the well-known online encyclopedia.\n", "versions": [{"version": "v1", "created": "Mon, 5 Nov 2012 18:54:10 GMT"}, {"version": "v2", "created": "Thu, 23 May 2013 17:28:59 GMT"}, {"version": "v3", "created": "Wed, 26 Jun 2013 14:38:59 GMT"}], "update_date": "2014-05-13", "authors_parsed": [["Mestyán", "Márton", ""], ["Yasseri", "Taha", ""], ["Kertész", "János", ""]]}, {"id": "1211.1035", "submitter": "Haluk O. Bingol", "authors": "Haluk O. Bingol and Omer Basar", "title": "Asymmetries of Men and Women in Selecting Partner", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates human dynamics in a large online dating site with\n3,000 new users daily who stay in the system for 3 months on the average. The\ndaily activity is also quite large such as 500,000 massage transactions, 5,000\nphoto uploads, and 20,000 votes.\n  The data investigated has 276, 210 male and 483, 963 female users. Based on\nthe activity that they made, there are clear distinctions between men and women\nin their pattern of behavior. Men prefer lower, women prefer higher\nqualifications in their partner.\n", "versions": [{"version": "v1", "created": "Fri, 2 Nov 2012 08:06:04 GMT"}], "update_date": "2012-11-07", "authors_parsed": [["Bingol", "Haluk O.", ""], ["Basar", "Omer", ""]]}, {"id": "1211.2028", "submitter": "Mohamed Firdhous", "authors": "Mohamed Firdhous and Ravindi Jayasundara", "title": "A Decision Support Tool for Inferring Further Education Desires of Youth\n  in Sri Lanka", "comments": "8 pages, 4 figures, 16 tables", "journal-ref": "International Journal of Advanced Computer Science and\n  Applications (IJACSA), vol. 2, no 6, June 2011, pp. 28-35", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the results of a study carried out to identify the\nfactors that influence the further education desires of Sri Lankan youth.\nStatistical modeling has been initially used to infer the desires of the youth\nand then a decision support tool has been developed based on the statistical\nmodel developed. In order to carry out the analysis and the development of the\nmodel, data collected as part of the National Youth Survey has been used. The\naccuracy of the model and the decision support tool has been tested by using a\nrandom data sets and the accuracy was found to be well above 80 percent, which\nis sufficient for any policy related decision making.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2012 02:26:51 GMT"}], "update_date": "2012-11-12", "authors_parsed": [["Firdhous", "Mohamed", ""], ["Jayasundara", "Ravindi", ""]]}, {"id": "1211.2033", "submitter": "Mohamed Firdhous", "authors": "Mohamed Firdhous and P. M. Karunaratne", "title": "An ICT Enhanced Life Quality for the Elderly in Developing Countries:\n  Analysis Study Applied to Sri Lanka", "comments": null, "journal-ref": "Journal of Health Informatics in Developing Countries, Vol. 5, No\n  1, 2011, pp. 47-59", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the recent years, the entire world has seen a tremendous increase in the\nelderly population. Even though countries differ in the numerical criterion for\ndefining the old age, the UN has agreed that the cutoff of 60+ years refers to\nthe older population. When the percentage of older population increases in a\ncountry, the country faces new challenges in the form of economical as well as\nsocial impacts. The economic impacts are felt in the form of a shortfall in\nlabor supply, income, household savings while an increase in the payment of\nretirement benefits and healthcare expenditures. On the social side, the\nelderly population feels continuously isolated due to the changes in the value\nsystem. The United Nations has identified five quality of life characteristics\nfor the elderly in its 1991 resolution named the United Nations Principles for\nOlder Persons. In this paper the authors initially look at the trends in the\nincrease of aged population in Asia in general and Sri Lanka in particular.\nThen they discuss how the quality of life characteristics can be achieved in a\ncost effective way through the use of Information and Communication Technology\n(ICT). The authors take an in depth look at the recent developments in field of\nICT and its penetration in developing countries especially Sri Lanka with\nspecial emphasis to constraints and challenges in adopting ICT for the\nimproving the quality of life of elderly.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2012 02:58:45 GMT"}], "update_date": "2012-11-12", "authors_parsed": [["Firdhous", "Mohamed", ""], ["Karunaratne", "P. M.", ""]]}, {"id": "1211.2313", "submitter": "Dirk Helbing", "authors": "Dirk Helbing, Steven Bishop, Paul Lukowicz and the FuturICT Consortium", "title": "FuturICT", "comments": "For related information see http://www.futurict.eu", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  FuturlCT is a FET Flagship project using collective, participatory research,\nintegrated across ICT, the social sciences and complexity science, to design\nsocio-inspired technology and develop a science of global, socially interactive\nsystems. The project will bring together, on a global level, Big Data, new\nmodelling techniques and new forms of interaction, leading to a new\nunderstanding of society and its coevolution with technology. It aims to\nunderstand, explore and manage our complex, connected world in a more\nsustainable and resilient way. FuturICT is motivated by the fact that\nubiquitous communication and sensing blur the boundaries between the physical\nand digital worlds, creating unparalleled opportunities for understanding the\nsocio-economic fabric of our world, and for empowering humanity to make\ninformed, responsible decisions for its future. The intimate, complex and\ndynamic relationship between global, networked ICT systems and human society\ndirectly influences the complexity and manageability of both. This also opens\nup the possibility to fundamentally change the way ICT will be designed, built\nand operated, to reflect the need for socially interactive, ethically\nsensitive, trustworthy, self-organised and reliable systems. FuturICT will\ncreate a new public resource - value-oriented tools and models to aggregate,\naccess, query and understand vast amounts of data. Information from open\nsources, real-time devices and mobile sensors will be integrated with\nmulti-scale models of the behaviour of social, technological, environmental and\neconomic systems, which can be interrogated by policy-makers, business people\nand citizens alike. Together, these will build an eco-system that will lead to\nnew business models, scientific paradigm shifts and more rapid and effective\nways to create and disseminate new knowledge and social benefits - thereby\nforming an innovation accelerator.\n", "versions": [{"version": "v1", "created": "Sat, 10 Nov 2012 10:11:10 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Helbing", "Dirk", ""], ["Bishop", "Steven", ""], ["Lukowicz", "Paul", ""], ["Consortium", "the FuturICT", ""]]}, {"id": "1211.2396", "submitter": "Rayed AlGhamdi", "authors": "Rayed AlGhamdi, Steve Drew and Thamer Alhussain", "title": "A Conceptual Framework for the Promotion of Trusted Online Retailing\n  Environment in Saudi Arabia", "comments": null, "journal-ref": "International Journal of Business and Management 2012", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a model conceptual framework that is aimed at promoting\ntrust in the online retailing environment in the Kingdom of Saudi Arabia (KSA).\nDespite rapid Internet growth, the development of online retailing in Saudi\nArabia continues to progress very slowly compared to that of the developed and\nleading developing countries. To determine the reason behind the sluggish\ngrowth of online retailing in the KSA, a mixed methods study involving\nretailers and customers was conducted in four stages. The outcomes of the study\npoint to distrust in the online retailing environment in Saudi Arabia as a key\ninhibitory factor for growth. As such, a five-part model is proposed to promote\ntrust in the online shopping environment in the KSA.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 11:22:14 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["AlGhamdi", "Rayed", ""], ["Drew", "Steve", ""], ["Alhussain", "Thamer", ""]]}, {"id": "1211.2398", "submitter": "Rayed AlGhamdi", "authors": "Rayed AlGhamdi, Steve Drew and Salem Alkhalaf", "title": "Government Initiatives: The Missing Key for E-commerce Growth in KSA", "comments": null, "journal-ref": "World Academy of Science, Engineering and Technology 77 2011", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper explores the issues that influence online retailing in Saudi\nArabia. Retailers in Saudi Arabia have been reserved in their adoption of\nelectronically delivered aspects of their business. Despite the fact that Saudi\nArabia has the largest and fastest growth of ICT marketplaces in the Arab\nregion, e-commerce activities are not progressing at the same speed. Only very\nfew Saudi companies, mostly medium and large companies from the manufacturing\nsector, are involved in e-commerce implementation. Based on qualitative data\ncollected by conducting interviews with 16 retailers and 16 potential customers\nin Saudi Arabia, several factors influencing online retailing diffusion in\nSaudi Arabia are identified. However, government support comes the highest and\nmost influencing factor for online retailing growth as identified by both\nparties; retailers and potential customers in Saudi Arabia.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 11:25:07 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["AlGhamdi", "Rayed", ""], ["Drew", "Steve", ""], ["Alkhalaf", "Salem", ""]]}, {"id": "1211.2402", "submitter": "Rayed AlGhamdi", "authors": "Adel A. Bahaddad, Rayed AlGhamdi, Luke Houghton", "title": "To What Extent Would E-mall Enable SMEs to Adopt E-Commerce?", "comments": null, "journal-ref": "International Journal of Business and Management vol 7, no 22,\n  2012", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents findings from a study of e-commerce adoption by Small and\nMedium Enterprises (SMEs) in Saudi Arabia. Only tiny number of Saudi commercial\norganizations, mostly medium and large companies from the manufacturing sector,\nin involved in e-commerce implementation. The latest report released in 2010 by\nThe Communications and Information Technology Commission (CITC) in Saudi Arabia\nshows that only 8% of businesses sell online. Accordingly new research has been\nconducted to explore to what extent electronic mall (e-mall) would enable SMEs\nin Saudi Arabia to adopt and use online channels for their sales. A\nquantitative analysis of responses obtained from a survey of 108 SMEs in Saudi\nArabia was conducted. The main results of the current analysis demonstrate the\nsignificant of organizational factors, and technology and environmental\nfactors. Interestingly, traditional & cultural factors have no significance in\nthis regard.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 11:37:32 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Bahaddad", "Adel A.", ""], ["AlGhamdi", "Rayed", ""], ["Houghton", "Luke", ""]]}, {"id": "1211.2404", "submitter": "Rayed AlGhamdi", "authors": "Rayed AlGhamdi, Steve Drew and Waleed Al-Ghaith", "title": "Factors unflinching e-commerce adoption by retailers in Saudi Arabia:\n  Qual Analysis", "comments": null, "journal-ref": "The Electronic Journal on Information Systems in Developing\n  Countries (2011)", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the preliminary findings of a study researching the\ndiffusion and the adoption of online retailing in Saudi Arabia. It reports new\nresearch that identifies and explores the key issues that positively and\nnegatively influence retailers in Saudi Arabia regarding the adoption of\nelectronic commerce. Retailers in Saudi Arabia have been reserved in their\nadoption of electronically delivered aspects of their business. Despite the\nfact that Saudi Arabia has the largest and fastest growth of ICT marketplaces\nin the Arab region, ecommerce activities are not progressing at the same speed.\nOnly a tiny number of Saudi commercial organizations, mostly medium and large\ncompanies from the manufacturing sector, are involved in e-commerce\nimplementation. Based on qualitative data, collected by conducting interviews\nwith a sample population of retail sector decision makers in Saudi Arabia, both\npositive and negative issues influencing retailer adoption of electronic\nretailing systems in Saudi Arabia are identified. A number of impediments which\ninclude cultural, business and technical issues were reported. Facilitating\nfactors include access to educational programs and awareness building of\ne-commerce, government support and assistance for ecommerce, trustworthy and\nsecure online payment options, developing strong ICT infrastructure, and\nprovision of sample e-commerce software to trial. While literature reveals that\ngovernment promotion has had limited effects on the diffusion of e-commerce in\nmost countries, this study significantly indicates government promotion and\nsupport as a key driver to online retailing in KSA.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 11:45:31 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["AlGhamdi", "Rayed", ""], ["Drew", "Steve", ""], ["Al-Ghaith", "Waleed", ""]]}, {"id": "1211.2406", "submitter": "Rayed AlGhamdi", "authors": "Osama Alfarraj, Steve Drew and Rayed AlGhamdi", "title": "EGovernment Stage Model: Evaluating the Rate of Web Development Progress\n  of Government Websites in Saudi Arabia", "comments": null, "journal-ref": "International Journal of Advanced Computer Science and\n  Applications, International Journal of Advanced Computer Science and\n  Applications Vol. 2, No. 9, 2011", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper contributes to the issue of eGovernment implementation in Saudi\nArabia by discussing the current situation of ministry websites. It evaluates\nthe rate of web development progress of vital government websites in Saudi\nArabia using the eGovernment stage model. In 2010, Saudi Arabia ranked 58th in\nthe world and 4th in the Gulf region in eGovernment readiness according to\nUnited Nations reports. In particular, Saudi Arabia has ranked 75th worldwide\nfor its online service index and its components compared to the neighbouring\nGulf country of Bahrain, which was ranked 8th for the same index. While this is\nstill modest in relation to the Saudi government expectation concerning its\nvision for eGovernment implementation for 2010, and the results achieved by the\nneighbouring Gulf countries such as Bahrain and the United Arab Emirates on the\neGovernment index, the Saudi government has endeavoured to meet the public\nneeds concerning eGovernment and carry out the implementation of eGovernment\nproperly. Governments may heed the importance of actively launching official\ngovernment websites as the main portals for delivering their online services to\nall the different categories of eGovernment (including G2C, G2B, and G2G).\nHowever, certain Saudi ministries have not given due attention to this vital\nissue. This is evidenced by the fact that some of their websites are not fully\ndeveloped or do not yet exist, which clearly impedes that particular ministry\nfrom appropriately delivering eServices.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 11:55:31 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Alfarraj", "Osama", ""], ["Drew", "Steve", ""], ["AlGhamdi", "Rayed", ""]]}, {"id": "1211.2407", "submitter": "Rayed AlGhamdi", "authors": "Rayed AlGhamdi, Ann Nguyen, Jeremy Nguyen and Steve Drew", "title": "Factors influencing the decision of Saudi consumers to purchase form\n  online retailers: Quantitative Analysis", "comments": null, "journal-ref": "IADIS International Conference e-Commerce 2011", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This paper presents the preliminary findings of a study researching the\ndiffusion and the adoption of online retailing in Saudi Arabia. It reports new\nresearch that identifies and explores the key issues that positively and\nnegatively influence the decision of Saudi customers to buy from online\nretailers in Saudi Arabia. Although Saudi Arabia has the largest and fastest\ngrowth of ICT marketplaces in the Arab region, e-commerce activities are not\nprogressing at the same speed. While the overall research project involves\nexploratory research using mixed methods, the focus of this paper is on a\nquantitative analysis of responses obtained from a survey of Saudi customers,\nwith the design of the questionnaire instrument being based on the findings of\na qualitative analysis reported in a previous paper. The main findings of the\ncurrent analysis include a list of key factors that affect Saudi customers'\npurchase from Saudi online retailers, and quantitative indications of the\nrelative strengths of the various relationships.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 12:03:14 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["AlGhamdi", "Rayed", ""], ["Nguyen", "Ann", ""], ["Nguyen", "Jeremy", ""], ["Drew", "Steve", ""]]}, {"id": "1211.2410", "submitter": "Rayed AlGhamdi", "authors": "Mohammed Alshehri, Steve Drew, Thamer Alhussain and Rayed Alghamdi", "title": "The Effects of Website Quality on Adoption of E-Government Service:\n  AnEmpirical Study Applying UTAUT Model Using SEM", "comments": "23rd Australasian Conference On Information Systems 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In today global age, e-government services have become the main channel for\nonline communication between the government and its citizens. They aim to\nprovide citizens with more accessible, accurate, real-time and high quality\nservices. Therefore, the quality of government websites which provide\ne-services is an essential factor in the successful adoption of e-government\nservices by the public. This paper discusses an investigation of the effect of\nthe Website Quality (WQ) factor on the acceptance of using e-government\nservices (G2C) in the Kingdom of Saudi Arabia (KSA) by adopting the Unified\nTheory of Acceptance and Use of Technology (UTAUT) Model. Survey Data collected\nfrom 400 respondents were examined using the structural equation modelling\n(SEM) technique and utilising AMOS tools. This study found that the factors\nthat significantly influenced the Use Behaviour of e-government services in KSA\n(USE) include Performance Expectancy (PE), Effort expectancy (EE), Facilitating\nConditions (FC) and Website Quality (WQ), while the construct known Social\nInfluence (SI) did not. Moreover, the results confirm the importance of quality\ngovernment websites and support systems as one of the main significant and\ninfluential factors of e-government services adoption. The results of this\nstudy can be helpful to Saudi governmental sectors to adjust their corporate\nstrategies and plans to advance successful adoption and diffusion of\ne-government services (G2C) in KSA.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 12:27:27 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Alshehri", "Mohammed", ""], ["Drew", "Steve", ""], ["Alhussain", "Thamer", ""], ["Alghamdi", "Rayed", ""]]}, {"id": "1211.2495", "submitter": "Mohamed Firdhous", "authors": "M. F. M. Firdhous and D. L. Basnayake and K. H. L. Kodithuwakku and N.\n  K. Haththalla and N. W. Charlin and P. M. R. I. K. Bandara", "title": "Route Planning Made Easy - An Automated System for Sri Lanka", "comments": "17 pages, 17 figures and 2 tables", "journal-ref": "Route Planning Made Easy-An Automated System for Sri Lanka, Bhumi:\n  the Planning Research Journal of the University of Moratuwa, Vol. 02 No. 02,\n  2010, pp. 13-24", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Commercial cities like Colombo constantly face to problem of traffic\ncongestion due to the large number of people visiting the city for various\nreasons. Also these cities have a large number of roads with many roads\nconnecting any two selected locations. Finding the best path between two\nlocations in Colombo city is not a trivial task, due to the complexity of the\nroad network and other reasons such as heavy traffic, changes to the road\nnetworks such as road closures and one-ways. This paper presents the results of\na study carried out to understand this problem and development of a system to\nplan the travel way ahead of the planned day or time of the journey. This\nsystem can compute the best route from between two locations taking multiple\nfactors such as traffic conditions, road closures or one-way declarations etc.,\ninto account. This system also has the capability to compute the best route\nbetween any two locations on a future date based on the road conditions on that\ndate. The system comprises three main modules and two user interfaces one for\nnormal users and the other for administrators. The Administrative interface can\nonly be accessed via web browser running on a computer, while the other\ninterface can be accessed either via a web browser or a GPRS enabled mobile\nphone. The system is powered mainly by the Geographic Information System (GIS)\ntechnology and the other supporting technologies used are database management\nsystem, ASP.Net technology and the GPRS technology. Finally the developed\nsystem was evaluated for its functionality and user friendliness using a user\nsurvey. The results of the survey are also presented in this paper.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2012 02:13:46 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Firdhous", "M. F. M.", ""], ["Basnayake", "D. L.", ""], ["Kodithuwakku", "K. H. L.", ""], ["Haththalla", "N. K.", ""], ["Charlin", "N. W.", ""], ["Bandara", "P. M. R. I. K.", ""]]}, {"id": "1211.2573", "submitter": "Loet Leydesdorff", "authors": "Inga A. Ivanova, Loet Leydesdorff", "title": "Rotational Symmetry and the Transformation of Innovation Systems in a\n  Triple Helix of University-Industry-Government Relations", "comments": "Technological Forecasting and Social Change (forthcoming)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using a mathematical model, we show that a Triple Helix (TH) system contains\nself-interaction, and therefore self-organization of innovations can be\nexpected in waves, whereas a Double Helix (DH) remains determined by its linear\nconstituents. (The mathematical model is fully elaborated in the Appendices.)\nThe ensuing innovation systems can be expected to have a fractal structure:\ninnovation systems at different scales can be considered as spanned in a\nCartesian space with the dimensions of (S)cience, (B)usiness, and (G)overnment.\nA national system, for example, contains sectorial and regional systems, and is\na constituent part in technological and supra-national systems of innovation.\nThe mathematical modeling enables us to clarify the mechanisms, and provides\nnew possibilities for the prediction. Emerging technologies can be expected to\nbe more diversified and their life cycles will become shorter than before. In\nterms of policy implications, the model suggests a shift from the production of\nmaterial objects to the production of innovative technologies.\n", "versions": [{"version": "v1", "created": "Mon, 12 Nov 2012 11:23:25 GMT"}, {"version": "v2", "created": "Mon, 3 Dec 2012 16:07:01 GMT"}, {"version": "v3", "created": "Tue, 13 Aug 2013 10:42:00 GMT"}], "update_date": "2013-08-14", "authors_parsed": [["Ivanova", "Inga A.", ""], ["Leydesdorff", "Loet", ""]]}, {"id": "1211.2799", "submitter": "Rayed AlGhamdi", "authors": "Rayed AlGhamdi, Ann Nguyen, Jeremy Nguyen and Steve Drew", "title": "Factors influencing E-commerce Adoption by Retailers in Saudi Arabia", "comments": "International Conference on Internet Studies. arXiv admin note: text\n  overlap with arXiv:1211.2407, arXiv:1211.2396, arXiv:1211.2398", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents some findings from a study researching the diffusion and\nadoption of online retailing in Saudi Arabia. Although the country has the\nlargest and fastest growing ICT marketplace in the Arab region, e-commerce\nactivities have not progressed at a similar speed. In general, Saudi retailers\nhave not responded actively to the global growth of online retailing.\nAccordingly new research has been conducted to identify and explore key issues\nthat positively and negatively influence Saudi retailers in deciding whether to\nadopt the online channel. While the overall research project uses mixed\nmethods, the focus of this paper is on a quantitative analysis of responses\nobtained from a survey of retailers in Saudi Arabia, with the design of the\nquestionnaire instrument being based on the findings of a qualitative analysis\nreported in a previous paper. The main findings of the current analysis include\na list of key factors that affect retailers decision to adopt e-commerce, and\nquantitative indications of the relative strengths of the various\nrelationships.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 11:34:21 GMT"}], "update_date": "2012-11-14", "authors_parsed": [["AlGhamdi", "Rayed", ""], ["Nguyen", "Ann", ""], ["Nguyen", "Jeremy", ""], ["Drew", "Steve", ""]]}, {"id": "1211.2875", "submitter": "Maged  Ibrahim", "authors": "Maged hamada Ibrahim", "title": "A Novel Approach to Fully Private and Secure Auction: A Sealed Bid\n  Knapsack Auction", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In an electronic auction protocol, the main participants are the seller, a\nset of trusted auctioneer(s) and the set of bidders. In this paper we consider\nthe situation where there is a seller and a set of n bidders intending to come\nto an agreement on the selling price of a certain good. Full private or\nbidder-resolved auction means that this agreement is reached without the help\nof trusted parties or auctioneers. Therefore, only the seller and the set of\nbidders are involved, the role of the auctioneers becomes obsolete in this\ncase. property.We propose a new technique for the design of a full private\nsealed-bid auction protocol.\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2012 02:12:49 GMT"}], "update_date": "2012-11-14", "authors_parsed": [["Ibrahim", "Maged hamada", ""]]}, {"id": "1211.3089", "submitter": "Yuheng Hu", "authors": "Yuheng Hu, Ajita John, Fei Wang, Subbarao Kambhampati", "title": "ET-LDA: Joint Topic Modeling for Aligning Events and their Twitter\n  Feedback", "comments": "reference error, delete for now", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During broadcast events such as the Superbowl, the U.S. Presidential and\nPrimary debates, etc., Twitter has become the de facto platform for crowds to\nshare perspectives and commentaries about them. Given an event and an\nassociated large-scale collection of tweets, there are two fundamental research\nproblems that have been receiving increasing attention in recent years. One is\nto extract the topics covered by the event and the tweets; the other is to\nsegment the event. So far these problems have been viewed separately and\nstudied in isolation. In this work, we argue that these problems are in fact\ninter-dependent and should be addressed together. We develop a joint Bayesian\nmodel that performs topic modeling and event segmentation in one unified\nframework. We evaluate the proposed model both quantitatively and qualitatively\non two large-scale tweet datasets associated with two events from different\ndomains to show that it improves significantly over baseline models.\n", "versions": [{"version": "v1", "created": "Tue, 13 Nov 2012 19:46:51 GMT"}, {"version": "v2", "created": "Fri, 21 Dec 2012 05:50:15 GMT"}], "update_date": "2012-12-24", "authors_parsed": [["Hu", "Yuheng", ""], ["John", "Ajita", ""], ["Wang", "Fei", ""], ["Kambhampati", "Subbarao", ""]]}, {"id": "1211.3148", "submitter": "Rayed AlGhamdi", "authors": "Rayed AlGhamdi and Steve Drew", "title": "Seven Key Drivers to Online Retailing Growth in KSA", "comments": "IADIS International Conference e-Society 2011. arXiv admin note:\n  substantial text overlap with arXiv:1211.2398, arXiv:1211.2404,\n  arXiv:1211.2799", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Retailers in Saudi Arabia have been reserved in their adoption of\nelectronically delivered aspects of their business. This paper reports research\nthat identifies and explores key issues to enhance the diffusion of online\nretailing in Saudi Arabia. Despite the fact that Saudi Arabia has the largest\nand fastest growth of ICT marketplaces in the Arab region, e-commerce\nactivities are not progressing at the same speed. Only very few Saudi\ncompanies, mostly medium and large companies from the manufacturing sector, are\ninvolved in e-commerce implementation. Based on qualitative data collected by\nconducting interviews with 16 retailers and 16 potential customers in Saudi\nArabia, 7 key drivers to online retailing diffusion in Saudi Arabia are\nidentified. These key drivers are government support, providing trustworthy and\nsecure online payments options, provision of individual house mailboxes,\nproviding high speed Internet connection at low cost, providing educational\nprograms, the success of bricks-and-clicks model, and competitive prices.\n", "versions": [{"version": "v1", "created": "Sun, 11 Nov 2012 12:14:56 GMT"}], "update_date": "2012-12-13", "authors_parsed": [["AlGhamdi", "Rayed", ""], ["Drew", "Steve", ""]]}, {"id": "1211.3218", "submitter": "Cm Pintea", "authors": "Camelia-M. Pintea, Petrica C. Pop, Mara Hajdu-Macelaru", "title": "Classical hybrid approaches on a transportation problem with gas\n  emissions constraints", "comments": "4 pages, 1 figure", "journal-ref": "Advances in Intelligent Systems and Computing, 188:449-458, 2013", "doi": "10.1007/978-3-642-32922-7_46", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to keep a green planet, in particular its important to limiting the\npollution with gas emissions. In a specific capacitated fixed-charge\ntransportation problem with fixed capacities for distribution centers and\ncustomers with particular demands, the objective is to keep the pollution\nfactor in a given range while the total cost of the transportation is as low as\npossible. In order to solve this problem, we developed several hybrid variants\nof the nearest neighbor classical approach. The proposed models are analyzed on\na set of instances used in the literature. The preliminary results shows that\nthe newly approaches are attractive and appropriate for solving the described\ntransportation problem.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2012 07:16:29 GMT"}], "update_date": "2012-11-15", "authors_parsed": [["Pintea", "Camelia-M.", ""], ["Pop", "Petrica C.", ""], ["Hajdu-Macelaru", "Mara", ""]]}, {"id": "1211.4226", "submitter": "Rivindu Perera", "authors": "Rivindu Perera", "title": "Education for All: Remote testing system with gesture recognition and\n  recording", "comments": "5 pages, International Journal of Advances in Engineering, Science\n  and Technology 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Etymologically, in Latin expresses \"educare\", that means to bring out, or be\nengaged in the infinite process of learning to present to the society as a\nvaluable citizen. However, unfortunately especially in third world countries,\neducation cannot be achieved due to, lack of inorganic and organic resources.\nHowever, many third world countries have embraced the concepts such as One\nLaptop per Child, facilitating the students to learn. The effective adaptation\nof these concepts has being launched through many government and non-government\nprojects, providing inorganic resources. However, inorganic resources alone\ncannot provide quality education, as learning needs assessment procedures,\nfeedback generators and trainers who could guide the students to gain\nknowledge. This paper attempts to introduce an acceptable solution that can be\nused to address facilitating resources to enhance the learning experience\nthrough enabling organic resources such as teachers, instructors and trainers\non a remote mode through technology. This paper introduces a software system\nthat is used to design and distribute examinations and detect gestures of\nstudents while answering remotely. The feature enables the teacher or\ninstructor to gain a better understanding about the learner's attitude when\ntaking the assessment. The content of the paper is organized to give the basic\nidea of the system and it includes description of the system and practical\neffectiveness of the system with evaluations from different views. A java\nenabled computer with a webcam and internet access is the minimum requirements\nto be able to use the proposed system. The development platform is based on\njava, with the use of \"Chilkat\" to maintain an asynchronous connection with the\nFTP server. \"iGesture\" and \"Yuille\" approach play major role in gesture\ndetection and recognition.\n", "versions": [{"version": "v1", "created": "Sun, 18 Nov 2012 15:39:44 GMT"}], "update_date": "2012-11-20", "authors_parsed": [["Perera", "Rivindu", ""]]}, {"id": "1211.4627", "submitter": "Nicolas Kourtellis Ph.D.", "authors": "Nicolas Kourtellis, Jeremy Blackburn, Cristian Borcea and Adriana\n  Iamnitchi", "title": "Enabling Social Applications via Decentralized Social Data Management", "comments": "27 pages, single ACM column, 9 figures, accepted in Special Issue of\n  Foundations of Social Computing, ACM Transactions on Internet Technology", "journal-ref": "ACM Trans. Internet Technol. 15, 1, (March 2015)", "doi": "10.1145/2700057", "report-no": null, "categories": "cs.SI cs.CY cs.DC physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An unprecedented information wealth produced by online social networks,\nfurther augmented by location/collocation data, is currently fragmented across\ndifferent proprietary services. Combined, it can accurately represent the\nsocial world and enable novel socially-aware applications. We present\nPrometheus, a socially-aware peer-to-peer service that collects social\ninformation from multiple sources into a multigraph managed in a decentralized\nfashion on user-contributed nodes, and exposes it through an interface\nimplementing non-trivial social inferences while complying with user-defined\naccess policies. Simulations and experiments on PlanetLab with emulated\napplication workloads show the system exhibits good end-to-end response time,\nlow communication overhead and resilience to malicious attacks.\n", "versions": [{"version": "v1", "created": "Mon, 19 Nov 2012 23:31:58 GMT"}, {"version": "v2", "created": "Tue, 28 Apr 2015 13:25:28 GMT"}], "update_date": "2015-04-29", "authors_parsed": [["Kourtellis", "Nicolas", ""], ["Blackburn", "Jeremy", ""], ["Borcea", "Cristian", ""], ["Iamnitchi", "Adriana", ""]]}, {"id": "1211.4986", "submitter": "Sonja Kabicher-Fuchs", "authors": "Sonja Kabicher-Fuchs and Stefanie Rinderle-Ma and Jan Recker and Marta\n  Indulska and Francois Charoy and Rob Christiaanse and Reinhold Dunkl and\n  Gregor Grambow and Jens Kolb and Henrik Leopold and Jan Mendling", "title": "Human-Centric Process-Aware Information Systems (HC-PAIS)", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": "TR-201211213534", "categories": "cs.HC cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Process-Aware Information Systems (PAIS) support organizations in managing\nand automating their processes. A full automation of processes is in particular\nindustries, such as service-oriented markets, not practicable. The integration\nof humans in PAIS is necessary to manage and perform processes that require\nhuman capabilities, judgments and decisions. A challenge of interdisciplinary\nPAIS research is to provide concepts and solutions that support human\nintegration in PAIS and human orientation of PAIS in a way that provably\nincrease the PAIS users' satisfaction and motivation with working with the\nHuman-Centric Process Aware Information System (HC-PAIS) and consequently\ninfluence users' performance of tasks. This work is an initial step of research\nthat aims at providing a definition of Human-Centric Process Aware Information\nSystems (HC-PAIS) and future research challenges of HC-PAIS. Results of focus\ngroup research are presented.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2012 10:36:12 GMT"}], "update_date": "2012-11-22", "authors_parsed": [["Kabicher-Fuchs", "Sonja", ""], ["Rinderle-Ma", "Stefanie", ""], ["Recker", "Jan", ""], ["Indulska", "Marta", ""], ["Charoy", "Francois", ""], ["Christiaanse", "Rob", ""], ["Dunkl", "Reinhold", ""], ["Grambow", "Gregor", ""], ["Kolb", "Jens", ""], ["Leopold", "Henrik", ""], ["Mendling", "Jan", ""]]}, {"id": "1211.5167", "submitter": "Jessika Trancik", "authors": "Luis M. A. Bettencourt, Jessika E. Trancik, Jasleen Kaur", "title": "Determinants of the Pace of Global Innovation in Energy Technologies", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0067864", "report-no": null, "categories": "physics.soc-ph cs.CY stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the factors driving innovation in energy technologies is of\ncritical importance to mitigating climate change and addressing other\nenergy-related global challenges. Low levels of innovation, measured in terms\nof energy patent filings, were noted in the 1980s and 90s as an issue of\nconcern and were attributed to low investment in public and private research\nand development (R&D). Here we build a comprehensive global database of energy\npatents covering the period 1970-2009 which is unique in its temporal and\ngeographical scope. Analysis of the data reveals a recent, marked departure\nfrom historical trends. A sharp increase in rates of patenting has occurred\nover the last decade, particularly in renewable technologies, despite continued\nlow levels of R&D funding. To solve the puzzle of fast innovation despite\nmodest R&D increases we develop a model that explains the nonlinear response\nobserved in the empirical data of technological innovation to various types of\ninvestment. The model reveals a regular relationship between patents, R&D\nfunding, and growing markets across technologies, and accurately predicts\npatenting rates at different stages of technological maturity and market\ndevelopment. We show quantitatively how growing markets have formed a vital\ncomplement to public R&D in driving innovative activity; these two forms of\ninvestment have each leveraged the effect of the other in driving patenting\ntrends over long periods of time.\n", "versions": [{"version": "v1", "created": "Wed, 21 Nov 2012 23:06:49 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Bettencourt", "Luis M. A.", ""], ["Trancik", "Jessika E.", ""], ["Kaur", "Jasleen", ""]]}, {"id": "1211.5322", "submitter": "Hector Zenil", "authors": "Hector Zenil", "title": "What is Nature-like Computation? A Behavioural Approach and a Notion of\n  Programmability", "comments": "31 pages, 4 figures, special issue on History and Philosophy of\n  Computing. Philosophy & Technology, Springer, 2012. The final publication is\n  available at http://springerlink.com", "journal-ref": null, "doi": "10.1007/s13347-012-0095-2", "report-no": null, "categories": "cs.LO cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this paper is to propose an alternative behavioural definition of\ncomputation (and of a computer) based simply on whether a system is capable of\nreacting to the environment-the input-as reflected in a measure of\nprogrammability. This definition is intended to have relevance beyond the realm\nof digital computers, particularly vis-a-vis natural systems. This will be done\nby using an extension of a phase transition coefficient previously defined in\nan attempt to characterise the dynamical behaviour of cellular automata and\nother systems. The transition coefficient measures the sensitivity of a system\nto external stimuli, and will be used to define the susceptibility of a system\nto being (efficiently) programmed.\n", "versions": [{"version": "v1", "created": "Thu, 22 Nov 2012 16:01:57 GMT"}], "update_date": "2012-11-26", "authors_parsed": [["Zenil", "Hector", ""]]}, {"id": "1211.5514", "submitter": "Stanislaw D. Glazek", "authors": "Stanislaw D. Glazek", "title": "Estimate of resources required for a meaningful reform of education", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.ed-ph cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A simple estimate in terms of currency units shows that a meaningful\neducational reform process can be launched and sustained over many generations\nof teachers with support of parents of students. In the estimate, the steady\ninflow of resources from parents provides support for advanced studies by\nteachers. Not to waste the resources on spurious activities, the estimated\ninflow proceeds directly from the parents as clients to the providers of\nrequired reform program. The providers are the experts in various disciplines\nwho excel in helping teachers become great. Their services to teachers are\nultimately assessed by parents on the basis of changes in behavior of children.\nThe resulting reform program grows slowly from small seeds. The running cost of\nthe reform process to parents appears surprisingly low while its development\nleads to the desired changes over time.\n", "versions": [{"version": "v1", "created": "Fri, 23 Nov 2012 14:27:42 GMT"}], "update_date": "2012-11-26", "authors_parsed": [["Glazek", "Stanislaw D.", ""]]}, {"id": "1211.5648", "submitter": "Alfred Coleman DR", "authors": "Alfred Coleman, Marlien E Herselman, Mary Coleman", "title": "Improving Computer-Mediated Synchronous Communication of Doctors in\n  Rural Communities through Cloud Computing: A Case Study of Rural Hospitals in\n  South Africa", "comments": "10", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigated how doctors in remote rural hospitals in South Africa\nuse computer-mediated tool to communicate with experienced and specialist\ndoctors for professional advice to improve on their clinical practices. A case\nstudy approach was used. Ten doctors were purposively selected from ten\nhospitals in the North West Province. Data was collected using semi-structured\nopen ended interview questions. The interviewees were asked to tell in their\nown words the average number of patients served per week, processes used in\nconsultation with other doctors, communication practices using\ncomputer-mediated tool, transmission speed of the computer-mediated tool and\nsatisfaction in using the computer-mediated communication tool. The findings\nrevealed that an average of 15 consultations per doctor to a specialist doctor\nper week was done through face to face or through telephone conversation\ninstead of using a computer-mediated tool. Participants cited reasons for not\nusing computer-mediated tool for communication due to slow transmission speed\nof the Internet and regular down turn of the Internet connectivity, constant\nelectricity power outages and lack of e-health application software to support\nreal time computer-mediated communication. The results led to the\nrecommendation of a hybrid cloud computing architecture for improving\ncommunication between doctors in hospitals.\n", "versions": [{"version": "v1", "created": "Sat, 24 Nov 2012 06:46:47 GMT"}], "update_date": "2012-11-27", "authors_parsed": [["Coleman", "Alfred", ""], ["Herselman", "Marlien E", ""], ["Coleman", "Mary", ""]]}, {"id": "1211.6086", "submitter": "Kang Zhao", "authors": "Kang Zhao, Greta Greer, Baojun Qiu, Prasenjit Mitra, Kenneth Portier,\n  and John Yen", "title": "Finding influential users of an online health community: a new metric\n  based on sentiment influence", "comments": "Working paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  What characterizes influential users in online health communities (OHCs)? We\nhypothesize that (1) the emotional support received by OHC members can be\nassessed from their sentiment ex-pressed in online interactions, and (2) such\nassessments can help to identify influential OHC members. Through text mining\nand sentiment analysis of users' online interactions, we propose a novel metric\nthat directly measures a user's ability to affect the sentiment of others.\nUsing dataset from an OHC, we demonstrate that this metric is highly effective\nin identifying influential users. In addition, combining the metric with other\ntraditional measures further improves the identification of influential users.\nThis study can facilitate online community management and advance our\nunderstanding of social influence in OHCs.\n", "versions": [{"version": "v1", "created": "Mon, 26 Nov 2012 20:37:00 GMT"}, {"version": "v2", "created": "Wed, 5 Dec 2012 23:12:05 GMT"}], "update_date": "2012-12-07", "authors_parsed": [["Zhao", "Kang", ""], ["Greer", "Greta", ""], ["Qiu", "Baojun", ""], ["Mitra", "Prasenjit", ""], ["Portier", "Kenneth", ""], ["Yen", "John", ""]]}, {"id": "1211.7230", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff, Han Woo Park, and Balazs Lengyel", "title": "A Routine for Measuring Synergy in University-Industry-Government\n  Relations: Mutual Information as a Triple-Helix and Quadruple-Helix Indicator", "comments": "submitted to a special issue of Scientometrics entitled \"Mapping\n  Triple Helix Innovation for Developing and Transitional Economies:\n  Webometrics, Scientometrics, and Informetrics\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mutual information in three (or more) dimensions can be considered as a\nTriple-Helix indicator of synergy in university-industry-government relations.\nAn open-source routine th4.exe makes the computation of this indicator\ninteractively available at the Internet, and thus applicable to large sets of\ndata. Th4.exe computes all probabilistic entropies and mutual information in\ntwo, three, and, if available in the data, four dimensions among, for example,\nclasses such as geographical addresses (cities, regions), technological codes\n(e.g., OECD's NACE codes), and size categories; or, alternatively, among\ninstitutional addresses (academic, industrial, public sector) in document sets.\nThe relations between the Triple-Helix indicator -- as an indicator of synergy\n-- and the Triple-Helix model that specifies the possibility of feedback by an\noverlay of communications, are also discussed.\n", "versions": [{"version": "v1", "created": "Fri, 30 Nov 2012 12:37:30 GMT"}], "update_date": "2012-12-03", "authors_parsed": [["Leydesdorff", "Loet", ""], ["Park", "Han Woo", ""], ["Lengyel", "Balazs", ""]]}]