[{"id": "1012.0047", "submitter": "Zolt\\'an K\\'asa", "authors": "Peter Jakub\\v{c}o, Slavom\\'ir \\v{S}imo\\v{n}\\'ak, Norbert \\'Ad\\'am", "title": "Communication model of emuStudio emulation platform", "comments": null, "journal-ref": "Acta Univ. Sapientiae Informatica, vol. 2 no. 2 (2010) 117-134", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Within the paper a description of communication model of plug-in based\nemuStudio emulation platform is given. The platform mentioned above allows the\nemulation of whole computer systems, configurable to the level of its\ncomponents, represented by the plug-in modules of the platform. Development\ntasks still are in progress at the home institution of the authors. Currently\nthe platform is exploited for teaching purposes within subjects aimed at\nmachine-oriented languages and computer architectures. Versatility of the\nplatform, given by its plug-in based architecture is a big advantage, when used\nas a teaching support tool. The paper briefly describes the emuStudio platform\nat its introductory part and then the mechanisms of inter-module communication\nare described.\n", "versions": [{"version": "v1", "created": "Tue, 30 Nov 2010 22:21:36 GMT"}], "update_date": "2010-12-02", "authors_parsed": [["Jakubčo", "Peter", ""], ["Šimoňák", "Slavomír", ""], ["Ádám", "Norbert", ""]]}, {"id": "1012.0326", "submitter": "Ammar Adl", "authors": "Ammar Adl, Amr Badr, Ibrahim Farag", "title": "Towards a Spiking Neural P Systems OS", "comments": null, "journal-ref": "Computing and Information Systems Journal, Issue 3 Oct. 2010, P\n  30-36", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is an attempt to incorporate the idea of spiking neural P systems\nas an early seed into the area of Operating System Design, regarding their\ncapability to solve some classical computer science problems. It is reflecting\nthe power of such systems to simulate well known parallel computational models,\nlike logic gates, arithmetic operation, and sorting. In these devices, the time\n(when the neurons fire and/or spike) plays an essential role. For instance, the\nresult of a computation is the time between the moments when a specified neuron\nspikes. Seen as number computing devices, SN P systems are shown to be\ncomputationally complete, and with such capabilities, arithmetic operations,\nlogic, and timing, some first steps could be taken towards an OS design.\n", "versions": [{"version": "v1", "created": "Wed, 1 Dec 2010 21:15:18 GMT"}], "update_date": "2010-12-03", "authors_parsed": [["Adl", "Ammar", ""], ["Badr", "Amr", ""], ["Farag", "Ibrahim", ""]]}, {"id": "1012.1620", "submitter": "Adrian Paschke", "authors": "Maria R\\\"uther, Thomas Bandholtz, Antoine Logean", "title": "Linked Environment Data for the Life Sciences", "comments": "in Adrian Paschke, Albert Burger, Andrea Splendiani, M. Scott\n  Marshall, Paolo Romano: Proceedings of the 3rd International Workshop on\n  Semantic Web Applications and Tools for the Life Sciences, Berlin,Germany,\n  December 8-10, 2010", "journal-ref": null, "doi": null, "report-no": "SWAT4LS 2010", "categories": "cs.OH q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Environment Agencies from Europe and the US are setting up a network of\nLinked Environment Data and are looking to crosslink it with Linked Data\ncontributions from the life sciences.\n", "versions": [{"version": "v1", "created": "Tue, 7 Dec 2010 21:49:42 GMT"}], "update_date": "2010-12-09", "authors_parsed": [["Rüther", "Maria", ""], ["Bandholtz", "Thomas", ""], ["Logean", "Antoine", ""]]}, {"id": "1012.1636", "submitter": "Adrian Paschke", "authors": "Iker Huerga, Ainhoa Serna and Jon Kepa Gerrikagoitia", "title": "Fundamentals of Semantic Web Technologies in Medical Environments: a\n  case in breast cancer risk estimation", "comments": "in Adrian Paschke, Albert Burger, Andrea Splendiani, M. Scott\n  Marshall, Paolo Romano: Proceedings of the 3rd International Workshop on\n  Semantic Web Applications and Tools for the Life Sciences, Berlin,Germany,\n  December 8-10, 2010", "journal-ref": null, "doi": null, "report-no": "SWAT4LS 2010", "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Risk estimation of developing breast cancer poses as the first prevention\nmethod for early diagnosis. Furthermore, data integration from different\ndepartments involved in the process plays a key role. In order to guarantee\npatient safety, the whole process should be orchestrated and monitored\nautomatically. Support for the solution will be a linked data cloud, composed\nby all the departments that take part in the process, combined with rule\nengines.\n", "versions": [{"version": "v1", "created": "Tue, 7 Dec 2010 23:07:13 GMT"}], "update_date": "2010-12-09", "authors_parsed": [["Huerga", "Iker", ""], ["Serna", "Ainhoa", ""], ["Gerrikagoitia", "Jon Kepa", ""]]}, {"id": "1012.1664", "submitter": "Adrian Paschke", "authors": "Falko Krause, Marvin Schulz, Timo Lubitz, Wolfram Liebermeister", "title": "semanticSBML 2.0 - A Collection of Online Services for SBML Models", "comments": "in Adrian Paschke, Albert Burger, Andrea Splendiani, M. Scott\n  Marshall, Paolo Romano: Proceedings of the 3rd International Workshop on\n  Semantic Web Applications and Tools for the Life Sciences, Berlin,Germany,\n  December 8-10, 2010", "journal-ref": null, "doi": null, "report-no": "SWAT4LS 2010", "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  semanticSBML 2.0 is an online collection of services for the work with\nbiochemical network models in SBML format.\n", "versions": [{"version": "v1", "created": "Wed, 8 Dec 2010 01:00:03 GMT"}], "update_date": "2010-12-09", "authors_parsed": [["Krause", "Falko", ""], ["Schulz", "Marvin", ""], ["Lubitz", "Timo", ""], ["Liebermeister", "Wolfram", ""]]}, {"id": "1012.2889", "submitter": "Andrzej Gecow", "authors": "Andrzej Gecow", "title": "The differences between natural and artificial life. Towards a\n  definition of life", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO cs.OH q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is high time to openly and without finalism define the dangerous but\nneeded term 'purposeful information', whose quantity is an Eigen information\nvalue. Using the term 'biological information' in its stead forces one into an\nuncomfortable detour. I propose such a definition based on the generalized\nnotions of 'information' and 'encoding'. Next, the properties of the\nspontaneous process of collecting purposeful information are investigated. In\neffect, the properties of this process: the goal 'continuation of existence',\nreproduction and Darwinian mechanism are derived which suggest, that it is the\nnatural life process. A 'natural identity criterion' appears in this process\nfor an evolving object, that is connected to a 'small change tendency'.\nLikewise, 'hereditary information' is defined. Artificial life is constructed\nby living objects, is a part of natural life process and its properties are not\nan effect of its internal restrictions but of external assumptions.\n", "versions": [{"version": "v1", "created": "Mon, 13 Dec 2010 21:40:21 GMT"}, {"version": "v2", "created": "Wed, 30 Nov 2011 18:18:11 GMT"}], "update_date": "2011-12-01", "authors_parsed": [["Gecow", "Andrzej", ""]]}, {"id": "1012.3531", "submitter": "Laszlo Kish", "authors": "Ferdinand Peper, Laszlo B. Kish", "title": "Instantaneous, non-squeezed, noise-based logic", "comments": "6 pages", "journal-ref": "Fluctuation and Noise Letters 10 (2011) 231-237", "doi": "10.1142/S0219477511000521", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Noise-based logic, by utilizing its multidimensional logic hyperspace, has\nsignificant potential for low-power parallel operations in beyond-Moore-chips.\nHowever universal gates for Boolean logic thus far had to rely on either time\naveraging to distinguish signals from each other or, alternatively, on squeezed\nlogic signals, where the logic-high was represented by a random process and the\nlogic-low was a zero signal. A major setback is that squeezed logic variables\nare unable to work in the hyperspace, because the logic-low zero value sets the\nhyperspace product vector to zero. This paper proposes Boolean universal logic\ngates that alleviate such shortcomings. They are able to work with non-squeezed\nlogic values where both the high and low values are encoded into nonzero,\nbipolar, independent random telegraph waves. Non-squeezed universal Boolean\nlogic gates for spike-based brain logic are also shown. The advantages vs.\ndisadvantages of the two logic types are compared.\n", "versions": [{"version": "v1", "created": "Thu, 16 Dec 2010 08:42:35 GMT"}], "update_date": "2011-12-06", "authors_parsed": [["Peper", "Ferdinand", ""], ["Kish", "Laszlo B.", ""]]}, {"id": "1012.4567", "submitter": "Arne Kesting", "authors": "Arne Kesting and Martin Treiber", "title": "Online traffic state estimation based on floating car data", "comments": "Appears in Proceedings of Traffic and Granular Flow '09 (TGF'09), see\n  http://tgf09.shu.edu.cn", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Besides the traditional data collection by stationary detectors, recent\nadvances in wireless and sensor technologies have promoted new potentials for a\nvehicle-based data collection and local dissemination of information. By means\nof microscopic traffic simulations we study the problem of online estimation of\nthe current traffic situation based on floating car data. Our focus is on the\nestimation on the up- and downstream jam fronts determining the extension of\ntraffic congestion. We study the impact of delayed information transmission by\nshort-range communication via wireless LAN in contrast to instantaneous\ninformation transmission to the roadside units by means of mobile radio. The\ndelayed information transmission leads to systematic estimation errors which\ncannot be compensated for by a higher percentage of probe vehicles. Additional\nflow measurements from stationary detectors allow for a model-based prediction\nwhich is effective for much lower floating car percentages than 1%.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 08:46:47 GMT"}], "update_date": "2010-12-22", "authors_parsed": [["Kesting", "Arne", ""], ["Treiber", "Martin", ""]]}, {"id": "1012.4691", "submitter": "Thomas Sejr Jensen", "authors": "Steffen Godskesen, Thomas Sejr Jensen, Niels Kjeldsen, Rune Larsen", "title": "Solving a real-life large-scale energy management problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces a three-phase heuristic approach for a large-scale\nenergy management and maintenance scheduling problem. The problem is concerned\nwith scheduling maintenance and refueling for nuclear power plants up to five\nyears into the future, while handling a number of scenarios for future demand\nand prices. The goal is to minimize the expected total production costs. The\nfirst phase of the heuristic solves a simplified constraint programming model\nof the problem, the second performs a local search, and the third handles\noverproduction in a greedy fashion.\n  This work was initiated in the context of the ROADEF/EURO Challenge 2010, a\ncompetition organized jointly by the French Operational Research and Decision\nSupport Society, the European Operational Research Society, and the European\nutility company Electricite de France. In the concluding phase of the\ncompetition our team ranked second in the junior category and sixth overall.\n  After correcting an implementation bug in the program that was submitted for\nevaluation, our heuristic solves all ten real-life instances, and the solutions\nobtained are all within 2.45% of the currently best known solutions. The\nresults given here would have ranked first in the original competition.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 15:21:26 GMT"}], "update_date": "2010-12-22", "authors_parsed": [["Godskesen", "Steffen", ""], ["Jensen", "Thomas Sejr", ""], ["Kjeldsen", "Niels", ""], ["Larsen", "Rune", ""]]}, {"id": "1012.4739", "submitter": "R Devarakonda", "authors": "Phani Nandan K, Pavan Kumar K", "title": "Software Oriented Data Monitoring System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This project \"Software Oriented Data Monitoring System\" deals with real time\nmonitoring of patients' parameters like body temperature, heart rate etc. The\nparameters are checked at regular intervals and Short Messaging Service (SMS)\nis sent to concerned doctor regarding the measured values. If the obtained\nparameters are above or below critical values, an alert SMS is also sent to the\nconcerned doctor. This system is very much useful in hospitals, which saves the\nvaluable time of the doctor who otherwise will have to monitor the patients\nthroughout the day. Here the analog data from the sensors is first converted\ninto digital form and is fed to the parallel port of the computer. This data\nobtained is converted into useful parameters, which is monitored and checked\nfor safe limits. Appropriate SMS is sent to the doctor depending on whether the\nrequest is from an alert or routine signal. This is possible by interfacing a\nmobile phone (Siemens c35i) to the serial port of the computer. The SMS is sent\nfrom the computer using proper AT commands.\n", "versions": [{"version": "v1", "created": "Tue, 21 Dec 2010 17:26:36 GMT"}, {"version": "v2", "created": "Tue, 11 Jan 2011 21:28:21 GMT"}], "update_date": "2011-01-13", "authors_parsed": [["K", "Phani Nandan", ""], ["K", "Pavan Kumar", ""]]}, {"id": "1012.5270", "submitter": "Haret Rosu", "authors": "I. Campos-Canton, J.A. Pecina-Sanchez, E. Campos-Canton, H.C. Rosu", "title": "A simple circuit with dynamic logic architecture of basic logic gates", "comments": "11 pages,5 figures,3 tables", "journal-ref": "Int. J. Bif. Chaos 20(8) 2547-2551 (2010)", "doi": "10.1142/S0218127410027179", "report-no": null, "categories": "cond-mat.other cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report experimental results obtained with a circuit possessing dynamic\nlogic architecture based on one of the theoretical schemes proposed by H. Peng\nand collaborators in 2008. The schematic diagram of the electronic circuit and\nits implementation to get different basic logic gates are displayed and\ndiscussed. In particular, we show explicitly how to get the electronic NOR,\nNAND, and XOR gates. The proposed electronic circuit is easy to build because\nit employs only resistors, operational amplifiers and comparators\n", "versions": [{"version": "v1", "created": "Thu, 23 Dec 2010 18:16:10 GMT"}], "update_date": "2010-12-24", "authors_parsed": [["Campos-Canton", "I.", ""], ["Pecina-Sanchez", "J. A.", ""], ["Campos-Canton", "E.", ""], ["Rosu", "H. C.", ""]]}, {"id": "1012.5838", "submitter": "Serban Vlad E.", "authors": "Serban E. Vlad", "title": "Universal regular autonomous asynchronous systems: omega-limit sets,\n  invariance and basins of attraction", "comments": "accepted to be published in Mathematics and its Applications/Annals\n  of the Academy of the Romanian Scientists", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The asynchronous systems are the non-deterministic real time-binary models of\nthe asynchronous circuits from electrical engineering. Autonomy means that the\ncircuits and their models have no input. Regularity means analogies with the\ndynamical systems, thus such systems may be considered to be the real time\ndynamical systems with a 'vector field' {\\Phi}:{0,1}^2 \\rightarrow {0,1}^2.\nUniversality refers to the case when the state space of the system is the\ngreatest possible in the sense of the inclusion. The purpose of the paper is\nthat of defining, by analogy with the dynamical systems theory, the\n{\\omega}-limit sets, the invariance and the basins of attraction of the\nuniversal regular autonomous asynchronous systems.\n", "versions": [{"version": "v1", "created": "Tue, 28 Dec 2010 20:55:06 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Vlad", "Serban E.", ""]]}, {"id": "1012.5841", "submitter": "Serban Vlad E.", "authors": "Serban E. Vlad", "title": "The dependence on the initial states and the transitivity of the regular\n  autonomous asynchronous systems", "comments": "presented at ADEM May 19-21, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The asynchronous systems are non-deterministic real time, binary valued\nmodels of the asynchronous circuits from electronics. Autonomy means that there\nis no input and regularity means analogies with the (real) dynamical systems.\nWe introduce the concepts of dependence on the initial states and of\ntransitivity for these systems.\n", "versions": [{"version": "v1", "created": "Tue, 28 Dec 2010 21:04:46 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Vlad", "Serban E.", ""]]}, {"id": "1012.5842", "submitter": "Serban Vlad E.", "authors": "Serban E. Vlad", "title": "The model of the ideal rotary element of Morita", "comments": "presented at the 12-th Symposium of Mathematics and its Applications,\n  \"Politehnica\" University of Timisoara, Timisoara, 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reversible computing is a concept reflecting physical reversibility. Until\nnow several reversible systems have been investigated. In a series of papers\nKenichi Morita defines the rotary element RE, that is a reversible logic\nelement. By reversibility, he understands that 'every computation process can\nbe traced backward uniquely from the end to the start. In other words, they are\nbackward deterministic systems'. He shows that any reversible Turing machine\ncan be realized as a circuit composed of RE's only. Our purpose in this paper\nis to use the asynchronous systems theory and the real time for the modeling of\nthe ideal rotary element\n", "versions": [{"version": "v1", "created": "Tue, 28 Dec 2010 21:15:44 GMT"}, {"version": "v2", "created": "Sun, 2 Jan 2011 18:45:11 GMT"}, {"version": "v3", "created": "Wed, 5 Jan 2011 19:25:08 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Vlad", "Serban E.", ""]]}]