[{"id": "1202.0678", "submitter": "Matteo De Felice", "authors": "Matteo De Felice, Sandro Meloni and Stefano Panzieri", "title": "Influence of Topological Features on Spatially-Structured Evolutionary\n  Algorithms Dynamics", "comments": "Submitted to IEEE Transactions on Evolutionary Computation, 14 pages,\n  14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last decades, complex networks theory significantly influenced other\ndisciplines on the modeling of both static and dynamic aspects of systems\nobserved in nature. This work aims to investigate the effects of networks'\ntopological features on the dynamics of an evolutionary algorithm, considering\nin particular the ability to find a large number of optima on multi-modal\nproblems. We introduce a novel spatially-structured evolutionary algorithm and\nwe apply it on two combinatorial problems: ONEMAX and the multi-modal NMAX.\nConsidering three different network models we investigate the relationships\nbetween their features, algorithm's convergence and its ability to find\nmultiple optima (for the multi-modal problem). In order to perform a deeper\nanalysis we investigate the introduction of weighted graphs with time-varying\nweights. The results show that networks with a large Average Path Length lead\nto an higher number of optima and a consequent slow exploration dynamics (i.e.\nlow First Hitting Time). Furthermore, the introduction of weighted networks\nshows the possibility to tune algorithm's dynamics during its execution with\nthe parameter related with weights' change. This work gives a first answer\nabout the effects of various graph topologies on the diversity of evolutionary\nalgorithms and it describes a simple but powerful algorithmic framework which\nallows to investigate many aspects of ssEAs dynamics.\n", "versions": [{"version": "v1", "created": "Fri, 3 Feb 2012 12:24:37 GMT"}, {"version": "v2", "created": "Wed, 8 Feb 2012 08:03:57 GMT"}], "update_date": "2012-02-09", "authors_parsed": [["De Felice", "Matteo", ""], ["Meloni", "Sandro", ""], ["Panzieri", "Stefano", ""]]}, {"id": "1202.1643", "submitter": "Vinesh Rajpaul", "authors": "Vinesh Rajpaul", "title": "Genetic algorithms in astronomy and astrophysics", "comments": "6 pages, 3 figures. Review paper in Proc. SAIP2011 (ISBN:\n  978-1-86888-688-3), ed. I. Basson and A. E. Botha, available online at\n  http://www.saip.org.za", "journal-ref": "Proceedings of SAIP2011, the 56th Annual Conference of the South\n  African Institute of Physics, pp. 519-524", "doi": null, "report-no": null, "categories": "astro-ph.IM cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Genetic algorithms (GAs) emulate the process of biological evolution, in a\ncomputational setting, in order to generate good solutions to difficult search\nand optimisation problems. GA-based optimisers tend to be extremely robust and\nversatile compared to most traditional techniques used to solve optimisation\nproblems. This review paper provides a very brief introduction to GAs and\noutlines their utility in astronomy and astrophysics.\n", "versions": [{"version": "v1", "created": "Wed, 8 Feb 2012 10:06:25 GMT"}], "update_date": "2012-02-09", "authors_parsed": [["Rajpaul", "Vinesh", ""]]}, {"id": "1202.1708", "submitter": "Jun He", "authors": "Boris Mitavskiy and Jun He", "title": "A Polynomial Time Approximation Scheme for a Single Machine Scheduling\n  Problem Using a Hybrid Evolutionary Algorithm", "comments": null, "journal-ref": null, "doi": "10.1109/CEC.2012.6256166", "report-no": null, "categories": "cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays hybrid evolutionary algorithms, i.e, heuristic search algorithms\ncombining several mutation operators some of which are meant to implement\nstochastically a well known technique designed for the specific problem in\nquestion while some others playing the role of random search, have become\nrather popular for tackling various NP-hard optimization problems. While\nempirical studies demonstrate that hybrid evolutionary algorithms are\nfrequently successful at finding solutions having fitness sufficiently close to\nthe optimal, many fewer articles address the computational complexity in a\nmathematically rigorous fashion. This paper is devoted to a mathematically\nmotivated design and analysis of a parameterized family of evolutionary\nalgorithms which provides a polynomial time approximation scheme for one of the\nwell-known NP-hard combinatorial optimization problems, namely the \"single\nmachine scheduling problem without precedence constraints\". The authors hope\nthat the techniques and ideas developed in this article may be applied in many\nother situations.\n", "versions": [{"version": "v1", "created": "Wed, 8 Feb 2012 14:30:55 GMT"}, {"version": "v2", "created": "Tue, 22 Apr 2014 09:20:43 GMT"}], "update_date": "2014-04-23", "authors_parsed": [["Mitavskiy", "Boris", ""], ["He", "Jun", ""]]}, {"id": "1202.2026", "submitter": "Akira SaiToh", "authors": "Akira SaiToh, Robabeh Rahimi, Mikio Nakahara", "title": "A quantum genetic algorithm with quantum crossover and mutation\n  operations", "comments": "21 pages, 1 table, v2: typos corrected, minor modifications in\n  sections 3.5 and 4, v3: minor revision, title changed (original title:\n  Semiclassical genetic algorithm with quantum crossover and mutation\n  operations), v4: minor revision, v5: minor grammatical corrections, to appear\n  in QIP", "journal-ref": "Quantum Inf. Process. 13, 737-755 (2014)", "doi": "10.1007/s11128-013-0686-6", "report-no": null, "categories": "cs.NE quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the context of evolutionary quantum computing in the literal meaning, a\nquantum crossover operation has not been introduced so far. Here, we introduce\na novel quantum genetic algorithm which has a quantum crossover procedure\nperforming crossovers among all chromosomes in parallel for each generation. A\ncomplexity analysis shows that a quadratic speedup is achieved over its\nclassical counterpart in the dominant factor of the run time to handle each\ngeneration.\n", "versions": [{"version": "v1", "created": "Thu, 9 Feb 2012 16:04:52 GMT"}, {"version": "v2", "created": "Mon, 13 Feb 2012 07:19:53 GMT"}, {"version": "v3", "created": "Mon, 19 Nov 2012 19:12:14 GMT"}, {"version": "v4", "created": "Fri, 8 Nov 2013 04:48:49 GMT"}, {"version": "v5", "created": "Fri, 22 Nov 2013 04:22:29 GMT"}], "update_date": "2014-02-05", "authors_parsed": [["SaiToh", "Akira", ""], ["Rahimi", "Robabeh", ""], ["Nakahara", "Mikio", ""]]}, {"id": "1202.2249", "submitter": "Ioana Sporea", "authors": "Ioana Sporea and Andr\\'e Gr\\\"uning", "title": "Supervised Learning in Multilayer Spiking Neural Networks", "comments": "38 pages, 4 figures", "journal-ref": "Neural Compuation February 2013, Vol. 25, No. 2, Pages 473-509", "doi": "10.1162/NECO_a_00396", "report-no": null, "categories": "cs.NE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The current article introduces a supervised learning algorithm for multilayer\nspiking neural networks. The algorithm presented here overcomes some\nlimitations of existing learning algorithms as it can be applied to neurons\nfiring multiple spikes and it can in principle be applied to any linearisable\nneuron model. The algorithm is applied successfully to various benchmarks, such\nas the XOR problem and the Iris data set, as well as complex classifications\nproblems. The simulations also show the flexibility of this supervised learning\nalgorithm which permits different encodings of the spike timing patterns,\nincluding precise spike trains encoding.\n", "versions": [{"version": "v1", "created": "Fri, 10 Feb 2012 12:57:34 GMT"}], "update_date": "2014-02-04", "authors_parsed": [["Sporea", "Ioana", ""], ["Grüning", "André", ""]]}, {"id": "1202.2350", "submitter": "Khaled Masmoudi Mr.", "authors": "Khaled Masmoudi and Marc Antonini and Pierre Kornprobst", "title": "Streaming an image through the eye: The retina seen as a dithered\n  scalable image coder", "comments": "arXiv admin note: substantial text overlap with arXiv:1104.1550", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose the design of an original scalable image coder/decoder that is\ninspired from the mammalians retina. Our coder accounts for the time-dependent\nand also nondeterministic behavior of the actual retina. The present work\nbrings two main contributions: As a first step, (i) we design a deterministic\nimage coder mimicking most of the retinal processing stages and then (ii) we\nintroduce a retinal noise in the coding process, that we model here as a dither\nsignal, to gain interesting perceptual features. Regarding our first\ncontribution, our main source of inspiration will be the biologically plausible\nmodel of the retina called Virtual Retina. The main novelty of this coder is to\nshow that the time-dependent behavior of the retina cells could ensure, in an\nimplicit way, scalability and bit allocation. Regarding our second\ncontribution, we reconsider the inner layers of the retina. We emit a possible\ninterpretation for the non-determinism observed by neurophysiologists in their\noutput. For this sake, we model the retinal noise that occurs in these layers\nby a dither signal. The dithering process that we propose adds several\ninteresting features to our image coder. The dither noise whitens the\nreconstruction error and decorrelates it from the input stimuli. Furthermore,\nintegrating the dither noise in our coder allows a faster recognition of the\nfine details of the image during the decoding process. Our present paper goal\nis twofold. First, we aim at mimicking as closely as possible the retina for\nthe design of a novel image coder while keeping encouraging performances.\nSecond, we bring a new insight concerning the non-deterministic behavior of the\nretina.\n", "versions": [{"version": "v1", "created": "Fri, 10 Feb 2012 09:16:43 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Masmoudi", "Khaled", ""], ["Antonini", "Marc", ""], ["Kornprobst", "Pierre", ""]]}, {"id": "1202.2523", "submitter": "Jose Alberto Garc\\'ia Guti\\'errez Sr.", "authors": "Jos\\'e A. Garc\\'ia Guti\\'errez, Carlos Cotta, and Antonio J.\n  Fern\\'andez-Leiva", "title": "Evolutionary Computation in Astronomy and Astrophysics: A Review", "comments": "* PRE-PRINT *", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI astro-ph.IM cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In general Evolutionary Computation (EC) includes a number of optimization\nmethods inspired by biological mechanisms of evolution. The methods catalogued\nin this area use the Darwinian principles of life evolution to produce\nalgorithms that returns high quality solutions to hard-to-solve optimization\nproblems. The main strength of EC is precisely that they provide good solutions\neven if the computational resources (e.g., running time) are limited. Astronomy\nand Astrophysics are two fields that often require optimizing problems of high\ncomplexity or analyzing a huge amount of data and the so-called complete\noptimization methods are inherently limited by the size of the problem/data.\nFor instance, reliable analysis of large amounts of data is central to modern\nastrophysics and astronomical sciences in general. EC techniques perform well\nwhere other optimization methods are inherently limited (as complete methods\napplied to NP-hard problems), and in the last ten years, numerous proposals\nhave come up that apply with greater or lesser success methodologies of\nevolutional computation to common engineering problems. Some of these problems,\nsuch as the estimation of non-lineal parameters, the development of automatic\nlearning techniques, the implementation of control systems, or the resolution\nof multi-objective optimization problems, have had (and have) a special\nrepercussion in the fields. For these reasons EC emerges as a feasible\nalternative for traditional methods. In this paper, we discuss some promising\napplications in this direction and a number of recent works in this area; the\npaper also includes a general description of EC to provide a global perspective\nto the reader and gives some guidelines of application of EC techniques for\nfuture research\n", "versions": [{"version": "v1", "created": "Sun, 12 Feb 2012 12:12:14 GMT"}, {"version": "v2", "created": "Tue, 10 Apr 2012 17:13:45 GMT"}], "update_date": "2012-04-11", "authors_parsed": [["Gutiérrez", "José A. García", ""], ["Cotta", "Carlos", ""], ["Fernández-Leiva", "Antonio J.", ""]]}, {"id": "1202.2770", "submitter": "Amir Hesam Salavati", "authors": "Amir Hesam Salavati, Amin Karbasi", "title": "Multi-Level Error-Resilient Neural Networks with Learning", "comments": "Part of this draft has been submitted to International Symposium on\n  Information Theory (ISIT) 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.AI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of neural network association is to retrieve a previously\nmemorized pattern from its noisy version using a network of neurons. An ideal\nneural network should include three components simultaneously: a learning\nalgorithm, a large pattern retrieval capacity and resilience against noise.\nPrior works in this area usually improve one or two aspects at the cost of the\nthird.\n  Our work takes a step forward in closing this gap. More specifically, we show\nthat by forcing natural constraints on the set of learning patterns, we can\ndrastically improve the retrieval capacity of our neural network. Moreover, we\ndevise a learning algorithm whose role is to learn those patterns satisfying\nthe above mentioned constraints. Finally we show that our neural network can\ncope with a fair amount of noise.\n", "versions": [{"version": "v1", "created": "Mon, 13 Feb 2012 15:48:04 GMT"}, {"version": "v2", "created": "Tue, 15 May 2012 12:56:31 GMT"}, {"version": "v3", "created": "Wed, 6 Jun 2012 09:58:22 GMT"}, {"version": "v4", "created": "Thu, 21 Jun 2012 15:42:41 GMT"}], "update_date": "2012-06-22", "authors_parsed": [["Salavati", "Amir Hesam", ""], ["Karbasi", "Amin", ""]]}, {"id": "1202.4170", "submitter": "Sergei Kozyrev", "authors": "S.V. Kozyrev", "title": "Classification by Ensembles of Neural Networks", "comments": "8 pages, LaTeX", "journal-ref": "p-Adic Numbers, Ultrametric Analysis and Applications, 2012, Vol.\n  4, No. 1, pp. 27-33", "doi": null, "report-no": null, "categories": "cs.NE cond-mat.dis-nn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new procedure for training of artificial neural networks by\nusing the approximation of an objective function by arithmetic mean of an\nensemble of selected randomly generated neural networks, and apply this\nprocedure to the classification (or pattern recognition) problem. This approach\ndiffers from the standard one based on the optimization theory. In particular,\nany neural network from the mentioned ensemble may not be an approximation of\nthe objective function.\n", "versions": [{"version": "v1", "created": "Sun, 19 Feb 2012 16:56:45 GMT"}], "update_date": "2012-02-21", "authors_parsed": [["Kozyrev", "S. V.", ""]]}, {"id": "1202.5284", "submitter": "Alex Ter-Sarkissov", "authors": "Aram Ter-Sarkisov", "title": "Elitism Levels Traverse Mechanism For The Derivation of Upper Bounds on\n  Unimodal Functions", "comments": "accepted to Congress on Evolutionary Computation (WCCI/CEC) 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we present an Elitism Levels Traverse Mechanism that we\ndesigned to find bounds on population-based Evolutionary algorithms solving\nunimodal functions. We prove its efficiency theoretically and test it on OneMax\nfunction deriving bounds c{\\mu}n log n - O({\\mu} n). This analysis can be\ngeneralized to any similar algorithm using variants of tournament selection and\ngenetic operators that flip or swap only 1 bit in each string.\n", "versions": [{"version": "v1", "created": "Thu, 23 Feb 2012 20:21:57 GMT"}, {"version": "v2", "created": "Fri, 16 Mar 2012 04:55:09 GMT"}, {"version": "v3", "created": "Mon, 2 Apr 2012 04:27:11 GMT"}], "update_date": "2012-04-03", "authors_parsed": [["Ter-Sarkisov", "Aram", ""]]}, {"id": "1202.5683", "submitter": "Saptarshi Das", "authors": "Saptarshi Das, Indranil Pan, Shantanu Das, and Amitava Gupta", "title": "Improved Model Reduction and Tuning of Fractional Order\n  PI{\\lambda}D{\\mu} Controllers for Analytical Rule Extraction with Genetic\n  Programming", "comments": "41 pages, 29 figures", "journal-ref": "ISA Transactions, vol. 51, no. 2, pp. 237-261, March 2012", "doi": "10.1016/j.isatra.2011.10.004", "report-no": null, "categories": "cs.SY cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Genetic Algorithm (GA) has been used in this paper for a new approach of\nsub-optimal model reduction in the Nyquist plane and optimal time domain tuning\nof PID and fractional order (FO) PI{\\lambda}D{\\mu} controllers. Simulation\nstudies show that the Nyquist based new model reduction technique outperforms\nthe conventional H2 norm based reduced parameter modeling technique. With the\ntuned controller parameters and reduced order model parameter data-set, optimum\ntuning rules have been developed with a test-bench of higher order processes\nvia Genetic Programming (GP). The GP performs a symbolic regression on the\nreduced process parameters to evolve a tuning rule which provides the best\nanalytical expression to map the data. The tuning rules are developed for a\nminimum time domain integral performance index described by weighted sum of\nerror index and controller effort. From the reported Pareto optimal front of GP\nbased optimal rule extraction technique a trade-off can be made between the\ncomplexity of the tuning formulae and the control performance. The efficacy of\nthe single-gene and multi-gene GP based tuning rules has been compared with\noriginal GA based control performance for the PID and PI{\\lambda}D{\\mu}\ncontrollers, handling four different class of representative higher order\nprocesses. These rules are very useful for process control engineers as they\ninherit the power of the GA based tuning methodology, but can be easily\ncalculated without the requirement for running the computationally intensive GA\nevery time. Three dimensional plots of the required variation in PID/FOPID\ncontroller parameters with reduced process parameters have been shown as a\nguideline for the operator. Parametric robustness of the reported GP based\ntuning rules has also been shown with credible simulation examples.\n", "versions": [{"version": "v1", "created": "Sat, 25 Feb 2012 19:01:46 GMT"}], "update_date": "2012-02-28", "authors_parsed": [["Das", "Saptarshi", ""], ["Pan", "Indranil", ""], ["Das", "Shantanu", ""], ["Gupta", "Amitava", ""]]}, {"id": "1202.5953", "submitter": "Olivia Saierli", "authors": "Ripunjai Kumar Shukla and Soubhik Chakraborty", "title": "On an Ethical Use of Neural Networks: A Case Study on a North Indian\n  Raga", "comments": "16 pages", "journal-ref": "Ann. Univ. Tibiscus Comp. Sci. Series VII/2 (2009), 41-56", "doi": null, "report-no": null, "categories": "cs.NE cs.SD", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper gives an artificial neural network (ANN) approach to time series\nmodeling, the data being instance versus notes (characterized by pitch)\ndepicting the structure of a North Indian raga, namely, Bageshree. Respecting\nthe sentiments of the artists' community, the paper argues why it is more\nethical to model a structure than try and \"manufacture\" an artist by training\nthe neural network to copy performances of artists. Indian Classical Music\ncenters on the ragas, where emotion and devotion are both important and neither\ncan be substituted by such \"calculated artistry\" which the ANN generated copies\nare ultimately up to.\n", "versions": [{"version": "v1", "created": "Mon, 27 Feb 2012 14:36:43 GMT"}], "update_date": "2012-02-28", "authors_parsed": [["Shukla", "Ripunjai Kumar", ""], ["Chakraborty", "Soubhik", ""]]}]