[{"id": "0803.0146", "submitter": "Dorit Hochbaum", "authors": "Dorit S. Hochbaum", "title": "Polynomial time algorithms for bi-criteria, multi-objective and ratio\n  problems in clustering and imaging. Part I: Normalized cut and ratio regions", "comments": "15 pages, 4 figures", "journal-ref": "IEEE Transactions on Pattern Analysis and Machine Intelligence,\n  May 2010 32:5 889-898", "doi": null, "report-no": null, "categories": "cs.CV cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Partitioning and grouping of similar objects plays a fundamental role in\nimage segmentation and in clustering problems. In such problems a typical goal\nis to group together similar objects, or pixels in the case of image\nprocessing. At the same time another goal is to have each group distinctly\ndissimilar from the rest and possibly to have the group size fairly large.\nThese goals are often combined as a ratio optimization problem. One example of\nsuch problem is the normalized cut problem, another is the ratio regions\nproblem. We devise here the first polynomial time algorithms solving these\nproblems optimally. The algorithms are efficient and combinatorial. This\ncontrasts with the heuristic approaches used in the image segmentation\nliterature that formulate those problems as nonlinear optimization problems,\nwhich are then relaxed and solved with spectral techniques in real numbers.\nThese approaches not only fail to deliver an optimal solution, but they are\nalso computationally expensive. The algorithms presented here use as a\nsubroutine a minimum $s,t-cut procedure on a related graph which is of\npolynomial size. The output consists of the optimal solution to the respective\nratio problem, as well as a sequence of nested solution with respect to any\nrelative weighting of the objectives of the numerator and denominator.\n  An extension of the results here to bi-criteria and multi-criteria objective\nfunctions is presented in part II.\n", "versions": [{"version": "v1", "created": "Sun, 2 Mar 2008 21:30:58 GMT"}], "update_date": "2010-10-12", "authors_parsed": [["Hochbaum", "Dorit S.", ""]]}, {"id": "0803.0194", "submitter": "Radu Arsinte", "authors": "Radu Arsinte, Costin Miron", "title": "Acquisition Accuracy Evaluation in Visual Inspection Systems - a\n  Practical Approach", "comments": "6 pages, 4 figures, ETc'96 Conference paper", "journal-ref": "Proceeedings of ETc '96 Conference, 1996, Timisoara, Romania", "doi": null, "report-no": null, "categories": "cs.CV cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper draws a proposal of a set of parameters and methods for accuracy\nevaluation of visual inspection systems. The case of a monochrome board is\ntreated, but practically all conclusions and methods may be extended for colour\nacquisition. Basically, the proposed parameters are grouped in five sets as\nfollows:Internal noise;Video ADC cuantisation parameters;Analogue processing\nsection parameters;Dominant frequencies;Synchronisation (lock-in) accuracy. On\nbasis of this set of parameters was developed a software environment, in\nconjunction with a test signal generator that allows the \"test\" images. The\npaper also presents conclusions of evaluation for two types of video\nacquisition boards\n", "versions": [{"version": "v1", "created": "Mon, 3 Mar 2008 08:57:10 GMT"}], "update_date": "2008-03-04", "authors_parsed": [["Arsinte", "Radu", ""], ["Miron", "Costin", ""]]}, {"id": "0803.1586", "submitter": "Jeroen Vendrig", "authors": "Jarrad Springett, Jeroen Vendrig", "title": "Spatio-activity based object detection", "comments": "To be submitted to: AVSS 2008 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the SAMMI lightweight object detection method which has a high\nlevel of accuracy and robustness, and which is able to operate in an\nenvironment with a large number of cameras. Background modeling is based on DCT\ncoefficients provided by cameras. Foreground detection uses similarity in\ntemporal characteristics of adjacent blocks of pixels, which is a\ncomputationally inexpensive way to make use of object coherence. Scene model\nupdating uses the approximated median method for improved performance.\nEvaluation at pixel level and application level shows that SAMMI object\ndetection performs better and faster than the conventional Mixture of Gaussians\nmethod.\n", "versions": [{"version": "v1", "created": "Tue, 11 Mar 2008 13:40:42 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Springett", "Jarrad", ""], ["Vendrig", "Jeroen", ""]]}, {"id": "0803.2363", "submitter": "Li Chen", "authors": "Li Chen", "title": "lambda-Connectedness Determination for Image Segmentation", "comments": "9 pages, 36th Applied Image Pattern Recognition Workshop (AIPR 2007),\n  October 2007, Washington, DC, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Image segmentation is to separate an image into distinct homogeneous regions\nbelonging to different objects. It is an essential step in image analysis and\ncomputer vision. This paper compares some segmentation technologies and\nattempts to find an automated way to better determine the parameters for image\nsegmentation, especially the connectivity value of $\\lambda$ in\n$\\lambda$-connected segmentation.\n  Based on the theories on the maximum entropy method and Otsu's minimum\nvariance method, we propose:(1)maximum entropy connectedness determination: a\nmethod that uses maximum entropy to determine the best $\\lambda$ value in\n$\\lambda$-connected segmentation, and (2) minimum variance connectedness\ndetermination: a method that uses the principle of minimum variance to\ndetermine $\\lambda$ value. Applying these optimization techniques in real\nimages, the experimental results have shown great promise in the development of\nthe new methods. In the end, we extend the above method to more general case in\norder to compare it with the famous Mumford-Shah method that uses variational\nprinciple and geometric measure.\n", "versions": [{"version": "v1", "created": "Sun, 16 Mar 2008 17:18:19 GMT"}], "update_date": "2008-03-18", "authors_parsed": [["Chen", "Li", ""]]}, {"id": "0803.2695", "submitter": "Juan J. Merelo Pr.", "authors": "C. Fernandes, A.M. Mora, J.J. Merelo, V. Ramos, J.L.J. Laredo", "title": "KohonAnts: A Self-Organizing Ant Algorithm for Clustering and Pattern\n  Classification", "comments": "Submitted to ALIFE XI", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a new ant-based method that takes advantage of the\ncooperative self-organization of Ant Colony Systems to create a naturally\ninspired clustering and pattern recognition method. The approach considers each\ndata item as an ant, which moves inside a grid changing the cells it goes\nthrough, in a fashion similar to Kohonen's Self-Organizing Maps. The resulting\nalgorithm is conceptually more simple, takes less free parameters than other\nant-based clustering algorithms, and, after some parameter tuning, yields very\ngood results on some benchmark problems.\n", "versions": [{"version": "v1", "created": "Tue, 18 Mar 2008 18:27:14 GMT"}], "update_date": "2008-03-19", "authors_parsed": [["Fernandes", "C.", ""], ["Mora", "A. M.", ""], ["Merelo", "J. J.", ""], ["Ramos", "V.", ""], ["Laredo", "J. L. J.", ""]]}, {"id": "0803.2812", "submitter": "Mikhail Konnik", "authors": "Mikhail V. Konnik", "title": "Using Spatially Varying Pixels Exposures and Bayer-covered Photosensors\n  for High Dynamic Range Imaging", "comments": "Typos corrected", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The method of a linear high dynamic range imaging using solid-state\nphotosensors with Bayer colour filters array is provided in this paper. Using\ninformation from neighbour pixels, it is possible to reconstruct linear images\nwith wide dynamic range from the oversaturated images. Bayer colour filters\narray is considered as an array of neutral filters in a quasimonochromatic\nlight. If the camera's response function to the desirable light source is known\nthen one can calculate correction coefficients to reconstruct oversaturated\nimages. Reconstructed images are linearized in order to provide a linear high\ndynamic range images for optical-digital imaging systems. The calibration\nprocedure for obtaining the camera's response function to the desired light\nsource is described. Experimental results of the reconstruction of the images\nfrom the oversaturated images are presented for red, green, and blue\nquasimonochromatic light sources. Quantitative analysis of the accuracy of the\nreconstructed images is provided.\n", "versions": [{"version": "v1", "created": "Wed, 19 Mar 2008 14:55:15 GMT"}, {"version": "v2", "created": "Mon, 24 Mar 2008 07:04:39 GMT"}], "update_date": "2008-03-24", "authors_parsed": [["Konnik", "Mikhail V.", ""]]}]