[{"id": "0704.0589", "submitter": "Wei-Xing Zhou", "authors": "Wei-Xing Zhou (ECUST), Didier Sornette (ETH Zurich)", "title": "Analysis of the real estate market in Las Vegas: Bubble, seasonal\n  patterns, and prediction of the CSW indexes", "comments": "24 Elsart pages including 13 pages and 1 table", "journal-ref": "Physica A 387 (1), 243-260 (2008)", "doi": "10.1016/j.physa.2007.08.059", "report-no": null, "categories": "q-fin.GN physics.soc-ph q-fin.ST", "license": null, "abstract": "  We analyze 27 house price indexes of Las Vegas from Jun. 1983 to Mar. 2005,\ncorresponding to 27 different zip codes. These analyses confirm the existence\nof a real-estate bubble, defined as a price acceleration faster than\nexponential, which is found however to be confined to a rather limited time\ninterval in the recent past from approximately 2003 to mid-2004 and has\nprogressively transformed into a more normal growth rate comparable to\npre-bubble levels in 2005. There has been no bubble till 2002 except for a\nmedium-sized surge in 1990. In addition, we have identified a strong yearly\nperiodicity which provides a good potential for fine-tuned prediction from\nmonth to month. A monthly monitoring using a model that we have developed could\nconfirm, by testing the intra-year structure, if indeed the market has returned\nto ``normal'' or if more turbulence is expected ahead. We predict the evolution\nof the indexes one year ahead, which is validated with new data up to Sep.\n2006. The present analysis demonstrates the existence of very significant\nvariations at the local scale, in the sense that the bubble in Las Vegas seems\nto have preceded the more global USA bubble and has ended approximately two\nyears earlier (mid 2004 for Las Vegas compared with mid-2006 for the whole of\nthe USA).\n", "versions": [{"version": "v1", "created": "Wed, 4 Apr 2007 15:00:11 GMT"}], "update_date": "2008-12-10", "authors_parsed": [["Zhou", "Wei-Xing", "", "ECUST"], ["Sornette", "Didier", "", "ETH Zurich"]]}, {"id": "0704.1225", "submitter": "M. Angeles Serrano", "authors": "M. Angeles Serrano, Marian Boguna, and Alessandro Vespignani", "title": "Patterns of dominant flows in the world trade web", "comments": null, "journal-ref": "J. Econ. Interac. Coor. 2, 111 (2007)", "doi": "10.1007/s11403-007-0026-y", "report-no": null, "categories": "q-fin.GN cond-mat.dis-nn physics.soc-ph", "license": null, "abstract": "  The large-scale organization of the world economies is exhibiting\nincreasingly levels of local heterogeneity and global interdependency.\nUnderstanding the relation between local and global features calls for\nanalytical tools able to uncover the global emerging organization of the\ninternational trade network. Here we analyze the world network of bilateral\ntrade imbalances and characterize its overall flux organization, unraveling\nlocal and global high-flux pathways that define the backbone of the trade\nsystem. We develop a general procedure capable to progressively filter out in a\nconsistent and quantitative way the dominant trade channels. This procedure is\ncompletely general and can be applied to any weighted network to detect the\nunderlying structure of transport flows. The trade fluxes properties of the\nworld trade web determines a ranking of trade partnerships that highlights\nglobal interdependencies, providing information not accessible by simple local\nanalysis. The present work provides new quantitative tools for a dynamical\napproach to the propagation of economic crises.\n", "versions": [{"version": "v1", "created": "Tue, 10 Apr 2007 12:33:31 GMT"}], "update_date": "2008-12-10", "authors_parsed": [["Serrano", "M. Angeles", ""], ["Boguna", "Marian", ""], ["Vespignani", "Alessandro", ""]]}, {"id": "0704.2139", "submitter": "Pradeep Kumar Mohanty", "authors": "P. K. Mohanty", "title": "Why only few are so successful ?", "comments": "8 pages, 3 eps figures, elsart.cls (included), accepted in Physica A", "journal-ref": "Physica A 384, 75 (2007)", "doi": "10.1016/j.physa.2007.04.118", "report-no": null, "categories": "physics.pop-ph physics.soc-ph q-fin.GN", "license": null, "abstract": "  In many professons employees are rewarded according to their relative\nperformance. Corresponding economy can be modeled by taking $N$ independent\nagents who gain from the market with a rate which depends on their current\ngain. We argue that this simple realistic rate generates a scale free\ndistribution even though intrinsic ability of agents are marginally different\nfrom each other. As an evidence we provide distribution of scores for two\ndifferent systems (a) the global stock game where players invest in real stock\nmarket and (b) the international cricket.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2007 12:07:15 GMT"}], "update_date": "2010-09-03", "authors_parsed": [["Mohanty", "P. K.", ""]]}]