[{"id": "0706.0664", "submitter": "Mihaela Neamtu", "authors": "O.Bundau, M.Neamtu, D.Opris", "title": "Rent seeking games with tax evasion", "comments": "8 pages, 4 figures, the paper was presented at Pannonian Applied\n  Mathematical Meetings, 31 may-3june, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-fin.GN", "license": null, "abstract": "  We consider the static and dynamic models of Cournot duopoly with tax\nevasion. In the dynamic model we introduce the time delay and we analyze the\nlocal stability of the stationary state. There is a critical value of the delay\nwhen the Hopf bifurcation occurs.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2007 14:18:24 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Bundau", "O.", ""], ["Neamtu", "M.", ""], ["Opris", "D.", ""]]}, {"id": "0706.1028", "submitter": "Gerard Weisbuch", "authors": "Tanya Ara\\'ujo, G\\'erard Weisbuch", "title": "Hiking the hypercube: producers and consumers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": null, "abstract": "  We study the dynamics of co-evolution of producers and customers described by\nbit-strings representing individual traits. Individual ''size-like'' properties\nare controlled by binary encounters which outcome depends upon a recognition\nprocess. Depending upon the parameter set-up, mutual selection of producers and\ncustomers results in different types of attractors, either an exclusive niches\nregime or a competition regime.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2007 15:47:16 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Araújo", "Tanya", ""], ["Weisbuch", "Gérard", ""]]}, {"id": "0706.1454", "submitter": "Gerard Weisbuch", "authors": "G\\'erard Weisbuch, Vincent Buskens, Luat Vuong", "title": "Heterogeneity and Increasing Returns May Drive Socio-Economic\n  Transitions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": null, "abstract": "  There are clear benefits associated with a particular consumer choice for\nmany current markets. For example, as we consider here, some products might\ncarry environmental or `green' benefits. Some consumers might value these\nbenefits while others do not. However, as evidenced by myriad failed attempts\nof environmental products to maintain even a niche market, such benefits do not\nnecessarily outweigh the extra purchasing cost. The question we pose is, how\ncan such an initially economically-disadvantaged green product evolve to hold\nthe greater share of the market? We present a simple mathematical model for the\ndynamics of product competition in a heterogeneous consumer population. Our\nmodel preassigns a hierarchy to the products, which designates the consumer\nchoice when prices are comparable, while prices are dynamically rescaled to\nreflect increasing returns to scale. Our approach allows us to model many\nscenarios of technology substitution and provides a method for generalizing\nmarket forces. With this model, we begin to forecast irreversible trends\nassociated with consumer dynamics as well as policies that could be made to\ninfluence transitions\n", "versions": [{"version": "v1", "created": "Mon, 11 Jun 2007 12:38:44 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Weisbuch", "Gérard", ""], ["Buskens", "Vincent", ""], ["Vuong", "Luat", ""]]}, {"id": "0706.1839", "submitter": "Didier Sornette", "authors": "Didier Sornette (ETH Zurich)", "title": "Nurturing Breakthroughs: Lessons from Complexity Theory", "comments": "14 pages, Invited talk at the workshop Trans-disciplinary Research\n  Agenda for Societal Dynamics (http://www.uni-lj.si/trasd in Ljubljana),\n  organized by J. Rogers Hollingsworth, Karl H. Mueller, Ivan Svetlik, 24 - 25\n  May 2007, Ljubljana, Slovenia", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph q-fin.GN", "license": null, "abstract": "  A general theory of innovation and progress in human society is outlined,\nbased on the combat between two opposite forces (conservatism/inertia and\nspeculative herding \"bubble\" behavior). We contend that human affairs are\ncharacterized by ubiquitous ``bubbles'', which involve huge risks which would\nnot otherwise be taken using standard cost/benefit analysis. Bubbles result\nfrom self-reinforcing positive feedbacks. This leads to explore uncharted\nterritories and niches whose rare successes lead to extraordinary discoveries\nand provide the base for the observed accelerating development of technology\nand of the economy. But the returns are very heterogeneous, very risky and may\nnot occur. In other words, bubbles, which are characteristic definitions of\nhuman activity, allow huge risks to get huge returns over large scales. We\noutline some underlying mathematical structure and a few results involving\npositive feedbacks, emergence, heavy-tailed power laws, outliers/kings/black\nswans, the problem of predictability and the illusion of control, as well as\nsome policy implications.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2007 07:33:27 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Sornette", "Didier", "", "ETH Zurich"]]}, {"id": "0706.4432", "submitter": "Willemien Kets", "authors": "Willemien Kets", "title": "The minority game: An economics perspective", "comments": "30 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": null, "abstract": "  This paper gives a critical account of the minority game literature. The\nminority game is a simple congestion game: players need to choose between two\noptions, and those who have selected the option chosen by the minority win. The\nlearning model proposed in this literature seems to differ markedly from the\nlearning models commonly used in economics. We relate the learning model from\nthe minority game literature to standard game-theoretic learning models, and\nshow that in fact it shares many features with these models. However, the\npredictions of the learning model differ considerably from the predictions of\nmost other learning models. We discuss the main predictions of the learning\nmodel proposed in the minority game literature, and compare these to\nexperimental findings on congestion games.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jun 2007 14:55:44 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Kets", "Willemien", ""]]}]