[{"id": "0709.1092", "submitter": "Sudhir Jain", "authors": "S. Jain, T. Yamano", "title": "Persistence in a Random Bond Ising Model of Socio-Econo Dynamics", "comments": "11 pages, 4 figures", "journal-ref": null, "doi": "10.1142/S012918310801198X", "report-no": null, "categories": "q-fin.GN cond-mat.dis-nn physics.comp-ph physics.soc-ph q-fin.ST", "license": null, "abstract": "  We study the persistence phenomenon in a socio-econo dynamics model using\ncomputer simulations at a finite temperature on hypercubic lattices in\ndimensions up to 5. The model includes a ` social\\rq local field which contains\nthe magnetization at time $t$. The nearest neighbour quenched interactions are\ndrawn from a binary distribution which is a function of the bond concentration,\n$p$. The decay of the persistence probability in the model depends on both the\nspatial dimension and $p$. We find no evidence of ` blocking\\rq in this model.\nWe also discuss the implications of our results for possible applications in\nthe social and economic fields. It is suggested that the absence, or otherwise,\nof blocking could be used as a criterion to decide on the validity of a given\nmodel in different scenarios.\n", "versions": [{"version": "v1", "created": "Fri, 7 Sep 2007 14:33:12 GMT"}, {"version": "v2", "created": "Mon, 17 Sep 2007 17:23:46 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Jain", "S.", ""], ["Yamano", "T.", ""]]}, {"id": "0709.1543", "submitter": "Arnab Chatterjee", "authors": "Arnab Chatterjee, Bikas K. Chakrabarti", "title": "Kinetic Exchange Models for Income and Wealth Distributions", "comments": "15 pages, 20 eps figures, EPJ class; To be published as \"Colloquium\"\n  in Eur Phys J B", "journal-ref": "The European Physical Journal B 60 (2007) 135-149", "doi": "10.1140/epjb/e2007-00343-8", "report-no": null, "categories": "q-fin.GN cond-mat.stat-mech nlin.AO physics.soc-ph", "license": null, "abstract": "  Increasingly, a huge amount of statistics have been gathered which clearly\nindicates that income and wealth distributions in various countries or\nsocieties follow a robust pattern, close to the Gibbs distribution of energy in\nan ideal gas in equilibrium. However, it also deviates in the low income and\nmore significantly for the high income ranges. Application of physics models\nprovides illuminating ideas and understanding, complementing the observations.\n", "versions": [{"version": "v1", "created": "Tue, 11 Sep 2007 08:18:14 GMT"}, {"version": "v2", "created": "Fri, 16 Nov 2007 09:50:46 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Chatterjee", "Arnab", ""], ["Chakrabarti", "Bikas K.", ""]]}, {"id": "0709.2630", "submitter": "Daniel Rockmore", "authors": "Irena Tzekina, Karan Danthi, Daniel N. Rockmore", "title": "Evolution of community structure in the world trade web", "comments": "To be submitted to APFA 6 Proceedings, 8 pages, 3 Figures", "journal-ref": null, "doi": "10.1140/epjb/e2008-00181-2", "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": null, "abstract": "  In this note we study the bilateral merchandise trade flows between 186\ncountries over the 1948-2005 period using data from the International Monetary\nFund. We use Pajek to identify network structure and behavior across thresholds\nand over time. In particular, we focus on the evolution of trade \"islands\" in\nthe a world trade network in which countries are linked with directed edges\nweighted according to fraction of total dollars sent from one country to\nanother. We find mixed evidence for globalization.\n", "versions": [{"version": "v1", "created": "Sat, 15 Sep 2007 08:49:56 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Tzekina", "Irena", ""], ["Danthi", "Karan", ""], ["Rockmore", "Daniel N.", ""]]}, {"id": "0709.2694", "submitter": "Tanya Araujo", "authors": "Tanya Araujo, R. Vilela Mendes", "title": "Innovation Success and Structural Change: An Abstract Agent Based Study", "comments": "20 pages, 12 figures", "journal-ref": "Advances in Complex Systems 12 (2009) 233-253", "doi": null, "report-no": null, "categories": "q-fin.GN nlin.AO", "license": null, "abstract": "  A model is developed to study the effectiveness of innovation and its impact\non structure creation and structure change on agent-based societies. The\nabstract model that is developed is easily adapted to any particular field. In\nany interacting environment, the agents receive something from the environment\n(the other agents) in exchange for their effort and pay the environment a\ncertain amount of value for the fulfilling of their needs or for the very price\nof existence in that environment. This is coded by two bit strings and the\ndynamics of the exchange is based on the matching of these strings to those of\nthe other agents. Innovation is related to the adaptation by the agents of\ntheir bit strings to improve some utility function.\n", "versions": [{"version": "v1", "created": "Mon, 17 Sep 2007 19:44:14 GMT"}], "update_date": "2010-08-31", "authors_parsed": [["Araujo", "Tanya", ""], ["Mendes", "R. Vilela", ""]]}, {"id": "0709.3710", "submitter": "Ciwei Gao", "authors": "C. Gao, E. Bompard, R. Napoli, Q. Wan", "title": "Bidding Strategy with Forecast Technology Based on Support Vector\n  Machine in Electrcity Market", "comments": "8pages, 13figures, paper for the conference \"Applications of Physics\n  in Financial Analysis 6th International Conference\"", "journal-ref": null, "doi": "10.1016/j.physa.2008.02.080", "report-no": null, "categories": "q-fin.GN physics.data-an", "license": null, "abstract": "  The participants of the electricity market concern very much the market price\nevolution. Various technologies have been developed for price forecast. SVM\n(Support Vector Machine) has shown its good performance in market price\nforecast. Two approaches for forming the market bidding strategies based on SVM\nare proposed. One is based on the price forecast accuracy, with which the being\nrejected risk is defined. The other takes into account the impact of the\nproducer's own bid. The risks associated with the bidding are controlled by the\nparameters setting. The proposed approaches have been tested on a numerical\nexample.\n", "versions": [{"version": "v1", "created": "Mon, 24 Sep 2007 08:49:16 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Gao", "C.", ""], ["Bompard", "E.", ""], ["Napoli", "R.", ""], ["Wan", "Q.", ""]]}, {"id": "0709.4093", "submitter": "Bikas K. Chakrabarti", "authors": "Bikas K Chakrabarti", "title": "A Brief History of Economics: An Outsider's Account", "comments": "6 pages, Springer style, from 'Econophysics of Stock and Other\n  Markets', Eds. A. Chatterjee, B. K. Chakrabarti, New Economic Windows Series,\n  Springer, Milan, 2006, pp~219-224", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": null, "abstract": "  A dangerously brief history of the developments of the main ideas in\neconomics, as observed by a physicist, is given. This was published in\n'Econophysics of Stock and Other Markets', Eds. A. Chatterjee, B. K.\nChakrabarti, New Economic Windows Series, Springer, Milan, 2006, pp~219-224.\n", "versions": [{"version": "v1", "created": "Wed, 26 Sep 2007 07:48:52 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Chakrabarti", "Bikas K", ""]]}, {"id": "0709.4096", "submitter": "Jan Sladkowski", "authors": "E.W. Piotrowski, J. Sladkowski", "title": "Quantum Auctions: Facts and Myths", "comments": "Talk given at the conference APFA6 (July 2007, Lisbone); 9 pages", "journal-ref": null, "doi": "10.1016/j.physa.2008.02.071", "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": null, "abstract": "  Quantum game theory, whatever opinions may be held due to its abstract\nphysical formalism, have already found various applications even outside the\northodox physics domain. In this paper we introduce the concept of a quantum\nauction, its advantages and drawbacks. Then we describe the models that have\nalready been put forward. A general model involves Wigner formalism and\ninfinite dimensional Hilbert spaces - we envisage that the implementation might\nnot be an easy task. But a restricted model advocated by the Hewlett-Packard\ngroup seems to be much easier to implement. Simulations involving humans have\nalready been performed. We will focus on problems related to combinatorial\nauctions and technical assumptions that are made. Quantum approach offers at\nleast two important developments. Powerful quantum algorithms for finding\nsolutions would extend the range of possible applications. Quantum strategies,\nbeing qubits, can be teleported but are immune from cloning - therefore extreme\nprivacy of agent's activity could in principle be guaranteed. Then we point out\nsome key problem that have to be solved before commercial use would be\npossible. With present technology, optical networks, single photon sources and\ndetectors seems to be sufficient for experimental realization in the near\nfuture. We conclude by describing potential customers, estimating the potential\nmarket size and possible timing.\n", "versions": [{"version": "v1", "created": "Wed, 26 Sep 2007 08:01:14 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Piotrowski", "E. W.", ""], ["Sladkowski", "J.", ""]]}, {"id": "0709.4355", "submitter": "Yuichi Ikeda", "authors": "Yuichi Ikeda, Yoshi Fujiwara, Wataru Souma, Hideaki Aoyama and Hiroshi\n  Iyetomi", "title": "Agent Simulation of Chain Bankruptcy", "comments": "Proceeding of APFA6", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": null, "abstract": "  We have conducted an agent-based simulation of chain bankruptcy. The\npropagation of credit risk on a network, i.e., chain bankruptcy, is the key to\nnderstanding largesized bankruptcies. In our model, decrease of revenue by the\nloss of accounts payable is modeled by an interaction term, and bankruptcy is\ndefined as a capital deficit. Model parameters were estimated using financial\ndata for 1,077 listed Japanese firms. Simulations of chain bankruptcy on the\nreal transaction network consisting of those 1,077 firms were made with the\nestimated model parameters. Given an initial bankrupt firm, a list of chain\nbankrupt firms was obtained. This model can be used to detect high-risk links\nin a transaction network, for the management of chain bankruptcy.\n", "versions": [{"version": "v1", "created": "Thu, 27 Sep 2007 10:43:30 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Ikeda", "Yuichi", ""], ["Fujiwara", "Yoshi", ""], ["Souma", "Wataru", ""], ["Aoyama", "Hideaki", ""], ["Iyetomi", "Hiroshi", ""]]}]