[{"id": "0808.1655", "submitter": "R. Alexander Bentley", "authors": "R. Alexander Bentley, Paul Ormerod, Mark E. Madsen", "title": "Shelf space strategy in long-tail markets", "comments": "10 pages, 3 figures", "journal-ref": "Physica A, 388 (2008) 691-696", "doi": "10.1016/j.physa.2008.11.009", "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet is known to have had a powerful impact on on-line retailer\nstrategies in markets characterised by long-tail distribution of sales. Such\nretailers can exploit the long tail of the market, since they are effectively\nwithout physical limit on the number of choices on offer. Here we examine two\nextensions of this phenomenon. First, we introduce turnover into the long-tail\ndistribution of sales. Although over any given period such as a week or a\nmonth, the distribution is right-skewed and often power law distributed, over\ntime there is considerable turnover in the rankings of sales of individual\nproducts. Second, we establish some initial results on the implications for\nshelf-space strategy of physical retailers in such markets.\n", "versions": [{"version": "v1", "created": "Tue, 12 Aug 2008 13:09:45 GMT"}, {"version": "v2", "created": "Tue, 19 Aug 2008 08:37:16 GMT"}], "update_date": "2009-01-11", "authors_parsed": [["Bentley", "R. Alexander", ""], ["Ormerod", "Paul", ""], ["Madsen", "Mark E.", ""]]}, {"id": "0808.1828", "submitter": "Didier Sornette", "authors": "A. Saichev, Y. Malevergne and D. Sornette", "title": "Theory of Zipf's Law and of General Power Law Distributions with\n  Gibrat's law of Proportional Growth", "comments": "11 pages, 1 figure with 4 panels, summary of a book in press", "journal-ref": "Theory of Zipf's Law and beyond, Lecture Notes in Economics and\n  Mathematical Systems, Volume 632, Springer (November 2009) ISBN:\n  978-3-642-02945-5", "doi": null, "report-no": null, "categories": "q-fin.GN physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We summarize a book under publication with his title written by the three\npresent authors, on the theory of Zipf's law, and more generally of power laws,\ndriven by the mechanism of proportional growth. The preprint is available upon\nrequest from the authors.\n  For clarity, consistence of language and conciseness, we discuss the origin\nand conditions of the validity of Zipf's law using the terminology of firms'\nasset values. We use firms at the entities whose size distributions are to be\nexplained. It should be noted, however, that most of the relations discussed in\nthis book, especially the intimate connection between Zipf's and Gilbrat's\nlaws, underlie Zipf's law in diverse scientific areas. The same models and\nvariations thereof can be straightforwardly applied to any of the other domains\nof application.\n", "versions": [{"version": "v1", "created": "Wed, 13 Aug 2008 13:54:36 GMT"}], "update_date": "2014-08-26", "authors_parsed": [["Saichev", "A.", ""], ["Malevergne", "Y.", ""], ["Sornette", "D.", ""]]}, {"id": "0808.3339", "submitter": "Kota Watanabe", "authors": "Kota Watanabe, Hideki Takayasu and Misako Takayasu", "title": "Random walker in a temporally deforming higher-order potential forces\n  observed in financial crisis", "comments": "5 pages, 13 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.80.056110", "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Basic peculiarities of market price fluctuations are known to be well\ndescribed by a recently developed random walk model in a temporally deforming\nquadric potential force whose center is given by a moving average of past price\ntraces [Physica A 370, pp91-97, 2006]. By analyzing high-frequency financial\ntime series of exceptional events such as bubbles and crashes, we confirm the\nappearance of nonlinear potential force in the markets. We show statistical\nsignificance of its existence by applying the information criterion. This new\ntime series analysis is expected to be applied widely for detecting a\nnon-stationary symptom in random phenomena.\n", "versions": [{"version": "v1", "created": "Mon, 25 Aug 2008 11:48:26 GMT"}, {"version": "v2", "created": "Thu, 27 Nov 2008 06:38:39 GMT"}], "update_date": "2013-05-29", "authors_parsed": [["Watanabe", "Kota", ""], ["Takayasu", "Hideki", ""], ["Takayasu", "Misako", ""]]}]