[{"id": "0903.0282", "submitter": "Arnab Kumar Ray", "authors": "Arnab K. Ray", "title": "A dynamic nonlinear model for saturation in industrial growth", "comments": "ReVTeX, 5 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A general nonlinear logistic equation has been proposed to model long-time\nsaturation in industrial growth. An integral solution of this equation has been\nderived for any arbitrary degree of nonlinearity. A time scale for the onset of\nnonlinear saturation in industrial growth can be estimated from an\nequipartition condition between nonlinearity and purely exponential growth.\nPrecise predictions can be made about the limiting values of the annual revenue\nand the human resource content that an industrial organisation may attain.\nThese variables have also been modelled to set up an autonomous first-order\ndynamical system, whose equilibrium condition forms a stable node (an attractor\nstate) in a related phase portrait. The theoretical model has received close\nsupport from all relevant data pertaining to the well-known global company,\nIBM.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2009 12:43:40 GMT"}], "update_date": "2009-03-03", "authors_parsed": [["Ray", "Arnab K.", ""]]}, {"id": "0903.2099", "submitter": "Siew-Ann Cheong", "authors": "Yik Wen Goo, Tong Wei Lian, Wei Guang Ong, Wen Ting Choi, and Siew-Ann\n  Cheong", "title": "Financial Atoms and Molecules", "comments": "19 pages in RevTeX4 format, 15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Atoms and molecules are important conceptual entities we invented to\nunderstand the physical world around us. The key to their usefulness lies in\nthe organization of nuclear and electronic degrees of freedom into a single\ndynamical variable whose time evolution we can better imagine. The use of such\neffective variables in place of the true microscopic variables is possible\nbecause of the separation between nuclear/electronic and atomic/molecular time\nscales. Where separation of time scales occurs, identification of analogous\nobjects in financial markets can help advance our understanding of their\ndynamics. To detect separated time scales and identify their associated\neffective degrees of freedom in financial markets, we devised a two-stage\nstatistical clustering scheme to analyze the price movements of stocks in\nseveral equity markets. Through this two-time-scale clustering analysis, we\ndiscovered a hierarchy of levels of self-organization in real financial\nmarkets. We call these statistically robust self-organized dynamical structures\nfinancial atoms, financial molecules, and financial supermolecules. In general,\nthe detailed compositions of these dynamical structures cannot be deduced based\non raw financial intuition alone, and must be explained in terms of the\nunderlying portfolios, and investment strategies of market players. More\ninterestingly, we find that major market events such as the Chinese Correction\nand the Subprime Crisis leave many tell-tale signs within the correlational\nstructures of financial molecules.\n", "versions": [{"version": "v1", "created": "Thu, 12 Mar 2009 06:09:03 GMT"}], "update_date": "2009-03-13", "authors_parsed": [["Goo", "Yik Wen", ""], ["Lian", "Tong Wei", ""], ["Ong", "Wei Guang", ""], ["Choi", "Wen Ting", ""], ["Cheong", "Siew-Ann", ""]]}, {"id": "0903.2428", "submitter": "Jean-Philippe Bouchaud", "authors": "J.P. Bouchaud (Capital Fund Management)", "title": "Price Impact", "comments": "Entry for the upcoming \"Encyclopedia of Quantitative Finance\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define what \"Price Impact\" means, and how it is measured and modelled in\nthe recent literature. Although this notion seems to convey the idea of a\nforceful and intuitive mechanism, we discuss why things might not be that\nsimple. Empirical studies show that while the correlation between signed order\nflow and price changes is strong, the impact of trades on prices is neither\nlinear in volume nor permanent. Impact allows private information to be\nreflected in prices, but by the same token, random fluctuations in order flow\nmust also contribute to the volatility of markets.\n", "versions": [{"version": "v1", "created": "Fri, 13 Mar 2009 16:42:00 GMT"}], "update_date": "2017-08-24", "authors_parsed": [["Bouchaud", "J. P.", "", "Capital Fund Management"]]}, {"id": "0903.3254", "submitter": "David Saakian", "authors": "David B. Saakian", "title": "Mapping markets to the statistical mechanics: the derivatives act\n  against the self-regulation of stock market", "comments": "3 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mapping the economy to the some statistical physics models we get strong\nindications that, in contrary to the pure stock market, the stock market with\nderivatives could not self-regulate.\n", "versions": [{"version": "v1", "created": "Wed, 18 Mar 2009 23:22:18 GMT"}], "update_date": "2009-03-20", "authors_parsed": [["Saakian", "David B.", ""]]}, {"id": "0903.3346", "submitter": "Svetlana Zverovich", "authors": "S. Zverovich", "title": "The Transfer Pricing Problem with Non-Linearities", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A number of approaches to solving the well-known transfer pricing problem are\nknown. However, few models satisfactorily resolve the core problem of allowing\nboth the source and receiving divisions to earn a profit on transfers during a\nperiod in such a way that sub-optimal output levels are avoided. In 1969,\nSamuel proposed to use a transfer price schedule instead of just a single\ntransfer price. An essential improvement of Samuels' model was given by Tomkins\n(1990) in his pragmatic-analytical transfer pricing approach, which is a\ncombination of a single cost-plus transfer price and the pragmatic process of\nnegotiation. This fundamental approach was developed under the assumption that\nthe net average revenue curve for the final product is linear.\n  In this paper, Tomkins' pragmatic-analytical model is further developed for\nnon-linear net average revenue curves. In particular, typical quadratic\nfunctions are considered and corresponding transfer price schedules are\ndetermined. A similar technique can be used for the transfer pricing problem\nwith any net average revenue curve.\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2009 15:16:02 GMT"}], "update_date": "2009-03-20", "authors_parsed": [["Zverovich", "S.", ""]]}, {"id": "0903.3657", "submitter": "Diogo Pinheiro", "authors": "Lampros Boukas, Diogo Pinheiro, Alberto Pinto, Stylianos Xanthopoulos,\n  Athanasios Yannacopoulos", "title": "Behavioural and Dynamical Scenarios for Contingent Claims Valuation in\n  Incomplete Markets", "comments": "18 pages. To appear in Journal of Difference Equations and\n  Applications", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of determination of asset prices in an incomplete market\nproposing three different but related scenarios. One scenario uses a market\ngame approach whereas the other two are based on risk sharing or regret\nminimizing considerations. Dynamical schemes modeling the convergence of the\nbuyer's and of the seller's prices to a unique price are proposed.\n", "versions": [{"version": "v1", "created": "Sat, 21 Mar 2009 11:31:13 GMT"}], "update_date": "2009-03-24", "authors_parsed": [["Boukas", "Lampros", ""], ["Pinheiro", "Diogo", ""], ["Pinto", "Alberto", ""], ["Xanthopoulos", "Stylianos", ""], ["Yannacopoulos", "Athanasios", ""]]}, {"id": "0903.3736", "submitter": "Constantinos Kardaras", "authors": "Constantinos Kardaras", "title": "Num\\'{e}raire-invariant preferences in financial modeling", "comments": "Published in at http://dx.doi.org/10.1214/09-AAP669 the Annals of\n  Applied Probability (http://www.imstat.org/aap/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Probability 2010, Vol. 20, No. 5, 1697-1728", "doi": "10.1214/09-AAP669", "report-no": "IMS-AAP-AAP669", "categories": "q-fin.GN math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide an axiomatic foundation for the representation of\nnum\\'{e}raire-invariant preferences of economic agents acting in a financial\nmarket. In a static environment, the simple axioms turn out to be equivalent to\nthe following choice rule: the agent prefers one outcome over another if and\nonly if the expected (under the agent's subjective probability) relative rate\nof return of the latter outcome with respect to the former is nonpositive. With\nthe addition of a transitivity requirement, this last preference relation has\nan extension that can be numerically represented by expected logarithmic\nutility. We also treat the case of a dynamic environment where consumption\nstreams are the objects of choice. There, a novel result concerning a canonical\nrepresentation of unit-mass optional measures enables us to explicitly solve\nthe investment--consumption problem by separating the two aspects of investment\nand consumption. Finally, we give an application to the problem of optimal\nnum\\'{e}raire investment with a random time-horizon.\n", "versions": [{"version": "v1", "created": "Sun, 22 Mar 2009 16:15:27 GMT"}, {"version": "v2", "created": "Fri, 13 Nov 2009 19:27:41 GMT"}, {"version": "v3", "created": "Fri, 13 Nov 2009 22:20:41 GMT"}, {"version": "v4", "created": "Thu, 3 Dec 2009 00:47:30 GMT"}, {"version": "v5", "created": "Mon, 8 Nov 2010 10:54:03 GMT"}], "update_date": "2010-11-09", "authors_parsed": [["Kardaras", "Constantinos", ""]]}, {"id": "0903.5064", "submitter": "Ivan Kitov O.", "authors": "Ivan Kitov, Oleg Kitov", "title": "Unemployment and inflation in Western Europe: solution by the boundary\n  element method", "comments": "27 pages, 22 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using an analog of the boundary element method in engineering and science, we\nanalyze and model unemployment rate in Austria, Italy, the Netherlands, Sweden,\nSwitzerland, and the United States as a function of inflation and the change in\nlabor force. Originally, the model linking unemployment to inflation and labor\nforce was developed and successfully tested for Austria, Canada, France,\nGermany, Japan, and the United States. Autoregressive properties of neither of\nthese variables are used to predict their evolution. In this sense, the model\nis a self-consistent and completely deterministic one without any stochastic\ncomponent (external shocks) except that associated with measurement errors and\nchanges in measurement units. Nevertheless, the model explains between 65% and\n95% of the variability in unemployment and inflation. For Italy, the rate of\nunemployment is predicted at a time horizon of nine years with pseudo\nout-of-sample root-mean-square forecasting error of 0.55% for the period\nbetween 1973 and 2006. One can expect that the u nemployment will be growing\nsince 2008 and will reach 11.4% near 2012. After 2012, unemployment in Italy\nwill start to descend.\n", "versions": [{"version": "v1", "created": "Sun, 29 Mar 2009 16:46:31 GMT"}], "update_date": "2009-03-31", "authors_parsed": [["Kitov", "Ivan", ""], ["Kitov", "Oleg", ""]]}]