[{"id": "0904.0729", "submitter": "Ivan Kitov O.", "authors": "Ivan O. Kitov", "title": "Does economics need a scientific revolution?", "comments": "6 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Economics does not need a scientific revolution. Economics needs accurate\nmeasurements according to high standards of natural sciences and meticulous\nwork on revealing empirical relationships between measured variables.\n", "versions": [{"version": "v1", "created": "Sat, 4 Apr 2009 17:06:44 GMT"}], "update_date": "2009-04-07", "authors_parsed": [["Kitov", "Ivan O.", ""]]}, {"id": "0904.0756", "submitter": "Sergey Razumovsky Mr.", "authors": "S.I. Chernyshov, A.V. Voronin, S.A. Razumovsky", "title": "The Problem of Modeling of Economic Dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The correctness of Harrods model in the differential form is studied. The\ninadequacy of exponential growth of economy is shown; an alternative result is\nobtained. By example of Phillips model, an approach to correction of\nmacroeconomic models (in terms of initial prerequisites) is generalized. A\nmethodology based on balance relations for modelling of economic dynamics,\nincluding obtaining forecast estimates, is developed. The problems thus\nconsidered are reduced to the solution of Volterra and Fredholm integral\nequations of the second kind.\n", "versions": [{"version": "v1", "created": "Sun, 5 Apr 2009 09:36:42 GMT"}, {"version": "v2", "created": "Sun, 7 Jun 2009 17:13:43 GMT"}, {"version": "v3", "created": "Mon, 30 Nov 2009 14:40:26 GMT"}], "update_date": "2009-11-30", "authors_parsed": [["Chernyshov", "S. I.", ""], ["Voronin", "A. V.", ""], ["Razumovsky", "S. A.", ""]]}, {"id": "0904.0805", "submitter": "Jean-Philippe Bouchaud", "authors": "Jean-Philippe Bouchaud", "title": "The (unfortunate) complexity of the economy", "comments": null, "journal-ref": "Physics World, April 2009, p.28-32", "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article is a follow-up of a short essay that appeared in Nature 455,\n1181 (2008) [arXiv:0810.5306]. It has become increasingly clear that the\nerratic dynamics of markets is mostly endogenous and not due to the rational\nprocessing of exogenous news. I elaborate on the idea that spin-glass type of\nproblems, where the combination of competition and heterogeneities generically\nleads to long epochs of statis interrupted by crises and hyper-sensitivity to\nsmall changes of the environment, could be metaphors for the complexity of\neconomic systems. I argue that the most valuable contribution of physics to\neconomics might end up being of methodological nature, and that simple models\nfrom physics and agent based numerical simulations, although highly stylized,\nare more realistic than the traditional models of economics that assume\nrational agents with infinite foresight and infinite computing abilities.\n", "versions": [{"version": "v1", "created": "Mon, 6 Apr 2009 12:36:14 GMT"}], "update_date": "2009-04-07", "authors_parsed": [["Bouchaud", "Jean-Philippe", ""]]}, {"id": "0904.0870", "submitter": "Sovan Mitra", "authors": "Sovan Mitra", "title": "Risk Measures in Quantitative Finance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.GN q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper was presented and written for two seminars: a national UK\nUniversity Risk Conference and a Risk Management industry workshop. The target\naudience is therefore a cross section of Academics and industry professionals.\n  The current ongoing global credit crunch has highlighted the importance of\nrisk measurement in Finance to companies and regulators alike. Despite risk\nmeasurement's central importance to risk management, few papers exist reviewing\nthem or following their evolution from its foremost beginnings up to the\npresent day risk measures.\n  This paper reviews the most important portfolio risk measures in Financial\nMathematics, from Bernoulli (1738) to Markowitz's Portfolio Theory, to the\npresently preferred risk measures such as CVaR (conditional Value at Risk). We\nprovide a chronological review of the risk measures and survey less commonly\nknown risk measures e.g. Treynor ratio.\n", "versions": [{"version": "v1", "created": "Mon, 6 Apr 2009 09:20:23 GMT"}], "update_date": "2009-04-07", "authors_parsed": [["Mitra", "Sovan", ""]]}, {"id": "0904.0896", "submitter": "Fabio Bagarello", "authors": "F. Bagarello", "title": "An operatorial approach to stock markets", "comments": null, "journal-ref": "J. Phys. A, {\\bf 39}, 6823-6840 (2006)", "doi": "10.1088/0305-4470/39/22/001", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose and discuss some toy models of stock markets using the same\noperatorial approach adopted in quantum mechanics. Our models are suggested by\nthe discrete nature of the number of shares and of the cash which are exchanged\nin a real market, and by the existence of conserved quantities, like the total\nnumber of shares or some linear combination of cash and shares. The same\nframework as the one used in the description of a gas of interacting bosons is\nadopted.\n", "versions": [{"version": "v1", "created": "Mon, 6 Apr 2009 10:17:33 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Bagarello", "F.", ""]]}, {"id": "0904.1426", "submitter": "Jacky Mallett", "authors": "Jacky Mallett", "title": "What are the limits on Commercial Bank Lending?", "comments": "19 pages, 6 figures, Accepted for Publication in Advances in Complex\n  Systems, August 2nd 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Analysis of the 2007-8 credit crisis has concentrated on issues of relaxed\nlending standards, and the perception of irrational behaviour by speculative\ninvestors in real estate and other assets. Asset backed securities have been\nextensively criticised for creating a moral hazard in loan issuance and an\nassociated increase in default risk, by removing the immediate lender's\nincentive to ensure that the underlying loans could be repaid. However\nsignificant monetary issues can accompany any form of increased commercial bank\nlending, and these appear to have been overlooked by this analysis. In this\npaper we propose a general explanation for credit crises based on an\nexamination of the mechanics of the banking system, and in particular its\ninternal controls on the supply of credit. We suggest that the current credit\ncrisis is the result of multiple failures in the Basel regulatory framework,\nincluding the removal of central bank reserve requirements from some classes of\ndeposit accounts within the banking system, allowing financial instruments\nrepresenting debt to be used as regulatory capital, and in particular the\nintroduction of securitized lending which effectively removed a previously\nimplicit control over the total quantity of lending originating from the\nbanking system. We further argue that the interaction of these problems has led\nto a destabilising imbalance between total money and loan supply growth, in\nthat total lending sourced from the commercial bank sector increased at a\nfaster rate than accompanying growth in the money supply. This not only created\na multi-decade macro-economic debt spiral, but by increasing the ratio of debt\nto money within the monetary system acted to increase the risk of loan\ndefaults, and consequentially reduce the overall stability of the banking\nsystem.\n", "versions": [{"version": "v1", "created": "Wed, 8 Apr 2009 20:30:37 GMT"}, {"version": "v2", "created": "Thu, 31 Dec 2009 16:50:01 GMT"}, {"version": "v3", "created": "Sun, 9 Jan 2011 23:41:04 GMT"}, {"version": "v4", "created": "Fri, 3 Aug 2012 00:31:39 GMT"}], "update_date": "2012-08-06", "authors_parsed": [["Mallett", "Jacky", ""]]}, {"id": "0904.2113", "submitter": "Matthias Hanauske", "authors": "Matthias Hanauske, Jennifer Kunz, Steffen Bernius, and Wolfgang\n  K\\\"onig", "title": "Doves and hawks in economics revisited. An evolutionary quantum game\n  theory-based analysis of financial crises", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2010.06.007", "report-no": null, "categories": "q-fin.GN physics.soc-ph q-fin.TR quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The last financial and economic crisis demonstrated the dysfunctional\nlong-term effects of aggressive behaviour in financial markets. Yet,\nevolutionary game theory predicts that under the condition of strategic\ndependence a certain degree of aggressive behaviour remains within a given\npopulation of agents. However, as the consequences of the financial crisis\nexhibit, it would be desirable to change the 'rules of the game' in a way that\nprevents the occurrence of any aggressive behaviour and thereby also the danger\nof market crashes. The paper picks up this aspect. Through the extension of the\nin literature well-known Hawk-Dove game by a quantum approach, we can show that\ndependent on entanglement, also evolutionary stable strategies can emerge,\nwhich are not predicted by classical evolutionary game theory and where the\ntotal economic population uses a non aggressive quantum strategy.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2009 12:49:48 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Hanauske", "Matthias", ""], ["Kunz", "Jennifer", ""], ["Bernius", "Steffen", ""], ["König", "Wolfgang", ""]]}, {"id": "0904.2731", "submitter": "Sovan Mitra", "authors": "Sovan Mitra", "title": "An Introduction to Hedge Funds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This report was originally written as an industry white paper on Hedge Funds.\nThis paper gives an overview to Hedge Funds, with a focus on risk management\nissues. We define and explain the general characteristics of Hedge Funds, their\nmain investment strategies and the risk models employed. We address the\nproblems in Hedge Fund modelling, survey current Hedge Funds available on the\nmarket and those that have been withdrawn. Finally, we summarise the supporting\nand opposing arguments for Hedge Fund usage. A unique value of this paper,\ncompared to other Hedge Fund literature freely available on the internet, is\nthat this review is fully sourced from academic references (such as peer\nreviewed journals) and is thus a bona fide study. This paper will be of\ninterest to: Hedge Fund and Mutual Fund Managers, Quantitative Analysts,\n\"Front\" and \"Middle\" office banking functions e.g. Treasury Management,\nRegulators concerned with Hedge Fund Financial Risk Management, Private and\nInstitutional Investors, Academic Researchers in the area of Financial Risk\nManagement and the general Finance community.\n", "versions": [{"version": "v1", "created": "Fri, 17 Apr 2009 15:55:28 GMT"}, {"version": "v2", "created": "Fri, 17 Apr 2009 20:48:09 GMT"}], "update_date": "2009-04-20", "authors_parsed": [["Mitra", "Sovan", ""]]}, {"id": "0904.2913", "submitter": "Constantinos Kardaras", "authors": "Constantinos Kardaras", "title": "Generalized supermartingale deflators under limited information", "comments": "13 pages; (hopefully) final version. To appear in \"Mathematical\n  Finance\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We undertake a study of markets from the perspective of a financial agent\nwith limited access to information. The set of wealth processes available to\nthe agent is structured with reasonable economic properties, instead of the\nusual practice of taking it to consist of stochastic integrals against a\nsemimartingale integrator. We obtain the equivalence of the boundedness in\nprobability of the set of terminal wealth outcomes (which in turn is equivalent\nto the weak market viability condition of absence of arbitrage of the first\nkind) with the existence of at least one strictly positive deflator that makes\nthe deflated wealth processes have a generalized supermartingale property.\n", "versions": [{"version": "v1", "created": "Sun, 19 Apr 2009 13:16:47 GMT"}, {"version": "v2", "created": "Thu, 21 Jan 2010 15:18:52 GMT"}, {"version": "v3", "created": "Sun, 19 Sep 2010 16:13:15 GMT"}, {"version": "v4", "created": "Sun, 10 Oct 2010 19:44:40 GMT"}], "update_date": "2010-10-12", "authors_parsed": [["Kardaras", "Constantinos", ""]]}, {"id": "0904.3004", "submitter": "Siew-Ann Cheong", "authors": "Wong Jian Cheng, Lian Heng, and Cheong Siew Ann", "title": "Macroeconomic Phase Transitions Detected from the Dow Jones Industrial\n  Average Time Series", "comments": "elsarticle, 18 pages, 3 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we perform statistical segmentation and clustering analysis of\nthe Dow Jones Industrial Average time series between January 1997 and August\n2008. Modeling the index movements and log-index movements as stationary\nGaussian processes, we find a total of 116 and 119 statistically stationary\nsegments respectively. These can then be grouped into between five to seven\nclusters, each representing a different macroeconomic phase. The macroeconomic\nphases are distinguished primarily by their volatilities. We find the US\neconomy, as measured by the DJI, spends most of its time in a low-volatility\nphase and a high-volatility phase. The former can be roughly associated with\neconomic expansion, while the latter contains the economic contraction phase in\nthe standard economic cycle. Both phases are interrupted by a\nmoderate-volatility market, but extremely-high-volatility market crashes are\nfound mostly within the high-volatility phase. From the temporal distribution\nof various phases, we see a high-volatility phase from mid-1998 to mid-2003,\nand another starting mid-2007 (the current global financial crisis).\nTransitions from the low-volatility phase to the high-volatility phase are\npreceded by a series of precursor shocks, whereas the transition from the\nhigh-volatility phase to the low-volatility phase is preceded by a series of\ninverted shocks. The time scale for both types of transitions is about a year.\nWe also identify the July 1997 Asian Financial Crisis to be the trigger for the\nmid-1998 transition, and an unnamed May 2006 market event related to\ncorrections in the Chinese markets to be the trigger for the mid-2007\ntransition.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2009 11:28:48 GMT"}], "update_date": "2009-04-21", "authors_parsed": [["Cheng", "Wong Jian", ""], ["Heng", "Lian", ""], ["Ann", "Cheong Siew", ""]]}, {"id": "0904.3929", "submitter": "Ammar Kessab", "authors": "Ammar Kessab (GRANEM)", "title": "La Loi organique relative aux lois de finances (LOLF) dans les\n  institutions culturelles publiques du spectacle vivant en France", "comments": "10th International Conference on Arts and Cultural Management (AIMAC\n  2009), Dallas : \\'Etats-Unis d'Am\\'erique (2009)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a crisis of public finances, France bases all its hopes on the \"evaluation\nof performance\" to moderate the effects of a complex crisis. Under the banner\nof \"modernization of the State\", a new \"financial constitution\" called the\nOrganic Law on finance laws (LOLF) became the main lever of reform of public\nmanagement. Fully applied to the Cultural Affairs since 2006, the LOLF is based\non a set of performance indicators and sets the public performance arts\ninstitutions specific targets. This article defines and analyzes the pattern of\nthe design and the course of these indicators and targets. It also examines the\ncontroversy generated by this new mode of governance.\n", "versions": [{"version": "v1", "created": "Fri, 24 Apr 2009 19:41:29 GMT"}, {"version": "v2", "created": "Sat, 25 Apr 2009 05:57:39 GMT"}], "update_date": "2009-04-27", "authors_parsed": [["Kessab", "Ammar", "", "GRANEM"]]}]