[{"id": "0907.2531", "submitter": "Fabio Bagarello", "authors": "Fabio Bagarello", "title": "A quantum statistical approach to simplified stock markets", "comments": "in press in Physica A", "journal-ref": null, "doi": "10.1016/j.physa.2009.07.006", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use standard perturbation techniques originally formulated in quantum\n(statistical) mechanics in the analysis of a toy model of a stock market which\nis given in terms of bosonic operators. In particular we discuss the\nprobability of transition from a given value of the {\\em portfolio} of a\ncertain trader to a different one. This computation can also be carried out\nusing some kind of {\\em Feynman graphs} adapted to the present context.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jul 2009 08:58:22 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Bagarello", "Fabio", ""]]}, {"id": "0907.4950", "submitter": "Angus Brown", "authors": "A. A. Brown", "title": "Heterogeneous Beliefs with Partial Observations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines a heterogeneous beliefs model in which there is a process\nthat is only partially observed by the agents. The economy contains a risky\nasset producing dividends continuously in time. The dividends are observed by\nthe agents. The dividends are assumed to be a known function of some other\nunobserved process. The agents use filtering to estimate the value of this\nunobserved process. The agents have different beliefs about the dynamics of the\nunobserved process and therefore form different estimates. We analyse this\nmodel and derive the state price density. We use this to derive the riskless\nrate. We also characterise the price of the risky asset in terms of the\nsolution of a series of differential equations.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jul 2009 16:38:13 GMT"}], "update_date": "2009-07-29", "authors_parsed": [["Brown", "A. A.", ""]]}, {"id": "0907.4953", "submitter": "Angus Brown", "authors": "A. A. Brown and L. C. G. Rogers", "title": "Heterogeneous Beliefs with Finite-Lived Agents", "comments": "6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper will examine a model with many agents, each of whom has a\ndifferent belief about the dynamics of a risky asset. The agents are Bayesian\nand so learn about the asset over time. All agents are assumed to have a finite\n(but random) lifetime. When an agent dies, he passes his wealth (but not his\nknowledge) onto his heir. As a result, the agents never become sure of the\ndynamics of the risky asset. We derive expressions for the stock price and\nriskless rate. We then use numerical examples to exhibit their behaviour.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jul 2009 17:09:17 GMT"}], "update_date": "2009-07-29", "authors_parsed": [["Brown", "A. A.", ""], ["Rogers", "L. C. G.", ""]]}, {"id": "0907.4964", "submitter": "Angus Brown", "authors": "A. A. Brown", "title": "A note on heterogeneous beliefs with CRRA utilities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This note will extend the research presented in Brown & Rogers (2009) to the\ncase of CRRA agents. We consider the model outlined in that paper in which\nagents had diverse beliefs about the dividends produced by a risky asset. We\nnow assume that the agents all have CRRA utility, with some integer coefficient\nof relative risk aversion. This is a generalisation of Brown & Rogers which\nconsidered logarithmic agents. We derive expressions for the state price\ndensity, riskless rate, stock price and wealths of the agents. This sheds light\non the effects of risk aversion in an equilibrium with diverse beliefs.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jul 2009 17:20:08 GMT"}], "update_date": "2009-07-29", "authors_parsed": [["Brown", "A. A.", ""]]}]