[{"id": "1006.0310", "submitter": "Filippo Santambrogio", "authors": "Aim\\'e Lachapelle (CEREMADE), Filippo Santambrogio (CEREMADE)", "title": "On the strategic use of risk and undesirable goods in multidimensional\n  screening", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A monopolist sells goods with possibly a characteristic consumers dislike\n(for instance, he sells random goods to risk averse agents), which does not\naffect the production costs. We investigate the question whether using\nundesirable goods is profitable to the seller. We prove that in general this\nmay be the case, depending on the correlation between agents types and\naversion. This is due to screening effects that outperform this aversion. We\nanalyze, in a continuous framework, both 1D and multidimensional cases.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jun 2010 06:56:16 GMT"}], "update_date": "2010-06-03", "authors_parsed": [["Lachapelle", "Aimé", "", "CEREMADE"], ["Santambrogio", "Filippo", "", "CEREMADE"]]}, {"id": "1006.2010", "submitter": "Damien Challet", "authors": "David Br\\'ee, Damien Challet, and Pier Paolo Peirano", "title": "Prediction accuracy and sloppiness of log-periodic functions", "comments": "6 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that log-periodic power-law (LPPL) functions are intrinsically very\nhard to fit to time series. This comes from their sloppiness, the squared\nresiduals depending very much on some combinations of parameters and very\nlittle on other ones. The time of singularity that is supposed to give an\nestimate of the day of the crash belongs to the latter category. We discuss in\ndetail why and how the fitting procedure must take into account the sloppy\nnature of this kind of model. We then test the reliability of LPPLs on\nsynthetic AR(1) data replicating the Hang Seng 1987 crash and show that even\nthis case is borderline regarding predictability of divergence time. We finally\nargue that current methods used to estimate a probabilistic time window for the\ndivergence time are likely to be over-optimistic.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jun 2010 11:49:30 GMT"}], "update_date": "2010-06-14", "authors_parsed": [["Brée", "David", ""], ["Challet", "Damien", ""], ["Peirano", "Pier Paolo", ""]]}, {"id": "1006.2057", "submitter": "Juan C. Ferrero", "authors": "Juan C. Ferrero", "title": "The individual income distribution in Argentina in the period 2000-2009.\n  A unique source of non stationary data", "comments": "5 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.data-an q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The economic crisis in Argentina around year 2002 provides a unique\nopportunity for Econophysics studies. The available data on individual income\nare analyzed to show that they correspond to non stationary states. However,\nthe rather restricted size of the data survey imposes difficulties that must be\novercome through a careful analysis, for a reliable use. A new method of data\ntreatment is presented that could be helpful in theoretical studies.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jun 2010 15:18:18 GMT"}], "update_date": "2010-06-14", "authors_parsed": [["Ferrero", "Juan C.", ""]]}, {"id": "1006.3521", "submitter": "Alberto Russo", "authors": "Domenico Delli Gatti, Mauro Gallegati, Bruce Greenwald, Alberto Russo,\n  Joseph E. Stiglitz", "title": "Business fluctuations in a credit-network economy", "comments": null, "journal-ref": "Physica A: Statistical Mechanics and its Applications, Vol: 370,\n  Issue: 1, 1 October 2006, pp: 68-74", "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We model a network economy with three sectors: downstream firms, upstream\nfirms, and banks. Agents are linked by productive and credit relationships so\nthat the behavior of one agent influences the behavior of the others through\nnetwork connections. Credit interlinkages among agents are a source of\nbankruptcy diffusion: in fact, failure of fulfilling debt commitments would\nlead to bankruptcy chains. All in all, the bankruptcy in one sector can diffuse\nto other sectors through linkages creating a vicious cycle and bankruptcy\navalanches in the network economy. Our analysis show how the choices of credit\nsupply by both banks and firms are interrelated. While the initial impact of\nmonetary policy is on bank behaviour, we show the interactive play between the\nchoices made by banks, the choices made by firms in their role as providers of\ncredit, and the choices made by firms in their role as producers.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2010 17:05:53 GMT"}], "update_date": "2010-06-18", "authors_parsed": [["Gatti", "Domenico Delli", ""], ["Gallegati", "Mauro", ""], ["Greenwald", "Bruce", ""], ["Russo", "Alberto", ""], ["Stiglitz", "Joseph E.", ""]]}, {"id": "1006.3708", "submitter": "Els Heinsalu", "authors": "M. Patriarca, E. Heinsalu, R. Kitt, J. Kalda", "title": "Econophysics studies in Estonia", "comments": "Submitted to the special issue on \"Econophysics\" of the journal\n  Science & Culture (http://www.scienceandculture-isna.org/journal.htm), a\n  publication of the Indian Science News Association, established in 1935", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A short review of the econophysics research done in Estonia, devoted to the\n15th anniversary of the term \"econophysics\".\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2010 14:37:07 GMT"}], "update_date": "2010-06-21", "authors_parsed": [["Patriarca", "M.", ""], ["Heinsalu", "E.", ""], ["Kitt", "R.", ""], ["Kalda", "J.", ""]]}, {"id": "1006.3923", "submitter": "Diego Garlaschelli", "authors": "Diego Garlaschelli, Franco Ruzzenenti, Riccardo Basosi", "title": "Complex Networks and Symmetry I: A Review", "comments": "Final accepted version", "journal-ref": "Symmetry 2, no. 3, pp. 1683-1709 (2010)", "doi": "10.3390/sym2031683", "report-no": null, "categories": "q-fin.GN cond-mat.stat-mech math-ph math.MP nlin.AO physics.soc-ph", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this review we establish various connections between complex networks and\nsymmetry. While special types of symmetries (e.g., automorphisms) are studied\nin detail within discrete mathematics for particular classes of deterministic\ngraphs, the analysis of more general symmetries in real complex networks is far\nless developed. We argue that real networks, as any entity characterized by\nimperfections or errors, necessarily require a stochastic notion of invariance.\nWe therefore propose a definition of stochastic symmetry based on graph\nensembles and use it to review the main results of network theory from an\nunusual perspective. The results discussed here and in a companion paper show\nthat stochastic symmetry highlights the most informative topological properties\nof real networks, even in noisy situations unaccessible to exact techniques.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jun 2010 09:49:33 GMT"}, {"version": "v2", "created": "Wed, 22 Sep 2010 21:57:48 GMT"}], "update_date": "2010-11-04", "authors_parsed": [["Garlaschelli", "Diego", ""], ["Ruzzenenti", "Franco", ""], ["Basosi", "Riccardo", ""]]}, {"id": "1006.3956", "submitter": "Sonia Bentes", "authors": "Sonia R. Bentes", "title": "Econophysics: A new discipline", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper debates the contribution of Econophysics to the economic or\nfinancial domains. Since the traditional approach performed by Economics or\nFinance has revealed to be insufficient in fully characterizing and explaining\nthe correspondingly phenomena, we discuss whether Econophysics can provide a\nnew insight onto these matters. Thus, an assessment is presented in order to\nweight its potential opportunities and limitations. This is particularly\nrelevant as it is widely recognized that during its yet short existence\nEconophysics has experienced a growing interest not only by physicists but also\nby economists in searching for new approaches that could help explaining\nexisting questions. In fact, many papers have been submitted, some books have\nbeen released, new journals have been published, several conferences have been\nheld, a site is maintained -- http://www.unifr.ch/econophysics where news,\nevents, book reviews, papers and a blog are exhibited; a 3-year licentiate\nstudies (University of Silesia [1]) and a B.Sc. course (University of Wroclaw\n[2]) have been created and also some Ph.D. thesis have been written. Therefore,\na fundamental question arises: Is this just a fad or is it something much more\nconsistent that will prevail? This is what this paper addresses.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jun 2010 21:04:38 GMT"}], "update_date": "2010-06-28", "authors_parsed": [["Bentes", "Sonia R.", ""]]}, {"id": "1006.4382", "submitter": "Venkat Venkatasubramanian", "authors": "Venkat Venkatasubramanian", "title": "Fairness Is an Emergent Self-Organized Property of the Free Market for\n  Labor", "comments": null, "journal-ref": "Entropy 2010, 12(6), 1514-1531", "doi": "10.3390/e12061514", "report-no": null, "categories": "q-fin.GN cond-mat.stat-mech q-fin.ST", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The excessive compensation packages of CEOs of U.S. corporations in recent\nyears have brought to the foreground the issue of fairness in economics. The\nconventional wisdom is that the free market for labor, which determines the pay\npackages, cares only about efficiency and not fairness. We present an\nalternative theory that shows that an ideal free market environment also\npromotes fairness, as an emergent property resulting from the self-organizing\nmarket dynamics. Even though an individual employee may care only about his or\nher salary and no one else's, the collective actions of all the employees,\ncombined with the profit maximizing actions of all the companies, in a free\nmarket environment under budgetary constraints, lead towards a more fair\nallocation of wages, guided by Adam Smith's invisible hand of\nself-organization. By exploring deep connections with statistical\nthermodynamics, we show that entropy is the appropriate measure of fairness in\na free market environment which is maximized at equilibrium to yield the\nlognormal distribution of salaries as the fairest inequality of pay in an\norganization under ideal conditions.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jun 2010 21:36:20 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Venkatasubramanian", "Venkat", ""]]}, {"id": "1006.4595", "submitter": "Sidney Redner", "authors": "P. L. Krapivsky and S. Redner", "title": "Wealth Distributions in Asset Exchange Models", "comments": "5 pages, 2 figures, revtex4 2-column format. To appear in\n  \"Econophysics\", a special issue in Science and Culture (Kolkata, India) to\n  celebrate 15 years of Econophysics. Trivial typos fixed for the final version", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How do individuals accumulate wealth as they interact economically? We\noutline the consequences of a simple microscopic model in which repeated\npairwise exchanges of assets between individuals build the wealth distribution\nof a population. This distribution is determined for generic exchange rules ---\ntransactions that involve a fixed amount or a fixed fraction of individual\nwealth, as well as random or greedy exchanges. In greedy multiplicative\nexchange, a continuously evolving power law wealth distribution arises, a\nfeature that qualitatively mimics empirical observations.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 17:25:25 GMT"}, {"version": "v2", "created": "Sun, 29 Aug 2010 17:27:00 GMT"}], "update_date": "2010-08-31", "authors_parsed": [["Krapivsky", "P. L.", ""], ["Redner", "S.", ""]]}, {"id": "1006.5587", "submitter": "Hideaki Aoyama", "authors": "Hideaki Aoyama, Yoshi Fujiwara, Yuichi Ikeda, Hiroshi Iyetomi, and\n  Wataru Souma", "title": "Econophysics on Real Economy -The First Decade of the Kyoto Econophysics\n  Group-", "comments": "6 pages in Phys.Rev. format. Minor typographical errors are corrected\n  in v3", "journal-ref": null, "doi": null, "report-no": "KUNS-2275", "categories": "q-fin.GN physics.hist-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Research activities of Kyoto Econophysics Group is reviewed. Strong emphasis\nhas been placed on real economy. While the initial stage of research was a\nfirst high-definition data analysis on personal income, it soon progressed to\nfirm dynamics, growth rate distribution and establishment of Pareto's law and\nGibrat's law. It then led to analysis and simulation of firm dynamics on\neconomic network. Currently it covers a wide rage of dynamics of firms and\nfinancial institutions on complex network, using Japanese large-scale network\ndata, some of which are not available in other countries. Activities of this\ngroup for publicising and promoting understanding of econophysics is also\nreviewed.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2010 12:18:55 GMT"}, {"version": "v2", "created": "Wed, 30 Jun 2010 03:58:59 GMT"}, {"version": "v3", "created": "Fri, 2 Jul 2010 02:53:21 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Aoyama", "Hideaki", ""], ["Fujiwara", "Yoshi", ""], ["Ikeda", "Yuichi", ""], ["Iyetomi", "Hiroshi", ""], ["Souma", "Wataru", ""]]}]