[{"id": "1012.0349", "submitter": "Martin Gould", "authors": "Martin D. Gould and Mason A. Porter and Stacy Williams and Mark\n  McDonald and Daniel J. Fenn and Sam D. Howison", "title": "Limit Order Books", "comments": "42 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR physics.data-an q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Limit order books (LOBs) match buyers and sellers in more than half of the\nworld's financial markets. This survey highlights the insights that have\nemerged from the wealth of empirical and theoretical studies of LOBs. We\nexamine the findings reported by statistical analyses of historical LOB data\nand discuss how several LOB models provide insight into certain aspects of the\nmechanism. We also illustrate that many such models poorly resemble real LOBs\nand that several well-established empirical facts have yet to be reproduced\nsatisfactorily. Finally, we identify several key unresolved questions about\nLOBs.\n", "versions": [{"version": "v1", "created": "Wed, 1 Dec 2010 23:25:03 GMT"}, {"version": "v2", "created": "Thu, 17 Nov 2011 23:14:34 GMT"}, {"version": "v3", "created": "Fri, 27 Apr 2012 20:22:31 GMT"}, {"version": "v4", "created": "Mon, 1 Apr 2013 13:17:55 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Gould", "Martin D.", ""], ["Porter", "Mason A.", ""], ["Williams", "Stacy", ""], ["McDonald", "Mark", ""], ["Fenn", "Daniel J.", ""], ["Howison", "Sam D.", ""]]}, {"id": "1012.1188", "submitter": "Christian Hilbe", "authors": "Christian Hilbe", "title": "Equilibrium notions and framing effects", "comments": "15 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Experimental economics has repeatedly demonstrated that the Nash equilibrium\nmakes inaccurate predictions for a vast set of games. Instead, several\nalternative theoretical concepts predict behavior that is much more in tune\nwith observed data, with the quantal response equilibrium as the most prominent\nexample. However, here we show that this equilibrium notion itself, like any\nother concept that varies smoothly with the payoffs, is necessarily subject to\nframing effects: If the same economic problem is represented in a different but\nequivalent way, the predicted results will differ. As a consequence, we argue\nthat tools and methods that are successful in explaining human behavior in\nlaboratory experiments may be unsuitable for doing theory.\n", "versions": [{"version": "v1", "created": "Fri, 3 Dec 2010 15:56:30 GMT"}, {"version": "v2", "created": "Mon, 10 Oct 2011 10:34:20 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Hilbe", "Christian", ""]]}, {"id": "1012.2279", "submitter": "Jiang Zhang", "authors": "Jiang Zhang and You-Gui Wang", "title": "Size-Dependency of Income Distributions and Its Implications", "comments": "4 figures, 4 pages", "journal-ref": "Chinese Physics Letters, 2011,28(2):038901", "doi": "10.1088/0256-307X/28/3/038901", "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper highlights the size-dependency of income distributions, i.e. the\nincome distribution curves versus the population of a country systematically.\nBy using the generalized Lotka-Volterra model to fit the empirical income data\nin the United States during 1996-2007, we found an important parameter\n$\\lambda$ can scale with a $\\beta$ power of the size (population) of U.S. in\nthat year. We pointed out that the size-dependency of the income distributions,\nwhich is a very important property but seldom addressed by previous studies,\nhas two non-trivial implications: (1) the allometric growth pattern, i.e. the\npower law relationship between population and GDP in different years, which can\nbe mathematically derived from the size-dependent income distributions and also\nsupported by the empirical data; (2) the connection with the anomalous scaling\nfor the probability density function in critical phenomena since the re-scaled\nform of the income distributions has the exactly same mathematical expression\nfor the limit distribution of the sum of many correlated random variables\nasymptotically.\n", "versions": [{"version": "v1", "created": "Thu, 9 Dec 2010 09:07:36 GMT"}, {"version": "v2", "created": "Tue, 18 Jan 2011 08:50:25 GMT"}, {"version": "v3", "created": "Tue, 25 Jan 2011 08:24:59 GMT"}], "update_date": "2011-04-06", "authors_parsed": [["Zhang", "Jiang", ""], ["Wang", "You-Gui", ""]]}, {"id": "1012.4118", "submitter": "Sergey Tsirel V.", "authors": "Sergey V. Tsirel, Askar Akaev, Alexey Fomin, Andrey V. Korotayev", "title": "Log-Periodic Oscillation Analysis and Possible Burst of the \"Gold\n  Bubble\" in April - June 2011", "comments": "15 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This working paper analyzes the gold price dynamics on the basis of\nmethodology developed by Didier Sornette. Our calculations indicate that this\ndynamics is close to the one of the \"bubbles\" studied by Sornette and that the\nmost probable timing of the \"burst of the gold bubble\" is April - June 2011.\nThe obtained result has been additionally checked with two different methods.\nFirst of all, we have compared the pattern of changes of the forecasted timing\nof the gold bubble crash with the retrospective changes of forecasts of the oil\nbubble crash (that took place in July 2008). This comparison indicates that the\nperiod when the timing of the crash tended to change is close to the end, and\nthe burst of the gold bubble is the most probable in May or June 2011.\nSecondly, we used the estimates of critical time for the hyperbolic trend (that\nhas been shown in our previous publications to be typical for many\nsocioeconomic processes). Our calculations with this method also indicate May -\nJune 2011 as the most probable time of the burst of the gold bubble. Naturally,\nthis forecast should not be regarded as an exact prediction as this implies the\nstability of the finance policies of the USA, European Union, and China,\nwhereas a significant intervention of giant players (like the Federal Reserve\nSystem, or the Central Bank of China) could affect the course of the exchange\ngame in a rather significant way. We also analyze possible consequences of the\nburst of the \"gold bubble\".\n", "versions": [{"version": "v1", "created": "Sat, 18 Dec 2010 20:33:56 GMT"}], "update_date": "2010-12-21", "authors_parsed": [["Tsirel", "Sergey V.", ""], ["Akaev", "Askar", ""], ["Fomin", "Alexey", ""], ["Korotayev", "Andrey V.", ""]]}, {"id": "1012.4291", "submitter": "Kees Middelburg", "authors": "J. A. Bergstra and C. A. Middelburg", "title": "Preliminaries to an investigation of reduced product set finance", "comments": "32 pages", "journal-ref": "JKAU: Islamic Economics, 24(1):175-210, 2011", "doi": "10.4197/Islec.24-1.7", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Principles of financial product synthesis from a few basic financial products\nconstitute an interesting research topic inspired by Islamic finance. We make\nan effort to answer general questions that should be answered before starting\nto investigate the main issues concerning this topic with the formalization of\nfinancial products and principles of financial product synthesis. We also\noutline the outcome of some preparatory explorations, which have been conducted\nwith the purpose to form a reasonable preliminary picture of the details of\nfinancial products that are relevant to the study of the principles of\nfinancial product synthesis.\n", "versions": [{"version": "v1", "created": "Mon, 20 Dec 2010 11:28:01 GMT"}], "update_date": "2012-03-19", "authors_parsed": [["Bergstra", "J. A.", ""], ["Middelburg", "C. A.", ""]]}, {"id": "1012.4446", "submitter": "Stefano Balietti", "authors": "Dirk Helbing and Stefano Balietti", "title": "Fundamental and Real-World Challenges in Economics", "comments": "16 pages", "journal-ref": "Science and Culture, Vol.76, No. 9-10 September-October 2010,\n  Special Issue on 15 Years of Econophysics Research", "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the same way as the Hilbert Program was a response to the foundational\ncrisis of mathematics, this article tries to formulate a research program for\nthe socio-economic sciences. The aim of this contribution is to stimulate\nresearch in order to close serious knowledge gaps in mainstream economics that\nthe recent financial and economic crisis has revealed. By identifying weak\npoints of conventional approaches in economics, we identify the scientific\nproblems which need to be addressed. We expect that solving these questions\nwill bring scientists in a position to give better decision support and policy\nadvice. We also indicate, what kinds of insights can be contributed by\nscientists from other research fields such as physics, biology, computer and\nsocial science. In order to make a quick progress and gain a systemic\nunderstanding of the whole interconnected socio-economic-environmental system,\nusing the data, information and computer systems available today and in the\nnear future, we suggest a multi-disciplinary collaboration as most promising\nresearch approach.\n", "versions": [{"version": "v1", "created": "Mon, 20 Dec 2010 19:27:01 GMT"}], "update_date": "2010-12-21", "authors_parsed": [["Helbing", "Dirk", ""], ["Balietti", "Stefano", ""]]}, {"id": "1012.5832", "submitter": "William Morrow", "authors": "W. Ross Morrow and Steven J. Skerlos", "title": "On the Existence of Bertrand-Nash Equilibrium Prices Under Logit Demand", "comments": "39 Pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cs.GT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This article presents a proof of the existence of Bertrand-Nash equilibrium\nprices with multi-product firms and under the Logit model of demand that does\nnot rely on restrictive assumptions on product characteristics, firm\nhomogeneity or symmetry, product costs, or linearity of the utility function.\nThe proof is based on conditions for the indirect utility function, fixed-point\nequations derived from the first-order conditions, and a direct analysis of the\nsecond-order conditions resulting in the uniqueness of profit-maximizing\nprices. Several subsequent results also demonstrate that price equilibrium\nunder the Logit model of demand cannot adequately describe multi-product\npricing.\n", "versions": [{"version": "v1", "created": "Tue, 28 Dec 2010 20:22:42 GMT"}, {"version": "v2", "created": "Thu, 12 Jan 2012 15:11:33 GMT"}], "update_date": "2012-02-14", "authors_parsed": [["Morrow", "W. Ross", ""], ["Skerlos", "Steven J.", ""]]}, {"id": "1012.5896", "submitter": "Abhijit  Kargupta Dr.", "authors": "Abhijit Kar Gupta", "title": "Punctuated Equilibrium and Power Law in Economic Dynamics", "comments": "7 pages, 3 figs", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An interesting toy model has recently been proposed on Schumpeterian economic\ndynamics by Thurner {\\it et al.} following the idea of economist Joseph\nSchumpeter. Punctuated equilibrium dynamics is shown to emerge from this model\nand some detail analyses of the time series indicate SOC kind of behaviours.\nThe focus in the present work is to toss the idea whether the dynamics can\nreally be like a self organized critical (SOC) type. This study indicates that\nit is necessary to incorporate the concepts of 'fitness' and 'selection' in\nsuch a model in the line of the biological evolutionary model by Bak and\nSneppen in order to obtain power law and thus SOC behaviour.\n", "versions": [{"version": "v1", "created": "Wed, 29 Dec 2010 09:44:18 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Gupta", "Abhijit Kar", ""]]}, {"id": "1012.5932", "submitter": "Juan C. Ferrero", "authors": "Juan C. Ferrero", "title": "An statistical analysis of stratification and inequity in the income\n  distribution", "comments": "22 pages, 3 figures", "journal-ref": "The European Physical Journal B, Volume 80, Issue 2, 2011,\n  pp.255-261", "doi": "10.1140/epjb/e2011-11018-2", "report-no": null, "categories": "q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The analysis of the USA 2001 income distribution shows that it can be\ndescribed by at least two main components, which obey the generalized Tsallis\nstatistics with different values of the q parameter. Theoretical calculations\nusing the gas kinetics model with a distributed saving propensity factor and\ntwo ensembles reproduce the empirical data and provide further information on\nthe structure of the distribution, which shows a clear stratification. This\nstratification is amenable to different interpretations, which are analyzed.\nThe distribution function is invariant with the average individual income,\nwhich implies that the inequity of the distribution cannot be modified by\nincreasing the total income.\n", "versions": [{"version": "v1", "created": "Wed, 29 Dec 2010 12:55:22 GMT"}], "update_date": "2011-05-18", "authors_parsed": [["Ferrero", "Juan C.", ""]]}]