[{"id": "1103.1006", "submitter": "Alexander Alvarez", "authors": "Alexander Alvarez, Sebastian Ferrando and Pablo Olivares (Ryerson\n  University, Toronto)", "title": "Arbitrage and Hedging in a non probabilistic framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper studies the concepts of hedging and arbitrage in a non\nprobabilistic framework. It provides conditions for non probabilistic arbitrage\nbased on the topological structure of the trajectory space and makes\nconnections with the usual notion of arbitrage. Several examples illustrate the\nnon probabilistic arbitrage as well perfect replication of options under\ncontinuous and discontinuous trajectories, the results can then be applied in\nprobabilistic models path by path. The approach is related to recent financial\nmodels that go beyond semimartingales, we remark on some of these connections\nand provide applications of our results to some of these models.\n", "versions": [{"version": "v1", "created": "Sat, 5 Mar 2011 05:18:19 GMT"}], "update_date": "2011-03-08", "authors_parsed": [["Alvarez", "Alexander", "", "Ryerson\n  University, Toronto"], ["Ferrando", "Sebastian", "", "Ryerson\n  University, Toronto"], ["Olivares", "Pablo", "", "Ryerson\n  University, Toronto"]]}, {"id": "1103.1243", "submitter": "Diego Garlaschelli", "authors": "Tiziano Squartini, Giorgio Fagiolo, Diego Garlaschelli", "title": "Randomizing world trade. I. A binary network analysis", "comments": "See also the companion paper (part II): arXiv:1103.1249\n  [physics.soc-ph], published as Phys. Rev. E 84, 046118 (2011)", "journal-ref": "Phys. Rev. E 84, 046117 (2011)", "doi": "10.1103/PhysRevE.84.046117", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.SI physics.data-an q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The international trade network (ITN) has received renewed multidisciplinary\ninterest due to recent advances in network theory. However, it is still unclear\nwhether a network approach conveys additional, nontrivial information with\nrespect to traditional international-economics analyses that describe world\ntrade only in terms of local (first-order) properties. In this and in a\ncompanion paper, we employ a recently proposed randomization method to assess\nin detail the role that local properties have in shaping higher-order patterns\nof the ITN in all its possible representations (binary/weighted,\ndirected/undirected, aggregated/disaggregated by commodity) and across several\nyears. Here we show that, remarkably, the properties of all binary projections\nof the network can be completely traced back to the degree sequence, which is\ntherefore maximally informative. Our results imply that explaining the observed\ndegree sequence of the ITN, which has not received particular attention in\neconomic theory, should instead become one the main focuses of models of trade.\n", "versions": [{"version": "v1", "created": "Mon, 7 Mar 2011 11:15:50 GMT"}, {"version": "v2", "created": "Tue, 8 Mar 2011 15:24:20 GMT"}, {"version": "v3", "created": "Wed, 2 Nov 2011 09:41:42 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Squartini", "Tiziano", ""], ["Fagiolo", "Giorgio", ""], ["Garlaschelli", "Diego", ""]]}, {"id": "1103.1249", "submitter": "Diego Garlaschelli", "authors": "Tiziano Squartini, Giorgio Fagiolo, Diego Garlaschelli", "title": "Randomizing world trade. II. A weighted network analysis", "comments": "See also the companion paper (Part I): arXiv:1103.1243\n  [physics.soc-ph], published as Phys. Rev. E 84, 046117 (2011)", "journal-ref": "Phys. Rev. E 84, 046118 (2011)", "doi": "10.1103/PhysRevE.84.046118", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.SI physics.data-an q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on the misleading expectation that weighted network properties always\noffer a more complete description than purely topological ones, current\neconomic models of the International Trade Network (ITN) generally aim at\nexplaining local weighted properties, not local binary ones. Here we complement\nour analysis of the binary projections of the ITN by considering its weighted\nrepresentations. We show that, unlike the binary case, all possible weighted\nrepresentations of the ITN (directed/undirected, aggregated/disaggregated)\ncannot be traced back to local country-specific properties, which are therefore\nof limited informativeness. Our two papers show that traditional macroeconomic\napproaches systematically fail to capture the key properties of the ITN. In the\nbinary case, they do not focus on the degree sequence and hence cannot\ncharacterize or replicate higher-order properties. In the weighted case, they\ngenerally focus on the strength sequence, but the knowledge of the latter is\nnot enough in order to understand or reproduce indirect effects.\n", "versions": [{"version": "v1", "created": "Mon, 7 Mar 2011 11:22:35 GMT"}, {"version": "v2", "created": "Tue, 8 Mar 2011 15:28:16 GMT"}, {"version": "v3", "created": "Wed, 2 Nov 2011 09:39:24 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Squartini", "Tiziano", ""], ["Fagiolo", "Giorgio", ""], ["Garlaschelli", "Diego", ""]]}, {"id": "1103.1652", "submitter": "Shaolin Ji", "authors": "Larry Epstein and Shaolin Ji", "title": "Ambiguous Volatility, Possibility and Utility in Continuous Time", "comments": "39 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper formulates a model of utility for a continuous time framework that\ncaptures the decision-maker's concern with ambiguity about both the drift and\nvolatility of the driving process. At a technical level, the analysis requires\na significant departure from existing continuous time modeling because it\ncannot be done within a probability space framework. This is because ambiguity\nabout volatility leads invariably to a set of nonequivalent priors, that is, to\npriors that disagree about which scenarios are possible.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2011 21:54:28 GMT"}, {"version": "v2", "created": "Thu, 24 Mar 2011 22:32:46 GMT"}, {"version": "v3", "created": "Mon, 28 Mar 2011 21:24:27 GMT"}, {"version": "v4", "created": "Thu, 11 Aug 2011 06:46:27 GMT"}, {"version": "v5", "created": "Thu, 19 Jan 2012 22:59:16 GMT"}, {"version": "v6", "created": "Mon, 14 May 2012 21:37:46 GMT"}, {"version": "v7", "created": "Sun, 20 Jan 2013 00:17:48 GMT"}], "update_date": "2013-01-22", "authors_parsed": [["Epstein", "Larry", ""], ["Ji", "Shaolin", ""]]}, {"id": "1103.1992", "submitter": "Leonidas Sandoval", "authors": "Leonidas Sandoval Junior and Italo De Paula Franca", "title": "Shocks in financial markets, price expectation, and damped harmonic\n  oscillators", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using a modified damped harmonic oscillator model equivalent to a model of\nmarket dynamics with price expectations, we analyze the reaction of financial\nmarkets to shocks. In order to do this, we gather data from indices of a\nvariety of financial markets for the 1987 Black Monday, the Russian crisis of\n1998, the crash after September 11th (2001), and the recent downturn of markets\ndue to the subprime mortgage crisis in the USA (2008). Analyzing those data we\nwere able to establish the amount by which each market felt the shocks, a\ndampening factor which expresses the capacity of a market of absorving a shock,\nand also a frequency related with volatility after the shock. The results gauge\nthe efficiency of different markets in recovering from such shocks, and measure\nsome level of dependence between them. We also show, using the correlation\nmatrices between the indices used, that financial markets are now much more\nconnected than they were two decades ago.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 11:09:40 GMT"}, {"version": "v2", "created": "Sat, 24 Sep 2011 15:00:34 GMT"}], "update_date": "2011-09-27", "authors_parsed": [["Junior", "Leonidas Sandoval", ""], ["Franca", "Italo De Paula", ""]]}, {"id": "1103.2001", "submitter": "Yu-Gang Ma", "authors": "D. D. Han, J. H. Qian, Y. G. Ma", "title": "Emergence of double scaling law in complex system", "comments": "6 pages, 6 figures, 2 tables", "journal-ref": "Europhys.Lett.94:28006,2011", "doi": "10.1209/0295-5075/94/28006", "report-no": null, "categories": "physics.soc-ph cond-mat.soft nucl-th q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a stochastic model to explain a double power-law distribution\nwhich exhibits two different Paretian behaviors in the upper and the lower tail\nand widely exists in social and economic systems. The model incorporates\nfitness consideration and noise fluctuation. We find that if the number of\nvariables (e.g. the degree of nodes in complex networks or people's incomes)\ngrows exponentially, normal distributed fitness coupled with exponentially\nincreasing variable is responsible for the emergence of the double power-law\ndistribution. Fluctuations do not change the result qualitatively but\ncontribute to the second-part scaling exponent. The evolution of Chinese\nairline network is taken as an example to show a nice agreement with our\nstochastic model.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 11:42:53 GMT"}], "update_date": "2011-04-25", "authors_parsed": [["Han", "D. D.", ""], ["Qian", "J. H.", ""], ["Ma", "Y. G.", ""]]}, {"id": "1103.3206", "submitter": "Dorje C. Brody Dr", "authors": "Grzegorz Andruszkiewicz and Dorje C. Brody", "title": "Noise, risk premium, and bubble", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The existence of the pricing kernel is shown to imply the existence of an\nambient information process that generates market filtration. This information\nprocess consists of a signal component concerning the value of the random\nvariable X that can be interpreted as the timing of future cash demand, and an\nindependent noise component. The conditional expectation of the signal, in\nparticular, determines the market risk premium vector. An addition to the\nsignal of any term that is independent of X, which generates a drift in the\nnoise, is shown to change the drifts of price processes in the physical\nmeasure, without affecting the current asset price levels. Such a drift in the\nnoise term can induce anomalous price dynamics, and can be seen to explain the\nmechanism of observed phenomena of equity premium and financial bubbles.\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2011 15:45:15 GMT"}], "update_date": "2011-03-17", "authors_parsed": [["Andruszkiewicz", "Grzegorz", ""], ["Brody", "Dorje C.", ""]]}, {"id": "1103.4943", "submitter": "Thomas Conlon", "authors": "Thomas Conlon, John Cotter", "title": "An Empirical Analysis of Dynamic Multiscale Hedging using Wavelet\n  Decomposition", "comments": "To Appear: Journal of Futures Markets", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.GN q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the hedging effectiveness of a dynamic moving window\nOLS hedging model, formed using wavelet decomposed time-series. The wavelet\ntransform is applied to calculate the appropriate dynamic minimum-variance\nhedge ratio for various hedging horizons for a number of assets. The\neffectiveness of the dynamic multiscale hedging strategy is then tested, both\nin- and out-of-sample, using standard variance reduction and expanded to\ninclude a downside risk metric, the time horizon dependent Value-at-Risk.\nMeasured using variance reduction, the effectiveness converges to one at longer\nscales, while a measure of VaR reduction indicates a portion of residual risk\nremains at all scales. Analysis of the hedge portfolio distributions indicate\nthat this unhedged tail risk is related to excess portfolio kurtosis found at\nall scales.\n", "versions": [{"version": "v1", "created": "Fri, 25 Mar 2011 10:49:21 GMT"}], "update_date": "2011-03-28", "authors_parsed": [["Conlon", "Thomas", ""], ["Cotter", "John", ""]]}, {"id": "1103.5027", "submitter": "Leonardo Ermann", "authors": "Leonardo Ermann, Dima L.Shepelyansky", "title": "Google matrix of the world trade network", "comments": "14 pages, 13 figures. More detailed data and high definition figures\n  are available on the website:\n  http://www.quantware.ups-tlse.fr/QWLIB/tradecheirank/index.html", "journal-ref": "Acta Physica Polonica A, vol. 120 (6A), A-158 (2011)", "doi": null, "report-no": null, "categories": "q-fin.GN cond-mat.stat-mech cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using the United Nations Commodity Trade Statistics Database\n[http://comtrade.un.org/db/] we construct the Google matrix of the world trade\nnetwork and analyze its properties for various trade commodities for all\ncountries and all available years from 1962 to 2009. The trade flows on this\nnetwork are classified with the help of PageRank and CheiRank algorithms\ndeveloped for the World Wide Web and other large scale directed networks. For\nthe world trade this ranking treats all countries on equal democratic grounds\nindependent of country richness. Still this method puts at the top a group of\nindustrially developed countries for trade in {\\it all commodities}. Our study\nestablishes the existence of two solid state like domains of rich and poor\ncountries which remain stable in time, while the majority of countries are\nshown to be in a gas like phase with strong rank fluctuations. A simple random\nmatrix model provides a good description of statistical distribution of\ncountries in two-dimensional rank plane. The comparison with usual ranking by\nexport and import highlights new features and possibilities of our approach.\n", "versions": [{"version": "v1", "created": "Fri, 25 Mar 2011 16:42:22 GMT"}], "update_date": "2012-02-14", "authors_parsed": [["Ermann", "Leonardo", ""], ["Shepelyansky", "Dima L.", ""]]}, {"id": "1103.5672", "submitter": "John Cotter", "authors": "Kevin Dowd, John Cotter, Chris Humphrey and Margaret Woods", "title": "How Unlucky is 25-Sigma?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the more memorable moments of last summer's credit crunch came when\nthe CFO of Goldman Sachs, David Viniar, announced in August that Goldman's\nflagship GEO hedge fund had lost 27% of its value since the start of the year.\nAs Mr. Viniar explained, \"We were seeing things that were 25-standard deviation\nmoves, several days in a row.\"\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 14:59:44 GMT"}], "update_date": "2011-03-30", "authors_parsed": [["Dowd", "Kevin", ""], ["Cotter", "John", ""], ["Humphrey", "Chris", ""], ["Woods", "Margaret", ""]]}, {"id": "1103.5703", "submitter": "Ricardo Lopez-Ruiz", "authors": "Jose-Luis Lopez, Ricardo Lopez-Ruiz and Xavier Calbet", "title": "Exponential wealth distribution in a random market. A rigorous\n  explanation", "comments": "9 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cs.MA nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In simulations of some economic gas-like models, the asymptotic regime shows\nan exponential wealth distribution, independently of the initial wealth\ndistribution given to the system. The appearance of this statistical\nequilibrium for this type of gas-like models is explained in a rigorous\nanalytical way.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 16:29:42 GMT"}, {"version": "v2", "created": "Fri, 6 May 2011 16:46:45 GMT"}, {"version": "v3", "created": "Fri, 20 May 2011 15:17:57 GMT"}], "update_date": "2011-05-23", "authors_parsed": [["Lopez", "Jose-Luis", ""], ["Lopez-Ruiz", "Ricardo", ""], ["Calbet", "Xavier", ""]]}, {"id": "1103.5994", "submitter": "Ivan Kitov O.", "authors": "Oleg Kitov, Ivan Kitov", "title": "A win-win monetary policy in Canada", "comments": "25 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Lucas critique has exposed the problem of the trade-off between changes\nin monetary policy and structural breaks in economic time series. The search\nfor and characterisation of such breaks has been a major econometric task ever\nsince. We have developed an integral technique similar to CUSUM using an\nempirical model quantitatively linking the rate of inflation and unemployment\nto the change in the level of labour force in Canada. Inherently, our model\nbelongs to the class of Phillips curve models, and the link between the\ninvolved variables is a linear one with all coefficients of individual and\ngeneralized models obtained by empirical calibration. To achieve the best LSQ\nfit between measured and predicted time series cumulative curves are used as a\nsimplified version of the 1-D boundary elements (integral) method. The distance\nbetween the cumulative curves (in L2 metrics) is very sensitive to structural\nbreaks since it accumulates true differences and suppresses uncorrelated noise\nand systematic errors. Our previous model of inflation and unemployment in\nCanada is enhanced by the introduction of structural breaks and is validated by\nnew data in the past and future. The most exiting finding is that the\nintroduction of inflation targeting as a new monetary policy in 1991 resulted\nin a structural break manifested in a lowered rate of price inflation\naccompanied by a substantial fall in the rate of unemployment. Therefore, the\nnew monetary policy in Canada is a win-win one.\n", "versions": [{"version": "v1", "created": "Wed, 30 Mar 2011 17:10:46 GMT"}], "update_date": "2011-03-31", "authors_parsed": [["Kitov", "Oleg", ""], ["Kitov", "Ivan", ""]]}]