[{"id": "1107.0170", "submitter": "Saoussen Ben Gamra", "authors": "Saoussen Ben Gamra (CEPN), Dominique Plihon (CEPN)", "title": "Revenue diversification in emerging market banks: implications for\n  financial performance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Shaped by structural forces of change, banking in emerging markets has\nrecently experienced a decline in its traditional activities, leading banks to\ndiversify into new business strategies. This paper examines whether the\nobserved shift into non-interest based activities improves financial\nperformance. Using a sample of 714 banks across 14 East-Asian and\nLatin-American countries over the post 1997-crisis changing structure, we find\nthat diversification gains are more than offset by the cost of increased\nexposure to the non-interest income, specifically by the trading income\nvolatility. But this diversification performance's effect is found to be no\nlinear with risk, and significantly not uniform among banks and across business\nlines. An implication of these findings is that banking institutions can reap\ndiversification benefits as long as they well-studied it depending on their\nspecific characteristics, competences and risk levels, and as they choose the\nright niche.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jul 2011 09:41:17 GMT"}], "update_date": "2011-07-04", "authors_parsed": [["Gamra", "Saoussen Ben", "", "CEPN"], ["Plihon", "Dominique", "", "CEPN"]]}, {"id": "1107.0838", "submitter": "Wanfeng Yan", "authors": "Wanfeng Yan, Ryan Woodard, Didier Sornette", "title": "Role of Diversification Risk in Financial Bubbles", "comments": "22 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an extension of the Johansen-Ledoit-Sornette (JLS) model to\ninclude an additional pricing factor called the \"Zipf factor\", which describes\nthe diversification risk of the stock market portfolio. Keeping all the\ndynamical characteristics of a bubble described in the JLS model, the new model\nprovides additional information about the concentration of stock gains over\ntime. This allows us to understand better the risk diversification and to\nexplain the investors' behavior during the bubble generation. We apply this new\nmodel to two famous Chinese stock bubbles, from August 2006 to October 2007\n(bubble 1) and from October 2008 to August 2009 (bubble 2). The Zipf factor is\nfound highly significant for bubble 1, corresponding to the fact that valuation\ngains were more concentrated on the large firms of the Shanghai index. It is\nlikely that the widespread acknowledgement of the 80-20 rule in the Chinese\nmedia and discussion forums led many investors to discount the risk of a lack\nof diversification, therefore enhancing the role of the Zipf factor. For bubble\n2, the Zipf factor is found marginally relevant, suggesting a larger weight of\nmarket gains on small firms. We interpret this result as the consequence of the\nresponse of the Chinese economy to the very large stimulus provided by the\nChinese government in the aftermath of the 2008 financial crisis.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2011 10:15:56 GMT"}], "update_date": "2011-07-06", "authors_parsed": [["Yan", "Wanfeng", ""], ["Woodard", "Ryan", ""], ["Sornette", "Didier", ""]]}, {"id": "1107.1078", "submitter": "Frank Riedel", "authors": "Frank Riedel", "title": "Finance Without Probabilistic Prior Assumptions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop the fundamental theorem of asset pricing in a probability-free\ninfinite-dimensional setup. We replace the usual assumption of a prior\nprobability by a certain continuity property in the state variable.\nProbabilities enter then endogenously as full support martingale measures\n(instead of equivalent martingale measures). A variant of the\nHarrison-Kreps-Theorem on viability and no arbitrage is shown. Finally, we show\nhow to embed the superhedging problem in a classical infinite-dimensional\nlinear programming problem.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2011 09:51:27 GMT"}], "update_date": "2011-07-07", "authors_parsed": [["Riedel", "Frank", ""]]}, {"id": "1107.1607", "submitter": "Josef Teichmann", "authors": "Christa Cuchiero and Josef Teichmann", "title": "Path properties and regularity of affine processes on general state\n  spaces", "comments": "final version for publication in seminaire de probabilite", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a new proof for regularity of affine processes on general state\nspaces by methods from the theory of Markovian semimartingales. On the way to\nthis result we also show that the definition of an affine process, namely as\nstochastically continuous time-homogeneous Markov process with exponential\naffine Fourier-Laplace transform, already implies the existence of a c\\`adl\\`ag\nversion. This was one of the last open issues in the fundaments of affine\nprocesses.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jul 2011 11:15:35 GMT"}, {"version": "v2", "created": "Wed, 16 Jan 2013 06:51:29 GMT"}], "update_date": "2013-01-17", "authors_parsed": [["Cuchiero", "Christa", ""], ["Teichmann", "Josef", ""]]}, {"id": "1107.3095", "submitter": "Ingve Simonsen", "authors": "A. Johansen and I. Simonsen", "title": "Keynesian Economics After All", "comments": "Latex, 4 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is demonstrated that the US economy has on the long-term in reality been\ngoverned by the Keynesian approach to economics independent of the current\nofficial economical policy. This is done by calculating the two-point\ncorrelation function between the fluctuations of the DJIA and the US public\ndebt. We find that the origin of this condition is mainly related to the wars\nthat the USA has fought during the time period investigated. Wars mean a large\ninflux of public money into the economy, thus as a consequence creating a\nsignificant economical upturn in the DJIA. A reason for this straight-cut\nresult of our analysis, is that very few wars have been fought on US-territory\nand those that have, were in the 18th century, when the partial destruction of\ncities, factories, railways and so on, was more limited and with less effect on\nthe over-all economy.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jul 2011 15:57:33 GMT"}], "update_date": "2011-07-18", "authors_parsed": [["Johansen", "A.", ""], ["Simonsen", "I.", ""]]}, {"id": "1107.3171", "submitter": "Wanfeng Yan", "authors": "Didier Sornette, Ryan Woodard, Wanfeng Yan, Wei-Xing Zhou", "title": "Clarifications to Questions and Criticisms on the\n  Johansen-Ledoit-Sornette Bubble Model", "comments": "27 pages, 3 figures", "journal-ref": "Physica A 392 (19), 4417-4428 (2013)", "doi": "10.1016/j.physa.2013.05.011", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Johansen-Ledoit-Sornette (JLS) model of rational expectation bubbles with\nfinite-time singular crash hazard rates has been developed to describe the\ndynamics of financial bubbles and crashes. It has been applied successfully to\na large variety of financial bubbles in many different markets. Having been\ndeveloped for more than one decade, the JLS model has been studied, analyzed,\nused and criticized by several researchers. Much of this discussion is helpful\nfor advancing the research. However, several serious misconceptions seem to be\npresent within this collective conversation both on theoretical and empirical\naspects. Several of these problems appear to stem from the fast evolution of\nthe literature on the JLS model and related works. In the hope of removing\npossible misunderstanding and of catalyzing useful future developments, we\nsummarize these common questions and criticisms concerning the JLS model and\noffer a synthesis of the existing state-of-the-art and best-practice advices.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jul 2011 21:56:14 GMT"}, {"version": "v2", "created": "Mon, 18 Mar 2013 21:06:29 GMT"}, {"version": "v3", "created": "Mon, 10 Jun 2013 19:57:46 GMT"}], "update_date": "2013-09-09", "authors_parsed": [["Sornette", "Didier", ""], ["Woodard", "Ryan", ""], ["Yan", "Wanfeng", ""], ["Zhou", "Wei-Xing", ""]]}, {"id": "1107.3287", "submitter": "Dariusz Grech", "authors": "B. Bieda, P. Chodorowski, and D. Grech", "title": "On the Zipf strategy for short-term investments in WIG20 futures", "comments": "13 pages, 6 figures, 1 table, presented at the 5-th FENS symposium on\n  Physics in Economic and Social Systems, Warsaw 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply the Zipf power law to financial time series of WIG20 index daily\nchanges (open-close). Thanks to the mapping of time series signal into the\nsequence of 2k+1 'spin-like' states, where k=0, 1/2, 1, 3/2, ..., we are able\nto describe any time series increments, with almost arbitrary accuracy, as the\none of such 'spin-like' states. This procedure leads in the simplest\nnon-trivial case (k = 1/2) to the binary data projection. More sophisticated\nprojections are also possible and mentioned in the article. The introduced\nformalism allows then to use Zipf power law to describe the intrinsic structure\nof time series. The fast algorithm for this implementation was constructed by\nus within Matlab^{TM} software. The method, called Zipf strategy, is then\napplied in the simplest case k = 1/2 to WIG 20 open and close daily data to\nmake short-term predictions for forthcoming index changes. The results of\nforecast effectiveness are presented with respect to different time window\nsizes and partition divisions (word lengths in Zipf language). Finally, the\nvarious investment strategies improving ROI (return of investment) for WIG20\nfutures are proposed. We show that the Zipf strategy is the appropriate and\nvery effective tool to make short-term predictions and therefore, to evaluate\nshort-term investments on the basis of historical stock index data. Our\nfindings support also the existence of long memory in financial data, exceeding\nthe known in literature 3 days span limit.\n", "versions": [{"version": "v1", "created": "Sun, 17 Jul 2011 09:47:33 GMT"}], "update_date": "2011-07-19", "authors_parsed": [["Bieda", "B.", ""], ["Chodorowski", "P.", ""], ["Grech", "D.", ""]]}, {"id": "1107.3293", "submitter": "Francesco Mina", "authors": "Lane P. Hughston, Francesco Mina", "title": "On the Representation of General Interest Rate Models as Square\n  Integrable Wiener Functionals", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the setting proposed by Hughston & Rafailidis (2005) we consider general\ninterest rate models in the case of a Brownian market information filtration\n$(\\mathcal{F}_t)_{t\\geq0}$. Let $X$ be a square-integrable\n$\\mathcal{F}_\\infty$-measurable random variable, and assume the non-degeneracy\ncondition that for all $t<\\infty$ the random variable $X$ is not\n$\\mathcal{F}_t$-measurable. Let ${\\sigma_t}$ denote the integrand appearing in\nthe representation of $X$ as a stochastic integral, write $\\pi_t$ for the\nconditional variance of $X$ at time $t$, and set $r_t = \\sigma^2_t / \\pi_t$.\nThen $\\pi_t$ is a potential, and as such can act as a model for a pricing\nkernel (or state price density), where $r_t$ is the associated interest rate.\nUnder the stated assumptions, we prove the following: (a) that the money market\naccount process defined by $B_t = \\exp (\\int_0^t r_s \\,ds)$ is finite almost\nsurely at all finite times; and (b) that the product of the money-market\naccount and the pricing kernel is a local martingale, and is a martingale\nprovided a certain integrability condition is satisfied. The fact that a\nmartingale is thus obtained shows that from any non-degenerate element of\nWiener space satisfying the integrability condition we can construct an\nassociated interest-rate model. The model thereby constructed is valid over an\ninfinite time horizon, with strictly positive interest, and satisfies the\nrelevant intertemporal relations associated with the absence of arbitrage. The\nresults thus stated pave the way for the use of Wiener chaos methods in\ninterest rate modelling, since any such square-integrable Wiener functional\nadmits a chaos expansion, the individual terms of which can be regarded as\nparametric degrees of freedom in the associated interest rate model to be fixed\nby calibration to appropriately liquid sectors of the interest rate derivatives\nmarkets.\n", "versions": [{"version": "v1", "created": "Sun, 17 Jul 2011 12:08:19 GMT"}], "update_date": "2011-07-19", "authors_parsed": [["Hughston", "Lane P.", ""], ["Mina", "Francesco", ""]]}, {"id": "1107.4632", "submitter": "Stephan Sturm", "authors": "Ronnie Sircar and Stephan Sturm", "title": "From Smile Asymptotics to Market Risk Measures", "comments": "24 pages, 4 figures", "journal-ref": "Math. Finance 25:2, 400-425 (2015)", "doi": "10.1111/mafi.12015", "report-no": null, "categories": "q-fin.RM math.PR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The left tail of the implied volatility skew, coming from quotes on\nout-of-the-money put options, can be thought to reflect the market's assessment\nof the risk of a huge drop in stock prices. We analyze how this market\ninformation can be integrated into the theoretical framework of convex monetary\nmeasures of risk. In particular, we make use of indifference pricing by dynamic\nconvex risk measures, which are given as solutions of backward stochastic\ndifferential equations (BSDEs), to establish a link between these two\napproaches to risk measurement. We derive a characterization of the implied\nvolatility in terms of the solution of a nonlinear PDE and provide a small\ntime-to-maturity expansion and numerical solutions. This procedure allows to\nchoose convex risk measures in a conveniently parametrized class, distorted\nentropic dynamic risk measures, which we introduce here, such that the\nasymptotic volatility skew under indifference pricing can be matched with the\nmarket skew. We demonstrate this in a calibration exercise to market implied\nvolatility data.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2011 21:41:50 GMT"}, {"version": "v2", "created": "Sun, 12 Feb 2012 23:40:06 GMT"}, {"version": "v3", "created": "Mon, 16 Jul 2012 20:51:47 GMT"}], "update_date": "2016-08-16", "authors_parsed": [["Sircar", "Ronnie", ""], ["Sturm", "Stephan", ""]]}, {"id": "1107.5122", "submitter": "Jaehyung Choi", "authors": "Jaehyung Choi", "title": "Spontaneous symmetry breaking of arbitrage", "comments": "23 pages, 6 figures; Published version", "journal-ref": "Physica A: Statistical Mechanics and its Applications 391 (2012),\n  pp. 3206-3218", "doi": "10.1016/j.physa.2012.01.031", "report-no": null, "categories": "q-fin.GN cond-mat.stat-mech q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the concept of spontaneous symmetry breaking to arbitrage\nmodeling. In the model, the arbitrage strategy is considered as being in the\nsymmetry breaking phase and the phase transition between arbitrage mode and\nno-arbitrage mode is triggered by a control parameter. We estimate the control\nparameter for momentum strategy with real historical data. The momentum\nstrategy aided by symmetry breaking shows stronger performance and has a better\nrisk measure than the naive momentum strategy in U.S. and South Korean markets.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jul 2011 05:49:06 GMT"}, {"version": "v2", "created": "Sun, 23 Oct 2011 20:55:23 GMT"}, {"version": "v3", "created": "Wed, 18 Apr 2012 22:39:34 GMT"}], "update_date": "2012-04-20", "authors_parsed": [["Choi", "Jaehyung", ""]]}, {"id": "1107.5373", "submitter": "Jie-Jun Tseng", "authors": "Shu-Heng Chen and Sai-Ping Li", "title": "Econophysics: Bridges over a Turbulent Current", "comments": "50 pages, to be published in a forthcoming special issue of\n  International Review of Financial Analysis", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this editorial guide for the special issue on econophysics, we give a\nunique review of this young but quickly growing discipline. A suggestive\ntaxonomy of the development is proposed by making a distinction between\nclassical econophysics and modern econophysics. For each of these two stages of\ndevelopment, we identify the key economic issues whose formulations and/or\ntreatments have been affected by physics or physicists, which includes value,\nbusiness fluctuations, economic growth, economic and financial time series, the\ndistribution of economic entities, interactions of economic agents, and\neconomic and social networks. The recent advancements in these issues of modern\neconophysics are demonstrated by nine articles selected from the papers\npresented at the Econophysics Colloquium 2010 held at Academia Sinica in\nTaipei.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2011 03:12:31 GMT"}], "update_date": "2011-07-28", "authors_parsed": [["Chen", "Shu-Heng", ""], ["Li", "Sai-Ping", ""]]}, {"id": "1107.5420", "submitter": "Sergii Piskun Mr", "authors": "Oleksandr Piskun, Sergii Piskun", "title": "Recurrence Quantification Analysis of Financial Market Crashes and\n  Crises", "comments": "19 pages, 15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.CD q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial markets are systems with the complex behavior, that can be hardly\nanalyzed by means of linear methods. Recurrence Quantification Analysis (RQA)\nis a nonlinear methodology, which is able to work with the nonstationary and\nshort data series. Thus, we apply RQA for the studying of the critical events\non financial markets. For the present research, stock crashes of DJI 1929; DJI,\nNYSE and S&P500 1987; NASDAQ 2000; HSI 1994, 1997 and Spanish 1992, Portuguese\n1992, British 1992, German 1992, Italian 1992, Mexican 1994, Brazilian 1999,\nIndonesian 1997, Thai 1997, Malaysian 1997, Philippine 1997, Russian 1998,\nTurkish 2001, Argentine 2002 currency devaluations were taken. The recent world\nfinancial crisis of 2007-2010 was considered as well. The possibility of LAM\nmeasure to serve as a tool for the revealing, monitoring, analysing and\nprecursoring of financial bubbles, crises and crashes was asserted.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jul 2011 09:12:33 GMT"}], "update_date": "2011-07-28", "authors_parsed": [["Piskun", "Oleksandr", ""], ["Piskun", "Sergii", ""]]}, {"id": "1107.5728", "submitter": "James Glattfelder B", "authors": "Stefania Vitali, James B. Glattfelder and Stefano Battiston", "title": "The network of global corporate control", "comments": "Main Text (10 pages, 3 figures and 1 table) and Supporting\n  Information (26 pages, 7 figures and 4 tables), 2nd version (with minor\n  comments, typos removed, detailed acknowledgement, better referencing of\n  Supporting Information)", "journal-ref": "PLoS ONE 6(10), e25995 (2011)", "doi": "10.1371/journal.pone.0025995", "report-no": null, "categories": "q-fin.GN cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The structure of the control network of transnational corporations affects\nglobal market competition and financial stability. So far, only small national\nsamples were studied and there was no appropriate methodology to assess control\nglobally. We present the first investigation of the architecture of the\ninternational ownership network, along with the computation of the control held\nby each global player. We find that transnational corporations form a giant\nbow-tie structure and that a large portion of control flows to a small\ntightly-knit core of financial institutions. This core can be seen as an\neconomic \"super-entity\" that raises new important issues both for researchers\nand policy makers.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2011 14:57:51 GMT"}, {"version": "v2", "created": "Mon, 19 Sep 2011 14:36:01 GMT"}], "update_date": "2011-10-28", "authors_parsed": [["Vitali", "Stefania", ""], ["Glattfelder", "James B.", ""], ["Battiston", "Stefano", ""]]}]