[{"id": "1303.1663", "submitter": "Floarea Baicu", "authors": "Floarea Baicu, Maria Alexandra Baches", "title": "Impact Analysis for Risks in Informatics Systems", "comments": "12 pages, 3 figures, 5 refferences, ENEC 2008, ISSN 265-2550", "journal-ref": "F.BAICU, M.A.BACHES - Impact Analysis for Risks in Informatics\n  Systems, ENEC 2008, PP. 269-281", "doi": null, "report-no": null, "categories": "q-fin.GN cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper are presented methods of impact analysis on informatics system\nsecurity accidents, qualitative and quantitative methods, starting with risk\nand informational system security definitions. It is presented the relationship\nbetween the risks of exploiting vulnerabilities of security system, security\nlevel of these informatics systems, probability of exploiting the weak points\nsubject to financial losses of a company, respectively impact of a security\naccident on the company. Herewith are presented some examples concerning losses\ncaused by excesses within informational systems and depicted from the study\ncarried out by CSI.\n", "versions": [{"version": "v1", "created": "Thu, 7 Mar 2013 12:37:29 GMT"}], "update_date": "2013-03-08", "authors_parsed": [["Baicu", "Floarea", ""], ["Baches", "Maria Alexandra", ""]]}, {"id": "1303.2901", "submitter": "Peter Cauwels P.", "authors": "Nicola Pestalozzi, Peter Cauwels, and Didier Sornette", "title": "Dynamics and Spatial Distribution of Global Nighttime Lights", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using open source data, we observe the fascinating dynamics of nighttime\nlight. Following a global economic regime shift, the planetary center of light\ncan be seen moving eastwards at a pace of about 60 km per year. Introducing\nspatial light Gini coefficients, we find a universal pattern of human\nsettlements across different countries and see a global centralization of\nlight. Observing 160 different countries we document the expansion of\ndeveloping countries, the growth of new agglomerations, the regression in\ncountries suffering from demographic decline and the success of light pollution\nabatement programs in western countries.\n", "versions": [{"version": "v1", "created": "Tue, 12 Mar 2013 14:47:14 GMT"}], "update_date": "2013-03-13", "authors_parsed": [["Pestalozzi", "Nicola", ""], ["Cauwels", "Peter", ""], ["Sornette", "Didier", ""]]}, {"id": "1303.3693", "submitter": "Aleksejus Kononovicius", "authors": "Aleksejus Kononovicius, Valentas Daniunas", "title": "Agent-based and macroscopic modeling of the complex socio-economic\n  systems", "comments": "12 pages, 6 figures", "journal-ref": "Social Technologies 3 (1): 85-103 (2013)", "doi": "10.13165/ST-13-3-1-06", "report-no": null, "categories": "physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The current economic crisis has provoked an active response from the\ninterdisciplinary scientific community. As a result many papers suggesting what\ncan be improved in understanding of the complex socio-economics systems were\npublished. Some of the most prominent papers on the topic include (Bouchaud,\n2009; Farmer and Foley, 2009; Farmer et al, 2012; Helbing, 2010; Pietronero,\n2008). These papers share the idea that agent-based modeling is essential for\nthe better understanding of the complex socio-economic systems and consequently\nbetter policy making. Yet in order for an agent-based model to be useful it\nshould also be analytically tractable, possess a macroscopic treatment\n(Cristelli et al, 2012). In this work we shed a new light on our research\ngroup's contributions towards understanding of the correspondence between the\ninter-individual interactions and collective behavior. We also provide some new\ninsights into the implications of the global and local interactions, the\nleadership and the predator-prey interactions in the complex socio-economic\nsystems.\n", "versions": [{"version": "v1", "created": "Fri, 15 Mar 2013 07:19:53 GMT"}, {"version": "v2", "created": "Wed, 3 Apr 2013 06:38:58 GMT"}], "update_date": "2018-10-17", "authors_parsed": [["Kononovicius", "Aleksejus", ""], ["Daniunas", "Valentas", ""]]}, {"id": "1303.4514", "submitter": "Peter Cauwels P.", "authors": "Diego Ardila, Peter Cauwels, Dorsa Sanadgol, and Didier Sornette", "title": "Is There A Real Estate Bubble in Switzerland?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have analyzed the risks of possible development of bubbles in the Swiss\nresidential real estate market. The data employed in this work has been\ncollected by comparis.ch, and carefully cleaned from duplicate records through\na procedure based on supervised machine learning methods. The study uses the\nlog periodic power law (LPPL) bubble model to analyze the development of asking\nprices of residential properties in all Swiss districts between 2005 and 2013.\nThe results suggest that there are 11 critical districts that exhibit\nsignatures of bubbles, and seven districts where bubbles have already burst.\nDespite these strong signatures, it is argued that, based on the current\neconomic environment, a soft landing rather than a severe crash is expected.\n", "versions": [{"version": "v1", "created": "Tue, 19 Mar 2013 08:52:17 GMT"}], "update_date": "2013-03-20", "authors_parsed": [["Ardila", "Diego", ""], ["Cauwels", "Peter", ""], ["Sanadgol", "Dorsa", ""], ["Sornette", "Didier", ""]]}, {"id": "1303.5290", "submitter": "Sofoklis Makridis S", "authors": "Evangelos I. Gkanas, Vasso MagkouKriticou, Sofoklis S. Makridis,\n  Athanasios K. Stubos and Ioannis Bakouros", "title": "Nanotechnology and Innovation, Recent status and the strategic\n  implication for the formation of high tech clusters in Greece, in between a\n  global economic crisis", "comments": null, "journal-ref": "International Journal of Technology Innovations and Research,\n  Vol.2, 2013", "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nanotechnology is the first major worldwide research initiative of the 21st\ncentury and probably is the solution vector in the economic environment. Also,\ninnovation is widely recognized as a key factor in the economic development of\nnations, and is essential for the competitiveness of the industrial firms as\nwell. Policy and management of innovation are necessary in order to develop\ninnovation and it involves processes. It is essential to develop new methods\nfor nanotechnology development for better understanding of nanotechnology based\ninnovation. Nanotechnologies reveal commercialization processes, from start ups\nto large firms in collaboration with public sector research. In the current\npaper, a study in the present status of innovation in nanotechnology and the\naffection of global economic crisis in this section is made and also the\npotential of increase the innovation via the presence of clusters in a small\ncountry like Greece which is in the eye of tornado from the global crisis is\nstudied.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 14:38:09 GMT"}, {"version": "v2", "created": "Sat, 6 Apr 2013 15:09:24 GMT"}], "update_date": "2013-11-05", "authors_parsed": [["Gkanas", "Evangelos I.", ""], ["MagkouKriticou", "Vasso", ""], ["Makridis", "Sofoklis S.", ""], ["Stubos", "Athanasios K.", ""], ["Bakouros", "Ioannis", ""]]}, {"id": "1303.5703", "submitter": "Bruce Abramson", "authors": "Bruce Abramson", "title": "ARCO1: An Application of Belief Networks to the Oil Market", "comments": "Appears in Proceedings of the Seventh Conference on Uncertainty in\n  Artificial Intelligence (UAI1991)", "journal-ref": null, "doi": null, "report-no": "UAI-P-1991-PG-1-8", "categories": "cs.AI q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Belief networks are a new, potentially important, class of knowledge-based\nmodels. ARCO1, currently under development at the Atlantic Richfield Company\n(ARCO) and the University of Southern California (USC), is the most advanced\nreported implementation of these models in a financial forecasting setting.\nARCO1's underlying belief network models the variables believed to have an\nimpact on the crude oil market. A pictorial market model-developed on a MAC II-\nfacilitates consensus among the members of the forecasting team. The system\nforecasts crude oil prices via Monte Carlo analyses of the network. Several\ndifferent models of the oil market have been developed; the system's ability to\nbe updated quickly highlights its flexibility.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 15:29:24 GMT"}], "update_date": "2013-03-26", "authors_parsed": [["Abramson", "Bruce", ""]]}, {"id": "1303.5882", "submitter": "Harris Georgiou", "authors": "Harris V. Georgiou", "title": "Feedback models and stability analysis of three economic paradigms", "comments": null, "journal-ref": null, "doi": null, "report-no": "HG/GT.0313.01v1", "categories": "q-fin.GN math.DS", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this paper, simple mathematical models from Control Theory are applied to\nthree very important economic paradigms, namely (a) minimum wages in\nself-regulating markets, (b) market-versus-true values and currency rates, and\n(c) government spending and taxation levels. Analytical solutions are provided\nin all three paradigms and some useful conclusions are drawn in terms of\nvariable analysis. This short study can be used as an example of how feedback\nmodels and stability analysis can be applied as a guideline of 'proofs' in the\ncontext of economic policies.\n", "versions": [{"version": "v1", "created": "Sat, 23 Mar 2013 20:07:13 GMT"}], "update_date": "2013-03-26", "authors_parsed": [["Georgiou", "Harris V.", ""]]}, {"id": "1303.6183", "submitter": "Svozil Karl", "authors": "Karl Svozil", "title": "Quantitative easing is an incomplete strategy that must be accompanied\n  by the nullification of debt", "comments": "8 pages, some revisions", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Compound interest as well as inflation grows exponentially with time, whereas\nother means to repay debt grow polynomially. For this and other, mostly\npolitical, reasons, debt without inflation is unsustainable. We suggest a\ndiscontinuous way to eliminate debt by nullifying it. This scenario is\npreferable to current central bank strategies of quantitative easing because it\nallows the disposal of debt without hyperinflation or bloated balance sheets.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2013 15:57:19 GMT"}, {"version": "v2", "created": "Fri, 12 Apr 2013 12:33:52 GMT"}, {"version": "v3", "created": "Fri, 10 Jul 2015 15:05:36 GMT"}], "update_date": "2015-07-13", "authors_parsed": [["Svozil", "Karl", ""]]}, {"id": "1303.6192", "submitter": "Mazen Kebewar", "authors": "Muhammad Khan, Mazen Kebewar, Nikolay Nenovsky", "title": "Inflation Uncertainty, Output Growth Uncertainty and Macroeconomic\n  Performance: Comparing Alternative Exchange Rate Regimes in Eastern Europe", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the late 90's, after severe financial and economic crisis, accompanied by\ninflation and exchange rate instability, Eastern Europe emerged into two groups\nof countries with radically contrasting monetary regimes (Currency Boards and\nInflation targeting). The task of our study is to compare econometrically the\nperformance of these two regimes in terms of the relationship between\ninflation, output growth, nominal and real uncertainties from 2000 till now. In\nother words, we test the hypothesis of non-neutrality of monetary and exchange\nrate regimes with respect to these connections. In a whole, the empirical\nresults do not allow us to judge which monetary regime is more appropriate and\nreasonable to assume. EU enlargement is one of the possible explanations for\nthe numbing of the differences and the lack of coherence between the two\nregimes in terms of inflation, growth and their uncertainties\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2013 16:09:06 GMT"}], "update_date": "2013-03-26", "authors_parsed": [["Khan", "Muhammad", ""], ["Kebewar", "Mazen", ""], ["Nenovsky", "Nikolay", ""]]}, {"id": "1303.6569", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg, Nils Bruzelius, and Bert van Wee", "title": "Comparison of Capital Costs per Route-Kilometre in Urban Rail", "comments": null, "journal-ref": "European Journal of Transport and Infrastructure Research, vol. 8,\n  no. 1, March 2008, 17-30", "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Because of the prominent position of urban rail in reducing urban\ntransport-related problems, such as congestion and air pollution, insights into\nthe costs of possible new urban rail projects is very relevant for those\ninvolved with cost estimations, policy makers, cost-benefit analysts, and other\ntarget groups. Knowledge of the differences in costs per kilometre, including\nexplanations of differences and their breakdowns is currently lacking in the\nliterature. This paper aims to provide a first stage insight into how cost per\nkilometre varies across urban rail projects. The methodology applied is a\nsimple cost comparison across projects where the data collected are comparable.\nWe conclude that capital costs per route-kilometre of urban rail vary highly\nbetween projects. Looking at European projects and excluding outliers, the\ntotal capital costs per route-kilometre (including stations and rolling stock)\nlie mainly between US$50-100 million (2002 prices). Including US projects, the\nrange is US$50-150 million. The main reasons for the high variation in the\nroute-kilometre costs are differences between projects as regards the ratio of\nunderground to above-ground construction, ground conditions, station spacing,\ntype of rolling stock, environmental and safety constraints and labour costs.\nWe warn, however, that the observations used to reach the conclusions are too\nfew to obtain results with statistical significance. Our results must therefore\nbe seen as a first step towards collecting more data so that a more succinct\nstatistical analysis can be conducted. Another conclusion is therefore that\nthis area has future research potential.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 11:33:52 GMT"}], "update_date": "2013-03-27", "authors_parsed": [["Flyvbjerg", "Bent", ""], ["Bruzelius", "Nils", ""], ["van Wee", "Bert", ""]]}, {"id": "1303.6571", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg", "title": "Survival of the Unfittest: Why the Worst Infrastructure Gets Built, And\n  What We Can Do about It", "comments": "arXiv admin note: text overlap with arXiv:1302.3642", "journal-ref": "Oxford Review of Economic Policy, vol. 25, no. 3, 2009", "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The article first describes characteristics of major infrastructure projects.\nSecond, it documents a much neglected topic in economics: that ex ante\nestimates of costs and benefits are often very different from actual ex post\ncosts and benefits. For large infrastructure projects the consequence is cost\noverruns, benefit shortfalls, and the systematic underestimation of risks.\nThird, implications for cost-benefit analysis are described, including that\nsuch analysis is not to be trusted for major infrastructure projects. Fourth,\nthe article uncovers the causes of this state of affairs in terms of perverse\nincentives that encourage promoters to underestimate costs and overestimate\nbenefits in the business cases for their projects. But the projects that are\nmade to look best on paper are the projects that amass the highest cost\noverruns and benefit shortfalls in reality. The article depicts this situation\nas \"survival of the un-fittest.\" Fifth, the article sets out to explain how the\nproblem may be solved, with a view to arriving at more efficient and more\ndemocratic projects, and avoiding the scandals that often accompany major\ninfrastructure investments. Finally, the article identifies current trends in\nmajor infrastructure development. It is argued that a rapid increase in\nstimulus spending combined with more investments in emerging economies combined\nwith more spending on information technology is catapulting infrastructure\ninvestment from the frying pan into the fire.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 10:59:34 GMT"}], "update_date": "2013-03-27", "authors_parsed": [["Flyvbjerg", "Bent", ""]]}, {"id": "1303.6604", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg, Mette K. Skamris Holm, S{\\o}ren L. Buhl", "title": "Underestimating Costs in Public Works Projects: Error or Lie?", "comments": "40 pages", "journal-ref": "Bent Flyvbjerg, Mette K. Skamris Holm, S{\\o}ren L. Buhl,\n  \"Underestimating Costs in Public Works Projects: Error or Lie?\" Journal of\n  the American Planning Association, vol. 68, no. 3, Summer 2002, pp. 279-295", "doi": "10.1080/01944360208976273", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents results from the first statistically significant study\nof cost escalation in transportation infrastructure projects. Based on a sample\nof 258 transportation infrastructure projects worth US$90 billion and\nrepresenting different project types, geographical regions, and historical\nperiods, it is found with overwhelming statistical significance that the cost\nestimates used to decide whether such projects should be built are highly and\nsystematically misleading. Underestimation cannot be explained by error and is\nbest explained by strategic misrepresentation, that is, lying. The policy\nimplications are clear: legislators, administrators, investors, media\nrepresentatives, and members of the public who value honest numbers should not\ntrust cost estimates and cost-benefit analyses produced by project promoters\nand their analysts.\n", "versions": [{"version": "v1", "created": "Wed, 6 Mar 2013 11:22:51 GMT"}], "update_date": "2013-03-27", "authors_parsed": [["Flyvbjerg", "Bent", ""], ["Holm", "Mette K. Skamris", ""], ["Buhl", "Søren L.", ""]]}, {"id": "1303.6654", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg, Mette Skamris Holm, and S{\\o}ren L. Buhl", "title": "How (In)accurate Are Demand Forecasts in Public Works Projects? The Case\n  of Transportation", "comments": "arXiv admin note: text overlap with arXiv:1302.2544, arXiv:1303.6571,\n  arXiv:1302.3642", "journal-ref": "Journal of the American Planning Association, vol. 71, no. 2,\n  Spring 2005, 131-146", "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents results from the first statistically significant study\nof traffic forecasts in transportation infrastructure projects. The sample used\nis the largest of its kind, covering 210 projects in 14 nations worth US$59\nbillion. The study shows with very high statistical significance that\nforecasters generally do a poor job of estimating the demand for transportation\ninfrastructure projects. The result is substantial downside financial and\neconomic risks. Such risks are typically ignored or downplayed by planners and\ndecision makers, to the detriment of social and economic welfare. For nine out\nof ten rail projects passenger forecasts are overestimated; average\noverestimation is 106 percent. This results in large benefit shortfalls for\nrail projects. For half of all road projects the difference between actual and\nforecasted traffic is more than plus/minus 20 percent. Forecasts have not\nbecome more accurate over the 30-year period studied. If techniques and skills\nfor arriving at accurate demand forecasts have improved over time, as often\nclaimed by forecasters, this does not show in the data. The causes of\ninaccuracy in forecasts are different for rail and road projects, with\npolitical causes playing a larger role for rail than for road. The cure is\ntransparency, accountability, and new forecasting methods. The challenge is to\nchange the governance structures for forecasting and project development. The\narticle shows how planners may help achieve this.\n", "versions": [{"version": "v1", "created": "Wed, 20 Mar 2013 12:14:55 GMT"}], "update_date": "2013-03-28", "authors_parsed": [["Flyvbjerg", "Bent", ""], ["Holm", "Mette Skamris", ""], ["Buhl", "Søren L.", ""]]}, {"id": "1303.7400", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg", "title": "Policy and Planning for Large Infrastructure Projects: Problems, Causes,\n  Cures", "comments": "arXiv admin note: substantial text overlap with arXiv:1303.6571,\n  arXiv:1303.6654, arXiv:1303.6571, arXiv:1302.3642", "journal-ref": null, "doi": null, "report-no": "Policy Research Working Paper, WPS 3781, World Bank, Washington, DC,\n  2005, 32 pp", "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper argues, first, that a major problem in the planning of large\ninfrastructure projects is the high level of misinformation about costs and\nbenefits that decision makers face in deciding whether to build, and the high\nrisks such misinformation generates. Second, it explores the causes of\nmisinformation and risk, mainly in the guise of optimism bias and strategic\nmisrepresentation. Finally, the paper presents a number of measures aimed at\nimproving planning and decision making for large infrastructure projects,\nincluding changed incentive structures and better planning methods. Thus the\npaper is organized as a simple triptych consisting in problems, causes, and\ncures.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 13:04:30 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Flyvbjerg", "Bent", ""]]}, {"id": "1303.7401", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg", "title": "Measuring Inaccuracy in Travel Demand Forecasting: Methodological\n  Considerations Regarding Ramp Up and Sampling", "comments": null, "journal-ref": "Transportation Research A, vol. 39, no. 6, July 2005, 522-530", "doi": "10.1016/j.tra.2005.02.003", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Project promoters, forecasters, and managers sometimes object to two things\nin measuring inaccuracy in travel demand forecasting: (1) using the forecast\nmade at the time of making the decision to build as the basis for measuring\ninaccuracy and (2) using traffic during the first year of operations as the\nbasis for measurement. This paper presents the case against both objections.\nFirst, if one is interested in learning whether decisions about building\ntransport infrastructure are based on reliable information, then it is exactly\nthe traffic forecasted at the time of making the decision to build that is of\ninterest. Second, although ideally studies should take into account so-called\ndemand \"ramp up\" over a period of years, the empirical evidence and practical\nconsiderations do not support this ideal requirement, at least not for large-N\nstudies. Finally, the paper argues that large samples of inaccuracy in travel\ndemand forecasts are likely to be conservatively biased, i.e., accuracy in\ntravel demand forecasts estimated from such samples would likely be higher than\naccuracy in travel demand forecasts in the project population. This bias must\nbe taken into account when interpreting the results from statistical analyses\nof inaccuracy in travel demand forecasting.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 12:41:50 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Flyvbjerg", "Bent", ""]]}, {"id": "1303.7402", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg", "title": "Cost Overruns and Demand Shortfalls in Urban Rail and Other\n  Infrastructure", "comments": null, "journal-ref": "Transportation Planning and Technology, vol. 30, no. 1, February\n  2007, 9-30", "doi": "10.1080/03081060701207938", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Risk, including economic risk, is increasingly a concern for public policy\nand management. The possibility of dealing effectively with risk is hampered,\nhowever, by lack of a sound empirical basis for risk assessment and management.\nThe paper demonstrates the general point for cost and demand risks in urban\nrail projects. The paper presents empirical evidence that allow valid economic\nrisk assessment and management of urban rail projects, including benchmarking\nof individual or groups of projects. Benchmarking of the Copenhagen Metro is\npresented as a case in point. The approach developed is proposed as a model for\nother types of policies and projects in order to improve economic and financial\nrisk assessment and management in policy and planning.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 12:14:47 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Flyvbjerg", "Bent", ""]]}, {"id": "1303.7403", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg, Massimo Garbuio, and Dan Lovallo", "title": "Delusion and Deception in Large Infrastructure Projects: Two Models for\n  Explaining and Preventing Executive Disaster", "comments": null, "journal-ref": "California Management Review, vol. 51, no. 2, Winter 2009, 170-193", "doi": "10.1225/CMR423", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Economist recently reported that infrastructure spending is the largest\nit is ever been as a share of world GDP. With $22 trillion in projected\ninvestments over the next ten years in emerging economies alone, the magazine\ncalls it the \"biggest investment boom in history.\" The efficiency of\ninfrastructure planning and execution is therefore particularly important at\npresent. Unfortunately, the private sector, the public sector and\nprivate/public sector partnerships have a dismal record of delivering on large\ninfrastructure cost and performance promises. This paper explains why and how\nto solve the problem.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 11:51:20 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Flyvbjerg", "Bent", ""], ["Garbuio", "Massimo", ""], ["Lovallo", "Dan", ""]]}, {"id": "1303.7404", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg, Nils Bruzelius, and Werner Rothengatter", "title": "Megaprojects and Risk: An Anatomy of Ambition", "comments": "Cambridge University Press, 2003", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Back cover text: Megaprojects and Risk provides the first detailed\nexamination of the phenomenon of megaprojects. It is a fascinating account of\nhow the promoters of multibillion-dollar megaprojects systematically and\nself-servingly misinform parliaments, the public and the media in order to get\nprojects approved and built. It shows, in unusual depth, how the formula for\napproval is an unhealthy cocktail of underestimated costs, overestimated\nrevenues, undervalued environmental impacts and overvalued economic development\neffects. This results in projects that are extremely risky, but where the risk\nis concealed from MPs, taxpayers and investors. The authors not only explore\nthe problems but also suggest practical solutions drawing on theory and hard,\nscientific evidence from the several hundred projects in twenty nations that\nillustrate the book. Accessibly written, it will be essential reading in its\nfield for students, scholars, planners, economists, auditors, politicians,\njournalists and interested citizens.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 10:29:04 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Flyvbjerg", "Bent", ""], ["Bruzelius", "Nils", ""], ["Rothengatter", "Werner", ""]]}, {"id": "1303.7405", "submitter": "Bent Flyvbjerg", "authors": "Bent Flyvbjerg", "title": "How Planners Deal with Uncomfortable Knowledge: The Dubious Ethics of\n  the American Planning Association", "comments": "Flyvbjerg, Bent, 2013, \"How Planners Deal with Uncomfortable\n  Knowledge: The Dubious Ethics of the American Planning Association,\" Cities", "journal-ref": null, "doi": "10.1016/J.CITIES.2012.10.016", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With a point of departure in the concept \"uncomfortable knowledge,\" this\narticle presents a case study of how the American Planning Association (APA)\ndeals with such knowledge. APA was found to actively suppress publicity of\nmalpractice concerns and bad planning in order to sustain a boosterish image of\nplanning. In the process, APA appeared to disregard and violate APA's own Code\nof Ethics. APA justified its actions with a need to protect APA members'\ninterests, seen as preventing planning and planners from being presented in\npublic in a bad light. The current article argues that it is in members'\ninterest to have malpractice critiqued and reduced, and that this best happens\nby exposing malpractice, not by denying or diverting attention from it as APA\ndid in this case. Professions, organizations, and societies that stifle\ncritique tend to degenerate and become socially and politically irrelevant\n\"zombie institutions.\" The article asks whether such degeneration has set in\nfor APA and planning. Finally, it is concluded that more debate about APA's\nethics and actions is needed for improving planning practice. Nine key\nquestions are presented to constructively stimulate such debate.\n", "versions": [{"version": "v1", "created": "Thu, 28 Mar 2013 11:04:53 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Flyvbjerg", "Bent", ""]]}, {"id": "1303.7445", "submitter": "Saad Khan", "authors": "Saad Ahmad Khan, Ladislau Boloni", "title": "Agent-based modeling of a price information trading business", "comments": "Extended version of the paper published at Computer and Information\n  Sciences, Proc. of ISCIS-26, 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe an agent-based simulation of a fictional (but feasible)\ninformation trading business. The Gas Price Information Trader (GPIT) buys\ninformation about real-time gas prices in a metropolitan area from drivers and\nresells the information to drivers who need to refuel their vehicles.\n  Our simulation uses real world geographic data, lifestyle-dependent driving\npatterns and vehicle models to create an agent-based model of the drivers. We\nuse real world statistics of gas price fluctuation to create scenarios of\ntemporal and spatial distribution of gas prices. The price of the information\nis determined on a case-by-case basis through a simple negotiation model. The\ntrader and the customers are adapting their negotiation strategies based on\ntheir historical profits.\n  We are interested in the general properties of the emerging information\nmarket: the amount of realizable profit and its distribution between the trader\nand customers, the business strategies necessary to keep the market operational\n(such as promotional deals), the price elasticity of demand and the impact of\npricing strategies on the profit.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2013 17:40:04 GMT"}], "update_date": "2013-04-01", "authors_parsed": [["Khan", "Saad Ahmad", ""], ["Boloni", "Ladislau", ""]]}]