[{"id": "1411.1560", "submitter": "Maciej Jagielski", "authors": "Maciej Jagielski, Rafa{\\l} Duczmal, Ryszard Kutner", "title": "Income Distribution in the European Union Versus in the United States", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2015.03.071", "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that the refined approach -- our extension of the Yakovenko et al.\nformalism -- is universal in the sense that it describes well both household\nincomes in the European Union and the individual incomes in the United States\nfor social classes of any income. This formalism allowed the study of the\nimpact of the recent world-wide financial crisis on the annual incomes of\ndifferent social classes. Hence, we indicate the existence of a possible\nprecursor of a market crisis. Besides, we find the most painful impact of the\ncrisis on incomes of all social classes.\n", "versions": [{"version": "v1", "created": "Thu, 6 Nov 2014 10:52:04 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Jagielski", "Maciej", ""], ["Duczmal", "Rafał", ""], ["Kutner", "Ryszard", ""]]}, {"id": "1411.1929", "submitter": "Peter Weijland", "authors": "W.P. Weijland", "title": "A General Equilibrium Theorem for the Economy of Giving", "comments": "14 pages, nine figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In [1] we presented a model for transactions when goods are given away in the\nexpectation of a later settlement. In settings where people keep track of their\nsocial accounts we were able to redefine concepts like account balance, yield\ncurve and the law of diminishing returns. In this paper we establish a general\nequilibrium theorem, conjectured in [1], by developing sufficient conditions\nfor any instance of the standard model (or Gift Economy Model) to have a unique\nequilibrium. The convergence to that equilibrium is exponential and for each\npair of entities P and Q the total sum of yields from all mutual transactions\nis equal to zero.\n  [1] W.P. Weijland, Mathematical Foundations for the Economy of Giving, ArXiv\nCategories: q-fin.GN, Report 1401.4664, 2014.\n", "versions": [{"version": "v1", "created": "Fri, 7 Nov 2014 14:29:01 GMT"}], "update_date": "2014-11-10", "authors_parsed": [["Weijland", "W. P.", ""]]}, {"id": "1411.2138", "submitter": "Francesco Sarracino", "authors": "Stefano Bartolini and Francesco Sarracino", "title": "It's not the economy, stupid! How social capital and GDP relate to\n  happiness over time", "comments": "48 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  What predicts the evolution over time of subjective well-being? We correlate\nthe trends of subjective well-being with the trends of social capital and/or\nGDP. We find that in the long and medium run social capital largely predicts\nthe trends of subjective wellbeing in our sample of countries. In the\nshort-term this relationship weakens. Indeed, in the short run, changes in\nsocial capital predict a much smaller portion of the changes in subjective\nwell-being than over longer periods. GDP follows a reverse path, thus\nconfirming the Easterlin paradox: in the short run GDP is more positively\ncorrelated to well-being than in the medium-term, while in the long run this\ncorrelation vanishes.\n", "versions": [{"version": "v1", "created": "Sat, 8 Nov 2014 17:09:39 GMT"}], "update_date": "2014-11-11", "authors_parsed": [["Bartolini", "Stefano", ""], ["Sarracino", "Francesco", ""]]}, {"id": "1411.4633", "submitter": "Angus Unegbu O", "authors": "Angus O. Unegbu", "title": "Theories of Accounting: Evolution & Developments, Income-Determination\n  and Diversities in Use", "comments": "Keywords: Review of Accounting Theories, Financial Reporting,\n  Corporate Reports, Financial Statements, Developments in Accounting", "journal-ref": "Research Journal of Finance and Accounting, Vol. 5(19), 2014.\n  http://www.iiste.org/Journals/index.php/RJFA/article/download/16836/17176", "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Accounting frameworks follow stipulations of existing Accounting Theories.\nThis exploratory research sets out to trace the evolution of accounting\ntheories of Charge and Discharge Syndrome and the Corollary of Double Entry.\nFurthermore, it dives into the theories of Income Determination, garnishing it\nwith areas of diversities in the use of Accounting Information while review of\ntheories of recent growths and developments in Accounting are not left out. The\nmethod of research adopted is exploratory review of existing accounting\nliterature. It is observed that the emergence of these theories exist to\nminimize fraud, errors, misappropriations and pilfering of Corporate assets. It\nis recommended that implementation prescriptions of these theories by\nInternational Financial Reporting Standard Committee and Practicing Accountants\nshould be adhered to and simplified so as to avoid confusing and scandalous\nreporting of financial statements\n", "versions": [{"version": "v1", "created": "Mon, 3 Nov 2014 10:00:26 GMT"}], "update_date": "2014-11-18", "authors_parsed": [["Unegbu", "Angus O.", ""]]}, {"id": "1411.5159", "submitter": "Hacene Djellout", "authors": "Hac\\`ene Djellout, Arnaud Guillin, Yacouba Samoura", "title": "Large deviations of the realized (co-)volatility vector", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST q-fin.GN stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Realized statistics based on high frequency returns have become very popular\nin financial economics. In recent years, different non-parametric estimators of\nthe variation of a log-price process have appeared. These were developed by\nmany authors and were motivated by the existence of complete records of price\ndata. Among them are the realized quadratic (co-)variation which is perhaps the\nmost well known example, providing a consistent estimator of the integrated\n(co-)volatility when the logarithmic price process is continuous. Limit results\nsuch as the weak law of large numbers or the central limit theorem have been\nproved in different contexts. In this paper, we propose to study the large\ndeviation properties of realized (co-)volatility (i.e., when the number of high\nfrequency observations in a fixed time interval increases to infinity. More\nspecifically, we consider a bivariate model with synchronous observation\nschemes and correlated Brownian motions of the following form: $dX\\_{\\ell,t} =\n\\sigma\\_{\\ell,t}dB\\_{\\ell,t}+b\\_{\\ell}(t,\\omega)dt$ for $\\ell=1,2$, where\n$X\\_{\\ell}$ denotes the log-price, we are concerned with the large deviation\nestimation of the vector $V\\_t^n(X)=(Q\\_{1,t}^n(X), Q\\_{2,t}^n(X),\nC\\_{t}^n(X))$ where $Q\\_{\\ell,t}^n(X)$ and $C\\_{t}^n(X)$ represente the\nestimator of the quadratic variational processes\n$Q\\_{\\ell,t}=\\int\\_0^t\\sigma\\_{\\ell,s}^2ds$ and the integrated covariance\n$C\\_t=\\int\\_0^t\\sigma\\_{1,s}\\sigma\\_{2,s}\\rho\\_sds$ respectively, with\n$\\rho\\_t=cov(B\\_{1,t}, B\\_{2,t})$. Our main motivation is to improve upon the\nexisting limit theorems. Our large deviations results can be used to evaluate\nand approximate tail probabilities of realized (co-)volatility. As an\napplication we provide the large deviation for the standard dependence measures\nbetween the two assets returns such as the realized regression coefficients up\nto time $t$, or the realized correlation. Our study should contribute to the\nrecent trend of research on the (co-)variance estimation problems, which are\nquite often discussed in high-frequency financial data analysis.\n", "versions": [{"version": "v1", "created": "Wed, 19 Nov 2014 09:42:49 GMT"}], "update_date": "2014-11-20", "authors_parsed": [["Djellout", "Hacène", ""], ["Guillin", "Arnaud", ""], ["Samoura", "Yacouba", ""]]}, {"id": "1411.7593", "submitter": "Rafael Diaz", "authors": "Rafael Diaz, Laura Gomez", "title": "Indirect Influences in International Trade", "comments": null, "journal-ref": "Networks and Heterogenous Media 10 (2015) 149-165", "doi": null, "report-no": null, "categories": "cs.SI physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the problem of gauging the influence exerted by a given country on\nthe global trade market from the viewpoint of complex networks. In particular,\nwe apply the PWP method for computing indirect influences on the world trade\nnetwork.\n", "versions": [{"version": "v1", "created": "Thu, 27 Nov 2014 13:32:14 GMT"}], "update_date": "2015-04-30", "authors_parsed": [["Diaz", "Rafael", ""], ["Gomez", "Laura", ""]]}]