[{"id": "1505.00471", "submitter": "Jose Luis Subias", "authors": "J. L. Subias", "title": "Phase Transitions, Renormalization and Yang-Lee Zeros in Stock Markets", "comments": "11 pages, 8 figures, LaTeX preprint", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present paper analyses the formal parallelism existing between the laws\nof thermodynamics and some economic principles. Based on previous works, we\nshall show how the existence in Economics of principles analogous to those in\nthermodynamics involves the occurrence of economic events that remind of\nwell-known phenomenological thermodynamic paradigms (i.e., the magnetocaloric\neffect and population inversion). We shall also show how the phase transition\nand renormalization theory provides a natural framework to understand and\npredict trend changes in stock markets. Finally, current negotiation strategies\nin financial markets are briefly reviewed.\n", "versions": [{"version": "v1", "created": "Sun, 3 May 2015 20:40:55 GMT"}], "update_date": "2015-05-05", "authors_parsed": [["Subias", "J. L.", ""]]}, {"id": "1505.01274", "submitter": "Marco Patriarca", "authors": "Els Heinsalu and Marco Patriarca", "title": "Kinetic models of immediate exchange", "comments": "10 pages, 7 figures", "journal-ref": "Eur. Phys. J. B 87, 170 (2014)", "doi": "10.1140/epjb/e2014-50270-6", "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a novel kinetic exchange model differing from previous ones in two\nmain aspects. First, the basic dynamics is modified in order to represent\neconomies where immediate wealth exchanges are carried out, instead of\nreshufflings or uni-directional movements of wealth. Such dynamics produces\nwealth distributions that describe more faithfully real data at small values of\nwealth. Secondly, a general probabilistic trading criterion is introduced, so\nthat two economic units can decide independently whether to trade or not\ndepending on their profit. It is found that the type of the equilibrium wealth\ndistribution is the same for a large class of trading criteria formulated in a\nsymmetrical way with respect to the two interacting units. This establishes\nunexpected links between and provides a microscopic foundations of various\nkinetic exchange models in which the existence of a saving propensity is\npostulated. We also study the generalized heterogeneous version of the model in\nwhich units use different trading criteria and show that suitable sets of\ndiversified parameter values with a moderate level of heterogeneity can\nreproduce realistic wealth distributions with a Pareto power law.\n", "versions": [{"version": "v1", "created": "Wed, 6 May 2015 07:56:30 GMT"}], "update_date": "2015-05-07", "authors_parsed": [["Heinsalu", "Els", ""], ["Patriarca", "Marco", ""]]}, {"id": "1505.02274", "submitter": "Takayuki Mizuno", "authors": "Takayuki Mizuno, Takaaki Ohnishi and Tsutomu Watanabe", "title": "Structure of global buyer-supplier networks and its implications for\n  conflict minerals regulations", "comments": "18 pages, 7 tables, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the structure of global inter-firm linkages using a dataset\nthat contains information on business partners for about 400,000 firms\nworldwide, including all the firms listed on the major stock exchanges. Among\nthe firms, we examine three networks, which are based on customer-supplier,\nlicensee-licensor, and strategic alliance relationships. First, we show that\nthese networks all have scale-free topology and that the degree distribution\nfor each follows a power law with an exponent of 1.5. The shortest path length\nis around six for all three networks. Second, we show through community\nstructure analysis that the firms comprise a community with those firms that\nbelong to the same industry but different home countries, indicating the\nglobalization of firms' production activities. Finally, we discuss what such\nproduction globalization implies for the proliferation of conflict minerals\n(i.e., minerals extracted from conflict zones and sold to firms in other\ncountries to perpetuate fighting) through global buyer-supplier linkages. We\nshow that a limited number of firms belonging to some specific industries and\ncountries plays an important role in the global proliferation of conflict\nminerals. Our numerical simulation shows that regulations on the purchases of\nconflict minerals by those firms would substantially reduce their worldwide\nuse.\n", "versions": [{"version": "v1", "created": "Sat, 9 May 2015 13:58:27 GMT"}], "update_date": "2015-05-12", "authors_parsed": [["Mizuno", "Takayuki", ""], ["Ohnishi", "Takaaki", ""], ["Watanabe", "Tsutomu", ""]]}, {"id": "1505.02305", "submitter": "Daniel Rockmore", "authors": "Robin L. Lumsdaine, Daniel N. Rockmore, Nicholas Foti, Gregory Leibon,\n  J. Doyne Farmer", "title": "The Intrafirm Complexity of Systemically Important Financial\n  Institutions", "comments": "33 pages, 7 Figures, 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In November, 2011, the Financial Stability Board, in collaboration with the\nInternational Monetary Fund, published a list of 29 \"systemically important\nfinancial institutions\" (SIFIs). This designation reflects a concern that the\nfailure of any one of them could have dramatic negative consequences for the\nglobal economy and is based on \"their size, complexity, and systemic\ninterconnectedness\". While the characteristics of \"size\" and \"systemic\ninterconnectedness\" have been the subject of a good deal of quantitative\nanalysis, less attention has been paid to measures of a firm's \"complexity.\" In\nthis paper we take on the challenges of measuring the complexity of a financial\ninstitution and to that end explore the use of the structure of an individual\nfirm's control hierarchy as a proxy for institutional complexity. The control\nhierarchy is a network representation of the institution and its subsidiaries.\nWe show that this mathematical representation (and various associated metrics)\nprovides a consistent way to compare the complexity of firms with often very\ndisparate business models and as such may provide the foundation for\ndetermining a SIFI designation. By quantifying the level of complexity of a\nfirm, our approach also may prove useful should firms need to reduce their\nlevel of complexity either in response to business or regulatory needs. Using a\ndata set containing the control hierarchies of many of the designated SIFIs, we\nfind that in the past two years, these firms have decreased their level of\ncomplexity, perhaps in response to regulatory requirements.\n", "versions": [{"version": "v1", "created": "Sat, 9 May 2015 19:00:33 GMT"}], "update_date": "2015-05-12", "authors_parsed": [["Lumsdaine", "Robin L.", ""], ["Rockmore", "Daniel N.", ""], ["Foti", "Nicholas", ""], ["Leibon", "Gregory", ""], ["Farmer", "J. Doyne", ""]]}, {"id": "1505.02644", "submitter": "Dragos-Patru Covei D.P.", "authors": "Dragos-Patru Covei", "title": "A Profit-maximization Model for a Company that Sells an Arbitrary Number\n  of Products", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the problems faced by a firm that sells certain commodities is to\ndetermine the number of products that it must supply in order to maximize its\nprofit. In this article, the authors give an answer to this problem of economic\ninterest. The proposed problem is a generalization of the results obtained by\nStirzaker (Probability and Random Variables: A Beginner's Guide, 1999) and\nKupferman (Lecture Notes in Probability, 2009) where the authors do not present\na situation where the sale of a quantity from some commodities is constrained\nby the marketing of another. In addition, the described procedure is simple and\ncan be successfully applied to any number of commodities. The obtained results\ncan be easily put into practice.\n", "versions": [{"version": "v1", "created": "Sat, 2 May 2015 13:58:22 GMT"}, {"version": "v2", "created": "Mon, 9 May 2016 12:45:37 GMT"}], "update_date": "2016-05-10", "authors_parsed": [["Covei", "Dragos-Patru", ""]]}, {"id": "1505.04060", "submitter": "Wanfeng Yan", "authors": "Wanfeng Yan and Edgar van Tuyll van Serooskerken", "title": "Forecasting Financial Extremes: A Network Degree Measure of\n  Super-exponential Growth", "comments": "16 pages, 6 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0128908", "report-no": null, "categories": "q-fin.GN", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Investors in stock market are usually greedy during bull markets and scared\nduring bear markets. The greed or fear spreads across investors quickly. This\nis known as the herding effect, and often leads to a fast movement of stock\nprices. During such market regimes, stock prices change at a super-exponential\nrate and are normally followed by a trend reversal that corrects the previous\nover reaction. In this paper, we construct an indicator to measure the\nmagnitude of the super-exponential growth of stock prices, by measuring the\ndegree of the price network, generated from the price time series. Twelve major\ninternational stock indices have been investigated. Error diagram tests show\nthat this new indicator has strong predictive power for financial extremes,\nboth peaks and troughs. By varying the parameters used to construct the error\ndiagram, we show the predictive power is very robust. The new indicator has a\nbetter performance than the LPPL pattern recognition indicator.\n", "versions": [{"version": "v1", "created": "Fri, 15 May 2015 13:38:10 GMT"}], "update_date": "2016-11-06", "authors_parsed": [["Yan", "Wanfeng", ""], ["van Serooskerken", "Edgar van Tuyll", ""]]}, {"id": "1505.05639", "submitter": "Elena Harpa", "authors": "Elena Lucia Harpa, Liviu Marian, Sorina Moica, Iulia Elena Apavaloaie", "title": "Analysis of the most important variables which determine innovation\n  among rural entrepreneurs", "comments": "4th RMEE Conference The Management Between Profit and Social\n  Responsibility, UT Cluj, 18th-20th September 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present research aims to highlight the main factors influencing the\ndevelopment of entrepreneurial innovation in a rural environment and to perform\nan empirical study with the purpose of assessing the main problems in rural\ndevelopment. The research performed is mostly of a quantitative nature, being\nbased on the use of the questionnaire as research tool, although some of the\nquestions were raised in order to collect respondents impressions and opinions\nwhich would form the object fo qualitative research. The research outlines the\nfact that in the rural entrepreneurship innovation is performed with minimal\ninvestment in new technologies and depends on the entrepreneur's involvement in\nInnovation Systems Network. It was also noted that most of the entrepreneurs in\nrural environment are non-innovators. The research question started to assess\nthe key elements which identify the role of innovation among entrepreneurs in\nrural areas. Based on these facts, we determined the variables that make\nentrepreneurial innovation in rural areas, followed by the analysis of the most\nsignificant variable rural entrepreneurs in the Mures county. This result can\nsupport the creation of the future model of innovation in rural\nentrepreneurship. There are relatively few studies addressing the problem of\nresearch regarding innovation in rural areas. The emphasis is on national and\nregional studies, without differentiating between the rural and urban areas.\nThus, the purpose of the analysis is to add a descriptive background related to\nthe innovation at a micro-economic level in the rural areas\n", "versions": [{"version": "v1", "created": "Thu, 21 May 2015 08:05:54 GMT"}], "update_date": "2015-05-22", "authors_parsed": [["Harpa", "Elena Lucia", ""], ["Marian", "Liviu", ""], ["Moica", "Sorina", ""], ["Apavaloaie", "Iulia Elena", ""]]}, {"id": "1505.06216", "submitter": "Yuji Hirono", "authors": "Yuji Hirono, Yoshimasa Hidaka", "title": "Jarzynski-type equalities in gambling: role of information in capital\n  growth", "comments": "32 pages, no figure; ver2: version to appear in Journal of\n  Statistical Physics", "journal-ref": null, "doi": "10.1007/s10955-015-1348-0", "report-no": "RIKEN-QHP-182, RIKEN-STAMP-10", "categories": "q-fin.GN cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the capital growth in gambling with (and without) side information\nand memory effects. We derive several equalities for gambling, which are of\nsimilar form to the Jarzynski equality and its extension to systems with\nfeedback controls. Those relations provide us with new measures to quantify the\neffects of information on the statistics of capital growth in gambling. We\ndiscuss the implications of the equalities and show that they reproduce the\nknown upper bounds of average capital growth rates.\n", "versions": [{"version": "v1", "created": "Mon, 16 Mar 2015 20:00:10 GMT"}, {"version": "v2", "created": "Tue, 18 Aug 2015 23:04:01 GMT"}], "update_date": "2015-08-20", "authors_parsed": [["Hirono", "Yuji", ""], ["Hidaka", "Yoshimasa", ""]]}, {"id": "1505.07210", "submitter": "Dominique Pepin", "authors": "Dominique Pepin (CRIEF)", "title": "Intertemporal Substitutability, Risk Aversion and Asset Prices", "comments": null, "journal-ref": "Economics Bulletin, Economics Bulletin, 2015, 35 (4), pp.2233-2241", "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Is the elasticity of intertemporal substitution (EIS) more or less than one?\nThis question can be answered by confronting theoretical results of asset\npricing models with investor behaviour during episodes of stock market panic.\nIf we consider these episodes as periods of high risk aversion, then lower\nasset prices are in fact associated with higher risk aversion. However,\naccording to theoretical models, risky asset price is an increasing function of\nthe coefficient of risk aversion only if the EIS exceeds unity. It may\ntherefore be concluded that the EIS must be more than one to reconcile theory\nwith the observed stock price decline during periods of panic.\n", "versions": [{"version": "v1", "created": "Wed, 27 May 2015 07:15:26 GMT"}, {"version": "v2", "created": "Wed, 4 Nov 2015 13:19:22 GMT"}], "update_date": "2015-11-05", "authors_parsed": [["Pepin", "Dominique", "", "CRIEF"]]}]