[{"id": "1609.00415", "submitter": "Bent Flyvbjerg", "authors": "Atif Ansar, Bent Flyvbjerg, Alexander Budzier, and Daniel Lunn", "title": "Does Infrastructure Investment Lead to Economic Growth or Economic\n  Fragility? Evidence from China", "comments": null, "journal-ref": "Oxford Review of Economic Policy, vol 32, 2016", "doi": "10.1093/oxrep/grw022", "report-no": null, "categories": "q-fin.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The prevalent view in the economics literature is that a high level of\ninfrastructure investment is a precursor to economic growth. China is\nespecially held up as a model to emulate. Based on the largest dataset of its\nkind, this paper punctures the twin myths that, first, infrastructure creates\neconomic value, and, second, China has a distinct advantage in its delivery.\nFar from being an engine of economic growth, the typical infrastructure\ninvestment fails to deliver a positive risk adjusted return. Moreover, China's\ntrack record in delivering infrastructure is no better than that of rich\ndemocracies. Where investments are debt-financed, overinvesting in unproductive\nprojects results in the buildup of debt, monetary expansion, instability in\nfinancial markets, and economic fragility, exactly as we see in China today. We\nconclude that poorly managed infrastructure investments are a main explanation\nof surfacing economic and financial problems in China. We predict that, unless\nChina shifts to a lower level of higher-quality infrastructure investments, the\ncountry is headed for an infrastructure-led national financial and economic\ncrisis, which is likely also to be a crisis for the international economy.\nChina's infrastructure investment model is not one to follow for other\ncountries but one to avoid.\n", "versions": [{"version": "v1", "created": "Thu, 1 Sep 2016 22:18:59 GMT"}], "update_date": "2016-09-05", "authors_parsed": [["Ansar", "Atif", ""], ["Flyvbjerg", "Bent", ""], ["Budzier", "Alexander", ""], ["Lunn", "Daniel", ""]]}, {"id": "1609.01900", "submitter": "Claudiu Albulescu", "authors": "Claudiu Albulescu (CRIEF), Dominique P\\'epin (CRIEF)", "title": "The loss of interest for the euro in Romania", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We generalize a money demand micro-founded model to explain Romanians' recent\nloss of interest for the euro. We show that the reason behind this loss of\ninterest is a severe decline in the relative degree of the euro liquidity\nagainst that of the Romanian leu.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2016 09:24:50 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Albulescu", "Claudiu", "", "CRIEF"], ["Pépin", "Dominique", "", "CRIEF"]]}, {"id": "1609.02334", "submitter": "Claudiu Albulescu", "authors": "Claudiu Tiberiu Albulescu (UPT), Daniel Goyeau (CRIEF)", "title": "The interaction between trade and FDI: the CEE countries experience", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inside the EU, the commercial integration of the CEE countries has gained\nremarkable momentum before the crisis appearance, but it has slightly slowed\ndown afterwards. Consequently, the interest in identifying the factors\nsupporting the commercial integration process is high. Recent findings in the\nnew trade theory suggest that FDI influence the trade intensity but the studies\napproaching this relationship for the CEE countries present mixed evidence, and\ninvestigate the commercial integration of CEE countries with the old EU\nmembers. Against this background, the purpose of this paper is to assess the\nCEE countries' intra-integration, focusing on the Czech Republic, Hungary,\nPoland and the Slovak Republic. For each country we employ a panel\ngravitational model for the bilateral trade and FDI, considering its\ninteractions with the other three countries in the sample on the one hand, and\nwith the three EU main commercial partners on the other hand. We investigate\ndifferent facets of the trade -- FDI nexus, resorting to a fixed effects model,\na random effects model, as well as to an instrumental variable estimator, over\nthe period 2000-2013. Our results suggest that outward FDI sustains the CEE\ncountries' commercial integration, while inward FDI has no significant effect.\nIn all the cases a complementarity effect between trade and FDI is documented,\nwhich is stronger for the CEE countries' historical trade partners.\nConsequently, these findings show that CEE countries' policymakers are\ninterested in encouraging the outward FDI toward their neighbour countries in\norder to increase the commercial integration.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2016 09:02:37 GMT"}], "update_date": "2016-09-09", "authors_parsed": [["Albulescu", "Claudiu Tiberiu", "", "UPT"], ["Goyeau", "Daniel", "", "CRIEF"]]}, {"id": "1609.04629", "submitter": "S Levine", "authors": "Sheen S. Levine and Edward J. Zajac", "title": "Institutionalization in Efficient Markets: The Case of Price Bubbles", "comments": "Academy of Management Best Paper Proceedings (2008)", "journal-ref": null, "doi": "10.5465/AMBPP.2008.33649949", "report-no": null, "categories": "q-fin.GN cs.SI nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We seek to deepen understanding of the micro-foundations of\ninstitutionalization while contributing to a sociological theory of markets by\ninvestigating the puzzle of price bubbles in financial markets. We find that\nsuch markets, despite textbook conditions of high efficiency -- perfect\ninformation, atomistic agents, no uncertainty -- quickly develop patterns\nconsistent with institutionalization processes.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2016 14:22:43 GMT"}], "update_date": "2016-09-16", "authors_parsed": [["Levine", "Sheen S.", ""], ["Zajac", "Edward J.", ""]]}, {"id": "1609.04944", "submitter": "Matus Medo", "authors": "Alan Roncoroni, Matus Medo", "title": "Spatial firm competition in two dimensions with linear transportation\n  costs: simulations and analytical results", "comments": "7 pages, 4 figures", "journal-ref": "European Physical Journal B 89, 270 (2016)", "doi": "10.1140/epjb/e2016-70148-9", "report-no": null, "categories": "q-fin.TR physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Models of spatial firm competition assume that customers are distributed in\nspace and transportation costs are associated with their purchases of products\nfrom a small number of firms that are also placed at definite locations. It has\nbeen long known that the competition equilibrium is not guaranteed to exist if\nthe most straightforward linear transportation costs are assumed. We show by\nsimulations and also analytically that if periodic boundary conditions in two\ndimensions are assumed, the equilibrium exists for a pair of firms at any\ndistance. When a larger number of firms is considered, we find that their total\nequilibrium profit is inversely proportional to the square root of the number\nof firms. We end with a numerical investigation of the system's behavior for a\ngeneral transportation cost exponent.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2016 08:22:43 GMT"}], "update_date": "2017-02-22", "authors_parsed": [["Roncoroni", "Alan", ""], ["Medo", "Matus", ""]]}, {"id": "1609.05055", "submitter": "Alexander Smirnov", "authors": "Alexander Smirnov", "title": "A Simple Model of Credit Expansion", "comments": "45 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The proposed model is aimed to reveal important patterns in the behavior of a\nsimplified financial system. The patterns could be detected as regular cycles\nconsisting of debt bubbles and crises. Financial cycles have a well defined\nstructure and form periodic sequences along the axis of credit expansion while\nretaining stochastic nature in terms of time.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2016 19:33:26 GMT"}], "update_date": "2016-09-19", "authors_parsed": [["Smirnov", "Alexander", ""]]}, {"id": "1609.05056", "submitter": "Henry Penikas", "authors": "Henry Penikas", "title": "Copula-Based Univariate Time Series Structural Shift Identification Test", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An approach is proposed to determine structural shift in time-series assuming\nnon-linear dependence of lagged values of dependent variable. Copulas are used\nto model non-linear dependence of time series components.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2016 19:10:01 GMT"}], "update_date": "2016-09-19", "authors_parsed": [["Penikas", "Henry", ""]]}, {"id": "1609.07051", "submitter": "Matthias Raddant", "authors": "Matthias Raddant and Friedrich Wagner", "title": "Multivariate Garch with dynamic beta", "comments": "revised version. M. The European Journal of Finance (2021)", "journal-ref": null, "doi": "10.1080/1351847X.2021.1882523", "report-no": "Kiel Working Paper 1949", "categories": "q-fin.GN q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a solution for the problems related to the application of\nmultivariate GARCH models to markets with a large number of stocks by\nrestricting the form of the conditional covariance matrix. The model is a\nfactor model and uses only six free GARCH parameters. One factor can be\ninterpreted as the market component, the remaining factors are equal. This\nallow the analytical calculation of the inverse covariance matrix. The\ntime-dependence of the factors enables the determination of dynamical beta\ncoefficients. We compare the results from our model with the results of other\nGARCH models for the daily returns from the S\\&P500 market and find that they\nare competitive. As applications we use the daily values of beta coefficients\nto confirm a transition of the market in 2006. Furthermore we discuss the\nrelationship of our model with the leverage effect.\n", "versions": [{"version": "v1", "created": "Thu, 22 Sep 2016 16:22:28 GMT"}, {"version": "v2", "created": "Thu, 16 Feb 2017 17:29:02 GMT"}, {"version": "v3", "created": "Fri, 16 Feb 2018 10:52:37 GMT"}, {"version": "v4", "created": "Thu, 25 Apr 2019 16:28:03 GMT"}, {"version": "v5", "created": "Wed, 7 Aug 2019 12:37:14 GMT"}, {"version": "v6", "created": "Fri, 29 Nov 2019 14:11:48 GMT"}], "update_date": "2021-04-22", "authors_parsed": [["Raddant", "Matthias", ""], ["Wagner", "Friedrich", ""]]}, {"id": "1609.08520", "submitter": "Nhien-An Le-Khac", "authors": "Fan Cai, Nhien-An Le-Khac, Tahar Kechadi", "title": "Clustering Approaches for Financial Data Analysis: a Survey", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, financial data analysis is becoming increasingly important in the\nbusiness market. As companies collect more and more data from daily operations,\nthey expect to extract useful knowledge from existing collected data to help\nmake reasonable decisions for new customer requests, e.g. user credit category,\nconfidence of expected return, etc. Banking and financial institutes have\napplied different data mining techniques to enhance their business performance.\nAmong these techniques, clustering has been considered as a significant method\nto capture the natural structure of data. However, there are not many studies\non clustering approaches for financial data analysis. In this paper, we\nevaluate different clustering algorithms for analysing different financial\ndatasets varied from time series to transactions. We also discuss the\nadvantages and disadvantages of each method to enhance the understanding of\ninner structure of financial datasets as well as the capability of each\nclustering method in this context.\n", "versions": [{"version": "v1", "created": "Sun, 4 Sep 2016 21:11:15 GMT"}], "update_date": "2016-09-28", "authors_parsed": [["Cai", "Fan", ""], ["Le-Khac", "Nhien-An", ""], ["Kechadi", "Tahar", ""]]}, {"id": "1609.08978", "submitter": "Bertram D\\\"uring", "authors": "Bertram D\\\"uring, Nicos Georgiou, Enrico Scalas", "title": "A stylized model for wealth distribution", "comments": "16 pages, this version corrects typos and an error while calculating\n  the invariant distribution of the discrete space-time chain, and the proof is\n  simplified", "journal-ref": "Economic Foundations for Social Complexity Science, Y.Aruka, A.\n  Kirman (eds.), pp. 135-157, Evolutionary Economics and Social Complexity\n  Science 9, Springer, Singapore, 2017", "doi": "10.1007/978-981-10-5705-2_7", "report-no": null, "categories": "math.PR physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recent book by T. Piketty (Capital in the Twenty-First Century) promoted\nthe important issue of wealth inequality. In the last twenty years, physicists\nand mathematicians developed models to derive the wealth distribution using\ndiscrete and continuous stochastic processes (random exchange models) as well\nas related Boltzmann-type kinetic equations. In this literature, the usual\nconcept of equilibrium in Economics is either replaced or completed by\nstatistical equilibrium.\n  In order to illustrate this activity with a concrete example, we present a\nstylised random exchange model for the distribution of wealth. We first discuss\na fully discrete version (a Markov chain with finite state space). We then\nstudy its discrete-time continuous-state-space version and we prove the\nexistence of the equilibrium distribution. Finally, we discuss the connection\nof these models with Boltzmann-like kinetic equations for the marginal\ndistribution of wealth. This paper shows in practice how it is possible to\nstart from a finitary description and connect it to continuous models following\nBoltzmann's original research program.\n", "versions": [{"version": "v1", "created": "Wed, 28 Sep 2016 15:57:04 GMT"}, {"version": "v2", "created": "Fri, 16 Jul 2021 09:14:17 GMT"}], "update_date": "2021-07-19", "authors_parsed": [["Düring", "Bertram", ""], ["Georgiou", "Nicos", ""], ["Scalas", "Enrico", ""]]}, {"id": "1609.09571", "submitter": "Gaurav Paruthi", "authors": "Gaurav Paruthi (University of Michigan), Enrique Frias-Martinez\n  (Telefonica Research), Vanessa Frias-Martinez (University of Maryland)", "title": "The Role of Rating and Loan Characteristics in Online Microfunding\n  Behaviors", "comments": "Presented at the Data For Good Exchange 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an in-depth study of lending behaviors in Kiva using a mix of\nquantitative and large-scale data mining techniques. Kiva is a non-profit\norganization that offers an online platform to connect lenders with borrowers.\nTheir site, kiva.org, allows citizens to microlend small amounts of money to\nentrepreneurs (borrowers) from different countries. The borrowers are always\naffiliated with a Field Partner (FP) which can be a microfinance institution\n(MFI) or other type of local organization that has partnered with Kiva. Field\npartners give loans to selected businesses based on their local knowledge\nregarding the country, the business sector including agriculture, health or\nmanufacture among others, and the borrower.Our objective is to understand the\nrelationship between lending activity and various features offered by the\nonline platform. Specifically, we focus on two research questions: (i) the role\nthat MFI ratings play in driving lending activity and (ii) the role that\nvarious loan features have in the lending behavior. The first question analyzes\nwhether there exists a relationship between the MFI ratings - that lenders can\nexplore online - and their lending volumes. The second research question\nattempts to understand if certain loan features - available online at Kiva -\nsuch as the type of small business, the gender of the borrower, or the loan's\ncountry information might affect the way lenders lend.\n", "versions": [{"version": "v1", "created": "Fri, 30 Sep 2016 02:37:47 GMT"}], "update_date": "2016-10-03", "authors_parsed": [["Paruthi", "Gaurav", "", "University of Michigan"], ["Frias-Martinez", "Enrique", "", "Telefonica Research"], ["Frias-Martinez", "Vanessa", "", "University of Maryland"]]}, {"id": "1609.09601", "submitter": "Giancarlo Salirrosas Mart\\'inez", "authors": "Giancarlo Salirrosas Mart\\'inez", "title": "Biased Roulette Wheel: A Quantitative Trading Strategy Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this research paper it is to present a new approach in the\nframework of a biased roulette wheel. It is used the approach of a quantitative\ntrading strategy, commonly used in quantitative finance, in order to assess the\nprofitability of the strategy in the short term. The tools of backtesting and\nwalk-forward optimization were used to achieve such task. The data has been\ngenerated from a real European roulette wheel from an on-line casino based in\nRiga, Latvia. It has been recorded 10,980 spins and sent to the computer\nthrough a voice-to-text software for further numerical analysis in R. It has\nbeen observed that the probabilities of occurrence of the numbers at the\nroulette wheel follows an Ornstein-Uhlenbeck process. Moreover, it is shown\nthat a flat betting system against Kelly Criterion was more profitable in the\nshort term.\n", "versions": [{"version": "v1", "created": "Fri, 30 Sep 2016 05:39:05 GMT"}], "update_date": "2016-10-03", "authors_parsed": [["Martínez", "Giancarlo Salirrosas", ""]]}]