[{"id": "1706.00203", "submitter": "Abhijit Chakraborty", "authors": "Abhijit Chakraborty, Hazem Krichene, Hiroyasu Inoue, Yoshi Fujiwara", "title": "Characterization of the community structure in a large-scale production\n  network in Japan", "comments": "12 pages, 8 figures", "journal-ref": "Physica A: Statistical Mechanics and its Applications Volume 513,\n  1 January 2019, Pages 210-221", "doi": "10.1016/j.physa.2018.08.175", "report-no": null, "categories": "physics.soc-ph physics.data-an q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inter-firm organizations, which play a driving role in the economy of a\ncountry, can be represented in the form of a customer-supplier network. Such a\nnetwork exhibits a heavy-tailed degree distribution, disassortative mixing and\na prominent community structure. We analyze a large-scale data set of\ncustomer-supplier relationships containing data from one million Japanese\nfirms. Using a directed network framework, we show that the production network\nexhibits the characteristics listed above. We conduct detailed investigations\nto characterize the communities in the network. The topology within smaller\ncommunities is found to be very close to a tree-like structure but becomes\ndenser as the community size increases. A large fraction (~40%) of firms with\nrelatively small in- or out-degrees have customers or suppliers solely from\nwithin their own communities, indicating interactions of a highly local nature.\nThe interaction strengths between communities as measured by the\ninter-community link weights follow a highly heterogeneous distribution. We\nfurther present the statistically significant over-expressions of different\nprefectures and sectors within different communities.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jun 2017 08:27:39 GMT"}, {"version": "v2", "created": "Tue, 18 Sep 2018 07:24:25 GMT"}], "update_date": "2018-09-19", "authors_parsed": [["Chakraborty", "Abhijit", ""], ["Krichene", "Hazem", ""], ["Inoue", "Hiroyasu", ""], ["Fujiwara", "Yoshi", ""]]}, {"id": "1706.00330", "submitter": "Laurent Pagnier", "authors": "Laurent Pagnier and Philippe Jacquod", "title": "How fast can one overcome the paradox of the energy transition? A\n  physico-economic model for the European power grid", "comments": "13 pages, 11 figures and 2 tables", "journal-ref": "Energy 157, 550-560 (2018)", "doi": "10.1016/j.energy.2018.05.185", "report-no": null, "categories": "physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paradox of the energy transition is that the low marginal costs of new\nrenewable energy sources (RES) drag electricity prices down and discourage\ninvestments in flexible productions that are needed to compensate for the lack\nof dispatchability of the new RES. The energy transition thus discourages the\ninvestments that are required for its own harmonious expansion. To investigate\nhow this paradox can be overcome, we argue that, under certain assumptions,\nfuture electricity prices are rather accurately modeled from the residual load\nobtained by subtracting non-flexible productions from the load. Armed with the\nresulting economic indicator, we investigate future revenues for European power\nplants with various degree of flexibility. We find that, if neither carbon\ntaxes nor fuel prices change, flexible productions would be financially\nrewarded better and sooner if the energy transition proceeds faster but at more\nor less constant total production, i.e. by reducing the production of thermal\npower plants at the same rate as the RES production increases. Less flexible\nproductions, on the other hand, would see their revenue grow more moderately.\nOur results indicate that a faster energy transition with a quicker withdrawal\nof thermal power plants would reward flexible productions faster.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jun 2017 14:55:54 GMT"}, {"version": "v2", "created": "Fri, 15 Jun 2018 09:06:08 GMT"}], "update_date": "2018-06-18", "authors_parsed": [["Pagnier", "Laurent", ""], ["Jacquod", "Philippe", ""]]}, {"id": "1706.01666", "submitter": "Laurent Pagnier", "authors": "Laurent Pagnier and Philippe Jacquod", "title": "A predictive pan-European economic and production dispatch model for the\n  energy transition in the electricity sector", "comments": "6 pages, 8 figures", "journal-ref": "2017 IEEE Manchester PowerTech", "doi": "10.1109/PTC.2017.7980982", "report-no": null, "categories": "physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The energy transition is well underway in most European countries. It has a\ngrowing impact on electric power systems as it dramatically modifies the way\nelectricity is produced. To ensure a safe and smooth transition towards a\npan-European electricity production dominated by renewable sources, it is of\nparamount importance to anticipate how production dispatches will evolve, to\nunderstand how increased fluctuations in power generations can be absorbed at\nthe pan-European level and to evaluate where the resulting changes in power\nflows will require significant grid upgrades. To address these issues, we\nconstruct an aggregated model of the pan-European transmission network which we\ncouple to an optimized, few-parameter dispatch algorithm to obtain time- and\ngeographically-resolved production profiles. We demonstrate the validity of our\ndispatch algorithm by reproducing historical production time series for all\npower productions in fifteen different European countries. Having calibrated\nour model in this way, we investigate future production profiles at later\nstages of the energy transition - determined by planned future production\ncapacities - and the resulting interregional power flows. We find that large\npower fluctuations from increasing penetrations of renewable sources can be\nabsorbed at the pan-European level via significantly increased electricity\nexchanges between different countries. We identify where these increased\nexchanges will require additional power transfer capacities. We finally\nintroduce a physically-based economic indicator which allows to predict future\nfinancial conditions in the electricity market. We anticipate new economic\nopportunities for dam hydroelectricity and pumped-storage plants.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 09:18:18 GMT"}], "update_date": "2018-10-17", "authors_parsed": [["Pagnier", "Laurent", ""], ["Jacquod", "Philippe", ""]]}, {"id": "1706.02795", "submitter": "Thai Pham", "authors": "Thai T. Pham and Yuanyuan Shen", "title": "A Deep Causal Inference Approach to Measuring the Effects of Forming\n  Group Loans in Online Non-profit Microfinance Platform", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Kiva is an online non-profit crowdsouring microfinance platform that raises\nfunds for the poor in the third world. The borrowers on Kiva are small business\nowners and individuals in urgent need of money. To raise funds as fast as\npossible, they have the option to form groups and post loan requests in the\nname of their groups. While it is generally believed that group loans pose less\nrisk for investors than individual loans do, we study whether this is the case\nin a philanthropic online marketplace. In particular, we measure the effect of\ngroup loans on funding time while controlling for the loan sizes and other\nfactors. Because loan descriptions (in the form of texts) play an important\nrole in lenders' decision process on Kiva, we make use of this information\nthrough deep learning in natural language processing. In this aspect, this is\nthe first paper that uses one of the most advanced deep learning techniques to\ndeal with unstructured data in a way that can take advantage of its superior\nprediction power to answer causal questions. We find that on average, forming\ngroup loans speeds up the funding time by about 3.3 days.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jun 2017 23:43:12 GMT"}], "update_date": "2017-06-12", "authors_parsed": [["Pham", "Thai T.", ""], ["Shen", "Yuanyuan", ""]]}, {"id": "1706.02936", "submitter": "Thibaut Mastrolia", "authors": "Thibaut Mastrolia (CMAP), Zhenjie Ren (CEREMADE)", "title": "Principal-Agent Problem with Common Agency without Communication", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC math.PR q-fin.CP q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a problem of contract theory in which several\nPrincipals hire a common Agent and we study the model in the continuous time\nsetting. We show that optimal contracts should satisfy some equilibrium\nconditions and we reduce the optimisation problem of the Principals to a system\nof coupled Hamilton-Jacobi-Bellman (HJB) equations. We provide conditions\nensuring that for risk-neutral Principals, the system of coupled HJB equations\nadmits a solution. Further, we apply our study in a more specific\nlinear-quadratic model where two interacting Principals hire one common Agent.\nIn this continuous time model, we extend the result of Bernheim and Whinston\n(1986) in which the authors compare the optimal effort of the Agent in a\nnon-cooperative Principals model and that in the aggregate model, by showing\nthat these two optimisations coincide only in the first best case. We also\nstudy the sensibility of the optimal effort and the optimal remunerations with\nrespect to appetence parameters and the correlation between the projects.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jun 2017 13:03:58 GMT"}, {"version": "v2", "created": "Fri, 12 Jan 2018 16:08:31 GMT"}], "update_date": "2018-01-15", "authors_parsed": [["Mastrolia", "Thibaut", "", "CMAP"], ["Ren", "Zhenjie", "", "CEREMADE"]]}, {"id": "1706.02985", "submitter": "Ratthachat Chatpatanasiri", "authors": "Haizhen Wang, Ratthachat Chatpatanasiri, Pairote Sattayatham", "title": "Stock Trading Using PE ratio: A Dynamic Bayesian Network Modeling on\n  Behavioral Finance and Fundamental Investment", "comments": "34 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.AI cs.LG q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  On a daily investment decision in a security market, the price earnings (PE)\nratio is one of the most widely applied methods being used as a firm valuation\ntool by investment experts. Unfortunately, recent academic developments in\nfinancial econometrics and machine learning rarely look at this tool. In\npractice, fundamental PE ratios are often estimated only by subjective expert\nopinions. The purpose of this research is to formalize a process of fundamental\nPE estimation by employing advanced dynamic Bayesian network (DBN) methodology.\nThe estimated PE ratio from our model can be used either as a information\nsupport for an expert to make investment decisions, or as an automatic trading\nsystem illustrated in experiments. Forward-backward inference and EM parameter\nestimation algorithms are derived with respect to the proposed DBN structure.\nUnlike existing works in literatures, the economic interpretation of our DBN\nmodel is well-justified by behavioral finance evidences of volatility. A simple\nbut practical trading strategy is invented based on the result of Bayesian\ninference. Extensive experiments show that our trading strategy equipped with\nthe inferenced PE ratios consistently outperforms standard investment\nbenchmarks.\n", "versions": [{"version": "v1", "created": "Thu, 25 May 2017 13:24:22 GMT"}], "update_date": "2017-06-12", "authors_parsed": [["Wang", "Haizhen", ""], ["Chatpatanasiri", "Ratthachat", ""], ["Sattayatham", "Pairote", ""]]}, {"id": "1706.04210", "submitter": "Zurab Kakushadze", "authors": "Zura Kakushadze and Willie Yu", "title": "Open Source Fundamental Industry Classification", "comments": "68 pages; leftover Word \"track-changes\" highlights removed, no\n  changes in the text", "journal-ref": "Data 2(2) (2017) 20", "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide complete source code for building a fundamental industry\nclassification based on publically available and freely downloadable data. We\ncompare various fundamental industry classifications by running a horserace of\nshort-horizon trading signals (alphas) utilizing open source heterotic risk\nmodels (https://ssrn.com/abstract=2600798) built using such industry\nclassifications. Our source code includes various stand-alone and portable\nmodules, e.g., for downloading/parsing web data, etc.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jun 2017 18:10:49 GMT"}, {"version": "v2", "created": "Sat, 17 Jun 2017 15:21:53 GMT"}, {"version": "v3", "created": "Thu, 30 Nov 2017 18:43:01 GMT"}, {"version": "v4", "created": "Fri, 22 Dec 2017 17:02:31 GMT"}], "update_date": "2017-12-25", "authors_parsed": [["Kakushadze", "Zura", ""], ["Yu", "Willie", ""]]}, {"id": "1706.04229", "submitter": "David Hunter", "authors": "David Scott Hunter, Ajay Saini, Tauhid Zaman", "title": "Picking Winners: A Data Driven Approach to Evaluating the Quality of\n  Startup Companies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of evaluating the quality of startup companies. This\ncan be quite challenging due to the rarity of successful startup companies and\nthe complexity of factors which impact such success. In this work we collect\ndata on tens of thousands of startup companies, their performance, the\nbackgrounds of their founders, and their investors. We develop a novel model\nfor the success of a startup company based on the first passage time of a\nBrownian motion. The drift and diffusion of the Brownian motion associated with\na startup company are a function of features based its sector, founders, and\ninitial investors. All features are calculated using our massive dataset. Using\na Bayesian approach, we are able to obtain quantitative insights about the\nfeatures of successful startup companies from our model.\n  To test the performance of our model, we use it to build a portfolio of\ncompanies where the goal is to maximize the probability of having at least one\ncompany achieve an exit (IPO or acquisition), which we refer to as winning.\nThis $\\textit{picking winners}$ framework is very general and can be used to\nmodel many problems with low probability, high reward outcomes, such as\npharmaceutical companies choosing drugs to develop or studios selecting movies\nto produce. We frame the construction of a picking winners portfolio as a\ncombinatorial optimization problem and show that a greedy solution has strong\nperformance guarantees. We apply the picking winners framework to the problem\nof choosing a portfolio of startup companies. Using our model for the exit\nprobabilities, we are able to construct out of sample portfolios which achieve\nexit rates as high as 60%, which is nearly double that of top venture capital\nfirms.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jun 2017 19:15:02 GMT"}, {"version": "v2", "created": "Sun, 8 Jul 2018 19:50:27 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Hunter", "David Scott", ""], ["Saini", "Ajay", ""], ["Zaman", "Tauhid", ""]]}, {"id": "1706.04518", "submitter": "Ivan Breslavsky", "authors": "Ivan D. Breslavsky", "title": "Effect of Intellectual Property Policy on the Speed of Technological\n  Advancement", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the agent-based modeling is employed to model the effect of\nintellectual property policy at the speed of technological advancement. Every\nagent has inborn preferences towards investing their capital into independent\ntechnological development, innovation appropriation, and production. The\nrelative cost of appropriation compared to independent development is chosen as\na measure of strictness of intellectual property protection. We vary this\nparameter and look at the performance of agents with different preferences and\noverall technological progress. In general, it is found that in the specific\nsetting considered with stronger intellectual property protection leads to\nfaster progress.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jun 2017 14:46:52 GMT"}], "update_date": "2017-06-15", "authors_parsed": [["Breslavsky", "Ivan D.", ""]]}, {"id": "1706.05877", "submitter": "Tyler Abbot", "authors": "Tyler Abbot", "title": "General Equilibrium Under Convex Portfolio Constraints and Heterogeneous\n  Risk Preferences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper characterizes the equilibrium in a continuous time financial\nmarket populated by heterogeneous agents who differ in their rate of relative\nrisk aversion and face convex portfolio constraints. The model is studied in an\napplication to margin constraints and found to match real world observations\nabout financial variables and leverage cycles. It is shown how margin\nconstraints increase the market price of risk and decrease the interest rate by\nforcing more risk averse agents to hold more risky assets, producing a higher\nequity risk premium. In addition, heterogeneity and margin constraints are\nshown to produce both pro- and counter-cyclical leverage cycles. Beyond two\ntypes, it is shown how constraints can cascade and how leverage can exhibit\nhighly non-linear dynamics. Finally, empirical results are given, documenting a\nnovel stylized fact which is predicted by the model, namely that the leverage\ncycle is both pro- and counter-cyclical.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jun 2017 11:00:40 GMT"}, {"version": "v2", "created": "Thu, 16 Nov 2017 19:45:54 GMT"}, {"version": "v3", "created": "Mon, 18 Jun 2018 09:51:05 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Abbot", "Tyler", ""]]}, {"id": "1706.05912", "submitter": "Emiliano Diaz", "authors": "Emiliano Diaz", "title": "An\\'alisis de cointegraci\\'on con una aplicaci\\'on al mercado de deuda\n  en Estados Unidos, Canad\\'a y M\\'exico", "comments": "thesis, in Spanish, Instituto Technol\\'ogico aut\\'onomo de M\\'exico,\n  2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Certain theoretical aspects of vector autoregression (VAR) as tools to model\neconomic time series are revised, in particular their capacity to include both\nshort term and long term information. The VAR model, in its error correction\nform, is derived and the permanent-transitory decomposition of factors proposed\nby Gonzalo and Granger (1995) studied. An introductory exposition of estimation\ntheory for reduced rank models, necessary to estimate the error correction\nmodel, is given. Cointegration analysis using the VAR model is carried out for\ngovernment bond interest rates (short, medium and long term) of the United\nStates, Mexico and Canada, with the objective of finding the long-term common\nfactors that drive the system. The error correction model of this system is\nestimated using Johansen's method. Using this estimation the\npermanent-transitory decomposition of the system is calculated. Hypothesis\ntests are carried out on permanent factors to determine which of the nine rates\nstudied drive the system.\n", "versions": [{"version": "v1", "created": "Mon, 3 Apr 2017 23:11:20 GMT"}], "update_date": "2017-06-20", "authors_parsed": [["Diaz", "Emiliano", ""]]}, {"id": "1706.07760", "submitter": "Irina Georgescu", "authors": "Irina Georgescu, Adolfo Crist\\'obal Campoamor, Ana Maria Lucia\n  Casademunt", "title": "A Possibilistic and Probabilistic Approach to Precautionary Saving", "comments": "Panoeconomicus, 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes two mixed models to study a consumer's optimal saving in\nthe presence of two types of risk.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jun 2017 15:27:16 GMT"}], "update_date": "2017-06-26", "authors_parsed": [["Georgescu", "Irina", ""], ["Campoamor", "Adolfo Cristóbal", ""], ["Casademunt", "Ana Maria Lucia", ""]]}]