[{"id": "1708.00645", "submitter": "Aurelien Hazan", "authors": "Aur\\'elien Hazan (UPEC UP12)", "title": "Stock-flow consistent macroeconomic model with nonuniform distributional\n  constraint", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report on results concerning a partially aggregated Stock Flow Consistent\n(SFC) macroeconomic model in the stationary state where the sectors of banks\nand firms are aggregated, the sector of households is dis-aggregated, and the\nprobability density function (pdf) of the wealth of households is exogenous,\nconstrained by econometric data. It is shown that the equality part of the\nconstraint can be reduced to a single constant-sum equation, which relates this\nproblem to the study of continuous mass transport problems, and to the sum of\niid random variables. Existing results can thus be applied, and provide\nmarginal probabilities, and the location of the critical point before\ncondensation occurs. Various numerical experiments are performed using Monte\nCarlo sampling of the hit-and-run type, using wealth and income data for\nFrance.\n", "versions": [{"version": "v1", "created": "Wed, 2 Aug 2017 08:32:35 GMT"}], "update_date": "2017-08-03", "authors_parsed": [["Hazan", "Aurélien", "", "UPEC UP12"]]}, {"id": "1708.02605", "submitter": "Rubina Zadourian", "authors": "Rubina Zadourian and Andreas Kl\\\"umper", "title": "Exact probability distribution function for the volatility of cumulative\n  production", "comments": "6 pages, 6 figures", "journal-ref": null, "doi": "10.1016/j.physa.2017.12.003", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the volatility and its probability distribution\nfunction for the cumulative production based on the experience curve\nhypothesis. This work presents a generalization of the study of volatility in\n[1], which addressed the effects of normally distributed noise in the\nproduction process. Due to its wide applicability in industrial and\ntechnological activities we present here the mathematical foundation for an\narbitrary distribution function of the process, which we expect will pave the\nfuture research on production and market strategy.\n", "versions": [{"version": "v1", "created": "Tue, 1 Aug 2017 12:52:44 GMT"}], "update_date": "2018-01-17", "authors_parsed": [["Zadourian", "Rubina", ""], ["Klümper", "Andreas", ""]]}, {"id": "1708.02625", "submitter": "Jethro Browell", "authors": "Jethro Browell", "title": "Risk Constrained Trading Strategies for Stochastic Generation with a\n  Single-Price Balancing Market", "comments": null, "journal-ref": null, "doi": "10.3390/en11061345", "report-no": null, "categories": "q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to the limited predictability of wind power and other stochastic\ngeneration, trading this energy in competitive electricity markets is\nchallenging. This paper derives revenue-maximising and risk-constrained\nstrategies for stochastic generators participating in electricity markets with\na single-price balancing mechanism. Starting from the optimal---and\nimpractical---strategy of offering zero or nominal power, which exposes the\nparticipant to potentially large imbalance costs, we develop a number of\nstrategies that control risk by hedging against penalising balancing prices in\nfavour of rewarding ones. Trading strategies are formulated in a probabilistic\nframework in order to address asymmetry in balancing prices. The large-scale\ncommunication of system information characteristic of modern power systems is\nutilised to inputs for electricity price forecasts and probabilistic system\nlength forecasts. A case study using data from the GB market in the UK is\npresented and the ability of the proposed strategies to increase revenue and\nreduce risk is demonstrated and analysed.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jun 2017 13:14:20 GMT"}], "update_date": "2018-05-31", "authors_parsed": [["Browell", "Jethro", ""]]}, {"id": "1708.03533", "submitter": "Luciano Celi PhD", "authors": "Luciano Celi, Claudio Della Volpe, Luca Pardi, Stefano Siboni", "title": "Oil economy phase plot: a physical analogy", "comments": "8 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  A phase plot of the oil economy is built using the literature data of world\noil production, price, and EROEI (Energy Returned on Energy Invested). An\nanalogy between the oil economy and the Benard convection is proposed; some\nmethods of interpretation and forecast of the system behavior are also shown\nbased on \"phase portrait\" using as main variables the price, production and\nEROEI values. A scenery is proposed on this basis.\n", "versions": [{"version": "v1", "created": "Fri, 11 Aug 2017 13:18:00 GMT"}, {"version": "v2", "created": "Sat, 2 May 2020 09:08:53 GMT"}], "update_date": "2020-05-05", "authors_parsed": [["Celi", "Luciano", ""], ["Della Volpe", "Claudio", ""], ["Pardi", "Luca", ""], ["Siboni", "Stefano", ""]]}, {"id": "1708.04532", "submitter": "Aurelio Fernandez Bariviera", "authors": "Aurelio F. Bariviera, Mar\\'ia Jos\\'e Basgall, Waldo Hasperu\\'e,\n  Marcelo Naiouf", "title": "Some stylized facts of the Bitcoin market", "comments": "17 pages, 6 figures. arXiv admin note: text overlap with\n  arXiv:1605.06700", "journal-ref": "Physica A Statistical Mechanics and Its Applications, Vol. 484,\n  pp. 82-90 (2017)", "doi": "10.1016/j.physa.2017.04.159", "report-no": null, "categories": "q-fin.ST q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years a new type of tradable assets appeared, generically known as\ncryptocurrencies. Among them, the most widespread is Bitcoin. Given its\nnovelty, this paper investigates some statistical properties of the Bitcoin\nmarket. This study compares Bitcoin and standard currencies dynamics and\nfocuses on the analysis of returns at different time scales. We test the\npresence of long memory in return time series from 2011 to 2017, using\ntransaction data from one Bitcoin platform. We compute the Hurst exponent by\nmeans of the Detrended Fluctuation Analysis method, using a sliding window in\norder to measure long range dependence. We detect that Hurst exponents changes\nsignificantly during the first years of existence of Bitcoin, tending to\nstabilize in recent times. Additionally, multiscale analysis shows a similar\nbehavior of the Hurst exponent, implying a self-similar process.\n", "versions": [{"version": "v1", "created": "Sat, 12 Aug 2017 14:52:17 GMT"}], "update_date": "2017-08-16", "authors_parsed": [["Bariviera", "Aurelio F.", ""], ["Basgall", "María José", ""], ["Hasperué", "Waldo", ""], ["Naiouf", "Marcelo", ""]]}, {"id": "1708.04955", "submitter": "Kazuki Ikeda", "authors": "Kazuki Ikeda", "title": "qBitcoin: A Peer-to-Peer Quantum Cash System", "comments": "11 pages, 2 figures", "journal-ref": "Proceedings of the 2018 Computing Conference", "doi": "10.1007/978-3-030-01174-1_58", "report-no": "OU-HET-942", "categories": "q-fin.GN cs.CR quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A decentralized online quantum cash system, called qBitcoin, is given. We\ndesign the system which has great benefits of quantization in the following\nsense. Firstly, quantum teleportation technology is used for coin transaction,\nwhich prevents from the owner of the coin keeping the original coin data even\nafter sending the coin to another. This was a main problem in a classical\ncircuit and a blockchain was introduced to solve this issue. In qBitcoin, the\ndouble-spending problem never happens and its security is guaranteed\ntheoretically by virtue of quantum information theory. Making a block is time\nconsuming and the system of qBitcoin is based on a quantum chain, instead of\nblocks. Therefore a payment can be completed much faster than Bitcoin. Moreover\nwe employ quantum digital signature so that it naturally inherits properties of\npeer-to-peer (P2P) cash system as originally proposed in Bitcoin.\n", "versions": [{"version": "v1", "created": "Tue, 15 Aug 2017 09:52:31 GMT"}, {"version": "v2", "created": "Sun, 19 Nov 2017 13:09:01 GMT"}], "update_date": "2020-09-22", "authors_parsed": [["Ikeda", "Kazuki", ""]]}, {"id": "1708.06792", "submitter": "Marco Due\\~nas", "authors": "Mercedes Campi, Marco Due\\~nas", "title": "Volatility and Economic Growth in the Twentieth Century", "comments": "25 pages, 6 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The twentieth century was a period of outstanding economic growth together\nwith an unequal income distribution. This paper analyses the international\ndistribution of growth rates and its dynamics during the twentieth century. We\nshow that the whole century is characterized by a high heterogeneity in the\ndistribution of GDP per capita growth rates, which is reflected in different\nshapes and a persistent asymmetry of the distributions at the regional level\nand for countries of different development levels. We find that in the context\nof the global conflicts that characterized the first half of the twentieth\ncentury and involved mainly large economies, the well-known negative scale\nrelation between volatility and size of countries is not significant. After the\nyear 1956, a redistribution of volatility leads to a significant negative\nscale-relation, which has been recently considered as a robust feature of the\nevolution of economic organizations. Our results contribute with more empirical\nfacts that call the attention to traditional macroeconomic theories to better\nexplain the underlying complexity of the growth process and sheds light on its\nhistorical evolution.\n", "versions": [{"version": "v1", "created": "Tue, 22 Aug 2017 19:31:00 GMT"}], "update_date": "2017-08-24", "authors_parsed": [["Campi", "Mercedes", ""], ["Dueñas", "Marco", ""]]}, {"id": "1708.08594", "submitter": "Teruyoshi Kobayashi", "authors": "Teruyoshi Kobayashi, Taro Takaguchi", "title": "Identifying relationship lending in the interbank market: A network\n  approach", "comments": "Main text: 39 pages, 15 figures. SI: 4 pages, 3 figures", "journal-ref": "Journal of Banking & Finance 97, 20-36, 2018", "doi": "10.1016/j.jbankfin.2018.09.018", "report-no": null, "categories": "q-fin.TR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Relationship lending is broadly interpreted as a strong partnership between a\nlender and a borrower. Nevertheless, we still lack consensus regarding how to\nquantify the strength of a lending relationship, while simple statistics such\nas the frequency and volume of loans have been used as proxies in previous\nstudies. Here, we propose statistical tests to identify relationship lending as\na significant tie between banks. Application of the proposed method to the\nItalian interbank networks reveals that the fraction of relationship lending\namong all bilateral trades has been quite stable and that the relationship\nlenders tend to impose high interest rates at the time of financial distress.\n", "versions": [{"version": "v1", "created": "Tue, 29 Aug 2017 05:38:00 GMT"}, {"version": "v2", "created": "Fri, 27 Apr 2018 02:15:50 GMT"}], "update_date": "2018-10-11", "authors_parsed": [["Kobayashi", "Teruyoshi", ""], ["Takaguchi", "Taro", ""]]}, {"id": "1708.08673", "submitter": "Ron Nielsen", "authors": "Ron W. Nielsen", "title": "Changing the Direction of the Economic and Demographic Research", "comments": "20 pages,10 figures, 11729 words", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A simple but useful method of reciprocal values is introduced, explained and\nillustrated. This method simplifies the analysis of hyperbolic distributions,\nwhich are causing serious problems in the demographic and economic research. It\nallows for a unique identification of hyperbolic distributions and for\nunravelling components of more complicated trajectories. This method is\nillustrated by a few examples. They show that fundamental postulates of the\ndemographic and economic research are contradicted by data, even by precisely\nthe same data, which are used in this research. The generally accepted\npostulates are based on the incorrect understanding of hyperbolic\ndistributions, which characterise the historical growth of population and the\nhistorical economic growth. In particular, data used, but never analysed,\nduring the formulation of the Unified Growth Theory show that this theory is\nbased on fundamentally incorrect premises and thus is fundamentally defective.\nApplication of this simple method of analysis points to new directions in the\ndemographic and economic research. It suggests simpler interpretations of the\nmechanism of growth. The concept or the evidence of the past primitive and\ndifficult living conditions, which might be perhaps described as some kind of\nstagnation, is not questioned or disputed. It is only demonstrated that\ntrajectories of the past economic growth and of the growth of population were\nnot reflecting any form of stagnation and thus that they were not shaped by\nthese primitive and difficult living conditions. The concept or evidence of an\nexplosion in technology, medicine, education and in the improved living\nconditions is not questioned or disputed. It is only demonstrated that this\npossible explosion is not reflected in the trajectories of the economic growth\nand of the growth of population.\n", "versions": [{"version": "v1", "created": "Tue, 29 Aug 2017 09:59:23 GMT"}], "update_date": "2017-08-30", "authors_parsed": [["Nielsen", "Ron W.", ""]]}]