[{"id": "1712.00001", "submitter": "Tiago Fernandes M.Sc.", "authors": "Tiago Fernandes", "title": "Some Physics Notions on Monetary Standard", "comments": "9 pages, no figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regardless of the gold-standard being considered as outdated, it provides\nvaluable signs concerning the development of novel monetary standards, better\nadjusted to the current macroeconomic environment. By using a point of view of\nclassical physics, the intent of this work is doing a review of the concept of\nmonetary standard and show that the energy matrix of an economy together with a\nnew monetary standard, based on the energy supply capacity, can play an\nessential role in the sustainable growth.\n", "versions": [{"version": "v1", "created": "Thu, 30 Nov 2017 19:12:59 GMT"}, {"version": "v2", "created": "Sun, 10 Dec 2017 21:34:56 GMT"}, {"version": "v3", "created": "Sat, 30 Dec 2017 01:41:51 GMT"}, {"version": "v4", "created": "Wed, 17 Jan 2018 17:57:44 GMT"}], "update_date": "2018-01-18", "authors_parsed": [["Fernandes", "Tiago", ""]]}, {"id": "1712.00064", "submitter": "Lily Hu", "authors": "Lily Hu and Yiling Chen", "title": "A Short-term Intervention for Long-term Fairness in the Labor Market", "comments": "10 pages", "journal-ref": null, "doi": "10.1145/3178876.3186044", "report-no": null, "categories": "cs.GT q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The persistence of racial inequality in the U.S. labor market against a\ngeneral backdrop of formal equality of opportunity is a troubling phenomenon\nthat has significant ramifications on the design of hiring policies. In this\npaper, we show that current group disparate outcomes may be immovable even when\nhiring decisions are bound by an input-output notion of \"individual fairness.\"\nInstead, we construct a dynamic reputational model of the labor market that\nillustrates the reinforcing nature of asymmetric outcomes resulting from\ngroups' divergent accesses to resources and as a result, investment choices. To\naddress these disparities, we adopt a dual labor market composed of a Temporary\nLabor Market (TLM), in which firms' hiring strategies are constrained to ensure\nstatistical parity of workers granted entry into the pipeline, and a Permanent\nLabor Market (PLM), in which firms hire top performers as desired. Individual\nworker reputations produce externalities for their group; the corresponding\nfeedback loop raises the collective reputation of the initially disadvantaged\ngroup via a TLM fairness intervention that need not be permanent. We show that\nsuch a restriction on hiring practices induces an equilibrium that, under\nparticular market conditions, Pareto-dominates those arising from strategies\nthat statistically discriminate or employ a \"group-blind\" criterion. The\nenduring nature of equilibria that are both inequitable and Pareto suboptimal\nsuggests that fairness interventions beyond procedural checks of hiring\ndecisions will be of critical importance in a world where machines play a\ngreater role in the employment process.\n", "versions": [{"version": "v1", "created": "Thu, 30 Nov 2017 20:24:30 GMT"}, {"version": "v2", "created": "Wed, 21 Feb 2018 16:33:06 GMT"}], "update_date": "2018-02-22", "authors_parsed": [["Hu", "Lily", ""], ["Chen", "Yiling", ""]]}, {"id": "1712.00130", "submitter": "Marcel Ausloos", "authors": "Marcel Ausloos", "title": "Hint of a Universal Law for the Financial Gains of Competitive Sport\n  Teams. The case of Tour de France cycle race", "comments": "7 pages, 2 figures, 13 references", "journal-ref": "Frontiers in Physics 5: 59 (Nov 2017)", "doi": "10.3389/fphy.2017.00059", "report-no": null, "categories": "q-fin.GN nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This short note is intended as a \"Letter to the Editor\" Perspective in order\nthat it serves as a contribution, in view of reaching the physics community\ncaring about rare events and scaling laws and unexpected findings, on a domain\nof wide interest: sport and money. It is apparent from the data reported and\ndiscussed below that the scarcity of such data does not allow to recommend a\ncomplex elaboration of an agent based model, - at this time. In some sense,\nthis also means that much data on sport activities is not necessarily given in\nterms of physics prone materials, but it could be, and would then attract much\nattention. Nevertheless the findings tie the data to well known scaling laws\nand physics processes. It is found that a simple scaling law describes the\ngains of teams in recent bicycle races, like the Tour de France. An analogous\ncase, ranking teams in Formula 1 races, is shown in an Appendix\n", "versions": [{"version": "v1", "created": "Thu, 30 Nov 2017 23:49:44 GMT"}], "update_date": "2017-12-04", "authors_parsed": [["Ausloos", "Marcel", ""]]}, {"id": "1712.04117", "submitter": "Jacob Ferguson", "authors": "Jacob Ferguson", "title": "The Calculus of Democratization and Development", "comments": "15 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.EM q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In accordance with \"Democracy's Effect on Development: More Questions than\nAnswers\", we seek to carry out a study in following the description in the\n'Questions for Further Study.' To that end, we studied 33 countries in the\nSub-Saharan Africa region, who all went through an election which should signal\na \"step-up\" for their democracy, one in which previously homogenous regimes\ntransfer power to an opposition party that fairly won the election. After doing\nso, liberal-democracy indicators and democracy indicators were evaluated in the\nfive years prior to and after the election took place, and over that ten-year\nperiod, we examine the data for trends. If we see positive or negative trends\nover this time horizon, we are able to conclude that it was the recent increase\nin the quality of their democracy which led to it. Having investigated examples\nof this in depth, there seem to be three main archetypes which drive the\nresults. Countries with positive results to their democracy from the election\nhave generally positive effects on their development, countries with more\n\"plateau\" like results also did well, but countries for whom the descent to\nauthoritarianism was continued by this election found more negative results.\n", "versions": [{"version": "v1", "created": "Tue, 12 Dec 2017 04:08:32 GMT"}], "update_date": "2017-12-13", "authors_parsed": [["Ferguson", "Jacob", ""]]}, {"id": "1712.06358", "submitter": "Anirban Chakraborti", "authors": "Kiran Sharma, Anamika, Anindya S. Chakrabarti, Anirban Chakraborti,\n  Sujoy Chakravarty", "title": "The Saga of KPR: Theoretical and Experimental developments", "comments": "14 pages, Submitted for publication in a special issue in Science and\n  Culture (Kolkata, India)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we present a brief narration of the origin and the overview\nof the recent developments done on the Kolkata Paise Restaurant (KPR) problem,\nwhich can serve as a prototype for a broader class of resource allocation\nproblems in the presence of a large number of competing agents, typically\nstudied using coordination and anti-coordination games. We discuss the KPR and\nits several extensions, as well as its applications in many economic and social\nphenomena. We end the article with some discussions on our ongoing experimental\nanalysis of the same problem. We demonstrate that this provides an interesting\npicture of how people analyze complex situations, and design their strategies\nor react to them.\n", "versions": [{"version": "v1", "created": "Mon, 18 Dec 2017 12:16:19 GMT"}], "update_date": "2017-12-19", "authors_parsed": [["Sharma", "Kiran", ""], ["Anamika", "", ""], ["Chakrabarti", "Anindya S.", ""], ["Chakraborti", "Anirban", ""], ["Chakravarty", "Sujoy", ""]]}, {"id": "1712.07649", "submitter": "Valerii Salov", "authors": "Valerii Salov", "title": "Trading Strategies with Position Limits", "comments": "64 pages, 17 figures, 6 tables, 123 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Whether you trade futures for yourself or a hedge fund, your strategy is\ncounted. Long and short position limits make the number of unique strategies\nfinite. Formulas of the numbers of strategies, transactions, do nothing actions\nare derived. A discrete distribution of actions, corresponding probability\nmass, cumulative distribution and characteristic functions, moments, extreme\nvalues are presented. Strategies time slice distributions are determined.\nVector properties of trading strategies are studied. Algebraic not associative,\ncommutative, initial magmas with invertible elements control trading positions\nand strategies. Maximum profit strategies, MPS, and optimal trading elements\ncan define trading patterns. Dynkin introduced the term interpreted in English\nas \"Markov time\" in 1963. Neftci applied it for the formalization of Technical\nAnalysis in 1991.\n", "versions": [{"version": "v1", "created": "Tue, 19 Dec 2017 21:26:16 GMT"}], "update_date": "2017-12-22", "authors_parsed": [["Salov", "Valerii", ""]]}, {"id": "1712.09969", "submitter": "Russell Stanley Geronimo", "authors": "Russell Stanley Q. Geronimo", "title": "De Facto Control: Applying Game Theory to the Law on Corporate\n  Nationality", "comments": null, "journal-ref": "Philippine Law Journal, Vol. 90 Issue No. 2 (2017)", "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One unexamined assumption in foreign ownership regulation is the notion that\nmajority voting rights translate to 'effective control'. This assumption is so\ndeeply entrenched in foreign investments law that possession of majority voting\nrights can determine the nationality of a corporation and its capacity to\nengage in partially nationalized economic activities. The fact, however, is\nthat minority stockholders can possess a degree of voting power higher than\nwhat their shareholding size might suggest. Voting power is not the same as\nvoting weight and is not measured simply by the proportion or number of votes a\nstockholder may cast in a stockholder meeting. This paper proposes and\ndemonstrates a method for calculating 'effective control' based on given voting\nthresholds and voting weights. It also shows instances where the 'effective\ncontrol' of a foreign minority stockholder appears to comply with foreign\nequity limitations, but has a 'real' voting power grossly beyond the allowable\nthreshold.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 18:27:09 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Geronimo", "Russell Stanley Q.", ""]]}, {"id": "1712.09978", "submitter": "Russell Stanley Geronimo", "authors": "Russell Stanley Q. Geronimo", "title": "Why Long-Term Debt Instruments Cannot Be Deposit Substitutes", "comments": null, "journal-ref": "Lexkhoj Int'l J. Crim. L. Vol. 2 Issue No. 4 (2017)", "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The definition of deposit substitutes in Philippine tax law fails to consider\nthe maturity of a debt instrument. This makes it possible for long-term bonds\nto be considered as deposit substitutes if they meet the 20-lender rule,\ntaxable at 20% final tax. However, long-term debt instruments cannot\nrealistically function as deposit substitutes even if they fall in the hands of\n20 or more lenders. First, long-term debt instruments cannot simultaneously\nreplicate the twin features of capital preservation and liquidity, which are\nintegral to the nature of a deposit substitute. Second, deposit substitutes are\nan integral part of the maturity transformation process (i.e. short-term\nborrowing for the purpose of long-term lending) in financial intermediaries,\nwhich means that they should have low borrowing cost, made possible only by\nhaving short-term maturity. To prove these propositions, this paper situates\nthe function of deposit substitutes within the context of shadow banking, where\nsaid instruments originated and are generally used. To show the incompatibility\nbetween a deposit substitute and a long-term debt instrument, the paper applies\nthe fundamental theory of bond values to 10-year zero-coupon treasury notes\ncalled 'PEACe Bonds' in Banco De Oro, et al. vs. Republic (2015 and 2016). The\npaper recommends that deposit substitutes should be limited to debt instruments\nwith maturity of not more than 1 year.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 18:39:04 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Geronimo", "Russell Stanley Q.", ""]]}, {"id": "1712.09987", "submitter": "Russell Stanley Geronimo", "authors": "Russell Stanley Q. Geronimo", "title": "How Short Sales Circumvent the Capital Gains Tax System", "comments": null, "journal-ref": "Philippine Law Journal Vol. 90 Issue No. 01 (2016)", "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Through a short sale, a person borrows a share of stock from a lender, sells\nthe borrowed share to a third person at the current price, and purchases an\nidentical share in the market at a future date and at a future price to replace\nthe borrowed share of stock. This only makes sense if the short seller\nanticipates a downward trend in share price. The short seller incurs a gain if\nshare price decreases because the cost of replacing the borrowed share falls\nbelow the selling price. The reverse is true in an ordinary sale, where a\nperson owning a share of stock incurs a loss if price decreases because the\nselling price falls below the basis or acquisition cost. Therefore, when a\ntaxpayer simultaneously owns a share of stock and short sells an identical\nstock, any gain in an ordinary sale of the owned stock is offset by a\ncorresponding loss in the short sale of the borrowed identical stock, vice\nversa. This offsetting effect, in turn, creates an unexpected tax deferral\nopportunity abused in other jurisdictions and which remains unregulated in the\nPhilippine tax system.\n", "versions": [{"version": "v1", "created": "Thu, 28 Dec 2017 18:49:35 GMT"}], "update_date": "2017-12-29", "authors_parsed": [["Geronimo", "Russell Stanley Q.", ""]]}, {"id": "1712.10274", "submitter": "Muhammad Mohsin Hakeem", "authors": "Muhammad Mohsin Hakeem, Ken-ichi Suzuki", "title": "Foreign Portfolio Investment and Economy: The Network Perspective", "comments": null, "journal-ref": "International Journal of Economics, Finance and Business\n  Management Studies, Vol. 3, No. 1, pp. 15-26, April 2017", "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The European Union and Eurozone present an inquisitive case of strongly\ninterconnected network with high degree of dependence among nodes. This\nresearch focused on investment network of European Union and its major trading\npartners for specific time period 2001 to 2014. The changing investment\npatterns within Eurozone suggest strong financial and trade links with central\nand large economies. This study is about the association between portfolio\ninvestment and economic indicators with respect to financial networks. The\nanalysis used the strongly connected investment network of Eurozone and its\nlarge trading partners. A strong correlation between, increasing or decreasing\ninvestment patterns with economic indicators of particular economy was found.\nInterestingly correlation patterns for network members other than Eurozone\nstates were not as strong and depicted mild behavior. This as well, explains\nthe significance of interconnectedness level among nodes of one network with\nvarying centrality measures. Investment network visualization techniques helped\nto validate the results based on network`s statistical measures.\n", "versions": [{"version": "v1", "created": "Fri, 29 Dec 2017 16:36:54 GMT"}], "update_date": "2018-01-01", "authors_parsed": [["Hakeem", "Muhammad Mohsin", ""], ["Suzuki", "Ken-ichi", ""]]}]