[{"id": "2001.00465", "submitter": "Riccardo De Blasis", "authors": "Guglielmo D'Amico and Riccardo De Blasis", "title": "A review of the Dividend Discount Model: from deterministic to\n  stochastic models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This chapter presents a review of the dividend discount models starting from\nthe basic models (Williams 1938, Gordon and Shapiro 1956) to more recent and\ncomplex models (Ghezzi and Piccardi 2003, Barbu et al. 2017, D'Amico and De\nBlasis 2018) with a focus on the modelling of the dividend process rather than\nthe discounting factor, that is assumed constant in most of the models. The\nChapter starts with an introduction of the basic valuation model with some\ngeneral aspects to consider when performing the computation. Then, Section 1.3\npresents the Gordon growth model (Gordon 1962) with some of its extensions\n(Malkiel 1963, Fuller and Hsia 1984, Molodovsky et al. 1965, Brooks and Helms\n1990, Barsky and De Long 1993), and reports some empirical evidence. Extended\nreviews of the Gordon stock valuation model and its extensions can be found in\nKamstra (2003) and Damodaran (2012). In Section 1.4, the focus is directed to\nmore recent advancements which make us of the Markov chain to model the\ndividend process (Hurley and Johnson 1994, Yao 1997, Hurley and Johnson 1998,\nGhezzi and Piccardi 2003, Barbu et al. 2017, D'Amico and De Blasis 2018). The\nadvantage of these models is the possibility to obtain a different valuation\nthat depends on the state of the dividend series, allowing the model to be\ncloser to reality. In addition, these models permit to obtain a measure of the\nrisk of the single stock or a portfolio of stocks.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2020 14:49:48 GMT"}], "update_date": "2020-01-03", "authors_parsed": [["D'Amico", "Guglielmo", ""], ["De Blasis", "Riccardo", ""]]}, {"id": "2001.00516", "submitter": "Ivan Arraut Dr.", "authors": "Ivan Arraut, Alan Au, Alan Ching-biu Tse and Joao Alexandre Lobo\n  Marques", "title": "On the probability flow in the Stock market I: The Black-Scholes case", "comments": "10 pages including references", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is known that the probability is not a conserved quantity in the stock\nmarket, given the fact that it corresponds to an open system. In this paper we\nanalyze the flow of probability in this system by expressing the ideal\nBlack-Scholes equation in the Hamiltonian form. We then analyze how the\nnon-conservation of probability affects the stability of the prices of the\nStocks. Finally, we find the conditions under which the probability might be\nconserved in the market, challenging in this way the non-Hermitian nature of\nthe Black-Scholes Hamiltonian.\n", "versions": [{"version": "v1", "created": "Fri, 20 Dec 2019 02:30:06 GMT"}], "update_date": "2020-01-03", "authors_parsed": [["Arraut", "Ivan", ""], ["Au", "Alan", ""], ["Tse", "Alan Ching-biu", ""], ["Marques", "Joao Alexandre Lobo", ""]]}, {"id": "2001.00919", "submitter": "Tarun Chitra", "authors": "Tarun Chitra", "title": "Competitive equilibria between staking and on-chain lending", "comments": "25 pages, Accepted to Stanford Blockchain Conference and MIT\n  Cryptoeconomic Systems '20", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cs.DC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Proof of Stake (PoS) is a burgeoning Sybil resistance mechanism that aims to\nhave a digital asset (\"token\") serve as security collateral in crypto networks.\nHowever, PoS has so far eluded a comprehensive threat model that encompasses\nboth Byzantine attacks from distributed systems and financial attacks that\narise from the dual usage of the token as a means of payment and a Sybil\nresistance mechanism. In particular, the existence of derivatives markets makes\nmalicious coordination among validators easier to execute than in Proof of Work\nsystems. We demonstrate that it is also possible for on-chain lending smart\ncontracts to cannibalize network security in PoS systems. When the yield\nprovided by these contracts is more attractive than the inflation rate provided\nfrom staking, stakers will tend to remove their staked tokens and lend them\nout, thus reducing network security. In this paper, we provide a simple\nstochastic model that describes how rational validators with varying risk\npreferences react to changes in staking and lending returns. For a particular\nconfiguration of this model, we provide a formal proof of a phase transition\nbetween equilibria in which tokens are predominantly staked and those in which\nthey are predominantly lent. We further validate this emergent adversarial\nbehavior (e.g. reduced staked token supply) with agent-based simulations that\nsample transitions under more realistic conditions. Our results illustrate that\nrational, non-adversarial actors can dramatically reduce PoS network security\nif block rewards are not calibrated appropriately above the expected yields of\non-chain lending.\n", "versions": [{"version": "v1", "created": "Thu, 28 Nov 2019 01:22:35 GMT"}, {"version": "v2", "created": "Tue, 4 Feb 2020 18:22:52 GMT"}], "update_date": "2020-02-05", "authors_parsed": [["Chitra", "Tarun", ""]]}, {"id": "2001.00920", "submitter": "Javier Trejos", "authors": "Andres Quiros-Granados, JAvier Trejos-Zelaya", "title": "Estimation of the yield curve for Costa Rica using combinatorial\n  optimization metaheuristics applied to nonlinear regression", "comments": "13 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cs.LG math.OC stat.ML", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The term structure of interest rates or yield curve is a function relating\nthe interest rate with its own term. Nonlinear regression models of\nNelson-Siegel and Svensson were used to estimate the yield curve using a sample\nof historical data supplied by the National Stock Exchange of Costa Rica. The\noptimization problem involved in the estimation process of model parameters is\naddressed by the use of four well known combinatorial optimization\nmetaheuristics: Ant colony optimization, Genetic algorithm, Particle swarm\noptimization and Simulated annealing. The aim of the study is to improve the\nlocal minima obtained by a classical quasi-Newton optimization method using a\ndescent direction. Good results with at least two metaheuristics are achieved,\nParticle swarm optimization and Simulated annealing. Keywords: Yield curve,\nnonlinear regression, Nelson-\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 02:55:44 GMT"}], "update_date": "2020-01-06", "authors_parsed": [["Quiros-Granados", "Andres", ""], ["Trejos-Zelaya", "JAvier", ""]]}, {"id": "2001.04188", "submitter": "Sudip   Mukherjee", "authors": "Antika Sinha, Sudip Mukherjee and Bikas K Chakrabarti", "title": "Econophysics Through Computation", "comments": "Invited review article for `Journal of Physics Through Computation'\n  (Clausius Scientific Press)", "journal-ref": "Journal of Physics Through Computation (2020) Vol. 3: 1-54", "doi": null, "report-no": null, "categories": "physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce here very briefly, through some selective choices of problems\nand through the sample computer simulation programs (following the request of\nthe editor for this invited review in the Journal of Physics Through\nComputation), the newly developed field of econophysics. Though related\nattempts could be traced much earlier (see the Appendix), the formal researches\nin econophysics started in 1995. We hope, the readers (students \\& researchers)\ncan start themselves to enjoy the excitement, through the sample computer\nprograms given, and eventually can undertake researches in the frontier\nproblems, through the indicated survey literature provided.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2020 12:40:38 GMT"}, {"version": "v2", "created": "Wed, 29 Jan 2020 13:25:54 GMT"}], "update_date": "2020-01-30", "authors_parsed": [["Sinha", "Antika", ""], ["Mukherjee", "Sudip", ""], ["Chakrabarti", "Bikas K", ""]]}, {"id": "2001.05575", "submitter": "Mukaramah Harun", "authors": "Sallahuddin Hassan, Zalila Othman, Mukaramah Harun", "title": "Ownership Structure Variation and Firm Efficiency", "comments": null, "journal-ref": "Asian Social Science 2014", "doi": "10.5539/ass.v10n11p233", "report-no": null, "categories": "q-fin.GN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Firms with different ownership structures could be argued to have different\nlevels of efficiency.Highly concentrated firms are expected to be more\nefficient as this type of ownership structure may alleviate the conflict of\ninterest between managers and shareholders.In Malaysia, public-listed firms\nhave been found to have highly concentrated ownership structure.However,\nwhether this evidence holds for every industry has not been established.Hence,\nthe objective of this paper is to investigate whether there are variations in\nownership structure and firm's efficiency across sectors.To achieve this\nobjective, the frequency distributions of ownership structure were calculated\nand firms efficiency scores for consumer products, industrial products,\nconstruction and trading/services sectors were measured.Data Envelopment\nAnalysis(DEA) under the assumptions of constant returns to scale(CRS) and\nvariable returns to scale(VRS) was employed to estimate firms efficiency\nscores.A sample of 156 firms listed on the Kuala Lumpur Stock Exchange(KLSE)\nwas selected using the stratified random sampling method. The findings have\nshown that there are variations in firm ownership structure and efficiency\nacross sectors.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jan 2020 08:07:14 GMT"}], "update_date": "2020-01-17", "authors_parsed": [["Hassan", "Sallahuddin", ""], ["Othman", "Zalila", ""], ["Harun", "Mukaramah", ""]]}, {"id": "2001.06889", "submitter": "Diego Amancio", "authors": "Thiago C. Silva and Diego R. Amancio and Benjamin M. Tabak", "title": "Modeling Supply-Chain Networks with Firm-to-Firm Wire Transfers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a novel economic network (supply chain) comprised of wire transfers\n(electronic payment transactions) among the universe of firms in Brazil (6.2\nmillion firms). We construct a directed and weighted network in which vertices\nrepresent cities and edges connote pairwise economic dependence between cities.\nCities (vertices) represent the collection of all firms in that location and\nlinks denote intercity wire transfers. We find a high degree of economic\nintegration among cities in the trade network, which is consistent with the\nhigh degree of specialization found across Brazilian cities. We are able to\nidentify which cities have a dominant role in the entire supply chain process\nusing centrality network measures. We find that the trade network has a\ndisassortative mixing pattern, which is consistent with the power-law shape of\nthe firm size distribution in Brazil. After the Brazilian recession in 2014, we\nfind that the disassortativity becomes even stronger as a result of the death\nof many small firms and the consequent concentration of economic flows on large\nfirms. Our results suggest that recessions have a large impact on the trade\nnetwork with meaningful and heterogeneous economic consequences across\nmunicipalities. We run econometric exercises and find that courts efficiency\nplays a dual role. From the customer perspective, it plays an important role in\nreducing contractual frictions as it increases economic transactions between\ndifferent cities. From the supplier perspective, cities that are central\nsuppliers to the supply chain seem to use courts inefficiency as a lawsuit\nbarrier from their customers.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jan 2020 19:47:14 GMT"}, {"version": "v2", "created": "Mon, 10 Aug 2020 18:26:58 GMT"}], "update_date": "2020-08-12", "authors_parsed": [["Silva", "Thiago C.", ""], ["Amancio", "Diego R.", ""], ["Tabak", "Benjamin M.", ""]]}, {"id": "2001.08240", "submitter": "Lawrence Middleton", "authors": "Graham Baird, James Dodd, Lawrence Middleton", "title": "A growth adjusted price-earnings ratio", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this paper is to introduce a new growth adjusted\nprice-earnings measure (GA-P/E) and assess its efficacy as measure of value and\npredictor of future stock returns. Taking inspiration from the interpretation\nof the traditional price-earnings ratio as a period of time, the new measure\ncomputes the requisite payback period whilst accounting for earnings growth.\nHaving derived the measure, we outline a number of its properties before\nconducting an extensive empirical study utilising a sorted portfolio\nmethodology. We find that the returns of the low GA-P/E stocks exceed those of\nthe high GA-P/E stocks, both in an absolute sense and also on a risk-adjusted\nbasis. Furthermore, the returns from the low GA-P/E porfolio was found to\nexceed those of the value portfolio arising from a P/E sort on the same pool of\nstocks. Finally, the returns of our GA-P/E sorted porfolios were subjected to\nanalysis by conducting regressions against the standard Fama and French risk\nfactors.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2020 19:22:42 GMT"}], "update_date": "2020-01-24", "authors_parsed": [["Baird", "Graham", ""], ["Dodd", "James", ""], ["Middleton", "Lawrence", ""]]}, {"id": "2001.08865", "submitter": "Abootaleb Shirvani", "authors": "Abootaleb Shirvani and Frank J. Fabozzi", "title": "Choosing the Right Return Distribution and the Excess Volatility Puzzle", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Proponents of behavioral finance have identified several \"puzzles\" in the\nmarket that are inconsistent with rational finance theory. One such puzzle is\nthe \"excess volatility puzzle\". Changes in equity prices are too large given\nchanges in the fundamentals that are expected to change equity prices. In this\npaper, we offer a resolution to the excess volatility puzzle within the context\nof rational finance. We empirically show that market inefficiency attributable\nto the volatility of excess return across time is caused by fitting an improper\ndistribution to the historical returns. Our results indicate that the variation\nof gross excess returns is attributable to poorly fitting the tail of the\nreturn distribution and that the puzzle disappears by employing a more\nappropriate distribution for the return data. The new distribution that we\nintroduce in this paper that better fits the historical return distribution of\nstocks explains the excess volatility in the market and thereby explains the\nvolatility puzzle. Failing to estimate the historical returns using the proper\ndistribution is only one possible explanation for the existence of the\nvolatility puzzle. However, it offers statistical models within the rational\nfinance framework which can be used without relying on behavioral finance\nassumptions when searching for an explanation for the volatility puzzle.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2020 02:42:54 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Shirvani", "Abootaleb", ""], ["Fabozzi", "Frank J.", ""]]}, {"id": "2001.10432", "submitter": "Claudiu Albulescu", "authors": "Claudiu Albulescu (CRIEF)", "title": "Investment behavior and firms' financial performance: A comparative\n  analysis using firm-level data from the wine industry", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper assesses the role of financial performance in explaining firms'\ninvestment dynamics in the wine industry from the three European Union (EU)\nlargest producers. The wine sector deserves special attention to investigate\nfirms' investment behavior given the high competition imposed by the\nlatecomers. More precisely, we investigate how the capitalization, liquidity\nand profitability influence the investment dynamics using firm-level data from\nthe wine industry from France (331 firms), Italy (335) firms and Spain (442)\nfirms. We use data from 2007 to 2014, drawing a comparison between these\ncountries, and relying on difference-and system-GMM estimators. Specifically,\nthe impact of profitability is positive and significant, while the\ncapitalization has a significant and negative impact on the investment dynamics\nonly in France and Spain. The influence of the liquidity ratio is negative and\nsignificant only in the case of Spain. Therefore, we notice different\ninvestment strategies for wine companies located in the largest producer\ncountries. It appears that these findings are in general robust to different\nspecifications of liquidity and profitability ratios, and to the different\nestimators we use.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jan 2020 16:08:49 GMT"}], "update_date": "2020-01-29", "authors_parsed": [["Albulescu", "Claudiu", "", "CRIEF"]]}, {"id": "2001.11214", "submitter": "Christian Bongiorno", "authors": "Christian Bongiorno, Damien Challet", "title": "Nonparametric sign prediction of high-dimensional correlation matrix\n  coefficients", "comments": null, "journal-ref": null, "doi": "10.1209/0295-5075/133/48001", "report-no": null, "categories": "q-fin.GN q-fin.ST stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a method to predict which correlation matrix coefficients are\nlikely to change their signs in the future in the high-dimensional regime, i.e.\nwhen the number of features is larger than the number of samples per feature.\nThe stability of correlation signs, two-by-two relationships, is found to\ndepend on three-by-three relationships inspired by Heider social cohesion\ntheory in this regime. We apply our method to US and Hong Kong equities\nhistorical data to illustrate how the structure of correlation matrices\ninfluences the stability of the sign of its coefficients.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2020 08:45:58 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Bongiorno", "Christian", ""], ["Challet", "Damien", ""]]}, {"id": "2001.11861", "submitter": "Lioudmila Vostrikova", "authors": "Elena Boguslavskaya, Lioudmila Vostrikova (LAREMA)", "title": "Revisiting integral functionals of geometric Brownian motion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST q-fin.CP q-fin.GN q-fin.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we revisit the integral functional of geometric Brownian motion\n$I_t= \\int_0^t e^{-(\\mu s +\\sigma W_s)}ds$, where $\\mu\\in\\mathbb{R}$, $\\sigma >\n0$, and $(W_s )_s>0$ is a standard Brownian motion. Specifically, we calculate\nthe Laplace transform in $t$ of the cumulative distribution function and of the\nprobability density function of this functional.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2020 14:17:20 GMT"}], "update_date": "2020-02-03", "authors_parsed": [["Boguslavskaya", "Elena", "", "LAREMA"], ["Vostrikova", "Lioudmila", "", "LAREMA"]]}]