[{"id": "2010.00212", "submitter": "Jean-Bernard Chatelain", "authors": "Jean Bernard Chatelain, Kirsten Ralf", "title": "How Macroeconomists Lost Control of Stabilization Policy: Towards Dark\n  Ages", "comments": null, "journal-ref": "The European Journal of the History of Economic Thought (2020)\n  27(6)", "doi": "10.1080/09672567.2020.1817119", "report-no": null, "categories": "q-fin.GN math.HO math.OC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is a study of the history of the transplant of mathematical tools\nusing negative feedback for macroeconomic stabilization policy from 1948 to\n1975 and the subsequent break of the use of control for stabilization policy\nwhich occurred from 1975 to 1993. New-classical macroeconomists selected a\nsubset of the tools of control that favored their support of rules against\ndiscretionary stabilization policy. The Lucas critique and Kydland and\nPrescott's time-inconsistency were over-statements that led to the \"dark ages\"\nof the prevalence of the stabilization-policy-ineffectiveness idea. These\nover-statements were later revised following the success of the Taylor rule.\n", "versions": [{"version": "v1", "created": "Thu, 1 Oct 2020 06:28:21 GMT"}], "update_date": "2020-10-02", "authors_parsed": [["Chatelain", "Jean Bernard", ""], ["Ralf", "Kirsten", ""]]}, {"id": "2010.01043", "submitter": "Peng-Fei Dai", "authors": "Zhifeng Liu, Toan Luu Duc Huynh, Jianjun Sun, Peng-Fei Dai", "title": "COVID-19, economic policy uncertainty and stock market crash risk", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the impact of economic policy uncertainty (EPU) on\nthe crash risk of US stock market during the COVID-19 pandemic. To this end, we\nuse the GARCH-S (GARCH with skewness) model to estimate daily skewness as a\nproxy for the stock market crash risk. The empirical results show the\nsignificantly negative correlation between EPU and stock market crash risk,\nindicating the aggravation of EPU increase the crash risk. Moreover, the\nnegative correlation gets stronger after the global COVID-19 outbreak, which\nshows the crash risk of the US stock market will be more affected by EPU during\nthe epidemic.\n", "versions": [{"version": "v1", "created": "Fri, 2 Oct 2020 15:18:25 GMT"}], "update_date": "2020-10-05", "authors_parsed": [["Liu", "Zhifeng", ""], ["Huynh", "Toan Luu Duc", ""], ["Sun", "Jianjun", ""], ["Dai", "Peng-Fei", ""]]}, {"id": "2010.01265", "submitter": "Chuheng Zhang", "authors": "Chuheng Zhang, Yuanqi Li, Xi Chen, Yifei Jin, Pingzhong Tang, Jian Li", "title": "DoubleEnsemble: A New Ensemble Method Based on Sample Reweighting and\n  Feature Selection for Financial Data Analysis", "comments": "This paper was published in ICDM 2020. We have fixed several typos\n  and polished the writing in this revision", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-fin.GN stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern machine learning models (such as deep neural networks and boosting\ndecision tree models) have become increasingly popular in financial market\nprediction, due to their superior capacity to extract complex non-linear\npatterns. However, since financial datasets have very low signal-to-noise ratio\nand are non-stationary, complex models are often very prone to overfitting and\nsuffer from instability issues. Moreover, as various machine learning and data\nmining tools become more widely used in quantitative trading, many trading\nfirms have been producing an increasing number of features (aka factors).\nTherefore, how to automatically select effective features becomes an imminent\nproblem. To address these issues, we propose DoubleEnsemble, an ensemble\nframework leveraging learning trajectory based sample reweighting and shuffling\nbased feature selection. Specifically, we identify the key samples based on the\ntraining dynamics on each sample and elicit key features based on the ablation\nimpact of each feature via shuffling. Our model is applicable to a wide range\nof base models, capable of extracting complex patterns, while mitigating the\noverfitting and instability issues for financial market prediction. We conduct\nextensive experiments, including price prediction for cryptocurrencies and\nstock trading, using both DNN and gradient boosting decision tree as base\nmodels. Our experiment results demonstrate that DoubleEnsemble achieves a\nsuperior performance compared with several baseline methods.\n", "versions": [{"version": "v1", "created": "Sat, 3 Oct 2020 02:57:10 GMT"}, {"version": "v2", "created": "Thu, 10 Dec 2020 02:35:02 GMT"}, {"version": "v3", "created": "Sun, 31 Jan 2021 12:10:40 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Zhang", "Chuheng", ""], ["Li", "Yuanqi", ""], ["Chen", "Xi", ""], ["Jin", "Yifei", ""], ["Tang", "Pingzhong", ""], ["Li", "Jian", ""]]}, {"id": "2010.01312", "submitter": "Roman Orus", "authors": "Samuel Mugel, Enrique Lizaso, Roman Orus", "title": "Use Cases of Quantum Optimization for Finance", "comments": "10 pages, conference proceedings, to appear in Quantum Computing in\n  Econometrics and Quantum Economics and Related Topics, edited by Songsak\n  Sriboonchitta, Vladik Kreinovich, Woraphon Yamaka", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we briefly review two recent use-cases of quantum optimization\nalgorithms applied to hard problems in finance and economy. Specifically, we\ndiscuss the prediction of financial crashes as well as dynamic portfolio\noptimization. We comment on the different types of quantum strategies to carry\non these optimizations, such as those based on quantum annealers, universal\ngate-based quantum processors, and quantum-inspired Tensor Networks.\n", "versions": [{"version": "v1", "created": "Sat, 3 Oct 2020 09:41:48 GMT"}], "update_date": "2020-10-06", "authors_parsed": [["Mugel", "Samuel", ""], ["Lizaso", "Enrique", ""], ["Orus", "Roman", ""]]}, {"id": "2010.01727", "submitter": "Bruce Knuteson", "authors": "Bruce Knuteson", "title": "Strikingly Suspicious Overnight and Intraday Returns", "comments": "4 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The world's stock markets display a strikingly suspicious pattern of\novernight and intraday returns. Overnight returns to major stock market indices\nover the past few decades have been wildly positive, while intraday returns\nhave been disturbingly negative. The cause of these astonishingly consistent\nreturn patterns is unknown. We highlight the features of these extraordinary\npatterns that have hindered the construction of any plausible innocuous\nexplanation. We then use those same features to deduce the only plausible\nexplanation so far advanced for these strikingly suspicious returns.\n", "versions": [{"version": "v1", "created": "Mon, 5 Oct 2020 00:29:55 GMT"}], "update_date": "2020-10-06", "authors_parsed": [["Knuteson", "Bruce", ""]]}, {"id": "2010.04827", "submitter": "Jiahao Chen", "authors": "Eren Kurshan and Hongda Shen and Jiahao Chen", "title": "Towards Self-Regulating AI: Challenges and Opportunities of AI Model\n  Governance in Financial Services", "comments": "8 pages, 7 figures", "journal-ref": "Proceedings of the 1st International Conference on AI in Finance\n  (ICAIF '20), October 15-16, 2020, New York", "doi": "10.1145/3383455.3422564", "report-no": null, "categories": "cs.LG cs.AI q-fin.GN stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  AI systems have found a wide range of application areas in financial\nservices. Their involvement in broader and increasingly critical decisions has\nescalated the need for compliance and effective model governance. Current\ngovernance practices have evolved from more traditional financial applications\nand modeling frameworks. They often struggle with the fundamental differences\nin AI characteristics such as uncertainty in the assumptions, and the lack of\nexplicit programming. AI model governance frequently involves complex review\nflows and relies heavily on manual steps. As a result, it faces serious\nchallenges in effectiveness, cost, complexity, and speed. Furthermore, the\nunprecedented rate of growth in the AI model complexity raises questions on the\nsustainability of the current practices. This paper focuses on the challenges\nof AI model governance in the financial services industry. As a part of the\noutlook, we present a system-level framework towards increased self-regulation\nfor robustness and compliance. This approach aims to enable potential solution\nopportunities through increased automation and the integration of monitoring,\nmanagement, and mitigation capabilities. The proposed framework also provides\nmodel governance and risk management improved capabilities to manage model risk\nduring deployment.\n", "versions": [{"version": "v1", "created": "Fri, 9 Oct 2020 22:12:22 GMT"}], "update_date": "2020-10-13", "authors_parsed": [["Kurshan", "Eren", ""], ["Shen", "Hongda", ""], ["Chen", "Jiahao", ""]]}, {"id": "2010.05867", "submitter": "David Byrd", "authors": "David Byrd and Antigoni Polychroniadou", "title": "Differentially Private Secure Multi-Party Computation for Federated\n  Learning in Financial Applications", "comments": "ACM ICAIF 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI cs.MA q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Federated Learning enables a population of clients, working with a trusted\nserver, to collaboratively learn a shared machine learning model while keeping\neach client's data within its own local systems. This reduces the risk of\nexposing sensitive data, but it is still possible to reverse engineer\ninformation about a client's private data set from communicated model\nparameters. Most federated learning systems therefore use differential privacy\nto introduce noise to the parameters. This adds uncertainty to any attempt to\nreveal private client data, but also reduces the accuracy of the shared model,\nlimiting the useful scale of privacy-preserving noise. A system can further\nreduce the coordinating server's ability to recover private client information,\nwithout additional accuracy loss, by also including secure multiparty\ncomputation. An approach combining both techniques is especially relevant to\nfinancial firms as it allows new possibilities for collaborative learning\nwithout exposing sensitive client data. This could produce more accurate models\nfor important tasks like optimal trade execution, credit origination, or fraud\ndetection. The key contributions of this paper are: We present a\nprivacy-preserving federated learning protocol to a non-specialist audience,\ndemonstrate it using logistic regression on a real-world credit card fraud data\nset, and evaluate it using an open-source simulation platform which we have\nadapted for the development of federated learning systems.\n", "versions": [{"version": "v1", "created": "Mon, 12 Oct 2020 17:16:27 GMT"}], "update_date": "2020-10-13", "authors_parsed": [["Byrd", "David", ""], ["Polychroniadou", "Antigoni", ""]]}, {"id": "2010.06954", "submitter": "Anand Sahasranaman", "authors": "Anand Sahasranaman", "title": "Long term dynamics of poverty transitions in India", "comments": "17 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We model the dynamics of poverty using a stochastic model of Geometric\nBrownian Motion with reallocation (RGBM) and explore both transient and\npersistent poverty over 1952-2006. We find that annual transitions in and out\nof poverty are common and show a rising trend, with the rise largely being\ndriven by transitions out of poverty. Despite this promising trend, even toward\nthe end of the time frame, there is a non-trivial proportion of individuals\nstill transitioning annually into poverty, indicative of the economic fragility\nof those near the poverty line. We also find that there is still a marked\npersistence of poverty over time, though the probability of poverty persistence\nis slowly declining. Particularly concerning in this context are the poverty\ntrajectories of those at the very bottom of the income distribution. The choice\nof poverty line appears to impact the dynamics, with higher poverty lines\ncorresponding to lower transitions and higher persistence probabilities. The\ndistinct nature of emergent transient and persistence dynamics suggests that\nthe approaches to counter these phenomena need to be different, possibly\nincorporating both missing financial markets and state action.\n", "versions": [{"version": "v1", "created": "Wed, 14 Oct 2020 11:01:12 GMT"}], "update_date": "2020-10-15", "authors_parsed": [["Sahasranaman", "Anand", ""]]}, {"id": "2010.08962", "submitter": "Lixin Zhong", "authors": "Wen-Juan Xu, Chen-Yang Zhong, Fei Ren, Tian Qiu, Rong-Da Chen, Yun-Xin\n  He, Li-Xin Zhong", "title": "Evolutionary dynamics in financial markets with heterogeneities in\n  strategies and risk tolerance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN nlin.AO physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In nature and human societies, the effects of homogeneous and heterogeneous\ncharacteristics on the evolution of collective behaviors are quite different\nfrom each other. It is of great importance to understand the underlying\nmechanisms of the occurrence of such differences. By incorporating pair pattern\nstrategies and reference point strategies into an agent-based model, we have\ninvestigated the coupled effects of heterogeneous investment strategies and\nheterogeneous risk tolerance on price fluctuations. In the market flooded with\nthe investors with homogeneous investment strategies or homogeneous risk\ntolerance, large price fluctuations are easy to occur. In the market flooded\nwith the investors with heterogeneous investment strategies or heterogeneous\nrisk tolerance, the price fluctuations are suppressed. For a heterogeneous\npopulation, the coexistence of investors with pair pattern strategies and\nreference point strategies causes the price to have a slow fluctuation around a\ntypical equilibrium point and both a large price fluctuation and a no-trading\nstate are avoided, in which the pair pattern strategies push the system far\naway from the equilibrium while the reference point strategies pull the system\nback to the equilibrium. A theoretical analysis indicates that the evolutionary\ndynamics in the present model is governed by the competition between different\nstrategies. The strategy that causes large price fluctuations loses more while\nthe strategy that pulls the system back to the equilibrium gains more.\nOverfrequent trading does harm to one's pursuit for more wealth.\n", "versions": [{"version": "v1", "created": "Sun, 18 Oct 2020 11:28:48 GMT"}], "update_date": "2020-10-20", "authors_parsed": [["Xu", "Wen-Juan", ""], ["Zhong", "Chen-Yang", ""], ["Ren", "Fei", ""], ["Qiu", "Tian", ""], ["Chen", "Rong-Da", ""], ["He", "Yun-Xin", ""], ["Zhong", "Li-Xin", ""]]}, {"id": "2010.10260", "submitter": "Sergey Rashkovskiy", "authors": "Sergey Rashkovskiy", "title": "Thermodynamics of markets", "comments": "29 pages", "journal-ref": null, "doi": "10.1016/j.physa.2020.125699", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the thermodynamic approach to the description of economic systems\nand processes. The first and second laws of thermodynamics as applied to\neconomic systems are derived and analyzed. It is shown that there is a deep\nanalogy between the parameters of thermodynamic and economic systems (markets);\nin particular, each thermodynamic parameter can be associated with a certain\neconomic parameter or indicator. The economic meaning of such primordially\nthermodynamic concepts as pressure, volume, internal energy, heat, etc. has\nbeen established. The thermostatistics of the market is considered. It is shown\nthat, as in conventional thermostatistics, many market parameters, such as\nprice of goods, quantity of goods, etc., as well as their fluctuations can be\ncalculated formally using the partition function of an economic system.\n", "versions": [{"version": "v1", "created": "Wed, 14 Oct 2020 18:41:57 GMT"}], "update_date": "2021-02-03", "authors_parsed": [["Rashkovskiy", "Sergey", ""]]}, {"id": "2010.12415", "submitter": "Juergen Schatzmann", "authors": "J\\\"urgen E. Schatzmann and Bernhard Haslhofer", "title": "Bitcoin Trading is Irrational! An Analysis of the Disposition Effect in\n  Bitcoin", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.CR q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Investors tend to sell their winning investments and hold onto their losers.\nThis phenomenon, known as the \\emph{disposition effect} in the field of\nbehavioural finance, is well-known and its prevalence has been shown in a\nnumber of existing markets. But what about new atypical markets like\ncryptocurrencies? Do investors act as irrationally as in traditional markets?\nOne might suspect this and hypothesise that cryptocurrency sells occur more\nfrequently in positive market conditions and less frequently in negative market\nconditions. However, there is still no empirical evidence to support this. In\nthis paper, we expand on existing research and empirically investigate the\nprevalence of the disposition effect in Bitcoin by testing this hypothesis. Our\nresults show that investors are indeed subject to the disposition effect,\ntending to sell their winning positions too soon and holding on to their losing\nposition for too long. This effect is very prominently evident from the boom\nand bust year 2017 onwards, confirmed via most of the applied technical\nindicators. In this study, we show that Bitcoin traders act just as\nirrationally as traders in other, more established markets.\n", "versions": [{"version": "v1", "created": "Fri, 23 Oct 2020 14:06:19 GMT"}], "update_date": "2020-10-26", "authors_parsed": [["Schatzmann", "Jürgen E.", ""], ["Haslhofer", "Bernhard", ""]]}, {"id": "2010.12550", "submitter": "David Shikumo Mr.", "authors": "David Haritone Shikumo and Mwangi Mirie", "title": "Determinants of Lending to Small and Medium Enterprises by Commercial\n  Banks in Kenya", "comments": "7 Pages", "journal-ref": "IOSR Journal of Economics and Finance (IOSR-JEF) e-ISSN:\n  2321-5933, p-ISSN: 2321-5925.Volume 7, Issue 4. Ver. IV (Jul. - Aug. 2016),\n  PP 57-63 www.iosrjournals.org", "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Small and Medium Enterprises (SMEs) access to external finance is an issue of\nsignificant research interest to academicians. Commercial banks consider many\nSMEs not to be credit worthy because of their inability to meet some banking\nrequirements. Hence, the objective of this study was to investigate what\ndetermines lending to SMEs by commercial banks in Kenya. To achieve the study\nobjectives, a descriptive research design was employed. The study undertook a\ncensus of the 43 commercial banks in Kenya, with full data being obtained for\n36 institutions. The study used secondary data from the annual published\nreports of commercial banks in Kenya for a period of 5 years from 2010-2014.\nThe data collected was analyzed through the multiple linear regression using\nthe Statistical Package for Social Studies version 20.The study established\nthat bank size and liquidity significantly influences (positively and\nnegatively, respectively) lending to SMEs by commercial banks in Kenya while\ncredit risk and interest rates have no significant influence on lending to SMEs\nby commercial banks in Kenya. The study recommends that lending to SMEs by\ncommercial banks in Kenya be enhanced by adopting policies that grow the\ncommercial banks.\n", "versions": [{"version": "v1", "created": "Fri, 23 Oct 2020 17:25:12 GMT"}], "update_date": "2020-10-26", "authors_parsed": [["Shikumo", "David Haritone", ""], ["Mirie", "Mwangi", ""]]}, {"id": "2010.12569", "submitter": "David Shikumo Mr.", "authors": "King'ori S. Ngumo, Kioko W. Collins and Shikumo H. David", "title": "Determinants of Financial Performance of Microfinance Banks in Kenya", "comments": "8 pages", "journal-ref": "Research Journal of Finance and Accounting ISSN 2222-1697 (Paper)\n  ISSN 2222-2847 (Online) Vol.8, No.16, 2017", "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Microfinance provides strength to boost the economic activities of low-income\nearners and thus contributes to eradication of poverty. However, microfinance\ninstitutions face stringent competition from commercial banks; the growth of\nmicroloan activities of commercial banks may confront microfinance institutions\nwith increased competition for borrowers. In Kenya, the micro finance sector\nhas extremely high competition indicated by the shifting market share and\nprofitability. This study sought to examine the determinants of financial\nperformance of Microfinance banks in Kenya. The study adopted a descriptive\nresearch design and used secondary data from 7 Microfinance banks for a period\nof 5 years from 2011 to 2015. The data collected was analyzed using correlation\nand regression analysis. The study found a positive and statistically\nsignificant relationship between operational efficiency, capital adequacy, firm\nsize and financial performance of microfinance banks in Kenya. However, the\nstudy found an insignificant negative relationship between liquidity risk,\ncredit risk and financial performance of microfinance banks in Kenya. The study\nconcluded that there is direct relationship between operational efficiency,\ncapital adequacy, firm size and financial performance of microfinance banks in\nKenya.\n", "versions": [{"version": "v1", "created": "Fri, 23 Oct 2020 17:54:19 GMT"}], "update_date": "2020-10-26", "authors_parsed": [["Ngumo", "King'ori S.", ""], ["Collins", "Kioko W.", ""], ["David", "Shikumo H.", ""]]}, {"id": "2010.12596", "submitter": "David Shikumo Mr.", "authors": "David Haritone Shikumo, Oluoch Oluoch and Joshua Matanda Wepukhulu", "title": "Effect of Long-Term Debt on the Financial Growth of Non-Financial Firms\n  Listed at the Nairobi Securities Exchange", "comments": "9 pages", "journal-ref": "http://www.iosrjournals.org/iosr-jef/papers/Vol11-Issue5/Series-2/A1105020109.pdf\n  2020", "doi": "10.9790/5933-1105020109", "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A significant number of the non-financial firms listed at Nairobi Securities\nExchange (NSE) have been experiencing declining financial performance which\ndeter investors from investing in such firms. The lenders are also not willing\nto lend to such firms. As such, the firms struggle to raise funds for their\noperations. Prudent financing decisions can lead to financial growth of the\nfirm. The purpose of this study is to assess the effect of Long-term debt on\nthe financial growth of Non-financial firms listed at Nairobi Securities\nExchange. Financial firms were excluded because of their specific sector\ncharacteristics and stringent regulatory framework. The study is guided by\nTrade-Off Theory and Theory of Growth of the Firm. Explanatory research design\nwas adopted. The population of the study comprised of 45 non-financial firms\nlisted at the NSE for a period of ten years from 2008 to 2017. The study\nconducted both descriptive statistics analysis and panel data analysis. The\nresult indicates that Long term debt explains 21.6% and 5.16% of variation in\nfinancial growth as measured by growth in earnings per share and growth in\nmarket capitalization respectively. Long term debt positively and significantly\ninfluences financial growth measured using both growth in earnings per share\nand growth in market capitalization. The study recommends that, the management\nof non-financial firms listed at Nairobi Securities Exchange to employ\nfinancing means that can improve the earnings per share, market capitalization\nand enhance the value of the firm for the benefit of its stakeholders.\n", "versions": [{"version": "v1", "created": "Fri, 23 Oct 2020 18:03:47 GMT"}, {"version": "v2", "created": "Sat, 21 Nov 2020 11:23:12 GMT"}], "update_date": "2020-11-24", "authors_parsed": [["Shikumo", "David Haritone", ""], ["Oluoch", "Oluoch", ""], ["Wepukhulu", "Joshua Matanda", ""]]}, {"id": "2010.13340", "submitter": "Naftali Cohen", "authors": "Naftali Cohen, Simran Lamba, Prashant Reddy", "title": "What can be learned from satisfaction assessments?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.EM q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Companies survey their customers to measure their satisfaction levels with\nthe company and its services. The received responses are crucial as they allow\ncompanies to assess their respective performances and find ways to make needed\nimprovements. This study focuses on the non-systematic bias that arises when\ncustomers assign numerical values in ordinal surveys. Using real customer\nsatisfaction survey data of a large retail bank, we show that the common\npractice of segmenting ordinal survey responses into uneven segments limit the\nvalue that can be extracted from the data. We then show that it is possible to\nassess the magnitude of the irreducible error under simple assumptions, even in\nreal surveys, and place the achievable modeling goal in perspective. We finish\nthe study by suggesting that a thoughtful survey design, which uses either a\ncareful binning strategy or proper calibration, can reduce the compounding\nnon-systematic error even in elaborated ordinal surveys. A possible application\nof the calibration method we propose is efficiently conducting targeted surveys\nusing active learning.\n", "versions": [{"version": "v1", "created": "Mon, 26 Oct 2020 05:00:56 GMT"}], "update_date": "2020-10-27", "authors_parsed": [["Cohen", "Naftali", ""], ["Lamba", "Simran", ""], ["Reddy", "Prashant", ""]]}]