[{"id": "2012.00206", "submitter": "Ben-Hur Cardoso", "authors": "Ben-Hur Francisco Cardoso, Sebasti\\'an Gon\\c{c}alves and Jos\\'e\n  Roberto Iglesias", "title": "Wealth concentration in systems with unbiased binary exchanges", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2021.126123", "report-no": null, "categories": "q-fin.GN cond-mat.stat-mech", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Aiming to describe the wealth distribution evolution, several models consider\nan ensemble of interacting economic agents that exchange wealth in binary\nfashion. Intriguingly, models that consider an unbiased market, that gives to\neach agent the same chances to win in the game, are always out of equilibrium\nuntil the perfect inequality of the final state is attained. Here we present a\nrigorous analytical demonstration that any system driven by unbiased binary\nexchanges are doomed to drive the system to perfect inequality and zero\nmobility.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2020 01:30:59 GMT"}, {"version": "v2", "created": "Mon, 7 Dec 2020 01:06:32 GMT"}], "update_date": "2021-06-30", "authors_parsed": [["Cardoso", "Ben-Hur Francisco", ""], ["Gonçalves", "Sebastián", ""], ["Iglesias", "José Roberto", ""]]}, {"id": "2012.01160", "submitter": "Devansh Jain", "authors": "Devansh Jain, Manthan Patel, Aman Narsaria and Siddharth Malik", "title": "A Study on the Efficiency of the Indian Stock Market", "comments": "9 pages, 4 tables, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The efficiency of the stock market has a significant impact on the potential\nreturn on investment. An efficient market eliminates the possibility of\narbitrage and unexploited profit opportunities. This study analyzes the weak\nform efficiency of the Indian Stock market based on the two major Indian stock\nexchanges, viz., BSE and NSE. The daily closing values of Sensex and Nifty\nindices for the period from April 2010 to March 2019 are used to perform the\nRuns test, the Autocorrelation test, and the Autoregression test. The study\nconfirms that the Indian Stock market is weak form inefficient and can thus be\noutperformed.\n", "versions": [{"version": "v1", "created": "Wed, 2 Dec 2020 12:58:57 GMT"}], "update_date": "2020-12-03", "authors_parsed": [["Jain", "Devansh", ""], ["Patel", "Manthan", ""], ["Narsaria", "Aman", ""], ["Malik", "Siddharth", ""]]}, {"id": "2012.05237", "submitter": "Rene Carmona", "authors": "Rene Carmona", "title": "Applications of Mean Field Games in Financial Engineering and Economic\n  Theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN econ.TH math.PR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This is an expanded version of the lecture given at the AMS Short Course on\nMean Field Games, on January 13, 2020 in Denver CO. The assignment was to\ndiscuss applications of Mean Field Games in finance and economics. I need to\nadmit upfront that several of the examples reviewed in this chapter were\nalready discussed in book form. Still, they are here accompanied with\ndiscussions of, and references to, works which appeared over the last three\nyears. Moreover, several completely new sections are added to show how recent\ndevelopments in financial engineering and economics can benefit from being\nviewed through the lens of the Mean Field Game paradigm. The new financial\nengineering applications deal with bitcoin mining and the energy markets, while\nthe new economic applications concern models offering a smooth transition\nbetween macro-economics and finance, and contract theory.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2020 06:57:20 GMT"}], "update_date": "2020-12-11", "authors_parsed": [["Carmona", "Rene", ""]]}, {"id": "2012.06573", "submitter": "Alexis Marchal", "authors": "Alexis Marchal", "title": "Risk & returns around FOMC press conferences: a novel perspective from\n  computer vision", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.CV cs.LG q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I propose a new tool to characterize the resolution of uncertainty around\nFOMC press conferences. It relies on the construction of a measure capturing\nthe level of discussion complexity between the Fed Chair and reporters during\nthe Q&A sessions. I show that complex discussions are associated with higher\nequity returns and a drop in realized volatility. The method creates an\nattention score by quantifying how much the Chair needs to rely on reading\ninternal documents to be able to answer a question. This is accomplished by\nbuilding a novel dataset of video images of the press conferences and\nleveraging recent deep learning algorithms from computer vision. This\nalternative data provides new information on nonverbal communication that\ncannot be extracted from the widely analyzed FOMC transcripts. This paper can\nbe seen as a proof of concept that certain videos contain valuable information\nfor the study of financial markets.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2020 18:59:47 GMT"}, {"version": "v2", "created": "Fri, 15 Jan 2021 16:31:18 GMT"}], "update_date": "2021-01-18", "authors_parsed": [["Marchal", "Alexis", ""]]}, {"id": "2012.09606", "submitter": "Yuuki Ida", "authors": "Jir\\^o Akahori, Yuuki Ida, Maho Nishida and Shuji Tamada", "title": "The Thermodynamic Approach to Whole-Life Insurance: A Method for\n  Evaluation of Surrender Risk", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a collective model for life insurance where the heterogeneity of\neach insured, including the health state, is modeled by a diffusion process.\nThis model is influenced by concepts in statistical mechanics. Using the\nproposed framework, one can describe the total pay-off as a functional of the\ndiffusion process, which can be used to derive a level premium that evaluates\nthe risk of lapses due tothe so-called adverse selection. Two numerically\ntractable models are presented to exemplify the flexibility of the proposed\nframework.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2020 09:10:06 GMT"}], "update_date": "2020-12-18", "authors_parsed": [["Akahori", "Jirô", ""], ["Ida", "Yuuki", ""], ["Nishida", "Maho", ""], ["Tamada", "Shuji", ""]]}, {"id": "2012.11594", "submitter": "Marcel Ausloos", "authors": "Rebecaa Pham and Marcel Ausloos", "title": "Insider trading in the run-up to merger announcements. Before and after\n  the UK's Financial Services Act 2012", "comments": "to be published in International Journal of Finance and Economics; 5\n  figures, 62 references; 36 pages", "journal-ref": null, "doi": "10.1002/ijfe.2325", "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  After the 2007/2008 financial crisis, the UK government decided that a change\nin regulation was required to amend the poor control of financial markets. The\nFinancial Services Act 2012 was developed as a result in order to give more\ncontrol and authority to the regulators of financial markets. Thus, the\nFinancial Conduct Authority (FCA) succeeded the Financial Services Authority\n(FSA). An area requiring an improvement in regulation was insider trading. Our\nstudy examines the effectiveness of the FCA in its duty of regulating insider\ntrading through utilising the event study methodology to assess abnormal\nreturns in the run-up to the first announcement of mergers. Samples of abnormal\nreturns are examined on periods, under regulation either by the FSA or by the\nFCA. Practically, stock price data on the London Stock Exchange from 2008-2012\nand 2015-2019 is investigated. The results from this study determine that\nabnormal returns are reduced after the implementation of the Financial Services\nAct 2012; prices are also found to be noisier in the period before the 2012\nAct. Insignificant abnormal returns are found in the run-up to the first\nannouncement of mergers in the 2015-2019 period. This concludes that the FCA is\nefficient in regulating insider trading.\n", "versions": [{"version": "v1", "created": "Sat, 19 Dec 2020 11:37:20 GMT"}], "update_date": "2020-12-23", "authors_parsed": [["Pham", "Rebecaa", ""], ["Ausloos", "Marcel", ""]]}, {"id": "2012.11595", "submitter": "Marcel Ausloos", "authors": "Marcel Ausloos", "title": "Valuation Models Applied to Value-Based Management. Application to the\n  Case of UK Companies with Problems", "comments": "15 pages; 52 references; 3 Tables", "journal-ref": "Forecasting 2, 549-565 (2020)", "doi": "10.3390/forecast2040029", "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many still rightly wonder whether accounting numbers affect business value.\nBasic questions are why? and how? I aim at promoting an objective choice on how\noptimizing the most suitable valuation methods under a value-based management\nframework through some performance measurement systems. First, I present a\ncomprehensive review of valuation methods. Three valuations methods, (i) Free\nCash Flow Valuation Model (FCFVM), (ii) Residual Earning Valuation Model (REVM)\nand (iii) Abnormal Earning Growth Model (AEGM), are presented. I point out to\nadvantages and limitations. As applications, the proofs of the findings are\nillustrated on three study cases: Marks & Spencer's business pattern (size and\ngrowth prospect), which had a recently advertised valuation problem, and two\ncomparable companies, Tesco and Sainsbury's, all three chosen for\nmultiple-based valuation. For the purpose, two value drivers are chosen,\nEnV/EBIT (entity value/earnings before interests and taxes) and the\ncorresponding EnV/Sales. Thus, the question whether accounting numbers through\nmodels based on mathematical economics truly affect business value has an\nanswer: Maybe, yes.\n", "versions": [{"version": "v1", "created": "Sat, 19 Dec 2020 14:09:14 GMT"}], "update_date": "2020-12-23", "authors_parsed": [["Ausloos", "Marcel", ""]]}, {"id": "2012.11649", "submitter": "Francis Diebold", "authors": "Francis X. Diebold, Minchul Shin, and Boyuan Zhang", "title": "On the Aggregation of Probability Assessments: Regularized Mixtures of\n  Predictive Densities for Eurozone Inflation and Real Interest Rates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.EM q-fin.GN stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose methods for constructing regularized mixtures of density\nforecasts. We explore a variety of objectives and regularization penalties, and\nwe use them in a substantive exploration of Eurozone inflation and real\ninterest rate density forecasts. All individual inflation forecasters (even the\nex post best forecaster) are outperformed by our regularized mixtures. From the\nGreat Recession onward, the optimal regularization tends to move density\nforecasts' probability mass from the centers to the tails, correcting for\noverconfidence.\n", "versions": [{"version": "v1", "created": "Mon, 21 Dec 2020 19:22:29 GMT"}, {"version": "v2", "created": "Mon, 4 Jan 2021 20:27:37 GMT"}], "update_date": "2021-01-06", "authors_parsed": [["Diebold", "Francis X.", ""], ["Shin", "Minchul", ""], ["Zhang", "Boyuan", ""]]}, {"id": "2012.12861", "submitter": "Matthew O. Jackson", "authors": "Matthew O. Jackson and Agathe Pernoud", "title": "Credit Freezes, Equilibrium Multiplicity, and Optimal Bailouts in\n  Financial Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze how interdependencies between organizations in financial networks\ncan lead to multiple possible equilibrium outcomes. A multiplicity arises if\nand only if there exists a certain type of dependency cycle in the network that\nallows for self-fulfilling chains of defaults. We provide necessary and\nsufficient conditions for banks' solvency in any equilibrium. Building on these\nconditions, we characterize the minimum bailout payments needed to ensure\nsystemic solvency, as well as how solvency can be ensured by guaranteeing a\nspecific set of debt payments. Bailout injections needed to eliminate\nself-fulfilling cycles of defaults (credit freezes) are fully recoverable,\nwhile those needed to prevent cascading defaults outside of cycles are not. We\nshow that the minimum bailout problem is computationally hard, but provide an\nupper bound on optimal payments and show that the problem has intuitive\nsolutions in specific network structures such as those with disjoint cycles or\na core-periphery structure.\n", "versions": [{"version": "v1", "created": "Tue, 22 Dec 2020 06:02:09 GMT"}], "update_date": "2020-12-24", "authors_parsed": [["Jackson", "Matthew O.", ""], ["Pernoud", "Agathe", ""]]}, {"id": "2012.13230", "submitter": "James Chiang", "authors": "Massimo Bartoletti, James Hsin-yu Chiang, Alberto Lluch-Lafuente", "title": "SoK: Lending Pools in Decentralized Finance", "comments": "20 pages. Under submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.GT q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lending pools are decentralized applications which allow mutually untrusted\nusers to lend and borrow crypto-assets. These applications feature complex,\nhighly parametric incentive mechanisms to equilibrate the loan market. This\ncomplexity makes the behaviour of lending pools difficult to understand and to\npredict: indeed, ineffective incentives and attacks could potentially lead to\nemergent unwanted behaviours. Reasoning about lending pools is made even harder\nby the lack of executable models of their behaviour: to precisely understand\nhow users interact with lending pools, eventually one has to inspect their\nimplementations, where the incentive mechanisms are intertwined with low-level\nimplementation details. Further, the variety of existing implementations makes\nit difficult to distill the common aspects of lending pools. We systematize the\nexisting knowledge about lending pools, leveraging a new formal model of\ninteractions with users, which reflects the archetypal features of mainstream\nimplementations. This enables us to prove some general properties of lending\npools, such as the correct handling of funds, and to precisely describe\nvulnerabilities and attacks. We also discuss the role of lending pools in the\nbroader context of decentralized finance.\n", "versions": [{"version": "v1", "created": "Thu, 24 Dec 2020 12:53:38 GMT"}], "update_date": "2020-12-25", "authors_parsed": [["Bartoletti", "Massimo", ""], ["Chiang", "James Hsin-yu", ""], ["Lluch-Lafuente", "Alberto", ""]]}]