[{"id": "2107.00837", "submitter": "Joe Levine", "authors": "Joseph Levine", "title": "No Investment Fee Is Small, Long Term", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This note presents a simple \"back of the envelope\" formula estimating that an\nannual investment fee expense ${\\epsilon}$%, compounding for $N$ years,\nconsumes almost $N$${\\epsilon}$% of an investment's value. For example, an\ninvestment with 1% annual fee compounding for 30 years pays almost 30% of its\nfinal value to fees over this period. This approximation captures how annual\nfees can compound over a decade or more to cumulative costs an order of\nmagnitude higher. The formula is simple enough for rapid hand calculation.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jul 2021 04:51:18 GMT"}], "update_date": "2021-07-05", "authors_parsed": [["Levine", "Joseph", ""]]}, {"id": "2107.05163", "submitter": "Xuedong He", "authors": "Jing Guo and Xue Dong He", "title": "Recursive Utility with Investment Gains and Losses: Existence,\n  Uniqueness, and Convergence", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a generalization of the recursive utility model by adding a new\ncomponent that represents utility of investment gains and losses. We also study\nthe utility process in this generalized model with constant elasticity of\nintertemporal substitution and relative risk aversion degree, and with infinite\ntime horizon. In a specific, finite-state Markovian setting, we prove that the\nutility process uniquely exists when the agent derives nonnegative gain-loss\nutility, and that it can be non-existent or non-unique otherwise. Moreover, we\nprove that the utility process, when it uniquely exists, can be computed by\nstarting from any initial guess and applying the recursive equation that\ndefines the utility process repeatedly. We then consider a portfolio selection\nproblem with gain-loss utility and solve it by proving that the corresponding\ndynamic programming equation has a unique solution. Finally, we extend certain\nprevious results to the case in which the state space is infinite.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2021 02:00:42 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Guo", "Jing", ""], ["He", "Xue Dong", ""]]}, {"id": "2107.06194", "submitter": "Lara Dalmeyer", "authors": "Lara Dalmeyer and Tim Gebbie", "title": "Geometric insights into robust portfolio construction with gearing", "comments": "18 pages, 5 Figures, 3 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.OC q-fin.GN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We investigate and extend the results of Golts and Jones (2009) that an\n$\\alpha$-weight angle resulting from unconstrained quadratic portfolio\noptimisations has an upper bound dependent on the condition number of the\ncovariance matrix. This implies that better conditioned covariance matrices\nproduce weights from unconstrained mean-variance optimisations that are better\naligned with each assets expected return. We provide further clarity on the\nmathematical insights that relate the inequality between the $\\alpha$-weight\nangle and the condition number and extend the result to include portfolio\noptimisations with gearing constraints. We provide an extended family of robust\noptimisations that include the gearing constraints, and discuss their\ninterpretation.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 15:49:56 GMT"}, {"version": "v2", "created": "Mon, 26 Jul 2021 14:09:34 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Dalmeyer", "Lara", ""], ["Gebbie", "Tim", ""]]}, {"id": "2107.06810", "submitter": "Emilia Luoma", "authors": "Emilia Luoma, Mirka Laurila-Pant, Elias Altarriba, Inari Helle, Lena\n  Granhag, Maiju Lehtiniemi, Greta Sr\\.ebalien\\.e, Sergej Olenin, Annukka\n  Lehikoinen", "title": "A decision support tool for ship biofouling management in the Baltic Sea", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Biofouling of ships causes major environmental and economic consequences all\nover the world. In addition, biofouling management of ship hulls causes both\nsocial, environmental and economic risks that should all be considered reaching\nwell-balanced decisions. In addition, each case is unique and thus optimal\nmanagement strategy must be considered case-specifically. We produced a novel\ndecision support tool using Bayesian networks to promote the comprehensive\nunderstanding about the complex biofouling management issue in the Baltic Sea\nand to identify potential management options and their consequences. The tool\ncompares the biofouling management strategies in relation to NIS\n(non-indigenous species) introduction risk, eco-toxicological risk due to\nbiocidal coating, carbon dioxide emissions resulting from fuel consumption and\ncosts related to fuel consumption, in-water cleaning and coating. According to\nthe results, the optimal biofouling management strategy would consist of a\nbiocidal-free coating with regular in-water cleaning and with devices\ncollecting the material. However, the best biocidal-free coating type and the\noptimal in-water cleaning interval varies and depends e.g. on the operational\nprofile of the ship. The decision support tool can increase the\nmulti-perspective understanding about the issue and support the implementation\nof the optimal biofouling management strategies in the Baltic Sea.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2021 14:16:04 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Luoma", "Emilia", ""], ["Laurila-Pant", "Mirka", ""], ["Altarriba", "Elias", ""], ["Helle", "Inari", ""], ["Granhag", "Lena", ""], ["Lehtiniemi", "Maiju", ""], ["Srėbalienė", "Greta", ""], ["Olenin", "Sergej", ""], ["Lehikoinen", "Annukka", ""]]}, {"id": "2107.09636", "submitter": "Sebastian Martin", "authors": "Yves Smeers, Sebastian Martin, Jose A. Aguado", "title": "Co-optimization of Energy and Reserve with Incentives to Wind\n  Generation: Case Study", "comments": "8 pages, 4 tables, 5 figures. Supplementary material for article\n  entitled: Co-optimization of Energy and Reserve with Incentives to Wind\n  Generation", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cs.SY eess.SY math.OC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This case study presents an analysis and quantification of the impact of the\nlack of co-optimization of energy and reserve in the presence of high\npenetration of wind energy. The methodology is developed in a companion paper,\nPart I. Two models, with and without co-optimization are confronted. The\nmodeling of reserve and the incentive to renewable as well as the calibration\nof the model are inspired by the Spanish market. A sensitivity analysis is\nperformed on configurations that differ by generation capacity, ramping\ncapability, and market parameters (available wind, Feed in Premium to wind,\ngenerators risk aversion, and reserve requirement). The models and the case\nstudy are purely illustrative but the methodology is general.\n", "versions": [{"version": "v1", "created": "Sat, 3 Jul 2021 16:58:22 GMT"}], "update_date": "2021-07-21", "authors_parsed": [["Smeers", "Yves", ""], ["Martin", "Sebastian", ""], ["Aguado", "Jose A.", ""]]}, {"id": "2107.09637", "submitter": "Daniel Berleant", "authors": "Daniel Berleant, Venkat Kodali, Richard Segall, Hyacinthe Aboudja and\n  Michael Howell", "title": "Moore's law, Wright's law and the Countdown to Exponential Space", "comments": "This article may also be obtained at\n  https://www.thespacereview.com/article/3632/1", "journal-ref": "The Space Review (2019), Jan. 7,\n  www.thespacereview.com/article/3632/1", "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Technologies have often been observed to improve exponentially over time. In\npractice this often means identifying a constant known as the doubling time,\ndescribing the time period over which the technology roughly doubles in some\nmeasure of performance or of performance per dollar. Moore's law is,\nclassically, the empirical observation that the number of electronic components\nthat can be put on a chip doubles every 18 months to 2 years. Today it is\nfrequently stated as the number of computations available per unit of cost.\nGeneralized to the appropriate doubling time, it describes the rate of\nadvancement in many technologies. A frequently noted competitor to Moore's law\nis known as Wright's law, which has aeronautical roots. Wright's law (also\ncalled power law, experience curve and Henderson's law) relates some quality of\na manufactured unit (for Wright, airplanes) to the volume of units\nmanufactured. The Wright's law equation expresses the idea that performance -\nprice or a quality metric - improves according to a power of the number\nproduced, or alternatively stated, improves by a constant percentage for every\ndoubling of the total number produced.\n  Does exploration of outer space conform to Moore's law or Wright's law-like\nbehavior? Our results below are broadly consistent with these laws. This is\ntrue for many technologies. Although the two laws can make somewhat different\npredictions, Sahal found that they converge to the same predictions when\nmanufacturing volume increases exponentially over time. When space exploration\ntransitions into an independent commercial sector, as many people hope and\nexpect, spacecraft technology will then likely enter an era of unambiguously\nexponential advancement.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2021 03:27:51 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Berleant", "Daniel", ""], ["Kodali", "Venkat", ""], ["Segall", "Richard", ""], ["Aboudja", "Hyacinthe", ""], ["Howell", "Michael", ""]]}, {"id": "2107.10001", "submitter": "Evan Hurwitz", "authors": "Evan Hurwitz, George Cevora", "title": "Forecasting performance of workforce reskilling programmes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Estimating success rates for programmes aiming to reintegrate theunemployed\ninto the workforce is essential for good stewardship of publicfinances. At the\ncurrent moment, the methods used for this task arebased on the historical\nperformance of comparable programmes. In lightof Brexit and Covid-19\nsimultaneously causing a shock to the labourmarket in the UK we developed an\nestimation method that is basedon fundamental factors involved - workforce\ndemand and supply - asopposed to the historical values which are quickly\nbecoming irrelevant.With an average error of 3.9% of the re-integration success\nrate, ourmodel outperforms the best benchmark known to us by 53%\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 10:45:08 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Hurwitz", "Evan", ""], ["Cevora", "George", ""]]}, {"id": "2107.11255", "submitter": "Ge-Zhi Wu", "authors": "Ge-zhi Wu and Da-ming You", "title": "Margin Trading, Short-Selling and Corporate Green Innovation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.GN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper uses the panel data of Chinese listed companies from 2007 to 2019,\nuses the relaxation of China's margin trading and Short-Selling restrictions as\nthe basis of quasi experimental research, and then constructs a double\ndifference model to analyze whether the margin trading and Short-Selling will\nencourage enterprises to engage in green technology innovation activities.\nFirstly, our research results show that after the implementation of the margin\ntrading and Short-Selling, the green technology innovation behavior of pilot\ncompanies will increase significantly. We believe that the short selling threat\nand pressure brought by short selling to enterprises are the main reasons for\npilot enterprises to engage in green technology innovation. Secondly, the\nempirical results show that the implementation of margin trading and\nShort-Selling restrictions will significantly promote the number of green\ntechnology innovation of pilot enterprises, but will not promote the quality of\ngreen technology innovation of pilot enterprises. Furthermore, we analyze the\ndifference of the impact of margin trading and Short-Selling restrictions on\nthe number of green technology innovation of pilot enterprises in different\nperiods. Finally, we find that the yield gap between financial assets and\noperating assets, the risk of stock price decline, management shareholding,\ninstitutional shareholding ratio, weak product market competition and bull\nmarket will affect the role of short selling in promoting green technology\ninnovation of pilot enterprises.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jul 2021 14:15:00 GMT"}], "update_date": "2021-07-26", "authors_parsed": [["Wu", "Ge-zhi", ""], ["You", "Da-ming", ""]]}, {"id": "2107.12516", "submitter": "Bruce Knuteson", "authors": "Bruce Knuteson", "title": "They Chose to Not Tell You", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The world's stock markets display a strikingly suspicious, decades long\npattern of overnight and intraday returns that nobody (other than us) has\nplausibly explained and that nobody (other than us) has clearly and\npersistently alerted you to. We use correspondence on this topic over the past\nfive years to show that the silence of others on this issue does not arise from\ntheir having a good reason to believe this pattern is fine. Separately, and\nregardless of whether this pattern turns out to be fine, we have documented\nthat people in a position to alert you to the presence of strikingly suspicious\nreturn patterns in the world's stock markets that nobody can innocuously\nexplain are aware of this issue, have no good reason to believe it is not a\nproblem, and chose to not tell you.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jul 2021 23:40:06 GMT"}], "update_date": "2021-07-28", "authors_parsed": [["Knuteson", "Bruce", ""]]}, {"id": "2107.12899", "submitter": "Dana Uhlig", "authors": "Alois Pichler and Dana Uhlig", "title": "Mortality in Germany during the Covid-19 pandemic", "comments": "19 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Covid-19 pandemic still causes severe impacts on society and the economy.\nThis paper studies excess mortality during the pandemic years 2020 and 2021 in\nGermany empirically with a special focus on the life insurer's perspective. Our\nconclusions are based on official counts of German governmental offices on the\nliving and deaths of the entire population. Conclusions, relevant for actuaries\nand specific insurance business lines, including portfolios of pension, life,\nand health insurance contracts, are provided.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2021 13:20:38 GMT"}], "update_date": "2021-07-28", "authors_parsed": [["Pichler", "Alois", ""], ["Uhlig", "Dana", ""]]}, {"id": "2107.13673", "submitter": "Luisa Fernanda Roa Ballen", "authors": "Jaime D. Acevedo-Viloria, Luisa Roa, Soji Adeshina, Cesar Charalla\n  Olazo, Andr\\'es Rodr\\'iguez-Rey, Jose Alberto Ramos, Alejandro Correa-Bahnsen", "title": "Relational Graph Neural Networks for Fraud Detection in a Super-Appe\n  nvironment", "comments": "Accepted to be appeared in 2021 KDD Workshop on ML in Finance", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-fin.GN", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Large digital platforms create environments where different types of user\ninteractions are captured, these relationships offer a novel source of\ninformation for fraud detection problems. In this paper we propose a framework\nof relational graph convolutional networks methods for fraudulent behaviour\nprevention in the financial services of a Super-App. To this end, we apply the\nframework on different heterogeneous graphs of users, devices, and credit\ncards; and finally use an interpretability algorithm for graph neural networks\nto determine the most important relations to the classification task of the\nusers. Our results show that there is an added value when considering models\nthat take advantage of the alternative data of the Super-App and the\ninteractions found in their high connectivity, further proofing how they can\nleverage that into better decisions and fraud detection strategies.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2021 00:02:06 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Acevedo-Viloria", "Jaime D.", ""], ["Roa", "Luisa", ""], ["Adeshina", "Soji", ""], ["Olazo", "Cesar Charalla", ""], ["Rodríguez-Rey", "Andrés", ""], ["Ramos", "Jose Alberto", ""], ["Correa-Bahnsen", "Alejandro", ""]]}, {"id": "2107.14109", "submitter": "Omer Aydin", "authors": "Suleyman Yukcu, Omer Aydin", "title": "Digital Twin As A Cost Reduction Method", "comments": "Digital Twin, Cost Accounting, Cyber Physical Systems, Artificial\n  Intelligence, Internet of Things, Sensor", "journal-ref": "Muhasebe Bilim Dunyas{\\i} Dergisi , 22 (3) , 563-579", "doi": "10.31460/mbdd.694571", "report-no": null, "categories": "cs.OH econ.GN q-fin.EC q-fin.GN", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Many fields have been affected by the introduction of concepts such as\nsensors, industry 4.0, internet of things, machine learning and artificial\nintelligence in recent years. As a result of the interaction of cyber physical\nsystems with these concepts, digital twin model has emerged. The concept of\ndigital twin has been used in many areas with its emergence. The use of this\nmodel has made significant gains, especially in decision making processes. The\ngains in decision making processes contribute to every field and cause changes\nin terms of cost. In this study, the historical development of the concept of\ndigital twin has been mentioned and general information about the usage areas\nof digital twin has been given. In the light of this information, the cost\neffect of the digital twin model, therefore its appearance from the cost\naccounting window and its use as a cost reduction method were evaluated. This\nstudy was carried out in order to shed light on the studies with the\ninsufficient resources in the Turkish literature and the cost accounting\nperspective.\n", "versions": [{"version": "v1", "created": "Sat, 10 Jul 2021 22:01:34 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Yukcu", "Suleyman", ""], ["Aydin", "Omer", ""]]}]