[{"id": "1110.1029", "submitter": "Benedikt Meurer", "authors": "Marcell Fischbach, Benedikt Meurer", "title": "Towards a native toplevel for the OCaml language", "comments": "10 pages, 5 figures, technical report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PL cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the current state of our work on an interactive toplevel\nfor the OCaml language based on the optimizing native code compiler and\nruntime. Our native toplevel is up to 100 times faster than the default OCaml\ntoplevel, which is based on the byte code compiler and interpreter. It uses\nJust-In-Time techniques to compile toplevel phrases to native code at runtime,\nand currently works with various Unix-like systems running on x86 or x86-64\nprocessors.\n", "versions": [{"version": "v1", "created": "Wed, 5 Oct 2011 16:05:41 GMT"}, {"version": "v2", "created": "Thu, 27 Oct 2011 16:09:44 GMT"}], "update_date": "2011-10-28", "authors_parsed": [["Fischbach", "Marcell", ""], ["Meurer", "Benedikt", ""]]}, {"id": "1110.1277", "submitter": "Amel Ben Hadj Salem Mhamdia", "authors": "Amel Ben Hadj Salem-Mhamdia, Bahia Bejar Ghadhab", "title": "Performance improvement of the software development project using the\n  Value Management approach", "comments": null, "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 8,\n  Issue 3, No. 2, 2011, 298-306", "doi": null, "report-no": null, "categories": "cs.SE cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Improving performance and delivering value for customers have become a\ncentral theme in business. The software industry has become an increasingly\nimportant sector for the economy growth in Tunisia. This study aims to show how\nusing Value Management in the Tunisian software industry for project analysis\ngives new insight about true project value and performance. This new approach\nis considered as an appropriate tool for guiding the process of making\ndecisions. It offers tools in order to analyze the service value from the\ncustomer and organization perspectives. The results showed that the VM allows\nto have better performance in the software development project by linking\ncustomer satisfaction and cost analysis. The present case shows to service\nmanagers how they can benchmark project function to reduce their costs and\nimprove resource allocation taking into consideration what customers consider\nimportant during their overall service experience. It can identify best\nprofessional practices, orient decisions to improve service value\n", "versions": [{"version": "v1", "created": "Wed, 5 Oct 2011 07:25:37 GMT"}], "update_date": "2011-10-07", "authors_parsed": [["Salem-Mhamdia", "Amel Ben Hadj", ""], ["Ghadhab", "Bahia Bejar", ""]]}, {"id": "1110.2753", "submitter": "Bruce Hajek", "authors": "Ji Zhu and Bruce Hajek", "title": "Stability of a Peer-to-Peer Communication System", "comments": "33 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper focuses on the stationary portion of file download in an\nunstructured peer-to-peer network, which typically follows for many hours after\na flash crowd initiation. The model includes the case that peers can have some\npieces at the time of arrival. The contribution of the paper is to identify how\nmuch help is needed from the seeds, either fixed seeds or peer seeds (which are\npeers remaining in the system after obtaining a complete collection) to\nstabilize the system. The dominant cause for instability is the missing piece\nsyndrome, whereby one piece becomes very rare in the network. It is shown that\nstability can be achieved with only a small amount of help from peer\nseeds--even with very little help from a fixed seed, peers need dwell as peer\nseeds on average only long enough to upload one additional piece. The region of\nstability is insensitive to the piece selection policy. Network coding can\nsubstantially increase the region of stability in case a portion of the new\npeers arrive with randomly coded pieces.\n", "versions": [{"version": "v1", "created": "Wed, 12 Oct 2011 18:47:23 GMT"}, {"version": "v2", "created": "Sun, 6 May 2012 03:53:44 GMT"}], "update_date": "2012-05-08", "authors_parsed": [["Zhu", "Ji", ""], ["Hajek", "Bruce", ""]]}, {"id": "1110.3711", "submitter": "Alejandro J.C. Crespo", "authors": "Jose M. Dom\\'inguez, Alejandro J.C. Crespo and Moncho G\\'omez-Gesteira", "title": "Optimization strategies for parallel CPU and GPU implementations of a\n  meshfree particle method", "comments": "18 pages, 21 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Much of the current focus in high performance computing (HPC) for\ncomputational fluid dynamics (CFD) deals with grid based methods. However,\nparallel implementations for new meshfree particle methods such as Smoothed\nParticle Hydrodynamics (SPH) are less studied. In this work, we present\noptimizations for both central processing unit (CPU) and graphics processing\nunit (GPU) of a SPH method. These optimization strategies can be further\napplied to many other meshfree methods. The obtained performance for each\narchitecture and a comparison between the most efficient implementations for\nCPU and GPU are shown.\n", "versions": [{"version": "v1", "created": "Mon, 17 Oct 2011 15:54:48 GMT"}, {"version": "v2", "created": "Tue, 18 Oct 2011 09:49:40 GMT"}, {"version": "v3", "created": "Fri, 18 Nov 2011 08:32:50 GMT"}], "update_date": "2011-11-21", "authors_parsed": [["Domínguez", "Jose M.", ""], ["Crespo", "Alejandro J. C.", ""], ["Gómez-Gesteira", "Moncho", ""]]}, {"id": "1110.4245", "submitter": "Luojie Xiang", "authors": "Luojie Xiang, Brian Kurkoski", "title": "An Improved Analytical Expression for Write Amplification in NAND Flash", "comments": "5 pages, 5 figures, accepted by ICNC 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Agarwal et al. gave an closed-form expression for write amplification in NAND\nflash memory by finding the probability of a page being valid over the whole\nflash memory. This paper gives an improved analytic expression for write\namplification in NAND flash memory by finding the probability of a page being\ninvalid over the block selected for garbage collection. The improved expression\nuses Lambert W function. Through asymptotic analysis, write amplification is\nshown to depend on overprovisioning factor only, consistent with the previous\nwork. Comparison with numerical simulations shows that the improved expression\nachieves a more accurate prediction of write amplification. For example, when\nthe overprovisioning factor is 0.3, the expression proposed by this paper gives\na write amplification of 2.36 whereas that of the previous work gives 2.17,\nwhen the actual value is 2.35.\n", "versions": [{"version": "v1", "created": "Wed, 19 Oct 2011 11:33:43 GMT"}], "update_date": "2011-10-20", "authors_parsed": [["Xiang", "Luojie", ""], ["Kurkoski", "Brian", ""]]}, {"id": "1110.4535", "submitter": "Ying Cui", "authors": "Ying Cui, Vincent K. N. Lau, Rui Wang, Huang Huang, Shunqing Zhang", "title": "A Survey on Delay-Aware Resource Control for Wireless Systems --- Large\n  Deviation Theory, Stochastic Lyapunov Drift and Distributed Stochastic\n  Learning", "comments": "58 pages, 8 figures; IEEE Transactions on Information Theory, 2011", "journal-ref": null, "doi": "10.1109/TIT.2011.2178150", "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this tutorial paper, a comprehensive survey is given on several major\nsystematic approaches in dealing with delay-aware control problems, namely the\nequivalent rate constraint approach, the Lyapunov stability drift approach and\nthe approximate Markov Decision Process (MDP) approach using stochastic\nlearning. These approaches essentially embrace most of the existing literature\nregarding delay-aware resource control in wireless systems. They have their\nrelative pros and cons in terms of performance, complexity and implementation\nissues. For each of the approaches, the problem setup, the general solution and\nthe design methodology are discussed. Applications of these approaches to\ndelay-aware resource allocation are illustrated with examples in single-hop\nwireless networks. Furthermore, recent results regarding delay-aware multi-hop\nrouting designs in general multi-hop networks are elaborated. Finally, the\ndelay performance of the various approaches are compared through simulations\nusing an example of the uplink OFDMA systems.\n", "versions": [{"version": "v1", "created": "Thu, 20 Oct 2011 14:09:02 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Cui", "Ying", ""], ["Lau", "Vincent K. N.", ""], ["Wang", "Rui", ""], ["Huang", "Huang", ""], ["Zhang", "Shunqing", ""]]}, {"id": "1110.6265", "submitter": "Wojciech Mazurczyk", "authors": "Wojciech Mazurczyk, Pawel Kopiczko", "title": "Understanding BitTorrent Through Real Measurements", "comments": "11 pages, 9 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper the results of the BitTorrent measurement study are presented.\nTwo sources of BitTorrent data were utilized: meta-data files that describe the\ncontent of resources shared by BitTorrent users and the logs of one of the\ncurrently most popular BitTorrent clients - {\\mu}Torrent. {\\mu}Torrent is\nfounded upon a rather newly released UDP-based {\\mu}TP protocol that is claimed\nto be more efficient than TCP-based clients. Experimental data have been\ncollected for fifteen days from the popular torrent-discovery site\nthepiratebay.org (more than 30,000 torrents were captured and analyzed). During\nthis period the activity and logs of an unmodified version of {\\mu}Torrent\nclient downloading sessions have been also captured. The obtained experimental\nresults are swarm-oriented (not tracker-oriented as has been previously\nresearched), which has allowed us to look at BitTorrent and its users from an\nexchanged resources perspective. Moreover, comparative analysis of the clients'\nconnections with and without {\\mu}TP protocol is carried out to verify to what\nextent {\\mu}TP improves BitTorrent transmissions. To the authors' best\nknowledge, none of the previous studies have addressed these issues.\n", "versions": [{"version": "v1", "created": "Fri, 28 Oct 2011 07:03:15 GMT"}, {"version": "v2", "created": "Wed, 2 Nov 2011 12:13:51 GMT"}, {"version": "v3", "created": "Tue, 18 Jun 2013 08:49:29 GMT"}], "update_date": "2013-06-19", "authors_parsed": [["Mazurczyk", "Wojciech", ""], ["Kopiczko", "Pawel", ""]]}, {"id": "1110.6544", "submitter": "Md Asaduzzaman", "authors": "Md Asaduzzaman and Thierry J Chaussalet", "title": "A Generalized Loss Network Model with Overflow for Capacity Planning of\n  a Perinatal Network", "comments": "21 pages, 4 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a generalized loss network framework for capacity planning of a\nperinatal network in the UK. Decomposing the network by hospitals, each unit is\nanalyzed with a GI/G/c/0 overflow loss network model. A two-moment\napproximation is performed to obtain the steady state solution of the GI/G/c/0\nloss systems, and expressions for rejection probability and overflow\nprobability have been derived. Using the model framework, the number of\nrequired cots can be estimated based on the rejection probability at each level\nof care of the neonatal units in a network. The generalization ensures that the\nmodel can be applied to any perinatal network for renewal arrival and discharge\nprocesses.\n", "versions": [{"version": "v1", "created": "Sat, 29 Oct 2011 18:22:36 GMT"}, {"version": "v2", "created": "Thu, 24 Nov 2011 13:24:26 GMT"}], "update_date": "2011-11-28", "authors_parsed": [["Asaduzzaman", "Md", ""], ["Chaussalet", "Thierry J", ""]]}]