[{"id": "0708.0998", "submitter": "Jan Ob{\\l}\\'oj", "authors": "Jan Obloj", "title": "Fine-tune your smile: Correction to Hagan et al", "comments": "Typos and reference corrected. Eq (3) valid for all x now", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.PR q-fin.ST", "license": null, "abstract": "  In this small note we use results derived in Berestycki et al. to correct the\ncelebrated formulae of Hagan et al. We derive explicitly the correct zero order\nterm in the expansion of the implied volatility in time to maturity. The new\nterm is consistent as $\\beta\\to 1$. Furthermore, numerical simulations show\nthat it reduces or eliminates known pathologies of the earlier formula.\n", "versions": [{"version": "v1", "created": "Tue, 7 Aug 2007 17:50:32 GMT"}, {"version": "v2", "created": "Thu, 13 Sep 2007 16:57:19 GMT"}, {"version": "v3", "created": "Tue, 18 Mar 2008 15:25:33 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Obloj", "Jan", ""]]}, {"id": "0708.4022", "submitter": "Gilles Zumbach", "authors": "Gilles Zumbach", "title": "Time reversal invariance in finance", "comments": "23 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.soc-ph q-fin.CP", "license": null, "abstract": "  Time reversal invariance can be summarized as follows: no difference can be\nmeasured if a sequence of events is run forward or backward in time. Because\nprice time series are dominated by a randomness that hides possible structures\nand orders, the existence of time reversal invariance requires care to be\ninvestigated. Different statistics are constructed with the property to be zero\nfor time series which are time reversal invariant; they all show that\nhigh-frequency empirical foreign exchange prices are not invariant. The same\nstatistics are applied to mathematical processes that should mimic empirical\nprices. Monte Carlo simulations show that only some ARCH processes with a\nmulti-timescales structure can reproduce the empirical findings. A GARCH(1,1)\nprocess can only reproduce some asymmetry. On the other hand, all the\nstochastic volatility type processes are time reversal invariant. This clear\ndifference related to the process structures gives some strong selection\ncriterion for processes.\n", "versions": [{"version": "v1", "created": "Wed, 29 Aug 2007 20:34:02 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Zumbach", "Gilles", ""]]}]