[{"id": "0805.0540", "submitter": "Giacomo Bormetti", "authors": "Giacomo Bormetti, Valentina Cazzola, Guido Montagna and Oreste\n  Nicrosini", "title": "Probability distribution of returns in the exponential\n  Ornstein-Uhlenbeck model", "comments": "26 pages, 9 figures and 3 tables. New section with real data analysis\n  and related references added, some minor typos corrected. Accepted for\n  publication on JSTAT", "journal-ref": "J. Stat. Mech. (2008) P11013", "doi": "10.1088/1742-5468/2008/11/P11013", "report-no": "FNT/T 2008/03", "categories": "q-fin.CP cond-mat.stat-mech physics.soc-ph q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the problem of the analytical characterization of the probability\ndistribution of financial returns in the exponential Ornstein-Uhlenbeck model\nwith stochastic volatility. In this model the prices are driven by a Geometric\nBrownian motion, whose diffusion coefficient is expressed through an\nexponential function of an hidden variable Y governed by a mean-reverting\nprocess. We derive closed-form expressions for the probability distribution and\nits characteristic function in two limit cases. In the first one the\nfluctuations of Y are larger than the volatility normal level, while the second\none corresponds to the assumption of a small stationary value for the variance\nof Y. Theoretical results are tested numerically by intensive use of Monte\nCarlo simulations. The effectiveness of the analytical predictions is checked\nvia a careful analysis of the parameters involved in the numerical\nimplementation of the Euler-Maruyama scheme and is tested on a data set of\nfinancial indexes. In particular, we discuss results for the German DAX30 and\nDow Jones Euro Stoxx 50, finding a good agreement between the empirical data\nand the theoretical description.\n", "versions": [{"version": "v1", "created": "Mon, 5 May 2008 14:13:40 GMT"}, {"version": "v2", "created": "Thu, 30 Oct 2008 10:14:21 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Bormetti", "Giacomo", ""], ["Cazzola", "Valentina", ""], ["Montagna", "Guido", ""], ["Nicrosini", "Oreste", ""]]}, {"id": "0805.0611", "submitter": "Daniel Sevcovic", "authors": "Daniel Sevcovic", "title": "Transformation methods for evaluating approximations to the optimal\n  exercise boundary for linear and nonlinear Black-Scholes equations", "comments": "submitted to: Nonlinear Models in Mathematical Finance: New Research\n  Trends in Option Pricing", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.AP math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this survey chapter is to present a transformation technique\nthat can be used in analysis and numerical computation of the early exercise\nboundary for an American style of vanilla options that can be modelled by class\nof generalized Black-Scholes equations. We analyze qualitatively and\nquantitatively the early exercise boundary for a linear as well as a class of\nnonlinear Black-Scholes equations with a volatility coefficient which can be a\nnonlinear function of the second derivative of the option price itself. A\nmotivation for studying the nonlinear Black-Scholes equation with a nonlinear\nvolatility arises from option pricing models taking into account e.g.\nnontrivial transaction costs, investor's preferences, feedback and illiquid\nmarkets effects and risk from a volatile (unprotected) portfolio. We present a\nmethod how to transform the free boundary problem for the early exercise\nboundary position into a solution of a time depending nonlinear nonlocal\nparabolic equation defined on a fixed domain. We furthermore propose an\niterative numerical scheme that can be used in order to find an approximation\nof the free boundary. In the case of a linear Black-Scholes equation we are\nable to derive a nonlinear integral equation for the position of the free\nboundary. We present results of numerical approximation of the early exercise\nboundary for various types of linear and nonlinear Black-Scholes equations and\nwe discuss dependence of the free boundary on model parameters. Finally, we\ndiscuss an application of the transformation method for the pricing equation\nfor American type of Asian options.\n", "versions": [{"version": "v1", "created": "Mon, 5 May 2008 22:10:49 GMT"}], "update_date": "2008-12-10", "authors_parsed": [["Sevcovic", "Daniel", ""]]}]