[{"id": "0812.0033", "submitter": "Constantinos Kardaras", "authors": "Constantinos Kardaras, Eckhard Platen", "title": "Multiplicative approximation of wealth processes involving no-short-sale\n  strategies via simple trading", "comments": "11 pages. Revised version. This is the 2nd part of what comprised the\n  older arxiv submission \"On financial markets where only buy-and-hold trading\n  is possible\" from the two authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A financial market model with general semimartingale asset-price processes\nand where agents can only trade using no-short-sales strategies is considered.\nWe show that wealth processes using continuous trading can be approximated very\nclosely by wealth processes using simple combinations of buy-and-hold trading.\nThis approximation is based on controlling the proportions of wealth invested\nin the assets. As an application, the utility maximization problem is\nconsidered and it is shown that optimal expected utilities and wealth processes\nresulting from continuous trading can be approximated arbitrarily well by the\nuse of simple combinations of buy-and-hold strategies.\n", "versions": [{"version": "v1", "created": "Sat, 29 Nov 2008 00:17:29 GMT"}, {"version": "v2", "created": "Tue, 23 Mar 2010 04:15:31 GMT"}], "update_date": "2010-03-24", "authors_parsed": [["Kardaras", "Constantinos", ""], ["Platen", "Eckhard", ""]]}, {"id": "0812.2000", "submitter": "Mark B. Wise", "authors": "Mark B. Wise and Vineer Bhansali", "title": "Correlated Random Walks and the Joint Survival Probability", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  First passage models, where corporate assets undergo correlated random walks\nand a company defaults if its assets fall below a threshold provide an\nattractive framework for modeling the default process. Typical one year default\ncorrelations are small, i.e., of order a few percent, but nonetheless including\ncorrelations is very important, for managing portfolio credit risk and pricing\nsome credit derivatives (e.g. first to default baskets). In first passage\nmodels the exact dependence of the joint survival probability of more than two\nfirms on their asset correlations is not known. We derive an expression for the\ndependence of the joint survival probability of $n$ firms on their asset\ncorrelations using first order perturbation theory in the correlations. It\nincludes all terms that are linear in the correlations but neglects effects of\nquadratic and higher order. For constant time independent correlations we\ncompare the first passage model expression for the joint survival probability\nwith what a multivariate normal Copula function gives. As a practical\napplication of our results we calculate the dependence of the five year joint\nsurvival probability for five basic industrials on their asset correlations.\n", "versions": [{"version": "v1", "created": "Wed, 10 Dec 2008 19:22:03 GMT"}], "update_date": "2008-12-11", "authors_parsed": [["Wise", "Mark B.", ""], ["Bhansali", "Vineer", ""]]}, {"id": "0812.2444", "submitter": "Alexandre Roch", "authors": "Alexandre F. Roch", "title": "Viscosity Solutions and American Option Pricing in a Stochastic\n  Volatility Model of the Ornstein-Uhlenbeck Type", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the valuation of American type derivatives in the\nstochastic volatility model of Barndorff-Nielsen and Shephard (2001). We\ncharacterize the value of such derivatives as the unique viscosity solution of\nan integral-partial differential equation when the payoff function satisfies a\nLipschitz condition.\n", "versions": [{"version": "v1", "created": "Fri, 12 Dec 2008 18:11:47 GMT"}], "update_date": "2008-12-15", "authors_parsed": [["Roch", "Alexandre F.", ""]]}, {"id": "0812.3083", "submitter": "Carlo Sgarra", "authors": "Edie Miglio, Carlo Sgarra", "title": "A Finite Element Framework for Option Pricing with the Bates Model", "comments": "15 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present paper we present a finite element approach for option pricing\nin the framework of a well-known stochastic volatility model with jumps, the\nBates model. In this model the asset log-returns are assumed to follow a\njump-diffusion model where the jump component consists of a Levy process of\ncompound Poisson type, while the volatility behavior is described by a\nstochastic differential equation of CIR type, with a mean-reverting drift term\nand a diffusion component correlated with that of the log-returns. Like in all\nthe Levy models, the option pricing problem can be formulated in terms of an\nintegro-differential equation: for the Bates model the unknown F(S, V, t) (the\noption price) of the pricing equation depends on three independent variables\nand the differential operator part turns out to be of parabolic kind, while the\nnonlocal integral operator is calculated with respect to the Levy measure of\nthe jumps. In this paper we will present a variational formulation of the\nproblem suitable for a finite element approach. The numerical results obtained\nfor european options will be compared with those obtained with different\nmethods.\n", "versions": [{"version": "v1", "created": "Tue, 16 Dec 2008 15:16:59 GMT"}], "update_date": "2008-12-17", "authors_parsed": [["Miglio", "Edie", ""], ["Sgarra", "Carlo", ""]]}, {"id": "0812.3117", "submitter": "Martijn Pistorius", "authors": "Marc Jeannin and Martijn Pistorius", "title": "Pricing and hedging barrier options in a hyper-exponential additive\n  model", "comments": "26 pages, 8 figures. To appear in IJTAF", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we develop an algorithm to calculate the prices and Greeks of\nbarrier options in a hyper-exponential additive model with piecewise constant\nparameters. We obtain an explicit semi-analytical expression for the\nfirst-passage probability. The solution rests on a randomization and an\nexplicit matrix Wiener-Hopf factorization. Employing this result we derive\nexplicit expressions for the Laplace-Fourier transforms of the prices and\nGreeks of barrier options. As a numerical illustration, the prices and Greeks\nof down-and-in digital and down-and-in call options are calculated for a set of\nparameters obtained by a simultaneous calibration to Stoxx50E call options\nacross strikes and four different maturities. By comparing the results with\nMonte-Carlo simulations, we show that the method is fast, accurate, and stable.\n", "versions": [{"version": "v1", "created": "Tue, 16 Dec 2008 18:02:36 GMT"}, {"version": "v2", "created": "Thu, 31 Dec 2009 12:27:56 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Jeannin", "Marc", ""], ["Pistorius", "Martijn", ""]]}, {"id": "0812.3128", "submitter": "Martijn Pistorius", "authors": "Marc Jeannin and Martijn Pistorius", "title": "A transform approach to compute prices and greeks of barrier options\n  driven by a class of Levy processes", "comments": "27 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a transform method to compute the prices and greeks\nof barrier options driven by a class of Levy processes. We derive analytical\nexpressions for the Laplace transforms in time of the prices and sensitivities\nof single barrier options in an exponential Levy model with hyper-exponential\njumps. Inversion of these single Laplace transform yields rapid, accurate\nresults. These results are employed to construct an approximation of the prices\nand sensitivities of barrier options in exponential generalised\nhyper-exponential (GHE) Levy models. The latter class includes many of the Levy\nmodels employed in quantitative finance such as the variance gamma (VG), KoBoL,\ngeneralised hyperbolic, and the normal inverse Gaussian (NIG) models.\nConvergence of the approximating prices and sensitivities is proved. To provide\na numerical illustration, this transform approach is compared with Monte Carlo\nsimulation in the cases that the driving process is a VG and a NIG Levy\nprocess. Parameters are calibrated to Stoxx50E call options.\n", "versions": [{"version": "v1", "created": "Tue, 16 Dec 2008 18:51:05 GMT"}, {"version": "v2", "created": "Fri, 13 Mar 2009 15:31:24 GMT"}], "update_date": "2009-03-13", "authors_parsed": [["Jeannin", "Marc", ""], ["Pistorius", "Martijn", ""]]}, {"id": "0812.3381", "submitter": "Noufel Frikha", "authors": "Olivier Aj Bardou (PMA, GDF-RDD), Noufel Frikha (PMA, GDF-RDD), G.\n  Pag\\`es (PMA)", "title": "Computation of VaR and CVaR using stochastic approximations and\n  unconstrained importance sampling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Value-at-Risk (VaR) and Conditional Value-at-Risk (CVaR) are two risk\nmeasures which are widely used in the practice of risk management. This paper\ndeals with the problem of computing both VaR and CVaR using stochastic\napproximation (with decreasing steps): we propose a first Robbins-Monro\nprocedure based on Rockaffelar-Uryasev's identity for the CVaR. The convergence\nrate of this algorithm to its target satisfies a Gaussian Central Limit\nTheorem. As a second step, in order to speed up the initial procedure, we\npropose a recursive importance sampling (I.S.) procedure which induces a\nsignificant variance reduction of both VaR and CVaR procedures. This idea,\nwhich goes back to the seminal paper of B. Arouna, follows a new approach\nintroduced by V. Lemaire and G. Pag\\`es. Finally, we consider a deterministic\nmoving risk level to speed up the initialization phase of the algorithm. We\nprove that the convergence rate of the resulting procedure is ruled by a\nCentral Limit Theorem with minimal variance and its efficiency is illustrated\nby considering several typical energy portfolios.\n", "versions": [{"version": "v1", "created": "Wed, 17 Dec 2008 20:02:40 GMT"}, {"version": "v2", "created": "Fri, 23 Jan 2009 16:22:07 GMT"}, {"version": "v3", "created": "Fri, 27 Feb 2009 15:14:44 GMT"}, {"version": "v4", "created": "Sat, 7 Nov 2009 05:54:26 GMT"}, {"version": "v5", "created": "Fri, 3 Dec 2010 11:26:07 GMT"}], "update_date": "2010-12-06", "authors_parsed": [["Bardou", "Olivier Aj", "", "PMA, GDF-RDD"], ["Frikha", "Noufel", "", "PMA, GDF-RDD"], ["Pagès", "G.", "", "PMA"]]}, {"id": "0812.4050", "submitter": "Damiano  Brigo", "authors": "Damiano Brigo and Bernard Hanzon", "title": "On three filtering problems arising in mathematical finance", "comments": "A short version appeared in \"Insurance. Mathematics and Economics\",\n  22 (1) (1998) pp. 53-64", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Three situations in which filtering theory is used in mathematical finance\nare illustrated at different levels of detail. The three problems originate\nfrom the following different works: 1) On estimating the stochastic volatility\nmodel from observed bilateral exchange rate news, by R. Mahieu, and P.\nSchotman; 2) A state space approach to estimate multi-factors CIR models of the\nterm structure of interest rates, by A.L.J. Geyer, and S. Pichler; 3)\nRisk-minimizing hedging strategies under partial observation in pricing\nfinancial derivatives, by P. Fischer, E. Platen, and W. J. Runggaldier; In the\nfirst problem we propose to use a recent nonlinear filtering technique based on\ngeometry to estimate the volatility time series from observed bilateral\nexchange rates. The model used here is the stochastic volatility model. The\nfilters that we propose are known as projection filters, and a brief derivation\nof such filters is given. The second problem is introduced in detail, and a\npossible use of different filtering techniques is hinted at. In fact the\nfilters used for this problem in 2) and part of the literature can be\ninterpreted as projection filters and we will make some remarks on how more\ngeneral and possibly more suitable projection filters can be constructed. The\nthird problem is only presented shortly.\n", "versions": [{"version": "v1", "created": "Sun, 21 Dec 2008 18:55:04 GMT"}], "update_date": "2008-12-23", "authors_parsed": [["Brigo", "Damiano", ""], ["Hanzon", "Bernard", ""]]}, {"id": "0812.4052", "submitter": "Damiano  Brigo", "authors": "Damiano Brigo", "title": "The general mixture-diffusion SDE and its relationship with an\n  uncertain-volatility option model with volatility-asset decorrelation", "comments": null, "journal-ref": "Related publication in Brigo, D., Mercurio, F., and Sartorelli,\n  G., Alternative Asset Price Dynamics and Volatility Smile, Quantitative\n  Finance, Vol 3, N. 3. (2003) pp. 173-183", "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present paper, given an evolving mixture of probability densities, we\ndefine a candidate diffusion process whose marginal law follows the same\nevolution. We derive as a particular case a stochastic differential equation\n(SDE) admitting a unique strong solution and whose density evolves as a mixture\nof Gaussian densities. We present an interesting result on the comparison\nbetween the instantaneous and the terminal correlation between the obtained\nprocess and its squared diffusion coefficient. As an application to\nmathematical finance, we construct diffusion processes whose marginal densities\nare mixtures of lognormal densities. We explain how such processes can be used\nto model the market smile phenomenon. We show that the lognormal mixture\ndynamics is the one-dimensional diffusion version of a suitable uncertain\nvolatility model, and suitably reinterpret the earlier correlation result. We\nexplore numerically the relationship between the future smile structures of\nboth the diffusion and the uncertain volatility versions.\n", "versions": [{"version": "v1", "created": "Sun, 21 Dec 2008 19:20:58 GMT"}], "update_date": "2008-12-23", "authors_parsed": [["Brigo", "Damiano", ""]]}, {"id": "0812.4156", "submitter": "Damiano  Brigo", "authors": "Massimo Morini and Damiano Brigo", "title": "Arbitrage-free Pricing of Credit Index Options: The no-armageddon\n  pricing measure and the role of correlation after the subprime crisis", "comments": "Updated version accepted for publication in Mathematical Finance", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we consider three problems of the standard market approach to\npricing of credit index options: the definition of the index spread is not\nvalid in general, the usually considered payoff leads to a pricing which is not\nalways defined, and the candidate numeraire one would use to define a pricing\nmeasure is not strictly positive, which would lead to a non-equivalent pricing\nmeasure.\n  We give a general mathematical solution to the three problems, based on a\nnovel way of modeling the flow of information through the definition of a new\nsubfiltration. Using this subfiltration, we take into account consistently the\npossibility of default of all names in the portfolio, that is neglected in the\nstandard market approach. We show that, while the related mispricing can be\nnegligible for standard options in normal market conditions, it can become\nhighly relevant for different options or in stressed market conditions.\n  In particular, we show on 2007 market data that after the subprime credit\ncrisis the mispricing of the market formula compared to the no arbitrage\nformula we propose has become financially relevant even for the liquid\nCrossover Index Options.\n", "versions": [{"version": "v1", "created": "Mon, 22 Dec 2008 11:19:35 GMT"}], "update_date": "2008-12-23", "authors_parsed": [["Morini", "Massimo", ""], ["Brigo", "Damiano", ""]]}, {"id": "0812.4163", "submitter": "Damiano  Brigo", "authors": "Damiano Brigo, Andrea Pallavicini and Roberto Torresetti", "title": "Default correlation, cluster dynamics and single names: The GPCL\n  dynamical loss model", "comments": null, "journal-ref": "Short version in \"International Journal of Theoretical and Applied\n  Finance\", Vol 10, n. 4, and in \"Credit Correlation - Life After Copulas\",\n  World Scientific, 2007", "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend the common Poisson shock framework reviewed for example in Lindskog\nand McNeil (2003) to a formulation avoiding repeated defaults, thus obtaining a\nmodel that can account consistently for single name default dynamics, cluster\ndefault dynamics and default counting process. This approach allows one to\nintroduce significant dynamics, improving on the standard \"bottom-up\"\napproaches, and to achieve true consistency with single names, improving on\nmost \"top-down\" loss models. Furthermore, the resulting GPCL model has\nimportant links with the previous GPL dynamical loss model in Brigo,\nPallavicini and Torresetti (2006a,b), which we point out. Model extensions\nallowing for more articulated spread and recovery dynamics are hinted at.\nCalibration to both DJi-TRAXX and CDX index and tranche data across attachments\nand maturities shows that the GPCL model has the same calibration power as the\nGPL model while allowing for consistency with single names\n", "versions": [{"version": "v1", "created": "Mon, 22 Dec 2008 12:06:40 GMT"}], "update_date": "2008-12-23", "authors_parsed": [["Brigo", "Damiano", ""], ["Pallavicini", "Andrea", ""], ["Torresetti", "Roberto", ""]]}, {"id": "0812.4548", "submitter": "Martijn Pistorius", "authors": "Bjorn Eriksson, Martijn Pistorius", "title": "A method of moments approach to pricing double barrier contracts driven\n  by a general class of jump diffusions", "comments": "22 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the method of moments approach to pricing barrier-type options\nwhen the underlying is modelled by a general class of jump diffusions. By\ngeneral principles the option prices are linked to certain infinite dimensional\nlinear programming problems. Subsequently approximating those systems by finite\ndimensional linear programming problems, upper and lower bounds for the prices\nof such options are found. As numerical illustration we apply the method to the\nvaluation of several barrier-type options (double barrier knockout option,\nAmerican corridor and double no touch) under a number of different models,\nincluding a case with deterministic interest rates, and compare with Monte\nCarlo simulation results. In all cases we find tight bounds with short\nexecution times. Theoretical convergence results are also provided.\n", "versions": [{"version": "v1", "created": "Wed, 24 Dec 2008 16:57:32 GMT"}], "update_date": "2008-12-25", "authors_parsed": [["Eriksson", "Bjorn", ""], ["Pistorius", "Martijn", ""]]}]