[{"id": "0902.1721", "submitter": "Russell Behboudi", "authors": "Rasoul Behboudi, You-Lan Zhu", "title": "Existence & Regularity of Weak Solutions of Degenerate Parabolic PDE\n  Models for the Pricing of Security Derivatives", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.AP math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work is focused on the solvability of initial-boundary value problems\nfor degenerate parabolic partial differential equations that arise in the\npricing of Asian options, and on the investigation of differential and certain\nqualitative properties of solutions of such equations. The generalized\nsolvability for such models with degeneracy at the boundaries is proven by\nemploying solutions obtained from finite difference numerical schemes.\nFurthermore, the regularity of such solutions is studied.\n", "versions": [{"version": "v1", "created": "Tue, 10 Feb 2009 19:02:42 GMT"}, {"version": "v2", "created": "Wed, 11 Feb 2009 15:28:26 GMT"}], "update_date": "2009-02-11", "authors_parsed": [["Behboudi", "Rasoul", ""], ["Zhu", "You-Lan", ""]]}, {"id": "0902.3643", "submitter": "Tom Hurd", "authors": "T. R. Hurd and Zhuowei Zhou", "title": "A Fourier transform method for spread option pricing", "comments": "16 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spread options are a fundamental class of derivative contract written on\nmultiple assets, and are widely used in a range of financial markets. There is\na long history of approximation methods for computing such products, but as yet\nthere is no preferred approach that is accurate, efficient and flexible enough\nto apply in general models. The present paper introduces a new formula for\ngeneral spread option pricing based on Fourier analysis of the spread option\npayoff function. Our detailed investigation proves the effectiveness of a fast\nFourier transform implementation of this formula for the computation of prices.\nIt is found to be easy to implement, stable, efficient and applicable in a wide\nvariety of asset pricing models.\n", "versions": [{"version": "v1", "created": "Fri, 20 Feb 2009 20:47:51 GMT"}], "update_date": "2009-02-23", "authors_parsed": [["Hurd", "T. R.", ""], ["Zhou", "Zhuowei", ""]]}, {"id": "0902.4245", "submitter": "Erick Trevino Aguilar", "authors": "Erick Trevino Aguilar", "title": "T-Systems and the lower Snell envelope", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamical analysis of American options has motivated the development of\nrobust versions of the classical Snell envelopes. The cost of superhedging an\nAmerican option is characterized by the upper Snell envelope. The infimum of\nthe arbitrage free prices is characterized by the lower Snell envelope. In this\npaper we focus on the lower Snell envelope. We construct a regular version of\nthis stochastic process. To this end, we apply results due to Dellacherie and\nLenglart on regularization of stochastic processes and T -Systems.\n", "versions": [{"version": "v1", "created": "Tue, 24 Feb 2009 21:33:52 GMT"}], "update_date": "2009-02-26", "authors_parsed": [["Aguilar", "Erick Trevino", ""]]}]