[{"id": "1201.1623", "submitter": "Sergio G\\'omez", "authors": "Sergio Gomez, Justo Montiel, David Torres, Alberto Fernandez", "title": "MultiDendrograms: Variable-Group Agglomerative Hierarchical Clusterings", "comments": "Article upgraded to MultiDendrograms 3.0. Software available at\n  http://deim.urv.cat/~sgomez/multidendrograms.php", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR math.ST physics.comp-ph physics.data-an q-fin.CP stat.CO stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MultiDendrograms is a Java-written application that computes agglomerative\nhierarchical clusterings of data. Starting from a distances (or weights)\nmatrix, MultiDendrograms is able to calculate its dendrograms using the most\ncommon agglomerative hierarchical clustering methods. The application\nimplements a variable-group algorithm that solves the non-uniqueness problem\nfound in the standard pair-group algorithm. This problem arises when two or\nmore minimum distances between different clusters are equal during the\nagglomerative process, because then different output clusterings are possible\ndepending on the criterion used to break ties between distances.\nMultiDendrograms solves this problem implementing a variable-group algorithm\nthat groups more than two clusters at the same time when ties occur.\n", "versions": [{"version": "v1", "created": "Sun, 8 Jan 2012 11:03:42 GMT"}, {"version": "v2", "created": "Tue, 4 Dec 2012 15:44:04 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Gomez", "Sergio", ""], ["Montiel", "Justo", ""], ["Torres", "David", ""], ["Fernandez", "Alberto", ""]]}, {"id": "1201.2756", "submitter": "Alexander Schied", "authors": "Aur\\'elien Alfonsi (CERMICS), Alexander Schied", "title": "Capacitary measures for completely monotone kernels via singular control", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a singular control approach to the problem of minimizing an energy\nfunctional for measures with given total mass on a compact real interval, when\nenergy is defined in terms of a completely monotone kernel. This problem occurs\nboth in potential theory and when looking for optimal financial order execution\nstrategies under transient price impact. In our setup, measures or order\nexecution strategies are interpreted as singular controls, and the capacitary\nmeasure is the unique optimal control. The minimal energy, or equivalently the\ncapacity of the underlying interval, is characterized by means of a nonstandard\ninfinite-dimensional Riccati differential equation, which is analyzed in some\ndetail. We then show that the capacitary measure has two Dirac components at\nthe endpoints of the interval and a continuous Lebesgue density in between.\nThis density can be obtained as the solution of a certain Volterra integral\nequation of the second kind.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jan 2012 07:44:06 GMT"}, {"version": "v2", "created": "Thu, 19 Jan 2012 19:18:05 GMT"}, {"version": "v3", "created": "Wed, 19 Sep 2012 15:41:56 GMT"}, {"version": "v4", "created": "Mon, 25 Feb 2013 14:10:41 GMT"}], "update_date": "2013-02-26", "authors_parsed": [["Alfonsi", "Aurélien", "", "CERMICS"], ["Schied", "Alexander", ""]]}, {"id": "1201.4781", "submitter": "Jozef Barunik", "authors": "Jozef Barunik, Lukas Vacha", "title": "Monte Carlo-based tail exponent estimator", "comments": null, "journal-ref": "Physica A: Statistical Mechanics and its Applications (2010), 389\n  (21), pp. 4863-4874", "doi": "10.1016/j.physa.2010.06.054", "report-no": null, "categories": "q-fin.CP q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a new approach to estimation of the tail exponent in\nfinancial stock markets. We begin the study with the finite sample behavior of\nthe Hill estimator under {\\alpha}-stable distributions. Using large Monte Carlo\nsimulations, we show that the Hill estimator overestimates the true tail\nexponent and can hardly be used on samples with small length. Utilizing our\nresults, we introduce a Monte Carlo-based method of estimation for the tail\nexponent. Our proposed method is not sensitive to the choice of tail size and\nworks well also on small data samples. The new estimator also gives unbiased\nresults with symmetrical confidence intervals. Finally, we demonstrate the\npower of our estimator on the international world stock market indices. On the\ntwo separate periods of 2002-2005 and 2006-2009, we estimate the tail exponent.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jan 2012 17:41:59 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Barunik", "Jozef", ""], ["Vacha", "Lukas", ""]]}]