[{"id": "1204.0637", "submitter": "Masaaki Fukasawa", "authors": "Masaaki Fukasawa", "title": "Efficient Discretization of Stochastic Integrals", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.CP q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sharp asymptotic lower bounds of the expected quadratic variation of\ndiscretization error in stochastic integration are given. The theory relies on\ninequalities for the kurtosis and skewness of a general random variable which\nare themselves seemingly new. Asymptotically efficient schemes which attain the\nlower bounds are constructed explicitly. The result is directly applicable to\npractical hedging problem in mathematical finance; it gives an asymptotically\noptimal way to choose rebalancing dates and portofolios with respect to\ntransaction costs. The asymptotically efficient strategies in fact reflect the\nstructure of transaction costs. In particular a specific biased rebalancing\nscheme is shown to be superior to unbiased schemes if transaction costs follow\na convex model. The problem is discussed also in terms of the exponential\nutility maximization.\n", "versions": [{"version": "v1", "created": "Tue, 3 Apr 2012 09:40:55 GMT"}], "update_date": "2012-04-04", "authors_parsed": [["Fukasawa", "Masaaki", ""]]}, {"id": "1204.0915", "submitter": "Dan Pirjol", "authors": "Dan Pirjol", "title": "Equivalence of interest rate models and lattice gases", "comments": "7 pages, 1 figure", "journal-ref": null, "doi": "10.1103/PhysRevE.85.046116", "report-no": null, "categories": "q-fin.CP cond-mat.stat-mech math-ph math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the class of short rate interest rate models for which the short\nrate is proportional to the exponential of a Gaussian Markov process x(t) in\nthe terminal measure r(t) = a(t) exp(x(t)). These models include the Black,\nDerman, Toy and Black, Karasinski models in the terminal measure. We show that\nsuch interest rate models are equivalent with lattice gases with attractive\ntwo-body interaction V(t1,t2)= -Cov(x(t1),x(t2)). We consider in some detail\nthe Black, Karasinski model with x(t) an Ornstein, Uhlenbeck process, and show\nthat it is similar with a lattice gas model considered by Kac and Helfand, with\nattractive long-range two-body interactions V(x,y) = -\\alpha (e^{-\\gamma |x -\ny|} - e^{-\\gamma (x + y)}). An explicit solution for the model is given as a\nsum over the states of the lattice gas, which is used to show that the model\nhas a phase transition similar to that found previously in the Black, Derman,\nToy model in the terminal measure.\n", "versions": [{"version": "v1", "created": "Wed, 4 Apr 2012 10:35:09 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Pirjol", "Dan", ""]]}, {"id": "1204.1126", "submitter": "Jan Baldeaux Dr", "authors": "Jan Baldeaux and Eckhard Platen", "title": "Computing Functionals of Multidimensional Diffusions via Monte Carlo\n  Methods", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss suitable classes of diffusion processes, for which functionals\nrelevant to finance can be computed via Monte Carlo methods. In particular, we\nconstruct exact simulation schemes for processes from this class. However,\nshould the finance problem under consideration require e.g. continuous\nmonitoring of the processes, the simulation algorithm can easily be embedded in\na multilevel Monte Carlo scheme. We choose to introduce the finance problems\nunder the benchmark approach, and find that this approach allows us to exploit\nconveniently the analytical tractability of these diffusion processes.\n", "versions": [{"version": "v1", "created": "Thu, 5 Apr 2012 06:04:13 GMT"}], "update_date": "2012-04-06", "authors_parsed": [["Baldeaux", "Jan", ""], ["Platen", "Eckhard", ""]]}, {"id": "1204.1442", "submitter": "Christoph Reisinger", "authors": "Michael B. Giles and Christoph Reisinger", "title": "Stochastic finite differences and multilevel Monte Carlo for a class of\n  SPDEs in finance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we propose a Milstein finite difference scheme for a\nstochastic partial differential equation (SPDE) describing a large particle\nsystem. We show, by means of Fourier analysis, that the discretisation on an\nunbounded domain is convergent of first order in the timestep and second order\nin the spatial grid size, and that the discretisation is stable with respect to\nboundary data. Numerical experiments clearly indicate that the same convergence\norder also holds for boundary-value problems. Multilevel path simulation,\npreviously used for SDEs, is shown to give substantial complexity gains\ncompared to a standard discretisation of the SPDE or direct simulation of the\nparticle system. We derive complexity bounds and illustrate the results by an\napplication to basket credit derivatives.\n", "versions": [{"version": "v1", "created": "Fri, 6 Apr 2012 09:26:32 GMT"}], "update_date": "2012-04-09", "authors_parsed": [["Giles", "Michael B.", ""], ["Reisinger", "Christoph", ""]]}, {"id": "1204.1583", "submitter": "Jacky Mallett", "authors": "Jacky Mallett", "title": "Description of the Operational Mechanics of a Basel Regulated Banking\n  System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a description of the mechanical operations of banking as\nused in modern banking systems regulated under the Basel Accords, in order to\nprovide support for a verifiable and complete description of the banking system\nsuitable for computer simulation. Feedback is requested on the contents of this\ndocument, both with respect to the operations described here, and any known\nnational, regional or local variations in their structure and practice.\n", "versions": [{"version": "v1", "created": "Sat, 7 Apr 2012 00:38:43 GMT"}], "update_date": "2012-04-10", "authors_parsed": [["Mallett", "Jacky", ""]]}, {"id": "1204.2638", "submitter": "Masaaki Fujii", "authors": "Masaaki Fujii, Akihiko Takahashi", "title": "Perturbative Expansion Technique for Non-linear FBSDEs with Interacting\n  Particle Method", "comments": "20 pages, 3 figures, references added", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose an efficient Monte Carlo implementation of\nnon-linear FBSDEs as a system of interacting particles inspired by the ideas of\nbranching diffusion method. It will be particularly useful to investigate large\nand complex systems, and hence it is a good complement of our previous work\npresenting an analytical perturbation procedure for generic non-linear FBSDEs.\nThere appear multiple species of particles, where the first one follows the\ndiffusion of the original underlying state, and the others the Malliavin\nderivatives with a grading structure. The number of branching points are capped\nby the order of perturbation, which is expected to make the scheme less\nnumerically intensive. The proposed method can be applied to semi-linear\nproblems, such as American and Bermudan options, Credit Value Adjustment (CVA),\nand even fully non-linear issues, such as the optimal portfolio problems in\nincomplete and/or constrained markets, feedbacks from large investors, and also\nthe analysis of various risk measures.\n", "versions": [{"version": "v1", "created": "Thu, 12 Apr 2012 07:20:55 GMT"}, {"version": "v2", "created": "Mon, 23 Apr 2012 10:57:18 GMT"}], "update_date": "2012-04-24", "authors_parsed": [["Fujii", "Masaaki", ""], ["Takahashi", "Akihiko", ""]]}, {"id": "1204.3556", "submitter": "Josep Perello", "authors": "Jordi Camprodon and Josep Perell\\'o", "title": "Maximum likelihood approach for several stochastic volatility models", "comments": "26 pages, 15 figures", "journal-ref": "J. Stat. Mech. (2012) P08016", "doi": "10.1088/1742-5468/2012/08/P08016", "report-no": null, "categories": "q-fin.CP cond-mat.stat-mech physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Volatility measures the amplitude of price fluctuations. Despite it is one of\nthe most important quantities in finance, volatility is not directly\nobservable. Here we apply a maximum likelihood method which assumes that price\nand volatility follow a two-dimensional diffusion process where volatility is\nthe stochastic diffusion coefficient of the log-price dynamics. We apply this\nmethod to the simplest versions of the expOU, the OU and the Heston stochastic\nvolatility models and we study their performance in terms of the log-price\nprobability, the volatility probability, and its Mean First-Passage Time. The\napproach has some predictive power on the future returns amplitude by only\nknowing current volatility. The assumed models do not consider long-range\nvolatility auto-correlation and the asymmetric return-volatility\ncross-correlation but the method still arises very naturally these two\nimportant stylized facts. We apply the method to different market indexes and\nwith a good performance in all cases.\n", "versions": [{"version": "v1", "created": "Mon, 16 Apr 2012 16:26:57 GMT"}, {"version": "v2", "created": "Mon, 2 Jul 2012 15:26:06 GMT"}], "update_date": "2012-09-03", "authors_parsed": [["Camprodon", "Jordi", ""], ["Perelló", "Josep", ""]]}, {"id": "1204.4025", "submitter": "Jia-Wen Gu", "authors": "Jia-Wen Gu, Wai-Ki Ching, Tak-Kuen Siu and Harry Zheng", "title": "On Pricing Basket Credit Default Swaps", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a simple and efficient method to compute the ordered\ndefault time distributions in both the homogeneous case and the two-group\nheterogeneous case under the interacting intensity default contagion model. We\ngive the analytical expressions for the ordered default time distributions with\nrecursive formulas for the coefficients, which makes the calculation fast and\nefficient in finding rates of basket CDSs. In the homogeneous case, we explore\nthe ordered default time in limiting case and further include the exponential\ndecay and the multistate stochastic intensity process. The numerical study\nindicates that, in the valuation of the swap rates and their sensitivities with\nrespect to underlying parameters, our proposed model outperforms the Monte\nCarlo method.\n", "versions": [{"version": "v1", "created": "Wed, 18 Apr 2012 09:26:31 GMT"}], "update_date": "2012-04-19", "authors_parsed": [["Gu", "Jia-Wen", ""], ["Ching", "Wai-Ki", ""], ["Siu", "Tak-Kuen", ""], ["Zheng", "Harry", ""]]}, {"id": "1204.4631", "submitter": "Didier Kouokap Youmbi", "authors": "Didier Kouokap Youmbi", "title": "Yield to maturity modelling and a Monte Carlo Technique for pricing\n  Derivatives on Constant Maturity Treasury (CMT) and Derivatives on forward\n  Bonds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a Monte Carlo technique for pricing the forward yield to\nmaturity, when the volatility of the zero-coupon bond is known. We make the\nassumption of deterministic default intensity (Hazard Rate Function). We make\nno assumption on the volatility of the yield. We actually calculate the initial\nvalue of the forward yield, we calculate the volatility of the yield, and we\nwrite the diffusion of the yield. As direct application we price options on\nConstant Maturity Treasury (CMT) in the Hull and White Model for the short\ninterest rate. Tests results with Caps and Floors on 10 years constant maturity\ntreasury (CMT10) are satisfactory. This work can also be used for pricing\noptions on bonds or forward bonds.\n", "versions": [{"version": "v1", "created": "Fri, 20 Apr 2012 13:48:46 GMT"}], "update_date": "2012-04-23", "authors_parsed": [["Youmbi", "Didier Kouokap", ""]]}, {"id": "1204.4877", "submitter": "Peter Tankov", "authors": "Arturo Kohatsu-Higa, Salvador Ortiz-Latorre and Peter Tankov", "title": "Optimal simulation schemes for L\\'evy driven stochastic differential\n  equations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a general class of high order weak approximation schemes for\nstochastic differential equations driven by L\\'evy processes with infinite\nactivity. These schemes combine a compound Poisson approximation for the jump\npart of the L\\'evy process with a high order scheme for the Brownian driven\ncomponent, applied between the jump times. The overall approximation is\nanalyzed using a stochastic splitting argument. The resulting error bound\ninvolves separate contributions of the compound Poisson approximation and of\nthe discretization scheme for the Brownian part, and allows, on one hand, to\nbalance the two contributions in order to minimize the computational time, and\non the other hand, to study the optimal design of the approximating compound\nPoisson process. For driving processes whose L\\'evy measure explodes near zero\nin a regularly varying way, this procedure allows to construct discretization\nschemes with arbitrary order of convergence.\n", "versions": [{"version": "v1", "created": "Sun, 22 Apr 2012 11:00:00 GMT"}], "update_date": "2012-04-24", "authors_parsed": [["Kohatsu-Higa", "Arturo", ""], ["Ortiz-Latorre", "Salvador", ""], ["Tankov", "Peter", ""]]}, {"id": "1204.5698", "submitter": "Jianing Zhang", "authors": "Marcel Ladkau, John G. M. Schoenmakers, Jianing Zhang", "title": "Libor model with expiry-wise stochastic volatility and displacement", "comments": "3 tables, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a multi-factor stochastic volatility Libor model with\ndisplacement, where each individual forward Libor is driven by its own\nsquare-root stochastic volatility process. The main advantage of this approach\nis that, maturity-wise, each square-root process can be calibrated to the\ncorresponding cap(let)vola-strike panel at the market. However, since even\nafter freezing the Libors in the drift of this model, the Libor dynamics are\nnot affine, new affine approximations have to be developed in order to obtain\nFourier based (approximate) pricing procedures for caps and swaptions. As a\nresult, we end up with a Libor modeling package that allows for efficient\ncalibration to a complete system of cap/swaption market quotes that performs\nwell even in crises times, where structural breaks in vola-strike-maturity\npanels are typically observed.\n", "versions": [{"version": "v1", "created": "Wed, 25 Apr 2012 16:23:25 GMT"}], "update_date": "2012-04-26", "authors_parsed": [["Ladkau", "Marcel", ""], ["Schoenmakers", "John G. M.", ""], ["Zhang", "Jianing", ""]]}, {"id": "1204.5718", "submitter": "Leonard Rogers", "authors": "Tino Kluge and L. C. G. Rogers", "title": "The potential approach in practice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The potential approach is a general and simple method for modelling interest\nrates, foreign exchange rates, and in principle other types of financial\nassets. This paper takes data on some liquid interest rate derivatives, and\nfits potential models using a small finite-state Markov chain as the base\nMarkov process.\n", "versions": [{"version": "v1", "created": "Wed, 25 Apr 2012 17:47:29 GMT"}], "update_date": "2012-04-26", "authors_parsed": [["Kluge", "Tino", ""], ["Rogers", "L. C. G.", ""]]}]