[{"id": "1311.0530", "submitter": "Kostas Triantafyllopoulos", "authors": "K. Triantafyllopoulos", "title": "Multivariate stochastic volatility modelling using Wishart\n  autoregressive processes", "comments": "29 pages, 3 figures, 2 tables", "journal-ref": "Journal of Time Series Analysis, 2012, 33, 48-60", "doi": "10.1111/j.1467-9892.2011.00738.x", "report-no": null, "categories": "q-fin.CP stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new multivariate stochastic volatility estimation procedure for financial\ntime series is proposed. A Wishart autoregressive process is considered for the\nvolatility precision covariance matrix, for the estimation of which a two step\nprocedure is adopted. The first step is the conditional inference on the\nautoregressive parameters and the second step is the unconditional inference,\nbased on a Newton-Raphson iterative algorithm. The proposed methodology, which\nis mostly Bayesian, is suitable for medium dimensional data and it bridges the\ngap between closed-form estimation and simulation-based estimation algorithms.\nAn example, consisting of foreign exchange rates data, illustrates the proposed\nmethodology.\n", "versions": [{"version": "v1", "created": "Sun, 3 Nov 2013 21:08:03 GMT"}], "update_date": "2013-11-05", "authors_parsed": [["Triantafyllopoulos", "K.", ""]]}, {"id": "1311.0675", "submitter": "Nikolai Dokuchaev", "authors": "Nikolai Dokuchaev", "title": "On strong binomial approximation for stochastic processes and\n  applications for financial modelling", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers binomial approximation of continuous time stochastic\nprocesses. It is shown that, under some mild integrability conditions, a\nprocess can be approximated in mean square sense and in other strong metrics by\nbinomial processes, i.e., by processes with fixed size binary increments at\nsampling points. Moreover, this approximation can be causal, i.e., at every\ntime it requires only past historical values of the underlying process. In\naddition, possibility of approximation of solutions of stochastic differential\nequations by solutions of ordinary equations with binary noise is established.\nSome consequences for the financial modelling and options pricing models are\ndiscussed.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2013 12:34:27 GMT"}, {"version": "v2", "created": "Sun, 20 Apr 2014 14:52:07 GMT"}, {"version": "v3", "created": "Fri, 6 Feb 2015 10:16:38 GMT"}], "update_date": "2015-02-09", "authors_parsed": [["Dokuchaev", "Nikolai", ""]]}, {"id": "1311.1545", "submitter": "Stefano De Marco", "authors": "Stefano De Marco, Peter Friz", "title": "Varadhan's formula, conditioned diffusions, and local volatilities", "comments": "34 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by marginals-mimicking results for It\\^o processes via SDEs and by\ntheir applications to volatility modeling in finance, we discuss the weak\nconvergence of the law of a hypoelliptic diffusions conditioned to belong to a\ntarget affine subspace at final time, namely $\\mathcal{L}(Z_t|Y_t = y)$ if\n$X_{\\cdot}=(Y_\\cdot,Z_{\\cdot})$. To do so, we revisit Varadhan-type estimates\nin a small-noise regime (as opposed to small-time), studying the density of the\nlower-dimensional component $Y$. The application to stochastic volatility\nmodels include the small-time and, for certain models, the large-strike\nasymptotics of the Gyongy-Dupire's local volatility function. The final product\nare asymptotic formulae that can (i) motivate parameterizations of the local\nvolatility surface and (ii) be used to extrapolate local volatilities in a\ngiven model.\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2013 23:08:15 GMT"}, {"version": "v2", "created": "Wed, 30 Dec 2015 21:33:15 GMT"}, {"version": "v3", "created": "Tue, 14 Jun 2016 09:11:24 GMT"}], "update_date": "2016-06-15", "authors_parsed": [["De Marco", "Stefano", ""], ["Friz", "Peter", ""]]}, {"id": "1311.3881", "submitter": "Yuri F. Saporito", "authors": "Samy Jazaerli and Yuri F. Saporito", "title": "Functional Ito Calculus, Path-dependence and the Computation of Greeks", "comments": "45 pages", "journal-ref": null, "doi": "10.1016/j.spa.2017.03.015", "report-no": null, "categories": "q-fin.CP math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dupire's functional It\\^o calculus provides an alternative approach to the\nclassical Malliavin calculus for the computation of sensitivities, also called\nGreeks, of path-dependent derivatives prices. In this paper, we introduce a\nmeasure of path-dependence of functionals within the functional It\\^o calculus\nframework. Namely, we consider the Lie bracket of the space and time functional\nderivatives, which we use to classify functionals accordingly to their degree\nof path-dependence. We then revisit the problem of efficient numerical\ncomputation of Greeks for path-dependent derivatives using integration by parts\ntechniques. Special attention is paid to path-dependent functionals with zero\nLie bracket, called locally weakly path-dependent functionals in our\nclassification. Hence, we derive the weighted-expectation formulas for their\nGreeks. In the more general case of fully path-dependent functionals, we show\nthat, equipped with the functional It\\^o calculus, we are able to analyze the\neffect of the Lie bracket on the computation of Greeks. Moreover, we are also\nable to consider the more general dynamics of path-dependent volatility. These\nwere not achieved using Malliavin calculus.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2013 15:35:58 GMT"}, {"version": "v2", "created": "Tue, 21 Jul 2015 18:33:37 GMT"}, {"version": "v3", "created": "Tue, 27 Oct 2015 18:06:46 GMT"}, {"version": "v4", "created": "Thu, 23 Mar 2017 13:36:32 GMT"}, {"version": "v5", "created": "Tue, 19 Jun 2018 12:23:19 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Jazaerli", "Samy", ""], ["Saporito", "Yuri F.", ""]]}, {"id": "1311.4074", "submitter": "Chunli  Chen", "authors": "Wenqing Bao, ChunLi Chen and Jin E. Zhang", "title": "Option Pricing with Lie Symmetry Analysis and Similarity Reduction\n  Method", "comments": "23 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With some transformations, we convert the problem of option pricing under\nstate-dependent volatility into an initial value problem of the Fokker-Planck\nequation with a certain potential. By using the Lie symmetry analysis and\nsimilarity reduction method, we are able to reduce the dimensions of the\npartial differential equation and find some of its particular solutions of the\nequation. A few case studies demonstrate that our new method can be used to\nproduce analytical option pricing formulas for certain volatility functions.\n", "versions": [{"version": "v1", "created": "Sat, 16 Nov 2013 16:08:23 GMT"}], "update_date": "2013-11-19", "authors_parsed": [["Bao", "Wenqing", ""], ["Chen", "ChunLi", ""], ["Zhang", "Jin E.", ""]]}, {"id": "1311.4249", "submitter": "Yuri F. Saporito", "authors": "Jean-Pierre Fouque, Yuri F. Saporito, Jorge P. Zubelli", "title": "Multiscale Stochastic Volatility Model for Derivatives on Futures", "comments": "30 pages and 3 figures", "journal-ref": null, "doi": "10.1142/S0219024914500435", "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a new method to compute the first-order\napproximation of the price of derivatives on futures in the context of\nmultiscale stochastic volatility of Fouque \\textit{et al.} (2011, CUP). It\nprovides an alternative method to the singular perturbation technique presented\nin Hikspoors and Jaimungal (2008). The main features of our method are twofold:\nfirstly, it does not rely on any additional hypothesis on the regularity of the\npayoff function, and secondly, it allows an effective and straightforward\ncalibration procedure of the model to implied volatilities. These features were\nnot achieved in previous works. Moreover, the central argument of our method\ncould be applied to interest rate derivatives and compound derivatives. The\nonly pre-requisite of our approach is the first-order approximation of the\nunderlying derivative. Furthermore, the model proposed here is well-suited for\ncommodities since it incorporates mean reversion of the spot price and\nmultiscale stochastic volatility. Indeed, the model was validated by\ncalibrating it to options on crude-oil futures, and it displays a very good fit\nof the implied volatility.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2013 03:07:26 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Fouque", "Jean-Pierre", ""], ["Saporito", "Yuri F.", ""], ["Zubelli", "Jorge P.", ""]]}, {"id": "1311.4503", "submitter": "Nicolas Langrene", "authors": "Idris Kharroubi (CREST, CEREMADE), Nicolas Langren\\'e (LPMA), Huy\\^en\n  Pham (CREST, LPMA)", "title": "A numerical algorithm for fully nonlinear HJB equations: an approach by\n  control randomization", "comments": null, "journal-ref": "Monte Carlo Methods and Applications 20(2) 145-165 (2014)", "doi": "10.1515/mcma-2013-0024", "report-no": null, "categories": "math.PR q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a probabilistic numerical algorithm to solve Backward Stochastic\nDifferential Equations (BSDEs) with nonnegative jumps, a class of BSDEs\nintroduced in [9] for representing fully nonlinear HJB equations. In\nparticular, this allows us to numerically solve stochastic control problems\nwith controlled volatility, possibly degenerate. Our backward scheme, based on\nleast-squares regressions, takes advantage of high-dimensional properties of\nMonte-Carlo methods, and also provides a parametric estimate in feedback form\nfor the optimal control. A partial analysis of the error of the scheme is\nprovided, as well as numerical tests on the problem of superreplication of\noption with uncertain volatilities and/or correlations, including a detailed\ncomparison with the numerical results from the alternative scheme proposed in\n[7].\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2013 19:27:39 GMT"}], "update_date": "2019-07-11", "authors_parsed": [["Kharroubi", "Idris", "", "CREST, CEREMADE"], ["Langrené", "Nicolas", "", "LPMA"], ["Pham", "Huyên", "", "CREST, LPMA"]]}, {"id": "1311.4698", "submitter": "Markus Hofer", "authors": "Christoph Aistleitner and Markus Hofer and Robert Tichy", "title": "A central limit theorem for Latin hypercube sampling with dependence and\n  application to exotic basket option pricing", "comments": null, "journal-ref": "International Journal of Theoretical & Applied Finance, 15 (2012),\n  no. 7, (20 pages)", "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of estimating $\\mathbb{E} [f(U^1, \\ldots, U^d)]$,\nwhere $(U^1, \\ldots, U^d)$ denotes a random vector with uniformly distributed\nmarginals. In general, Latin hypercube sampling (LHS) is a powerful tool for\nsolving this kind of high-dimensional numerical integration problem. In the\ncase of dependent components of the random vector $(U^1, \\ldots, U^d)$ one can\nachieve more accurate results by using Latin hypercube sampling with dependence\n(LHSD). We state a central limit theorem for the $d$-dimensional LHSD\nestimator, by this means generalising a result of Packham and Schmidt.\nFurthermore we give conditions on the function $f$ and the distribution of\n$(U^1, \\ldots, U^d)$ under which a reduction of variance can be achieved.\nFinally we compare the effectiveness of Monte Carlo and LHSD estimators\nnumerically in exotic basket option pricing problems.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2013 11:18:51 GMT"}], "update_date": "2013-11-20", "authors_parsed": [["Aistleitner", "Christoph", ""], ["Hofer", "Markus", ""], ["Tichy", "Robert", ""]]}, {"id": "1311.6257", "submitter": "Samuel Cohen", "authors": "Samuel N. Cohen and Robert J. Elliott", "title": "Filters and smoothers for self-exciting Markov modulated counting\n  processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.PR q-fin.TR stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a self-exciting counting process, the parameters of which depend\non a hidden finite-state Markov chain. We derive the optimal filter and\nsmoother for the hidden chain based on observation of the jump process. This\nfilter is in closed form and is finite dimensional. We demonstrate the\nperformance of this filter both with simulated data, and by analysing the\n`flash crash' of 6th May 2010 in this framework.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2013 10:44:53 GMT"}], "update_date": "2013-11-26", "authors_parsed": [["Cohen", "Samuel N.", ""], ["Elliott", "Robert J.", ""]]}]