[{"id": "1402.0243", "submitter": "Nikolaus Schweizer", "authors": "Fabian Dickmann and Nikolaus Schweizer", "title": "Faster Comparison of Stopping Times by Nested Conditional Monte Carlo", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that deliberately introducing a nested simulation stage can lead to\nsignificant variance reductions when comparing two stopping times by Monte\nCarlo. We derive the optimal number of nested simulations and prove that the\nalgorithm is remarkably robust to misspecifications of this number. The method\nis applied to several problems related to Bermudan/American options. In these\napplications, our method allows to substantially increase the efficiency of\nother variance reduction techniques, namely, Quasi-Control Variates and\nMultilevel Monte Carlo.\n", "versions": [{"version": "v1", "created": "Sun, 2 Feb 2014 20:53:48 GMT"}], "update_date": "2014-02-04", "authors_parsed": [["Dickmann", "Fabian", ""], ["Schweizer", "Nikolaus", ""]]}, {"id": "1402.1953", "submitter": "Maksym Tertychnyi", "authors": "Anatoliy Swishchuk, Maksym Tertychnyi, Robert Elliott", "title": "Pricing Currency Derivatives with Markov-modulated Levy Dynamics", "comments": "25 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using a Levy process we generalize formulas in Bo et al.(2010) for the\nEsscher transform parameters for the log-normal distribution which ensure the\nmartingale condition holds for the discounted foreign exchange rate. Using\nthese values of the parameters we find a risk-neural measure and provide new\nformulas for the distribution of jumps, the mean jump size, and the Poisson\nprocess intensity with respect to to this measure. The formulas for a European\ncall foreign exchange option are also derived. We apply these formulas to the\ncase of the log-double exponential distribution of jumps. We provide numerical\nsimulations for the European call foreign exchange option prices with different\nparameters.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2014 13:58:43 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Swishchuk", "Anatoliy", ""], ["Tertychnyi", "Maksym", ""], ["Elliott", "Robert", ""]]}, {"id": "1402.2273", "submitter": "Maksym Tertychnyi", "authors": "Anatoliy Swishchuk, Maksym Tertychnyi, Winsor Hoang", "title": "Currency Derivatives Pricing for Markov-modulated Merton Jump-diffusion\n  Spot Forex Rate", "comments": "17 pages, 3 figures. arXiv admin note: substantial text overlap with\n  arXiv:1402.1953", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derived similar to Bo et al. (2010) results but in the case when the\ndynamics of the FX rate is driven by a general Merton jump-diffusion process.\nThe main results of our paper are as follows: 1) formulas for the Esscher\ntransform parameters which ensure that the martingale condition for the\ndiscounted foreign exchange rate is a martingale for a general Merton\njump--diffusion process are derived; using the values of these parameters we\nproceeded to a risk-neural measure and provide new formulas for the\ndistribution of jumps, the mean jump size, and the Poisson process intensity\nwith respect to the measure; pricing formulas for European call foreign\nexchange options have been given as well; 2) obtained formulas are applied to\nthe case of the exponential processes; 3) numerical simulations of European\ncall foreign exchange option prices for different parameters are also provided;\n4) codes for Matlab functions used in numerical simulations of option prices\nare given.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2014 14:05:59 GMT"}], "update_date": "2014-02-12", "authors_parsed": [["Swishchuk", "Anatoliy", ""], ["Tertychnyi", "Maksym", ""], ["Hoang", "Winsor", ""]]}, {"id": "1402.5094", "submitter": "Samuel  Palmer", "authors": "Samuel Palmer", "title": "Accelerating Implicit Finite Difference Schemes Using a Hardware\n  Optimized Tridiagonal Solver for FPGAs", "comments": "Preliminary paper, awaiting final implementation results", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a design and implementation of the Thomas algorithm optimized for\nhardware acceleration on an FPGA, the Thomas Core. The hardware-based algorithm\ncombined with the custom data flow and low level parallelism available in an\nFPGA reduces the overall complexity from 8N down to 5N serial arithmetic\noperations, and almost halves the overall latency by parallelizing the two\ncostly divisions. Combining this with a data streaming interface, we reduce\nmemory overheads to 2 N-length vectors per N-tridiagonal system to be solved.\nThe Thomas Core allows for multiple independent tridiagonal systems to be\ncontinuously solved in parallel, providing an efficient and scalable\naccelerator for many numerical computations. Finally we present applications\nfor derivatives pricing problems using implicit finite difference schemes on an\nFPGA accelerated system and we investigate the use and limitations of\nfixed-point arithmetic in our algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2014 18:32:40 GMT"}, {"version": "v2", "created": "Wed, 14 Oct 2015 20:48:53 GMT"}], "update_date": "2015-10-16", "authors_parsed": [["Palmer", "Samuel", ""]]}, {"id": "1402.5352", "submitter": "Konstantinos Spiliopoulos", "authors": "Konstantinos Spiliopoulos", "title": "Systemic Risk and Default Clustering for Large Financial Systems", "comments": "in Large Deviations and Asymptotic Methods in Finance, (Editors: P.\n  Friz, J. Gatheral, A. Gulisashvili, A. Jacqier, J. Teichmann) , Springer\n  Proceedings in Mathematics and Statistics, Vol. 110 2015,", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As it is known in the finance risk and macroeconomics literature,\nrisk-sharing in large portfolios may increase the probability of creation of\ndefault clusters and of systemic risk. We review recent developments on\nmathematical and computational tools for the quantification of such phenomena.\nLimiting analysis such as law of large numbers and central limit theorems allow\nto approximate the distribution in large systems and study quantities such as\nthe loss distribution in large portfolios. Large deviations analysis allow us\nto study the tail of the loss distribution and to identify pathways to default\nclustering. Sensitivity analysis allows to understand the most likely ways in\nwhich different effects, such as contagion and systematic risks, combine to\nlead to large default rates. Such results could give useful insights into how\nto optimally safeguard against such events.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2014 17:02:19 GMT"}, {"version": "v2", "created": "Wed, 1 Oct 2014 13:50:59 GMT"}, {"version": "v3", "created": "Wed, 18 Feb 2015 21:30:24 GMT"}], "update_date": "2015-02-20", "authors_parsed": [["Spiliopoulos", "Konstantinos", ""]]}, {"id": "1402.5679", "submitter": "Genko Vasilev", "authors": "G. S. Vasilev", "title": "Time-dependent Heston model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work presents an exact solution to the generalized Heston model, where\nthe model parameters are assumed to have linear time dependence The solution\nfor the model in expressed in terms of confluent hypergeometric functions.\n", "versions": [{"version": "v1", "created": "Sun, 23 Feb 2014 21:33:01 GMT"}], "update_date": "2014-02-25", "authors_parsed": [["Vasilev", "G. S.", ""]]}, {"id": "1402.6204", "submitter": "Fabio Bagarello Dr.", "authors": "F. Bagarello, E. Haven", "title": "The role of information in a two-traders market", "comments": "in press in Physica A", "journal-ref": null, "doi": "10.1016/j.physa.2014.02.052", "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a very simple stock market, made by only two \\emph{initially equivalent}\ntraders, we discuss how the information can affect the performance of the\ntraders. More in detail, we first consider how the portfolios of the traders\nevolve in time when the market is \\emph{closed}. After that, we discuss two\nmodels in which an interaction with the outer world is allowed. We show that,\nin this case, the two traders behave differently, depending on \\textbf{i)} the\namount of information which they receive from outside; and \\textbf{ii)}the\nquality of this information.\n", "versions": [{"version": "v1", "created": "Tue, 25 Feb 2014 15:37:22 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Bagarello", "F.", ""], ["Haven", "E.", ""]]}]