[{"id": "1403.0851", "submitter": "Dominique Pepin", "authors": "Dominique Pepin (CRIEF)", "title": "Asset Prices and Risk Aversion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The standard asset pricing models (the CCAPM and the Epstein-Zin non-expected\nutility model) counterintuitively predict that equilibrium asset prices can\nrise if the representative agent's risk aversion increases. If the income\neffect, which implies enhanced saving as a result of an increase in risk\naversion, dominates the substitution effect, which causes the representative\nagent to reallocate his portfolio in favour of riskless assets, the demand for\nsecurities increases. Thus, asset prices are forced to rise when the\nrepresentative agent is more risk adverse. By disentangling risk aversion and\nintertemporal substituability, we demonstrate that the risky asset price is an\nincreasing function of the coefficient of risk aversion only if the elasticity\nof intertemporal substitution (EIS) exceeds unity. This result, which was first\nproved par Epstein (1988) in a stationary economy setting with a constant risk\naversion, is shown to hold true for non-stationary economies with a variable or\nconstant risk aversion coefficient. The conclusion is that the EIS probably\nexceeds unity.\n", "versions": [{"version": "v1", "created": "Tue, 4 Mar 2014 16:45:52 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Pepin", "Dominique", "", "CRIEF"]]}, {"id": "1403.1804", "submitter": "Andrey Itkin", "authors": "Andrey Itkin", "title": "High-Order Splitting Methods for Forward PDEs and PIDEs", "comments": "25 pages, 2 figures, 7 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is dedicated to the construction of high-order (in both space and\ntime) finite-difference schemes for both forward and backward PDEs and PIDEs,\nsuch that option prices obtained by solving both the forward and backward\nequations are consistent. This approach is partly inspired by Andreasen & Huge,\n2011 who reported a pair of consistent finite-difference schemes of first-order\napproximation in time for an uncorrelated local stochastic volatility model. We\nextend their approach by constructing schemes that are second-order in both\nspace and time and that apply to models with jumps and discrete dividends.\nTaking correlation into account in our approach is also not an issue.\n", "versions": [{"version": "v1", "created": "Fri, 7 Mar 2014 16:54:15 GMT"}], "update_date": "2014-03-10", "authors_parsed": [["Itkin", "Andrey", ""]]}, {"id": "1403.3627", "submitter": "Dominique Pepin", "authors": "Claudiu Tiberiu Albulescu (CRIEF), Dominique Pepin (CRIEF), Aviral\n  Kumar Tiwari", "title": "A re-examination of real interest parity in CEECs using old and new\n  generations of panel unit root tests", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study applies old and new generations of panel unit root tests to test\nthe validity of long-run real interest rate parity (RIP) hypothesis for ten\nCentral and Eastern European Countries (CEECs) with respect to the Euro area\nand an average of the CEECs' real interest rates, respectively. When the panel\nunit root tests are carried out with respect to the Euro area rate, we confirm\nthe results of previous studies which support the RIP hypothesis. Nevertheless,\nwhen the test is performed using the average of the CEECs' rate, our results\nare mitigated, revealing that the hypothesis of CEECs' interest rates\nconvergence cannot be taken for granted. From a robustness analysis\nperspective, our findings indicate that the RIP hypothesis for CEECs should be\nconsidered with cautions, being sensitive to the benchmark.\n", "versions": [{"version": "v1", "created": "Fri, 14 Mar 2014 16:14:39 GMT"}], "update_date": "2014-03-17", "authors_parsed": [["Albulescu", "Claudiu Tiberiu", "", "CRIEF"], ["Pepin", "Dominique", "", "CRIEF"], ["Tiwari", "Aviral Kumar", ""]]}, {"id": "1403.4099", "submitter": "Dieter Hendricks", "authors": "Dieter Hendricks, Diane Wilcox, Tim Gebbie", "title": "High-speed detection of emergent market clustering via an unsupervised\n  parallel genetic algorithm", "comments": "10 pages, 5 figures, 4 tables, More thorough discussion of\n  implementation", "journal-ref": "S Afr J Sci. 2016;112(1/2), Art. #2014-0340, 9 pages", "doi": "10.17159/sajs.2016/20140340", "report-no": null, "categories": "q-fin.CP cs.DC cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We implement a master-slave parallel genetic algorithm (PGA) with a bespoke\nlog-likelihood fitness function to identify emergent clusters within price\nevolutions. We use graphics processing units (GPUs) to implement a PGA and\nvisualise the results using disjoint minimal spanning trees (MSTs). We\ndemonstrate that our GPU PGA, implemented on a commercially available general\npurpose GPU, is able to recover stock clusters in sub-second speed, based on a\nsubset of stocks in the South African market. This represents a pragmatic\nchoice for low-cost, scalable parallel computing and is significantly faster\nthan a prototype serial implementation in an optimised C-based\nfourth-generation programming language, although the results are not directly\ncomparable due to compiler differences. Combined with fast online intraday\ncorrelation matrix estimation from high frequency data for cluster\nidentification, the proposed implementation offers cost-effective,\nnear-real-time risk assessment for financial practitioners.\n", "versions": [{"version": "v1", "created": "Mon, 17 Mar 2014 14:02:33 GMT"}, {"version": "v2", "created": "Fri, 25 Jul 2014 17:09:24 GMT"}, {"version": "v3", "created": "Fri, 3 Oct 2014 08:24:40 GMT"}, {"version": "v4", "created": "Sun, 2 Aug 2015 20:25:09 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Hendricks", "Dieter", ""], ["Wilcox", "Diane", ""], ["Gebbie", "Tim", ""]]}, {"id": "1403.5309", "submitter": "Yuan Xia", "authors": "Mike Giles, Yuan Xia", "title": "Multilevel Monte Carlo For Exponential L\\'{e}vy Models", "comments": "32 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply multilevel Monte Carlo for option pricing problems using exponential\nL\\'{e}vy models with a uniform timestep discretisation to monitor the running\nmaximum required for lookback and barrier options. The numerical results\ndemonstrate the computational efficiency of this approach. We derive estimates\nof the convergence rate for the error introduced by the discrete monitoring of\nthe running supremum of a broad class of L\\'{e}vy processes. We use these to\nobtain upper bounds on the multilevel Monte Carlo variance convergence rate for\nthe Variance Gamma, NIG and $\\alpha$-stable processes used in the numerical\nexperiments. We also show numerical results and analysis of a trapezoidal\napproximation for Asian options.\n", "versions": [{"version": "v1", "created": "Thu, 20 Mar 2014 21:46:29 GMT"}, {"version": "v2", "created": "Tue, 30 May 2017 13:42:27 GMT"}], "update_date": "2017-05-31", "authors_parsed": [["Giles", "Mike", ""], ["Xia", "Yuan", ""]]}, {"id": "1403.5599", "submitter": "Nguyet Nguyen", "authors": "Nguyet Nguyen and Giray \\\"Okten", "title": "The acceptance-rejection method for low-discrepancy sequences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Generation of pseudorandom numbers from different probability distributions\nhas been studied extensively in the Monte Carlo simulation literature. Two\nstandard generation techniques are the acceptance-rejection and inverse\ntransformation methods. An alternative approach to Monte Carlo simulation is\nthe quasi-Monte Carlo method, which uses low-discrepancy sequences, instead of\npseudorandom numbers, in simulation. Low-discrepancy sequences from different\ndistributions can be obtained by the inverse transformation method, just like\nfor pseudorandom numbers. In this paper, we will present an\nacceptance-rejection algorithm for low-discrepancy sequences. We will prove a\nconvergence result, and present error bounds. We will then use this\nacceptance-rejection algorithm to develop quasi-Monte Carlo versions of some\nwell known algorithms to generate beta and gamma distributions, and investigate\nthe efficiency of these algorithms numerically. We will also consider the\nsimulation of the variance gamma model, a model used in computational finance,\nwhere the generation of these probability distributions are needed. Our results\nshow that the acceptance-rejection technique can result in significant\nimprovements in computing time over the inverse transformation method in the\ncontext of low-discrepancy sequences.\n", "versions": [{"version": "v1", "created": "Sat, 22 Mar 2014 01:16:54 GMT"}], "update_date": "2014-03-25", "authors_parsed": [["Nguyen", "Nguyet", ""], ["Ökten", "Giray", ""]]}]