[{"id": "1407.0256", "submitter": "Andrey Itkin", "authors": "Andrey Itkin", "title": "To sigmoid-based functional description of the volatility smile", "comments": "32 pages, 18 figures, 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.CP q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new static parameterization of the implied volatility surface\nwhich is constructed by using polynomials of sigmoid functions combined with\nsome other terms. This parameterization is flexible enough to fit market\nimplied volatilities which demonstrate smile or skew. An arbitrage-free\ncalibration algorithm is considered that constructs the implied volatility\nsurface as a grid in the strike-expiration space and guarantees a lack of\narbitrage at every node of this grid. We also demonstrate how to construct an\narbitrage-free interpolation and extrapolation in time, as well as build a\nlocal volatility and implied pdf surfaces. Asymptotic behavior of this\nparameterization is discussed, as well as results on stability of the\ncalibrated parameters are presented. Numerical examples show robustness of the\nproposed approach in building all these surfaces as well as demonstrate a\nbetter quality of the fit as compared with some known models.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jul 2014 14:31:06 GMT"}, {"version": "v2", "created": "Tue, 29 Jul 2014 22:13:12 GMT"}, {"version": "v3", "created": "Mon, 8 Dec 2014 00:54:16 GMT"}], "update_date": "2014-12-09", "authors_parsed": [["Itkin", "Andrey", ""]]}, {"id": "1407.5020", "submitter": "Pawe{\\l} Fiedor", "authors": "Pawe{\\l} Fiedor", "title": "Causal Non-Linear Financial Networks", "comments": "11 pages, 9 figures, submitted to Financial Risk & Network Theory\n  seminar", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In our previous study we have presented an approach to studying lead--lag\neffect in financial markets using information and network theories. Methodology\npresented there, as well as previous studies using Pearson's correlation for\nthe same purpose, approached the concept of lead--lag effect in a naive way. In\nthis paper we further investigate the lead--lag effect in financial markets,\nthis time treating them as causal effects. To incorporate causality in a manner\nconsistent with our previous study, that is including non-linear\ninterdependencies, we base this study on a generalisation of Granger causality\nin the form of transfer entropy, or equivalently a special case of conditional\n(partial) mutual information. This way we are able to produce networks of\nstocks, where directed links represent causal relationships for a specific time\nlag. We apply this procedure to stocks belonging to the NYSE 100 index for\nvarious time lags, to investigate the short-term causality on this market, and\nto comment on the resulting Bonferroni networks.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jul 2014 14:57:49 GMT"}], "update_date": "2014-07-21", "authors_parsed": [["Fiedor", "Paweł", ""]]}, {"id": "1407.7738", "submitter": "Peter Martey Addo", "authors": "Peter Martey Addo", "title": "Multivariate Self-Exciting Threshold Autoregressive Models with\n  eXogenous Input", "comments": "This is a preliminary version of the paper-- please do not quote", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-fin.CP q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study defines a multivariate Self--Exciting Threshold Autoregressive\nwith eXogenous input (MSETARX) models and present an estimation procedure for\nthe parameters. The conditions for stationarity of the nonlinear MSETARX models\nis provided. In particular, the efficiency of an adaptive parameter estimation\nalgorithm and LSE (least squares estimate) algorithm for this class of models\nis then provided via simulations.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jul 2014 14:30:25 GMT"}], "update_date": "2014-07-30", "authors_parsed": [["Addo", "Peter Martey", ""]]}]