[{"id": "1701.00030", "submitter": "Christoph Reisinger", "authors": "Vadim Kaushansky and Alexander Lipton and Christoph Reisinger", "title": "Numerical analysis of an extended structural default model with mutual\n  liabilities and jump risk", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a structural default model in an interconnected banking network\nas in Lipton [International Journal of Theoretical and Applied Finance, 19(6),\n2016], with mutual obligations between each pair of banks. We analyse the model\nnumerically for two banks with jumps in their asset value processes.\nSpecifically, we develop a finite difference method for the resulting\ntwo-dimensional partial integro-differential equation, and study its stability\nand consistency. We then compute joint and marginal survival probabilities, as\nwell as prices of credit default swaps (CDS), first-to-default swaps (FTD),\ncredit and debt value adjustments (CVA and DVA). Finally, we calibrate the\nmodel to market data and assess the impact of jump risk.\n", "versions": [{"version": "v1", "created": "Fri, 30 Dec 2016 23:03:07 GMT"}], "update_date": "2017-01-03", "authors_parsed": [["Kaushansky", "Vadim", ""], ["Lipton", "Alexander", ""], ["Reisinger", "Christoph", ""]]}, {"id": "1701.00112", "submitter": "Nicola Cantarutti", "authors": "Nicola Cantarutti, Jo\\~ao Guerra", "title": "Multinomial method for option pricing under Variance Gamma", "comments": null, "journal-ref": "International Journal of Computer Mathematics, 96:6, 2019,\n  1087-1106,", "doi": "10.1080/00207160.2018.1427853", "report-no": null, "categories": "q-fin.PR q-fin.CP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a multinomial method for option pricing when the\nunderlying asset follows an exponential Variance Gamma process. The continuous\ntime Variance Gamma process is approximated by a discrete time Markov chain\nwith the same firsts four cumulants. This approach is particularly convenient\nfor pricing American and Bermudan options, which can be exercised at any time\nup to expiration date. Numerical computations of European and American options\nare presented, and compared with results obtained with finite differences\nmethods and with the Black Scholes model.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2016 14:29:37 GMT"}, {"version": "v2", "created": "Sun, 29 Jan 2017 10:26:05 GMT"}, {"version": "v3", "created": "Sun, 5 Mar 2017 20:50:23 GMT"}, {"version": "v4", "created": "Wed, 14 Feb 2018 16:48:59 GMT"}], "update_date": "2021-06-18", "authors_parsed": [["Cantarutti", "Nicola", ""], ["Guerra", "João", ""]]}, {"id": "1701.00886", "submitter": "Chunfa Wang", "authors": "Chunfa Wang", "title": "Pricing European Options by Stable Fourier-Cosine Series Expansions", "comments": "14 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The COS method proposed in Fang and Oosterlee (2008), although highly\nefficient, may lack robustness for a number of cases. In this paper, we present\na Stable pricing of call options based on Fourier cosine series expansion. The\nStability of the pricing methods is demonstrated by error analysis, as well as\nby a series of numerical examples, including the Heston stochastic volatility\nmodel, Kou jump-diffusion model, and CGMY model.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2017 02:36:59 GMT"}, {"version": "v2", "created": "Sun, 8 Jan 2017 05:31:36 GMT"}], "update_date": "2017-01-10", "authors_parsed": [["Wang", "Chunfa", ""]]}, {"id": "1701.01429", "submitter": "Victor Gaton", "authors": "Javier de Frutos, Victor Gaton", "title": "Chebyshev Reduced Basis Function applied to Option Valuation", "comments": null, "journal-ref": "Computational Management Science. 2017", "doi": "10.1007/s10287-017-0287-4", "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a numerical method for the frequent pricing of financial\nderivatives that depends on a large number of variables. The method is based on\nthe construction of a polynomial basis to interpolate the value function of the\nproblem by means of a hierarchical orthogonalization process that allows to\nreduce the number of degrees of freedom needed to have an accurate\nrepresentation of the value function. In the paper we consider, as an example,\na GARCH model that depends on eight parameters and show that a very large\nnumber of contracts for different maturities and asset and parameters values\ncan be valued in a small computational time with the proposed procedure. In\nparticular the method is applied to the problem of model calibration. The\nmethod is easily generalizable to be used with other models or problems.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2017 12:27:30 GMT"}, {"version": "v2", "created": "Thu, 22 Jun 2017 13:06:19 GMT"}], "update_date": "2017-09-27", "authors_parsed": [["de Frutos", "Javier", ""], ["Gaton", "Victor", ""]]}, {"id": "1701.01515", "submitter": "Kai Du", "authors": "Wenting Chen and Kai Du and Xinzi Qiu", "title": "Analytic properties of American option prices under a modified\n  Black-Scholes equation with spatial fractional derivatives", "comments": "12 pages", "journal-ref": null, "doi": "10.1016/j.physa.2017.08.068", "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates analytic properties of American option prices under\nthe finite moment log-stable (FMLS) model. Under this model the price of\nAmerican options is characterised by the free boundary problem of a fractional\npartial differential equation (FPDE) system. Using the technique of\napproximation we prove that the American put price under the FMLS model is\nconvex with respect the underlying price, and specify the impact of the tail\nindex on option prices.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jan 2017 00:38:51 GMT"}], "update_date": "2017-10-25", "authors_parsed": [["Chen", "Wenting", ""], ["Du", "Kai", ""], ["Qiu", "Xinzi", ""]]}, {"id": "1701.02245", "submitter": "Takashi Shinzato", "authors": "Takashi Shinzato", "title": "Property Safety Stock Policy for Correlated Commodities Based on\n  Probability Inequality", "comments": "16 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.CP stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deriving the optimal safety stock quantity with which to meet customer\nsatisfaction is one of the most important topics in stock management. However,\nit is difficult to control the stock management of correlated marketable\nmerchandise when using an inventory control method that was developed under the\nassumption that the demands are not correlated. For this, we propose a\ndeterministic approach that uses a probability inequality to derive a\nreasonable safety stock for the case in which we know the correlation between\nvarious commodities. Moreover, over a given lead time, the relation between the\nappropriate safety stock and the allowable stockout rate is analytically\nderived, and the potential of our proposed procedure is validated by numerical\nexperiments.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jan 2017 16:28:11 GMT"}], "update_date": "2017-01-10", "authors_parsed": [["Shinzato", "Takashi", ""]]}, {"id": "1701.02681", "submitter": "Ralph Rudd", "authors": "T. A. McWalter, R. Rudd, J. Kienitz, E. Platen", "title": "Recursive Marginal Quantization of Higher-Order Schemes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantization techniques have been applied in many challenging finance\napplications, including pricing claims with path dependence and early exercise\nfeatures, stochastic optimal control, filtering problems and efficient\ncalibration of large derivative books. Recursive Marginal Quantization of the\nEuler scheme has recently been proposed as an efficient numerical method for\nevaluating functionals of solutions of stochastic differential equations. This\nmethod involves recursively quantizing the conditional marginals of the\ndiscrete-time Euler approximation of the underlying process. By generalizing\nthis approach, we show that it is possible to perform recursive marginal\nquantization for two higher-order schemes: the Milstein scheme and a simplified\nweak order 2.0 scheme. As part of this generalization a simple matrix\nformulation is presented, allowing efficient implementation. We further extend\nthe applicability of recursive marginal quantization by showing how absorption\nand reflection at the zero boundary may be incorporated, when this is\nnecessary. To illustrate the improved accuracy of the higher order schemes,\nvarious computations are performed using geometric Brownian motion and its\ngeneralization, the constant elasticity of variance model. For both processes,\nwe show numerical evidence of improved weak order convergence and we compare\nthe marginal distributions implied by the three schemes to the known analytical\ndistributions. By pricing European, Bermudan and Barrier options, further\nevidence of improved accuracy of the higher order schemes is demonstrated.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jan 2017 04:18:50 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["McWalter", "T. A.", ""], ["Rudd", "R.", ""], ["Kienitz", "J.", ""], ["Platen", "E.", ""]]}, {"id": "1701.02798", "submitter": "Kazutoshi Yamazaki", "authors": "Kazutoshi Yamazaki", "title": "Phase-type Approximation of the Gerber-Shiu Function", "comments": "16 pages. Forthcoming in the Journal of the Operations Research\n  Society of Japan, vol. 60, no. 3, 2017 (special issue of the 60th anniversary\n  of the Operations Research Society of Japan)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Gerber-Shiu function provides a way of measuring the risk of an insurance\ncompany. It is given by the expected value of a function that depends on the\nruin time, the deficit at ruin, and the surplus prior to ruin. Its computation\nrequires the evaluation of the overshoot/undershoot distributions of the\nsurplus process at ruin. In this paper, we use the recent developments of the\nfluctuation theory and approximate it in a closed form by fitting the\nunderlying process by phase-type Levy processes. A sequence of numerical\nresults are given.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2017 22:00:29 GMT"}], "update_date": "2017-01-12", "authors_parsed": [["Yamazaki", "Kazutoshi", ""]]}, {"id": "1701.02821", "submitter": "Andrey Itkin", "authors": "Andrey Itkin", "title": "Modeling stochastic skew of FX options using SLV models with stochastic\n  spot/vol correlation and correlated jumps", "comments": "42 pages, 12 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.NA q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is known that the implied volatility skew of FX options demonstrates a\nstochastic behavior which is called stochastic skew. In this paper we create\nstochastic skew by assuming the spot/instantaneous variance correlation to be\nstochastic. Accordingly, we consider a class of SLV models with stochastic\ncorrelation where all drivers - the spot, instantaneous variance and their\ncorrelation are modeled by Levy processes. We assume all diffusion components\nto be fully correlated as well as all jump components. A new fully implicit\nsplitting finite-difference scheme is proposed for solving forward PIDE which\nis used when calibrating the model to market prices of the FX options with\ndifferent strikes and maturities. The scheme is unconditionally stable, of\nsecond order of approximation in time and space, and achieves a linear\ncomplexity in each spatial direction. The results of simulation obtained by\nusing this model demonstrate capacity of the presented approach in modeling\nstochastic skew.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2017 01:23:27 GMT"}, {"version": "v2", "created": "Wed, 18 Jan 2017 21:03:54 GMT"}], "update_date": "2017-01-20", "authors_parsed": [["Itkin", "Andrey", ""]]}, {"id": "1701.03512", "submitter": "Sai Kumar Popuri", "authors": "Sai K. Popuri and Andrew M. Raim and Nagaraj K. Neerchal and Matthias\n  K. Gobbert", "title": "Parallelizing Computation of Expected Values in Recombinant Binomial\n  Trees", "comments": "19 pages and 5 figures (png/jpeg files)", "journal-ref": "J. Stat. Comp. & Sim. 88 (2018) 657-674", "doi": "10.1080/00949655.2017.1402898", "report-no": null, "categories": "stat.CO q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recombinant binomial trees are binary trees where each non-leaf node has two\nchild nodes, but adjacent parents share a common child node. Such trees arise\nin finance when pricing an option. For example, valuation of a European option\ncan be carried out by evaluating the expected value of asset payoffs with\nrespect to random paths in the tree. In many variants of the option valuation\nproblem, a closed form solution cannot be obtained and computational methods\nare needed. The cost to exactly compute expected values over random paths grows\nexponentially in the depth of the tree, rendering a serial computation of one\nbranch at a time impractical. We propose a parallelization method that\ntransforms the calculation of the expected value into an \"embarrassingly\nparallel\" problem by mapping the branches of the binomial tree to the processes\nin a multiprocessor computing environment. We also propose a parallel Monte\nCarlo method which takes advantage of the mapping to achieve a reduced variance\nover the basic Monte Carlo estimator. Performance results from R and Julia\nimplementations of the parallelization method on a distributed computing\ncluster indicate that both the implementations are scalable, but Julia is\nsignificantly faster than a similarly written R code. A simulation study is\ncarried out to verify the convergence and the variance reduction behavior in\nthe proposed Monte Carlo method.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2017 21:34:48 GMT"}, {"version": "v2", "created": "Sat, 27 Oct 2018 07:07:46 GMT"}], "update_date": "2018-10-30", "authors_parsed": [["Popuri", "Sai K.", ""], ["Raim", "Andrew M.", ""], ["Neerchal", "Nagaraj K.", ""], ["Gobbert", "Matthias K.", ""]]}, {"id": "1701.04134", "submitter": "Seyed Amir Hejazi", "authors": "Seyed Amir Hejazi, Kenneth R. Jackson, Guojun Gan", "title": "A Spatial Interpolation Framework for Efficient Valuation of Large\n  Portfolios of Variable Annuities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Variable Annuity (VA) products expose insurance companies to considerable\nrisk because of the guarantees they provide to buyers of these products.\nManaging and hedging these risks requires insurers to find the value of key\nrisk metrics for a large portfolio of VA products. In practice, many companies\nrely on nested Monte Carlo (MC) simulations to find key risk metrics. MC\nsimulations are computationally demanding, forcing insurance companies to\ninvest hundreds of thousands of dollars in computational infrastructure per\nyear. Moreover, existing academic methodologies are focused on fair valuation\nof a single VA contract, exploiting ideas in option theory and regression. In\nmost cases, the computational complexity of these methods surpasses the\ncomputational requirements of MC simulations. Therefore, academic methodologies\ncannot scale well to large portfolios of VA contracts. In this paper, we\npresent a framework for valuing such portfolios based on spatial interpolation.\nWe provide a comprehensive study of this framework and compare existing\ninterpolation schemes. Our numerical results show superior performance, in\nterms of both computational efficiency and accuracy, for these methods compared\nto nested MC simulations. We also present insights into the challenge of\nfinding an effective interpolation scheme in this framework, and suggest\nguidelines that help us build a fully automated scheme that is efficient and\naccurate.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jan 2017 01:30:02 GMT"}], "update_date": "2017-01-17", "authors_parsed": [["Hejazi", "Seyed Amir", ""], ["Jackson", "Kenneth R.", ""], ["Gan", "Guojun", ""]]}, {"id": "1701.05016", "submitter": "Ziping Zhao", "authors": "Ziping Zhao and Daniel P. Palomar", "title": "Mean-Reverting Portfolio Design with Budget Constraint", "comments": "Paper submitted to IEEE Transactions on Signal Processing. Part of\n  this work will appear in the Proceedings of the 50th annual Asilomar\n  conference on signals, systems, and computers, Nov. 6-9, 2016, CA, USA", "journal-ref": null, "doi": "10.1109/TSP.2018.2799193", "report-no": null, "categories": "q-fin.PM q-fin.CP q-fin.MF q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the mean-reverting portfolio design problem arising from\nstatistical arbitrage in the financial markets. We first propose a general\nproblem formulation aimed at finding a portfolio of underlying component assets\nby optimizing a mean-reversion criterion characterizing the mean-reversion\nstrength, taking into consideration the variance of the portfolio and an\ninvestment budget constraint. Then several specific problems are considered\nbased on the general formulation, and efficient algorithms are proposed.\nNumerical results on both synthetic and market data show that our proposed\nmean-reverting portfolio design methods can generate consistent profits and\noutperform the traditional design methods and the benchmark methods in the\nliterature.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2017 11:33:51 GMT"}], "update_date": "2018-05-09", "authors_parsed": [["Zhao", "Ziping", ""], ["Palomar", "Daniel P.", ""]]}, {"id": "1701.05176", "submitter": "Oisin Connolly", "authors": "Oisin Connolly", "title": "Dynamic Prize Linked Savings: Maximizing Savings and Managing Risk", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Prize linked savings accounts provide a return in the form of randomly chosen\naccounts receiving large cash prizes, in lieu of a guaranteed and uniform\ninterest rate. This model became legal for American national banks upon\nbipartisan passage of the American Savings Promotion Act in December 2014, and\nmany states have deregulated this option for state chartered banks and credit\nunions in recent years. Prize linked savings programs have unique appeal and\nproven societal benefits, but the product is still not available to the vast\nmajority of Americans. There is demonstrated interest in these products, but\nthe supply side may be the bottleneck, because the prevailing consensus is that\nprize linked savings primarily appeal to low income consumers. This paper\nexamines a less common, dynamic prize, model of prize linked savings and shows\nwhy it might result in a larger average account size. The paper proposes three\nmethods of managing risk under this model, and tests two of them using a Monte\nCarlo simulation. We conclude that both tested methods are effective at\nmitigating the most severe risks.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2017 18:34:04 GMT"}], "update_date": "2017-01-19", "authors_parsed": [["Connolly", "Oisin", ""]]}, {"id": "1701.06975", "submitter": "Antoaneta Serguieva", "authors": "Antoaneta Serguieva", "title": "Multichannel Contagion vs Stabilisation in Multiple Interconnected\n  Financial Markets", "comments": "35 pages, 4 figures, 5 tables, 35 equations", "journal-ref": null, "doi": null, "report-no": "IFC Bulletins, Bank for International Settlements, vol. 43, pp 1-35,\n  2017, www.bis.org/ifc/publ/ifcb43_d.pdf", "categories": "q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The theory of multilayer networks is in its early stages, and its development\nprovides vital methods for understanding complex systems. Multilayer networks,\nin their multiplex form, have been introduced within the last three years to\nanalysing the structure of financial systems, and existing studies have\nmodelled and evaluated interdependencies of different type among financial\ninstitutions. These studies, however, have considered the structure as a\nnon-interconnected multiplex - an ensemble of single layer networks comprising\nthe same nodes - rather than as an interconnected multiplex network. No\nmechanism of multichannel contagion has been modelled and empirically\nevaluated, and no multichannel stabilisation strategies for pre-emptive\ncontagion containment have been designed. This paper formulates an\ninterconnected multiplex structure, and a contagion mechanism among financial\ninstitutions due to bilateral exposures arising from institutions activity\nwithin different interconnected markets that compose the overall financial\nmarket. We introduce structural measures of absolute systemic risk and\nresilience, and relative systemic-risk indexes. Based on the contagion\nmechanism and systemic-risk quantification, this study designs minimum-cost\nstabilisation strategies that act simultaneously on different markets and their\ninterconnections, in order to effectively contain potential contagion\nprogressing through the overall structure. The stabilisation strategies subtly\naffect the emergence process of structure to adaptively build in structural\nresilience and achieve pre-emptive stabilisation at a minimum cost for each\ninstitution and at no cost for the system as a whole. We empirically evaluate\nthe new approach using large granular databases, maintained by the Prudential\nRegulatory Authority of the Bank of England. The capabilities of multichannel\nstabilisation are confirmed empirically.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jan 2017 16:44:13 GMT"}, {"version": "v2", "created": "Thu, 26 Jan 2017 15:56:14 GMT"}, {"version": "v3", "created": "Fri, 10 Feb 2017 22:34:25 GMT"}, {"version": "v4", "created": "Tue, 21 Mar 2017 03:19:04 GMT"}, {"version": "v5", "created": "Sat, 1 Apr 2017 09:10:15 GMT"}], "update_date": "2017-04-04", "authors_parsed": [["Serguieva", "Antoaneta", ""]]}]