[{"id": "1910.00258", "submitter": "Jan Posp\\'i\\v{s}il", "authors": "Jan Posp\\'i\\v{s}il and Vladim\\'ir \\v{S}v\\'igler", "title": "Isogeometric analysis in option pricing", "comments": null, "journal-ref": "Int. J. Comput. Math 96(11), 2177--2200, 2019", "doi": "10.1080/00207160.2018.1494826", "report-no": null, "categories": "q-fin.CP cs.NA math.AP math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Isogeometric analysis is a recently developed computational approach that\nintegrates finite element analysis directly into design described by\nnon-uniform rational B-splines (NURBS). In this paper we show that price\nsurfaces that occur in option pricing can be easily described by NURBS\nsurfaces. For a class of stochastic volatility models, we develop a methodology\nfor solving corresponding pricing partial integro-differential equations\nnumerically by isogeometric analysis tools and show that a very small number of\nspace discretization steps can be used to obtain sufficiently accurate results.\nPresented solution by finite element method is especially useful for\npractitioners dealing with derivatives where closed-form solution is not\navailable.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2019 08:43:54 GMT"}], "update_date": "2019-10-02", "authors_parsed": [["Pospíšil", "Jan", ""], ["Švígler", "Vladimír", ""]]}, {"id": "1910.01490", "submitter": "Yang Qu", "authors": "Yang Qu, Ming-Xi Wang", "title": "The option pricing model based on time values: an application of the\n  universal approximation theory on unbounded domains", "comments": "To appear in IJCNN 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a time value related decision function to treat a classical option\npricing problem raised by Hutchinson-Lo-Poggio. In numerical experiments, the\nnew decision function significantly improves the original model of\nHutchinson-Lo-Poggio with faster convergence and better generalization\nperformance. By proving a novel universal approximation theorem, we show that\nour decision function rather than Hutchinson-Lo-Poggio's can be approximated on\nthe entire domain of definition by neural networks. Thus the experimental\nresults are partially explained by the representation properties of networks.\n", "versions": [{"version": "v1", "created": "Wed, 2 Oct 2019 12:52:58 GMT"}, {"version": "v2", "created": "Thu, 19 Dec 2019 22:18:49 GMT"}, {"version": "v3", "created": "Mon, 19 Apr 2021 18:48:33 GMT"}], "update_date": "2021-04-21", "authors_parsed": [["Qu", "Yang", ""], ["Wang", "Ming-Xi", ""]]}, {"id": "1910.04075", "submitter": "Lisha Lin", "authors": "Lisha Lin, Yaqiong Li, Rui Gao, Jianhong Wu", "title": "The Numerical Simulation of Quanto Option Prices Using Bayesian\n  Statistical Methods", "comments": "31 pages, 5 figures and 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the paper, the pricing of Quanto options is studied, where the underlying\nforeign asset and the exchange rate are correlated with each other. Firstly, we\nadopt Bayesian methods to estimate unknown parameters entering the pricing\nformula of Quanto options, including the volatility of stock, the volatility of\nexchange rate and the correlation. Secondly, we compute and predict prices of\ndifferent four types of Quanto options based on Bayesian posterior prediction\ntechniques and Monte Carlo methods. Finally, we provide numerical simulations\nto demonstrate the advantage of Bayesian method used in this paper comparing\nwith some other existing methods. This paper is a new application of the\nBayesian methods in the pricing of multi-asset options.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2019 14:40:54 GMT"}], "update_date": "2019-10-10", "authors_parsed": [["Lin", "Lisha", ""], ["Li", "Yaqiong", ""], ["Gao", "Rui", ""], ["Wu", "Jianhong", ""]]}, {"id": "1910.07241", "submitter": "Francesco Statti", "authors": "Damir Filipovi\\'c, Kathrin Glau, Yuji Nakatsukasa, Francesco Statti", "title": "Weighted Monte Carlo with least squares and randomized extended Kaczmarz\n  for option pricing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a methodology for computing single and multi-asset European option\nprices, and more generally expectations of scalar functions of (multivariate)\nrandom variables. This new approach combines the ability of Monte Carlo\nsimulation to handle high-dimensional problems with the efficiency of function\napproximation. Specifically, we first generalize the recently developed method\nfor multivariate integration in [arXiv:1806.05492] to integration with respect\nto probability measures. The method is based on the principle \"approximate and\nintegrate\" in three steps i) sample the integrand at points in the integration\ndomain, ii) approximate the integrand by solving a least-squares problem, iii)\nintegrate the approximate function. In high-dimensional applications we face\nmemory limitations due to large storage requirements in step ii). Combining\nweighted sampling and the randomized extended Kaczmarz algorithm we obtain a\nnew efficient approach to solve large-scale least-squares problems. Our\nconvergence and cost analysis along with numerical experiments show the\neffectiveness of the method in both low and high dimensions, and under the\nassumption of a limited number of available simulations.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2019 09:36:29 GMT"}], "update_date": "2019-10-21", "authors_parsed": [["Filipović", "Damir", ""], ["Glau", "Kathrin", ""], ["Nakatsukasa", "Yuji", ""], ["Statti", "Francesco", ""]]}, {"id": "1910.13205", "submitter": "Olivier Gu\\'eant", "authors": "Olivier Gu\\'eant, Iuliia Manziuk", "title": "Deep reinforcement learning for market making in corporate bonds:\n  beating the curse of dimensionality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In corporate bond markets, which are mainly OTC markets, market makers play a\ncentral role by providing bid and ask prices for a large number of bonds to\nasset managers from all around the globe. Determining the optimal bid and ask\nquotes that a market maker should set for a given universe of bonds is a\ncomplex task. Useful models exist, most of them inspired by that of Avellaneda\nand Stoikov. These models describe the complex optimization problem faced by\nmarket makers: proposing bid and ask prices in an optimal way for making money\nout of the difference between bid and ask prices while mitigating the market\nrisk associated with holding inventory. While most of the models only tackle\none-asset market making, they can often be generalized to a multi-asset\nframework. However, the problem of solving numerically the equations\ncharacterizing the optimal bid and ask quotes is seldom tackled in the\nliterature, especially in high dimension. In this paper, our goal is to propose\na numerical method for approximating the optimal bid and ask quotes over a\nlarge universe of bonds in a model \\`a la Avellaneda-Stoikov. Because we aim at\nconsidering a large universe of bonds, classical finite difference methods as\nthose discussed in the literature cannot be used and we present therefore a\ndiscrete-time method inspired by reinforcement learning techniques. More\nprecisely, the approach we propose is a model-based actor-critic-like algorithm\ninvolving deep neural networks.\n", "versions": [{"version": "v1", "created": "Tue, 29 Oct 2019 11:31:04 GMT"}], "update_date": "2019-10-30", "authors_parsed": [["Guéant", "Olivier", ""], ["Manziuk", "Iuliia", ""]]}, {"id": "1910.14282", "submitter": "Lingfei Li", "authors": "Christian Meier, Lingfei Li, Gongqiu Zhang", "title": "Markov Chain Approximation of One-Dimensional Sticky Diffusions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop continuous time Markov chain (CTMC) approximation of\none-dimensional diffusions with a lower sticky boundary. Approximate solutions\nto the action of the Feynman-Kac operator associated with a sticky diffusion\nand first passage probabilities are obtained using matrix exponentials. We show\nhow to compute matrix exponentials efficiently and prove that a carefully\ndesigned scheme achieves second order convergence. We also propose a scheme\nbased on CTMC approximation for the simulation of sticky diffusions, for which\nthe Euler scheme may completely fail. The efficiency of our method and its\nadvantages over alternative approaches are illustrated in the context of bond\npricing in a sticky short rate model for low interest environment.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2019 07:27:33 GMT"}], "update_date": "2019-11-01", "authors_parsed": [["Meier", "Christian", ""], ["Li", "Lingfei", ""], ["Zhang", "Gongqiu", ""]]}, {"id": "1910.14522", "submitter": "Alan Lewis", "authors": "Alan L. Lewis", "title": "Option-based Equity Risk Premiums", "comments": "44 pages, 12 figures, revised Appendix A, added reference to an\n  application to COVID-19 pandemic, supplemented conclusions with a remark\n  about Ross Recovery", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct the term structure of the (forward-looking, US market) equity\nrisk premium from SPX option chains. The method is \"model-light\". Risk-neutral\nprobability densities are estimated by fitting $N$-component Gaussian mixture\nmodels to option quotes, where $N$ is a small integer (here 4 or 5). These\ndensities are transformed to their real-world equivalents by exponential\ntilting with a single parameter: the Coefficient of Relative Risk Aversion\n$\\kappa$. From history, I estimate $\\kappa = 3 \\pm 0.5$. From the inferred\nreal-world densities, the equity risk premium is readily calculated. Three term\nstructures serve as examples.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2019 15:07:33 GMT"}, {"version": "v2", "created": "Thu, 30 Apr 2020 22:54:22 GMT"}], "update_date": "2020-05-04", "authors_parsed": [["Lewis", "Alan L.", ""]]}]