[{"id": "2002.00816", "submitter": "Denis Belomestny", "authors": "Christian Bayer, Denis Belomestny, Paul Hager, Paolo Pigato, John\n  Schoenmakers", "title": "Randomized optimal stopping algorithms and their convergence analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.NA math.NA q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study randomized optimal stopping problems and consider\ncorresponding forward and backward Monte Carlo based optimisation algorithms.\nIn particular we prove the convergence of the proposed algorithms and derive\nthe corresponding convergence rates.\n", "versions": [{"version": "v1", "created": "Mon, 3 Feb 2020 15:17:14 GMT"}], "update_date": "2020-02-05", "authors_parsed": [["Bayer", "Christian", ""], ["Belomestny", "Denis", ""], ["Hager", "Paul", ""], ["Pigato", "Paolo", ""], ["Schoenmakers", "John", ""]]}, {"id": "2002.02481", "submitter": "Francois Belletti", "authors": "Francois Belletti, Davis King, James Lottes, Yi-Fan Chen, John\n  Anderson", "title": "Sensitivity Analysis in the Dupire Local Volatility Model with\n  Tensorflow", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC q-fin.CP stat.CO", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  In a recent paper, we have demonstrated how the affinity between TPUs and\nmulti-dimensional financial simulation resulted in fast Monte Carlo simulations\nthat could be setup in a few lines of python Tensorflow code. We also presented\na major benefit from writing high performance simulations in an automated\ndifferentiation language such as Tensorflow: a single line of code enabled us\nto estimate sensitivities, i.e. the rate of change in price of financial\ninstrument with respect to another input such as the interest rate, the current\nprice of the underlying, or volatility. Such sensitivities (otherwise known as\nthe famous financial \"Greeks\") are fundamental for risk assessment and risk\nmitigation. In the present follow-up short paper, we extend the developments\nexposed in our previous work about the use of Tensor Processing Units and\nTensorflow for TPUs.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2020 19:27:44 GMT"}], "update_date": "2020-02-10", "authors_parsed": [["Belletti", "Francois", ""], ["King", "Davis", ""], ["Lottes", "James", ""], ["Chen", "Yi-Fan", ""], ["Anderson", "John", ""]]}, {"id": "2002.03295", "submitter": "Khaled Masoumifard", "authors": "Khaled Masoumifard and Mohammad Zokaei", "title": "Stochastic optimization of the Dividend strategy with reinsurance in\n  correlated multiple insurance lines of business", "comments": "39 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.CP", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  The present paper addresses the issue of the stochastic control of the\noptimal dynamic reinsurance policy and dynamic dividend strategy, which are\nstate-dependent, for an insurance company that operates under multiple\ninsurance lines of business. The aggregate claims model with a\nthinning-dependence structure is adopted for the risk process. In the\noptimization method, the maximum of the cumulative expected discounted dividend\npayouts with respect to the dividend and reinsurance strategies are considered\nas value function. This value function is characterized as the smallest super\nViscosity solution of the associated Hamilton-Jacobi- Bellman (HJB) equation.\nThe finite difference method (FDM) has been utilized for the numerical solution\nof the value function and the optimal control strategy and the proof for the\nconvergence of this numerical solution to the value function is provided. The\nfindings of this paper provide insights for the insurance companies as such\nthat based upon the lines in which they are operating, they can choose a vector\nof the optimal dynamic reinsurance strategies and consequently transfer some\npart of their risks to several reinsurers.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2020 06:18:37 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Masoumifard", "Khaled", ""], ["Zokaei", "Mohammad", ""]]}, {"id": "2002.04675", "submitter": "Ludovic Mathys", "authors": "Walter Farkas, Ludovic Mathys, Nikola Vasiljevi\\'c", "title": "Intra-Horizon Expected Shortfall and Risk Structure in Models with Jumps", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present article deals with intra-horizon risk in models with jumps. Our\ngeneral understanding of intra-horizon risk is along the lines of the approach\ntaken in Boudoukh, Richardson, Stanton and Whitelaw (2004), Rossello (2008),\nBhattacharyya, Misra and Kodase (2009), Bakshi and Panayotov (2010), and\nLeippold and Vasiljevi\\'c (2019). In particular, we believe that quantifying\nmarket risk by strictly relying on point-in-time measures cannot be deemed a\nsatisfactory approach in general. Instead, we argue that complementing this\napproach by studying measures of risk that capture the magnitude of losses\npotentially incurred at any time of a trading horizon is necessary when dealing\nwith (m)any financial position(s). To address this issue, we propose an\nintra-horizon analogue of the expected shortfall for general profit and loss\nprocesses and discuss its key properties. Our intra-horizon expected shortfall\nis well-defined for (m)any popular class(es) of L\\'evy processes encountered\nwhen modeling market dynamics and constitutes a coherent measure of risk, as\nintroduced in Cheridito, Delbaen and Kupper (2004). On the computational side,\nwe provide a simple method to derive the intra-horizon risk inherent to popular\nL\\'evy dynamics. Our general technique relies on results for\nmaturity-randomized first-passage probabilities and allows for a derivation of\ndiffusion and single jump risk contributions. These theoretical results are\ncomplemented with an empirical analysis, where popular L\\'evy dynamics are\ncalibrated to S&P 500 index data and an analysis of the resulting intra-horizon\nrisk is presented.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2020 20:50:44 GMT"}, {"version": "v2", "created": "Sun, 17 Jan 2021 13:34:39 GMT"}], "update_date": "2021-01-19", "authors_parsed": [["Farkas", "Walter", ""], ["Mathys", "Ludovic", ""], ["Vasiljević", "Nikola", ""]]}, {"id": "2002.07117", "submitter": "Pablo Olivares", "authors": "Pablo Olivares", "title": "Pricing Bitcoin Derivatives under Jump-Diffusion Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  In recent years cryptocurrency trading has captured the attention of\npractitioners and academics. The volume of the exchange with standard\ncurrencies has known a dramatic increasing of late. This paper addresses to the\nneed of models describing a bitcoin-US dollar exchange dynamic and their use to\nevaluate European option having bitcoin as underlying asset.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 18:31:18 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Olivares", "Pablo", ""]]}, {"id": "2002.07389", "submitter": "Janusz Milek", "authors": "Janusz Milek", "title": "Quantum Implementation of Risk Analysis-relevant Copulas", "comments": "15 pages, 32+10 figures, 4+1 tables. Changes in v.2: updated\n  references p. 2 and 14-15, typo correction p. 6, quantum circuit diagrams\n  improved for gray print", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-fin.CP q-fin.RM quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern quantitative risk management relies on an adequate modeling of the\ntail dependence and a possibly accurate quantification of risk measures, like\nValue at Risk (VaR), at high confidence levels like 1 in 100 or even 1 in 2000.\nQuantum computing makes such a quantification quadratically more efficient than\nthe Monte Carlo method; see (Woerner and Egger, 2018) and, for a broader\nperspective, (Or\\'us et al., 2018). An important element of the risk analysis\ntoolbox is copula, see (Jouanin et al., 2004) regarding financial applications.\nHowever, to the best knowledge of the author, no quantum computing\nimplementation for sampling from a risk modeling-relevant copula in explicit\nform has been published so far. Our focus here is implementation of simple yet\npowerful copula models, capable of a satisfactory capturing the joint tail\nbehaviour of the modelled risk factors. This paper deals with a few simple\ncopula families, including Multivariate B11 (MB11) copula family, presented in\n(Milek, 2014). We will show that this copula family is suitable for the risk\naggregation as it is exceptionally able to reproduce tail dependence\nstructures; see (Embrechts et al., 2016) for a relevant benchmark as well as\nnecessary and sufficient conditions regarding the ultimate feasible bivariate\ntail dependence structures. It turns out that such a discretized copula can be\nexpressed using simple constructs present in the quantum computing: binary\nfraction expansion format, comonotone/independent random variables, controlled\ngates, and convex combinations, and is therefore suitable for a quantum\ncomputer implementation. This paper presents design behind the quantum\nimplementation circuits, numerical and symbolic simulation results, and\nexperimental validation on IBM quantum computer. The paper proposes also a\ngeneric method for quantum implementation of any discretized copula.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 06:05:43 GMT"}, {"version": "v2", "created": "Mon, 9 Mar 2020 06:08:37 GMT"}], "update_date": "2020-03-10", "authors_parsed": [["Milek", "Janusz", ""]]}, {"id": "2002.08245", "submitter": "Tianping Zhang", "authors": "Tianping Zhang and Yuanqi Li and Yifei Jin and Jian Li", "title": "AutoAlpha: an Efficient Hierarchical Evolutionary Algorithm for Mining\n  Alpha Factors in Quantitative Investment", "comments": "7 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The multi-factor model is a widely used model in quantitative investment. The\nsuccess of a multi-factor model is largely determined by the effectiveness of\nthe alpha factors used in the model. This paper proposes a new evolutionary\nalgorithm called AutoAlpha to automatically generate effective formulaic alphas\nfrom massive stock datasets. Specifically, first we discover an inherent\npattern of the formulaic alphas and propose a hierarchical structure to quickly\nlocate the promising part of space for search. Then we propose a new Quality\nDiversity search based on the Principal Component Analysis (PCA-QD) to guide\nthe search away from the well-explored space for more desirable results. Next,\nwe utilize the warm start method and the replacement method to prevent the\npremature convergence problem. Based on the formulaic alphas we discover, we\npropose an ensemble learning-to-rank model for generating the portfolio. The\nbacktests in the Chinese stock market and the comparisons with several\nbaselines further demonstrate the effectiveness of AutoAlpha in mining\nformulaic alphas for quantitative trading.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2020 02:26:05 GMT"}, {"version": "v2", "created": "Sat, 4 Apr 2020 04:27:45 GMT"}], "update_date": "2020-04-07", "authors_parsed": [["Zhang", "Tianping", ""], ["Li", "Yuanqi", ""], ["Jin", "Yifei", ""], ["Li", "Jian", ""]]}, {"id": "2002.08492", "submitter": "Alexandre Carbonneau", "authors": "Alexandre Carbonneau and Fr\\'ed\\'eric Godin", "title": "Equal Risk Pricing of Derivatives with Deep Hedging", "comments": "44 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents a deep reinforcement learning approach to price and\nhedge financial derivatives. This approach extends the work of Guo and Zhu\n(2017) who recently introduced the equal risk pricing framework, where the\nprice of a contingent claim is determined by equating the optimally hedged\nresidual risk exposure associated respectively with the long and short\npositions in the derivative. Modifications to the latter scheme are considered\nto circumvent theoretical pitfalls associated with the original approach.\nDerivative prices obtained through this modified approach are shown to be\narbitrage-free. The current paper also presents a general and tractable\nimplementation for the equal risk pricing framework inspired by the deep\nhedging algorithm of Buehler et al. (2019). An $\\epsilon$-completeness measure\nallowing for the quantification of the residual hedging risk associated with a\nderivative is also proposed. The latter measure generalizes the one presented\nin Bertsimas et al. (2001) based on the quadratic penalty. Monte Carlo\nsimulations are performed under a large variety of market dynamics to\ndemonstrate the practicability of our approach, to perform benchmarking with\nrespect to traditional methods and to conduct sensitivity analyses.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2020 22:59:59 GMT"}, {"version": "v2", "created": "Sun, 7 Jun 2020 17:30:54 GMT"}], "update_date": "2020-06-09", "authors_parsed": [["Carbonneau", "Alexandre", ""], ["Godin", "Frédéric", ""]]}, {"id": "2002.09911", "submitter": "Ludovic Mathys", "authors": "Walter Farkas, Ludovic Mathys", "title": "Geometric Step Options with Jumps. Parity Relations, PIDEs, and\n  Semi-Analytical Pricing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present article studies geometric step options in exponential L\\'evy\nmarkets. Our contribution is manifold and extends several aspects of the\ngeometric step option pricing literature. First, we provide symmetry and parity\nrelations and derive various characterizations for both European-type and\nAmerican-type geometric double barrier step options. In particular, we are able\nto obtain a jump-diffusion disentanglement for the early exercise premium of\nAmerican-type geometric double barrier step contracts and its\nmaturity-randomized equivalent as well as to characterize the diffusion and\njump contributions to these early exercise premiums separately by means of\npartial integro-differential equations and ordinary integro-differential\nequations. As an application of our characterizations, we derive\nsemi-analytical pricing results for (regular) European-type and American-type\ngeometric down-and-out step call options under hyper-exponential jump-diffusion\nmodels. Lastly, we use the latter results to discuss the early exercise\nstructure of geometric step options once jumps are added and to subsequently\nprovide an analysis of the impact of jumps on the price and hedging parameters\nof (European-type and American-type) geometric step contracts.\n", "versions": [{"version": "v1", "created": "Sun, 23 Feb 2020 14:21:22 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Farkas", "Walter", ""], ["Mathys", "Ludovic", ""]]}, {"id": "2002.10206", "submitter": "C\\'onall Kelly", "authors": "C\\'onall Kelly, Gabriel Lord, Heru Maulana", "title": "Hybrid, adaptive, and positivity preserving numerical methods for the\n  Cox-Ingersoll-Ross model", "comments": "24 pages, 3 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an adaptive Euler method for the approximate solution of the\nCox-Ingersoll-Ross short rate model. An explicit discretisation is applied over\nan adaptive mesh to the stochastic differential equation (SDE) governing the\nsquare root of the solution, relying upon a class of path-bounded timestepping\nstrategies which work by reducing the stepsize as solutions approach a\nneighbourhood of zero. The method is hybrid in the sense that a backstop method\nis invoked if the timestep becomes too small, or to prevent solutions from\novershooting zero and becoming negative. Under parameter constraints that imply\nFeller's condition, we prove that such a scheme is strongly convergent, of\norder at least 1/2. Under Feller's condition we also prove that the probability\nof ever needing the backstop method to prevent a negative value can be made\narbitrarily small. Numerically, we compare this adaptive method to fixed step\nschemes extant in the literature, both implicit and explicit, and a novel\nsemi-implicit adaptive variant. We observe that the adaptive approach leads to\nmethods that are competitive over the entire domain of Feller's condition.\n", "versions": [{"version": "v1", "created": "Mon, 24 Feb 2020 12:47:36 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Kelly", "Cónall", ""], ["Lord", "Gabriel", ""], ["Maulana", "Heru", ""]]}, {"id": "2002.10385", "submitter": "Ben Moews", "authors": "Ben Moews and Gbenga Ibikunle", "title": "Predictive intraday correlations in stable and volatile market\n  environments: Evidence from deep learning", "comments": "15 pages, 6 figures, preprint submitted to Physica A", "journal-ref": null, "doi": "10.1016/j.physa.2020.124392", "report-no": null, "categories": "q-fin.CP cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Standard methods and theories in finance can be ill-equipped to capture\nhighly non-linear interactions in financial prediction problems based on\nlarge-scale datasets, with deep learning offering a way to gain insights into\ncorrelations in markets as complex systems. In this paper, we apply deep\nlearning to econometrically constructed gradients to learn and exploit lagged\ncorrelations among S&P 500 stocks to compare model behaviour in stable and\nvolatile market environments, and under the exclusion of target stock\ninformation for predictions. In order to measure the effect of time horizons,\nwe predict intraday and daily stock price movements in varying interval lengths\nand gauge the complexity of the problem at hand with a modification of our\nmodel architecture. Our findings show that accuracies, while remaining\nsignificant and demonstrating the exploitability of lagged correlations in\nstock markets, decrease with shorter prediction horizons. We discuss\nimplications for modern finance theory and our work's applicability as an\ninvestigative tool for portfolio managers. Lastly, we show that our model's\nperformance is consistent in volatile markets by exposing it to the environment\nof the recent financial crisis of 2007/2008.\n", "versions": [{"version": "v1", "created": "Mon, 24 Feb 2020 17:19:54 GMT"}], "update_date": "2020-04-22", "authors_parsed": [["Moews", "Ben", ""], ["Ibikunle", "Gbenga", ""]]}, {"id": "2002.10990", "submitter": "Matthew Dixon", "authors": "Matthew Dixon and Igor Halperin", "title": "G-Learner and GIRL: Goal Based Wealth Management with Reinforcement\n  Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.LG q-fin.CP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a reinforcement learning approach to goal based wealth management\nproblems such as optimization of retirement plans or target dated funds. In\nsuch problems, an investor seeks to achieve a financial goal by making periodic\ninvestments in the portfolio while being employed, and periodically draws from\nthe account when in retirement, in addition to the ability to re-balance the\nportfolio by selling and buying different assets (e.g. stocks). Instead of\nrelying on a utility of consumption, we present G-Learner: a reinforcement\nlearning algorithm that operates with explicitly defined one-step rewards, does\nnot assume a data generation process, and is suitable for noisy data. Our\napproach is based on G-learning - a probabilistic extension of the Q-learning\nmethod of reinforcement learning.\n  In this paper, we demonstrate how G-learning, when applied to a quadratic\nreward and Gaussian reference policy, gives an entropy-regulated Linear\nQuadratic Regulator (LQR). This critical insight provides a novel and\ncomputationally tractable tool for wealth management tasks which scales to high\ndimensional portfolios. In addition to the solution of the direct problem of\nG-learning, we also present a new algorithm, GIRL, that extends our goal-based\nG-learning approach to the setting of Inverse Reinforcement Learning (IRL)\nwhere rewards collected by the agent are not observed, and should instead be\ninferred. We demonstrate that GIRL can successfully learn the reward parameters\nof a G-Learner agent and thus imitate its behavior. Finally, we discuss\npotential applications of the G-Learner and GIRL algorithms for wealth\nmanagement and robo-advising.\n", "versions": [{"version": "v1", "created": "Tue, 25 Feb 2020 16:03:38 GMT"}], "update_date": "2020-02-26", "authors_parsed": [["Dixon", "Matthew", ""], ["Halperin", "Igor", ""]]}, {"id": "2002.11258", "submitter": "Nicolas Essis-Breton", "authors": "Nicolas Essis-Breton and Patrice Gaillardetz", "title": "Fast Lower and Upper Estimates for the Price of Constrained Multiple\n  Exercise American Options by Single Pass Lookahead Search and\n  Nearest-Neighbor Martingale", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.LG math.OC q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents fast lower and upper estimates for a large class of\noptions: the class of constrained multiple exercise American options. Typical\noptions in this class are swing options with volume and timing constraints, and\npassport options with multiple lookback rights. The lower estimate algorithm\nuses the artificial intelligence method of lookahead search. The upper estimate\nalgorithm uses the dual approach to option pricing on a nearest-neighbor basis\nfor the martingale space. Probabilistic convergence guarantees are provided.\nSeveral numerical examples illustrate the approaches including a swing option\nwith four constraints, and a passport option with 16 constraints.\n", "versions": [{"version": "v1", "created": "Wed, 26 Feb 2020 02:06:06 GMT"}], "update_date": "2020-02-27", "authors_parsed": [["Essis-Breton", "Nicolas", ""], ["Gaillardetz", "Patrice", ""]]}, {"id": "2002.11976", "submitter": "Onkar Jadhav", "authors": "Andreas Binder (1), Onkar Jadhav (1 and 2) and Volker Mehrmann (2)\n  ((1) MathConsult GmbH, Linz, Austria, (2) Institute of Mathematics, TU\n  Berlin, Berlin, Germany)", "title": "Model order reduction for parametric high dimensional models in the\n  analysis of financial risk", "comments": "39 pages, 10 figures", "journal-ref": null, "doi": "10.1186/s13362-021-00105-8", "report-no": null, "categories": "q-fin.CP cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a model order reduction (MOR) approach for high\ndimensional problems in the analysis of financial risk. To understand the\nfinancial risks and possible outcomes, we have to perform several thousand\nsimulations of the underlying product. These simulations are expensive and\ncreate a need for efficient computational performance. Thus, to tackle this\nproblem, we establish a MOR approach based on a proper orthogonal decomposition\n(POD) method. The study involves the computations of high dimensional\nparametric convection-diffusion reaction partial differential equations (PDEs).\nPOD requires to solve the high dimensional model at some parameter values to\ngenerate a reduced-order basis. We propose an adaptive greedy sampling\ntechnique based on surrogate modeling for the selection of the sample parameter\nset that is analyzed, implemented, and tested on the industrial data. The\nresults obtained for the numerical example of a floater with cap and floor\nunder the Hull-White model indicate that the MOR approach works well for\nshort-rate models.\n", "versions": [{"version": "v1", "created": "Thu, 27 Feb 2020 09:09:56 GMT"}, {"version": "v2", "created": "Mon, 6 Jul 2020 17:49:36 GMT"}], "update_date": "2021-06-15", "authors_parsed": [["Binder", "Andreas", "", "1 and 2"], ["Jadhav", "Onkar", "", "1 and 2"], ["Mehrmann", "Volker", ""]]}]