[{"id": "2003.00130", "submitter": "James Wallbridge", "authors": "James Wallbridge", "title": "Transformers for Limit Order Books", "comments": "16 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new deep learning architecture for predicting price movements\nfrom limit order books. This architecture uses a causal convolutional network\nfor feature extraction in combination with masked self-attention to update\nfeatures based on relevant contextual information. This architecture is shown\nto significantly outperform existing architectures such as those using\nconvolutional networks (CNN) and Long-Short Term Memory (LSTM) establishing a\nnew state-of-the-art benchmark for the FI-2010 dataset.\n", "versions": [{"version": "v1", "created": "Sat, 29 Feb 2020 00:06:38 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Wallbridge", "James", ""]]}, {"id": "2003.00334", "submitter": "Zhiqiu Li", "authors": "Nian Yao, Zhiqiu Li, Zhichao Ling, Junfeng Lin", "title": "Asymptotic Smiles for an Affine Jump-Diffusion Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the asymptotic behaviors of implied volatility of an\naffine jump-diffusion model. Let log stock price under risk-neutral measure\nfollow an affine jump-diffusion model, we show that an explicit form of moment\ngenerating function for log stock price can be obtained by solving a set of\nordinary differential equations. A large-time large deviation principle for log\nstock price is derived by applying the G\\\"{a}rtner-Ellis theorem. We\ncharacterize the asymptotic behaviors of the implied volatility in the\nlarge-maturity and large-strike regime using rate function in the large\ndeviation principle. The asymptotics of the Black-Scholes implied volatility\nfor fixed-maturity, large-strike and fixed-maturity, small-strike regimes are\nalso studied. Numerical results are provided to validate the theoretical work.\n", "versions": [{"version": "v1", "created": "Sat, 29 Feb 2020 19:48:36 GMT"}, {"version": "v2", "created": "Fri, 8 May 2020 02:11:03 GMT"}], "update_date": "2020-05-11", "authors_parsed": [["Yao", "Nian", ""], ["Li", "Zhiqiu", ""], ["Ling", "Zhichao", ""], ["Lin", "Junfeng", ""]]}, {"id": "2003.00884", "submitter": "Amit Chattopadhyay", "authors": "Amit K Chattopadhyay, Biswajit Debnath, Rihab El-Hassani, Sadhan Kumar\n  Ghosh, Rahul Baidya", "title": "Cleaner Production in Optimized Multivariate Networks: Operations\n  Management through a Roll of Dice", "comments": "18 pages, 9 figures; 3 additional appendices (14 pages)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.CP q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The importance of supply chain management in analyzing and later catalyzing\neconomic expectations while simultaneously prioritizing cleaner production\naspects is a vital component of modern finance. Such predictions, though, are\noften known to be less than accurate due to the ubiquitous uncertainty plaguing\nmost business decisions. Starting from a multi-dimensional cost function\ndefining the sustainability of the supply chain (SC) kernel, this article\noutlines a 4-component SC module - environmental, demand, economic, and social\nuncertainties - each ranked according to its individual weight. Our\nmathematical model then assesses the viability of a sustainable business by\nfirst ranking the potentially stochastic variables in order of their subjective\nimportance, and then optimizing the cost kernel, defined from a utility\nfunction. The model will then identify conditions (as equations) validating the\nsustainability of a business venture. The ranking is initially obtained from an\nAnalytical Hierarchical Process; the resultant weighted cost function is then\noptimized to analyze the impact of market uncertainty based on our supply chain\nmodel. Model predictions are then ratified against SME data to emphasize the\nimportance of cleaner production in business strategies.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 19:18:11 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Chattopadhyay", "Amit K", ""], ["Debnath", "Biswajit", ""], ["El-Hassani", "Rihab", ""], ["Ghosh", "Sadhan Kumar", ""], ["Baidya", "Rahul", ""]]}, {"id": "2003.01809", "submitter": "Yongyang Cai", "authors": "Yongyang Cai, Kenneth Judd, Rong Xu", "title": "Numerical Solution of Dynamic Portfolio Optimization with Transaction\n  Costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM econ.GN q-fin.CP q-fin.EC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply numerical dynamic programming techniques to solve discrete-time\nmulti-asset dynamic portfolio optimization problems with proportional\ntransaction costs and shorting/borrowing constraints. Examples include problems\nwith multiple assets, and many trading periods in a finite horizon problem. We\nalso solve dynamic stochastic problems, with a portfolio including one\nrisk-free asset, an option, and its underlying risky asset, under the existence\nof transaction costs and constraints. These examples show that it is now\ntractable to solve such problems.\n", "versions": [{"version": "v1", "created": "Tue, 3 Mar 2020 21:50:16 GMT"}], "update_date": "2020-03-05", "authors_parsed": [["Cai", "Yongyang", ""], ["Judd", "Kenneth", ""], ["Xu", "Rong", ""]]}, {"id": "2003.01977", "submitter": "Kristoffer Andersson", "authors": "Kristoffer Andersson and Cornelis Oosterlee", "title": "A deep learning approach for computations of exposure profiles for\n  high-dimensional Bermudan options", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a neural network-based method for approximating\nexpected exposures and potential future exposures of Bermudan options. In a\nfirst phase, the method relies on the Deep Optimal Stopping algorithm, which\nlearns the optimal stopping rule from Monte-Carlo samples of the underlying\nrisk factors. Cashflow-paths are then created by applying the learned stopping\nstrategy on a new set of realizations of the risk factors. Furthermore, in a\nsecond phase the risk factors are regressed against the cashflow-paths to\nobtain approximations of pathwise option values. The regression step is carried\nout by ordinary least squares as well as neural networks, and it is shown that\nthe latter produces more accurate approximations.\n  The expected exposure is formulated, both in terms of the cashflow-paths and\nin terms of the pathwise option values and it is shown that a simple\nMonte-Carlo average yields accurate approximations in both cases. The potential\nfuture exposure is estimated by the empirical $\\alpha$-percentile.\n  Finally, it is shown that the expected exposures, as well as the potential\nfuture exposures can be computed under either, the risk neutral measure, or the\nreal world measure, without having to re-train the neural networks.\n", "versions": [{"version": "v1", "created": "Wed, 4 Mar 2020 10:08:03 GMT"}, {"version": "v2", "created": "Thu, 5 Mar 2020 16:40:42 GMT"}, {"version": "v3", "created": "Fri, 11 Sep 2020 13:08:21 GMT"}], "update_date": "2020-09-14", "authors_parsed": [["Andersson", "Kristoffer", ""], ["Oosterlee", "Cornelis", ""]]}, {"id": "2003.02035", "submitter": "Yuri F. Saporito", "authors": "Yuri F. Saporito and Zhaoyu Zhang", "title": "PDGM: a Neural Network Approach to Solve Path-Dependent Partial\n  Differential Equations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a novel numerical method for Path-Dependent Partial\nDifferential Equations (PPDEs). These equations firstly appeared in the seminal\nwork of Dupire [2009], where the functional It\\^o calculus was developed to\ndeal with path-dependent financial derivatives contracts. More specificaly, we\ngeneralize the Deep Galerking Method (DGM) of Sirignano and Spiliopoulos [2018]\nto deal with these equations. The method, which we call Path-Dependent DGM\n(PDGM), consists of using a combination of feed-forward and Long Short-Term\nMemory architectures to model the solution of the PPDE. We then analyze several\nnumerical examples, many from the Financial Mathematics literature, that show\nthe capabilities of the method under very different situations.\n", "versions": [{"version": "v1", "created": "Wed, 4 Mar 2020 12:26:54 GMT"}, {"version": "v2", "created": "Fri, 3 Apr 2020 19:18:44 GMT"}], "update_date": "2020-04-07", "authors_parsed": [["Saporito", "Yuri F.", ""], ["Zhang", "Zhaoyu", ""]]}, {"id": "2003.02515", "submitter": "Yuk Kwan Wong", "authors": "Steven Y. K. Wong (1), Jennifer Chan (2), Lamiae Azizi (2), and\n  Richard Y. D. Xu (1) ((1) University of Technology Sydney, (2) University of\n  Sydney)", "title": "Time-varying neural network for stock return prediction", "comments": "35 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.LG q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of neural network training in a time-varying context.\nMachine learning algorithms have excelled in problems that do not change over\ntime. However, problems encountered in financial markets are often\ntime-varying. We propose the online early stopping algorithm and show that a\nneural network trained using this algorithm can track a function changing with\nunknown dynamics. We compare the proposed algorithm to current approaches on\npredicting monthly U.S. stock returns and show its superiority. We also show\nthat prominent factors (such as the size and momentum effects) and industry\nindicators, exhibit time varying stock return predictiveness. We find that\nduring market distress, industry indicators experience an increase in\nimportance at the expense of firm level features. This indicates that\nindustries play a role in explaining stock returns during periods of heightened\nrisk.\n", "versions": [{"version": "v1", "created": "Thu, 5 Mar 2020 10:16:13 GMT"}, {"version": "v2", "created": "Wed, 8 Apr 2020 11:28:00 GMT"}, {"version": "v3", "created": "Mon, 29 Jun 2020 12:08:29 GMT"}, {"version": "v4", "created": "Fri, 22 Jan 2021 11:39:29 GMT"}], "update_date": "2021-01-25", "authors_parsed": [["Wong", "Steven Y. K.", ""], ["Chan", "Jennifer", ""], ["Azizi", "Lamiae", ""], ["Xu", "Richard Y. D.", ""]]}, {"id": "2003.02842", "submitter": "Patrick Chang", "authors": "Patrick Chang, Etienne Pienaar, Tim Gebbie", "title": "Malliavin-Mancino estimators implemented with non-uniform fast Fourier\n  transforms", "comments": "29 pages, 15 figures, 3 tables, 10 algorithms, link to our supporting\n  Julia code: https://github.com/CHNPAT005/PCEPTG-MM-NUFFT; v3: Accepted\n  submitted version for SISC", "journal-ref": "SIAM J. Sci. Comput., 2020, 42(6), B1378 - B1403", "doi": "10.1137/20M1325903", "report-no": null, "categories": "q-fin.CP q-fin.TR stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We implement and test kernel averaging Non-Uniform Fast Fourier Transform\n(NUFFT) methods to enhance the performance of correlation and covariance\nestimation on asynchronously sampled event-data using the Malliavin-Mancino\nFourier estimator. The methods are benchmarked for Dirichlet and Fej\\'{e}r\nFourier basis kernels. We consider test cases formed from Geometric Brownian\nmotions to replicate synchronous and asynchronous data for benchmarking\npurposes. We consider three standard averaging kernels to convolve the\nevent-data for synchronisation via over-sampling for use with the Fast Fourier\nTransform (FFT): the Gaussian kernel, the Kaiser-Bessel kernel, and the\nexponential of semi-circle kernel. First, this allows us to demonstrate the\nperformance of the estimator with different combinations of basis kernels and\naveraging kernels. Second, we investigate and compare the impact of the\naveraging scales explicit in each averaging kernel and its relationship between\nthe time-scale averaging implicit in the Malliavin-Mancino estimator. Third, we\ndemonstrate the relationship between time-scale averaging based on the number\nof Fourier coefficients used in the estimator to a theoretical model of the\nEpps effect. We briefly demonstrate the methods on Trade-and-Quote (TAQ) data\nfrom the Johannesburg Stock Exchange to make an initial visualisation of the\ncorrelation dynamics for various time-scales under market microstructure.\n", "versions": [{"version": "v1", "created": "Thu, 5 Mar 2020 16:42:45 GMT"}, {"version": "v2", "created": "Mon, 9 Mar 2020 16:06:46 GMT"}, {"version": "v3", "created": "Tue, 10 Nov 2020 16:33:03 GMT"}], "update_date": "2020-11-11", "authors_parsed": [["Chang", "Patrick", ""], ["Pienaar", "Etienne", ""], ["Gebbie", "Tim", ""]]}, {"id": "2003.02878", "submitter": "Shane Barratt", "authors": "Shane Barratt, Jonathan Tuck, Stephen Boyd", "title": "Convex Optimization Over Risk-Neutral Probabilities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.OC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a collection of derivatives that depend on the price of an\nunderlying asset at expiration or maturity. The absence of arbitrage is\nequivalent to the existence of a risk-neutral probability distribution on the\nprice; in particular, any risk neutral distribution can be interpreted as a\ncertificate establishing that no arbitrage exists. We are interested in the\ncase when there are multiple risk-neutral probabilities. We describe a number\nof convex optimization problems over the convex set of risk neutral price\nprobabilities. These include computation of bounds on the cumulative\ndistribution, VaR, CVaR, and other quantities, over the set of risk-neutral\nprobabilities. After discretizing the underlying price, these problems become\nfinite dimensional convex or quasiconvex optimization problems, and therefore\nare tractable. We illustrate our approach using real options and futures\npricing data for the S&P 500 index and Bitcoin.\n", "versions": [{"version": "v1", "created": "Thu, 5 Mar 2020 19:17:21 GMT"}], "update_date": "2020-03-09", "authors_parsed": [["Barratt", "Shane", ""], ["Tuck", "Jonathan", ""], ["Boyd", "Stephen", ""]]}, {"id": "2003.03076", "submitter": "Arthur Denouveaux", "authors": "Rachid Guennouni Hassani (X), Alexis Gilles, Emmanuel Lassalle, Arthur\n  D\\'enouveaux", "title": "Predicting Stock Returns with Batched AROW", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend the AROW regression algorithm developed by Vaits and Crammer in\n[VC11] to handle synchronous mini-batch updates and apply it to stock return\nprediction. By design, the model should be more robust to noise and adapt\nbetter to non-stationarity compared to a simple rolling regression. We\nempirically show that the new model outperforms more classical approaches by\nbacktesting a strategy on S\\&P500 stocks.\n", "versions": [{"version": "v1", "created": "Fri, 6 Mar 2020 08:42:12 GMT"}, {"version": "v2", "created": "Fri, 20 Mar 2020 07:55:19 GMT"}], "update_date": "2020-03-23", "authors_parsed": [["Hassani", "Rachid Guennouni", "", "X"], ["Gilles", "Alexis", ""], ["Lassalle", "Emmanuel", ""], ["Dénouveaux", "Arthur", ""]]}, {"id": "2003.03876", "submitter": "Ben Boukai", "authors": "Ben Boukai", "title": "How much is your Strangle worth? On the relative value of the\n  $\\delta-$Symmetric Strangle under the Black-Scholes model", "comments": "15 pages with 3 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Trading option strangles is a highly popular strategy often used by market\nparticipants to mitigate volatility risks in their portfolios. In this paper we\npropose a measure of the relative value of a delta-Symmetric Strangle and\ncompute it under the standard Black-Scholes option pricing model. This new\nmeasure accounts for the price of the strangle, relative to the Present Value\nof the spread between the two strikes, all expressed, after a natural\nre-parameterization, in terms of delta and a volatility parameter. We show that\nunder the standard BS option pricing model, this measure of relative value is\nbounded by a simple function of delta only and is independent of the time to\nexpiry, the price of the underlying security or the prevailing volatility used\nin the pricing model. We demonstrate how this bound can be used as a quick {\\it\nbenchmark} to assess, regardless the market volatility, the duration of the\ncontract or the price of the underlying security, the market (relative) value\nof the $\\delta-$strangle in comparison to its BS (relative) price. In fact, the\nexplicit and simple expression for this measure and bound allows us to also\nstudy in detail the strangle's exit strategy and the corresponding {\\it\noptimal} choice for a value of delta.\n", "versions": [{"version": "v1", "created": "Mon, 9 Mar 2020 00:36:57 GMT"}, {"version": "v2", "created": "Mon, 18 May 2020 09:57:00 GMT"}], "update_date": "2020-05-19", "authors_parsed": [["Boukai", "Ben", ""]]}, {"id": "2003.04005", "submitter": "Claudiu Albulescu", "authors": "Claudiu Albulescu (CRIEF)", "title": "Coronavirus and financial volatility: 40 days of fasting and fear", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  40 days after the start of the international monitoring of COVID-19, we\nsearch for the effect of official announcements regarding new cases of\ninfection and death ratio on the financial markets volatility index (VIX).\nWhereas the new cases reported in China and outside China have a mixed effect\non financial volatility, the death ratio positively influences VIX, that\noutside China triggering a more important impact. In addition, the higher the\nnumber of affected countries, the higher the financial volatility is.\n", "versions": [{"version": "v1", "created": "Mon, 9 Mar 2020 09:50:52 GMT"}], "update_date": "2020-03-10", "authors_parsed": [["Albulescu", "Claudiu", "", "CRIEF"]]}, {"id": "2003.04007", "submitter": "Claudiu Albulescu", "authors": "Claudiu Albulescu (CRIEF), Aviral Tiwari, Qiang Ji", "title": "Copula-based local dependence between energy, agriculture and metal\n  commodity markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the extreme dependencies between energy, agriculture and\nmetal commodity markets, with a focus on local co-movements, allowing the\nidentification of asymmetries and changing trend in the degree of co-movements.\nMore precisely, starting from a non-parametric mixture copula, we use a novel\ncopula-based local Kendall's tau approach to measure nonlinear local dependence\nin regions. In all pairs of commodity indexes, we find increased co-movements\nin extreme situations, a stronger dependence between energy and other commodity\nmarkets at lower tails, and a 'V-type' local dependence for the energy-metal\npairs. The three-dimensional Kendall's tau plot for upper tails in quantiles\nshows asymmetric co-movements in the energy-metal pairs, which tend to become\nnegative at peak returns. Therefore, we show that the energy market can offer\ndiversification solutions for risk management in the case of extreme bull\nmarket events.\n", "versions": [{"version": "v1", "created": "Mon, 9 Mar 2020 09:53:17 GMT"}], "update_date": "2020-03-10", "authors_parsed": [["Albulescu", "Claudiu", "", "CRIEF"], ["Tiwari", "Aviral", ""], ["Ji", "Qiang", ""]]}, {"id": "2003.05095", "submitter": "Zurab Kakushadze", "authors": "Zura Kakushadze and Willie Yu", "title": "Machine Learning Treasury Yields", "comments": "68 pages", "journal-ref": "Bulletin of Applied Economics 7(1) (2020) 1-65", "doi": null, "report-no": null, "categories": "stat.ME q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give explicit algorithms and source code for extracting factors underlying\nTreasury yields using (unsupervised) machine learning (ML) techniques, such as\nnonnegative matrix factorization (NMF) and (statistically deterministic)\nclustering. NMF is a popular ML algorithm (used in computer vision,\nbioinformatics/computational biology, document classification, etc.), but is\noften misconstrued and misused. We discuss how to properly apply NMF to\nTreasury yields. We analyze the factors based on NMF and clustering and their\ninterpretation. We discuss their implications for forecasting Treasury yields\nin the context of out-of-sample ML stability issues.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2020 03:15:18 GMT"}], "update_date": "2020-03-13", "authors_parsed": [["Kakushadze", "Zura", ""], ["Yu", "Willie", ""]]}, {"id": "2003.05358", "submitter": "Grzegorz Krzy\\.zanowski", "authors": "Grzegorz Krzy\\.zanowski, Marcin Magdziarz", "title": "A computational weighted finite difference method for American and\n  barrier options in subdiffusive Black-Scholes model", "comments": null, "journal-ref": "Communications in Nonlinear Science and Numerical Simulation 96\n  (2021): 105676", "doi": "10.1016/j.cnsns.2020.105676", "report-no": null, "categories": "q-fin.CP cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Subdiffusion is a well established phenomenon in physics. In this paper we\napply the subdiffusive dynamics to analyze financial markets. We focus on the\nfinancial aspect of time fractional diffusion model with moving boundary i.e.\nAmerican and barrier option pricing in the subdiffusive Black-Scholes (B-S)\nmodel. Two computational methods for valuing American options in the considered\nmodel are proposed - the weighted finite difference (FD) and the\nLongstaff-Schwartz method. In the article it is also shown how to valuate\nnumerically wide range of barrier options using the FD approach.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2020 15:27:05 GMT"}, {"version": "v2", "created": "Thu, 28 May 2020 12:46:28 GMT"}, {"version": "v3", "created": "Sat, 7 Nov 2020 19:31:15 GMT"}, {"version": "v4", "created": "Tue, 29 Dec 2020 08:51:22 GMT"}], "update_date": "2021-04-19", "authors_parsed": [["Krzyżanowski", "Grzegorz", ""], ["Magdziarz", "Marcin", ""]]}, {"id": "2003.05708", "submitter": "Chiheb Ben Hammouda", "authors": "Christian Bayer, Chiheb Ben Hammouda, Raul Tempone", "title": "Numerical smoothing and hierarchical approximations for efficient option\n  pricing and density estimation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When approximating the expectation of a functional of a certain stochastic\nprocess, the efficiency and performance of deterministic quadrature methods,\nand hierarchical variance reduction methods such as multilevel Monte Carlo\n(MLMC), is highly deteriorated in different ways by the low regularity of the\nintegrand with respect to the input parameters. To overcome this issue, a\nsmoothing procedure is needed to uncover the available regularity and improve\nthe performance of the aforementioned methods. In this work, we consider cases\nwhere we cannot perform an analytic smoothing. Thus, we introduce a novel\nnumerical smoothing technique based on root-finding combined with a one\ndimensional integration with respect to a single well-chosen variable. We prove\nthat under appropriate conditions, the resulting function of the remaining\nvariables is highly smooth, potentially allowing a higher efficiency of\nadaptive sparse grids quadrature (ASGQ), in particular when combined with\nhierarchical representations to treat the high dimensionality effectively. Our\nstudy is motivated by option pricing problems and our main focus is on dynamics\nwhere a discretization of the asset price is needed. Our analysis and numerical\nexperiments illustrate the advantage of combining numerical smoothing with ASGQ\ncompared to the Monte Carlo method. Furthermore, we demonstrate how numerical\nsmoothing significantly reduces the kurtosis at the deep levels of MLMC, and\nalso improves the strong convergence rate. Given a pre-selected tolerance,\n$\\text{TOL}$, this results in an improvement of the complexity from\n$\\mathcal{O}\\left(\\text{TOL}^{-2.5}\\right)$ in the standard case to\n$\\mathcal{O}\\left(\\text{TOL}^{-2} \\log(\\text{TOL})^2\\right)$. Finally, we show\nhow our numerical smoothing enables MLMC to estimate density functions, which\nstandard MLMC (without smoothing) fails to achieve.\n", "versions": [{"version": "v1", "created": "Thu, 12 Mar 2020 11:09:25 GMT"}], "update_date": "2020-03-13", "authors_parsed": [["Bayer", "Christian", ""], ["Hammouda", "Chiheb Ben", ""], ["Tempone", "Raul", ""]]}, {"id": "2003.06184", "submitter": "Claudiu Albulescu", "authors": "Claudiu Albulescu (CRIEF)", "title": "Coronavirus and oil price crash", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coronavirus (COVID-19) creates fear and uncertainty, hitting the global\neconomy and amplifying the financial markets volatility. The oil price reaction\nto COVID-19 was gradually accommodated until March 09, 2020, when, 49 days\nafter the release of the first coronavirus monitoring report by the World\nHealth Organization (WHO), Saudi Arabia floods the market with oil. As a\nresult, international prices drop with more than 20% in one single day. Against\nthis background, the purpose of this paper is to investigate the impact of\nCOVID-19 numbers on crude oil prices, while controlling for the impact of\nfinancial volatility and the United States (US) economic policy uncertainty.\nOur ARDL estimation shows that the COVID-19 daily reported cases of new\ninfections have a marginal negative impact on the crude oil prices in the long\nrun. Nevertheless, by amplifying the financial markets volatility, COVID-19\nalso has an indirect effect on the recent dynamics of crude oil prices.\n", "versions": [{"version": "v1", "created": "Fri, 13 Mar 2020 10:15:04 GMT"}, {"version": "v2", "created": "Fri, 20 Mar 2020 10:56:20 GMT"}], "update_date": "2020-03-23", "authors_parsed": [["Albulescu", "Claudiu", "", "CRIEF"]]}, {"id": "2003.06218", "submitter": "Xin Zang", "authors": "Fan Jiang, Xin Zang, Jingping Yang", "title": "Asymptotic expansion for the transition densities of stochastic\n  differential equations driven by the gamma processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, enlightened by the asymptotic expansion methodology developed\nby Li(2013b) and Li and Chen (2016), we propose a Taylor-type approximation for\nthe transition densities of the stochastic differential equations (SDEs) driven\nby the gamma processes, a special type of Levy processes. After representing\nthe transition density as a conditional expectation of Dirac delta function\nacting on the solution of the related SDE, the key technical method for\ncalculating the expectation of multiple stochastic integrals conditional on the\ngamma process is presented. To numerically test the efficiency of our method,\nwe examine the pure jump Ornstein--Uhlenbeck (OU) model and its extensions to\ntwo jump-diffusion models. For each model, the maximum relative error between\nour approximated transition density and the benchmark density obtained by the\ninverse Fourier transform of the characteristic function is sufficiently small,\nwhich shows the efficiency of our approximated method.\n", "versions": [{"version": "v1", "created": "Fri, 13 Mar 2020 12:16:11 GMT"}], "update_date": "2020-03-16", "authors_parsed": [["Jiang", "Fan", ""], ["Zang", "Xin", ""], ["Yang", "Jingping", ""]]}, {"id": "2003.07058", "submitter": "Hirdesh Pharasi", "authors": "Hirdesh K. Pharasi, Eduard Seligman, and Thomas H. Seligman", "title": "Market states: A new understanding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the clustering analysis of the financial markets of S&P 500 (USA)\nand Nikkei 225 (JPN) markets over a period of 2006-2019 as an example of a\ncomplex system. We investigate the statistical properties of correlation\nmatrices constructed from the sliding epochs. The correlation matrices can be\nclassified into different clusters, named as market states based on the\nsimilarity of correlation structures. We cluster the S&P 500 market into four\nand Nikkei 225 into six market states by optimizing the value of intracluster\ndistances. The market shows transitions between these market states and the\nstatistical properties of the transitions to critical market states can\nindicate likely precursors to the catastrophic events. We also analyze the same\nclustering technique on surrogate data constructed from average correlations of\nmarket states and the fluctuations arise due to the white noise of short time\nseries. We use the correlated Wishart orthogonal ensemble for the construction\nof surrogate data whose average correlation equals the average of the real\ndata.\n", "versions": [{"version": "v1", "created": "Mon, 16 Mar 2020 07:37:45 GMT"}, {"version": "v2", "created": "Tue, 10 Nov 2020 18:53:33 GMT"}], "update_date": "2020-11-12", "authors_parsed": [["Pharasi", "Hirdesh K.", ""], ["Seligman", "Eduard", ""], ["Seligman", "Thomas H.", ""]]}, {"id": "2003.07591", "submitter": "Claudiu Albulescu", "authors": "Claudiu Albulescu (CRIEF)", "title": "Do COVID-19 and crude oil prices drive the US economic policy\n  uncertainty?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the effect of the novel coronavirus and crude oil\nprices on the United States (US) economic policy uncertainty (EPU). Using daily\ndata for the period January 21-March 13, 2020, our Autoregressive Distributed\nLag (ARDL) model shows that the new infection cases reported at global level,\nand the death ratio, have no significant effect on the US EPU, whereas the oil\nprice negative dynamics leads to increased uncertainty. However, analyzing the\nsituation outside China, we discover that both new case announcements and the\nCOVID-19 associated death ratio have a positive influence on the US EPU.\n", "versions": [{"version": "v1", "created": "Tue, 17 Mar 2020 09:14:09 GMT"}], "update_date": "2020-03-18", "authors_parsed": [["Albulescu", "Claudiu", "", "CRIEF"]]}, {"id": "2003.07992", "submitter": "Andrew Lesniewski", "authors": "Andrew Lesniewski and Nicholas Lesniewski", "title": "Options on infectious diseases", "comments": "Typo fixed", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a parsimonious stochastic model for valuation of options on the\nfraction of infected individuals during an epidemic. The underlying stochastic\ndynamical system is a stochastic differential version of the SIR model of\nmathematical epidemiology.\n", "versions": [{"version": "v1", "created": "Wed, 18 Mar 2020 00:09:34 GMT"}, {"version": "v2", "created": "Fri, 20 Mar 2020 18:27:28 GMT"}, {"version": "v3", "created": "Tue, 24 Mar 2020 19:58:31 GMT"}], "update_date": "2020-03-26", "authors_parsed": [["Lesniewski", "Andrew", ""], ["Lesniewski", "Nicholas", ""]]}, {"id": "2003.08810", "submitter": "Piergiacomo Sabino Dr", "authors": "Nicola Cufaro Petroni and Piergiacomo Sabino", "title": "Gamma Related Ornstein-Uhlenbeck Processes and their Simulation", "comments": "27 pages, 2 figures, 4 tables. arXiv admin note: substantial text\n  overlap with arXiv:1908.03137", "journal-ref": "Journal of Statistical Computation and Simulation, 2020", "doi": "10.1080/00949655.2020.1842408", "report-no": null, "categories": "math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the distributional properties of two generalized\nOrnstein-Uhlenbeck (OU) processes whose stationary distributions are the gamma\nlaw and the bilateral gamma law, respectively. The said distributions turn out\nto be related to the self-decomposable gamma and bilateral gamma laws, and\ntheir densities and characteristic functions are here given in closed-form.\nAlgorithms for the exact generation of such processes are accordingly derived\nwith the advantage of being significantly faster than those available in the\nliterature and therefore suitable for real-time simulations.\n", "versions": [{"version": "v1", "created": "Sun, 15 Mar 2020 13:40:16 GMT"}], "update_date": "2021-03-25", "authors_parsed": [["Petroni", "Nicola Cufaro", ""], ["Sabino", "Piergiacomo", ""]]}, {"id": "2003.08853", "submitter": "Andrey Itkin", "authors": "Peter Carr and Andrey Itkin", "title": "Semi-closed form solutions for barrier and American options written on a\n  time-dependent Ornstein Uhlenbeck process", "comments": "16 pages, 5 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we develop a semi-closed form solutions for the barrier\n(perhaps, time-dependent) and American options written on the underlying stock\nwhich follows a time-dependent OU process with a log-normal drift. This model\nis equivalent to the familiar Hull-White model in FI, or a time dependent OU\nmodel in FX. Semi-closed form means that given the time-dependent interest\nrate, continuous dividend and volatility functions, one need to solve\nnumerically a linear (for the barrier option) or nonlinear (for the American\noption) Fredholm equation of the first kind. After that the option prices in\nall cases are presented as one-dimensional integrals of combination of the\nabove solutions and Jacobi theta functions. We also demonstrate that\ncomputationally our method is more efficient than the backward finite\ndifference method used for solving these problems, and can also be as efficient\nas the forward finite difference solver while providing better accuracy and\nstability.\n", "versions": [{"version": "v1", "created": "Thu, 19 Mar 2020 15:04:26 GMT"}, {"version": "v2", "created": "Sat, 28 Mar 2020 18:36:33 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Carr", "Peter", ""], ["Itkin", "Andrey", ""]]}, {"id": "2003.09298", "submitter": "Andreas Aigner", "authors": "Andreas A. Aigner, Walter Schrabmair", "title": "Power Assisted Trend Following", "comments": "13 pages, 16 figures", "journal-ref": null, "doi": "10.13140/RG.2.2.20898.17605", "report-no": null, "categories": "q-fin.TR eess.SP q-fin.CP q-fin.MF", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  'The trend is your friend' is a common saying, the difficulty lies in\ndetermining if and when you are in a trend. Is the trend strong enough to\ntrade? When does the trend reverse and how are you going to determine this? We\nwill try and answer at least some of these questions here. We are deriving a\nnovel indicator to measure the power of a trend using digital signal processing\ntechniques, separating the Signal from the Noise. We apply these to examples as\nwell as real data and evaluate the accuracy of these and the relation to PNL\nperformance of the 'Volatility Index' trend following algorithm devised by J.\nWelles Wilder Jr. in 1978.\n", "versions": [{"version": "v1", "created": "Fri, 20 Mar 2020 14:38:21 GMT"}], "update_date": "2020-03-23", "authors_parsed": [["Aigner", "Andreas A.", ""], ["Schrabmair", "Walter", ""]]}, {"id": "2003.10014", "submitter": "Arthur Charpentier", "authors": "Arthur Charpentier and Romuald Elie and Carl Remlinger", "title": "Reinforcement Learning in Economics and Finance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.LG q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reinforcement learning algorithms describe how an agent can learn an optimal\naction policy in a sequential decision process, through repeated experience. In\na given environment, the agent policy provides him some running and terminal\nrewards. As in online learning, the agent learns sequentially. As in\nmulti-armed bandit problems, when an agent picks an action, he can not infer\nex-post the rewards induced by other action choices. In reinforcement learning,\nhis actions have consequences: they influence not only rewards, but also future\nstates of the world. The goal of reinforcement learning is to find an optimal\npolicy -- a mapping from the states of the world to the set of actions, in\norder to maximize cumulative reward, which is a long term strategy. Exploring\nmight be sub-optimal on a short-term horizon but could lead to optimal\nlong-term ones. Many problems of optimal control, popular in economics for more\nthan forty years, can be expressed in the reinforcement learning framework, and\nrecent advances in computational science, provided in particular by deep\nlearning algorithms, can be used by economists in order to solve complex\nbehavioral problems. In this article, we propose a state-of-the-art of\nreinforcement learning techniques, and present applications in economics, game\ntheory, operation research and finance.\n", "versions": [{"version": "v1", "created": "Sun, 22 Mar 2020 22:31:35 GMT"}], "update_date": "2020-03-24", "authors_parsed": [["Charpentier", "Arthur", ""], ["Elie", "Romuald", ""], ["Remlinger", "Carl", ""]]}, {"id": "2003.11352", "submitter": "Fan Fang", "authors": "Fan Fang, Carmine Ventre, Michail Basios, Hoiliong Kong, Leslie\n  Kanthan, Lingbo Li, David Martinez-Regoband, Fan Wu", "title": "Cryptocurrency Trading: A Comprehensive Survey", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, the tendency of the number of financial institutions\nincluding cryptocurrencies in their portfolios has accelerated.\nCryptocurrencies are the first pure digital assets to be included by asset\nmanagers. Even though they share some commonalities with more traditional\nassets, they have a separate nature of its own and their behaviour as an asset\nis still under the process of being understood. It is therefore important to\nsummarise existing research papers and results on cryptocurrency trading,\nincluding available trading platforms, trading signals, trading strategy\nresearch and risk management. This paper provides a comprehensive survey of\ncryptocurrency trading research, by covering 126 research papers on various\naspects of cryptocurrency trading (eg., cryptocurrency trading systems, bubble\nand extreme condition, prediction of volatility and return, crypto-assets\nportfolio construction and crypto-assets, technical trading and others). This\npaper also analyses datasets, research trends and distribution among research\nobjects (contents/properties) and technologies, concluding with some promising\nopportunities that remain open in cryptocurrency trading.\n", "versions": [{"version": "v1", "created": "Wed, 25 Mar 2020 12:10:59 GMT"}, {"version": "v2", "created": "Fri, 24 Apr 2020 15:18:25 GMT"}, {"version": "v3", "created": "Thu, 7 Jan 2021 14:51:07 GMT"}], "update_date": "2021-01-08", "authors_parsed": [["Fang", "Fan", ""], ["Ventre", "Carmine", ""], ["Basios", "Michail", ""], ["Kong", "Hoiliong", ""], ["Kanthan", "Leslie", ""], ["Li", "Lingbo", ""], ["Martinez-Regoband", "David", ""], ["Wu", "Fan", ""]]}, {"id": "2003.12934", "submitter": "Hongshan Li", "authors": "Hongshan Li, Zhongyi Huang", "title": "An iterative splitting method for pricing European options under the\n  Heston model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose an iterative splitting method to solve the partial\ndifferential equations in option pricing problems. We focus on the Heston\nstochastic volatility model and the derived two-dimensional partial\ndifferential equation (PDE). We take the European option as an example and\nconduct numerical experiments using different boundary conditions. The\niterative splitting method transforms the two-dimensional equation into two\nquasi one-dimensional equations with the variable on the other dimension fixed,\nwhich helps to lower the computational cost. Numerical results show that the\niterative splitting method together with an artificial boundary condition (ABC)\nbased on the method by Li and Huang (2019) gives the most accurate option price\nand Greeks compared to the classic finite difference method with the\ncommonly-used boundary conditions in Heston (1993).\n", "versions": [{"version": "v1", "created": "Sun, 29 Mar 2020 03:21:58 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Li", "Hongshan", ""], ["Huang", "Zhongyi", ""]]}, {"id": "2003.13062", "submitter": "Vladim\\'ir Hol\\'y", "authors": "Vladim\\'ir Hol\\'y and Petra Tomanov\\'a", "title": "Streaming Approach to Quadratic Covariation Estimation Using Financial\n  Ultra-High-Frequency Data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the computational issues related to the memory size in the\nestimation of quadratic covariation, taking into account the specifics of\nfinancial ultra-high-frequency data. In multivariate price processes, we\nconsider both contamination by the market microstructure noise and the\nnon-synchronicity of the observations. We formulate a multi-scale, flat-top\nrealized kernel, non-flat-top realized kernel, pre-averaging and modulated\nrealized covariance estimators in quadratic form and fix their bandwidth\nparameter at a constant value. This allows us to operate with limited memory\nand formulate this estimation as a streaming algorithm. We compare the\nperformance of the estimators with fixed bandwidth parameter in a simulation\nstudy. We find that the estimators ensuring positive semidefiniteness require\nmuch higher bandwidth than the estimators without this constraint.\n", "versions": [{"version": "v1", "created": "Sun, 29 Mar 2020 16:04:18 GMT"}, {"version": "v2", "created": "Mon, 22 Mar 2021 22:38:31 GMT"}], "update_date": "2021-03-24", "authors_parsed": [["Holý", "Vladimír", ""], ["Tomanová", "Petra", ""]]}]