[{"id": "2006.00123", "submitter": "Dhagash Mehta", "authors": "Dhagash Mehta, Dhruv Desai, Jithin Pradeep", "title": "Machine Learning Fund Categorizations", "comments": "8 pages, 2-column format, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.LG q-fin.CP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given the surge in popularity of mutual funds (including exchange-traded\nfunds (ETFs)) as a diversified financial investment, a vast variety of mutual\nfunds from various investment management firms and diversification strategies\nhave become available in the market. Identifying similar mutual funds among\nsuch a wide landscape of mutual funds has become more important than ever\nbecause of many applications ranging from sales and marketing to portfolio\nreplication, portfolio diversification and tax loss harvesting. The current\nbest method is data-vendor provided categorization which usually relies on\ncuration by human experts with the help of available data. In this work, we\nestablish that an industry wide well-regarded categorization system is\nlearnable using machine learning and largely reproducible, and in turn\nconstructing a truly data-driven categorization. We discuss the intellectual\nchallenges in learning this man-made system, our results and their\nimplications.\n", "versions": [{"version": "v1", "created": "Fri, 29 May 2020 23:26:14 GMT"}], "update_date": "2020-06-02", "authors_parsed": [["Mehta", "Dhagash", ""], ["Desai", "Dhruv", ""], ["Pradeep", "Jithin", ""]]}, {"id": "2006.00218", "submitter": "Imanol Perez Arribas", "authors": "Imanol Perez Arribas, Cristopher Salvi, Lukasz Szpruch", "title": "Sig-SDEs model for quantitative finance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical models, calibrated to data, have become ubiquitous to make key\ndecision processes in modern quantitative finance. In this work, we propose a\nnovel framework for data-driven model selection by integrating a classical\nquantitative setup with a generative modelling approach. Leveraging the\nproperties of the signature, a well-known path-transform from stochastic\nanalysis that recently emerged as leading machine learning technology for\nlearning time-series data, we develop the Sig-SDE model. Sig-SDE provides a new\nperspective on neural SDEs and can be calibrated to exotic financial products\nthat depend, in a non-linear way, on the whole trajectory of asset prices.\nFurthermore, we our approach enables to consistently calibrate under the\npricing measure $\\mathbb Q$ and real-world measure $\\mathbb P$. Finally, we\ndemonstrate the ability of Sig-SDE to simulate future possible market scenarios\nneeded for computing risk profiles or hedging strategies. Importantly, this new\nmodel is underpinned by rigorous mathematical analysis, that under appropriate\nconditions provides theoretical guarantees for convergence of the presented\nalgorithms.\n", "versions": [{"version": "v1", "created": "Sat, 30 May 2020 08:14:49 GMT"}, {"version": "v2", "created": "Wed, 3 Jun 2020 12:50:45 GMT"}], "update_date": "2020-06-04", "authors_parsed": [["Arribas", "Imanol Perez", ""], ["Salvi", "Cristopher", ""], ["Szpruch", "Lukasz", ""]]}, {"id": "2006.04727", "submitter": "Florian Krach", "authors": "Calypso Herrera, Florian Krach, Josef Teichmann", "title": "Neural Jump Ordinary Differential Equations: Consistent Continuous-Time\n  Prediction and Filtering", "comments": null, "journal-ref": "International Conference on Learning Representations (2021)", "doi": null, "report-no": null, "categories": "stat.ML cs.LG math.PR q-fin.CP q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Combinations of neural ODEs with recurrent neural networks (RNN), like\nGRU-ODE-Bayes or ODE-RNN are well suited to model irregularly observed time\nseries. While those models outperform existing discrete-time approaches, no\ntheoretical guarantees for their predictive capabilities are available.\nAssuming that the irregularly-sampled time series data originates from a\ncontinuous stochastic process, the $L^2$-optimal online prediction is the\nconditional expectation given the currently available information. We introduce\nthe Neural Jump ODE (NJ-ODE) that provides a data-driven approach to learn,\ncontinuously in time, the conditional expectation of a stochastic process. Our\napproach models the conditional expectation between two observations with a\nneural ODE and jumps whenever a new observation is made. We define a novel\ntraining framework, which allows us to prove theoretical guarantees for the\nfirst time. In particular, we show that the output of our model converges to\nthe $L^2$-optimal prediction. This can be interpreted as solution to a special\nfiltering problem. We provide experiments showing that the theoretical results\nalso hold empirically. Moreover, we experimentally show that our model\noutperforms the baselines in more complex learning tasks and give comparisons\non real-world datasets.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jun 2020 16:34:51 GMT"}, {"version": "v2", "created": "Sat, 3 Oct 2020 06:46:28 GMT"}, {"version": "v3", "created": "Wed, 9 Dec 2020 13:36:20 GMT"}, {"version": "v4", "created": "Fri, 16 Apr 2021 12:54:38 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Herrera", "Calypso", ""], ["Krach", "Florian", ""], ["Teichmann", "Josef", ""]]}, {"id": "2006.07635", "submitter": "Bernhard Hientzsch", "authors": "Yajie Yu, Bernhard Hientzsch, Narayan Ganesan", "title": "Backward Deep BSDE Methods and Applications to Nonlinear Problems", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a backward deep BSDE method applied to Forward\nBackward Stochastic Differential Equations (FBSDE) with given terminal\ncondition at maturity that time-steps the BSDE backwards. We present an\napplication of this method to a nonlinear pricing problem - the differential\nrates problem. To time-step the BSDE backward, one needs to solve a nonlinear\nproblem. For the differential rates problem, we derive an exact solution of\nthis time-step problem and a Taylor-based approximation. Previously backward\ndeep BSDE methods only treated zero or linear generators. While a Taylor\napproach for nonlinear generators was previously mentioned, it had not been\nimplemented or applied, while we apply our method to nonlinear generators and\nderive details and present results. Likewise, previously backward deep BSDE\nmethods were presented for fixed initial risk factor values $X_0$ only, while\nwe present a version with random $X_0$ and a version that learns portfolio\nvalues at intermediate times as well. The method is able to solve nonlinear\nFBSDE problems in high dimensions.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jun 2020 13:01:48 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Yu", "Yajie", ""], ["Hientzsch", "Bernhard", ""], ["Ganesan", "Narayan", ""]]}, {"id": "2006.07669", "submitter": "Young Shin Kim", "authors": "Young Shin Kim, Kum-Hwan Roh, and Raphael Douady", "title": "Tempered Stable Processes with Time Varying Exponential Tails", "comments": "Kum-Hwan Roh gratefully acknowledges the support of Basic Science\n  Research Program through the National Research Foundation of Korea (NRF)\n  grant funded by the Korea government [Grant No. NRF-2017R1D1A3B03036548]", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce a new time series model having a stochastic\nexponential tail. This model is constructed based on the Normal Tempered Stable\ndistribution with a time-varying parameter. The model captures the stochastic\nexponential tail, which generates the volatility smile effect and volatility\nterm structure in option pricing. Moreover, the model describes the\ntime-varying volatility of volatility. We empirically show the stochastic\nskewness and stochastic kurtosis by applying the model to analyze S&P 500 index\nreturn data. We present the Monte-Carlo simulation technique for the parameter\ncalibration of the model for the S&P 500 option prices. We can see that the\nstochastic exponential tail makes the model better to analyze the market option\nprices by the calibration.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jun 2020 16:01:02 GMT"}, {"version": "v2", "created": "Tue, 25 Aug 2020 16:27:21 GMT"}], "update_date": "2020-08-26", "authors_parsed": [["Kim", "Young Shin", ""], ["Roh", "Kum-Hwan", ""], ["Douady", "Raphael", ""]]}, {"id": "2006.07771", "submitter": "Kevin Shuai Zhang", "authors": "Kevin S. Zhang and Traian A. Pirvu", "title": "Numerical Simulation of Exchange Option with Finite Liquidity:\n  Controlled Variate Model", "comments": "24 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we develop numerical pricing methodologies for European style\nExchange Options written on a pair of correlated assets, in a market with\nfinite liquidity. In contrast to the standard multi-asset Black-Scholes\nframework, trading in our market model has a direct impact on the asset's\nprice. The price impact is incorporated into the dynamics of the first asset\nthrough a specific trading strategy, as in large trader liquidity model.\nTwo-dimensional Milstein scheme is implemented to simulate the pair of assets\nprices. The option value is numerically estimated by Monte Carlo with the\nMargrabe option as controlled variate. Time complexity of these numerical\nschemes are included. Finally, we provide a deep learning framework to\nimplement this model effectively in a production environment.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jun 2020 02:19:18 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Zhang", "Kevin S.", ""], ["Pirvu", "Traian A.", ""]]}, {"id": "2006.09455", "submitter": "Matteo Gambara", "authors": "Matteo Gambara and Josef Teichmann", "title": "Consistent Recalibration Models and Deep Calibration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consistent Recalibration models (CRC) have been introduced to capture in\nnecessary generality the dynamic features of term structures of derivatives'\nprices. Several approaches have been suggested to tackle this problem, but all\nof them, including CRC models, suffered from numerical intractabilities mainly\ndue to the presence of complicated drift terms or consistency conditions. We\novercome this problem by machine learning techniques, which allow to store the\ncrucial drift term's information in neural network type functions. This yields\nfirst time dynamic term structure models which can be efficiently simulated.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jun 2020 18:55:00 GMT"}, {"version": "v2", "created": "Wed, 23 Jun 2021 20:38:36 GMT"}, {"version": "v3", "created": "Thu, 1 Jul 2021 15:03:46 GMT"}], "update_date": "2021-07-02", "authors_parsed": [["Gambara", "Matteo", ""], ["Teichmann", "Josef", ""]]}, {"id": "2006.09611", "submitter": "Laura Simonsen Leal", "authors": "Laura Leal, Mathieu Lauri\\`ere, Charles-Albert Lehalle", "title": "Learning a functional control for high-frequency finance", "comments": "24 pages, 21 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CE cs.LG q-fin.CP q-fin.TR", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  We use a deep neural network to generate controllers for optimal trading on\nhigh frequency data. For the first time, a neural network learns the mapping\nbetween the preferences of the trader, i.e. risk aversion parameters, and the\noptimal controls. An important challenge in learning this mapping is that in\nintraday trading, trader's actions influence price dynamics in closed loop via\nthe market impact. The exploration--exploitation tradeoff generated by the\nefficient execution is addressed by tuning the trader's preferences to ensure\nlong enough trajectories are produced during the learning phase. The issue of\nscarcity of financial data is solved by transfer learning: the neural network\nis first trained on trajectories generated thanks to a Monte-Carlo scheme,\nleading to a good initialization before training on historical trajectories.\nMoreover, to answer to genuine requests of financial regulators on the\nexplainability of machine learning generated controls, we project the obtained\n\"blackbox controls\" on the space usually spanned by the closed-form solution of\nthe stylized optimal trading problem, leading to a transparent structure. For\nmore realistic loss functions that have no closed-form solution, we show that\nthe average distance between the generated controls and their explainable\nversion remains small. This opens the door to the acceptance of ML-generated\ncontrols by financial regulators.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2020 02:39:22 GMT"}, {"version": "v2", "created": "Fri, 12 Feb 2021 02:14:23 GMT"}], "update_date": "2021-02-15", "authors_parsed": [["Leal", "Laura", ""], ["Laurière", "Mathieu", ""], ["Lehalle", "Charles-Albert", ""]]}, {"id": "2006.09955", "submitter": "Giacomo Bormetti", "authors": "Pietro Rossi, Flavio Cocco, and Giacomo Bormetti", "title": "Deep learning Profit & Loss", "comments": "19 pages, 3 figures, and 9 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Building the future profit and loss (P&L) distribution of a portfolio\nholding, among other assets, highly non-linear and path-dependent derivatives\nis a challenging task. We provide a simple machinery where more and more assets\ncould be accounted for in a simple and semi-automatic fashion. We resort to a\nvariation of the Least Square Monte Carlo algorithm where interpolation of the\ncontinuation value of the portfolio is done with a feed forward neural network.\nThis approach has several appealing features not all of them will be fully\ndiscussed in the paper. Neural networks are extremely flexible regressors. We\ndo not need to worry about the fact that for multi assets payoff, the exercise\nsurface could be non connected. Neither we have to search for smart regressors.\nThe idea is to use, regardless of the complexity of the payoff, only the\nunderlying processes. Neural networks with many outputs can interpolate every\nsingle assets in the portfolio generated by a single Monte Carlo simulation.\nThis is an essential feature to account for the P&L distribution of the whole\nportfolio when the dependence structure between the different assets is very\nstrong like the case where one has contingent claims written on the same\nunderlying.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2020 16:07:03 GMT"}, {"version": "v2", "created": "Thu, 27 Aug 2020 08:56:02 GMT"}], "update_date": "2020-08-28", "authors_parsed": [["Rossi", "Pietro", ""], ["Cocco", "Flavio", ""], ["Bormetti", "Giacomo", ""]]}, {"id": "2006.11146", "submitter": "Richard Martin", "authors": "Richard J. Martin", "title": "Credit migration: Generating generators", "comments": "Minor corrections from V1", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.CP q-fin.MF q-fin.PR", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Markovian credit migration models are a reasonably standard tool nowadays,\nbut there are fundamental difficulties with calibrating them. We show how these\nare resolved using a simplified form of matrix generator and explain why\nrisk-neutral calibration cannot be done without volatility information. We also\nshow how to use elementary ideas from differential geometry to make general\ninferences about calibration stability. This the longer version of an article\npublished by RISK (Feb 2021).\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2020 14:12:13 GMT"}, {"version": "v2", "created": "Thu, 4 Feb 2021 14:34:01 GMT"}], "update_date": "2021-02-05", "authors_parsed": [["Martin", "Richard J.", ""]]}, {"id": "2006.11222", "submitter": "Sanjay Mansabdar", "authors": "Sanjay Mansabdar and Hussain C Yaganti", "title": "Valuing the quality option in agricultural commodity futures: a Monte\n  Carlo simulation based approach", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Agricultural commodity futures are often settled by delivery. Quality options\nthat allow the futures short to deliver one of several underlying assets are\ncommonly used in such contracts to prevent manipulation. Inclusion of these\noptions reduces the price of the futures contract and leads to degraded\ncontract hedging performance. Valuation of these options is a first step in\nassessing the impact of the quality options embedded into a futures contract.\nThis paper demonstrates a Monte Carlo simulation based approach to estimate the\nvalue of a quality option. In order to improve simulation efficiency, the\ntechnique of antithetic variables is used. This approach can help in the\nassessment of the impact of embedded quality options.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2020 16:51:49 GMT"}], "update_date": "2020-06-22", "authors_parsed": [["Mansabdar", "Sanjay", ""], ["Yaganti", "Hussain C", ""]]}, {"id": "2006.11426", "submitter": "Bastien Baldacci", "authors": "Bastien Baldacci, Jerome Benveniste", "title": "A note on Almgren-Chriss optimal execution problem with geometric\n  Brownian motion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We solve explicitly the Almgren-Chriss optimal liquidation problem where the\nstock price process follows a geometric Brownian motion. Our technique is to\nwork in terms of cash and to use functional analysis tools. We show that this\nframework extends readily to the case of a stochastic drift for the price\nprocess and the liquidation of a portfolio.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2020 22:26:08 GMT"}, {"version": "v2", "created": "Tue, 23 Jun 2020 20:18:56 GMT"}], "update_date": "2020-06-25", "authors_parsed": [["Baldacci", "Bastien", ""], ["Benveniste", "Jerome", ""]]}, {"id": "2006.11976", "submitter": "Andrey Itkin", "authors": "A. Itkin, A. Lipton, D. Muravey", "title": "From the Black-Karasinski to the Verhulst model to accommodate the\n  unconventional Fed's policy", "comments": "21 pages, 3 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we argue that some of the most popular short-term interest\nmodels have to be revisited and modified to reflect current market conditions\nbetter. In particular, we propose a modification of the popular\nBlack-Karasinski model, which is widely used by practitioners for modeling\ninterest rates, credit, and commodities. Our adjustment gives rise to the\nstochastic Verhulst model, which is well-known in the population dynamics and\nepidemiology as a logistic model. We demonstrate that the Verhulst model's\ndynamics are well suited to the current economic environment and the Fed's\nactions. Besides, we derive new integral equations for the zero-coupon bond\nprices for both the BK and Verhulst models. For the BK model for small\nmaturities up to 2 years, we solve the corresponding integral equation by using\nthe reduced differential transform method. For the Verhulst integral equation,\nunder some mild assumptions, we find the closed-form solution. Numerical\nexamples show that computationally our approach is significantly more efficient\nthan the standard finite difference method.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2020 02:49:26 GMT"}, {"version": "v2", "created": "Mon, 18 Jan 2021 22:15:32 GMT"}], "update_date": "2021-01-20", "authors_parsed": [["Itkin", "A.", ""], ["Lipton", "A.", ""], ["Muravey", "D.", ""]]}, {"id": "2006.13521", "submitter": "Sophian Mehalla", "authors": "Herv\\'e Andres, Pierre-Edouard Arrouy, Paul Bonnefoy, Alexandre\n  Boumezoued, Sophian Mehalla", "title": "Fast calibration of the LIBOR Market Model with Stochastic Volatility\n  based on analytical gradient", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose to take advantage of the common knowledge of the characteristic\nfunction of the swap rate process as modelled in the LIBOR Market Model with\nStochastic Volatility and Displaced Diffusion (DDSVLMM) to derive analytical\nexpressions of the gradient of swaptions prices with respect to the model\nparameters. We use this result to derive an efficient calibration method for\nthe DDSVLMM using gradient-based optimization algorithms. Our study relies on\nand extends the work by (Cui et al., 2017) that developed the analytical\ngradient for fast calibration of the Heston model, based on an alternative\nformulation of the Heston moment generating function proposed by (del Ba{\\~n}o\net al., 2010). Our main conclusion is that the analytical gradient-based\ncalibration is highly competitive for the DDSVLMM, as it significantly limits\nthe number of steps in the optimization algorithm while improving its accuracy.\nThe efficiency of this novel approach is compared to classical standard\noptimization procedures.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2020 07:19:23 GMT"}], "update_date": "2020-06-25", "authors_parsed": [["Andres", "Hervé", ""], ["Arrouy", "Pierre-Edouard", ""], ["Bonnefoy", "Paul", ""], ["Boumezoued", "Alexandre", ""], ["Mehalla", "Sophian", ""]]}, {"id": "2006.13539", "submitter": "Eduardo Abi Jaber", "authors": "Eduardo Abi Jaber (CES), Enzo Miller (LPSM (UMR\\_8001)), Huy\\^en Pham\n  (LPSM (UMR\\_8001))", "title": "Markowitz portfolio selection for multivariate affine and quadratic\n  Volterra models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper concerns portfolio selection with multiple assets under rough\ncovariance matrix. We investigate the continuous-time Markowitz mean-variance\nproblem for a multivariate class of affine and quadratic Volterra models. In\nthis incomplete non-Markovian and non-semimartingale market framework with\nunbounded random coefficients, the optimal portfolio strategy is expressed by\nmeans of a Riccati backward stochastic differential equation (BSDE). In the\ncase of affine Volterra models, we derive explicit solutions to this BSDE in\nterms of multi-dimensional Riccati-Volterra equations. This framework includes\nmultivariate rough Heston models and extends the results of \\cite{han2019mean}.\nIn the quadratic case, we obtain new analytic formulae for the the Riccati BSDE\nand we establish their link with infinite dimensional Riccati equations. This\ncovers rough Stein-Stein and Wishart type covariance models. Numerical results\non a two dimensional rough Stein-Stein model illustrate the impact of rough\nvolatilities and stochastic correlations on the optimal Markowitz strategy. In\nparticular for positively correlated assets, we find that the optimal strategy\nin our model is a `buy rough sell smooth' one.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2020 07:55:22 GMT"}, {"version": "v2", "created": "Mon, 26 Oct 2020 09:15:06 GMT"}, {"version": "v3", "created": "Fri, 30 Oct 2020 10:59:22 GMT"}, {"version": "v4", "created": "Fri, 22 Jan 2021 09:05:32 GMT"}], "update_date": "2021-01-25", "authors_parsed": [["Jaber", "Eduardo Abi", "", "CES"], ["Miller", "Enzo", "", "LPSM"], ["Pham", "Huyên", "", "LPSM"]]}, {"id": "2006.13889", "submitter": "Paul Friedrich", "authors": "Paul Friedrich and Josef Teichmann", "title": "Deep Investing in Kyle's Single Period Model", "comments": "12 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Kyle model describes how an equilibrium of order sizes and security\nprices naturally arises between a trader with insider information and the price\nproviding market maker as they interact through a series of auctions. Ever\nsince being introduced by Albert S. Kyle in 1985, the model has become\nimportant in the study of market microstructure models with asymmetric\ninformation. As it is well understood, it serves as an excellent opportunity to\nstudy how modern deep learning technology can be used to replicate and better\nunderstand equilibria that occur in certain market learning problems.\n  We model the agents in Kyle's single period setting using deep neural\nnetworks. The networks are trained by interacting following the rules and\nobjectives as defined by Kyle. We show how the right network architectures and\ntraining methods lead to the agents' behaviour converging to the theoretical\nequilibrium that is predicted by Kyle's model.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2020 17:16:02 GMT"}], "update_date": "2020-06-25", "authors_parsed": [["Friedrich", "Paul", ""], ["Teichmann", "Josef", ""]]}, {"id": "2006.14288", "submitter": "Ariel Neufeld", "authors": "Ariel Neufeld, Antonis Papapantoleon, Qikun Xiang", "title": "Model-free bounds for multi-asset options using option-implied\n  information and their exact computation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC math.PR q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider derivatives written on multiple underlyings in a one-period\nfinancial market, and we are interested in the computation of model-free upper\nand lower bounds for their arbitrage-free prices. We work in a completely\nrealistic setting, in that we only assume the knowledge of traded prices for\nother single- and multi-asset derivatives, and even allow for the presence of\nbid-ask spread in these prices. We provide a fundamental theorem of asset\npricing for this market model, as well as a superhedging duality result, that\nallows to transform the abstract maximization problem over probability measures\ninto a more tractable minimization problem over vectors, subject to certain\nconstraints. Then, we recast this problem into a linear semi-infinite\noptimization problem, and provide two algorithms for its solution. These\nalgorithms provide upper and lower bounds for the prices that are\n$\\varepsilon$-optimal, as well as a characterization of the optimal pricing\nmeasures. These algorithms are efficient and allow the computation of bounds in\nhigh-dimensional scenarios (e.g. when $d=60$). Moreover, these algorithms can\nbe used to detect arbitrage opportunities and identify the corresponding\narbitrage strategies. Numerical experiments using both synthetic and real\nmarket data showcase the efficiency of these algorithms, while they also allow\nto understand the reduction of model risk by including additional information,\nin the form of known derivative prices.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jun 2020 10:14:12 GMT"}, {"version": "v2", "created": "Tue, 15 Jun 2021 11:42:40 GMT"}], "update_date": "2021-06-16", "authors_parsed": [["Neufeld", "Ariel", ""], ["Papapantoleon", "Antonis", ""], ["Xiang", "Qikun", ""]]}, {"id": "2006.14402", "submitter": "Sang Il Lee", "authors": "Sang Il Lee", "title": "Deeply Equal-Weighted Subset Portfolios", "comments": "arXiv admin note: text overlap with arXiv:2001.10278", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.LG q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The high sensitivity of optimized portfolios to estimation errors has\nprevented their practical application. To mitigate this sensitivity, we propose\na new portfolio model called a Deeply Equal-Weighted Subset Portfolio (DEWSP).\nDEWSP is a subset of top-N ranked assets in an asset universe, the members of\nwhich are selected based on the predicted returns from deep learning algorithms\nand are equally weighted. Herein, we evaluate the performance of DEWSPs of\ndifferent sizes N in comparison with the performance of other types of\nportfolios such as optimized portfolios and historically equal-weighed subset\nportfolios (HEWSPs), which are subsets of top-N ranked assets based on the\nhistorical mean returns. We found the following advantages of DEWSPs: First,\nDEWSPs provides an improvement rate of 0.24% to 5.15% in terms of monthly\nSharpe ratio compared to the benchmark, HEWSPs. In addition, DEWSPs are built\nusing a purely data-driven approach rather than relying on the efforts of\nexperts. DEWSPs can also target the relative risk and return to the baseline of\nthe EWP of an asset universe by adjusting the size N. Finally, the DEWSP\nallocation mechanism is transparent and intuitive. These advantages make DEWSP\ncompetitive in practice.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jun 2020 17:45:19 GMT"}], "update_date": "2020-06-26", "authors_parsed": [["Lee", "Sang Il", ""]]}, {"id": "2006.14498", "submitter": "Blanka Horvath", "authors": "Hans B\\\"uhler, Blanka Horvath, Terry Lyons, Imanol Perez Arribas, and\n  Ben Wood", "title": "A Data-driven Market Simulator for Small Data Environments", "comments": "27 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.LG q-fin.CP q-fin.MF stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neural network based data-driven market simulation unveils a new and flexible\nway of modelling financial time series without imposing assumptions on the\nunderlying stochastic dynamics. Though in this sense generative market\nsimulation is model-free, the concrete modelling choices are nevertheless\ndecisive for the features of the simulated paths. We give a brief overview of\ncurrently used generative modelling approaches and performance evaluation\nmetrics for financial time series, and address some of the challenges to\nachieve good results in the latter. We also contrast some classical approaches\nof market simulation with simulation based on generative modelling and\nhighlight some advantages and pitfalls of the new approach. While most\ngenerative models tend to rely on large amounts of training data, we present\nhere a generative model that works reliably in environments where the amount of\navailable training data is notoriously small. Furthermore, we show how a rough\npaths perspective combined with a parsimonious Variational Autoencoder\nframework provides a powerful way for encoding and evaluating financial time\nseries in such environments where available training data is scarce. Finally,\nwe also propose a suitable performance evaluation metric for financial time\nseries and discuss some connections of our Market Generator to deep hedging.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jun 2020 14:04:21 GMT"}], "update_date": "2020-06-26", "authors_parsed": [["Bühler", "Hans", ""], ["Horvath", "Blanka", ""], ["Lyons", "Terry", ""], ["Arribas", "Imanol Perez", ""], ["Wood", "Ben", ""]]}, {"id": "2006.15012", "submitter": "Weilong Fu", "authors": "Ali Hirsa and Weilong Fu", "title": "An unsupervised deep learning approach in solving partial\n  integro-differential equations", "comments": "22 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate solving partial integro-differential equations (PIDEs) using\nunsupervised deep learning in this paper. To price options, assuming underlying\nprocesses follow Levy processes, we require to solve PIDEs. In supervised deep\nlearning, pre-calculated labels are used to train neural networks to fit the\nsolution of the PIDE. In an unsupervised deep learning, neural networks are\nemployed as the solution, and the derivatives and the integrals in the PIDE are\ncalculated based on the neural network. By matching the PIDE and its boundary\nconditions, the neural network gives an accurate solution of the PIDE. Once\ntrained, it would be fast for calculating options values as well as option\nGreeks.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jun 2020 15:01:05 GMT"}, {"version": "v2", "created": "Wed, 9 Dec 2020 17:20:45 GMT"}, {"version": "v3", "created": "Thu, 10 Dec 2020 16:44:25 GMT"}], "update_date": "2020-12-11", "authors_parsed": [["Hirsa", "Ali", ""], ["Fu", "Weilong", ""]]}, {"id": "2006.15054", "submitter": "Michael Fu", "authors": "Michael C. Fu, Bingqing Li, Rongwen Wu, Tianqi Zhang", "title": "Option Pricing Under a Discrete-Time Markov Switching Stochastic\n  Volatility with Co-Jump Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider option pricing using a discrete-time Markov switching stochastic\nvolatility with co-jump model, which can model volatility clustering and\nvarying mean-reversion speeds of volatility. For pricing European options, we\ndevelop a computationally efficient method for obtaining the probability\ndistribution of average integrated variance (AIV), which is key to option\npricing under stochastic-volatility-type models. Building upon the efficiency\nof the European option pricing approach, we are able to price an American-style\noption, by converting its pricing into the pricing of a portfolio of European\noptions. Our work also provides constructive guidance for analyzing derivatives\nbased on variance, e.g., the variance swap. Numerical results indicate our\nmethods can be implemented very efficiently and accurately.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jun 2020 15:31:54 GMT"}], "update_date": "2020-06-29", "authors_parsed": [["Fu", "Michael C.", ""], ["Li", "Bingqing", ""], ["Wu", "Rongwen", ""], ["Zhang", "Tianqi", ""]]}, {"id": "2006.15312", "submitter": "Xiaoyang Zhuo", "authors": "Sanjay K. Nawalkha, Xiaoyang Zhuo", "title": "A Theory of Equivalent Expectation Measures for Contingent Claim Returns", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP q-fin.GN q-fin.MF", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper introduces a dynamic change of measure approach for computing the\nanalytical solutions of expected future prices (and therefore, expected\nreturns) of contingent claims over a finite horizon. The new approach\nconstructs hybrid probability measures called the \"equivalent expectation\nmeasures\"(EEMs), which provide the physical expectation of the claim's future\nprice until before the horizon date, and serve as pricing measures on or after\nthe horizon date. The EEM theory can be used for empirical investigations of\nboth the cross-section and the term structure of returns of contingent claims,\nsuch as Treasury bonds, corporate bonds, and financial derivatives.\n", "versions": [{"version": "v1", "created": "Sat, 27 Jun 2020 08:06:26 GMT"}, {"version": "v2", "created": "Tue, 30 Jun 2020 01:43:43 GMT"}, {"version": "v3", "created": "Mon, 6 Jul 2020 16:34:08 GMT"}, {"version": "v4", "created": "Thu, 16 Jul 2020 03:04:08 GMT"}, {"version": "v5", "created": "Wed, 16 Sep 2020 12:21:40 GMT"}, {"version": "v6", "created": "Thu, 29 Jul 2021 09:13:50 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Nawalkha", "Sanjay K.", ""], ["Zhuo", "Xiaoyang", ""]]}, {"id": "2006.15384", "submitter": "Peter  Forsyth", "authors": "Chendi Ni, Yuying Li, Peter Forsyth, Ray Carroll", "title": "Optimal Asset Allocation For Outperforming A Stochastic Benchmark Target", "comments": "33 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a data-driven Neural Network (NN) optimization framework to\ndetermine the optimal multi-period dynamic asset allocation strategy for\noutperforming a general stochastic target. We formulate the problem as an\noptimal stochastic control with an asymmetric, distribution shaping, objective\nfunction. The proposed framework is illustrated with the asset allocation\nproblem in the accumulation phase of a defined contribution pension plan, with\nthe goal of achieving a higher terminal wealth than a stochastic benchmark. We\ndemonstrate that the data-driven approach is capable of learning an adaptive\nasset allocation strategy directly from historical market returns, without\nassuming any parametric model of the financial market dynamics. Following the\noptimal adaptive strategy, investors can make allocation decisions simply\ndepending on the current state of the portfolio. The optimal adaptive strategy\noutperforms the benchmark constant proportion strategy, achieving a higher\nterminal wealth with a 90% probability, a 46% higher median terminal wealth,\nand a significantly more right-skewed terminal wealth distribution. We further\ndemonstrate the robustness of the optimal adaptive strategy by testing the\nperformance of the strategy on bootstrap resampled market data, which has\ndifferent distributions compared to the training data.\n", "versions": [{"version": "v1", "created": "Sat, 27 Jun 2020 15:22:40 GMT"}], "update_date": "2020-06-30", "authors_parsed": [["Ni", "Chendi", ""], ["Li", "Yuying", ""], ["Forsyth", "Peter", ""], ["Carroll", "Ray", ""]]}, {"id": "2006.15823", "submitter": "Ralph Rudd", "authors": "Ralph Rudd, Thomas A. McWalter, Joerg Kienitz and Eckhard Platen", "title": "Robust Product Markovian Quantization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recursive marginal quantization (RMQ) allows the construction of optimal\ndiscrete grids for approximating solutions to stochastic differential equations\nin d-dimensions. Product Markovian quantization (PMQ) reduces this problem to d\none-dimensional quantization problems by recursively constructing product\nquantizers, as opposed to a truly optimal quantizer. However, the standard\nNewton-Raphson method used in the PMQ algorithm suffers from numerical\ninstabilities, inhibiting widespread adoption, especially for use in\ncalibration. By directly specifying the random variable to be quantized at each\ntime step, we show that PMQ, and RMQ in one dimension, can be expressed as\nstandard vector quantization. This reformulation allows the application of the\naccelerated Lloyd's algorithm in an adaptive and robust procedure. Furthermore,\nin the case of stochastic volatility models, we extend the PMQ algorithm by\nusing higher-order updates for the volatility or variance process. We\nillustrate the technique for European options, using the Heston model, and more\nexotic products, using the SABR model.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2020 06:03:46 GMT"}], "update_date": "2020-06-30", "authors_parsed": [["Rudd", "Ralph", ""], ["McWalter", "Thomas A.", ""], ["Kienitz", "Joerg", ""], ["Platen", "Eckhard", ""]]}, {"id": "2006.16407", "submitter": "Ben Hamida Mrabet Sana", "authors": "Fathi Abid, Wafa Abdelmalek and Sana Ben Hamida", "title": "Dynamic Hedging using Generated Genetic Programming Implied Volatility\n  Models", "comments": "32 pages,13 figures, Intech Open Science", "journal-ref": "INTECH 2012 - Genetic Programming - New Approaches and Successful\n  Applications", "doi": "10.5772/48148", "report-no": null, "categories": "q-fin.CP cs.CE", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The purpose of this paper is to improve the accuracy of dynamic hedging using\nimplied volatilities generated by genetic programming. Using real data from\nS&P500 index options, the genetic programming's ability to forecast Black and\nScholes implied volatility is compared between static and dynamic\ntraining-subset selection methods. The performance of the best generated GP\nimplied volatilities is tested in dynamic hedging and compared with\nBlack-Scholes model. Based on MSE total, the dynamic training of GP yields\nbetter results than those obtained from static training with fixed samples.\nAccording to hedging errors, the GP model is more accurate almost in all\nhedging strategies than the BS model, particularly for in-the-money call\noptions and at-the-money put options.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2020 21:57:00 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Abid", "Fathi", ""], ["Abdelmalek", "Wafa", ""], ["Hamida", "Sana Ben", ""]]}]