[{"id": "1401.0052", "submitter": "Janne Lindqvist", "authors": "Bernhard Firner, Shridatt Sugrim, Yulong Yang, Janne Lindqvist", "title": "Elastic Pathing: Your Speed is Enough to Track You", "comments": null, "journal-ref": null, "doi": null, "report-no": "Technical Report - Rutgers University - WINLAB - TR-429", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today people increasingly have the opportunity to opt-in to \"usage-based\"\nautomotive insurance programs for reducing insurance premiums. In these\nprograms, participants install devices in their vehicles that monitor their\ndriving behavior, which raises some privacy concerns. Some devices collect\nfine-grained speed data to monitor driving habits. Companies that use these\ndevices claim that their approach is privacy-preserving because speedometer\nmeasurements do not have physical locations. However, we show that with\nknowledge of the user's home location, as the insurance companies have, speed\ndata is sufficient to discover driving routes and destinations when trip data\nis collected over a period of weeks. To demonstrate the real-world\napplicability of our approach we applied our algorithm, elastic pathing, to\ndata collected over hundreds of driving trips occurring over several months.\nWith this data and our approach, we were able to predict trip destinations to\nwithin 250 meters of ground truth in 10% of the traces and within 500 meters in\n20% of the traces. This result, combined with the amount of speed data that is\nbeing collected by insurance companies, constitutes a substantial breach of\nprivacy because a person's regular driving pattern can be deduced with repeated\nexamples of the same paths with just a few weeks of monitoring.\n", "versions": [{"version": "v1", "created": "Mon, 30 Dec 2013 23:11:50 GMT"}], "update_date": "2014-01-03", "authors_parsed": [["Firner", "Bernhard", ""], ["Sugrim", "Shridatt", ""], ["Yang", "Yulong", ""], ["Lindqvist", "Janne", ""]]}, {"id": "1401.0102", "submitter": "Mahdi Zamani", "authors": "Mahdi Zamani and Mahnush Movahedi and Mohammad Ebadzadeh and Hossein\n  Pedram", "title": "A DDoS-Aware IDS Model Based on Danger Theory and Mobile Agents", "comments": "10 pages, 3 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.AI cs.CR cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an artificial immune model for intrusion detection in distributed\nsystems based on a relatively recent theory in immunology called Danger theory.\nBased on Danger theory, immune response in natural systems is a result of\nsensing corruption as well as sensing unknown substances. In contrast,\ntraditional self-nonself discrimination theory states that immune response is\nonly initiated by sensing nonself (unknown) patterns. Danger theory solves many\nproblems that could only be partially explained by the traditional model.\nAlthough the traditional model is simpler, such problems result in high false\npositive rates in immune-inspired intrusion detection systems. We believe using\ndanger theory in a multi-agent environment that computationally emulates the\nbehavior of natural immune systems is effective in reducing false positive\nrates. We first describe a simplified scenario of immune response in natural\nsystems based on danger theory and then, convert it to a computational model as\na network protocol. In our protocol, we define several immune signals and model\ncell signaling via message passing between agents that emulate cells. Most\nmessages include application-specific patterns that must be meaningfully\nextracted from various system properties. We show how to model these messages\nin practice by performing a case study on the problem of detecting distributed\ndenial-of-service attacks in wireless sensor networks. We conduct a set of\nsystematic experiments to find a set of performance metrics that can accurately\ndistinguish malicious patterns. The results indicate that the system can be\nefficiently used to detect malicious patterns with a high level of accuracy.\n", "versions": [{"version": "v1", "created": "Tue, 31 Dec 2013 06:18:18 GMT"}, {"version": "v2", "created": "Fri, 28 Feb 2014 22:07:13 GMT"}, {"version": "v3", "created": "Sun, 28 Dec 2014 05:14:01 GMT"}], "update_date": "2014-12-30", "authors_parsed": [["Zamani", "Mahdi", ""], ["Movahedi", "Mahnush", ""], ["Ebadzadeh", "Mohammad", ""], ["Pedram", "Hossein", ""]]}, {"id": "1401.0348", "submitter": "Henry Cohn", "authors": "Nir Bitansky, Ran Canetti, Henry Cohn, Shafi Goldwasser, Yael Tauman\n  Kalai, Omer Paneth, Alon Rosen", "title": "The impossibility of obfuscation with auxiliary input or a universal\n  simulator", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we show that the existence of general indistinguishability\nobfuscators conjectured in a few recent works implies, somewhat\ncounterintuitively, strong impossibility results for virtual black box\nobfuscation. In particular, we show that indistinguishability obfuscation for\nall circuits implies:\n  * The impossibility of average-case virtual black box obfuscation with\nauxiliary input for any circuit family with super-polynomial pseudo-entropy.\nSuch circuit families include all pseudo-random function families, and all\nfamilies of encryption algorithms and randomized digital signatures that\ngenerate their required coin flips pseudo-randomly. Impossibility holds even\nwhen the auxiliary input depends only on the public circuit family, and not the\nspecific circuit in the family being obfuscated.\n  * The impossibility of average-case virtual black box obfuscation with a\nuniversal simulator (with or without any auxiliary input) for any circuit\nfamily with super-polynomial pseudo-entropy.\n  These bounds significantly strengthen the impossibility results of Goldwasser\nand Kalai (STOC 2005).\n", "versions": [{"version": "v1", "created": "Wed, 1 Jan 2014 23:18:36 GMT"}, {"version": "v2", "created": "Sun, 5 Jan 2014 03:47:42 GMT"}, {"version": "v3", "created": "Thu, 13 Feb 2014 04:58:39 GMT"}], "update_date": "2014-02-14", "authors_parsed": [["Bitansky", "Nir", ""], ["Canetti", "Ran", ""], ["Cohn", "Henry", ""], ["Goldwasser", "Shafi", ""], ["Kalai", "Yael Tauman", ""], ["Paneth", "Omer", ""], ["Rosen", "Alon", ""]]}, {"id": "1401.0458", "submitter": "David F. Nettleton", "authors": "David F. Nettleton, Vicenc Torra, and Anton Dries", "title": "The effect of constraints on information loss and risk for clustering\n  and modification based graph anonymization methods", "comments": "21 pages, 6 figures, 7 tables", "journal-ref": null, "doi": null, "report-no": "This research is partially supported by the Spanish MEC (projects\n  ARES CONSOLIDER INGENIO 2010 CSD2007-00004--eAEGISTSI2007-65406-C03-02--and\n  HIPERGRAPH TIN2009-14560-C03-01)", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a novel approach for anonymizing Online Social\nNetwork graphs which can be used in conjunction with existing perturbation\napproaches such as clustering and modification. The main insight of this paper\nis that by imposing additional constraints on which nodes can be selected we\ncan reduce the information loss with respect to key structural metrics, while\nmaintaining an acceptable risk. We present and evaluate two constraints,\n'local1' and 'local2' which select the most similar subgraphs within the same\ncommunity while excluding some key structural nodes. To this end, we introduce\na novel distance metric based on local subgraph characteristics and which is\ncalibrated using an isomorphism matcher. Empirical testing is conducted with\nthree real OSN datasets, six information loss measures, five adversary queries\nas risk measures, and different levels of k-anonymity. The results show that\noverall, the methods with constraints give the best results for information\nloss and risk of disclosure.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2014 15:46:06 GMT"}, {"version": "v2", "created": "Fri, 14 Feb 2014 17:04:36 GMT"}, {"version": "v3", "created": "Thu, 27 Feb 2014 17:02:33 GMT"}, {"version": "v4", "created": "Tue, 1 Jul 2014 15:10:06 GMT"}], "update_date": "2021-01-07", "authors_parsed": [["Nettleton", "David F.", ""], ["Torra", "Vicenc", ""], ["Dries", "Anton", ""]]}, {"id": "1401.0561", "submitter": "Janne Lindqvist", "authors": "Michael Sherman, Gradeigh Clark, Yulong Yang, Shridatt Sugrim, Arttu\n  Modig, Janne Lindqvist, Antti Oulasvirta, Teemu Roos", "title": "User-Generated Free-Form Gestures for Authentication: Security and\n  Memorability", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the security and memorability of free-form multitouch\ngestures for mobile authentication. Towards this end, we collected a dataset\nwith a generate-test-retest paradigm where participants (N=63) generated\nfree-form gestures, repeated them, and were later retested for memory. Half of\nthe participants decided to generate one-finger gestures, and the other half\ngenerated multi-finger gestures. Although there has been recent work on\ntemplate-based gestures, there are yet no metrics to analyze security of either\ntemplate or free-form gestures. For example, entropy-based metrics used for\ntext-based passwords are not suitable for capturing the security and\nmemorability of free-form gestures. Hence, we modify a recently proposed metric\nfor analyzing information capacity of continuous full-body movements for this\npurpose. Our metric computed estimated mutual information in repeated sets of\ngestures. Surprisingly, one-finger gestures had higher average mutual\ninformation. Gestures with many hard angles and turns had the highest mutual\ninformation. The best-remembered gestures included signatures and simple\nangular shapes. We also implemented a multitouch recognizer to evaluate the\npracticality of free-form gestures in a real authentication system and how they\nperform against shoulder surfing attacks. We conclude the paper with strategies\nfor generating secure and memorable free-form gestures, which present a robust\nmethod for mobile authentication.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2014 23:15:27 GMT"}], "update_date": "2014-01-06", "authors_parsed": [["Sherman", "Michael", ""], ["Clark", "Gradeigh", ""], ["Yang", "Yulong", ""], ["Sugrim", "Shridatt", ""], ["Modig", "Arttu", ""], ["Lindqvist", "Janne", ""], ["Oulasvirta", "Antti", ""], ["Roos", "Teemu", ""]]}, {"id": "1401.0994", "submitter": "Xiangyun Zhou", "authors": "Chunxiao Cai, Yueming Cai, Xiangyun Zhou, Weiwei Yang, and Wendong\n  Yang", "title": "When Does Relay Transmission Give a More Secure Connection in Wireless\n  Ad Hoc Networks?", "comments": "Accepted for publication in IEEE Transactions On Information\n  Forensics and Security", "journal-ref": null, "doi": "10.1109/TIFS.2013.2297835", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Relay transmission can enhance coverage and throughput, while it can be\nvulnerable to eavesdropping attacks due to the additional transmission of the\nsource message at the relay. Thus, whether or not one should use relay\ntransmission for secure communication is an interesting and important problem.\nIn this paper, we consider the transmission of a confidential message from a\nsource to a destination in a decentralized wireless network in the presence of\nrandomly distributed eavesdroppers. The source-destination pair can be\npotentially assisted by randomly distributed relays. For an arbitrary relay, we\nderive exact expressions of secure connection probability for both colluding\nand non-colluding eavesdroppers. We further obtain lower bound expressions on\nthe secure connection probability, which are accurate when the eavesdropper\ndensity is small. By utilizing these lower bound expressions, we propose a\nrelay selection strategy to improve the secure connection probability. By\nanalytically comparing the secure connection probability for direct\ntransmission and relay transmission, we address the important problem of\nwhether or not to relay and discuss the condition for relay transmission in\nterms of the relay density and source-destination distance. These analytical\nresults are accurate in the small eavesdropper density regime.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jan 2014 06:42:01 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Cai", "Chunxiao", ""], ["Cai", "Yueming", ""], ["Zhou", "Xiangyun", ""], ["Yang", "Weiwei", ""], ["Yang", "Wendong", ""]]}, {"id": "1401.1086", "submitter": "Paulo Shakarian", "authors": "Paulo Shakarian, Hansheng Lei, Roy Lindelauf", "title": "Power Grid Defense Against Malicious Cascading Failure", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.MA physics.soc-ph", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  An adversary looking to disrupt a power grid may look to target certain\nsubstations and sources of power generation to initiate a cascading failure\nthat maximizes the number of customers without electricity. This is\nparticularly an important concern when the enemy has the capability to launch\ncyber-attacks as practical concerns (i.e. avoiding disruption of service,\npresence of legacy systems, etc.) may hinder security. Hence, a defender can\nharden the security posture at certain power stations but may lack the time and\nresources to do this for the entire power grid. We model a power grid as a\ngraph and introduce the cascading failure game in which both the defender and\nattacker choose a subset of power stations such as to minimize (maximize) the\nnumber of consumers having access to producers of power. We formalize problems\nfor identifying both mixed and deterministic strategies for both players, prove\ncomplexity results under a variety of different scenarios, identify tractable\ncases, and develop algorithms for these problems. We also perform an\nexperimental evaluation of the model and game on a real-world power grid\nnetwork. Empirically, we noted that the game favors the attacker as he benefits\nmore from increased resources than the defender. Further, the minimax defense\nproduces roughly the same expected payoff as an easy-to-compute deterministic\nload based (DLB) defense when played against a minimax attack strategy.\nHowever, DLB performs more poorly than minimax defense when faced with the\nattacker's best response to DLB. This is likely due to the presence of low-load\nyet high-payoff nodes, which we also found in our empirical analysis.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jan 2014 14:08:09 GMT"}], "update_date": "2014-01-07", "authors_parsed": [["Shakarian", "Paulo", ""], ["Lei", "Hansheng", ""], ["Lindelauf", "Roy", ""]]}, {"id": "1401.1232", "submitter": "Yeray Cachon  YC", "authors": "Yeray Cachon Santana", "title": "A Cryptographic Scheme Of Mellin Transform", "comments": "Cryptography using Mellin's transform", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper it has been developed an algorithm for cryptography, using the\nMellin's transform. Cryptography is very important to protect data to ensure\nthat two people, using an insecure channel, may communicate in a secure way. In\nthe present age, ensure the communications will essential to shared data that\nhave to be protected. The original message is a plain text, and the encrypted\nform as cipher text. The cipher text message contains all the information of\nthe plain text, but is cannot be read from a human without a key and a method\nto decrypt it.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jan 2014 22:50:30 GMT"}], "update_date": "2014-01-08", "authors_parsed": [["Santana", "Yeray Cachon", ""]]}, {"id": "1401.1318", "submitter": "Chandra Sekhar Mr", "authors": "Vorugunti Chandra Sekhar and Mrudula Sarvabhatla", "title": "A Robust Biometric-Based Three-factor Remote User Authentication Scheme", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid development of Internet of Things (IoT) technology, which is an\ninter connection of networks through an insecure public channel i.e. Internet\ndemands for authenticating the remote user trying to access the secure network\nresources. In 2013, Ankita et al. proposed an improved three factor remote user\nauthentication scheme. In this poster we will show that Ankita et al scheme is\nvulnerable to known session specific temporary information attack, on\nsuccessfully performing the attack, the adversary can perform all other major\ncryptographic attacks. As a part of our contribution, we will propose an\nimproved scheme which is resistance to all major cryptographic attacks and\novercomes the defects in Ankita et al. scheme.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jan 2014 09:29:57 GMT"}], "update_date": "2014-01-08", "authors_parsed": [["Sekhar", "Vorugunti Chandra", ""], ["Sarvabhatla", "Mrudula", ""]]}, {"id": "1401.1331", "submitter": "Igor Shparlinski", "authors": "Oscar Garcia-Morchon, Ronald Rietman, Igor E. Shparlinski and Ludo\n  Tolhuizen", "title": "Interpolation and Approximation of Polynomials in Finite Fields over a\n  Short Interval from Noisy Values", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by a recently introduced HIMMO key distribution scheme, we consider\na modification of the noisy polynomial interpolation problem of recovering an\nunknown polynomial $f(X) \\in Z[X]$ from approximate values of the residues of\n$f(t)$ modulo a prime $p$ at polynomially many points $t$ taken from a short\ninterval.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jan 2014 10:13:42 GMT"}], "update_date": "2014-01-08", "authors_parsed": [["Garcia-Morchon", "Oscar", ""], ["Rietman", "Ronald", ""], ["Shparlinski", "Igor E.", ""], ["Tolhuizen", "Ludo", ""]]}, {"id": "1401.1526", "submitter": "Colleen Swanson", "authors": "Colleen M. Swanson and Douglas R. Stinson", "title": "Additional Constructions to Solve the Generalized Russian Cards Problem\n  using Combinatorial Designs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the generalized Russian cards problem, we have a card deck $X$ of $n$\ncards and three participants, Alice, Bob, and Cathy, dealt $a$, $b$, and $c$\ncards, respectively. Once the cards are dealt, Alice and Bob wish to privately\ncommunicate their hands to each other via public announcements, without the\nadvantage of a shared secret or public key infrastructure. Cathy should remain\nignorant of all but her own cards after Alice and Bob have made their\nannouncements. Notions for Cathy's ignorance in the literature range from Cathy\nnot learning the fate of any individual card with certainty (weak $1$-security)\nto not gaining any probabilistic advantage in guessing the fate of some set of\n$\\delta$ cards (perfect $\\delta$-security). As we demonstrate, the generalized\nRussian cards problem has close ties to the field of combinatorial designs, on\nwhich we rely heavily, particularly for perfect security notions. Our main\nresult establishes an equivalence between perfectly $\\delta$-secure strategies\nand $(c+\\delta)$-designs on $n$ points with block size $a$, when announcements\nare chosen uniformly at random from the set of possible announcements. We also\nprovide construction methods and example solutions, including a construction\nthat yields perfect $1$-security against Cathy when $c=2$. We leverage a known\ncombinatorial design to construct a strategy with $a=8$, $b=13$, and $c=3$ that\nis perfectly $2$-secure. Finally, we consider a variant of the problem that\nyields solutions that are easy to construct and optimal with respect to both\nthe number of announcements and level of security achieved. Moreover, this is\nthe first method obtaining weak $\\delta$-security that allows Alice to hold an\narbitrary number of cards and Cathy to hold a set of $c = \\lfloor\n\\frac{a-\\delta}{2} \\rfloor$ cards. Alternatively, the construction yields\nsolutions for arbitrary $\\delta$, $c$ and any $a \\geq \\delta + 2c$.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jan 2014 22:18:05 GMT"}, {"version": "v2", "created": "Tue, 5 Aug 2014 17:41:40 GMT"}], "update_date": "2014-08-06", "authors_parsed": [["Swanson", "Colleen M.", ""], ["Stinson", "Douglas R.", ""]]}, {"id": "1401.1982", "submitter": "Maleh Yassine", "authors": "Y. Maleh, A. Ezzati", "title": "A review of security attacks and Intrusion Detection Schemes in Wireless\n  Sensor Networks", "comments": "12 pages with 9 figures", "journal-ref": "International Journal of Wireless & Mobile Networks (IJWMN) Vol.\n  5, No. 6, December 2013", "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Sensor Networks (WSNs) are currently used in different industrial\nand consumer applications, such as earth monitoring, health related\napplications, natural disaster prevention, and many other areas. Security is\none of the major aspects of Wireless sensor networks due to the resource\nlimitations of sensor nodes. However, these networks are facing several threats\nthat affect their functioning and their life. In this paper we present security\nattacks in wireless sensor networks, and we focus on a review and analysis of\nthe recent Intrusion Detection schemes in WSNs.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jan 2014 12:37:25 GMT"}], "update_date": "2014-01-13", "authors_parsed": [["Maleh", "Y.", ""], ["Ezzati", "A.", ""]]}, {"id": "1401.2107", "submitter": "Dragan Vidakovic Novak", "authors": "Dragan Vidakovic, Dusko Parezanovic, Zoran Vucetic", "title": "Minimizing the Time of Detection of Large (Probably) Prime Numbers", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present the experimental results that more clearly than any\ntheory suggest an answer to the question: when in detection of large (probably)\nprime numbers to apply, a very resource demanding, Miller-Rabin algorithm. Or,\nto put it another way, when the dividing by first several tens of prime numbers\nshould be replaced by primality testing? As an innovation, the procedure above\nwill be supplemented by considering the use of the well-known Goldbach's\nconjecture in the solving of this and some other important questions about the\nRSA cryptosystem, always guided by the motto \"do not harm\" - neither the\nsecurity nor the time spent.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jan 2014 18:20:04 GMT"}], "update_date": "2014-01-10", "authors_parsed": [["Vidakovic", "Dragan", ""], ["Parezanovic", "Dusko", ""], ["Vucetic", "Zoran", ""]]}, {"id": "1401.2417", "submitter": "Tommaso Gagliardoni", "authors": "Frederik Armknecht and Tommaso Gagliardoni and Stefan Katzenbeisser\n  and Andreas Peter", "title": "General Impossibility of Group Homomorphic Encryption in the Quantum\n  World", "comments": "20 pages, 2 figures, conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Group homomorphic encryption represents one of the most important building\nblocks in modern cryptography. It forms the basis of widely-used, more\nsophisticated primitives, such as CCA2-secure encryption or secure multiparty\ncomputation. Unfortunately, recent advances in quantum computation show that\nmany of the existing schemes completely break down once quantum computers reach\nmaturity (mainly due to Shor's algorithm). This leads to the challenge of\nconstructing quantum-resistant group homomorphic cryptosystems.\n  In this work, we prove the general impossibility of (abelian) group\nhomomorphic encryption in the presence of quantum adversaries, when assuming\nthe IND-CPA security notion as the minimal security requirement. To this end,\nwe prove a new result on the probability of sampling generating sets of finite\n(sub-)groups if sampling is done with respect to an arbitrary, unknown\ndistribution. Finally, we provide a sufficient condition on homomorphic\nencryption schemes for our quantum attack to work and discuss its\nsatisfiability in non-group homomorphic cases. The impact of our results on\nrecent fully homomorphic encryption schemes poses itself as an open question.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 18:02:48 GMT"}, {"version": "v2", "created": "Mon, 13 Jan 2014 16:06:44 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Armknecht", "Frederik", ""], ["Gagliardoni", "Tommaso", ""], ["Katzenbeisser", "Stefan", ""], ["Peter", "Andreas", ""]]}, {"id": "1401.2594", "submitter": "Jun Zhang", "authors": "You-Qi Nie, Hong-Fei Zhang, Zhen Zhang, Jian Wang, Xiongfeng Ma, Jun\n  Zhang, and Jian-Wei Pan", "title": "Practical and fast quantum random number generation based on photon\n  arrival time relative to external reference", "comments": "9 pages, 3 figures, 1 table. Accepted for publication in Applied\n  Physics Letters", "journal-ref": "Appl. Phys. Lett. 104, 051110 (2014)", "doi": "10.1063/1.4863224", "report-no": null, "categories": "quant-ph cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a practical high-speed quantum random number generator, where the\ntiming of single-photon detection relative to an external time reference is\nmeasured as the raw data. The bias of the raw data can be substantially reduced\ncompared with the previous realizations. The raw random bit rate of our\ngenerator can reach 109 Mbps. We develop a model for the generator and evaluate\nthe min-entropy of the raw data. Toeplitz matrix hashing is applied for\nrandomness extraction, after which the final random bits are able to pass the\nstandard randomness tests.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jan 2014 06:21:15 GMT"}], "update_date": "2014-02-06", "authors_parsed": [["Nie", "You-Qi", ""], ["Zhang", "Hong-Fei", ""], ["Zhang", "Zhen", ""], ["Wang", "Jian", ""], ["Ma", "Xiongfeng", ""], ["Zhang", "Jun", ""], ["Pan", "Jian-Wei", ""]]}, {"id": "1401.2596", "submitter": "Zhenqi Huang", "authors": "Zhenqi Huang, Sayan Mitra, Nitin Vaidya", "title": "Differentially Private Distributed Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In distributed optimization and iterative consensus literature, a standard\nproblem is for $N$ agents to minimize a function $f$ over a subset of Euclidean\nspace, where the cost function is expressed as a sum $\\sum f_i$. In this paper,\nwe study the private distributed optimization (PDOP) problem with the\nadditional requirement that the cost function of the individual agents should\nremain differentially private. The adversary attempts to infer information\nabout the private cost functions from the messages that the agents exchange.\nAchieving differential privacy requires that any change of an individual's cost\nfunction only results in unsubstantial changes in the statistics of the\nmessages. We propose a class of iterative algorithms for solving PDOP, which\nachieves differential privacy and convergence to the optimal value. Our\nanalysis reveals the dependence of the achieved accuracy and the privacy levels\non the the parameters of the algorithm. We observe that to achieve\n$\\epsilon$-differential privacy the accuracy of the algorithm has the order of\n$O(\\frac{1}{\\epsilon^2})$.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jan 2014 07:43:39 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Huang", "Zhenqi", ""], ["Mitra", "Sayan", ""], ["Vaidya", "Nitin", ""]]}, {"id": "1401.2854", "submitter": "Lucca Hirschi", "authors": "David Baelde, St\\'ephanie Delaune and Lucca Hirschi", "title": "A reduced semantics for deciding trace equivalence using constraint\n  systems", "comments": "Accepted for publication at POST'14", "journal-ref": null, "doi": "10.1007/978-3-642-54792-8_1", "report-no": null, "categories": "cs.CR cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many privacy-type properties of security protocols can be modelled using\ntrace equivalence properties in suitable process algebras. It has been shown\nthat such properties can be decided for interesting classes of finite processes\n(i.e., without replication) by means of symbolic execution and constraint\nsolving. However, this does not suffice to obtain practical tools. Current\nprototypes suffer from a classical combinatorial explosion problem caused by\nthe exploration of many interleavings in the behaviour of processes.\nM\\\"odersheim et al. have tackled this problem for reachability properties using\npartial order reduction techniques. We revisit their work, generalize it and\nadapt it for equivalence checking. We obtain an optimization in the form of a\nreduced symbolic semantics that eliminates redundant interleavings on the fly.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2014 14:45:34 GMT"}, {"version": "v2", "created": "Fri, 17 Jan 2014 15:22:28 GMT"}], "update_date": "2016-10-27", "authors_parsed": [["Baelde", "David", ""], ["Delaune", "Stéphanie", ""], ["Hirschi", "Lucca", ""]]}, {"id": "1401.3088", "submitter": "Stefano Tomasin", "authors": "Stefano Tomasin and Nicola Laurenti", "title": "Secret Message Transmission by HARQ with Multiple Encoding", "comments": "Proc. Int. Conference on Communications (ICC) 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Secure transmission between two agents, Alice and Bob, over block fading\nchannels can be achieved similarly to conventional hybrid automatic repeat\nrequest (HARQ) by letting Alice transmit multiple blocks, each containing an\nencoded version of the secret message, until Bob informs Alice about successful\ndecoding by a public error-free return channel. In existing literature each\nblock is a differently punctured version of a single codeword generated with a\nWyner code that uses a common randomness for all blocks. In this paper instead\nwe propose a more general approach where multiple codewords are generated from\nindependent randomnesses. The class of channels for which decodability and\nsecrecy is ensured is characterized, with derivations for the existence of\nsecret codes. We show in particular that the classes are not a trivial subset\n(or superset) of those of existing schemes, thus highlighting the novelty of\nthe proposed solution. The result is further confirmed by deriving the average\nachievable secrecy throughput, thus taking into account both decoding and\nsecrecy outage.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2014 07:26:54 GMT"}], "update_date": "2014-01-15", "authors_parsed": [["Tomasin", "Stefano", ""], ["Laurenti", "Nicola", ""]]}, {"id": "1401.3201", "submitter": "Chongjing Sun", "authors": "Chongjing Sun, Philip S. Yu, Xiangnan Kong and Yan Fu", "title": "Privacy Preserving Social Network Publication Against Mutual Friend\n  Attacks", "comments": "10 pages, 11 figures, extended version of a paper in the 4th IEEE\n  International Workshop on Privacy Aspects of Data Mining(PADM2013)", "journal-ref": null, "doi": "10.1109/ICDMW.2013.71", "report-no": null, "categories": "cs.DB cs.CR cs.SI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Publishing social network data for research purposes has raised serious\nconcerns for individual privacy. There exist many privacy-preserving works that\ncan deal with different attack models. In this paper, we introduce a novel\nprivacy attack model and refer it as a mutual friend attack. In this model, the\nadversary can re-identify a pair of friends by using their number of mutual\nfriends. To address this issue, we propose a new anonymity concept, called\nk-NMF anonymity, i.e., k-anonymity on the number of mutual friends, which\nensures that there exist at least k-1 other friend pairs in the graph that\nshare the same number of mutual friends. We devise algorithms to achieve the\nk-NMF anonymity while preserving the original vertex set in the sense that we\nallow the occasional addition but no deletion of vertices. Further we give an\nalgorithm to ensure the k-degree anonymity in addition to the k-NMF anonymity.\nThe experimental results on real-word datasets demonstrate that our approach\ncan preserve the privacy and utility of social networks effectively against\nmutual friend attacks.\n", "versions": [{"version": "v1", "created": "Fri, 11 Oct 2013 03:52:41 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Sun", "Chongjing", ""], ["Yu", "Philip S.", ""], ["Kong", "Xiangnan", ""], ["Fu", "Yan", ""]]}, {"id": "1401.3274", "submitter": "Deepjyoti Deka", "authors": "Deepjyoti Deka, Ross Baldick, and Sriram Vishwanath", "title": "Hidden Attacks on Power Grid: Optimal Attack Strategies and Mitigation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Real time operation of the power grid and synchronism of its different\nelements require accurate estimation of its state variables. Errors in state\nestimation will lead to sub-optimal Optimal Power Flow (OPF) solutions and\nsubsequent increase in the price of electricity in the market or, potentially\noverload and create line outages. This paper studies hidden data attacks on\npower systems by an adversary trying to manipulate state estimators. The\nadversary gains control of a few meters, and is able to introduce spurious\nmeasurements in them. The paper presents a polynomial time algorithm using\nmin-cut calculations to determine the minimum number of measurements an\nadversary needs to manipulate in order to perform a hidden attack. Greedy\ntechniques are presented to aid the system operator in identifying critical\nmeasurements for protection to prevent such hidden data attacks. Secure PMU\nplacement against data attacks is also discussed and an algorithm for placing\nPMUs for this purpose is developed. The performances of the proposed algorithms\nare shown through simulations on IEEE test cases.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2014 18:26:36 GMT"}], "update_date": "2014-01-15", "authors_parsed": [["Deka", "Deepjyoti", ""], ["Baldick", "Ross", ""], ["Vishwanath", "Sriram", ""]]}, {"id": "1401.3307", "submitter": "Yongge Wang", "authors": "Yongge Wang", "title": "On the Design of LIL Tests for (Pseudo) Random Generators and Some\n  Experimental Results", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  NIST SP800-22 (2010) proposes the state of art testing suite for (pseudo)\nrandom generators to detect deviations of a binary sequence from randomness. On\nthe one hand, as a counter example to NIST SP800-22 test suite, it is easy to\nconstruct functions that are considered as GOOD pseudorandom generators by NIST\nSP800-22 test suite though the output of these functions are easily\ndistinguishable from the uniform distribution. Thus these functions are not\npseudorandom generators by definition. On the other hand, NIST SP800-22 does\nnot cover some of the important laws for randomness. Two fundamental limit\ntheorems about random binary strings are the central limit theorem and the law\nof the iterated logarithm (LIL). Several frequency related tests in NIST\nSP800-22 cover the central limit theorem while no NIST SP800-22 test covers\nLIL.\n  This paper proposes techniques to address the above challenges that NIST\nSP800-22 testing suite faces. Firstly, we propose statistical distance based\ntesting techniques for (pseudo) random generators to reduce the above mentioned\nType II errors in NIST SP800-22 test suite. Secondly, we propose LIL based\nstatistical testing techniques, calculate the probabilities, and carry out\nexperimental tests on widely used pseudorandom generators by generating around\n30TB of pseudorandom sequences. The experimental results show that for a sample\nsize of 1000 sequences (2TB), the statistical distance between the generated\nsequences and the uniform distribution is around 0.07 (with $0$ for\nstatistically indistinguishable and $1$ for completely distinguishable) and the\nroot-mean-square deviation is around 0.005.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2014 19:46:30 GMT"}], "update_date": "2014-01-15", "authors_parsed": [["Wang", "Yongge", ""]]}, {"id": "1401.3421", "submitter": "Rourab Paul", "authors": "Sruti Agarwal, Sangeet Saha, Rourab Paul, Amlan Chakrabarti", "title": "Performance Evaluation of ECC in Single and Multi Processor\n  Architectures on FPGA Based Embedded System", "comments": "Published Book Title: Elsevier Science and Technology, ICCN 2013,\n  Bangalore, Page(s): 140 - 147, Volume 3, 03.elsevierst.2013.3.ICCN16, ISBN\n  :9789351071044, Paper\n  link:-http://searchdl.org/index.php/book_series/view/917", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cryptographic algorithms are computationally costly and the challenge is more\nif we need to execute them in resource constrained embedded systems. Field\nProgrammable Gate Arrays (FPGAs) having programmable logic de- vices and\nprocessing cores, have proven to be highly feasible implementation platforms\nfor embedded systems providing lesser design time and reconfig- urability.\nDesign parameters like throughput, resource utilization and power requirements\nare the key issues. The popular Elliptic Curve Cryptography (ECC), which is\nsuperior over other public-key crypto-systems like RSA in many ways, such as\nproviding greater security for a smaller key size, is cho- sen in this work and\nthe possibilities of its implementation in FPGA based embedded systems for both\nsingle and dual processor core architectures in- volving task parallelization\nhave been explored. This exploration, which is first of its kind considering\nthe other existing works, is a needed activity for evaluating the best possible\narchitectural environment for ECC implementa- tion on FPGA (Virtex4 XC4VFX12,\nFF668, -10) based embedded platform.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 03:25:41 GMT"}], "update_date": "2014-02-20", "authors_parsed": [["Agarwal", "Sruti", ""], ["Saha", "Sangeet", ""], ["Paul", "Rourab", ""], ["Chakrabarti", "Amlan", ""]]}, {"id": "1401.3592", "submitter": "Ayman Bahaa-Eldin", "authors": "Ayman M. Bahaa-Eldin", "title": "Intelligent Systems for Information Security", "comments": "PhD Thesis. Ain Shams University, Faculty of Engineering. Computer\n  and Systems Eng. Dept., 2004", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This thesis aims to use intelligent systems to extend and improve performance\nand security of cryptographic techniques. Genetic algorithms framework for\ncryptanalysis problem is addressed. A novel extension to the differential\ncryptanalysis using genetic algorithm is proposed and a fitness measure based\non the differential characteristics of the cipher being attacked is also\nproposed. The complexity of the proposed attack is shown to be less than\nquarter of normal differential cryptanalysis of the same cipher by applying the\nproposed attack to both the basic Substitution Permutation Network and the\nFeistel Network. The basic models of modern block ciphers are attacked instead\nof actual cipher to prove that the attack is applicable to other ciphers\nvulnerable to differential cryptanalysis. A new attack for block cipher based\non the ability of neural networks to perform an approximation of mapping is\nproposed. A complete problem formulation is explained and implementation of the\nattack on some hypothetical Feistel cipher not vulnerable to differential or\nlinear attacks is presented. A new block cipher based on the neural networks is\nproposed. A complete cipher structure is given and a key scheduling is also\nshown. The main properties of neural network being able to perform mapping\nbetween large dimension domains in a very fast and a very small memory compared\nto S-Boxes is used as a base for the cipher.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 14:00:36 GMT"}], "update_date": "2014-01-16", "authors_parsed": [["Bahaa-Eldin", "Ayman M.", ""]]}, {"id": "1401.3659", "submitter": "Hadi Ahmadi", "authors": "Hadi Ahmadi and Reihaneh Safavi-Naini", "title": "Multipath Private Communication: An Information Theoretic Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sending private messages over communication environments under surveillance\nis an important challenge in communication security and has attracted\nattentions of cryptographers through time. We believe that resources other than\ncryptographic keys can be used for communication privacy. We consider private\nmessage transmission (PMT) in an abstract multipath communication model between\ntwo communicants, Alice and Bob, in the presence of an eavesdropper, Eve. Alice\nand Bob have pre-shared keys and Eve is computationally unbounded. There are a\ntotal of $n$ paths and the three parties can have simultaneous access to at\nmost $t_a$, $t_b$, and $t_e$ paths. The parties can switch their paths after\nevery $\\lambda$ bits of communication. We study perfect (P)-PMT versus\nasymptotically-perfect (AP)-PMT protocols. The former has zero tolerance of\ntransmission error and leakage, whereas the latter allows for positive error\nand leakage that tend to zero as the message length increases. We derive the\nnecessary and sufficient conditions under which P-PMT and AP-PMT are possible.\nWe also introduce explicit P-PMT and AP-PMT constructions. Our results show\nAP-PMT protocols attain much higher information rates than P-PMT ones.\nInterestingly, AP-PMT is possible even in poorest condition where $t_a=t_b=1$\nand $t_e=n-1$. It remains however an open question whether the derived rates\ncan be improved by more sophisticated AP-PMT protocols.\n  We study applications of our results to private communication over the\nreal-life scenarios of multiple-frequency links and multiple-route networks. We\nshow practical examples of such scenarios that can be abstracted by the\nmultipath setting: Our results prove the possibility of keyless\ninformation-theoretic private message transmission at rates $17\\%$ and $20\\%$\nfor the two example scenarios, respectively. We discuss open problems and\nfuture work at the end.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 16:48:08 GMT"}], "update_date": "2014-01-16", "authors_parsed": [["Ahmadi", "Hadi", ""], ["Safavi-Naini", "Reihaneh", ""]]}, {"id": "1401.3768", "submitter": "Wei   Jiang", "authors": "Bharath K. Samanthula, Wei Jiang, Elisa Bertino", "title": "Lightweight and Secure Two-Party Range Queries over Outsourced Encrypted\n  Databases", "comments": "25 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the many benefits of cloud computing, an entity may want to outsource\nits data and their related analytics tasks to a cloud. When data are sensitive,\nit is in the interest of the entity to outsource encrypted data to the cloud;\nhowever, this limits the types of operations that can be performed on the cloud\nside. Especially, evaluating queries over the encrypted data stored on the\ncloud without the entity performing any computation and without ever decrypting\nthe data become a very challenging problem. In this paper, we propose solutions\nto conduct range queries over outsourced encrypted data. The existing methods\nleak valuable information to the cloud which can violate the security guarantee\nof the underlying encryption schemes. In general, the main security primitive\nused to evaluate range queries is secure comparison (SC) of encrypted integers.\nHowever, we observe that the existing SC protocols are not very efficient. To\nthis end, we first propose a novel SC scheme that takes encrypted integers and\noutputs encrypted comparison result. We empirically show its practical\nadvantage over the current state-of-the-art. We then utilize the proposed SC\nscheme to construct two new secure range query protocols. Our protocols protect\ndata confidentiality, privacy of user's query, and also preserve the semantic\nsecurity of the encrypted data; therefore, they are more secure than the\nexisting protocols. Furthermore, our second protocol is lightweight at the user\nend, and it can allow an authorized user to use any device with limited storage\nand computing capability to perform the range queries over outsourced encrypted\ndata.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 21:50:01 GMT"}], "update_date": "2014-01-17", "authors_parsed": [["Samanthula", "Bharath K.", ""], ["Jiang", "Wei", ""], ["Bertino", "Elisa", ""]]}, {"id": "1401.3851", "submitter": "Jing Xu", "authors": "Jing Xu, Christian R. Shelton", "title": "Intrusion Detection using Continuous Time Bayesian Networks", "comments": null, "journal-ref": "Journal Of Artificial Intelligence Research, Volume 39, pages\n  745-774, 2010", "doi": "10.1613/jair.3050", "report-no": null, "categories": "cs.AI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intrusion detection systems (IDSs) fall into two high-level categories:\nnetwork-based systems (NIDS) that monitor network behaviors, and host-based\nsystems (HIDS) that monitor system calls. In this work, we present a general\ntechnique for both systems. We use anomaly detection, which identifies patterns\nnot conforming to a historic norm. In both types of systems, the rates of\nchange vary dramatically over time (due to burstiness) and over components (due\nto service difference). To efficiently model such systems, we use continuous\ntime Bayesian networks (CTBNs) and avoid specifying a fixed update interval\ncommon to discrete-time models. We build generative models from the normal\ntraining data, and abnormal behaviors are flagged based on their likelihood\nunder this norm. For NIDS, we construct a hierarchical CTBN model for the\nnetwork packet traces and use Rao-Blackwellized particle filtering to learn the\nparameters. We illustrate the power of our method through experiments on\ndetecting real worms and identifying hosts on two publicly available network\ntraces, the MAWI dataset and the LBNL dataset. For HIDS, we develop a novel\nlearning method to deal with the finite resolution of system log file time\nstamps, without losing the benefits of our continuous time model. We\ndemonstrate the method by detecting intrusions in the DARPA 1998 BSM dataset.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2014 04:59:06 GMT"}], "update_date": "2014-01-17", "authors_parsed": [["Xu", "Jing", ""], ["Shelton", "Christian R.", ""]]}, {"id": "1401.3859", "submitter": "Andreas Krause", "authors": "Andreas Krause, Eric Horvitz", "title": "A Utility-Theoretic Approach to Privacy in Online Services", "comments": null, "journal-ref": "Journal Of Artificial Intelligence Research, Volume 39, pages\n  633-662, 2010", "doi": "10.1613/jair.3089", "report-no": null, "categories": "cs.AI cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online offerings such as web search, news portals, and e-commerce\napplications face the challenge of providing high-quality service to a large,\nheterogeneous user base. Recent efforts have highlighted the potential to\nimprove performance by introducing methods to personalize services based on\nspecial knowledge about users and their context. For example, a users\ndemographics, location, and past search and browsing may be useful in enhancing\nthe results offered in response to web search queries. However, reasonable\nconcerns about privacy by both users, providers, and government agencies acting\non behalf of citizens, may limit access by services to such information. We\nintroduce and explore an economics of privacy in personalization, where people\ncan opt to share personal information, in a standing or on-demand manner, in\nreturn for expected enhancements in the quality of an online service. We focus\non the example of web search and formulate realistic objective functions for\nsearch efficacy and privacy. We demonstrate how we can find a provably\nnear-optimal optimization of the utility-privacy tradeoff in an efficient\nmanner. We evaluate our methodology on data drawn from a log of the search\nactivity of volunteer participants. We separately assess users' preferences\nabout privacy and utility via a large-scale survey, aimed at eliciting\npreferences about peoples' willingness to trade the sharing of personal data in\nreturns for gains in search efficiency. We show that a significant level of\npersonalization can be achieved using a relatively small amount of information\nabout users.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2014 05:03:13 GMT"}], "update_date": "2014-01-17", "authors_parsed": [["Krause", "Andreas", ""], ["Horvitz", "Eric", ""]]}, {"id": "1401.3936", "submitter": "Adnan Anwar", "authors": "Adnan Anwar, Abdun Naser Mahmood", "title": "Cyber Security of Smart Grid Infrastructure", "comments": "The State of the Art in Intrusion Prevention and Detection, CRC\n  Press, Taylor & Francis Group, USA, January 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Smart grid security is crucial to maintain stable and reliable power system\noperation during the contingency situation due to the failure of any critical\npower system component. Ensuring a secured smart grid involves with a less\npossibility of power grid collapse or equipment malfunction. Due to lack of the\nproper security measures, a major blackout may occur which can even lead to a\ncascading failure. Therefore, to protect this critical power system\ninfrastructure and to ensure a reliable and an uninterrupted power supply to\nthe end users, smart grid security issues must be addressed with high priority.\nIn a smart grid environment, electric power infrastructure is modernized by\nincorporating the current and future requirements and advanced functionalities\nto its consumers. To make the smart grid happen, cyber system is integrated\nwith the physical power system. Although adoption of cyber system has made the\ngrid more energy efficient and modernized, it has introduced cyber-attack\nissues which are critical for national infrastructure security and customer\nsatisfaction. Due to the cyber-attack, power grid may face operational failures\nand loss of synchronization. This operational failure may damage critical power\nsystem components which may interrupt the power supply and make the system\nunstable resulting high financial penalties. In this chapter, some recent cyber\nattack related incidents into a smart grid environment are discussed. The\nrequirements and the state of the art of cyber security issues of a critical\npower system infrastructure are illustrated elaborately.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2014 08:53:28 GMT"}, {"version": "v2", "created": "Wed, 22 Jan 2014 05:00:21 GMT"}], "update_date": "2014-01-23", "authors_parsed": [["Anwar", "Adnan", ""], ["Mahmood", "Abdun Naser", ""]]}, {"id": "1401.4151", "submitter": "Steve Schneider", "authors": "Chris Culnane and Steve Schneider", "title": "A Peered Bulletin Board for Robust Use in Verifiable Voting Systems", "comments": "49 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Web Bulletin Board (WBB) is a key component of verifiable election\nsystems. It is used in the context of election verification to publish evidence\nof voting and tallying that voters and officials can check, and where\nchallenges can be launched in the event of malfeasance. In practice, the\nelection authority has responsibility for implementing the web bulletin board\ncorrectly and reliably, and will wish to ensure that it behaves correctly even\nin the presence of failures and attacks. To ensure robustness, an\nimplementation will typically use a number of peers to be able to provide a\ncorrect service even when some peers go down or behave dishonestly. In this\npaper we propose a new protocol to implement such a Web Bulletin Board,\nmotivated by the needs of the vVote verifiable voting system. Using a\ndistributed algorithm increases the complexity of the protocol and requires\ncareful reasoning in order to establish correctness. Here we use the Event-B\nmodelling and refinement approach to establish correctness of the peered design\nagainst an idealised specification of the bulletin board behaviour. In\nparticular we show that for n peers, a threshold of t > 2n/3 peers behaving\ncorrectly is sufficient to ensure correct behaviour of the bulletin board\ndistributed design. The algorithm also behaves correctly even if honest or\ndishonest peers temporarily drop out of the protocol and then return. The\nverification approach also establishes that the protocols used within the\nbulletin board do not interfere with each other. This is the first time a\npeered web bulletin board suite of protocols has been formally verified.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2014 20:11:42 GMT"}], "update_date": "2014-01-17", "authors_parsed": [["Culnane", "Chris", ""], ["Schneider", "Steve", ""]]}, {"id": "1401.4339", "submitter": "Abhishek Bichhawat", "authors": "Abhishek Bichhawat, Vineet Rajani, Deepak Garg and Christian Hammer", "title": "Information Flow Control in WebKit's JavaScript Bytecode", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Websites today routinely combine JavaScript from multiple sources, both\ntrusted and untrusted. Hence, JavaScript security is of paramount importance. A\nspecific interesting problem is information flow control (IFC) for JavaScript.\nIn this paper, we develop, formalize and implement a dynamic IFC mechanism for\nthe JavaScript engine of a production Web browser (specifically, Safari's\nWebKit engine). Our IFC mechanism works at the level of JavaScript bytecode and\nhence leverages years of industrial effort on optimizing both the source to\nbytecode compiler and the bytecode interpreter. We track both explicit and\nimplicit flows and observe only moderate overhead. Working with bytecode\nresults in new challenges including the extensive use of unstructured control\nflow in bytecode (which complicates lowering of program context taints),\nunstructured exceptions (which complicate the matter further) and the need to\nmake IFC analysis permissive. We explain how we address these challenges,\nformally model the JavaScript bytecode semantics and our instrumentation, prove\nthe standard property of termination-insensitive non-interference, and present\nexperimental results on an optimized prototype.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jan 2014 13:38:08 GMT"}, {"version": "v2", "created": "Tue, 21 Jan 2014 09:01:09 GMT"}], "update_date": "2014-01-22", "authors_parsed": [["Bichhawat", "Abhishek", ""], ["Rajani", "Vineet", ""], ["Garg", "Deepak", ""], ["Hammer", "Christian", ""]]}, {"id": "1401.4726", "submitter": "Rainer H\\\"orbe", "authors": "Rainer Hoerbe", "title": "A Model for Privacy-enhanced Federated Identity Management", "comments": "36 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Identity federations operating in a business or consumer context need to\nprevent the collection of user data across trust service providers for legal\nand business case reasons. Legal reasons are given by data protection\nlegislation. Other reasons include business owners becoming increasingly aware\nof confidentiality risks that go beyond traditional information security, e.g.,\nthe numbers of authentications to an EDI service might provide insights into\nthe volume of invoices, from which one could derive insider information. This\npaper proposes extended technical controls supporting three privacy\nrequirements: a) Limit d Linkability: Two service providers cannot link data\nrelated to a user without the help of a third party, using neither an\nidentifier nor other identifying attributes like email addresses or payment\ndata; b) Limited Observability: An identity provider cannot trace which\nservices a user is using without the help of a third party; c) Non-Disclosure:\nAttributes provided to the service provider by an attribute provider are not\ndisclosed to the identity provider or an intermediate service broker. Using a\nhub-and-spoke federation style following the privacy-by-design principle, this\nreference architecture addresses the privacy controls mentioned above.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jan 2014 19:44:38 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Hoerbe", "Rainer", ""]]}, {"id": "1401.4730", "submitter": "Masoud Koleini", "authors": "Masoud Koleini and Eike Ritter and Mark Ryan", "title": "Verification of agent knowledge in dynamic access control policies", "comments": "The original version of this paper, \"Model checking agent knowledge\n  in dynamic access control policies\", appeared in Lecture Notes in Computer\n  Science (LNCS), Volume 7795, 2013, pp 448-462", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a modeling technique based on interpreted systems in order to\nverify temporal-epistemic properties over access control policies. This\napproach enables us to detect information flow vulnerabilities in dynamic\npolicies by verifying the knowledge of the agents gained by both reading and\nreasoning about system information. To overcome the practical limitations of\nstate explosion in model-checking temporal-epistemic properties, we introduce a\nnovel abstraction and refinement technique for temporal-epistemic safety\nproperties in ACTLK (ACTL with knowledge modality K) and a class of interesting\nproperties that does fall in this category.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jan 2014 19:59:24 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Koleini", "Masoud", ""], ["Ritter", "Eike", ""], ["Ryan", "Mark", ""]]}, {"id": "1401.4790", "submitter": "Dheerendra Mishra Mr.", "authors": "Dheerendra Mishra", "title": "Cryptanalysis of Multi-Server Authenticated Key Agreement Scheme Based\n  on Trust Computing Using Smart Cards and Biometrics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advancement in communication technology provides a scalable platform for\nvarious services where a remote user can access the server from anywhere\nwithout moving from its place. It has provided a unique opportunity for online\nservices, such that the user need not physically present at the service center.\nThese services adopt authentication and key agreement protocols to ensure\nauthorized and secure access to resources. Most of the authentication schemes\nsupport single server environment where the user has to register with each\nserver. If a user wishes to access multiple application servers, he requires to\nregister with each of the servers. Although multi-server authentication schemes\nintroduced a scalable platform such that a user can interact with any server\nusing single registration. Recently, Chuang and Chen proposed an efficient\nmulti-server authenticated key agreement scheme based on smart cards along with\npassword and biometrics. This is a lightweight authentication scheme which\nrequires the computation of only hash function. In this article, we present a\nbrief review of Chuang and Chen's scheme. We analyze Chuang and Chen's scheme\nand identify that their scheme does not resist stolen smart card attack which\ncauses the user's impersonation attack, server spoofing attack and man-in-the\nmiddle attack. Additionally, we show that their scheme has a weak key agreement\nprotocol, which does not ensure forward secrecy.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2014 04:29:25 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Mishra", "Dheerendra", ""]]}, {"id": "1401.4872", "submitter": "Ayman Bahaa-Eldin", "authors": "Hany Nashat Gabra, Ayman Mohammad Bahaa-Eldin, Huda Korashy", "title": "Classification of IDS Alerts with Data Mining Techniques", "comments": "2012 International Conference on Internet Study (NETs2012), Bangkok,\n  Thailand", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DB cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A data mining technique to reduce the amount of false alerts within an IDS\nsystem is proposed. The new technique achieves an accuracy of 99% compared to\n97% by the current systems.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2014 11:58:23 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Gabra", "Hany Nashat", ""], ["Bahaa-Eldin", "Ayman Mohammad", ""], ["Korashy", "Huda", ""]]}, {"id": "1401.4917", "submitter": "Philipp Winter", "authors": "Philipp Winter and Stefan Lindskog", "title": "Spoiled Onions: Exposing Malicious Tor Exit Relays", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several hundred Tor exit relays together push more than 1 GiB/s of network\ntraffic. However, it is easy for exit relays to snoop and tamper with\nanonymised network traffic and as all relays are run by independent volunteers,\nnot all of them are innocuous.\n  In this paper, we seek to expose malicious exit relays and document their\nactions. First, we monitored the Tor network after developing a fast and\nmodular exit relay scanner. We implemented several scanning modules for\ndetecting common attacks and used them to probe all exit relays over a period\nof four months. We discovered numerous malicious exit relays engaging in\ndifferent attacks. To reduce the attack surface users are exposed to, we\nfurther discuss the design and implementation of a browser extension patch\nwhich fetches and compares suspicious X.509 certificates over independent Tor\ncircuits.\n  Our work makes it possible to continuously monitor Tor exit relays. We are\nable to detect and thwart many man-in-the-middle attacks which makes the\nnetwork safer for its users. All our code is available under a free license.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2014 14:31:24 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Winter", "Philipp", ""], ["Lindskog", "Stefan", ""]]}, {"id": "1401.5688", "submitter": "Thijs Laarhoven", "authors": "Thijs Laarhoven", "title": "Capacities and Capacity-Achieving Decoders for Various Fingerprinting\n  Games", "comments": "13 pages, 2 figures", "journal-ref": "ACM Workshop on Information Hiding and Multimedia Security\n  (IH&MMSec), pp. 123-134, 2014", "doi": "10.1145/2600918.2600925", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Combining an information-theoretic approach to fingerprinting with a more\nconstructive, statistical approach, we derive new results on the fingerprinting\ncapacities for various informed settings, as well as new log-likelihood\ndecoders with provable code lengths that asymptotically match these capacities.\nThe simple decoder built against the interleaving attack is further shown to\nachieve the simple capacity for unknown attacks, and is argued to be an\nimproved version of the recently proposed decoder of Oosterwijk et al. With\nthis new universal decoder, cut-offs on the bias distribution function can\nfinally be dismissed.\n  Besides the application of these results to fingerprinting, a direct\nconsequence of our results to group testing is that (i) a simple decoder\nasymptotically requires a factor 1.44 more tests to find defectives than a\njoint decoder, and (ii) the simple decoder presented in this paper provably\nachieves this bound.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2014 14:47:37 GMT"}, {"version": "v2", "created": "Wed, 5 Feb 2014 13:26:25 GMT"}, {"version": "v3", "created": "Wed, 2 Apr 2014 15:18:12 GMT"}], "update_date": "2014-12-30", "authors_parsed": [["Laarhoven", "Thijs", ""]]}, {"id": "1401.5775", "submitter": "Tobias Kuhn", "authors": "Tobias Kuhn, Michel Dumontier", "title": "Trusty URIs: Verifiable, Immutable, and Permanent Digital Artifacts for\n  Linked Data", "comments": "Small error corrected in the text (table data was correct) on page\n  13: \"All average values are below 0.8s (0.03s for batch mode). Using Java in\n  batch mode even requires only 1ms per file.\"", "journal-ref": "Proceedings of The Semantic Web: Trends and Challenges, 11th\n  International Conference, ESWC 2014, Springer", "doi": "10.1007/978-3-319-07443-6_27", "report-no": null, "categories": "cs.CR cs.DL cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  To make digital resources on the web verifiable, immutable, and permanent, we\npropose a technique to include cryptographic hash values in URIs. We call them\ntrusty URIs and we show how they can be used for approaches like\nnanopublications to make not only specific resources but their entire reference\ntrees verifiable. Digital artifacts can be identified not only on the byte\nlevel but on more abstract levels such as RDF graphs, which means that\nresources keep their hash values even when presented in a different format. Our\napproach sticks to the core principles of the web, namely openness and\ndecentralized architecture, is fully compatible with existing standards and\nprotocols, and can therefore be used right away. Evaluation of our reference\nimplementations shows that these desired properties are indeed accomplished by\nour approach, and that it remains practical even for very large files.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jan 2014 14:23:43 GMT"}, {"version": "v2", "created": "Fri, 7 Mar 2014 09:29:16 GMT"}, {"version": "v3", "created": "Wed, 28 May 2014 14:50:55 GMT"}], "update_date": "2014-05-29", "authors_parsed": [["Kuhn", "Tobias", ""], ["Dumontier", "Michel", ""]]}, {"id": "1401.5787", "submitter": "Yeray Cachon  YC", "authors": "Yeray Cachon Santana", "title": "Orthogonal Matrix in Cryptography", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work is proposed a method using orthogonal matrix transform\nproperties to encrypt and decrypt a message. It will be showed how to use\nmatrix functions to create complex encryptions. Because orthogonal matrix are\nalways diagonalizable on R, and the exponential of a diagonal matrix is easy to\ncompute, the exponential of orthogonal matrix will be used to encrypt text\nmessages.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jan 2014 20:56:01 GMT"}, {"version": "v2", "created": "Sun, 26 Jan 2014 14:16:12 GMT"}], "update_date": "2014-01-28", "authors_parsed": [["Santana", "Yeray Cachon", ""]]}, {"id": "1401.5895", "submitter": "Yohei Watanabe", "authors": "Yohei Watanabe, Junji Shikata", "title": "Timed-Release Secret Sharing Scheme with Information Theoretic Security", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In modern cryptography, the secret sharing scheme is an important\ncryptographic primitive and it is used in various situations. In this paper, a\ntimed-release secret sharing scheme (TR-SS) with information-theoretic security\nis first studied. TR-SS is a secret sharing scheme with the property that\nparticipants more than a threshold number can reconstruct a secret by using\ntheir shares only when the time specified by a dealer has come. Specifically,\nin this paper we first introduce a model and formalization of security for\nTR-SS based on the traditional secret sharing scheme and information-theoretic\ntimed-release security. We also derive tight lower bounds on the sizes of\nshares, time-signals, and entities' secret-keys required for TR-SS. In\naddition, we propose a direct construction for TR-SS. Our direct construction\nis optimal in the sense that the construction meets equality in each of our\nbounds. As a result, it is shown that the timed-release security can be\nrealized without any additional redundancy on the share-size.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2014 09:05:28 GMT"}, {"version": "v2", "created": "Sun, 26 Jan 2014 04:09:27 GMT"}, {"version": "v3", "created": "Sun, 11 May 2014 19:31:53 GMT"}], "update_date": "2014-05-13", "authors_parsed": [["Watanabe", "Yohei", ""], ["Shikata", "Junji", ""]]}, {"id": "1401.5896", "submitter": "Mitsugu Iwamoto", "authors": "Mitsugu Iwamoto, Junji Shikata", "title": "Secret Sharing Schemes Based on Min-Entropies", "comments": "7 pages, This is the full version of the paper to appear at IEEE\n  ISIT2014", "journal-ref": null, "doi": "10.1109/ISIT.2014.6874863", "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fundamental results on secret sharing schemes (SSSs) are discussed in the\nsetting where security and share size are measured by (conditional)\nmin-entropies.\n  We first formalize a unified framework of SSSs based on (conditional) R\\'enyi\nentropies, which includes SSSs based on Shannon and min entropies etc. as\nspecial cases. By deriving the lower bound of share sizes in terms of R\\'enyi\nentropies based on the technique introduced by Iwamoto-Shikata, we obtain the\nlower bounds of share sizes measured by min entropies as well as by Shannon\nentropies in a unified manner.\n  As the main contributions of this paper, we show two existential results of\nnon-perfect SSSs based on min-entropies under several important settings. We\nfirst show that there exists a non-perfect SSS for arbitrary binary secret\ninformation and arbitrary monotone access structure. In addition, for every\nintegers $k$ and $n$ ($k \\le n$), we prove that the ideal non-perfect\n$(k,n)$-threshold scheme exists even if the distribution of the secret is not\nuniformly distributed.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2014 09:08:06 GMT"}, {"version": "v2", "created": "Sun, 26 Jan 2014 02:22:00 GMT"}, {"version": "v3", "created": "Mon, 28 Apr 2014 15:51:46 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Iwamoto", "Mitsugu", ""], ["Shikata", "Junji", ""]]}, {"id": "1401.6022", "submitter": "Rishab Nithyanand", "authors": "Xiang Cai, Rishab Nithyanand, and Rob Johnson", "title": "New Approaches to Website Fingerprinting Defenses", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Website fingerprinting attacks enable an adversary to infer which website a\nvictim is visiting, even if the victim uses an encrypting proxy, such as Tor.\nPrevious work has shown that all proposed defenses against website\nfingerprinting attacks are ineffective.\n  This paper advances the study of website fingerprinting attacks and defenses\nin two ways. First, we develop bounds on the trade-off between security and\nbandwidth overhead that any fingerprinting defense scheme can achieve. This\nenables us to compare schemes with different security/overhead trade-offs by\ncomparing how close they are to the lower bound. We then refine, implement, and\nevaluate the Congestion Sensitive BuFLO scheme outlined by Cai, et al.\nCS-BuFLO, which is based on the provably-secure BuFLO defense proposed by Dyer,\net al., was not fully-specified by Cai, et al, but has nonetheless attracted\nthe attention of the Tor developers. Our experiments find that CS-BuFLO has\nhigh overhead (around 2.3-2.8x) but can get 6x closer to the bandwidth/security\ntrade-off lower bound than Tor or plain SSH.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2014 15:55:20 GMT"}], "update_date": "2014-01-24", "authors_parsed": [["Cai", "Xiang", ""], ["Nithyanand", "Rishab", ""], ["Johnson", "Rob", ""]]}, {"id": "1401.6087", "submitter": "Prerana Sharma", "authors": "Prerana Sharma", "title": "Efficient Image Encryption and Decryption Using Discrete Wavelet\n  Transform and Fractional Fourier Transform", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT cs.MM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fractional Fourier transform and chaos functions play a key role in many of\nencryption-decryption algorithms. In this work performance of image\nencryption-decryption algorithms is quantified and compared using the\ncomputation time i.e. the time consumption of encryption-decryption process and\nresemblance of input image to the restored image, quantified by MSE. This work\nproposes an improvement in computation-time of image encryptiondecryption\nalgorithms by utilizing image compression properties of the 2-dimensional\nDiscrete Wavelet Transform (DWT2). Initially, computation complexity of the\nalgorithms is evaluated and compared with that of existing algorithms. This\nanalysis claims the proposed algorithms to be nearly 8 times faster than the\nexisting algorithms. Further, simulations are performed using MATLAB7.7 to\nquantify performance of existing algorithms and the proposed algorithms using\nMSE and computation time. The results obtained in these simulations prove that\nfor the proposed algorithms MSE between restored and original images is lesser\nthan that of existing algorithms thereby maintaining the robustness of the\nexisting algorithms. These algorithms are found sensitive to a variation of\n1x10-1 in the fractional orders used in encryption-decryption process.\n", "versions": [{"version": "v1", "created": "Sat, 14 Dec 2013 13:44:37 GMT"}], "update_date": "2014-01-24", "authors_parsed": [["Sharma", "Prerana", ""]]}, {"id": "1401.6118", "submitter": "Smita Nirkhi", "authors": "Smita Nirkhi, R.V. Dharaskar", "title": "Comparative study of Authorship Identification Techniques for Cyber\n  Forensics Analysis", "comments": null, "journal-ref": "published 2013", "doi": null, "report-no": null, "categories": "cs.CY cs.CR cs.IR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Authorship Identification techniques are used to identify the most\nappropriate author from group of potential suspects of online messages and find\nevidences to support the conclusion. Cybercriminals make misuse of online\ncommunication for sending blackmail or a spam email and then attempt to hide\ntheir true identities to void detection.Authorship Identification of online\nmessages is the contemporary research issue for identity tracing in cyber\nforensics. This is highly interdisciplinary area as it takes advantage of\nmachine learning, information retrieval, and natural language processing. In\nthis paper, a study of recent techniques and automated approaches to\nattributing authorship of online messages is presented. The focus of this\nreview study is to summarize all existing authorship identification techniques\nused in literature to identify authors of online messages. Also it discusses\nevaluation criteria and parameters for authorship attribution studies and list\nopen questions that will attract future work in this area.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 10:40:00 GMT"}], "update_date": "2014-02-20", "authors_parsed": [["Nirkhi", "Smita", ""], ["Dharaskar", "R. V.", ""]]}, {"id": "1401.6120", "submitter": "Aurelien Thierry", "authors": "Guillaume Bonfante (INRIA Nancy - Grand Est / LORIA), Jean-Yves Marion\n  (INRIA Nancy - Grand Est / LORIA), Fabrice Sabatier (INRIA Nancy - Grand Est\n  / LORIA), Aur\\'elien Thierry (INRIA Nancy - Grand Est / LORIA)", "title": "Analysis and Diversion of Duqu's Driver", "comments": "Malware 2013 - 8th International Conference on Malicious and Unwanted\n  Software (2013)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The propagation techniques and the payload of Duqu have been closely studied\nover the past year and it has been said that Duqu shared functionalities with\nStuxnet. We focused on the driver used by Duqu during the infection, our\ncontribution consists in reverse-engineering the driver: we rebuilt its source\ncode and analyzed the mechanisms it uses to execute the payload while avoiding\ndetection. Then we diverted the driver into a defensive version capable of\ndetecting injections in Windows binaries, thus preventing further attacks. We\nspecifically show how Duqu's modified driver would have detected Duqu.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jan 2014 12:43:09 GMT"}], "update_date": "2014-01-24", "authors_parsed": [["Bonfante", "Guillaume", "", "INRIA Nancy - Grand Est / LORIA"], ["Marion", "Jean-Yves", "", "INRIA Nancy - Grand Est / LORIA"], ["Sabatier", "Fabrice", "", "INRIA Nancy - Grand Est\n  / LORIA"], ["Thierry", "Aurélien", "", "INRIA Nancy - Grand Est / LORIA"]]}, {"id": "1401.6121", "submitter": "Chandra Sekhar Mr", "authors": "Vorugunti Chandra Sekhar, Mrudula Sarvabhatla", "title": "A Robust Password-Based Multi-Server Authentication Scheme", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 2013, Tsai et al. cryptanalyzed Yeh et al. scheme and shown that Yeh et\nal., scheme is vulnerable to various cryptographic attacks and proposed an\nimproved scheme. In this poster we will show that Tsai et al., scheme is also\nvulnerable to undetectable online password guessing attack, on success of the\nattack, the adversary can perform all major cryptographic attacks. As apart of\nour contribution, we have proposed an improved scheme which overcomes the\ndefects in Tsai et al. and Yeh et al. schemes.\n", "versions": [{"version": "v1", "created": "Sat, 7 Dec 2013 03:48:11 GMT"}], "update_date": "2014-01-24", "authors_parsed": [["Sekhar", "Vorugunti Chandra", ""], ["Sarvabhatla", "Mrudula", ""]]}, {"id": "1401.6123", "submitter": "Yin Chen", "authors": "Jinxiao Zhu and Yin Chen and Yulong Shen and Osamu Takahashi and\n  Xiaohong Jiang and Norio Shiratori", "title": "Secrecy Transmission Capacity in Noisy Wireless Ad Hoc Networks", "comments": "26 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the transmission of confidential messages over noisy\nwireless ad hoc networks, where both background noise and interference from\nconcurrent transmitters affect the received signals. For the random networks\nwhere the legitimate nodes and the eavesdroppers are distributed as Poisson\npoint processes, we study the secrecy transmission capacity (STC), as well as\nthe connection outage probability and secrecy outage probability, based on the\nphysical layer security. We first consider the basic fixed transmission\ndistance model, and establish a theoretical model of the STC. We then extend\nthe above results to a more realistic random distance transmission model,\nnamely nearest receiver transmission. Finally, extensive simulation and\nnumerical results are provided to validate the efficiency of our theoretical\nresults and illustrate how the STC is affected by noise, connection and secrecy\noutage probabilities, transmitter and eavesdropper densities, and other system\nparameters. Remarkably, our results reveal that a proper amount of noise is\nhelpful to the secrecy transmission capacity.\n", "versions": [{"version": "v1", "created": "Fri, 20 Dec 2013 09:26:33 GMT"}], "update_date": "2014-01-24", "authors_parsed": [["Zhu", "Jinxiao", ""], ["Chen", "Yin", ""], ["Shen", "Yulong", ""], ["Takahashi", "Osamu", ""], ["Jiang", "Xiaohong", ""], ["Shiratori", "Norio", ""]]}, {"id": "1401.6226", "submitter": "Tunji Adebiyi", "authors": "Adetunji Adebiyi, Chris Imafidon", "title": "Using Neural Network to Propose Solutions to Threats in Attack Patterns", "comments": "11 Pages", "journal-ref": "International Journal of Soft Computing and Software Engineering\n  [JSCSE], Vol. 3, No. 1, 2013", "doi": "10.7321/jscse.v3.n1.1", "report-no": null, "categories": "cs.CR cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last decade, a lot of effort has been put into securing software\napplication during development in the software industry. Software security is a\nresearch field in this area which looks at how security can be weaved into\nsoftware at each phase of software development lifecycle (SDLC). The use of\nattack patterns is one of the approaches that have been proposed for\nintegrating security during the design phase of SDLC. While this approach help\ndevelopers in identify security flaws in their software designs, the need to\napply the proper security capability that will mitigate the threat identified\nis very important. To assist in this area, the uses of security patterns have\nbeen proposed to help developers to identify solutions to recurring security\nproblems. However due to different types of security patterns and their\ntaxonomy, software developers are faced with the challenge of finding and\nselecting appropriate security patterns that addresses the security risks in\ntheir design. In this paper, we propose a tool based on Neural Network for\nproposing solutions in form of security patterns to threats in attack patterns\nmatching attacking patterns. From the result of performance of the neural\nnetwork, we found out that the neural network was able to match attack patterns\nto security patterns that can mitigate the threat in the attack pattern. With\nthis information developers are better informed in making decision on the\nsolution for securing their application.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2014 00:42:53 GMT"}], "update_date": "2014-01-27", "authors_parsed": [["Adebiyi", "Adetunji", ""], ["Imafidon", "Chris", ""]]}, {"id": "1401.6290", "submitter": "Ghazal Riahi", "authors": "Ghazal Riahi", "title": "A Security Plan for Smart Grid Systems Based On AGC4ISR", "comments": "The International Journal of Soft Computing and Software Engineering\n  [JSCSE], Vol. 3, No. 3, Special Issue", "journal-ref": "International Journal of Soft Computing and Software Engineering\n  [JSCSE], Vol. 3, No. 3, 2013 pp.760-768", "doi": "10.7321/jscse.v3.n3.115", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is proposed a security plan for Smart Grid Systems based on\nAGC4ISR which is an architecture for Autonomic Grid Computing Systems. Smart\nGrid incorporates has many benefits of distributed computing and communications\nto deliver a real-time information and enable the near-instantaneous balance of\nsupply and demand at the device level. AGC4ISR architecture is Organized by\nAutonomic Grid Computing and C4ISR (Command, Control, Communications, Computers\nand Intelligence, Surveillance, & Reconnaissance) Architecture. In this paper\nwe will present a solution for as security plan which will be consider\nencryption, intrusion detection, key management and detail of cyber security in\nSmart Grids. In this paper we use the cryptography for the packet in the C4ISR\nand we use a key management for send and receive a packet in the smart grid\nbecause it is necessary for intelligent networks to keeping away from packet\nmissing.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2014 09:08:30 GMT"}], "update_date": "2014-01-27", "authors_parsed": [["Riahi", "Ghazal", ""]]}, {"id": "1401.6317", "submitter": "Muhammad Aamir", "authors": "Muhammad Aamir and Mustafa Ali Zaidi", "title": "DDoS Attack and Defense: Review of Some Traditional and Current\n  Techniques", "comments": "This paper is being withdrawn by the author due to a critical signing\n  mistake in equation 5", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed Denial of Service (DDoS) attacks exhaust victim's bandwidth or\nservices. Traditional architecture of Internet is vulnerable to DDoS attacks\nand an ongoing cycle of attack & defense is observed. In this paper, different\ntypes and techniques of DDoS attacks and their countermeasures are reviewed.\nThe significance of this paper is the coverage of many aspects of countering\nDDoS attacks including new research on the topic. We survey different papers\ndescribing methods of defense against DDoS attacks based on entropy variations,\ntraffic anomaly parameters, neural networks, device level defense, botnet flux\nidentifications and application layer DDoS defense. We also discuss some\ntraditional methods of defense such as traceback and packet filtering\ntechniques so that readers can identify major differences between traditional\nand current techniques of defense against DDoS attacks. Before the discussion\non countermeasures, we mention different attack types under DDoS with\ntraditional and advanced schemes while some information on DDoS trends in the\nyear 2012 Quarter-1 is also provided. We identify that application layer DDoS\nattacks possess the ability to produce greater impact on the victim as they are\ndriven by legitimate-like traffic making it quite difficult to identify and\ndistinguish from legitimate requests. The need of improved defense against such\nattacks is therefore more demanding in research. The study conducted in this\npaper can be helpful for readers and researchers to recognize better techniques\nof defense in current times against DDoS attacks and contribute with more\nresearch on the topic in the light of future challenges identified in this\npaper.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2014 11:43:28 GMT"}, {"version": "v2", "created": "Fri, 21 Mar 2014 19:36:21 GMT"}], "update_date": "2014-03-24", "authors_parsed": [["Aamir", "Muhammad", ""], ["Zaidi", "Mustafa Ali", ""]]}, {"id": "1401.6375", "submitter": "Haipeng Zhang Ph.D.", "authors": "Yixin Liu, Haipeng Zhang, Tao Feng", "title": "Design of an Encryption-Decryption Module Oriented for Internet\n  Information Security SOC Design", "comments": "11 pages, 5 figures, 4 tables, 14 references", "journal-ref": "International Journal of Soft Computing And Software Engineering\n  (JSCSE),Vol.2,No.7, 2012", "doi": "10.7321/jscse.v2.n7.3", "report-no": null, "categories": "cs.AR cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In order to protect the security of network data, a high speed chip module\nfor encrypting and decrypting of network data packet is designed. The chip\nmodule is oriented for internet information security SOC (System on Chip)\ndesign. During the design process, AES (Advanced Encryption Standard) and 3DES\n(Data Encryption Standard) encryption algorithm are adopted to protect the\nsecurity of network data. The following points are focused: (1) The SOC (System\non Chip) design methodology based on IP (Intellectual Property) core is used.\nAES (Advanced Encryption Standard) and 3DES (Data Encryption Standard) IP\n(Intellectual Property) cores are embedded in the chip module, peripheral\ncontrol sub-modules are designed to control the encryption-decryption module,\nwhich is capable of shortening the design period of the chip module. (2) The\nimplementation of encryption-decryption with hardware was presented, which\nimproves the safety of data through the encryption-decryption chip and reduce\nthe load of CPU. (3) In our hardware solution, two AES (Advanced Encryption\nStandard) cores are used to work in parallel, which improves the speed of the\nencryption module. Moreover, the key length of AES (Advanced Encryption\nStandard) encryption algorithm is designed with three optional configurations\nat 128 bits, 256 bits and 192 bits respectively and six optional encryption\nalgorithm modes: CBC (Cipher Block Chaining) mode, ECB (Electronic Code Book)\nmode, GCM (Galois/Counter Mode) mode, XTS(cipherteXT Stealing) mode, CTR\n(CounTeR) mode and 3DES respectively, which adds the flexibility to its\napplications.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2014 15:29:06 GMT"}], "update_date": "2014-01-27", "authors_parsed": [["Liu", "Yixin", ""], ["Zhang", "Haipeng", ""], ["Feng", "Tao", ""]]}, {"id": "1401.6379", "submitter": "Nyagudi Musandu Nyagudi", "authors": "Nyagudi Musandu Nyagudi", "title": "Post-Westgate SWAT : C4ISTAR Architectural Framework for Autonomous\n  Network Integrated Multifaceted Warfighting Solutions Version 1.0 : A\n  Peer-Reviewed Monograph", "comments": "52 pages, 6 Figures, over 40 references, reviewed by a reader", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Police SWAT teams and Military Special Forces face mounting pressure and\nchallenges from adversaries that can only be resolved by way of ever more\nsophisticated inputs into tactical operations. Lethal Autonomy provides\nconstrained military/security forces with a viable option, but only if\nimplementation has got proper empirically supported foundations. Autonomous\nweapon systems can be designed and developed to conduct ground, air and naval\noperations. This monograph offers some insights into the challenges of\ndeveloping legal, reliable and ethical forms of autonomous weapons, that\naddress the gap between Police or Law Enforcement and Military operations that\nis growing exponentially small. National adversaries are today in many\ninstances hybrid threats, that manifest criminal and military traits, these\noften require deployment of hybrid-capability autonomous weapons imbued with\nthe capability to taken on both Military and/or Security objectives. The\nWestgate Terrorist Attack of 21st September 2013 in the Westlands suburb of\nNairobi, Kenya is a very clear manifestation of the hybrid combat scenario that\nrequired military response and police investigations against a fighting cell of\nthe Somalia based globally networked Al Shabaab terrorist group.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2013 16:04:48 GMT"}, {"version": "v2", "created": "Mon, 27 Jan 2014 09:47:05 GMT"}], "update_date": "2014-01-28", "authors_parsed": [["Nyagudi", "Nyagudi Musandu", ""]]}, {"id": "1401.6444", "submitter": "William Glisson", "authors": "Karl-Johan Karlsson, William Bradley Glisson", "title": "Android Anti-forensics: Modifying CyanogenMod", "comments": "Karlsson, K.-J. and W.B. Glisson, Android Anti-forensics: Modifying\n  CyanogenMod in Hawaii International Conference on System Sciences (HICSS-47).\n  2014, IEEE Computer Society Press: Hawaii", "journal-ref": null, "doi": "10.1109/HICSS.2014.593", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile devices implementing Android operating systems inherently create\nopportunities to present environments that are conducive to anti-forensic\nactivities. Previous mobile forensics research focused on applications and data\nhiding anti-forensics solutions. In this work, a set of modifications were\ndeveloped and implemented on a CyanogenMod community distribution of the\nAndroid operating system. The execution of these solutions successfully\nprevented data extractions, blocked the installation of forensic tools, created\nextraction delays and presented false data to industry accepted forensic\nanalysis tools without impacting normal use of the device. The research\ncontribution is an initial empirical analysis of the viability of operating\nsystem modifications in an anti-forensics context along with providing the\nfoundation for future research.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2014 20:23:05 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Karlsson", "Karl-Johan", ""], ["Glisson", "William Bradley", ""]]}, {"id": "1401.6488", "submitter": "Dusko Pavlovic", "authors": "Dusko Pavlovic", "title": "Chasing diagrams in cryptography", "comments": "17 pages, 4 figures; to appear in: 'Categories in Logic, Language and\n  Physics. Festschrift on the occasion of Jim Lambek's 90th birthday', Claudia\n  Casadio, Bob Coecke, Michael Moortgat, and Philip Scott (editors); this\n  version: fixed typos found by kind readers", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cryptography is a theory of secret functions. Category theory is a general\ntheory of functions. Cryptography has reached a stage where its structures\noften take several pages to define, and its formulas sometimes run from page to\npage. Category theory has some complicated definitions as well, but one of its\nspecialties is taming the flood of structure. Cryptography seems to be in need\nof high level methods, whereas category theory always needs concrete\napplications. So why is there no categorical cryptography? One reason may be\nthat the foundations of modern cryptography are built from probabilistic\npolynomial-time Turing machines, and category theory does not have a good\nhandle on such things. On the other hand, such foundational problems might be\nthe very reason why cryptographic constructions often resemble low level\nmachine programming. I present some preliminary explorations towards\ncategorical cryptography. It turns out that some of the main security concepts\nare easily characterized through the categorical technique of *diagram\nchasing*, which was first used Lambek's seminal `Lecture Notes on Rings and\nModules'.\n", "versions": [{"version": "v1", "created": "Sat, 25 Jan 2014 02:21:38 GMT"}, {"version": "v2", "created": "Mon, 7 Nov 2016 23:01:50 GMT"}], "update_date": "2016-11-09", "authors_parsed": [["Pavlovic", "Dusko", ""]]}, {"id": "1401.6604", "submitter": "Baofeng Wu", "authors": "Baofeng Wu, Qingfang Jin, Zhuojun Liu, Dongdai Lin", "title": "Constructing Boolean Functions With Potential Optimal Algebraic Immunity\n  Based on Additive Decompositions of Finite Fields", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a general approach to construct cryptographic significant Boolean\nfunctions of $(r+1)m$ variables based on the additive decomposition\n$\\mathbb{F}_{2^{rm}}\\times\\mathbb{F}_{2^m}$ of the finite field\n$\\mathbb{F}_{2^{(r+1)m}}$, where $r$ is odd and $m\\geq3$. A class of unbalanced\nfunctions are constructed first via this approach, which coincides with a\nvariant of the unbalanced class of generalized Tu-Deng functions in the case\n$r=1$. This class of functions have high algebraic degree, but their algebraic\nimmunity does not exceeds $m$, which is impossible to be optimal when $r>1$. By\nmodifying these unbalanced functions, we obtain a class of balanced functions\nwhich have optimal algebraic degree and high nonlinearity (shown by a lower\nbound we prove). These functions have optimal algebraic immunity provided a\ncombinatorial conjecture on binary strings which generalizes the Tu-Deng\nconjecture is true. Computer investigations show that, at least for small\nvalues of number of variables, functions from this class also behave well\nagainst fast algebraic attacks.\n", "versions": [{"version": "v1", "created": "Sun, 26 Jan 2014 01:49:10 GMT"}], "update_date": "2014-01-28", "authors_parsed": [["Wu", "Baofeng", ""], ["Jin", "Qingfang", ""], ["Liu", "Zhuojun", ""], ["Lin", "Dongdai", ""]]}, {"id": "1401.6726", "submitter": "Earlence T Fernandes", "authors": "Earlence Fernandes, Alexander Crowell, Ajit Aluri and Atul Prakash", "title": "Anception: Application Virtualization For Android", "comments": "University of Michigan, Technical Report CSE-TR-583-13", "journal-ref": null, "doi": null, "report-no": "CSE-TR-583-13", "categories": "cs.CR cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of malware has become significant on Android devices. Library\noperating systems and application virtualization are both possible solutions\nfor confining malware. Unfortunately, such solutions do not exist for Android.\nDesigning mechanisms for application virtualization is a significant chal-\nlenge for several reasons: (1) graphics performance is important due to\npopularity of games and (2) applications with the same UID can share state.\nThis paper presents Anception, the first flexible application virtualization\nframework for Android. It is imple- mented as a modification to the Android\nkernel and supports application virtualization that addresses the above\nrequirements. Anception is able to confine many types of malware while\nsupporting unmodified Android applications. Our Anception- based system\nexhibits up to 3.9% overhead on various 2D/3D benchmarks, and 1.8% overhead on\nthe SunSpider benchmark.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jan 2014 03:01:33 GMT"}], "update_date": "2014-01-28", "authors_parsed": [["Fernandes", "Earlence", ""], ["Crowell", "Alexander", ""], ["Aluri", "Ajit", ""], ["Prakash", "Atul", ""]]}, {"id": "1401.6790", "submitter": "Arsenia Chorti", "authors": "Arsenia Chorti, Katerina Papadaki, H. Vincent Poor", "title": "Optimal Power Allocation in Block Fading Gaussian Channels with Causal\n  CSI and Secrecy Constraints", "comments": "submitted to ISIT 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The optimal power allocation that maximizes the secrecy capacity of block\nfading Gaussian (BF-Gaussian) networks with causal channel state information\n(CSI), M-block delay tolerance and a frame based power constraint is examined.\nIn particular, we formulate the secrecy capacity maximization as a dynamic\nprogram. We propose suitable linear approximations of the secrecy capacity\ndensity in the low SNR, the high SNR and the intermediate SNR regimes,\naccording to the overall available power budget. Our findings indicate that\nwhen the available power resources are very low (low SNR case) the optimal\nstrategy is a threshold policy. On the other hand when the available power\nbudget is infinite (high SNR case) a constant power policy maximizes the frame\nsecrecy capacity. Finally, when the power budget is finite (medium SNR case),\nan approximate tractable power allocation policy is derived.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jan 2014 10:17:04 GMT"}], "update_date": "2014-01-28", "authors_parsed": [["Chorti", "Arsenia", ""], ["Papadaki", "Katerina", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1401.6988", "submitter": "Marcos Portnoi", "authors": "Marcos Portnoi", "title": "Criptografia com Curvas El\\'ipticas", "comments": "Portuguese, 14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents an overview of the use of elliptic curves in\ncryptography. The security of this cryptosystem is based on the discrete\nlogarithm problem, which appears to be much harder compared to the discrete\nlogarithm problem in other cryptosystems. An overview of common cryptosystems\nis given, such as Diffie-Hellman and RSA, and an elliptic curve cryptography\nscheme is discussed.\n  --------\n  Este trabalho apresenta o uso das curvas el\\'ipticas em criptografia. Sua\nseguran\\c{c}a est\\'a baseada no problema do logaritmo discreto. Este problema\naparentemente \\'e significativamente mais dif\\'icil de resolver, comparado com\no problema do logaritmo discreto usado por outros sistemas de criptografia. \\'E\ndada uma vis\\~ao geral de sistemas de criptografia comuns, como Diffie-Hellman\ne RSA, e discute-se um esquema de criptografia usando curvas el\\'ipticas.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jan 2014 20:15:17 GMT"}], "update_date": "2014-01-28", "authors_parsed": [["Portnoi", "Marcos", ""]]}, {"id": "1401.7360", "submitter": "Eun Jee Lee", "authors": "Eun Jee Lee and Emmanuel Abbe", "title": "A Shannon Approach to Secure Multi-party Computations", "comments": null, "journal-ref": "52nd Annual Allerton Conference on. IEEE (2014) 1287-1293", "doi": "10.1109/ALLERTON.2014.7028604", "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In secure multi-party computations (SMC), parties wish to compute a function\non their private data without revealing more information about their data than\nwhat the function reveals. In this paper, we investigate two Shannon-type\nquestions on this problem. We first consider the traditional one-shot model for\nSMC which does not assume a probabilistic prior on the data. In this model,\nprivate communication and randomness are the key enablers to secure computing,\nand we investigate a notion of randomness cost and capacity. We then move to a\nprobabilistic model for the data, and propose a Shannon model for discrete\nmemoryless SMC. In this model, correlations among data are the key enablers for\nsecure computing, and we investigate a notion of dependency which permits the\nsecure computation of a function. While the models and questions are general,\nthis paper focuses on summation functions, and relies on polar code\nconstructions.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jan 2014 22:43:57 GMT"}, {"version": "v2", "created": "Thu, 13 Feb 2014 02:13:18 GMT"}, {"version": "v3", "created": "Wed, 26 Mar 2014 04:07:06 GMT"}], "update_date": "2017-05-25", "authors_parsed": [["Lee", "Eun Jee", ""], ["Abbe", "Emmanuel", ""]]}, {"id": "1401.7444", "submitter": "Yossi Gilad", "authors": "Yossi Gilad, Amir Herzberg, Ari Trachtenberg", "title": "Securing Smartphones: A Micro-TCB Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As mobile phones have evolved into `smartphones', with complex operating\nsystems running third- party software, they have become increasingly vulnerable\nto malicious applications (malware). We introduce a new design for mitigating\nmalware attacks against smartphone users, based on a small trusted computing\nbase module, denoted uTCB. The uTCB manages sensitive data and sensors, and\nprovides core services to applications, independently of the operating system.\nThe user invokes uTCB using a simple secure attention key, which is pressed in\norder to validate physical possession of the device and authorize a sensitive\naction; this protects private information even if the device is infected with\nmalware. We present a proof-of-concept implementation of uTCB based on ARM's\nTrustZone, a secure execution environment increasingly found in smartphones,\nand evaluate our implementation using simulations.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2014 09:20:53 GMT"}], "update_date": "2014-01-30", "authors_parsed": [["Gilad", "Yossi", ""], ["Herzberg", "Amir", ""], ["Trachtenberg", "Ari", ""]]}, {"id": "1401.7471", "submitter": "Massimo Cafaro", "authors": "Massimo Cafaro and Piergiuseppe Pell\\`e", "title": "Space-efficient Verifiable Secret Sharing Using Polynomial Interpolation", "comments": "Accepted for publication. To appear in IEEE Transactions on Cloud\n  Computing", "journal-ref": null, "doi": "10.1109/TCC.2015.2396072", "report-no": null, "categories": "cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Preserving data confidentiality in clouds is a key issue. Secret Sharing, a\ncryptographic primitive for the distribution of a secret among a group of $n$\nparticipants designed so that only subsets of shareholders of cardinality $0 <\nt \\leq n$ are allowed to reconstruct the secret by pooling their shares, can\nhelp mitigating and minimizing the problem. A desirable feature of Secret\nSharing schemes is cheater detection, i.e. the ability to detect one or more\nmalicious shareholders trying to reconstruct the secret by obtaining legal\nshares from the other shareholders while providing them with fake shares.\nVerifiable Secret Sharing schemes solve this problem by allowing shareholders\nverifying the others' shares. We present new verification algorithms providing\narbitrary secret sharing schemes with cheater detection capabilities, and prove\ntheir space efficiency with regard to other schemes appeared in the literature.\nWe also introduce, in one of our schemes, the Exponentiating Polynomial Root\nProblem (EPRP), which is believed to be NP-Intermediate and therefore\ndifficult.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2014 11:03:33 GMT"}, {"version": "v2", "created": "Fri, 12 Sep 2014 10:17:42 GMT"}, {"version": "v3", "created": "Wed, 3 Dec 2014 16:33:04 GMT"}, {"version": "v4", "created": "Mon, 22 Dec 2014 16:06:31 GMT"}, {"version": "v5", "created": "Mon, 16 Feb 2015 18:01:29 GMT"}, {"version": "v6", "created": "Thu, 3 Sep 2015 08:19:26 GMT"}], "update_date": "2015-09-04", "authors_parsed": [["Cafaro", "Massimo", ""], ["Pellè", "Piergiuseppe", ""]]}, {"id": "1401.7483", "submitter": "Pawel Krawczyk", "authors": "Pawel Krawczyk", "title": "Secure SAML validation to prevent XML signature wrapping attacks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  SAML assertions are becoming popular method for passing authentication and\nauthorisation information between identity providers and consumers using\nvarious single sign-on protocols. However their practical security strongly\ndepends on correct implementation, especially on the consumer side. Somorovsky\nand others have demonstrated a number of XML signature related vulnerabilities\nin SAML assertion validation frameworks. This article demonstrates how bad\nlibrary documentation and examples can lead to vulnerable consumer code and how\nthis can be avoided.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2014 12:13:19 GMT"}], "update_date": "2014-01-30", "authors_parsed": [["Krawczyk", "Pawel", ""]]}, {"id": "1401.7532", "submitter": "Ludo M.G.M. Tolhuizen", "authors": "Oscar Garcia-Morchon and Ronald Rietman and Ludo Tolhuizen and Domingo\n  Gomez and Jaime Gutierrez", "title": "The MMO problem", "comments": "Submitted to Interantaional Symposium on Symbolic and Algebraic\n  Computation (ISSAC) 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.RA cs.CR cs.SC math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a two polynomials analogue of the polynomial interpolation\nproblem. Namely, we consider the Mixing Modular Operations (MMO) problem of\nrecovering two polynomials $f\\in \\Z_p[x]$ and $g\\in \\Z_q[x]$ of known degree,\nwhere $p$ and $q$ are two (un)known positive integers, from the values of\n$f(t)\\bmod p + g(t)\\bmod q$ at polynomially many points $t \\in \\Z$. We show\nthat if $p$ and $q$ are known, the MMO problem is equivalent to computing a\nclose vector in a lattice with respect to the infinity norm. We also\nimplemented in the SAGE system a heuristic polynomial-time algorithm. If $p$\nand $q$ are kept secret, we do not know how to solve this problem. This problem\nis motivated by several potential cryptographic applications.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2014 15:07:28 GMT"}], "update_date": "2014-01-30", "authors_parsed": [["Garcia-Morchon", "Oscar", ""], ["Rietman", "Ronald", ""], ["Tolhuizen", "Ludo", ""], ["Gomez", "Domingo", ""], ["Gutierrez", "Jaime", ""]]}, {"id": "1401.7727", "submitter": "Benjamin Rubinstein", "authors": "Battista Biggio and Igino Corona and Blaine Nelson and Benjamin I. P.\n  Rubinstein and Davide Maiorca and Giorgio Fumera and Giorgio Giacinto and and\n  Fabio Roli", "title": "Security Evaluation of Support Vector Machines in Adversarial\n  Environments", "comments": "47 pages, 9 figures; chapter accepted into book 'Support Vector\n  Machine Applications'", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Support Vector Machines (SVMs) are among the most popular classification\ntechniques adopted in security applications like malware detection, intrusion\ndetection, and spam filtering. However, if SVMs are to be incorporated in\nreal-world security systems, they must be able to cope with attack patterns\nthat can either mislead the learning algorithm (poisoning), evade detection\n(evasion), or gain information about their internal parameters (privacy\nbreaches). The main contributions of this chapter are twofold. First, we\nintroduce a formal general framework for the empirical evaluation of the\nsecurity of machine-learning systems. Second, according to our framework, we\ndemonstrate the feasibility of evasion, poisoning and privacy attacks against\nSVMs in real-world security problems. For each attack technique, we evaluate\nits impact and discuss whether (and how) it can be countered through an\nadversary-aware design of SVMs. Our experiments are easily reproducible thanks\nto open-source code that we have made available, together with all the employed\ndatasets, on a public repository.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2014 03:37:18 GMT"}], "update_date": "2014-01-31", "authors_parsed": [["Biggio", "Battista", ""], ["Corona", "Igino", ""], ["Nelson", "Blaine", ""], ["Rubinstein", "Benjamin I. P.", ""], ["Maiorca", "Davide", ""], ["Fumera", "Giorgio", ""], ["Giacinto", "Giorgio", ""], ["Roli", "and Fabio", ""]]}, {"id": "1401.8064", "submitter": "Tanran Zhang", "authors": "Ben Niu, Tanran Zhang, Xiaoyan Zhu, Hui Li and Zongqing Lu", "title": "Priority-Aware Private Matching Schemes for Proximity-Based Mobile\n  Social Networks", "comments": "15 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid developments of mobile devices and online social networks have\nresulted in increasing attention to Mobile Social Networking (MSN). The\nexplosive growth of mobile-connected and location-aware devices makes it\npossible and meaningful to do the Proximity-based Mobile Social Networks\n(PMSNs). Users can discover and make new social interactions easily with\nphysical-proximate mobile users through WiFi/Bluetooth interfaces embedded in\ntheir smartphones. However, users enjoy these conveniences at the cost of their\ngrowing privacy concerns. To address this problem, we propose a suit of\npriority-aware private matching schemes to privately match the similarity with\npotential friends in the vicinity. Unlike most existing work, our proposed\npriority-aware matching scheme (P-match) achieves the privacy goal by combining\nthe commutative encryption function and the Tanimoto similarity coefficient\nwhich considers both the number of common attributes between users as well as\nthe corresponding priorities on each common attribute. Further, based on the\nnewly constructed similarity function which takes the ratio of attributes\nmatched over all the input set into consideration, we design an enhanced\nversion to deal with some potential attacks such as unlimitedly inputting the\nattribute set on either the initiator side or the responder side, etc. Finally,\nour proposed E-match avoids the heavy cryptographic operations and improves the\nsystem performance significantly by employing a novel use of the Bloom filter.\nThe security and communication/computation overhead of our schemes are\nthoroughly analyzed and evaluated via detailed simulations and implementation.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2014 05:27:10 GMT"}], "update_date": "2014-02-03", "authors_parsed": [["Niu", "Ben", ""], ["Zhang", "Tanran", ""], ["Zhu", "Xiaoyan", ""], ["Li", "Hui", ""], ["Lu", "Zongqing", ""]]}, {"id": "1401.8170", "submitter": "Pablo Rauzy", "authors": "Pablo Rauzy (LTCI), Sylvain Guilley", "title": "A Formal Proof of Countermeasures against Fault Injection Attacks on\n  CRT-RSA", "comments": "PROOFS, Santa Barbara, CA : United States (2013)", "journal-ref": null, "doi": "10.1007/s13389-013-0065-3", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we describe a methodology that aims at either breaking or\nproving the security of CRT-RSA implementations against fault injection\nattacks. In the specific case-study of the BellCoRe attack, our work bridges a\ngap between formal proofs and implementation-level attacks. We apply our\nresults to three implementations of CRT-RSA, namely the unprotected one, that\nof Shamir, and that of Aum\\\"uller et al. Our findings are that many attacks are\npossible on both the unprotected and the Shamir implementations, while the\nimplementation of Aum\\\"uller et al. is resistant to all single-fault attacks.\nIt is also resistant to double-fault attacks if we consider the less powerful\nthreat-model of its authors.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2014 14:15:28 GMT"}], "update_date": "2014-06-16", "authors_parsed": [["Rauzy", "Pablo", "", "LTCI"], ["Guilley", "Sylvain", ""]]}, {"id": "1401.8172", "submitter": "Pablo Rauzy", "authors": "Pablo Rauzy (LTCI), Sylvain Guilley", "title": "Formal Analysis of CRT-RSA Vigilant's Countermeasure Against the\n  BellCoRe Attack: A Pledge for Formal Methods in the Field of Implementation\n  Security", "comments": "arXiv admin note: substantial text overlap with arXiv:1401.8170", "journal-ref": "Program Protection and Reverse Engineering Workshop 2014, San\n  Diego, CA : United States (2014)", "doi": "10.1145/2556464.2556466", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In our paper at PROOFS 2013, we formally studied a few known countermeasures\nto protect CRT-RSA against the BellCoRe fault injection attack. However, we\nleft Vigilant's countermeasure and its alleged repaired version by Coron et al.\nas future work, because the arithmetical framework of our tool was not\nsufficiently powerful. In this paper we bridge this gap and then use the same\nmethodology to formally study both versions of the countermeasure. We obtain\nsurprising results, which we believe demonstrate the importance of formal\nanalysis in the field of implementation security. Indeed, the original version\nof Vigilant's countermeasure is actually broken, but not as much as Coron et\nal. thought it was. As a consequence, the repaired version they proposed can be\nsimplified. It can actually be simplified even further as two of the nine\nmodular verifications happen to be unnecessary. Fortunately, we could formally\nprove the simplified repaired version to be resistant to the BellCoRe attack,\nwhich was considered a \"challenging issue\" by the authors of the countermeasure\nthemselves.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2014 14:19:33 GMT"}, {"version": "v2", "created": "Fri, 23 May 2014 18:13:10 GMT"}], "update_date": "2014-05-26", "authors_parsed": [["Rauzy", "Pablo", "", "LTCI"], ["Guilley", "Sylvain", ""]]}, {"id": "1401.8230", "submitter": "Vadim Demchik", "authors": "Vadim Demchik and Alexey Gulov", "title": "Increasing precision of uniform pseudorandom number generators", "comments": "5 pages, 1 figure; additional description of algorithm is applied", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.CR cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A general method to produce uniformly distributed pseudorandom numbers with\nextended precision by combining two pseudorandom numbers with lower precision\nis proposed. In particular, this method can be used for pseudorandom number\ngeneration with extended precision on graphics processing units (GPU), where\nthe performance of single and double precision operations can vary\nsignificantly.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jan 2014 20:20:18 GMT"}, {"version": "v2", "created": "Mon, 12 May 2014 12:45:45 GMT"}], "update_date": "2014-05-13", "authors_parsed": [["Demchik", "Vadim", ""], ["Gulov", "Alexey", ""]]}, {"id": "1401.8255", "submitter": "Kevin Carter", "authors": "Kevin M. Carter, Hamed Okhravi, and James Riordan", "title": "Quantitative Analysis of Active Cyber Defenses Based on Temporal\n  Platform Diversity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Active cyber defenses based on temporal platform diversity have been proposed\nas way to make systems more resistant to attacks. These defenses change the\nproperties of the platforms in order to make attacks more complicated.\nUnfortunately, little work has been done on measuring the effectiveness of\nthese defenses. In this work, we use four different approaches to\nquantitatively analyze these defenses; an abstract analysis studies the\nalgebraic models of a temporal platform diversity system; a set of experiments\non a test bed measures the metrics of interest for the system; a game theoretic\nanalysis studies the impact of preferential selection of platforms and derives\nan optimal strategy; finally, a set of simulations evaluates the metrics of\ninterest on the models. Our results from these approaches all agree and yet are\ncounter-intuitive. We show that although platform diversity can mitigate some\nattacks, it can be detrimental for others. We also illustrate that the benefit\nfrom these systems heavily depends on their threat model and that the\npreferential selection of platforms can achieve better protection.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2014 18:48:01 GMT"}], "update_date": "2014-02-03", "authors_parsed": [["Carter", "Kevin M.", ""], ["Okhravi", "Hamed", ""], ["Riordan", "James", ""]]}]