[{"id": "0907.0403", "submitter": "Andreas Witzel", "authors": "Krzysztof R. Apt and Andreas Witzel and Jonathan A. Zvesper", "title": "Common Knowledge in Interaction Structures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider two simple variants of a framework for reasoning about knowledge\namongst communicating groups of players. Our goal is to clarify the resulting\nepistemic issues. In particular, we investigate what is the impact of common\nknowledge of the underlying hypergraph connecting the players, and under what\nconditions common knowledge distributes over disjunction. We also obtain two\nversions of the classic result that common knowledge cannot be achieved in the\nabsence of a simultaneous event (here a message sent to the whole group).\n", "versions": [{"version": "v1", "created": "Thu, 2 Jul 2009 15:19:22 GMT"}], "update_date": "2009-07-03", "authors_parsed": [["Apt", "Krzysztof R.", ""], ["Witzel", "Andreas", ""], ["Zvesper", "Jonathan A.", ""]]}, {"id": "0907.0540", "submitter": "Kees Middelburg", "authors": "J. A. Bergstra, C. A. Middelburg", "title": "Inversive Meadows and Divisive Meadows", "comments": "18 pages; error corrected; 29 pages, combined with arXiv:0909.2088\n  [math.RA] and arXiv:0909.5271 [math.RA]", "journal-ref": "Journal of Applied Logic, 9(3):203--220, 2011", "doi": "10.1016/j.jal.2011.03.001", "report-no": null, "categories": "math.RA cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inversive meadows are commutative rings with a multiplicative identity\nelement and a total multiplicative inverse operation whose value at 0 is 0.\nDivisive meadows are inversive meadows with the multiplicative inverse\noperation replaced by a division operation. We give finite equational\nspecifications of the class of all inversive meadows and the class of all\ndivisive meadows. It depends on the angle from which they are viewed whether\ninversive meadows or divisive meadows must be considered more basic. We show\nthat inversive and divisive meadows of rational numbers can be obtained as\ninitial algebras of finite equational specifications. In the spirit of\nPeacock's arithmetical algebra, we study variants of inversive and divisive\nmeadows without an additive identity element and/or an additive inverse\noperation. We propose simple constructions of variants of inversive and\ndivisive meadows with a partial multiplicative inverse or division operation\nfrom inversive and divisive meadows. Divisive meadows are more basic if these\nvariants are considered as well. We give a simple account of how mathematicians\ndeal with 1 / 0, in which meadows and a customary convention among\nmathematicians play prominent parts, and we make plausible that a convincing\naccount, starting from the popular computer science viewpoint that 1 / 0 is\nundefined, by means of some logic of partial functions is not attainable.\n", "versions": [{"version": "v1", "created": "Fri, 3 Jul 2009 06:42:28 GMT"}, {"version": "v2", "created": "Tue, 28 Jul 2009 07:14:16 GMT"}, {"version": "v3", "created": "Tue, 2 Nov 2010 16:00:31 GMT"}], "update_date": "2011-08-02", "authors_parsed": [["Bergstra", "J. A.", ""], ["Middelburg", "C. A.", ""]]}, {"id": "0907.0616", "submitter": "Philipp Weis", "authors": "Philipp Weis, Neil Immerman", "title": "Structure Theorem and Strict Alternation Hierarchy for FO^2 on Words", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 5, Issue 3 (August 4,\n  2009) lmcs:1159", "doi": "10.2168/LMCS-5(3:4)2009", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well-known that every first-order property on words is expressible\nusing at most three variables. The subclass of properties expressible with only\ntwo variables is also quite interesting and well-studied. We prove precise\nstructure theorems that characterize the exact expressive power of first-order\nlogic with two variables on words. Our results apply to both the case with and\nwithout a successor relation. For both languages, our structure theorems show\nexactly what is expressible using a given quantifier depth, n, and using m\nblocks of alternating quantifiers, for any m \\leq n. Using these\ncharacterizations, we prove, among other results, that there is a strict\nhierarchy of alternating quantifiers for both languages. The question whether\nthere was such a hierarchy had been completely open. As another consequence of\nour structural results, we show that satisfiability for first-order logic with\ntwo variables without successor, which is NEXP-complete in general, becomes\nNP-complete once we only consider alphabets of a bounded size.\n", "versions": [{"version": "v1", "created": "Fri, 3 Jul 2009 12:28:01 GMT"}, {"version": "v2", "created": "Mon, 3 Aug 2009 23:05:40 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Weis", "Philipp", ""], ["Immerman", "Neil", ""]]}, {"id": "0907.0877", "submitter": "Stephen Bloom", "authors": "S.L. Bloom and Z. Esik", "title": "Algebraic Ordinals", "comments": "30 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An algebraic tree T is one determined by a finite system of fixed point\nequations. The frontier \\Fr(T) of an algebraic tree t is linearly ordered by\nthe lexicographic order \\lex. When (\\Fr(T),\\lex) is well-ordered, its order\ntype is an \\textbf{algebraic ordinal}. We prove that the algebraic ordinals are\nexactly the ordinals less than $\\omega^{\\omega^\\omega}$.\n", "versions": [{"version": "v1", "created": "Sun, 5 Jul 2009 18:24:28 GMT"}, {"version": "v2", "created": "Fri, 5 Feb 2010 14:49:46 GMT"}, {"version": "v3", "created": "Mon, 8 Feb 2010 14:49:21 GMT"}], "update_date": "2010-02-08", "authors_parsed": [["Bloom", "S. L.", ""], ["Esik", "Z.", ""]]}, {"id": "0907.1357", "submitter": "Nicolas Stouls", "authors": "Jean-Fran\\c{c}ois Couchot (LIFC), Alain Giorgetti (LIFC), Nicolas\n  Stouls (CITI Insa Lyon / INRIA Grenoble Rh\\^one-Alpes)", "title": "Graph Based Reduction of Program Verification Conditions", "comments": null, "journal-ref": "Automated Formal Methods (AFM'09), colocated with CAV'09 (2009)\n  40-47", "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Increasing the automaticity of proofs in deductive verification of C programs\nis a challenging task. When applied to industrial C programs known heuristics\nto generate simpler verification conditions are not efficient enough. This is\nmainly due to their size and a high number of irrelevant hypotheses. This work\npresents a strategy to reduce program verification conditions by selecting\ntheir relevant hypotheses. The relevance of a hypothesis is determined by the\ncombination of a syntactic analysis and two graph traversals. The first graph\nis labeled by constants and the second one by the predicates in the axioms. The\napproach is applied on a benchmark arising in industrial program verification.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jul 2009 08:32:57 GMT"}], "update_date": "2011-05-24", "authors_parsed": [["Couchot", "Jean-François", "", "LIFC"], ["Giorgetti", "Alain", "", "LIFC"], ["Stouls", "Nicolas", "", "CITI Insa Lyon / INRIA Grenoble Rhône-Alpes"]]}, {"id": "0907.1540", "submitter": "Sonja Georgievska", "authors": "Sonja Georgievska and Suzana Andova", "title": "Testing Probabilistic Processes: Can Random Choices Be Unobservable?", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A central paradigm behind process semantics based on observability and\ntesting is that the exact moment of occurring of an internal nondeterministic\nchoice is unobservable. It is natural, therefore, for this property to hold\nwhen the internal choice is quantified with probabilities. However, ever since\nprobabilities have been introduced in process semantics, it has been a\nchallenge to preserve the unobservability of the random choice, while not\nviolating the other laws of process theory and probability theory. This paper\naddresses this problem. It proposes two semantics for processes where the\ninternal nondeterminism has been quantified with probabilities. The first one\nis based on the notion of testing, i.e. interaction between the process and its\nenvironment. The second one, the probabilistic ready trace semantics, is based\non the notion of observability. Both are shown to coincide. They are also\npreserved under the standard operators.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jul 2009 13:29:25 GMT"}], "update_date": "2009-07-10", "authors_parsed": [["Georgievska", "Sonja", ""], ["Andova", "Suzana", ""]]}, {"id": "0907.1722", "submitter": "Dai Tri Man Le", "authors": "Ryszard Janicki, Dai Tri Man Le", "title": "Modelling Concurrency with Comtraces and Generalized Comtraces", "comments": "49 pages", "journal-ref": null, "doi": "10.1016/j.ic.2011.08.001", "report-no": null, "categories": "cs.LO cs.DC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Comtraces (combined traces) are extensions of Mazurkiewicz traces that can\nmodel the \"not later than\" relationship. In this paper, we first introduce the\nnovel notion of generalized comtraces, extensions of comtraces that can\nadditionally model the \"non-simultaneously\" relationship. Then we study some\nbasic algebraic properties and canonical reprentations of comtraces and\ngeneralized comtraces. Finally we analyze the relationship between generalized\ncomtraces and generalized stratified order structures. The major technical\ncontribution of this paper is a proof showing that generalized comtraces can be\nrepresented by generalized stratified order structures.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jul 2009 04:36:37 GMT"}, {"version": "v2", "created": "Thu, 16 Jul 2009 06:13:21 GMT"}, {"version": "v3", "created": "Wed, 9 Sep 2009 15:16:01 GMT"}, {"version": "v4", "created": "Mon, 18 Jul 2011 17:55:40 GMT"}, {"version": "v5", "created": "Wed, 31 Aug 2011 16:00:34 GMT"}], "update_date": "2011-09-01", "authors_parsed": [["Janicki", "Ryszard", ""], ["Le", "Dai Tri Man", ""]]}, {"id": "0907.3019", "submitter": "Dana Fisman", "authors": "Dana Fisman, Orna Kupferman and Yoad Lustig", "title": "Rational Synthesis", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Synthesis is the automated construction of a system from its specification.\nThe system has to satisfy its specification in all possible environments.\nModern systems often interact with other systems, or agents. Many times these\nagents have objectives of their own, other than to fail the system. Thus, it\nmakes sense to model system environments not as hostile, but as composed of\nrational agents; i.e., agents that act to achieve their own objectives. We\nintroduce the problem of synthesis in the context of rational agents (rational\nsynthesis, for short). The input consists of a temporal-logic formula\nspecifying the system and temporal-logic formulas specifying the objectives of\nthe agents. The output is an implementation T of the system and a profile of\nstrategies, suggesting a behavior for each of the agents. The output should\nsatisfy two conditions. First, the composition of T with the strategy profile\nshould satisfy the specification. Second, the strategy profile should be an\nequilibria in the sense that, in view of their objectives, agents have no\nincentive to deviate from the strategies assigned to them. We solve the\nrational-synthesis problem for various definitions of equilibria studied in\ngame theory. We also consider the multi-valued case in which the objectives of\nthe system and the agents are still temporal logic formulas, but involve\npayoffs from a finite lattice.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jul 2009 08:51:23 GMT"}], "update_date": "2009-07-20", "authors_parsed": [["Fisman", "Dana", ""], ["Kupferman", "Orna", ""], ["Lustig", "Yoad", ""]]}, {"id": "0907.3076", "submitter": "Stephan Kreutzer", "authors": "Stephan Kreutzer and Siamak Tazari", "title": "On Brambles, Grid-Like Minors, and Parameterized Intractability of\n  Monadic Second-Order Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.DS cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Brambles were introduced as the dual notion to treewidth, one of the most\ncentral concepts of the graph minor theory of Robertson and Seymour. Recently,\nGrohe and Marx showed that there are graphs G, in which every bramble of order\nlarger than the square root of the treewidth is of exponential size in |G|. On\nthe positive side, they show the existence of polynomial-sized brambles of the\norder of the square root of the treewidth, up to log factors. We provide the\nfirst polynomial time algorithm to construct a bramble in general graphs and\nachieve this bound, up to log-factors. We use this algorithm to construct\ngrid-like minors, a replacement structure for grid-minors recently introduced\nby Reed and Wood, in polynomial time. Using the grid-like minors, we introduce\nthe notion of a perfect bramble and an algorithm to find one in polynomial\ntime. Perfect brambles are brambles with a particularly simple structure and\nthey also provide us with a subgraph that has bounded degree and still large\ntreewidth; we use them to obtain a meta-theorem on deciding certain\nparameterized subgraph-closed problems on general graphs in time singly\nexponential in the parameter.\n  The second part of our work deals with providing a lower bound to Courcelle's\nfamous theorem, stating that every graph property that can be expressed by a\nsentence in monadic second-order logic (MSO), can be decided by a linear time\nalgorithm on classes of graphs of bounded treewidth. Using our results from the\nfirst part of our work we establish a strong lower bound for tractability of\nMSO on classes of colored graphs.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jul 2009 13:45:20 GMT"}], "update_date": "2009-07-20", "authors_parsed": [["Kreutzer", "Stephan", ""], ["Tazari", "Siamak", ""]]}, {"id": "0907.3085", "submitter": "Matteo Pradella", "authors": "Matteo Pradella, Angelo Morzenti, Pierluigi San Pietro", "title": "A Metric Encoding for Bounded Model Checking (extended version)", "comments": null, "journal-ref": null, "doi": "10.1007/978-3-642-05089-3_47", "report-no": null, "categories": "cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Bounded Model Checking both the system model and the checked property are\ntranslated into a Boolean formula to be analyzed by a SAT-solver. We introduce\na new encoding technique which is particularly optimized for managing\nquantitative future and past metric temporal operators, typically found in\nproperties of hard real time systems. The encoding is simple and intuitive in\nprinciple, but it is made more complex by the presence, typical of the Bounded\nModel Checking technique, of backward and forward loops used to represent an\nultimately periodic infinite domain by a finite structure. We report and\ncomment on the new encoding technique and on an extensive set of experiments\ncarried out to assess its feasibility and effectiveness.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jul 2009 14:51:10 GMT"}, {"version": "v2", "created": "Mon, 27 Jul 2009 09:51:03 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Pradella", "Matteo", ""], ["Morzenti", "Angelo", ""], ["Pietro", "Pierluigi San", ""]]}, {"id": "0907.3123", "submitter": "Olivier Bournez", "authors": "Emmanuel Beffara, Olivier Bournez, Hassen Kacem, Claude Kirchner", "title": "Verification of Timed Automata Using Rewrite Rules and Strategies", "comments": "In the Proceedings BISFAI 2001, Seventh Biennial Bar-Ilan\n  International Symposium on the Foundations of Artificial Intelligence.\n  Ramat-Gan, 2001", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  ELAN is a powerful language and environment for specifying and prototyping\ndeduction systems in a language based on rewrite rules controlled by\nstrategies. Timed automata is a class of continuous real-time models of\nreactive systems for which efficient model-checking algorithms have been\ndevised. In this paper, we show that these algorithms can very easily be\nprototyped in the ELAN system. This paper argues through this example that\nrewriting based systems relying on rules and strategies are a good framework to\nprototype, study and test rather efficiently symbolic model-checking\nalgorithms, i.e. algorithms which involve combination of graph exploration\nrules, deduction rules, constraint solving techniques and decision procedures.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jul 2009 17:40:04 GMT"}], "update_date": "2009-07-20", "authors_parsed": [["Beffara", "Emmanuel", ""], ["Bournez", "Olivier", ""], ["Kacem", "Hassen", ""], ["Kirchner", "Claude", ""]]}, {"id": "0907.3226", "submitter": "Walid Belkhir", "authors": "Walid Belkhir", "title": "From Causal Semantics To Duration Timed Models", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The interleaving semantics is not compatible with both action refinement and\ndurational actions. Since many true concurrency semantics are congruent w.r.t.\naction refinement, notably the causality and the maximality ones, this has\nchallenged us to study the dense time behavior - where the actions are of\narbitrary fixed duration - within the causality semantics of Da Costa.\n  We extend the causal transition systems with the clocks and the timed\nconstraints, and thus we obtain an over class of timed automata where the\nactions need not to be atomic. We define a real time extension of the formal\ndescription technique CSP, called duration-CSP, by attributing the duration to\nactions. We give the operational timed causal semantics of duration-CSP as well\nas its denotational semantics over the class of timed causal transition\nsystems. Afterwards, we prove that the two semantics are equivalent. Finally we\nextend the duration-CSP language with a refinement operator $\\rho$ - that\nallows to replace an action with a process - and prove that it preserves the\ntimed causal bisimulation.\n", "versions": [{"version": "v1", "created": "Sat, 18 Jul 2009 15:27:45 GMT"}, {"version": "v2", "created": "Tue, 13 Apr 2010 08:56:45 GMT"}], "update_date": "2010-04-14", "authors_parsed": [["Belkhir", "Walid", ""]]}, {"id": "0907.3230", "submitter": "Arno Pauly", "authors": "Arno Pauly", "title": "Infinite Oracle Queries in Type-2 Machines (Extended Abstract)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define Oracle-Type-2-Machine capable of writing infinite oracle queries.\nIn contrast to finite oracle queries, this extends the realm of\noracle-computable functions into the discontinuous realm. Our definition is\nconservative; access to a computable oracle does not increase the computational\npower.\n  Other models of real hypercomputation such as Ziegler's (finitely) revising\ncomputation or Type-2-Nondeterminism are shown to be special cases of\nOracle-Type-2-Machines. Our approach offers an intuitive definition of the\nweakest machine model capable to simulate both Type-2-Machines and BSS\nmachines.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2009 15:06:12 GMT"}], "update_date": "2009-07-21", "authors_parsed": [["Pauly", "Arno", ""]]}, {"id": "0907.3414", "submitter": "Ashutosh Trivedi", "authors": "Marcin Jurdzi\\'nski and Ashutosh Trivedi", "title": "Reachability-time games on timed automata", "comments": null, "journal-ref": "In ICALP, Volume 4596 of LNCS, pages 838--849, Springer 2007", "doi": "10.1007/978-3-540-73420-8_72", "report-no": null, "categories": "cs.CC cs.DS cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a reachability-time game, players Min and Max choose moves so that the\ntime to reach a final state in a timed automaton is minimised or maximised,\nrespectively. Asarin and Maler showed decidability of reachability-time games\non strongly non-Zeno timed automata using a value iteration algorithm. This\npaper complements their work by providing a strategy improvement algorithm for\nthe problem. It also generalizes their decidability result because the proposed\nstrategy improvement algorithm solves reachability-time games on all timed\nautomata. The exact computational complexity of solving reachability-time games\nis also established: the problem is EXPTIME-complete for timed automata with at\nleast two clocks.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2009 14:57:38 GMT"}], "update_date": "2020-01-16", "authors_parsed": [["Jurdziński", "Marcin", ""], ["Trivedi", "Ashutosh", ""]]}, {"id": "0907.3599", "submitter": "Jean-Francois Monin", "authors": "Jean-Fran\\c{c}ois Monin (VERIMAG - Imag), Cristian Ene (VERIMAG -\n  Imag), Micha\\\"el P\\'erin (VERIMAG - Imag)", "title": "Gentzen-Prawitz Natural Deduction as a Teaching Tool", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report a four-years experiment in teaching reasoning to undergraduate\nstudents, ranging from weak to gifted, using Gentzen-Prawitz's style natural\ndeduction. We argue that this pedagogical approach is a good alternative to the\nuse of Boolean algebra for teaching reasoning, especially for computer\nscientists and formal methods practionners.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jul 2009 09:58:12 GMT"}], "update_date": "2009-07-22", "authors_parsed": [["Monin", "Jean-François", "", "VERIMAG - Imag"], ["Ene", "Cristian", "", "VERIMAG -\n  Imag"], ["Périn", "Michaël", "", "VERIMAG - Imag"]]}, {"id": "0907.3804", "submitter": "Colin Stirling", "authors": "Colin Stirling", "title": "Decidability of higher-order matching", "comments": "appears in LMCS (Logical Methods in Computer Science)", "journal-ref": "Logical Methods in Computer Science, Volume 5, Issue 3 (July 30,\n  2009) lmcs:757", "doi": "10.2168/LMCS-5(3:2)2009", "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the higher-order matching problem is decidable using a\ngame-theoretic argument.\n", "versions": [{"version": "v1", "created": "Wed, 22 Jul 2009 09:17:30 GMT"}, {"version": "v2", "created": "Thu, 30 Jul 2009 12:42:31 GMT"}, {"version": "v3", "created": "Fri, 31 Jul 2009 11:37:46 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Stirling", "Colin", ""]]}, {"id": "0907.4128", "submitter": "Stefan Woltran", "authors": "Miroslaw Truszczy\\'nski, Stefan Woltran", "title": "Relativized hyperequivalence of logic programs for modular programming", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A recent framework of relativized hyperequivalence of programs offers a\nunifying generalization of strong and uniform equivalence. It seems to be\nespecially well suited for applications in program optimization and modular\nprogramming due to its flexibility that allows us to restrict, independently of\neach other, the head and body alphabets in context programs. We study\nrelativized hyperequivalence for the three semantics of logic programs given by\nstable, supported and supported minimal models. For each semantics, we identify\nfour types of contexts, depending on whether the head and body alphabets are\ngiven directly or as the complement of a given set. Hyperequivalence relative\nto contexts where the head and body alphabets are specified directly has been\nstudied before. In this paper, we establish the complexity of deciding\nrelativized hyperequivalence with respect to the three other types of context\nprograms.\n  To appear in Theory and Practice of Logic Programming (TPLP).\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2009 17:31:45 GMT"}], "update_date": "2009-07-24", "authors_parsed": [["Truszczyński", "Miroslaw", ""], ["Woltran", "Stefan", ""]]}, {"id": "0907.4169", "submitter": "Victor Yodaiken", "authors": "Victor Yodaiken", "title": "Primitive Recursive Presentations of Automata and their Products", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Methods for specifying Moore type state machines (transducers) abstractly via\nprimitive recursive functions and for defining parallel composition via\nsimultaneous primitive recursion are discussed. The method is mostly of\ninterest as a concise and convenient way of working with the complex state\nsystems found in computer programming and engineering, but a short section\nindicates connections to algebraic automata theory and the theorem of Krohn and\nRhodes.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2009 20:56:05 GMT"}, {"version": "v2", "created": "Sun, 10 Jan 2010 12:58:03 GMT"}], "update_date": "2010-01-10", "authors_parsed": [["Yodaiken", "Victor", ""]]}, {"id": "0907.4316", "submitter": "Krzysztof R. Apt", "authors": "Krzysztof R. Apt, Frank S. de Boer, Ernst-R\\\"udiger Olderog", "title": "Modular Verification of Recursive Programs", "comments": "21 pages. appeared in: Languages: From Formal to Natural, Essays\n  Dedicated to Nissim Francez on the Occasion of His 65th Birthday. Lecture\n  Notes in Computer Science 5533 Springer 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We argue that verification of recursive programs by means of the assertional\nmethod of C.A.R. Hoare can be conceptually simplified using a modular\nreasoning. In this approach some properties of the program are established\nfirst and subsequently used to establish other program properties. We\nillustrate this approach by providing a modular correctness proof of the\nQuicksort program.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jul 2009 15:06:46 GMT"}], "update_date": "2009-07-27", "authors_parsed": [["Apt", "Krzysztof R.", ""], ["de Boer", "Frank S.", ""], ["Olderog", "Ernst-Rüdiger", ""]]}, {"id": "0907.4477", "submitter": "Nikos Tzevelekos", "authors": "Nikos Tzevelekos", "title": "Full abstraction for nominal general references", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 5, Issue 3 (September\n  11, 2009) lmcs:918", "doi": "10.2168/LMCS-5(3:8)2009", "report-no": null, "categories": "cs.PL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Game semantics has been used with considerable success in formulating fully\nabstract semantics for languages with higher-order procedures and a wide range\nof computational effects. Recently, nominal games have been proposed for\nmodelling functional languages with names. These are ordinary, stateful games\ncast in the theory of nominal sets developed by Pitts and Gabbay. Here we take\nnominal games one step further, by developing a fully abstract semantics for a\nlanguage with nominal general references.\n", "versions": [{"version": "v1", "created": "Sun, 26 Jul 2009 13:27:38 GMT"}, {"version": "v2", "created": "Fri, 11 Sep 2009 19:57:27 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Tzevelekos", "Nikos", ""]]}, {"id": "0907.4531", "submitter": "Zhaohua Luo", "authors": "Zhaohua Luo", "title": "Clone Theory and Algebraic Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of a clone is central to many branches of mathematics, such as\nuniversal algebra, algebraic logic, and lambda calculus. Abstractly a clone is\na category with two objects such that one is a countably infinite power of the\nother. Left and right algebras over a clone are covariant and contravariant\nfunctors from the category to that of sets respectively. In this paper we show\nthat first-order logic can be studied effectively using the notions of right\nand left algebras over a clone. It is easy to translate the classical treatment\nof logic into our setting and prove all the fundamental theorems of first-order\ntheory algebraically.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jul 2009 17:36:16 GMT"}], "update_date": "2009-07-28", "authors_parsed": [["Luo", "Zhaohua", ""]]}, {"id": "0907.5074", "submitter": "Marcello M. Bersani", "authors": "Marcello M. Bersani, Carlo A. Furia, Matteo Pradella, and Matteo Rossi", "title": "Integrated Modeling and Verification of Real-Time Systems through\n  Multiple Paradigms", "comments": "27 pages", "journal-ref": "Proceedings of the 7th IEEE International Conference on Software\n  Engineering and Formal Methods (SEFM'09). Pgg. 13--22, IEEE Computer Society\n  Press, November 2009", "doi": "10.1109/SEFM.2009.16", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Complex systems typically have many different parts and facets, with\ndifferent characteristics. In a multi-paradigm approach to modeling, formalisms\nwith different natures are used in combination to describe complementary parts\nand aspects of the system. This can have a beneficial impact on the modeling\nactivity, as different paradigms an be better suited to describe different\naspects of the system. While each paradigm provides a different view on the\nmany facets of the system, it is of paramount importance that a coherent\ncomprehensive model emerges from the combination of the various partial\ndescriptions. In this paper we present a technique to model different aspects\nof the same system with different formalisms, while keeping the various models\ntightly integrated with one another. In addition, our approach leverages the\nflexibility provided by a bounded satisfiability checker to encode the\nverification problem of the integrated model in the propositional\nsatisfiability (SAT) problem; this allows users to carry out formal\nverification activities both on the whole model and on parts thereof. The\neffectiveness of the approach is illustrated through the example of a\nmonitoring system.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jul 2009 09:21:45 GMT"}], "update_date": "2013-08-14", "authors_parsed": [["Bersani", "Marcello M.", ""], ["Furia", "Carlo A.", ""], ["Pradella", "Matteo", ""], ["Rossi", "Matteo", ""]]}, {"id": "0907.5125", "submitter": "Florent Jacquemard", "authors": "Florent Jacquemard (INRIA Saclay - Ile de France), Michael Rusinowitch\n  (INRIA Lorraine - LORIA / LIFC)", "title": "Rewrite based Verification of XML Updates", "comments": null, "journal-ref": null, "doi": null, "report-no": "RR-7007", "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider problems of access control for update of XML documents. In the\ncontext of XML programming, types can be viewed as hedge automata, and static\ntype checking amounts to verify that a program always converts valid source\ndocuments into also valid output documents. Given a set of update operations we\nare particularly interested by checking safety properties such as preservation\nof document types along any sequence of updates. We are also interested by the\nrelated policy consistency problem, that is detecting whether a sequence of\nauthorized operations can simulate a forbidden one. We reduce these questions\nto type checking problems, solved by computing variants of hedge automata\ncharacterizing the set of ancestors and descendants of the initial document\ntype for the closure of parameterized rewrite rules.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jul 2009 13:34:50 GMT"}], "update_date": "2009-07-30", "authors_parsed": [["Jacquemard", "Florent", "", "INRIA Saclay - Ile de France"], ["Rusinowitch", "Michael", "", "INRIA Lorraine - LORIA / LIFC"]]}, {"id": "0907.5162", "submitter": "Anya Tafliovich", "authors": "Anya Tafliovich and Eric C. R. Hehner", "title": "Programming with Quantum Communication", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PL cs.LO quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work develops a formal framework for specifying, implementing, and\nanalysing quantum communication protocols. We provide tools for developing\nsimple proofs and analysing programs which involve communication, both via\nquantum channels and exhibiting the LOCC (local operations, classical\ncommunication) paradigm.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jul 2009 15:38:02 GMT"}], "update_date": "2009-07-30", "authors_parsed": [["Tafliovich", "Anya", ""], ["Hehner", "Eric C. R.", ""]]}, {"id": "0907.5527", "submitter": "Georg Moser", "authors": "Georg Moser", "title": "Proof Theory at Work: Complexity Analysis of Term Rewrite Systems", "comments": "Cumulative Habilitation Thesis, submitted to the University of\n  Innsbruck", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC cs.SC cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This thesis is concerned with investigations into the \"complexity of term\nrewriting systems\". Moreover the majority of the presented work deals with the\n\"automation\" of such a complexity analysis. The aim of this introduction is to\npresent the main ideas in an easily accessible fashion to make the result\npresented accessible to the general public. Necessarily some technical points\nare stated in an over-simplified way.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jul 2009 13:19:25 GMT"}, {"version": "v2", "created": "Wed, 30 Dec 2009 08:40:50 GMT"}], "update_date": "2009-12-30", "authors_parsed": [["Moser", "Georg", ""]]}]