[{"id": "1108.0144", "submitter": "EPTCS", "authors": "Alexandra Silva, Simon Bliudze, Roberto Bruni, Marco Carbone", "title": "Proceedings Fourth Interaction and Concurrency Experience", "comments": null, "journal-ref": "EPTCS 59, 2011", "doi": "10.4204/EPTCS.59", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the pre-proceedings of ICE'11, the 4th Interaction and\nConcurrency Experience workshop, which was held in Reykjavik, Iceland on the\n9th of June 2011 as a satellite event of DisCoTec'11.\n  The topic of ICE'11 was Reliable and Contract-based Interaction. Reliable\ninteractions are, e.g., those enjoying suitable logical, behavioural, or\nsecurity properties, or adhering to certain QoS standards. Contract-based\ninteractions are, e.g., those where the interacting entities are committed to\ngive certain guarantees whenever certain assumptions are met by their operating\nenvironment.\n  The ICE procedure for paper selection allows for PC members to interact,\nanonymously, with authors. During the review phase, each submitted paper is\npublished on a Wiki and associated with a discussion forum whose access is\nrestricted to the authors and to all the PC members not declaring a conflict of\ninterests. The PC members post comments and questions that the authors reply\nto. Each paper was reviewed by four PC members, and altogether 8 papers (out of\n12) were accepted for publication.\n  We were proud to host three invited talks by Rocco De Nicola (joint with\nPACO), Simon Gay and Prakash Panangaden, whose abstracts are included in this\nvolume together with the regular papers.\n", "versions": [{"version": "v1", "created": "Sun, 31 Jul 2011 06:14:37 GMT"}], "update_date": "2011-08-02", "authors_parsed": [["Silva", "Alexandra", ""], ["Bliudze", "Simon", ""], ["Bruni", "Roberto", ""], ["Carbone", "Marco", ""]]}, {"id": "1108.0229", "submitter": "EPTCS", "authors": "Ross Horne (University of Southampton), Vladimiro Sassone (University\n  of Southampton)", "title": "A Verified Algebra for Linked Data", "comments": "In Proceedings FOCLASA 2011, arXiv:1107.5847", "journal-ref": "EPTCS 58, 2011, pp. 20-33", "doi": "10.4204/EPTCS.58.2", "report-no": null, "categories": "cs.LO cs.NI cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A foundation is investigated for the application of loosely structured data\non the Web. This area is often referred to as Linked Data, due to the use of\nURIs in data to establish links. This work focuses on emerging W3C standards\nwhich specify query languages for Linked Data. The approach is to provide an\nabstract syntax to capture Linked Data structures and queries, which are then\ninternalised in a process calculus. An operational semantics for the calculus\nspecifies how queries, data and processes interact. A labelled transition\nsystem is shown to be sound with respect to the operational semantics.\nBisimulation over the labelled transition system is used to verify an algebra\nover queries. The derived algebra is a contribution to the application domain.\nFor instance, the algebra may be used to rewrite a query to optimise its\ndistribution across a cluster of servers. The framework used to provide the\noperational semantics is powerful enough to model related calculi for the Web.\n", "versions": [{"version": "v1", "created": "Mon, 1 Aug 2011 03:58:02 GMT"}], "update_date": "2011-08-02", "authors_parsed": [["Horne", "Ross", "", "University of Southampton"], ["Sassone", "Vladimiro", "", "University\n  of Southampton"]]}, {"id": "1108.0232", "submitter": "EPTCS", "authors": "Jos\\'e Proen\\c{c}a (KUL), Dave Clarke (KUL), Erik de Vink (TUE),\n  Farhad Arbab (CWI)", "title": "Decoupled execution of synchronous coordination models via behavioural\n  automata", "comments": "In Proceedings FOCLASA 2011, arXiv:1107.5847", "journal-ref": "EPTCS 58, 2011, pp. 65-79", "doi": "10.4204/EPTCS.58.5", "report-no": null, "categories": "cs.FL cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Synchronous coordination systems allow the exchange of data by logically\nindivisible actions involving all coordinated entities. This paper introduces\nbehavioural automata, a logically synchronous coordination model based on the\nReo coordination language, which focuses on relevant aspects for the concurrent\nevolution of these systems. We show how our automata model encodes the Reo and\nLinda coordination models and how it introduces an explicit predicate that\ncaptures the concurrent evolution, distinguishing local from global actions,\nand lifting the need of most synchronous models to involve all entities at each\ncoordination step, paving the way to more scalable implementations.\n", "versions": [{"version": "v1", "created": "Mon, 1 Aug 2011 03:58:23 GMT"}], "update_date": "2011-08-02", "authors_parsed": [["Proença", "José", "", "KUL"], ["Clarke", "Dave", "", "KUL"], ["de Vink", "Erik", "", "TUE"], ["Arbab", "Farhad", "", "CWI"]]}, {"id": "1108.0315", "submitter": "R\\\"udiger Ehlers", "authors": "Ruediger Ehlers", "title": "Small witnesses, accepting lassos and winning strategies in\n  omega-automata and games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Obtaining accepting lassos, witnesses and winning strategies in\nomega-automata and games with omega-regular winning conditions is an integral\npart of many formal methods commonly found in practice today. Despite the fact\nthat in most applications, the lassos, witnesses and strategies found should be\nas small as possible, little is known about the hardness of obtaining small\nsuch certificates. In this paper, we survey the known hardness results and\ncomplete the complexity landscape for the cases not considered in the\nliterature so far. We pay particular attention to the approximation hardness of\nthe problems as approximate small solutions usually suffice in practice.\n", "versions": [{"version": "v1", "created": "Mon, 1 Aug 2011 14:03:10 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Ehlers", "Ruediger", ""]]}, {"id": "1108.0330", "submitter": "Remy Haemmerle", "authors": "R\\'emy Haemmerl\\'e", "title": "(Co-)Inductive semantics for Constraint Handling Rules", "comments": "17 pages", "journal-ref": "Theory and Practice of Logic Programming, 11(4-5): 593-609, 2011", "doi": "10.1017/S1471068411000196", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we address the problem of defining a fixpoint semantics for\nConstraint Handling Rules (CHR) that captures the behavior of both\nsimplification and propagation rules in a sound and complete way with respect\nto their declarative semantics. Firstly, we show that the logical reading of\nstates with respect to a set of simplification rules can be characterized by a\nleast fixpoint over the transition system generated by the abstract operational\nsemantics of CHR. Similarly, we demonstrate that the logical reading of states\nwith respect to a set of propagation rules can be characterized by a greatest\nfixpoint. Then, in order to take advantage of both types of rules without\nlosing fixpoint characterization, we present an operational semantics with\npersistent. We finally establish that this semantics can be characterized by\ntwo nested fixpoints, and we show the resulting language is an elegant\nframework to program using coinductive reasoning.\n", "versions": [{"version": "v1", "created": "Mon, 1 Aug 2011 15:02:43 GMT"}], "update_date": "2011-08-02", "authors_parsed": [["Haemmerlé", "Rémy", ""]]}, {"id": "1108.0463", "submitter": "EPTCS", "authors": "Tom Hirschowitz (CNRS, Chambery), Damien Pous (CNRS, Grenoble)", "title": "Innocent strategies as presheaves and interactive equivalences for CCS", "comments": "In Proceedings ICE 2011, arXiv:1108.0144", "journal-ref": "EPTCS 59, 2011, pp. 2-24", "doi": "10.4204/EPTCS.59.2", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Seeking a general framework for reasoning about and comparing programming\nlanguages, we derive a new view of Milner's CCS. We construct a category E of\nplays, and a subcategory V of views. We argue that presheaves on V adequately\nrepresent innocent strategies, in the sense of game semantics. We then equip\ninnocent strategies with a simple notion of interaction. This results in an\ninterpretation of CCS.\n  Based on this, we propose a notion of interactive equivalence for innocent\nstrategies, which is close in spirit to Beffara's interpretation of testing\nequivalences in concurrency theory. In this framework we prove that the\nanalogues of fair and must testing equivalences coincide, while they differ in\nthe standard setting.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 02:27:04 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Hirschowitz", "Tom", "", "CNRS, Chambery"], ["Pous", "Damien", "", "CNRS, Grenoble"]]}, {"id": "1108.0464", "submitter": "EPTCS", "authors": "Vincenzo Ciancia", "title": "Interaction and observation, categorically", "comments": "In Proceedings ICE 2011, arXiv:1108.0144", "journal-ref": "EPTCS 59, 2011, pp. 25-36", "doi": "10.4204/EPTCS.59.3", "report-no": null, "categories": "cs.PL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes to use dialgebras to specify the semantics of interactive\nsystems in a natural way. Dialgebras are a conservative extension of\ncoalgebras. In this categorical model, from the point of view that we provide,\nthe notions of observation and interaction are separate features. This is\nuseful, for example, in the specification of process equivalences, which are\nobtained as kernels of the homomorphisms of dialgebras. As an example we\npresent the asynchronous semantics of the CCS.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 02:27:04 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Ciancia", "Vincenzo", ""]]}, {"id": "1108.0465", "submitter": "EPTCS", "authors": "Andrei Dorman (Universit\\'e Paris 13) and Tobias Heindel (Universit\\'e\n  Paris 13)", "title": "Structured Operational Semantics for Graph Rewriting", "comments": "In Proceedings ICE 2011, arXiv:1108.0144", "journal-ref": "EPTCS 59, 2011, pp. 37-51", "doi": "10.4204/EPTCS.59.4", "report-no": null, "categories": "cs.LO cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Process calculi and graph transformation systems provide models of reactive\nsystems with labelled transition semantics. While the semantics for process\ncalculi is compositional, this is not the case for graph transformation\nsystems, in general. Hence, the goal of this article is to obtain a\ncompositional semantics for graph transformation system in analogy to the\nstructural operational semantics (SOS) for Milner's Calculus of Communicating\nSystems (CCS).\n  The paper introduces an SOS style axiomatization of the standard labelled\ntransition semantics for graph transformation systems. The first result is its\nequivalence with the so-called Borrowed Context technique. Unfortunately, the\naxiomatization is not compositional in the expected manner as no rule captures\n\"internal\" communication of sub-systems. The main result states that such a\nrule is derivable if the given graph transformation system enjoys a certain\nproperty, which we call \"complementarity of actions\". Archetypal examples of\nsuch systems are interaction nets. We also discuss problems that arise if\n\"complementarity of actions\" is violated.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 02:27:13 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Dorman", "Andrei", "", "Université Paris 13"], ["Heindel", "Tobias", "", "Université\n  Paris 13"]]}, {"id": "1108.0469", "submitter": "EPTCS", "authors": "Timothy A.S. Davidson (University of Warwick, UK), Simon J. Gay\n  (University of Glasgow, UK), Rajagopal Nagarajan (University of Warwick, UK)", "title": "Formal Analysis of Quantum Systems using Process Calculus", "comments": "In Proceedings ICE 2011, arXiv:1108.0144", "journal-ref": "EPTCS 59, 2011, pp. 104-110", "doi": "10.4204/EPTCS.59.9", "report-no": null, "categories": "cs.LO quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum communication and cryptographic protocols are well on the way to\nbecoming an important practical technology. Although a large amount of\nsuccessful research has been done on proving their correctness, most of this\nwork does not make use of familiar techniques from formal methods, such as\nformal logics for specification, formal modelling languages, separation of\nlevels of abstraction, and compositional analysis. We argue that these\ntechniques will be necessary for the analysis of large-scale systems that\ncombine quantum and classical components, and summarize the results of initial\ninvestigation using behavioural equivalence in process calculus. This paper is\na summary of Simon Gay's invited talk at ICE'11.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 02:27:37 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Davidson", "Timothy A. S.", "", "University of Warwick, UK"], ["Gay", "Simon J.", "", "University of Glasgow, UK"], ["Nagarajan", "Rajagopal", "", "University of Warwick, UK"]]}, {"id": "1108.0471", "submitter": "EPTCS", "authors": "Massimo Bartoletti (Dipartimento di Matematica e Informatica,\n  Universita' degli Studi di Cagliari, Italy), Emilio Tuosto (Department of\n  Computer Science, University of Leicester, UK), Roberto Zunino\n  (DISI-Universita' degli Studi di Trento and COSBI, Italy)", "title": "Contracts in distributed systems", "comments": "In Proceedings ICE 2011, arXiv:1108.0144", "journal-ref": "EPTCS 59, 2011, pp. 130-147", "doi": "10.4204/EPTCS.59.11", "report-no": null, "categories": "cs.PL cs.DC cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a parametric calculus for contract-based computing in distributed\nsystems. By abstracting from the actual contract language, our calculus\ngeneralises both the contracts-as-processes and contracts-as-formulae\nparadigms. The calculus features primitives for advertising contracts, for\nreaching agreements, and for querying the fulfilment of contracts. Coordination\namong principals happens via multi-party sessions, which are created once\nagreements are reached. We present two instances of our calculus, by modelling\ncontracts as (i) processes in a variant of CCS, and (ii) as formulae in a\nlogic. With the help of a few examples, we discuss the primitives of our\ncalculus, as well as some possible variants.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 02:27:50 GMT"}], "update_date": "2011-08-03", "authors_parsed": [["Bartoletti", "Massimo", "", "Dipartimento di Matematica e Informatica,\n  Universita' degli Studi di Cagliari, Italy"], ["Tuosto", "Emilio", "", "Department of\n  Computer Science, University of Leicester, UK"], ["Zunino", "Roberto", "", "DISI-Universita' degli Studi di Trento and COSBI, Italy"]]}, {"id": "1108.0556", "submitter": "Fritz Mueller", "authors": "Fritz M\\\"uller (Saarland University)", "title": "On Berry's conjectures about the stable order in PCF", "comments": "submitted to LMCS, 39 pages, 23 pstricks/pst-tree figures, main\n  changes for this version: 4.1: proof of game term theorem corrected, 7.: the\n  improved chain conjecture is made precise, more references added", "journal-ref": "Logical Methods in Computer Science, Volume 8, Issue 4 (October\n  12, 2012) lmcs:925", "doi": "10.2168/LMCS-8(4:7)2012", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  PCF is a sequential simply typed lambda calculus language. There is a unique\norder-extensional fully abstract cpo model of PCF, built up from equivalence\nclasses of terms. In 1979, G\\'erard Berry defined the stable order in this\nmodel and proved that the extensional and the stable order together form a\nbicpo. He made the following two conjectures: 1) \"Extensional and stable order\nform not only a bicpo, but a bidomain.\" We refute this conjecture by showing\nthat the stable order is not bounded complete, already for finitary PCF of\nsecond-order types. 2) \"The stable order of the model has the syntactic order\nas its image: If a is less than b in the stable order of the model, for finite\na and b, then there are normal form terms A and B with the semantics a, resp.\nb, such that A is less than B in the syntactic order.\" We give counter-examples\nto this conjecture, again in finitary PCF of second-order types, and also\nrefute an improved conjecture: There seems to be no simple syntactic\ncharacterization of the stable order. But we show that Berry's conjecture is\ntrue for unary PCF. For the preliminaries, we explain the basic fully abstract\nsemantics of PCF in the general setting of (not-necessarily complete) partial\norder models (f-models.) And we restrict the syntax to \"game terms\", with a\ngraphical representation.\n", "versions": [{"version": "v1", "created": "Tue, 2 Aug 2011 12:12:11 GMT"}, {"version": "v2", "created": "Fri, 7 Sep 2012 12:44:38 GMT"}, {"version": "v3", "created": "Thu, 11 Oct 2012 12:28:18 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Müller", "Fritz", "", "Saarland University"]]}, {"id": "1108.0843", "submitter": "Vassilios Gregoriades", "authors": "Vassilios Gregoriades (Post-Doctoral Researcher TU Darmstadt)", "title": "The descriptive set-theoretic complexity of the set of points of\n  continuity of a multi-valued function", "comments": "22 pages", "journal-ref": "Logical Methods in Computer Science, Volume 7, Issue 4 (November\n  2, 2011) lmcs:887", "doi": "10.2168/LMCS-7(4:2)2011", "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we treat a notion of continuity for a multi-valued function\n$F$ and we compute the descriptive set-theoretic complexity of the set of all\n$x$ for which $F$ is continuous at $x$. We give conditions under which the\nlatter set is either a $G_\\delta$ set or the countable union of $G_\\delta$\nsets. Also we provide a counterexample which shows that the latter result is\noptimum under the same conditions. Moreover we prove that those conditions are\nnecessary in order to obtain that the set of points of continuity of $F$ is\nBorel i.e., we show that if we drop some of the previous conditions then there\nis a multi-valued function $F$ whose graph is a Borel set and the set of points\nof continuity of $F$ is not a Borel set. Finally we give some analogous results\nregarding a stronger notion of continuity for a multi-valued function. This\narticle is motivated by a question of M. Ziegler in [{\\em Real Computation with\nLeast Discrete Advice: A Complexity Theory of Nonuniform Computability with\nApplications to Linear Algebra}, {\\sl submitted}].\n", "versions": [{"version": "v1", "created": "Wed, 3 Aug 2011 13:39:29 GMT"}, {"version": "v2", "created": "Tue, 1 Nov 2011 14:00:33 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Gregoriades", "Vassilios", "", "Post-Doctoral Researcher TU Darmstadt"]]}, {"id": "1108.1445", "submitter": "Matthew de Brecht", "authors": "Matthew de Brecht", "title": "Quasi-Polish Spaces", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate some basic descriptive set theory for countably based\ncompletely quasi-metrizable topological spaces, which we refer to as\nquasi-Polish spaces. These spaces naturally generalize much of the classical\ndescriptive set theory of Polish spaces to the non-Hausdorff setting. We show\nthat a subspace of a quasi-Polish space is quasi-Polish if and only if it is\nlevel \\Pi_2 in the Borel hierarchy. Quasi-Polish spaces can be characterized\nwithin the framework of Type-2 Theory of Effectivity as precisely the countably\nbased spaces that have an admissible representation with a Polish domain. They\ncan also be characterized domain theoretically as precisely the spaces that are\nhomeomorphic to the subspace of all non-compact elements of an\n\\omega-continuous domain. Every countably based locally compact sober space is\nquasi-Polish, hence every \\omega-continuous domain is quasi-Polish. A\nmetrizable space is quasi-Polish if and only if it is Polish. We show that the\nBorel hierarchy on an uncountable quasi-Polish space does not collapse, and\nthat the Hausdorff-Kuratowski theorem generalizes to all quasi-Polish spaces.\n", "versions": [{"version": "v1", "created": "Sat, 6 Aug 2011 03:52:15 GMT"}, {"version": "v2", "created": "Tue, 6 Nov 2012 02:59:46 GMT"}], "update_date": "2012-11-07", "authors_parsed": [["de Brecht", "Matthew", ""]]}, {"id": "1108.1452", "submitter": "EPTCS", "authors": "Luca Aceto (Reykjavik University), Mohammad Reza Mousavi (Eindhoven\n  University of Technology)", "title": "Proceedings First International Workshop on Process Algebra and\n  Coordination", "comments": null, "journal-ref": "EPTCS 60, 2011", "doi": "10.4204/EPTCS.60", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Process algebra provides abstract and rigorous means for studying\ncommunicating concurrent systems. Coordination languages also provide abstract\nmeans for the specifying and programming communication of components. Hence,\nthe two fields seem to have very much in common and the link between these two\nresearch areas have been established formally by means of several translations,\nmainly from coordination languages to process algebras. There have also been\nproposals of process algebras whose communication policy is inspired by the one\nunderlying coordination languages.\n  The aim of this workshop was to push the state of the art in the study of the\nconnections between process algebra and coordination languages by bringing\ntogether experts as well as young researchers from the two fields to\ncommunicate their ideas and findings. It includes both contributed and invited\npapers that have been presented during the one day meeting on Process Algebra\nand Coordination (PACO 2011) which took place on June 9, 2011 in Reykjavik,\nIceland.\n", "versions": [{"version": "v1", "created": "Sat, 6 Aug 2011 05:23:21 GMT"}], "update_date": "2011-08-09", "authors_parsed": [["Aceto", "Luca", "", "Reykjavik University"], ["Mousavi", "Mohammad Reza", "", "Eindhoven\n  University of Technology"]]}, {"id": "1108.1482", "submitter": "Nikolaos Triantafyllou", "authors": "Nikolaos Triantafyllou, Katerina Ksystra, Petros Stefaneas and\n  Panayiotis Frangos", "title": "Applying Algebraic Specifications on Digital Right Management Systems", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Digital Right Management (DRM) Systems have been created to meet the need for\ndigital content protection and distribution. In this paper we present some of\nthe directions of our ongoing research to apply algebraic specification\ntechniques on mobile DRM systems.\n", "versions": [{"version": "v1", "created": "Sat, 6 Aug 2011 13:54:17 GMT"}], "update_date": "2011-08-09", "authors_parsed": [["Triantafyllou", "Nikolaos", ""], ["Ksystra", "Katerina", ""], ["Stefaneas", "Petros", ""], ["Frangos", "Panayiotis", ""]]}, {"id": "1108.1861", "submitter": "EPTCS", "authors": "Suzana Andova (Eindhoven University of Technology), Luuk Groenewegen\n  (Leiden University), Erik de Vink (Eindhoven University of Technology)", "title": "Towards reduction of Paradigm coordination models", "comments": "In Proceedings PACO 2011, arXiv:1108.1452", "journal-ref": "EPTCS 60, 2011, pp. 1-18", "doi": "10.4204/EPTCS.60.1", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The coordination modelling language Paradigm addresses collaboration between\ncomponents in terms of dynamic constraints. Within a Paradigm model, component\ndynamics are consistently specified at a detailed and a global level of\nabstraction. To enable automated verification of Paradigm models, a translation\nof Paradigm into process algebra has been defined in previous work. In this\npaper we investigate, guided by a client-server example, reduction of Paradigm\nmodels based on a notion of global inertness. Representation of Paradigm models\nas process algebraic specifications helps to establish a property-preserving\nequivalence relation between the original and the reduced Paradigm model.\nExperiments indicate that in this way larger Paradigm models can be analyzed.\n", "versions": [{"version": "v1", "created": "Tue, 9 Aug 2011 06:38:19 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Andova", "Suzana", "", "Eindhoven University of Technology"], ["Groenewegen", "Luuk", "", "Leiden University"], ["de Vink", "Erik", "", "Eindhoven University of Technology"]]}, {"id": "1108.1863", "submitter": "EPTCS", "authors": "Jos Baeten (Department of Mechanical Engineering, Eindhoven University\n  of Technology), Bert van Beek (Department of Mechanical Engineering,\n  Eindhoven University of Technology), Allan van Hulst (Department of\n  Mechanical Engineering, Eindhoven University of Technology), Jasen Markovski\n  (Department of Mechanical Engineering, Eindhoven University of Technology)", "title": "A Process Algebra for Supervisory Coordination", "comments": "In Proceedings PACO 2011, arXiv:1108.1452", "journal-ref": "EPTCS 60, 2011, pp. 36-55", "doi": "10.4204/EPTCS.60.3", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A supervisory controller controls and coordinates the behavior of different\ncomponents of a complex machine by observing their discrete behaviour.\nSupervisory control theory studies automated synthesis of controller models,\nknown as supervisors, based on formal models of the machine components and a\nformalization of the requirements. Subsequently, code generation can be used to\nimplement this supervisor in software, on a PLC, or embedded microprocessor. In\nthis article, we take a closer look at the control loop that couples the\nsupervisory controller and the machine. We model both event-based and\nstate-based observations using process algebra and bisimulation-based\nsemantics. The main application area of supervisory control that we consider is\ncoordination, referred to as supervisory coordination, and we give an academic\nand an industrial example, discussing the process-theoretic concepts employed.\n", "versions": [{"version": "v1", "created": "Tue, 9 Aug 2011 06:38:31 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Baeten", "Jos", "", "Department of Mechanical Engineering, Eindhoven University\n  of Technology"], ["van Beek", "Bert", "", "Department of Mechanical Engineering,\n  Eindhoven University of Technology"], ["van Hulst", "Allan", "", "Department of\n  Mechanical Engineering, Eindhoven University of Technology"], ["Markovski", "Jasen", "", "Department of Mechanical Engineering, Eindhoven University of Technology"]]}, {"id": "1108.1864", "submitter": "EPTCS", "authors": "Giorgio Delzanno, Arnaud Sangnier, Gianluigi Zavattaro", "title": "Parameterized Verification of Safety Properties in Ad Hoc Network\n  Protocols", "comments": "In Proceedings PACO 2011, arXiv:1108.1452", "journal-ref": "EPTCS 60, 2011, pp. 56-65", "doi": "10.4204/EPTCS.60.4", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We summarize the main results proved in recent work on the parameterized\nverification of safety properties for ad hoc network protocols. We consider a\nmodel in which the communication topology of a network is represented as a\ngraph. Nodes represent states of individual processes. Adjacent nodes represent\nsingle-hop neighbors. Processes are finite state automata that communicate via\nselective broadcast messages. Reception of a broadcast is restricted to\nsingle-hop neighbors. For this model we consider a decision problem that can be\nexpressed as the verification of the existence of an initial topology in which\nthe execution of the protocol can lead to a configuration with at least one\nnode in a certain state. The decision problem is parametric both on the size\nand on the form of the communication topology of the initial configurations. We\ndraw a complete picture of the decidability and complexity boundaries of this\nproblem according to various assumptions on the possible topologies.\n", "versions": [{"version": "v1", "created": "Tue, 9 Aug 2011 06:38:39 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Delzanno", "Giorgio", ""], ["Sangnier", "Arnaud", ""], ["Zavattaro", "Gianluigi", ""]]}, {"id": "1108.1865", "submitter": "EPTCS", "authors": "Marco Bernardo (Dipartimento di Scienze di Base e Fondamenti --\n  Universita' di Urbino -- Italy), Rocco De Nicola (IMT -- Institute for\n  Advanced Studies Lucca -- Italy and Dipartimento di Sistemi e Informatica --\n  Universita' di Firenze -- Italy), Michele Loreti (Dipartimento di Sistemi e\n  Informatica -- Universita' di Firenze -- Italy)", "title": "Uniform Labeled Transition Systems for Nondeterministic, Probabilistic,\n  and Stochastic Process Calculi", "comments": "In Proceedings PACO 2011, arXiv:1108.1452", "journal-ref": "EPTCS 60, 2011, pp. 66-75", "doi": "10.4204/EPTCS.60.5", "report-no": null, "categories": "cs.DC cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Labeled transition systems are typically used to represent the behavior of\nnondeterministic processes, with labeled transitions defining a one-step state\nto-state reachability relation. This model has been recently made more general\nby modifying the transition relation in such a way that it associates with any\nsource state and transition label a reachability distribution, i.e., a function\nmapping each possible target state to a value of some domain that expresses the\ndegree of one-step reachability of that target state. In this extended\nabstract, we show how the resulting model, called ULTraS from Uniform Labeled\nTransition System, can be naturally used to give semantics to a fully\nnondeterministic, a fully probabilistic, and a fully stochastic variant of a\nCSP-like process language.\n", "versions": [{"version": "v1", "created": "Tue, 9 Aug 2011 06:38:45 GMT"}], "update_date": "2011-08-10", "authors_parsed": [["Bernardo", "Marco", "", "Dipartimento di Scienze di Base e Fondamenti --\n  Universita' di Urbino -- Italy"], ["De Nicola", "Rocco", "", "IMT -- Institute for\n  Advanced Studies Lucca -- Italy and Dipartimento di Sistemi e Informatica --\n  Universita' di Firenze -- Italy"], ["Loreti", "Michele", "", "Dipartimento di Sistemi e\n  Informatica -- Universita' di Firenze -- Italy"]]}, {"id": "1108.2085", "submitter": "EPTCS", "authors": "Laura Kovacs (TU Vienna, Austria), Rosario Pugliese (DSI Univ. of\n  Florence, Italy), Francesco Tiezzi (IMT Lucca, Italy)", "title": "Proceedings 7th International Workshop on Automated Specification and\n  Verification of Web Systems", "comments": "EPTCS 61, 2011", "journal-ref": null, "doi": "10.4204/EPTCS.61", "report-no": null, "categories": "cs.SE cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the final and revised versions of the papers presented\nat the 7th International Workshop on Automated Specification and Verification\nof Web Systems (WWV 2011). The workshop was held in Reykjavik, Iceland, on June\n9, 2011, as part of DisCoTec 2011. The aim of the WWV workshop series is to\nprovide an interdisciplinary forum to facilitate the cross-fertilization and\nthe advancement of hybrid methods that exploit concepts and tools drawn from\nRule-based programming, Software engineering, Formal methods and Web-oriented\nresearch. Nowadays, indeed, many companies and institutions have diverted their\nWeb sites into interactive, completely-automated, Web-based applications for,\ne.g., e-business, e-learning, e-government, and e-health. The increased\ncomplexity and the explosive growth of Web systems have made their design and\nimplementation a challenging task. Systematic, formal approaches to their\nspecification and verification can permit to address the problems of this\nspecific domain by means of automated and effective techniques and tools. In\nresponse to this year's call for papers, we received 9 paper submissions. The\nProgram Committee of WWV 2011 collected three reviews for each paper and held\nan electronic discussion leading to the selection of 7 papers for presentation\nat the workshop. In addition to the selected papers, the scientific programme\nincluded an invited lecture by Elie Najm.\n", "versions": [{"version": "v1", "created": "Wed, 10 Aug 2011 02:50:25 GMT"}], "update_date": "2011-08-11", "authors_parsed": [["Kovacs", "Laura", "", "TU Vienna, Austria"], ["Pugliese", "Rosario", "", "DSI Univ. of\n  Florence, Italy"], ["Tiezzi", "Francesco", "", "IMT Lucca, Italy"]]}, {"id": "1108.2115", "submitter": "Hans van Ditmarsch", "authors": "Hans van Ditmarsch", "title": "The Ditmarsch Tale of Wonders - The Dynamics of Lying", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a dynamic logic of lying, wherein a 'lie that phi' (where phi is a\nformula in the logic) is an action in the sense of dynamic modal logic, that is\ninterpreted as a state transformer relative to the formula phi. The states that\nare being transformed are pointed Kripke models encoding the uncertainty of\nagents about their beliefs. Lies can be about factual propositions but also\nabout modal formulas, such as the beliefs of other agents or the belief\nconsequences of the lies of other agents. We distinguish (i) an outside\nobserver who is lying to an agent that is modelled in the system, from (ii) one\nagent who is lying to another agent, and where both are modelled in the system.\nFor either case, we further distinguish (iii) the agent who believes everything\nthat it is told (even at the price of inconsistency), from (iv) the agent who\nonly believes what it is told if that is consistent with its current beliefs,\nand from (v) the agent who believes everything that it is told by consistently\nrevising its current beliefs. The logics have complete axiomatizations, which\ncan most elegantly be shown by way of their embedding in what is known as\naction model logic or the extension of that logic to belief revision.\n", "versions": [{"version": "v1", "created": "Wed, 10 Aug 2011 07:55:15 GMT"}, {"version": "v2", "created": "Wed, 21 Mar 2012 16:08:53 GMT"}], "update_date": "2012-03-22", "authors_parsed": [["van Ditmarsch", "Hans", ""]]}, {"id": "1108.2348", "submitter": "EPTCS", "authors": "Petros Papapanagiotou (University of Edinburgh), Jacques D. Fleuriot\n  (University of Edinburgh)", "title": "A theorem proving framework for the formal verification of Web Services\n  Composition", "comments": "In Proceedings WWV 2011, arXiv:1108.2085", "journal-ref": "EPTCS 61, 2011, pp. 1-16", "doi": "10.4204/EPTCS.61.1", "report-no": null, "categories": "cs.LO cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a rigorous framework for the composition of Web Services within a\nhigher order logic theorem prover. Our approach is based on the\nproofs-as-processes paradigm that enables inference rules of Classical Linear\nLogic (CLL) to be translated into pi-calculus processes. In this setting,\ncomposition is achieved by representing available web services as CLL\nsentences, proving the requested composite service as a conjecture, and then\nextracting the constructed pi-calculus term from the proof. Our framework,\nimplemented in HOL Light, not only uses an expressive logic that allows us to\nincorporate multiple Web Services properties in the composition process, but\nalso provides guarantees of soundness and correctness for the composition.\n", "versions": [{"version": "v1", "created": "Thu, 11 Aug 2011 08:51:25 GMT"}], "update_date": "2011-08-12", "authors_parsed": [["Papapanagiotou", "Petros", "", "University of Edinburgh"], ["Fleuriot", "Jacques D.", "", "University of Edinburgh"]]}, {"id": "1108.2358", "submitter": "EPTCS", "authors": "Mar\\'ia Alpuente (Universidad Polit\\'ecnica de Valencia), Demis Ballis\n  (University of Udine), Javier Espert (Universidad Polit\\'ecnica de Valencia),\n  Francisco Frechina (Universidad Polit\\'ecnica de Valencia), Daniel Romero\n  (Universidad Polit\\'ecnica de Valencia)", "title": "Debugging of Web Applications with Web-TLR", "comments": "In Proceedings WWV 2011, arXiv:1108.2085", "journal-ref": "EPTCS 61, 2011, pp. 66-80", "doi": "10.4204/EPTCS.61.5", "report-no": null, "categories": "cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Web-TLR is a Web verification engine that is based on the well-established\nRewriting Logic--Maude/LTLR tandem for Web system specification and\nmodel-checking. In Web-TLR, Web applications are expressed as rewrite theories\nthat can be formally verified by using the Maude built-in LTLR model-checker.\nWhenever a property is refuted, a counterexample trace is delivered that\nreveals an undesired, erroneous navigation sequence. Unfortunately, the\nanalysis (or even the simple inspection) of such counterexamples may be\nunfeasible because of the size and complexity of the traces under examination.\nIn this paper, we endow Web-TLR with a new Web debugging facility that supports\nthe efficient manipulation of counterexample traces. This facility is based on\na backward trace-slicing technique for rewriting logic theories that allows the\npieces of information that we are interested to be traced back through inverse\nrewrite sequences. The slicing process drastically simplifies the computation\ntrace by dropping useless data that do not influence the final result. By using\nthis facility, the Web engineer can focus on the relevant fragments of the\nfailing application, which greatly reduces the manual debugging effort and also\ndecreases the number of iterative verifications.\n", "versions": [{"version": "v1", "created": "Thu, 11 Aug 2011 09:27:47 GMT"}], "update_date": "2011-08-12", "authors_parsed": [["Alpuente", "María", "", "Universidad Politécnica de Valencia"], ["Ballis", "Demis", "", "University of Udine"], ["Espert", "Javier", "", "Universidad Politécnica de Valencia"], ["Frechina", "Francisco", "", "Universidad Politécnica de Valencia"], ["Romero", "Daniel", "", "Universidad Politécnica de Valencia"]]}, {"id": "1108.2359", "submitter": "EPTCS", "authors": "Letterio Galletta (Dipartimento di Informatica, Universit\\`a di Pisa),\n  Giorgio Levi (Dipartimento di Informatica, Universit\\`a di Pisa)", "title": "An Abstract Semantics for Inference of Types and Effects in a Multi-Tier\n  Web Language", "comments": "In Proceedings WWV 2011, arXiv:1108.2085", "journal-ref": "EPTCS 61, 2011, pp. 81-95", "doi": "10.4204/EPTCS.61.6", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Types-and-effects are type systems, which allow one to express general\nsemantic properties and to statically reason about program's execution. They\nhave been widely exploited to specify static analyses, for example to track\ncomputational side effects, exceptions and communications in concurrent\nprograms. In this paper we adopt abstract interpretation techniques to\nreconstruct (following the Cousot's methodology) a types-and-effects system\ndeveloped to handle security problems of a multi-tier web language. Our\nreconstruction allows us to show that this types-and-effects system is not\nsound with respect to the semantics of the language. In addition, we correct\nthe soundness issues in the analysis and systematically construct a correct\nanalyser.\n", "versions": [{"version": "v1", "created": "Thu, 11 Aug 2011 09:27:54 GMT"}], "update_date": "2011-08-12", "authors_parsed": [["Galletta", "Letterio", "", "Dipartimento di Informatica, Università di Pisa"], ["Levi", "Giorgio", "", "Dipartimento di Informatica, Università di Pisa"]]}, {"id": "1108.2360", "submitter": "EPTCS", "authors": "Marco Giunti (INRIA and LIX, Ecole Polytechnique, France)", "title": "A type checking algorithm for qualified session types", "comments": "In Proceedings WWV 2011, arXiv:1108.2085", "journal-ref": "EPTCS 61, 2011, pp. 96-114", "doi": "10.4204/EPTCS.61.7", "report-no": null, "categories": "cs.PL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a type checking algorithm for establishing a session-based\ndiscipline in the pi calculus of Milner, Parrow and Walker. Our session types\nare qualified as linear or unrestricted. Linearly typed communication channels\nare guaranteed to occur in exactly one thread, possibly multiple times;\nafterwards they evolve as unrestricted channels. Session protocols are\ndescribed by a type constructor that denotes the two ends of one and the same\ncommunication channel. We ensure the soundness of the algorithm by showing that\nprocesses consuming all linear resources are accepted by a type system\npreserving typings during the computation and that type checking is consistent\nw.r.t. structural congruence.\n", "versions": [{"version": "v1", "created": "Thu, 11 Aug 2011 09:28:01 GMT"}], "update_date": "2011-08-12", "authors_parsed": [["Giunti", "Marco", "", "INRIA and LIX, Ecole Polytechnique, France"]]}, {"id": "1108.2796", "submitter": "EPTCS", "authors": "M.A. Reniers (Eindhoven University of Technology, The Netherlands), P.\n  Sobocinski (University of Southampton, United Kingdom)", "title": "Proceedings Eight Workshop on Structural Operational Semantics 2011", "comments": null, "journal-ref": "EPTCS 62, 2011", "doi": "10.4204/EPTCS.62", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of SOS 2011, the Eight Workshop on\nStructural Operational Semantics, held on the 5th of September 2011 in Aachen,\nGermany as an affiliated workshop of CONCUR 2011, the 22nd International\nConference on Concurrency Theory.\n  Structural operational semantics (SOS) provides a framework for giving\noperational semantics to programming and specification languages. A growing\nnumber of programming languages from commercial and academic spheres have been\ngiven usable semantic descriptions by means of structural operational\nsemantics. Because of its intuitive appeal and flexibility, structural\noperational semantics has found considerable application in the study of the\nsemantics of concurrent processes. It is also a viable alternative to\ndenotational semantics in the static analysis of programs, and in proving\ncompiler correctness. Moreover, it has found application in emerging areas of\ncomputing such as probabilistic systems and systems biology.\n  Structural operational semantics has been successfully applied as a formal\ntool to establish results that hold for classes of process description\nlanguages. This has allowed for the generalization of well-known results in the\nfield of process algebra, and for the development of a meta-theory for process\ncalculi based on the realization that many of the results in this field only\ndepend upon general semantic properties of language constructs.\n  The workshop is a forum for researchers, students and practitioners\ninterested in new developments and directions for future investigations. One of\nthe specific goals of the workshop is to provide a meeting point for the\nconcurrency and programming language communities. Another goal is the\ndissemination of the theory and practice of SOS amongst postgraduate students\nand young researchers worldwide.\n", "versions": [{"version": "v1", "created": "Sat, 13 Aug 2011 14:27:59 GMT"}], "update_date": "2011-08-16", "authors_parsed": [["Reniers", "M. A.", "", "Eindhoven University of Technology, The Netherlands"], ["Sobocinski", "P.", "", "University of Southampton, United Kingdom"]]}, {"id": "1108.2864", "submitter": "Olivier Finkel", "authors": "Olivier Finkel (ELM)", "title": "Some Problems in Automata Theory Which Depend on the Models of Set\n  Theory", "comments": "To appear in the journal RAIRO-Theoretical Informatics and\n  Applications", "journal-ref": "RAIRO - Theoretical Informatics and Applications 45, 4 (2011) 383\n  - 397", "doi": "10.1051/ita/2011113", "report-no": null, "categories": "cs.FL cs.CC cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that some fairly basic questions on automata reading infinite words\ndepend on the models of the axiomatic system ZFC. It is known that there are\nonly three possibilities for the cardinality of the complement of an\nomega-language $L(A)$ accepted by a B\\\"uchi 1-counter automaton $A$. We prove\nthe following surprising result: there exists a 1-counter B\\\"uchi automaton $A$\nsuch that the cardinality of the complement $L(A)^-$ of the omega-language\n$L(A)$ is not determined by ZFC: (1). There is a model $V_1$ of ZFC in which\n$L(A)^-$ is countable. (2). There is a model $V_2$ of ZFC in which $L(A)^-$ has\ncardinal $2^{\\aleph_0}$. (3). There is a model $V_3$ of ZFC in which $L(A)^-$\nhas cardinal $\\aleph_1$ with $\\aleph_0<\\aleph_1<2^{\\aleph_0}$. We prove a very\nsimilar result for the complement of an infinitary rational relation accepted\nby a 2-tape B\\\"uchi automaton $B$. As a corollary, this proves that the\nContinuum Hypothesis may be not satisfied for complements of 1-counter\nomega-languages and for complements of infinitary rational relations accepted\nby 2-tape B\\\"uchi automata. We infer from the proof of the above results that\nbasic decision problems about 1-counter omega-languages or infinitary rational\nrelations are actually located at the third level of the analytical hierarchy.\nIn particular, the problem to determine whether the complement of a 1-counter\nomega-language (respectively, infinitary rational relation) is countable is in\n$\\Sigma_3^1 \\setminus (\\Pi_2^1 \\cup \\Sigma_2^1)$. This is rather surprising if\ncompared to the fact that it is decidable whether an infinitary rational\nrelation is countable (respectively, uncountable).\n", "versions": [{"version": "v1", "created": "Sun, 14 Aug 2011 12:14:22 GMT"}], "update_date": "2012-02-02", "authors_parsed": [["Finkel", "Olivier", "", "ELM"]]}, {"id": "1108.3033", "submitter": "Karl Schlechta", "authors": "Dov Gabbay, Karl Schlechta", "title": "Equilibria und weiteres Heiteres II", "comments": "arXiv admin note: incorporates entirety of text from arXiv:0907.4017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate several technical and conceptual questions.\n  Our main subject is the investigation of independence as a ternary relation\nin the context of non-monotonic logic. In the context of probability, this\ninvestigation was started by W.Spohn et al., and then followed by J.Pearl. We\nlook at products of function sets, and thus continue our own investigation of\nindependence in non-monotonic logic. We show that a finite characterization of\nthis relation in our context is impossible, and indicate how to construct all\nvalid rules.\n", "versions": [{"version": "v1", "created": "Mon, 15 Aug 2011 16:59:07 GMT"}, {"version": "v2", "created": "Fri, 9 Sep 2011 11:56:02 GMT"}, {"version": "v3", "created": "Sat, 17 Sep 2011 19:36:06 GMT"}, {"version": "v4", "created": "Sun, 16 Oct 2011 05:37:12 GMT"}, {"version": "v5", "created": "Tue, 31 Jan 2012 09:18:23 GMT"}, {"version": "v6", "created": "Wed, 25 Apr 2012 06:28:15 GMT"}], "update_date": "2012-04-26", "authors_parsed": [["Gabbay", "Dov", ""], ["Schlechta", "Karl", ""]]}, {"id": "1108.3124", "submitter": "EPTCS", "authors": "Luca Aceto (Reykjavik University, Iceland), Georgiana Caltais\n  (Reykjavik University, Iceland), Eugen-Ioan Goriac (Reykjavik University,\n  Iceland), Anna Ingolfsdottir (Reykjavik University, Iceland)", "title": "Axiomatizing GSOS with Predicates", "comments": "In Proceedings SOS 2011, arXiv:1108.2796", "journal-ref": "EPTCS 62, 2011, pp. 1-15", "doi": "10.4204/EPTCS.62.1", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce an extension of the GSOS rule format with\npredicates such as termination, convergence and divergence. For this format we\ngeneralize the technique proposed by Aceto, Bloom and Vaandrager for the\nautomatic generation of ground-complete axiomatizations of bisimilarity over\nGSOS systems. Our procedure is implemented in a tool that receives SOS\nspecifications as input and derives the corresponding axiomatizations\nautomatically. This paves the way to checking strong bisimilarity over process\nterms by means of theorem-proving techniques.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 00:23:36 GMT"}], "update_date": "2011-08-17", "authors_parsed": [["Aceto", "Luca", "", "Reykjavik University, Iceland"], ["Caltais", "Georgiana", "", "Reykjavik University, Iceland"], ["Goriac", "Eugen-Ioan", "", "Reykjavik University,\n  Iceland"], ["Ingolfsdottir", "Anna", "", "Reykjavik University, Iceland"]]}, {"id": "1108.3125", "submitter": "EPTCS", "authors": "Ken Madlener (Radboud University Nijmegen, The Netherlands), Sjaak\n  Smetsers (Radboud University Nijmegen, The Netherlands), Marko van Eekelen\n  (Radboud University Nijmegen, The Netherlands)", "title": "Formal Component-Based Semantics", "comments": "In Proceedings SOS 2011, arXiv:1108.2796", "journal-ref": "EPTCS 62, 2011, pp. 17-29", "doi": "10.4204/EPTCS.62.2", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the proposed solutions for improving the scalability of semantics of\nprogramming languages is Component-Based Semantics, introduced by Peter D.\nMosses. It is expected that this framework can also be used effectively for\nmodular meta theoretic reasoning. This paper presents a formalization of\nComponent-Based Semantics in the theorem prover Coq. It is based on Modular\nSOS, a variant of SOS, and makes essential use of dependent types, while\nprofiting from type classes. This formalization constitutes a contribution\ntowards modular meta theoretic formalizations in theorem provers. As a small\nexample, a modular proof of determinism of a mini-language is developed.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 00:23:42 GMT"}], "update_date": "2011-08-17", "authors_parsed": [["Madlener", "Ken", "", "Radboud University Nijmegen, The Netherlands"], ["Smetsers", "Sjaak", "", "Radboud University Nijmegen, The Netherlands"], ["van Eekelen", "Marko", "", "Radboud University Nijmegen, The Netherlands"]]}, {"id": "1108.3126", "submitter": "EPTCS", "authors": "Asiri Rathnayake (University of Birmingham, United Kingdom), Hayo\n  Thielecke (University of Birmingham, United Kingdom)", "title": "Regular Expression Matching and Operational Semantics", "comments": "In Proceedings SOS 2011, arXiv:1108.2796", "journal-ref": "EPTCS 62, 2011, pp. 31-45", "doi": "10.4204/EPTCS.62.3", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many programming languages and tools, ranging from grep to the Java String\nlibrary, contain regular expression matchers. Rather than first translating a\nregular expression into a deterministic finite automaton, such implementations\ntypically match the regular expression on the fly. Thus they can be seen as\nvirtual machines interpreting the regular expression much as if it were a\nprogram with some non-deterministic constructs such as the Kleene star. We\nformalize this implementation technique for regular expression matching using\noperational semantics. Specifically, we derive a series of abstract machines,\nmoving from the abstract definition of matching to increasingly realistic\nmachines. First a continuation is added to the operational semantics to\ndescribe what remains to be matched after the current expression. Next, we\nrepresent the expression as a data structure using pointers, which enables\nredundant searches to be eliminated via testing for pointer equality. From\nthere, we arrive both at Thompson's lockstep construction and a machine that\nperforms some operations in parallel, suitable for implementation on a large\nnumber of cores, such as a GPU. We formalize the parallel machine using process\nalgebra and report some preliminary experiments with an implementation on a\ngraphics processor using CUDA.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 00:23:47 GMT"}], "update_date": "2011-08-17", "authors_parsed": [["Rathnayake", "Asiri", "", "University of Birmingham, United Kingdom"], ["Thielecke", "Hayo", "", "University of Birmingham, United Kingdom"]]}, {"id": "1108.3127", "submitter": "EPTCS", "authors": "David Romero-Hern\\'andez (Universidad Complutense de Madrid, Spain),\n  David de Frutos-Escrig (Universidad Complutense de Madrid, Spain)", "title": "On the Unification of Process Semantics: Logical Semantics", "comments": "In Proceedings SOS 2011, arXiv:1108.2796", "journal-ref": "EPTCS 62, 2011, pp. 47-61", "doi": "10.4204/EPTCS.62.4", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We continue with the task of obtaining a unifying view of process semantics\nby considering in this case the logical characterization of the semantics. We\nstart by considering the classic linear time-branching time spectrum developed\nby R.J. van Glabbeek. He provided a logical characterization of most of the\nsemantics in his spectrum but, without following a unique pattern. In this\npaper, we present a uniform logical characterization of all the semantics in\nthe enlarged spectrum. The common structure of the formulas that constitute all\nthe corresponding logics gives us a much clearer picture of the spectrum,\nclarifying the relations between the different semantics, and allows us to\ndevelop generic proofs of some general properties of the semantics.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 00:23:54 GMT"}], "update_date": "2011-08-17", "authors_parsed": [["Romero-Hernández", "David", "", "Universidad Complutense de Madrid, Spain"], ["de Frutos-Escrig", "David", "", "Universidad Complutense de Madrid, Spain"]]}, {"id": "1108.3260", "submitter": "Esra Erdem", "authors": "Thomas Eiter and Esra Erdem and Halit Erdogan and Michael Fink", "title": "Finding Similar/Diverse Solutions in Answer Set Programming", "comments": "57 pages, 17 figures, 4 tables. To appear in Theory and Practice of\n  Logic Programming (TPLP)", "journal-ref": "Theory and Practice of Logic Programming, 13(3), 303-359, 2013", "doi": "10.1017/S1471068411000548", "report-no": null, "categories": "cs.AI cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For some computational problems (e.g., product configuration, planning,\ndiagnosis, query answering, phylogeny reconstruction) computing a set of\nsimilar/diverse solutions may be desirable for better decision-making. With\nthis motivation, we studied several decision/optimization versions of this\nproblem in the context of Answer Set Programming (ASP), analyzed their\ncomputational complexity, and introduced offline/online methods to compute\nsimilar/diverse solutions of such computational problems with respect to a\ngiven distance function. All these methods rely on the idea of computing\nsolutions to a problem by means of finding the answer sets for an ASP program\nthat describes the problem. The offline methods compute all solutions in\nadvance using the ASP formulation of the problem with an ASP solver, like\nClasp, and then identify similar/diverse solutions using clustering methods.\nThe online methods compute similar/diverse solutions following one of the three\napproaches: by reformulating the ASP representation of the problem to compute\nsimilar/diverse solutions at once using an ASP solver; by computing\nsimilar/diverse solutions iteratively (one after other) using an ASP solver; by\nmodifying the search algorithm of an ASP solver to compute similar/diverse\nsolutions incrementally. We modified Clasp to implement the last online method\nand called it Clasp-NK. In the first two online methods, the given distance\nfunction is represented in ASP; in the last one it is implemented in C++. We\nshowed the applicability and the effectiveness of these methods on\nreconstruction of similar/diverse phylogenies for Indo-European languages, and\non several planning problems in Blocks World. We observed that in terms of\ncomputational efficiency the last online method outperforms the others; also it\nallows us to compute similar/diverse solutions when the distance function\ncannot be represented in ASP.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 14:59:44 GMT"}], "update_date": "2013-09-19", "authors_parsed": [["Eiter", "Thomas", ""], ["Erdem", "Esra", ""], ["Erdogan", "Halit", ""], ["Fink", "Michael", ""]]}, {"id": "1108.3347", "submitter": "William  Gasarch", "authors": "William Gasarch", "title": "Proving programs terminate using well orderings, Ramsey Theory, and\n  Matrices", "comments": "While this is classified under Combinatorics (to tell combinatorists\n  that someone is using their stuff) it should also be of interest to Logicians\n  and Computer Scientists", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many programs allow the user to input data several times during its\nexecution. If the program runs forever the user may input data infinitely\noften. A program terminates if it terminates no matter what the user does.\n  We discuss various ways to prove that program terminates. The proofs use well\norderings, Ramsey Theory, and Matrices. These techniques are used by real\nprogram checkers.\n", "versions": [{"version": "v1", "created": "Tue, 16 Aug 2011 20:24:04 GMT"}, {"version": "v2", "created": "Tue, 13 Nov 2012 16:38:51 GMT"}, {"version": "v3", "created": "Mon, 3 Nov 2014 13:36:46 GMT"}], "update_date": "2014-11-04", "authors_parsed": [["Gasarch", "William", ""]]}, {"id": "1108.3424", "submitter": "Bogdan Aman", "authors": "Roberto Barbuti, Diletta Romana Cacciagrano, Andrea\n  Maggiolo-Schettini, Paolo Milazzo, Luca Tesei", "title": "A Testing Framework for P Systems", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/04", "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Testing equivalence was originally defined by De Nicola and Hennessy in a\nprocess algebraic setting (CCS) with the aim of defining an equivalence\nrelation between processes being less discriminating than bisimulation and with\na natural interpretation in the practice of system development. Finite\ncharacterizations of the defined preorders and relations led to the possibility\nof verification by comparing an implementation with a specification in a\nsetting where systems were seen as black boxes with input and output\ncapabilities, thus neglecting internal undetectable behaviours.\n  In this paper, we start defining a porting of the well-established testing\ntheory into membrane computing, in order to investigate possible benefits in\nterms of inherited analysis/verification techniques and interesting biological\napplications. P Algebra, a process algebra for describing P Systems, is used as\na natural candidate for the porting since it enjoys the desirable property of\nbeing compositional and comes with other observational equivalences already\ndefined and studied.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 08:45:29 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Barbuti", "Roberto", ""], ["Cacciagrano", "Diletta Romana", ""], ["Maggiolo-Schettini", "Andrea", ""], ["Milazzo", "Paolo", ""], ["Tesei", "Luca", ""]]}, {"id": "1108.3426", "submitter": "Bogdan Aman", "authors": "Livio Bioglio, Cristina Calcagno, Mario Coppo, Ferruccio Damiani, Eva\n  Sciacca, Salvatore Spinella, Angelo Troina", "title": "A Spatial Calculus of Wrapped Compartments", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/05", "categories": "cs.LO cs.CE cs.ET q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Calculus of Wrapped Compartments (CWC) is a recently proposed modelling\nlanguage for the representation and simulation of biological systems behaviour.\nAlthough CWC has no explicit structure modelling a spatial geometry, its\ncompartment labelling feature can be exploited to model various examples of\nspatial interactions in a natural way. However, specifying large networks of\ncompartments may require a long modelling phase. In this work we present a\nsurface language for CWC that provides basic constructs for modelling spatial\ninteractions. These constructs can be compiled away to obtain a standard CWC\nmodel, thus exploiting the existing CWC simulation tool. A case study\nconcerning the modelling of Arbuscular Mychorrizal fungi growth is discussed.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 09:00:56 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Bioglio", "Livio", ""], ["Calcagno", "Cristina", ""], ["Coppo", "Mario", ""], ["Damiani", "Ferruccio", ""], ["Sciacca", "Eva", ""], ["Spinella", "Salvatore", ""], ["Troina", "Angelo", ""]]}, {"id": "1108.3429", "submitter": "Bogdan Aman", "authors": "Chiara Bodei, Linda Brodo", "title": "Brane Calculi Systems: A Static Preview of their Possible Behaviour", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/06", "categories": "cs.LO cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We improve the precision of a previous Control Flow Analysis for Brane\nCalculi, by adding information on the context and introducing causality\ninformation on the membranes. This allows us to prove some biological\nproperties on the behaviour of systems specified in Brane Calculi.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 09:04:48 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Bodei", "Chiara", ""], ["Brodo", "Linda", ""]]}, {"id": "1108.3436", "submitter": "Bogdan Aman", "authors": "Nicolas Sedlmajer, Didier Buchs, Steve Hostettler, Alban Linard,\n  Edmundo Lopez, Alexis Marechal", "title": "Modelling of Genetic Regulatory Mechanisms with GReg", "comments": "Presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": "MeCBIC/2011/12", "categories": "cs.LO cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most available tools propose simulation frameworks to study models of\nbiological systems, but simulation only explores a few of the most probable\nbehaviours of the system. On the contrary, techniques such as model checking,\ncoming from IT-systems analysis, explore all the possible behaviours of the\nmodelled systems, thus helping to identify emergent properties. A main drawback\nfrom most model checking tools in the life sciences domain is that they take as\ninput a language designed for computer scientists, that is not easily\nunderstood by non-expert users. We propose in this article an approach based on\nDSL. It provides a comprehensible language to describe the system while\nallowing the use of complex and powerful underlying model checking techniques.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 09:31:59 GMT"}], "update_date": "2011-08-18", "authors_parsed": [["Sedlmajer", "Nicolas", ""], ["Buchs", "Didier", ""], ["Hostettler", "Steve", ""], ["Linard", "Alban", ""], ["Lopez", "Edmundo", ""], ["Marechal", "Alexis", ""]]}, {"id": "1108.3558", "submitter": "Bogdan Aman", "authors": "Gabriel Ciobanu", "title": "Proceedings of the 5th Workshop on Membrane Computing and Biologically\n  Inspired Process Calculi (MeCBIC 2011)", "comments": "Papers presented at MeCBIC 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CE cs.ET cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume represents the proceedings of the 5th Workshop on Membrane\nComputing and Biologically Inspired Process Calculi (MeCBIC 2011), held\ntogether with the 12th International Conference on Membrane Computing on 23rd\nAugust 2011 in Fontainebleau, France.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 19:41:29 GMT"}, {"version": "v2", "created": "Thu, 18 Aug 2011 08:29:07 GMT"}], "update_date": "2011-08-19", "authors_parsed": [["Ciobanu", "Gabriel", ""]]}, {"id": "1108.3675", "submitter": "Nan Li", "authors": "Nan Li and Elena Dubrova", "title": "AIG Rewriting Using 5-Input Cuts", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rewriting is a common approach to logic optimization based on local\ntransformations. Most commercially available logic synthesis tools include a\nrewriting engine that may be used multiple times on the same netlist during\noptimization. This paper presents an And-Inverter graph based rewriting\nalgorithm using 5-input cuts. The best circuits are pre-computed for a subset\nof NPN classes of 5-variable functions. Cut enumeration and Boolean matching\nare used to identify replacement candidates. The presented approach is expected\nto complement existing rewriting approaches which are usually based on 4-input\ncuts. The experimental results show that, by adding the new rewriting algorithm\nto ABC synthesis tool, we can further reduce the area of heavily optimized\nlarge circuits by 5.57% on average.\n", "versions": [{"version": "v1", "created": "Thu, 18 Aug 2011 08:10:37 GMT"}], "update_date": "2011-08-19", "authors_parsed": [["Li", "Nan", ""], ["Dubrova", "Elena", ""]]}, {"id": "1108.3736", "submitter": "Massoud Pourmahdian", "authors": "Massoud Pourmahdian, Mahdi Ali-Akbari", "title": "Computational Models of Certain Hyperspaces of Quasi-metric Spaces", "comments": "25 pages", "journal-ref": "Logical Methods in Computer Science, Volume 7, Issue 4 (October\n  26, 2011) lmcs:886", "doi": "10.2168/LMCS-7(4:1)2011", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, for a given sequentially Yoneda-complete T_1 quasi-metric\nspace (X,d), the domain theoretic models of the hyperspace K_0(X) of nonempty\ncompact subsets of (X,d) are studied. To this end, the $\\omega$-Plotkin domain\nof the space of formal balls BX, denoted by CBX is considered. This domain is\ngiven as the chain completion of the set of all finite subsets of BX with\nrespect to the Egli-Milner relation. Further, a map $\\phi:K_0(X)\\rightarrow\nCBX$ is established and proved that it is an embedding whenever K_0(X) is\nequipped with the Vietoris topology and respectively CBX with the Scott\ntopology. Moreover, if any compact subset of (X,d) is d^{-1}-precompact, \\phi\nis an embedding with respect to the topology of Hausdorff quasi-metric H_d on\nK_0(X). Therefore, it is concluded that (CBX,\\sqsubseteq,\\phi) is an\n$\\omega$-computational model for the hyperspace K_0(X) endowed with the\nVietoris and respectively the Hausdorff topology. Next, an algebraic\nsequentially Yoneda-complete quasi-metric D on CBX$ is introduced in such a way\nthat the specialization order $\\sqsubseteq_D$ is equivalent to the usual\npartial order of CBX and, furthermore, $\\phi:({\\cal\nK}_0(X),H_d)\\rightarrow({\\bf C}{\\bf B}X,D)$ is an isometry. This shows that\n(CBX,\\sqsubseteq,\\phi,D) is a quantitative $\\omega$-computational model for\n(K_(X),H_d).\n", "versions": [{"version": "v1", "created": "Thu, 18 Aug 2011 12:21:27 GMT"}, {"version": "v2", "created": "Tue, 25 Oct 2011 11:50:19 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Pourmahdian", "Massoud", ""], ["Ali-Akbari", "Mahdi", ""]]}, {"id": "1108.3850", "submitter": "Juraj Dzifcak", "authors": "Chitta Baral and Juraj Dzifcak", "title": "Solving puzzles described in English by automated translation to answer\n  set programming and learning how to do that translation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a system capable of automatically solving combinatorial logic\npuzzles given in (simplified) English. It involves translating the English\ndescriptions of the puzzles into answer set programming(ASP) and using ASP\nsolvers to provide solutions of the puzzles. To translate the descriptions, we\nuse a lambda-calculus based approach using Probabilistic Combinatorial\nCategorial Grammars (PCCG) where the meanings of words are associated with\nparameters to be able to distinguish between multiple meanings of the same\nword. Meaning of many words and the parameters are learned. The puzzles are\nrepresented in ASP using an ontology which is applicable to a large set of\nlogic puzzles.\n", "versions": [{"version": "v1", "created": "Thu, 18 Aug 2011 20:17:58 GMT"}], "update_date": "2011-08-22", "authors_parsed": [["Baral", "Chitta", ""], ["Dzifcak", "Juraj", ""]]}, {"id": "1108.4032", "submitter": "Rory Lucyshyn-Wright", "authors": "Rory B.B. Lucyshyn-Wright", "title": "Totally distributive toposes", "comments": "Now includes extended result: The lex totally distributive categories\n  with a small set of generators are exactly the injective Grothendieck\n  toposes; Made changes to abstract and intro to reflect the enhanced result;\n  Changed formatting of diagrams", "journal-ref": "Journal of Pure and Applied Algebra 216 (2012) 2425-2431", "doi": "10.1016/j.jpaa.2012.03.018", "report-no": null, "categories": "math.CT cs.LO math.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A locally small category E is totally distributive (as defined by\nRosebrugh-Wood) if there exists a string of adjoint functors t -| c -| y, where\ny : E --> E^ is the Yoneda embedding. Saying that E is lex totally distributive\nif, moreover, the left adjoint t preserves finite limits, we show that the lex\ntotally distributive categories with a small set of generators are exactly the\ninjective Grothendieck toposes, studied by Johnstone and Joyal. We characterize\nthe totally distributive categories with a small set of generators as exactly\nthe essential subtoposes of presheaf toposes, studied by Kelly-Lawvere and\nKennett-Riehl-Roy-Zaks.\n", "versions": [{"version": "v1", "created": "Fri, 19 Aug 2011 19:53:47 GMT"}, {"version": "v2", "created": "Thu, 1 Sep 2011 19:56:23 GMT"}, {"version": "v3", "created": "Mon, 12 Sep 2011 19:56:16 GMT"}], "update_date": "2012-10-22", "authors_parsed": [["Lucyshyn-Wright", "Rory B. B.", ""]]}, {"id": "1108.4077", "submitter": "EPTCS", "authors": "Bas Luttik (Eindhoven University of Technology), Frank Valencia (CNRS\n  and LIX \\'Ecole Polytechnique)", "title": "Proceedings 18th International Workshop on Expressiveness in Concurrency", "comments": null, "journal-ref": "EPTCS 64, 2011", "doi": "10.4204/EPTCS.64", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 18th International Workshop on\nExpressiveness in Concurrency (EXPRESS 2011), which took place on 5th September\n2011 in Aachen, as a satellite workshop of CONCUR 2011. The EXPRESS workshop\nseries aim at bringing together researchers who are interested in the\nexpressiveness and comparison of formal models that broadly relate to\nconcurrency. In particular, this also includes emergent fields such as logic\nand interaction, game-theoretic models, and service-oriented computing.\n", "versions": [{"version": "v1", "created": "Sat, 20 Aug 2011 01:47:47 GMT"}], "update_date": "2011-08-23", "authors_parsed": [["Luttik", "Bas", "", "Eindhoven University of Technology"], ["Valencia", "Frank", "", "CNRS\n  and LIX École Polytechnique"]]}, {"id": "1108.4253", "submitter": "Thomas Braibant", "authors": "Thomas Braibant (LIG)", "title": "Coquet: a Coq library for verifying hardware", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new library to model and verify hardware circuits in the Coq\nproof assistant. This library allows one to easily build circuits by following\nthe usual pen-and-paper diagrams. We define a deep-embedding: we use a\n(dependently typed) data-type that models the architecture of circuits, and a\nmeaning function. We propose tactics that ease the reasoning about the behavior\nof the circuits, and we demonstrate that our approach is practicable by proving\nthe correctness of various circuits: a text-book divide and conquer adder of\nparametric size, some higher-order combinators of circuits, and some sequential\ncircuits: a buffer, and a register.\n", "versions": [{"version": "v1", "created": "Mon, 22 Aug 2011 08:14:38 GMT"}], "update_date": "2011-08-23", "authors_parsed": [["Braibant", "Thomas", "", "LIG"]]}, {"id": "1108.4368", "submitter": "Filip Maric", "authors": "Filip Maric (Faculty of Mathematics, University of Belgrade), Predrag\n  Janicic (Faculty of Mathematics, University of Belgrade)", "title": "Formalization of Abstract State Transition Systems for SAT", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 7, Issue 3 (September\n  28, 2011) lmcs:843", "doi": "10.2168/LMCS-7(3:19)2011", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a formalization of modern SAT solvers and their properties in a\nform of abstract state transition systems. SAT solving procedures are described\nas transition relations over states that represent the values of the solver's\nglobal variables. Several different SAT solvers are formalized, including both\nthe classical DPLL procedure and its state-of-the-art successors. The\nformalization is made within the Isabelle/HOL system and the total correctness\n(soundness, termination, completeness) is shown for each presented system (with\nrespect to a simple notion of satisfiability that can be manually checked). The\nsystems are defined in a general way and cover procedures used in a wide range\nof modern SAT solvers. Our formalization builds up on the previous work on\nstate transition systems for SAT, but it gives machine-verifiable proofs,\nsomewhat more general specifications, and weaker assumptions that ensure the\nkey correctness properties. The presented proofs of formal correctness of the\ntransition systems can be used as a key building block in proving correctness\nof SAT solvers by using other verification approaches.\n", "versions": [{"version": "v1", "created": "Mon, 22 Aug 2011 16:15:00 GMT"}, {"version": "v2", "created": "Tue, 27 Sep 2011 09:01:07 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Maric", "Filip", "", "Faculty of Mathematics, University of Belgrade"], ["Janicic", "Predrag", "", "Faculty of Mathematics, University of Belgrade"]]}, {"id": "1108.4464", "submitter": "EPTCS", "authors": "Luca Aceto, Ignacio F\\'abregas, David de Frutos-Escrig, Anna\n  Ing\\'olfsd\\'ottir, Miguel Palomino", "title": "Graphical representation of covariant-contravariant modal formulae", "comments": "In Proceedings EXPRESS 2011, arXiv:1108.4077", "journal-ref": "EPTCS 64, 2011, pp. 1-15", "doi": "10.4204/EPTCS.64.1", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Covariant-contravariant simulation is a combination of standard (covariant)\nsimulation, its contravariant counterpart and bisimulation. We have previously\nstudied its logical characterization by means of the covariant-contravariant\nmodal logic. Moreover, we have investigated the relationships between this\nmodel and that of modal transition systems, where two kinds of transitions (the\nso-called may and must transitions) were combined in order to obtain a simple\nframework to express a notion of refinement over state-transition models. In a\nclassic paper, Boudol and Larsen established a precise connection between the\ngraphical approach, by means of modal transition systems, and the logical\napproach, based on Hennessy-Milner logic without negation, to system\nspecification. They obtained a (graphical) representation theorem proving that\na formula can be represented by a term if, and only if, it is consistent and\nprime. We show in this paper that the formulae from the covariant-contravariant\nmodal logic that admit a \"graphical\" representation by means of processes,\nmodulo the covariant-contravariant simulation preorder, are also the consistent\nand prime ones. In order to obtain the desired graphical representation result,\nwe first restrict ourselves to the case of covariant-contravariant systems\nwithout bivariant actions. Bivariant actions can be incorporated later by means\nof an encoding that splits each bivariant action into its covariant and its\ncontravariant parts.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 01:23:02 GMT"}], "update_date": "2011-08-24", "authors_parsed": [["Aceto", "Luca", ""], ["Fábregas", "Ignacio", ""], ["de Frutos-Escrig", "David", ""], ["Ingólfsdóttir", "Anna", ""], ["Palomino", "Miguel", ""]]}, {"id": "1108.4466", "submitter": "EPTCS", "authors": "Flavio Corradini (University of Camerino), Maria Rita Di Berardini\n  (University of Camerino), Walter Vogler (University of Augsburg)", "title": "Read Operators and their Expressiveness in Process Algebras", "comments": "In Proceedings EXPRESS 2011, arXiv:1108.4077", "journal-ref": "EPTCS 64, 2011, pp. 31-43", "doi": "10.4204/EPTCS.64.3", "report-no": null, "categories": "cs.LO cs.DC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study two different ways to enhance PAFAS, a process algebra for modelling\nasynchronous timed concurrent systems, with non-blocking reading actions. We\nfirst add reading in the form of a read-action prefix operator. This operator\nis very flexible, but its somewhat complex semantics requires two types of\ntransition relations. We also present a read-set prefix operator with a simpler\nsemantics, but with syntactic restrictions. We discuss the expressiveness of\nread prefixes; in particular, we compare them to read-arcs in Petri nets and\njustify the simple semantics of the second variant by showing that its\nprocesses can be translated into processes of the first with timed-bisimilar\nbehaviour. It is still an open problem whether the first algebra is more\nexpressive than the second; we give a number of laws that are interesting in\ntheir own right, and can help to find a backward translation.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 01:23:16 GMT"}], "update_date": "2011-08-24", "authors_parsed": [["Corradini", "Flavio", "", "University of Camerino"], ["Di Berardini", "Maria Rita", "", "University of Camerino"], ["Vogler", "Walter", "", "University of Augsburg"]]}, {"id": "1108.4467", "submitter": "EPTCS", "authors": "Ugo Dal Lago, Paolo Di Giamberardino", "title": "Soft Session Types", "comments": "In Proceedings EXPRESS 2011, arXiv:1108.4077", "journal-ref": "EPTCS 64, 2011, pp. 59-73", "doi": "10.4204/EPTCS.64.5", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how systems of session types can enforce interactions to be bounded\nfor all typable processes. The type system we propose is based on Lafont's soft\nlinear logic and is strongly inspired by recent works about session types as\nintuitionistic linear logic formulas. Our main result is the existence, for\nevery typable process, of a polynomial bound on the length of any reduction\nsequence starting from it and on the size of any of its reducts.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 01:23:29 GMT"}], "update_date": "2011-08-24", "authors_parsed": [["Lago", "Ugo Dal", ""], ["Di Giamberardino", "Paolo", ""]]}, {"id": "1108.4468", "submitter": "EPTCS", "authors": "Damian Nadales Agut (Eindhoven University of Technology), Michel\n  Reniers (Eindhoven University of Technology)", "title": "Linearization of CIF Through SOS", "comments": "In Proceedings EXPRESS 2011, arXiv:1108.4077", "journal-ref": "EPTCS 64, 2011, pp. 74-88", "doi": "10.4204/EPTCS.64.6", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Linearization is the procedure of rewriting a process term into a linear\nform, which consist only of basic operators of the process language. This\nprocedure is interesting both from a theoretical and a practical point of view.\nIn particular, a linearization algorithm is needed for the Compositional\nInterchange Format (CIF), an automaton based modeling language.\n  The problem of devising efficient linearization algorithms is not trivial,\nand has been already addressed in literature. However, the linearization\nalgorithms obtained are the result of an inventive process, and the proof of\ncorrectness comes as an afterthought. Furthermore, the semantic specification\nof the language does not play an important role on the design of the algorithm.\n  In this work we present a method for obtaining an efficient linearization\nalgorithm, through a step-wise refinement of the SOS rules of CIF. As a result,\nwe show how the semantic specification of the language can guide the\nimplementation of such a procedure, yielding a simple proof of correctness.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 01:23:36 GMT"}], "update_date": "2011-08-24", "authors_parsed": [["Agut", "Damian Nadales", "", "Eindhoven University of Technology"], ["Reniers", "Michel", "", "Eindhoven University of Technology"]]}, {"id": "1108.4469", "submitter": "EPTCS", "authors": "Kirstin Peters, Jens-Wolfhard Schicke, Uwe Nestmann", "title": "Synchrony vs Causality in the Asynchronous Pi-Calculus", "comments": "In Proceedings EXPRESS 2011, arXiv:1108.4077", "journal-ref": "EPTCS 64, 2011, pp. 89-103", "doi": "10.4204/EPTCS.64.7", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the relation between process calculi that differ in their either\nsynchronous or asynchronous interaction mechanism. Concretely, we are\ninterested in the conditions under which synchronous interaction can be\nimplemented using just asynchronous interactions in the pi-calculus. We assume\na number of minimal conditions referring to the work of Gorla: a \"good\"\nencoding must be compositional and preserve and reflect computations,\ndeadlocks, divergence, and success. Under these conditions, we show that it is\nnot possible to encode synchronous interactions without introducing additional\ncausal dependencies in the translation.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 01:23:43 GMT"}], "update_date": "2011-08-24", "authors_parsed": [["Peters", "Kirstin", ""], ["Schicke", "Jens-Wolfhard", ""], ["Nestmann", "Uwe", ""]]}, {"id": "1108.4470", "submitter": "EPTCS", "authors": "Iain Phillips (Imperial College London), Irek Ulidowski (University of\n  Leicester)", "title": "A Logic with Reverse Modalities for History-preserving Bisimulations", "comments": "In Proceedings EXPRESS 2011, arXiv:1108.4077", "journal-ref": "EPTCS 64, 2011, pp. 104-118", "doi": "10.4204/EPTCS.64.8", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce event identifier logic (EIL) which extends Hennessy-Milner logic\nby the addition of (1) reverse as well as forward modalities, and (2)\nidentifiers to keep track of events. We show that this logic corresponds to\nhereditary history-preserving (HH) bisimulation equivalence within a particular\ntrue-concurrency model, namely stable configuration structures. We furthermore\nshow how natural sublogics of EIL correspond to coarser equivalences. In\nparticular we provide logical characterisations of weak history-preserving (WH)\nand history-preserving (H) bisimulation. Logics corresponding to HH and H\nbisimulation have been given previously, but not to WH bisimulation (when\nautoconcurrency is allowed), as far as we are aware. We also present\ncharacteristic formulas which characterise individual structures with respect\nto history-preserving equivalences.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 01:23:54 GMT"}], "update_date": "2011-08-24", "authors_parsed": [["Phillips", "Iain", "", "Imperial College London"], ["Ulidowski", "Irek", "", "University of\n  Leicester"]]}, {"id": "1108.4607", "submitter": "Tianrong Lin", "authors": "Tianrong Lin", "title": "Simple characterizations for commutativity of quantum weakest\n  preconditions", "comments": "Re-written, comments are welcome", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO quant-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In a recent letter [Information Processing Letters~104 (2007) 152-158], it\nhas shown some sufficient conditions for commutativity of quantum weakest\npreconditions. This paper provides some alternative and simple\ncharacterizations for the commutativity of quantum weakest preconditions, i.e.,\nTheorem 3.1, Theorem 3.2 and Proposition 3.3 in what follows. We also show that\nto characterize the commutativity of quantum weakest preconditions in terms of\n$[M,N]$ ($=MN-NM$) is hard in the sense of Proposition 4.1 and Proposition 4.2.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 14:11:30 GMT"}, {"version": "v2", "created": "Wed, 24 Aug 2011 13:04:23 GMT"}, {"version": "v3", "created": "Thu, 25 Aug 2011 05:47:34 GMT"}, {"version": "v4", "created": "Sat, 10 Dec 2011 06:46:21 GMT"}, {"version": "v5", "created": "Mon, 3 Sep 2012 14:32:05 GMT"}, {"version": "v6", "created": "Fri, 14 Sep 2012 12:27:44 GMT"}, {"version": "v7", "created": "Sat, 6 Oct 2012 17:00:42 GMT"}, {"version": "v8", "created": "Mon, 2 Dec 2013 08:23:11 GMT"}, {"version": "v9", "created": "Mon, 23 Mar 2015 15:33:18 GMT"}], "update_date": "2015-03-24", "authors_parsed": [["Lin", "Tianrong", ""]]}, {"id": "1108.4891", "submitter": "Christoph Wernhard", "authors": "Christoph Wernhard", "title": "Computing with Logic as Operator Elimination: The ToyElim System", "comments": "Appears in the Proceedings of the 25th Workshop on Logic Programming\n  (WLP 2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A prototype system is described whose core functionality is, based on\npropositional logic, the elimination of second-order operators, such as Boolean\nquantifiers and operators for projection, forgetting and circumscription. This\napproach allows to express many representational and computational tasks in\nknowledge representation - for example computation of abductive explanations\nand models with respect to logic programming semantics - in a uniform\noperational system, backed by a uniform classical semantic framework.\n", "versions": [{"version": "v1", "created": "Wed, 24 Aug 2011 17:21:58 GMT"}], "update_date": "2011-08-25", "authors_parsed": [["Wernhard", "Christoph", ""]]}, {"id": "1108.5017", "submitter": "Maxime Amblard", "authors": "Sai Qian (LORIA), Maxime Amblard (LORIA)", "title": "Event in Compositional Dynamic Semantics", "comments": "16 pages; Logical Aspect of Computational Linguistic, Montpellier :\n  France (2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a framework which constructs an event-style dis- course semantics.\nThe discourse dynamics are encoded in continuation semantics and various\nrhetorical relations are embedded in the resulting interpretation of the\nframework. We assume discourse and sentence are distinct semantic objects, that\nplay different roles in meaning evalua- tion. Moreover, two sets of composition\nfunctions, for handling different discourse relations, are introduced. The\npaper first gives the necessary background and motivation for event and dynamic\nsemantics, then the framework with detailed examples will be introduced.\n", "versions": [{"version": "v1", "created": "Thu, 25 Aug 2011 06:08:16 GMT"}], "update_date": "2011-08-26", "authors_parsed": [["Qian", "Sai", "", "LORIA"], ["Amblard", "Maxime", "", "LORIA"]]}, {"id": "1108.5027", "submitter": "Maxime Amblard", "authors": "Maxime Amblard (LORIA)", "title": "Encoding Phases using Commutativity and Non-commutativity in a Logical\n  Framework", "comments": "Logical Aspect of Computational Linguistic, Montpellier : France\n  (2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents an extension of Minimalist Categorial Gram- mars (MCG)\nto encode Chomsky's phases. These grammars are based on Par- tially Commutative\nLogic (PCL) and encode properties of Minimalist Grammars (MG) of Stabler. The\nfirst implementation of MCG were using both non- commutative properties (to\nrespect the linear word order in an utterance) and commutative ones (to model\nfeatures of different constituents). Here, we pro- pose to adding Chomsky's\nphases with the non-commutative tensor product of the logic. Then we could give\naccount of the PIC just by using logical prop- erties of the framework.\n", "versions": [{"version": "v1", "created": "Thu, 25 Aug 2011 07:22:09 GMT"}], "update_date": "2011-08-26", "authors_parsed": [["Amblard", "Maxime", "", "LORIA"]]}, {"id": "1108.5084", "submitter": "Christian Retore", "authors": "Christian Retor\\'e (INRIA Bordeaux - Sud-Ouest, LaBRI)", "title": "On the system F as a glue language for natural-language\n  compositional-semantics", "comments": "(24/08/2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to model in compositional framework some phenomena of lexical\npragmatics and in particular the ones studied by Nicholas Asher several\ncontributions developed in our team did use the system F of Jean-Yves Girard to\nconstruct logical formulae expressing the meaning of sentences --- while other\nauthors prefer to use Per Martin-L\\\"of's type theory In this note we explain\nthe motivations supporting our preference for system F.\n", "versions": [{"version": "v1", "created": "Thu, 25 Aug 2011 13:37:41 GMT"}], "update_date": "2011-08-29", "authors_parsed": [["Retoré", "Christian", "", "INRIA Bordeaux - Sud-Ouest, LaBRI"]]}, {"id": "1108.5281", "submitter": "Jan Sefranek", "authors": "Monika Adamova, Jan Sefranek", "title": "Transfer of semantics from argumentation frameworks to logic programming\n  A preliminary report", "comments": "WLP 2011 (Workshop on Logic Programming)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are various interesting semantics' (extensions) designed for\nargumentation frameworks. They enable to assign a meaning, e.g., to odd-length\ncycles. Our main motivation is to transfer semantics' proposed by Baroni,\nGiacomin and Guida for argumetation frameworks with odd-length cycles to logic\nprograms with odd-length cycles through default negation. The developed\nconstruction is even stronger. For a given logic program an argumentation\nframework is defined. The construction enables to transfer each semantics of\nthe resulting argumentation framework to a semantics of the given logic\nprogram. Weak points of the construction are discussed and some future\ncontinuations of this approach are outlined.\n", "versions": [{"version": "v1", "created": "Fri, 26 Aug 2011 11:01:31 GMT"}], "update_date": "2011-08-29", "authors_parsed": [["Adamova", "Monika", ""], ["Sefranek", "Jan", ""]]}, {"id": "1108.5457", "submitter": "Daniel Kral", "authors": "Tomas Gavenciak and Daniel Kral and Sang-il Oum", "title": "Deciding first order logic properties of matroids", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Frick and Grohe [J. ACM 48 (2006), 1184-1206] introduced a notion of graph\nclasses with locally bounded tree-width and established that every first order\nlogic property can be decided in almost linear time in such a graph class.\nHere, we introduce an analogous notion for matroids (locally bounded\nbranch-width) and show the existence of a fixed parameter algorithm for first\norder logic properties in classes of regular matroids with locally bounded\nbranch-width. To obtain this result, we show that the problem of deciding the\nexistence of a circuit of length at most k containing two given elements is\nfixed parameter tractable for regular matroids.\n", "versions": [{"version": "v1", "created": "Sat, 27 Aug 2011 15:02:37 GMT"}], "update_date": "2011-08-30", "authors_parsed": [["Gavenciak", "Tomas", ""], ["Kral", "Daniel", ""], ["Oum", "Sang-il", ""]]}, {"id": "1108.5667", "submitter": "Stef De Pooter", "authors": "Stef De Pooter, Johan Wittocx and Marc Denecker", "title": "A prototype of a knowledge-based programming environment", "comments": "6 pages, appears in the Proceedings of the 19th International\n  Conference on Applications of Declarative Programming and Knowledge\n  Management (INAP 2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a proposal for a knowledge-based programming\nenvironment. In such an environment, declarative background knowledge,\nprocedures, and concrete data are represented in suitable languages and\ncombined in a flexible manner. This leads to a highly declarative programming\nstyle. We illustrate our approach on an example and report about our prototype\nimplementation.\n", "versions": [{"version": "v1", "created": "Mon, 29 Aug 2011 17:38:33 GMT"}], "update_date": "2011-08-31", "authors_parsed": [["De Pooter", "Stef", ""], ["Wittocx", "Johan", ""], ["Denecker", "Marc", ""]]}, {"id": "1108.5766", "submitter": "Alexandre Miguel Pinto", "authors": "Alexandre Miguel Pinto and Lu\\'s Moniz Pereira", "title": "Each normal logic program has a 2-valued Minimal Hypotheses semantics", "comments": "15 pages Proceedings of the 19th International Conference on\n  Applications of Declarative Programming and Knowledge Management (INAP 2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we explore a unifying approach --- that of hypotheses\nassumption --- as a means to provide a semantics for all Normal Logic Programs\n(NLPs), the Minimal Hypotheses (MH) semantics. This semantics takes a positive\nhypotheses assumption approach as a means to guarantee the desirable properties\nof model existence, relevance and cumulativity, and of generalizing the Stable\nModels in the process. To do so we first introduce the fundamental semantic\nconcept of minimality of assumed positive hypotheses, define the MH semantics,\nand analyze the semantics' properties and applicability. Indeed, abductive\nLogic Programming can be conceptually captured by a strategy centered on the\nassumption of abducibles (or hypotheses). Likewise, the Argumentation\nperspective of Logic Programs also lends itself to an arguments (or hypotheses)\nassumption approach. Previous works on Abduction have depicted the atoms of\ndefault negated literals in NLPs as abducibles, i.e., assumable hypotheses. We\ntake a complementary and more general view than these works to NLP semantics by\nemploying positive hypotheses instead.\n", "versions": [{"version": "v1", "created": "Mon, 29 Aug 2011 21:46:07 GMT"}], "update_date": "2011-08-31", "authors_parsed": [["Pinto", "Alexandre Miguel", ""], ["Pereira", "Luś Moniz", ""]]}, {"id": "1108.5837", "submitter": "Tomi Janhunen", "authors": "Mai Nguyen, Tomi Janhunen, Ilkka Niemel\\\"a", "title": "Translating Answer-Set Programs into Bit-Vector Logic", "comments": "12 pages, 1 figure, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Answer set programming (ASP) is a paradigm for declarative problem solving\nwhere problems are first formalized as rule sets, i.e., answer-set programs, in\na uniform way and then solved by computing answer sets for programs. The\nsatisfiability modulo theories (SMT) framework follows a similar modelling\nphilosophy but the syntax is based on extensions of propositional logic rather\nthan rules. Quite recently, a translation from answer-set programs into\ndifference logic was provided---enabling the use of particular SMT solvers for\nthe computation of answer sets. In this paper, the translation is revised for\nanother SMT fragment, namely that based on fixed-width bit-vector theories.\nThus, even further SMT solvers can be harnessed for the task of computing\nanswer sets. The results of a preliminary experimental comparison are also\nreported. They suggest a level of performance which is similar to that achieved\nvia difference logic.\n", "versions": [{"version": "v1", "created": "Tue, 30 Aug 2011 05:52:38 GMT"}], "update_date": "2011-08-31", "authors_parsed": [["Nguyen", "Mai", ""], ["Janhunen", "Tomi", ""], ["Niemelä", "Ilkka", ""]]}, {"id": "1108.5943", "submitter": "Xishun Zhao", "authors": "Xishun Zhao, Yuping Shen", "title": "Proof System for Plan Verification under 0-Approximation Semantics", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper a proof system is developed for plan verification problems\n$\\{X\\}c\\{Y\\}$ and $\\{X\\}c\\{KW p\\}$ under 0-approximation semantics for\n${\\mathcal A}_K$. Here, for a plan $c$, two sets $X,Y$ of fluent literals, and\na literal $p$, $\\{X\\}c\\{Y\\}$ (resp. $\\{X\\}c\\{KW p\\}$) means that all literals\nof $Y$ become true (resp. $p$ becomes known) after executing $c$ in any initial\nstate in which all literals in $X$ are true.Then, soundness and completeness\nare proved. The proof system allows verifying plans and generating plans as\nwell.\n", "versions": [{"version": "v1", "created": "Tue, 30 Aug 2011 12:48:29 GMT"}, {"version": "v2", "created": "Thu, 22 Sep 2011 09:37:04 GMT"}], "update_date": "2011-09-23", "authors_parsed": [["Zhao", "Xishun", ""], ["Shen", "Yuping", ""]]}, {"id": "1108.6097", "submitter": "EPTCS", "authors": "Conrad Drescher, Ines Lynce, Ralf Treinen", "title": "Proceedings Second Workshop on Logics for Component Configuration", "comments": "EPTCS 65, 2011", "journal-ref": null, "doi": "10.4204/EPTCS.65", "report-no": null, "categories": "cs.LO cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the papers presented at the second international\nworkshop on Logics for Component Configuration (LoCoCo 2011) which was\nassociated with the International Conference on Principles and Practice of\nConstraint Programming (CP 2011) and which took place on September 12, 2011 in\nPerugia, Italy. Representing and solving configuration problems is a hot topic\nof great importance for many application domains. For example, modern software\ndistributions are based on the notion of components, which denote units of\nindependent development and deployment. Components provide the necessary\nflexibility when organizing a complex software distribution, but also are a\nchallenge when it comes to selecting components from a large repository of\npossible choices, and configuring these components according to user needs,\nresource constraints, and interdependencies with other components. Some\nwell-known examples of complex systems of components in the world of Free and\nOpen Source software are the different distributions for GNU/Linux, BSD, or\nEclipse plugins. The LoCoCo workshop focus on logic-based methods for\nspecifying and solving complex configuration problems. The goal of the workshop\nwas to bring together both researchers and practitioners active in the area of\ncomponent configuration of systems, using different modeling and solving\ntechniques, such as constraint and logic programming, description logics,\nsatisfiability and its extensions. The workshop was an opportunity to discuss\ncommon and complementary solutions for solving component configuration.\n", "versions": [{"version": "v1", "created": "Tue, 30 Aug 2011 23:07:40 GMT"}], "update_date": "2011-09-01", "authors_parsed": [["Drescher", "Conrad", ""], ["Lynce", "Ines", ""], ["Treinen", "Ralf", ""]]}, {"id": "1108.6240", "submitter": "Emil Je\\v{r}\\'abek", "authors": "Emil Je\\v{r}\\'abek", "title": "Blending margins: The modal logic K has nullary unification type", "comments": "12 pages, 1 figure", "journal-ref": "Journal of Logic and Computation 25 (2015), no. 5, pp. 1231--1240", "doi": "10.1093/logcom/ext055", "report-no": null, "categories": "cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate properties of the formula $p \\to \\Box p$ in the basic modal\nlogic K. We show that K satisfies an infinitary weaker variant of the rule of\nmargins $\\phi \\to \\Box\\phi / \\phi, \\neg\\phi$, and as a consequence, we obtain\nvarious negative results about admissibility and unification in K. We describe\na complete set of unifiers (i.e., substitutions making the formula provable) of\n$p \\to \\Box p$, and use it to establish that K has the worst possible\nunification type: nullary. In well-behaved transitive modal logics,\nadmissibility and unification can be analyzed in terms of projective formulas,\nintroduced by Ghilardi; in particular, projective formulas coincide for these\nlogics with formulas that are admissibly saturated (i.e., derive all their\nmultiple-conclusion admissible consequences) or exact (i.e., axiomatize a\ntheory of a substitution). In contrast, we show that in K, the formula $p \\to\n\\Box p$ is admissibly saturated, but neither projective nor exact. All our\nresults for K also apply to the basic description logic ALC.\n", "versions": [{"version": "v1", "created": "Wed, 31 Aug 2011 14:28:52 GMT"}, {"version": "v2", "created": "Fri, 11 Oct 2013 15:17:06 GMT"}], "update_date": "2015-12-22", "authors_parsed": [["Jeřábek", "Emil", ""]]}, {"id": "1108.6261", "submitter": "Emil Je\\v{r}\\'abek", "authors": "Emil Je\\v{r}\\'abek", "title": "The complexity of admissible rules of {\\L}ukasiewicz logic", "comments": "14 pages, 2 figures; to appear in Journal of Logic and Computation", "journal-ref": "Journal of Logic and Computation 23 (2013), no. 3, pp. 693--705", "doi": "10.1093/logcom/exs007", "report-no": null, "categories": "cs.LO cs.CC math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the computational complexity of admissibility of inference\nrules in infinite-valued {\\L}ukasiewicz propositional logic (\\L). It was shown\nin [13] that admissibility in {\\L} is checkable in PSPACE. We establish that\nthis result is optimal, i.e., admissible rules of {\\L} are PSPACE-complete. In\ncontrast, derivable rules of {\\L} are known to be coNP-complete.\n", "versions": [{"version": "v1", "created": "Wed, 31 Aug 2011 15:19:06 GMT"}, {"version": "v2", "created": "Tue, 28 Feb 2012 15:22:01 GMT"}], "update_date": "2013-05-22", "authors_parsed": [["Jeřábek", "Emil", ""]]}, {"id": "1108.6263", "submitter": "Emil Je\\v{r}\\'abek", "authors": "Emil Je\\v{r}\\'abek", "title": "The ubiquity of conservative translations", "comments": "15 pages; to appear in Review of Symbolic Logic", "journal-ref": "Review of Symbolic Logic 5 (2012), no. 4, pp. 666--678", "doi": "10.1017/S1755020312000226", "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the notion of conservative translation between logics introduced by\nFeitosa and D'Ottaviano. We show that classical propositional logic (CPC) is\nuniversal in the sense that every finitary consequence relation over a\ncountable set of formulas can be conservatively translated into CPC. The\ntranslation is computable if the consequence relation is decidable. More\ngenerally, we show that one can take instead of CPC a broad class of logics\n(extensions of a certain fragment of full Lambek calculus FL) including most\nnonclassical logics studied in the literature, hence in a sense, (almost) any\ntwo reasonable deductive systems can be conservatively translated into each\nother. We also provide some counterexamples, in particular the paraconsistent\nlogic LP is not universal.\n", "versions": [{"version": "v1", "created": "Wed, 31 Aug 2011 15:26:56 GMT"}, {"version": "v2", "created": "Tue, 31 Jul 2012 15:35:32 GMT"}], "update_date": "2012-11-29", "authors_parsed": [["Jeřábek", "Emil", ""]]}, {"id": "1108.6274", "submitter": "Rainer L\\\"udecke", "authors": "Rainer L\\\"udecke", "title": "Every Formula-Based Logic Program Has a Least Infinite-Valued Model", "comments": "This paper appears in the Proceedings of the 19th International\n  Conference on Applications of Declarative Programming and Knowledge\n  Management (INAP 2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Every definite logic program has as its meaning a least Herbrand model with\nrespect to the program-independent ordering \"set-inclusion\". In the case of\nnormal logic programs there do not exist least models in general. However,\naccording to a recent approach by Rondogiannis and Wadge, who consider\ninfinite-valued models, every normal logic program does have a least model with\nrespect to a program-independent ordering. We show that this approach can be\nextended to formula-based logic programs (i.e., finite sets of rules of the\nform A\\leftarrowF where A is an atom and F an arbitrary first-order formula).\nWe construct for a given program P an interpretation M_P and show that it is\nthe least of all models of P. Keywords: Logic programming, semantics of\nprograms, negation-as-failure, infinite-valued logics, set theory\n", "versions": [{"version": "v1", "created": "Wed, 31 Aug 2011 15:47:04 GMT"}], "update_date": "2011-09-01", "authors_parsed": [["Lüdecke", "Rainer", ""]]}]