[{"id": "1801.00074", "submitter": "Bogdan Chlebus", "authors": "Bogdan S. Chlebus", "title": "Randomized Communication in Radio Networks", "comments": "Published in Panos M. Pardalos, Sanguthevar Rajasekaran, John H.\n  Reif, and Jose D. P. Rolim, editors, Handbook of Randomized Computing, volume\n  I, pages 401-456. Kluwer Academic Publishers, 2001", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A communication network is called a radio network if its nodes exchange\nmessages in the following restricted way. First, a send operation performed by\na node delivers copies of the same message to all directly reachable nodes.\nSecondly, a node can successfully receive an incoming message only if exactly\none of its neighbors sent a message in that step. It is this semantics of how\nports at nodes send and receive messages that defines the networks rather than\nthe fact that only radio waves are used as a medium of communication; but if\nthat is the case then just a single frequency is used. We discuss algorithmic\naspects of exchanging information in such networks, concentrating on\ndistributed randomized protocols. Specific problems and solutions depend a lot\non the topology of the underlying reachability graph and how much the nodes\nknow about it. In single-hop networks each pair of nodes can communicate\ndirectly. This kind of networks is also known as the multiple access channel.\nPopular broadcasting protocols used on such channels are Aloha and the\nexponential backoff. Multi-hop networks may have arbitrary topology and packets\nneed to be routed hopping through a sequence of adjacent nodes. Distributed\nprotocols run by such networks are usually robust enough not to expect the\nnodes to know their neighbors. These ad-hoc networks and protocols model the\nsituation when nodes are mobile and do not rely on a fixed infrastructure.\n", "versions": [{"version": "v1", "created": "Sat, 30 Dec 2017 02:24:50 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Chlebus", "Bogdan S.", ""]]}, {"id": "1801.00095", "submitter": "Xin Wang", "authors": "Xin Wang, Yinlong Xu, Richard T. B. Ma", "title": "Paid Peering, Settlement-Free Peering, or Both?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the rapid growth of congestion-sensitive and data-intensive\napplications, traditional settlement-free peering agreements with best-effort\ndelivery often do not meet the QoS requirements of content providers (CPs).\nMeanwhile, Internet access providers (IAPs) feel that revenues from end-users\nare not sufficient to recoup the upgrade costs of network infrastructures.\nConsequently, some IAPs have begun to offer CPs a new type of peering\nagreement, called paid peering, under which they provide CPs with better data\ndelivery quality for a fee. In this paper, we model a network platform where an\nIAP makes decisions on the peering types offered to CPs and the prices charged\nto CPs and end-users. We study the optimal peering schemes for the IAP, i.e.,\nto offer CPs both the paid and settlement-free peering to choose from or only\none of them, as the objective is profit or welfare maximization. Our results\nshow that 1) the IAP should always offer the paid and settlement-free peering\nunder the profit-optimal and welfare-optimal schemes, respectively, 2) whether\nto simultaneously offer the other peering type is largely driven by the type of\ndata traffic, e.g., text or video, and 3) regulators might want to encourage\nthe IAP to allocate more network capacity to the settlement-free peering for\nincreasing user welfare.\n", "versions": [{"version": "v1", "created": "Sat, 30 Dec 2017 07:44:42 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Wang", "Xin", ""], ["Xu", "Yinlong", ""], ["Ma", "Richard T. B.", ""]]}, {"id": "1801.00110", "submitter": "Jian-Jhih Kuo", "authors": "Sheng-Hao Chiang and Jian-Jhih Kuo and Shan-Hsiang Shen and De-Nian\n  Yang and Wen-Tsuen Chen", "title": "Online Multicast Traffic Engineering for Software-Defined Networks", "comments": "Full version (accepted by INFOCOM 2018)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Previous research on SDN traffic engineering mostly focuses on static\ntraffic, whereas dynamic traffic, though more practical, has drawn much less\nattention. Especially, online SDN multicast that supports IETF dynamic group\nmembership (i.e., any user can join or leave at any time) has not been\nexplored. Different from traditional shortest-path trees (SPT) and graph\ntheoretical Steiner trees (ST), which concentrate on routing one tree at any\ninstant, online SDN multicast traffic engineering is more challenging because\nit needs to support dynamic group membership and optimize a sequence of\ncorrelated trees without the knowledge of future join and leave, whereas the\nscalability of SDN due to limited TCAM is also crucial. In this paper,\ntherefore, we formulate a new optimization problem, named Online Branch-aware\nSteiner Tree (OBST), to jointly consider the bandwidth consumption, SDN\nmulticast scalability, and rerouting overhead. We prove that OBST is NP-hard\nand does not have a $|D_{max}|^{1-\\epsilon}$-competitive algorithm for any\n$\\epsilon >0$, where $|D_{max}|$ is the largest group size at any time. We\ndesign a $|D_{max}|$-competitive algorithm equipped with the notion of the\nbudget, the deposit, and Reference Tree to achieve the tightest bound. The\nsimulations and implementation on real SDNs with YouTube traffic manifest that\nthe total cost can be reduced by at least 25% compared with SPT and ST, and the\ncomputation time is small for massive SDN.\n", "versions": [{"version": "v1", "created": "Sat, 30 Dec 2017 10:36:20 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Chiang", "Sheng-Hao", ""], ["Kuo", "Jian-Jhih", ""], ["Shen", "Shan-Hsiang", ""], ["Yang", "De-Nian", ""], ["Chen", "Wen-Tsuen", ""]]}, {"id": "1801.00194", "submitter": "Bogdan Chlebus", "authors": "Bogdan S. Chlebus and Dariusz R. Kowalski and Mariusz A. Rokicki", "title": "Maximum Throughput of Multiple Access Channels in Adversarial\n  Environments", "comments": null, "journal-ref": "Distributed Computing 22 (2), pp. 93 - 116, 2009", "doi": "10.1007/s00446-009-0086-4", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider deterministic distributed broadcasting on multiple access\nchannels in the framework of adversarial queuing. Packets are injected\ndynamically by an adversary that is constrained by the injection rate and the\nnumber of packets that may be injected simultaneously; the latter we call\nburstiness. The maximum injection rate that an algorithm can handle in a stable\nmanner is called the throughput of the algorithm. We develop an algorithm that\nachieves throughput $1$ for any number of stations against leaky-bucket\nadversaries. The algorithm has $O(n^2+\\text{burstiness})$ packets queued\nsimultaneously at any time, where $n$ is the number of stations; this upper\nbound is proved to be best possible. An algorithm is called fair when each\npacket is eventually broadcast. We show that no algorithm can be both stable\nand fair for a system of at least two stations against leaky-bucket\nadversaries. We study in detail small systems of exactly two and three stations\nagainst window adversaries to exhibit differences in quality of broadcast among\nclasses of algorithms. For two stations, we show that fair latency can be\nachieved by a full sensing algorithm, while there is no stable acknowledgment\nbased algorithm. For three stations, we show that fair latency can be achieved\nby a general algorithm, while no full sensing algorithm can be stable. Finally,\nwe show that algorithms that either are fair or do not have the queue sizes\naffect the order of transmissions cannot be stable in systems of at least four\nstations against window adversaries.\n", "versions": [{"version": "v1", "created": "Sat, 30 Dec 2017 21:14:25 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Chlebus", "Bogdan S.", ""], ["Kowalski", "Dariusz R.", ""], ["Rokicki", "Mariusz A.", ""]]}, {"id": "1801.00280", "submitter": "Ganhua Wu", "authors": "Ganhua Wu", "title": "Efficient priority queueing routing strategy on mobile networks", "comments": null, "journal-ref": null, "doi": "10.1142/S0217984918501373", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile networks are intriguing in recent years due to their practical\nimplications. Previous routing strategies for improving transport efficiency\nhave little attention what order should the packets be forwarded, just simply\nused first-in-first-out queue discipline. Here we apply priority queueing\ndiscipline to shortest distance routing strategy on mobile networks. Numerical\nexperiments show it not only remarkably improves network throughput and the\npacket arriving rate, but also reduces average end-to-end delay and the rate of\nqueueing delay. Our work may be helpful in routing strategy designing on mobile\nnetworks.\n", "versions": [{"version": "v1", "created": "Sun, 31 Dec 2017 13:15:35 GMT"}], "update_date": "2018-04-18", "authors_parsed": [["Wu", "Ganhua", ""]]}, {"id": "1801.00365", "submitter": "Bogdan Chlebus", "authors": "Bogdan S. Chlebus and Karol Golab and Dariusz R. Kowalski", "title": "Broadcasting Spanning Forests on a Multiple-Access Channel", "comments": null, "journal-ref": "Theory of Computing Systems, 36(6) : 711 - 733, 2003", "doi": "10.1007/s00224-003-1149-8", "report-no": null, "categories": "cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of finding a spanning forest of a graph in a\ndistributed-processing environment is studied. If an input graph is weighted,\nthen the goal is to find a minimum-weight spanning forest. The processors\ncommunicate by broadcasting. The output consists of the edges that make a\nspanning forest and have been broadcast on the network. Input edges are\ndistributed among the processors, with each edge held by one processor.\n  The underlying broadcast network is implemented as a multiple-access channel.\nIf exactly one processor attempts to perform a broadcast, then the broadcast is\nsuccessful. A message broadcast successfully is delivered to all the processors\nin one step. If more than one processors broadcast simultaneously, then the\nmessages interfere with each other and no processor can receive any of them.\n  Optimality of algorithmic solutions is investigated, by way of comparing\ndeterministic with randomized algorithms, and adaptive with oblivious ones.\nLower bounds are proved that either justify the optimality of specific\nalgorithms or show that the optimal performance depends on a class of\nalgorithms.\n", "versions": [{"version": "v1", "created": "Sun, 31 Dec 2017 22:20:46 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Chlebus", "Bogdan S.", ""], ["Golab", "Karol", ""], ["Kowalski", "Dariusz R.", ""]]}, {"id": "1801.00389", "submitter": "Muhammad Bilal", "authors": "Muhammad Bilal, Moonsoo Kang", "title": "Throughput Enhancement by Concurrent Transmission in WPAN with Multiple\n  Antennas", "comments": "5 pages, 6 Figures, Presented in 14th International Conference on\n  Advanced Communication Technology IEEE ICACT'12. February 2012, South Korea", "journal-ref": "2012 14th International Conference on Advanced Communication\n  Technology (ICACT), PyeongChang, 2012, pp. 67-71", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To achieve high rate of Multi-Giga-bits-per-second for multimedia\napplications at personal area level, 60 GHz communication technologies are most\npotential candidates. Due to some special characteristics of 60 GHz band of\nfrequencies and use of multiple directional antennas,the network level and user\nlevel throughput can be increased tremendously by identifying and scheduling\nthe non interfering transmission requests for concurrent transmissions. Instead\nof direct communication between source and destination, by traversing the\ntraffic flow on optimum path (consists of light weight multiple-relying-hops),\ncan further increase the throughput and balances the load condition across the\nnetwork. In this paper we present a scheduling scheme for concurrent\ntransmission of non interfering transmission requests on instantaneous optimum\npath. Performance of scheme is investigated for different path loss exponents.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jan 2018 03:53:58 GMT"}], "update_date": "2019-07-29", "authors_parsed": [["Bilal", "Muhammad", ""], ["Kang", "Moonsoo", ""]]}, {"id": "1801.00390", "submitter": "Muhammad Bilal", "authors": "Muhammad Bilal, Shin-Gak Kang", "title": "Time Aware Least Recent Used (TLRU) Cache Management Policy in ICN", "comments": "5 pages, 8 figures, paper presented in conference IEEE ICACT'14,\n  South Korea", "journal-ref": "Proc. IEEE ICACT, pp. 528-532, Feb. 2014", "doi": "10.1109/ICACT.2014.6779016", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The information centric networks (ICN) can be viewed as a network of caches.\nConversely, ICN type of cache networks has distinctive features e.g, contents\npopularity, usability time of content and other factors inflicts some diverse\nrequirements for cache eviction policies. In this paper we defined four\nimportant characteristics of a suitable eviction policy for ICN. We analysed\nwell known eviction policies in view of defined characteristics. Based upon\nanalysis we propose a new eviction scheme which is well suitable for ICN type\nof cache networks.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jan 2018 04:13:53 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Bilal", "Muhammad", ""], ["Kang", "Shin-Gak", ""]]}, {"id": "1801.00522", "submitter": "Khaled Abdelfadeel", "authors": "Khaled Q. Abdelfadeel, Victor Cionca, Dirk Pesch", "title": "A Fair Adaptive Data Rate Algorithm for LoRaWAN", "comments": "2 pages, 6 figures and 1 algorithm", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  LoRaWAN exhibits several characteristics that can lead to an unfair\ndistribution of the Data Extracted Rate (DER) among nodes. Firstly, the capture\neffect leads to a strong signal suppressing a weaker signal at the gateway and\nsecondly, the spreading codes used are not perfectly orthogonal, causing packet\nloss if an interfering signal is strong enough. In these conditions, nodes\nexperiencing higher attenuation are less likely to see their packets received\ncorrectly. We develop FADR, a Fair Adaptive Data Rate algorithm for LoRaWAN\nthat exploits the different Spreading Factors (SFs) and Transmission Powers\n(TPs) settings available in LoRa to achieve a fair Data Extraction Rate among\nall nodes while at the same time avoiding excessively high TPs. Simulations\nshow that FADR, in highly congested cells, achieves 300% higher fairness than\nthe minimum airtime allocation approach and 22% higher fairness than Brechts\napproach, while consuming almost 22% lower energy.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jan 2018 22:24:03 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Abdelfadeel", "Khaled Q.", ""], ["Cionca", "Victor", ""], ["Pesch", "Dirk", ""]]}, {"id": "1801.00594", "submitter": "Sergio Barrachina-Mu\\~noz Mr.", "authors": "Sergio Barrachina-Mu\\~noz, Francesc Wilhelmi, Boris Bellalta", "title": "Dynamic Channel Bonding in Spatially Distributed High-Density WLANs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we discuss the effects on throughput and fairness of dynamic\nchannel bonding (DCB) in spatially distributed high-density wireless local area\nnetworks (WLANs). First, we present an analytical framework based on\ncontinuous-time Markov networks (CTMNs) for depicting the behavior of different\nDCB policies in spatially distributed scenarios, where nodes are not required\nto be within the carrier sense range of each other. Then, we assess the\nperformance of DCB in high-density IEEE 802.11ac/ax WLANs by means of\nsimulations. We show that there may be critical interrelations among nodes in\nthe spatial domain - even if they are located outside the carrier sense range\nof each other - in a chain reaction manner. Results also reveal that, while\nalways selecting the widest available channel normally maximizes the individual\nlong-term throughput, it often generates unfair situations where other WLANs\nstarve. Moreover, we show that there are scenarios where DCB with stochastic\nchannel width selection improves the latter approach both in terms of\nindividual throughput and fairness. It follows that there is not a unique\noptimal DCB policy for every case. Instead, smarter bandwidth adaptation is\nrequired in the challenging scenarios of next-generation WLANs.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jan 2018 10:05:55 GMT"}, {"version": "v2", "created": "Wed, 25 Jul 2018 10:40:14 GMT"}, {"version": "v3", "created": "Tue, 11 Dec 2018 17:41:48 GMT"}, {"version": "v4", "created": "Thu, 6 Feb 2020 13:54:03 GMT"}], "update_date": "2020-02-07", "authors_parsed": [["Barrachina-Muñoz", "Sergio", ""], ["Wilhelmi", "Francesc", ""], ["Bellalta", "Boris", ""]]}, {"id": "1801.00825", "submitter": "Rajarshi Bhattacharyya", "authors": "Rajarshi Bhattacharyya, Bainan Xia, Desik Rengarajan, Srinivas\n  Shakkottai, Dileep Kalathil", "title": "FlowBazaar: A Market-Mediated Software Defined Communications Ecosystem\n  at the Wireless Edge", "comments": "Submitted to WiOpt, 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The predominant use of wireless access networks is for media streaming\napplications, which are only gaining popularity as ever more devices become\navailable for this purpose. However, current access networks treat all packets\nidentically, and lack the agility to determine which clients are most in need\nof service at a given time. Software reconfigurability of networking devices\nhas seen wide adoption, and this in turn implies that agile control policies\ncan be now instantiated on access networks. The goal of this work is to design,\ndevelop and demonstrate FlowBazaar, an market-based approach to create a value\nchain from the application on one side, to algorithms operating over\nreconfigurable infrastructure on the other, so that applications are able to\nobtain necessary resources for optimal performance. Using YouTube video\nstreaming as an example, we illustrate how FlowBazaar is able to adaptively\nprovide such resources and attain a high QoE for all clients at a wireless\naccess point.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jan 2018 20:31:54 GMT"}, {"version": "v2", "created": "Thu, 24 Jan 2019 02:22:38 GMT"}], "update_date": "2019-01-25", "authors_parsed": [["Bhattacharyya", "Rajarshi", ""], ["Xia", "Bainan", ""], ["Rengarajan", "Desik", ""], ["Shakkottai", "Srinivas", ""], ["Kalathil", "Dileep", ""]]}, {"id": "1801.00831", "submitter": "Eren Balevi", "authors": "Eren Balevi and Richard D. Gitlin", "title": "Optimizing the Number of Fog Nodes for Cloud-Fog-Thing Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Going from theory to practice in fog networking raises the question of the\noptimum number of fog nodes that will be upgraded from the existing nodes. This\npaper finds the optimum number of fog nodes for a given total number of\nordinary nodes residing in the area of interest for different channel\nconditions. Determining the optimum number of fog nodes is quite beneficial,\nbecause it can strongly affect the SINR, and thus the average data rate and\ntransmission delay. The numerical results indicate that the average data rate\nincreases nearly an order of magnitude for an optimized number of fog nodes in\ncase of shadowing and fading. It is further shown that the optimum number of\nfog nodes does not increase in direct proportion to the increase in the total\nnumber of nodes. Furthermore, the optimum number of fog nodes decreases when\nchannels have high path loss exponents. These findings suggest that the fog\nnodes must be selected among those that have the highest computation capability\nfor densely deployed networks and high path loss exponents channels.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jan 2018 20:45:23 GMT"}], "update_date": "2018-01-04", "authors_parsed": [["Balevi", "Eren", ""], ["Gitlin", "Richard D.", ""]]}, {"id": "1801.00837", "submitter": "Mohammad Noormohammadpour", "authors": "Mohammad Noormohammadpour, Cauligi S. Raghavendra, Srikanth Kandula,\n  Sriram Rao", "title": "QuickCast: Fast and Efficient Inter-Datacenter Transfers using\n  Forwarding Tree Cohorts", "comments": "[Extended Version] Accepted for presentation in IEEE INFOCOM 2018,\n  Honolulu, HI", "journal-ref": "INFOCOM (2018) 225-233", "doi": "10.1109/INFOCOM.2018.8486324", "report-no": null, "categories": "cs.NI cs.DC cs.PF cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large inter-datacenter transfers are crucial for cloud service efficiency and\nare increasingly used by organizations that have dedicated wide area networks\nbetween datacenters. A recent work uses multicast forwarding trees to reduce\nthe bandwidth needs and improve completion times of point-to-multipoint\ntransfers. Using a single forwarding tree per transfer, however, leads to poor\nperformance because the slowest receiver dictates the completion time for all\nreceivers. Using multiple forwarding trees per transfer alleviates this\nconcern--the average receiver could finish early; however, if done naively,\nbandwidth usage would also increase and it is apriori unclear how best to\npartition receivers, how to construct the multiple trees and how to determine\nthe rate and schedule of flows on these trees. This paper presents QuickCast, a\nfirst solution to these problems. Using simulations on real-world network\ntopologies, we see that QuickCast can speed up the average receiver's\ncompletion time by as much as $10\\times$ while only using $1.04\\times$ more\nbandwidth; further, the completion time for all receivers also improves by as\nmuch as $1.6\\times$ faster at high loads.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jan 2018 21:10:52 GMT"}], "update_date": "2018-10-15", "authors_parsed": [["Noormohammadpour", "Mohammad", ""], ["Raghavendra", "Cauligi S.", ""], ["Kandula", "Srikanth", ""], ["Rao", "Sriram", ""]]}, {"id": "1801.00840", "submitter": "Rashid Hatami", "authors": "Rashid Hatamia, Hossein Bahramgiria and Ahmad Khonsari", "title": "High Performance Architecture for Flow-Table Lookup in SDN on FPGA", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose Range-based Ternary Search Tree (RTST), a tree-based approach for\nflow-table lookup in SDN network. RTST builds upon flow-tables in SDN switches\nto provide a fast lookup among flows. We present a parallel multi-pipeline\narchitecture for implementing RTST that benefits from high throughput and low\nlatency. The proposed RTST and architecture achieve a memory efficiency of 1\nbyte of memory for each byte of flow. We also present a set of techniques to\nsupport dynamic updates. Experimental results show that RTST can be used to\nimprove the performance of flow-lookup. It achieves a throughput of 670 Million\nPackets Per Second (MPPS), for a 1 K 15-tuple flow-table, on a state-of-the-art\nFPGA.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jan 2018 21:25:24 GMT"}], "update_date": "2018-01-04", "authors_parsed": [["Hatamia", "Rashid", ""], ["Bahramgiria", "Hossein", ""], ["Khonsari", "Ahmad", ""]]}, {"id": "1801.01085", "submitter": "Pavlos Sermpezis", "authors": "Pavlos Sermpezis, Vasileios Kotronis, Petros Gigis, Xenofontas\n  Dimitropoulos, Danilo Cicalese, Alistair King, and Alberto Dainotti", "title": "ARTEMIS: Neutralizing BGP Hijacking within a Minute", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BGP prefix hijacking is a critical threat to Internet organizations and\nusers. Despite the availability of several defense approaches (ranging from\nRPKI to popular third-party services), none of them solves the problem\nadequately in practice. In fact, they suffer from: (i) lack of detection\ncomprehensiveness, allowing sophisticated attackers to evade detection, (ii)\nlimited accuracy, especially in the case of third-party detection, (iii)\ndelayed verification and mitigation of incidents, reaching up to days, and (iv)\nlack of privacy and of flexibility in post-hijack counteractions, on the side\nof network operators. In this work, we propose ARTEMIS (Automatic and Real-Time\ndEtection and MItigation System), a defense approach (a) based on accurate and\nfast detection operated by the AS itself, leveraging the pervasiveness of\npublicly available BGP monitoring services and their recent shift towards\nreal-time streaming, thus (b) enabling flexible and fast mitigation of\nhijacking events. Compared to previous work, our approach combines\ncharacteristics desirable to network operators such as comprehensiveness,\naccuracy, speed, privacy, and flexibility. Finally, we show through real-world\nexperiments that, with the ARTEMIS approach, prefix hijacking can be\nneutralized within a minute.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jan 2018 17:15:04 GMT"}, {"version": "v2", "created": "Thu, 25 Jan 2018 08:29:14 GMT"}, {"version": "v3", "created": "Thu, 21 Jun 2018 14:11:11 GMT"}, {"version": "v4", "created": "Wed, 27 Jun 2018 09:23:23 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Sermpezis", "Pavlos", ""], ["Kotronis", "Vasileios", ""], ["Gigis", "Petros", ""], ["Dimitropoulos", "Xenofontas", ""], ["Cicalese", "Danilo", ""], ["King", "Alistair", ""], ["Dainotti", "Alberto", ""]]}, {"id": "1801.01086", "submitter": "E. T. Tchao", "authors": "E. T. Tchao, Kwasi Diawuo, Christiana Selorm Aggor, Seth Djane Kotey", "title": "Ghanaian Consumers Online Privacy Concerns: Causes and its Effects on\n  E-Commerce Adoption", "comments": null, "journal-ref": null, "doi": "10.14569/IJACSA.2017.081120", "report-no": null, "categories": "cs.CY cs.NI cs.SI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Online privacy has gradually become a concern for internet users over the\nyears as a result of the interconnection of customers devices with other\ndevices supporting the internet technology. This research investigates and\ndiscusses the factors that influence the privacy concerns faced by online\nconsumers of internet services and the possible outcomes of these privacy\nconcerns on the African online market with Ghana being the primary focus.\nResults from this study indicated that only 10.1 percent of respondents felt\nthat the internet was safe for purchase and payment transaction in Ghana.\nHowever, respondents were willing to shop online if e-Commerce was the only\nmeans of getting their products. Respondents also had a high sense of perceived\nvulnerability and their perceived vulnerability to unauthorized data collection\nand misuse of personal information could affect Ghanaian e-Commerce platform\nadoption. The perceived ability of users of e-Commerce platforms in Ghana to\ncontrol data collection and its subsequent use by other third parties was also\nfound to negatively impact customers willingness to wholly transact and share\ntheir personal information online. The perceived vulnerability was found to be\naffected by the high levels of internet illiteracy whiles the perceived ability\nto control the collection of information and use was influenced by both the\ninternet literacy level as well as the level of social awareness of the\nGhanaian internet consumer.\n", "versions": [{"version": "v1", "created": "Tue, 5 Dec 2017 21:18:20 GMT"}], "update_date": "2018-01-04", "authors_parsed": [["Tchao", "E. T.", ""], ["Diawuo", "Kwasi", ""], ["Aggor", "Christiana Selorm", ""], ["Kotey", "Seth Djane", ""]]}, {"id": "1801.01108", "submitter": "Tingjun Chen", "authors": "Tingjun Chen, Jelena Diakonikolas, Javad Ghaderi, Gil Zussman", "title": "Hybrid Scheduling in Heterogeneous Half- and Full-Duplex Wireless\n  Networks", "comments": "A partial and preliminary version of this paper appeared in IEEE\n  INFOCOM'18", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Full-duplex (FD) wireless is an attractive communication paradigm with high\npotential for improving network capacity and reducing delay in wireless\nnetworks. Despite significant progress on the physical layer development, the\nchallenges associated with developing medium access control (MAC) protocols for\nheterogeneous networks composed of both legacy half-duplex (HD) and emerging FD\ndevices have not been fully addressed. Therefore, we focus on the design and\nperformance evaluation of scheduling algorithms for infrastructure-based\nheterogeneous HD-FD networks (composed of HD and FD users). We first show that\ncentralized Greedy Maximal Scheduling (GMS) is throughput-optimal in\nheterogeneous HD-FD networks. We propose the Hybrid-GMS (H-GMS) algorithm, a\ndistributed implementation of GMS that combines GMS and a queue-based\nrandom-access mechanism. We prove that H-GMS is throughput-optimal. Moreover,\nwe analyze the delay performance of H-GMS by deriving lower bounds on the\naverage queue length. We further demonstrate the benefits of upgrading HD nodes\nto FD nodes in terms of throughput gains for individual nodes and the whole\nnetwork. Finally, we evaluate the performance of H-GMS and its variants in\nterms of throughput, delay, and fairness between FD and HD users via extensive\nsimulations. We show that in heterogeneous HD-FD networks, H-GMS achieves\n16-30x better delay performance and improves fairness between HD and FD users\nby up to 50% compared with the fully decentralized Q-CSMA algorithm.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jan 2018 18:47:54 GMT"}, {"version": "v2", "created": "Mon, 26 Nov 2018 21:28:53 GMT"}], "update_date": "2018-11-28", "authors_parsed": [["Chen", "Tingjun", ""], ["Diakonikolas", "Jelena", ""], ["Ghaderi", "Javad", ""], ["Zussman", "Gil", ""]]}, {"id": "1801.01372", "submitter": "Ganhua Wu", "authors": "Ganhua Wu and Huijie Yang", "title": "Effective usage of random routing on networks of mobile agents", "comments": "We incorporated this article into the article \"arXiv:1801.00280\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most existing routing strategies to improve transport efficiency have little\nattention what order should the packets be delivered, just simply used\nfirst-in-first-out queue discipline. However, it is far from optimal. In this\npaper we apply priority queuing discipline to random routing strategy on\nnetworks of mobile agents, in which the packets have high priority to transfer\ndirectly to their destination despite their order in the queue if their\ndestination are within a communication radius. Numerical experiments show that\nit not only remarkably improves network throughput and the packet arriving\nrate, but also reduces average travelling time and the rate of waiting time to\ntravelling time. Our work may be helpful in routing strategy designing on\nnetworks of mobile agents.\n", "versions": [{"version": "v1", "created": "Sun, 31 Dec 2017 13:15:46 GMT"}, {"version": "v2", "created": "Wed, 10 Jan 2018 15:32:18 GMT"}], "update_date": "2018-01-11", "authors_parsed": [["Wu", "Ganhua", ""], ["Yang", "Huijie", ""]]}, {"id": "1801.01435", "submitter": "Bashir Sadiq Mr", "authors": "B. O. Sadiq, A. E Adedokun, Z.M Abubakar", "title": "The Impact of Mobility Model in the Optimal placement of Sensor Nodes in\n  Wireless Body Sensor Network", "comments": "IEEE NIGER CONFERENCE 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Power and energy consumption is a fundamental issue in Body Sensor Networks\n(BSNs) since nodes must operate properly and autonomously for a certain period\nof time without battery replacement or change. This is due to the fact that the\nsensors in BSNs are either implanted in the body or are in very near position\nto the body. Thus, the duration of replacing the batteries should be of utmost\nimportance. Most of the existing researches suggested the development of a more\nimproved battery cells or developing an energy aware routing protocol to tackle\nthe energy consumption in WBSN. But this is not the case as most energy\nconsumption in WBSN occur as a result of mobility in routing and sensor node\nplacement. Therefore, improving the battery cells might not solve the energy\nconsumption in WBSN.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jan 2018 16:43:13 GMT"}], "update_date": "2018-01-08", "authors_parsed": [["Sadiq", "B. O.", ""], ["Adedokun", "A. E", ""], ["Abubakar", "Z. M", ""]]}, {"id": "1801.01516", "submitter": "Michel Bonfim", "authors": "Michel S. Bonfim, Kelvin L. Dias, and Stenio F. L. Fernandes", "title": "Integrated NFV/SDN Architectures: A Systematic Literature Review", "comments": "Accepted for publication at ACM Computing Surveys", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network Functions Virtualization (NFV) and Software-Defined Networking (SDN)\nare new paradigms in the move towards open software and network hardware. While\nNFV aims to virtualize network functions and deploy them into general purpose\nhardware, SDN makes networks programmable by separating the control and data\nplanes. NFV and SDN are complementary technologies capable of providing one\nnetwork solution. SDN can provide connectivity between Virtual Network\nFunctions (VNFs) in a flexible and automated way, whereas NFV can use SDN as\npart of a service function chain. There are many studies designing NFV/SDN\narchitectures in different environments. Researchers have been trying to\naddress reliability, performance, and scalability problems using different\narchitectural designs. This Systematic Literature Review (SLR) focuses on\nintegrated NFV/SDN architectures, with the following goals: i) to investigate\nand provide an in-depth review of the state-of-the-art of NFV/SDN\narchitectures, ii) to synthesize their architectural designs, and iii) to\nidentify areas for further improvements. Broadly, this SLR will encourage\nresearchers to advance the current stage of development (i.e., the\nstate-of-the-practice) of integrated NFV/SDN architectures, and shed some light\non future research efforts and the challenges faced.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jan 2018 19:16:36 GMT"}], "update_date": "2018-01-08", "authors_parsed": [["Bonfim", "Michel S.", ""], ["Dias", "Kelvin L.", ""], ["Fernandes", "Stenio F. L.", ""]]}, {"id": "1801.01704", "submitter": "Sandeep Kumar Singh", "authors": "Javier Mata, Ignacio de Miguel, Ram\\'o n J. Dur\\'a n, Noem\\'i Merayo,\n  Sandeep Kumar Singh, Admela Jukan, Mohit Chamania", "title": "Artificial Intelligence (AI) Methods in Optical Networks: A\n  Comprehensive Survey", "comments": null, "journal-ref": "Optical Switching and Networking, Jan 2018", "doi": "10.1016/j.osn.2017.12.006", "report-no": null, "categories": "cs.AI cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Artificial intelligence (AI) is an extensive scientific discipline which\nenables computer systems to solve problems by emulating complex biological\nprocesses such as learning, reasoning and self-correction. This paper presents\na comprehensive review of the application of AI techniques for improving\nperformance of optical communication systems and networks. The use of AI-based\ntechniques is first studied in applications related to optical transmission,\nranging from the characterization and operation of network components to\nperformance monitoring, mitigation of nonlinearities, and quality of\ntransmission estimation. Then, applications related to optical network control\nand management are also reviewed, including topics like optical network\nplanning and operation in both transport and access networks. Finally, the\npaper also presents a summary of opportunities and challenges in optical\nnetworking where AI is expected to play a key role in the near future.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jan 2018 10:51:55 GMT"}, {"version": "v2", "created": "Mon, 15 Jan 2018 11:54:34 GMT"}], "update_date": "2018-01-16", "authors_parsed": [["Mata", "Javier", ""], ["de Miguel", "Ignacio", ""], ["n", "Ramó n J. Durá", ""], ["Merayo", "Noemí", ""], ["Singh", "Sandeep Kumar", ""], ["Jukan", "Admela", ""], ["Chamania", "Mohit", ""]]}, {"id": "1801.01793", "submitter": "Apostolos Destounis", "authors": "Apostolos Destounis, Georgios S. Paschos, David Gesbert", "title": "Selective Fair Scheduling over Fading Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Imposing fairness in resource allocation incurs a loss of system throughput,\nknown as the Price of Fairness ($PoF$). In wireless scheduling, $PoF$ increases\nwhen serving users with very poor channel quality because the scheduler wastes\nresources trying to be fair. This paper proposes a novel resource allocation\nframework to rigorously address this issue. We introduce selective fairness:\nbeing fair only to selected users, and improving $PoF$ by momentarily blocking\nthe rest. We study the associated admission control problem of finding the user\nselection that minimizes $PoF$ subject to selective fairness, and show that\nthis combinatorial problem can be solved efficiently if the feasibility set\nsatisfies a condition; in our model it suffices that the wireless channels are\nstochastically dominated. Exploiting selective fairness, we design a stochastic\nframework where we minimize $PoF$ subject to an SLA, which ensures that an\nergodic subscriber is served frequently enough. In this context, we propose an\nonline policy that combines the drift-plus-penalty technique with\nGradient-Based Scheduling experts, and we prove it achieves the optimal $PoF$.\nSimulations show that our intelligent blocking outperforms by 40$\\%$ in\nthroughput previous approaches which satisfy the SLA by blocking low-SNR users.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jan 2018 15:29:22 GMT"}], "update_date": "2018-01-08", "authors_parsed": [["Destounis", "Apostolos", ""], ["Paschos", "Georgios S.", ""], ["Gesbert", "David", ""]]}, {"id": "1801.01803", "submitter": "Igor Kadota", "authors": "Igor Kadota, Abhishek Sinha, Elif Uysal-Biyikoglu, Rahul Singh and\n  Eytan Modiano", "title": "Scheduling Policies for Minimizing Age of Information in Broadcast\n  Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a wireless broadcast network with a base station sending\ntime-sensitive information to a number of clients through unreliable channels.\nThe Age of Information (AoI), namely the amount of time that elapsed since the\nmost recently delivered packet was generated, captures the freshness of the\ninformation. We formulate a discrete-time decision problem to find a\ntransmission scheduling policy that minimizes the expected weighted sum AoI of\nthe clients in the network.\n  We first show that in symmetric networks a Greedy policy, which transmits the\npacket with highest current age, is optimal. For general networks, we develop\nthree low-complexity scheduling policies: a randomized policy, a Max-Weight\npolicy and a Whittle's Index policy, and derive performance guarantees as a\nfunction of the network configuration. To the best of our knowledge, this is\nthe first work to derive performance guarantees for scheduling policies that\nattempt to minimize AoI in wireless networks with unreliable channels.\nNumerical results show that both Max-Weight and Whittle's Index policies\noutperform the other scheduling policies in every configuration simulated, and\nachieve near optimal performance.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jan 2018 15:53:28 GMT"}], "update_date": "2018-01-08", "authors_parsed": [["Kadota", "Igor", ""], ["Sinha", "Abhishek", ""], ["Uysal-Biyikoglu", "Elif", ""], ["Singh", "Rahul", ""], ["Modiano", "Eytan", ""]]}, {"id": "1801.01824", "submitter": "Andres Arcia Moret", "authors": "Andr\\'es Arcia-Moret, Ioannis Psaras, Jon Crowcroft", "title": "Bringing Information Centric Networking to Challenged Environments: An\n  overview of the Second Workshop on Future Internet Architecture for\n  Developing Regions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The 2nd workshop on Future Internet Architecture for Developing Regions\n(FI4D) took place on January 8th, 2017. The workshop was hosted by the 14th\nAnnual IEEE Consumer Communications $\\&$ Networking Conference in Las Vegas,\nUSA. This report summarizes the motivation, discussions and perspectives held\nduring the half-day event.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jan 2018 16:37:04 GMT"}, {"version": "v2", "created": "Wed, 30 May 2018 14:36:55 GMT"}], "update_date": "2018-05-31", "authors_parsed": [["Arcia-Moret", "Andrés", ""], ["Psaras", "Ioannis", ""], ["Crowcroft", "Jon", ""]]}, {"id": "1801.01980", "submitter": "Vaneet Aggarwal", "authors": "Anis Elgabli, Ke Liu, and Vaneet Aggarwal", "title": "Optimized Preference-Aware Multi-path Video Streaming with Scalable\n  Video Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most client hosts are equipped with multiple network interfaces (e.g., WiFi\nand cellular networks). Simultaneous access of multiple interfaces can\nsignificantly improve the users' quality of experience (QoE) in video\nstreaming. An intuitive approach to achieve it is to use Multi-path TCP\n(MPTCP). However, the deployment of MPTCP, especially with link preference,\nrequires OS kernel update at both the client and server side, and a vast amount\nof commercial content providers do not support MPTCP. Thus, in this paper, we\nrealize a multi-path video streaming algorithm in the application layer\ninstead, by considering Scalable Video Coding (SVC), where each layer of every\nchunk can be fetched from only one of the orthogonal paths. We formulate the\nquality decisions of video chunks subject to the available bandwidth of the\ndifferent paths, chunk deadlines, and link preferences as an optimization\nproblem. The objective is to to optimize a QoE metric that maintains a tradeoff\nbetween maximizing the playback rate of every chunk and ensuring fairness among\nchunks. The QoE is a weighted some of the following metrics: skip/stall\nduration, average playback rate, and quality switching rate. However, the\nweights are chosen such that pushing more chunks to the same quality level is\nmore preferable over any other choice. Even though the formulation is a\nnon-convex discrete optimization, we show that the problem can be solved\noptimally with a polynomial complexity in some special cases. We further\npropose an online algorithm where several challenges including bandwidth\nprediction errors, are addressed. Extensive emulated experiments in a real\ntestbed with real traces of public dataset reveal the robustness of our scheme\nand demonstrate its significant performance improvement compared to other\nmulti-path algorithms.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jan 2018 07:18:19 GMT"}, {"version": "v2", "created": "Thu, 7 Jun 2018 18:08:06 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Elgabli", "Anis", ""], ["Liu", "Ke", ""], ["Aggarwal", "Vaneet", ""]]}, {"id": "1801.01996", "submitter": "Fuhui Zhou", "authors": "Fuhui Zhou, Yongpeng Wu, Rose Qingyang Hu, Yuhao Wang, Kai-Kit Wong", "title": "Energy-Efficient NOMA Enabled Heterogeneous Cloud Radio Access Networks", "comments": "This work has been accepted by IEEE Network. Pages 18, Figure 6", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heterogeneous cloud radio access networks (H-CRANs) are envisioned to be\npromising in the fifth generation (5G) wireless networks. H-CRANs enable users\nto enjoy diverse services with high energy efficiency, high spectral\nefficiency, and low-cost operation, which are achieved by using cloud computing\nand virtualization techniques. However, H-CRANs face many technical challenges\ndue to massive user connectivity, increasingly severe spectrum scarcity and\nenergy-constrained devices. These challenges may significantly decrease the\nquality of service of users if not properly tackled. Non-orthogonal multiple\naccess (NOMA) schemes exploit non-orthogonal resources to provide services for\nmultiple users and are receiving increasing attention for their potential of\nimproving spectral and energy efficiency in 5G networks. In this article a\nframework for energy-efficient NOMA H-CRANs is presented. The enabling\ntechnologies for NOMA H-CRANs are surveyed. Challenges to implement these\ntechnologies and open issues are discussed. This article also presents the\nperformance evaluation on energy efficiency of H-CRANs with NOMA.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jan 2018 10:11:17 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Zhou", "Fuhui", ""], ["Wu", "Yongpeng", ""], ["Hu", "Rose Qingyang", ""], ["Wang", "Yuhao", ""], ["Wong", "Kai-Kit", ""]]}, {"id": "1801.01997", "submitter": "Fuhui Zhou", "authors": "Fuhui Zhou, Yongpeng Wu, Ying-Chang Liang, Zan Li, Yuhao Wang, Kai-Kit\n  Wong", "title": "State of the Art, Taxonomy, and Open Issues on Cognitive Radio Networks\n  with NOMA", "comments": "This paper has been accepted by IEEE Wireless Communications\n  Magazine. Pages 16, Figures 6", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The explosive growth of mobile devices and the rapid increase of wideband\nwireless services call for advanced communication techniques that can achieve\nhigh spectral efficiency and meet the massive connectivity requirement.\nCognitive radio (CR) and non-orthogonal multiple access (NOMA) are envisioned\nto be important solutions for the fifth generation wireless networks.\nIntegrating NOMA techniques into CR networks (CRNs) has the tremendous\npotential to improve spectral efficiency and increase the system capacity.\nHowever, there are many technical challenges due to the severe interference\ncaused by using NOMA. Many efforts have been made to facilitate the application\nof NOMA into CRNs and to investigate the performance of CRNs with NOMA. This\narticle aims to survey the latest research results along this direction. A\ntaxonomy is devised to categorize the literature based on operation paradigms,\nenabling techniques, design objectives and optimization characteristics.\nMoreover, the key challenges are outlined to provide guidelines for the domain\nresearchers and designers to realize CRNs with NOMA. Finally, the open issues\nare discussed.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jan 2018 10:11:31 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Zhou", "Fuhui", ""], ["Wu", "Yongpeng", ""], ["Liang", "Ying-Chang", ""], ["Li", "Zan", ""], ["Wang", "Yuhao", ""], ["Wong", "Kai-Kit", ""]]}, {"id": "1801.02076", "submitter": "Muhammad Bilal", "authors": "Muhammad Bilal and Moonsoo Kang", "title": "Future Mobile Network Architecture: Challenges and Issues", "comments": "6 pages, 4 figures, paper presented at JCICT 2011, China", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The future mobile networks facing many challenges and to cope these\nchallenges, different standards and project has been proposed so far. Most\nrecently Cognitive Networks has opened a new ground to present suitable\narchitecture and mechanism for these challenges. The objective of this paper is\nto identify and discuss the challenges to the future mobile networks and to\ndiscuss some workable solutions to these challenges. Finally, on the basis of\ndiscussion a simple flexible network architecture is proposed.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jan 2018 19:49:37 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Bilal", "Muhammad", ""], ["Kang", "Moonsoo", ""]]}, {"id": "1801.02077", "submitter": "Zhi Wang", "authors": "Zhi Wang, Lihua Li, Yue Xu, Hui Tian and Shuguang Cui", "title": "Handover Control in Wireless Systems via Asynchronous Multi-User Deep\n  Reinforcement Learning", "comments": "12 pages, 10 figures and 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a two-layer framework to learn the optimal handover\n(HO) controllers in possibly large-scale wireless systems supporting mobile\nInternet-of-Things (IoT) users or traditional cellular users, where the user\nmobility patterns could be heterogeneous. In particular, our proposed framework\nfirst partitions the user equipments (UEs) with different mobility patterns\ninto clusters, where the mobility patterns are similar in the same cluster.\nThen, within each cluster, an asynchronous multi-user deep reinforcement\nlearning scheme is developed to control the HO processes across the UEs in each\ncluster, in the goal of lowering the HO rate while ensuring certain system\nthroughput. In this scheme, we use a deep neural network (DNN) as an HO\ncontroller learned by each UE via reinforcement learning in a collaborative\nfashion. Moreover, we use supervised learning in initializing the DNN\ncontroller before the execution of reinforcement learning to exploit what we\nalready know with traditional HO schemes and to mitigate the negative effects\nof random exploration at the initial stage. Furthermore, we show that the\nadopted global-parameter-based asynchronous framework enables us to train\nfaster with more UEs, which could nicely address the scalability issue to\nsupport large systems. Finally, simulation results demonstrate that the\nproposed framework can achieve better performance than the state-of-art on-line\nschemes, in terms of HO rates.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jan 2018 19:55:52 GMT"}, {"version": "v2", "created": "Tue, 8 May 2018 17:57:57 GMT"}], "update_date": "2018-05-09", "authors_parsed": [["Wang", "Zhi", ""], ["Li", "Lihua", ""], ["Xu", "Yue", ""], ["Tian", "Hui", ""], ["Cui", "Shuguang", ""]]}, {"id": "1801.02080", "submitter": "Muhammad Bilal", "authors": "Muhammad Bilal", "title": "An Intelligent Future Mobile Terminal Architecture", "comments": "6 pages, 4 figures, paper presented in conference, IEEE ICIET Karachi\n  2010", "journal-ref": "IEEE International Conference on Information and Emerging\n  Technologies, Karachi, 2010, pp. 1-6", "doi": "10.1109/ICIET.2010.5625738", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel Extended Cognitive Mobile Terminal (ExCogNet-MT)\nscheme is presented. In this scheme, a \"test bench\" at receiver's Mobile\nTerminal (MT) can estimate the channel Signal to Noise Ratio (SNR) and can\ndetect the jamming signal. The estimation scheme compares the Standard\nDeviation (SD) of received signal and processed signal, and on the bases of\nthis comparison the \"test bench\" can determine the BER and corresponding SNR\nvalue of the channel. Simulation results demonstrated that under certain\nscenarios estimated SNR value can be helpful for tuning the parameters of\nprotocol stack of 802.11a and WiMaxm.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jan 2018 20:10:44 GMT"}], "update_date": "2019-08-27", "authors_parsed": [["Bilal", "Muhammad", ""]]}, {"id": "1801.02099", "submitter": "Faheem Zafari", "authors": "Jian Li, Faheem Zafari, Don Towsley, Kin K. Leung, Ananthram Swami", "title": "Joint Data Compression and Caching: Approaching Optimality with\n  Guarantees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of optimally compressing and caching data across a\ncommunication network. Given the data generated at edge nodes and a routing\npath, our goal is to determine the optimal data compression ratios and caching\ndecisions across the network in order to minimize average latency, which can be\nshown to be equivalent to maximizing the compression and caching gain under an\nenergy consumption constraint. We show that this problem is NP-hard in general\nand the hardness is caused by the caching decision subproblem, while the\ncompression sub-problem is polynomial-time solvable. We then propose an\napproximation algorithm that achieves a $(1-1/e)$-approximation solution to the\noptimum in strongly polynomial time. We show that our proposed algorithm\nachieve the near-optimal performance in synthetic-based evaluations. In this\npaper, we consider a tree-structured network as an illustrative example, but\nour results easily extend to general network topology at the expense of more\ncomplicated notations.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jan 2018 22:26:39 GMT"}, {"version": "v2", "created": "Wed, 24 Jan 2018 16:22:21 GMT"}], "update_date": "2018-01-25", "authors_parsed": [["Li", "Jian", ""], ["Zafari", "Faheem", ""], ["Towsley", "Don", ""], ["Leung", "Kin K.", ""], ["Swami", "Ananthram", ""]]}, {"id": "1801.02117", "submitter": "Somayeh Kafaie", "authors": "Somayeh Kafaie, Yuanzhu Chen, Mohamed Hossam Ahmed, Octavia A. Dobre", "title": "Network Coding with Link Layer Cooperation in Wireless Mesh Networks", "comments": "6 pages, 6 figures, IEEE International Conference on Communications\n  (ICC), 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, network coding has emerged as an innovative method that\nhelps wireless network approaches its maximum capacity, by combining multiple\nunicasts in one broadcast. However, the majority of research conducted in this\narea is yet to fully utilize the broadcasting nature of wireless networks, and\nstill assumes fixed route between the source and destination that every packet\nshould travel through. This assumption not only limits coding opportunities,\nbut can also cause buffer overflow in some specific intermediate nodes.\nAlthough some studies considered scattering of the flows dynamically in the\nnetwork, they still face some limitations. This paper explains pros and cons of\nsome prominent research in network coding and proposes FlexONC (Flexible and\nOpportunistic Network Coding) as a solution to such issues. The performance\nresults show that FlexONC outperforms previous methods especially in worse\nquality networks, by better utilizing redundant packets spread in the network.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jan 2018 03:10:41 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Kafaie", "Somayeh", ""], ["Chen", "Yuanzhu", ""], ["Ahmed", "Mohamed Hossam", ""], ["Dobre", "Octavia A.", ""]]}, {"id": "1801.02119", "submitter": "Somayeh Kafaie", "authors": "Somayeh Kafaie, Mohamed H. Ahmed, Yuanzhu Chen, Octavia A. Dobre", "title": "Throughput Analysis of Network Coding in Multi-Hop Wireless Mesh\n  Networks Using Queueing Theory", "comments": "6 Pages, 4 figues, IEEE Global Communications Conference (GLOBECOM),\n  2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, a significant amount of research has been conducted to\nexplore the benefits of network coding in different scenarios, from both\ntheoretical and simulation perspectives. In this paper, we utilize queueing\ntheory to propose an analytical framework for bidirectional unicast flows in\nmulti-hop wireless mesh networks, and study throughput of inter-flow network\ncoding. We analytically determine performance metrics such as the probability\nof successful transmission in terms of collision probability, and feedback\nmechanism and retransmission. Regarding the coding process, our model uses a\nmulti-class queueing network where coded packets are separated from native\npackets and have a non-preemptive higher priority over native packets, and both\nqueues are in a stable state. Finally, we use simulations to verify the\naccuracy of our analytical model.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jan 2018 03:21:50 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Kafaie", "Somayeh", ""], ["Ahmed", "Mohamed H.", ""], ["Chen", "Yuanzhu", ""], ["Dobre", "Octavia A.", ""]]}, {"id": "1801.02120", "submitter": "Somayeh Kafaie", "authors": "Somayeh Kafaie, Yuanzhu Peter Chen, Octavia A. Dobre, Mohamed Hossam\n  Ahmed", "title": "Network Coding Implementation Details: A Guidance Document", "comments": "5 pages, 5 figures, 22nd Annual Newfoundland Electrical and Computer\n  Engineering Conference (NECEC), 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, network coding has become one of the most interesting fields\nand has attracted considerable attention from both industry and academia. The\nidea of network coding is based on the concept of allowing intermediate nodes\nto encode and combine incoming packets instead of only copy and forward them.\nThis approach, by augmenting the multicast and broadcast efficiency of\nmulti-hop wireless networks, increases the capacity of the network and improves\nits throughput and robustness. While a wide variety of papers described\napplications of network coding in different types of networks such as delay\ntolerant networks, peer to peer networks and wireless sensor networks, the\ndetailed practical implementation of network coding has not been noted in most\npapers. Since applying network coding in real scenarios requires an acceptable\nunderstanding of mathematics and algebra, especially linear equations, reduced\nrow echelon matrices, field and its operations, this paper provides a\ncomprehensive guidance for the implementation of almost all required concepts\nin network coding. The paper explains the implementation details of network\ncoding in real scenarios and describes the effect of the field size on network\ncoding.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jan 2018 03:26:04 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Kafaie", "Somayeh", ""], ["Chen", "Yuanzhu Peter", ""], ["Dobre", "Octavia A.", ""], ["Ahmed", "Mohamed Hossam", ""]]}, {"id": "1801.02123", "submitter": "Ramakrishnan Durairajan", "authors": "Ramakrishnan Durairajan, Sathiya Kumaran Mani, Paul Barford, Rob\n  Nowak, Joel Sommers", "title": "TimeWeaver: Opportunistic One Way Delay Measurement via NTP", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One-way delay (OWD) between end hosts has important implications for Internet\napplications, protocols, and measurement-based analyses. We describe a new\napproach for identifying OWDs via passive measurement of Network Time Protocol\n(NTP) traffic. NTP traffic offers the opportunity to measure OWDs accurately\nand continuously from hosts throughout the Internet. Based on detailed examina-\ntion of NTP implementations and in-situ behavior, we develop an analysis tool\nthat we call TimeWeaver, which enables assessment of precision and accuracy of\nOWD measurements from NTP. We apply TimeWeaver to a ~1TB corpus of NTP traffic\ncollected from 19 servers located in the US and report on the characteristics\nof hosts and their associated OWDs, which we classify in a precision/accuracy\nhierarchy. To demonstrate the utility of these measurements, we apply iterative\nhard-threshold singular value decomposition to estimate OWDs between arbitrary\nhosts from the high- est tier in the hierarchy. We show that this approach\nresults in highly accurate estimates of OWDs, with average error rates on the\norder of less than 2%. Finally, we outline a number of applications---in\nparticular, IP geolocation, network operations and management---for hosts in\nlower tiers of the precision hierarchy that can benefit from TimeWeaver,\noffering directions for future work.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jan 2018 03:37:46 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Durairajan", "Ramakrishnan", ""], ["Mani", "Sathiya Kumaran", ""], ["Barford", "Paul", ""], ["Nowak", "Rob", ""], ["Sommers", "Joel", ""]]}, {"id": "1801.02134", "submitter": "Somayeh Kafaie", "authors": "Somayeh Kafaie, Yuanzhu Chen, Mohamed Hossam Ahmed, Octavia A. Dobre", "title": "FlexONC: Joint Cooperative Forwarding and Network Coding with Precise\n  Encoding Conditions", "comments": "15 pages, 27 figures", "journal-ref": "IEEE Transactions on Vehicular Technology, Vol. 66, No. 8, pp.\n  7262-7277, Aug. 2017", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, network coding has emerged as an innovative method that\nhelps a wireless network approach its maximum capacity, by combining multiple\nunicasts in one broadcast. However, the majority of research conducted in this\narea is yet to fully utilize the broadcasting nature of wireless networks, and\nstill assumes fixed route between the source and destination that every packet\nshould travel through. This assumption not only limits coding opportunities,\nbut can also cause buffer overflow in some specific intermediate nodes.\nAlthough some studies considered scattering of the flows dynamically in the\nnetwork, they still face some limitations. This paper explains pros and cons of\nsome prominent research in network coding and proposes a Flexible and\nOpportunistic Network Coding scheme (FlexONC) as a solution to such issues.\nFurthermore, this research discovers that the conditions used in previous\nstudies to combine packets of different flows are overly optimistic and would\naffect the network performance adversarially. Therefore, we provide a more\naccurate set of rules for packet encoding. The experimental results show that\nFlexONC outperforms previous methods especially in networks with high bit error\nrate, by better utilizing redundant packets spread in the network.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jan 2018 05:28:09 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Kafaie", "Somayeh", ""], ["Chen", "Yuanzhu", ""], ["Ahmed", "Mohamed Hossam", ""], ["Dobre", "Octavia A.", ""]]}, {"id": "1801.02154", "submitter": "Truc Nguyen", "authors": "Truc D.T. Nguyen, Quan M.B. Nguyen and Hoang-Anh Pham", "title": "Publish-Subscribe Framework for Event Management in IoT-based\n  Applications", "comments": "11th South East Asian Technical University Consortium (SEATUC)\n  Symposium, Ho Chi Minh City, 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The incredible growth of sensors and microcontroller units makes the task of\nreal-time event monitoring in the Internet of Things (IoT) based applications\neasier and more practical. In order to effectively support the event management\nin IoT-based applications, we propose a framework that is based on the\npublish-subscribe model for detecting events from IoT sensor nodes and sending\nnotifications to subscribers (end-users) via Internet, SMS, and Calling. With\nthe exception of the advantages inherited from the publish-subscribe model, the\nfurther advantages of the proposed framework are the ease of use in terms of\nuser configuration without any need of technical skills, the aid of security\nmechanisms to prevent network intrusion, and the minimum hardware resource\nrequirement. Additionally, the proposed framework is applicable and adaptable\nto various platforms since it has been developed by using Boost C++ Libraries\nand CMake. To evaluate the proposed framework, we develop a prototype of a\nreal-time event monitoring system that is also presented in this paper.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jan 2018 07:53:17 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Nguyen", "Truc D. T.", ""], ["Nguyen", "Quan M. B.", ""], ["Pham", "Hoang-Anh", ""]]}, {"id": "1801.02206", "submitter": "Chao Yao", "authors": "Chao Yao, Xiaoyang Wang, Zijie Zheng, Guangyu Sun, and Lingyang Song", "title": "EdgeFlow: Open-Source Multi-layer Data Flow Processing in Edge Computing\n  for 5G and Beyond", "comments": "17 pages, 6 figures, magazine", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Edge computing has evolved to be a promising avenue to enhance the system\ncomputing capability by offloading processing tasks from the cloud to edge\ndevices. In this paper, we propose a multi-layer edge computing framework\ncalled EdgeFlow. In this framework, different nodes ranging from edge devices\nto cloud data centers are categorized into corresponding layers and cooperate\ntogether for data processing. With the help of EdgeFlow, one can balance the\ntrade-off between computing and communication capability so that the tasks are\nassigned to each layer optimally. At the same time, resources are carefully\nallocated throughout the whole network to mitigate performance fluctuation. The\nproposed open-source data flow processing framework is implemented on a\nplatform that can emulate various computing nodes in multiple layers and\ncorresponding network connections. Evaluated on the face recognition scenario,\nEdgeFlow can significantly reduce task finish time and perform more tolerance\nto run-time variation, compared with the pure cloud computing, the pure edge\ncomputing and Cloudlet. Potential applications of EdgeFlow, including network\nfunction visualization, Internet of Things, and vehicular networks, are also\ndiscussed in the end of this work.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jan 2018 16:22:34 GMT"}, {"version": "v2", "created": "Tue, 3 Apr 2018 04:03:38 GMT"}], "update_date": "2018-04-04", "authors_parsed": [["Yao", "Chao", ""], ["Wang", "Xiaoyang", ""], ["Zheng", "Zijie", ""], ["Sun", "Guangyu", ""], ["Song", "Lingyang", ""]]}, {"id": "1801.02221", "submitter": "Somayeh Kafaie", "authors": "Somayeh Kafaie, Mohamed Hossam Ahmed, Yuanzhu Chen, Octavia A. Dobre", "title": "Performance Analysis of Network Coding with IEEE 802.11 DCF in Multi-Hop\n  Wireless Networks", "comments": "14 pages, 11 figures, IEEE Transactions on Mobile Computing, 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network coding is an effective idea to boost the capacity of wireless\nnetworks, and a variety of studies have explored its advantages in different\nscenarios. However, there is not much analytical study on throughput and\nend-to-end delay of network coding in multi-hop wireless networks considering\nthe specifications of IEEE 802.11 Distributed Coordination Function. In this\npaper, we utilize queuing theory to propose an analytical framework for\nbidirectional unicast flows in multi-hop wireless mesh networks. We study the\nthroughput and end-to-end delay of inter-flow network coding under the IEEE\n802.11 standard with CSMA/CA random access and exponential back-off time\nconsidering clock freezing and virtual carrier sensing, and formulate several\nparameters such as the probability of successful transmission in terms of bit\nerror rate and collision probability, waiting time of packets at nodes, and\nretransmission mechanism. Our model uses a multi-class queuing network with\nstable queues, where coded packets have a non-preemptive higher priority over\nnative packets, and forwarding of native packets is not delayed if no coding\nopportunities are available. Finally, we use computer simulations to verify the\naccuracy of our analytical model.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jan 2018 18:12:14 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Kafaie", "Somayeh", ""], ["Ahmed", "Mohamed Hossam", ""], ["Chen", "Yuanzhu", ""], ["Dobre", "Octavia A.", ""]]}, {"id": "1801.02300", "submitter": "Hamed Rezaei", "authors": "Hamed Rezaei, Nima Ghazanfari motlagha, Yaghoub Farjamib, Mohammad\n  Hossein Yektae", "title": "A Novel Framework for DDoS Detectionin Huge Scale Networks, Thanksto QoS\n  Features", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is not been a long time since the advent of cloud-based technology.\nHowever, in this short period of timeseveral advantages and disadvantages have\nbeen emerged. This is a problem solving technology with some threats as well.\nThese threats and potential damages are not only limited to the cloud-based\ntechnologies, but they have always been against computer network\ninfrastructures. One of these examples is Distributed Denial-of-Service (DDoS)\nintrusion which is of course one of the most complex and the most dangerous\ntypes of attacks. The impact of this type of attack, due to its powerful\nnature, is much higher on cloud systems since in case of occurrence, the\nservice providers lose their services completely as well as their reputationand\nloyal customers. This, apparently,can even lead to the collapse of the stock\nand other destructive consequences. On the other hand, due to the properties of\ncloud service providers including large-scale infrastructures, DDoS intrusion\ndetection algorithms need high sensitivity, innovation, and general\nimprovements. Traditional structures of DDoS attack detection algorithms are\ndesigned for small-scale networks or at most for application camps. Lack of\nefficient algorithm is seemingly apparentfor the large-scale networks.\nTherefore, in this context we utilize standardmethods as well as a proposed\nhybrid protocol which is more appropriate in connection with cloud structures\nin order to detect DDoS attacks\n", "versions": [{"version": "v1", "created": "Mon, 8 Jan 2018 03:20:20 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Rezaei", "Hamed", ""], ["motlagha", "Nima Ghazanfari", ""], ["Farjamib", "Yaghoub", ""], ["Yektae", "Mohammad Hossein", ""]]}, {"id": "1801.02344", "submitter": "Nguyen Van Huynh", "authors": "Nguyen Van Huynh, Dinh Thai Hoang, Dusit Niyato, Ping Wang, and Dong\n  In Kim", "title": "Optimal Time Scheduling for Wireless-Powered Backscatter Communication\n  Networks", "comments": "Submitted to IEEE Wireless Communications Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This letter introduces a novel wireless-powered backscatter communication\nsystem which allows sensors to utilize RF signals transmitted from a dedicated\nRF energy source to transmit data. In the proposed system, when the RF energy\nsource transmits RF signals, the sensors are able to backscatter the RF signals\nto transmit date to the gateway and/or harvest energy from the RF signals for\ntheir operations. By integrating backscattering and energy harvesting\ntechniques, we can optimize the network throughput of the system. In\nparticular, we first formulate the time scheduling problem for the system, and\nthen propose an optimal solution using convex optimization to maximize the\noverall network throughput. Numerical results show a significant throughput\ngain achieved by our proposed design over two other baseline schemes.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jan 2018 08:53:46 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Van Huynh", "Nguyen", ""], ["Hoang", "Dinh Thai", ""], ["Niyato", "Dusit", ""], ["Wang", "Ping", ""], ["Kim", "Dong In", ""]]}, {"id": "1801.02534", "submitter": "Ke Liu", "authors": "Ke Liu, Zhongbin Zha, Wenkai Wan, Vaneet Aggarwal, Binzhang Fu, Mingyu\n  Chen", "title": "Optimizing TCP Loss Recovery Performance Over Mobile Data Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent advances in high-speed mobile networks have revealed new bottlenecks\nin ubiquitous TCP protocol deployed in the Internet. In addition to\ndifferentiating non-congestive loss from congestive loss, our experiments\nrevealed two significant performance bottlenecks during the loss recovery\nphase: flow control bottleneck and application stall, resulting in degradation\nin QoS performance. To tackle these two problems we firstly develop a novel\nopportunistic retransmission algorithm to eliminate the flow control\nbottleneck, which enables TCP sender to transmit new packets even if receiver's\nreceiving window is exhausted. Secondly, application stall can be significantly\nalleviated by carefully monitoring and tuning the TCP sending buffer growth\nmechanism. We implemented and modularized the proposed algorithms in the Linux\nkernel thus they can plug-and-play with the existing TCP loss recovery\nalgorithms easily. Using emulated experiments we showed that, compared to the\nexisting TCP loss recovery algorithms, the proposed optimization algorithms\nimprove the bandwidth efficiency by up to 133% and completely mitigate RTT\nspikes, i.e., over 50% RTT reduction, over the loss recovery phase.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jan 2018 16:14:44 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Liu", "Ke", ""], ["Zha", "Zhongbin", ""], ["Wan", "Wenkai", ""], ["Aggarwal", "Vaneet", ""], ["Fu", "Binzhang", ""], ["Chen", "Mingyu", ""]]}, {"id": "1801.02609", "submitter": "Ahmed El Shafie", "authors": "Yanjie Dong, Ahmed El Shafie, Md. Jahangir Hossain, Julian Cheng,\n  Naofal Al-Dhahir, Victor C.M. Leung", "title": "Secure Beamforming in Full-Duplex SWIPT Systems With Loopback\n  Self-Interference Cancellation", "comments": "Accepted in ICC 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security is a critical issue in full duplex (FD) communication systems due to\nthe broadcast nature of wireless channels. In this paper, joint design of\ninformation and artificial noise beamforming vectors is proposed for the FD\nsimultaneous wireless information and power transferring (FD-SWIPT) systems\nwith loopback self-interference cancellation. To guarantee high security and\nenergy harvesting performance of the FD-SWIPT system, the proposed design is\nformulated as a secrecy rate maximization problem under energy transfer rate\nconstraints. Although the secrecy rate maximization problem is non-convex, we\nsolve it via semidefinite relaxation and a two-dimensional search. We prove the\noptimality of our proposed algorithm and demonstrate its performance via\nsimulations.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jan 2018 18:47:17 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Dong", "Yanjie", ""], ["Shafie", "Ahmed El", ""], ["Hossain", "Md. Jahangir", ""], ["Cheng", "Julian", ""], ["Al-Dhahir", "Naofal", ""], ["Leung", "Victor C. M.", ""]]}, {"id": "1801.02621", "submitter": "Mufti Mahmud", "authors": "Fariha Afsana, Md. Asif-Ur-Rahman, Muhammad R. Ahmed, Mufti Mahmud and\n  M. Shamim Kaiser", "title": "An Energy Conserving Routing Scheme for Wireless Body Sensor Nanonetwork\n  Communication", "comments": "13 pages, 13 figures, and 2 tables, IEEE Access, 2018", "journal-ref": null, "doi": "10.1109/ACCESS.2018.2789437", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Current developments in nanotechnology make electromagnetic communication\n(EC) possible at the nanoscale for applications involving Wireless [Body]\nSensor Networks (W[B]SNs). This specialized branch of WSN has emerged as an\nimportant research area contributing to medical treatment, social welfare, and\nsports. The concept is based on the interaction of integrated nanoscale\nmachines by means of wireless communications. One key hurdle for advancing\nnanocommunications is the lack of an apposite networking protocol to address\nthe upcoming needs of the nanonetworks. Recently, some key challenges have been\nidentified, such as nanonodes with extreme energy constraints, limited\ncomputational capabilities, Terahertz frequency bands with limited transmission\nrange, etc., in designing protocols for wireless nanosensor networks (WNN).\nThis work proposes an improved performance scheme of nanocommunication over\nTerahertz bands for wireless BSNs making it suitable for smart e-health\napplications. The scheme contains -- a new energy-efficient forwarding routine\nfor EC in WNN consisting of hybrid clusters with centralized scheduling, a\nmodel designed for channel behavior taking into account the aggregated impact\nof molecular absorption, spreading loss, and shadowing, and an energy model for\nenergy harvesting and consumption. The outage probability is derived for both\nsingle and multilinks and extended to determine the outage capacity. The outage\nprobability for a multilink is derived using a cooperative fusion technique at\na predefined fusion node. Simulated using a Nano-Sim simulator, performance of\nthe proposed model has been evaluated for energy efficiency, outage capacity,\nand outage probability. The results demonstrate the efficiency of the proposed\nscheme through maximized energy utilization in both single and multihop\ncommunication, multisensor fusion enhances the link quality of the\ntransmission.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jan 2018 08:52:57 GMT"}], "update_date": "2018-01-10", "authors_parsed": [["Afsana", "Fariha", ""], ["Asif-Ur-Rahman", "Md.", ""], ["Ahmed", "Muhammad R.", ""], ["Mahmud", "Mufti", ""], ["Kaiser", "M. Shamim", ""]]}, {"id": "1801.02705", "submitter": "Babak Alipour", "authors": "Babak Alipour, Leonardo Tonetto, Aaron Ding, Roozbeh Ketabi, J\\\"org\n  Ott, Ahmed Helmy", "title": "Analyzing Mobility-Traffic Correlations in Large WLAN Traces: Flutes vs.\n  Cellos", "comments": "12 pages, 17 figures, conference paper at IEEE INFOCOM 2018, plus\n  appendix (v3 fixes some typographical errors)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two major factors affecting mobile network performance are mobility and\ntraffic patterns. Simulations and analytical-based performance evaluations rely\non models to approximate factors affecting the network. Hence, the\nunderstanding of mobility and traffic is imperative to the effective evaluation\nand efficient design of future mobile networks. Current models target either\nmobility or traffic, but do not capture their interplay. Many trace-based\nmobility models have largely used pre-smartphone datasets (e.g., AP-logs), or\nmuch coarser granularity (e.g., cell-towers) traces. This raises questions\nregarding the relevance of existing models, and motivates our study to revisit\nthis area. In this study, we conduct a multidimensional analysis, to\nquantitatively characterize mobility and traffic spatio-temporal patterns, for\nlaptops and smartphones, leading to a detailed integrated mobility-traffic\nanalysis. Our study is data-driven, as we collect and mine capacious datasets\n(with 30TB, 300k devices) that capture all of these dimensions. The\ninvestigation is performed using our systematic (FLAMeS) framework. Overall,\ndozens of mobility and traffic features have been analyzed. The insights and\nlessons learnt serve as guidelines and a first step towards future integrated\nmobility-traffic models. In addition, our work acts as a stepping-stone towards\na richer, more-realistic suite of mobile test scenarios and benchmarks.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jan 2018 22:41:50 GMT"}, {"version": "v2", "created": "Thu, 11 Jan 2018 20:43:02 GMT"}, {"version": "v3", "created": "Fri, 21 Aug 2020 06:52:03 GMT"}], "update_date": "2020-08-24", "authors_parsed": [["Alipour", "Babak", ""], ["Tonetto", "Leonardo", ""], ["Ding", "Aaron", ""], ["Ketabi", "Roozbeh", ""], ["Ott", "Jörg", ""], ["Helmy", "Ahmed", ""]]}, {"id": "1801.02741", "submitter": "Gayane Vardoyan", "authors": "Gayane Vardoyan, C.V. Hollot, Don Towsley", "title": "Towards Stability Analysis of Data Transport Mechanisms: a Fluid Model\n  and an Application", "comments": "IEEE INFOCOM 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Transmission Control Protocol (TCP) utilizes congestion avoidance and\ncontrol mechanisms as a preventive measure against congestive collapse and as\nan adaptive measure in the presence of changing network conditions. The set of\navailable congestion control algorithms is diverse, and while many have been\nstudied from empirical and simulation perspectives, there is a notable lack of\nanalytical work for some variants. To gain more insight into the dynamics of\nthese algorithms, we: (1) propose a general modeling scheme consisting of a set\nof functional differential equations of retarded type (RFDEs) and of the\ncongestion window as a function of time; (2) apply this scheme to TCP Reno and\ndemonstrate its equivalence to a previous, well known model for TCP Reno; (3)\nshow an application of the new framework to the widely-deployed congestion\ncontrol algorithm TCP CUBIC, for which analytical models are few and limited;\nand (4) validate the model using simulations. Our modeling framework yields a\nfluid model for TCP CUBIC. From a theoretical analysis of this model, we\ndiscover that TCP CUBIC is locally uniformly asymptotically stable -- a\nproperty of the algorithm previously unknown.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 01:26:04 GMT"}], "update_date": "2018-01-10", "authors_parsed": [["Vardoyan", "Gayane", ""], ["Hollot", "C. V.", ""], ["Towsley", "Don", ""]]}, {"id": "1801.02798", "submitter": "Jang Jonggyu", "authors": "Jonggyu Jang, Hyun Jong Yang, Hyekyung Jwa", "title": "Resource Allocation and Power Control in Cooperative Small Cell Networks\n  in Frequency Selective Channels with Backhaul Constraint", "comments": "30 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A joint resource allocation (RA), user association (UA), and power control\n(PC) problem is addressed for proportional fairness maximization in a\ncooperative multiuser downlink small cell network with limited backhaul\ncapacity, based on orthogonal frequency division multiplexing. Previous studies\nhave relaxed the per-resource-block (RB) RA and UA problem to a continuous\noptimisation problem based on long-term signal-to-noise-ratio, because the\noriginal problem is known as a combinatorial NP-hard problem. We tackle the\noriginal per-RB RA and UA problem to obtain a near-optimal solution with\nfeasible complexity. We show that the conventional dual problem approach for RA\ncannot find the solution satisfying the conventional KKT conditions. Inspired\nby the dual problem approach, however, we derive the first order optimality\nconditions for the considered RA, UA, and PC problem, and propose a sequential\noptimization method for finding the solution. The overall proposed scheme can\nbe implemented with feasible complexity even with a large number of system\nparameters. Numerical results show that the proposed scheme achieves the\nproportional fairness close to its outer bound with unlimited backhaul capacity\nin the low backhaul capacity regime and to that of a carefully-designed genetic\nalgorithm with excessive generations but without backhaul constraint in the\nhigh backhaul capacity regime.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 05:10:39 GMT"}, {"version": "v2", "created": "Sun, 12 Aug 2018 09:59:55 GMT"}], "update_date": "2018-08-14", "authors_parsed": [["Jang", "Jonggyu", ""], ["Yang", "Hyun Jong", ""], ["Jwa", "Hyekyung", ""]]}, {"id": "1801.02811", "submitter": "Wei Wang Dr.", "authors": "Wei Wang, Shiyue He, Lin Yang, Qian Zhang, Tao Jiang", "title": "Wi-Fi Teeter-Totter: Overclocking OFDM for Internet of Things", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The conventional high-speed Wi-Fi has recently become a contender for\nlow-power Internet-of-Things (IoT) communications. OFDM continues its adoption\nin the new IoT Wi-Fi standard due to its spectrum efficiency that can support\nthe demand of massive IoT connectivity. While the IoT Wi-Fi standard offers\nmany new features to improve power and spectrum efficiency, the basic physical\nlayer (PHY) structure of transceiver design still conforms to its conventional\ndesign rationale where access points (AP) and clients employ the same OFDM PHY.\nIn this paper, we argue that current Wi-Fi PHY design does not take full\nadvantage of the inherent asymmetry between AP and IoT. To fill the gap, we\npropose an asymmetric design where IoT devices transmit uplink packets using\nthe lowest power while pushing all the decoding burdens to the AP side. Such a\ndesign utilizes the sufficient power and computational resources at AP to trade\nfor the transmission (TX) power of IoT devices. The core technique enabling\nthis asymmetric design is that the AP takes full power of its high clock rate\nto boost the decoding ability. We provide an implementation of our design and\nshow that it can reduce the IoT's TX power by boosting the decoding capability\nat the receivers.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 06:22:11 GMT"}], "update_date": "2018-01-10", "authors_parsed": [["Wang", "Wei", ""], ["He", "Shiyue", ""], ["Yang", "Lin", ""], ["Zhang", "Qian", ""], ["Jiang", "Tao", ""]]}, {"id": "1801.02833", "submitter": "Matthias W\\\"ahlisch", "authors": "Martine Lenders, Peter Kietzmann, Oliver Hahm, Hauke Petersen, Cenk\n  G\\\"undo\\u{g}an, Emmanuel Baccelli, Kaspar Schleiser, Thomas C. Schmidt,\n  Matthias W\\\"ahlisch", "title": "Connecting the World of Embedded Mobiles: The RIOT Approach to\n  Ubiquitous Networking for the Internet of Things", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things (IoT) is rapidly evolving based on low-power compliant\nprotocol standards that extend the Internet into the embedded world. Pioneering\nimplementations have proven it is feasible to inter-network very constrained\ndevices, but had to rely on peculiar cross-layered designs and offer a\nminimalistic set of features. In the long run, however, professional use and\nmassive deployment of IoT devices require full-featured, cleanly composed, and\nflexible network stacks.\n  This paper introduces the networking architecture that turns RIOT into a\npowerful IoT system, to enable low-power wireless scenarios. RIOT networking\noffers (i) a modular architecture with generic interfaces for plugging in\ndrivers, protocols, or entire stacks, (ii) support for multiple heterogeneous\ninterfaces and stacks that can concurrently operate, and (iii) GNRC, its\ncleanly layered, recursively composed default network stack. We contribute an\nin-depth analysis of the communication performance and resource efficiency of\nRIOT, both on a micro-benchmarking level as well as by comparing IoT\ncommunication across different platforms. Our findings show that, though it is\nbased on significantly different design trade-offs, the networking subsystem of\nRIOT achieves a performance equivalent to that of Contiki and TinyOS, the two\noperating systems which pioneered IoT software platforms.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 08:28:11 GMT"}], "update_date": "2018-01-10", "authors_parsed": [["Lenders", "Martine", ""], ["Kietzmann", "Peter", ""], ["Hahm", "Oliver", ""], ["Petersen", "Hauke", ""], ["Gündoğan", "Cenk", ""], ["Baccelli", "Emmanuel", ""], ["Schleiser", "Kaspar", ""], ["Schmidt", "Thomas C.", ""], ["Wählisch", "Matthias", ""]]}, {"id": "1801.02853", "submitter": "Mohammad Riyaz Belgaum", "authors": "Zeyad M. Alfawaer and Mohammad Riyaz Belgaum", "title": "An enhanced Multipath Strategy in Mobile Ad hoc Routing Protocols", "comments": null, "journal-ref": "Proceedings of the 9th IEEE-GCC Conference and Exhibition 2017,\n  9-11 May 2017, Gulf Convension Centre, Manama, Bahrain, ISBN:\n  978-1-5386-2755-6, ISSN: 2473-9391, pp 1120-1125, Published by IEEE", "doi": "10.1109/IEEEGCC.2017.8448106", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The various routing protocols in Mobile Ad hoc Networks follow different\nstrategies to send the information from one node to another. The nodes in the\nnetwork are non static and they move randomly and are prone to link failure\nwhich makes always to find new routes to the destination. This research mainly\nfocused on the study of the characteristics of multipath routing protocols in\nMANETS. Two of the multipath routing protocols were investigated and a\ncomparative study along with simulation using NS2 was done between DSR and AODV\nto propose an enhanced approach to reach the destination maintaining the QoS. A\npossible optimization to the DSR and AODV routing protocols was proposed to\nmake no node to be overburdened by distributing the load after finding the\nalternate multipath routes which were discovered in the Route discovery\nprocess. The simulation shows that the differences in the protocol highlighted\nmajor differences with the protocol performance. These differences have been\nanalyzed with various network size, mobility, and network load. A new search\ntable named Search of Next Node Enquiry Table (SONNET) was proposed to find the\nbest neighbor node. Using SONNET the node selects the neighbor which can be\nreached in less number of hops and with less time delay and maintaining the\nQoS.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 09:40:34 GMT"}], "update_date": "2020-10-02", "authors_parsed": [["Alfawaer", "Zeyad M.", ""], ["Belgaum", "Mohammad Riyaz", ""]]}, {"id": "1801.02909", "submitter": "George Iosifidis Dr", "authors": "Konstantinos Poularakis, George Iosifidis, Leandros Tassiulas", "title": "SDN-enabled Tactical Ad Hoc Networks: Extending Programmable Control to\n  the Edge", "comments": "to appear in IEEE Communications Magazine, Ad Hoc and Sensor Networks\n  Series", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern tactical operations have complex communication and computing\nrequirements, often involving different coalition teams, that cannot be\nsupported by today's mobile ad hoc networks. To this end, the emerging Software\nDefined Networking (SDN) paradigm has the potential to enable the redesign and\nsuccessful deployment of these systems. In this paper, we propose a set of\nnovel architecture designs for SDN-enabled mobile ad hoc networks in the\ntactical field. We discuss in detail the challenges raised by the ad hoc and\ncoalition network environment, and we present specific solutions to address\nthem. The proposed approaches build on evidence from experimental evaluation of\nsuch architectures and leverage recent theoretical results from SDN deployments\nin large backbone networks.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 12:18:29 GMT"}], "update_date": "2018-01-10", "authors_parsed": [["Poularakis", "Konstantinos", ""], ["Iosifidis", "George", ""], ["Tassiulas", "Leandros", ""]]}, {"id": "1801.02918", "submitter": "Pavlos Sermpezis", "authors": "Pavlos Sermpezis, Vasileios Kotronis, Alberto Dainotti, and Xenofontas\n  Dimitropoulos", "title": "A Survey among Network Operators on BGP Prefix Hijacking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BGP prefix hijacking is a threat to Internet operators and users. Several\nmechanisms or modifications to BGP that protect the Internet against it have\nbeen proposed. However, the reality is that most operators have not deployed\nthem and are reluctant to do so in the near future. Instead, they rely on basic\n- and often inefficient - proactive defenses to reduce the impact of hijacking\nevents, or on detection based on third party services and reactive approaches\nthat might take up to several hours. In this work, we present the results of a\nsurvey we conducted among 75 network operators to study: (a) the operators'\nawareness of BGP prefix hijacking attacks, (b) presently used defenses (if any)\nagainst BGP prefix hijacking, (c) the willingness to adopt new defense\nmechanisms, and (d) reasons that may hinder the deployment of BGP prefix\nhijacking defenses. We expect the findings of this survey to increase the\nunderstanding of existing BGP hijacking defenses and the needs of network\noperators, as well as contribute towards designing new defense mechanisms that\nsatisfy the requirements of the operators.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 12:39:54 GMT"}], "update_date": "2018-01-10", "authors_parsed": [["Sermpezis", "Pavlos", ""], ["Kotronis", "Vasileios", ""], ["Dainotti", "Alberto", ""], ["Dimitropoulos", "Xenofontas", ""]]}, {"id": "1801.03069", "submitter": "Tingjun Chen", "authors": "Tingjun Chen, Mahmood Baraani Dastjerdi, Guy Farkash, Jin Zhou, Harish\n  Krishnaswamy, Gil Zussman", "title": "Open-Access Full-Duplex Wireless in the ORBIT Testbed", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to support experimentation with full-duplex (FD) wireless, we\nrecently integrated an open-access FD transceiver in the ORBIT testbed. In this\nreport, we present the design and implementation of the FD transceiver and\ninterfaces, and provide examples and guidelines for experimentation. In\nparticular, an ORBIT node with a National Instruments (NI)/Ettus Research\nUniversal Software Radio Peripheral (USRP) N210 software-defined radio (SDR)\nwas equipped with the Columbia FlexICoN Gen-1 customized RF self-interference\n(SI) canceller box. The RF canceller box includes an RF SI canceller that is\nimplemented using discrete components on a printed circuit board (PCB) and\nachieves 40dB RF SI cancellation across 5MHz bandwidth. We provide an FD\ntransceiver baseline program and present two example FD experiments where 90dB\nand 85dB overall SI cancellation is achieved for a simple waveform and PSK\nmodulated signals across both the RF and digital domains. We also discuss\npotential FD wireless experiments that can be conducted based on the\nimplemented open-access FD transceiver and baseline program.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 18:21:57 GMT"}, {"version": "v2", "created": "Tue, 29 May 2018 14:29:48 GMT"}], "update_date": "2018-05-30", "authors_parsed": [["Chen", "Tingjun", ""], ["Dastjerdi", "Mahmood Baraani", ""], ["Farkash", "Guy", ""], ["Zhou", "Jin", ""], ["Krishnaswamy", "Harish", ""], ["Zussman", "Gil", ""]]}, {"id": "1801.03162", "submitter": "Matthias Rost", "authors": "Matthias Rost, Stefan Schmid", "title": "NP-Completeness and Inapproximability of the Virtual Network Embedding\n  Problem and Its Variants", "comments": "Extended version of our paper which will be presented at IFIP\n  Networking 2018; v2 is a minor revision of v1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many resource allocation problems in the cloud can be described as a basic\nVirtual Network Embedding Problem (VNEP): the problem of finding a mapping of a\nrequest graph (describing a workload) onto a substrate graph (describing the\nphysical infrastructure). Applications range from mapping testbeds (from where\nthe problem originated), over the embedding of batch-processing workloads\n(virtual clusters) to the embedding of service function chains. The different\napplications come with their own specific requirements and constraints,\nincluding node mapping constraints, routing policies, and latency constraints.\nWhile the VNEP has been studied intensively over the last years, complexity\nresults are only known for specific models and we lack a comprehensive\nunderstanding of its hardness.\n  This paper charts the complexity landscape of the VNEP by providing a\nsystematic analysis of the hardness of a wide range of VNEP variants, using a\nunifying and rigorous proof framework. In particular, we show that the problem\nof finding a feasible embedding is NP-complete in general, and, hence, the VNEP\ncannot be approximated under any objective, unless P=NP holds. Importantly, we\nderive NP-completeness results also for finding approximate embeddings, which\nmay violate, e.g., capacity constraints by certain factors. Lastly, we prove\nthat our results still pertain when restricting the request graphs to planar or\ndegree-bounded graphs.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 22:24:22 GMT"}, {"version": "v2", "created": "Wed, 28 Mar 2018 17:11:12 GMT"}], "update_date": "2018-03-29", "authors_parsed": [["Rost", "Matthias", ""], ["Schmid", "Stefan", ""]]}, {"id": "1801.03290", "submitter": "Benjamin Sliwa", "authors": "Benjamin Sliwa and Thomas Liebig and Robert Falkenberg and Johannes\n  Pillmann and Christian Wietfeld", "title": "Efficient Machine-type Communication using Multi-metric\n  Context-awareness for Cars used as Mobile Sensors in Upcoming 5G Networks", "comments": "Best Student Paper Award", "journal-ref": "2018 IEEE 87th Vehicular Technology Conference (VTC Spring)", "doi": "10.1109/VTCSpring.2018.8417753", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Upcoming 5G-based communication networks will be confronted with huge\nincreases in the amount of transmitted sensor data related to massive\ndeployments of static and mobile Internet of Things (IoT) systems. Cars acting\nas mobile sensors will become important data sources for cloud-based\napplications like predictive maintenance and dynamic traffic forecast. Due to\nthe limitation of available communication resources, it is expected that the\ngrows in Machine-Type Communication (MTC) will cause severe interference with\nHuman-to-human (H2H) communication. Consequently, more efficient transmission\nmethods are highly required. In this paper, we present a probabilistic scheme\nfor efficient transmission of vehicular sensor data which leverages favorable\nchannel conditions and avoids transmissions when they are expected to be highly\nresource-consuming. Multiple variants of the proposed scheme are evaluated in\ncomprehensive realworld experiments. Through machine learning based combination\nof multiple context metrics, the proposed scheme is able to achieve up to 164%\nhigher average data rate values for sensor applications with soft deadline\nrequirements compared to regular periodic transmission.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jan 2018 10:25:25 GMT"}, {"version": "v2", "created": "Thu, 22 Feb 2018 12:14:18 GMT"}, {"version": "v3", "created": "Tue, 31 Jul 2018 07:03:52 GMT"}, {"version": "v4", "created": "Thu, 21 Nov 2019 10:45:50 GMT"}], "update_date": "2019-11-22", "authors_parsed": [["Sliwa", "Benjamin", ""], ["Liebig", "Thomas", ""], ["Falkenberg", "Robert", ""], ["Pillmann", "Johannes", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1801.03291", "submitter": "Benjamin Sliwa", "authors": "Benjamin Sliwa and Marcus Haferkamp and Manar Al-Askary and Dennis\n  Dorn and Christian Wietfeld", "title": "A Radio-fingerprinting-based Vehicle Classification System for\n  Intelligent Traffic Control in Smart Cities", "comments": null, "journal-ref": "2018 Annual IEEE International Systems Conference (SysCon)", "doi": "10.1109/SYSCON.2018.8369511", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The measurement and provision of precise and upto-date traffic-related key\nperformance indicators is a key element and crucial factor for intelligent\ntraffic controls systems in upcoming smart cities. The street network is\nconsidered as a highly-dynamic Cyber Physical System (CPS) where measured\ninformation forms the foundation for dynamic control methods aiming to optimize\nthe overall system state. Apart from global system parameters like traffic flow\nand density, specific data such as velocity of individual vehicles as well as\nvehicle type information can be leveraged for highly sophisticated traffic\ncontrol methods like dynamic type-specific lane assignments. Consequently,\nsolutions for acquiring these kinds of information are required and have to\ncomply with strict requirements ranging from accuracy over cost-efficiency to\nprivacy preservation. In this paper, we present a system for classifying\nvehicles based on their radio-fingerprint. In contrast to other approaches, the\nproposed system is able to provide real-time capable and precise vehicle\nclassification as well as cost-efficient installation and maintenance, privacy\npreservation and weather independence. The system performance in terms of\naccuracy and resource-efficiency is evaluated in the field using comprehensive\nmeasurements. Using a machine learning based approach, the resulting success\nratio for classifying cars and trucks is above 99%.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jan 2018 10:29:23 GMT"}, {"version": "v2", "created": "Tue, 12 Jun 2018 05:22:36 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Sliwa", "Benjamin", ""], ["Haferkamp", "Marcus", ""], ["Al-Askary", "Manar", ""], ["Dorn", "Dennis", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1801.03317", "submitter": "Benjamin Sliwa", "authors": "Marcus Haferkamp and Manar Al-Askary and Dennis Dorn and Benjamin\n  Sliwa and Lars Habel and Michael Schreckenberg and Christian Wietfeld", "title": "Radio-based Traffic Flow Detection and Vehicle Classification for Future\n  Smart Cities", "comments": null, "journal-ref": "Vehicular Technology Conference (VTC Spring), 2017 IEEE 85th", "doi": "10.1109/VTCSpring.2017.8108633", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intelligent Transportation Systems (ITSs) providing vehicle-related\nstatistical data are one of the key components for future smart cities. In this\ncontext, knowledge about the current traffic flow is used for travel time\nreduction and proactive jam avoidance by intelligent traffic control\nmechanisms. In addition, the monitoring and classification of vehicles can be\nused in the field of smart parking systems. The required data is measured using\nnetworks with a wide range of sensors. Nevertheless, in the context of smart\ncities no existing solution for traffic flow detection and vehicle\nclassification is able to guarantee high classification accuracy, low\ndeployment and maintenance costs, low power consumption and a\nweather-independent operation while respecting privacy. In this paper, we\npropose a radiobased approach for traffic flow detection and vehicle\nclassification using signal attenuation measurements and machine learning\nalgorithms. The results of comprehensive measurements in the field prove its\nhigh classification success rate of about 99%.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jan 2018 11:39:55 GMT"}, {"version": "v2", "created": "Wed, 21 Feb 2018 09:20:31 GMT"}], "update_date": "2018-02-22", "authors_parsed": [["Haferkamp", "Marcus", ""], ["Al-Askary", "Manar", ""], ["Dorn", "Dennis", ""], ["Sliwa", "Benjamin", ""], ["Habel", "Lars", ""], ["Schreckenberg", "Michael", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1801.03412", "submitter": "Nazar Ali Dr", "authors": "Ebtesam Almazrouei, Nazar Ali, and Saleh Al-Araji", "title": "Assessment of SFSDP Cooperative Localization Algorithm for WLAN\n  Environment", "comments": "4 pages, 5 figures, conference; Seventh International Conferences On\n  Internet Technologies and Applications (ITA 17), 12-17 Sept 2017, North\n  Wales, U.K", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperative localization for indoor WiFi networks have received little\nattention thus far. Many cooperative location algorithms exist for Wireless\nSensor Network Applications but their suitability for WiFi based networks has\nnot been studied. In this paper the performance of the Sparse Finite Semi\nDefinite Program (SFSDP) has been examined using real measurements data and\nunder different indoor conditions. Effects of other network parameters such as\nvarying number of anchors and blind nodes are also included.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jan 2018 15:01:28 GMT"}], "update_date": "2018-01-11", "authors_parsed": [["Almazrouei", "Ebtesam", ""], ["Ali", "Nazar", ""], ["Al-Araji", "Saleh", ""]]}, {"id": "1801.03422", "submitter": "Yu-Pin Hsu", "authors": "Yu-Pin Hsu", "title": "Age of Information: Whittle Index for Scheduling Stochastic Arrivals", "comments": "ISIT 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Age of information is a new concept that characterizes the freshness of\ninformation at end devices. This paper studies the age of information from a\nscheduling perspective. We consider a wireless broadcast network where a\nbase-station updates many users on stochastic information arrivals. Suppose\nthat only one user can be updated for each time. In this context, we aim at\ndeveloping a transmission scheduling algorithm for minimizing the long-run\naverage age. To develop a low-complexity transmission scheduling algorithm, we\napply the Whittle's framework for restless bandits. We successfully derive the\nWhittle index in a closed form and establish the indexability. Based on the\nWhittle index, we propose a scheduling algorithm, while experimentally showing\nthat it closely approximates an age-optimal scheduling algorithm.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jan 2018 15:37:37 GMT"}, {"version": "v2", "created": "Tue, 17 Apr 2018 07:28:33 GMT"}], "update_date": "2018-04-18", "authors_parsed": [["Hsu", "Yu-Pin", ""]]}, {"id": "1801.03484", "submitter": "Vincenzo Sciancalepore", "authors": "Vincenzo Sciancalepore, Lanfranco Zanzi, Xavier Costa-Perez, Antonio\n  Capone", "title": "ONETS: Online Network Slice Broker From Theory to Practice", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network slicing allows mobile network operators to open their physical\nnetwork infrastructure platform to the concurrent deployment of multiple\nlogical self-contained networks, i.e., network slices. In this paper we propose\nand analyze ONETS: an Online NETwork Slicing solution that (i) builds on the\nbudgeted lock-up multi-armed bandit mathematical model and properties, (ii)\nderives its analytical bounds in our proposed extension for network slicing,\n(iii) seamlessly integrates into the 3GPP architecture, (iv) proves its\nfeasibility through a proof-of-concept implementation on commercial hardware\nconsidering three network slices and (v) allows for the design of a\nlow-complexity online network slice brokering solution that maximizes\nmultiplexing gains.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jan 2018 18:34:05 GMT"}, {"version": "v2", "created": "Thu, 5 Nov 2020 14:25:40 GMT"}], "update_date": "2020-11-06", "authors_parsed": [["Sciancalepore", "Vincenzo", ""], ["Zanzi", "Lanfranco", ""], ["Costa-Perez", "Xavier", ""], ["Capone", "Antonio", ""]]}, {"id": "1801.03611", "submitter": "Won-Jin Chung", "authors": "Won-Jin Chung and Tea-Ho Cho", "title": "Multi-path Route Determination Method for Network Load Balancing in\n  FAP-Based WSNs Using Fuzzy Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A flooding attack in wireless sensor networks is a type of threat that\nshortens the lifetimes of the sensor networks. Although flooding attack\nprevention techniques have been proposed, if a continuous flooding attack\noccurs, the sensor node energy is depleted during detection. In this paper, we\nuse multi-path routing to solve this problem. In order to balance the load of\nthe sensor node, energy balancing of the sensor node is controlled by\ndetermining the number of pathways using fuzzy logic. By adjusting the energy\nbalancing of the sensor nodes, the number of energy-exhausting sensor nodes can\nbe reduced. As a result, when a flooding attack occurs, the energy efficiency\nof the sensor node is increased by determining the number of pathways.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jan 2018 02:05:29 GMT"}], "update_date": "2018-01-12", "authors_parsed": [["Chung", "Won-Jin", ""], ["Cho", "Tea-Ho", ""]]}, {"id": "1801.03648", "submitter": "Xavier Vilajosana", "authors": "Xavier Vilajosana, Cristina Cano, Borja Martinez, Pere Tuset, Joan\n  Meli\\`a, Ferran Adelantado", "title": "The Wireless Technology Landscape in the Manufacturing Industry: A\n  Reality Check", "comments": "5 pages", "journal-ref": "MMTC Communications - Frontiers, SPECIAL ISSUE ON Multiple\n  Wireless Technologies and IoT in Industry: Applications and Challenges, Vol.\n  12, No. 6, November 2017", "doi": null, "report-no": "01-A", "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An upcoming industrial IoT revolution, supposedly led by the introduction of\nembedded sensing and computing, seamless communication and massive data\nanalytics within industrial processes [1], seems unquestionable today. Multiple\ntechnologies are being developed, and huge marketing efforts are being made to\nposition solutions in this industrial landscape. However, we have observed that\nindustrial wireless technologies are hardly being adopted by the manufacturing\nindustry. In this article, we try to understand the reasons behind this current\nlack of wireless technologies adoption by means of conducting visits to the\nmanufacturing industry and interviews with the maintenance and engineering\nteams in these industries. The manufacturing industry is very diverse and\nspecialized, so we have tried to cover some of the most representative cases:\nthe automotive sector, the pharmaceutical sector (blistering), machine-tool\nindustries (both consumer and aerospace sectors) and robotics. We have analyzed\nthe technology of their machinery, their application requirements and\nrestrictions, and identified a list of obstacles for wireless technology\nadoption. The most immediate obstacles we have found are the need to strictly\nfollow standards and certifications processes, as well as their prudence. But\nthe less obvious and perhaps even more limiting obstacles are their apparent\nlack of concern regarding low energy consumption or cost which, in contrast,\nare believed to be of utmost importance by wireless researchers and\npractitioners. In this reality-check article, we analyze the causes of this\ndifferent perception, we identify these obstacles and devise complementary\npaths to make wireless adoption by the industrial manufacturing sector a\nreality in the coming years.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jan 2018 07:34:46 GMT"}], "update_date": "2018-01-16", "authors_parsed": [["Vilajosana", "Xavier", ""], ["Cano", "Cristina", ""], ["Martinez", "Borja", ""], ["Tuset", "Pere", ""], ["Melià", "Joan", ""], ["Adelantado", "Ferran", ""]]}, {"id": "1801.03717", "submitter": "Jos\\'e Mairton Barros da Silva J\\'unior", "authors": "Jos\\'e Mairton B. da Silva Jr., Hadi Ghauch, G\\'abor Fodor, Carlo\n  Fischione", "title": "How to Split UL/DL Antennas in Full-Duplex Cellular Networks", "comments": "7 pages, 4 figures. Accepted to IEEE ICC 2018 Workshop on Full-Duplex\n  Communications for Future Wireless Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI eess.SP math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To further improve the potential of full-duplex communications, networks may\nemploy multiple antennas at the base station or user equipment. To this end,\nnetworks that employ current radios usually deal with self-interference and\nmulti-user interference by beamforming techniques. Although previous works\ninvestigated beamforming design to improve spectral efficiency, the fundamental\nquestion of how to split the antennas at a base station between uplink and\ndownlink in full-duplex networks has not been investigated rigorously. This\npaper addresses this question by posing antenna splitting as a binary nonlinear\noptimization problem to minimize the sum mean squared error of the received\ndata symbols. It is shown that this is an NP-hard problem. This combinatorial\nproblem is dealt with by equivalent formulations, iterative convex\napproximations, and a binary relaxation. The proposed algorithm is guaranteed\nto converge to a stationary solution of the relaxed problem with much smaller\ncomplexity than exhaustive search. Numerical results indicate that the proposed\nsolution is close to the optimal in both high and low self-interference capable\nscenarios, while the usually assumed antenna splitting is far from optimal. For\nlarge number of antennas, a simple antenna splitting is close to the proposed\nsolution. This reveals that the importance of antenna splitting is inversely\nproportional with the number of antennas.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jan 2018 11:27:52 GMT"}, {"version": "v2", "created": "Wed, 23 May 2018 20:37:57 GMT"}], "update_date": "2018-05-25", "authors_parsed": [["Silva", "José Mairton B. da", "Jr."], ["Ghauch", "Hadi", ""], ["Fodor", "Gábor", ""], ["Fischione", "Carlo", ""]]}, {"id": "1801.03748", "submitter": "Andres Oscar Altieri", "authors": "Andres Altieri and Pablo Piantanida", "title": "Performance Evaluation of Advanced Relaying Protocols in Large Wireless\n  Networks", "comments": "27 pages, 14 figures. Submitted for possible publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the performance of some state-of-the-art cooperative\nfull-duplex relaying protocols in the context of a large wireless network\nmodelled using stochastic geometry tools. We investigate the outage behaviour\nfor different cooperative schemes, namely, decode-and-forward, noisy-network\ncoding and mixed noisy-network coding, considering fading, path loss and\ninterference from other sources and relays. Due to the high complexity of the\nnetwork topology and the protocols considered, a closed-form analysis is not\npossible, so our study is performed through extensive but careful numerical\nsimulations, sweeping a large number of relevant parameters. Several scenarios\nof particular interest are investigated. In this way, insightful conclusions\nare drawn regarding the network regimes in which relay-assisted cooperation is\nmost beneficial and the potential gains that could be achieved through it.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jan 2018 13:30:45 GMT"}], "update_date": "2018-01-12", "authors_parsed": [["Altieri", "Andres", ""], ["Piantanida", "Pablo", ""]]}, {"id": "1801.03890", "submitter": "Matthias W?hlisch", "authors": "Cenk G\\\"undo\\u{g}an, Peter Kietzmann, Thomas C. Schmidt, Matthias\n  W\\\"ahlisch", "title": "HoPP: Robust and Resilient Publish-Subscribe for an Information-Centric\n  Internet of Things", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper revisits NDN deployment in the IoT with a special focus on the\ninteraction of sensors and actuators. Such scenarios require high\nresponsiveness and limited control state at the constrained nodes. We argue\nthat the NDN request-response pattern which prevents data push is vital for IoT\nnetworks. We contribute HoP-and-Pull (HoPP), a robust publish-subscribe scheme\nfor typical IoT scenarios that targets IoT networks consisting of hundreds of\nresource constrained devices at intermittent connectivity. Our approach limits\nthe FIB tables to a minimum and naturally supports mobility, temporary network\npartitioning, data aggregation and near real-time reactivity. We experimentally\nevaluate the protocol in a real-world deployment using the IoT-Lab testbed with\nvarying numbers of constrained devices, each wirelessly interconnected via IEEE\n802.15.4 LowPANs. Implementations are built on CCN-lite with RIOT and support\nexperiments using various single- and multi-hop scenarios.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jan 2018 17:36:59 GMT"}], "update_date": "2018-01-12", "authors_parsed": [["Gündoğan", "Cenk", ""], ["Kietzmann", "Peter", ""], ["Schmidt", "Thomas C.", ""], ["Wählisch", "Matthias", ""]]}, {"id": "1801.04035", "submitter": "He Zhu", "authors": "He Zhu and Changcheng Huang and Jiayu Zhou", "title": "EdgeChain: Blockchain-based Multi-vendor Mobile Edge Application\n  Placement", "comments": "9 pages, 7 figures, conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The state-of-the-art mobile edge applications are generating intense traffic\nand posing rigorous latency requirements to service providers. While resource\nsharing across multiple service providers can be a way to maximize the\nutilization of limited resources at the network edge, it requires a centralized\nrepository maintained by all parties for service providers to share status.\nMoreover, service providers have to trust each other for resource allocation\nfairness, which is difficult because of potential conflicts of interest. We\npropose EdgeChain, a blockchain-based architecture to make mobile edge\napplication placement decisions for multiple service providers. We first\nformulate a stochastic programming problem minimizing the placement cost for\nmobile edge application placement scenarios. Based on our model, we present a\nheuristic mobile edge application placement algorithm. As a decentralized\npublic ledger, the blockchain then takes the logic of our algorithm as the\nsmart contract, with the consideration of resources from all mobile edge hosts\nparticipating in the system. The algorithm is agreed by all parties and the\nresults will only be accepted by majority of the mining nodes on the\nblockchain. When a placement decision is made, an edge host meeting the\nconsumer's latency and budget requirements will be selected at the lowest cost.\nAll placement transactions are stored on the blockchain and are traceable by\nevery mobile edge service provider and application vendor who consumes\nresources at the mobile edge.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jan 2018 01:50:57 GMT"}], "update_date": "2018-01-15", "authors_parsed": [["Zhu", "He", ""], ["Huang", "Changcheng", ""], ["Zhou", "Jiayu", ""]]}, {"id": "1801.04131", "submitter": "Michael Karrenbauer", "authors": "Michael Karrenbauer, Andreas Weinand and Hans D. Schotten", "title": "On Partly Overloaded Spreading Sequences with Variable Spreading Factor", "comments": "6 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Future wireless communications systems are expected to support multi-service\noperation, i.e. especially multi-rate as well as multi-level quality of service\n(QoS) requirements. This evolution is mainly driven by the success of the\nInternet of Things (IoT) and the growing presence of machine type communication\n(MTC). Whereas in the last years information in wireless communication systems\nwas mainly generated or at least requested by humans and was also processed by\nhumans, we can now see a paradigm shift since so-called machine type\ncommunication is gaining growing importance. Along with these changes we also\nencounter changes regarding the quality of service requirements, data rate\nrequirements, latency constraints, different duty cycles et cetera. The\nchallenge for new communication systems will therefore be to enable different\nuser types and their different requirements efficiently. In this paper, we\npresent partly overloaded spreading sequences, i.e. sequences which are\nglobally orthogonal and sequences which interfere with a subset of sequences\nwhile being orthogonal to the globally orthogonal sequences. Additionally, we\nare able to vary the spreading factor of these sequences, which allows us to\nflexibly assign appropriate sequences to different service types or user types\nrespectively. We propose the use of these sequences for a CDMA channel access\nmethod which is able to flexibly support different traffic types.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jan 2018 10:54:45 GMT"}], "update_date": "2018-01-15", "authors_parsed": [["Karrenbauer", "Michael", ""], ["Weinand", "Andreas", ""], ["Schotten", "Hans D.", ""]]}, {"id": "1801.04613", "submitter": "Mubashir Husain Rehmani", "authors": "Mubashir Husain Rehmani, Alan Davy, Brendan Jennings, and Chadi Assi", "title": "Software Defined Networks based Smart Grid Communication: A\n  Comprehensive Survey", "comments": "Accepted", "journal-ref": "IEEE Communications Surveys and Tutorials, 2019", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The current power grid is no longer a feasible solution due to\never-increasing user demand of electricity, old infrastructure, and reliability\nissues and thus require transformation to a better grid a.k.a., smart grid\n(SG). The key features that distinguish SG from the conventional electrical\npower grid are its capability to perform two-way communication, demand side\nmanagement, and real time pricing. Despite all these advantages that SG will\nbring, there are certain issues which are specific to SG communication system.\nFor instance, network management of current SG systems is complex, time\nconsuming, and done manually. Moreover, SG communication (SGC) system is built\non different vendor specific devices and protocols. Therefore, the current SG\nsystems are not protocol independent, thus leading to interoperability issue.\nSoftware defined network (SDN) has been proposed to monitor and manage the\ncommunication networks globally. This article serves as a comprehensive survey\non SDN-based SGC. In this article, we first discuss taxonomy of advantages of\nSDNbased SGC.We then discuss SDN-based SGC architectures, along with case\nstudies. Our article provides an in-depth discussion on routing schemes for\nSDN-based SGC. We also provide detailed survey of security and privacy schemes\napplied to SDN-based SGC. We furthermore present challenges, open issues, and\nfuture research directions related to SDN-based SGC.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jan 2018 21:37:03 GMT"}, {"version": "v2", "created": "Mon, 16 Jul 2018 14:24:11 GMT"}, {"version": "v3", "created": "Mon, 3 Dec 2018 22:20:27 GMT"}, {"version": "v4", "created": "Wed, 27 Mar 2019 21:26:34 GMT"}], "update_date": "2019-03-29", "authors_parsed": [["Rehmani", "Mubashir Husain", ""], ["Davy", "Alan", ""], ["Jennings", "Brendan", ""], ["Assi", "Chadi", ""]]}, {"id": "1801.04655", "submitter": "Quoc-Viet Pham", "authors": "Quoc-Viet Pham, Choong Seon Hong", "title": "Power Control for Harmonic Utility in Non-Orthogonal Multiple Access\n  based Visible Light Communications", "comments": "Presented at Korea Software Congress 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Visible light communication is a promising technique in future networks due\nto its advantages of high data rate and licensed-free spectrum. In addition,\nnon-orthogonal multiple access (NOMA) is considered as a candidate of multiple\naccess schemes in 5G networks and beyond. In this paper, we study the power\ncontrol problem in NOMA-based visible light communication. An optimization\nproblem is formulated, where the objective is the harmonic-rate utility\nfunction. The optimal solution is achieved optimally by equivalently\ntransforming the underlying problem into a convex problem. Simulation result is\nprovided to validate performance of the proposed approach.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jan 2018 03:33:20 GMT"}, {"version": "v2", "created": "Fri, 24 Aug 2018 00:46:37 GMT"}], "update_date": "2018-08-27", "authors_parsed": [["Pham", "Quoc-Viet", ""], ["Hong", "Choong Seon", ""]]}, {"id": "1801.04744", "submitter": "Rajeev Shakya", "authors": "Rajeev K. Shakya (Department of Electrical and Electronics\n  Engineering, Galgotia College of Engineering and Technology Greater noida)", "title": "Modified SI Epidemic Model for Combating Virus Spread in Spatially\n  Correlated Wireless Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": "Report No.01", "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In wireless sensor networks (WSNs), main task of each sensor node is to sense\nthe physical activity (i.e., targets or disaster conditions) and then to report\nit to the control center for further process. For this, sensor nodes are\nattached with many sensors having ability to measure the environmental\ninformation. Spatial correlation between nodes exists in such wireless sensor\nnetwork based on common sensory coverage and then the redundant data\ncommunication is observed. To study virus spreading dynamics in such scenario,\na modified SI epidemic model is derived mathematically by incorporating WSN\nparameters such as spatial correlation, node density, sensing range,\ntransmission range, total sensor nodes etc. The solution for proposed SI model\nis also determined to study the dynamics with time. Initially, a small number\nof nodes are attacked by viruses and then virus infection propagates through\nits neighboring nodes over normal data communication. Since redundant nodes\nexists in correlated sensor field, virus spread process could be different with\ndifferent sensory coverage. The proposed SI model captures spatial and temporal\ndynamics than existing ones which are global. The infection process leads to\nnetwork failure. By exploiting spatial correlation between nodes, spread\ncontrol scheme is developed to limit the further infection in the network.\nNumerical result analysis is provided with comparison for validation.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jan 2018 11:30:55 GMT"}], "update_date": "2018-01-16", "authors_parsed": [["Shakya", "Rajeev K.", "", "Department of Electrical and Electronics\n  Engineering, Galgotia College of Engineering and Technology Greater noida"]]}, {"id": "1801.04837", "submitter": "Celso Carvalho", "authors": "Eric V. das Neves, Ronaldo N. Martins, Celso B. Carvalho and Edjair\n  Mota", "title": "Disseminacao de mensagens DTN com base em grupos de interesses", "comments": "IV Escola Regional de Informatica (ERIN 2017), in Portuguese", "journal-ref": "Eric V. Das Neves, Ronaldo Martins, Celso B. Carvalho and Edjair\n  Mota. Disseminacao de mensagens DTN com base em grupos de interesses. IV\n  Escola Regional de Informatica - ERIN, 2017", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent works explore social characteristics of nodes to improve message\ndelivery rate in Delay Tolerant Networks (DTN). This work uses machine learning\ntechniques to create node groups organized by common interests. Messages are\nsent to target groups, and from there to the final destination. Simulation\nresults using The ONE simulator show that the larger the group size the higher\nthe message delivery rate, that reaches 100% in some cases. The paper also\npresents results related to the groups of interest such as message delivery\nrat, delivery delay and an average number of hops to deliver messages. The\noverall results indicate that group-based routing is a promising research\nfiled.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jan 2018 07:36:53 GMT"}], "update_date": "2018-01-16", "authors_parsed": [["Neves", "Eric V. das", ""], ["Martins", "Ronaldo N.", ""], ["Carvalho", "Celso B.", ""], ["Mota", "Edjair", ""]]}, {"id": "1801.04907", "submitter": "Abdulrahman Baknina", "authors": "Abdulrahman Baknina and Omur Ozel and Jing Yang and Sennur Ulukus and\n  Aylin Yener", "title": "Sending Information Through Status Updates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI eess.SP math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an energy harvesting transmitter sending status updates regarding\na physical phenomenon it observes to a receiver. Different from the existing\nliterature, we consider a scenario where the status updates carry information\nabout an independent message. The transmitter encodes this message into the\ntimings of the status updates. The receiver needs to extract this encoded\ninformation, as well as update the status of the observed phenomenon. The\ntimings of the status updates, therefore, determine both the age of information\n(AoI) and the message rate (rate). We study the tradeoff between the achievable\nmessage rate and the achievable average AoI. We propose several achievable\nschemes and compare their rate-AoI performances.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jan 2018 18:51:22 GMT"}], "update_date": "2018-01-16", "authors_parsed": [["Baknina", "Abdulrahman", ""], ["Ozel", "Omur", ""], ["Yang", "Jing", ""], ["Ulukus", "Sennur", ""], ["Yener", "Aylin", ""]]}, {"id": "1801.04964", "submitter": "Suzan Bayhan", "authors": "Suzan Bayhan, G\\\"urkan G\\\"ur, Anatolij Zubow", "title": "The Future is Unlicensed: Coexistence in the Unlicensed Spectrum for 5G", "comments": "7 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  5G has to fulfill the requirements of ultra-dense, scalable, and customizable\nnetworks such as IoT while increasing spectrum and energy efficiency. Given the\ndiversity of envisaged applications and scenarios, one crucial property for 5G\nNew Radio (NR) is flexibility: flexible UL/DL allocation, bandwidths, or\nscalable transmission time interval, and most importantly operation at\ndifferent frequency bands. In particular, 5G should exploit the spectral\nopportunities in the unlicensed spectrum for expanding network capacity when\nand where needed. However, unlicensed bands pose the challenge of \"coexisting\nnetworks\", which mostly lack the means of communication for negotiation and\ncoordination. This deficiency is further exacerbated by the heterogeneity,\nmassive connectivity, and ubiquity of IoT systems and applications. Therefore,\n5G needs to provide mechanisms to coexist and even converge in the unlicensed\nbands. In that regard, WiFi, as the most prominent wireless technology in the\nunlicensed bands, is both a key enabler for boosting 5G capacity and competitor\nof 5G cellular networks for the shared unlicensed spectrum. In this work, we\ndescribe spectrum sharing in 5G and present key coexistence solutions, mostly\nin the context of WiFi. We also highlight the role of machine learning which is\nenvisaged to be critical for reaching coexistence and convergence goals by\nproviding the necessary intelligence and adaptation mechanisms.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jan 2018 19:51:11 GMT"}], "update_date": "2018-01-17", "authors_parsed": [["Bayhan", "Suzan", ""], ["Gür", "Gürkan", ""], ["Zubow", "Anatolij", ""]]}, {"id": "1801.05168", "submitter": "Jan R\\\"uth", "authors": "Jan R\\\"uth and Ingmar Poese and Christoph Dietzel and Oliver Hohlfeld", "title": "A First Look at QUIC in the Wild", "comments": null, "journal-ref": "Passive Active Measurements Conference (PAM), 2018", "doi": "10.1007/978-3-319-76481-8_19", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the first time since the establishment of TCP and UDP, the Internet\ntransport layer is subject to a major change by the introduction of QUIC.\nInitiated by Google in 2012, QUIC provides a reliable, connection-oriented\nlow-latency and fully encrypted transport. In this paper, we provide the first\nbroad assessment of QUIC usage in the wild. We monitor the entire IPv4 address\nspace since August 2016 and about 46% of the DNS namespace to detected\nQUIC-capable infrastructures. Our scans show that the number of QUIC-capable\nIPs has more than tripled since then to over 617.59 K. We find around 161K\ndomains hosted on QUIC-enabled infrastructure, but only 15K of them present\nvalid certificates over QUIC. Second, we analyze one year of traffic traces\nprovided by MAWI, one day of a major European tier-1 ISP and from a large IXP\nto understand the dominance of QUIC in the Internet traffic mix. We find QUIC\nto account for 2.6% to 9.1% of the current Internet traffic, depending on the\nvantage point. This share is dominated by Google pushing up to 42.1% of its\ntraffic via QUIC.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jan 2018 09:24:48 GMT"}, {"version": "v2", "created": "Sun, 24 Feb 2019 13:08:40 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Rüth", "Jan", ""], ["Poese", "Ingmar", ""], ["Dietzel", "Christoph", ""], ["Hohlfeld", "Oliver", ""]]}, {"id": "1801.05204", "submitter": "Andrei Marinescu", "authors": "Andrei Marinescu, Irene Macaluso, Luiz A. DaSilva", "title": "A Multi-Agent Neural Network for Dynamic Frequency Reuse in LTE Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fractional Frequency Reuse techniques can be employed to address interference\nin mobile networks, improving throughput for edge users. There is a tradeoff\nbetween the coverage and overall throughput achievable, as interference\navoidance techniques lead to a loss in a cell's overall throughput, with\nspectrum efficiency decreasing with the fencing off of orthogonal resources. In\nthis paper we propose MANN, a dynamic multiagent frequency reuse scheme, where\nindividual agents in charge of cells control their configurations based on\ninput from neural networks. The agents' decisions are partially influenced by a\ncoordinator agent, which attempts to maximise a global metric of the network\n(e.g., cell-edge performance). Each agent uses a neural network to estimate the\nbest action (i.e., cell configuration) for its current environment setup, and\nattempts to maximise in turn a local metric, subject to the constraint imposed\nby the coordinator agent. Results show that our solution provides improved\nperformance for edge users, increasing the throughput of the bottom 5% of users\nby 22%, while retaining 95% of a network's overall throughput from the full\nfrequency reuse case. Furthermore, we show how our method improves on static\nfractional frequency reuse schemes.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jan 2018 10:59:41 GMT"}], "update_date": "2018-01-17", "authors_parsed": [["Marinescu", "Andrei", ""], ["Macaluso", "Irene", ""], ["DaSilva", "Luiz A.", ""]]}, {"id": "1801.05210", "submitter": "Xiaoda Jiang", "authors": "Xiaoda Jiang, Hancheng Lu, Chang Wen Chen", "title": "Enabling Quality-Driven Scalable Video Transmission over Multi-User NOMA\n  System", "comments": "9 pages, 6 figures. This paper has already been accepted by IEEE\n  INFOCOM 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.MM cs.NI eess.SP math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, non-orthogonal multiple access (NOMA) has been proposed to achieve\nhigher spectral efficiency over conventional orthogonal multiple access.\nAlthough it has the potential to meet increasing demands of video services, it\nis still challenging to provide high performance video streaming. In this\nresearch, we investigate, for the first time, a multi-user NOMA system design\nfor video transmission. Various NOMA systems have been proposed for data\ntransmission in terms of throughput or reliability. However, the perceived\nquality, or the quality-of-experience of users, is more critical for video\ntransmission. Based on this observation, we design a quality-driven scalable\nvideo transmission framework with cross-layer support for multi-user NOMA. To\nenable low complexity multi-user NOMA operations, a novel user grouping\nstrategy is proposed. The key features in the proposed framework include the\nintegration of the quality model for encoded video with the physical layer\nmodel for NOMA transmission, and the formulation of multi-user NOMA-based video\ntransmission as a quality-driven power allocation problem. As the problem is\nnon-concave, a global optimal algorithm based on the hidden monotonic property\nand a suboptimal algorithm with polynomial time complexity are developed.\nSimulation results show that the proposed multi-user NOMA system outperforms\nexisting schemes in various video delivery scenarios.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jan 2018 11:12:28 GMT"}], "update_date": "2018-01-17", "authors_parsed": [["Jiang", "Xiaoda", ""], ["Lu", "Hancheng", ""], ["Chen", "Chang Wen", ""]]}, {"id": "1801.05309", "submitter": "Mouhammd Alkasassbeh", "authors": "Mouhammd Alkasassbeh", "title": "A Novel Hybrid Method for Network Anomaly Detection Based on Traffic\n  Prediction and Change Point Detection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, computer networks have become more and more advanced in\nterms of size, applications, complexity and level of heterogeneity. Moreover,\navailability and performance are important issues for end users. New types of\ncyber-attacks that can affect and damage network performance and availability\nare constantly emerging and some threats, such as Distributed Denial of Service\n(DDoS) attacks, can be very dangerous and cannot be easily prevented. In this\nstudy, we present a novel hybrid approach to detecting a DDoS attack by means\nof monitoring abnormal traffic in the network. This approach reads traffic data\nand from that it is possible to build a model, by means of which future data\nmay be predicted and compared with observed data, in order to detect any\nabnormal traffic. This approach combines two methods: traffic prediction and\nchanging detection. To the best of our knowledge, such a combination has never\nbeen used in this area before. The approach achieved a highly significant\naccuracy rate of 98.3% and sensitivity was 100%, which means that all potential\nattacks are detected and prevented from penetrating the network system.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jan 2018 09:24:12 GMT"}], "update_date": "2018-01-17", "authors_parsed": [["Alkasassbeh", "Mouhammd", ""]]}, {"id": "1801.05388", "submitter": "Zhiwen Hu", "authors": "Zhiwen Hu, Zijie Zheng, Lingyang Song, Tao Wang, and Xiaoming Li", "title": "UAV Offloading: Spectrum Trading Contract Design for UAV Assisted 5G\n  Networks", "comments": "30 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unmanned Aerial Vehicle (UAV) has been recognized as a promising way to\nassist future wireless communications due to its high flexibility of deployment\nand scheduling. In this paper, we focus on temporarily deployed UAVs that\nprovide downlink data offloading in some regions under a macro base station\n(MBS). Since the manager of the MBS and the operators of the UAVs could be of\ndifferent interest groups, we formulate the corresponding spectrum trading\nproblem by means of contract theory, where the manager of the MBS has to design\nan optimal contract to maximize its own revenue. Such contract comprises a set\nof bandwidth options and corresponding prices, and each UAV operator only\nchooses the most profitable one from all the options in the whole contract. We\nanalytically derive the optimal pricing strategy based on fixed bandwidth\nassignment, and then propose a dynamic programming algorithm to calculate the\noptimal bandwidth assignment in polynomial time. By simulations, we compare the\noutcome of the MBS optimal contract with that of a social optimal one, and find\nthat a selfish MBS manager sells less bandwidth to the UAV operators.\n", "versions": [{"version": "v1", "created": "Sun, 17 Dec 2017 12:36:06 GMT"}, {"version": "v2", "created": "Sun, 28 Jan 2018 04:51:28 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Hu", "Zhiwen", ""], ["Zheng", "Zijie", ""], ["Song", "Lingyang", ""], ["Wang", "Tao", ""], ["Li", "Xiaoming", ""]]}, {"id": "1801.05537", "submitter": "Abhishek Gupta", "authors": "Abhishek Gupta, Massimo Tornatore, Brigitte Jaumard, Biswanath\n  Mukherjee", "title": "Virtual-Mobile-Core Placement for Metro Network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional highly-centralized mobile core networks (e.g., Evolved Packet\nCore (EPC)) need to be constantly upgraded both in their network functions and\nbackhaul links, to meet increasing traffic demands. Network Function\nVirtualization (NFV) is being investigated as a potential cost-effective\nsolution for this upgrade. A virtual mobile core (here, virtual EPC, vEPC)\nprovides deployment flexibility and scalability while reducing costs,\nnetwork-resource consumption and application delay. Moreover, a distributed\ndeployment of vEPC is essential for emerging paradigms like Multi-Access Edge\nComputing (MEC). In this work, we show that significant reduction in\nnetworkresource consumption can be achieved as a result of optimal placement of\nvEPC functions in metro area. Further, we show that not all vEPC functions need\nto be distributed. In our study, for the first time, we account for vEPC\ninteractions in both data and control planes (Non-Access Stratum (NAS)\nsignaling procedure Service Chains (SCs) with application latency requirements)\nusing a detailed mathematical model.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 03:43:12 GMT"}, {"version": "v2", "created": "Tue, 3 Apr 2018 16:19:02 GMT"}], "update_date": "2018-04-04", "authors_parsed": [["Gupta", "Abhishek", ""], ["Tornatore", "Massimo", ""], ["Jaumard", "Brigitte", ""], ["Mukherjee", "Biswanath", ""]]}, {"id": "1801.05541", "submitter": "Samith Abeywickrama", "authors": "Samith Abeywickrama, Lei Liu, Yuhao Chi, and Chau Yuen", "title": "Over-the-Air Implementation of Uplink NOMA", "comments": "6 pages, 7 figures, in Proc. IEEE Global Communications Conference\n  (GLOBECOM), 2017", "journal-ref": null, "doi": "10.1109/GLOCOM.2017.8254920", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Though the concept of non-orthogonal multiple access (NOMA) was proposed\nseveral years ago, the performance of uplink NOMA has only been verified in\ntheory, but not in practice. This paper presents an over-the-air implementation\nof a uplink NOMA system, while providing solutions to most common practical\nproblems, i.e., carrier frequency offset (CFO) synchronization, time\nsynchronization, and channel estimation. The implemented CFO synchronization\nmethod adopts the primary synchronization signal (PSS) of LTE. Also, we design\na novel preamble for each uplink user, and it is appended to every frame before\nit is transmitted through the air. This preamble will be used for time\nsynchronization and channel estimation at the BS. Also, a low-complexity,\niterative linear minimum mean squared error (LMMSE) detector has been\nimplemented for multi-user decoding. The paper also validates the proposed\narchitecture numerically, as well as experimentally.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 04:12:13 GMT"}], "update_date": "2018-01-18", "authors_parsed": [["Abeywickrama", "Samith", ""], ["Liu", "Lei", ""], ["Chi", "Yuhao", ""], ["Yuen", "Chau", ""]]}, {"id": "1801.05604", "submitter": "Christos Liaskos K.", "authors": "A. Tsioliaridou, C. Liaskos, E. Dedu, S. Ioannidis", "title": "Packet Routing in 3D Nanonetworks: A Lightweight, Linear-path Scheme", "comments": null, "journal-ref": "Volume 12, June 2017, Pages 63-71", "doi": "10.1016/j.nancom.2017.01.001", "report-no": null, "categories": "cs.NI cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Packet routing in nanonetworks requires novel approaches, which can cope with\nthe extreme limitations posed by the nano-scale. Highly lossy wireless\nchannels, extremely limited hardware capabilities and non-unique node\nidentifiers are among the restrictions. The present work offers an addressing\nand routing solution for static 3D nanonetworks that find applications in\nmaterial monitoring and programmatic property tuning. The addressing process\nrelies on virtual coordinates from multiple, alternative anchor point sets that\nact as \\emph{viewports}. Each viewport offers different address granularity\nwithin the network space, and its selection is optimized by a packet sending\nnode using a novel heuristic. Regarding routing, each node can deduce whether\nit is located on the linear segment connecting the sender to the recipient\nnode. This deduction is made using integer calculations, node-local information\nand in a stateless manner, minimizing the computational and storage overhead of\nthe proposed scheme. Most importantly, the nodes can regulate the width of the\nlinear path, thus trading energy efficiency (redundant transmissions) for\nincreased path diversity. This trait can enable future adaptive routing\nschemes. Extensive evaluation via simulations highlights the advantages of the\nnovel scheme over related approaches.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 09:38:37 GMT"}], "update_date": "2018-01-18", "authors_parsed": [["Tsioliaridou", "A.", ""], ["Liaskos", "C.", ""], ["Dedu", "E.", ""], ["Ioannidis", "S.", ""]]}, {"id": "1801.05700", "submitter": "Alexander Erreygers", "authors": "Alexander Erreygers, Cristina Rottondi, Giacomo Verticale, Jasper De\n  Bock", "title": "Imprecise Markov Models for Scalable and Robust Performance Evaluation\n  of Flexi-Grid Spectrum Allocation Policies", "comments": "16 pages, 7 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The possibility of flexibly assigning spectrum resources with channels of\ndifferent sizes greatly improves the spectral efficiency of optical networks,\nbut can also lead to unwanted spectrum fragmentation.We study this problem in a\nscenario where traffic demands are categorised in two types (low or high\nbit-rate) by assessing the performance of three allocation policies. Our first\ncontribution consists of exact Markov chain models for these allocation\npolicies, which allow us to numerically compute the relevant performance\nmeasures. However, these exact models do not scale to large systems, in the\nsense that the computations required to determine the blocking\nprobabilities---which measure the performance of the allocation\npolicies---become intractable. In order to address this, we first extend an\napproximate reduced-state Markov chain model that is available in the\nliterature to the three considered allocation policies. These reduced-state\nMarkov chain models allow us to tractably compute approximations of the\nblocking probabilities, but the accuracy of these approximations cannot be\neasily verified. Our main contribution then is the introduction of\nreduced-state imprecise Markov chain models that allow us to derive guaranteed\nlower and upper bounds on blocking probabilities, for the three allocation\npolicies separately or for all possible allocation policies simultaneously.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 15:02:49 GMT"}, {"version": "v2", "created": "Thu, 25 Jan 2018 15:03:03 GMT"}, {"version": "v3", "created": "Fri, 27 Apr 2018 16:51:02 GMT"}], "update_date": "2018-04-30", "authors_parsed": [["Erreygers", "Alexander", ""], ["Rottondi", "Cristina", ""], ["Verticale", "Giacomo", ""], ["De Bock", "Jasper", ""]]}, {"id": "1801.05756", "submitter": "Lifeng Wang", "authors": "Yongxu Zhu, Gan Zheng, Lifeng Wang, Kai-Kit Wong, and Liqiang Zhao", "title": "Content Placement in Cache-Enabled Sub-6 GHz and Millimeter-Wave\n  Multi-antenna Dense Small Cell Networks", "comments": "14 pages; Accepted to appear in IEEE Transactions on Wireless\n  Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the performance of cache-enabled dense small cell networks\nconsisting of multi-antenna sub-6 GHz and millimeter-wave base stations.\nDifferent from the existing works which only consider a single antenna at each\nbase station, the optimal content placement is unknown when the base stations\nhave multiple antennas. We first derive the successful content delivery\nprobability by accounting for the key channel features at sub-6 GHz and mmWave\nfrequencies. The maximization of the successful content delivery probability is\na challenging problem. To tackle it, we first propose a constrained\ncross-entropy algorithm which achieves the near-optimal solution with moderate\ncomplexity. We then develop another simple yet effective heuristic\nprobabilistic content placement scheme, termed two-stair algorithm, which\nstrikes a balance between caching the most popular contents and achieving\ncontent diversity. Numerical results demonstrate the superior performance of\nthe constrained cross-entropy method and that the two-stair algorithm yields\nsignificantly better performance than only caching the most popular contents.\nThe comparisons between the sub-6 GHz and mmWave systems reveal an interesting\ntradeoff between caching capacity and density for the mmWave system to achieve\nsimilar performance as the sub-6 GHz system.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 17:07:09 GMT"}], "update_date": "2018-01-18", "authors_parsed": [["Zhu", "Yongxu", ""], ["Zheng", "Gan", ""], ["Wang", "Lifeng", ""], ["Wong", "Kai-Kit", ""], ["Zhao", "Liqiang", ""]]}, {"id": "1801.05757", "submitter": "Zhiyuan Xu", "authors": "Zhiyuan Xu, Jian Tang, Jingsong Meng, Weiyi Zhang, Yanzhi Wang, Chi\n  Harold Liu and Dejun Yang", "title": "Experience-driven Networking: A Deep Reinforcement Learning based\n  Approach", "comments": "9 pages, 12 figures, paper is accepted as a conference paper at IEEE\n  Infocom 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.AI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern communication networks have become very complicated and highly\ndynamic, which makes them hard to model, predict and control. In this paper, we\ndevelop a novel experience-driven approach that can learn to well control a\ncommunication network from its own experience rather than an accurate\nmathematical model, just as a human learns a new skill (such as driving,\nswimming, etc). Specifically, we, for the first time, propose to leverage\nemerging Deep Reinforcement Learning (DRL) for enabling model-free control in\ncommunication networks; and present a novel and highly effective DRL-based\ncontrol framework, DRL-TE, for a fundamental networking problem: Traffic\nEngineering (TE). The proposed framework maximizes a widely-used utility\nfunction by jointly learning network environment and its dynamics, and making\ndecisions under the guidance of powerful Deep Neural Networks (DNNs). We\npropose two new techniques, TE-aware exploration and actor-critic-based\nprioritized experience replay, to optimize the general DRL framework\nparticularly for TE. To validate and evaluate the proposed framework, we\nimplemented it in ns-3, and tested it comprehensively with both representative\nand randomly generated network topologies. Extensive packet-level simulation\nresults show that 1) compared to several widely-used baseline methods, DRL-TE\nsignificantly reduces end-to-end delay and consistently improves the network\nutility, while offering better or comparable throughput; 2) DRL-TE is robust to\nnetwork changes; and 3) DRL-TE consistently outperforms a state-ofthe-art DRL\nmethod (for continuous control), Deep Deterministic Policy Gradient (DDPG),\nwhich, however, does not offer satisfying performance.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 17:09:01 GMT"}], "update_date": "2018-01-18", "authors_parsed": [["Xu", "Zhiyuan", ""], ["Tang", "Jian", ""], ["Meng", "Jingsong", ""], ["Zhang", "Weiyi", ""], ["Wang", "Yanzhi", ""], ["Liu", "Chi Harold", ""], ["Yang", "Dejun", ""]]}, {"id": "1801.05795", "submitter": "Gamal Sallam", "authors": "Gamal Sallam, Gagan R. Gupta, Bin Li, and Bo Ji", "title": "Shortest Path and Maximum Flow Problems Under Service Function Chaining\n  Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the advent of Network Function Virtualization (NFV), Physical Network\nFunctions (PNFs) are gradually being replaced by Virtual Network Functions\n(VNFs) that are hosted on general purpose servers. Depending on the call flows\nfor specific services, the packets need to pass through an ordered set of\nnetwork functions (physical or virtual) called Service Function Chains (SFC)\nbefore reaching the destination. Conceivably for the next few years during this\ntransition, these networks would have a mix of PNFs and VNFs, which brings an\ninteresting mix of network problems that are studied in this paper: (1) How to\nfind an SFC-constrained shortest path between any pair of nodes? (2) What is\nthe achievable SFC-constrained maximum flow? (3) How to place the VNFs such\nthat the cost (the number of nodes to be virtualized) is minimized, while the\nmaximum flow of the original network can still be achieved even under the SFC\nconstraint? In this work, we will try to address such emerging questions.\nFirst, for the SFC-constrained shortest path problem, we propose a\ntransformation of the network graph to minimize the computational complexity of\nsubsequent applications of any shortest path algorithm. Second, we formulate\nthe SFC-constrained maximum flow problem as a fractional multicommodity flow\nproblem, and develop a combinatorial algorithm for a special case of practical\ninterest. Third, we prove that the VNFs placement problem is NP-hard and\npresent an alternative Integer Linear Programming (ILP) formulation. Finally,\nwe conduct simulations to elucidate our theoretical results.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 18:45:21 GMT"}], "update_date": "2018-01-18", "authors_parsed": [["Sallam", "Gamal", ""], ["Gupta", "Gagan R.", ""], ["Li", "Bin", ""], ["Ji", "Bo", ""]]}, {"id": "1801.05823", "submitter": "Tao Deng", "authors": "Tao Deng, Lei You, Pingzhi Fan, Di Yuan", "title": "Device Caching for Network Offloading: Delay Minimization with Presence\n  of User Mobility", "comments": "To appear in IEEE Wireless Communication Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A delay-optimal caching problem (DOCP) in deviceto- device (D2D) networks\nwith moblity is modelled. The problem arises in the context of achieving\noffloading using device caching, and the offloading effect is represented by\nthe expected network load ratio (NLR) which is the percentage of data that has\nto be downloaded from the network. Compared with the related studies, this work\nconsiders minimizing delay with NLR guarantee in mobility scenarios. A lower\nbound of global optimum is derived, thus enabling performance benchmarking of\nany sub-optimal algorithm. For problem-solving, an effective search algorithm\n(ESA) is proposed based on the bound. Simulations are conducted to evaluate the\neffectiveness of the ESA algorithm.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 19:03:39 GMT"}], "update_date": "2018-01-19", "authors_parsed": [["Deng", "Tao", ""], ["You", "Lei", ""], ["Fan", "Pingzhi", ""], ["Yuan", "Di", ""]]}, {"id": "1801.05938", "submitter": "Cam Ly Nguyen Ms", "authors": "Cam Ly Nguyen and Aftab Khan", "title": "WiLAD: Wireless Localisation through Anomaly Detection", "comments": null, "journal-ref": "IEEE GLOBECOM 2017", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new approach towards RSS (Received Signal Strength) based\nwireless localisation for scenarios where, instead of absolute positioning of\nan object, only the information whether an object is inside or outside of a\nspecific area is required. This is motivated through a number of applications\nincluding, but not limited to, a) security: detecting whether an object is\nremoved from a secure location, b) wireless sensor networks: detecting sensor\nmovements outside of a network area, and c) computational behaviour analytics:\ndetecting customers leaving a retail store. The result of such detection\nsystems can naturally be utilised in building a higher level contextual\nunderstanding of a system or user behaviours. We use a supervised learning\nmethod to overcome issues related to RSS based localisation systems including\nmultipath fading, shadowing, and incorrect model parameters (as in unsupervised\nmethods). Moreover, to reduce the cost of collecting training data, we employ a\ndetection method called One-Class SVM (OC-SVM) which requires only one class of\ndata (positive data, or target class data) for training. We derive a\nmathematical approximation of accuracy which utilises the characteristics of\nwireless signals as well as OC-SVM. Based on this we then propose a novel\nmathematical formula to find optimal placement of devices. This enables us to\noptimize the placement without performing any costly experiments or\nsimulations. We validate our proposed mathematical framework based on simulated\nand real experiments.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jan 2018 05:13:15 GMT"}], "update_date": "2018-01-19", "authors_parsed": [["Nguyen", "Cam Ly", ""], ["Khan", "Aftab", ""]]}, {"id": "1801.05984", "submitter": "Ferdi Kara", "authors": "Ferdi Kara, Hakan Kaya, Okan Erkaymaz, Ertan Ozturk", "title": "Prediction of the Optimal Threshold Value in DF Relay Selection Schemes\n  Based on Artificial Neural Networks", "comments": "6 pages,IEEE INnovations in Intelligent SysTems and Applications\n  (INISTA), 2016 International Symposium on", "journal-ref": null, "doi": "10.1109/INISTA.2016.7571823", "report-no": null, "categories": "eess.SP cs.LG cs.NE cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In wireless communications, the cooperative communication (CC) technology\npromises performance gains compared to traditional Single-Input Single Output\n(SISO) techniques. Therefore, the CC technique is one of the nominees for 5G\nnetworks. In the Decode-and-Forward (DF) relaying scheme which is one of the CC\ntechniques, determination of the threshold value at the relay has a key role\nfor the system performance and power usage. In this paper, we propose\nprediction of the optimal threshold values for the best relay selection scheme\nin cooperative communications, based on Artificial Neural Networks (ANNs) for\nthe first time in literature. The average link qualities and number of relays\nhave been used as inputs in the prediction of optimal threshold values using\nArtificial Neural Networks (ANNs): Multi-Layer Perceptron (MLP) and Radial\nBasis Function (RBF) networks. The MLP network has better performance from the\nRBF network on the prediction of optimal threshold value when the same number\nof neurons is used at the hidden layer for both networks. Besides, the optimal\nthreshold values obtained using ANNs are verified by the optimal threshold\nvalues obtained numerically using the closed form expression derived for the\nsystem. The results show that the optimal threshold values obtained by ANNs on\nthe best relay selection scheme provide a minimum Bit-Error-Rate (BER) because\nof the reduction of the probability that error propagation may occur. Also, for\nthe same BER performance goal, prediction of optimal threshold values provides\n2dB less power usage, which is great gain in terms of green communicationBER\nperformance goal, prediction of optimal threshold values provides 2dB less\npower usage, which is great gain in terms of green communication.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jan 2018 12:36:38 GMT"}], "update_date": "2018-07-13", "authors_parsed": [["Kara", "Ferdi", ""], ["Kaya", "Hakan", ""], ["Erkaymaz", "Okan", ""], ["Ozturk", "Ertan", ""]]}, {"id": "1801.06018", "submitter": "Muhammad Bilal", "authors": "Muhammad Bilal, Moonsoo Kang, Sayed Chhattan Shah, and Shin-Gak Kang", "title": "Time-Slotted Scheduling Schemes for Multi-hop Concurrent Transmission in\n  WPANs with Directional Antenna", "comments": "11 pages, 10 figures, published in ETRI Journal, Volume 36, Number 3,\n  pp. 374-384, June 2014", "journal-ref": "ETRI Journal, vol. 36, no. 3, pp. 374-384, 2014", "doi": "10.4218/etrij.14.0113.0703", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To achieve high-speed (giga-bit) connectivity for short-range wireless\nmultimedia applications, the millimeter-wave (mmWave) wireless personal area\nnetworks with directional antennas are gaining increased interest. Due to the\nuse of directional antennas and mmWave communications, the probability of\nnon-interfering transmissions increases in a localized region. Network\nthroughput can be increased immensely by the concurrent time allocation of\nnon-interfering transmissions. The problem of finding optimum time allocation\nfor concurrent transmissions is an NP-hard problem. In this paper, we propose\ntwo enhanced versions of previously proposed multi-hop concurrent transmission\n(MHCT) schemes. To increase network capacity, the proposed schemes efficiently\nmake use of the free holes in the time-allocation map of the MHCT scheme; thus,\nmaking it more compact.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jan 2018 13:59:18 GMT"}], "update_date": "2018-01-19", "authors_parsed": [["Bilal", "Muhammad", ""], ["Kang", "Moonsoo", ""], ["Shah", "Sayed Chhattan", ""], ["Kang", "Shin-Gak", ""]]}, {"id": "1801.06326", "submitter": "Stephan Sigg", "authors": "Stephan Sigg", "title": "Some aspects of physical prototyping in Pervasive Computing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This document summarises the results of several research campaigns over the\npast seven years. The main connecting theme is the physical layer of widely\ndeployed sensors in Pervasive Computing domains. In particular, we have focused\non the RF-channel or on ambient audio.\n  The initial problem from which we started this work was that of distributed\nadaptive transmit beamforming. We have been looking for a simple method to\nalign the phases of jointly transmitting nodes (e.g. sensor or IoT nodes). The\nalgorithmic solution to this problem was to implement a distributed random\noptimisation method on the participating nodes in which the transmitters and\nthe receiver follow an iterative question-and-answer scheme. We have been able\nto derive sharp asymptotic bounds on the expected optimisation time of an\nevolutionary random optimiser and presented an asymptotically optimal approach.\n  One thing that we have learned from the work on these physical layer\nalgorithms was that the signals we work on are fragile and perceptive to\nphysical environmental changes. These could be obstacles such as furniture,\nopened or closed windows or doors as well as movement of individuals. This\nobservation motivated us to view the wireless interface as a sensor for\nenvironmental changes in Pervasive Computing environments.\n  Another use of physical layer RF-signals is for security applications.\n  We are currently working to further push these mentioned directions and novel\nfields of physical prototyping. In particular, the calculation of mathematical\noperations on the wireless channel at the time of transmission appears to\ncontain good potential for gains in efficiency for communication and\ncomputation in Pervasive Computing domains.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jan 2018 07:43:51 GMT"}], "update_date": "2018-01-22", "authors_parsed": [["Sigg", "Stephan", ""]]}, {"id": "1801.06447", "submitter": "Omid Taghizadeh M.Sc.", "authors": "Omid Taghizadeh, Praveen Sirvi, Santosh Narasimha, Jose Angel Leon\n  Calvo, Rudolf Mathar", "title": "Environment-Aware Minimum-Cost Wireless Backhaul Network Planning with\n  Full-Duplex Links", "comments": "Submuitted to IEEE for publication", "journal-ref": null, "doi": "10.1109/JSYST.2019.2893537", "report-no": null, "categories": "cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we address the joint design of the wireless backhauling network\ntopology as well as the frequency/power allocation on the wireless links, where\nnodes are capable of full-duplex (FD) operation. The proposed joint design\nenables the coexistence of multiple wireless links at the same channel,\nresulting in an enhanced spectral efficiency. Moreover, it enables the usage of\nFD capability when/where it is gainful. In this regard, a\nmixed-integer-linear-program (MILP) is proposed, aiming at a minimum cost\ndesign for the wireless backhaul network, considering the required rate demand\nat each base station. Moreover, a re-tunning algorithm is proposed which reacts\nto the slight changes in the network condition, e.g., channel attenuation or\nrate demand, by adjusting the transmit power at the wireless links. In this\nregard, a successive inner approximation (SIA)- based design is proposed, where\nin each step a convex subproblem is solved. Numerical simulations show a\nreduction in the overall network cost via the utilization of the proposed\ndesigns, thanks to the coexistence of multiple wireless links on the same\nchannel due to the FD capability.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jan 2018 17:35:03 GMT"}], "update_date": "2019-10-02", "authors_parsed": [["Taghizadeh", "Omid", ""], ["Sirvi", "Praveen", ""], ["Narasimha", "Santosh", ""], ["Calvo", "Jose Angel Leon", ""], ["Mathar", "Rudolf", ""]]}, {"id": "1801.06448", "submitter": "Ruchin Jain", "authors": "Ruchin Jain", "title": "A Congestion Control System Based on VANET for Small Length Roads", "comments": null, "journal-ref": "Annals of Emerging Technologies in Computing (AETiC), Print ISSN:\n  2516-0281, Online ISSN: 2516-029X, pp. 17-21, Vol. 2, No. 1, 1st January\n  2018, Published by International Association of Educators and Researchers\n  (IAER)", "doi": null, "report-no": null, "categories": "cs.NI cs.CE", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  As vehicle population has been increasing on a daily basis, this leads\ntowards increased number of accidents. To overcome this issue, Vehicular Ad Hoc\nNetwork (VANET) has come up with lot of novel ideas such as vehicular\ncommunication, navigation and traffic controlling. In this study, the main\nfocus is on congestion control at the intersections which result from unclear\nahead. For this purpose, a city lane and intersection model has been proposed\nto manage vehicle mobility. It shows the actual vehicle to vehicle and vehicle\nto traffic infrastructure communication. The experiment was conducted using\nNetwork Simulator 2 (NS 2). The implementation required modelling the road side\nunit, traffic control unit, and on-board unit along the roadside. In the\nsimulation, including traffic volume, the distance between two signals,\nend-to-end delay, packet delivery ratio, throughput and packet lost were taken\ninto consideration. These parameters ensure efficient communication between the\ntraffic signals. This results in improved congestion control and road safety,\nsince the vehicles will be signalled not to enter the junction box and\ninformation about other vehicles.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 09:15:04 GMT"}], "update_date": "2018-01-22", "authors_parsed": [["Jain", "Ruchin", ""]]}, {"id": "1801.06449", "submitter": "Yanxiang Jiang", "authors": "Yanxiang Jiang, Miaoli Ma, Mehdi Bennis, Fu-Chun Zheng, Xiaohu You", "title": "User Preference Learning Based Edge Caching for Fog Radio Access Network", "comments": "16 pages, 9 figures. This work has been accepted by IEEE Transactions\n  on Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the edge caching problem in fog radio access network (F-RAN)\nis investigated. By maximizing the overall cache hit rate, the edge caching\noptimization problem is formulated to find the optimal policy. Content\npopularity in terms of time and space is considered from the perspective of\nregional users. We propose an online content popularity prediction algorithm by\nleveraging the content features and user preferences, and an offline user\npreference learning algorithm by using the {online gradient descent} (OGD)\nmethod and the {follow the (proximally) regularized leader} (FTRL-Proximal)\nmethod. Our proposed edge caching policy not only can promptly predict the\nfuture content popularity in an online fashion with low complexity, {but also}\ncan track the content popularity with spatial and temporal popularity dynamic\nin time without delay. Furthermore, we design two learning based edge caching\narchitectures. Moreover, we theoretically derive the upper bound of the\npopularity prediction error, the lower bound of the cache hit rate, and the\nregret bound of the overall cache hit rate of our proposed edge caching policy.\nSimulation results show that the overall cache hit rate of our proposed policy\nis superior to those of the traditional policies and asymptotically approaches\nthe optimal performance.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jan 2018 07:11:35 GMT"}, {"version": "v2", "created": "Wed, 27 Feb 2019 13:39:39 GMT"}], "update_date": "2019-02-28", "authors_parsed": [["Jiang", "Yanxiang", ""], ["Ma", "Miaoli", ""], ["Bennis", "Mehdi", ""], ["Zheng", "Fu-Chun", ""], ["You", "Xiaohu", ""]]}, {"id": "1801.06450", "submitter": "Ha-Vu Tran", "authors": "Ha-Vu Tran and Georges Kaddoum", "title": "Green Cell-less Design for RF-Wireless Power Transfer Networks", "comments": "7 pages, 8 figures, accepted for publication in IEEE Wireless\n  Communications and Networking Conference, 15-18 April 2018, Barcelona, Spain", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a new concept so-called green cell-less radio frequency\n(RF) wireless power transfer (WPT) networks. We consider a scenario in which\nmultiple indoor access points (APs) equipped with outdoor energy harvesters are\nconnected with a central control unit via backhaul links. Further, such APs\nexploit the harnessed green energy to recharge wirelessly indoor devices under\nthe coordination of the control unit. Considering the network, we focus on AP\nselection and beamforming optimization to maximize the total energy harvesting\n(EH) rate. The resulting mathematical problem has the form of mixed-integer\noptimization that is intractable to solve. Thus, we propose an algorithm to\ntackle this difficulty. Through numerical results, we show the advantages of\nthe cell-less design over the conventional small-cell one to validate our\nideas. In particular, the issue on safety requirements of human exposure to RF\nradiation is discussed. Finally, potential future research is provided.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jan 2018 17:16:50 GMT"}], "update_date": "2018-01-22", "authors_parsed": [["Tran", "Ha-Vu", ""], ["Kaddoum", "Georges", ""]]}, {"id": "1801.06451", "submitter": "Mingyan Li", "authors": "Mingyan Li and Xinping Guan and Cunqing Hua and Cailian Chen and Ling\n  Lyu", "title": "Predictive Pre-allocation for Low-latency Uplink Access in Industrial\n  Wireless Networks", "comments": "Full version (accepted by INFOCOM 2018)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Driven by mission-critical applications in modern industrial systems, the 5th\ngeneration (5G) communication system is expected to provide ultra-reliable\nlow-latency communications (URLLC) services to meet the quality of service\n(QoS) demands of industrial applications. However, these stringent requirements\ncannot be guaranteed by its conventional dynamic access scheme due to the\ncomplex signaling procedure. A promising solution to reduce the access delay is\nthe pre-allocation scheme based on the semi-persistent scheduling (SPS)\ntechnique, which however may lead to low spectrum utilization if the allocated\nresource blocks (RBs) are not used. In this paper, we aim to address this issue\nby developing DPre, a predictive pre-allocation framework for uplink access\nscheduling of delay-sensitive applications in industrial process automation.\nThe basic idea of DPre is to explore and exploit the correlation of data\nacquisition and access behavior between nodes through static and dynamic\nlearning mechanisms in order to make judicious resource per-allocation\ndecisions. We evaluate the effectiveness of DPre based on several monitoring\napplications in a steel rolling production process. Simulation results\ndemonstrate that DPre achieves better performance in terms of the prediction\naccuracy, which can effectively increase the rewards of those reserved\nresources.\n", "versions": [{"version": "v1", "created": "Sat, 6 Jan 2018 06:52:14 GMT"}], "update_date": "2018-01-22", "authors_parsed": [["Li", "Mingyan", ""], ["Guan", "Xinping", ""], ["Hua", "Cunqing", ""], ["Chen", "Cailian", ""], ["Lyu", "Ling", ""]]}, {"id": "1801.06619", "submitter": "K. N. R. Surya Vara Prasad", "authors": "K. N. R. Surya Vara Prasad, Ekram Hossain, and Vijay K. Bhargava", "title": "Machine Learning Methods for User Positioning With Uplink RSS in\n  Distributed Massive MIMO", "comments": "submitted to IEEE Trans. Wireless Commun., Jan 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a machine learning approach based on Gaussian process regression\n(GP) to position users in a distributed massive multiple-input multiple-output\n(MIMO) system with the uplink received signal strength (RSS) data. We focus on\nthe scenario where noise-free RSS is available for training, but only noisy RSS\nis available for testing purposes. To estimate the test user locations and\ntheir 2{\\sigma} error-bars, we adopt two state-of-the-art GP methods, namely,\nthe conventional GP (CGP) and the numerical approximation GP (NaGP) methods. We\nfind that the CGP method, which treats the noisy test RSS vectors as\nnoise-free, provides unrealistically small 2{\\sigma} error-bars on the\nestimated locations. To alleviate this concern, we derive the true predictive\ndistribution for the test user locations and then employ the NaGP method to\nnumerically approximate it as a Gaussian with the same first and second order\nmoments. We also derive a Bayesian Cramer-Rao lower bound (BCRLB) on the\nachievable root- mean-squared-error (RMSE) performance of the two GP methods.\nSimulation studies reveal that: (i) the NaGP method indeed provides realistic\n2{\\sigma} error-bars on the estimated locations, (ii) operation in massive MIMO\nregime improves the RMSE performance, and (iii) the achieved RMSE performances\nare very close to the derived BCRLB.\n", "versions": [{"version": "v1", "created": "Sat, 20 Jan 2018 03:53:44 GMT"}], "update_date": "2018-01-23", "authors_parsed": [["Prasad", "K. N. R. Surya Vara", ""], ["Hossain", "Ekram", ""], ["Bhargava", "Vijay K.", ""]]}, {"id": "1801.06623", "submitter": "Ming Ding Dr.", "authors": "Ming Ding, David Lopez Perez", "title": "Promises and Caveats of Uplink IoT Ultra-Dense Networks", "comments": "to appear in IEEE WCNC2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, by means of simulations, we evaluate the uplink (UL)\nperformance of an Internet of Things (IoT) capable ultra-dense network (UDN) in\nterms of the coverage probability and the density of reliably working user\nequipments (UEs). From our study, we show the benefits and challenges that UL\nIoT UDNs will bring about in the future. In more detail, for a low-reliability\ncriterion, such as achieving a UL signal-to-interference-plus-noise ratio\n(SINR) above 0 dB, the density of reliably working UEs grows quickly with the\nnetwork densification, showing the potential of UL IoT UDNs. In contrast, for a\nhigh-reliability criterion, such as achieving a UL SINR above 10 dB, the\ndensity of reliably working UEs remains to be low in UDNs due to excessive\ninter-cell interference, which should be considered when operating UL IoT UDNs.\nMoreover, considering the existence of a non-zero antenna height difference\nbetween base stations (BSs) and UEs, the density of reliably working UEs could\neven decrease as we deploy more BSs. This calls for the usage of sophisticated\ninterference management schemes and/or beam steering/shaping technologies in UL\nIoT UDNs.\n", "versions": [{"version": "v1", "created": "Sat, 20 Jan 2018 05:08:10 GMT"}], "update_date": "2018-01-23", "authors_parsed": [["Ding", "Ming", ""], ["Perez", "David Lopez", ""]]}, {"id": "1801.06716", "submitter": "Seungmo Kim", "authors": "Imtiaz Nasim and Seungmo Kim", "title": "Mitigation of Human Exposure to RF Fields in Downlink of Millimeter-Wave\n  Cellular Systems", "comments": "Submitted to IEEE INFOCOM 2018. arXiv admin note: text overlap with\n  arXiv:1711.03683", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Out of the very few studies that paid proper attention to the harmful health\nimpacts in millimeter-wave (mmW) communications, most of them are concerned\nabout uplink cases due to closer contact with the human body. Our recent study\nrevealed that even the human exposure to radio frequency (RF) fields in\ndownlink mmW technology is not very minimum to be ignored. There were a few RF\nexposure mitigation techniques for uplinks, but the downlink scenario is hardly\npaid any attention. However, this paper proposes a downlink protocol for mmW\ncellular communications that achieves the maximum data rate while keeping the\nimpacts on human health minimized. Our results show that the proposed technique\nlowers both power density (PD) and specific absorption rate (SAR) compared to\nthe typical protocol, with only slight sacrifice in data rates.\n", "versions": [{"version": "v1", "created": "Sat, 20 Jan 2018 19:25:30 GMT"}], "update_date": "2018-01-23", "authors_parsed": [["Nasim", "Imtiaz", ""], ["Kim", "Seungmo", ""]]}, {"id": "1801.06866", "submitter": "Rakesh Kumar Jha Dr", "authors": "Pimmy Gandotra, Rakesh Kumar Jha, Sanjeev Jain", "title": "Sector-Based Radio Resource Allocation (SBRRA) Algorithm for Better\n  Quality of Service and Experience in Device-to-Device (D2D) Communication", "comments": "IEEE Transactions", "journal-ref": null, "doi": "10.1109/TVT.2017.2787767", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The mounting content sharing among users has resulted in a considerable rise\nin wireless data traffic, pressurizing the cellular networks to undergo a\nsuitable upheaval. A competent technology of the fifth-generation networks (5G)\nfor efficiently supporting proximity-based applications is Device-to-Device\n(D2D) communication, underlaying cellular networks. Significant advances have\nbeen made till date, for allocating resources to D2D users in cellular\nnetworks, such that sharing of spectral resources between cellular and D2D\nusers is carried out in a coordinated manner. In this paper, a sector-based\nradio resource allocation (SBRRA) algorithm for resource block allocation to\nD2D pairs has been proposed, where the number of resource blocks (RBs) is\nallocated to each D2D pair in an adaptive manner, based on the demanded\napplication by each pair. Different applications demand a varying number of\nRBs, in accordance with their priority. This algorithm focusses on the use of\nsectored antennas at the base station, for a better performance and low\ncomplexity. Extensive simulations are carried out, considering real-time\nscenario, for ensuring satisfactory Quality of Service (QoS) and Quality of\nExperience (QoE) by the users. The efficiency of the proposed scheme is proved\nby comparing it with the RB allocation using Hidden Markov Model (HMM).\n", "versions": [{"version": "v1", "created": "Sun, 21 Jan 2018 18:17:08 GMT"}], "update_date": "2018-01-23", "authors_parsed": [["Gandotra", "Pimmy", ""], ["Jha", "Rakesh Kumar", ""], ["Jain", "Sanjeev", ""]]}, {"id": "1801.06964", "submitter": "Soo-Min Kim", "authors": "Jeemin Kim, Soo-Min Kim, Han Cha, Jinho Choi, Seung-Woo Ko,\n  Chan-Byoung Chae, and Seong-Lyun Kim", "title": "Opportunism in Dynamic Spectrum Access for 5G: A Concept and Its\n  Application to Duplexing", "comments": "9 pages, 6 figures, real-time demonstration at IEEE Globecom,\n  Singapore in Dec. 2017, and full demonstration video is available at\n  http://www.cbchae.org/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the envisioned massive Internet-of-Things (IoT) era, one of the\nchallenges for 5G wireless systems will be handling the unprecedented spectrum\ncrunch. A potential solution has emerged in the form of spectrum sharing, which\ndeviates from a monopolistic spectrum usage system. This article investigates\nthe medium access control (MAC) as a means of increasing the viability of the\nspectrum sharing technique. We first quantify the opportunity of spectrum\naccess in a probabilistic manner, a method referred to as opportunity\nprobability (OP). Based on the OP framework, we propose a random MAC algorithm\nin which the access of a node is randomly determined with its own OP value. As\na possible application of our OP based random MAC, we propose a hybrid half\nduplex (HD)/full duplex (FD) communication where each pair decides the\nduplexing mode according to the OP values of the two pair nodes. This approach\nfits well with the spectrum sharing system since it enables a flexible\noperation for the spectrum access according to the spectrum usage level. From\nthe numerical analysis, we validate the feasibility and verify the performance\nenhancements by implementing an FPGA based real-time prototype. Measurements\nand numerical results confirm that the proposed architecture can achieve up to\n4 times higher system throughput than conventional LTE-TDD (time division\nduplex) systems.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jan 2018 06:29:42 GMT"}], "update_date": "2018-01-23", "authors_parsed": [["Kim", "Jeemin", ""], ["Kim", "Soo-Min", ""], ["Cha", "Han", ""], ["Choi", "Jinho", ""], ["Ko", "Seung-Woo", ""], ["Chae", "Chan-Byoung", ""], ["Kim", "Seong-Lyun", ""]]}, {"id": "1801.07029", "submitter": "Ma\\\"el Guiraud", "authors": "Dominique Barth, Ma\\\"el Guiraud, Yann Strozecki", "title": "Deterministic Scheduling of Periodic Messages for Low Latency in Cloud\n  RAN", "comments": "40 pages, 23 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A recent trend in mobile networks is to centralize in distant data-centers\nthe processing units which were attached to antennas until now. The main\nchallenge is to guarantee that the latency of the periodic messages sent from\nthe antennas to their processing units and back, fulfills protocol time\nconstraints. We show that traditional statistical multiplexing does not allow\nsuch a low latency, due to collisions and buffering at nodes. Hence, we propose\nin this article to use a deterministic scheme for sending periodic messages\nwithout collisions in the network thus saving the latency incurred by\nbuffering.\n  We give several algorithms to compute such schemes for a common topology\nwhere one link is shared by all antennas. We show that there is always a\nsolution when the routes are short or the load is small. When the parameters\nare unconstrained, and some buffering is allowed in the processing units, we\npropose an algorithm (PMLS) adapted from a classical scheduling method. The\nexperimental results show that even under full load, most of the time PMLS\nfinds a deterministic sending scheme with no latency.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jan 2018 10:24:48 GMT"}, {"version": "v2", "created": "Tue, 19 Jun 2018 10:00:59 GMT"}, {"version": "v3", "created": "Fri, 7 Jun 2019 11:50:51 GMT"}, {"version": "v4", "created": "Thu, 8 Apr 2021 15:12:53 GMT"}], "update_date": "2021-04-09", "authors_parsed": [["Barth", "Dominique", ""], ["Guiraud", "Maël", ""], ["Strozecki", "Yann", ""]]}, {"id": "1801.07092", "submitter": "Francesco Malandrino", "authors": "Francesco Malandrino, Carla-Fabiana Chiasserini, Claudio Casetti", "title": "Virtualization-based Evaluation of Backhaul Performance in Vehicular\n  Applications", "comments": "Accepted for publication in Elsevier Communication Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Next-generation networks, based on SDN and NFV, are expected to support a\nwide array of services, including vehicular safety applications. These services\ncome with strict delay constraints, and our goal in this paper is to ascertain\nto which extent SDN/NFV-based networks are able to meet them. To this end, we\nbuild and emulate a vehicular collision detection system, using the popular\nMininet and Docker tools, on a real-world topology with mobility information.\nUsing different core network topologies and open-source SDN controllers, we\nmeasure (i) the delay with which vehicle beacons are processed and (ii) the\nassociated overhead and energy consumption. We find that we can indeed meet the\nlatency constraints associated with vehicular safety applications, and that SDN\ncontrollers represent a moderate contribution to the overall energy consumption\nbut a significant source of additional delay.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jan 2018 13:46:41 GMT"}], "update_date": "2018-01-23", "authors_parsed": [["Malandrino", "Francesco", ""], ["Chiasserini", "Carla-Fabiana", ""], ["Casetti", "Claudio", ""]]}, {"id": "1801.07168", "submitter": "Lachlan Urquhart Ph.D", "authors": "Lachlan Urquhart, Tom Lodge, Andy Crabtree", "title": "Demonstrably Doing Accountability in the Internet of Things", "comments": "31 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CY cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper explores the importance of accountability to data protection, and\nhow it can be built into the Internet of Things (IoT). The need to build\naccountability into the IoT is motivated by the opaque nature of distributed\ndata flows, inadequate consent mechanisms, and lack of interfaces enabling\nend-user control over the behaviours of internet-enabled devices. The lack of\naccountability precludes meaningful engagement by end-users with their personal\ndata and poses a key challenge to creating user trust in the IoT and the\nreciprocal development of the digital economy. The EU General Data Protection\nRegulation 2016 (GDPR) seeks to remedy this particular problem by mandating\nthat a rapidly developing technological ecosystem be made accountable. In doing\nso it foregrounds new responsibilities for data controllers, including data\nprotection by design and default, and new data subject rights such as the right\nto data portability. While GDPR is technologically neutral, it is nevertheless\nanticipated that realising the vision will turn upon effective technological\ndevelopment. Accordingly, this paper examines the notion of accountability, how\nit has been translated into systems design recommendations for the IoT, and how\nthe IoT Databox puts key data protection principles into practice.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jan 2018 16:12:19 GMT"}], "update_date": "2018-01-23", "authors_parsed": [["Urquhart", "Lachlan", ""], ["Lodge", "Tom", ""], ["Crabtree", "Andy", ""]]}, {"id": "1801.07347", "submitter": "Mansour Naslcheraghi", "authors": "Mansour Naslcheraghi, Mehrnaz Afshang, Harpreet S. Dhillon", "title": "Modeling and Performance Analysis of Full-Duplex Communications in\n  Cache-Enabled D2D Networks", "comments": "This paper will be presented at the ICC 2018, Kansas, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cache-enabled Device-to-Device (D2D) communication is widely recognized as\none of the key components of the emerging fifth generation (5G) cellular\nnetwork architecture. However, conventional half-duplex (HD) transmission may\nnot be sufficient to provide fast enough content delivery over D2D links in\norder to meet strict latency targets of emerging D2D applications. In-band\nfull-duplex (FD), with its capability of allowing simultaneous transmission and\nreception, can improve spectral efficiency and reduce latency by providing more\ncontent delivery opportunities. In this paper, we consider a finite network of\nD2D nodes in which each node is endowed with FD capability. We first carefully\nlist all possible operating modes for an arbitrary device using which we\ncompute the number of devices that are actively transmitting at any given time.\nWe then characterize network performance in terms of the success probability,\nwhich depends on the content availability, signal-to-interference ratio (SIR)\ndistribution, as well as the operating mode of the D2D receiver. Our analysis\nconcretely demonstrates that caching dictates the system performance in lower\ntarget SIR thresholds whereas interference dictates the performance at the\nhigher target SIR thresholds.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jan 2018 23:08:00 GMT"}, {"version": "v2", "created": "Wed, 7 Feb 2018 18:32:36 GMT"}], "update_date": "2018-02-08", "authors_parsed": [["Naslcheraghi", "Mansour", ""], ["Afshang", "Mehrnaz", ""], ["Dhillon", "Harpreet S.", ""]]}, {"id": "1801.07367", "submitter": "Hyesung Kim", "authors": "Hyesung Kim, Jihong Park, Mehdi Bennis, Seong-Lyun Kim, and M\\'erouane\n  Debbah", "title": "Mean-Field Game Theoretic Edge Caching in Ultra-Dense Networks", "comments": "submitted for suitable IEEE publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates a cellular edge caching problem under a very large\nnumber of small base stations (SBSs) and users. In this ultra-dense edge\ncaching network (UDCN), conventional caching algorithms are inapplicable as\ntheir complexity increases with the number of small base stations (SBSs).\nFurthermore, the performance of UDCN is highly sensitive to the dynamics of\nuser demand and inter-SBS interference. To overcome such difficulties, we\npropose a distributed caching algorithm under a stochastic geometric network\nmodel, as well as a spatio-temporal user demand model that characterizes the\ncontent popularity dynamics. By exploiting mean-field game (MFG) theory, the\ncomplexity of the proposed UDCN caching algorithm becomes independent of the\nnumber of SBSs. Numerical evaluations validate that the proposed caching\nalgorithm reduces not only the long run average cost of the network but also\nthe redundant cached data respectively by 24% and 42%, compared to a baseline\ncaching algorithm. The simulation results also show that the proposed caching\nalgorithm is robust to imperfect popularity information, while ensuring a low\ncomputational complexity.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jan 2018 01:48:26 GMT"}, {"version": "v2", "created": "Wed, 28 Mar 2018 18:35:20 GMT"}], "update_date": "2018-03-30", "authors_parsed": [["Kim", "Hyesung", ""], ["Park", "Jihong", ""], ["Bennis", "Mehdi", ""], ["Kim", "Seong-Lyun", ""], ["Debbah", "Mérouane", ""]]}, {"id": "1801.07379", "submitter": "Donghua Jiang", "authors": "Liang Xiao, Donghua Jiang, Dongjin Xu, Ning An", "title": "Secure Mobile Crowdsensing with Deep Learning", "comments": "7 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to stimulate secure sensing for Internet of Things (IoT)\napplications such as healthcare and traffic monitoring, mobile crowdsensing\n(MCS) systems have to address security threats, such as jamming, spoofing and\nfaked sensing attacks, during both the sensing and the information exchange\nprocesses in large-scale dynamic and heterogenous networks. In this article, we\ninvestigate secure mobile crowdsensing and present how to use deep learning\n(DL) methods such as stacked autoencoder (SAE), deep neural network (DNN), and\nconvolutional neural network (CNN) to improve the MCS security approaches\nincluding authentication, privacy protection, faked sensing countermeasures,\nintrusion detection and anti-jamming transmissions in MCS. We discuss the\nperformance gain of these DL-based approaches compared with traditional\nsecurity schemes and identify the challenges that need to be addressed to\nimplement them in practical MCS systems.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jan 2018 02:57:12 GMT"}], "update_date": "2018-01-24", "authors_parsed": [["Xiao", "Liang", ""], ["Jiang", "Donghua", ""], ["Xu", "Dongjin", ""], ["An", "Ning", ""]]}, {"id": "1801.07472", "submitter": "Rozhina Ghanavi", "authors": "Rozhina Ghanavi, Elham Kalantari, Maryam Sabbaghian, Halim\n  Yanikomeroglu, Abbas Yongacoglu", "title": "Efficient 3D Aerial Base Station Placement Considering Users Mobility by\n  Reinforcement Learning", "comments": "6 pages, 7 figures, Accepted in IEEE Wireless Communications and\n  Networking Conference (WCNC 2018)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers an aerial base station (aerial-BS) assisted terrestrial\nnetwork where user mobility is taken into account. User movement changes the\nnetwork dynamically which may result in performance loss. To avoid this loss,\nguarantee a minimum quality-of-service (QoS) and possibly increase the QoS, we\nadd an aerial-BS to the network. For a fair comparison between the conventional\nterrestrial network and the aerial-BS assisted one, we keep the total number of\nBSs identical in both networks. Obtaining the best performance in such networks\nhighly depends on the optimal placement of the aerial-BS. To this end, an\nalgorithm which can rely on general and realistic assumptions and can decide\nwhere to go based on the past experiences is required. The proposed approach\nfor this goal is based on a discounted reward reinforcement learning which is\nknown as Q-learning. Simulation results show this method provides an effective\nplacement strategy which increases the QoS of wireless networks when it is\nneeded and promises to find the optimum position of the aerial-BS in discrete\nenvironments.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jan 2018 10:43:19 GMT"}, {"version": "v2", "created": "Tue, 13 Feb 2018 14:47:07 GMT"}], "update_date": "2018-02-14", "authors_parsed": [["Ghanavi", "Rozhina", ""], ["Kalantari", "Elham", ""], ["Sabbaghian", "Maryam", ""], ["Yanikomeroglu", "Halim", ""], ["Yongacoglu", "Abbas", ""]]}, {"id": "1801.07551", "submitter": "Nicola Piovesan", "authors": "Nicola Piovesan, Angel Fernandez Gambin, Marco Miozzo, Michele Rossi,\n  Paolo Dini", "title": "Energy sustainable paradigms and methods for future mobile networks: A\n  survey", "comments": "Accepted by Elsevier Computer Communications, 21 pages, 9 figures", "journal-ref": null, "doi": "10.1016/j.comcom.2018.01.005", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this survey, we discuss the role of energy in the design of future mobile\nnetworks and, in particular, we advocate and elaborate on the use of energy\nharvesting (EH) hardware as a means to decrease the environmental footprint of\n5G technology. To take full advantage of the harvested (renewable) energy,\nwhile still meeting the quality of service required by dense 5G deployments,\nsuitable management techniques are here reviewed, highlighting the open issues\nthat are still to be solved to provide eco-friendly and cost-effective mobile\narchitectures. Several solutions have recently been proposed to tackle\ncapacity, coverage and efficiency problems, including: C-RAN, Software Defined\nNetworking (SDN) and fog computing, among others. However, these are not\nexplicitly tailored to increase the energy efficiency of networks featuring\nrenewable energy sources, and have the following limitations: (i) their energy\nsavings are in many cases still insufficient and (ii) they do not consider\nnetwork elements possessing energy harvesting capabilities. In this paper, we\nsystematically review existing energy sustainable paradigms and methods to\naddress points (i) and (ii), discussing how these can be exploited to obtain\nhighly efficient, energy self-sufficient and high capacity networks. Several\nopen issues have emerged from our review, ranging from the need for accurate\nenergy, transmission and consumption models, to the lack of accurate data\ntraffic profiles, to the use of power transfer, energy cooperation and energy\ntrading techniques. These challenges are here discussed along with some\nresearch directions to follow for achieving sustainable 5G systems.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jan 2018 14:18:37 GMT"}], "update_date": "2018-01-24", "authors_parsed": [["Piovesan", "Nicola", ""], ["Gambin", "Angel Fernandez", ""], ["Miozzo", "Marco", ""], ["Rossi", "Michele", ""], ["Dini", "Paolo", ""]]}, {"id": "1801.07587", "submitter": "Cristina Perfecto", "authors": "Mohammed S. Elbamby and Cristina Perfecto and Mehdi Bennis and Klaus\n  Doppler", "title": "Towards Low-Latency and Ultra-Reliable Virtual Reality", "comments": "Accepted in IEEE Network. 8 pages, 5 figures", "journal-ref": null, "doi": "10.1109/MNET.2018.1700268", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Virtual Reality (VR) is expected to be one of the killer-applications in 5G\nnetworks. However, many technical bottlenecks and challenges need to be\novercome to facilitate its wide adoption. In particular, VR requirements in\nterms of high-throughput, low-latency and reliable communication call for\ninnovative solutions and fundamental research cutting across several\ndisciplines. In view of this, this article discusses the challenges and\nenablers for ultra-reliable and low-latency VR. Furthermore, in an interactive\nVR gaming arcade case study, we show that a smart network design that leverages\nthe use of mmWave communication, edge computing and proactive caching can\nachieve the future vision of VR over wireless.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jan 2018 14:50:02 GMT"}], "update_date": "2018-12-11", "authors_parsed": [["Elbamby", "Mohammed S.", ""], ["Perfecto", "Cristina", ""], ["Bennis", "Mehdi", ""], ["Doppler", "Klaus", ""]]}, {"id": "1801.07604", "submitter": "Wenbo Wang", "authors": "Wenbo Wang and Dusit Niyato and Ping Wang and Amir Leshem", "title": "Decentralized Caching for Content Delivery Based on Blockchain: A Game\n  Theoretic Perspective", "comments": "IEEE ICC 2018 Next Generation Networking and Internet Symposium\n  (ICC'18 NGNI)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blockchains enables tamper-proof, ordered logging for transactional data in a\ndecentralized manner over open-access, overlay peer-to-peer networks. In this\npaper, we propose a decentralized framework of proactive caching in a\nhierarchical wireless network based on blockchains. We employ the\nblockchain-based smart contracts to construct an autonomous content caching\nmarket. In the market, the cache helpers are able to autonomously adapt their\ncaching strategies according to the market statistics obtained from the\nblockchain, and the truthfulness of trustless nodes are financially enforced by\nsmart contract terms. Further, we propose an incentive-compatible consensus\nmechanism based on proof-of-stake to financially encourage the cache helpers to\nstay active in service. We model the interaction between the cache helpers and\nthe content providers as a Chinese restaurant game. Based on the theoretical\nanalysis regarding the Nash equilibrium of the game, we propose a decentralized\nstrategy-searching algorithm using sequential best response. The simulation\nresults demonstrate both the efficiency and reliability of the proposed\nequilibrium searching algorithm.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jan 2018 15:10:05 GMT"}], "update_date": "2018-01-24", "authors_parsed": [["Wang", "Wenbo", ""], ["Niyato", "Dusit", ""], ["Wang", "Ping", ""], ["Leshem", "Amir", ""]]}, {"id": "1801.07614", "submitter": "Cristina Perfecto", "authors": "Mohammed S. Elbamby and Cristina Perfecto and Mehdi Bennis and Klaus\n  Doppler", "title": "Edge Computing Meets Millimeter-wave Enabled VR: Paving the Way to\n  Cutting the Cord", "comments": "Accepted for presentation in IEEE WCNC 2018. 6 pages, 6 figures", "journal-ref": null, "doi": "10.1109/WCNC.2018.8377419", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel proactive computing and mmWave communication for\nultra-reliable and low latency wireless virtual reality (VR is proposed. By\nleveraging information about users' poses, proactive computing and caching are\nused to pre-compute and store users' HD video frames to minimize the computing\nlatency. Furthermore, multi-connectivity is exploited to ensure reliable mmWave\nlinks to deliver users' requested HD frames. The performance of the proposed\napproach is validated on a VR network serving an interactive gaming arcade,\nwhere dynamic and real-time rendering of HD video frames is needed and impulse\nactions of different players impact the content to be shown. Simulation results\nshow significant gains of up to $30\\%$ reduction in end-to-end delay and $50\\%$\nin the $90^{\\textrm{th}}$ percentile communication delay.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jan 2018 15:20:43 GMT"}, {"version": "v2", "created": "Fri, 26 Jan 2018 12:24:14 GMT"}, {"version": "v3", "created": "Fri, 9 Feb 2018 22:32:14 GMT"}], "update_date": "2018-12-11", "authors_parsed": [["Elbamby", "Mohammed S.", ""], ["Perfecto", "Cristina", ""], ["Bennis", "Mehdi", ""], ["Doppler", "Klaus", ""]]}, {"id": "1801.07759", "submitter": "Jukka Ruohonen", "authors": "Jukka Ruohonen and Ville Lepp\\\"anen", "title": "Whose Hands Are in the Finnish Cookie Jar?", "comments": "Proceedings of the European Intelligence and Security Informatics\n  Conference (EISIC 2017)", "journal-ref": null, "doi": "10.1109/EISIC.2017.25", "report-no": null, "categories": "cs.CR cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Web cookies are ubiquitously used to track and profile the behavior of users.\nAlthough there is a solid empirical foundation for understanding the use of\ncookies in the global world wide web, thus far, limited attention has been\ndevoted for country-specific and company-level analysis of cookies. To patch\nthis limitation in the literature, this paper investigates persistent\nthird-party cookies used in the Finnish web. The exploratory results reveal\nsome similarities and interesting differences between the Finnish and the\nglobal web---in particular, popular Finnish web sites are mostly owned by media\ncompanies, which have established their distinct partnerships with online\nadvertisement companies. The results reported can be also reflected against\ncurrent and future privacy regulation in the European Union.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jan 2018 20:33:00 GMT"}], "update_date": "2018-01-25", "authors_parsed": [["Ruohonen", "Jukka", ""], ["Leppänen", "Ville", ""]]}, {"id": "1801.07992", "submitter": "Anatolij Zubow", "authors": "Anatolij Zubow, Piotr Gaw{\\l}owicz, Suzan Bayhan", "title": "XZero: On Practical Cross-Technology Interference-Nulling for LTE-U/WiFi\n  Coexistence", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  LTE-U/WiFi coexistence can be significantly improved by placing so-called\ncoexistence gaps in space through cross-technology interference-nulling (CTIN)\nfrom LTE-U BS towards WiFi nodes. Such coordinated co-existence scheme\nrequires, for the exchange of control messages, a cross-technology control\nchannel (CTC) between LTE-U and WiFi networks which was presented recently.\nHowever, it is unclear how a practical CTIN operates in the absence of channel\nstate information which is needed for CTIN but cannot be obtained from the CTC.\nWe present XZero, the first practical CTIN system that is able to quickly find\nthe suitable precoding configuration used for interference nulling without\nhaving to search the whole space of angular orientations. XZero performs a\ntree-based search to find the direction for the null beam(s) by exploiting the\nfeedback received from the WiFi AP on the tested null directions. We have\nimplemented a prototype of XZero using SDR platform for LTE-U and commodity\nhardware for WiFi and evaluated its performance in a large indoor testbed.\nEvaluation results reveal on average a reduction by 15.7 dB in\ninterference-to-noise ratio at the nulled WiFi nodes when using a ULA with four\nantennas. Moreover, XZero has a sub-second reconfiguration delay which is up to\n10x smaller as compared to naive exhaustive linear search.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jan 2018 14:08:13 GMT"}], "update_date": "2018-01-25", "authors_parsed": [["Zubow", "Anatolij", ""], ["Gawłowicz", "Piotr", ""], ["Bayhan", "Suzan", ""]]}, {"id": "1801.08018", "submitter": "Jonatan Krolikowski", "authors": "Jonatan Krolikowski, Anastasios Giovanidis, Marco Di Renzo", "title": "Optimal Cache Leasing from a Mobile Network Operator to a Content\n  Provider", "comments": "9 pages, double column, 4 figures, INFOCOM 2018 Honolulu, HI, USA", "journal-ref": "INFOCOM 2018", "doi": "10.1109/INFOCOM.2018.8486267", "report-no": null, "categories": "cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Caching popular content at the wireless edge is recently proposed as a means\nto reduce congestion at the backbone of cellular networks. The two main actors\ninvolved are Mobile Network Operators (MNOs) and Content Providers (CPs). In\nthis work, we consider the following arrangement: an MNO pre-installs memory on\nits wireless equipment (e.g. Base Stations) and invites a unique CP to use\nthem, with monetary cost. The CP will lease memory space and place its content;\nthe MNO will associate network users to stations. For a given association\npolicy, the MNO may help (or not) the CP to offload traffic, depending on\nwhether the association takes into account content placement. We formulate an\noptimization problem from the CP perspective, which aims at maximizing traffic\noffloading with minimum leasing costs. This is a joint optimization problem\nthat can include any association policy, and can also derive the optimal one.\nWe present a general exact solution using Benders decomposition. It iteratively\nupdates decisions of the two actors separately and converges to the global\noptimum. We illustrate the optimal CP leasing/placement strategy and hit\nprobability gains under different association policies. Performance is\nmaximised when the MNO association follows CP actions.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jan 2018 15:21:21 GMT"}], "update_date": "2020-12-11", "authors_parsed": [["Krolikowski", "Jonatan", ""], ["Giovanidis", "Anastasios", ""], ["Di Renzo", "Marco", ""]]}, {"id": "1801.08170", "submitter": "Hong Xing", "authors": "Yuanwei Liu, Hong Xing, Cunhua Pan, Arumugam Nallanathan, Maged\n  Elkashlan, Lajos Hanzo", "title": "Multiple Antenna Assisted Non-Orthogonal Multiple Access", "comments": "16 pages, 4 figures, 2 tables, accepted by IEEE Wireless\n  Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-orthogonal multiple access (NOMA) is potentially capable of circumventing\nthe limitations of the classic orthogonal multiple access schemes, hence it has\nrecently received significant research attention both in industry and academia.\nThis article is focused on exploiting multiple antenna techniques in NOMA\nnetworks, with an emphasis on investigating the rate region of multiple-input\nmultiple-output (MIMO)-NOMA, whist reviewing two popular multiple antennas\naided NOMA structures, as well as underlining resource management problems of\nboth single-carrier and multi-carrier MIMO-NOMA networks. This article also\npoints out several effective methods of tackling the practical implementation\nconstraints of multiple antenna NOMA networks. Finally, some promising open\nresearch directions are provided in context of multiple antenna aided NOMA.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jan 2018 20:08:50 GMT"}], "update_date": "2018-01-26", "authors_parsed": [["Liu", "Yuanwei", ""], ["Xing", "Hong", ""], ["Pan", "Cunhua", ""], ["Nallanathan", "Arumugam", ""], ["Elkashlan", "Maged", ""], ["Hanzo", "Lajos", ""]]}, {"id": "1801.08191", "submitter": "Elisa Rojas", "authors": "Aitor Zabala, Elisa Rojas, Jos\\'e Mar\\'ia Roldan, Luis Pulido", "title": "Towards Per-user Flexible Management in 5G", "comments": "5 pages, 6 figures, preprint", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flexible management is one of the key components of next-generation 5G\nnetworks. Currently, many approaches focus on network functionality (services)\nand translate it afterward into end-user requirements, which slightly\nconstrains the flexibility for both management and end users. Furthermore,\nmoving the intelligence of the network towards the edge (i.e. the users) has\nalready proven its benefits, such as computational offloading, lower latency\nand higher bandwidth utilization. In this article, we try to move management as\nclose as possible to final users, providing per-user flexibility and unique\nuser to service paths, enabling custom paths adapted for each user requirements\ninstead of users adapting to service requirements. To validate our ideas, we\nwork on two different use cases, implemented as proof-of-concepts in the ONOS\nplatform. From the results obtained we conclude that there is still work to be\ndone regarding the integration of SDN in the radio access and evolved packet\ncore functions to provide the desired flexibility.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jan 2018 21:01:41 GMT"}], "update_date": "2018-01-26", "authors_parsed": [["Zabala", "Aitor", ""], ["Rojas", "Elisa", ""], ["Roldan", "José María", ""], ["Pulido", "Luis", ""]]}, {"id": "1801.08291", "submitter": "Wei Wang Dr.", "authors": "Wei Wang, Yuanwei Liu, Zhiqing Luo, Tao Jiang, Qian Zhang, Arumugam\n  Nallanathan", "title": "Toward Cross-Layer Design for Non-Orthogonal Multiple Access: A\n  Quality-of-Experience Perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent years have seen proliferation in versatile mobile devices and an\nupsurge in the growth of data-consuming application services. Orthogonal\nmultiple access (OMA) technologies in today's mobile systems fall inefficient\nin the presence of such massive connectivity and traffic demands. In this\nregards, non-orthogonal multiple access (NOMA) has been advocated by the\nresearch community to embrace unprecedented requirements. Current NOMA designs\nhave been demonstrated to largely improve conventional system performance in\nterms of throughput and latency, while their impact on the end users' perceived\nexperience has not yet been comprehensively understood. We envision that\nquality-of-experience (QoE) awareness is a key pillar for NOMA designs to\nfulfill versatile user demands in the 5th generation (5G) wireless\ncommunication systems. This article systematically investigates QoE-aware NOMA\ndesigns that translate the physical-layer benefits of NOMA to the improvement\nof users' perceived experience in upper layers. We shed light on design\nprinciples and key challenges in realizing QoE-aware NOMA designs. With these\nprinciples and challenges in mind, we develop a general architecture with a\ndynamic network scheduling scheme. We provide some implications for future\nQoE-aware NOMA designs by conducting a case study in video streaming\napplications.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jan 2018 07:10:06 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Wang", "Wei", ""], ["Liu", "Yuanwei", ""], ["Luo", "Zhiqing", ""], ["Jiang", "Tao", ""], ["Zhang", "Qian", ""], ["Nallanathan", "Arumugam", ""]]}, {"id": "1801.08351", "submitter": "Paolo Baracca", "authors": "Paolo Baracca, Andreas Weber, Thorsten Wild, Christophe Grangeat", "title": "A Statistical Approach for RF Exposure Compliance Boundary Assessment in\n  Massive MIMO Systems", "comments": "Accepted at the International Workshop on Smart Antennas (WSA),\n  Bochum (Germany), Mar. 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Massive multiple-input multiple-output (MIMO) is a fundamental enabler to\nprovide high data throughput in next generation cellular networks. By equipping\nthe base stations (BSs) with tens or hundreds of antenna elements, narrow and\nhigh gain beams can be used to spatially multiplex several user equipment (UE)\ndevices. While increasing the achievable performance, focusing the transmit\npower into specific UE directions also poses new issues when performing the\nradio frequency (RF) exposure assessment. In fact, the spatial distribution of\nthe actual BS transmit power strongly depends on the deployment scenario and on\nthe position of the UEs. Traditional methods for assessing the RF exposure\ncompliance boundaries around BS sites are generally based on maximum transmit\npower and static beams. In massive MIMO systems, these approaches tend to be\nvery conservative, in particular when time averaging is properly considered. In\nthis work, we propose to leverage the three dimensional spatial channel model\nstandardized by the Third Generation Partnership Project in order to assess\nreasonably foreseeable compliance boundaries of massive MIMO BSs. The analysis\nis performed by considering BSs fully loaded and different configurations of\nactive UEs per cell. Numerical results show that the statistical approach\ndeveloped in this paper allows reducing to nearly half the compliance distance\nwhen compared to the traditional method.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jan 2018 11:11:59 GMT"}], "update_date": "2018-01-26", "authors_parsed": [["Baracca", "Paolo", ""], ["Weber", "Andreas", ""], ["Wild", "Thorsten", ""], ["Grangeat", "Christophe", ""]]}, {"id": "1801.08477", "submitter": "Jean-Yves Le Boudec", "authors": "Jean-Yves Le Boudec", "title": "A Theory of Traffic Regulators for Deterministic Networks with\n  Application to Interleaved Regulators", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define the minimal interleaved regulator, which generalizes the Urgency\nBased Shaper that was recently proposed by Specht and Samii as a simpler\nalternative to per-flow reshaping in deterministic networks with aggregate\nscheduling. With this regulator, packets of multiple flows are processed in one\nFIFO queue; the packet at the head of the queue is examined against the\nregulation constraints of its flow; it is released at the earliest time at\nwhich this is possible without violating the constraints. Packets that are not\nat the head of the queue are not examined until they reach the head of the\nqueue. This regulator thus possibly delays the packet at the head of the queue\nbut also all following packets, which typically belong to other flows. However,\nwe show that, when it is placed after an arbitrary FIFO system, the worst case\ndelay of the combination is not increased. This shaping-for-free property is\nwell-known with per-flow shapers; surprisingly, it continues to hold here. To\nderive this property, we introduce a new definition of traffic regulator, the\nminimal Pi-regulator, which extends both the greedy shaper of network calculus\nand Chang's max-plus regulator and also includes new types of regulators such\nas packet rate limiters. Incidentally, we provide a new insight on the\nequivalence between min-plus and max-plus formulations of regulators and\nshapers.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jan 2018 16:41:07 GMT"}, {"version": "v2", "created": "Thu, 4 Oct 2018 16:59:58 GMT"}], "update_date": "2018-10-05", "authors_parsed": [["Boudec", "Jean-Yves Le", ""]]}, {"id": "1801.08560", "submitter": "Sundar Aditya", "authors": "Sundar Aditya, Harpreet S. Dhillon, Andreas F. Molisch, Hatim Behairy", "title": "A Tractable Analysis of the Blind-spot Probability in Localization\n  Networks under Correlated Blocking", "comments": "Submitted to IEEE Transactions on Wireless Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In localization applications, the line-of-sight between anchors and targets\nmay be blocked by obstacles in the environment. A target that is invisible\n(i.e., without line-of-sight) to a sufficient number of anchors cannot be\nunambiguously localized and is, therefore, said to be in a blind spot. In this\npaper, we analyze the blind spot probability of a typical target by using\nstochastic geometry to model the randomness in the obstacle and anchor\nlocations. In doing so, we handle correlated anchor blocking induced by the\nobstacles, unlike previous works that assume independent anchor blocking. We\nfirst characterize the regime over which the independent blocking assumption\nunderestimates the blind spot probability of the typical target, which in turn,\nis characterized as a function of the distribution of the visible area,\nsurrounding the target location. Since this distribution is difficult to\ncharacterize exactly, we formulate the nearest two-obstacle approximation,\nwhich is equivalent to considering correlated blocking for only the nearest two\nobstacles from the target and assuming independent blocking for the remaining\nobstacles. Based on this, we derive an approximate expression for the blind\nspot probability, which helps determine the anchor deployment intensity needed\nfor the blind spot probability of a typical target to be at most a threshold,\n$\\mu$.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jan 2018 19:07:42 GMT"}, {"version": "v2", "created": "Mon, 9 Jul 2018 03:23:17 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Aditya", "Sundar", ""], ["Dhillon", "Harpreet S.", ""], ["Molisch", "Andreas F.", ""], ["Behairy", "Hatim", ""]]}, {"id": "1801.08620", "submitter": "Alireza Sharifian Dr.", "authors": "Alirezan Sharifian and Raviraj Adve", "title": "Queue-Aware Joint Dynamic Interference Coordination and Heterogeneous\n  QoS Provisioning in OFDMA Networks", "comments": "Accepted for publication in IEEE Transaction on Wireless\n  Communications; 17 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose algorithms for cloud radio access networks that not only provide\nheterogeneous quality of-service (QoS) for rate- and, importantly,\ndelay-sensitive applications, but also jointly optimize the frequency reuse\npattern. Importantly, unlike related works, we account for random arrivals,\nthrough queue awareness and, unlike majority of works focusing on a single\nframe only, we consider QoS measures averaged over multiple frames involving a\nset of closed loop controls. We model this problem as multi-cell optimization\nto maximize a sum utility subject to the QoS constraints, expressed as minimum\nmean-rate or maximum mean-delay. Since we consider dynamic interference\ncoordination jointly with dynamic user association, the problem is not convex,\neven after integer relaxation. We translate the problem into an optimization of\nframe rates, amenable to a decomposition into intertwined primal and dual\nproblems. The solution to this optimization problem provides joint decisions on\nscheduling, dynamic interference coordination, and, importantly, unlike most\nworks in this area, on dynamic user association. Additionally, we propose a\nnovel method to manage infeasible loads. Extensive simulations confirm that the\ndesign responds to instantaneous loads, heterogeneous user and AP locations,\nchannel conditions, and QoS constraints while, if required, keeping outage low\nwhen dealing with infeasible loads. Comparisons to the baseline proportional\nfair scheme illustrate the gains achieved.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jan 2018 22:23:59 GMT"}], "update_date": "2018-01-29", "authors_parsed": [["Sharifian", "Alirezan", ""], ["Adve", "Raviraj", ""]]}, {"id": "1801.08843", "submitter": "Giuseppe Avino", "authors": "Giuseppe Avino, Marco Malinverno, Francesco Malandrino, Claudio\n  Casetti, Carla-Fabiana Chiasserini", "title": "Characterizing Docker Overhead in Mobile Edge Computing Scenarios", "comments": "6 Pages, 9 images, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile Edge Computing (MEC) is an emerging network paradigm that provides\ncloud and IT services at the point of access of the network. Such proximity to\nthe end user translates into ultra-low latency and high bandwidth, while, at\nthe same time, it alleviates traffic congestion in the network core. Due to the\nneed to run servers on edge nodes (e.g., an LTE-A macro eNodeB), a key element\nof MEC architectures is to ensure server portability and low overhead. A\npossible tool that can be used for this purpose is Docker, a framework that\nallows easy, fast deployment of Linux containers. This paper addresses the\nsuitability of Docker in MEC scenar- ios by quantifying the CPU consumed by\nDocker when running two different containerized services: multiplayer gam- ing\nand video streaming. Our tests, run with varying numbers of clients and\nservers, yield different results for the two case studies: for the gaming\nservice, the overhead logged by Docker increases only with the number of\nservers; con- versely, for the video streaming case, the overhead is not\naffected by the number of either clients or servers.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jan 2018 15:15:48 GMT"}], "update_date": "2018-01-29", "authors_parsed": [["Avino", "Giuseppe", ""], ["Malinverno", "Marco", ""], ["Malandrino", "Francesco", ""], ["Casetti", "Claudio", ""], ["Chiasserini", "Carla-Fabiana", ""]]}, {"id": "1801.08938", "submitter": "Oliver Rutishauser", "authors": "Oliver Rutishauser", "title": "Simulation for L3 Volumetric Attack Detection", "comments": "8 pages with figures, code, and conclusions", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The detection of a volumetric attack involves collecting statistics on the\nnetwork traffic, and identifying suspicious activities. We assume that\navailable statistical information includes the number of packets and the number\nof bytes passed per flow. We apply methods of machine learning to detect\nmalicious traffic. A prototype project is implemented as a module for the\nFloodlight controller. The prototype was tested on the Mininet simulation\nplatform. The simulated topology includes a number of edge switches, a\nconnected graph of core switches, and a number of server and user hosts. The\nserver hosts run simple web servers. The user hosts simulate web clients. The\ncontroller employs Dijkstra's algorithm to find the best flow in the graph. The\ncontroller periodically polls the edge switches and provides current and\nhistorical statistics on each active flow. The streaming analytics evaluates\nthe traffic volume and detects volumetric attacks.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jan 2018 18:59:51 GMT"}], "update_date": "2018-01-29", "authors_parsed": [["Rutishauser", "Oliver", ""]]}, {"id": "1801.09011", "submitter": "Omid Avatefipour", "authors": "Omid Avatefipour, Azeem Hafeez, Muhammad Tayyab, and Hafiz Malik", "title": "Linking Received Packet to the Transmitter Through\n  Physical-Fingerprinting of Controller Area Network", "comments": "6 pages, 5 figures, 9th IEEE International Workshop on Information\n  Forensics and Security (WIFS 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Controller Area Network (CAN) bus serves as a legacy protocol for\nin-vehicle data communication. Simplicity, robustness, and suitability for\nreal-time systems are the salient features of the CAN bus protocol. However, it\nlacks the basic security features such as massage authentication, which makes\nit vulnerable to the spoofing attacks. In a CAN network, linking CAN packet to\nthe sender node is a challenging task. This paper aims to address this issue by\ndeveloping a framework to link each CAN packet to its source. Physical signal\nattributes of the received packet consisting of channel and node (or device)\nwhich contains specific unique artifacts are considered to achieve this goal.\nMaterial and design imperfections in the physical channel and digital device,\nwhich are the main contributing factors behind the device-channel specific\nunique artifacts, are leveraged to link the received electrical signal to the\ntransmitter. Generally, the inimitable patterns of signals from each ECUs exist\nover the course of time that can manifest the stability of the proposed method.\nUniqueness of the channel-device specific attributes are also investigated for\ntime- and frequency-domain. Feature vector is made up of both time and\nfrequency domain physical attributes and then employed to train a neural\nnetwork-based classifier. Performance of the proposed fingerprinting method is\nevaluated by using a dataset collected from 16 different channels and four\nidentical ECUs transmitting same message. Experimental results indicate that\nthe proposed method achieves correct detection rates of 95.2% and 98.3% for\nchannel and ECU classification, respectively.\n", "versions": [{"version": "v1", "created": "Sat, 27 Jan 2018 00:30:55 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Avatefipour", "Omid", ""], ["Hafeez", "Azeem", ""], ["Tayyab", "Muhammad", ""], ["Malik", "Hafiz", ""]]}, {"id": "1801.09082", "submitter": "Loreto Pescosolido", "authors": "Loreto Pescosolido, Marco Conti, Andrea Passarella", "title": "Performance Analysis of a Device-to-Device Offloading Scheme in a\n  Vehicular Network Environment", "comments": "v2 and v3 include minor corrections in the notation used in some\n  equations, along with the correction of some typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a scheme for offloading the delivery of contents to mobile\ndevices in a vehicular networking scenario. Each content can be delivered to\nthe requesting device either by a neighboring device or, at the expiration of a\nmaximum delay, by the network infrastructure nodes. We compute the analytical\nexpression of the probability that the content delivery is offloaded through a\nDevice-to-Device (D2D) communication as a function of the maximum transmission\nrange allowed for D2D communications, the content popularity, and the vehicles\nspeed. We show that, using the model, it is possible to identify the optimal\nmaximum transmission range, which minimizes the total energy consumption (of\nthe infrastructure plus mobile devices).\n", "versions": [{"version": "v1", "created": "Sat, 27 Jan 2018 12:35:26 GMT"}, {"version": "v2", "created": "Thu, 17 Sep 2020 11:32:31 GMT"}, {"version": "v3", "created": "Fri, 18 Sep 2020 11:02:02 GMT"}], "update_date": "2020-09-21", "authors_parsed": [["Pescosolido", "Loreto", ""], ["Conti", "Marco", ""], ["Passarella", "Andrea", ""]]}, {"id": "1801.09224", "submitter": "Wei Wang Dr.", "authors": "Wei Wang, Lin Yang, Qian Zhang, Tao Jiang", "title": "Securing On-Body IoT Devices By Exploiting Creeping Wave Propagation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  On-body devices are an intrinsic part of the Internet-of-Things (IoT) vision\nto provide human-centric services. These on-body IoT devices are largely\nembedded devices that lack a sophisticated user interface to facilitate\ntraditional Pre-Shared Key based security protocols. Motivated by this\nreal-world security vulnerability, this paper proposes SecureTag, a system\ndesigned to add defense in depth against active attacks by integrating physical\nlayer (PHY) information with upper-layer protocols. The underpinning of\nSecureTag is a signal processing technique that extracts the peculiar\npropagation characteristics of creeping waves to discern on-body devices. Upon\noverhearing a suspicious transmission, SecureTag initiates a PHY-based\nchallenge-response protocol to mitigate attacks. We implement our system on\ndifferent commercial off-the-shelf (COTS) wearables and a smartphone. Extensive\nexperiments are conducted in a lab, apartments, malls, and outdoor areas,\ninvolving 12 volunteer subjects of different age groups, to demonstrate the\nrobustness of our system. Results show that our system can mitigate 96.13% of\nactive attack attempts while triggering false alarms on merely 5.64% of\nlegitimate traffic.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jan 2018 13:12:26 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Wang", "Wei", ""], ["Yang", "Lin", ""], ["Zhang", "Qian", ""], ["Jiang", "Tao", ""]]}, {"id": "1801.09262", "submitter": "Tao Han", "authors": "Lijun Wang, Tao Han, Qiang Li, Jia Yan, Xiong Liu and Dexiang Deng", "title": "Cell-less Communications in 5G Vehicular Networks Based on\n  Vehicle-Installed Access Points", "comments": "20 pages, 6 figures, accepted by IEEE Wireless Communications", "journal-ref": "IEEE Wireless Communications, vol. 24, no. 6, pp. 64-71, Dec. 2017", "doi": "10.1109/MWC.2017.1600401", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The development of intelligent transportation systems raises many\nrequirements to the current vehicular networks. For instance, to ensure secure\ncommunications between vehicles, low latency, high connectivity and high data\nrate are required for vehicular networks. To meet such requirements, the 5G\ncommunication systems for vehicular networks should be improved accordingly.\nThis article proposes a communication scheme for 5G vehicular networks, in\nwhich moving access points are deployed on vehicles to facilitate the access of\nvehicle users. Moreover, the adjacent vehicle-installed moving access points\nmay cooperatively communicate with the vehicle users by joint transmissions and\nreceptions. In this way, the vehicle users communicate with one or more\nunspecified cooperative access points in a cell-less manner instead of being\nassociated to a single access point. To manage such cell-less networks, local\nmoving software-defined cloudlets are adopted to perform transmission and\nscheduling management. Simulation results show that the proposed scheme\nsignificantly reduces the latency, while improving the connectivity of the\nvehicular networks, and can be considered as a research direction for the\nsolution to 5G vehicular networks.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jan 2018 18:28:22 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Wang", "Lijun", ""], ["Han", "Tao", ""], ["Li", "Qiang", ""], ["Yan", "Jia", ""], ["Liu", "Xiong", ""], ["Deng", "Dexiang", ""]]}, {"id": "1801.09286", "submitter": "Guang Yang", "authors": "Guang Yang, Ming Xiao, Muhammad Alam, and Yongming Huang", "title": "Low-Latency Heterogeneous Networks with Millimeter-Wave Communications", "comments": "to appear in IEEE Communications Magazine", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heterogeneous network (HetNet) is a key enabler to largely boost network\ncoverage and capacity in the forthcoming fifth-generation (5G) and beyond. To\nsupport the explosively growing mobile data volumes, wireless communications\nwith millimeter-wave (mm-wave) radios have attracted massive attention, which\nis widely considered as a promising candidate in 5G HetNets. In this article,\nwe give an overview on the end-to-end latency of HetNets with mm-wave\ncommunications. In general, it is rather challenging for formulating and\noptimizing the delay problem with buffers in mm-wave communications, since\nconventional graph-based network optimization techniques are not applicable\nwhen queues are considered. Toward this end, we develop an adaptive low-latency\nstrategy, which uses cooperative networking to reduce the end-to-end latency.\nThen, we evaluate the performance of the introduced strategy. Results reveal\nthe importance of proper cooperative networking in reducing the end-to-end\nlatency. In addition, we have identified several challenges in future research\nfor low-latency mm-wave HetNets.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jan 2018 20:54:07 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Yang", "Guang", ""], ["Xiao", "Ming", ""], ["Alam", "Muhammad", ""], ["Huang", "Yongming", ""]]}, {"id": "1801.09345", "submitter": "Long Chen", "authors": "Long Chen, Jigang Wu, Hong-Ning Dai, Xiaoxia Huang", "title": "BRAINS: Joint Bandwidth-Relay Allocation in Multi-Homing Cooperative D2D\n  Networks", "comments": "28 pages, 7 figures, Accepted by IEEE Transactions on Vehicular\n  Technology (Not the final version)", "journal-ref": "IEEE Transactions on Vehicular Technology, 2018", "doi": "10.1109/TVT.2018.2799970", "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperative device to device (CD2D) communication has been considered to be a\nsolution to capacity shortage problem. Combining multi-homing and CD2D\ntechniques together can potentially improve network performance. We propose a\nnovel multi-homing CD2D (MH-CD2D) network, in which multiple homing mobile\ndevices (MMDs) act as relays for the cooperative communications of ordinary\nmobile devices (OMDs). We formulate such joint bandwidth-relay allocation\nproblem as a two-stage game, in order to deal with two challenges: how to\nmotivate MMDs to lease spare bandwidths and help OMDs to choose appropriate MMD\nrelays. In the first stage, we use a non-cooperative game to model the\ncompetition between MMDs in terms of shared bandwidth and price. In the second\nstage, we model the behavior of OMDs selecting MMDs by an evolutionary game. We\nprove that there exists Nash equilibrium in the game and propose a distributed\nincentive scheme named IMES to solve the joint bandwidth-relay allocation\nproblem. Extensive simulation results show that the equilibrium can be achieved\nand the best response price of one MMD increases with the other's best price in\nthe Stackelberg game. The utility of MMDs increases with the number of OMDs in\neach OMD group at the evolutionary equilibrium. The proposed algorithms are\nable to reduce average service delay by more than 25% in comparison to the\nrandomized scheme which is frequently used in existing works. On average, IMES\noutperforms existing scheme by about 20.37% in terms of utility of MMDs.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jan 2018 02:27:08 GMT"}], "update_date": "2018-06-15", "authors_parsed": [["Chen", "Long", ""], ["Wu", "Jigang", ""], ["Dai", "Hong-Ning", ""], ["Huang", "Xiaoxia", ""]]}, {"id": "1801.09510", "submitter": "Andrea Tassi", "authors": "Ioannis Mavromatis, Andrea Tassi, Giovanni Rigazzi, Robert J.\n  Piechocki, Andrew Nix", "title": "Multi-Radio 5G Architecture for Connected and Autonomous Vehicles:\n  Application and Design Insights", "comments": "Invited paper on EAI Transactions on Industrial Networks and\n  Intelligent Systems", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Connected and Autonomous Vehicles (CAVs) will play a crucial role in\nnext-generation Cooperative Intelligent Transportation Systems (C-ITSs). Not\nonly is the information exchange fundamental to improve road safety and\nefficiency, but it also paves the way to a wide spectrum of advanced ITS\napplications enhancing efficiency, mobility and accessibility. Highly dynamic\nnetwork topologies and unpredictable wireless channel conditions entail\nnumerous design challenges and open questions. In this paper, we address the\nbeneficial interactions between CAVs and an ITS and propose a novel\narchitecture design paradigm. Our solution can accommodate multi-layer\napplications over multiple Radio Access Technologies (RATs) and provide a smart\nconfiguration interface for enhancing the performance of each RAT.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jan 2018 14:04:14 GMT"}, {"version": "v2", "created": "Sun, 25 Feb 2018 22:15:27 GMT"}, {"version": "v3", "created": "Wed, 28 Feb 2018 12:35:16 GMT"}], "update_date": "2018-03-01", "authors_parsed": [["Mavromatis", "Ioannis", ""], ["Tassi", "Andrea", ""], ["Rigazzi", "Giovanni", ""], ["Piechocki", "Robert J.", ""], ["Nix", "Andrew", ""]]}, {"id": "1801.09563", "submitter": "Achim Autenrieth", "authors": "Achim Autenrieth, J\\\"org Peter Elbers, Thomas Szyrkowiec, Pawel\n  Kaczmarek, Wolfgang Kellerer", "title": "Optical Network Programmability - Requirements and Applications", "comments": "The research leading to these results has received funding from the\n  European Commission within the Seventh Framework Programme (FP7/2007-2013)\n  under grant agreement n.608528, project STRAUSS (www.ict-strauss.eu), and the\n  H2020 Research and Innovation Programme, under grant agreeement n.645127,\n  project ACINO (www.acino.eu)", "journal-ref": "2015 International Conference on Photonics in Switching (PS)", "doi": "10.1109/PS.2015.7329040", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Datacenter operators and internet content providers require optical network\nprogrammability to efficiently interconnect distributed datacenters. This paper\ndescribes the requirements, applications and use cases for optical network\nprogrammability. Based on application scenarios, open northbound APIs with\ndifferent levels of control and abstraction to address different network\noperator requirements which are defined. For their illustration, use cases for\noptical network programmability show current research directions.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jan 2018 15:13:13 GMT"}, {"version": "v2", "created": "Tue, 17 Apr 2018 09:27:11 GMT"}], "update_date": "2018-04-18", "authors_parsed": [["Autenrieth", "Achim", ""], ["Elbers", "Jörg Peter", ""], ["Szyrkowiec", "Thomas", ""], ["Kaczmarek", "Pawel", ""], ["Kellerer", "Wolfgang", ""]]}, {"id": "1801.09577", "submitter": "Thomas Szyrkowiec", "authors": "Thomas Szyrkowiec, Michele Santuari, Mohit Chamania, Domenico\n  Siracusa, Achim Autenrieth, Victor Lopez", "title": "First Demonstration of an Automatic Multilayer Intent-Based Secure\n  Service Creation by an Open Source SDN Orchestrator", "comments": "Parts of the presented work has received funding from the European\n  Commission within the H2020 Research and Innovation Programme, under grant\n  agreeement n.645127, project ACINO", "journal-ref": "ECOC 2016 - Post Deadline Paper - 42nd European Conference on\n  Optical Communication (see\n  https://www.vde-verlag.de/proceedings-de/454283011.html)", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we demonstrate an automatic intent-based encryption layer\nselection and configuration for a multilayer network covering IP and optical\nutilizing an open source SDN orchestrator. Results indicate that the processing\nimpact of a secure channel creation is negligible.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jan 2018 15:34:12 GMT"}, {"version": "v2", "created": "Thu, 1 Feb 2018 15:54:16 GMT"}], "update_date": "2018-02-02", "authors_parsed": [["Szyrkowiec", "Thomas", ""], ["Santuari", "Michele", ""], ["Chamania", "Mohit", ""], ["Siracusa", "Domenico", ""], ["Autenrieth", "Achim", ""], ["Lopez", "Victor", ""]]}, {"id": "1801.09664", "submitter": "I\\~naki Ucar", "authors": "I\\~naki Ucar, Jos\\'e Alberto Hern\\'andez, Pablo Serrano, Arturo\n  Azcorra", "title": "Design and Analysis of 5G Scenarios with 'simmer': An R Package for Fast\n  DES Prototyping", "comments": "7 pages, 4 figures", "journal-ref": "IEEE Communications Magazine, vol. 56, no. 11, pp. 145-151,\n  November 2018", "doi": "10.1109/MCOM.2018.1700960", "report-no": null, "categories": "cs.NI stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Simulation frameworks are important tools for the analysis and design of\ncommunication networks and protocols, but they can result extremely costly\nand/or complex (for the case of very specialized tools), or too naive and\nlacking proper features and support (for the case of ad-hoc tools). In this\npaper, we present an analysis of three 5G scenarios using 'simmer', a recent R\npackage for discrete-event simulation that sits between the above two\nparadigms. As our results show, it provides a simple yet very powerful syntax,\nsupporting the efficient simulation of relatively complex scenarios at a low\nimplementation cost.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jan 2018 18:42:04 GMT"}], "update_date": "2018-11-21", "authors_parsed": [["Ucar", "Iñaki", ""], ["Hernández", "José Alberto", ""], ["Serrano", "Pablo", ""], ["Azcorra", "Arturo", ""]]}, {"id": "1801.09812", "submitter": "Angli Liu", "authors": "Angli Liu, Jiangtao Li, Guobin Shen, Chao Sun, Liqun Li, Feng Zhao", "title": "Enabling Low-power Duplex Visible Light Communication", "comments": "Extension of the HotMobile 2015 paper: Retro-VLC: Enabling\n  Battery-free Duplex Visible Light Communication for Mobile and IoT\n  Applications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The new generation of LED-based illuminating infrastructures has enabled a\n\"dual-paradigm\" where LEDs are used for both illumination and communication\npurposes. The ubiquity of lighting makes visible light communication (VLC) well\nsuited for communication with mobile devices and sensor nodes in indoor\nenvironment. Existing research on VLC has primarily been focused on advancing\nthe performance of one-way communication. In this paper, we present Retro-VLC,\na low-power duplex VLC system that enables a mobile device to perform\nbi-directional communication with the illuminating LEDs over the same light\ncarrier. The design features a retro-reflector fabric that backscatters light,\nan LCD shutter that modulates information bits on the backscattered light\ncarrier, and several low-power optimization techniques. We have prototyped the\nReader system and made a few battery-free tag devices. Experimental results\nshow that the tag can achieve a 10kbps downlink speed and 0.5kbps uplink speed\nover a distance of 2.4m. We also outline several potential applications of the\nproposed Retro-VLC system.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jan 2018 00:25:42 GMT"}], "update_date": "2018-01-31", "authors_parsed": [["Liu", "Angli", ""], ["Li", "Jiangtao", ""], ["Shen", "Guobin", ""], ["Sun", "Chao", ""], ["Li", "Liqun", ""], ["Zhao", "Feng", ""]]}, {"id": "1801.09898", "submitter": "Thomas Szyrkowiec", "authors": "Thomas Szyrkowiec, Achim Autenrieth and Wolfgang Kellerer", "title": "Optical Network Models and their Application to Software-Defined Network\n  Management", "comments": "Parts of the presented work has received funding from the European\n  Commission within the H2020 Research and Innovation Programme, under grant\n  agreeement n.645127, project ACINO", "journal-ref": "International Journal of Optics Volume 2017 (2017), Article ID\n  5150219, 9 pages", "doi": "10.1155/2017/5150219", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Software-defined networking is finding its way into optical networks. Here,\nit promises a simplification and unification of network management for optical\nnetworks allowing automation of operational tasks despite the highly diverse\nand vendor-specific commercial systems and the complexity and analog nature of\noptical transmission. A fundamental component for software-defined optical\nnetworking are common abstractions and interfaces. Currently, a number of\nmodels for optical networks are available. They all claim to provide open and\nvendor agnostic management of optical equipment. In this work, we survey and\ncompare the most important models and propose an intent interface for creating\nvirtual topologies that is integrated in the existing model ecosystem.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jan 2018 08:57:50 GMT"}, {"version": "v2", "created": "Tue, 6 Feb 2018 10:38:21 GMT"}], "update_date": "2018-02-07", "authors_parsed": [["Szyrkowiec", "Thomas", ""], ["Autenrieth", "Achim", ""], ["Kellerer", "Wolfgang", ""]]}, {"id": "1801.09923", "submitter": "Dmitri Moltchanov", "authors": "Dmitri Moltchanov and Pavel Kustarev and Yevgeni Kucharyavy", "title": "Analytical modeling and analysis of interleaving on correlated wireless\n  channels", "comments": "Accepted to Elsevier Computer Communications in 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI eess.SP math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interleaving is a mechanism universally used in wireless access technologies\nto alleviate the effect of channel correlation. In spite of its wide adoption,\nto the best of our knowledge, there are no analytical models proposed so far.\nIn this paper we fill this void proposing three different models of\ninterleaving. Two of these models are based on numerical algorithms while one\nof them allows for closed-form expression for packet error probability.\nAlthough we use block codes with hard decoding to specify the models our\nmodeling principles are applicable to all forward error correction codes as\nlong as there exists a functional relationship (possibly, probabilistic)\nbetween the number of incorrectly received bits in a codeword and the codeword\nerror probability. We evaluate accuracy of our models showing that the worst\ncase prediction is limited by 50\\% across a wide range of input parameters.\nFinally, we study the effect of interleaving in detail demonstrating how it\nvaries with channel correlation, bit error rate and error correction\ncapability. Numerical results reported in this paper allows to identify the\noptimal value of the interleaving depth that need to be used for a channel with\na given degree of correlation. The reference implementations of the models are\navailable [1].\n", "versions": [{"version": "v1", "created": "Tue, 30 Jan 2018 10:35:33 GMT"}], "update_date": "2018-01-31", "authors_parsed": [["Moltchanov", "Dmitri", ""], ["Kustarev", "Pavel", ""], ["Kucharyavy", "Yevgeni", ""]]}, {"id": "1801.09978", "submitter": "Lam Nguyen Duc", "authors": "Duc-Lam Nguyen, HyungHo Byun, Naeon Kim, Chong-Kwon Kim", "title": "Towards Efficient Dynamic Virtual Network Embedding Strategy for Cloud\n  IoT Networks", "comments": "12 pages, 10 figures, Preprint submitted to International Journal of\n  Distributed Sensor Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network Virtualization is one of the most promising technologies for future\nnetworking and considered as a critical IT resource that connects distributed,\nvirtualized Cloud Computing services and different components such as storage,\nservers and application. Network Virtualization allows multiple virtual\nnetworks to coexist on same shared physical infrastructure simultaneously. One\nof the crucial keys in Network Virtualization is Virtual Network Embedding,\nwhich provides a method to allocate physical substrate resources to virtual\nnetwork requests. In this paper, we investigate Virtual Network Embedding\nstrategies and related issues for resource allocation of an Internet\nProvider(InP) to efficiently embed virtual networks that are requested by\nVirtual Network Operators(VNOs) who share the same infrastructure provided by\nthe InP. In order to achieve that goal, we design a heuristic Virtual Network\nEmbedding algorithm that simultaneously embeds virtual nodes and virtual links\nof each virtual network request onto physic infrastructure. Through extensive\nsimulations, we demonstrate that our proposed scheme improves significantly the\nperformance of Virtual Network Embedding by enhancing the long-term average\nrevenue as well as acceptance ratio and resource utilization of virtual network\nrequests compared to prior algorithms.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jan 2018 13:25:45 GMT"}], "update_date": "2018-01-31", "authors_parsed": [["Nguyen", "Duc-Lam", ""], ["Byun", "HyungHo", ""], ["Kim", "Naeon", ""], ["Kim", "Chong-Kwon", ""]]}, {"id": "1801.09984", "submitter": "Hadi Razzaghi Kouchaksaraei", "authors": "Hadi Razzaghi Kouchaksaraei, Holger Karl", "title": "Joint Orchestration of Cloud-Based Microservices and Virtual Network\n  Functions", "comments": "Accepted in The Ninth International Conferences on Cloud Computing,\n  GRIDs, and Virtualization", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent studies show the increasing popularity of distributed cloud\napplications, which are composed of multiple microservices. Besides their known\nbenefits, microservice architecture also enables to mix and match cloud\napplications and Network Function Virtualization (NFV) services (service\nchains), which are composed of Virtual Network Functions (VNFs). Provisioning\ncomplex services containing VNFs and microservices in a combined NFV/cloud\nplatform can enhance service quality and optimise cost. Such a platform can be\nbased on the multi-cloud concept. However, current multi-cloud solutions do not\nsupport NFV requirements, making them inadequate to support complex services.\nIn this paper, we investigate these challenges and propose a solution for\njointly managing and orchestrating microservices and virtual network functions.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jan 2018 13:55:30 GMT"}], "update_date": "2018-01-31", "authors_parsed": [["Kouchaksaraei", "Hadi Razzaghi", ""], ["Karl", "Holger", ""]]}, {"id": "1801.10094", "submitter": "Robert Gardner Jr.", "authors": "James Zhang, Ilija Vukotic, Robert Gardner", "title": "Anomaly detection in wide area network mesh using two machine learning\n  anomaly detection algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Anomaly detection is the practice of identifying items or events that do not\nconform to an expected behavior or do not correlate with other items in a\ndataset. It has previously been applied to areas such as intrusion detection,\nsystem health monitoring, and fraud detection in credit card transactions. In\nthis paper, we describe a new method for detecting anomalous behavior over\nnetwork performance data, gathered by perfSONAR, using two machine learning\nalgorithms: Boosted Decision Trees (BDT) and Simple Feedforward Neural Network.\nThe effectiveness of each algorithm was evaluated and compared. Both have shown\nsufficient performance and sensitivity.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jan 2018 16:59:22 GMT"}], "update_date": "2018-01-31", "authors_parsed": [["Zhang", "James", ""], ["Vukotic", "Ilija", ""], ["Gardner", "Robert", ""]]}, {"id": "1801.10152", "submitter": "Cheng Zhang", "authors": "Cheng Zhang, Bo Gu, Zhi Liu, Kyoko Yamori, and Yoshiaki Tanaka", "title": "Cost- and Energy-Aware Multi-Flow Mobile Data Offloading Using Markov\n  Decision Process", "comments": null, "journal-ref": "IEICE Transactions on Communications, Vol.E101-B, No.3, Mar. 2018", "doi": "10.1587/transcom.2017NRP0014", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the rapid increase in demand for mobile data, mobile network operators\nare trying to expand wireless network capacity by deploying wireless local area\nnetwork (LAN) hotspots on which they can offload their mobile traffic. However,\nthese network-centric methods usually do not fulfill the interests of mobile\nusers (MUs). Taking into consideration many issues, MUs should be able to\ndecide whether to offload their traffic to a complementary wireless LAN. Our\nprevious work studied single-flow wireless LAN offloading from a MU's\nperspective by considering delay-tolerance of traffic, monetary cost and energy\nconsumption. In this paper, we study the multi-flow mobile data offloading\nproblem from a MU's perspective in which a MU has multiple applications to\ndownload data simultaneously from remote servers, and different applications'\ndata have different deadlines. We formulate the wireless LAN offloading problem\nas a finite-horizon discrete-time Markov decision process (MDP) and establish\nan optimal policy by a dynamic programming based algorithm. Since the time\ncomplexity of the dynamic programming based offloading algorithm is still high,\nwe propose a low time complexity heuristic offloading algorithm with\nperformance sacrifice. Extensive simulations are conducted to validate our\nproposed offloading algorithms.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jan 2018 04:31:10 GMT"}], "update_date": "2018-02-01", "authors_parsed": [["Zhang", "Cheng", ""], ["Gu", "Bo", ""], ["Liu", "Zhi", ""], ["Yamori", "Kyoko", ""], ["Tanaka", "Yoshiaki", ""]]}, {"id": "1801.10282", "submitter": "Ali Taleb Zadeh Kasgari", "authors": "Ali Taleb Zadeh Kasgari and Walid Saad", "title": "Stochastic Optimization and Control Framework for 5G Network Slicing\n  with Effective Isolation", "comments": "Accepted for publication is CISS 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network slicing is an emerging technique for providing resources to diverse\nwireless services with heterogeneous quality-of-service needs. However, beyond\nsatisfying end-to-end requirements of network users, network slicing needs to\nalso provide isolation between slices so as to prevent one slice's faults and\ncongestion from affecting other slices. In this paper, the problem of network\nslicing is studied in the context of a wireless system having a time-varying\nnumber of users that require two types of slices: reliable low latency (RLL)\nand self-managed (capacity limited) slices. To address this problem, a novel\ncontrol framework for stochastic optimization is proposed based on the Lyapunov\ndrift-plus-penalty method. This new framework enables the system to minimize\npower, maintain slice isolation, and provide reliable and low latency\nend-to-end communication for RLL slices. Simulation results show that the\nproposed approach can maintain the system's reliability while providing\neffective slice isolation in the event of sudden changes in the network\nenvironment.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jan 2018 02:36:37 GMT"}], "update_date": "2018-02-01", "authors_parsed": [["Kasgari", "Ali Taleb Zadeh", ""], ["Saad", "Walid", ""]]}, {"id": "1801.10294", "submitter": "Belal Amro", "authors": "Belal Amro", "title": "Protecting Privacy in VANETs Using Mix Zones With Virtual Pseudonym\n  Change", "comments": "10 pages, 3 figures, 3 tables", "journal-ref": "International Journal of Network Security & Its Applications\n  volume 10 number 1 2018", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicular ad hoc networks VANETs use pseudonyms to communicate among them and\nwith road side units, these pseudonyms are used to authenticate these vehicles\nand to hide real identities behind these pseudonyms, to better enhance privacy,\nthese pseudonyms are changed frequently so that it will not be that easy to\nlink these pseudonyms together and hence reveal real identities. However,\nchanging pseudonyms will not be that useful if previous and current pseudonyms\nare easily linked together. Therefore different techniques have been proposed\nto hide the pseudonym changes and make it difficult to link pseudonyms\ntogether. Most of these techniques do not fully quarantine privacy when\nchanging a pseudonym under some situations such as low traffic. In this paper,\nwe provide a technique for changing pseudonyms that has the same privacy level\nunder all traffic conditions. The technique relies on fixed mix zones that are\nplanted and distributed over the roads. By this technique, a vehicle guarantees\na high level of security when changing its pseudonym at that mix zone which\nwill make it very difficult for an adversary to link particular pseudonyms\ntogether and hence reveal real identity. Performance analysis showed that our\nmodel works efficiently with very few computational costs\n", "versions": [{"version": "v1", "created": "Wed, 31 Jan 2018 04:25:26 GMT"}, {"version": "v2", "created": "Mon, 12 Feb 2018 20:27:22 GMT"}], "update_date": "2018-02-14", "authors_parsed": [["Amro", "Belal", ""]]}, {"id": "1801.10416", "submitter": "Mattia D'Emidio Ph.D.", "authors": "Mattia D'Emidio, Luca Forlizzi, Daniele Frigioni, Stefano Leucci,\n  Guido Proietti", "title": "Hardness, Approximability, and Fixed-Parameter Tractability of the\n  Clustered Shortest-Path Tree Problem", "comments": "21 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Given an $n$-vertex non-negatively real-weighted graph $G$, whose vertices\nare partitioned into a set of $k$ clusters, a \\emph{clustered network design\nproblem} on $G$ consists of solving a given network design optimization problem\non $G$, subject to some additional constraint on its clusters.\n  In particular, we focus on the classic problem of designing a\n\\emph{single-source shortest-path tree}, and we analyze its computational\nhardness when in a feasible solution each cluster is required to form a\nsubtree. We first study the \\emph{unweighted} case, and prove that the problem\nis \\np-hard. However, on the positive side, we show the existence of an\napproximation algorithm whose quality essentially depends on few parameters,\nbut which remarkably is an $O(1)$-approximation when the largest out of all the\n\\emph{diameters} of the clusters is either $O(1)$ or $\\Theta(n)$. Furthermore,\nwe also show that the problem is \\emph{fixed-parameter tractable} with respect\nto $k$ or to the number of vertices that belong to clusters of size at least 2.\nThen, we focus on the \\emph{weighted} case, and show that the problem can be\napproximated within a tight factor of $O(n)$, and that it is fixed-parameter\ntractable as well. Finally, we analyze the unweighted \\emph{single-pair\nshortest path problem}, and we show it is hard to approximate within a (tight)\nfactor of $n^{1-\\epsilon}$, for any $\\epsilon>0$.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jan 2018 12:02:04 GMT"}], "update_date": "2018-02-01", "authors_parsed": [["D'Emidio", "Mattia", ""], ["Forlizzi", "Luca", ""], ["Frigioni", "Daniele", ""], ["Leucci", "Stefano", ""], ["Proietti", "Guido", ""]]}, {"id": "1801.10417", "submitter": "Achim Autenrieth", "authors": "Achim Autenrieth", "title": "Multilayer Network Planning - A Practical Perspective", "comments": "Parts of the presented work has received funding from the European\n  Commission within the H2020 Research and Innovation Programme, under grant\n  agreeement n.645127, project ACINO (www.acino.eu)", "journal-ref": "Optical Fiber Communication Conference 2016, Anaheim, California,\n  United States, 20 - 22 March 2016, ISBN 978-1-943580-07-1", "doi": "10.1364/OFC.2016.Th1E.5", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents a pragmatic and practical multilayer network planning\napproach based on a candidate lightpath auxiliary graph model. The paper\ndiscusses, how this approach can be applied to offline network planning as well\nas dynamic planning and provisioning of services.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jan 2018 12:06:15 GMT"}], "update_date": "2018-02-01", "authors_parsed": [["Autenrieth", "Achim", ""]]}, {"id": "1801.10500", "submitter": "Derya Malak", "authors": "Derya Malak, Muriel M\\'edard, Edmund M. Yeh", "title": "Analysis of Coded Selective-Repeat ARQ via Matrix Signal-Flow Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose two schemes for selective-repeat ARQ protocols over packet erasure\nchannels with unreliable feedback: (i) a hybrid ARQ protocol with soft\ncombining at the receiver, and (ii) a coded ARQ protocol, by building on the\nuncoded baseline scheme for ARQ, developed by Ausavapattanakun and Nosratinia.\nOur method leverages discrete-time queuing and coding theory to analyze the\nperformance of the proposed data transmission methods. We incorporate forward\nerror-correction to reduce in-order delivery delay, and exploit a matrix\nsignal-flow graph approach to analyze the throughput and delay of the\nprotocols. We demonstrate and contrast the performance of the coded protocols\nwith that of the uncoded scheme, illustrating the benefits of coded\ntransmissions.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jan 2018 15:41:07 GMT"}], "update_date": "2018-02-01", "authors_parsed": [["Malak", "Derya", ""], ["Médard", "Muriel", ""], ["Yeh", "Edmund M.", ""]]}, {"id": "1801.10508", "submitter": "Sebastian Euler", "authors": "Xingqin Lin, Richard Wiren, Sebastian Euler, Arvi Sadam, Helka-Liina\n  Maattanen, Siva D. Muruganathan, Shiwei Gao, Y.-P. Eric Wang, Juhani Kauppi,\n  Zhenhua Zou, and Vijaya Yajnanarayana", "title": "Mobile-Network Connected Drones: Field Trials, Simulations, and Design\n  Insights", "comments": "10 pages; 8 figures", "journal-ref": "IEEE Vehicular Technology Magazine, vol. 14, no. 3, pp. 115-125,\n  Sept. 2019", "doi": "10.1109/MVT.2019.2917363", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Drones are becoming increasingly used in a wide variety of industries and\nservices and are delivering profound socioeconomic benefits. Technology needs\nto be in place to ensure safe operation and management of the growing fleet of\ndrones. Mobile networks have connected tens of billions of devices on the\nground in the past decades and are now ready to connect the drones flying in\nthe sky. In this article, we share some of our findings in cellular\nconnectivity for low altitude drones. We first present and analyze field\nmeasurement data collected during drone flights in a commercial Long-Term\nEvolution (LTE) network. We then present simulation results to shed light on\nthe performance of a network when it is serving many drones simultaneously over\na wide area. The results, analysis, and design insights presented in this\narticle help enhance the understanding of the applicability and performance of\nproviding mobile connectivity to low altitude drones.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jan 2018 15:49:49 GMT"}, {"version": "v2", "created": "Mon, 2 Sep 2019 13:27:27 GMT"}], "update_date": "2019-09-04", "authors_parsed": [["Lin", "Xingqin", ""], ["Wiren", "Richard", ""], ["Euler", "Sebastian", ""], ["Sadam", "Arvi", ""], ["Maattanen", "Helka-Liina", ""], ["Muruganathan", "Siva D.", ""], ["Gao", "Shiwei", ""], ["Wang", "Y. -P. Eric", ""], ["Kauppi", "Juhani", ""], ["Zou", "Zhenhua", ""], ["Yajnanarayana", "Vijaya", ""]]}, {"id": "1801.10574", "submitter": "Joerg-Peter Elbers", "authors": "Nicklas Eiselt, Daniel Muench, Annika Dochhan, Helmut Griesser,\n  Michael Eiselt, Juan Jose Vegas Olmos, Idelfonso Tafur Monroy, and\n  Joerg-Peter Elbers", "title": "Performance Comparison of 112 Gb/s DMT, Nyquist PAM4 and\n  Partial-Response PAM4 for Future 5G Ethernet-based Fronthaul Architecture", "comments": "The work leading to these results has received funding from the\n  European Union's Seventh Framework Programme under Grant Agreement No. 644526\n  (ABACUS), the European Union's Horizon 2020 Research and Innovation Programme\n  under Grant Agreement No. 644526 (iCIRRUS), and the German Ministry of\n  Education and Research (BMBF) under contract numbers 16KIS0477K (SENDATE\n  Secure-DCI) and 13N13744 (SPeeD)", "journal-ref": null, "doi": "10.1109/JLT.2018.2790579", "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a future 5G Ethernet-based fronthaul architecture, 100G trunk lines of a\ntransmission distance up to 10 km standard single mode fiber (SSMF) in\ncombination with cheap grey optics to daisy chain cell site network interfaces\nare a promising cost- and power-efficient solution. For such a scenario,\ndifferent intensity modulation and direct detect (IMDD) Formats at a data rate\nof 112 Gb/s, namely Nyquist four-level pulse amplitude modulation (PAM4),\ndiscrete multi-tone Transmission (DMT) and partial-response (PR) PAM4 are\nexperimentally investigated, using a low-cost electro-absorption modulated\nlaser (EML), a 25G driver and current state-of-the-art high Speed 84 GS/s CMOS\ndigital-to-analog converter (DAC) and analog-to-digital converter (ADC) test\nchips. Each modulation Format is optimized independently for the desired\nscenario and their digital signal processing (DSP) requirements are\ninvestigated. The performance of Nyquist PAM4 and PR PAM4 depend very much on\nthe efficiency of pre- and post-equalization. We show the necessity for at\nleast 11 FFE-taps for pre-emphasis and up to 41 FFE coefficients at the\nreceiver side. In addition, PR PAM4 requires an MLSE with four states to decode\nthe signal back to a PAM4 signal. On the contrary, bit- and power-loading (BL,\nPL) is crucial for DMT and an FFT length of at least 512 is necessary. With\noptimized parameters, all Modulation formats result in a very similar\nperformances, demonstrating a transmission distance of up to 10 km over SSMF\nwith bit error rates (BERs) below a FEC threshold of 4.4E-3, allowing error\nfree transmission.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jan 2018 17:45:49 GMT"}], "update_date": "2018-02-01", "authors_parsed": [["Eiselt", "Nicklas", ""], ["Muench", "Daniel", ""], ["Dochhan", "Annika", ""], ["Griesser", "Helmut", ""], ["Eiselt", "Michael", ""], ["Olmos", "Juan Jose Vegas", ""], ["Monroy", "Idelfonso Tafur", ""], ["Elbers", "Joerg-Peter", ""]]}, {"id": "1801.10588", "submitter": "Benedikt Jahnel", "authors": "Elie Cali, Nila Novita Gafur, Christian Hirsch, Benedikt Jahnel,\n  Taoufik En-Najjary, Robert I.A. Patterson", "title": "Percolation for D2D Networks on Street Systems", "comments": "6 pages, 7 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study fundamental characteristics for the connectivity of multi-hop D2D\nnetworks. Devices are randomly distributed on street systems and are able to\ncommunicate with each other whenever their separation is smaller than some\nconnectivity threshold. We model the street systems as Poisson-Voronoi or\nPoisson-Delaunay tessellations with varying street lengths. We interpret the\nexistence of adequate D2D connectivity as percolation of the underlying random\ngraph. We derive and compare approximations for the critical device-intensity\nfor percolation, the percolation probability and the graph distance. Our\nresults show that for urban areas, the Poisson Boolean Model gives a very good\napproximation, while for rural areas, the percolation probability stays far\nfrom 1 even far above the percolation threshold.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jan 2018 18:21:56 GMT"}], "update_date": "2018-02-01", "authors_parsed": [["Cali", "Elie", ""], ["Gafur", "Nila Novita", ""], ["Hirsch", "Christian", ""], ["Jahnel", "Benedikt", ""], ["En-Najjary", "Taoufik", ""], ["Patterson", "Robert I. A.", ""]]}]