[{"id": "1410.0241", "submitter": "Luis Dinis", "authors": "J.M.R. Parrondo, L. Dinis, E. Garc\\'ia-Tora\\~no, B. Sotillo", "title": "Collective decision making and paradoxical games", "comments": "9 pages, 6 figures", "journal-ref": "Eur. Phys. J. Special Topics 143, 39 (2007)", "doi": "10.1140/epjst/e2007-00068-0", "report-no": null, "categories": "physics.soc-ph cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study an ensemble of individuals playing the two games of the so-called\nParrondo paradox. In our study, players are allowed to choose the game to be\nplayed by the whole ensemble in each turn. The choice cannot conform to the\npreferences of all the players and, consequently, they face a simple\nfrustration phenomenon that requires some strategy to make a collective\ndecision. We consider several such strategies and analyze how fluctuations can\nbe used to improve the performance of the system.\n", "versions": [{"version": "v1", "created": "Wed, 1 Oct 2014 14:34:21 GMT"}], "update_date": "2016-08-10", "authors_parsed": [["Parrondo", "J. M. R.", ""], ["Dinis", "L.", ""], ["García-Toraño", "E.", ""], ["Sotillo", "B.", ""]]}, {"id": "1410.0375", "submitter": "Rafael Frongillo", "authors": "Rafael M. Frongillo, Yiling Chen, Ian A. Kash", "title": "Elicitation for Aggregation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of eliciting and aggregating probabilistic information\nfrom multiple agents. In order to successfully aggregate the predictions of\nagents, the principal needs to elicit some notion of confidence from agents,\ncapturing how much experience or knowledge led to their predictions. To\nformalize this, we consider a principal who wishes to elicit predictions about\na random variable from a group of Bayesian agents, each of whom have privately\nobserved some independent samples of the random variable, and hopes to\naggregate the predictions as if she had directly observed the samples of all\nagents. Leveraging techniques from Bayesian statistics, we represent confidence\nas the number of samples an agent has observed, which is quantified by a\nhyperparameter from a conjugate family of prior distributions. This then allows\nus to show that if the principal has access to a few samples, she can achieve\nher aggregation goal by eliciting predictions from agents using proper scoring\nrules. In particular, if she has access to one sample, she can successfully\naggregate the agents' predictions if and only if every posterior predictive\ndistribution corresponds to a unique value of the hyperparameter. Furthermore,\nthis uniqueness holds for many common distributions of interest. When this\nuniqueness property does not hold, we construct a novel and intuitive mechanism\nwhere a principal with two samples can elicit and optimally aggregate the\nagents' predictions.\n", "versions": [{"version": "v1", "created": "Wed, 1 Oct 2014 20:11:04 GMT"}], "update_date": "2014-10-03", "authors_parsed": [["Frongillo", "Rafael M.", ""], ["Chen", "Yiling", ""], ["Kash", "Ian A.", ""]]}, {"id": "1410.0413", "submitter": "Rafael Frongillo", "authors": "Rafael M. Frongillo, Mark D. Reid", "title": "Risk Dynamics in Trade Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new framework to model interactions among agents which seek to\ntrade to minimize their risk with respect to some future outcome. We quantify\nthis risk using the concept of risk measures from finance, and introduce a\nclass of trade dynamics which allow agents to trade contracts contingent upon\nthe future outcome. We then show that these trade dynamics exactly correspond\nto a variant of randomized coordinate descent. By extending the analysis of\nthese coordinate descent methods to account for our more organic setting, we\nare able to show convergence rates for very general trade dynamics, showing\nthat the market or network converges to a unique steady state. Applying these\nresults to prediction markets, we expand on recent results by adding\nconvergence rates and general aggregation properties. Finally, we illustrate\nthe generality of our framework by applying it to agent interactions on a\nscale-free network.\n", "versions": [{"version": "v1", "created": "Wed, 1 Oct 2014 23:26:59 GMT"}, {"version": "v2", "created": "Fri, 10 Oct 2014 01:40:36 GMT"}], "update_date": "2014-10-13", "authors_parsed": [["Frongillo", "Rafael M.", ""], ["Reid", "Mark D.", ""]]}, {"id": "1410.0485", "submitter": "Luis Dinis", "authors": "J.M.R. Parrondo, L. Dinis", "title": "Brownian motion and gambling: from ratchets to paradoxical games", "comments": "25 pages, 11 figures", "journal-ref": "Contemporary Physics 45 (2), 147 (2004)", "doi": "10.1080/00107510310001644836", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two losing gambling games, when alternated in a periodic or random fashion,\ncan produce a winning game. This paradox has been inspired by certain physical\nsystems capable of rectifying fluctuations: the so-called Brownian ratchets. In\nthis paper we review this paradox, from Brownian ratchets to the most recent\nstudies on collective games, providing some intuitive explanations of the\nunexpected phenomena that we will find along the way.\n", "versions": [{"version": "v1", "created": "Thu, 2 Oct 2014 09:13:24 GMT"}], "update_date": "2014-10-03", "authors_parsed": [["Parrondo", "J. M. R.", ""], ["Dinis", "L.", ""]]}, {"id": "1410.0488", "submitter": "Luis Dinis", "authors": "L. Dinis, J.M.R. Parrondo", "title": "Inefficiency of voting in Parrondo games", "comments": "11 pages, 6 figures", "journal-ref": "Physica A: Statistical Mechanics and its Applications 343, 701\n  (2004)", "doi": "10.1016/j.physa.2004.06.076", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a modification of the so-called Parrondo's paradox where a large\nnumber of individuals choose the game they want to play by voting. We show that\nit can be better for the players to vote randomly than to vote according to\ntheir own benefit in one turn. The former yields a winning tendency while the\nlatter results in steady losses. An explanation of this behaviour is given by\nnoting that selfish voting prevents the switching between games that is\nessential for the total capital to grow. Results for both finite and infinite\nnumber of players are presented. It is shown that the extension of the model to\nthe history-dependent Parrondo's paradox also displays the same effect.\n", "versions": [{"version": "v1", "created": "Thu, 2 Oct 2014 09:25:56 GMT"}], "update_date": "2014-10-03", "authors_parsed": [["Dinis", "L.", ""], ["Parrondo", "J. M. R.", ""]]}, {"id": "1410.0782", "submitter": "James Roberts", "authors": "Thomas Bonald and James Roberts", "title": "Multi-resource fairness: Objectives, algorithms and performance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing efficient and fair algorithms for sharing multiple resources\nbetween heterogeneous demands is becoming increasingly important. Applications\ninclude compute clusters shared by multi-task jobs and routers equipped with\nmiddleboxes shared by flows of different types. We show that the currently\npreferred objective of Dominant Resource Fairness has a significantly less\nfavorable efficiency-fairness tradeoff than alternatives like Proportional\nFairness and our proposal, Bottleneck Max Fairness. In addition to other\ndesirable properties, these objectives are equally strategyproof in any\nrealistic scenario with dynamic demand.\n", "versions": [{"version": "v1", "created": "Fri, 3 Oct 2014 08:50:44 GMT"}], "update_date": "2014-10-06", "authors_parsed": [["Bonald", "Thomas", ""], ["Roberts", "James", ""]]}, {"id": "1410.0940", "submitter": "Faisal Khan", "authors": "Faisal Shah Khan", "title": "Dominant Strategies in Two Qubit Quantum Computations", "comments": "The abstract has been re-written and technical details added to\n  section 5 in version 1", "journal-ref": null, "doi": "10.1007/s11128-015-0945-9", "report-no": null, "categories": "quant-ph cs.GT math-ph math.MP math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nash equilibrium is a solution concept in non-strictly competitive,\nnon-cooperative game theory that finds applications in various scientific and\nengineering disciplines. A non-strictly competitive, non-cooperative game model\nis presented here for two qubit quantum computations that allows for the\ncharacterization of Nash equilibrium in these computations via the inner\nproduct of their state space. Nash equilibrium outcomes are optimal under given\nconstraints and therefore offer a game-theoretic measure of constrained\noptimization of two qubit quantum computations.\n", "versions": [{"version": "v1", "created": "Fri, 3 Oct 2014 18:51:54 GMT"}, {"version": "v2", "created": "Wed, 4 Feb 2015 06:01:00 GMT"}], "update_date": "2015-02-05", "authors_parsed": [["Khan", "Faisal Shah", ""]]}, {"id": "1410.1113", "submitter": "Shreyas Sekar", "authors": "Elliot Anshelevich and Shreyas Sekar", "title": "Price Competition in Networked Markets: How do monopolies impact social\n  welfare?", "comments": "To appear in Proceedings of WINE 2015: 11th Conference on Web and\n  Internet Economics", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the efficiency of allocations in large markets with a network\nstructure where every seller owns an edge in a graph and every buyer desires a\npath connecting some nodes. While it is known that stable allocations in such\nsettings can be very inefficient, the exact properties of equilibria in markets\nwith multiple sellers are not fully understood even in single-source\nsingle-sink networks. In this work, we show that for a large class of natural\nbuyer demand functions, we are guaranteed the existence of an equilibrium with\nseveral desirable properties. The crucial insight that we gain into the\nequilibrium structure allows us to obtain tight bounds on efficiency in terms\nof the various parameters governing the market, especially the number of\nmonopolies M. All of our efficiency results extend to markets without the\nnetwork structure.\n  While it is known that monopolies can cause large inefficiencies in general,\nour main results for single-source single-sink networks indicate that for\nseveral natural demand functions the efficiency only drops linearly with M. For\nexample, for concave demand we prove that the efficiency loss is at most a\nfactor 1+M/2 from the optimum, for demand with monotone hazard rate it is at\nmost 1+M, and for polynomial demand the efficiency decreases logarithmically\nwith M. In contrast to previous work that showed that monopolies may adversely\naffect welfare, our main contribution is showing that monopolies may not be as\n`evil' as they are made out to be; the loss in efficiency is bounded in many\nnatural markets. Finally, we consider more general, multiple-source networks\nand show that in the absence of monopolies, mild assumptions on the network\ntopology guarantee an equilibrium that maximizes social welfare.\n", "versions": [{"version": "v1", "created": "Sun, 5 Oct 2014 05:00:41 GMT"}, {"version": "v2", "created": "Tue, 21 Apr 2015 23:32:55 GMT"}, {"version": "v3", "created": "Mon, 5 Oct 2015 08:48:15 GMT"}], "update_date": "2015-10-06", "authors_parsed": [["Anshelevich", "Elliot", ""], ["Sekar", "Shreyas", ""]]}, {"id": "1410.1255", "submitter": "Weidong Li", "authors": "Weidong Li, Xi Liu, Xiaolu Zhang, Xuejie Zhang", "title": "Multi-resource Fair Allocation with Bounded Number of Tasks in Cloud\n  Computing Systems", "comments": "This paper has been withdrawn by the author due to a crucial sign\n  error in equatio", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dominant resource fairness (DRF) is a popular mechanism for multi-resource\nallocation in cloud computing systems. In this paper, we consider a problem of\nmulti-resource fair allocation with bounded number of tasks. Firstly, we\npropose the lexicographically max-min normalized share (LMMNS) fair allocation\nmechanism, which is a natural generalization of DRF, and design a non-trivial\noptimal algorithm to find a LMMNS fair allocation, whose running time is linear\nin the number of users. Secondly, we prove that LMMNS satisfies envy-freeness\n(EF) and group strategy-proofness (GSP), and analysis the approximation ratios\nof LMMNS, by exploiting the properties of the optimal solution. Thirdly, we\npropose a modified version of LMMNS, which is the second mechanism satisfying\nsharing incentive, EF, and GSP. Finally, we have implemented LMMNS, and show\nthat it has a good average-case performance, especially when the number of\nresources is 2.\n", "versions": [{"version": "v1", "created": "Mon, 6 Oct 2014 05:22:56 GMT"}, {"version": "v2", "created": "Tue, 3 Feb 2015 06:04:07 GMT"}, {"version": "v3", "created": "Wed, 26 Oct 2016 01:06:30 GMT"}], "update_date": "2016-10-27", "authors_parsed": [["Li", "Weidong", ""], ["Liu", "Xi", ""], ["Zhang", "Xiaolu", ""], ["Zhang", "Xuejie", ""]]}, {"id": "1410.1314", "submitter": "Valerio Capraro", "authors": "Valerio Capraro", "title": "The emergence of hyper-altruistic behaviour in conflictual situations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Situations where people have to decide between hurting themselves or another\nperson are at the core of many individual and global conflicts. Yet little is\nknown about how people behave when facing these situations in the lab. Here we\nreport a large experiment in which participants could either take $x$ dollars\nfrom another anonymous participant or give $y$ dollars to the same participant.\nDepending on the treatments, participants could also exit the game without\nmaking any decision, but paying a cost. Across different protocols and\nparameter specifications, we provide evidence of three regularities: (i) when\nexiting is allowed and costless, subjects tend to exit the game; (ii) females\nare more likely than males to exit the game, but only when the cost is small;\n(iii) when exiting is not allowed, altruistic actions are more common than\npredicted by the dominant economic models. In particular, against the\npredictions of every dominant economic model, about one sixth of the subjects\nshow hyper-altruistic tendencies, that is, they prefer giving $y$ rather than\ntaking $x>y$. In doing so, our findings shed light on human decision-making in\nconflictual situations and suggest that economic models should be revised in\norder to take into account hyper-altruistic behaviour.\n", "versions": [{"version": "v1", "created": "Mon, 6 Oct 2014 10:45:44 GMT"}, {"version": "v2", "created": "Mon, 17 Nov 2014 14:17:20 GMT"}, {"version": "v3", "created": "Thu, 20 Nov 2014 11:00:03 GMT"}, {"version": "v4", "created": "Mon, 22 Dec 2014 11:14:54 GMT"}], "update_date": "2014-12-23", "authors_parsed": [["Capraro", "Valerio", ""]]}, {"id": "1410.1703", "submitter": "Salman Fadaei", "authors": "Salman Fadaei and Martin Bichler", "title": "A Truthful Mechanism for the Generalized Assignment Problem", "comments": "18 pages, Earlier version accepted at WINE 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a truthful-in-expectation, $(1-1/e)$-approximation mechanism for a\nstrategic variant of the generalized assignment problem (GAP). In GAP, a set of\nitems has to be optimally assigned to a set of bins without exceeding the\ncapacity of any singular bin. In the strategic variant of the problem we study,\nvalues for assigning items to bins are the private information of bidders and\nthe mechanism should provide bidders with incentives to truthfully report their\nvalues. The approximation ratio of the mechanism is a significant improvement\nover the approximation ratio of the existing truthful mechanism for GAP.\n  The proposed mechanism comprises a novel convex optimization program as the\nallocation rule as well as an appropriate payment rule. To implement the convex\nprogram in polynomial time, we propose a fractional local search algorithm\nwhich approximates the optimal solution within an arbitrarily small error\nleading to an approximately truthful-in-expectation mechanism. The presented\nalgorithm improves upon the existing optimization algorithms for GAP in terms\nof simplicity and runtime while the approximation ratio closely matches the\nbest approximation ratio given for GAP when all inputs are publicly known.\n", "versions": [{"version": "v1", "created": "Tue, 7 Oct 2014 12:29:43 GMT"}, {"version": "v2", "created": "Mon, 15 Aug 2016 20:05:49 GMT"}], "update_date": "2016-08-17", "authors_parsed": [["Fadaei", "Salman", ""], ["Bichler", "Martin", ""]]}, {"id": "1410.1920", "submitter": "Or Sheffet", "authors": "Yiling Chen and Or Sheffet and Salil Vadhan", "title": "Privacy Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of analyzing the effect of privacy concerns on the behavior of\nselfish utility-maximizing agents has received much attention lately. Privacy\nconcerns are often modeled by altering the utility functions of agents to\nconsider also their privacy loss. Such privacy aware agents prefer to take a\nrandomized strategy even in very simple games in which non-privacy aware agents\nplay pure strategies. In some cases, the behavior of privacy aware agents\nfollows the framework of Randomized Response, a well-known mechanism that\npreserves differential privacy.\n  Our work is aimed at better understanding the behavior of agents in settings\nwhere their privacy concerns are explicitly given. We consider a toy setting\nwhere agent A, in an attempt to discover the secret type of agent B, offers B a\ngift that one type of B agent likes and the other type dislikes. As opposed to\nprevious works, B's incentive to keep her type a secret isn't the result of\n\"hardwiring\" B's utility function to consider privacy, but rather takes the\nform of a payment between B and A. We investigate three different types of\npayment functions and analyze B's behavior in each of the resulting games. As\nwe show, under some payments, B's behavior is very different than the behavior\nof agents with hardwired privacy concerns and might even be deterministic.\nUnder a different payment we show that B's BNE strategy does fall into the\nframework of Randomized Response.\n", "versions": [{"version": "v1", "created": "Tue, 7 Oct 2014 21:31:59 GMT"}], "update_date": "2014-10-09", "authors_parsed": [["Chen", "Yiling", ""], ["Sheffet", "Or", ""], ["Vadhan", "Salil", ""]]}, {"id": "1410.2272", "submitter": "Arkadii Slinko", "authors": "Adam Clearwater, Clemens Puppe and Arkadii Slinko", "title": "The single-crossing property on a tree", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We generalize the classical single-crossing property to single-crossing\nproperty on trees and obtain new ways to construct Condorcet domains which are\nsets of linear orders which possess the property that every profile composed\nfrom those orders have transitive majority relation. We prove that for any tree\nthere exist profiles that are single-crossing on that tree; moreover, that tree\nis minimal in this respect for at least one such profile. Finally, we provide a\npolynomial-time algorithm to recognize whether or not a given profile is\nsingle-crossing with respect to some tree. We also show that finding winners\nfor Chamberlin-Courant rule is polynomial for profiles that are single-crossing\non trees.\n", "versions": [{"version": "v1", "created": "Wed, 8 Oct 2014 20:44:06 GMT"}], "update_date": "2014-10-10", "authors_parsed": [["Clearwater", "Adam", ""], ["Puppe", "Clemens", ""], ["Slinko", "Arkadii", ""]]}, {"id": "1410.2652", "submitter": "Lane A. Hemaspaandra", "authors": "Gabor Erdelyi, Edith Hemaspaandra, Lane A. Hemaspaandra", "title": "More Natural Models of Electoral Control by Partition", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  \"Control\" studies attempts to set the outcome of elections through the\naddition, deletion, or partition of voters or candidates. The set of benchmark\ncontrol types was largely set in the seminal 1992 paper by Bartholdi, Tovey,\nand Trick that introduced control, and there now is a large literature studying\nhow many of the benchmark types various election systems are vulnerable to,\ni.e., have polynomial-time attack algorithms for.\n  However, although the longstanding benchmark models of addition and deletion\nmodel relatively well the real-world settings that inspire them, the\nlongstanding benchmark models of partition model settings that are arguably\nquite distant from those they seek to capture.\n  In this paper, we introduce--and for some important cases analyze the\ncomplexity of--new partition models that seek to better capture many real-world\npartition settings. In particular, in many partition settings one wants the two\nparts of the partition to be of (almost) equal size, or is partitioning into\nmore than two parts, or has groups of actors who must be placed in the same\npart of the partition. Our hope is that having these new partition types will\nallow studies of control attacks to include such models that more realistically\ncapture many settings.\n", "versions": [{"version": "v1", "created": "Thu, 9 Oct 2014 23:22:49 GMT"}], "update_date": "2014-10-13", "authors_parsed": [["Erdelyi", "Gabor", ""], ["Hemaspaandra", "Edith", ""], ["Hemaspaandra", "Lane A.", ""]]}, {"id": "1410.2924", "submitter": "Wenbo Wang", "authors": "Wenbo Wang, Andres Kwasinski and Zhu Han", "title": "Power allocation with stackelberg game in femtocell networks: a\n  self-learning approach", "comments": "2014 Eleventh Annual IEEE International Conference on Sensing,\n  Communication, and Networking (SECON) (SECON 2014)", "journal-ref": null, "doi": "10.1109/SAHCN.2014.6990372", "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the energy-efficient power allocation for a two-tier,\nunderlaid femtocell network. The behaviors of the Macrocell Base Station (MBS)\nand the Femtocell Users (FUs) are modeled hierarchically as a Stackelberg game.\nThe MBS guarantees its own QoS requirement by charging the FUs individually\naccording to the cross-tier interference, and the FUs responds by controlling\nthe local transmit power non-cooperatively. Due to the limit of information\nexchange in intra- and inter-tiers, a self-learning based strategy-updating\nmechanism is proposed for each user to learn the equilibrium strategies. In the\nsame Stackelberg-game framework, two different scenarios based on the\ncontinuous and discrete power profiles for the FUs are studied, respectively.\nThe self-learning schemes in the two scenarios are designed based on the local\nbest response. By studying the properties of the proposed game in the two\nsituations, the convergence property of the learning schemes is provided. The\nsimulation results are provided to support the theoretical finding in different\nsituations of the proposed game, and the efficiency of the learning schemes is\nvalidated.\n", "versions": [{"version": "v1", "created": "Fri, 10 Oct 2014 22:53:28 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Wang", "Wenbo", ""], ["Kwasinski", "Andres", ""], ["Han", "Zhu", ""]]}, {"id": "1410.3033", "submitter": "Ho Yee Cheung", "authors": "Yu Cheng, Ho Yee Cheung, Shaddin Dughmi, Shanghua Teng", "title": "Signaling in Quasipolynomial time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Strategic interactions often take place in an environment rife with\nuncertainty. As a result, the equilibrium of a game is intimately related to\nthe information available to its players. The \\emph{signaling problem}\nabstracts the task faced by an informed \"market maker\", who must choose how to\nreveal information in order to effect a desirable equilibrium.\n  In this paper, we consider two fundamental signaling problems: one for\nabstract normal form games, and the other for single item auctions. For the\nformer, we consider an abstract class of objective functions which includes the\nsocial welfare and weighted combinations of players' utilities, and for the\nlatter we restrict our attention to the social welfare objective and to\nsignaling schemes which are constrained in the number of signals used. For both\nproblems, we design approximation algorithms for the signaling problem which\nrun in quasi-polynomial time under various conditions, extending and\ncomplementing the results of various recent works on the topic.\n  Underlying each of our results is a \"meshing scheme\" which effectively\novercomes the \"curse of dimensionality\" and discretizes the space of\n\"essentially different\" posterior beliefs -- in the sense of inducing\n\"essentially different\" equilibria. This is combined with an algorithm for\noptimally assembling a signaling scheme as a convex combination of such\nbeliefs. For the normal form game setting, the meshing scheme leads to a convex\npartition of the space of posterior beliefs and this assembly procedure is\nreduced to a linear program, and in the auction setting the assembly procedure\nis reduced to submodular function maximization.\n", "versions": [{"version": "v1", "created": "Sat, 11 Oct 2014 23:26:10 GMT"}], "update_date": "2014-10-14", "authors_parsed": [["Cheng", "Yu", ""], ["Cheung", "Ho Yee", ""], ["Dughmi", "Shaddin", ""], ["Teng", "Shanghua", ""]]}, {"id": "1410.3048", "submitter": "Christopher Wilkens", "authors": "Ruggiero Cavallo and Christopher A. Wilkens", "title": "GSP with General Independent Click-Through-Rates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The popular generalized second price (GSP) auction for sponsored search is\nbuilt upon a separable model of click-through-rates that decomposes the\nlikelihood of a click into the product of a \"slot effect\" and an \"advertiser\neffect\" --- if the first slot is twice as good as the second for some bidder,\nthen it is twice as good for everyone. Though appealing in its simplicity, this\nmodel is quite suspect in practice. A wide variety of factors including\nexternalities and budgets have been studied that can and do cause it to be\nviolated. In this paper we adopt a view of GSP as an iterated second price\nauction (see, e.g., Milgrom 2010) and study how the most basic violation of\nseparability --- position dependent, arbitrary public click-through-rates that\ndo not decompose --- affects results from the foundational analysis of GSP\n(Varian 2007, Edelman et al. 2007). For the two-slot setting we prove that for\narbitrary click-through-rates, for arbitrary bidder values, an efficient\npure-strategy equilibrium always exists; however, without separability there\nalways exist values such that the VCG outcome and payments cannot be realized\nby any bids, in equilibrium or otherwise. The separability assumption is\ntherefore necessary in the two-slot case to match the payments of VCG but not\nfor efficiency. We moreover show that without separability, generic existence\nof efficient equilibria is sensitive to the choice of tie-breaking rule, and\nwhen there are more than two slots, no (bid-independent) tie-breaking rule\nyields the positive result. In light of this we suggest alternative mechanisms\nthat trade the simplicity of GSP for better equilibrium properties when there\nare three or more slots.\n", "versions": [{"version": "v1", "created": "Sun, 12 Oct 2014 04:50:44 GMT"}], "update_date": "2014-10-14", "authors_parsed": [["Cavallo", "Ruggiero", ""], ["Wilkens", "Christopher A.", ""]]}, {"id": "1410.3341", "submitter": "Fei Tian", "authors": "Haifang Li, Fei Tian, Wei Chen, Tao Qin, Tie-Yan Liu", "title": "Generalization Analysis for Game-Theoretic Machine Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For Internet applications like sponsored search, cautions need to be taken\nwhen using machine learning to optimize their mechanisms (e.g., auction) since\nself-interested agents in these applications may change their behaviors (and\nthus the data distribution) in response to the mechanisms. To tackle this\nproblem, a framework called game-theoretic machine learning (GTML) was recently\nproposed, which first learns a Markov behavior model to characterize agents'\nbehaviors, and then learns the optimal mechanism by simulating agents' behavior\nchanges in response to the mechanism. While GTML has demonstrated practical\nsuccess, its generalization analysis is challenging because the behavior data\nare non-i.i.d. and dependent on the mechanism. To address this challenge,\nfirst, we decompose the generalization error for GTML into the behavior\nlearning error and the mechanism learning error; second, for the behavior\nlearning error, we obtain novel non-asymptotic error bounds for both parametric\nand non-parametric behavior learning methods; third, for the mechanism learning\nerror, we derive a uniform convergence bound based on a new concept called\nnested covering number of the mechanism space and the generalization analysis\ntechniques developed for mixing sequences. To the best of our knowledge, this\nis the first work on the generalization analysis of GTML, and we believe it has\ngeneral implications to the theoretical analysis of other complicated machine\nlearning problems.\n", "versions": [{"version": "v1", "created": "Thu, 9 Oct 2014 03:51:19 GMT"}], "update_date": "2014-10-14", "authors_parsed": [["Li", "Haifang", ""], ["Tian", "Fei", ""], ["Chen", "Wei", ""], ["Qin", "Tao", ""], ["Liu", "Tie-Yan", ""]]}, {"id": "1410.3363", "submitter": "Valerio Capraro", "authors": "Valerio Capraro and Joseph Y. Halpern", "title": "Translucent Players: Explaining Cooperative Behavior in Social Dilemmas", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last few decades, numerous experiments have shown that humans do not\nalways behave so as to maximize their material payoff. Cooperative behavior\nwhen non-cooperation is a dominant strategy (with respect to the material\npayoffs) is particularly puzzling. Here we propose a novel approach to explain\ncooperation, assuming what Halpern and Pass (2013) call \"translucent players\".\nTypically, players are assumed to be \"opaque\", in the sense that a deviation by\none player does not affect the strategies used by other players. But a player\nmay believe that if he switches from one strategy to another, the fact that he\nchooses to switch may be visible to the other players. For example, if he\nchooses to defect in Prisoner's Dilemma, the other player may sense his guilt.\nWe show that by assuming translucent players, we can recover many of the\nregularities observed in human behavior in well-studied games such as\nPrisoner's Dilemma, Traveler's Dilemma, Bertrand Competition, and the Public\nGoods game.\n", "versions": [{"version": "v1", "created": "Mon, 13 Oct 2014 15:50:09 GMT"}, {"version": "v2", "created": "Tue, 4 Nov 2014 16:37:53 GMT"}], "update_date": "2014-11-05", "authors_parsed": [["Capraro", "Valerio", ""], ["Halpern", "Joseph Y.", ""]]}, {"id": "1410.3688", "submitter": "Khammassi Iyed Mr", "authors": "Iyed Khammassi, Rachid Elazouzi, Majed Haddad and Issam Mabrouki", "title": "A Game Theoretic Model for Network Virus Protection", "comments": "Technical report, 8 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The network virus propagation is influenced by various factors, and some of\nthem are neglected in most of the existed models in the literature. In this\npaper, we study the network virus propagation based on the the epidemiological\nviewpoint. We assume that nodes can be equipped with protection against virus\nand the security of a node depends not only on his protection strategy but also\nby those chosen by other nodes in the network. A crucial aspect is whether\nowners of device, e.g., either smartphones, machines or tablets, are willing to\nbe equipped to protect themselves or to take the risk to be contaminated in\norder to avoid the payment for a new antivirus. We model the interaction\nbetween nodes as a non-cooperative games where the node has two strategies:\neither to update the antivirus or not. To this aim, we provide a full\ncharacterization of the equilibria of the game and we investigate the impact of\nthe price of protection on the equilibrium as well as the efficiency of the\nprotection at equilibrium. Further we consider more realistic scenarios in\nwhich the dynamic of sources that disseminate the virus, evolves as function of\nthe popularity of virus. In this work, the interest in the virus by sources\nevolves under the Influence Linear Threshold (HILT) model.\n", "versions": [{"version": "v1", "created": "Tue, 14 Oct 2014 13:37:45 GMT"}], "update_date": "2014-10-15", "authors_parsed": [["Khammassi", "Iyed", ""], ["Elazouzi", "Rachid", ""], ["Haddad", "Majed", ""], ["Mabrouki", "Issam", ""]]}, {"id": "1410.3877", "submitter": "Jan Bok", "authors": "Jan Bok, Milan Hlad\\'ik", "title": "Selection-based Approach to Cooperative Interval Games", "comments": "slightly more appropriate wording about the results of Section 4", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperative interval games are a generalized model of cooperative games in\nwhich the worth of every coalition corresponds to a closed interval\nrepresenting the possible outcomes of its cooperation. Selections are all\npossible outcomes of the interval game with no additional uncertainty.\n  We introduce new selection-based classes of interval games and prove their\ncharacterization theorems and relations to existing classes based on the\ninterval weakly better operator. We show new results regarding the core and\nimputations and examine a problem of equivalence for two different versions of\nthe core, the main stability solution of cooperative games. Finally, we\nintroduce the definition of strong imputation and strong core as universal\nsolution concepts of interval games.\n", "versions": [{"version": "v1", "created": "Tue, 14 Oct 2014 22:04:38 GMT"}, {"version": "v2", "created": "Mon, 15 Dec 2014 14:06:02 GMT"}, {"version": "v3", "created": "Fri, 13 Nov 2015 00:57:55 GMT"}, {"version": "v4", "created": "Mon, 14 Nov 2016 16:05:15 GMT"}, {"version": "v5", "created": "Sat, 21 Jul 2018 11:42:31 GMT"}, {"version": "v6", "created": "Wed, 25 Jul 2018 15:39:45 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Bok", "Jan", ""], ["Hladík", "Milan", ""]]}, {"id": "1410.4154", "submitter": "EPTCS", "authors": "Anshul Gupta (University of Liverpool), Sven Schewe (University of\n  Liverpool), Dominik Wojtczak (University of Liverpool)", "title": "Making the Best of Limited Memory in Multi-Player Discounted Sum Games", "comments": "In Proceedings GandALF 2015, arXiv:1509.06858", "journal-ref": "EPTCS 193, 2015, pp. 16-30", "doi": "10.4204/EPTCS.193.2", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we establish the existence of optimal bounded memory strategy\nprofiles in multi-player discounted sum games. We introduce a non-deterministic\napproach to compute optimal strategy profiles with bounded memory. Our approach\ncan be used to obtain optimal rewards in a setting where a powerful player\nselects the strategies of all players for Nash and leader equilibria, where in\nleader equilibria the Nash condition is waived for the strategy of this\npowerful player. The resulting strategy profiles are optimal for this player\namong all strategy profiles that respect the given memory bound, and the\nrelated decision problem is NP-complete. We also provide simple examples, which\nshow that having more memory will improve the optimal strategy profile, and\nthat sufficient memory to obtain optimal strategy profiles cannot be inferred\nfrom the structure of the game.\n", "versions": [{"version": "v1", "created": "Wed, 15 Oct 2014 18:20:42 GMT"}, {"version": "v2", "created": "Thu, 30 Jul 2015 15:04:37 GMT"}, {"version": "v3", "created": "Thu, 24 Sep 2015 01:53:44 GMT"}], "update_date": "2015-09-25", "authors_parsed": [["Gupta", "Anshul", "", "University of Liverpool"], ["Schewe", "Sven", "", "University of\n  Liverpool"], ["Wojtczak", "Dominik", "", "University of Liverpool"]]}, {"id": "1410.4421", "submitter": "Sergio Grammatico", "authors": "Sergio Grammatico, Francesca Parise, Marcello Colombino, John Lygeros", "title": "Decentralized Convergence to Nash Equilibria in Constrained\n  Deterministic Mean Field Control", "comments": "IEEE Trans. on Automatic Control (cond. accepted)", "journal-ref": null, "doi": "10.1109/TAC.2015.2513368", "report-no": null, "categories": "cs.SY cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers decentralized control and optimization methodologies for\nlarge populations of systems, consisting of several agents with different\nindividual behaviors, constraints and interests, and affected by the aggregate\nbehavior of the overall population. For such large-scale systems, the theory of\naggregative and mean field games has been established and successfully applied\nin various scientific disciplines. While the existing literature addresses the\ncase of unconstrained agents, we formulate deterministic mean field control\nproblems in the presence of heterogeneous convex constraints for the individual\nagents, for instance arising from agents with linear dynamics subject to convex\nstate and control constraints. We propose several model-free feedback\niterations to compute in a decentralized fashion a mean field Nash equilibrium\nin the limit of infinite population size. We apply our methods to the\nconstrained linear quadratic deterministic mean field control problem and to\nthe constrained mean field charging control problem for large populations of\nplug-in electric vehicles.\n", "versions": [{"version": "v1", "created": "Thu, 16 Oct 2014 13:48:14 GMT"}, {"version": "v2", "created": "Sun, 17 May 2015 20:59:36 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Grammatico", "Sergio", ""], ["Parise", "Francesca", ""], ["Colombino", "Marcello", ""], ["Lygeros", "John", ""]]}, {"id": "1410.5152", "submitter": "Shanghua Teng", "authors": "Christian Borgs and Jennifer Chayes and Adrian Marple and Shang-Hua\n  Teng", "title": "Fixed-Points of Social Choice: An Axiomatic Approach to Network\n  Communities", "comments": "39 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CC cs.DS cs.GT cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide the first social choice theory approach to the question of what\nconstitutes a community in a social network. Inspired by the classic\npreferences models in social choice theory, we start from an abstract social\nnetwork framework, called preference networks; these consist of a finite set of\nmembers where each member has a total-ranking preference of all members in the\nset.\n  Within this framework, we develop two complementary approaches to\naxiomatically study the formation and structures of communities. (1) We apply\nsocial choice theory and define communities indirectly by postulating that they\nare fixed points of a preference aggregation function obeying certain desirable\naxioms. (2) We directly postulate desirable axioms for communities without\nreference to preference aggregation, leading to eight natural community axioms.\n  These approaches allow us to formulate and analyze community rules. We prove\na taxonomy theorem that provides a structural characterization of the family of\ncommunity rules that satisfies all eight axioms. The structure is actually\nquite beautiful: these community rules form a bounded lattice under the natural\nintersection and union operations. Our structural theorem is complemented with\na complexity result: while identifying a community by the most selective rule\nof the lattice is in P, deciding if a subset is a community by the most\ncomprehensive rule of the lattice is coNP-complete. Our studies also shed light\non the limitations of defining community rules solely based on preference\naggregation: any aggregation function satisfying Arrow's IIA axiom, or based on\ncommonly used aggregation schemes like the Borda count or generalizations\nthereof, lead to communities which violate at least one of our community\naxioms. Finally, we give a polynomial-time rule consistent with seven axioms\nand weakly satisfying the eighth axiom.\n", "versions": [{"version": "v1", "created": "Mon, 20 Oct 2014 04:37:23 GMT"}], "update_date": "2014-10-21", "authors_parsed": [["Borgs", "Christian", ""], ["Chayes", "Jennifer", ""], ["Marple", "Adrian", ""], ["Teng", "Shang-Hua", ""]]}, {"id": "1410.5186", "submitter": "Dominikus Kr\\\"uger", "authors": "Britta Dorn and Dominikus Kr\\\"uger", "title": "On the Hardness of Bribery Variants in Voting with CP-Nets", "comments": "improved readability; identified Cheapest Subsets to be the\n  enumeration variant of K.th Largest Subset, so we renamed it to K-Smallest\n  Subsets and point to the literatur; some more typos fixed", "journal-ref": null, "doi": "10.1007/s10472-015-9469-3", "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We continue previous work by Mattei et al. (Mattei, N., Pini, M., Rossi, F.,\nVenable, K.: Bribery in voting with CP-nets. Ann. of Math. and Artif. Intell.\npp. 1--26 (2013)) in which they study the computational complexity of bribery\nschemes when voters have conditional preferences that are modeled by CP-nets.\nFor most of the cases they considered, they could show that the bribery problem\nis solvable in polynomial time. Some cases remained open---we solve two of them\nand extend the previous results to the case that voters are weighted. Moreover,\nwe consider negative (weighted) bribery in CP-nets, when the briber is not\nallowed to pay voters to vote for his preferred candidate.\n", "versions": [{"version": "v1", "created": "Mon, 20 Oct 2014 08:23:00 GMT"}, {"version": "v2", "created": "Fri, 27 Feb 2015 15:06:50 GMT"}, {"version": "v3", "created": "Wed, 18 May 2016 12:26:22 GMT"}], "update_date": "2016-05-19", "authors_parsed": [["Dorn", "Britta", ""], ["Krüger", "Dominikus", ""]]}, {"id": "1410.5958", "submitter": "Florian Brandl", "authors": "Florian Brandl", "title": "An Application of Fixed-point Theory to Probabilistic Social Choice", "comments": "This paper has been withdrawn due to a mistake in the proof of the\n  main theorem", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this note is to prove the existence of a randomized mechanism,\na social decision scheme (SDS), with desirable fairness, efficiency, and\nstrategyproofness properties unmatched by all known SDSs. In particular, we\ndisprove a conjecture by Aziz et al. (2013). Additionally, we obtain a strong\nexistence result for the domain of random assignment. Both, the notion of\nefficiency and strategyproofness are based on stochastic dominance and have\nbeen studied extensively for random assignment. The proof makes crucial use of\nBrouwer's fixed-point theorem and is hence non-constructive. To the best of our\nknowledge, this is the first application of a fixed-point theorem to show the\nexistence of a social choice function or mechanism.\n", "versions": [{"version": "v1", "created": "Wed, 22 Oct 2014 09:17:13 GMT"}, {"version": "v2", "created": "Wed, 26 Nov 2014 13:41:50 GMT"}], "update_date": "2014-11-27", "authors_parsed": [["Brandl", "Florian", ""]]}, {"id": "1410.6831", "submitter": "Benjamin Larrousse", "authors": "Benjamin Larrousse, Olivier Beaude and Samson Lasaulce", "title": "Crawford-Sobel meet Lloyd-Max on the grid", "comments": "ICASSP 2014, 5 pages", "journal-ref": "IEEE International Conference on Acoustics, Speech and Signal\n  Processing (ICASSP), Florence, Italy, May 2014", "doi": "10.1109/ICASSP.2014.6854781", "report-no": null, "categories": "cs.OH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main contribution of this work is twofold. First, we apply, for the first\ntime, a framework borrowed from economics to a problem in the smart grid\nnamely, the design of signaling schemes between a consumer and an electricity\naggregator when these have non-aligned objectives. The consumer's objective is\nto meet its need in terms of power and send a request (a message) to the\naggregator which does not correspond, in general, to its actual need. The\naggregator, which receives this request, not only wants to satisfy it but also\nwants to manage the cost induced by the residential electricity distribution\nnetwork. Second, we establish connections between the exploited framework and\nthe quantization problem. Although the model assumed for the payoff functions\nfor the consumer and aggregator is quite simple, it allows one to extract\ninsights of practical interest from the analysis conducted. This allows us to\nestablish a direct connection with quantization, and more importantly, to open\na much more general challenge for source and channel coding.\n", "versions": [{"version": "v1", "created": "Fri, 5 Sep 2014 12:45:14 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Larrousse", "Benjamin", ""], ["Beaude", "Olivier", ""], ["Lasaulce", "Samson", ""]]}, {"id": "1410.7026", "submitter": "Yuanshi Zheng", "authors": "Jingying Ma, Yuanshi Zheng, Bin Wu, Long Wang", "title": "Optimal topology of multi-agent systems with two leaders: a zero-sum\n  game perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is typical to assume that there is no conflict of interest among leaders.\nUnder such assumption, it is known that, for a multi-agent system with two\nleaders, if the followers' interaction subgraph is undirected and connected,\nthen followers will converge to a convex combination of two leaders' states\nwith linear consensus protocol. In this paper, we introduce the conflict\nbetween leaders: by choosing k followers to connect with, every leader attempts\nall followers converge to himself closer than that of the other. By using graph\ntheory and matrix theory, we formulate this conflict as a standard two-player\nzero-sum game and give some properties about it. It is noteworthy that the\ninteraction graph here is generated from the conflict between leaders.\nInterestingly, we find that to find the optimal topology of the system is\nequivalent to solve a Nash equilibrium. Especially for the case of choosing one\nconnected follower, the necessary and sufficient condition for an interaction\ngraph to be the optimal one is given. Moreover, if followers' interaction graph\nis a circulant graph or a graph with a center node, then the system's optimal\ntopology is obtained. Simulation examples are provided to validate the\neffectiveness of the theoretical results.\n", "versions": [{"version": "v1", "created": "Sun, 26 Oct 2014 13:29:18 GMT"}], "update_date": "2014-10-28", "authors_parsed": [["Ma", "Jingying", ""], ["Zheng", "Yuanshi", ""], ["Wu", "Bin", ""], ["Wang", "Long", ""]]}, {"id": "1410.7052", "submitter": "Stewart Ethier", "authors": "S. N. Ethier and Jiyeon Lee", "title": "On the three-person game baccara banque", "comments": "22 pages, 4 figures, and a 54-page appendix; new figure and minor\n  corrections in v2", "journal-ref": "Games 6 (2015) 57-78", "doi": null, "report-no": null, "categories": "math.OC cs.GT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Baccara banque is a three-person zero-sum game parameterized by\n$\\theta\\in(0,1)$. A study of the game by Downton and Lockwood claimed that the\nNash equilibrium is of only academic interest. Their preferred alternative is\nwhat we call the independent cooperative equilibrium. But this solution exists\nonly for certain $\\theta$. A third solution, which we call the correlated\ncooperative equilibrium, always exists. Under a \"with replacement\" assumption\nas well as a simplifying assumption concerning the information available to one\nof the players, we derive each of the three solutions for all $\\theta$.\n", "versions": [{"version": "v1", "created": "Sun, 26 Oct 2014 15:45:39 GMT"}, {"version": "v2", "created": "Fri, 14 Nov 2014 00:09:42 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Ethier", "S. N.", ""], ["Lee", "Jiyeon", ""]]}, {"id": "1410.7263", "submitter": "Changjun Wang", "authors": "Zhigang Cao, Xujin Chen, Xiaodong Hu, Changjun Wang", "title": "Pricing in Social Networks with Negative Externalities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problems of pricing an indivisible product to consumers who are\nembedded in a given social network. The goal is to maximize the revenue of the\nseller. We assume impatient consumers who buy the product as soon as the seller\nposts a price not greater than their values of the product. The product's value\nfor a consumer is determined by two factors: a fixed consumer-specified\nintrinsic value and a variable externality that is exerted from the consumer's\nneighbors in a linear way. We study the scenario of negative externalities,\nwhich captures many interesting situations, but is much less understood in\ncomparison with its positive externality counterpart. We assume complete\ninformation about the network, consumers' intrinsic values, and the negative\nexternalities. The maximum revenue is in general achieved by iterative pricing,\nwhich offers impatient consumers a sequence of prices over time.\n  We prove that it is NP-hard to find an optimal iterative pricing, even for\nunweighted tree networks with uniform intrinsic values. Complementary to the\nhardness result, we design a 2-approximation algorithm for finding iterative\npricing in general weighted networks with (possibly) nonuniform intrinsic\nvalues. We show that, as an approximation to optimal iterative pricing, single\npricing can work rather well for many interesting cases, but theoretically it\ncan behave arbitrarily bad.\n", "versions": [{"version": "v1", "created": "Mon, 27 Oct 2014 14:56:27 GMT"}, {"version": "v2", "created": "Sat, 7 Feb 2015 03:21:01 GMT"}], "update_date": "2015-02-10", "authors_parsed": [["Cao", "Zhigang", ""], ["Chen", "Xujin", ""], ["Hu", "Xiaodong", ""], ["Wang", "Changjun", ""]]}, {"id": "1410.7472", "submitter": "EPTCS", "authors": "Massimo Bartoletti (University of Cagliari), Tiziana Cimoli\n  (University of Cagliari), G. Michele Pinna (University of Cagliari)", "title": "A note on two notions of compliance", "comments": "In Proceedings ICE 2014, arXiv:1410.7013", "journal-ref": "EPTCS 166, 2014, pp. 86-93", "doi": "10.4204/EPTCS.166.9", "report-no": null, "categories": "cs.PL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish a relation between two models of contracts: binary session\ntypes, and a model based on event structures and game-theoretic notions. In\nparticular, we show that compliance in session types corresponds to the\nexistence of certain winning strategies in game-based contracts.\n", "versions": [{"version": "v1", "created": "Tue, 28 Oct 2014 00:41:47 GMT"}], "update_date": "2014-10-29", "authors_parsed": [["Bartoletti", "Massimo", "", "University of Cagliari"], ["Cimoli", "Tiziana", "", "University of Cagliari"], ["Pinna", "G. Michele", "", "University of Cagliari"]]}, {"id": "1410.8091", "submitter": "Luca Canzian", "authors": "Luca Canzian, Kun Zhao, Gerard C. L. Wong, Mihaela van der Schaar", "title": "A Dynamic Network Formation Model for Understanding Bacterial\n  Self-Organization into Micro-Colonies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.GT q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a general parametrizable model to capture the dynamic interaction\namong bacteria in the formation of micro-colonies. micro-colonies represent the\nfirst social step towards the formation of structured multicellular communities\nknown as bacterial biofilms, which protect the bacteria against antimicrobials.\nIn our model, bacteria can form links in the form of intercellular adhesins\n(such as polysaccharides) to collaborate in the production of resources that\nare fundamental to protect them against antimicrobials. Since maintaining a\nlink can be costly, we assume that each bacterium forms and maintains a link\nonly if the benefit received from the link is larger than the cost, and we\nformalize the interaction among bacteria as a dynamic network formation game.\nWe rigorously characterize some of the key properties of the network evolution\ndepending on the parameters of the system. In particular, we derive the\nparameters under which it is guaranteed that all bacteria will join\nmicro-colonies and the parameters under which it is guaranteed that some\nbacteria will not join micro-colonies. Importantly, our study does not only\ncharacterize the properties of networks emerging in equilibrium, but it also\nprovides important insights on how the network dynamically evolves and on how\nthe formation history impacts the emerging networks in equilibrium. This\nanalysis can be used to develop methods to influence on- the-fly the evolution\nof the network, and such methods can be useful to treat or prevent\nbiofilm-related diseases.\n", "versions": [{"version": "v1", "created": "Thu, 23 Oct 2014 19:20:43 GMT"}], "update_date": "2014-10-30", "authors_parsed": [["Canzian", "Luca", ""], ["Zhao", "Kun", ""], ["Wong", "Gerard C. L.", ""], ["van der Schaar", "Mihaela", ""]]}, {"id": "1410.8776", "submitter": "Nicolas Gensollen", "authors": "Nicolas Gensollen, Vincent Gauthier, Michel Marot and Monique Becker", "title": "Coalition Formation Algorithm of Prosumers in a Smart Grid Environment", "comments": "6 pages, 4 figures, 1 table. submited to ICC 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a smart grid environment, we study coalition formation of prosumers that\naim at entering the energy market. It is paramount for the grid operation that\nthe energy producers are able to sustain the grid demand in terms of stability\nand minimum production requirement. We design an algorithm that seeks to form\ncoalitions that will meet both of these requirements: a minimum energy level\nfor the coalitions and a steady production level which leads to finding\nuncorrelated sources of energy to form a coalition. We propose an algorithm\nthat uses graph tools such as correlation graphs or clique percolation to form\ncoalitions that meet such complex constraints. We validate the algorithm\nagainst a random procedure and show that, it not only performs better in term\nof social welfare for the power grid, but also that it is more robust against\nunforeseen production variations due to changing weather conditions for\ninstance.\n", "versions": [{"version": "v1", "created": "Fri, 31 Oct 2014 15:32:12 GMT"}], "update_date": "2014-11-03", "authors_parsed": [["Gensollen", "Nicolas", ""], ["Gauthier", "Vincent", ""], ["Marot", "Michel", ""], ["Becker", "Monique", ""]]}]