[{"id": "1806.00276", "submitter": "Paul Schmitt", "authors": "Paul Schmitt, Anne Edmundson, Nick Feamster", "title": "Oblivious DNS: Practical Privacy for DNS Queries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Virtually every Internet communication typically involves a Domain Name\nSystem (DNS) lookup for the destination server that the client wants to\ncommunicate with. Operators of DNS recursive resolvers---the machines that\nreceive a client's query for a domain name and resolve it to a corresponding IP\naddress---can learn significant information about client activity. Past work,\nfor example, indicates that DNS queries reveal information ranging from web\nbrowsing activity to the types of devices that a user has in their home.\nRecognizing the privacy vulnerabilities associated with DNS queries, various\nthird parties have created alternate DNS services that obscure a user's DNS\nqueries from his or her Internet service provider. Yet, these systems merely\ntransfer trust to a different third party. We argue that no single party ought\nto be able to associate DNS queries with a client IP address that issues those\nqueries. To this end, we present Oblivious DNS (ODNS), which introduces an\nadditional layer of obfuscation between clients and their queries. To do so,\nODNS uses its own authoritative namespace; the authoritative servers for the\nODNS namespace act as recursive resolvers for the DNS queries that they\nreceive, but they never see the IP addresses for the clients that initiated\nthese queries. We present an initial deployment of ODNS; our experiments show\nthat ODNS introduces minimal performance overhead, both for individual queries\nand for web page loads. We design ODNS to be compatible with existing DNS\nprotocols and infrastructure, and we are actively working on an open standard\nwith the IETF.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 10:35:12 GMT"}, {"version": "v2", "created": "Tue, 11 Dec 2018 17:32:09 GMT"}], "update_date": "2018-12-12", "authors_parsed": [["Schmitt", "Paul", ""], ["Edmundson", "Anne", ""], ["Feamster", "Nick", ""]]}, {"id": "1806.00459", "submitter": "Michael Tschantz", "authors": "Sadia Afroz, Mobin Javed, Vern Paxson, Shoaib Asif Qazi, Shaarif\n  Sajid, and Michael Carl Tschantz", "title": "A Bestiary of Blocking: The Motivations and Modes behind Website\n  Unavailability", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines different reasons the websites may vary in their\navailability by location. Prior works on availability mostly focus on\ncensorship by nation states. We look at three forms of server-side blocking:\nblocking visitors from the EU to avoid GDPR compliance, blocking based upon the\nvisitor's country, and blocking due to security concerns. We argue that these\nand other forms of blocking warrant more research.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 17:35:27 GMT"}], "update_date": "2018-06-04", "authors_parsed": [["Afroz", "Sadia", ""], ["Javed", "Mobin", ""], ["Paxson", "Vern", ""], ["Qazi", "Shoaib Asif", ""], ["Sajid", "Shaarif", ""], ["Tschantz", "Michael Carl", ""]]}, {"id": "1806.00669", "submitter": "Ziru Chen", "authors": "Ziru Chen, Zhao Chen, Lin X. Cai, Yu Cheng, and Ruoting Gong", "title": "A Stochastic Geometry Analysis of Energy Harvesting in Large Scale\n  Wireless Networks", "comments": "This paper has been accepted by Greencom 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the theoretical sustainable capacity of wireless networks with\nradio frequency (RF) energy harvesting is analytically studied. Specifically,\nwe consider a large scale wireless network where base stations (BSs) and low\npower wireless devices are deployed by homogeneous Poisson point process (PPP)\nwith different spatial densities. Wireless devices exploit the downlink\ntransmissions from the BSs for either information delivery or energy\nharvesting. Generally, a BS schedules downlink transmission to wireless\ndevices. The scheduled device receives the data information while other devices\nharvest energy from the downlink signals. The data information can be\nsuccessfully received by the scheduled device only if the device has sufficient\nenergy for data processing, i.e., the harvested energy is larger than a\nthreshold. Given the densities of BSs and users, we apply stochastic geometry\nto analyze the expected number of users per cell and the successful information\ndelivery probability of a wireless device, based on which the total network\nthroughput can be derived. It is shown that the maximum network throughput per\ncell can be achieved under the optimal density of BSs. Extensive simulations\nvalidate the analysis.\n", "versions": [{"version": "v1", "created": "Sat, 2 Jun 2018 17:03:04 GMT"}], "update_date": "2018-06-05", "authors_parsed": [["Chen", "Ziru", ""], ["Chen", "Zhao", ""], ["Cai", "Lin X.", ""], ["Cheng", "Yu", ""], ["Gong", "Ruoting", ""]]}, {"id": "1806.00676", "submitter": "Kav\\'e Salamatian", "authors": "Loqman Salamatian, Dali Kaafar, Kav\\'e Salamatian", "title": "A Geometric Approach for Real-time Monitoring of Dynamic Large Scale\n  Graphs: AS-level graphs illustrated", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.SI math.DG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The monitoring of large dynamic networks is a major chal- lenge for a wide\nrange of application. The complexity stems from properties of the underlying\ngraphs, in which slight local changes can lead to sizable variations of global\nprop- erties, e.g., under certain conditions, a single link cut that may be\noverlooked during monitoring can result in splitting the graph into two\ndisconnected components. Moreover, it is often difficult to determine whether a\nchange will propagate globally or remain local. Traditional graph theory\nmeasure such as the centrality or the assortativity of the graph are not\nsatisfying to characterize global properties of the graph. In this paper, we\ntackle the problem of real-time monitoring of dynamic large scale graphs by\ndeveloping a geometric approach that leverages notions of geometric curvature\nand recent development in graph embeddings using Ollivier-Ricci curvature [47].\nWe illustrate the use of our method by consid- ering the practical case of\nmonitoring dynamic variations of global Internet using topology changes\ninformation provided by combining several BGP feeds. In particular, we use our\nmethod to detect major events and changes via the geometry of the embedding of\nthe graph.\n", "versions": [{"version": "v1", "created": "Sat, 2 Jun 2018 17:32:50 GMT"}], "update_date": "2018-06-05", "authors_parsed": [["Salamatian", "Loqman", ""], ["Kaafar", "Dali", ""], ["Salamatian", "Kavé", ""]]}, {"id": "1806.00750", "submitter": "Mohamed Grissa", "authors": "Mohamed Grissa, Bechir Hamdaoui and Attila A. Yavuz", "title": "Location Privacy in Cognitive Radio Networks: A Survey", "comments": "Published in IEEE Communications Surveys and Tutorials", "journal-ref": "IEEE Communications Surveys & Tutorials, vol. 19, no. 3, pp.\n  1726-1760, thirdquarter 2017", "doi": "10.1109/COMST.2017.2693965", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cognitive radio networks (CRNs) have emerged as an essential technology to\nenable dynamic and opportunistic spectrum access which aims to exploit\nunderutilized licensed channels to solve the spectrum scarcity problem. Despite\nthe great benefits that CRNs offer in terms of their ability to improve\nspectrum utilization efficiency, they suffer from user location privacy issues.\nKnowing that their whereabouts may be exposed can discourage users from joining\nand participating in the CRNs, thereby potentially hindering the adoption and\ndeployment of this technology in future generation networks. The location\ninformation leakage issue in the CRN context has recently started to gain\nattention from the research community due to its importance, and several\nresearch efforts have been made to tackle it. However, to the best of our\nknowledge, none of these works have tried to identify the vulnerabilities that\nare behind this issue or discuss the approaches that could be deployed to\nprevent it. In this paper, we try to fill this gap by providing a comprehensive\nsurvey that investigates the various location privacy risks and threats that\nmay arise from the different components of this CRN technology, and explores\nthe different privacy attacks and countermeasure solutions that have been\nproposed in the literature to cope with this location privacy issue. We also\ndiscuss some open research problems, related to this issue, that need to be\novercome by the research community to take advantage of the benefits of this\nkey CRN technology without having to sacrifice the users' privacy.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jun 2018 08:19:38 GMT"}], "update_date": "2018-06-05", "authors_parsed": [["Grissa", "Mohamed", ""], ["Hamdaoui", "Bechir", ""], ["Yavuz", "Attila A.", ""]]}, {"id": "1806.00916", "submitter": "Mohamed Grissa", "authors": "Mohamed Grissa, Attila A. Yavuz and Bechir Hamdaoui", "title": "Preserving the Location Privacy of Secondary Users in Cooperative\n  Spectrum Sensing", "comments": "Published in IEEE Transactions on Information Forensics and Security,\n  14 pages, 7 figures", "journal-ref": "IEEE Transactions On Information Forensics and Security, Vol. 12,\n  No. 2, February 2017", "doi": "10.1109/TIFS.2016.2622000", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperative spectrum sensing, despite its effectiveness in enabling dynamic\nspectrum access, suffers from location privacy threats, merely because\nsecondary users (SUs)' sensing reports that need to be shared with a fusion\ncenter to make spectrum availability decisions are highly correlated to the\nusers' locations. It is therefore important that cooperative spectrum sensing\nschemes be empowered with privacy preserving capabilities so as to provide SUs\nwith incentives for participating in the sensing task. In this paper, we\npropose privacy preserving protocols that make use of various cryptographic\nmechanisms to preserve the location privacy of SUs while performing reliable\nand efficient spectrum sensing. We also present cost-performance tradeoffs. The\nfirst consists on using an additional architectural entity at the benefit of\nincurring lower computation overhead by relying only on symmetric cryptography.\nThe second consists on using an additional secure comparison protocol at the\nbenefit of incurring lesser architectural cost by not requiring extra entities.\nOur schemes can also adapt to the case of a malicious fusion center as we\ndiscuss in this paper. We also show that not only are our proposed schemes\nsecure and more efficient than existing alternatives, but also achieve fault\ntolerance and are robust against sporadic network topological changes.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 01:36:48 GMT"}], "update_date": "2018-06-05", "authors_parsed": [["Grissa", "Mohamed", ""], ["Yavuz", "Attila A.", ""], ["Hamdaoui", "Bechir", ""]]}, {"id": "1806.01035", "submitter": "Apostolos Avranas Mr", "authors": "Marios Kountouris, Apostolos Avranas", "title": "Delay Performance of Multi-Antenna Multicasting in Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Low-latency communication is currently attracting significant attention due\nto the emergence of mission-critical Internet of Things (IoT) applications and\ncontent-centric services. A deep understanding of the delay performance is\nessential for efficient wireless system design and end-to-end latency\nguarantees. In this paper, we investigate the network-layer performance of\nphysical layer multi-antenna multicasting, i.e., when the same data is\nsimultaneously conveyed to multiple users. We provide a statistical\ncharacterization of the service process in terms of its Mellin transform and\nderive probabilistic delay bounds using tools from stochastic network calculus.\nFurthermore, using extreme value theory, we characterize the service process\nfor very large number of users and derive scaling laws as the number of\nantennas and/or users is taken to infinity. Our results can be used for system\ndimensioning to guarantee the delay requirements in wireless multicast\nnetworks.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 10:02:25 GMT"}], "update_date": "2018-06-05", "authors_parsed": [["Kountouris", "Marios", ""], ["Avranas", "Apostolos", ""]]}, {"id": "1806.01091", "submitter": "Udo Schilcher", "authors": "Udo Schilcher, Jorge F. Schmidt, Mahin K. Atiq, and Christian\n  Bettstetter", "title": "Auto-Correlation and Coherence Time of Interference in Poisson Networks", "comments": null, "journal-ref": null, "doi": "10.1109/TMC.2019.2912373", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamics of interference over space and time influences the performance\nof wireless communication systems, yet its features are still not fully\nunderstood. This article analyzes the temporal dynamics of the interference in\nPoisson networks accounting for three key correlation sources: the location of\nnodes, the wireless channel, and the network traffic. We derive expressions for\nthe auto-correlation function of interference. These are presented as a\nframework that enables us to arbitrarily combine the three correlation sources\nto match a wide range of interference scenarios. We then introduce the\ninterference coherence time - analogously to the well-known channel coherence\ntime - and analyze its features for each correlation source. We find that the\ncoherence time behaves very different for the different interference scenarios\nconsidered and depends on the network parameters. Having accurate knowledge of\nthe coherence time can thus be an important design input for protocols, e.g.,\nretransmission and medium access control.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 13:12:46 GMT"}], "update_date": "2019-04-26", "authors_parsed": [["Schilcher", "Udo", ""], ["Schmidt", "Jorge F.", ""], ["Atiq", "Mahin K.", ""], ["Bettstetter", "Christian", ""]]}, {"id": "1806.01156", "submitter": "Victor Le Pochat", "authors": "Victor Le Pochat, Tom Van Goethem, Samaneh Tajalizadehkhoob, Maciej\n  Korczy\\'nski and Wouter Joosen", "title": "Tranco: A Research-Oriented Top Sites Ranking Hardened Against\n  Manipulation", "comments": "Our online service providing the Tranco ranking is available at\n  https://tranco-list.eu", "journal-ref": "Proceedings of the 26th Annual Network and Distributed System\n  Security Symposium (NDSS), 2019", "doi": "10.14722/ndss.2019.23386", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to evaluate the prevalence of security and privacy practices on a\nrepresentative sample of the Web, researchers rely on website popularity\nrankings such as the Alexa list. While the validity and representativeness of\nthese rankings are rarely questioned, our findings show the contrary: we show\nfor four main rankings how their inherent properties (similarity, stability,\nrepresentativeness, responsiveness and benignness) affect their composition and\ntherefore potentially skew the conclusions made in studies. Moreover, we find\nthat it is trivial for an adversary to manipulate the composition of these\nlists. We are the first to empirically validate that the ranks of domains in\neach of the lists are easily altered, in the case of Alexa through as little as\na single HTTP request. This allows adversaries to manipulate rankings on a\nlarge scale and insert malicious domains into whitelists or bend the outcome of\nresearch studies to their will. To overcome the limitations of such rankings,\nwe propose improvements to reduce the fluctuations in list composition and\nguarantee better defenses against manipulation. To allow the research community\nto work with reliable and reproducible rankings, we provide Tranco, an improved\nranking that we offer through an online service available at\nhttps://tranco-list.eu.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 15:10:27 GMT"}, {"version": "v2", "created": "Thu, 1 Nov 2018 17:47:21 GMT"}, {"version": "v3", "created": "Mon, 17 Dec 2018 14:35:30 GMT"}], "update_date": "2018-12-18", "authors_parsed": [["Pochat", "Victor Le", ""], ["Van Goethem", "Tom", ""], ["Tajalizadehkhoob", "Samaneh", ""], ["Korczyński", "Maciej", ""], ["Joosen", "Wouter", ""]]}, {"id": "1806.01444", "submitter": "Cenk G\\\"undo\\u{g}an", "authors": "Cenk G\\\"undo\\u{g}an, Peter Kietzmann, Martine Lenders, Hauke Petersen,\n  Thomas C. Schmidt, Matthias W\\\"ahlisch", "title": "NDN, CoAP, and MQTT: A Comparative Measurement Study in the IoT", "comments": null, "journal-ref": "Proceedings of ACM ICN 2018", "doi": "10.1145/3267955.3267967", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper takes a comprehensive view on the protocol stacks that are under\ndebate for a future Internet of Things (IoT). It addresses the holistic\nquestion of which solution is beneficial for common IoT use cases. We deploy\nNDN and the two popular IP-based application protocols, CoAP and MQTT, in its\ndifferent variants on a large-scale IoT testbed in single- and multi-hop\nscenarios. We analyze the use cases of scheduled periodic and unscheduled\ntraffic under varying loads. Our findings indicate that (a) NDN admits the most\nresource-friendly deployment on nodes, and (b) shows superior robustness and\nresilience in multi-hop scenarios, while (c) the IP protocols operate at less\noverhead and higher speed in single-hop deployments. Most strikingly we find\nthat NDN-based protocols are in significantly better flow balance than the\nUDP-based IP protocols and require less corrective actions.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2018 00:26:56 GMT"}, {"version": "v2", "created": "Thu, 7 Jun 2018 11:26:38 GMT"}, {"version": "v3", "created": "Fri, 28 Sep 2018 02:18:36 GMT"}], "update_date": "2018-10-01", "authors_parsed": [["Gündoğan", "Cenk", ""], ["Kietzmann", "Peter", ""], ["Lenders", "Martine", ""], ["Petersen", "Hauke", ""], ["Schmidt", "Thomas C.", ""], ["Wählisch", "Matthias", ""]]}, {"id": "1806.01479", "submitter": "Bassem Khalfi", "authors": "Bassem Khalfi, Bechir Hamdaoui, Mohsen Guizani, Nizar Zorba", "title": "Exploiting wideband spectrum occupancy heterogeneity for weighted\n  compressive spectrum sensing", "comments": "6 pages, 5 figures, IEEE Conference on Computer Communications\n  Workshops (INFOCOM WKSHPS)", "journal-ref": "IEEE Conference on Computer Communications Workshops (INFOCOM\n  WKSHPS), Atlanta, GA, 2017, pp. 613-618", "doi": "10.1109/INFCOMW.2017.8116447", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Compressive sampling has shown great potential for making wideband spectrum\nsensing possible at sub-Nyquist sampling rates. As a result, there have\nrecently been research efforts that aimed to develop techniques that leverage\ncompressive sampling to enable compressed wideband spectrum sensing. These\ntechniques consider homogeneous wideband spectrum where all bands are assumed\nto have similar PU traffic characteristics. In practice, however, wideband\nspectrum is not homogeneous, in that different spectrum bands could have\ndifferent PU occupancy patterns. In fact, the nature of spectrum assignment, in\nwhich applications of similar types are often assigned bands within the same\nblock, dictates that wideband spectrum is indeed heterogeneous, as different\napplication types exhibit different behaviors. In this paper, we consider\nheterogeneous wideband spectrum, where we exploit this inherent, block-like\nstructure of wideband spectrum to design efficient compressive spectrum sensing\ntechniques that are well suited for heterogeneous wideband spectrum. We propose\na weighted $\\ell_1$-minimization sensing information recovery algorithm that\nachieves more stable recovery than that achieved by existing approaches while\naccounting for the variations of spectrum occupancy across both the time and\nfrequency dimensions. Through intensive numerical simulations, we show that our\napproach achieves better performance when compared to the state-of-the-art\napproaches.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2018 03:27:22 GMT"}], "update_date": "2018-06-06", "authors_parsed": [["Khalfi", "Bassem", ""], ["Hamdaoui", "Bechir", ""], ["Guizani", "Mohsen", ""], ["Zorba", "Nizar", ""]]}, {"id": "1806.01594", "submitter": "Minseok Choi", "authors": "Minseok Choi, Joongheon Kim and Jaekyun Moon", "title": "Wireless Video Caching and Dynamic Streaming under Differentiated\n  Quality Requirements", "comments": "13 pages, 11 figures, accepted for publication in IEEE Journal on\n  Selected Areas in Communications", "journal-ref": "IEEE JSAC 36 (2018) 1245-1257", "doi": "10.1109/JSAC.2018.2844980", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers one-hop device-to-device (D2D)-assisted wireless caching\nnetworks that cache video files of varying quality levels, with the assumption\nthat the base station can control the video quality but cache-enabled devices\ncannot. Two problems arise in such a caching network: file placement problem\nand node association problem. This paper suggests a method to cache videos of\ndifferent qualities, and thus of varying file sizes, by maximizing the sum of\nvideo quality measures that users can enjoy. There exists an interesting\ntrade-off between video quality and video diversity, i.e., the ability to\nprovision diverse video files. By caching high-quality files, the cache-enabled\ndevices can provide high-quality video, but cannot cache a variety of files.\nConversely, when the device caches various files, it cannot provide a good\nquality for file-requesting users. In addition, when multiple devices cache the\nsame file but their qualities are different, advanced node association is\nrequired for file delivery. This paper proposes a node association algorithm\nthat maximizes time-averaged video quality for multiple users under a playback\ndelay constraint. In this algorithm, we also consider request collision, the\nsituation where several users request files from the same device at the same\ntime, and we propose two ways to cope with the collision: scheduling of one\nuser and non-orthogonal multiple access. Simulation results verify that the\nproposed caching method and the node association algorithm work reliably.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2018 10:16:57 GMT"}], "update_date": "2018-09-26", "authors_parsed": [["Choi", "Minseok", ""], ["Kim", "Joongheon", ""], ["Moon", "Jaekyun", ""]]}, {"id": "1806.01633", "submitter": "Oliver Gasser", "authors": "Oliver Gasser, Quirin Scheitle, Pawel Foremski, Qasim Lone, Maciej\n  Korczynski, Stephen D. Strowes, Luuk Hendriks, Georg Carle", "title": "Clusters in the Expanse: Understanding and Unbiasing IPv6 Hitlists", "comments": "See https://ipv6hitlist.github.io for daily IPv6 hitlists, historical\n  data, and additional analyses", "journal-ref": "Proceedings of the 2018 Internet Measurement Conference (IMC '18)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network measurements are an important tool in understanding the Internet. Due\nto the expanse of the IPv6 address space, exhaustive scans as in IPv4 are not\npossible for IPv6. In recent years, several studies have proposed the use of\ntarget lists of IPv6 addresses, called IPv6 hitlists.\n  In this paper, we show that addresses in IPv6 hitlists are heavily clustered.\nWe present novel techniques that allow IPv6 hitlists to be pushed from quantity\nto quality. We perform a longitudinal active measurement study over 6 months,\ntargeting more than 50 M addresses. We develop a rigorous method to detect\naliased prefixes, which identifies 1.5 % of our prefixes as aliased, pertaining\nto about half of our target addresses. Using entropy clustering, we group the\nentire hitlist into just 6 distinct addressing schemes. Furthermore, we perform\nclient measurements by leveraging crowdsourcing.\n  To encourage reproducibility in network measurement research and to serve as\na starting point for future IPv6 studies, we publish source code, analysis\ntools, and data.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2018 12:27:17 GMT"}, {"version": "v2", "created": "Fri, 28 Sep 2018 11:58:50 GMT"}], "update_date": "2018-10-01", "authors_parsed": [["Gasser", "Oliver", ""], ["Scheitle", "Quirin", ""], ["Foremski", "Pawel", ""], ["Lone", "Qasim", ""], ["Korczynski", "Maciej", ""], ["Strowes", "Stephen D.", ""], ["Hendriks", "Luuk", ""], ["Carle", "Georg", ""]]}, {"id": "1806.01737", "submitter": "Adnan Aijaz", "authors": "M. Omar Al-Kadri, Adnan Aijaz, Arumugam Nallanathan", "title": "X-FDR: A Cross-Layer Routing Protocol for Multi-hop Full-Duplex Wireless\n  Networks", "comments": "IEEE Wireless Communications - Accepted for Publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recent developments in self-interference (SI) cancellation techniques\nhave led to the practical realization of full-duplex (FD) radios that can\nperform simultaneous transmission and reception. FD technology is attractive\nfor various legacy communications standards. In this paper, after discussing\nthe opportunities of FD technology at the network layer, we present a\ncross-layer aided routing protocol, termed as X-FDR, for multi-hop FD wireless\nnetworks. X-FDR exploits a Physical (PHY) layer model capturing imperfection of\nSI cancellation. At the medium access control (MAC) layer, X-FDR adopts an\noptimized MAC protocol which implements a power control mechanism without\ncreating the hidden terminal problem. X-FDR exploits the unique characteristics\nof FD technology at the network layer to construct energy-efficient and low\nend-to-end latency routes in the network. Performance evaluation demonstrates\nthe effectiveness of X-FDR in achieving the gains of FD at higher layers of the\nprotocol stack.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2018 15:06:10 GMT"}], "update_date": "2018-06-06", "authors_parsed": [["Al-Kadri", "M. Omar", ""], ["Aijaz", "Adnan", ""], ["Nallanathan", "Arumugam", ""]]}, {"id": "1806.01792", "submitter": "Christos Liaskos K.", "authors": "Christos Liaskos, Shuai Nie, Ageliki Tsioliaridou, Andreas\n  Pitsillides, Sotiris Ioannidis, Ian Akyildiz", "title": "A New Wireless Communication Paradigm through Software-controlled\n  Metasurfaces", "comments": "Paper accepted for publication at the IEEE Communications Magazine.\n  This work was funded by the European Union via the Horizon 2020: Future\n  Emerging Topics call (FETOPEN-RIA), grant EU736876, project VISORSURF:\n  HyperSurfaces-A Hardware Platform for Software-driven Functional Metasurfaces\n  (http://www.visorsurf.eu/)", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.ET cs.NI cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electromagnetic waves undergo multiple uncontrollable alterations as they\npropagate within a wireless environment. Free space path loss, signal\nabsorption, as well as reflections, refractions and diffractions caused by\nphysical objects within the environment highly affect the performance of\nwireless communications. Currently, such effects are intractable to account for\nand are treated as probabilistic factors. The paper proposes a radically\ndifferent approach, enabling deterministic, programmable control over the\nbehavior of the wireless environments. The key-enabler is the so-called\nHyperSurface tile, a novel class of planar meta-materials which can interact\nwith impinging electromagnetic waves in a controlled manner. The HyperSurface\ntiles can effectively re-engineer electromagnetic waves, including steering\ntowards any desired direction, full absorption, polarization manipulation and\nmore. Multiple tiles are employed to coat objects such as walls, furniture,\noverall, any objects in the indoor and outdoor environments. An external\nsoftware service calculates and deploys the optimal interaction types per tile,\nto best fit the needs of communicating devices. Evaluation via simulations\nhighlights the potential of the new concept.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 08:10:57 GMT"}], "update_date": "2018-06-06", "authors_parsed": [["Liaskos", "Christos", ""], ["Nie", "Shuai", ""], ["Tsioliaridou", "Ageliki", ""], ["Pitsillides", "Andreas", ""], ["Ioannidis", "Sotiris", ""], ["Akyildiz", "Ian", ""]]}, {"id": "1806.01885", "submitter": "Garegin Grigoryan", "authors": "Garegin Grigoryan, Yaoqing Liu, Laurent Njilla, Charles Kamhoua, Kevin\n  Kwiat", "title": "Enabling Cooperative IoT Security via Software Defined Networks (SDN)", "comments": "IEEE ICC 2018", "journal-ref": "2018 IEEE International Conference on Communications (ICC)", "doi": "10.1109/ICC.2018.8423017", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet of Things (IoT) is becoming an increasingly attractive target for\ncybercriminals. We observe that many attacks to IoTs are launched in a\ncollusive way, such as brute-force hacking usernames and passwords, to target\nat a particular victim. However, most of the time our defending mechanisms to\nsuch kind of attacks are carried out individually and independently, which\nleads to ineffective and weak defense. To this end, we propose to leverage\nSoftware Defined Networks (SDN) to enable cooperative security for legacy\nIP-based IoT devices. SDN decouples control plane and data plane, and can help\nbridge the knowledge divided between the application and network layers. In\nthis paper, we discuss the IoT security problems and challenges, and present an\nSDN-based architecture to enable IoT security in a cooperative manner.\nFurthermore, we implemented a platform that can quickly share the attacking\ninformation with peer controllers and block the attacks. We carried out our\nexperiments in both virtual and physical SDN environments with OpenFlow\nswitches. Our evaluation results show that both environments can scale well to\nhandle attacks, but hardware implementation is much more efficient than a\nvirtual one.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2018 18:42:29 GMT"}], "update_date": "2018-08-03", "authors_parsed": [["Grigoryan", "Garegin", ""], ["Liu", "Yaoqing", ""], ["Njilla", "Laurent", ""], ["Kamhoua", "Charles", ""], ["Kwiat", "Kevin", ""]]}, {"id": "1806.01905", "submitter": "Michail Fasoulakis", "authors": "Michail Fasoulakis, Eirini-Eleni Tsiropoulou, Symeon Papavassiliou", "title": "A New Theoretical Evaluation Framework for Satisfaction Equilibria in\n  Wireless Networks", "comments": "A version of this paper was accepted for publication in BalkanCom\n  2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a theoretical evaluation framework regarding the\n\\textit{Satisfaction Equilibrium (SE)} in wireless communication networks is\nintroduced and examined. To study these equilibria operation points, we coin\nsome new concepts, namely the \\textit{Valued Satisfaction Equilibrium}, the\n\\textit{Price of Efficiency} and the \\textit{Max Price of Satisfaction}, which\ncan be used for measuring the efficiency of the obtained equilibria solutions.\nThe aforementioned framework is analyzed and evaluated in a wireless\ncommunication environment under the presence of the Gaussian Interference\nchannel (GIC). Within this setting, a non-cooperative game among the users is\nstudied, where users aim in a selfish manner to meet their Quality of Service\n(QoS) prerequisite. However instead of maximizing the QoS which is generally\nenergy costly, we evangelize that better energy-efficiency is achieved by\ntargeting satisfactory QoS levels only. The sufficient and necessary conditions\nthat lead to the \\textit{Satisfaction Equilibrium} are provided for the\ntwo-user case and the \\textit{Efficient Satisfaction Equilibrium (ESE)} is\ndetermined, where the users satisfy their QoS constraints with the lowest\npossible cost. Moreover, specific measures for evaluating the efficiency of\nvarious satisfaction equilibria, in a formal and quantitative manner,\nexpressing the tradeoff with respect to the achieved utility or a given\nobjective function and corresponding cost, are defined and analyzed.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2018 19:28:52 GMT"}], "update_date": "2018-06-07", "authors_parsed": [["Fasoulakis", "Michail", ""], ["Tsiropoulou", "Eirini-Eleni", ""], ["Papavassiliou", "Symeon", ""]]}, {"id": "1806.02000", "submitter": "Moin Nadeem", "authors": "Moin Nadeem, Vibhor Nigam, Dimosthenis Anagnostopoulos, Patrick\n  Carretas", "title": "Automating Network Error Detection using Long-Short Term Memory Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we investigate the current flaws with identifying\nnetwork-related errors, and examine how K-Means and Long-Short Term Memory\nNetworks solve these problems. We demonstrate that K-Means is able to classify\nmessages, but not necessary provide meaningful clusters. However, Long-Short\nTerm Memory Networks are able to meet our goals of providing an intelligent\nclustering of messages by grouping messages that are temporally related.\nAdditionally, Long-Short Term Memory Networks can provide the ability to\nunderstand and visualize temporal causality, which unlocks the ability to warn\nabout errors before they happen. We show that LSTMs have a 70% accuracy on\nclassifying network errors, and provide some suggestions on future work.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jun 2018 04:00:08 GMT"}], "update_date": "2018-06-07", "authors_parsed": [["Nadeem", "Moin", ""], ["Nigam", "Vibhor", ""], ["Anagnostopoulos", "Dimosthenis", ""], ["Carretas", "Patrick", ""]]}, {"id": "1806.02055", "submitter": "Hazem Sallouha", "authors": "Hazem Sallouha, Mohammad Mahdi Azari, and Sofie Pollin", "title": "Energy-Constrained UAV Trajectory Design for Ground Node Localization", "comments": "This work has been submitted to IEEE Globecom 2018 for possible\n  publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of aerial anchors for localizing terrestrial nodes has recently been\nrecognized as a cost-effective, swift and flexible solution for better\nlocalization accuracy, providing localization services when the GPS is jammed\nor satellite reception is not possible. In this paper, the localization of\nterrestrial nodes when using mobile unmanned aerial vehicles (UAVs) as aerial\nanchors is presented. We propose a novel framework to derive localization error\nin urban areas. In contrast to the existing works, our framework includes\nheight-dependent UAV to ground channel characteristics and a highly detailed\nUAV energy consumption model. This enables us to explore different tradeoffs\nand optimize UAV trajectory for minimum localization error. In particular, we\ninvestigate the impact of UAV altitude, hovering time, number of waypoints and\npath length through formulating an energy-constrained optimization problem. Our\nresults show that increasing the hovering time decreases the localization error\nconsiderably at the cost of a higher energy consumption. To keep the\nlocalization error below 100m, shorter hovering is only possible when the path\naltitude and radius are optimized. For a constant hovering time of 5 seconds,\ntuning both parameters to their optimal values brings the localization error\nfrom 150m down to 65m with a power saving around 25%\n", "versions": [{"version": "v1", "created": "Wed, 6 Jun 2018 08:21:49 GMT"}], "update_date": "2018-06-07", "authors_parsed": [["Sallouha", "Hazem", ""], ["Azari", "Mohammad Mahdi", ""], ["Pollin", "Sofie", ""]]}, {"id": "1806.02088", "submitter": "Alessandro Guidotti", "authors": "A. Guidotti, A. Vanelli-Coralli, M. Conti, S. Andrenacci, S.\n  Chatzinotas, N. Maturo, B. Evans, A. Awoseyila, A. Ugolini, T. Foggi, L.\n  Gaudio, N. Alagha, S. Cioni", "title": "Architectures and Key Technical Challenges for 5G Systems Incorporating\n  Satellites", "comments": "Submitted to Transactions on Vehicular Technologies, April 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Satellite Communication systems are a promising solution to extend and\ncomplement terrestrial networks in unserved or under-served areas. This aspect\nis reflected by recent commercial and standardisation endeavours. In\nparticular, 3GPP recently initiated a Study Item for New Radio-based, i.e., 5G,\nNon-Terrestrial Networks aimed at deploying satellite systems either as a\nstand-alone solution or as an integration to terrestrial networks in mobile\nbroadband and machine-type communication scenarios. However, typical satellite\nchannel impairments, as large path losses, delays, and Doppler shifts, pose\nsevere challenges to the realisation of a satellite-based NR network. In this\npaper, based on the architecture options currently being discussed in the\nstandardisation fora, we discuss and assess the impact of the satellite channel\ncharacteristics on the physical and Medium Access Control layers, both in terms\nof transmitted waveforms and procedures for enhanced Mobile BroadBand (eMBB)\nand NarrowBand-Internet of Things (NB-IoT) applications. The proposed analysis\nshows that the main technical challenges are related to the PHY/MAC procedures,\nin particular Random Access (RA), Timing Advance (TA), and Hybrid Automatic\nRepeat reQuest (HARQ) and, depending on the considered service and\narchitecture, different solutions are proposed.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jun 2018 09:33:40 GMT"}], "update_date": "2018-06-07", "authors_parsed": [["Guidotti", "A.", ""], ["Vanelli-Coralli", "A.", ""], ["Conti", "M.", ""], ["Andrenacci", "S.", ""], ["Chatzinotas", "S.", ""], ["Maturo", "N.", ""], ["Evans", "B.", ""], ["Awoseyila", "A.", ""], ["Ugolini", "A.", ""], ["Foggi", "T.", ""], ["Gaudio", "L.", ""], ["Alagha", "N.", ""], ["Cioni", "S.", ""]]}, {"id": "1806.02410", "submitter": "Sotiris Angelos Lenas Dr", "authors": "Sotiris Lenas, Vassilis Tsaoussidis, Srikanth Sundaresan, Arjuna\n  Sathiaseelan and Jon Crowcroft", "title": "On the Impact of Guest Traffic in Open-Access Domestic Broadband Sharing\n  Schemes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Open-access domestic broadband connection sharing constitutes a voluntary\npractice that is associated with societal, economic and public-safety benefits.\nDespite this fact, broadband subscribers are usually hesitant to freely share\ntheir broadband connection with guests for a multitude of reasons; one of them\nbeing sharing their network might hinder their own broadband quality of\nexperience. In this paper, we investigate experimentally the impact of uplink\nguest traffic on the sharer's broadband quality of experience under both\ngeneric and broadband-sharing-specific packet scheduling policies. Both\nguest-user traffic and access point profiles employed in our study are\ndeveloped by analyzing real-world traffic traces and measurements, captured\nfrom actual broadband sharing networking environments. Our results validate the\nsuitability of hybrid packet scheduling policies for broadband sharing schemes\nand show that only a few dozen kilobytes per second of uplink guest traffic can\nbe tolerated by sharers without hampering their broadband quality of\nexperience. In this context, we show that the selection of the most appropriate\npacket scheduling policy for broadband sharing, as well as its respective\nconfiguration, depend largely on the capacity of the broadband connection and\nthe policy's packet-dropping behavior on guest traffic.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jun 2018 20:21:23 GMT"}], "update_date": "2018-06-08", "authors_parsed": [["Lenas", "Sotiris", ""], ["Tsaoussidis", "Vassilis", ""], ["Sundaresan", "Srikanth", ""], ["Sathiaseelan", "Arjuna", ""], ["Crowcroft", "Jon", ""]]}, {"id": "1806.02474", "submitter": "Sathiya Kumaran Mani", "authors": "Sathiya Kumaran Mani, Ramakrishnan Durairajan, Paul Barford, Joel\n  Sommers", "title": "A System for Clock Synchronization in an Internet of Things", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Synchronizing clocks on Internet of Things (IoT) devices is important for\napplications such as monitoring and real time control. In this paper, we\ndescribe a system for clock synchronization in IoT devices that is designed to\nbe scalable, flexibly accommodate diverse hardware, and maintain tight\nsynchronization over a range of operating conditions. We begin by examining\nclock drift on two standard IoT prototyping platforms. We observe clock drift\non the order of seconds over relatively short time periods, as well as poor\nclock rate stability, each of which make standard synchronization protocols\nineffective. To address this problem, we develop a synchronization system,\nwhich includes a lightweight client, a new packet exchange protocol called SPoT\nand a scalable reference server. We evaluate the efficacy of our system over a\nrange of configurations, operating conditions and target platforms. We find\nthat SPoT performs synchronization 22x and 17x more accurately than MQTT and\nSNTP, respectively, at high noise levels, and maintains a clock accuracy of\nwithin ~15ms at various noise levels. Finally, we report on the scalability of\nour server implementation through microbenchmark and wide area experiments,\nwhich show that our system can scale to support large numbers of clients\nefficiently.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 00:49:34 GMT"}], "update_date": "2018-06-08", "authors_parsed": [["Mani", "Sathiya Kumaran", ""], ["Durairajan", "Ramakrishnan", ""], ["Barford", "Paul", ""], ["Sommers", "Joel", ""]]}, {"id": "1806.02493", "submitter": "Xiaohu Ge", "authors": "Xiaohu Ge, Yang Sun, Hamid Gharavi, John Thompson", "title": "Joint Optimization of Computation and Communication Power in Multi-user\n  Massive MIMO Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the growing interest in the deployment of massive\nmultiple-input-multiple-output (MIMO) systems and millimeter wave technology\nfor fifth generation (5G) wireless systems, the computation power to the total\npower consumption ratio is expected to increase rapidly due to high data\ntraffic processing at the baseband unit. Therefore in this paper, a joint\noptimization problem of computation and communication power is formulated for\nmulti-user massive MIMO systems with partially-connected structures of radio\nfrequency (RF) transmission systems. When the computation power is considered\nfor massiv MIMO systems, the results of this paper reveal that the energy\nefficiency of massive MIMO systems decreases with increasing the number of\nantennas and RF chains, which is contrary with the conventional energy\nefficiency analysis results of massive MIMO systems, i.e., only communication\npower is considered. To optimize the energy efficiency of multi-user massive\nMIMO systems, an upper bound on energy efficiency is derived. Considering the\nconstraints on partially-connected structures, a suboptimal solution consisting\nof baseband and RF precoding matrices is proposed to approach the upper bound\non energy efficiency of multi-user massive MIMO systems. Furthermore, an\noPtimized Hybrid precOding with computation and commuNication powEr (PHONE)\nalgorithm is developed to realize the joint optimization of computation and\ncommunication power. Simulation results indicate that the proposed algorithm\nimproves energy and cost efficiencies and the maximum power saving is achieved\nby 76.59\\% for multi-user massive MIMO systems with partially-connected\nstructures.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 02:56:03 GMT"}], "update_date": "2018-06-08", "authors_parsed": [["Ge", "Xiaohu", ""], ["Sun", "Yang", ""], ["Gharavi", "Hamid", ""], ["Thompson", "John", ""]]}, {"id": "1806.02628", "submitter": "Paolo Casari", "authors": "Roee Diamant, Paolo Casari, Stefano Tomasin", "title": "Cooperative Authentication in Underwater Acoustic Sensor Networks", "comments": "Author version of paper accepted for publication in the IEEE\n  Transactions on Wireless Communications", "journal-ref": null, "doi": "10.1109/TWC.2018.2886896", "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the growing use of underwater acoustic communications (UWAC) for both\nindustrial and military operations, there is a need to ensure communication\nsecurity. A particular challenge is represented by underwater acoustic networks\n(UWANs), which are often left unattended over long periods of time. Currently,\ndue to physical and performance limitations, UWAC packets rarely include\nencryption, leaving the UWAN exposed to external attacks faking legitimate\nmessages. In this paper, we propose a new algorithm for message authentication\nin a UWAN setting. We begin by observing that, due to the strong spatial\ndependency of the underwater acoustic channel, an attacker can attempt to mimic\nthe channel associated with the legitimate transmitter only for a small set of\nreceivers, typically just for a single one. Taking this into account, our\nscheme relies on trusted nodes that independently help a sink node in the\nauthentication process. For each incoming packet, the sink fuses beliefs\nevaluated by the trusted nodes to reach an authentication decision. These\nbeliefs are based on estimated statistical channel parameters, chosen to be the\nmost sensitive to the transmitter-receiver displacement. Our simulation results\nshow accurate identification of an attacker's packet. We also report results\nfrom a sea experiment demonstrating the effectiveness of our approach.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 11:49:02 GMT"}, {"version": "v2", "created": "Wed, 2 Jan 2019 11:54:22 GMT"}], "update_date": "2019-01-03", "authors_parsed": [["Diamant", "Roee", ""], ["Casari", "Paolo", ""], ["Tomasin", "Stefano", ""]]}, {"id": "1806.02704", "submitter": "Pavlos Sermpezis", "authors": "Savvas Kastanakis, Pavlos Sermpezis, Vasileios Kotronis, Xenofontas\n  Dimitropoulos", "title": "CABaRet: Leveraging Recommendation Systems for Mobile Edge Caching", "comments": "ACM SIGCOMM 2018 workshops: Workshop on Mobile Edge Communications\n  (MECOMM'18), August 20, 2018, Budapest, Hungary", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Joint caching and recommendation has been recently proposed for increasing\nthe efficiency of mobile edge caching. While previous works assume\ncollaboration between mobile network operators and content providers (who\ncontrol the recommendation systems), this might be challenging in today's\neconomic ecosystem, with existing protocols and architectures. In this paper,\nwe propose an approach that enables cache-aware recommendations without\nrequiring a network and content provider collaboration. We leverage information\nprovided publicly by the recommendation system, and build a system that\nprovides cache-friendly and high-quality recommendations. We apply our approach\nto the YouTube service, and conduct measurements on YouTube video\nrecommendations and experiments with video requests, to evaluate the potential\ngains in the cache hit ratio. Finally, we analytically study the problem of\ncaching optimization under our approach. Our results show that significant\ncaching gains can be achieved in practice; 8 to 10 times increase in the cache\nhit ratio from cache-aware recommendations, and an extra 2 times increase from\ncaching optimization.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 14:32:49 GMT"}], "update_date": "2018-06-08", "authors_parsed": [["Kastanakis", "Savvas", ""], ["Sermpezis", "Pavlos", ""], ["Kotronis", "Vasileios", ""], ["Dimitropoulos", "Xenofontas", ""]]}, {"id": "1806.02803", "submitter": "Vaneet Aggarwal", "authors": "Anis Elgabli and Vaneet Aggarwal", "title": "FastScan: Robust Low-Complexity Rate Adaptation Algorithm for Video\n  Streaming over HTTP", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes and evaluates a novel algorithm for streaming video over\nHTTP. The problem is formulated as a non-convex optimization problem which is\nconstrained by the predicted available bandwidth, chunk deadlines, available\nvideo rates, and buffer occupancy. The objective is to optimize a QoE metric\nthat maintains a tradeoff between maximizing the playback rate of every chunk\nand ensuring fairness among different chunks for the minimum re-buffering time.\nWe propose FastScan, a low complexity algorithm that solves the problem. Online\nadaptations for dynamic bandwidth environments are proposed with imperfect\navailable bandwidth prediction. Results of experiments driven by Variable Bit\nRate (VBR) encoded video, video platform system (dash.js), and cellular\nbandwidth traces of a public dataset reveal the robustness of the online\nversion of FastScan algorithm and demonstrate its significant performance\nimprovement as compared to the considered state-of-the-art video streaming\nalgorithms. For example, on an experiment conducted over 100 real cellular\navailable bandwidth traces of a public dataset that spans different available\nbandwidth regimes, our proposed algorithm (FastScan) achieves the minimum\nre-buffering (stall) time and the maximum average playback rate in every single\ntrace as compared to Bola, Festive, BBA, RB, and FastMPC, and Pensieve\nalgorithms.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 17:27:06 GMT"}, {"version": "v2", "created": "Mon, 21 Jan 2019 16:17:49 GMT"}], "update_date": "2019-01-23", "authors_parsed": [["Elgabli", "Anis", ""], ["Aggarwal", "Vaneet", ""]]}, {"id": "1806.03031", "submitter": "Udo Schilcher", "authors": "Udo Schilcher, Jorge F. Schmidt, and Christian Bettstetter", "title": "On Interference Dynamics in Mat\\'ern Networks", "comments": null, "journal-ref": null, "doi": "10.1109/TMC.2019.2911498", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A thorough understanding of the temporal dynamics of interference in wireless\nnetworks is crucial for the design of communication protocols, scheduling, and\ninterference management. This paper applies stochastic geometry to investigate\ninterference dynamics for the first time in a network with nodes that use\ncarrier sense multiple access. This type of networks is approximated by a\nMat\\'ern hard-core point process of type II with Nakagami fading. We derive and\nanalyze expressions for the variance, covariance, and correlation of the\ninterference power at a given point in space. Results show that even though the\ncommonly used Poisson approximation to carrier sense multiple access may have\nthe same average interference than the Mat\\'ern model, the three interference\ndynamics measurements investigated behave significantly different.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 09:02:46 GMT"}], "update_date": "2019-04-26", "authors_parsed": [["Schilcher", "Udo", ""], ["Schmidt", "Jorge F.", ""], ["Bettstetter", "Christian", ""]]}, {"id": "1806.03124", "submitter": "Xu Chen", "authors": "Xu Chen and Wenzhong Li and Sanglu Lu and Zhi Zhou and Xiaoming Fu", "title": "Efficient Resource Allocation for On-Demand Mobile-Edge Cloud Computing", "comments": "Xu Chen,Wenzhong Li,Sanglu Lu,Zhi Zhou,and Xiaoming Fu, \"Efficient\n  Resource Allocation for On-Demand Mobile-Edge Cloud Computing,\" IEEE\n  Transactions on Vehicular Technology, June 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile-edge cloud computing is a new paradigm to provide cloud computing\ncapabilities at the edge of pervasive radio access networks in close proximity\nto mobile users. Aiming at provisioning flexible on-demand mobile-edge cloud\nservice, in this paper we propose a comprehensive framework consisting of a\nresource-efficient computation offloading mechanism for users and a joint\ncommunication and computation (JCC) resource allocation mechanism for network\noperator. Specifically, we first study the resource-efficient computation\noffloading problem for a user, in order to reduce user's resource occupation by\ndetermining its optimal communication and computation resource profile with\nminimum resource occupation and meanwhile satisfying the QoS constraint. We\nthen tackle the critical problem of user admission control for JCC resource\nallocation, in order to properly select the set of users for resource demand\nsatisfaction. We show the admission control problem is NP-hard, and hence\ndevelop an efficient approximation solution of a low complexity by carefully\ndesigning the user ranking criteria and rigourously derive its performance\nguarantee. To prevent the manipulation that some users may untruthfully report\ntheir valuations in acquiring mobile-edge cloud service, we further resort to\nthe powerful tool of critical value approach to design truthful pricing scheme\nfor JCC resource allocation. Extensive performance evaluation demonstrates that\nthe proposed schemes can achieve superior performance for on-demand mobile-edge\ncloud computing.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 12:53:13 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Chen", "Xu", ""], ["Li", "Wenzhong", ""], ["Lu", "Sanglu", ""], ["Zhou", "Zhi", ""], ["Fu", "Xiaoming", ""]]}, {"id": "1806.03155", "submitter": "Joberto Martins", "authors": "Eliseu Oliveira (UNIFACS), Rafael Freitas, Joberto Martins (UNIFACS)", "title": "Evaluating CBR Similarity Functions for BAM Switching in Networks with\n  Dynamic Traffic Profile", "comments": "https://lrsm.ibisc.univ-evry.fr/Advance2017/", "journal-ref": null, "doi": "10.5281/zenodo.1291127", "report-no": null, "categories": "cs.NI cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In an increasingly complex scenario for network management, a solution that\nallows configuration in more autonomous way with less intervention of the\nnetwork manager is expected. This paper presents an evaluation of similarity\nfunctions that are necessary in the context of using a learning strategy for\nfinding solutions. The learning approach considered is based on Case-Based\nReasoning (CBR) and is applied to a network scenario where different Bandwidth\nAllocation Models (BAMs) behaviors are used and must be eventually switched\nlooking for the best possible network operation. In this context, it is\nrequired to identify and configure an adequate similarity function that will be\nused in the learning process to recover similar solutions previously\nconsidered. This paper introduces the similarity functions, explains the\nrelevant aspects of the learning process in which the similarity function plays\na role and, finally, presents a proof of concept for a specific similarity\nfunction adopted. Results show that the similarity function was capable to get\nsimilar results from the existing use case database. As such, the use of\nsimilarity functions with CBR technique has proved to be potentially\nsatisfactory for supporting BAM switching decisions mostly driven by the\ndynamics of input traffic profile.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 13:48:52 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Oliveira", "Eliseu", "", "UNIFACS"], ["Freitas", "Rafael", "", "UNIFACS"], ["Martins", "Joberto", "", "UNIFACS"]]}, {"id": "1806.03156", "submitter": "Joberto Martins", "authors": "Maxli Campos (UNIFACS), Joberto Martins (UNIFACS)", "title": "A SDN-based Flexible System for On-the-Fly Monitoring and Treatment of\n  Security Events", "comments": "https://lrsm.ibisc.univ-evry.fr/Advance2017/", "journal-ref": null, "doi": "10.5281/zenodo.1291094", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Software Defined Networking (SDN) paradigm decouples control and data\nplanes, offering high programmability and a global view of the network.\nHowever, it is a challenge not only provide security in these next generation\nnetworks as well as allow that network attacks could be subjected to an\nincident and forensic treatment procedure. This paper proposes the\nimplementation of flexible mechanisms of monitoring and treatment of security\nevents categorized per type of attack and associated with whitelist and\nblacklist resources by means of the SDN controller programmability. The\nresources to perform intrusion and attack analysis are validated by means of a\nreal SDN/OpenFlow testbed.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 13:49:24 GMT"}], "update_date": "2018-06-18", "authors_parsed": [["Campos", "Maxli", "", "UNIFACS"], ["Martins", "Joberto", "", "UNIFACS"]]}, {"id": "1806.03157", "submitter": "Joberto Martins", "authors": "Pedro Moraes, Rafael Reale (IFBA), Joberto Martins", "title": "A Publish/Subscribe QoS-aware Framework for Massive IoT Traffic\n  Orchestration", "comments": "https://lrsm.ibisc.univ-evry.fr/Advance2018/", "journal-ref": null, "doi": "10.5281/zenodo.1098298", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet of Things (IoT) application deployment requires the allocation of\nresources such as virtual machines, storage, and network elements that must be\ndeployed over distinct infrastructures such as cloud computing, Cloud of Things\n(CoT), datacenters and backbone networks. For massive IoT data acquisition, a\ngateway-based data aggregation approach is commonly used featuring sensor/\nactuator seamless access and providing cache/ buffering and preprocessing\nfunctionality. In this perspective , gateways acting as producers need to\nallocate network resources to send IoT data to consumers. In this paper, it is\nproposed a Publish/-Subscribe (PubSub) quality of service (QoS) aware framework\n(PSIoT-Orch) that orchestrates IoT traffic and allocates network resources\nbetween aggregates and consumers for massive IoT traffic. PSIoT-Orch schedules\nIoT data flows based on its configured QoS requirements. Additionally , the\nframework allocates network resources (LSP/ bandwidth) over a controlled\nbackbone network with limited and constrained resources between IoT data users\nand consumers. Network resources are allocated using a Bandwidth Allocation\nModel (BAM) to achieve efficient network resource allocation for scheduled IoT\ndata streams. PSIoT-Orch adopts an ICN (Information-Centric Network) PubSub\narchitecture approach to handle IoT data transfers requests among framework\ncomponents. The proposed framework aims at gathering the inherent advantages of\nan ICN-centric approach using a PubSub message scheme while allocating\nresources efficiently keeping QoS awareness and handling restricted network\nresources (bandwidth) for massive IoT traffic.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 13:53:33 GMT"}], "update_date": "2018-06-18", "authors_parsed": [["Moraes", "Pedro", "", "IFBA"], ["Reale", "Rafael", "", "IFBA"], ["Martins", "Joberto", ""]]}, {"id": "1806.03183", "submitter": "Xiaohu Ge", "authors": "Jiaqi Chen, Xiaohu Ge, Xueying Song, Yi Zhong", "title": "Base Station Switch-off with Mutual Repulsion in 5G Massive MIMO\n  Networks", "comments": "arXiv admin note: text overlap with arXiv:1612.04459", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When small cells are densely deployed in the fifth generation (5G) cellular\nnetworks, switching off a part of base stations (BSs) is a practical approach\nfor saving energy consumption considering the variation of traffic load. The\nsmall cell network with the massive multi-input multi-output (massive MIMO)\nsystem is analyzed in this paper due to the dense deployment and low power\nconsumption. Based on the BS switch-off strategy with distance constraints, the\nenergy and coverage efficiency are investigated to illustrate the performance\nof the BS switch-off strategy. Simulation results indicate that the energy\nefficiency and coverage efficiency of the proposed strategy are better than the\nrandom strategy. The energy efficiency increases with the BS intensity and the\nminimal distance, and a maximum coverage efficiency can be achieved with the\nincrease of the BS intensity and the minimum distance. In this case, the\noptimal BS switch-off strategy can be designed under this work in the actual\nscene.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 02:27:14 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Chen", "Jiaqi", ""], ["Ge", "Xiaohu", ""], ["Song", "Xueying", ""], ["Zhong", "Yi", ""]]}, {"id": "1806.03213", "submitter": "Mohammad Yousefvand", "authors": "Mohammad Yousefvand, Mohammad Hajimirsadeghi, Narayan B. Mandayam", "title": "Impact of End-User Behavior on User/Network Association in HetNets", "comments": "7 pages, 5 figures, IEEE ICC 2018 Conference Paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the impact of end-user behavior on user/network association in a\nHetNet with multiple service providers (SPs). Specifically, we consider the\nuncertainty in the service guarantees offered by SPs in a HetNet, and use\nProspect Theory (PT) to model end-user decision making. We formulate user\nassociation with SPs as a multiple leader Stackelberg game where each SP offers\na data rate to each user with a certain service guarantee and at a certain\nprice, while the user chooses the best offer among multiple such bids. Using\nthe specific example of a HetNet with one cellular base station and one WiFi\naccess point, we show that when the end users underestimate the advertised\nservice guarantees, then some of the Nash Equilibrium strategies under the\nExpected Utility Theory (EUT) model become infeasible under PT, and for those\nNash Equilibria that are feasible under both EUT and PT, the resulting user\nutilities are less under PT. We propose resource allocation and bidding\nmechanisms for the SPs to mitigate these effects.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 23:25:34 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Yousefvand", "Mohammad", ""], ["Hajimirsadeghi", "Mohammad", ""], ["Mandayam", "Narayan B.", ""]]}, {"id": "1806.03236", "submitter": "Mohammad Asadul Hoque", "authors": "Noah Carter, Mohammad A. Hoque, Md Salman Ahmed", "title": "Simulating Vehicle Movement and Multi-Hop Connectivity from Basic Safety\n  Messages", "comments": null, "journal-ref": "Noah Carter, Mohammad A. Hoque, Md Salman Ahmed. \"Simulating\n  Vehicle Movement and Multi-Hop Connectivity from Basic Safety Messages.\" IEEE\n  SoutheastCon 2018", "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Basic Safety Message (BSM) is a standardized communication packet that is\nsent every tenth of a second between connected vehicles using Dedicated Short\nRange Communication (DSRC). BSMs contain data about the sending vehicle's\nstate, such as speed, location, and the status of the turn signal. Currently,\nmany BSM datasets are available through the connected vehicle testbeds of U.S.\nDepartment of Transportation from all over the country. However, without a\nproper visualization tool, it is not possible to analyze or visually get an\noverview of the spatio-temporal distribution of the data. With this goal, a web\napplication has been developed which can ingest a raw BSM dataset and display a\ntime-based simulation of vehicle movement. The simulation also displays\nmulti-hop vehicular network connectivity over DSRC. This paper gives details\nabout the application, including an explanation of the multi-hop partitioning\nalgorithm used to classify the vehicles into separate network partitions. A\nperformance analysis for the simulation is included, in which it is suggested\nthat calculating a connectivity matrix with the multi-hop partitioning\nalgorithm is computationally expensive for large number of vehicles.\n", "versions": [{"version": "v1", "created": "Sat, 5 May 2018 14:12:18 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Carter", "Noah", ""], ["Hoque", "Mohammad A.", ""], ["Ahmed", "Md Salman", ""]]}, {"id": "1806.03237", "submitter": "Hongling Shi", "authors": "Hongling Shi (LIMOS), Kun Mean Hou (LIMOS), Xunxing Diao (LIMOS), Liu\n  Xing (LIMOS), Jian-Jin Li (LIMOS), Christophe De Vaulx (LIMOS)", "title": "A Wireless Multimedia Sensor Network Platform for Environmental Event\n  Detection Dedicated to Precision Agriculture", "comments": null, "journal-ref": "New and Smart Information Communication Science and Technology to\n  Support Sustainable Development (NICST 2013), Sep 2013, Clermont-Ferrand,\n  France", "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Precision agriculture has been considered as a new technique to improve\nagricultural production and support sustainable development by preserving\nplanet resource and minimizing pollution. By monitoring different parameters of\ninterest in a cultivated field, wireless sensor network (WSN) enables real-time\ndecision making with regard to issues such as management of water resources for\nirrigation, choosing the optimum point for harvesting, estimating fertilizer\nrequirements and predicting crop yield more accurately. In spite the tremendous\nadvanced of scalar WSN in recent year, scalar WSN cannot meet all the\nrequirements of ubiquitous intelligent environmental event detections because\nscalar data such as temperature, soil humidity, air humidity and light\nintensity are not rich enough to detect all the environmental events such as\nplant diseases and present of insects. Thus to fulfill those requirements\nmultimedia data is needed. In this paper we present a robust multi-support and\nmodular Wireless Multimedia Sensor Network (WMSN) platform, which is a type of\nwireless sensor network equipped with a low cost CCD camera. This WMSN platform\nmay be used for diverse environmental event detections such as the presence of\nplant diseases and insects in precision agriculture applications.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2018 07:37:23 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Shi", "Hongling", "", "LIMOS"], ["Hou", "Kun Mean", "", "LIMOS"], ["Diao", "Xunxing", "", "LIMOS"], ["Xing", "Liu", "", "LIMOS"], ["Li", "Jian-Jin", "", "LIMOS"], ["De Vaulx", "Christophe", "", "LIMOS"]]}, {"id": "1806.03238", "submitter": "Khaled Sellami KSI", "authors": "Khaled Sellami, Lynda Sellami, Pierre F Tiako", "title": "Reconfigurable Ubiquitous Computing Infrastructure for Load Balancing", "comments": null, "journal-ref": "World Academy of Science, Engineering and Technology International\n  Journal of Industrial and Manufacturing Engineering Vol 12, No 3, 2018", "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Ubiquitous computing helps make data and services available to users anytime\nand anywhere. This makes the cooperation of devices a crucial need. In return,\nsuch cooperation causes an overload of the devices and/or networks, resulting\nin network malfunction and suspension of its activities. Our goal in this paper\nis to propose an approach of devices reconfiguration in order to help to reduce\nthe energy consumption in ubiquitous environments. The idea is that when\nhigh-energy consumption is detected, we proceed to a change in component\ndistribution on the devices to reduce and/or balance the energy consumption. We\nalso investigate the possibility to detect high-energy consumption of\ndevices/network based on devices abilities. As a result, our idea realizes a\nreconfiguration of devices aimed at reducing the consumption of energy and/or\nload balancing in ubiquitous environments.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 21:58:28 GMT"}, {"version": "v2", "created": "Thu, 29 Nov 2018 17:34:31 GMT"}], "update_date": "2018-11-30", "authors_parsed": [["Sellami", "Khaled", ""], ["Sellami", "Lynda", ""], ["Tiako", "Pierre F", ""]]}, {"id": "1806.03255", "submitter": "Austin Hounsel", "authors": "Austin Hounsel, Prateek Mittal, Nick Feamster", "title": "Automatically Generating a Large, Culture-Specific Blocklist for China", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet censorship measurements rely on lists of websites to be tested, or\n\"block lists\" that are curated by third parties. Unfortunately, many of these\nlists are not public, and those that are tend to focus on a small group of\ntopics, leaving other types of sites and services untested. To increase and\ndiversify the set of sites on existing block lists, we use natural language\nprocessing and search engines to automatically discover a much wider range of\nwebsites that are censored in China. Using these techniques, we create a list\nof 1125 websites outside the Alexa Top 1,000 that cover Chinese politics,\nminority human rights organizations, oppressed religions, and more.\nImportantly, $\\textit{none of the sites we discover are present on the current\nlargest block list}$. The list that we develop not only vastly expands the set\nof sites that current Internet measurement tools can test, but it also deepens\nour understanding of the nature of content that is censored in China. We have\nreleased both this new block list and the code for generating it.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 20:58:09 GMT"}, {"version": "v2", "created": "Thu, 19 Jul 2018 16:02:31 GMT"}], "update_date": "2018-07-20", "authors_parsed": [["Hounsel", "Austin", ""], ["Mittal", "Prateek", ""], ["Feamster", "Nick", ""]]}, {"id": "1806.03328", "submitter": "Jaya Prakash Champati", "authors": "Jaya Prakash Champati, Hussein Al-Zubaidy, James Gross", "title": "Transient Delay Bounds for Multi-Hop Wireless Networks", "comments": "13 pages, 13 figures, joournal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we investigate the transient behavior of a sequence of\npackets/bits traversing a multi-hop wireless network. Our work is motivated by\nnovel applications from the domain of process automation, Machine-Type\nCommunication (MTC) and cyber-physical systems, where short messages are\ncommunicated and statistical guarantees need to be provided on a per-message\nlevel. In order to optimize such a network, apart from understanding the\nstationary system dynamics, an understanding of the short-term dynamics (i.e.,\ntransient behavior) is also required. To this end, we derive novel Wireless\nTransient Bounds (WTB) for end-to-end delay and backlog in a multi-hop wireless\nnetwork using stochastic network calculus approach. WTB depends on the initial\nbacklog at each node as well as the instantaneous channel states. We\nnumerically compare WTB with State-Of-The-Art Transient bounds (SOTAT), that\ncan be obtained by adapting existing stationary bounds, as well as simulation\nof the network. While SOTAT and stationary bounds are not able to capture the\nshort-term system dynamics well, WTB provides relatively tight upper bound and\nhas a decay rate that closely matches the simulation. This is achieved by WTB\nonly with a slight increase in the computational complexity, by a factor of O(T\n+ N), where T is the duration of the arriving sequence and N is the number of\nhops in the network. We believe that the presented analysis and the bounds can\nbe used as base for future work on transient network optimization, e.g., in\nmassive MTC, critical MTC, edge computing and autonomous vehicle.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 19:22:10 GMT"}], "update_date": "2018-06-12", "authors_parsed": [["Champati", "Jaya Prakash", ""], ["Al-Zubaidy", "Hussein", ""], ["Gross", "James", ""]]}, {"id": "1806.03517", "submitter": "Hanan Hindy", "authors": "Hanan Hindy and David Brosset and Ethan Bayne and Amar Seeam and\n  Christos Tachtatzis and Robert Atkinson and Xavier Bellekens", "title": "A Taxonomy of Network Threats and the Effect of Current Datasets on\n  Intrusion Detection Systems", "comments": "28 Pages, 6 Figures", "journal-ref": "IEEE Access, 2020", "doi": "10.1109/ACCESS.2020.3000179", "report-no": null, "categories": "cs.CR cs.AI cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the world moves towards being increasingly dependent on computers and\nautomation, building secure applications, systems and networks are some of the\nmain challenges faced in the current decade. The number of threats that\nindividuals and businesses face is rising exponentially due to the increasing\ncomplexity of networks and services of modern networks. To alleviate the impact\nof these threats, researchers have proposed numerous solutions for anomaly\ndetection; however, current tools often fail to adapt to ever-changing\narchitectures, associated threats and zero-day attacks. This manuscript aims to\npinpoint research gaps and shortcomings of current datasets, their impact on\nbuilding Network Intrusion Detection Systems (NIDS) and the growing number of\nsophisticated threats. To this end, this manuscript provides researchers with\ntwo key pieces of information; a survey of prominent datasets, analyzing their\nuse and impact on the development of the past decade's Intrusion Detection\nSystems (IDS) and a taxonomy of network threats and associated tools to carry\nout these attacks. The manuscript highlights that current IDS research covers\nonly 33.3% of our threat taxonomy. Current datasets demonstrate a clear lack of\nreal-network threats, attack representation and include a large number of\ndeprecated threats, which together limit the detection accuracy of current\nmachine learning IDS approaches. The unique combination of the taxonomy and the\nanalysis of the datasets provided in this manuscript aims to improve the\ncreation of datasets and the collection of real-world data. As a result, this\nwill improve the efficiency of the next generation IDS and reflect network\nthreats more accurately within new datasets.\n", "versions": [{"version": "v1", "created": "Sat, 9 Jun 2018 17:47:55 GMT"}, {"version": "v2", "created": "Fri, 5 Jun 2020 14:27:56 GMT"}], "update_date": "2020-06-08", "authors_parsed": [["Hindy", "Hanan", ""], ["Brosset", "David", ""], ["Bayne", "Ethan", ""], ["Seeam", "Amar", ""], ["Tachtatzis", "Christos", ""], ["Atkinson", "Robert", ""], ["Bellekens", "Xavier", ""]]}, {"id": "1806.03542", "submitter": "Anirudh Sabnis", "authors": "Anirudh Sabnis, Ramesh K. Sitaraman, Donald Towsley", "title": "OCCAM: An Optimization-Based Approach to Network Inference", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of inferring the structure of a communication network\nbased only on network measurements made from a set of hosts situated at the\nnetwork periphery. Our novel approach called \"OCCAM\" is based on the principle\nof occam's razor and finds the \"simplest\" network that explains the observed\nnetwork measurements. OCCAM infers the internal topology of a communication\nnetwork, including the internal nodes and links of the network that are not\namenable to direct measurement. In addition to network topology, OCCAM infers\nthe routing paths that packets take between the hosts. OCCAM uses path metrics\nmeasurable from the hosts and expresses the observed measurements as\nconstraints of a mixed-integer bilinear optimization problem that can then be\nfeasibly solved to yield the network topology and the routing paths. We\nempirically validate OCCAM on a wide variety of real-world ISP networks and\nshow that its inferences agree closely with the ground truth. Specifically,\nOCCAM infers the topology with an average network similarity score of 93% and\ninfers routing paths with a path edit distance of 0.20. Further, OCCAM is\nrobust to error in its measured path metric inputs, producing high quality\ninferences even when 20-30% of its inputs are erroneous. Our work is a\nsignificant advance in network tomography as it proposes and empirically\nevaluates the first method that infers the complete network topology, rather\nthan just logical routing trees from sources.\n", "versions": [{"version": "v1", "created": "Sat, 9 Jun 2018 21:02:09 GMT"}, {"version": "v2", "created": "Sat, 1 Jun 2019 19:56:30 GMT"}], "update_date": "2019-06-04", "authors_parsed": [["Sabnis", "Anirudh", ""], ["Sitaraman", "Ramesh K.", ""], ["Towsley", "Donald", ""]]}, {"id": "1806.03557", "submitter": "Mohamed Grissa", "authors": "Mohamed Grissa, Attila A. Yavuz and Bechir Hamdaoui", "title": "Location Privacy Preservation in Database-Driven Wireless Cognitive\n  Networks Through Encrypted Probabilistic Data Structures", "comments": "Published in IEEE Transactions on Cognitive Communications and\n  Networking, 12 pages, 7 figures", "journal-ref": "IEEE Transactions On Cognitive Communications and Networking, Vol.\n  3, No. 2, June 2017", "doi": "10.1109/TCCN.2017.2702163", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose new location privacy preserving schemes for\ndatabase-driven cognitive radio networks that protect secondary users' (SUs)\nlocation privacy while allowing them to learn spectrum availability in their\nvicinity. Our schemes harness probabilistic set membership data structures to\nexploit the structured nature of spectrum databases (DBs) and SUs' queries.\nThis enables us to create a compact representation of DB that could be queried\nby SUs without having to share their location with DB, thus guaranteeing their\nlocation privacy. Our proposed schemes offer different cost-performance\ncharacteristics. Our first scheme relies on a simple yet powerful two-party\nprotocol that achieves unconditional security with a plausible communication\noverhead by making DB send a compacted version of its content to SU which needs\nonly to query this data structure to learn spectrum availability. Our second\nscheme achieves significantly lower communication and computation overhead for\nSUs, but requires an additional architectural entity which receives the\ncompacted version of the database and fetches the spectrum availability\ninformation in lieu of SUs to alleviate the overhead on the latter. We show\nthat our schemes are secure, and also demonstrate that they offer significant\nadvantages over existing alternatives for various performance and/or security\nmetrics.\n", "versions": [{"version": "v1", "created": "Sat, 9 Jun 2018 23:37:16 GMT"}], "update_date": "2018-06-12", "authors_parsed": [["Grissa", "Mohamed", ""], ["Yavuz", "Attila A.", ""], ["Hamdaoui", "Bechir", ""]]}, {"id": "1806.03572", "submitter": "Mohamed Grissa", "authors": "Mohamed Grissa, Attila Yavuz and Bechir Hamdaoui", "title": "LPOS: Location Privacy for Optimal Sensing in Cognitive Radio Networks", "comments": "Published in Global Communications Conference (GLOBECOM), 2015 IEEE,\n  7 pages, 2 figures", "journal-ref": null, "doi": "10.1109/GLOCOM.2015.7417611", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cognitive Radio Networks (CRNs) enable opportunistic access to the licensed\nchannel resources by allowing unlicensed users to exploit vacant channel\nopportunities. One effective technique through which unlicensed users, often\nreferred to as Secondary Users (SUs), acquire whether a channel is vacant is\ncooperative spectrum sensing. Despite its effectiveness in enabling CRN access,\ncooperative sensing suffers from location privacy threats, merely because the\nsensing reports that need to be exchanged among the SUs to perform the sensing\ntask are highly correlated to the SUs' locations. In this paper, we develop a\nnew Location Privacy for Optimal Sensing (LPOS) scheme that preserves the\nlocation privacy of SUs while achieving optimal sensing performance through\nvoting-based sensing. In addition, LPOS is the only alternative among existing\nCRN location privacy preserving schemes (to the best of our knowledge) that\nensures high privacy, achieves fault tolerance, and is robust against the\nhighly dynamic and wireless nature of CRNs.\n", "versions": [{"version": "v1", "created": "Sun, 10 Jun 2018 02:06:20 GMT"}], "update_date": "2018-06-12", "authors_parsed": [["Grissa", "Mohamed", ""], ["Yavuz", "Attila", ""], ["Hamdaoui", "Bechir", ""]]}, {"id": "1806.03860", "submitter": "Shan Zhang", "authors": "Shan Zhang, Wei Quan, Junling Li, Weisen Shi, Peng Yang, and Xuemin\n  Shen", "title": "Air-Ground Integrated Vehicular Network Slicing with Content Pushing and\n  Caching", "comments": "JSAC-Airborne, to appear", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, an Air-Ground Integrated VEhicular Network (AGIVEN)\narchitecture is proposed, where the aerial High Altitude Platforms (HAPs)\nproactively push contents to vehicles through large-area broadcast while the\nground roadside units (RSUs) provide high-rate unicast services on demand. To\nefficiently manage the multi-dimensional heterogeneous resources, a\nservice-oriented network slicing approach is introduced, where the AGIVEN is\nvirtually divided into multiple slices and each slice supports a specific\napplication with guaranteed quality of service (QoS). Specifically, the\nfundamental problem of multi-resource provisioning in AGIVEN slicing is\ninvestigated, by taking into account typical vehicular applications of\nlocation-based map and popularity-based content services. For the\nlocation-based map service, the capability of HAP-vehicle proactive pushing is\nderived with respect to the HAP broadcast rate and vehicle cache size, wherein\na saddle point exists indicating the optimal communication-cache resource\ntrading. For the popular contents of common interests, the average on-board\ncontent hit ratio is obtained, with HAPs pushing newly generated contents to\nkeep on-board cache fresh. Then, the minimal RSU transmission rate is derived\nto meet the average delay requirements of each slice. The obtained analytical\nresults reveal the service-dependent resource provisioning and trading\nrelationships among RSU transmission rate, HAP broadcast rate, and vehicle\ncache size, which provides guidelines for multi-resource network slicing in\npractice. Simulation results demonstrate that the proposed AGIVEN network\nslicing approach matches the multi-resources across slices, whereby the RSU\ntransmission rate can be saved by 40% while maintaining the same QoS.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jun 2018 08:42:04 GMT"}], "update_date": "2018-06-12", "authors_parsed": [["Zhang", "Shan", ""], ["Quan", "Wei", ""], ["Li", "Junling", ""], ["Shi", "Weisen", ""], ["Yang", "Peng", ""], ["Shen", "Xuemin", ""]]}, {"id": "1806.03875", "submitter": "Majd Latah", "authors": "Majd Latah, Levent Toker", "title": "An Efficient Flow-based Multi-level Hybrid Intrusion Detection System\n  for Software-Defined Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Software-Defined Networking (SDN) is a novel networking paradigm that\nprovides enhanced programming abilities, which can be used to solve traditional\nsecurity challenges on the basis of more efficient approaches. The most\nimportant element in the SDN paradigm is the controller, which is responsible\nfor managing the flows of each correspondence forwarding element (switch or\nrouter). Flow statistics provided by the controller are considered to be useful\ninformation that can be used to develop a network-based intrusion detection\nsystem. Therefore, in this paper, we propose a 5-level hybrid classification\nsystem based on flow statistics in order to attain an improvement in the\noverall accuracy of the system. For the first level, we employ the k-Nearest\nNeighbor approach (kNN); for the second level, we use the Extreme Learning\nMachine (ELM); and for the remaining levels, we utilize the Hierarchical\nExtreme Learning Machine (H-ELM) approach. In comparison with conventional\nsupervised machine learning algorithms based on the NSL-KDD benchmark dataset,\nthe experimental study showed that our system achieves the highest level of\naccuracy (84.29%). Therefore, our approach presents an efficient approach for\nintrusion detection in SDNs.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jun 2018 09:29:44 GMT"}], "update_date": "2018-06-12", "authors_parsed": [["Latah", "Majd", ""], ["Toker", "Levent", ""]]}, {"id": "1806.04193", "submitter": "Mattia Rebato", "authors": "Mattia Rebato and Jihong Park and Petar Popovski and Elisabeth De\n  Carvalho and Michele Zorzi", "title": "Stochastic Geometric Coverage Analysis in mmWave Cellular Networks with\n  Realistic Channel and Antenna Radiation Models", "comments": "Accepted to IEEE Transactions on Communications (TCOM)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Millimeter-wave (mmWave) bands will play an important role in 5G wireless\nsystems. The system performance can be assessed by using models from stochastic\ngeometry that cater for the directivity in the desired signal transmissions as\nwell as the interference, and by calculating the\nsignal-to-interference-plus-noise ratio (SINR) coverage. Nonetheless, the\ncorrectness of the existing coverage expressions derived through stochastic\ngeometry may be questioned, as it is not clear whether they capture the impact\nof the detailed mmWave channel and antenna features. In this study, we propose\nan SINR coverage analysis framework that includes realistic channel model (from\nNYU) and antenna element radiation patterns (with isotropic/directional\nradiation). We first introduce two parameters, aligned gain and misaligned\ngain, associated with the desired signal beam and the interfering signal beam,\nrespectively. We provide the distributions of the aligned and misaligned gains\nthrough curve fitting of system-simulation results. The distribution of these\ngains is used to determine the distribution of the SINR. We compare the\nobtained analytical SINR coverage with the corresponding SINR coverage\ncalculated via system-level simulations. The results show that both aligned and\nmisaligned gains can be modeled as exponential-logarithmically distributed\nrandom variables with the highest accuracy, and can further be approximated as\nexponentially distributed random variables with reasonable accuracy. These\napproximations are thus expected to be useful to evaluate the system\nperformance under ultra-reliable and low-latency communication (URLLC) and\nevolved mobile broadband (eMBB) scenarios, respectively.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jun 2018 19:00:23 GMT"}, {"version": "v2", "created": "Thu, 24 Jan 2019 11:07:56 GMT"}], "update_date": "2019-01-25", "authors_parsed": [["Rebato", "Mattia", ""], ["Park", "Jihong", ""], ["Popovski", "Petar", ""], ["De Carvalho", "Elisabeth", ""], ["Zorzi", "Michele", ""]]}, {"id": "1806.04311", "submitter": "Mohamed Faten Zhani", "authors": "Richard Olaniyan, Olamilekan Fadahunsi, Muthucumaru Maheswaran,\n  Mohamed Faten Zhani", "title": "Opportunistic Edge Computing: Concepts, Opportunities and Research\n  Challenges", "comments": "22 pages, 10 figures, journal paper", "journal-ref": "Elsevier Future Generation Computer Systems Journal, 2018", "doi": "10.1016/j.future.2018.07.040", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The growing need for low-latency access to computing resources has motivated\nthe introduction of edge computing, where resources are strategically placed at\nthe access networks. Unfortunately, edge computing infrastructures like fogs\nand cloudlets have limited scalability and may be prohibitively expensive to\ninstall given the vast edge of the Internet. In this paper, we present\nOpportunistic Edge Computing (OEC), a new computing paradigm that provides a\nframework to create scalable infrastructures at the edge using end-user\ncontributed resources. One of the goals of OEC is to place resources where\nthere is high demand for them by incentivizing people to share their resources.\nThis paper defines the OEC paradigm and the involved stakeholders and puts\nforward a management framework to build, manage and monitor scalable edge\ninfrastructures. It also highlights the key differences between the OEC\ncomputing models and the existing computing models and shed the light on early\nworks on the topic. The paper also presents preliminary experimental results\nthat highlight the benefits and the limitations of OEC compared to the regular\ncloud computing deployment and the Fog deployment. It finally summarizes key\nresearch directions pertaining to resource management in OEC environments.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 03:09:25 GMT"}, {"version": "v2", "created": "Tue, 17 Jul 2018 18:56:32 GMT"}, {"version": "v3", "created": "Tue, 24 Jul 2018 20:14:48 GMT"}], "update_date": "2018-07-26", "authors_parsed": [["Olaniyan", "Richard", ""], ["Fadahunsi", "Olamilekan", ""], ["Maheswaran", "Muthucumaru", ""], ["Zhani", "Mohamed Faten", ""]]}, {"id": "1806.04385", "submitter": "Thomas Kohler", "authors": "Thomas Kohler, Ruben Mayer, Frank D\\\"urr, Marius Maa{\\ss}, Sukanya\n  Bhowmik, Kurt Rothermel", "title": "P4CEP: Towards In-Network Complex Event Processing", "comments": "6 pages. Author's version", "journal-ref": null, "doi": "10.1145/3229591.3229593", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In-network computing using programmable networking hardware is a strong trend\nin networking that promises to reduce latency and consumption of server\nresources through offloading to network elements (programmable switches and\nsmart NICs). In particular, the data plane programming language P4 together\nwith powerful P4 networking hardware has spawned projects offloading services\ninto the network, e.g., consensus services or caching services. In this paper,\nwe present a novel case for in-network computing, namely, Complex Event\nProcessing (CEP). CEP processes streams of basic events, e.g., stemming from\nnetworked sensors, into meaningful complex events. Traditionally, CEP\nprocessing has been performed on servers or overlay networks. However, we argue\nin this paper that CEP is a good candidate for in-network computing along the\ncommunication path avoiding detouring streams to distant servers to minimize\ncommunication latency while also exploiting processing capabilities of novel\nnetworking hardware. We show that it is feasible to express CEP operations in\nP4 and also present a tool to compile CEP operations, formulated in our P4CEP\nrule specification language, to P4 code. Moreover, we identify challenges and\nproblems that we have encountered to show future research directions for\nimplementing full-fledged in-network CEP systems.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 08:20:20 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Kohler", "Thomas", ""], ["Mayer", "Ruben", ""], ["Dürr", "Frank", ""], ["Maaß", "Marius", ""], ["Bhowmik", "Sukanya", ""], ["Rothermel", "Kurt", ""]]}, {"id": "1806.04386", "submitter": "Onel Luis Alcaraz L\\'opez", "authors": "Onel L. Alcaraz Lopez, Hirley Alves, Matti Latva-aho", "title": "Rate Control under Finite Blocklength for Downlink Cellular Networks\n  with Reliability Constraints", "comments": "accepted to be presented at ISWCS 2018 as an invited paper. Special\n  session on 'Ultra-reliable low latency communications (URLLCs)'", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coming cellular systems are envisioned to open up to new services and\napplications with high reliability and low latency requirements. In this paper\nwe focus on the rate allocation problem in downlink cellular networks with\nRayleigh fading and stringent reliability constraints. We propose a rate\ncontrol strategy to cope with those requirements making use only of topological\ncharacteristics of the scenario, the reliability constraint and the number of\nantennas that are available at the receiver side. Numerical results show the\nfeasibility of the ultra-reliable operation when the number of antennas\nincreases, and also that our results remain valid even when operating at short\nblocklength as far as the amount of information to be transmitted is not too\nsmall.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 08:21:07 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Lopez", "Onel L. Alcaraz", ""], ["Alves", "Hirley", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1806.04467", "submitter": "Loic Baron", "authors": "Lo\\\"ic Baron (NPA, CNRS), Radomir Klacza (UPMC, NPA), Pauline\n  Gaudet-Chardonnet (NPA, UPMC), Amira Bradai (UPMC, NPA), Ciro Scognamiglio\n  (UPMC, NPA), Serge Fdida (NPA, LINCS)", "title": "Next generation portal for federated testbeds MySlice v2: from prototype\n  to production", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CY cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A number of projects in computer science around the world have contributed to\nbuild federated experimental facilities providing access to a large set of\ndistributed compute, storage and network resources for the research community.\nSeveral tools have been developed to provide users an easy access to the\nfederated testbeds. This paper presents the architecture of the new version of\nthe MySlice web portal, that has evolved from a prototype to a production ready\nsoftware.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 12:39:00 GMT"}], "update_date": "2018-06-16", "authors_parsed": [["Baron", "Loïc", "", "NPA, CNRS"], ["Klacza", "Radomir", "", "UPMC, NPA"], ["Gaudet-Chardonnet", "Pauline", "", "NPA, UPMC"], ["Bradai", "Amira", "", "UPMC, NPA"], ["Scognamiglio", "Ciro", "", "UPMC, NPA"], ["Fdida", "Serge", "", "NPA, LINCS"]]}, {"id": "1806.04578", "submitter": "Carla Mouradian", "authors": "Carla Mouradian, Somayeh Kianpisheh, Roch H. Glitho", "title": "Application Component Placement in NFV-based Hybrid Cloud/Fog Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Applications are sets of interacting components that can be executed in\nsequence, in parallel, or by using more complex constructs such as selections\nand loops. They can, therefore, be modeled as structured graphs with\nsub-structures consisting of these constructs. Fog computing can reduce the\nlatency induced by distant clouds by enabling the deployment of some components\nat the edge of the network (i.e., closer to end-devices) while keeping others\nin the cloud. Network Functions Virtualization (NFV) decouples software from\nhardware and enables an agile deployment of network services and applications\nas Virtual Network Functions (VNFs). In NFV settings, efficient placement\nalgorithms are required to map the structured graphs representing the VNF\nForwarding Graphs (VNF-FGs) onto the infrastructure of the hybrid cloud/fog\nsystem. Only deterministic graphs with sequence and parallel sub-structures\nhave been considered thus to date. However, several real-life applications do\nrequire non-deterministic graphs with sub-structures as selections and loops.\nThis paper focuses on application component placement in NFV-based hybrid\ncloud/fog systems, with the assumption that the graph representing the\napplication is non-deterministic. The objective is to minimize an aggregated\nweighted function of makespan and cost. The problem is modeled as an Integer\nLinear Programming (ILP) and evaluated over small-scale scenarios using the\nCPLEX optimization tool.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2018 12:45:35 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Mouradian", "Carla", ""], ["Kianpisheh", "Somayeh", ""], ["Glitho", "Roch H.", ""]]}, {"id": "1806.04580", "submitter": "Narjes Tahghigh Jahromi", "authors": "Narjes Tahghigh Jahromi, Somayeh Kianpisheh, Roch H. Glitho", "title": "Online VNF Placement and Chaining for Value-added Services in Content\n  Delivery Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Value-added Services (VASs) (e.g. dynamic site acceleration, media\nmanagement) play a critical role in Content Delivery Networks (CDNs). Network\nFunctions Virtualization (NFV) enables the agile provisioning of VASs. In NFV\nsettings, VASs are provisioned as ordered sets of Virtual Network Functions\n(VNFs), forming VNF-Forwarding Graphs (VNF-FG) which are deployed in the CDN\ninfrastructure. The CDN VAS VNF-FGs have a specific characteristic: they have\none end-point (corresponding to the content server) that is unknown, prior to\ntheir placement. The proposals for CDN VAS VNF-FG placement, so far, have only\nconsidered offline placement, where the VNF-FGs are placed before end-user\ntraffic steers into the network. However, in concrete cases, a change in\nservice usage patterns might occur, a situation that could require a VNF-FG\nplacement in an online manner. This paper tackles the problem of online VNF-FG\nplacement for VASs in CDNs, taking into account the eventual reuses and\nmigrations of already-deployed VNFs. A cost model is considered, including\nmultiple costs; i.e. new VNF instantiations, migration, hosting and routing\ncosts. The objective is to optimally place the VNF-FGs such that total\nreconfiguration costs are minimized while QoS is satisfied. An Integer Linear\nProgramming (ILP) formulation is provided and evaluated in a small-scale\nscenario.\n", "versions": [{"version": "v1", "created": "Thu, 24 May 2018 18:08:41 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Jahromi", "Narjes Tahghigh", ""], ["Kianpisheh", "Somayeh", ""], ["Glitho", "Roch H.", ""]]}, {"id": "1806.04582", "submitter": "Yasin Yilmaz", "authors": "Almuthanna T. Nassar and Yasin Yilmaz", "title": "Reinforcement Learning-based Resource Allocation in Fog RAN for IoT with\n  Heterogeneous Latency Requirements", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In light of the quick proliferation of Internet of things (IoT) devices and\napplications, fog radio access network (Fog-RAN) has been recently proposed for\nfifth generation (5G) wireless communications to assure the requirements of\nultra-reliable low-latency communication (URLLC) for the IoT applications which\ncannot accommodate large delays. Hence, fog nodes (FNs) are equipped with\ncomputing, signal processing and storage capabilities to extend the inherent\noperations and services of the cloud to the edge. We consider the problem of\nsequentially allocating the FN's limited resources to the IoT applications of\nheterogeneous latency requirements. For each access request from an IoT user,\nthe FN needs to decide whether to serve it locally utilizing its own resources\nor to refer it to the cloud to conserve its valuable resources for future users\nof potentially higher utility to the system (i.e., lower latency requirement).\nWe formulate the Fog-RAN resource allocation problem in the form of a Markov\ndecision process (MDP), and employ several reinforcement learning (RL) methods,\nnamely Q-learning, SARSA, Expected SARSA, and Monte Carlo, for solving the MDP\nproblem by learning the optimum decision-making policies. We verify the\nperformance and adaptivity of the RL methods and compare it with the\nperformance of a fixed-threshold-based algorithm. Extensive simulation results\nconsidering 19 IoT environments of heterogeneous latency requirements\ncorroborate that RL methods always achieve the best possible performance\nregardless of the IoT environment.\n", "versions": [{"version": "v1", "created": "Sun, 27 May 2018 15:04:58 GMT"}, {"version": "v2", "created": "Tue, 15 Jan 2019 22:01:22 GMT"}], "update_date": "2019-01-17", "authors_parsed": [["Nassar", "Almuthanna T.", ""], ["Yilmaz", "Yasin", ""]]}, {"id": "1806.04583", "submitter": "Guoru Ding Dr.", "authors": "Haichao Wang, Jinlong Wang, Jin Chen, Yuping Gong, and Guoru Ding", "title": "Network-Connected UAV Communications: Potentials and Challenges", "comments": null, "journal-ref": "China Communications, 2018", "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article explores the use of network-connected unmanned aerial vehicle\n(UAV) communications as a compelling solution to achieve high-rate information\ntransmission and support ultra-reliable UAV remote command and control. We\nfirst discuss the use cases of UAVs and the resulting communication\nrequirements, accompanied with a flexible architecture for network-connected\nUAV communications. Then, the signal transmission and interference\ncharacteristics are theoretically analyzed, and subsequently we highlight the\ndesign and optimization considerations, including antenna design,\nnon-orthogonal multiple access communications, as well as network selection and\nassociation optimization. Finally, case studies are provided to show the\nfeasibility of network-connected UAV communications.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2018 12:44:12 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Wang", "Haichao", ""], ["Wang", "Jinlong", ""], ["Chen", "Jin", ""], ["Gong", "Yuping", ""], ["Ding", "Guoru", ""]]}, {"id": "1806.04584", "submitter": "Chujie Wang", "authors": "Chujie Wang, Zhifeng Zhao, Qi Sun, Honggang Zhang", "title": "Deep Learning-based Intelligent Dual Connectivity for Mobility\n  Management in Dense Network", "comments": "5 pages, 9 figures, conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ultra-dense network deployment has been proposed as a key technique for\nachieving capacity goals in the fifth-generation (5G) mobile communication\nsystem. However, the deployment of smaller cells inevitably leads to more\nfrequent handovers, thus making mobility management more challenging and\nreducing the capacity gains offered by the dense network deployment. In order\nto fully reap the gains for mobile users in such a network environment, we\npropose an intelligent dual connectivity mechanism for mobility management\nthrough deep learning-based mobility prediction. We first use LSTM (Long Short\nTerm Memory) algorithm, one of deep learning algorithms, to learn every user\nequipment's (UE's) mobility pattern from its historical trajectories and\npredict its movement trends in the future. Based on the corresponding\nprediction results, the network will judge whether a handover is required for\nthe UE. For the handover case, a dual connection will be established for the\nrelated UE. Thus, the UE can get the radio signal from two base stations in the\nhandover process. Simulation results verify that the proposed intelligent dual\nconnectivity mechanism can significantly improve the quality of service of\nmobile users in the handover process while guaranteeing the network energy\nefficiency.\n", "versions": [{"version": "v1", "created": "Wed, 30 May 2018 07:59:12 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Wang", "Chujie", ""], ["Zhao", "Zhifeng", ""], ["Sun", "Qi", ""], ["Zhang", "Honggang", ""]]}, {"id": "1806.04585", "submitter": "Christos Liaskos K.", "authors": "Christos Liaskos, Ageliki Tsioliaridou, Andreas Pitsillides, Sotiris\n  Ioannidis, Ian Akyildiz", "title": "Using any Surface to Realize a New Paradigm for Wireless Communications", "comments": "Paper accepted as viewpoint article in Communications of the ACM.\n  (Accepted on 1-Mar-2018). This work was funded by the European Union via the\n  Horizon 2020: Future Emerging Topics call (FETOPEN-RIA), grant EU736876,\n  project VISORSURF: HyperSurfaces-A Hardware Platform for Software-driven\n  Functional Metasurfaces (http://www.visorsurf.eu/)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.ET cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article introduces an approach that could tame wireless channels, making\ntheir behavior deterministic and software-defined. We investigate the novel\nidea of HyperSurfaces, which are software-controlled metamaterials embedded in\nany surface in the environment. HyperSurfaces are materials that interact with\nelectromagnetic waves in a fully software-defined fashion, even unnaturally.\nCoating walls, doors, furniture and other objects with HyperSurfaces\nconstitutes the overall behavior of an indoor wireless environment\nprogrammable. Thus, the electromagnetic behavior of the environment as a whole\ncan be controlled and tailored to the needs of mobile devices within it.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 07:45:16 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Liaskos", "Christos", ""], ["Tsioliaridou", "Ageliki", ""], ["Pitsillides", "Andreas", ""], ["Ioannidis", "Sotiris", ""], ["Akyildiz", "Ian", ""]]}, {"id": "1806.04586", "submitter": "Davide Pedretti", "authors": "D. Pedretti, M. Bellato, R. Isocrate, A. Bergnoli, R. Brugnera, D.\n  Corti, F. Dal Corso, G. Galet, A. Garfagnini, A. Giaz, I. Lippi, F. Marini,\n  G. Andronico, V. Antonelli, M. Baldoncini, E. Bernieri, A. Brigatti, A.\n  Budano, M. Buscemi, S. Bussino, R. Caruso, D. Chiesa, C. Clementi, X. F.\n  Ding, S. Dusini, A. Fabbri, R. Ford, A. Formozov, M. Giammarchi, M. Grassi,\n  A. Insolia, P. Lombardi, F. Mantovani, S. M. Mari, C. Martellini, A. Martini,\n  E. Meroni, L. Miramonti, S. Monforte, P. Montini, M. Montuschi, M. Nastasi,\n  F. Ortica, A. Paoloni, E. Previtali, G. Ranucci, A. C. Re, B. Ricci, A.\n  Romani, G. Salamanna, F. H. Sawy, G. Settanta, M. Sisti, C. Sirignano, L.\n  Stanco, V. Strati, G. Verde", "title": "Nanoseconds Timing System Based on IEEE 1588 FPGA Implementation", "comments": "8 pages, 14 figures, proceedings of 21st IEEE Real Time Conference\n  Colonial Williamsburg 9-15 June 2018", "journal-ref": null, "doi": "10.1109/TNS.2019.2906045", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Clock synchronization procedures are mandatory in most physical experiments\nwhere event fragments are readout by spatially dislocated sensors and must be\nglued together to reconstruct key parameters (e.g. energy, interaction vertex\netc.) of the process under investigation. These distributed data readout\ntopologies rely on an accurate time information available at the frontend,\nwhere raw data are acquired and tagged with a precise timestamp prior to data\nbuffering and central data collecting. This makes the network complexity and\nlatency, between frontend and backend electronics, negligible within upper\nbounds imposed by the frontend data buffer capability. The proposed research\nwork describes an FPGA implementation of IEEE 1588 Precision Time Protocol\n(PTP) that exploits the CERN Timing, Trigger and Control (TTC) system as a\nmulticast messaging physical and data link layer. The hardware implementation\nextends the clock synchronization to the nanoseconds range, overcoming the\ntypical accuracy limitations inferred by computers Ethernet based Local Area\nNetwork (LAN). Establishing a reliable communication between master and timing\nreceiver nodes is essential in a message-based synchronization system. In the\nbackend electronics, the serial data streams synchronization with the global\nclock domain is guaranteed by an hardware-based finite state machine that scans\nthe bit period using a variable delay chain and finds the optimal sampling\npoint. The validity of the proposed timing system has been proved in\npoint-to-point data links as well as in star topology configurations over\nstandard CAT-5e cables. The results achieved together with weaknesses and\npossible improvements are hereby detailed.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 17:02:56 GMT"}, {"version": "v2", "created": "Tue, 19 Jun 2018 13:50:51 GMT"}], "update_date": "2019-09-04", "authors_parsed": [["Pedretti", "D.", ""], ["Bellato", "M.", ""], ["Isocrate", "R.", ""], ["Bergnoli", "A.", ""], ["Brugnera", "R.", ""], ["Corti", "D.", ""], ["Corso", "F. Dal", ""], ["Galet", "G.", ""], ["Garfagnini", "A.", ""], ["Giaz", "A.", ""], ["Lippi", "I.", ""], ["Marini", "F.", ""], ["Andronico", "G.", ""], ["Antonelli", "V.", ""], ["Baldoncini", "M.", ""], ["Bernieri", "E.", ""], ["Brigatti", "A.", ""], ["Budano", "A.", ""], ["Buscemi", "M.", ""], ["Bussino", "S.", ""], ["Caruso", "R.", ""], ["Chiesa", "D.", ""], ["Clementi", "C.", ""], ["Ding", "X. F.", ""], ["Dusini", "S.", ""], ["Fabbri", "A.", ""], ["Ford", "R.", ""], ["Formozov", "A.", ""], ["Giammarchi", "M.", ""], ["Grassi", "M.", ""], ["Insolia", "A.", ""], ["Lombardi", "P.", ""], ["Mantovani", "F.", ""], ["Mari", "S. M.", ""], ["Martellini", "C.", ""], ["Martini", "A.", ""], ["Meroni", "E.", ""], ["Miramonti", "L.", ""], ["Monforte", "S.", ""], ["Montini", "P.", ""], ["Montuschi", "M.", ""], ["Nastasi", "M.", ""], ["Ortica", "F.", ""], ["Paoloni", "A.", ""], ["Previtali", "E.", ""], ["Ranucci", "G.", ""], ["Re", "A. C.", ""], ["Ricci", "B.", ""], ["Romani", "A.", ""], ["Salamanna", "G.", ""], ["Sawy", "F. H.", ""], ["Settanta", "G.", ""], ["Sisti", "M.", ""], ["Sirignano", "C.", ""], ["Stanco", "L.", ""], ["Strati", "V.", ""], ["Verde", "G.", ""]]}, {"id": "1806.04587", "submitter": "Fatemeh Afghah", "authors": "Mehrdad Khaledi, Arnau Rovira-Sugranes, Fatemeh Afghah, Abolfazl Razi", "title": "On Greedy Routing in Dynamic UAV Networks", "comments": "7 pages, 5 figures, accepted in IEEE International Conference on\n  Sensing, Communication and Networking (SECON), Workshop on Communications,\n  Data Processing and Control for Unmanned Autonomous Systems (CPC-UAV)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unmanned aerial vehicles (UAVs), commonly known as drones, are becoming\nincreasingly popular for various applications. Freely flying drones create\nhighly dynamic environments, where conventional routing algorithms which rely\non stationary network contact graphs fail to perform efficiently. Also, link\nestablishment through exploring optimal paths using hello messages (as is used\nin AODV algorithm) deems extremely inefficient and costly for rapidly changing\nnetwork topologies.\n  In this paper, we present a distance-based greedy routing algorithm for UAV\nnetworks solely based on UAVs' local observations of their surrounding\nsubnetwork. Thereby, neither a central decision maker nor a time-consuming\nroute setup and maintenance mechanism are required. To evaluate the proposed\nmethod, we derive an analytical bound for the expected number of hops that a\npacket traverses. Also, we find the expected end-to-end distance traveled by\neach packet as well as the probability of successful delivery. The simulation\nresults verify the accuracy of the developed analytical expressions and show\nconsiderable improvement compared to centralized shortest path routing\nalgorithms.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 22:05:56 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Khaledi", "Mehrdad", ""], ["Rovira-Sugranes", "Arnau", ""], ["Afghah", "Fatemeh", ""], ["Razi", "Abolfazl", ""]]}, {"id": "1806.04588", "submitter": "Ali Esswie Dr.", "authors": "Ali A. Esswie, Klaus I. Pedersen", "title": "Multi-User Preemptive Scheduling for Critical Low Latency Communications\n  in 5G Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  5G new radio is envisioned to support three major service classes: enhanced\nmobile broadband (eMBB), ultra-reliable low-latency communications (URLLC), and\nmassive machine type communications. Emerging URLLC services require up to one\nmillisecond of communication latency with 99.999% success probability. Though,\nthere is a fundamental trade-off between system spectral efficiency (SE) and\nachievable latency. This calls for novel scheduling protocols which\ncross-optimize system performance on user-centric; instead of network-centric\nbasis. In this paper, we develop a joint multi-user preemptive scheduling\nstrategy to simultaneously cross-optimize system SE and URLLC latency. At each\nscheduling opportunity, available URLLC traffic is always given higher\npriority. When sporadic URLLC traffic appears during a transmission time\ninterval (TTI), proposed scheduler seeks for fitting the URLLC-eMBB traffic in\na multi-user transmission. If the available spatial degrees of freedom are\nlimited within a TTI, the URLLC traffic instantly overwrites part of the\nongoing eMBB transmissions to satisfy the URLLC latency requirements, at the\nexpense of minimal eMBB throughput loss. Extensive dynamic system level\nsimulations show that proposed scheduler provides significant performance gain\nin terms of eMBB SE and URLLC latency.\n", "versions": [{"version": "v1", "created": "Sun, 10 Jun 2018 11:12:37 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Esswie", "Ali A.", ""], ["Pedersen", "Klaus I.", ""]]}, {"id": "1806.04589", "submitter": "Fuhui Zhou", "authors": "Fuhui Zhou, Yongpeng Wu, Rose Qingyang Hu, and Yi Qian", "title": "Computation Rate Maximization in UAV-Enabled Wireless Powered\n  Mobile-Edge Computing Systems", "comments": "This paper has been accepted by IEEE JSAC", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.CE cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile edge computing (MEC) and wireless power transfer (WPT) are two\npromising techniques to enhance the computation capability and to prolong the\noperational time of low-power wireless devices that are ubiquitous in Internet\nof Things. However, the computation performance and the harvested energy are\nsignificantly impacted by the severe propagation loss. In order to address this\nissue, an unmanned aerial vehicle (UAV)-enabled MEC wireless powered system is\nstudied in this paper. The computation rate maximization problems in a\nUAV-enabled MEC wireless powered system are investigated under both partial and\nbinary computation offloading modes, subject to the energy harvesting causal\nconstraint and the UAV's speed constraint. These problems are non-convex and\nchallenging to solve. A two-stage algorithm and a three-stage alternative\nalgorithm are respectively proposed for solving the formulated problems. The\nclosed-form expressions for the optimal central processing unit frequencies,\nuser offloading time, and user transmit power are derived. The optimal\nselection scheme on whether users choose to locally compute or offload\ncomputation tasks is proposed for the binary computation offloading mode.\nSimulation results show that our proposed resource allocation schemes\noutperforms other benchmark schemes. The results also demonstrate that the\nproposed schemes converge fast and have low computational complexity.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 22:15:22 GMT"}, {"version": "v2", "created": "Tue, 17 Jul 2018 18:48:59 GMT"}], "update_date": "2018-07-19", "authors_parsed": [["Zhou", "Fuhui", ""], ["Wu", "Yongpeng", ""], ["Hu", "Rose Qingyang", ""], ["Qian", "Yi", ""]]}, {"id": "1806.04702", "submitter": "Dimitri Block", "authors": "Philip Soeffker, Dimitri Block, Nico Wiebusch, Uwe Meier", "title": "Resource Allocation for a Wireless Coexistence Management System Based\n  on Reinforcement Learning", "comments": "Submitted to the 23rd IEEE International Conference on Emerging\n  Technologies and Factory Automation (ETFA 2018)", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.LG cs.NI stat.ML", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  In industrial environments, an increasing amount of wireless devices are\nused, which utilize license-free bands. As a consequence of these mutual\ninterferences of wireless systems might decrease the state of coexistence.\nTherefore, a central coexistence management system is needed, which allocates\nconflict-free resources to wireless systems. To ensure a conflict-free resource\nutilization, it is useful to predict the prospective medium utilization before\nresources are allocated. This paper presents a self-learning concept, which is\nbased on reinforcement learning. A simulative evaluation of reinforcement\nlearning agents based on neural networks, called deep Q-networks and double\ndeep Q-networks, was realized for exemplary and practically relevant\ncoexistence scenarios. The evaluation of the double deep Q-network showed that\na prediction accuracy of at least 98 % can be reached in all investigated\nscenarios.\n", "versions": [{"version": "v1", "created": "Thu, 24 May 2018 12:05:30 GMT"}], "update_date": "2018-06-14", "authors_parsed": [["Soeffker", "Philip", ""], ["Block", "Dimitri", ""], ["Wiebusch", "Nico", ""], ["Meier", "Uwe", ""]]}, {"id": "1806.04951", "submitter": "Ioannis Mavromatis", "authors": "Ioannis Mavromatis and Andrea Tassi and Robert J. Piechocki and Andrew\n  Nix", "title": "A City-Scale ITS-G5 Network for Next-Generation Intelligent\n  Transportation Systems: Design Insights and Challenges", "comments": "Accepted for publication to AdHoc-Now 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As we move towards autonomous vehicles, a reliable Vehicle-to-Everything\n(V2X) communication framework becomes of paramount importance. In this paper we\npresent the development and the performance evaluation of a real-world\nvehicular networking testbed. Our testbed, deployed in the heart of the City of\nBristol, UK, is able to exchange sensor data in a V2X manner. We will describe\nthe testbed architecture and its operational modes. Then, we will provide some\ninsight pertaining the firmware operating on the network devices. The system\nperformance has been evaluated under a series of large-scale field trials,\nwhich have proven how our solution represents a low-cost high-quality framework\nfor V2X communications. Our system managed to achieve high packet delivery\nratios under different scenarios (urban, rural, highway) and for different\nlocations around the city. We have also identified the instability of the\npacket transmission rate while using single-core devices, and we present some\nfuture directions that will address that.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2018 11:19:02 GMT"}, {"version": "v2", "created": "Fri, 6 Jul 2018 01:11:21 GMT"}], "update_date": "2018-07-09", "authors_parsed": [["Mavromatis", "Ioannis", ""], ["Tassi", "Andrea", ""], ["Piechocki", "Robert J.", ""], ["Nix", "Andrew", ""]]}, {"id": "1806.05026", "submitter": "Florian Kauer", "authors": "Florian Kauer and Volker Turau", "title": "An Analytical Model for Wireless Mesh Networks with Collision-Free TDMA\n  and Finite Queues", "comments": "17 pages, 14 figures", "journal-ref": "EURASIP Journal on Wireless Communications and Networking 2018:149", "doi": "10.1186/s13638-018-1146-x", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Wireless mesh networks are a promising technology for connecting sensors and\nactuators with high flexibility and low investment costs. In industrial\napplications, however, reliability is essential. Therefore, two time-slotted\nmedium access methods, DSME and TSCH, were added to the IEEE 802.15.4 standard.\nThey allow collision-free communication in multi-hop networks and provide\nchannel hopping for mitigating external interferences. The slot schedule used\nin these networks is of high importance for the network performance. This paper\nsupports the development of efficient schedules by providing an analytical\nmodel for the assessment of such schedules, focused on TSCH. A Markov chain\nmodel for the finite queue on every node is introduced that takes the slot\ndistribution into account. The models of all nodes are interconnected to\ncalculate network metrics such as packet delivery ratio, end-to-end delay and\nthroughput. An evaluation compares the model with a simulation of the Orchestra\nschedule. The model is applied to Orchestra as well as to two simple\ndistributed scheduling algorithms to demonstrate the importance of\ntraffic-awareness for achieving high throughput.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2018 13:33:16 GMT"}], "update_date": "2018-06-15", "authors_parsed": [["Kauer", "Florian", ""], ["Turau", "Volker", ""]]}, {"id": "1806.05242", "submitter": "Mahdi Miraz", "authors": "Mahdi H. Miraz and Maaruf Ali", "title": "Blockchain Enabled Enhanced IoT Ecosystem Security", "comments": null, "journal-ref": "International Conference on International Conference on Emerging\n  Technologies in Computing 2018 (iCETiC '18) , 23rd -24th August, 2018, at\n  London Metropolitan University, London, UK, Published by Springer-Verlag", "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blockchain (BC), the technology behind the Bitcoin cryptocurrency system, is\nstarting to be adopted for ensuring enhanced security and privacy in the\nInternet of Things (IoT) ecosystem. Fervent research is currently being focused\nin both academia and industry in this domain. Proof of Work (PoW), a\ncryptographic puzzle, plays a vital role in ensuring BC security by maintaining\na digital ledger of transactions, which are considered to be incorruptible.\nFurthermore, BC uses a changeable Public Key (PK) to record the identity of\nusers, thus providing an extra layer of privacy. Not only in cryptocurrency has\nthe successful adoption of the BC been implemented, but also in multifaceted\nnon-monetary systems, such as in: distributed storage systems, proof of\nlocation and healthcare. Recent research articles and projects or applications\nwere surveyed to assess the implementation of the BC for IoT Security and\nidentify associated challenges and propose solutions for BC enabled enhanced\nsecurity for the IoT ecosystem.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 06:05:12 GMT"}], "update_date": "2018-06-15", "authors_parsed": [["Miraz", "Mahdi H.", ""], ["Ali", "Maaruf", ""]]}, {"id": "1806.05265", "submitter": "Ammar Gharaibeh", "authors": "Abdallah Khreishah, Sihua Shao, Ammar Gharaibeh, Moussa Ayyash, Hany\n  Elgala, Nirwan Ansari", "title": "A Hybrid RF-VLC System for Energy Efficient Wireless Access", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a new paradigm in designing and realizing energy\nefficient wireless indoor access networks, namely, a hybrid system enabled by\ntraditional RF access, such as WiFi, as well as the emerging visible light\ncommunication (VLC). VLC facilitates the great advantage of being able to\njointly perform illumination and communications, and little extra power beyond\nillumination is required to empower communications, thus rendering wireless\naccess with almost zero power consumption. On the other hand, when illumination\nis not required from the light source, the energy consumed by VLC could be more\nthan that consumed by the RF. By capitalizing on the above properties, the\nproposed hybrid RF-VLC system is more energy efficient and more adaptive to the\nillumination conditions than the individual VLC or RF systems. To demonstrate\nthe viability of the proposed system, we first formulate the problem of\nminimizing the power consumption of the hybrid RF-VLC system while satisfying\nthe users requests and maintaining acceptable level of illumination, which is\nNP-complete. Therefore, we divide the problem into two subproblems. In the\nfirst subproblems, we determine the set of VLC access points (AP) that needs to\nbe turned on to satisfy the illumination requirements. Given this set, we turn\nour attention to satisfying the users' requests for real-time communications,\nand we propose a randomized online algorithm that, against an oblivious\nadversary, achieves a competitive ratio of $\\log(N)\\log(M)$ with probability of\nsuccess $1 - \\frac{1}{N}$, where $N$ is the number of users and $M$ is the\nnumber of VLC and RF APs. We also show that the best online algorithm to solve\nthis problem can achieve a competitive ratio of $\\log(M)$. Simulation results\nfurther demonstrate the advantages of the hybrid system.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2018 20:57:02 GMT"}, {"version": "v2", "created": "Wed, 18 Jul 2018 08:43:17 GMT"}], "update_date": "2018-07-19", "authors_parsed": [["Khreishah", "Abdallah", ""], ["Shao", "Sihua", ""], ["Gharaibeh", "Ammar", ""], ["Ayyash", "Moussa", ""], ["Elgala", "Hany", ""], ["Ansari", "Nirwan", ""]]}, {"id": "1806.05380", "submitter": "Ming-Chun Lee", "authors": "Ming-Chun Lee, Mingyue Ji, Andreas F. Molisch, and Nishanth Sastry", "title": "Performance of Caching-Based D2D Video Distribution with Measured\n  Popularity Distributions", "comments": "Submitted to IEEE Globecom 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  On-demand video accounts for the majority of wireless data traffic. Video\ndistribution schemes based on caching combined with device-to-device (D2D)\ncommunications promise order-of-magnitude greater spectral efficiency for video\ndelivery, but hinge on the principle of `concentrated demand distributions.'\nThis paper presents, for the first time, the analysis and evaluations of the\nthroughput--outage tradeoff of such schemes based on measured cellular demand\ndistributions. In particular, we use a dataset with more than 100 million\nrequests from the BBC iPlayer, a popular video streaming service in the U.K.,\nas the foundation of the analysis and evaluations. We present an achievable\nscaling law based on the practical popularity distribution, and show that such\nscaling law is identical to those reported in the literature. We find that also\nfor the numerical evaluations based on a realistic setup, order-of-magnitude\nimprovements can be achieved. Our results indicate that the benefits promised\nby the caching-based D2D in the literature could be retained for cellular\nnetworks in practice.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2018 06:22:48 GMT"}, {"version": "v2", "created": "Thu, 16 May 2019 05:37:22 GMT"}], "update_date": "2019-05-17", "authors_parsed": [["Lee", "Ming-Chun", ""], ["Ji", "Mingyue", ""], ["Molisch", "Andreas F.", ""], ["Sastry", "Nishanth", ""]]}, {"id": "1806.05406", "submitter": "Kefan Chen", "authors": "Kefan Chen, Danfeng Shan, Xiaohui Luo, Tong Zhang, Yajun Yang, Ya\n  Zhao, Fengyuan Ren", "title": "Micro Congestion Control: Every Flow Deserves a Second Chance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today, considerable Internet traffic is sent from the datacenter and heads\nfor users. The characteristics of connections served by servers in datacenters\nare usually diverse and varied over time, with continuous upgrades in network\ninfrastructure and user devices. As a result, a specific congestion control\nalgorithm hardly accommodates the heterogeneity and performs well in various\nscenarios. In this work, we present Micro Congestion Control (MCC) --- a novel\nframework for Internet congestion control. With MCC, diverse algorithms can be\nassigned purposely to connections in one server to adapt to heterogeneity, and\ndifferent algorithms can be chosen in each connection's life cycle to keep pace\nwith the dynamic of network. We design and implement MCC in Linux, and the\nexperiments validate that MCC is capable of smoothly switching among various\ncandidate algorithms on the fly to achieve potential performance gain in the\nreal world. Meanwhile, the overheads introduced by MCC are moderate and\nacceptable.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2018 08:06:32 GMT"}, {"version": "v2", "created": "Mon, 22 Oct 2018 06:42:19 GMT"}], "update_date": "2018-10-23", "authors_parsed": [["Chen", "Kefan", ""], ["Shan", "Danfeng", ""], ["Luo", "Xiaohui", ""], ["Zhang", "Tong", ""], ["Yang", "Yajun", ""], ["Zhao", "Ya", ""], ["Ren", "Fengyuan", ""]]}, {"id": "1806.05776", "submitter": "Derya Malak", "authors": "Derya Malak and Muriel M\\'edard and Edmund M. Yeh", "title": "Tiny Codes for Guaranteeable Delay", "comments": "to appear in IEEE JSAC Special Issue on URLLC in Wireless Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Future 5G systems will need to support ultra-reliable low-latency\ncommunications scenarios. From a latency-reliability viewpoint, it is\ninefficient to rely on average utility-based system design. Therefore, we\nintroduce the notion of guaranteeable delay which is the average delay plus\nthree standard deviations of the mean. We investigate the trade-off between\nguaranteeable delay and throughput for point-to-point wireless erasure links\nwith unreliable and delayed feedback, by bringing together signal flow\ntechniques to the area of coding. We use tiny codes, i.e. sliding window by\ncoding with just 2 packets, and design three variations of selective-repeat ARQ\nprotocols, by building on the baseline scheme, i.e. uncoded ARQ, developed by\nAusavapattanakun and Nosratinia: (i) Hybrid ARQ with soft combining at the\nreceiver; (ii) cumulative feedback-based ARQ without rate adaptation; and (iii)\nCoded ARQ with rate adaptation based on the cumulative feedback. Contrasting\nthe performance of these protocols with uncoded ARQ, we demonstrate that HARQ\nperforms only slightly better, cumulative feedback-based ARQ does not provide\nsignificant throughput while it has better average delay, and Coded ARQ can\nprovide gains up to about 40% in terms of throughput. Coded ARQ also provides\ndelay guarantees, and is robust to various challenges such as imperfect and\ndelayed feedback, burst erasures, and round-trip time fluctuations. This\nfeature may be preferable for meeting the strict end-to-end latency and\nreliability requirements of future use cases of ultra-reliable low-latency\ncommunications in 5G, such as mission-critical communications and industrial\ncontrol for critical control messaging.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jun 2018 01:08:35 GMT"}, {"version": "v2", "created": "Fri, 1 Feb 2019 21:06:56 GMT"}], "update_date": "2019-02-05", "authors_parsed": [["Malak", "Derya", ""], ["Médard", "Muriel", ""], ["Yeh", "Edmund M.", ""]]}, {"id": "1806.05783", "submitter": "Michele Polese", "authors": "Menglei Zhang, Michele Polese, Marco Mezzavilla, Jing Zhu, Sundeep\n  Rangan, Shivendra Panwar, Michele Zorzi", "title": "Will TCP work in mmWave 5G Cellular Networks?", "comments": "7 pages, 4 figures, 2 tables. To be published in the IEEE\n  Communication Magazine", "journal-ref": null, "doi": "10.1109/MCOM.2018.1701370", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The vast available spectrum in the millimeter wave (mmWave) bands offers the\npossibility of multi-Gbps data rates for fifth generation (5G) cellular\nnetworks. However, mmWave capacity can be highly intermittent due to the\nvulnerability of mmWave signals to blockages and delays in directional\nsearching. Such highly variable links present unique challenges for adaptive\ncontrol mechanisms in transport layer protocols and end-to-end applications.\nThis paper considers the fundamental question of whether TCP - the most widely\nused transport protocol - will work in mmWave cellular systems. The paper\nprovides a comprehensive simulation study of TCP considering various factors\nsuch as the congestion control algorithm, including the recently proposed TCP\nBBR, edge vs. remote servers, handover and multi- connectivity, TCP packet size\nand 3GPP-stack parameters. We show that the performance of TCP on mmWave links\nis highly dependent on different combinations of these parameters, and identify\nthe open challenges in this area.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jun 2018 01:56:47 GMT"}, {"version": "v2", "created": "Sat, 6 Oct 2018 09:51:28 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Zhang", "Menglei", ""], ["Polese", "Michele", ""], ["Mezzavilla", "Marco", ""], ["Zhu", "Jing", ""], ["Rangan", "Sundeep", ""], ["Panwar", "Shivendra", ""], ["Zorzi", "Michele", ""]]}, {"id": "1806.05908", "submitter": "Mao Yang", "authors": "Qiao Qu, Bo Li, Mao Yang, Zhongjiang Yan, Annan Yang, Jian Yu, Ming\n  Gan, Yunbo Li, Xun Yang, Osama Aboul-Magd, Edward Au, Der-Jiunn Deng,\n  Kwang-Cheng Chen", "title": "Survey and Performance Evaluation of the Upcoming Next Generation WLAN\n  Standard - IEEE 802.11ax", "comments": "155 pages, 53 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the ever-increasing demand for wireless traffic and quality of serives\n(QoS), wireless local area networks (WLANs) have developed into one of the most\ndominant wireless networks that fully influence human life. As the most widely\nused WLANs standard, Institute of Electrical and Electronics Engineers (IEEE)\n802.11 will release the upcoming next generation WLANs standard amendment: IEEE\n802.11ax. This article comprehensively surveys and analyzes the application\nscenarios, technical requirements, standardization process, key technologies,\nand performance evaluations of IEEE 802.11ax. Starting from the technical\nobjectives and requirements of IEEE 802.11ax, this article pays special\nattention to high-dense deployment scenarios. After that, the key technologies\nof IEEE 802.11ax, including the physical layer (PHY) enhancements, multi-user\n(MU) medium access control (MU-MAC), spatial reuse (SR), and power efficiency\nare discussed in detail, covering both standardization technologies as well as\nthe latest academic studies. Furthermore, performance requirements of IEEE\n802.11ax are evaluated via a newly proposed systems and link-level integrated\nsimulation platform (SLISP). Simulations results confirm that IEEE 802.11ax\nsignificantly improves the user experience in high-density deployment, while\nsuccessfully achieves the average per user throughput requirement in project\nauthorization request (PAR) by four times compared to the legacy IEEE 802.11.\nFinally, potential advancement beyond IEEE 802.11ax are discussed to complete\nthis holistic study on the latest IEEE 802.11ax. To the best of our knowledge,\nthis article is the first study to directly investigate and analyze the latest\nstable version of IEEE 802.11ax, and the first work to thoroughly and deeply\nevaluate the compliance of the performance requirements of IEEE 802.11ax.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jun 2018 11:21:22 GMT"}], "update_date": "2018-06-18", "authors_parsed": [["Qu", "Qiao", ""], ["Li", "Bo", ""], ["Yang", "Mao", ""], ["Yan", "Zhongjiang", ""], ["Yang", "Annan", ""], ["Yu", "Jian", ""], ["Gan", "Ming", ""], ["Li", "Yunbo", ""], ["Yang", "Xun", ""], ["Aboul-Magd", "Osama", ""], ["Au", "Edward", ""], ["Deng", "Der-Jiunn", ""], ["Chen", "Kwang-Cheng", ""]]}, {"id": "1806.06125", "submitter": "Michele Polese", "authors": "Michele Polese, Michele Zorzi", "title": "Impact of Channel Models on the End-to-End Performance of mmWave\n  Cellular Networks", "comments": "6 pages, 3 figures. To be presented at IEEE SPAWC 2018, Kalamata,\n  Greece, June 2018", "journal-ref": null, "doi": "10.1109/SPAWC.2018.8445856", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Communication at mmWave frequencies is one of the major innovations of the\nfifth generation of cellular networks, because of the potential multi-gigabit\ndata rate given by the large amounts of available bandwidth. The mmWave\nchannel, however, makes reliable communications particularly challenging, given\nthe harsh propagation environment and the sensitivity to blockage. Therefore,\nproper modeling of the mmWave channel is fundamental for accurate results in\nsystem simulations of mmWave cellular networks. Nonetheless, complex models,\nsuch as the 3GPP channel model for frequencies above 6 GHz, may introduce a\nsignificant overhead in terms of computational complexity. In this paper we\ninvestigate the trade offs related to the accuracy and the simplicity of the\nchannel model in end-to-end network simulations, and the impact on the\nperformance evaluation of transport protocols.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jun 2018 21:02:39 GMT"}], "update_date": "2018-09-05", "authors_parsed": [["Polese", "Michele", ""], ["Zorzi", "Michele", ""]]}, {"id": "1806.06185", "submitter": "Jianli Pan", "authors": "Jianli Pan, Jianyu Wang, Austin Hester, Ismail Alqerm, Yuanni Liu,\n  Ying Zhao", "title": "EdgeChain: An Edge-IoT Framework and Prototype Based on Blockchain and\n  Smart Contracts", "comments": "14 pages, 13 figures, and 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The emerging Internet of Things (IoT) is facing significant scalability and\nsecurity challenges. On the one hand, IoT devices are \"weak\" and need external\nassistance. Edge computing provides a promising direction addressing the\ndeficiency of centralized cloud computing in scaling massive number of devices.\nOn the other hand, IoT devices are also relatively \"vulnerable\" facing\nmalicious hackers due to resource constraints. The emerging blockchain and\nsmart contracts technologies bring a series of new security features for IoT\nand edge computing. In this paper, to address the challenges, we design and\nprototype an edge-IoT framework named \"EdgeChain\" based on blockchain and smart\ncontracts. The core idea is to integrate a permissioned blockchain and the\ninternal currency or \"coin\" system to link the edge cloud resource pool with\neach IoT device' account and resource usage, and hence behavior of the IoT\ndevices. EdgeChain uses a credit-based resource management system to control\nhow much resource IoT devices can obtain from edge servers, based on\npre-defined rules on priority, application types and past behaviors. Smart\ncontracts are used to enforce the rules and policies to regulate the IoT device\nbehavior in a non-deniable and automated manner. All the IoT activities and\ntransactions are recorded into blockchain for secure data logging and auditing.\nWe implement an EdgeChain prototype and conduct extensive experiments to\nevaluate the ideas. The results show that while gaining the security benefits\nof blockchain and smart contracts, the cost of integrating them into EdgeChain\nis within a reasonable and acceptable range.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 05:13:56 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Pan", "Jianli", ""], ["Wang", "Jianyu", ""], ["Hester", "Austin", ""], ["Alqerm", "Ismail", ""], ["Liu", "Yuanni", ""], ["Zhao", "Ying", ""]]}, {"id": "1806.06188", "submitter": "Jianli Pan", "authors": "Jianli Pan, Yuanni Liu, Jianyu Wang, Austin Hester", "title": "Key Enabling Technologies for Secure and Scalable Future Fog-IoT\n  Architecture: A Survey", "comments": "7 pages, 5 figures, and 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fog or Edge computing has recently attracted broad attention from both\nindustry and academia. It is deemed as a paradigm shift from the current\ncentralized cloud computing model and could potentially bring a \"Fog-IoT\"\narchitecture that would significantly benefit the future ubiquitous Internet of\nThings (IoT) systems and applications. However, it takes a series of key\nenabling technologies including emerging technologies to realize such a vision.\nIn this article, we will survey these key enabling technologies with specific\nfocuses on security and scalability, which are two very important and\nmuch-needed characteristics for future large-scale deployment. We aim to draw\nan overall big picture of the future for the research and development in these\nareas.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 05:22:33 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Pan", "Jianli", ""], ["Liu", "Yuanni", ""], ["Wang", "Jianyu", ""], ["Hester", "Austin", ""]]}, {"id": "1806.06191", "submitter": "Jianli Pan", "authors": "Jianyu Wang, Jianli Pan, Flavio Esposito, Prasad Calyam, Zhicheng\n  Yang, Prasant Mohapatra", "title": "Edge Cloud Offloading Algorithms: Issues, Methods, and Perspectives", "comments": "23 pages, 9 figures, and 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile devices supporting the \"Internet of Things\" (IoT), often have limited\ncapabilities in computation, battery energy, and storage space, especially to\nsupport resource-intensive applications involving virtual reality (VR),\naugmented reality (AR), multimedia delivery and artificial intelligence (AI),\nwhich could require broad bandwidth, low response latency and large\ncomputational power. Edge cloud or edge computing is an emerging topic and\ntechnology that can tackle the deficiency of the currently centralized-only\ncloud computing model and move the computation and storage resource closer to\nthe devices in support of the above-mentioned applications. To make this\nhappen, efficient coordination mechanisms and \"offloading\" algorithms are\nneeded to allow the mobile devices and the edge cloud to work together\nsmoothly. In this survey paper, we investigate the key issues, methods, and\nvarious state-of-the-art efforts related to the offloading problem. We adopt a\nnew characterizing model to study the whole process of offloading from mobile\ndevices to the edge cloud. Through comprehensive discussions, we aim to draw an\noverall \"big picture\" on the existing efforts and research directions. Our\nstudy also indicates that the offloading algorithms in edge cloud have\ndemonstrated profound potentials for future technology and application\ndevelopment.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 05:50:46 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Wang", "Jianyu", ""], ["Pan", "Jianli", ""], ["Esposito", "Flavio", ""], ["Calyam", "Prasad", ""], ["Yang", "Zhicheng", ""], ["Mohapatra", "Prasant", ""]]}, {"id": "1806.06258", "submitter": "Joberto Martins Prof. Dr.", "authors": "Rafael Freitas Reale, Romildo Martins da S. Bezerra and Joberto S. B.\n  Martins", "title": "Applying Autonomy with Bandwidth Allocation Models", "comments": null, "journal-ref": "International Journal of Communication Systems, Volume 29, Issue\n  13, 10 September 2016, pages 2028 - 2040", "doi": "10.5281/zenodo.1287913", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Bandwidth Allocation Models (BAMs) are resource allocation methods used for\nnetworks in general. BAMs are currently applied for handling resources such as\nbandwidth allocation in MPLS DS-TE networks (LSP setup). In general, BAMs\ndefines resource restrictions by class and allocate the available resources on\ndemand. This is frequently necessary to manage large and complex systems like\nrouting networks. GBAM is a new generalized BAM that, by configuration,\nincorporates the behavior of existing BAMs (MAM, RDM, G-RDM and\nAllocTC-Sharing). In effect, any current available BAM behavior is reproduced\nby G-BAM by simply adjusting its configuration parameters. This paper focuses\non investigating the applicability of using autonomy together with Bandwidth\nAllocation Models (BAMs) for improve performance and facilitating the\nmanagement of MPLS DS-TE networks. It is investigated the applicability of BAM\nswitching using a framework with autonomic characteristics. In brief, it is\ninvestigated the switching among BAM behaviors and BAM reconfiguration with\ndistinct network traffic scenarios by using GBAM. Simulation results suggest\nthat the autonomic switching of BAM behaviors based on high-level management\nrules (SLAs, QoS or other police) may result in improving overall network\nmanagement and operational parameters such as link utilization and preemption.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 16:06:10 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Reale", "Rafael Freitas", ""], ["Bezerra", "Romildo Martins da S.", ""], ["Martins", "Joberto S. B.", ""]]}, {"id": "1806.06275", "submitter": "Scale Uwadia Maxwell Osagie", "authors": "Maxwell Scale Uwadia Osagie, C. I. Okoye and Amenze Joy Osagie", "title": "Mitigating Botnet Attack Using Encapsulated Detection Mechanism (EDM)", "comments": "This paper addresses critical area of network", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Botnet as it is popularly called became fashionable in recent times owing to\nit embedded force on network servers. Botnet has an exponential growth of about\n170, 000 within network server and client infrastructures per day. The\nnetworking environment on monthly basis battle over 5 million bots. Nigeria as\na country loses above one hundred and twenty five (N125) billion naira to\nnetwork fraud annually, end users such as Banks and other financial\ninstitutions battle daily the botnet threats.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 18:39:20 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Osagie", "Maxwell Scale Uwadia", ""], ["Okoye", "C. I.", ""], ["Osagie", "Amenze Joy", ""]]}, {"id": "1806.06294", "submitter": "Sergi Abadal", "authors": "Sergi Abadal, Albert Mestres, Josep Torrellas, Eduard Alarc\\'on,\n  Albert Cabellos-Aparicio", "title": "Medium Access Control in Wireless Network-on-Chip: A Context Analysis", "comments": "To appear in IEEE Communications Magazine", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless on-chip communication is a promising candidate to address the\nperformance and efficiency issues that arise when scaling current\nNetwork-on-Chip (NoC) techniques to manycore processors. A Wireless\nNetwork-on-Chip (WNoC) can serve global and broadcast traffic with ultra-low\nlatency even in thousand-core chips, thus acting as a natural complement of\nconventional and throughput-oriented wireline NoCs. However, the development of\nMedium Access Control (MAC) strategies needed to efficiently share the wireless\nmedium among the increasing number of cores remains as a considerable challenge\ngiven the singularities of the environment and the novelty of the research\narea. In this position paper, we present a context analysis describing the\nphysical constraints, performance objectives, and traffic characteristics of\nthe on-chip communication paradigm. We summarize the main differences with\nrespect to traditional wireless scenarios, to then discuss their implications\non the design of MAC protocols for manycore WNoCs, with the ultimate goal of\nkickstarting this arguably unexplored research area.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 21:07:44 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Abadal", "Sergi", ""], ["Mestres", "Albert", ""], ["Torrellas", "Josep", ""], ["Alarcón", "Eduard", ""], ["Cabellos-Aparicio", "Albert", ""]]}, {"id": "1806.06303", "submitter": "Divya Chitimalla", "authors": "Divya Chitimalla, Biswanath Mukherjee, Massimo Tornatore, Sang-Soo\n  Lee, Han-Hyub Lee, Soomyung Park, Hwan Seok Chung", "title": "QoE Enhancement Schemes for Video in Converged OFDMA Wireless Networks\n  and EPONs", "comments": "Journal of Optical Communications and Networking, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bandwidth requirements of both wireless and wired clients in access networks\ncontinue to increase rapidly, primarily due to the growth of video traffic.\nApplication awareness can be utilized in access networks to optimize quality of\nexperience (QoE) of end clients. In this study, we utilize information at the\nclient-side application (e.g., video resolution) to achieve superior resource\nallocation that improves user QoE. We emphasize optimizing QoE of the system\nrather than quality of service (QoS), as user satisfaction directly relies on\nQoE and optimizing QoS does not necessarily optimize QoE, as shown in this\nstudy. We propose application-aware resource-allocation schemes on an Ethernet\npassive optical network (EPON), which supports wireless (utilizing orthogonal\nfrequency division multiple access) and wired clients running video-conference\napplications. Numerical results show that the application-aware\nresource-allocation schemes improve QoE for video-conference applications for\nwired and wireless clients.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 22:02:54 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Chitimalla", "Divya", ""], ["Mukherjee", "Biswanath", ""], ["Tornatore", "Massimo", ""], ["Lee", "Sang-Soo", ""], ["Lee", "Han-Hyub", ""], ["Park", "Soomyung", ""], ["Chung", "Hwan Seok", ""]]}, {"id": "1806.06306", "submitter": "Divya Chitimalla", "authors": "Divya Chitimalla, Koteswararao Kondepu, Luca Valcarenghi, Massimo\n  Tornatore, Biswanath Mukherjee", "title": "5G fronthaul-latency and jitter studies of CPRI over ethernet", "comments": "IEEE/OSA Journal of Optical Communications and Networking 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Common Public Radio Interface (CPRI) is a successful industry cooperation\ndefining the publicly available specification for the key internal interface of\nradio base stations between the radio equipment control (REC) and the radio\nequipment (RE) in the fronthaul of mobile networks. However, CPRI is expensive\nto deploy, consumes large bandwidth, and currently is statically configured. On\nthe other hand, an Ethernet-based mobile fronthaul will be cost-efficient and\nmore easily reconfigurable. Encapsulating CPRI over Ethernet (CoE) is an\nattractive solution, but stringent CPRI requirements such as delay and jitter\nare major challenges that need to be met to make CoE a reality. This study\ninvestigates whether CoE can meet delay and jitter requirements by performing\nFPGA-based Verilog experiments and simulations. Verilog experiments show that\nCoE encapsulation with fixed Ethernet frame size requires about tens of\nmicroseconds. Numerical experiments show that the proposed scheduling policy of\nCoE flows on Ethernet can reduce jitter when redundant Ethernet capacity is\nprovided. The reduction in jitter can be as large as 1 {\\mu}s, hence making\nEthernet-based mobile fronthaul a credible technology.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 22:17:30 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Chitimalla", "Divya", ""], ["Kondepu", "Koteswararao", ""], ["Valcarenghi", "Luca", ""], ["Tornatore", "Massimo", ""], ["Mukherjee", "Biswanath", ""]]}, {"id": "1806.06507", "submitter": "Pan Wang", "authors": "Xuejiao Chen, Jiahui Yu, Feng Ye, Pan Wang", "title": "A Hierarchical Approach to Encrypted Data Packet Classification in Smart\n  Home Gateways", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the pervasive network based services in smart homes, traditional network\nmanagement cannot guarantee end-user quality-of-experience (QoE) for all\napplications. End-user QoE must be supported by efficient network\nquality-of-service (QoS) measurement and efficient network resource allocation.\nWith the software-defined network technology, the core network may be\ncontrolled more efficiently by a network service provider. However, end-to-end\nnetwork QoS can hardly be improved the managing the core network only. In this\npaper, we propose an encrypted packet classification scheme for smart home\ngateways to improve end-to-end QoS measurement from the network operator side.\nFurthermore, other services such as statistical data collecting, billing to\nservice providers, etc., can be provided without compromising end-user privacy\nnor security of a network. The proposed encrypted packet classification scheme\nhas a two-level hierarchical structure. One is the service level, which is\nbased on applications that have the same network QoS requirements. A faster\nclassification scheme based on deep learning is proposed to achieve real-time\nclassification with high accuracy. The other one is the application level,\nwhich is based on fine-grained applications. A non-real-time classifier can be\napplied to provide high accuracy. Evaluation is conducted on both level\nclassifiers to demonstrate the efficiency and accuracy of the two types of\nclassifiers.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jun 2018 06:07:34 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Chen", "Xuejiao", ""], ["Yu", "Jiahui", ""], ["Ye", "Feng", ""], ["Wang", "Pan", ""]]}, {"id": "1806.06620", "submitter": "Robert Falkenberg", "authors": "Robert Falkenberg and Benjamin Sliwa and Nico Piatkowski and Christian\n  Wietfeld", "title": "Machine Learning Based Uplink Transmission Power Prediction for LTE and\n  Upcoming 5G Networks using Passive Downlink Indicators", "comments": null, "journal-ref": "2018 IEEE 88th Vehicular Technology Conference (VTC-Fall)", "doi": "10.1109/VTCFall.2018.8690629", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Energy-aware system design is an important optimization task for static and\nmobile Internet of Things (IoT)-based sensor nodes, especially for highly\nresource-constrained vehicles such as mobile robotic systems. For 4G/5G-based\ncellular communication systems, the effective transmission power of uplink data\ntransmissions is of crucial importance for the overall system power\nconsumption. Unfortunately, this information is usually hidden within\noff-the-shelf modems and mobile handsets and can therefore not be exploited for\nenabling green communication. Moreover, the dynamic transmission power control\nbehavior of the mobile device is not even explicitly modeled in most of the\nestablished simulation frameworks. In this paper, we present a novel machine\nlearning-based approach for forecasting the resulting uplink transmission power\nused for data transmissions based on the available passive network quality\nindicators and application-level information. The model is derived from\ncomprehensive field measurements of drive tests performed in a public cellular\nnetwork and can be parameterized for integrating all measurements a given\ntarget platform is able to provide into the prediction process. In a comparison\nof three different machine learning methods, Random-Forest models thoroughly\nperformed best with a mean average error of 3.166 dB. As the absolute sum of\nerrors converges towards zero and falls below 1 dB after 28 predictions in\naverage, the approach is well-suited for long-term power estimations.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jun 2018 12:14:32 GMT"}, {"version": "v2", "created": "Wed, 19 Feb 2020 09:42:18 GMT"}], "update_date": "2020-02-20", "authors_parsed": [["Falkenberg", "Robert", ""], ["Sliwa", "Benjamin", ""], ["Piatkowski", "Nico", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1806.06898", "submitter": "Xingqin Lin", "authors": "Xingqin Lin, Jingya Li, Robert Baldemair, Thomas Cheng, Stefan\n  Parkvall, Daniel Larsson, Havish Koorapaty, Mattias Frenne, Sorour Falahati,\n  Asbj\\\"orn Gr\\\"ovlen, Karl Werner", "title": "5G New Radio: Unveiling the Essentials of the Next Generation Wireless\n  Access Technology", "comments": "8 pages, 5 figures, submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The 5th generation (5G) wireless access technology, known as new radio (NR),\nwill address a variety of usage scenarios from enhanced mobile broadband to\nultra-reliable low-latency communications to massive machine type\ncommunications. Key technology features include ultra-lean transmission,\nsupport for low latency, advanced antenna technologies, and spectrum\nflexibility including operation in high frequency bands and inter-working\nbetween high and low frequency bands. This article provides an overview of the\nessentials of the state of the art in 5G wireless technology represented by the\n3GPP NR technical specifications, with a focus on the physical layer. We\ndescribe the fundamental concepts of 5G NR, explain in detail the design of\nphysical channels and reference signals, and share the various design\nrationales influencing standardization.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jun 2018 19:23:39 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Lin", "Xingqin", ""], ["Li", "Jingya", ""], ["Baldemair", "Robert", ""], ["Cheng", "Thomas", ""], ["Parkvall", "Stefan", ""], ["Larsson", "Daniel", ""], ["Koorapaty", "Havish", ""], ["Frenne", "Mattias", ""], ["Falahati", "Sorour", ""], ["Grövlen", "Asbjörn", ""], ["Werner", "Karl", ""]]}, {"id": "1806.07038", "submitter": "Devashish Gosain", "authors": "H. B. Acharya, Sambuddho Chakravarty, Devashish Gosain", "title": "Few Throats to Choke: On the Current Structure of the Internet", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The original design of the Internet was a resilient, distributed system, that\nmaybe able to route around (and therefore recover from) massive disruption ---\nup to and including nuclear war. However, network routing effects and business\ndecisions cause traffic to often be routed through a relatively small set of\nAutonomous Systems (ASes). This is not merely an academic issue; it has\npractical implications --- some of these frequently appearing ASes are hosted\nin censorious nations. Other than censoring their own citizens' network access,\nsuch ASes may inadvertently filter traffic for other foreign customer ASes.\n  In this paper, we examine the extent of routing centralization in the\nInternet; identify the major players who control the \"Internet backbone\"; and\npoint out how many of these are, in fact, under the jurisdiction of censorious\ncountries (specifically, Russia, China, and India). Further, we show that China\nand India are not only the two largest nations by number of Internet users, but\nthat many users in free and democratic countries are affected by collateral\ndamage caused due to censorship by such countries.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 04:39:29 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Acharya", "H. B.", ""], ["Chakravarty", "Sambuddho", ""], ["Gosain", "Devashish", ""]]}, {"id": "1806.07055", "submitter": "Guohao Lan", "authors": "Guohao Lan, Dong Ma, Weitao Xu, Mahbub Hassan, Wen Hu", "title": "Capacitor Based Activity Sensing for Kinetic Powered Wearable IoTs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.ET cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a novel use of the conventional energy storage component, i.e.,\ncapacitor, in kinetic-powered wearable IoTs as a sensor to detect human\nactivities. Since different activities accumulate energies in the capacitor at\ndifferent rates, these activities can be detected directly by observing the\ncharging rate of the capacitor. The key advantage of the proposed capacitor\nbased activity sensing mechanism, called CapSense, is that it obviates the need\nfor sampling the motion signal during the activity detection period thus\nsignificantly saving power consumption of the wearable device. A challenge we\nface is that capacitors are inherently non-linear energy accumulators, which,\neven for the same activity, leads to significant variations in charging rates\nat different times depending on the current charge level of the capacitor. We\nsolve this problem by jointly configuring the parameters of the capacitor and\nthe associated energy harvesting circuits, which allows us to operate on\ncharging cycles that are approximately linear. We design and implement a\nkinetic-powered shoe sole and conduct experiments with 10 subjects. Our results\nshow that CapSense can classify five different daily activities with 95%\naccuracy while consuming 73% less system power compared to conventional motion\nsignal based activity detection.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 06:00:46 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Lan", "Guohao", ""], ["Ma", "Dong", ""], ["Xu", "Weitao", ""], ["Hassan", "Mahbub", ""], ["Hu", "Wen", ""]]}, {"id": "1806.07056", "submitter": "Vuk Marojevic", "authors": "Marti Floriach-Pigem, Guillem Xercavins-Torregrosa, Antoni\n  Gelonch-Bosch, Vuk Marojevic", "title": "Creating Tailored and Adaptive Network Services with the Open\n  Orchestration C-RAN Framework", "comments": "IEEE 5G World Forum 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Next generation wireless communications networks will leverage\nsoftware-defined radio and networking technologies, combined with cloud and fog\ncomputing. A pool of resources can then be dynamically allocated to create\npersonalized network services (NSs). The enabling technologies are abstraction,\nvirtualization and consolidation of resources, automatization of processes, and\nprogrammatic provisioning and orchestration. ETSI's network functions\nvirtualization (NFV) management and orchestration (MANO) framework provides the\narchitecture and specifications of the management layers. We introduce OOCRAN,\nan open-source software framework and testbed that extends existing NFV\nmanagement solutions by incorporating the radio communications layers. This\npaper presents OOCRAN and illustrates how it monitors and manages the pool of\nresources for creating tailored NSs. OOCRAN can automate NS reconfiguration,\nbut also facilitates user control. We demonstrate the dynamic deployment of\ncellular NSs and discuss the challenges of dynamically creating and managing\ntailored NSs on shared infrastructure.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 06:00:56 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Floriach-Pigem", "Marti", ""], ["Xercavins-Torregrosa", "Guillem", ""], ["Gelonch-Bosch", "Antoni", ""], ["Marojevic", "Vuk", ""]]}, {"id": "1806.07059", "submitter": "Vuk Marojevic", "authors": "Vuk Marojevic, Shem Kikamaze, Randall Nealy, Carl Dietrich", "title": "5G-CORNET: Platform as a Service", "comments": "IEEE 5G World Forum 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Practical testing of the latest wireless communications standards requires\nthe availability of flexible radio frequency hardware, networking and computing\nresources. We are providing a Cloud-based infrastructure which offers the\nnecessary resources to carry out tests of the latest 5G standards. The testbed\nprovides a Cloud-based Infrastructure as a Service. The research community can\naccess hardware and software resources through a virtual plat-form that enables\nisolation and customization of experiments. In other words, researchers have\ncontrol over the preferred experimental architecture and can run concurrent\nexperiments on the same testbed. This paper introduces the resources that can\nbe used to develop 5G testbeds and experiments.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 06:14:00 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Marojevic", "Vuk", ""], ["Kikamaze", "Shem", ""], ["Nealy", "Randall", ""], ["Dietrich", "Carl", ""]]}, {"id": "1806.07158", "submitter": "Luca Vassio Mr.", "authors": "Luca Vassio, Idilio Drago, Marco Mellia, Zied Ben Houidi, Mohamed\n  Lamine Lamali", "title": "You, the Web and Your Device: Longitudinal Characterization of Browsing\n  Habits", "comments": "30 pages. ACM Transactions on the Web. 12, 4, Article 24 (November\n  2018), 30 pages", "journal-ref": "ACM Trans. Web 12, 4, Article 24 (November 2018), 30 pages", "doi": "10.1145/3231466", "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding how people interact with the web is key for a variety of\napplications, e.g., from the design of effective web pages to the definition of\nsuccessful online marketing campaigns. Browsing behavior has been traditionally\nrepresented and studied by means of clickstreams, i.e., graphs whose vertices\nare web pages, and edges are the paths followed by users. Obtaining large and\nrepresentative data to extract clickstreams is however challenging. The\nevolution of the web questions whether browsing behavior is changing and, by\nconsequence, whether properties of clickstreams are changing. This paper\npresents a longitudinal study of clickstreams in from 2013 to 2016. We evaluate\nan anonymized dataset of HTTP traces captured in a large ISP, where thousands\nof households are connected. We first propose a methodology to identify actual\nURLs requested by users from the massive set of requests automatically fired by\nbrowsers when rendering web pages. Then, we characterize web usage patterns and\nclickstreams, taking into account both the temporal evolution and the impact of\nthe device used to explore the web. Our analyses precisely quantify various\naspects of clickstreams and uncover interesting patterns, such as the typical\nshort paths followed by people while navigating the web, the fast increasing\ntrend in browsing from mobile devices and the different roles of search engines\nand social networks in promoting content. Finally, we contribute a dataset of\nanonymized clickstreams to the community to foster new studies (anonymized\nclickstreams are available to the public at\nhttp://bigdata.polito.it/clickstream).\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 11:25:32 GMT"}, {"version": "v2", "created": "Tue, 4 May 2021 10:37:04 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Vassio", "Luca", ""], ["Drago", "Idilio", ""], ["Mellia", "Marco", ""], ["Houidi", "Zied Ben", ""], ["Lamali", "Mohamed Lamine", ""]]}, {"id": "1806.07178", "submitter": "Zheng Chen", "authors": "Zheng Chen, Emil Bj\\\"ornson, Erik G. Larsson", "title": "When Is the Achievable Rate Region Convex in Two-User Massive MIMO\n  Systems?", "comments": "4 pages, 3 figures, published in IEEE Wireless Communications Letters", "journal-ref": null, "doi": "10.1109/LWC.2018.2825443", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This letter investigates the achievable rate region in Massive\nmultiple-input-multiple-output (MIMO) systems with two users, with focus on the\ni.i.d.~Rayleigh fading and line-of-sight (LoS) scenarios. If the rate region is\nconvex, spatial multiplexing is preferable to orthogonal scheduling, while the\nopposite is true for non-convex regions. We prove that the uplink and downlink\nrate regions with i.i.d.~Rayleigh fading are convex, while the convexity in LoS\ndepends on parameters such as angular user separation, number of antennas, and\nsignal-to-noise ratio (SNR).\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 12:24:42 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Chen", "Zheng", ""], ["Björnson", "Emil", ""], ["Larsson", "Erik G.", ""]]}, {"id": "1806.07271", "submitter": "Ahmed Arafa", "authors": "Ahmed Arafa, Jing Yang, Sennur Ulukus, H. Vincent Poor", "title": "Age-Minimal Transmission for Energy Harvesting Sensors with Finite\n  Batteries: Online Policies", "comments": "Submitted to IEEE Transactions on Information Theory, June 2018.\n  arXiv admin note: text overlap with arXiv:1802.02129, arXiv:1802.01563", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI eess.SP math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An energy-harvesting sensor node that is sending status updates to a\ndestination is considered. The sensor is equipped with a battery of finite size\nto save its incoming energy, and consumes one unit of energy per status update\ntransmission, which is delivered to the destination instantly over an\nerror-free channel. The setting is online in which the harvested energy is\nrevealed to the sensor causally over time, and the goal is to design status\nupdate transmission policy such that the long term average age of information\n(AoI) is minimized. AoI is defined as the time elapsed since the latest update\nhas reached at the destination. Two energy arrival models are considered: a\nrandom battery recharge (RBR) model, and an incremental battery recharge (IBR)\nmodel. In both models, energy arrives according to a Poisson process with unit\nrate, with values that completely fill up the battery in the RBR model, and\nwith values that fill up the battery incrementally, unit-by-unit, in the IBR\nmodel. The key approach to characterizing the optimal status update policy for\nboth models is showing the optimality of renewal policies, in which the\ninter-update times follow a specific renewal process that depends on the energy\narrival model and the battery size. It is then shown that the optimal renewal\npolicy has an energy-dependent threshold structure, in which the sensor sends a\nstatus update only if the AoI grows above a certain threshold that depends on\nthe energy available. For both the RBR and the IBR models, the optimal\nenergy-dependent thresholds are characterized explicitly, i.e., in closed-form,\nin terms of the optimal long term average AoI. It is also shown that the\noptimal thresholds are monotonically decreasing in the energy available in the\nbattery, and that the smallest threshold, which comes in effect when the\nbattery is full, is equal to the optimal long term average AoI.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jun 2018 17:50:20 GMT"}, {"version": "v2", "created": "Thu, 9 May 2019 15:05:00 GMT"}], "update_date": "2019-05-10", "authors_parsed": [["Arafa", "Ahmed", ""], ["Yang", "Jing", ""], ["Ulukus", "Sennur", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1806.07292", "submitter": "Joberto Martins Prof. Dr.", "authors": "Rafael Freitas Reale, Romildo Martins da S. Bezerra and Joberto S. B.\n  Martins", "title": "G-BAM: A Generalized Bandwidth Allocation Model for IP/MPLS/DS-TE\n  Networks", "comments": null, "journal-ref": "International Journal of Computer Information Systems and\n  Industrial Management Applications, vol 6, pp 635 643, Dec 2014", "doi": "10.5281/zenodo.1292771", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Bandwidth Allocation Models (BAMs) configure and handle resource allocation\n(bandwidth, LSPs, fiber) in networks in general (IP/MPLS/DS-TE, optical domain,\nother). BAMs currently available for IP/MPLS/DS-TE networks (MAM, RDM, G-RDM\nand AllocTC-Sharing) basically define resource restrictions (bandwidth) by\nclass (traffic class, application class, user class or other grouping criteria)\nand allocate on demand this resource. There is a BAM allocation policy inherent\nfor each existing model which behaves differently under distinct network state,\nsuch as heavy traffic loads and dynamic traffic and/or application scenarios. A\ngeneralized Bandwidth Allocation Model (G-BAM) is proposed in this paper.\nG-BAM, firstly, incorporates the inherent behavior of currently used BAMs such\nas MAM, RDM, G-RDM and AllocTC-Sharing in IP/MPLS/DS-TE context. G-BAM,\nsecondly, proposes a new policy/ behavior allocation in addition to existing\nones in which additional private resources are incorporated. G-BAM, thirdly,\nallows a smoother BAM policy transition among existing policy alternatives\nresulting from MAM, RDM and AllocTC-Sharing adoption independently. The paper\nfocuses on the first characteristics of G-BAM which is to reproduce MAM, RDM\nand AllocTC-Sharing behaviors. As such, the required configuration to achieve\nMAM, RDM and AllocTC-Sharing behaviors is presented followed by a proof of\nconcept. Authors argue that the G-BAM reproducibility characteristics may\nimprove overall network resource utilization under distinct traffic profiles.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 14:52:12 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Reale", "Rafael Freitas", ""], ["Bezerra", "Romildo Martins da S.", ""], ["Martins", "Joberto S. B.", ""]]}, {"id": "1806.07302", "submitter": "Nicolae Paladi", "authors": "Nicolae Paladi, Linus Karlsson and Khalid Elbashir", "title": "Trust Anchors in Software Defined Networks", "comments": null, "journal-ref": null, "doi": "10.1007/978-3-319-98989-1_24", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in software virtualization and network processing lead to increasing\nnetwork softwarization. Software network elements running on commodity\nplatforms replace or complement hardware components in cloud and mobile network\ninfrastructure. However, such com- modity platforms have a large attack surface\nand often lack granular control and tight integration of the underlying\nhardware and software stack. Often, software network elements are either\nthemselves vulnerable to software attacks or can be compromised through the\nbloated trusted computing base. To address this, we protect the core security\nassets of network elements - authentication credentials and cryptographic\ncontext - by provisioning them to and maintaining them exclusively in isolated\nexecution environments. We complement this with a secure and scalable mechanism\nto enroll network elements into software defined networks. Our evaluation\nresults show a negligible impact on run-time performance and only a moderate\nperformance impact at the deployment stage.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 15:17:56 GMT"}], "update_date": "2018-09-17", "authors_parsed": [["Paladi", "Nicolae", ""], ["Karlsson", "Linus", ""], ["Elbashir", "Khalid", ""]]}, {"id": "1806.07316", "submitter": "Zarrar Yousaf", "authors": "Faqir Zarrar Yousaf, Michael Bredel, Sibylle Schaller, and Fabian\n  Schneider", "title": "NFV and SDN - Key Technology Enablers for 5G Networks", "comments": "This is an accepted version and consists of 11 pages, 9 figures and\n  32 references", "journal-ref": "F. Z. Yousaf, M. Bredel, S. Schaller and F. Schneider, \"NFV and\n  SDN - Key Technology Enablers for 5G Networks,\" in IEEE Journal on Selected\n  Areas in Communications, vol. 35, no. 11, pp. 2468 - 2478, Nov. 2017", "doi": "10.1109/JSAC.2017.2760418", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Communication networks are undergoing their next evolutionary step towards\n5G. The 5G networks are envisioned to provide a flexible, scalable, agile and\nprogrammable network platform over which different services with varying\nrequirements can be deployed and managed within strict performance bounds. In\norder to address these challenges a paradigm shift is taking place in the\ntechnologies that drive the networks, and thus their architecture. Innovative\nconcepts and techniques are being developed to power the next generation mobile\nnetworks. At the heart of this development lie Network Function Virtualization\nand Software Defined Networking technologies, which are now recognized as being\ntwo of the key technology enablers for realizing 5G networks, and which have\nintroduced a major change in the way network services are deployed and\noperated. For interested readers that are new to the field of SDN and NFV this\npaper provides an overview of both these technologies with reference to the 5G\nnetworks. Most importantly it describes how the two technologies complement\neach other and how they are expected to drive the networks of near future.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 15:49:47 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Yousaf", "Faqir Zarrar", ""], ["Bredel", "Michael", ""], ["Schaller", "Sibylle", ""], ["Schneider", "Fabian", ""]]}, {"id": "1806.07334", "submitter": "Jun Guo", "authors": "Jun Guo and Hamid Jafarkhani", "title": "Movement-efficient Sensor Deployment in Wireless Sensor Networks with\n  Limited Communication Range", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a mobile wireless sensor network (MWSN) consisting of multiple\nmobile sensors or robots. Three key factors in MWSNs, sensing quality, energy\nconsumption, and connectivity, have attracted plenty of attention, but the\ninteraction of these factors is not well studied. To take all the three factors\ninto consideration, we model the sensor deployment problem as a constrained\nsource coding problem. %, which can be applied to different coverage tasks,\nsuch as area coverage, target coverage, and barrier coverage. Our goal is to\nfind an optimal sensor deployment (or relocation) to optimize the sensing\nquality with a limited communication range and a specific network lifetime\nconstraint. We derive necessary conditions for the optimal sensor deployment in\nboth homogeneous and heterogeneous MWSNs. According to our derivation, some\nsensors are idle in the optimal deployment of heterogeneous MWSNs. Using these\nnecessary conditions, we design both centralized and distributed algorithms to\nprovide a flexible and explicit trade-off between sensing uncertainty and\nnetwork lifetime. The proposed algorithms are successfully extended to more\napplications, such as area coverage and target coverage, via properly selected\ndensity functions. Simulation results show that our algorithms outperform the\nexisting relocation algorithms.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 16:41:19 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Guo", "Jun", ""], ["Jafarkhani", "Hamid", ""]]}, {"id": "1806.07410", "submitter": "Can Altay Mr", "authors": "Can Altay, Mutlu Koca", "title": "Stochastic Geometry Analysis of Interference Coordination in NOMA-based\n  Heterogeneous Networks", "comments": "There are mistakes on statistical derivarions with the number of\n  users", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a stochastic geometry-based analysis for the\ncoverage probability of multi-tier heterogeneous networks employing\ninterference coordination for non-orthogonal multiple access (NOMA). Two basic\nand conventional interference coordination alternatives; strict fractional\nfrequency reuse (FFR) and soft frequency reuse (SFR) are analyzed, and their\nperformance gains on different instances are illustrated. Coverage probability\nanalysis has been extended to that of spectral efficiency for a fair\nperformance evaluation between different FFR methods. The analysis covers both\nopen-access networks with micro- and pico-cells, and closed-access networks\nwith femto-cells. For heterogeneous networks, NOMA is observed to achieve\nbetter spectral efficiency than OFDMA, while OFDMA provides better coverage.\nBoth analysis and numerical results reveal that strict FFR provides better\ncoverage while SFR provides spectral efficiency advantage in open-access.\nHowever, strict FFR outperforms SFR for both measures in closed-access\nnetworks.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 18:14:25 GMT"}, {"version": "v2", "created": "Tue, 26 Jun 2018 18:02:23 GMT"}, {"version": "v3", "created": "Mon, 15 Oct 2018 19:50:28 GMT"}], "update_date": "2018-10-17", "authors_parsed": [["Altay", "Can", ""], ["Koca", "Mutlu", ""]]}, {"id": "1806.07476", "submitter": "Vasileios Giotsas", "authors": "Vasileios Giotsas", "title": "CommunityWatch: The Swiss-Army Knife of BGP Anomaly Detection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present CommunityWatch, an open-source system that enables timely and\naccurate detection of BGP routing anomalies. CommunityWatch leverages meta-data\nencoded by AS operators on their advertised routes through the BGP Communities\nattribute. The BGP Communities values lack standardized semantics, offering the\nflexibility to attach a wide range of information, including AS relationships,\nlocation data, and route redistribution policies. Therefore, parsing and\ncorrelating Community values and their dynamics enables the detection and\ntracking of a variety of routing anomalies. We exhibit the efficacy of\nCommunityWatch through the detection of three different types of anomalies:\ninfrastructure outages, route leaks, and traffic blackholing.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 21:23:46 GMT"}], "update_date": "2018-06-21", "authors_parsed": [["Giotsas", "Vasileios", ""]]}, {"id": "1806.07526", "submitter": "Vishal Sharma", "authors": "Takshi Gupta, Gaurav Choudhary, Vishal Sharma", "title": "A Survey on the Security of Pervasive Online Social Networks (POSNs)", "comments": "39 Pages, 10 Figures", "journal-ref": "Journal of Internet Services and Information Security (JISIS),\n  8(2), 48--86, May 2018", "doi": "10.22667/JISIS.2018.05.31.048", "report-no": null, "categories": "cs.NI cs.CR cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pervasive Online Social Networks (POSNs) are the extensions of Online Social\nNetworks (OSNs) which facilitate connectivity irrespective of the domain and\nproperties of users. POSNs have been accumulated with the convergence of a\nplethora of social networking platforms with a motivation of bridging their\ngap. Over the last decade, OSNs have visually perceived an altogether\ntremendous amount of advancement in terms of the number of users as well as\ntechnology enablers. A single OSN is the property of an organization, which\nascertains smooth functioning of its accommodations for providing a quality\nexperience to their users. However, with POSNs, multiple OSNs have coalesced\nthrough communities, circles, or only properties, which make\nservice-provisioning tedious and arduous to sustain. Especially, challenges\nbecome rigorous when the focus is on the security perspective of cross-platform\nOSNs, which are an integral part of POSNs. Thus, it is of utmost paramountcy to\nhighlight such a requirement and understand the current situation while\ndiscussing the available state-of-the-art. With the modernization of OSNs and\nconvergence towards POSNs, it is compulsory to understand the impact and reach\nof current solutions for enhancing the security of users as well as associated\nservices. This survey understands this requisite and fixates on different sets\nof studies presented over the last few years and surveys them for their\napplicability to POSNs...\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2018 02:23:06 GMT"}], "update_date": "2018-06-21", "authors_parsed": [["Gupta", "Takshi", ""], ["Choudhary", "Gaurav", ""], ["Sharma", "Vishal", ""]]}, {"id": "1806.07761", "submitter": "Douglas Leith", "authors": "Hamid Hassani and Franceso Gringoli and Douglas J. Leith", "title": "Quick and Plenty: Achieving Low Delay and High Rate in 802.11ac Edge\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider transport layer approaches for achieving high rate, low delay\ncommunication over edge paths where the bottleneck is an 802.11ac WLAN. We\nfirst show that by regulating send rate so as to maintain a target aggregation\nlevel it is possible to realise high rate, low delay communication over\n802.11ac WLANs. We then address two important practical issues arising in\nproduction networks, namely that (i) many client devices are non-rooted mobile\nhandsets/tablets and (ii) the bottleneck may lie in the backhaul rather than\nthe WLAN, or indeed vary between the two over time. We show that both these\nissues can be resolved by use of simple and robust machine learning techniques.\nWe present a prototype transport layer implementation of our low delay rate\nallocation approach and use this to evaluate performance under real radio\nconditions.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2018 14:28:04 GMT"}, {"version": "v2", "created": "Thu, 24 Jan 2019 19:26:51 GMT"}, {"version": "v3", "created": "Sun, 13 Oct 2019 21:13:22 GMT"}], "update_date": "2019-10-15", "authors_parsed": [["Hassani", "Hamid", ""], ["Gringoli", "Franceso", ""], ["Leith", "Douglas J.", ""]]}, {"id": "1806.07840", "submitter": "Xu Chen", "authors": "En Li and Zhi Zhou and Xu Chen", "title": "Edge Intelligence: On-Demand Deep Learning Model Co-Inference with\n  Device-Edge Synergy", "comments": "ACM SIGCOMM Workshop on Mobile Edge Communications, Budapest,\n  Hungary, August 21-23, 2018. https://dl.acm.org/authorize?N665473", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.AI cs.CV cs.MM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the backbone technology of machine learning, deep neural networks (DNNs)\nhave have quickly ascended to the spotlight. Running DNNs on\nresource-constrained mobile devices is, however, by no means trivial, since it\nincurs high performance and energy overhead. While offloading DNNs to the cloud\nfor execution suffers unpredictable performance, due to the uncontrolled long\nwide-area network latency. To address these challenges, in this paper, we\npropose Edgent, a collaborative and on-demand DNN co-inference framework with\ndevice-edge synergy. Edgent pursues two design knobs: (1) DNN partitioning that\nadaptively partitions DNN computation between device and edge, in order to\nleverage hybrid computation resources in proximity for real-time DNN inference.\n(2) DNN right-sizing that accelerates DNN inference through early-exit at a\nproper intermediate DNN layer to further reduce the computation latency. The\nprototype implementation and extensive evaluations based on Raspberry Pi\ndemonstrate Edgent's effectiveness in enabling on-demand low-latency edge\nintelligence.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2018 16:56:54 GMT"}, {"version": "v2", "created": "Thu, 21 Jun 2018 03:36:27 GMT"}, {"version": "v3", "created": "Fri, 14 Sep 2018 02:37:07 GMT"}, {"version": "v4", "created": "Thu, 27 Dec 2018 11:49:55 GMT"}], "update_date": "2018-12-31", "authors_parsed": [["Li", "En", ""], ["Zhou", "Zhi", ""], ["Chen", "Xu", ""]]}, {"id": "1806.07913", "submitter": "Joberto Martins Prof. Dr.", "authors": "Eonassis O. Santos and Joberto S. B. Martins", "title": "Distribution Power Network Reconfiguration in the Smart Grid", "comments": "13 pages", "journal-ref": "International Seminar on Politics, Incentives, Technology and\n  Regulation of Smart Grids, Rio de Janeiro, 2017", "doi": "10.5281/zenodo.1066442", "report-no": null, "categories": "eess.SP cs.NI", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  The power network reconfiguration algorithm with an \"R\" modeling approach\nevaluates its behavior in computing new reconfiguration topologies for the\npower grid in the context of the Smart Grid. The power distribution network\nmodelling with the R language is used to represent the network and support\ncomputation of different algorithm configurations for the evaluation of new\nreconfiguration topologies. This work presents a reconfiguration solution of\ndistribution networks, with a construction of an algorithm that receiving the\nnetwork configuration data and the nodal measurements and from these data build\na radial network, after this and using a branch exchange algorithm And\nverifying the best configuration of the network through artificial\nintelligence, so that there are no unnecessary changes during the operation,\nand applied an algorithm that analyses the load levels, to suggest changes in\nthe network.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2018 18:15:45 GMT"}], "update_date": "2018-06-22", "authors_parsed": [["Santos", "Eonassis O.", ""], ["Martins", "Joberto S. B.", ""]]}, {"id": "1806.08159", "submitter": "Radhika Mittal", "authors": "Radhika Mittal, Alexander Shpiner, Aurojit Panda, Eitan Zahavi, Arvind\n  Krishnamurthy, Sylvia Ratnasamy, Scott Shenker", "title": "Revisiting Network Support for RDMA", "comments": "Extended version of the paper appearing in ACM SIGCOMM 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The advent of RoCE (RDMA over Converged Ethernet) has led to a significant\nincrease in the use of RDMA in datacenter networks. To achieve good\nperformance, RoCE requires a lossless network which is in turn achieved by\nenabling Priority Flow Control (PFC) within the network. However, PFC brings\nwith it a host of problems such as head-of-the-line blocking, congestion\nspreading, and occasional deadlocks. Rather than seek to fix these issues, we\ninstead ask: is PFC fundamentally required to support RDMA over Ethernet?\n  We show that the need for PFC is an artifact of current RoCE NIC designs\nrather than a fundamental requirement. We propose an improved RoCE NIC (IRN)\ndesign that makes a few simple changes to the RoCE NIC for better handling of\npacket losses. We show that IRN (without PFC) outperforms RoCE (with PFC) by\n6-83% for typical network scenarios. Thus not only does IRN eliminate the need\nfor PFC, it improves performance in the process! We further show that the\nchanges that IRN introduces can be implemented with modest overheads of about\n3-10% to NIC resources. Based on our results, we argue that research and\nindustry should rethink the current trajectory of network support for RDMA.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2018 10:30:19 GMT"}], "update_date": "2018-06-22", "authors_parsed": [["Mittal", "Radhika", ""], ["Shpiner", "Alexander", ""], ["Panda", "Aurojit", ""], ["Zahavi", "Eitan", ""], ["Krishnamurthy", "Arvind", ""], ["Ratnasamy", "Sylvia", ""], ["Shenker", "Scott", ""]]}, {"id": "1806.08252", "submitter": "Jeroen Hoebeke", "authors": "Girum Ketema Teklemariam, Floris Van den Abeele, Ingrid Moerman,\n  Jeroen Hoebeke", "title": "Transparent Recovery of Dynamic States on Constrained Nodes through Deep\n  Packet Inspection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many IoT applications make extensive use of constrained devices which are\ncharacterized by unexpected failures. In addition, nodes could be put offline\ntemporarily for maintenance (e.g. battery replacement). These incidents lead to\nloss of dynamic data that is generated due to the interactions between nodes.\nFor instance, configuration settings adjusted by sending PUT request to the\nsensor will be lost when the node is rebooted. The lost data, which we call\ndynamic states, leads to erroneous results or malfunctions of the IoT\napplication. In this paper, we introduce an intelligent dynamic state recovery\nmechanism through deep packet inspection. A State Directory, placed at the\ngateway, intercepts every communication between an external device and\nconstrained devices and stores (or updates) information that is important to\nrestore dynamic states. When a node reports a reboot, the state directory\nreplays the packets that generated the dynamic state so that all dynamic states\nare restored. We implemented the solution on a non-constrained device that acts\nas a gateway to the constrained network and tested the results using Cooja\nsimulator.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2018 14:03:46 GMT"}], "update_date": "2018-06-22", "authors_parsed": [["Teklemariam", "Girum Ketema", ""], ["Abeele", "Floris Van den", ""], ["Moerman", "Ingrid", ""], ["Hoebeke", "Jeroen", ""]]}, {"id": "1806.08274", "submitter": "Pallavi Athe", "authors": "Pallavi Athe, Yatindra Nath Singh", "title": "Impact Zone Analysis of p-Cycle", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pre-configured cycle (p-Cycle) method has been studied in literature\nextensively for optical network protection. A large p-cycle has high capacity\nefficiency and can protect a large number of nodes against the single link\nfailure scenarios. All the links protected by such a p-cycle lose protection\nwhen the p-cycle is consumed to restore traffic after a failure. As the\nprobability of multiple link failure is high for a large network, it also means\nthat with higher probability, on the second failure, protection may not be\nthere for the failed link. Thus, if the number of links protected by a p-cycle\nis large, it makes the network unprotected with high probability on the advent\nof the second failure. In this paper, we study the impact zone due to a first\nlink failure in the various configurations of the p-cycles. The study gives\ninsight into how to choose the p-cycle configuration to reduce the impact zone\nwhile using minimum spare capacity. We propose few methods and compare them to\nshow how the impact zone analysis can be used to improve the fault tolerance in\nan optical network.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2018 14:50:15 GMT"}], "update_date": "2018-06-22", "authors_parsed": [["Athe", "Pallavi", ""], ["Singh", "Yatindra Nath", ""]]}, {"id": "1806.08420", "submitter": "Aqsa Kashaf", "authors": "Aqsa Kashaf, Carolina Zarate, Hanrou Wang, Yuvraj Agarwal, Vyas Sekar", "title": "Oh, What a Fragile Web We Weave: Third-party Service Dependencies In\n  Modern Webservices and Implications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recent October 2016 DDoS attack on Dyn served as a wakeup call to the\nsecurity community as many popular and independent webservices (e.g., Twitter,\nSpotify) were impacted. This incident raises a larger question on the fragility\nof modern webservices due to their dependence on third-party services. In this\npaper, we characterize the dependencies of popular webservices on third party\nservices and how these can lead to DoS, RoQ attacks, and reduction in security\nposture. In particular, we focus on three critical infrastructure services:\nDNS, CDNs, and certificate authorities (CAs). We analyze both direct\nrelationships (e.g., Twitter uses Dyn) and indirect dependencies (e.g., Netflix\nuses Symantec as OCSP and Symantec, in turn, uses Verisign for DNS). Our key\nfindings are: (1) 73.14% of the top 100,000 popular services are vulnerable to\nreduction in availabil- ity due to potential attacks on third-party DNS, CDN,\nCA services that they exclusively rely on; (2) the use of third-party services\nis concentrated, so that if the top-10 providers of CDN, DNS and OCSP services\ngo down, they can potentially impact 25%-46% of the top 100K most popular web\nservices; (3) transitive depen- dencies significantly increase the set of\nwebservices that exclusively depend on popular CDN and DNS service providers,\nin some cases by ten times (4) targeting even less popular webservices can\npotentially cause signifi- cant collateral damage, affecting upto 20% of the\ntop- 100K webservices due to their shared dependencies. Based on our findings,\nwe present a number of key implications and guidelines to guard against such\nInternet- scale incidents in the future.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2018 20:27:36 GMT"}], "update_date": "2018-06-25", "authors_parsed": [["Kashaf", "Aqsa", ""], ["Zarate", "Carolina", ""], ["Wang", "Hanrou", ""], ["Agarwal", "Yuvraj", ""], ["Sekar", "Vyas", ""]]}, {"id": "1806.08455", "submitter": "Ashkan Aghdai", "authors": "Ashkan Aghdai, Cing-Yu Chu, Yang Xu, David H. Dai, Jun Xu, H. Jonathan\n  Chao", "title": "Spotlight: Scalable Transport Layer Load Balancing for Data Center\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Load Balancing plays a vital role in modern data centers to distribute\ntraffic among instances of network functions or services. State-of-the-art load\nbalancers such as Silkroad dispatch traffic obliviously without considering the\nreal-time utilization of service instances and therefore can lead to uneven\nload distribution and suboptimal performance.\n  In this paper, we design and implement Spotlight, a scalable and distributed\nload balancing architecture that maintains connection-to-instance mapping\nconsistency at the edge of data center networks. Spotlight uses a new stateful\nflow dispatcher which periodically polls instances' load and dispatches\nincoming connections to instances in proportion to their available capacity.\nOur design utilizes distributed control plane and in-band flow dispatching and\nthus scales horizontally in data center networks. Through extensive flow-level\nsimulation and packet-level experiments on a testbed, we demonstrate that\ncompared to existing methods Spotlight distributes the traffic more efficiently\nand has near-optimum performance in terms of overall service utilization.\nMoreover, Spotlight is not sensitive to utilization polling interval and\ntherefore can be implemented with low polling frequency to reduce the amount of\ncontrol traffic. Indeed, Spotlight achieves the mentioned performance\nimprovements using O(100ms) polling interval.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2018 23:36:28 GMT"}, {"version": "v2", "created": "Fri, 23 Nov 2018 23:58:44 GMT"}, {"version": "v3", "created": "Sat, 23 Feb 2019 19:47:16 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Aghdai", "Ashkan", ""], ["Chu", "Cing-Yu", ""], ["Xu", "Yang", ""], ["Dai", "David H.", ""], ["Xu", "Jun", ""], ["Chao", "H. Jonathan", ""]]}, {"id": "1806.08516", "submitter": "Sabidur Rahman", "authors": "Sabidur Rahman, Hyunsu Muny, Hyongjin Leey, Youngseok Lee, Massimo\n  Tornatore, and Biswanath Mukherjee", "title": "Insights from Analysis of Video Streaming Data to Improve Resource\n  Management", "comments": "This is a preprint electronic version of the article accepted to IEEE\n  CloudNet 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today a large portion of Internet traffic is video. Over The Top (OTT)\nservice providers offer video streaming services by creating a large\ndistributed cloud network on top of a physical infrastructure owned by multiple\nentities. Our study explores insights from video streaming activity by\nanalyzing data collected from Korea's largest OTT service provider. Our\nanalysis of nationwide data shows interesting characteristics of video\nstreaming such as correlation between user profile information (e.g., age, sex)\nand viewing habits, viewing habits of users (when do the users watch? using\nwhich devices?), viewing patterns (early leaving viewer vs. steady viewer),\netc. Video on Demand (VoD) streaming involves costly (and often limited)\ncompute, storage, and network resources. Findings from our study will be\nbeneficial for OTTs, Content Delivery Networks (CDNs), Internet Service\nProviders (ISPs), and Carrier Network Operators, to improve their resource\nallocation and management techniques.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2018 06:52:38 GMT"}, {"version": "v2", "created": "Thu, 6 Sep 2018 05:49:05 GMT"}], "update_date": "2018-09-07", "authors_parsed": [["Rahman", "Sabidur", ""], ["Muny", "Hyunsu", ""], ["Leey", "Hyongjin", ""], ["Lee", "Youngseok", ""], ["Tornatore", "Massimo", ""], ["Mukherjee", "Biswanath", ""]]}, {"id": "1806.08698", "submitter": "Boyu Wang", "authors": "Boyu Wang, Songtao Feng and Jing Yang", "title": "To Skip or to Switch? Minimizing Age of Information under Link Capacity\n  Constraint", "comments": "5 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a scenario where a source continuously monitors an object and sends\ntime-stamped status updates to a destination through a rate-limited link. In\norder to measure the \"freshness\" of the status information available at the\ndestination, we adopt the metric called Age of Information (AoI). We assume all\nupdates are of the same size, and arrive randomly at the source according to a\nBernoulli process. Due to the link capacity constraint, it takes $d$ ($d\\geq\n2$) time slots for the source to complete the transmission of an update.\nTherefore, when a new update when arrives at the source and it is transmitting\nanother update, the source needs to decide whether to skip the new arrival or\nto switch to it, in order to minimize the expected average AoI at the\ndestination. We prove that within a broadly defined class of online policies,\nthe optimal policy should be a renewal policy, and has a sequential switching\nproperty. We then show that the optimal decision the source should take in any\ntime slot has a multiple-threshold structure, and only depends on the age of\nthe update being transmitted and the AoI in the system. The thresholds are then\nnumerically identified by formulating the problem as a Markov Decision Process\n(MDP).\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2018 14:34:09 GMT"}, {"version": "v2", "created": "Mon, 2 Jul 2018 16:45:00 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Wang", "Boyu", ""], ["Feng", "Songtao", ""], ["Yang", "Jing", ""]]}, {"id": "1806.08744", "submitter": "Ryan Beckett", "authors": "Ryan Beckett, Aarti Gupta, Ratul Mahajan, David Walker", "title": "Control Plane Compression", "comments": "Extended version of the paper appearing in ACM SIGCOMM 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an algorithm capable of compressing large networks into a smaller\nones with similar control plane behavior: For every stable routing solution in\nthe large, original network, there exists a corresponding solution in the\ncompressed network, and vice versa. Our compression algorithm preserves a wide\nvariety of network properties including reachability, loop freedom, and path\nlength. Consequently, operators may speed up network analysis, based on\nsimulation, emulation, or verification, by analyzing only the compressed\nnetwork. Our approach is based on a new theory of control plane equivalence. We\nimplement these ideas in a tool called Bonsai and apply it to real and\nsynthetic networks. Bonsai can shrink real networks by over a factor of 5 and\nspeed up analysis by several orders of magnitude.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2018 16:12:39 GMT"}], "update_date": "2018-06-25", "authors_parsed": [["Beckett", "Ryan", ""], ["Gupta", "Aarti", ""], ["Mahajan", "Ratul", ""], ["Walker", "David", ""]]}, {"id": "1806.08776", "submitter": "Antzela Kosta", "authors": "Antzela Kosta, Nikolaos Pappas, Anthony Ephremides, Vangelis Angelakis", "title": "Age of Information and Throughput in a Shared Access Network with\n  Heterogeneous Traffic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a cognitive shared access scheme consisting of a high priority\nprimary node and a low priority network with $N$ secondary nodes accessing the\nspectrum. Assuming bursty traffic at the primary node, saturated queues at the\nsecondary nodes, and multipacket reception capabilities at the receivers, we\nderive analytical expressions of the time average age of information of the\nprimary node and the throughput of the secondary nodes. We formulate two\noptimization problems, the first aiming to minimize the time average age of\ninformation of the primary node subject to an aggregate secondary throughput\nrequirement. The second problem aims to maximize the aggregate secondary\nthroughput of the network subject to a maximum time average staleness\nconstraint. Our results provide guidelines for the design of a multiple access\nsystem with multipacket reception capabilities that fulfils both timeliness and\nthroughput requirements.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2018 17:35:24 GMT"}, {"version": "v2", "created": "Fri, 21 Dec 2018 15:38:59 GMT"}], "update_date": "2018-12-24", "authors_parsed": [["Kosta", "Antzela", ""], ["Pappas", "Nikolaos", ""], ["Ephremides", "Anthony", ""], ["Angelakis", "Vangelis", ""]]}, {"id": "1806.08900", "submitter": "Li Hangxu", "authors": "Hangxu Li, Jie Zhang, Jingzi Gu, Xiaolu Ji, Yang Li, Jun Hu, Yunhua\n  Sun, Xiaoshan Jiang, Zheng Wang", "title": "A readout method based on 10 Gigabit Ethernet for Sipixel detector", "comments": "4 pages, 12 figures, proceedings of 21st IEEE Real Time Conference\n  Colonial Williamsburg 9-15 June 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the rapid development of network protocol, TCP/IP has been widely\napplied in various OS systems because of its advantages of high-speed network\ntransmission and standardization. Furthermore, TCP/IP has the functions of\nretransmission and flow control, so it can ensure data's security and\nstability. In recent years, as a transmission Field-bus, it is also widely used\nin high-energy physics detectors. This article describes a readout method using\n10 gigabit network processor applied in silicon pixel detector which is a pixel\ndetector designed for the High Energy Photon Source (HEPS) in China. The PHY\nlayer and the MAC layer of this hardware are both instantiated in FPGA. The\nlogic of hardware can process and read out the data of the detectors.\nMeanwhile, it wraps up data and send them to TOE (TCP Offload Engine). A kind\nof bus control protocol interface is also provided, which can facilitate the\nhost computer to read and write the specific register directly through the UDP\nprotocol. Only a piece of FPGA can complete the processing of the TCP and UDP\npackets. It is important for the miniaturization of the detectors.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jun 2018 03:31:48 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Li", "Hangxu", ""], ["Zhang", "Jie", ""], ["Gu", "Jingzi", ""], ["Ji", "Xiaolu", ""], ["Li", "Yang", ""], ["Hu", "Jun", ""], ["Sun", "Yunhua", ""], ["Jiang", "Xiaoshan", ""], ["Wang", "Zheng", ""]]}, {"id": "1806.08943", "submitter": "Lifeng Wang", "authors": "Xiaoyan Hu, Lifeng Wang, Kai-Kit Wong, Yangyang Zhang, Zhongbin Zheng,\n  Meixia Tao", "title": "Edge and Central Cloud Computing: A Perfect Pairing for High Energy\n  Efficiency and Low-latency", "comments": "Accepted in IEEE Transactions on Wireless Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the coexistence and synergy between edge and central\ncloud computing in a heterogeneous cellular network (HetNet), which contains a\nmulti-antenna macro base station (MBS), multiple multi-antenna small base\nstations (SBSs) and multiple single-antenna user equipment (UEs). The SBSs are\nempowered by edge clouds offering limited computing services for UEs, whereas\nthe MBS provides high-performance central cloud computing services to UEs via a\nrestricted multiple-input multiple-output (MIMO) backhaul to their associated\nSBSs. With processing latency constraints at the central and edge networks, we\naim to minimize the system energy consumption used for task offloading and\ncomputation. The problem is formulated by jointly optimizing the cloud\nselection, the UEs' transmit powers, the SBSs' receive beamformers, and the\nSBSs' transmit covariance matrices, which is {a mixed-integer and non-convex\noptimization problem}. Based on methods such as decomposition approach and\nsuccessive pseudoconvex approach, a tractable solution is proposed via an\niterative algorithm. The simulation results show that our proposed solution can\nachieve great performance gain over conventional schemes using edge or central\ncloud alone. Also, with large-scale antennas at the MBS, the massive MIMO\nbackhaul can significantly reduce the complexity of the proposed algorithm and\nobtain even better performance.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jun 2018 10:43:31 GMT"}, {"version": "v2", "created": "Fri, 25 Oct 2019 00:43:11 GMT"}], "update_date": "2019-10-28", "authors_parsed": [["Hu", "Xiaoyan", ""], ["Wang", "Lifeng", ""], ["Wong", "Kai-Kit", ""], ["Zhang", "Yangyang", ""], ["Zheng", "Zhongbin", ""], ["Tao", "Meixia", ""]]}, {"id": "1806.09171", "submitter": "Vitaly Petrov", "authors": "Vitaly Petrov, Sergey Andreev, Mario Gerla, Yevgeni Koucheryavy", "title": "Breaking the Limits in Urban Video Monitoring: Massive Crowd Sourced\n  Surveillance over Vehicles", "comments": "8 pages, 5 figures, accepted to IEEE Wireless Communications, 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Contemporary urban environments are in prompt need of means for intelligent\ndecision-making, where a crucial role belongs to smart video surveillance\nsystems. While existing deployments of stationary monitoring cameras already\ndeliver notable societal benefits, the proposed concept of massive video\nsurveillance over connected vehicles that we contribute in this paper may\nfurther augment these important capabilities. We therefore introduce the\nenvisioned system concept, discuss its implementation, outline the high-level\narchitecture, and identify major data flows, while also offering insights into\nthe corresponding design and deployment aspects. Our conducted case study\nconfirms the potential of the described crowd sourced vehicular system to\neffectively complement and eventually surpass even the best of today's static\nvideo surveillance setups. We expect that our proposal will become of value and\nintegrate seamlessly into the future Internet-of-Things landscape, thus\nenabling a plethora of advanced urban applications.\n", "versions": [{"version": "v1", "created": "Sun, 24 Jun 2018 16:28:22 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Petrov", "Vitaly", ""], ["Andreev", "Sergey", ""], ["Gerla", "Mario", ""], ["Koucheryavy", "Yevgeni", ""]]}, {"id": "1806.09381", "submitter": "Sanaa Sharafeddine", "authors": "Sanaa Sharafeddine and Omar Farhat", "title": "A Proactive Scalable Approach for Reliable Cluster Formationin Wireless\n  Networks with D2D Offloading", "comments": "--", "journal-ref": "Ad Hoc Networks, 77, 42-53, 2018", "doi": "10.1016/j.adhoc.2018.04.010", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the current exponential growth in traffic and service demands,\ndevice-to-device (D2D) cooperation is identified as a major mechanism to enable\n5G networks to effectively and efficiently augment network resources. The\neffectiveness of D2D cooperation depends on a wide range of decision making\nprocesses that include cluster formation, resource allocation, in addition to\nconnection and mobility management. Irrespective of the D2D cooperation\nscenario whether in sensor, ad hoc, or cellular networks, the literature\nnormally assumes that devices selected as relays or data sources are reliable;\nthis means that they will maintain the connection till the communication\nsession ends. Yet, this assumption is challenged in practice since devices'\nbatteries can be depleted (e.g., sensors in an IoT network) and devices can\nmove leading to connection termination (e.g., mobile users in a WiFi network or\ncars in a vehicular ad hoc network). To this end, we address the problem of\nreliable D2D cooperation in wireless networks by proposing a novel approach\nthat is proactive by utilizing reliability metrics in the decision making\nprocess, and scalable by having low implementation complexity suitable for\ndense networks. These differentiating factors are shown to enhance the overall\nnetwork reliability compared to standard techniques and to facilitate dynamic\noperation which is essential for practical implementation. Performance is\nevaluated using extensive simulations in addition to test bed experimental\ndemonstration in order to quantify gains and extract insights on a range of\nexisting design tradeoffs.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2018 11:05:37 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Sharafeddine", "Sanaa", ""], ["Farhat", "Omar", ""]]}, {"id": "1806.09466", "submitter": "Vaneet Aggarwal", "authors": "Abubakr Alabbasi and Vaneet Aggarwal", "title": "Optimized Video Streaming over Cloud: A Stall-Quality Trade-off", "comments": "15 pages. arXiv admin note: substantial text overlap with\n  arXiv:1703.08348", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As video-streaming services have expanded and improved, cloud-based video has\nevolved into a necessary feature of any successful business for reaching\ninternal and external audiences. In this paper, video streaming over\ndistributed storage is considered where the video segments are encoded using an\nerasure code for better reliability. There are multiple parallel streams\nbetween each server and the edge router. For each client request, we need to\ndetermine the subset of servers to get the data, as well as one of the parallel\nstream from each chosen server. In order to have this scheduling, this paper\nproposes a two-stage probabilistic scheduling. The selection of video quality\nis also chosen with a certain probability distribution. With these parameters,\nthe playback time of video segments is determined by characterizing the\ndownload time of each coded chunk for each video segment. Using the playback\ntimes, a bound on the moment generating function of the stall duration is used\nto bound the mean stall duration. Based on this, we formulate an optimization\nproblem to jointly optimize the convex combination of mean stall duration and\naverage video quality for all requests, where the two-stage probabilistic\nscheduling, probabilistic video quality selection, bandwidth split among\nparallel streams, and auxiliary bound parameters can be chosen. This non-convex\nproblem is solved using an efficient iterative algorithm. Evaluation results\nshow significant improvement in QoE metrics for cloud-based video as compared\nto the considered baselines.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2018 06:59:11 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Alabbasi", "Abubakr", ""], ["Aggarwal", "Vaneet", ""]]}, {"id": "1806.09491", "submitter": "Fabian Eckermann", "authors": "Fabian Eckermann, Julian Freudenthal, Christian Wietfeld", "title": "Performance Analysis of Unsupervised LTE Device-to-Device (D2D)\n  Communication", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cellular network technology based device-to-device communication attracts\nincreasing attention for use cases such as the control of autonomous vehicles\non the ground and in the air. LTE provides device-to-device communication\noptions, however, the configuration options are manifold (leading to 150+\npossible combinations) and therefore the ideal combination of parameters is\nhard to find. Depending on the use case, either throughput, reliability or\nlatency constraints may be the primary concern of the service provider. In this\nwork we analyze the impact of different configuration settings of unsupervised\nLTE device-to-device (sidelink) communication on the system performance. Using\na simulative approach we vary the length of the PSCCH period and the number of\nPSCCH subframes and determine the impact of different combinations of those\nparameters on the resulting latency, reliability and the interarrival times of\nthe received packets. Furthermore we examine the system limitations by a\nscalability analysis. In this context, we propose a modified HARQ process to\nmitigate scalability constraints. Our results show that the proposed reduced\nHARQ retransmission probability can increase the system performance regarding\nlatency and interarrival times as well as the packet transmission reliability\nfor higher channel utilization.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2018 14:34:37 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Eckermann", "Fabian", ""], ["Freudenthal", "Julian", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1806.09527", "submitter": "Flavio Pisani", "authors": "Tommaso Colombo, Paolo Durante, Domenico Galli, Matteo Manzali,\n  Umberto Marconi, Niko Neufeld, Flavio Pisani, Rainer Schwemmer, S\\'ebastien\n  Valat", "title": "FLIT-level InfiniBand network simulations of the DAQ system of the LHCb\n  experiment for Run-3", "comments": "21st IEEE Real Time Conference", "journal-ref": null, "doi": "10.1109/TNS.2019.2905993", "report-no": null, "categories": "cs.NI hep-ex", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The LHCb (Large Hadron Collider beauty) experiment is designed to study\ndifferences between particles and anti-particles as well as very rare decays in\nthe charm and beauty sector at the LHC (Large Hadron Collider). The detector\nwill be upgraded in 2019 and a new trigger-less readout system will be\nimplemented in order to significantly increase its efficiency and take\nadvantage of the increased machine luminosity. In the upgraded system, both\nevent building and event filtering will be performed in software for all the\ndata produced in every bunch-crossing of the LHC. In order to transport the\nfull data rate of 32 Tb/s we will use custom FPGA readout boards (PCIe40) and\nstate of the art off-the-shelf network technologies. The full event building\nsystem will require around 500 nodes interconnected together. From a networking\npoint of view, event building traffic has an all-to-all pattern, therefore it\ntends to create high network congestion. In order to maximize the link\nutilization different techniques can be adopted in various areas like traffic\nshaping, network topology and routing optimization. The size of the system\nmakes it very difficult to test at production scale, before the actual\nprocurement. We resort therefore to network simulations as a powerful tool for\nfinding the optimal configuration. We will present an accurate low level\ndescription of an InfiniBand based network with event building like traffic. We\nwill show comparison between simulated and real systems and how changes in the\ninput parameters affect performances.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2018 15:29:39 GMT"}], "update_date": "2019-09-04", "authors_parsed": [["Colombo", "Tommaso", ""], ["Durante", "Paolo", ""], ["Galli", "Domenico", ""], ["Manzali", "Matteo", ""], ["Marconi", "Umberto", ""], ["Neufeld", "Niko", ""], ["Pisani", "Flavio", ""], ["Schwemmer", "Rainer", ""], ["Valat", "Sébastien", ""]]}, {"id": "1806.09566", "submitter": "Arnaud Dethise", "authors": "Arnaud Dethise, Marco Chiesa, Marco Canini", "title": "Prelude: Ensuring Inter-Domain Loop-Freedom in~SDN-Enabled Networks", "comments": null, "journal-ref": null, "doi": "10.1145/3232565.3232570", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Software-Defined-eXchanges (SDXes) promise to tackle the timely quest of\nbringing improving the inter-domain routing ecosystem through SDN deployment.\nYet, the naive deployment of SDN on the Internet raises concerns about the\ncorrectness of the inter-domain data-plane. By allowing operators to deflect\ntraffic from the default BGP route, SDN policies are susceptible of creating\npermanent forwarding loops invisible to the control-plane.\n  In this paper, we propose a system, called Prelude, for detecting SDN-induced\nforwarding loops between SDXes with high accuracy without leaking the private\nrouting information of network operators. To achieve this, we leverage Secure\nMulti-Party Computation (SMPC) techniques to build a novel and general\nprivacy-preserving primitive that detects whether any subset of SDN rules might\naffect the same portion of traffic without learning anything about those rules.\nWe then leverage that primitive as the main building block of a distributed\nsystem tailored to detect forwarding loops among any set of SDXes. We leverage\nthe particular nature of SDXes to further improve the efficiency of our SMPC\nsolution.\n  The number of valid SDN rules, i.e., not creating loops, rejected by our\nsolution is 100x lower than previous privacy-preserving solutions, and also\nprovides better privacy guarantees. Furthermore, our solution naturally\nprovides network operators with some hindsight on the cost of the deflected\npaths.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2018 17:06:10 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Dethise", "Arnaud", ""], ["Chiesa", "Marco", ""], ["Canini", "Marco", ""]]}, {"id": "1806.09582", "submitter": "Seyedmohammad Salehi", "authors": "Seyedmohammad Salehi, Li Li, Chien-Chung Shen, Leonard Cimini, John\n  Graybeal", "title": "Traffic Differentiation in Dense WLANs with CSMA/ECA-DR MAC Protocol", "comments": "This work has been accepted by IEEE VTC 2018 Fall conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In today's WLANs, scheduling of packet transmissions solely relies on the\ncollision and success a station may experience. To better support traffic\ndifferentiation in dense WLANs, in this paper, we propose a distributed\nreservation mechanism for the Carrier Sense Multiple Access Extended Collision\nAvoidance (CSMA/ECA) MAC protocol, termed CSMA/ECA-DR, based on which stations\ncan collaboratively achieve higher network performance. In addition, proper\nContention Window (CW) will be chosen based on the instantaneously estimated\nnumber of active contenders in the network. Simulation results from dense\nscenarios with traffic differentiation demonstrate that CSMA/ECA-DR can greatly\nimprove the efficiency of WLANs for traffic differentiation even with large\nnumbers of contenders.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2018 17:26:15 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Salehi", "Seyedmohammad", ""], ["Li", "Li", ""], ["Shen", "Chien-Chung", ""], ["Cimini", "Leonard", ""], ["Graybeal", "John", ""]]}, {"id": "1806.09619", "submitter": "Yi-Peng Wei", "authors": "Yi-Peng Wei and Sennur Ulukus", "title": "Novel Decentralized Coded Caching through Coded Prefetching", "comments": "Appeared at IEEE ITW, November 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new decentralized coded caching scheme for a two-phase caching\nnetwork, where the data placed in user caches in the prefetching phase are\nrandom portions of a maximal distance separable (MDS) coded version of the\noriginal files. The proposed scheme achieves a better rate memory trade-off by\nutilizing the reconstruction property of MDS codes which reduces the number of\ntransmissions that are useful only for a small subset of users in the delivery\nphase. Unlike the previously available coded prefetching schemes, the proposed\nscheme does not require to have more users than files. The proposed scheme can\nbe viewed as a generalization of the original uncoded prefetching based\ndecentralized coded caching scheme, and likewise, is applicable to various\nnetwork topologies.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2018 17:46:06 GMT"}], "update_date": "2018-06-27", "authors_parsed": [["Wei", "Yi-Peng", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1806.09980", "submitter": "Muzammil Behzad", "authors": "Muzammil Behzad, Manal Abdullah, Muhammad Talal Hassan, Yao Ge,\n  Mahmood Ashraf Khan", "title": "Toward Performance Optimization in IoT-based Next-Gen Wireless Sensor\n  Networks", "comments": "45 pages, 22 figures, pending article. arXiv admin note: substantial\n  text overlap with arXiv:1712.04259", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.CV cs.NI eess.IV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a novel framework for performance optimization in\nInternet of Things (IoT)-based next-generation wireless sensor networks. In\nparticular, a computationally-convenient system is presented to combat two\nmajor research problems in sensor networks. First is the conventionally-tackled\nresource optimization problem which triggers the drainage of battery at a\nfaster rate within a network. Such drainage promotes inefficient resource usage\nthereby causing sudden death of the network. The second main bottleneck for\nsuch networks is that of data degradation. This is because the nodes in such\nnetworks communicate via a wireless channel, where the inevitable presence of\nnoise corrupts the data making it unsuitable for practical applications.\nTherefore, we present a layer-adaptive method via 3-tier communication\nmechanism to ensure the efficient use of resources. This is supported with a\nmathematical coverage model that deals with the formation of coverage holes. We\nalso present a transform-domain based robust algorithm to effectively remove\nthe unwanted components from the data. Our proposed framework offers a handy\nalgorithm that enjoys desirable complexity for real-time applications as shown\nby the extensive simulation results.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jun 2018 08:42:01 GMT"}], "update_date": "2018-06-27", "authors_parsed": [["Behzad", "Muzammil", ""], ["Abdullah", "Manal", ""], ["Hassan", "Muhammad Talal", ""], ["Ge", "Yao", ""], ["Khan", "Mahmood Ashraf", ""]]}, {"id": "1806.10036", "submitter": "Zuchao Zhang", "authors": "Z. Zhang, B. Xiao, Z. Ji, Y. Wang, P. Wang", "title": "The application of precision time protocol on EAST timing system", "comments": "4 pages, 6 figures, 21st IEEE Real Time Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The timing system focuses on synchronizing and coordinating each subsystem\naccording to the trigger signals. A new prototype timing slave node based on\nprecision time protocol has been developed by using ARM STM32 platform. The\nproposed slave timing module is tested and results show that the\nsynchronization accuracy between slave nodes is in sub-microsecond range.\n", "versions": [{"version": "v1", "created": "Sun, 24 Jun 2018 22:24:37 GMT"}], "update_date": "2018-07-10", "authors_parsed": [["Zhang", "Z.", ""], ["Xiao", "B.", ""], ["Ji", "Z.", ""], ["Wang", "Y.", ""], ["Wang", "P.", ""]]}, {"id": "1806.10200", "submitter": "Nikolaos Pappas", "authors": "Nikolaos Pappas, Ioannis Dimitriou, Zheng Chen", "title": "On the Benefits of Network-level Cooperation in IoT Networks with\n  Aggregators", "comments": "This work was presented in part in the 30th International Teletraffic\n  Congress (ITC). This is the extended version submitted for possible journal\n  publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we consider a random access Internet of Things IoT wireless\nnetwork assisted by two aggregators collecting information from two disjoint\ngroups of sensors. The nodes and the aggregators are transmitting in a random\naccess manner under slotted time, the aggregators perform network-level\ncooperation for the data collection. The aggregators are equipped with queues\nto store data packets that are transmitted by the network nodes and relaying\nthem to the destination node. We characterize the throughput performance of the\nIoT network and we obtain the stability conditions for the queues at the\naggregators. We apply the theory of boundary value problems to analyze the\ndelay performance. Our results show that the presence of the aggregators\nprovides significant gains in the IoT network performance, in addition, we\nprovide useful insights regarding the scalability of the IoT network.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jun 2018 20:19:14 GMT"}, {"version": "v2", "created": "Sat, 6 Jul 2019 08:22:56 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Pappas", "Nikolaos", ""], ["Dimitriou", "Ioannis", ""], ["Chen", "Zheng", ""]]}, {"id": "1806.10258", "submitter": "Micah Sherr", "authors": "Akshaya Mani and Tavish Vaidya and David Dworken and Micah Sherr", "title": "An Extensive Evaluation of the Internet's Open Proxies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Open proxies forward traffic on behalf of any Internet user. Listed on open\nproxy aggregator sites, they are often used to bypass geographic region\nrestrictions or circumvent censorship. Open proxies sometimes also provide a\nweak form of anonymity by concealing the requestor's IP address.\n  To better understand their behavior and performance, we conducted a\ncomprehensive study of open proxies, encompassing more than 107,000 listed open\nproxies and 13M proxy requests over a 50 day period. While previous studies\nhave focused on malicious open proxies' manipulation of HTML content to\ninsert/modify ads, we provide a more broad study that examines the\navailability, success rates, diversity, and also (mis)behavior of proxies.\n  Our results show that listed open proxies suffer poor availability--more than\n92% of open proxies that appear on aggregator sites are unresponsive to proxy\nrequests. Much more troubling, we find numerous examples of malicious open\nproxies in which HTML content is manipulated to mine cryptocurrency (that is,\ncryptojacking). We additionally detect TLS man-in-the-middle (MitM) attacks,\nand discover numerous instances in which binaries fetched through proxies were\nmodified to include remote access trojans and other forms of malware. As a\npoint of comparison, we conduct and discuss a similar measurement study of the\nbehavior of Tor exit relays. We find no instances in which Tor relays performed\nTLS MitM or manipulated content, suggesting that Tor offers a far more reliable\nand safe form of proxied communication.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jun 2018 00:47:08 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Mani", "Akshaya", ""], ["Vaidya", "Tavish", ""], ["Dworken", "David", ""], ["Sherr", "Micah", ""]]}, {"id": "1806.10387", "submitter": "Henrik Forssell", "authors": "Henrik Forssell, Ragnar Thobaben, Hussein Al-Zubaidy, James Gross", "title": "Physical Layer Authentication in Mission-Critical MTC Networks: A\n  Security and Delay Performance Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the detection and delay performance impacts of a feature-based\nphysical layer authentication (PLA) protocol in mission-critical machine-type\ncommunication (MTC) networks. The PLA protocol uses generalized\nlikelihood-ratio testing based on the line-of-sight (LOS), single-input\nmultiple-output channel-state information in order to mitigate impersonation\nattempts from an adversary node. We study the detection performance, develop a\nqueueing model that captures the delay impacts of erroneous decisions in the\nPLA (i.e., the false alarms and missed detections), and model three different\nadversary strategies: data injection, disassociation, and Sybil attacks. Our\nmain contribution is the derivation of analytical delay performance bounds that\nallow us to quantify the delay introduced by PLA that potentially can degrade\nthe performance in mission-critical MTC networks. For the delay analysis, we\nutilize tools from stochastic network calculus. Our results show that with a\nsufficient number of receive antennas (approx. 4-8) and sufficiently strong LOS\ncomponents from legitimate devices, PLA is a viable option for securing\nmission-critical MTC systems, despite the low latency requirements associated\nto corresponding use cases. Furthermore, we find that PLA can be very effective\nin detecting the considered attacks, and in particular, it can significantly\nreduce the delay impacts of disassociation and Sybil attacks.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jun 2018 10:08:26 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Forssell", "Henrik", ""], ["Thobaben", "Ragnar", ""], ["Al-Zubaidy", "Hussein", ""], ["Gross", "James", ""]]}, {"id": "1806.10426", "submitter": "Mohammad Asif Habibi Mr.", "authors": "Mohammad Asif Habibi, Bin Han, Meysam Nasimi, and Hans D. Schotten", "title": "The Structure of Service Level Agreement of Slice-based 5G Network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Network slicing is considered to be one of the key enablers to Fifth\nGeneration (5G) communication system. Legacy telecommunication networks have\nbeen providing various services to all kinds of customers through a single\nnetwork infrastructure. In contrast, with the deployment of network slicing,\noperators are now able to partition entire network into different slices, each\nwith its own configuration and Quality of Service (QoS) requirements. There are\nmany applications across industry, each needs an independent slice with its own\nfunctions and features. All these applications open new business opportunities,\nwhich require new business models and therefore every single slice needs an\nindividual Service Level Agreement (SLA). In this paper, we proposed a\ncomprehensive end-to-end structure of SLA between tenant and service provider\nof slice-based 5G network, which balances the interests of both sides. The\nproposed SLA is expected to define reliability, availability, and performance\nof delivered telecommunication services in order to ensure that right\ninformation gets to the right destination at right time, safely and securely.\nWe also discussed the metrics of slice-based network SLA such as throughput,\npenalty, cost, revenue, profit, and QoS related metrics, which we think are\nvery critical to be considered during the agreement.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jun 2018 12:03:19 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Habibi", "Mohammad Asif", ""], ["Han", "Bin", ""], ["Nasimi", "Meysam", ""], ["Schotten", "Hans D.", ""]]}, {"id": "1806.10518", "submitter": "Haris Gacanin", "authors": "Haris Gacanin", "title": "Autonomous Wireless Systems with Artificial Intelligence", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses technology and opportunities to embrace artificial\nintelligence (AI) in the design of autonomous wireless systems. We aim to\nprovide readers with motivation and general AI methodology of autonomous agents\nin the context of self-organization in real time by unifying knowledge\nmanagement with sensing, reasoning and active learning. We highlight\ndifferences between training-based methods for matching problems and\ntraining-free methods for environment-specific problems. Finally, we\nconceptually introduce the functions of an autonomous agent with knowledge\nmanagement.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jun 2018 15:02:08 GMT"}, {"version": "v2", "created": "Tue, 21 May 2019 15:49:54 GMT"}], "update_date": "2019-05-22", "authors_parsed": [["Gacanin", "Haris", ""]]}, {"id": "1806.10521", "submitter": "Florian Kauer", "authors": "Florian Kauer and Maximilian K\\\"ostler and Volker Turau", "title": "Reliable Wireless Multi-Hop Networks with Decentralized Slot Management:\n  An Analysis of IEEE 802.15.4 DSME", "comments": "27 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless communication is a key element in the realization of the Industrial\nInternet of Things for flexible and cost-efficient monitoring and control of\nindustrial processes. Wireless mesh networks using IEEE 802.15.4 have a high\npotential for executing monitoring and control tasks with low energy\nconsumption and low costs for deployment and maintenance. However, conventional\nmedium access techniques based on carrier sensing cannot provide the required\nreliability for industrial applications. Therefore, the standard was extended\nwith techniques for time-slotted medium access on multiple channels. In this\npaper, we present openDSME, a comprehensive implementation of the Deterministic\nand Synchronous Multi-channel Extension (DSME) and propose a method for\ntraffic-aware and decentralized slot scheduling to enable scalable wireless\nindustrial networks. The performance of DSME and our implementation is\ndemonstrated in the OMNeT++ simulator and on a physically deployed wireless\nnetwork in the FIT/IoT-LAB. It is shown that in the given scenarios, twice as\nmuch traffic can be delivered reliably by using DSME instead of CSMA/CA and\nthat the energy consumption can be reduced significantly. The paper is\ncompleted by presenting important trade-offs for parameter selection and by\nuncovering open issues of the current specification that call for further\neffort in research and standardization.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jun 2018 15:07:43 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Kauer", "Florian", ""], ["Köstler", "Maximilian", ""], ["Turau", "Volker", ""]]}, {"id": "1806.10523", "submitter": "Haris Gacanin", "authors": "Samurdhi Karunaratne and Haris Gacanin", "title": "An Overview of Machine Learning Approaches in Wireless Mesh Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Mesh Networks (WMNs) have been extensively studied for nearly two\ndecades as one of the most promising candidates expected to power the high\nbandwidth, high coverage wireless networks of the future. However, consumer\ndemand for such networks has only recently caught up, rendering efforts at\noptimizing WMNs to support high capacities and offer high QoS, while being\nsecure and fault tolerant, more important than ever. To this end, a recent\ntrend has been the application of Machine Learning (ML) to solve various design\nand management tasks related to WMNs. In this work, we discuss key ML\ntechniques and analyze how past efforts have applied them in WMNs, while noting\nsome existing issues and suggesting potential solutions. We also provide\ndirections on how ML could advance future research and examine recent\ndevelopments in the field.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jun 2018 15:12:21 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Karunaratne", "Samurdhi", ""], ["Gacanin", "Haris", ""]]}, {"id": "1806.10751", "submitter": "Hudson Ayers", "authors": "Hudson Ayers, Paul Crews, Hubert Teo, Conor McAvity, Amit Levy, Philip\n  Levis", "title": "Design Considerations for Low Power Internet Protocols", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the past 10 years, low-power wireless networks have transitioned to\nsupporting IPv6 connectivity through 6LoWPAN, a set of standards which specify\nhow to aggressively compress IPv6 packets over low-power wireless links such as\n802.15.4.\n  We find that different low-power IPv6 stacks are unable to communicate using\n6LoWPAN, and therefore IP, due to design tradeoffs between code size and energy\nefficiency. We argue that applying traditional protocol design principles to\nlow-power networks is responsible for these failures, in part because receivers\nmust accommodate a wide range of senders.\n  Based on these findings, we propose three design principles for Internet\nprotocols on low-power networks. These principles are based around the\nimportance of providing flexible tradeoffs between code size and energy\nefficiency. We apply these principles to 6LoWPAN and show that the resulting\ndesign of the protocol provides developers a wide range of tradeoff points\nwhile allowing implementations with different choices to seamlessly\ncommunicate.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 03:07:21 GMT"}, {"version": "v2", "created": "Tue, 21 Jan 2020 20:11:08 GMT"}], "update_date": "2020-01-23", "authors_parsed": [["Ayers", "Hudson", ""], ["Crews", "Paul", ""], ["Teo", "Hubert", ""], ["McAvity", "Conor", ""], ["Levy", "Amit", ""], ["Levis", "Philip", ""]]}, {"id": "1806.10756", "submitter": "Bin Li", "authors": "Chaoqiong Fan, Bin Li, Jia Hou, Yi Wu, Weisi Guo, Chenglin Zhao", "title": "Robust Fuzzy-Learning For Partially Overlapping Channels Allocation In\n  UAV Communication Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT cs.LG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we consider a mesh-structured unmanned aerial vehicle (UAV)\nnetworks exploiting partially overlapping channels (POCs). For general\ndata-collection tasks in UAV networks, we aim to optimize the network\nthroughput with constraints on transmission power and quality of service (QoS).\nAs far as the highly mobile and constantly changing UAV networks are concerned,\nunfortunately, most existing methods rely on definite information which is\nvulnerable to the dynamic environment, rendering system performance to be less\neffective. In order to combat dynamic topology and varying interference of UAV\nnetworks, a robust and distributed learning scheme is proposed. Rather than the\nperfect channel state information (CSI), we introduce uncertainties to\ncharacterize the dynamic channel gains among UAV nodes, which are then\ninterpreted with fuzzy numbers. Instead of the traditional observation space\nwhere the channel capacity is a crisp reward, we implement the learning and\ndecision process in a mapped fuzzy space. This allows the system to achieve a\nsmoother and more robust performance by optimizing in an alternate space. To\nthis end, we design a fuzzy payoffs function (FPF) to describe the fluctuated\nutility, and the problem of POCs assignment is formulated as a fuzzy payoffs\ngame (FPG). Assisted by an attractive property of fuzzy bi-matrix games, the\nexistence of fuzzy Nash equilibrium (FNE) for our formulated FPG is proved. Our\nrobust fuzzy-learning algorithm could reach the equilibrium solution via a\nleast-deviation method. Finally, numerical simulations are provided to\ndemonstrate the advantages of our new scheme over the existing scheme.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 03:35:09 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Fan", "Chaoqiong", ""], ["Li", "Bin", ""], ["Hou", "Jia", ""], ["Wu", "Yi", ""], ["Guo", "Weisi", ""], ["Zhao", "Chenglin", ""]]}, {"id": "1806.10853", "submitter": "Vaneet Aggarwal", "authors": "Eric Friedlander and Vaneet Aggarwal", "title": "Generalization of LRU Cache Replacement Policy with Applications to\n  Video Streaming", "comments": "Accepted to ACM TOMPECS, Jun 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Caching plays a crucial role in networking systems to reduce the load on the\nnetwork and is commonly employed by content delivery networks (CDNs) in order\nto improve performance. One of the commonly used mechanisms, Least Recently\nUsed (LRU), works well for identical file sizes. However, for asymmetric file\nsizes, the performance deteriorates. This paper proposes an adaptation to the\nLRU strategy, called gLRU, where the file is sub-divided into equal-sized\nchunks. In this strategy, a chunk of the newly requested file is added in the\ncache, and a chunk of the least-recently-used file is removed from the cache.\nEven though approximate analysis for the hit rate has been studied for LRU, the\nanalysis does not extend to gLRU since the metric of interest is no longer the\nhit rate as the cache has partial files. This paper provides a novel\napproximation analysis for this policy where the cache may have partial file\ncontents. The approximation approach is validated by simulations. Further, gLRU\noutperforms the LRU strategy for a Zipf file popularity distribution and\ncensored Pareto file size distribution for the file download times. Video\nstreaming applications can further use the partial cache contents to help the\nstall duration significantly, and the numerical results indicate significant\nimprovements (32\\%) in stall duration using the gLRU strategy as compared to\nthe LRU strategy. Furthermore, the gLRU replacement policy compares favorably\nto two other cache replacement policies when simulated on MSR Cambridge Traces\nobtained from the SNIA IOTTA repository.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 09:44:56 GMT"}, {"version": "v2", "created": "Mon, 24 Jun 2019 01:56:07 GMT"}], "update_date": "2019-06-25", "authors_parsed": [["Friedlander", "Eric", ""], ["Aggarwal", "Vaneet", ""]]}, {"id": "1806.10906", "submitter": "Jason R.C. Nurse Dr", "authors": "Jason R.C. Nurse and Petar Radanliev and Sadie Creese and David De\n  Roure", "title": "If you can't understand it, you can't properly assess it! The reality of\n  assessing security risks in Internet of Things systems", "comments": "9 pages, 1 figure", "journal-ref": "IET Living in the Internet of Things: Cybersecurity of the IoT\n  Conference 2018", "doi": "10.1049/cp.2018.0001", "report-no": null, "categories": "cs.CR cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security risk assessment methods have served us well over the last two\ndecades. As the complexity, pervasiveness and automation of technology systems\nincreases, particularly with the Internet of Things (IoT), there is a\nconvincing argument that we will need new approaches to assess risk and build\nsystem trust. In this article, we report on a series of scoping workshops and\ninterviews with industry professionals (experts in enterprise systems, IoT and\nrisk) conducted to investigate the validity of this argument. Additionally, our\nresearch aims to consult with these professionals to understand two crucial\naspects. Firstly, we seek to identify the wider concerns in adopting IoT\nsystems into a corporate environment, be it a smart manufacturing shop floor or\na smart office. Secondly, we investigate the key challenges for approaches in\nindustry that attempt to effectively and efficiently assess cyber-risk in the\nIoT.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 12:07:12 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Nurse", "Jason R. C.", ""], ["Radanliev", "Petar", ""], ["Creese", "Sadie", ""], ["De Roure", "David", ""]]}, {"id": "1806.10964", "submitter": "Tigran Tonoyan", "authors": "Magnus M. Halldorsson, Tigran Tonoyan", "title": "Effective Wireless Scheduling via Hypergraph Sketches", "comments": "38 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An overarching issue in resource management of wireless networks is assessing\ntheir capacity: How much communication can be achieved in a network, utilizing\nall the tools available: power control, scheduling, routing, channel assignment\nand rate adjustment? We propose the first framework for approximation\nalgorithms in the physical model of wireless interference that addresses these\nquestions in full. The approximations obtained are at most doubly logarithmic\nin the link length and rate diversity. Where previous bounds are known, this\ngives an exponential improvement (or better).\n  A key contribution is showing that the complex interference relationship of\nthe physical model can be simplified, at a small cost, into a novel type of\namenable conflict graphs. We also show that the approximation obtained is\nprovably the best possible for any conflict graph formulation.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 13:41:07 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Halldorsson", "Magnus M.", ""], ["Tonoyan", "Tigran", ""]]}, {"id": "1806.10969", "submitter": "Andrea Bonfante", "authors": "Andrea Bonfante, Lorenzo Galati Giordano, David L\\'opez-P\\'erez,\n  Adrian Garcia-Rodriguez, Giovanni Geraci, Paolo Baracca, M. Majid Butt, Merim\n  Dzaferagic, Nicola Marchetti", "title": "Performance of Massive MIMO Self-Backhauling for Ultra-Dense Small Cell\n  Deployments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A key aspect of the fifth-generation wireless communication network will be\nthe integration of different services and technologies to provide seamless\nconnectivity. In this paper, we consider using massive multiple-input\nmultiple-output (mMIMO) to provide backhaul links to a dense deployment of\nself-backhauling (s-BH) small cells (SCs) that provide cellular access within\nthe same spectrum resources of the backhaul. Through a comprehensive\nsystem-level simulation study, we evaluate the interplay between access and\nbackhaul and the resulting end-to-end user rates. Moreover, we analyze the\nimpact of different SCs deployment strategies, while varying the time resource\nallocation between radio access and backhaul links. We finally compare the\nabove mMIMO-based s-BH approach to a mMIMO direct access (DA) architecture\naccounting for the effects of pilot reuse schemes, together with their\nassociated overhead and contamination mitigation effects. The results show that\ndense SCs deployments supported by mMIMO s-BH provide significant rate\nimprovements for cell-edge users (UEs) in ultra-dense deployments with respect\nto mMIMO DA, while the latter outperforms mMIMO s-BH from the median UEs'\nstandpoint.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 13:48:13 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Bonfante", "Andrea", ""], ["Giordano", "Lorenzo Galati", ""], ["López-Pérez", "David", ""], ["Garcia-Rodriguez", "Adrian", ""], ["Geraci", "Giovanni", ""], ["Baracca", "Paolo", ""], ["Butt", "M. Majid", ""], ["Dzaferagic", "Merim", ""], ["Marchetti", "Nicola", ""]]}, {"id": "1806.11038", "submitter": "Fatemeh Shah-Mohammadi", "authors": "Fatemeh Shah-Mohammadi and Andres Kwasinski", "title": "Neural Network Cognitive Engine for Autonomous and Distributed Underlay\n  Dynamic Spectrum Access", "comments": "Submitted to IEEE Access Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG eess.SP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two key challenges in underlay dynamic spectrum access (DSA) are how to\nestablish an interference limit from the primary network (PN) and how cognitive\nradios (CRs) in the secondary network (SN) become aware of the interference\nthey create on the PN, especially when there is no exchange of information\nbetween the two networks. These challenges are addressed in this paper by\npresenting a fully autonomous and distributed underlay DSA scheme where each CR\noperates based on predicting its transmission effect on the PN. The scheme is\nbased on a cognitive engine with an artificial neural network that predicts,\nwithout exchanging information between the networks, the adaptive modulation\nand coding configuration for the primary link nearest to a transmitting CR. By\nmanaging the effect of the SN on the PN, the presented technique maintains the\nrelative average throughput change in the PN within a prescribed maximum value,\nwhile also finding transmit settings for the CRs that result in throughput as\nlarge as allowed by the PN interference limit. Simulation results show that the\nability of the cognitive engine in estimating the effect of a CR transmission\non the full adaptive modulation and coding (AMC) mode leads to a much more fine\nunderlay transmit power control. This ability also provides higher transmission\nopportunities for the CRs, compared to a scheme that can only estimate the\nmodulation scheme used at the PN link.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 15:35:12 GMT"}, {"version": "v2", "created": "Thu, 5 Jul 2018 17:08:23 GMT"}, {"version": "v3", "created": "Thu, 24 Jan 2019 02:12:40 GMT"}, {"version": "v4", "created": "Mon, 10 Feb 2020 21:02:14 GMT"}, {"version": "v5", "created": "Mon, 5 Oct 2020 00:44:50 GMT"}], "update_date": "2020-10-06", "authors_parsed": [["Shah-Mohammadi", "Fatemeh", ""], ["Kwasinski", "Andres", ""]]}, {"id": "1806.11047", "submitter": "Antonia Affinito", "authors": "Antonia Affinito, Alessio Botta, Luigi Gallo, Mauro Garofalo, Giorgio\n  Ventre", "title": "Spark-Based Anomaly Detection: the Case of Port and Net Scan", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The two most spread network anomalies are port and net scan. In this work, we\npresent and analyze the results obtained by traditional approaches for the\ndetection of net scan and port scans. We use a simple threshold-based\nalgorithm, working at flow-level and adapt it for the execution on Apache\nSpark. The use of Big Data Analytics technologies allows to significantly the\nexecution times of the algorithm so to be used even in current, high-speed\nnetworks. The paper describes our approach and presents an experimental\nanalysis in terms of detection performance and execution time. We use real\ntraffic traces from MAWI archive and MAWILab anomaly detectors to compare with\nour results. The analysis shows that i) our traditional threshold-based\nalgorithm is already able to achieve detection performance higher than MAWILab\n(in 95% of the considered cases with the best threshold value), currently\nconsidered the gold standard in the field; ii) the execution time is much\nshorter than the trace time, which makes it usable also in real time. Moreover,\nfor each traffic trace we provide the research community with a new labeled\ndataset, validated by comparisons with MAWILab and extended with other\nanomalies not detected by it. We publish an updated dataset every day at our\nproject website.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 16:00:16 GMT"}, {"version": "v2", "created": "Thu, 19 Jul 2018 16:20:00 GMT"}, {"version": "v3", "created": "Thu, 20 Sep 2018 13:42:09 GMT"}, {"version": "v4", "created": "Wed, 6 Mar 2019 15:06:30 GMT"}, {"version": "v5", "created": "Thu, 30 May 2019 16:30:22 GMT"}], "update_date": "2019-05-31", "authors_parsed": [["Affinito", "Antonia", ""], ["Botta", "Alessio", ""], ["Gallo", "Luigi", ""], ["Garofalo", "Mauro", ""], ["Ventre", "Giorgio", ""]]}, {"id": "1806.11053", "submitter": "Filipo Sharevski", "authors": "Filipo Sharevski and Sharief Oteafy", "title": "Security for Cyber-Physical Systems: Leveraging Cellular Networks and\n  Fog Computing", "comments": "IEEE CNS 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The reach and scale of Cyber Physical Systems (CPS) are expanding to many\naspects of our everyday lives. Health, safety, transportation and education are\na few areas where CPS are increasingly prevalent. There is a pressing need to\nsecure CPS, both at the edge and at the network core. We present a hybrid\nframework for securing CPS that leverages the computational resources and\ncoordination of Fog networks, and builds on cellular connectivity for low-power\nand resource constrained CPS devices. The routine support for cellular\nauthentication, encryption, and integrity protection is enhanced with the\naddition of a cellular cloud controller to take over the management of the\nradio and core security contexts dedicated to CPS devices. Specialized cellular\ncloudlets liaison with core network components to implement localized and\nnetwork-wide defense for denial-or-service, smart jamming, or unauthorized CPS\ntracking attacks. A comparison between our framework and recent cellular/fog\nsolutions is provided, together with a feasibility analysis for operational\nframework deployment. We conclude with future research directions that we\nbelieve are pivotal to the proliferation of secure and scalable CPS.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 16:12:51 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Sharevski", "Filipo", ""], ["Oteafy", "Sharief", ""]]}, {"id": "1806.11264", "submitter": "Wenbo Wang", "authors": "Wenbo Wang and Zehui Xiong and Dusit Niyato and Ping Wang and Zhu Han", "title": "A Hierarchical Game with Strategy Evolution for Mobile Sponsored Content\n  and Service Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In sponsored content and service markets, the content and service providers\nare able to subsidize their target mobile users through directly paying the\nmobile network operator, to lower the price of the data/service access charged\nby the network operator to the mobile users. The sponsoring mechanism leads to\na surge in mobile data and service demand, which in return compensates for the\nsponsoring cost and benefits the content/service providers. In this paper, we\nstudy the interactions among the three parties in the market, namely, the\nmobile users, the content/service providers and the network operator, as a\ntwo-level game with multiple Stackelberg (i.e., leader) players. Our study is\nfeatured by the consideration of global network effects owning to consumers'\ngrouping. Since the mobile users may have bounded rationality, we model the\nservice-selection process among them as an evolutionary-population follower\nsub-game. Meanwhile, we model the pricing-then-sponsoring process between the\ncontent/service providers and the network operator as a non-cooperative\nequilibrium searching problem. By investigating the structure of the proposed\ngame, we reveal a few important properties regarding the equilibrium existence,\nand propose a distributed, projection-based algorithm for iterative equilibrium\nsearching. Simulation results validate the convergence of the proposed\nalgorithm, and demonstrate how sponsoring helps improve both the providers'\nprofits and the users' experience.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jun 2018 04:26:57 GMT"}], "update_date": "2018-07-02", "authors_parsed": [["Wang", "Wenbo", ""], ["Xiong", "Zehui", ""], ["Niyato", "Dusit", ""], ["Wang", "Ping", ""], ["Han", "Zhu", ""]]}, {"id": "1806.11285", "submitter": "Mustafa Emara", "authors": "Mustafa Emara, Miltiades C. Filippou, Ingolf Karls", "title": "Availability and Reliability of Wireless Links in 5G Systems: A\n  Space-Time Approach", "comments": "Submitted to Globecom18, 5th International Workshop on Ultra-Reliable\n  Low-Latency Communications in Wireless Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless links are characterized by fluctuating quality leading to variable\npacket error rates which are orders of magnitude higher than the ones of wired\nlinks. Therefore, it is of paramount importance to investigate the limitations\nof using 5G wireless links for internet of things (IoT) applications. 5G\nwireless links in IoT need to assure determinism of process flows via realtime\ncommunication anytime and anywhere, which is an utmost requirement for multiple\nverticals like automotive, industrial automation and aerospace. Based on a\nspace-time approach, in this work, we provide novel definitions of wireless\nlink availability and reliability, assuming a number of access points (APs) and\nend points (EPs) deployed over a fixed area. Our objective is to analyze the\navailability of a service in both domains. In the space domain, we characterize\nspatially available areas consisting of all locations that meet a performance\nrequirement with confidence. In the time domain, we propose a channel\nallocation scheme accounting for the spatial availability of a cell. To\nemphasize the incurred space-time performance trade-offs, numerical results are\npresented, also highlighting the effect of different system parameters on the\nachievable link availability and reliability.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jun 2018 07:34:29 GMT"}], "update_date": "2018-07-02", "authors_parsed": [["Emara", "Mustafa", ""], ["Filippou", "Miltiades C.", ""], ["Karls", "Ingolf", ""]]}, {"id": "1806.11342", "submitter": "Qing Zhou", "authors": "Qing Zhou and Nan Liu", "title": "The Economics of Video Websites with Membership-Advertising Mode in\n  Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a novel business model of video websites via\nMembership-Advertising Mode in wireless network, where the video websites\nprovide three video services for mobile users: \\textit{VIP-Member} service,\nRegular-Member service and Non-Member service. The VIP-Member (Regular-Member)\nservice provides the highest level (middle level) quality and non-advertising\nvideo service with high (low) price, while the Non-Member service provides the\nlowest level quality and advertising-containing video service for free.\nMeanwhile, the video websites sell their advertising spaces to the advertiser\nto create extra revenues. We formulate the interactions among the advertiser,\nvideo websites and mobile users as a three-stage Stackelberg game.\nSpecifically, in Stage I, the advertiser decides the advertising budget; in\nStage II, the video websites determine their advertising spaces selling\nstrategies for advertiser and the membership pricing strategies for mobile\nusers; in Stage III, the mobile users make their own decisions on video\nwatching strategies for each video website. We analyze the equilibrium of each\nsub-game. Particularly, we derive the closed-form solutions of each mobile\nuser's optimal video watching strategies, each video website's optimal\nmembership price and the optimal advertising spaces selling number. In\naddition, we also investigate the piece-wise structure of the advertiser's\nutility function, and further propose an efficient algorithm to obtain the\noptimal advertising budget. Finally, numerical results show the impacts of\ndifferent parameters' values on each entity's utility as well as the key\nindicators.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jun 2018 10:38:56 GMT"}], "update_date": "2018-07-02", "authors_parsed": [["Zhou", "Qing", ""], ["Liu", "Nan", ""]]}, {"id": "1806.11448", "submitter": "Martin Henze", "authors": "Martin Henze, Roman Matzutt, Jens Hiller, Erik M\\\"uhmer, Jan Henrik\n  Ziegeldorf, Johannes van der Giet, Klaus Wehrle", "title": "Complying with Data Handling Requirements in Cloud Storage Systems", "comments": "14 pages, 11 figures; revised manuscript, accepted for publication in\n  IEEE Transactions on Cloud Computing", "journal-ref": null, "doi": "10.1109/TCC.2020.3000336", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In past years, cloud storage systems saw an enormous rise in usage. However,\ndespite their popularity and importance as underlying infrastructure for more\ncomplex cloud services, today's cloud storage systems do not account for\ncompliance with regulatory, organizational, or contractual data handling\nrequirements by design. Since legislation increasingly responds to rising data\nprotection and privacy concerns, complying with data handling requirements\nbecomes a crucial property for cloud storage systems. We present PRADA, a\npractical approach to account for compliance with data handling requirements in\nkey-value based cloud storage systems. To achieve this goal, PRADA introduces a\ntransparent data handling layer, which empowers clients to request specific\ndata handling requirements and enables operators of cloud storage systems to\ncomply with them. We implement PRADA on top of the distributed database\nCassandra and show in our evaluation that complying with data handling\nrequirements in cloud storage systems is practical in real-world cloud\ndeployments as used for microblogging, data sharing in the Internet of Things,\nand distributed email storage.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jun 2018 14:40:03 GMT"}, {"version": "v2", "created": "Sun, 7 Jun 2020 18:45:40 GMT"}], "update_date": "2020-06-09", "authors_parsed": [["Henze", "Martin", ""], ["Matzutt", "Roman", ""], ["Hiller", "Jens", ""], ["Mühmer", "Erik", ""], ["Ziegeldorf", "Jan Henrik", ""], ["van der Giet", "Johannes", ""], ["Wehrle", "Klaus", ""]]}]