[{"id": "1203.0442", "submitter": "Liyong Shen", "authors": "Liyong shen, Jin-san Cheng, Xiaohong Jia", "title": "Homeomorphic approximation of the intersection curve of two rational\n  surfaces", "comments": "18 pages,15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG math.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an approach of computing the intersection curve $\\mathcal{C}$ of\ntwo rational parametric surface $\\S_1(u,s)$ and $\\S_2(v,t)$, one being\nprojectable and hence can easily be implicitized. Plugging the parametric\nsurface to the implicit surface yields a plane algebraic curve $G(v,t)=0$. By\nanalyzing the topology graph $\\G$ of $G(v,t)=0$ and the singular points on the\nintersection curve $\\mathcal{C}$ we associate a space topology graph to\n$\\mathcal{C}$, which is homeomorphic to $\\mathcal{C}$ and therefore leads us to\nan approximation for $\\mathcal{C}$ in a given precision.\n", "versions": [{"version": "v1", "created": "Fri, 2 Mar 2012 12:23:34 GMT"}], "update_date": "2012-03-05", "authors_parsed": [["shen", "Liyong", ""], ["Cheng", "Jin-san", ""], ["Jia", "Xiaohong", ""]]}, {"id": "1203.0478", "submitter": "Liyong Shen", "authors": "Liyong Shen, Chunming Yuan, Xiao-Shan Gao", "title": "Certified Approximation of Parametric Space Curves with Cubic B-spline\n  Curves", "comments": "26 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG math.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Approximating complex curves with simple parametric curves is widely used in\nCAGD, CG, and CNC. This paper presents an algorithm to compute a certified\napproximation to a given parametric space curve with cubic B-spline curves. By\ncertified, we mean that the approximation can approximate the given curve to\nany given precision and preserve the geometric features of the given curve such\nas the topology, singular points, etc. The approximated curve is divided into\nsegments called quasi-cubic B\\'{e}zier curve segments which have properties\nsimilar to a cubic rational B\\'{e}zier curve. And the approximate curve is\nnaturally constructed as the associated cubic rational B\\'{e}zier curve of the\ncontrol tetrahedron of a quasi-cubic curve. A novel optimization method is\nproposed to select proper weights in the cubic rational B\\'{e}zier curve to\napproximate the given curve. The error of the approximation is controlled by\nthe size of its tetrahedron, which converges to zero by subdividing the curve\nsegments. As an application, approximate implicit equations of the approximated\ncurves can be computed. Experiments show that the method can approximate space\ncurves of high degrees with high precision and very few cubic B\\'{e}zier curve\nsegments.\n", "versions": [{"version": "v1", "created": "Fri, 2 Mar 2012 14:49:58 GMT"}], "update_date": "2012-03-05", "authors_parsed": [["Shen", "Liyong", ""], ["Yuan", "Chunming", ""], ["Gao", "Xiao-Shan", ""]]}, {"id": "1203.0912", "submitter": "Florentina Pintea", "authors": "Ionica Soare, Carmen Antohe", "title": "Modeling the geographical studies with GeoGebra-software", "comments": "8 pages", "journal-ref": "Ann. Univ. Tibiscus Comp. Sci. Series VIII / 1 (2010), 173-180", "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of mathematical modeling in geography is one of the most\nimportant strategies in order to establish the evolution and the prevision of\ngeographical phenomena. Models must have a simplified structure, to reflect\nessential components and must be selective, structured, and suggestive and\napproximate the reality. Models could be static or dynamic, developed in a\ntheoretical, symbolic, conceptual or mental way, mathematically modeled. The\npresent paper is focused on the virtual model which uses GeoGebra software,\nfree and available at www.geogebra.org, in order to establish new methods of\ngeographical analysis in a dynamic, didactic way.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2012 13:38:07 GMT"}], "update_date": "2012-03-06", "authors_parsed": [["Soare", "Ionica", ""], ["Antohe", "Carmen", ""]]}, {"id": "1203.1042", "submitter": "Sandeep Gupta", "authors": "Sandeep Gupta, Chinya Ravishankar", "title": "Lower bounds for Arrangement-based Range-Free Localization in Sensor\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Colander are location aware entities that collaborate to determine\napproximate location of mobile or static objects when beacons from an object\nare received by all colanders that are within its distance $R$. This model,\nreferred to as arrangement-based localization, does not require distance\nestimation between entities, which has been shown to be highly erroneous in\npractice. Colander are applicable in localization in sensor networks and\ntracking of mobile objects.\n  A set $S \\subset {\\mathbb R}^2$ is an $(R,\\epsilon)$-colander if by placing\nreceivers at the points of $S$, a wireless device with transmission radius $R$\ncan be localized to within a circle of radius $\\epsilon$. We present tight\nupper and lower bounds on the size of $(R,\\epsilon)$-colanders. We measure the\nexpected size of colanders that will form $(R, \\epsilon)$-colanders if they\ndistributed uniformly over the plane.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2012 21:01:02 GMT"}], "update_date": "2012-03-07", "authors_parsed": [["Gupta", "Sandeep", ""], ["Ravishankar", "Chinya", ""]]}, {"id": "1203.1525", "submitter": "Nicolai H\\\"ahnle", "authors": "Nicolai H\\\"ahnle", "title": "Constructing subset partition graphs with strong adjacency and end-point\n  count properties", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG cs.DM", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Kim defined a very general combinatorial abstraction of the diameter of\npolytopes called subset partition graphs to study how certain combinatorial\nproperties of such graphs may be achieved in lower bound constructions. Using\nLov\\'asz' Local Lemma, we give a general randomized construction for subset\npartition graphs satisfying strong adjacency and end-point count properties.\nThis can be used as a building block to conceptually simplify the constructions\ngiven in [Kim11].\n  We also use our method to construct abstract spindles, an analogy to the\nspindles used by Santos to disprove the Hirsch conjecture, of exponential\nlength which satisfy the adjacency and end-point count properties.\n", "versions": [{"version": "v1", "created": "Wed, 7 Mar 2012 16:31:25 GMT"}], "update_date": "2012-03-08", "authors_parsed": [["Hähnle", "Nicolai", ""]]}, {"id": "1203.1592", "submitter": "Emil Saucan", "authors": "Emil Saucan", "title": "Metric Ricci curvature for $PL$ manifolds", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DG cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a metric notion of Ricci curvature for $PL$ manifolds and study\nits convergence properties. We also prove a fitting version of the Bonnet-Myers\nTheorem, for surfaces as well as for a large class of higher dimensional\nmanifolds.\n", "versions": [{"version": "v1", "created": "Wed, 7 Mar 2012 20:12:10 GMT"}], "update_date": "2012-03-08", "authors_parsed": [["Saucan", "Emil", ""]]}, {"id": "1203.3256", "submitter": "Sarah Cannon", "authors": "Sarah Cannon, Mashhood Ishaque, Csaba T\\'oth", "title": "Conflict-free graph orientations with parity constraints", "comments": "To appear, Sixth International Conference on Fun with Algorithms,\n  June 4-6, 2012; 15 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is known that every multigraph with an even number of edges has an even\norientation (i.e., all indegrees are even). We study parity constrained graph\norientations under additional constraints. We consider two types of constraints\nfor a multigraph G=(V,E): (1) an exact conflict constraint is an edge set C in\nE and a vertex v in V such that C should not equal the set of incoming edges at\nv; (2) a subset conflict constraint is an edge set C in E and a vertex v in V\nsuch that C should not be a subset of incoming edges at v. We show that it is\nNP-complete to decide whether G has an even orientation with exact or subset\nconflicts, for all conflict sets of size two or higher. We present efficient\nalgorithms for computing parity constrained orientations with disjoint exact or\nsubset conflict pairs.\n", "versions": [{"version": "v1", "created": "Thu, 15 Mar 2012 02:47:12 GMT"}, {"version": "v2", "created": "Mon, 26 Mar 2012 02:34:01 GMT"}], "update_date": "2012-03-27", "authors_parsed": [["Cannon", "Sarah", ""], ["Ishaque", "Mashhood", ""], ["Tóth", "Csaba", ""]]}, {"id": "1203.3601", "submitter": "Niraj  Shakhakarmi", "authors": "Shakhakarmi Niraj, Dhadesugoor R. Vaman", "title": "Distributed Position Localization and Tracking (DPLT) of Malicious Nodes\n  in Cluster Based Mobile Ad hoc Networks (MANET)", "comments": "12 pages,23 figures, VTC conference", "journal-ref": "WSEAS Transactions on Communications, ISSN: 1109-2742, Issue 11,\n  Volume 9, November 2010", "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  In this paper, a robust distributed malicious node detection and precise\nlocalization and tracking method is proposed for Cluster based Mobile Ad hoc\nNetwork (MANET). Certificate Authority (CA) node is selected as the most stable\nnode among trusted nodes, surrounded by Registration Authority nodes (RAs) in\neach cluster to generate the Dynamic Demilitarized Zone (DDMZ) to defend CA\nfrom probable attackers and mitigate the authentication overhead. The RAs also\nco-operate with member nodes to detect a target node and determine whether it\nis malicious or not, by providing the public key certificate and trust value.\nIn addition, Internet Protocol (IP) based Triangulation and multi-lateration\nmethod are deployed based on using the average time difference of Time of\nArrival (ToA) and Time of Departure (ToD) of the management packets.\nTriangulation uses three reference nodes which are elected within each cluster\nbased on Best Criterion Function (BCF) to localize each member node inside the\ncluster in 2D. Multi-lateration is employed to localize the malicious target\nnode in 2D using four neighbor nodes. After localization of two consecutive\npositions, the target node is continuously localized and tracked by a\nparticular node using the modified real time Position Localization and Tracking\n(PL&T) algorithm by adaptive beam forming and mapping the energy contours of\ntracking zone into coverage radii distance. The performance of the proposed\nscheme demonstrates the significant accuracy in the detection of malicious\nnodes within each cluster.\n", "versions": [{"version": "v1", "created": "Fri, 16 Mar 2012 01:54:15 GMT"}], "update_date": "2012-03-19", "authors_parsed": [["Niraj", "Shakhakarmi", ""], ["Vaman", "Dhadesugoor R.", ""]]}, {"id": "1203.3618", "submitter": "Michael Payne", "authors": "Michael S. Payne, Jens M. Schmidt and David R. Wood", "title": "Which point sets admit a k-angulation?", "comments": "13 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For k >= 3, a k-angulation is a 2-connected plane graph in which every\ninternal face is a k-gon. We say that a point set P admits a plane graph G if\nthere is a straight-line drawing of G that maps V(G) onto P and has the same\nfacial cycles and outer face as G. We investigate the conditions under which a\npoint set P admits a k-angulation and find that, for sets containing at least\n2k^2 points, the only obstructions are those that follow from Euler's formula.\n", "versions": [{"version": "v1", "created": "Fri, 16 Mar 2012 05:57:17 GMT"}, {"version": "v2", "created": "Wed, 23 Jan 2013 01:26:33 GMT"}], "update_date": "2013-01-24", "authors_parsed": [["Payne", "Michael S.", ""], ["Schmidt", "Jens M.", ""], ["Wood", "David R.", ""]]}, {"id": "1203.3811", "submitter": "Rahul Prabhu", "authors": "Rahul Prabhu and Meera Sitharam and Aysegul Ozkan and Ruijin Wu", "title": "Atlasing of Assembly Landscapes using Distance Geometry and Graph\n  Rigidity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a novel geometric methodology for analyzing free-energy and\nkinetics of assembly driven by short-range pair-potentials in an implicit\nsolvent, and provides illustrations of its unique capabilities. An atlas is a\nlabeled partition of the assembly landscape into a topological roadmap of\nmaximal, contiguous, nearly-equipotential-energy conformational regions or\nmacrostates, together with their neighborhood relationships. The new\nmethodology decouples the roadmap generation from sampling and produces: (1) a\nquery-able atlas of local potential energy minima, their basin structure,\nenergy barriers, and neighboring basins; (2) paths between a specified pair of\nbasins; and (3) approximations of relative path lengths, basin volumes\n(configurational entropy), and path probabilities. Results demonstrating the\ncore algorithm's capabilities have been generated by a resource-light,\nopensource software implementation EASAL. EASAL atlases several hundred\nthousand macrostates in minutes on a standard laptop. Subsequent path and basin\ncomputations each take seconds. The core algorithm's correctness, time\ncomplexity, and efficiency-accuracy tradeoffs are formally guaranteed using\nmodern geometric constraint systems. The methodology further links geometric\nvariables of the input assembling units to a type of intuitive topological\nbar-code of the output atlas, which in turn determine stable assembled\nstructures and kinetics. This succinct input-output relationship facilitates\nreverse analysis, and control towards design. We use the novel convex Cayley\n(distance-based) parametrization that is unique to assembly, as opposed to\nfolding. Sampling microstates with macrostate-specific Cayley parameters avoids\ngradient-descent search used by all prevailing methods. This increases sampling\nefficiency, significantly reduces the number of repeated and discarded samples.\n", "versions": [{"version": "v1", "created": "Fri, 16 Mar 2012 20:27:51 GMT"}, {"version": "v2", "created": "Tue, 21 Jan 2020 00:41:48 GMT"}, {"version": "v3", "created": "Sat, 28 Mar 2020 05:46:20 GMT"}, {"version": "v4", "created": "Fri, 16 Oct 2020 14:43:27 GMT"}], "update_date": "2020-10-19", "authors_parsed": [["Prabhu", "Rahul", ""], ["Sitharam", "Meera", ""], ["Ozkan", "Aysegul", ""], ["Wu", "Ruijin", ""]]}, {"id": "1203.4600", "submitter": "Joshua Zahl", "authors": "Joshua Zahl", "title": "A Szemeredi-Trotter type theorem in $\\mathbb{R}^4$", "comments": "50 pages. V3: final version. To appear in Discrete and Computational\n  Geometry", "journal-ref": "Discrete. Comput. Geom. 54(3): 513--572, 2015", "doi": "10.1007/s00454-015-9717-7", "report-no": null, "categories": "math.CO cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that $m$ points and $n$ two-dimensional algebraic surfaces in\n$\\mathbb{R}^4$ can have at most\n$O(m^{\\frac{k}{2k-1}}n^{\\frac{2k-2}{2k-1}}+m+n)$ incidences, provided that the\nalgebraic surfaces behave like pseudoflats with $k$ degrees of freedom, and\nthat $m\\leq n^{\\frac{2k+2}{3k}}$. As a special case, we obtain a\nSzemer\\'edi-Trotter type theorem for 2--planes in $\\mathbb{R}^4$, provided\n$m\\leq n$ and the planes intersect transversely. As a further special case, we\nobtain a Szemer\\'edi-Trotter type theorem for complex lines in $\\mathbb{C}^2$\nwith no restrictions on $m$ and $n$ (this theorem was originally proved by\nT\\'oth using a different method). As a third special case, we obtain a\nSzemer\\'edi-Trotter type theorem for complex unit circles in $\\mathbb{C}^2$. We\nobtain our results by combining several tools, including a two-level analogue\nof the discrete polynomial partitioning theorem and the crossing lemma.\n", "versions": [{"version": "v1", "created": "Tue, 20 Mar 2012 21:35:54 GMT"}, {"version": "v2", "created": "Mon, 27 Oct 2014 16:07:40 GMT"}, {"version": "v3", "created": "Wed, 8 Jul 2015 18:34:18 GMT"}], "update_date": "2018-07-18", "authors_parsed": [["Zahl", "Joshua", ""]]}, {"id": "1203.4863", "submitter": "Gabriel Tucci", "authors": "John D. Hobby, Gabriel H. Tucci", "title": "Traffic Analysis in Random Delaunay Tessellations and Other Graphs", "comments": "Submitted to the Journal of Discrete Computational Geometry", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DG cs.CG cs.NI math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we study the degree distribution, the maximum vertex and edge\nflow in non-uniform random Delaunay triangulations when geodesic routing is\nused. We also investigate the vertex and edge flow in Erd\\\"os-Renyi random\ngraphs, geometric random graphs, expanders and random $k$-regular graphs.\nMoreover we show that adding a random matching to the original graph can\nconsiderably reduced the maximum vertex flow.\n", "versions": [{"version": "v1", "created": "Thu, 22 Mar 2012 00:46:00 GMT"}], "update_date": "2012-03-23", "authors_parsed": [["Hobby", "John D.", ""], ["Tucci", "Gabriel H.", ""]]}, {"id": "1203.5453", "submitter": "Aleksandar Nikolov", "authors": "S. Muthukrishnan, Aleksandar Nikolov", "title": "Optimal Private Halfspace Counting via Discrepancy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A range counting problem is specified by a set $P$ of size $|P| = n$ of\npoints in $\\mathbb{R}^d$, an integer weight $x_p$ associated to each point $p\n\\in P$, and a range space ${\\cal R} \\subseteq 2^{P}$. Given a query range $R\n\\in {\\cal R}$, the target output is $R(\\vec{x}) = \\sum_{p \\in R}{x_p}$. Range\ncounting for different range spaces is a central problem in Computational\nGeometry.\n  We study $(\\epsilon, \\delta)$-differentially private algorithms for range\ncounting. Our main results are for the range space given by hyperplanes, that\nis, the halfspace counting problem. We present an $(\\epsilon,\n\\delta)$-differentially private algorithm for halfspace counting in $d$\ndimensions which achieves $O(n^{1-1/d})$ average squared error. This contrasts\nwith the $\\Omega(n)$ lower bound established by the classical result of Dinur\nand Nissim [PODS 2003] for arbitrary subset counting queries. We also show a\nmatching lower bound on average squared error for any $(\\epsilon,\n\\delta)$-differentially private algorithm for halfspace counting. Both bounds\nare obtained using discrepancy theory. For the lower bound, we use a modified\ndiscrepancy measure and bound approximation of $(\\epsilon,\n\\delta)$-differentially private algorithms for range counting queries in terms\nof this discrepancy. We also relate the modified discrepancy measure to\nclassical combinatorial discrepancy, which allows us to exploit known\ndiscrepancy lower bounds. This approach also yields a lower bound of\n$\\Omega((\\log n)^{d-1})$ for $(\\epsilon, \\delta)$-differentially private\northogonal range counting in $d$ dimensions, the first known superconstant\nlower bound for this problem. For the upper bound, we use an approach inspired\nby partial coloring methods for proving discrepancy upper bounds, and obtain\n$(\\epsilon, \\delta)$-differentially private algorithms for range counting with\npolynomially bounded shatter function range spaces.\n", "versions": [{"version": "v1", "created": "Sat, 24 Mar 2012 22:25:12 GMT"}], "update_date": "2012-03-27", "authors_parsed": [["Muthukrishnan", "S.", ""], ["Nikolov", "Aleksandar", ""]]}, {"id": "1203.5782", "submitter": "Satyan L. Devadoss", "authors": "Howard Cheng, Satyan L. Devadoss, Brian Li, Andrej Risteski", "title": "Skeletal Rigidity of Phylogenetic Trees", "comments": "17 pages, 12 figures", "journal-ref": "Discrete Applied Mathematics 170 (2014) 46 - 54", "doi": null, "report-no": null, "categories": "cs.CG cs.CE math.AG q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by geometric origami and the straight skeleton construction, we\noutline a map between spaces of phylogenetic trees and spaces of planar\npolygons. The limitations of this map is studied through explicit examples,\nculminating in proving a structural rigidity result.\n", "versions": [{"version": "v1", "created": "Mon, 26 Mar 2012 19:44:51 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Cheng", "Howard", ""], ["Devadoss", "Satyan L.", ""], ["Li", "Brian", ""], ["Risteski", "Andrej", ""]]}, {"id": "1203.5944", "submitter": "Sergio Cabello", "authors": "Sergio Cabello, Bojan Mohar", "title": "Adding one edge to planar graphs makes crossing number and 1-planarity\n  hard", "comments": "27 pages, 10 figures. Part of the results appeared in Proceedings of\n  the 26th Annual Symposium on Computational Geometry (SoCG), 68-76, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.CC math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A graph is near-planar if it can be obtained from a planar graph by adding an\nedge. We show the surprising fact that it is NP-hard to compute the crossing\nnumber of near-planar graphs. A graph is 1-planar if it has a drawing where\nevery edge is crossed by at most one other edge. We show that it is NP-hard to\ndecide whether a given near-planar graph is 1-planar. The main idea in both\nreductions is to consider the problem of simultaneously drawing two planar\ngraphs inside a disk, with some of its vertices fixed at the boundary of the\ndisk. This leads to the concept of anchored embedding, which is of independent\ninterest. As an interesting consequence we obtain a new, geometric proof of\nNP-completeness of the crossing number problem, even when restricted to cubic\ngraphs. This resolves a question of Hlin\\v{e}n\\'y.\n", "versions": [{"version": "v1", "created": "Tue, 27 Mar 2012 12:03:12 GMT"}], "update_date": "2012-03-28", "authors_parsed": [["Cabello", "Sergio", ""], ["Mohar", "Bojan", ""]]}, {"id": "1203.6266", "submitter": "Luis Barba", "authors": "Greg Aloupis and Luis Barba and Stefan Langerman", "title": "Circle separability queries in logarithmic time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $P$ be a set of $n$ points in the plane. In this paper we study a new\nvariant of the circular separability problem in which a point set $P$ is\npreprocessed so that one can quickly answer queries of the following form:\nGiven a geometric object $Q$, report the minimum circle containing $P$ and\nexluding $Q$. Our data structure can be constructed in $O(n\\log n)$ time using\nO(n) space, and can be used to answer the query when $Q$ is either a circle or\na convex $m$-gon in $O(\\log n)$ or $O(\\log n + \\log m)$ time, respectively.\n", "versions": [{"version": "v1", "created": "Wed, 28 Mar 2012 13:37:56 GMT"}], "update_date": "2012-03-29", "authors_parsed": [["Aloupis", "Greg", ""], ["Barba", "Luis", ""], ["Langerman", "Stefan", ""]]}, {"id": "1203.6464", "submitter": "Ralf Osbild", "authors": "Ralf Osbild", "title": "General Analysis Tool Box for Controlled Perturbation", "comments": "90 pages, 30 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The implementation of reliable and efficient geometric algorithms is a\nchallenging task. The reason is the following conflict: On the one hand,\ncomputing with rounded arithmetic may question the reliability of programs\nwhile, on the other hand, computing with exact arithmetic may be too expensive\nand hence inefficient. One solution is the implementation of controlled\nperturbation algorithms which combine the speed of floating-point arithmetic\nwith a protection mechanism that guarantees reliability, nonetheless.\n  This paper is concerned with the performance analysis of controlled\nperturbation algorithms in theory. We answer this question with the\npresentation of a general analysis tool box. This tool box is separated into\nindependent components which are presented individually with their interfaces.\nThis way, the tool box supports alternative approaches for the derivation of\nthe most crucial bounds. We present three approaches for this task.\nFurthermore, we have thoroughly reworked the concept of controlled perturbation\nin order to include rational function based predicates into the theory;\npolynomial based predicates are included anyway. Even more we introduce\nobject-preserving perturbations. Moreover, the tool box is designed such that\nit reflects the actual behavior of the controlled perturbation algorithm at\nhand without any simplifying assumptions.\n", "versions": [{"version": "v1", "created": "Thu, 29 Mar 2012 08:19:30 GMT"}], "update_date": "2012-03-30", "authors_parsed": [["Osbild", "Ralf", ""]]}, {"id": "1203.6481", "submitter": "Krzysztof Fleszar", "authors": "Aparna Das, Krzysztof Fleszar, Stephen Kobourov, Joachim Spoerhase,\n  Sankar Veeramoni, Alexander Wolff", "title": "Polylogarithmic Approximation for Generalized Minimum Manhattan Networks", "comments": "14 pages, 5 figures; added appendix and figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a set of $n$ terminals, which are points in $d$-dimensional Euclidean\nspace, the minimum Manhattan network problem (MMN) asks for a minimum-length\nrectilinear network that connects each pair of terminals by a Manhattan path,\nthat is, a path consisting of axis-parallel segments whose total length equals\nthe pair's Manhattan distance. Even for $d=2$, the problem is NP-hard, but\nconstant-factor approximations are known. For $d \\ge 3$, the problem is\nAPX-hard; it is known to admit, for any $\\eps > 0$, an\n$O(n^\\eps)$-approximation.\n  In the generalized minimum Manhattan network problem (GMMN), we are given a\nset $R$ of $n$ terminal pairs, and the goal is to find a minimum-length\nrectilinear network such that each pair in $R$ is connected by a Manhattan\npath. GMMN is a generalization of both MMN and the well-known rectilinear\nSteiner arborescence problem (RSA). So far, only special cases of GMMN have\nbeen considered.\n  We present an $O(\\log^{d+1} n)$-approximation algorithm for GMMN (and, hence,\nMMN) in $d \\ge 2$ dimensions and an $O(\\log n)$-approximation algorithm for 2D.\nWe show that an existing $O(\\log n)$-approximation algorithm for RSA in 2D\ngeneralizes easily to $d>2$ dimensions.\n", "versions": [{"version": "v1", "created": "Thu, 29 Mar 2012 10:31:43 GMT"}, {"version": "v2", "created": "Mon, 23 Apr 2012 19:43:16 GMT"}], "update_date": "2012-04-24", "authors_parsed": [["Das", "Aparna", ""], ["Fleszar", "Krzysztof", ""], ["Kobourov", "Stephen", ""], ["Spoerhase", "Joachim", ""], ["Veeramoni", "Sankar", ""], ["Wolff", "Alexander", ""]]}, {"id": "1203.6786", "submitter": "Donald Sheehy", "authors": "Donald R. Sheehy", "title": "Linear-Size Approximations to the Vietoris-Rips Filtration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Vietoris-Rips filtration is a versatile tool in topological data\nanalysis. It is a sequence of simplicial complexes built on a metric space to\nadd topological structure to an otherwise disconnected set of points. It is\nwidely used because it encodes useful information about the topology of the\nunderlying metric space. This information is often extracted from its so-called\npersistence diagram. Unfortunately, this filtration is often too large to\nconstruct in full. We show how to construct an O(n)-size filtered simplicial\ncomplex on an $n$-point metric space such that its persistence diagram is a\ngood approximation to that of the Vietoris-Rips filtration. This new filtration\ncan be constructed in $O(n\\log n)$ time. The constant factors in both the size\nand the running time depend only on the doubling dimension of the metric space\nand the desired tightness of the approximation. For the first time, this makes\nit computationally tractable to approximate the persistence diagram of the\nVietoris-Rips filtration across all scales for large data sets.\n  We describe two different sparse filtrations. The first is a zigzag\nfiltration that removes points as the scale increases. The second is a\n(non-zigzag) filtration that yields the same persistence diagram. Both methods\nare based on a hierarchical net-tree and yield the same guarantees.\n", "versions": [{"version": "v1", "created": "Fri, 30 Mar 2012 12:22:46 GMT"}, {"version": "v2", "created": "Wed, 6 Mar 2013 13:36:57 GMT"}], "update_date": "2013-03-07", "authors_parsed": [["Sheehy", "Donald R.", ""]]}]