[{"id": "0801.0092", "submitter": "Kerry Soileau", "authors": "Kerry Michael Soileau", "title": "Nash bargaining with a nondeterministic threat", "comments": "Added solution algorithm", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": null, "abstract": "  We consider bargaining problems which involve two participants, with a\nnonempty closed, bounded convex bargaining set of points in the real plane\nrepresenting all realizable bargains. We also assume that there is no definite\nthreat or disagreement point which will provide the default bargain if the\nplayers cannot agree on some point in the bargaining set. However, there is a\nnondeterministic threat: if the players fail to agree on a bargain, one of them\nwill be chosen at random with equal probability, and that chosen player will\nselect any realizable bargain as the solution, subject to a reasonable\nrestriction.\n", "versions": [{"version": "v1", "created": "Sat, 29 Dec 2007 21:39:31 GMT"}, {"version": "v2", "created": "Fri, 4 Jan 2008 00:58:21 GMT"}], "update_date": "2008-01-04", "authors_parsed": [["Soileau", "Kerry Michael", ""]]}, {"id": "0801.0534", "submitter": "Olivier Finkel", "authors": "Olivier Finkel (ELM)", "title": "On the Length of the Wadge Hierarchy of Omega Context Free Languages", "comments": null, "journal-ref": "Journal of Automata, Languages and Combinatorics 10 (4) (2005)\n  439-464", "doi": null, "report-no": null, "categories": "cs.LO cs.CC cs.GT math.LO", "license": null, "abstract": "  We prove in this paper that the length of the Wadge hierarchy of omega\ncontext free languages is greater than the Cantor ordinal epsilon_omega, which\nis the omega-th fixed point of the ordinal exponentiation of base omega. The\nsame result holds for the conciliating Wadge hierarchy, defined by J. Duparc,\nof infinitary context free languages, studied by D. Beauquier. We show also\nthat there exist some omega context free languages which are\nSigma^0_omega-complete Borel sets, improving previous results on omega context\nfree languages and the Borel hierarchy.\n", "versions": [{"version": "v1", "created": "Thu, 3 Jan 2008 14:48:48 GMT"}], "update_date": "2008-01-04", "authors_parsed": [["Finkel", "Olivier", "", "ELM"]]}, {"id": "0801.1573", "submitter": "Damien Challet", "authors": "Christina Matzke and Damien Challet", "title": "Taking a shower in Youth Hostels: risks and delights of heterogeneity", "comments": "13 pages, 7 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.84.016107", "report-no": null, "categories": "physics.soc-ph cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tuning one's shower in some hotels may turn into a challenging coordination\ngame with imperfect information. The temperature sensitivity increases with the\nnumber of agents, making the problem possibly unlearnable. Because there is in\npractice a finite number of possible tap positions, identical agents are\nunlikely to reach even approximately their favorite water temperature. We show\nthat a population of agents with homogeneous strategies is evolutionary\nunstable, which gives insights into the emergence of heterogeneity, the latter\nbeing tempting but risky.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jan 2008 10:32:41 GMT"}, {"version": "v2", "created": "Mon, 13 Dec 2010 13:28:00 GMT"}], "update_date": "2013-05-29", "authors_parsed": [["Matzke", "Christina", ""], ["Challet", "Damien", ""]]}, {"id": "0801.1783", "submitter": "Olivier Finkel", "authors": "Jacques Duparc (UNIL), Olivier Finkel (LIP)", "title": "An omega-power of a context-free language which is Borel above\n  Delta^0_omega", "comments": "To appear in the Proceedings of the International Conference\n  Foundations of the Formal Sciences V : Infinite Games, November 26th to 29th,\n  2004, Bonn, Germany, Stefan Bold, Benedikt L\\\"owe, Thoralf R\\\"asch, Johan van\n  Benthem (eds.), College Publications at King's College (Studies in Logic),\n  2007", "journal-ref": "Dans Proceedings of the International Conference on Foundations of\n  the Formal Sciences V : Infinite Games - Foundations of the Formal Sciences V\n  : Infinite Games, November 26-29, 2004, Bonn : Allemagne", "doi": null, "report-no": null, "categories": "cs.CC cs.GT cs.LO math.LO", "license": null, "abstract": "  We use erasers-like basic operations on words to construct a set that is both\nBorel and above Delta^0_omega, built as a set V^\\omega where V is a language of\nfinite words accepted by a pushdown automaton. In particular, this gives a\nfirst example of an omega-power of a context free language which is a Borel set\nof infinite rank.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jan 2008 14:20:30 GMT"}], "update_date": "2008-09-10", "authors_parsed": [["Duparc", "Jacques", "", "UNIL"], ["Finkel", "Olivier", "", "LIP"]]}, {"id": "0801.2480", "submitter": "Gesualdo Scutari", "authors": "Gesualdo Scutari, Daniel P. Palomar, and Sergio Barbarossa", "title": "Asynchronous Iterative Waterfilling for Gaussian Frequency-Selective\n  Interference Channels", "comments": "Submitted to IEEE Transactions on Information Theory, August 22,\n  2006. Revised September 25, 2007. Accepted January 14, 2008. To appear on\n  IEEE Transactions on Information Theory, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": null, "abstract": "  This paper considers the maximization of information rates for the Gaussian\nfrequency-selective interference channel, subject to power and spectral mask\nconstraints on each link. To derive decentralized solutions that do not require\nany cooperation among the users, the optimization problem is formulated as a\nstatic noncooperative game of complete information. To achieve the so-called\nNash equilibria of the game, we propose a new distributed algorithm called\nasynchronous iterative waterfilling algorithm. In this algorithm, the users\nupdate their power spectral density in a completely distributed and\nasynchronous way: some users may update their power allocation more frequently\nthan others and they may even use outdated measurements of the received\ninterference. The proposed algorithm represents a unified framework that\nencompasses and generalizes all known iterative waterfilling algorithms, e.g.,\nsequential and simultaneous versions. The main result of the paper consists of\na unified set of conditions that guarantee the global converge of the proposed\nalgorithm to the (unique) Nash equilibrium of the game.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2008 12:36:50 GMT"}], "update_date": "2008-01-17", "authors_parsed": [["Scutari", "Gesualdo", ""], ["Palomar", "Daniel P.", ""], ["Barbarossa", "Sergio", ""]]}, {"id": "0801.2931", "submitter": "Jon Feldman", "authors": "Jon Feldman, S. Muthukrishnan, Evdokia Nikolova, Martin Pal", "title": "A Truthful Mechanism for Offline Ad Slot Scheduling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": null, "abstract": "  We consider the \"Offline Ad Slot Scheduling\" problem, where advertisers must\nbe scheduled to \"sponsored search\" slots during a given period of time.\nAdvertisers specify a budget constraint, as well as a maximum cost per click,\nand may not be assigned to more than one slot for a particular search.\n  We give a truthful mechanism under the utility model where bidders try to\nmaximize their clicks, subject to their personal constraints. In addition, we\nshow that the revenue-maximizing mechanism is not truthful, but has a Nash\nequilibrium whose outcome is identical to our mechanism. As far as we can tell,\nthis is the first treatment of sponsored search that directly incorporates both\nmultiple slots and budget constraints into an analysis of incentives.\n  Our mechanism employs a descending-price auction that maintains a solution to\na certain machine scheduling problem whose job lengths depend on the price, and\nhence is variable over the auction. The price stops when the set of bidders\nthat can afford that price pack exactly into a block of ad slots, at which\npoint the mechanism allocates that block and continues on the remaining slots.\nTo prove our result on the equilibrium of the revenue-maximizing mechanism, we\nfirst show that a greedy algorithm suffices to solve the revenue-maximizing\nlinear program; we then use this insight to prove that bidders allocated in the\nsame block of our mechanism have no incentive to deviate from bidding the fixed\nprice of that block.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jan 2008 16:34:30 GMT"}], "update_date": "2008-01-21", "authors_parsed": [["Feldman", "Jon", ""], ["Muthukrishnan", "S.", ""], ["Nikolova", "Evdokia", ""], ["Pal", "Martin", ""]]}, {"id": "0801.4130", "submitter": "Klas Olof Daniel Andersson", "authors": "Daniel Andersson", "title": "Solving Min-Max Problems with Applications to Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": null, "abstract": "  We refine existing general network optimization techniques, give new\ncharacterizations for the class of problems to which they can be applied, and\nshow that they can also be used to solve various two-player games in almost\nlinear time. Among these is a new variant of the network interdiction problem,\nwhere the interdictor wants to destroy high-capacity paths from the source to\nthe destination using a vertex-wise limited budget of arc removals. We also\nshow that replacing the limit average in mean payoff games by the maximum\nweight results in a class of games amenable to these techniques.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jan 2008 13:28:43 GMT"}], "update_date": "2008-01-29", "authors_parsed": [["Andersson", "Daniel", ""]]}, {"id": "0801.4417", "submitter": "Wei Lianfu", "authors": "L.F. Wei, J.R. Johansson, L.X. Cen, S. Ashhab, Franco Nori", "title": "Controllable coherent population transfers in superconducting qubits for\n  quantum computing", "comments": "4 pages, 6 figures. to appear in Physical Review Letters", "journal-ref": "Phys. Rev. Lett. 100, 113601 (2008)", "doi": "10.1103/PhysRevLett.100.113601", "report-no": null, "categories": "quant-ph cond-mat.mes-hall cond-mat.supr-con cs.GT", "license": null, "abstract": "  We propose an approach to coherently transfer populations between selected\nquantum states in one- and two-qubit systems by using controllable\nStark-chirped rapid adiabatic passages (SCRAPs). These {\\it evolution-time\ninsensitive} transfers, assisted by easily implementable single-qubit\nphase-shift operations, could serve as elementary logic gates for quantum\ncomputing. Specifically, this proposal could be conveniently demonstrated with\nexisting Josephson phase qubits. Our proposal can find an immediate application\nin the readout of these qubits. Indeed, the broken parity symmetries of the\nbound states in these artificial \"atoms\" provide an efficient approach to\ndesign the required adiabatic pulses.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jan 2008 02:14:19 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Wei", "L. F.", ""], ["Johansson", "J. R.", ""], ["Cen", "L. X.", ""], ["Ashhab", "S.", ""], ["Nori", "Franco", ""]]}, {"id": "0801.4585", "submitter": "Piotr Faliszewski", "authors": "Piotr Faliszewski, Lane A. Hemaspaandra", "title": "The Complexity of Power-Index Comparison", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": "URCS TR-2008-929", "categories": "cs.CC cs.GT", "license": null, "abstract": "  We study the complexity of the following problem: Given two weighted voting\ngames G' and G'' that each contain a player p, in which of these games is p's\npower index value higher? We study this problem with respect to both the\nShapley-Shubik power index [SS54] and the Banzhaf power index [Ban65,DS79]. Our\nmain result is that for both of these power indices the problem is complete for\nprobabilistic polynomial time (i.e., is PP-complete). We apply our results to\npartially resolve some recently proposed problems regarding the complexity of\nweighted voting games. We also study the complexity of the raw Shapley-Shubik\npower index. Deng and Papadimitriou [DP94] showed that the raw Shapley-Shubik\npower index is #P-metric-complete. We strengthen this by showing that the raw\nShapley-Shubik power index is many-one complete for #P. And our strengthening\ncannot possibly be further improved to parsimonious completeness, since we\nobserve that, in contrast with the raw Banzhaf power index, the raw\nShapley-Shubik power index is not #P-parsimonious-complete.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2008 00:10:07 GMT"}], "update_date": "2008-01-31", "authors_parsed": [["Faliszewski", "Piotr", ""], ["Hemaspaandra", "Lane A.", ""]]}, {"id": "0801.4851", "submitter": "Rajgopal Kannan", "authors": "Costas Busch and Rajgopal Kannan", "title": "Bicretieria Optimization in Routing Games", "comments": "15 pages, submitted to SPAA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": null, "abstract": "  Two important metrics for measuring the quality of routing paths are the\nmaximum edge congestion $C$ and maximum path length $D$. Here, we study\nbicriteria in routing games where each player $i$ selfishly selects a path that\nsimultaneously minimizes its maximum edge congestion $C_i$ and path length\n$D_i$. We study the stability and price of anarchy of two bicriteria games:\n  - {\\em Max games}, where the social cost is $\\max(C,D)$ and the player cost\nis $\\max(C_i, D_i)$. We prove that max games are stable and convergent under\nbest-response dynamics, and that the price of anarchy is bounded above by the\nmaximum path length in the players' strategy sets. We also show that this bound\nis tight in worst-case scenarios.\n  - {\\em Sum games}, where the social cost is $C+D$ and the player cost is\n$C_i+D_i$. For sum games, we first show the negative result that there are game\ninstances that have no Nash-equilibria. Therefore, we examine an approximate\ngame called the {\\em sum-bucket game} that is always convergent (and therefore\nstable). We show that the price of anarchy in sum-bucket games is bounded above\nby $C^* \\cdot D^* / (C^* + D^*)$ (with a poly-log factor), where $C^*$ and\n$D^*$ are the optimal coordinated congestion and path length. Thus, the\nsum-bucket game has typically superior price of anarchy bounds than the max\ngame. In fact, when either $C^*$ or $D^*$ is small (e.g. constant) the social\ncost of the Nash-equilibria is very close to the coordinated optimal $C^* +\nD^*$ (within a poly-log factor). We also show that the price of anarchy bound\nis tight for cases where both $C^*$ and $D^*$ are large.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2008 19:29:13 GMT"}], "update_date": "2008-02-01", "authors_parsed": [["Busch", "Costas", ""], ["Kannan", "Rajgopal", ""]]}]