[{"id": "1210.0061", "submitter": "Sander Wozniak", "authors": "Sander Wozniak and Michael Rossberg and Franz Girlich and Guenter\n  Schaefer", "title": "Geocast into the Past: Towards a Privacy-Preserving Spatiotemporal\n  Multicast for Cellular Networks", "comments": "- added IEEE copyright notice", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article introduces the novel concept of Spatiotemporal Multicast (STM),\nwhich is the issue of sending a message to mobile devices that have been\nresiding at a specific area during a certain time span in the past. A wide\nvariety of applications can be envisioned for this concept, including crime\ninvestigation, disease control, and social applications. An important aspect of\nthese applications is the need to protect the privacy of its users. In this\narticle, we present an extensive overview of applications and objectives to be\nfulfilled by an STM service. Furthermore, we propose a first Cluster-based\nSpatiotemporal Multicast (CSTM) approach and provide a detailed discussion of\nits privacy features. Finally, we evaluate the performance of our scheme in a\nlarge-scale simulation setup.\n", "versions": [{"version": "v1", "created": "Sat, 29 Sep 2012 00:35:04 GMT"}, {"version": "v2", "created": "Mon, 28 Jan 2013 14:48:22 GMT"}], "update_date": "2013-01-29", "authors_parsed": [["Wozniak", "Sander", ""], ["Rossberg", "Michael", ""], ["Girlich", "Franz", ""], ["Schaefer", "Guenter", ""]]}, {"id": "1210.0071", "submitter": "Jing Zhang", "authors": "Jing Zhang", "title": "A Literature Survey of Cooperative Caching in Content Distribution\n  Networks", "comments": "5 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Content distribution networks (CDNs) which serve to deliver web objects\n(e.g., documents, applications, music and video, etc.) have seen tremendous\ngrowth since its emergence. To minimize the retrieving delay experienced by a\nuser with a request for a web object, caching strategies are often applied -\ncontents are replicated at edges of the network which is closer to the user\nsuch that the network distance between the user and the object is reduced. In\nthis literature survey, evolution of caching is studied. A recent research\npaper [15] in the field of large-scale caching for CDN was chosen to be the\nanchor paper which serves as a guide to the topic. Research studies after and\nrelevant to the anchor paper are also analyzed to better evaluate the\nstatements and results of the anchor paper and more importantly, to obtain an\nunbiased view of the large scale collaborate caching systems as a whole.\n", "versions": [{"version": "v1", "created": "Sat, 29 Sep 2012 02:35:49 GMT"}], "update_date": "2012-10-02", "authors_parsed": [["Zhang", "Jing", ""]]}, {"id": "1210.0258", "submitter": "Jinwoo Shin", "authors": "Antonius B. Dieker and Jinwoo Shin", "title": "From Local to Global Stability in Stochastic Processing Networks through\n  Quadratic Lyapunov Functions", "comments": "39 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct a generic, simple, and efficient scheduling policy for\nstochastic processing networks, and provide a general framework to establish\nits stability. Our policy is randomized and prioritized: with high probability\nit prioritizes jobs which have been least routed through the network. We show\nthat the network is globally stable under this policy if there exists an\nappropriate quadratic local Lyapunov function that provides a negative drift\nwith respect to nominal loads at servers. Applying this generic framework, we\nobtain stability results for our policy in many important examples of\nstochastic processing networks: open multiclass queueing networks, parallel\nserver networks, networks of input-queued switches, and a variety of wireless\nnetwork models with interference constraints. Our main novelty is the\nconstruction of an appropriate global Lyapunov function from quadratic local\nLyapunov functions, which we believe to be of broader interest.\n", "versions": [{"version": "v1", "created": "Sun, 30 Sep 2012 23:52:38 GMT"}], "update_date": "2012-10-02", "authors_parsed": [["Dieker", "Antonius B.", ""], ["Shin", "Jinwoo", ""]]}, {"id": "1210.0510", "submitter": "Tayeb Lemlouma", "authors": "Tayeb Lemlouma, Yoann Lefebvre, Fr\\'ed\\'eric Cespedes", "title": "PCNM: A New Platform for Cellular Networks Measurements and Optimization", "comments": "IEEE International Conference on Wireless Communications, Networking\n  and Mobile Computing (WiCOM 2007)", "journal-ref": null, "doi": "10.1109/WICOM.2007.737", "report-no": null, "categories": "cs.NI cs.OH cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present PCNM, a new mobile platform for cellular networks\nmeasurements. PCNM is based on a set of techniques that tailors theoretical\ncalculations and simulations to the real cellular network environment. It\nincludes: (a) modules that measure different parameters of a base station (BS)\nsuch as localization, cells identification, time advance information, reception\nlevel and quality, (b) a new protocol that optimizes the task of network\nmeasurement by monitoring a set of mobile nodes and finally (c) the ability to\nextend an existing cellular network by adding new base stations. We evaluate\nour genetic algorithm used to reduce the nodes mobility and optimize the\nmeasurement extraction of N base stations using k mobile sensors (k >= 1). We\nshow how connecting real measurements (using mobile sensors in a collaborative\nway) to theoretical and prediction methods is of high benefits for cellular\nnetworks maintenance, extension and performances evaluation.\n", "versions": [{"version": "v1", "created": "Mon, 1 Oct 2012 19:15:19 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Lemlouma", "Tayeb", ""], ["Lefebvre", "Yoann", ""], ["Cespedes", "Frédéric", ""]]}, {"id": "1210.0511", "submitter": "Tayeb Lemlouma", "authors": "Tayeb Lemlouma, Julien Luciana, Bastien Oza, Leandro Sierra and\n  Mika\\\"el Sala\\\"un", "title": "An Easy Cellular Gateway for Providing Shared Services and Data", "comments": "6 pages; The Fifth International Conference on Systems and Networks\n  Communications, ICSNC 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a new framework that links the two worlds of wired\nand cellular users sharing systems. The approach is to propose an easy gateway\nthat enables the use of cellular networks based services by wireline users and\napplications. The idea is to use a mobile terminal or wireless equipment for\nsharing cellular services, available thanks to its cellular network, to other\nusers that use the wireline Internet. The software application acts as a\ngateway between the cellular and the wired network; it is responsible for\nsupporting the services provided by the wireless network and make them\naccessible and usable, in a standard and easy way, by anyone on the wireline\nnetwork. The gateway software can be integrated easily on any complex\narchitecture since it can interact with any cellular modem. The paper describes\nan implementation prototype where some examples of services, such as the\nability of using messaging services and calls streaming, are experimented. The\nproposed platform combines different standards to guarantee the use of our\ngateway in heterogeneous environments.\n", "versions": [{"version": "v1", "created": "Mon, 1 Oct 2012 19:16:15 GMT"}], "update_date": "2012-10-02", "authors_parsed": [["Lemlouma", "Tayeb", ""], ["Luciana", "Julien", ""], ["Oza", "Bastien", ""], ["Sierra", "Leandro", ""], ["Salaün", "Mikaël", ""]]}, {"id": "1210.0965", "submitter": "Kwan-Wu  Chin Dr", "authors": "Zhenxin Feng and Kwan-Wu Chin", "title": "A Survey of Delay Tolerant Networks Routing Protocols", "comments": "56 pages", "journal-ref": null, "doi": null, "report-no": "WTL-TechReport-1-12", "categories": "cs.NI cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in Micro-Electro-Mechanical Systems (MEMS) have revolutionized the\ndigital age to a point where animate and inanimate objects can be used as a\ncommunication channel. In addition, the ubiquity of mobile phones with\nincreasing capabilities and ample resources means people are now effectively\nmobile sensors that can be used to sense the environment as well as data\ncarriers. These objects, along with their devices, form a new kind of networks\nthat are characterized by frequent disconnections, resource constraints and\nunpredictable or stochastic mobility patterns. A key underpinning in these\nnetworks is routing or data dissemination protocols that are designed\nspecifically to handle the aforementioned characteristics. Therefore, there is\na need to review state-of-the-art routing protocols, categorize them, and\ncompare and contrast their approaches in terms of delivery rate, resource\nconsumption and end-to-end delay. To this end, this paper reviews 63 unicast,\nmulticast and coding-based routing protocols that are designed specifically to\nrun in delay tolerant or challenged networks. We provide an extensive\nqualitative comparison of all protocols, highlight their experimental setup and\noutline their deficiencies in terms of design and research methodology. Apart\nfrom that, we review research that aims to exploit studies on social networks\nand epidemiology in order to improve routing protocol performance. Lastly, we\nprovide a list of future research directions.\n", "versions": [{"version": "v1", "created": "Wed, 3 Oct 2012 02:39:34 GMT"}], "update_date": "2012-10-04", "authors_parsed": [["Feng", "Zhenxin", ""], ["Chin", "Kwan-Wu", ""]]}, {"id": "1210.1185", "submitter": "Bita Azimdoost", "authors": "Bita Azimdoost, Cedric Westphal, Hamid R. Sadjadpour", "title": "Scaling Laws of the Throughput Capacity and Latency in\n  Information-Centric Networks", "comments": "12 pages, 6 figures, This is the journal version of the paper\n  presented in ITC25 under the name \"On the throughput capacity of\n  information-centric networks\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless information-centric networks consider storage as one of the network\nprimitives, and propose to cache data within the network in order to improve\nlatency and reduce bandwidth consumption. We study the throughput capacity and\ndelay in an information-centric network when the data cached in each node has a\nlimited lifetime. The results show that with some fixed request and cache\nexpiration rates, the order of the data access time does not change with\nnetwork growth, and the maximum throughput order is inversely proportional to\nthe square root and logarithm of the network size $n$ in cases of grid and\nrandom networks, respectively. Comparing these values with the corresponding\nthroughput and latency with no cache capability (throughput inversely\nproportional to the network size, and latency of order $\\sqrt{n}$ and\n$\\sqrt{\\frac{n}{\\log n}}$ in grid and random networks, respectively), we can\nactually quantify the asymptotic advantage of caching. Moreover, we compare\nthese scaling laws for different content discovery mechanisms and illustrate\nthat not much gain is lost when a simple path search is used.\n", "versions": [{"version": "v1", "created": "Wed, 3 Oct 2012 18:09:11 GMT"}, {"version": "v2", "created": "Tue, 16 Oct 2012 21:59:47 GMT"}, {"version": "v3", "created": "Thu, 30 Apr 2015 05:19:23 GMT"}], "update_date": "2015-05-01", "authors_parsed": [["Azimdoost", "Bita", ""], ["Westphal", "Cedric", ""], ["Sadjadpour", "Hamid R.", ""]]}, {"id": "1210.1326", "submitter": "Mohammad Firooz", "authors": "Mohammad H. Firooz, Zhiyong Chen, Sumit Roy, and Hui Liu", "title": "Wireless Network Coding via Modified 802.11 MAC/PHY: Design and\n  Implementation on SDR", "comments": null, "journal-ref": null, "doi": "10.1109/JSAC.2013.130823", "report-no": null, "categories": "cs.IT cs.NI cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network coding (NC), in principle, is a Layer-3 innovation that improves\nnetwork throughput in wired networks for multicast/broadcast scenarios. Due to\nthe fundamental differences between wired and wireless networks, extending NC\nto wireless networks generates several new and significant practical\nchallenges. Two-way information exchange (both symmetric and asymmetric).\nNetwork coding (NC), in principle, is a Layer-3 innovation that improves\nnetwork throughput in wired networks for multicast/broadcast scenarios. Due to\nthe fundamental differences between wired and wireless networks, extending NC\nto wireless networks generates several new and significant practical\nchallenges. Two-way information exchange (both symmetric and asymmetric)\nbetween a pair of 802.11 sources/sinks using an intermediate relay node is a\ncanonical scenario for evaluating the effectiveness of Wireless Network Coding\n(WNC) in a practical setting. Our primary objective in this work is to suggest\npragmatic and novel modifications at the MAC and PHY layers of the 802.11\nprotocol stack on a Software Radio (SORA) platform to support WNC and obtain\nachievable throughput estimates via lab-scale experiments. Our results show\nthat network coding (at the MAC or PHY layer) increases system\nthroughput-typically by 20-30%%.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 08:16:31 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Firooz", "Mohammad H.", ""], ["Chen", "Zhiyong", ""], ["Roy", "Sumit", ""], ["Liu", "Hui", ""]]}, {"id": "1210.1390", "submitter": "Arkadiusz Biernacki", "authors": "Arkadiusz Biernacki", "title": "Methods of QoS improvement for P2P IPTV based on traffic modelling", "comments": null, "journal-ref": "Complex, Intelligent and Software Intensive Systems (CISIS), 2010\n  International Conference on, pp. 445-450", "doi": "10.1109/CISIS.2010.173", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the last years many technological advances were introduced in Internet\ntelevision to meet user needs and expectations. However due to an overwhelming\nbandwidth requirements traditional IP-based television service based on simple\nclient-server approach remains restricted to small group of clients. In such\nsituation the use of the peer-to-peer overlay paradigm to deliver live\ntelevision on the Internet is gaining increasing attention. Unfortunately the\ncurrent Internet infrastructure provides only best effort services for this\nkind of applications and do not offer quality of service.\n  This paper is a research proposition which presents potential solutions for\nefficient IPTV streaming over P2P networks. We assume that the solutions will\nnot directly modify existing P2P IPTV protocols but rather will be dedicated\nfor a network engineer or an Internet service provider which will be able to\nintroduce and configure the proposed mechanisms in network routers.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 11:48:00 GMT"}], "update_date": "2012-10-05", "authors_parsed": [["Biernacki", "Arkadiusz", ""]]}, {"id": "1210.1394", "submitter": "Fabian Schneider", "authors": "Doris Schi\\\"oberg, Fabian Schneider, Gilles Tredan, Steve Uhlig, Anja\n  Feldmann", "title": "Revisiting Content Availability in Distributed Online Social Networks", "comments": "11pages, 12 figures; Technical report at TU Berlin, Department of\n  Electrical Engineering and Computer Science (ISSN 1436-9915)", "journal-ref": null, "doi": null, "report-no": "TU Berlin/EECS TR No. 2012 - 05", "categories": "cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online Social Networks (OSN) are among the most popular applications in\ntoday's Internet. Decentralized online social networks (DOSNs), a special class\nof OSNs, promise better privacy and autonomy than traditional centralized OSNs.\nHowever, ensuring availability of content when the content owner is not online\nremains a major challenge. In this paper, we rely on the structure of the\nsocial graphs underlying DOSN for replication. In particular, we propose that\nfriends, who are anyhow interested in the content, are used to replicate the\nusers content. We study the availability of such natural replication schemes\nvia both theoretical analysis as well as simulations based on data from OSN\nusers. We find that the availability of the content increases drastically when\ncompared to the online time of the user, e. g., by a factor of more than 2 for\n90% of the users. Thus, with these simple schemes we provide a baseline for any\nmore complicated content replication scheme.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 11:53:46 GMT"}], "update_date": "2012-10-05", "authors_parsed": [["Schiöberg", "Doris", ""], ["Schneider", "Fabian", ""], ["Tredan", "Gilles", ""], ["Uhlig", "Steve", ""], ["Feldmann", "Anja", ""]]}, {"id": "1210.1505", "submitter": "Yang Hong", "authors": "Yang Hong, Changcheng Huang, James Yan", "title": "A Comparative Study of SIP Overload Control Algorithms", "comments": "Network and Traffic Engineering in Emerging Distributed Computing\n  Applications, Edited by J. Abawajy, M. Pathan, M. Rahman, A.K. Pathan, and\n  M.M. Deris, IGI Global, 2012, pp. 1-20", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent collapses of SIP servers in the carrier networks indicates two\npotential problems of SIP: (1) the current SIP design does not easily scale up\nto large network sizes, and (2) the built-in SIP overload control mechanism\ncannot handle overload conditions effectively. In order to help carriers\nprevent widespread SIP network failure effectively, this chapter presents a\nsystematic investigation of current state-of-the-art overload control\nalgorithms. To achieve this goal, this chapter first reviews two basic\nmechanisms of SIP, and summarizes numerous experiment results reported in the\nliteratures which demonstrate the impact of overload on SIP networks. After\nsurveying the approaches for modeling the dynamic behaviour of SIP networks\nexperiencing overload, the chapter presents a comparison and assessment of\ndifferent types of SIP overload control solutions. Finally it outlines some\nresearch opportunities for managing SIP overload control.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 16:15:11 GMT"}, {"version": "v2", "created": "Thu, 31 Jul 2014 01:58:13 GMT"}], "update_date": "2014-08-01", "authors_parsed": [["Hong", "Yang", ""], ["Huang", "Changcheng", ""], ["Yan", "James", ""]]}, {"id": "1210.1593", "submitter": "Lukasz Swierczewski", "authors": "Lukasz Swierczewski", "title": "The Distributed Computing Model Based on The Capabilities of The\n  Internet", "comments": "6 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Paper describes the theoretical and practical aspects of the proposed model\nthat uses distributed computing to a global network of Internet communication.\nDistributed computing are widely used in modern solutions such as research,\nwhere the requirement is very high processing power, which can not be placed in\none centralized point. The presented solution is based on open technologies and\ncomputers to perform calculations provided mainly by Internet users who are\nvolunteers.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 21:01:35 GMT"}], "update_date": "2012-10-08", "authors_parsed": [["Swierczewski", "Lukasz", ""]]}, {"id": "1210.1633", "submitter": "Wei Bao", "authors": "Wei Bao and Ben Liang", "title": "Insensitivity of User Distribution in Multicell Networks under General\n  Mobility and Session Patterns", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The location of active users is an important factor in the performance\nanalysis of mobile multicell networks, but it is difficult to quantify due to\nthe wide variety of user mobility and session patterns. In particular, the\nchannel holding times in each cell may be arbitrarily distributed and dependent\non those in other cells. In this work, we study the stationary distribution of\nusers by modeling the system as a multi-route queueing network with Poisson\ninputs. We consider arbitrary routing and arbitrary joint probability\ndistributions for the channel holding times in each route. Using a\ndecomposition-composition approach, we show that the user distribution (1) is\ninsensitive to the user movement patterns, (2) is insensitive to general and\ndependently distributed channel holding times, (3) depends only on the average\narrival rate and average channel holding time at each cell, and (4) is\ncompletely characterized by an open network with M/M/infinity queues. This\nresult is validated by experiments with the Dartmouth user mobility traces.\n", "versions": [{"version": "v1", "created": "Fri, 5 Oct 2012 03:13:53 GMT"}, {"version": "v2", "created": "Fri, 25 Jan 2013 04:28:18 GMT"}, {"version": "v3", "created": "Wed, 25 Sep 2013 04:14:20 GMT"}], "update_date": "2013-09-26", "authors_parsed": [["Bao", "Wei", ""], ["Liang", "Ben", ""]]}, {"id": "1210.1639", "submitter": "Vaneet Aggarwal", "authors": "Melissa Duarte, Ashutosh Sabharwal, Vaneet Aggarwal, Rittwik Jana, K.\n  K. Ramakrishnan, Christopher Rice and N. K. Shankaranarayanan", "title": "Design and Characterization of a Full-duplex Multi-antenna System for\n  WiFi networks", "comments": "44 page, 11 figures, 8 tables. Submitted to IEEE Transactions on\n  Vehicular Technology, Oct 2012", "journal-ref": "IEEE Transactions on Vehicular Technology, vol.63, no.3,\n  pp.1160--1177, March 2014", "doi": "10.1109/TVT.2013.2284712", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present an experimental and simulation based study to\nevaluate the use of full-duplex as a mode in practical IEEE 802.11 networks. To\nenable the study, we designed a 20 MHz multi-antenna OFDM full-duplex physical\nlayer and a full-duplex capable MAC protocol which is backward compatible with\ncurrent 802.11. Our extensive over-the-air experiments, simulations and\nanalysis demonstrate the following two results. First, the use of multiple\nantennas at the physical layer leads to a higher ergodic throughput than its\nhardware-equivalent multi-antenna half-duplex counterparts, for SNRs above the\nmedian SNR encountered in practical WiFi deployments. Second, the proposed MAC\ntranslates the physical layer rate gain into near doubling of throughput for\nmulti-node single-AP networks. The two combined results allow us to conclude\nthat there are potentially significant benefits gained from including a\nfull-duplex mode in future WiFi standards.\n", "versions": [{"version": "v1", "created": "Fri, 5 Oct 2012 03:40:45 GMT"}, {"version": "v2", "created": "Mon, 8 Oct 2012 02:32:05 GMT"}], "update_date": "2014-07-15", "authors_parsed": [["Duarte", "Melissa", ""], ["Sabharwal", "Ashutosh", ""], ["Aggarwal", "Vaneet", ""], ["Jana", "Rittwik", ""], ["Ramakrishnan", "K. K.", ""], ["Rice", "Christopher", ""], ["Shankaranarayanan", "N. K.", ""]]}, {"id": "1210.1915", "submitter": "Yuan Li", "authors": "Yuan Li", "title": "The Limitation of Random Network Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is already known that in multicast (single source, multiple sinks)\nnetwork, random linear network coding can achieve the maximum flow upper bound.\nIn this paper, we investigate how random linear network coding behaves in\ngeneral multi-source multi-sink case, where each sink has different demands,\nand characterize all achievable rate of random linear network coding by a\nsimple maximum flow condition.\n", "versions": [{"version": "v1", "created": "Sat, 6 Oct 2012 06:26:06 GMT"}], "update_date": "2012-10-09", "authors_parsed": [["Li", "Yuan", ""]]}, {"id": "1210.1975", "submitter": "Bojin Zheng", "authors": "Bojin Zheng, Dan Huang, Deyi Li, Guisheng Chen, Wenfei Lan", "title": "Some scale-free networks could be robust under the selective node\n  attacks", "comments": null, "journal-ref": "Bojin Zheng, Dan Huang, Deyi Li, Guisheng Chen and Wenfei Lan.\n  Some scale-free networks could be robust under the selective node attacks.\n  Europhysics Letter. 2011, 94: 028010", "doi": null, "report-no": null, "categories": "physics.soc-ph cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is a mainstream idea that scale-free network would be fragile under the\nselective attacks. Internet is a typical scale-free network in the real world,\nbut it never collapses under the selective attacks of computer viruses and\nhackers. This phenomenon is different from the deduction of the idea above\nbecause this idea assumes the same cost to delete an arbitrary node. Hence this\npaper discusses the behaviors of the scale-free network under the selective\nnode attack with different cost. Through the experiments on five complex\nnetworks, we show that the scale-free network is possibly robust under the\nselective node attacks; furthermore, the more compact the network is, and the\nlarger the average degree is, then the more robust the network is; With the\nsame average degrees, the more compact the network is, the more robust the\nnetwork is. This result would enrich the theory of the invulnerability of the\nnetwork, and can be used to build the robust social, technological and\nbiological networks, and also has the potential to find the target of drugs.\n", "versions": [{"version": "v1", "created": "Sat, 6 Oct 2012 16:54:47 GMT"}], "update_date": "2012-10-09", "authors_parsed": [["Zheng", "Bojin", ""], ["Huang", "Dan", ""], ["Li", "Deyi", ""], ["Chen", "Guisheng", ""], ["Lan", "Wenfei", ""]]}, {"id": "1210.2005", "submitter": "Sabah Al-Fedaghi Dr.", "authors": "Sabah Al-Fedaghi", "title": "Diagrammatization of the Transmission Control Protocol", "comments": "9 pages, 10 figures", "journal-ref": "International Journal of Computer Science Issues, Volume 9, Issue\n  5, September, 2012", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the wide spread of Internet services, developers and users need a\ngreater understanding of the technology of networking. Acquiring a clear\nunderstanding of communication protocols is an important step in understanding\nhow a network functions; however, many protocols are complicated, and\nexplaining them can be demanding. In addition, protocols are often explained in\nterms of traffic analysis and oriented toward technical staff and those already\nfamiliar with network protocols. This paper aims at proposing a diagrammatic\nmethodology to represent protocols in general, with a focus on the Transmission\nControl Protocol and Secure Sockets Layer in particular. The purpose is to\nfacilitate understanding of protocols for learning and communication purposes.\nThe methodology is based on the notion of flow of primitive things in a system\nwith six stages: creation, release, transfer, arrival, acceptance, and\nprocessing. Though the method presents a basic description of protocols without\nin-depth analysis of all aspects and mechanisms, the resultant conceptual\ndescription is a systematic specification that utilizes a few basic notions\nthat assist in illustrating functionality and support comprehension.\n", "versions": [{"version": "v1", "created": "Sat, 6 Oct 2012 22:00:11 GMT"}], "update_date": "2012-10-09", "authors_parsed": [["Al-Fedaghi", "Sabah", ""]]}, {"id": "1210.2025", "submitter": "Abdul Razaque", "authors": "Wafa Elmannai, Abdul Razaque, Khaled Elleithy", "title": "TCP-UB: A New congestion aware transmission control protocolvariant", "comments": "13 Pages, 11 figures", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.4, No.4, July 2012", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transmission control protocol (TCP) is a connection oriented protocol for\nseveral types of distributed applications. TCP is reliable particularly for\ntraditional fixed networks. With emergence of faster wireless networks, TCP has\nbeen performing poorly in its original format. The performance of TCP is\naffected due to assorted factors including congestion window, maximum packet\nsize, retry limit, recovery mechanism, backup mechanism and mobility. To\novercome deficiency of original TCP, Several modifications have been introduced\nto improve network quality. The mobility is a major hurdle in degrading the\nperformance of mobile wireless networks. In this paper, we introduce and\nimplement new TCP variant University of Bridgeport (UB) that combines the\nfeatures of TCP Westwood and Vegas. We examine the performance of TCP-UB, Vegas\nand Westwood using different realistic scenarios. NS2 simulator demonstrates\nthe stability of TCP-UB as compared with TCP Vegas and Westwood in highly\ncongested networks from the mobility point of view.\n", "versions": [{"version": "v1", "created": "Sun, 7 Oct 2012 06:13:44 GMT"}], "update_date": "2012-10-09", "authors_parsed": [["Elmannai", "Wafa", ""], ["Razaque", "Abdul", ""], ["Elleithy", "Khaled", ""]]}, {"id": "1210.2122", "submitter": "Saman Ashkiani", "authors": "Saman Ashkiani, and Anna Scaglione", "title": "Discrete Dithered Desynchronization", "comments": "submitted to the 32th IEEE International Conference on Computer\n  Communications, IEEE INFOCOM 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces the Discrete Dithered Desynchronization (D3sync)\nalgorithm which is a decentralized Time Division Multiple Access (TDMA)\ntechnique in which a set of network nodes computes iteratively a conflict-free\nschedule so that each node obtains a portion of a frame that is an integer\nmultiple of a fixed slot size. The algorithm is inspired by the dynamics of\nPulse Coupled Oscillators (PCO), but unlike its predecessors that divide\narbitrarily the frame among the nodes in the network, the D3sync allocates\ndiscrete resources among the network nodes.\n  Our paper proves the convergence of the D3sync algorithm and gives an upper\nbound on the convergence time of the algorithm.\n", "versions": [{"version": "v1", "created": "Mon, 8 Oct 2012 00:55:51 GMT"}], "update_date": "2012-10-09", "authors_parsed": [["Ashkiani", "Saman", ""], ["Scaglione", "Anna", ""]]}, {"id": "1210.2149", "submitter": "Ragib Hasan", "authors": "Shams Zawoad and Ragib Hasan", "title": "The Enemy Within: The Emerging Threats to Healthcare from Malicious\n  Mobile Devices", "comments": "To appear at MobiHealth 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  With the proliferation of wireless networks, mobile devices and medical\ndevices are increasingly being equipped with wireless interfaces, such as\nBluetooth and WiFi to allow easy access to and control of the medical devices.\nUnfortunately, the very presence and usage of such interfaces also expose the\nmedical devices to novel attacks from malicious parties. The emerging threat\nfrom malicious mobile devices is significant and severe, since attackers can\nsteal confidential data from a patient's medical device. Also, attackers can\ncompromise the medical device and either feed doctors bad data from it or issue\npotentially fatal commands to the device, which may even result in the death of\nthe patient. As the mobile devices are often at close proximity to the patient\n(either in the hospital or home settings), attacks from such devices are hard\nto prevent. In this paper, we present a systematic analysis of this new threat\nfrom mobile devices on medical devices and healthcare infrastructure. We also\nperform a thorough security analysis of a major hospital and uncover potential\nvulnerabilities. Finally, we propose a set of potential solutions and defenses\nagainst such attacks.\n", "versions": [{"version": "v1", "created": "Mon, 8 Oct 2012 05:34:18 GMT"}], "update_date": "2012-10-09", "authors_parsed": [["Zawoad", "Shams", ""], ["Hasan", "Ragib", ""]]}, {"id": "1210.2174", "submitter": "Arkadiusz Biernacki", "authors": "Arkadiusz Biernacki", "title": "Analysis of the flooding search algorithm with OPNET", "comments": null, "journal-ref": "Novel Algorithms and Techniques in Telecommunications and\n  Networking 2010, pp. 339-342, Springer", "doi": "10.1007/978-90-481-3662-9_58", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we consider the popular OPNET simulator as a tool for\nperformance evaluation of algorithms operating in peer-to-peer (P2P) networks.\nWe created simple framework and used it to analyse the flooding search\nalgorithm which is a popular technique for searching files in an unstructured\nP2P network. We investigated the influence of the number of replicas and time\nto live (TTL) of search queries on the algorithm performance. Preparing the\nsimulation we did not reported the problems which are commonly encountered in\nP2P dedicated simulators although the size of simulated network was limited.\n", "versions": [{"version": "v1", "created": "Mon, 8 Oct 2012 07:53:00 GMT"}], "update_date": "2012-10-09", "authors_parsed": [["Biernacki", "Arkadiusz", ""]]}, {"id": "1210.2911", "submitter": "Mahdieh Ghazvini", "authors": "Mahdieh Ghazvini, Naser Movahedinia, Kamal Jamshidi", "title": "Carrier Sense Multiple Access Tuning Parameters using Game Theory", "comments": "9 pages", "journal-ref": null, "doi": "10.5121/ijwmn.2012.4419", "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ad Hoc and Mesh networks are good samples of multi agent systems, where their\nnodes access the channel through carrier sense multiple access method, while a\nnode channel access influence the access of neighbor nodes to the channel.\nHence, game theory is a strong tool for studying this kind of networks. Carrier\nsense multiple access parameters such as minimum and maximum size of contention\nwindow and persistence factor can be modified based on game theoretic methods.\nIn this study different games for tuning the parameters is investigated and\ndifferent challenges are examined.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2012 13:36:37 GMT"}], "update_date": "2012-10-11", "authors_parsed": [["Ghazvini", "Mahdieh", ""], ["Movahedinia", "Naser", ""], ["Jamshidi", "Kamal", ""]]}, {"id": "1210.2940", "submitter": "Neha Rathi", "authors": "Neha Rathi, Jyoti Saraswat, Partha Pratim Bhattacharya", "title": "A review on routing protocols for application in wireless sensor\n  networks", "comments": "20 pages, 16 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks are harshly restricted by storage capacity, energy\nand computing power. So it is essential to design effective and energy aware\nprotocol in order to enhance the network lifetime. In this paper, a review on\nrouting protocol in WSNs is carried out which are classified as data-centric,\nhierarchical and location based depending on the network structure. Then some\nof the multipath routing protocols which are widely used in WSNs to improve\nnetwork performance are also discussed. Advantages and disadvantages of each\nrouting algorithm are discussed thereafter. Furthermore, this paper compares\nand summarizes the performances of routing protocols.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2012 14:51:38 GMT"}], "update_date": "2012-10-11", "authors_parsed": [["Rathi", "Neha", ""], ["Saraswat", "Jyoti", ""], ["Bhattacharya", "Partha Pratim", ""]]}, {"id": "1210.3047", "submitter": "Sanjoy Das mr", "authors": "Sanjoy Das and D.K Lobiyal", "title": "A Performance Analysis of LAR Protocol for Vehicular Ad Hoc Networks in\n  City Scenarios", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, performance analysis of Location Aided Routing (LAR) protocol\nin different city scenarios has been done. The mobility model considered is\nManhattan model. This mobility model used to emulate the movement pattern of\nnodes i.e., vehicles on streets defined by maps. Our objective is to provide a\nqualitative analysis of the LAR protocol in different city scenarios in\nVehicular Ad hoc Networks. We have considered three different city scenarios\nfor the analysis of the protocol. The simulation work has been conducted using\nthe Glomosim 2.03 simulator. The results show that LAR1 protocol achieves\nmaximum packet delivery ratio is 99.68 % and maximum average end-to-end delay\nis 7.319969 ms when the network is sparsely populated. Further, for densely\npopulated network maximum achieved packet delivery ratio is 87.58% and average\nend-to-end delay is 0.017684 ms.\n", "versions": [{"version": "v1", "created": "Tue, 9 Oct 2012 18:05:55 GMT"}], "update_date": "2012-10-12", "authors_parsed": [["Das", "Sanjoy", ""], ["Lobiyal", "D. K", ""]]}, {"id": "1210.3050", "submitter": "Abbas Nargesi", "authors": "Abbas Nargesi and Mehdi Ghasemi", "title": "Using Orthogonal Channels for Supporting Multicast Service in\n  Multi-channel Wireless Mesh Networks", "comments": "11 pages, 9 figures, 2 tables, nternational Journal of Computer\n  Networks & Communications (IJCNC) Vol.4, No.5, September 2012", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.4, No.5, September 2012", "doi": "10.5121/ijcnc.2012.4506", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unlike wired networks, the capacity of a wireless network is interference\nlimited due to the broadcast nature of wireless medium. Some multicast wireless\nnetwork protocols do not consider channel assignment issue, that they cause\ninterference at transmission nodes, hence do not use full capacity of the\nnetwork. Interference can be reduced and throughput improved with the use of\nmultichannel features. Therefore, this paper used orthogonal channels for\nsending and receiving nodes in the network. We propose EWM (Efficient Wireless\nMulticast) method that is distributed scheme for constructing multicast tree in\nmulti-channel multi-interface wireless mesh networks (MIMC-WMN) which selects\nrelay nodes and in distributed form assign orthogonal radio channels to them.\nTo more decrease of interference in adding a branch to the tree, the route with\nminimum end-to-end delay from the source to the multicast receiver will be\nchosen. Thus, the tree is suitable for multimedia applicants. We also employ\nthe broadcast nature of the wireless media to reduce the number of relay nodes.\nThe proposed algorithm is compared with MCM algorithm in NS2.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2012 20:35:05 GMT"}], "update_date": "2012-10-12", "authors_parsed": [["Nargesi", "Abbas", ""], ["Ghasemi", "Mehdi", ""]]}, {"id": "1210.3061", "submitter": "Elad Michael Schiller (PhD)", "authors": "Pierre Leone and Elad M. Schiller", "title": "Self-Stabilizing TDMA Algorithms for Dynamic Wireless Ad-hoc Networks", "comments": null, "journal-ref": null, "doi": "10.1155/2013/639761", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In dynamic wireless ad-hoc networks (DynWANs), autonomous computing devices\nset up a network for the communication needs of the moment. These networks\nrequire the implementation of a medium access control (MAC) layer. We consider\nMAC protocols for DynWANs that need to be autonomous and robust as well as have\nhigh bandwidth utilization, high predictability degree of bandwidth allocation,\nand low communication delay in the presence of frequent topological changes to\nthe communication network. Recent studies have shown that existing\nimplementations cannot guarantee the necessary satisfaction of these timing\nrequirements. We propose a self-stabilizing MAC algorithm for DynWANs that\nguarantees a short convergence period, and by that, it can facilitate the\nsatisfaction of severe timing requirements, such as the above. Besides the\ncontribution in the algorithmic front of research, we expect that our proposal\ncan enable quicker adoption by practitioners and faster deployment of DynWANs\nthat are subject changes in the network topology.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2012 21:02:09 GMT"}, {"version": "v2", "created": "Thu, 24 Jan 2013 23:33:59 GMT"}], "update_date": "2013-08-30", "authors_parsed": [["Leone", "Pierre", ""], ["Schiller", "Elad M.", ""]]}, {"id": "1210.3147", "submitter": "Nithya Rekha Sivakumar", "authors": "S.Nithya Rekha and Dr.C.Chandrasekar", "title": "Performance Analysis of Probabilistic Rebroadcasting in Grid FSR for\n  MANET", "comments": "8 pages, 15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile Ad-hoc Network (MANET) is the self organizing collection of mobile\nnodes. The communication in MANET is done via a wireless media. Ad hoc wireless\nnetworks have massive commercial and military potential because of their\nmobility support. Due to demanding real time multimedia applications, Quality\nof Services (QoS) support in such infrastructure less networks have become\nessential. QoS routing in mobile Ad-Hoc networks is challenging due to rapid\nchange in network topology. In this paper, we focused to reduce flooding\nperformance of the Fisheye State Routing (FSR) protocol in Grid using ns-2\nnetwork simulator under different performance metrics scenario in respect to\nnumber of Nodes. For example, the connection establishment is costly in terms\nof time and resource where the network is mostly affected by connection request\nflooding. The proposed approach presents a way to reduce flooding in MANETs.\nFlooding is dictated by the propagation of connection-request packets from the\nsource to its neighborhood nodes. The proposed architecture embarks on the\nconcept of sharing neighborhood information. The proposed approach focuses on\nexposing its neighborhood peer to another node that is referred to as its\nfriend-node, which had requested/forwarded connection request. If there is a\nhigh probability for the friend node to communicate through the exposed routes,\nthis could improve the efficacy of bandwidth utilization by reducing flooding,\nas the routes have been acquired, without any broadcasts. Friendship between\nnodes is quantized based on empirical computations and heuristic algorithms.\nThe nodes store the neighborhood information in their cache that is\nperiodically verified for consistency. Simulation results show the performance\nof this proposed method.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2012 07:54:20 GMT"}], "update_date": "2012-10-12", "authors_parsed": [["Rekha", "S. Nithya", ""], ["Chandrasekar", "Dr. C.", ""]]}, {"id": "1210.3171", "submitter": "Hadassa Daltrophe", "authors": "Hadassa Daltrophe, Shlomi Dolev and Zvi Lotker", "title": "Data Interpolation: An Efficient Sampling Alternative for Big Data\n  Aggregation", "comments": "The Lynne and William Frankel Center for Computer Science, Ben-Gurion\n  University of the Negev, 2012 #13-01", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Given a large set of measurement sensor data, in order to identify a simple\nfunction that captures the essence of the data gathered by the sensors, we\nsuggest representing the data by (spatial) functions, in particular by\npolynomials. Given a (sampled) set of values, we interpolate the datapoints to\ndefine a polynomial that would represent the data. The interpolation is\nchallenging, since in practice the data can be noisy and even Byzantine, where\nthe Byzantine data represents an adversarial value that is not limited to being\nclose to the correct measured data. We present two solutions, one that extends\nthe Welch-Berlekamp technique in the case of multidimensional data, and copes\nwith discrete noise and Byzantine data, and the other based on Arora and Khot\ntechniques, extending them in the case of multidimensional noisy and Byzantine\ndata.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2012 10:25:44 GMT"}], "update_date": "2012-10-12", "authors_parsed": [["Daltrophe", "Hadassa", ""], ["Dolev", "Shlomi", ""], ["Lotker", "Zvi", ""]]}, {"id": "1210.3187", "submitter": "Rajesh Sundaresan", "authors": "Vasuki Narasimha Swamy, Srikrishna Bhashyam, Rajesh Sundaresan, and\n  Pramod Viswanath", "title": "An asymptotically optimal push-pull method for multicasting over a\n  random network", "comments": "13 pages, extended version of paper presented at the IEEE\n  International Symposium on Information Theory (ISIT) 2012, minor revision to\n  text to address review comments, to appear in IEEE Transactions in\n  information theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider allcast and multicast flow problems where either all of the nodes\nor only a subset of the nodes may be in session. Traffic from each node in the\nsession has to be sent to every other node in the session. If the session does\nnot consist of all the nodes, the remaining nodes act as relays. The nodes are\nconnected by undirected links whose capacities are independent and identically\ndistributed random variables. We study the asymptotics of the capacity region\n(with network coding) in the limit of a large number of nodes, and show that\nthe normalized sum rate converges to a constant almost surely. We then provide\na decentralized push-pull algorithm that asymptotically achieves this\nnormalized sum rate without network coding.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2012 11:41:34 GMT"}, {"version": "v2", "created": "Fri, 8 Feb 2013 20:49:09 GMT"}], "update_date": "2013-02-11", "authors_parsed": [["Swamy", "Vasuki Narasimha", ""], ["Bhashyam", "Srikrishna", ""], ["Sundaresan", "Rajesh", ""], ["Viswanath", "Pramod", ""]]}, {"id": "1210.3319", "submitter": "Shaun Joseph", "authors": "Shaun N. Joseph and Lisa C. DiPippo", "title": "Pseudo-scheduling: A New Approach to the Broadcast Scheduling Problem", "comments": "8th International Symposium on Algorithms for Sensor Systems,\n  Wireless Ad Hoc Networks and Autonomous Mobile Entities (ALGOSENSORS 2012),\n  13-14 September 2012, Ljubljana, Slovenia. 12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.NI math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The broadcast scheduling problem asks how a multihop network of broadcast\ntransceivers operating on a shared medium may share the medium in such a way\nthat communication over the entire network is possible. This can be naturally\nmodeled as a graph coloring problem via distance-2 coloring (L(1,1)-labeling,\nstrict scheduling). This coloring is difficult to compute and may require a\nnumber of colors quadratic in the graph degree. This paper introduces\npseudo-scheduling, a relaxation of distance-2 coloring. Centralized and\ndecentralized algorithms that compute pseudo-schedules with colors linear in\nthe graph degree are given and proved.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2012 18:51:02 GMT"}], "update_date": "2012-10-12", "authors_parsed": [["Joseph", "Shaun N.", ""], ["DiPippo", "Lisa C.", ""]]}, {"id": "1210.3435", "submitter": "Kaniezhil Radhakrishnan", "authors": "R. Kaniezhil and C. Chandrasekar", "title": "Multiple Service providers sharing Spectrum using Cognitive Radio in\n  Wireless Communication Networks", "comments": "7 pages; International Journal of Scientific & Engineering Research,\n  Volume 3, Issue 3, March-2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The current utilization of the spectrum is quite inefficient; consequently,\nif properly used, there is no shortage of the spectrum that is at present\navailable. Therefore, it is anticipated that more flexible use of spectrum and\nspectrum sharing between radio systems will be key enablers to facilitate the\nsuccessful implementation of future systems. Cognitive radio, however, is known\nas the most intelligent and promising technique in solving the problem of\nspectrum sharing. In this paper, we consider the technique of spectrum sharing\namong users of service providers to share the licensed spectrum of licensed\nservice providers. It is shown that the proposed technique reduces the call\nblocking rate and improves the spectrum utilization.\n", "versions": [{"version": "v1", "created": "Fri, 12 Oct 2012 06:24:52 GMT"}], "update_date": "2012-10-15", "authors_parsed": [["Kaniezhil", "R.", ""], ["Chandrasekar", "C.", ""]]}, {"id": "1210.3437", "submitter": "Kaniezhil Radhakrishnan", "authors": "R. Kaniezhil, C. Chandrasekar", "title": "Comparing Spectrum Utilization using Fuzzy Logic System for\n  Heterogeneous Wireless Networks via Cognitive Radio", "comments": "10 pages; International Journal of Scientific & Engineering Research,\n  Volume 3, Issue 7, July-2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  At present, lots of works focus on spectrum allocation of wireless networks.\nIn this paper, we proposed a Cognitive based spectrum access by\nopportunistically approach of Heterogeneous Wireless networks based on Fuzzy\nLogic system. The Cognitive Radio is a technology where a network or a wireless\nsystem changes its environment parameters to communicate efficiently by\navoiding the interference with the users. By applying FLS (Fuzzy Logic System),\nthe available spectrum utilization is effectively utilized with the help of the\nthree antecedents namely Spectrum utilization efficiency, Degree of mobility,\nDistance from primary user to the secondary users. The proposed work is\ncompared with normal Spectrum Utilization method. Finally, Simulation results\nof the proposed work Fuzzy Logic System shows more efficient than the normal\nSpectrum utilization method.\n", "versions": [{"version": "v1", "created": "Fri, 12 Oct 2012 06:30:39 GMT"}], "update_date": "2012-10-15", "authors_parsed": [["Kaniezhil", "R.", ""], ["Chandrasekar", "C.", ""]]}, {"id": "1210.3552", "submitter": "Magnus Skjegstad", "authors": "Magnus Skjegstad, Brage Ellings{\\ae}ter, Torleiv Maseng, Jon Crowcroft\n  and {\\O}ivind Kure", "title": "Large-Scale Distributed Internet-based Discovery Mechanism for Dynamic\n  Spectrum Allocation", "comments": "Accepted for publication at IEEE DySPAN 2014", "journal-ref": null, "doi": "10.1109/DySPAN.2014.6817824", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scarcity of frequencies and the demand for more bandwidth is likely to\nincrease the need for devices that utilize the available frequencies more\nefficiently. Radios must be able to dynamically find other users of the\nfrequency bands and adapt so that they are not interfered, even if they use\ndifferent radio protocols. As transmitters far away may cause as much\ninterference as a transmitter located nearby, this mechanism can not be based\non location alone. Central databases can be used for this purpose, but require\nexpensive infrastructure and planning to scale. In this paper, we propose a\ndecentralized protocol and architecture for discovering radio devices over the\nInternet. The protocol has low resource requirements, making it suitable for\nimplementation on limited platforms. We evaluate the protocol through\nsimulation in network topologies with up to 2.3 million nodes, including\ntopologies generated from population patterns in Norway. The protocol has also\nbeen implemented as proof-of-concept in real Wi-Fi routers.\n", "versions": [{"version": "v1", "created": "Fri, 12 Oct 2012 15:33:28 GMT"}, {"version": "v2", "created": "Tue, 18 Mar 2014 12:38:26 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Skjegstad", "Magnus", ""], ["Ellingsæter", "Brage", ""], ["Maseng", "Torleiv", ""], ["Crowcroft", "Jon", ""], ["Kure", "Øivind", ""]]}, {"id": "1210.3598", "submitter": "Jaume Barcelo", "authors": "Jaume Barcelo, Nuria Garcia, Azadeh Faridi, Simon Oechsner and Boris\n  Bellalta", "title": "Modelling a Decentralized Constraint Satisfaction Solver for\n  Collision-Free Channel Access", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the problem of assigning channel slots to a number of\ncontending stations is modeled as a Constraint Satisfaction Problem (CSP). A\nlearning MAC protocol that uses deterministic backoffs after successful\ntransmissions is used as a decentralized solver for the CSP. The convergence\nprocess of the solver is modeled by an absorbing Markov chain (MC), and\nanalytical, closed-form expressions for its transition probabilities are\nderived. Using these, the expected number of steps required to reach a solution\nis found. The analysis is validated by means of simulations and the model is\nextended to account for the presence of channel errors. The results are\napplicable in various resource allocation scenarios in wireless networks.\n", "versions": [{"version": "v1", "created": "Fri, 12 Oct 2012 18:49:38 GMT"}], "update_date": "2012-10-15", "authors_parsed": [["Barcelo", "Jaume", ""], ["Garcia", "Nuria", ""], ["Faridi", "Azadeh", ""], ["Oechsner", "Simon", ""], ["Bellalta", "Boris", ""]]}, {"id": "1210.3702", "submitter": "Tarun Juluru kumar", "authors": "Tarun Kumar Juluru and Anitha sheela Kankacharla", "title": "Estimation and compensation of inter carrier interference in wimax\n  physical layer under various channel models", "comments": "15 pages", "journal-ref": "International Journal of Next-Generation Networks,Vol.4,\n  No.3,September 2012", "doi": "10.5121/ijngn.2012.4306", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  WiMAX is Wireless Interoperability for Microwave Access has emerged as a\npromising solution for transmission of higher data rates for fixed and mobile\napplications. IEEE 802.16d and e are the standards proposed. To attain higher\ndata rates the Multi Carrier System with Multiple Input and Multiple Output\nMIMO is incorporated in the WiMAX. And all these sub carriers are considered to\nbe orthogonal to each other. As the number of sub carriers is increased there\nis no guarantee of sustained orthogonality, i.e. at some point the carriers are\nnot independent to each other, and hence where the orthogonality can be loosed\nwhich leads to interference and also owing to the synchronization between\ntransmitter and receiver local oscillator, it causes interference known as\nInter Carrier Interference (ICI).In this scheme at the transmitter side the\nmodulated data and a few predefined pilot symbols are mapped onto the non\nneighboring sub carriers with weighting coefficients of +1 and -1. With the aid\nof pilot symbols the frequency offset is exactly estimated by using Maximum\nLikelihood Estimation MLE and hence can be minimized. At demodulation stage the\nreceived signals are linearly combined along with their weighted oefficients\nand pilot symbols, called as Pilot Aided Self Cancellation Method PASCS. The\nsimulations are carried out on Stanford University Interim (SUI)channels. The\nsimulation results shows that by incorporating this method into WiMAX systems\nit performs better when the Line Of Sight (LOS) component is present in the\ntransmission and also it improves the Bit Error Rate (BER) and Carrier to\nInterference Ratio (CIR). The CIR can be improved 20 dB. In this paper the\neffectiveness of PASCS scheme is compared with the Self Cancellation Method\n(SCM). It provides accurate estimation of frequency offset and when residual\nCFO is less significant the ICI can be diminished successfully.\n", "versions": [{"version": "v1", "created": "Sat, 13 Oct 2012 12:34:24 GMT"}], "update_date": "2012-10-16", "authors_parsed": [["Juluru", "Tarun Kumar", ""], ["Kankacharla", "Anitha sheela", ""]]}, {"id": "1210.3768", "submitter": "Shih-Jung Wu", "authors": "Shih-Jung Wu, Shih-Yi Huang, Kuo-Feng Huang", "title": "Adaptive Priority-Based Downlink Scheduling for WiMAX Networks", "comments": "12 pages, 16 figures, 6 algorithms, 27 equations, 40 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Supporting quality of service (QoS) guarantees for diverse multimedia\nservices are the primary concerns for WiMAX (IEEE 802.16) networks. A\nscheduling scheme that satisfies QoS requirements has become more important for\nwireless communications. We propose a downlink scheduling scheme called\nadaptive priority-based downlink scheduling (APDS) for providing QoS guarantees\nin IEEE 802.16 networks. APDS comprises two major components: priority\nassignment and resource allocation. Different service-type connections\nprimarily depend on their QoS requirements to adjust priority assignments and\ndispatch bandwidth resources dynamically. We consider both starvation avoidance\nand resource management. Simulation results show that our APDS methodology\noutperforms the representative scheduling approaches in QoS satisfaction and\nmaintains fairness in starvation prevention.\n", "versions": [{"version": "v1", "created": "Sun, 14 Oct 2012 08:29:05 GMT"}], "update_date": "2012-10-16", "authors_parsed": [["Wu", "Shih-Jung", ""], ["Huang", "Shih-Yi", ""], ["Huang", "Kuo-Feng", ""]]}, {"id": "1210.3769", "submitter": "Mahima Mehta", "authors": "Mahima Mehta, Ranjan Bala Jain and Abhay Karandikar", "title": "Analysis of Blocking Probability in a Relay-based Cellular OFDMA Network", "comments": "33 pages, 10 figures", "journal-ref": "Pre-print version (May 2012)", "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Relay deployment in Orthogonal Frequency Division Multiple Access (OFDMA)\nbased cellular networks helps in coverage extension and or capacity\nimprovement. In OFDMA system, each user requires different number of\nsubcarriers to meet its rate requirement. This resource requirement depends on\nthe Signal to Interference Ratio (SIR) experienced by a user. Traditional\nmethods to compute blocking probability cannot be used in relay based cellular\nOFDMA networks. In this paper, we present an approach to compute the blocking\nprobability of such networks. We determine an expression of the probability\ndistribution of the users resource requirement based on its experienced SIR and\nthen classify the users into various classes depending upon their subcarrier\nrequirement. We consider the system to be a multidimensional system with\ndifferent classes and evaluate the blocking probability of system using the\nmulti-dimensional Erlang loss formulas.\n", "versions": [{"version": "v1", "created": "Sun, 14 Oct 2012 09:14:13 GMT"}, {"version": "v2", "created": "Tue, 29 Apr 2014 15:32:20 GMT"}], "update_date": "2014-04-30", "authors_parsed": [["Mehta", "Mahima", ""], ["Jain", "Ranjan Bala", ""], ["Karandikar", "Abhay", ""]]}, {"id": "1210.3872", "submitter": "Na Deng", "authors": "Na Deng, Ming Zhao, Sihai Zhang, and Wuyang Zhou", "title": "Traffic-Aware Relay Sleep Control to Improve Energy Efficiency in Joint\n  Macro-Relay Networks", "comments": "This paper has been withdrawn by the author because this work needs\n  to be further improved", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this letter, we consider a joint macro-relay network with densely deployed\nrelay stations (RSs) and dynamically varied traffic load measured by the number\nof users. An energy-efficient strategy is proposed by intelligently adjusting\nthe RS working modes (active or sleeping) according to the traffic variation.\nExplicit expressions related to the network energy efficiency are derived based\non stochastic geometry theory. Simulation results demonstrate that the derived\nanalytic results are reasonable and the proposed strategy can significantly\nimprove the network energy efficiency.\n", "versions": [{"version": "v1", "created": "Mon, 15 Oct 2012 01:59:38 GMT"}, {"version": "v2", "created": "Thu, 2 May 2013 14:29:01 GMT"}], "update_date": "2013-05-03", "authors_parsed": [["Deng", "Na", ""], ["Zhao", "Ming", ""], ["Zhang", "Sihai", ""], ["Zhou", "Wuyang", ""]]}, {"id": "1210.4301", "submitter": "Ruchir Gupta", "authors": "Ruchir Gupta, Y. N. Singh", "title": "Reputation Aggregation in Peer-to-Peer Network Using Differential Gossip\n  Algorithm", "comments": null, "journal-ref": null, "doi": "10.1109/TKDE.2015.2427793", "report-no": null, "categories": "cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reputation aggregation in peer to peer networks is generally a very time and\nresource consuming process. Moreover, most of the methods consider that a node\nwill have same reputation with all the nodes in the network, which is not true.\nThis paper proposes a reputation aggregation algorithm that uses a variant of\ngossip algorithm called differential gossip. In this paper, estimate of\nreputation is considered to be having two parts, one common component which is\nsame with every node, and the other one is information received from immediate\nneighbours based on the neighbours' direct interaction with the node. The\ndifferential gossip is fast and requires less amount of resources. This\nmechanism allows computation of independent reputation value by a node, of\nevery other node in the network, for each node. The differential gossip trust\nhas been investigated for a power law network formed using preferential\nattachment \\emph{(PA)} Model. The reputation computed using differential gossip\ntrust shows good amount of immunity to the collusion. We have verified the\nperformance of the algorithm on the power law networks of different sizes\nranging from 100 nodes to 50,000 nodes.\n", "versions": [{"version": "v1", "created": "Tue, 16 Oct 2012 08:32:59 GMT"}, {"version": "v2", "created": "Tue, 6 Nov 2012 12:49:26 GMT"}, {"version": "v3", "created": "Fri, 5 Apr 2013 09:27:09 GMT"}, {"version": "v4", "created": "Tue, 28 Jan 2014 10:23:22 GMT"}], "update_date": "2019-08-23", "authors_parsed": [["Gupta", "Ruchir", ""], ["Singh", "Y. N.", ""]]}, {"id": "1210.4446", "submitter": "Pradipta Mitra", "authors": "Eyjolfur I. Asgeirsson, Magnus M. Halldorsson and Pradipta Mitra", "title": "Wireless Network Stability in the SINR Model", "comments": "10 pages, appeared in SIROCCO'12", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the stability of wireless networks under stochastic arrival\nprocesses of packets, and design efficient, distributed algorithms that achieve\nstability in the SINR (Signal to Interference and Noise Ratio) interference\nmodel.\n  Specifically, we make the following contributions. We give a distributed\nalgorithm that achieves $\\Omega(\\frac{1}{\\log^2 n})$-efficiency on all networks\n(where $n$ is the number of links in the network), for all length monotone,\nsub-linear power assignments. For the power control version of the problem, we\ngive a distributed algorithm with $\\Omega(\\frac{1}{\\log n(\\log n + \\log \\log\n\\Delta)})$-efficiency (where $\\Delta$ is the length diversity of the link set).\n", "versions": [{"version": "v1", "created": "Tue, 16 Oct 2012 15:09:47 GMT"}], "update_date": "2012-10-18", "authors_parsed": [["Asgeirsson", "Eyjolfur I.", ""], ["Halldorsson", "Magnus M.", ""], ["Mitra", "Pradipta", ""]]}, {"id": "1210.4640", "submitter": "Sebastien Tixeuil", "authors": "Alexandre Maurer (LIP6, LINCS), S\\'ebastien Tixeuil (LIP6, LINCS, IUF)", "title": "A Scalable Byzantine Grid", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern networks assemble an ever growing number of nodes. However, it remains\ndifficult to increase the number of channels per node, thus the maximal degree\nof the network may be bounded. This is typically the case in grid topology\nnetworks, where each node has at most four neighbors. In this paper, we address\nthe following issue: if each node is likely to fail in an unpredictable manner,\nhow can we preserve some global reliability guarantees when the number of nodes\nkeeps increasing unboundedly ? To be more specific, we consider the problem or\nreliably broadcasting information on an asynchronous grid in the presence of\nByzantine failures -- that is, some nodes may have an arbitrary and potentially\nmalicious behavior. Our requirement is that a constant fraction of correct\nnodes remain able to achieve reliable communication. Existing solutions can\nonly tolerate a fixed number of Byzantine failures if they adopt a worst-case\nplacement scheme. Besides, if we assume a constant Byzantine ratio (each node\nhas the same probability to be Byzantine), the probability to have a fatal\nplacement approaches 1 when the number of nodes increases, and reliability\nguarantees collapse. In this paper, we propose the first broadcast protocol\nthat overcomes these difficulties. First, the number of Byzantine failures that\ncan be tolerated (if they adopt the worst-case placement) now increases with\nthe number of nodes. Second, we are able to tolerate a constant Byzantine\nratio, however large the grid may be. In other words, the grid becomes\nscalable. This result has important security applications in ultra-large\nnetworks, where each node has a given probability to misbehave.\n", "versions": [{"version": "v1", "created": "Wed, 17 Oct 2012 06:44:27 GMT"}], "update_date": "2012-10-18", "authors_parsed": [["Maurer", "Alexandre", "", "LIP6, LINCS"], ["Tixeuil", "Sébastien", "", "LIP6, LINCS, IUF"]]}, {"id": "1210.4749", "submitter": "Yuan Liu Yuan Liu", "authors": "Yuan Liu, Meixia Tao, and Jianwei Huang", "title": "An Auction Approach to Distributed Power Allocation for Multiuser\n  Cooperative Networks", "comments": "Accepted by IEEE Transactions on Wireless Communications", "journal-ref": null, "doi": "10.1109/TWC.2012.121112.112284", "report-no": null, "categories": "cs.NI cs.GT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a wireless network where multiple users cooperate with\neach other to improve the overall network performance. Our goal is to design an\noptimal distributed power allocation algorithm that enables user cooperation,\nin particular, to guide each user on the decision of transmission mode\nselection and relay selection. Our algorithm has the nice interpretation of an\nauction mechanism with multiple auctioneers and multiple bidders. Specifically,\nin our proposed framework, each user acts as both an auctioneer (seller) and a\nbidder (buyer). Each auctioneer determines its trading price and allocates\npower to bidders, and each bidder chooses the demand from each auctioneer. By\nfollowing the proposed distributed algorithm, each user determines how much\npower to reserve for its own transmission, how much power to purchase from\nother users, and how much power to contribute for relaying the signals of\nothers. We derive the optimal bidding and pricing strategies that maximize the\nweighted sum rates of the users. Extensive simulations are carried out to\nverify our proposed approach.\n", "versions": [{"version": "v1", "created": "Wed, 17 Oct 2012 14:26:04 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Liu", "Yuan", ""], ["Tao", "Meixia", ""], ["Huang", "Jianwei", ""]]}, {"id": "1210.5012", "submitter": "Sha Hua", "authors": "Sha Hua and Xuejun Zhuo and Shivendra S. Panwar", "title": "A Truthful Auction based Incentive Framework for Femtocell Access", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As cellular operators are suffering from a data explosion problem, and users\nare consequently experiencing poor data services, the introduction of\nfemtocells offers a cost-effective way to mitigate this problem. Femtocells\nenable larger network capacity by increasing spatial reuse of the spectrum and\nshortening the distance to the users. Existing work has shown that open access\nfemtocells, which allow unregistered macro users to connect, are efficient in\nreducing inter-cell interference and offloading traffic. However, a major\nobstacle constraining the potential capability of femtocells and open access is\nthe lack of incentives for privately-owned femtocells to serve unregistered\nusers. Hence in this paper, we propose a Vickrey-Clarke-Groves (VCG) auction\nbased incentive framework for accessing such selfish femtocells. We consider\ntwo scenarios: One scenario involves a single macro user and another scenario\nhas multiple macro users. We design auction schemes for both scenarios and show\nanalytically that our schemes are truthful and have low computational\ncomplexity. Extensive simulations validate these properties and show huge\nperformance improvement to the macro users.\n", "versions": [{"version": "v1", "created": "Thu, 18 Oct 2012 02:56:49 GMT"}, {"version": "v2", "created": "Wed, 16 Jan 2013 07:30:07 GMT"}], "update_date": "2013-01-17", "authors_parsed": [["Hua", "Sha", ""], ["Zhuo", "Xuejun", ""], ["Panwar", "Shivendra S.", ""]]}, {"id": "1210.5031", "submitter": "Venkatesan Ekambaram", "authors": "Venkatesan Ekambaram, Giulia Fanti, Kannan Ramchandran", "title": "Semi-Definite Programming Relaxation for Non-Line-of-Sight Localization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.MA cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of estimating the locations of a set of points in a\nk-dimensional euclidean space given a subset of the pairwise distance\nmeasurements between the points. We focus on the case when some fraction of\nthese measurements can be arbitrarily corrupted by large additive noise. Given\nthat the problem is highly non-convex, we propose a simple semidefinite\nprogramming relaxation that can be efficiently solved using standard\nalgorithms. We define a notion of non-contractibility and show that the\nrelaxation gives the exact point locations when the underlying graph is\nnon-contractible. The performance of the algorithm is evaluated on an\nexperimental data set obtained from a network of 44 nodes in an indoor\nenvironment and is shown to be robust to non-line-of-sight errors.\n", "versions": [{"version": "v1", "created": "Thu, 18 Oct 2012 06:02:52 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Ekambaram", "Venkatesan", ""], ["Fanti", "Giulia", ""], ["Ramchandran", "Kannan", ""]]}, {"id": "1210.5117", "submitter": "Harald Burchardt", "authors": "Harald Burchardt, Sinan Sinanovic, Zubin Bharucha, and Harald Haas", "title": "Distributed and Autonomous Resource and Power Allocation for Wireless\n  Networks", "comments": "Submitted to IEEE Transactions on Communications", "journal-ref": null, "doi": "10.1109/TCOMM.2013.053013.120916", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a distributed and autonomous technique for resource and power\nallocation in orthogonal frequency division multiple access (OFDMA)\nfemto-cellular networks is presented. Here, resource blocks (RBs) and their\ncorresponding transmit powers are assigned to the user(s) in each cell\nindividually without explicit coordination between femto base stations (FBSs).\nThe \"allocatability\" of each resource is determined utilising only locally\navailable information of the following quantities: - the required rate of the\nuser; - the quality (i.e., strength) of the desired signal; - the\nfrequency-selective fading on each RB; and - the level of interference incident\non each RB. Using a fuzzy logic system, the time-averaged values of each of\nthese inputs are combined to determine which RBs are most suitable to be\nallocated in a particular cell, i.e., which resources can be allocated such\nthat the user requested rate(s) in that cell are satisfied. Furthermore, link\nadaptation (LA) is included, enabling users to adjust to varying channel\nconditions. A comprehensive study of this system in a femto-cell environment is\nperformed, yielding system performance improvements in terms of throughput,\nenergy efficiency and coverage over state-of-the-art ICIC techniques.\n", "versions": [{"version": "v1", "created": "Thu, 18 Oct 2012 13:44:31 GMT"}, {"version": "v2", "created": "Mon, 26 Nov 2012 19:21:25 GMT"}], "update_date": "2013-06-21", "authors_parsed": [["Burchardt", "Harald", ""], ["Sinanovic", "Sinan", ""], ["Bharucha", "Zubin", ""], ["Haas", "Harald", ""]]}, {"id": "1210.5156", "submitter": "Donglin Hu", "authors": "Hui Zhou, Donglin Hu, Shiwen Mao, Prathima Agrawal, Saketh Anuma Reddy", "title": "Cell Association and Handover Management in Femtocell Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although the technology of femtocells is highly promising, many challenging\nproblems should be addressed before fully harvesting its potential. In this\npaper, we investigate the problem of cell association and handover management\nin femtocell networks. Two extreme cases for cell association are first\ndiscussed and analyzed. Then we propose our algorithm to maximize network\ncapacity while achieving fairness among users. Based on this algorithm, we\nfurther develop a handover algorithm to reduce the number of unnecessary\nhandovers using Bayesian estimation. The proposed handover algorithm is\ndemonstrated to outperform a heuristic scheme with considerable gains in our\nsimulation study.\n", "versions": [{"version": "v1", "created": "Thu, 18 Oct 2012 15:22:10 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Zhou", "Hui", ""], ["Hu", "Donglin", ""], ["Mao", "Shiwen", ""], ["Agrawal", "Prathima", ""], ["Reddy", "Saketh Anuma", ""]]}, {"id": "1210.5219", "submitter": "Brage Ellingsater", "authors": "Brage Ellings{\\ae}ter and Torleiv Maseng", "title": "The Domino Effect in Decentralized Wireless Networks", "comments": "6 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Convergence of resource allocation algorithms is well covered in the\nliterature as convergence to a steady state is important due to stability and\nperformance. However, research is lacking when it comes to the propagation of\nchange that occur in a network due to new nodes arriving or old nodes leaving\nor updating their allocation. As change can propagate through the network in a\nmanner similar to how domino pieces falls, we call this propagation of change\nthe domino effect. In this paper we investigate how change at one node can\naffect other nodes for a simple power control algorithm. We provide analytical\nresults from a deterministic network as well as a Poisson distributed network\nthrough percolation theory and provide simulation results that highlight some\naspects of the domino effect. The difficulty of mitigating this domino effect\nlies in the fact that to avoid it, one needs to have a margin of tolerance for\nchanges in the network. However, a high margin leads to poor system performance\nin a steady-state and therefore one has to consider a trade-off between\nperformance and propagation of change.\n", "versions": [{"version": "v1", "created": "Thu, 18 Oct 2012 18:43:29 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Ellingsæter", "Brage", ""], ["Maseng", "Torleiv", ""]]}, {"id": "1210.5232", "submitter": "Yiqing Cai", "authors": "Yiqing Cai, Robert Ghrist", "title": "Cyclic Network Automata and Cohomological Waves", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AT cs.NI nlin.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a dynamic coverage problem for sensor networks that are\nsufficiently dense but not localized. Only a small fraction of sensors may be\nin an awake state at any given time. The goal is to find a decentralized\nprotocol for establishing dynamic, sweeping barriers of awake-state sensors.\nFollowing Baryshnikov-Coffman-Kwak, we use network cyclic cellular automata to\ngenerate waves. This paper gives a rigorous analysis of network-based cyclic\ncellular automata in the context of a system of narrow hallways and shows that\nwaves of awake-state nodes turn corners and automatically solve\npusuit/evasion-type problems without centralized coordination.\n  As a corollary of this work, we unearth some interesting topological\ninterpretations of features previously observed in cyclic cellular automata\n(CCA). By considering CCA over networks and completing to simplicial complexes,\nwe induce dynamics on the higher-dimensional complex. In this setting, waves\nare seen to be generated by topological defects with a nontrivial degree (or\nwinding number). The simplicial complex has the topological type of the\nunderlying map of the workspace (a subset of the plane), and the resulting\nwaves can be classified cohomologically. This allows one to \"program\" pulses in\nthe sensor network according to cohomology class. We give a realization theorem\nfor such pulse waves.\n", "versions": [{"version": "v1", "created": "Thu, 18 Oct 2012 19:38:33 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Cai", "Yiqing", ""], ["Ghrist", "Robert", ""]]}, {"id": "1210.5393", "submitter": "Rachit Agarwal", "authors": "Rachit Agarwal, Vincent Gauthier, Monique Becker", "title": "Enhancing Information Dissemination in Dynamic Wireless Network using\n  Stability and Beamforming", "comments": "Submitted to Ad hoc Network journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobility causes network structures to change. In PSNs where underlying\nnetwork structure is changing rapidly, we are interested in studying how\ninformation dissemination can be enhanced in a sparse disconnected network\nwhere nodes lack the global knowledge about the network. We use beamforming to\nstudy the enhancement in the information dissemination process. In order to\nidentify potential beamformers and nodes to which beams should be directed we\nuse the concept of stability. We first predict the stability of a node in the\ndynamic network using truncated levy walk nature of jump lengths of human\nmobility and then use this measure to identify beamforming nodes and the nodes\nto which the beams are directed. We also develop our algorithm such that it\ndoes not require any global knowledge about the network and works in a\ndistributed manner. We also show the effect of various parameters such as\nnumber of sources, number of packets, mobility parameters, antenna parameters,\ntype of stability used and density of the network on information dissemination\nin the network. We validate our findings with three validation model, no\nbeamforming, beamforming using different stability measure and when no\nstability measure is associated but same number of node beamform and the\nselection of the beamforming nodes is random. Our simulation results show that\ninformation dissemination can be enhanced using our algorithm over other\nmodels.\n", "versions": [{"version": "v1", "created": "Fri, 19 Oct 2012 12:02:32 GMT"}], "update_date": "2012-10-22", "authors_parsed": [["Agarwal", "Rachit", ""], ["Gauthier", "Vincent", ""], ["Becker", "Monique", ""]]}, {"id": "1210.5424", "submitter": "Muhammad Nazmul Islam", "authors": "Muhammad Nazmul Islam, Shantharam Balasubramanian, Narayan B.\n  Mandayam, Ivan Seskar and Sastry Kompella", "title": "Implementation of Distributed Time Exchange Based Cooperative Forwarding", "comments": "Accepted in 2012 Military Communications Conference", "journal-ref": "Military Communications Conference 2012 (Page 1-6)", "doi": "10.1109/MILCOM.2012.6415742", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we design and implement time exchange (TE) based cooperative\nforwarding where nodes use transmission time slots as incentives for relaying.\nWe focus on distributed joint time slot exchange and relay selection in the sum\ngoodput maximization of the overall network. We formulate the design objective\nas a mixed integer nonlinear programming (MINLP) problem and provide a\npolynomial time distributed solution of the MINLP. We implement the designed\nalgorithm in the software defined radio enabled USRP nodes of the ORBIT indoor\nwireless testbed. The ORBIT grid is used as a global control plane for exchange\nof control information between the USRP nodes. Experimental results suggest\nthat TE can significantly increase the sum goodput of the network. We also\ndemonstrate the performance of a goodput optimization algorithm that is\nproportionally fair.\n", "versions": [{"version": "v1", "created": "Fri, 19 Oct 2012 14:00:51 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Islam", "Muhammad Nazmul", ""], ["Balasubramanian", "Shantharam", ""], ["Mandayam", "Narayan B.", ""], ["Seskar", "Ivan", ""], ["Kompella", "Sastry", ""]]}, {"id": "1210.5454", "submitter": "Mina Guirguis", "authors": "Mina Guirguis and George Atia", "title": "Stuck in Traffic (SiT) Attacks: A Framework for Identifying Stealthy\n  Attacks that Cause Traffic Congestion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent advances in wireless technologies have enabled many new applications\nin Intelligent Transportation Systems (ITS) such as collision avoidance,\ncooperative driving, congestion avoidance, and traffic optimization. Due to the\nvulnerable nature of wireless communication against interference and\nintentional jamming, ITS face new challenges to ensure the reliability and the\nsafety of the overall system. In this paper, we expose a class of stealthy\nattacks -- Stuck in Traffic (SiT) attacks -- that aim to cause congestion by\nexploiting how drivers make decisions based on smart traffic signs. An attacker\nmounting a SiT attack solves a Markov Decision Process problem to find\noptimal/suboptimal attack policies in which he/she interferes with a\nwell-chosen subset of signals that are based on the state of the system. We\napply Approximate Policy Iteration (API) algorithms to derive potent attack\npolicies. We evaluate their performance on a number of systems and compare them\nto other attack policies including random, myopic and DoS attack policies. The\ngenerated policies, albeit suboptimal, are shown to significantly outperform\nother attack policies as they maximize the expected cumulative reward from the\nstandpoint of the attacker.\n", "versions": [{"version": "v1", "created": "Fri, 19 Oct 2012 15:48:54 GMT"}], "update_date": "2012-10-22", "authors_parsed": [["Guirguis", "Mina", ""], ["Atia", "George", ""]]}, {"id": "1210.5614", "submitter": "Na Deng", "authors": "Na Deng, Sihai Zhang, Wuyang Zhou, and Jinkang Zhu", "title": "A Stochastic Geometry Approach to Energy Efficiency in Relay-Assisted\n  Cellular Networks", "comments": "6 pages, 5 figures, accepted by IEEE Globecom'12. arXiv admin note:\n  text overlap with arXiv:1108.1257 by other authors", "journal-ref": null, "doi": "10.1109/GLOCOM.2012.6503654", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Though cooperative relaying is believed to be a promising technology to\nimprove the energy efficiency of cellular networks, the relays' static power\nconsumption might worsen the energy efficiency therefore can not be neglected.\nIn this paper, we focus on whether and how the energy efficiency of cellular\nnetworks can be improved via relays. Based on the spatial Poisson point\nprocess, an analytical model is proposed to evaluate the energy efficiency of\nrelay-assisted cellular networks. With the aid of the technical tools of\nstochastic geometry, we derive the distributions of\nsignal-to-interference-plus-noise ratios (SINRs) and mean achievable rates of\nboth non-cooperative users and cooperative users. The energy efficiency\nmeasured by \"bps/Hz/W\" is expressed subsequently. These established expressions\nare amenable to numerical evaluation and corroborated by simulation results.\n", "versions": [{"version": "v1", "created": "Sat, 20 Oct 2012 13:00:32 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Deng", "Na", ""], ["Zhang", "Sihai", ""], ["Zhou", "Wuyang", ""], ["Zhu", "Jinkang", ""]]}, {"id": "1210.5783", "submitter": "EPTCS", "authors": "Josep Silva (Universitat Polit\\`ecnica de Val\\`encia, Spain),\n  Francesco Tiezzi (IMT Institute for Advanced Studies Lucca, Italy)", "title": "Proceedings 8th International Workshop on Automated Specification and\n  Verification of Web Systems", "comments": "EPTCS 98, 2012", "journal-ref": null, "doi": "10.4204/EPTCS.98", "report-no": null, "categories": "cs.SE cs.FL cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the final and revised versions of the papers presented\nat the 8th International Workshop on Automated Specification and Verification\nof Web Systems (WWV 2012). The workshop was held in Stockholm, Sweden, on June\n16, 2012, as part of DisCoTec 2012.\n  WWV is a yearly workshop that aims at providing an interdisciplinary forum to\nfacilitate the cross-fertilization and the advancement of hybrid methods that\nexploit concepts and tools drawn from Rule-based programming, Software\nengineering, Formal methods and Web-oriented research. WWV has a reputation for\nbeing a lively, friendly forum for presenting and discussing work in progress.\nThe proceedings have been produced after the symposium to allow the authors to\nincorporate the feedback gathered during the event in the published papers.\n  All papers submitted to the workshop were reviewed by at least three Program\nCommittee members or external referees. The Program Committee held an\nelectronic discussion leading to the acceptance of all papers for presentation\nat the workshop. In addition to the presentation of the contributed papers, the\nscientific programme included the invited talks by two outstanding speakers:\nRocco De Nicola (IMT, Institute for Advanced Studies Lucca, Italy) and Jos\\`e\nLuiz Fiadeiro (Royal Holloway, United Kingdom).\n", "versions": [{"version": "v1", "created": "Mon, 22 Oct 2012 00:17:53 GMT"}], "update_date": "2012-10-23", "authors_parsed": [["Silva", "Josep", "", "Universitat Politècnica de València, Spain"], ["Tiezzi", "Francesco", "", "IMT Institute for Advanced Studies Lucca, Italy"]]}, {"id": "1210.5917", "submitter": "Michel Marot", "authors": "Charbel Nicolas and Michel Marot", "title": "Dynamic Link adaptation Based on Coexistence-Fingerprint Detection for\n  WSN", "comments": "Ad Hoc Networking Workshop (Med-Hoc-Net), 2012 The 11th Annual\n  Mediterranean", "journal-ref": null, "doi": "10.1109/MedHocNet.2012.6257128", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Operating in the ISM band, the wireless sensor network (WSN) risks being\ninterfered by other concurrent networks. Our concerns are the technologies that\ndo not perform listening before transmission such as Bluetooth, and the ones\nthat do not detect other technologies due to their channel sensing techniques\nlike WIFI. To overcome this issue a WSN node should be able to identify the\npresence of such technologies. This will allow deducing the characteristics of\nthe generated traffic of these technologies, and thus the behavior of the\nchannel can be predicted. These predictions would help to trigger adequate\nreactions as to avoid or synchronize with the concurrent net- works. Many works\nexist on link adaptation, but they concern blind adaptations which are\nunintelligent and solve momentarily the problem that may reappear over time.\n  In this paper, we perform several experiments on a real testbed to categorize\nthe model of the bit errors in corrupted received packets. These experiments\nare performed under different conditions of channel noise and interferences.\nThis allows us to identify each corruption pattern as a fingerprint for the\ninterfering technology. Then we propose the mechanism FIM to identify on the\nfly the source of the corruption. With an implementation on \"Tmote Sky\" motes\nusing Tinyos1.x, We demonstrate the use of FIM for link adaptation in a\ncoexistence environment. Our mechanism led to throughput improvements of\n87%-100% depending on the transmission rate and channel quality.\n", "versions": [{"version": "v1", "created": "Mon, 22 Oct 2012 14:55:04 GMT"}], "update_date": "2012-10-23", "authors_parsed": [["Nicolas", "Charbel", ""], ["Marot", "Michel", ""]]}, {"id": "1210.6110", "submitter": "EPTCS", "authors": "Leonidas Lampropoulos (National Technical University of Athens),\n  Konstantinos Sagonas (National Technical University of Athens, Uppsala\n  University, Sweden)", "title": "Automatic WSDL-guided Test Case Generation for PropEr Testing of Web\n  Services", "comments": "In Proceedings WWV 2012, arXiv:1210.5783", "journal-ref": "EPTCS 98, 2012, pp. 3-16", "doi": "10.4204/EPTCS.98.3", "report-no": null, "categories": "cs.SE cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With web services already being key ingredients of modern web systems,\nautomatic and easy-to-use but at the same time powerful and expressive testing\nframeworks for web services are increasingly important. Our work aims at fully\nautomatic testing of web services: ideally the user only specifies properties\nthat the web service is expected to satisfy, in the form of input-output\nrelations, and the system handles all the rest. In this paper we present in\ndetail the component which lies at the heart of this system: how the WSDL\nspecification of a web service is used to automatically create test case\ngenerators that can be fed to PropEr, a property-based testing tool, to create\nstructurally valid random test cases for its operations and check its\nresponses. Although the process is fully automatic, our tool optionally allows\nthe user to easily modify its output to either add semantic information to the\ngenerators or write properties that test for more involved functionality of the\nweb services.\n", "versions": [{"version": "v1", "created": "Tue, 23 Oct 2012 02:54:41 GMT"}], "update_date": "2012-10-24", "authors_parsed": [["Lampropoulos", "Leonidas", "", "National Technical University of Athens"], ["Sagonas", "Konstantinos", "", "National Technical University of Athens, Uppsala\n  University, Sweden"]]}, {"id": "1210.6134", "submitter": "Pooja Vyavahare", "authors": "Pooja Vyavahare and Nutan Limaye and D. Manjunath", "title": "In-Network Estimation of Frequency Moments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  We consider the problem of estimating functions of distributed data using a\ndistributed algorithm over a network. The extant literature on computing\nfunctions in distributed networks such as wired and wireless sensor networks\nand peer-to-peer networks deals with computing linear functions of the\ndistributed data when the alphabet size of the data values is small, O(1). We\ndescribe a distributed randomized algorithm to estimate a class of non-linear\nfunctions of the distributed data which is over a large alphabet. We consider\nthree types of networks: point-to-point networks with gossip based\ncommunication, random planar networks in the connectivity regime and random\nplanar networks in the percolating regime both of which use the slotted Aloha\ncommunication protocol. For each network type, we estimate the scaled $k$-th\nfrequency moments, for $k \\geq 2$. Specifically, for every $k \\geq 2,$ we give\na distributed randomized algorithm that computes, with probability\n$(1-\\delta),$ an $\\epsilon$-approximation of the scaled $k$-th frequency\nmoment, $F_k/N^k$, using time $O(M^{1-\\frac{1}{k-1}} T)$ and\n$O(M^{1-\\frac{1}{k-1}} \\log N \\log (\\delta^{-1})/\\epsilon^2)$ bits of\ntransmission per communication step. Here, $N$ is the number of nodes in the\nnetwork, $T$ is the information spreading time and $M=o(N)$ is the alphabet\nsize.\n", "versions": [{"version": "v1", "created": "Tue, 23 Oct 2012 06:07:27 GMT"}], "update_date": "2012-10-24", "authors_parsed": [["Vyavahare", "Pooja", ""], ["Limaye", "Nutan", ""], ["Manjunath", "D.", ""]]}, {"id": "1210.6198", "submitter": "Gabriele Oliva", "authors": "Gabriele Oliva, Stefano Panzieri, Federica Pascucci and Roberto Setola", "title": "Network Localization by Shadow Edges", "comments": "preprint submitted to 2013 European Control Conference, July 17-19\n  2013, Zurich, Switzerland", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Localization is a fundamental task for sensor networks. Traditional network\nconstruction approaches allow to obtain localized networks requiring the nodes\nto be at least tri-connected (in 2D), i.e., the communication graph needs to be\nglobally rigid. In this paper we exploit, besides the information on the\nneighbors sensed by each robot/sensor, also the information about the lack of\ncommunication among nodes. The result is a framework where the nodes are\nrequired to be bi-connected and the communication graph has to be rigid. This\nis possible considering a novel typology of link, namely Shadow Edges, that\naccount for the lack of communication among nodes and allow to reduce the\nuncertainty associated to the position of the nodes.\n", "versions": [{"version": "v1", "created": "Tue, 23 Oct 2012 11:08:27 GMT"}, {"version": "v2", "created": "Mon, 29 Oct 2012 16:31:49 GMT"}], "update_date": "2013-01-08", "authors_parsed": [["Oliva", "Gabriele", ""], ["Panzieri", "Stefano", ""], ["Pascucci", "Federica", ""], ["Setola", "Roberto", ""]]}, {"id": "1210.6382", "submitter": "Nicolas Kourtellis", "authors": "Nicolas Kourtellis, Adriana Iamnitchi, Cristian Borcea and Robin\n  Murphy", "title": "Data Survivability in Networks of Mobile Robots in Urban Disaster\n  Environments", "comments": "16 double-column pages, 8 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile multi-robot teams deployed for monitoring or search-and-rescue\nmissions in urban disaster areas can greatly improve the quality of vital data\ncollected on-site. Analysis of such data can identify hazards and save lives.\nUnfortunately, such real deployments at scale are cost prohibitive and robot\nfailures lead to data loss. Moreover, scaled-down deployments do not capture\nsignificant levels of interaction and communication complexity. To tackle this\nproblem, we propose novel mobility and failure generation frameworks that allow\nrealistic simulations of mobile robot networks for large scale disaster\nscenarios. Furthermore, since data replication techniques can improve the\nsurvivability of data collected during the operation, we propose an adaptive,\nscalable data replication technique that achieves high data survivability with\nlow overhead. Our technique considers the anticipated robot failures and robot\nheterogeneity to decide how aggressively to replicate data. In addition, it\nconsiders survivability priorities, with some data requiring more effort to be\nsaved than others. Using our novel simulation generation frameworks, we compare\nour adaptive technique with flooding and broadcast-based replication techniques\nand show that for failure rates of up to 60% it ensures better data\nsurvivability with lower communication costs.\n", "versions": [{"version": "v1", "created": "Tue, 23 Oct 2012 21:09:08 GMT"}, {"version": "v2", "created": "Fri, 22 Feb 2013 10:26:13 GMT"}], "update_date": "2013-02-25", "authors_parsed": [["Kourtellis", "Nicolas", ""], ["Iamnitchi", "Adriana", ""], ["Borcea", "Cristian", ""], ["Murphy", "Robin", ""]]}, {"id": "1210.6398", "submitter": "Ma\\\"el  Le Treust", "authors": "Ma\\\"el Le Treust, Samson Lasaulce, M\\'erouane Debbah", "title": "Implicit cooperation in distributed energy-efficient networks", "comments": "arXiv admin note: text overlap with arXiv:1007.5004", "journal-ref": "Proc. 4th International Symposium on Communications, Control and\n  Signal Processing (ISCCSP), 2010", "doi": null, "report-no": null, "categories": "cs.GT cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of cooperation in distributed wireless networks of\nselfish and free transmitters aiming at maximizing their energy-efficiency. The\nstrategy of each transmitter consists in choosing his power control (PC)\npolicy. Two scenarios are considered: the case where transmitters can update\ntheir power levels within time intervals less than the channel coherence time\n(fast PC) and the case where it is updated only once per time interval (slow\nPC). One of our objectives is to show how cooperation can be stimulated without\nassuming cooperation links between the transmitters but only by repeating the\ncorresponding PC game and by signals from the receiver. In order to design\nefficient PC policies, standard and stochastic repeated games are respectively\nexploited to analyze the fast and slow PC problems. In the first case a\ncooperation plan between transmitters, that is both efficient and relies on\nmild information assumptions, is proposed. In the second case, the region of\nequilibrium utilities is derived from very recent and powerful results in game\ntheory.\n", "versions": [{"version": "v1", "created": "Tue, 23 Oct 2012 22:29:42 GMT"}], "update_date": "2012-10-25", "authors_parsed": [["Treust", "Maël Le", ""], ["Lasaulce", "Samson", ""], ["Debbah", "Mérouane", ""]]}, {"id": "1210.6910", "submitter": "Fotis Foukalas", "authors": "F. Foukalas, G. T. Karetsos, G. K. Karagiannidis", "title": "Adaptive Modulation in OSA-based Cognitive Radio Networks", "comments": "accepted conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Opportunistic spectrum access is based on channel state information and can\nlead to important performance improvements for the underlying communication\nsystems. On the other hand adaptive modulation is also based on channel state\ninformation and can achieve increased transmission rates in fading channels. In\nthis work we propose the combination of adaptive modulation with opportunistic\nspectrum access and we study the anticipated effects on the performance of\nwireless communication systems in terms of achieved spectral efficiency and\npower consumption.\n", "versions": [{"version": "v1", "created": "Thu, 25 Oct 2012 17:03:47 GMT"}], "update_date": "2012-11-26", "authors_parsed": [["Foukalas", "F.", ""], ["Karetsos", "G. T.", ""], ["Karagiannidis", "G. K.", ""]]}, {"id": "1210.7156", "submitter": "Alessandro Checco", "authors": "Alessandro Checco and Douglas Leith", "title": "Learning-Based Constraint Satisfaction With Sensing Restrictions", "comments": null, "journal-ref": null, "doi": "10.1109/JSTSP.2013.2251604", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider graph-coloring problems, an important subset of\ngeneral constraint satisfaction problems that arise in wireless resource\nallocation. We constructively establish the existence of fully decentralized\nlearning-based algorithms that are able to find a proper coloring even in the\npresence of strong sensing restrictions, in particular sensing asymmetry of the\ntype encountered when hidden terminals are present. Our main analytic\ncontribution is to establish sufficient conditions on the sensing behaviour to\nensure that the solvers find satisfying assignments with probability one. These\nconditions take the form of connectivity requirements on the induced sensing\ngraph. These requirements are mild, and we demonstrate that they are commonly\nsatisfied in wireless allocation tasks. We argue that our results are of\nconsiderable practical importance in view of the prevalence of both\ncommunication and sensing restrictions in wireless resource allocation\nproblems. The class of algorithms analysed here requires no message-passing\nwhatsoever between wireless devices, and we show that they continue to perform\nwell even when devices are only able to carry out constrained sensing of the\nsurrounding radio environment.\n", "versions": [{"version": "v1", "created": "Fri, 26 Oct 2012 14:33:39 GMT"}, {"version": "v2", "created": "Wed, 21 Nov 2012 23:32:38 GMT"}, {"version": "v3", "created": "Thu, 14 Feb 2013 14:11:35 GMT"}, {"version": "v4", "created": "Thu, 14 Mar 2013 01:11:28 GMT"}], "update_date": "2015-06-11", "authors_parsed": [["Checco", "Alessandro", ""], ["Leith", "Douglas", ""]]}, {"id": "1210.7385", "submitter": "Omer Khalid Dr", "authors": "Omer Khalid, Arsalaan Sheikh, Brice Copy", "title": "Optimizing Infrastructures for Testing Using Virtualization", "comments": "13th International Conference on Accelerator and Large Experimental\n  Physics Control Systems", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Virtualization technology and cloud computing have brought a paradigm shift\nin the way we utilize, deploy and manage computer resources. They allow fast\ndeployment of multiple operating system as containers on physical ma- chines\nwhich can be either discarded after use or check- pointed for later\nre-deployment. At European Organization for Nuclear Research (CERN), we have\nbeen using virtualization technology to quickly setup virtual machines for our\ndevelopers with preconfigured software to enable them to quickly test/deploy a\nnew version of a software patch for a given application. This paper reports\nboth on the techniques that have been used to setup a private cloud on a\ncommodity hardware and also presents the optimization techniques we used to\nremove deployment specific performance bottlenecks.\n", "versions": [{"version": "v1", "created": "Sun, 28 Oct 2012 00:03:46 GMT"}], "update_date": "2012-10-30", "authors_parsed": [["Khalid", "Omer", ""], ["Sheikh", "Arsalaan", ""], ["Copy", "Brice", ""]]}, {"id": "1210.7468", "submitter": "Antonios Argyriou", "authors": "Antonios Argyriou", "title": "Link Scheduling in Amplify-and-Forward Cooperative Wireless Networks", "comments": "Submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we are concerned with the problem of link scheduling for\nthroughput maximization in wireless networks that employ a cooperative amplify\nand forward (AF) protocol. To address this problem first we define the\nsignal-to-interference plus noise ratio (SINR) expression for the complete\ncooperative AF-based transmission. Next, we formulate the problem of link\nscheduling as a mixed integer linear program (MILP) that uses as a constraint\nthe developed SINR expression. The proposed formulation is motivated by the\nobservation that the aggregate interference that affects a single cooperative\ntransmission can be decomposed into two separate SINR constraints. Results for\nthe optimal solution and a polynomial time approximation algorithm are also\npresented.\n", "versions": [{"version": "v1", "created": "Sun, 28 Oct 2012 15:34:33 GMT"}, {"version": "v2", "created": "Wed, 24 Jul 2013 12:58:19 GMT"}], "update_date": "2013-07-25", "authors_parsed": [["Argyriou", "Antonios", ""]]}, {"id": "1210.7789", "submitter": "Ioannis Avramopoulos", "authors": "Ioannis Avramopoulos", "title": "Architectural innovation: A game-theoretic approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we view the Internet under a game-theoretic lens in an effort\nto explain and overcome the Internet's innovation slump. Game Theory is used to\nmodel Internet environments as problems of technological competition toward the\nend of understanding their emergent phenomena and the evolutionary forces that\nshape them. However, our results extend beyond understanding the Internet\narchitecture toward helping the Internet population achieve socially desirable\noutcomes.\n", "versions": [{"version": "v1", "created": "Mon, 29 Oct 2012 19:31:04 GMT"}], "update_date": "2012-10-30", "authors_parsed": [["Avramopoulos", "Ioannis", ""]]}, {"id": "1210.7837", "submitter": "Santanu Mondal", "authors": "Santanu Mondal and Vinod Sharma", "title": "Scheduling Under Fading and Partial Channel Information", "comments": "22 pages, 3 figures; Added IEEE Journal submission notice", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a scheduler for the downlink of a wireless channel when only\npartial channel-state information is available at the scheduler. We\ncharacterize the network stability region and provide two throughput-optimal\nscheduling policies. We also derive a deterministic bound on the mean packet\ndelay in the network. Finally, we provide a throughput-optimal policy for the\nnetwork under QoS constraints when real-time and rate-guaranteed data traffic\nmay be present.\n", "versions": [{"version": "v1", "created": "Mon, 29 Oct 2012 20:55:56 GMT"}, {"version": "v2", "created": "Sun, 18 Nov 2012 13:44:32 GMT"}, {"version": "v3", "created": "Sun, 17 Aug 2014 19:03:51 GMT"}], "update_date": "2014-08-19", "authors_parsed": [["Mondal", "Santanu", ""], ["Sharma", "Vinod", ""]]}, {"id": "1210.7870", "submitter": "Yuan Lu", "authors": "Yuan Lu, Alexandra Duel-Hallen", "title": "Channel-Adaptive Sensing Strategy for Cognitive Radio Ad Hoc Networks", "comments": "6 pages, 8 figures, CCNC 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Cognitive Radio (CR) ad hoc networks, secondary users (SU) attempt to\nutilize valuable spectral resources without causing significant interference to\nlicensed primary users (PU). While there is a large body of research on\nspectrum opportunity detection, exploitation, and adaptive transmission in CR,\nmost existing approaches focus only on avoiding PU activity when making sensing\ndecisions. Since the myopic sensing strategy results in congestion and poor\nthroughput, several collision-avoidance sensing approaches were investigated in\nthe literature. However, they provide limited improvement. A channel-aware\nmyopic sensing strategy that adapts the reward to the fading channel state\ninformation (CSI) of the SU link is proposed. This CSI varies over the CR\nspectrum and from one SU pair to another due to multipath and shadow fading,\nthus randomizing sensing decisions and increasing the network throughput. The\nproposed joint CSI adaptation at the medium access control (MAC) and physical\nlayers provides large throughput gain over randomized sensing strategies and/or\nconventional adaptive transmission methods. The performance of the proposed\nCSI-aided sensing strategy is validated for practical network scenarios and\ndemonstrated to be robust to CSI mismatch, sensing errors, and spatial channel\ncorrelation.\n", "versions": [{"version": "v1", "created": "Tue, 30 Oct 2012 00:40:41 GMT"}], "update_date": "2012-10-31", "authors_parsed": [["Lu", "Yuan", ""], ["Duel-Hallen", "Alexandra", ""]]}, {"id": "1210.7954", "submitter": "Jakarin Chawachat", "authors": "Jakarin Chawachat, Jittat Fakcharoenphol", "title": "A simpler load-balancing algorithm for range-partitioned data in\n  peer-to-peer systems", "comments": "(21 pages, 3 figures)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Random hashing is a standard method to balance loads among nodes in\nPeer-to-Peer networks. However, hashing destroys locality properties of object\nkeys, the critical properties to many applications, more specifically, those\nthat require range searching. To preserve a key order while keeping loads\nbalanced, Ganesan, Bawa and Garcia-Molina proposed a load-balancing algorithm\nthat supports both object insertion and deletion that guarantees a ratio of\n4.237 between the maximum and minimum loads among nodes in the network using\nconstant amortized costs. However, their algorithm is not straightforward to\nimplement in real networks because it is recursive. Their algorithm mostly uses\nlocal operations with global max-min load information. In this work, we present\na simple non-recursive algorithm using essentially the same primitive\noperations as in Ganesan {\\em et al.}'s work. We prove that for insertion and\ndeletion, our algorithm guarantees a constant max-min load ratio of 7.464 with\nconstant amortized costs.\n", "versions": [{"version": "v1", "created": "Tue, 30 Oct 2012 10:39:58 GMT"}, {"version": "v2", "created": "Sun, 28 Apr 2013 14:19:29 GMT"}], "update_date": "2013-04-30", "authors_parsed": [["Chawachat", "Jakarin", ""], ["Fakcharoenphol", "Jittat", ""]]}, {"id": "1210.8191", "submitter": "Eren Eraslan", "authors": "Eren Eraslan, Babak Daneshrad, Chung-Yu Lou", "title": "Performance Indicator for MIMO MMSE Receivers in the Presence of Channel\n  Estimation Error", "comments": "4 pages, 3 figures. Submitted to IEEE Wireless Communications Letters", "journal-ref": null, "doi": "10.1109/WCL.2013.012513.120824", "report-no": null, "categories": "cs.PF cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the derivation of post-processing SNR for\nMinimum-Mean-Squared-Error (MMSE) receivers with imperfect channel estimates,\nand show that it is an accurate indicator of the error rate performance of MIMO\nsystems in the presence of channel estimation error. Simulation results show\nthe tightness of the analysis.\n", "versions": [{"version": "v1", "created": "Tue, 30 Oct 2012 22:45:46 GMT"}, {"version": "v2", "created": "Tue, 13 Nov 2012 08:59:49 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Eraslan", "Eren", ""], ["Daneshrad", "Babak", ""], ["Lou", "Chung-Yu", ""]]}, {"id": "1210.8433", "submitter": "Ender Ayanoglu", "authors": "Ender Ayanoglu", "title": "Green Cellular Wireless Networks: Where to Begin?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Conventional cellular wireless networks were designed with the purpose of\nproviding high throughput for the user and high capacity for the service\nprovider, without any provisions of energy efficiency. As a result, these\nnetworks have an enormous Carbon footprint. In this note, we describe the\nsources of the inefficiencies in such networks. First we quantify how much\nCarbon footprint such networks generate. We also discuss how much more mobile\ntraffic is expected to increase so that this Carbon footprint will even\nincrease tremendously more. We then discuss specific sources of inefficiency\nand potential sources of improvement at the physical layer as well as higher\nlayers of the communication protocol hierarchy. In particular, considering that\nmost of the energy inefficiency in wireless cellular networks is at the base\nstations, we discuss multi-tier networks and point to the potential of\nexploiting mobility patterns in order to use base station energy judiciously.\n", "versions": [{"version": "v1", "created": "Wed, 31 Oct 2012 18:39:47 GMT"}], "update_date": "2012-11-01", "authors_parsed": [["Ayanoglu", "Ender", ""]]}]