[{"id": "1210.0049", "submitter": "Parikshit Gopalan", "authors": "Parikshit Gopalan, Raghu Meka, Omer Reingold, Luca Trevisan, Salil\n  Vadhan", "title": "Better Pseudorandom Generators from Milder Pseudorandom Restrictions", "comments": "To appear in FOCS 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an iterative approach to constructing pseudorandom generators,\nbased on the repeated application of mild pseudorandom restrictions. We use\nthis template to construct pseudorandom generators for combinatorial rectangles\nand read-once CNFs and a hitting set generator for width-3 branching programs,\nall of which achieve near-optimal seed-length even in the low-error regime: We\nget seed-length O(log (n/epsilon)) for error epsilon. Previously, only\nconstructions with seed-length O(\\log^{3/2} n) or O(\\log^2 n) were known for\nthese classes with polynomially small error.\n  The (pseudo)random restrictions we use are milder than those typically used\nfor proving circuit lower bounds in that we only set a constant fraction of the\nbits at a time. While such restrictions do not simplify the functions\ndrastically, we show that they can be derandomized using small-bias spaces.\n", "versions": [{"version": "v1", "created": "Fri, 28 Sep 2012 21:58:10 GMT"}], "update_date": "2012-10-02", "authors_parsed": [["Gopalan", "Parikshit", ""], ["Meka", "Raghu", ""], ["Reingold", "Omer", ""], ["Trevisan", "Luca", ""], ["Vadhan", "Salil", ""]]}, {"id": "1210.0340", "submitter": "Andrzej Lingas", "authors": "Andrzej Lingas and Mia Persson", "title": "A fast parallel algorithm for minimum-cost small integral flows", "comments": "This is an improved version of a preliminary version which appeared\n  in proc. EUROPAR 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new approach to the minimum-cost integral flow problem for small\nvalues of the flow. It reduces the problem to the tests of simple multi-variate\npolynomials over a finite field of characteristic two for non-identity with\nzero. In effect, we show that a minimum-cost flow of value k in a network with\nn vertices, a sink and a source, integral edge capacities and positive integral\nedge costs polynomially bounded in n can be found by a randomized PRAM, with\nerrors of exponentially small probability in n, running in O(k\\log (kn)+\\log^2\n(kn)) time and using 2^{k}(kn)^{O(1)} processors. Thus, in particular, for the\nminimum-cost flow of value O(\\log n), we obtain an RNC^2 algorithm.\n", "versions": [{"version": "v1", "created": "Mon, 1 Oct 2012 10:25:50 GMT"}], "update_date": "2012-10-02", "authors_parsed": [["Lingas", "Andrzej", ""], ["Persson", "Mia", ""]]}, {"id": "1210.0420", "submitter": "Manuel Bodirsky", "authors": "Manuel Bodirsky (LIX, Ecole Polytechnique), Peter Jonsson (Department\n  of Computer and System Science, Linkoepings Universitet), Timo von Oertzen\n  (Max-Planck-Institute for Human Development)", "title": "Essential Convexity and Complexity of Semi-Algebraic Constraints", "comments": "25 pages, 3 Figures. An extended abstract of a preliminary version of\n  this paper appeared in the proceedings of ICALP 2009 under the title\n  `Semilinear Program Feasibility'", "journal-ref": "Logical Methods in Computer Science, Volume 8, Issue 4 (October\n  10, 2012) lmcs:1218", "doi": "10.2168/LMCS-8(4:5)2012", "report-no": null, "categories": "cs.CC cs.DM math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let \\Gamma be a structure with a finite relational signature and a\nfirst-order definition in (R;*,+) with parameters from R, that is, a relational\nstructure over the real numbers where all relations are semi-algebraic sets. In\nthis article, we study the computational complexity of constraint satisfaction\nproblem (CSP) for \\Gamma: the problem to decide whether a given primitive\npositive sentence is true in \\Gamma. We focus on those structures \\Gamma that\ncontain the relations \\leq, {(x,y,z) | x+y=z} and {1}. Hence, all CSPs studied\nin this article are at least as expressive as the feasibility problem for\nlinear programs. The central concept in our investigation is essential\nconvexity: a relation S is essentially convex if for all a,b\\inS, there are\nonly finitely many points on the line segment between a and b that are not in\nS. If \\Gamma contains a relation S that is not essentially convex and this is\nwitnessed by rational points a,b, then we show that the CSP for \\Gamma is\nNP-hard. Furthermore, we characterize essentially convex relations in logical\nterms. This different view may open up new ways for identifying tractable\nclasses of semi-algebraic CSPs. For instance, we show that if \\Gamma is a\nfirst-order expansion of (R;*,+), then the CSP for \\Gamma can be solved in\npolynomial time if and only if all relations in \\Gamma are essentially convex\n(unless P=NP).\n", "versions": [{"version": "v1", "created": "Mon, 1 Oct 2012 14:30:00 GMT"}, {"version": "v2", "created": "Tue, 9 Oct 2012 08:39:30 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Bodirsky", "Manuel", "", "LIX, Ecole Polytechnique"], ["Jonsson", "Peter", "", "Department\n  of Computer and System Science, Linkoepings Universitet"], ["von Oertzen", "Timo", "", "Max-Planck-Institute for Human Development"]]}, {"id": "1210.0811", "submitter": "Francesco Zamponi", "authors": "Victor Bapst, Laura Foini, Florent Krzakala, Guilhem Semerjian,\n  Francesco Zamponi", "title": "The Quantum Adiabatic Algorithm applied to random optimization problems:\n  the quantum spin glass perspective", "comments": "151 pages, 21 figures", "journal-ref": "Physics Reports 523, 127 (2013)", "doi": "10.1016/j.physrep.2012.10.002", "report-no": null, "categories": "cond-mat.stat-mech cond-mat.dis-nn cs.CC quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Among various algorithms designed to exploit the specific properties of\nquantum computers with respect to classical ones, the quantum adiabatic\nalgorithm is a versatile proposition to find the minimal value of an arbitrary\ncost function (ground state energy). Random optimization problems provide a\nnatural testbed to compare its efficiency with that of classical algorithms.\nThese problems correspond to mean field spin glasses that have been extensively\nstudied in the classical case. This paper reviews recent analytical works that\nextended these studies to incorporate the effect of quantum fluctuations, and\npresents also some original results in this direction.\n", "versions": [{"version": "v1", "created": "Tue, 2 Oct 2012 15:37:06 GMT"}, {"version": "v2", "created": "Tue, 13 Nov 2012 08:57:43 GMT"}], "update_date": "2013-01-29", "authors_parsed": [["Bapst", "Victor", ""], ["Foini", "Laura", ""], ["Krzakala", "Florent", ""], ["Semerjian", "Guilhem", ""], ["Zamponi", "Francesco", ""]]}, {"id": "1210.1280", "submitter": "Daniel Kane", "authors": "Daniel M. Kane", "title": "A Pseudorandom Generator for Polynomial Threshold Functions of Gaussian\n  with Subpolynomial Seed Length", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a pseudorandom generator that fools degree-$d$ polynomial\nthreshold functions in $n$ variables with respect to the Gaussian distribution\nand has seed length $O_{c,d}(\\log(n) \\epsilon^{-c})$.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 02:53:30 GMT"}], "update_date": "2012-10-05", "authors_parsed": [["Kane", "Daniel M.", ""]]}, {"id": "1210.1283", "submitter": "Daniel Kane", "authors": "Daniel M. Kane", "title": "The Correct Exponent for the Gotsman-Linial Conjecture", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove a new bound on the average sensitivity of polynomial threshold\nfunctions. In particular we show that a polynomial threshold function of degree\n$d$ in at most $n$ variables has average sensitivity at most\n$\\sqrt{n}(\\log(n))^{O(d\\log(d))}2^{O(d^2\\log(d)}$. For fixed $d$ the exponent\nin terms of $n$ in this bound is known to be optimal. This bound makes\nsignificant progress towards the Gotsman-Linial Conjecture which would put the\ncorrect bound at $\\Theta(d\\sqrt{n})$.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 03:08:19 GMT"}], "update_date": "2012-10-05", "authors_parsed": [["Kane", "Daniel M.", ""]]}, {"id": "1210.1290", "submitter": "Francois Le Gall", "authors": "Hirotada Kobayashi, Fran\\c{c}ois Le Gall and Harumichi Nishimura", "title": "Stronger Methods of Making Quantum Interactive Proofs Perfectly Complete", "comments": "41 pages; v2: soundness parameters improved, correction of a minor\n  error in Lemma 23, and removal of the sentences claiming that our techniques\n  are quantumly nonrelativizing", "journal-ref": "SIAM Journal on Computing 44(2), pp.243-289, 2015", "doi": "10.1137/140971944", "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents stronger methods of achieving perfect completeness in\nquantum interactive proofs. First, it is proved that any problem in QMA has a\ntwo-message quantum interactive proof system of perfect completeness with\nconstant soundness error, where the verifier has only to send a constant number\nof halves of EPR pairs. This in particular implies that the class QMA is\nnecessarily included by the class QIP_1(2) of problems having two-message\nquantum interactive proofs of perfect completeness, which gives the first\nnontrivial upper bound for QMA in terms of quantum interactive proofs. It is\nalso proved that any problem having an $m$-message quantum interactive proof\nsystem necessarily has an $(m+1)$-message quantum interactive proof system of\nperfect completeness. This improves the previous result due to Kitaev and\nWatrous, where the resulting system of perfect completeness requires $m+2$\nmessages if not using the parallelization result.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 04:08:24 GMT"}, {"version": "v2", "created": "Fri, 17 May 2013 12:31:44 GMT"}], "update_date": "2016-05-25", "authors_parsed": [["Kobayashi", "Hirotada", ""], ["Gall", "François Le", ""], ["Nishimura", "Harumichi", ""]]}, {"id": "1210.1451", "submitter": "Bruno Grenet", "authors": "Bruno Grenet, Pascal Koiran, Natacha Portier", "title": "On the Complexity of the Multivariate Resultant", "comments": "25 pages. arXiv admin note: substantial text overlap with\n  arXiv:0912.2607", "journal-ref": "Journal of Complexity, 29(2), pp 142-157, 2013", "doi": "10.1016/j.jco.2012.10.001", "report-no": null, "categories": "cs.CC cs.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The multivariate resultant is a fundamental tool of computational algebraic\ngeometry. It can in particular be used to decide whether a system of n\nhomogeneous equations in n variables is satisfiable (the resultant is a\npolynomial in the system's coefficients which vanishes if and only if the\nsystem is satisfiable). In this paper, we investigate the complexity of\ncomputing the multivariate resultant.\n  First, we study the complexity of testing the multivariate resultant for\nzero. Our main result is that this problem is NP-hard under deterministic\nreductions in any characteristic, for systems of low-degree polynomials with\ncoefficients in the ground field (rather than in an extension). In\ncharacteristic zero, we observe that this problem is in the Arthur-Merlin class\nAM if the generalized Riemann hypothesis holds true, while the best known upper\nbound in positive characteristic remains PSPACE.\n  Second, we study the classical algorithms to compute the resultant. They\nusually rely on the computation of the determinant of an exponential-size\nmatrix, known as Macaulay matrix. We show that this matrix belongs to a class\nof succinctly representable matrices, for which testing the determinant for\nzero is proved PSPACE-complete. This means that improving Canny's PSPACE upper\nbound requires either to look at the fine structure of the Macaulay matrix to\nfind an ad hoc algorithm for computing its determinant, or to use altogether\ndifferent techniques.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 14:11:43 GMT"}], "update_date": "2013-02-12", "authors_parsed": [["Grenet", "Bruno", ""], ["Koiran", "Pascal", ""], ["Portier", "Natacha", ""]]}, {"id": "1210.1535", "submitter": "Tsuyoshi Ito", "authors": "Dmitry Gavinsky, Tsuyoshi Ito, Guoming Wang", "title": "Shared Randomness and Quantum Communication in the Multi-Party Model", "comments": "14 pages; v2: improved presentation, corrected statement of Theorem\n  2.1, corrected typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study shared randomness in the context of multi-party number-in-hand\ncommunication protocols in the simultaneous message passing model. We show that\nwith three or more players, shared randomness exhibits new interesting\nproperties that have no direct analogues in the two-party case.\n  First, we demonstrate a hierarchy of modes of shared randomness, with the\nusual shared randomness where all parties access the same random string as the\nstrongest form in the hierarchy. We show exponential separations between its\nlevels, and some of our bounds may be of independent interest. For example, we\nshow that the equality function can be solved by a protocol of constant length\nusing the weakest form of shared randomness, which we call \"XOR-shared\nrandomness.\"\n  Second, we show that quantum communication cannot replace shared randomness\nin the k-party case, where k >= 3 is any constant. We demonstrate a promise\nfunction GP_k that can be computed by a classical protocol of constant length\nwhen (the strongest form of) shared randomness is available, but any quantum\nprotocol without shared randomness must send n^Omega(1) qubits to compute it.\nMoreover, the quantum complexity of GP_k remains n^Omega(1) even if the \"second\nstrongest\" mode of shared randomness is available. While a somewhat similar\nseparation was already known in the two-party case, in the multi-party case our\nstatement is qualitatively stronger:\n  * In the two-party case, only a relational communication problem with similar\nproperties is known.\n  * In the two-party case, the gap between the two complexities of a problem\ncan be at most exponential, as it is known that 2^(O(c)) log n qubits can\nalways replace shared randomness in any c-bit protocol. Our bounds imply that\nwith quantum communication alone, in general, it is not possible to simulate\nefficiently even a three-bit three-party classical protocol that uses shared\nrandomness.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 18:43:07 GMT"}, {"version": "v2", "created": "Wed, 6 Mar 2013 19:31:04 GMT"}], "update_date": "2013-03-07", "authors_parsed": [["Gavinsky", "Dmitry", ""], ["Ito", "Tsuyoshi", ""], ["Wang", "Guoming", ""]]}, {"id": "1210.1550", "submitter": "Alexander Russell", "authors": "Hari Krovi and Alexander Russell", "title": "Quantum Fourier Transforms and the Complexity of Link Invariants for\n  Quantum Doubles of Finite Groups", "comments": "30 pages", "journal-ref": "Commun. Math. Phys. 334, 743-777 (2015)", "doi": "10.1007/s00220-014-2285-5", "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Knot and link invariants naturally arise from any braided Hopf algebra. We\nconsider the computational complexity of the invariants arising from an\nelementary family of finite-dimensional Hopf algebras: quantum doubles of\nfinite groups (denoted D(G), for a group G). Regarding algorithms for these\ninvariants, we develop quantum circuits for the quantum Fourier transform over\nD(G); in general, we show that when one can uniformly and efficiently carry out\nthe quantum Fourier transform over the centralizers Z(g) of the elements of G,\none can efficiently carry out the quantum Fourier transform over D(G). We apply\nthese results to the symmetric groups to yield efficient circuits for the\nquantum Fourier transform over D(S_n). With such a Fourier transform, it is\nstraightforward to obtain additive approximation algorithms for the related\nlink invariant. Additionally, we show that certain D(G) invariants (such as\nD(A_n) invariants) are BPP-hard to additively approximate, SBP-hard to\nmultiplicatively approximate, and #P-hard to exactly evaluate. Finally, we make\npartial progress on the question of simulating anyonic computation in groups\nuniformly as a function of the group size. In this direction, we provide\nefficient quantum circuits for the Clebsch-Gordan transform over D(G) for\n\"fluxon\" irreps, i.e., irreps of D(G) characterized by a conjugacy class of G.\nFor general irreps, i.e., those which are associated with a conjugacy class of\nG and an irrep of a centralizer, we present an efficient implementation under\ncertain conditions such as when there is an efficient Clebsch-Gordan transform\nover the centralizers. We remark that this also provides a simulation of\ncertain anyonic models of quantum computation, even in circumstances where the\ngroup may have size exponential in the size of the circuit.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 19:21:59 GMT"}, {"version": "v2", "created": "Wed, 24 Jul 2013 17:21:39 GMT"}], "update_date": "2015-07-10", "authors_parsed": [["Krovi", "Hari", ""], ["Russell", "Alexander", ""]]}, {"id": "1210.1572", "submitter": "Hector Zenil", "authors": "Hector Zenil", "title": "Turing Patterns with Turing Machines: Emergence and Low-level Structure\n  Formation", "comments": "27 pages, 14 figures. Forthcoming in Natural Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC nlin.CG nlin.PS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite having advanced a reaction-diffusion model of ODE's in his 1952 paper\non morphogenesis, reflecting his interest in mathematical biology, Alan Turing\nhas never been considered to have approached a definition of Cellular Automata.\nHowever, his treatment of morphogenesis, and in particular a difficulty he\nidentified relating to the uneven distribution of certain forms as a result of\nsymmetry breaking, are key to connecting his theory of universal computation\nwith his theory of biological pattern formation. Making such a connection would\nnot overcome the particular difficulty that Turing was concerned about, which\nhas in any case been resolved in biology. But instead the approach developed\nhere captures Turing's initial concern and provides a low-level solution to a\nmore general question by way of the concept of algorithmic probability, thus\nbridging two of his most important contributions to science: Turing pattern\nformation and universal computation. I will provide experimental results of\none-dimensional patterns using this approach, with no loss of generality to a\nn-dimensional pattern generalisation.\n", "versions": [{"version": "v1", "created": "Thu, 4 Oct 2012 19:51:48 GMT"}], "update_date": "2012-10-08", "authors_parsed": [["Zenil", "Hector", ""]]}, {"id": "1210.2260", "submitter": "Rustem Takhanov", "authors": "Rustem Takhanov", "title": "Extensions of the Minimum Cost Homomorphism Problem", "comments": "arXiv admin note: substantial text overlap with arXiv:0708.3226", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assume $D$ is a finite set and $R$ is a finite set of functions from $D$ to\nthe natural numbers. An instance of the minimum $R$-cost homomorphism problem\n($MinHom_R$) is a set of variables $V$ subject to specified constraints\ntogether with a positive weight $c_{vr}$ for each combination of $v \\in V$ and\n$r \\in R$. The aim is to find a function $f:V \\rightarrow D$ such that $f$\nsatisfies all constraints and $\\sum_{v \\in V} \\sum_{r \\in R} c_{vr}r(f(v))$ is\nminimized.\n  This problem unifies well-known optimization problems such as the minimum\ncost homomorphism problem and the maximum solution problem, and this makes it a\ncomputationally interesting fragment of the valued CSP framework for\noptimization problems. We parameterize $MinHom_R\\left(\\Gamma\\right)$ by {\\em\nconstraint languages}, i.e. sets $\\Gamma$ of relations that are allowed in\nconstraints. A constraint language is called {\\em conservative} if every unary\nrelation is a member of it; such constraint languages play an important role in\nunderstanding the structure of constraint problems. The dichotomy conjecture\nfor $MinHom_R$ is the following statement: if $\\Gamma$ is a constraint\nlanguage, then $MinHom_R\\left(\\Gamma\\right)$ is either polynomial-time solvable\nor NP-complete. For $MinHom$ the dichotomy result has been recently obtained\n[Takhanov, STACS, 2010] and the goal of this paper is to expand this result to\nthe case of $MinHom_R$ with conservative constraint language. For arbitrary $R$\nthis problem is still open, but assuming certain restrictions on $R$ we prove a\ndichotomy. As a consequence of this result we obtain a dichotomy for the\nconservative maximum solution problem.\n", "versions": [{"version": "v1", "created": "Mon, 8 Oct 2012 12:39:06 GMT"}], "update_date": "2012-10-09", "authors_parsed": [["Takhanov", "Rustem", ""]]}, {"id": "1210.2455", "submitter": "EPTCS", "authors": "Julian Gutierrez (University of Cambridge, United Kingdom), Felix\n  Klaedtke (ETH Zurich, Switzerland), Martin Lange (University of Kassel,\n  Germany)", "title": "The \\mu-Calculus Alternation Hierarchy Collapses over Structures with\n  Restricted Connectivity", "comments": "In Proceedings GandALF 2012, arXiv:1210.2028", "journal-ref": "EPTCS 96, 2012, pp. 113-126", "doi": "10.4204/EPTCS.96.9", "report-no": null, "categories": "cs.LO cs.CC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is known that the alternation hierarchy of least and greatest fixpoint\noperators in the mu-calculus is strict. However, the strictness of the\nalternation hierarchy does not necessarily carry over when considering\nrestricted classes of structures. A prominent instance is the class of infinite\nwords over which the alternation-free fragment is already as expressive as the\nfull mu-calculus. Our current understanding of when and why the mu-calculus\nalternation hierarchy is not strict is limited. This paper makes progress in\nanswering these questions by showing that the alternation hierarchy of the\nmu-calculus collapses to the alternation-free fragment over some classes of\nstructures, including infinite nested words and finite graphs with feedback\nvertex sets of a bounded size. Common to these classes is that the connectivity\nbetween the components in a structure from such a class is restricted in the\nsense that the removal of certain vertices from the structure's graph\ndecomposes it into graphs in which all paths are of finite length. Our collapse\nresults are obtained in an automata-theoretic setting. They subsume,\ngeneralize, and strengthen several prior results on the expressivity of the\nmu-calculus over restricted classes of structures.\n", "versions": [{"version": "v1", "created": "Tue, 9 Oct 2012 00:54:03 GMT"}], "update_date": "2012-10-10", "authors_parsed": [["Gutierrez", "Julian", "", "University of Cambridge, United Kingdom"], ["Klaedtke", "Felix", "", "ETH Zurich, Switzerland"], ["Lange", "Martin", "", "University of Kassel,\n  Germany"]]}, {"id": "1210.2459", "submitter": "EPTCS", "authors": "Felix Canavoi, Erich Gr\\\"adel, Roman Rabinovich", "title": "The discrete strategy improvement algorithm for parity games and\n  complexity measures for directed graphs", "comments": "In Proceedings GandALF 2012, arXiv:1210.2028", "journal-ref": "EPTCS 96, 2012, pp. 197-209", "doi": "10.4204/EPTCS.96.15", "report-no": null, "categories": "cs.CC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For some time the discrete strategy improvement algorithm due to Jurdzinski\nand Voge had been considered as a candidate for solving parity games in\npolynomial time. However, it has recently been proved by Oliver Friedmann that\nthe strategy improvement algorithm requires super-polynomially many iteration\nsteps, for all popular local improvements rules, including switch-all (also\nwith Fearnley's snare memorisation), switch-best, random-facet, random-edge,\nswitch-half, least-recently-considered, and Zadeh's Pivoting rule.\n  We analyse the examples provided by Friedmann in terms of complexity measures\nfor directed graphs such as treewidth, DAG-width, Kelly-width, entanglement,\ndirected pathwidth, and cliquewidth. It is known that for every class of parity\ngames on which one of these parameters is bounded, the winning regions can be\nefficiently computed. It turns out that with respect to almost all of these\nmeasures, the complexity of Friedmann's counterexamples is bounded, and indeed\nin most cases by very small numbers. This analysis strengthens in some sense\nFriedmann's results and shows that the discrete strategy improvement algorithm\nis even more limited than one might have thought. Not only does it require\nsuper-polynomial running time in the general case, where the problem of\npolynomial-time solvability is open, it even has super-polynomial lower time\nbounds on natural classes of parity games on which efficient algorithms are\nknown.\n", "versions": [{"version": "v1", "created": "Tue, 9 Oct 2012 00:54:54 GMT"}], "update_date": "2012-10-10", "authors_parsed": [["Canavoi", "Felix", ""], ["Grädel", "Erich", ""], ["Rabinovich", "Roman", ""]]}, {"id": "1210.2481", "submitter": "EPTCS", "authors": "Jakub Michaliszyn, Jan Otop, Piotr Witkowski", "title": "Satisfiability vs. Finite Satisfiability in Elementary Modal Logics", "comments": "In Proceedings GandALF 2012, arXiv:1210.2028", "journal-ref": "EPTCS 96, 2012, pp. 141-154", "doi": "10.4204/EPTCS.96.11", "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study elementary modal logics, i.e. modal logic considered over\nfirst-order definable classes of frames. The classical semantics of modal logic\nallows infinite structures, but often practical applications require to\nrestrict our attention to finite structures. Many decidability and\nundecidability results for the elementary modal logics were proved separately\nfor general satisfiability and for finite satisfiability [11, 12, 16, 17]. In\nthis paper, we show that there is a reason why we must deal with both kinds of\nsatisfiability separately -- we prove that there is a universal first-order\nformula that defines an elementary modal logic with decidable (global)\nsatisfiability problem, but undecidable finite satisfiability problem, and, the\nother way round, that there is a universal formula that defines an elementary\nmodal logic with decidable finite satisfiability problem, but undecidable\ngeneral satisfiability problem.\n", "versions": [{"version": "v1", "created": "Tue, 9 Oct 2012 03:49:00 GMT"}], "update_date": "2012-10-10", "authors_parsed": [["Michaliszyn", "Jakub", ""], ["Otop", "Jan", ""], ["Witkowski", "Piotr", ""]]}, {"id": "1210.2544", "submitter": "Hjalte Wedel Vildh{\\o}j", "authors": "S{\\o}ren B{\\o}g, Morten St\\\"ockel, Hjalte Wedel Vildh{\\o}j", "title": "The Hardness of the Functional Orientation 2-Color Problem", "comments": null, "journal-ref": "Australas. J. Combin., vol. 56 (2013), pages 225-234", "doi": null, "report-no": null, "categories": "cs.CC cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the Functional Orientation 2-Color problem, which was introduced\nby Valiant in his seminal paper on holographic algorithms [SIAM J. Comput.,\n37(5), 2008]. For this decision problem, Valiant gave a polynomial time\nholographic algorithm for planar graphs of maximum degree 3, and showed that\nthe problem is NP-complete for planar graphs of maximum degree 10. A recent\nresult on defective graph coloring by Corr\\^ea et al. [Australas. J. Combin.,\n43, 2009] implies that the problem is already hard for planar graphs of maximum\ndegree 8. Together, these results leave open the hardness question for graphs\nof maximum degree between 4 and 7. We close this gap by showing that the answer\nis always yes for arbitrary graphs of maximum degree 5, and that the problem is\nNP-complete for planar graphs of maximum degree 6. Moreover, for graphs of\nmaximum degree 5, we note that a linear time algorithm for finding a solution\nexists.\n", "versions": [{"version": "v1", "created": "Tue, 9 Oct 2012 09:59:22 GMT"}, {"version": "v2", "created": "Tue, 23 Apr 2013 11:55:30 GMT"}], "update_date": "2013-04-24", "authors_parsed": [["Bøg", "Søren", ""], ["Stöckel", "Morten", ""], ["Vildhøj", "Hjalte Wedel", ""]]}, {"id": "1210.2698", "submitter": "Mikael Gast", "authors": "Mikael Gast, Mathias Hauptmann, Marek Karpinski", "title": "Improved Approximation Lower Bounds for Vertex Cover on Power Law Graphs\n  and Some Generalizations", "comments": "26 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM cs.DS math.CO math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove new explicit inapproximability results for the Vertex Cover Problem\non the Power Law Graphs and some functional generalizations of that class of\ngraphs. Our results depend on special bounded degree amplifier constructions\nfor those classes of graphs and could be also of independent interest.\n", "versions": [{"version": "v1", "created": "Tue, 9 Oct 2012 19:19:39 GMT"}], "update_date": "2012-10-10", "authors_parsed": [["Gast", "Mikael", ""], ["Hauptmann", "Mathias", ""], ["Karpinski", "Marek", ""]]}, {"id": "1210.2987", "submitter": "Stanislav Zivny", "authors": "Johan Thapper, Stanislav Zivny", "title": "The complexity of finite-valued CSPs", "comments": null, "journal-ref": "Journal of the ACM 63(4) Article No. 37 (2016)", "doi": "10.1145/2974019", "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the computational complexity of exact minimisation of\nrational-valued discrete functions. Let $\\Gamma$ be a set of rational-valued\nfunctions on a fixed finite domain; such a set is called a finite-valued\nconstraint language. The valued constraint satisfaction problem,\n$\\operatorname{VCSP}(\\Gamma)$, is the problem of minimising a function given as\na sum of functions from $\\Gamma$. We establish a dichotomy theorem with respect\nto exact solvability for all finite-valued constraint languages defined on\ndomains of arbitrary finite size.\n  We show that every constraint language $\\Gamma$ either admits a binary\nsymmetric fractional polymorphism in which case the basic linear programming\nrelaxation solves any instance of $\\operatorname{VCSP}(\\Gamma)$ exactly, or\n$\\Gamma$ satisfies a simple hardness condition that allows for a\npolynomial-time reduction from Max-Cut to $\\operatorname{VCSP}(\\Gamma)$.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2012 17:17:43 GMT"}, {"version": "v2", "created": "Sat, 3 Nov 2012 18:59:18 GMT"}, {"version": "v3", "created": "Wed, 11 Feb 2015 23:09:35 GMT"}, {"version": "v4", "created": "Wed, 21 Sep 2016 13:14:57 GMT"}], "update_date": "2016-09-22", "authors_parsed": [["Thapper", "Johan", ""], ["Zivny", "Stanislav", ""]]}, {"id": "1210.3277", "submitter": "Arnaud Casteigts", "authors": "Arnaud Casteigts, Paola Flocchini, Bernard Mans, Nicola Santoro", "title": "Shortest, Fastest, and Foremost Broadcast in Dynamic Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Highly dynamic networks rarely offer end-to-end connectivity at a given time.\nYet, connectivity in these networks can be established over time and space,\nbased on temporal analogues of multi-hop paths (also called {\\em journeys}).\nAttempting to optimize the selection of the journeys in these networks\nnaturally leads to the study of three cases: shortest (minimum hop), fastest\n(minimum duration), and foremost (earliest arrival) journeys. Efficient\ncentralized algorithms exists to compute all cases, when the full knowledge of\nthe network evolution is given.\n  In this paper, we study the {\\em distributed} counterparts of these problems,\ni.e. shortest, fastest, and foremost broadcast with termination detection\n(TDB), with minimal knowledge on the topology.\n  We show that the feasibility of each of these problems requires distinct\nfeatures on the evolution, through identifying three classes of dynamic graphs\nwherein the problems become gradually feasible: graphs in which the\nre-appearance of edges is {\\em recurrent} (class R), {\\em bounded-recurrent}\n(B), or {\\em periodic} (P), together with specific knowledge that are\nrespectively $n$ (the number of nodes), $\\Delta$ (a bound on the recurrence\ntime), and $p$ (the period). In these classes it is not required that all pairs\nof nodes get in contact -- only that the overall {\\em footprint} of the graph\nis connected over time.\n  Our results, together with the strict inclusion between $P$, $B$, and $R$,\nimplies a feasibility order among the three variants of the problem, i.e.\nTDB[foremost] requires weaker assumptions on the topology dynamics than\nTDB[shortest], which itself requires less than TDB[fastest]. Reversely, these\ndifferences in feasibility imply that the computational powers of $R_n$,\n$B_\\Delta$, and $P_p$ also form a strict hierarchy.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2012 15:51:25 GMT"}, {"version": "v2", "created": "Mon, 17 Jun 2013 21:21:18 GMT"}, {"version": "v3", "created": "Thu, 20 Jun 2013 10:02:14 GMT"}, {"version": "v4", "created": "Fri, 8 Nov 2013 06:58:53 GMT"}, {"version": "v5", "created": "Wed, 27 Aug 2014 12:58:54 GMT"}], "update_date": "2014-08-28", "authors_parsed": [["Casteigts", "Arnaud", ""], ["Flocchini", "Paola", ""], ["Mans", "Bernard", ""], ["Santoro", "Nicola", ""]]}, {"id": "1210.3279", "submitter": "Aleksandrs Belovs", "authors": "Aleksandrs Belovs and Ansis Rosmanis", "title": "On the Power of Non-Adaptive Learning Graphs", "comments": "16 pages, 1.5 figures v2: the main result generalised for all\n  certificate structures, a bug in the proof of Proposition 17 fixed", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a notion of the quantum query complexity of a certificate\nstructure. This is a formalisation of a well-known observation that many\nquantum query algorithms only require the knowledge of the disposition of\npossible certificates in the input string, not the precise values therein.\n  Next, we derive a dual formulation of the complexity of a non-adaptive\nlearning graph, and use it to show that non-adaptive learning graphs are tight\nfor all certificate structures. By this, we mean that there exists a function\npossessing the certificate structure and such that a learning graph gives an\noptimal quantum query algorithm for it.\n  For a special case of certificate structures generated by certificates of\nbounded size, we construct a relatively general class of functions having this\nproperty. The construction is based on orthogonal arrays, and generalizes the\nquantum query lower bound for the $k$-sum problem derived recently in\narXiv:1206.6528.\n  Finally, we use these results to show that the learning graph for the\ntriangle problem from arXiv:1210.1014 is almost optimal in these settings. This\nalso gives a quantum query lower bound for the triangle-sum problem.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2012 15:54:33 GMT"}, {"version": "v2", "created": "Sun, 16 Dec 2012 10:52:29 GMT"}], "update_date": "2012-12-18", "authors_parsed": [["Belovs", "Aleksandrs", ""], ["Rosmanis", "Ansis", ""]]}, {"id": "1210.3321", "submitter": "Julian-Steffen M\\\"uller", "authors": "Johannes Ebbing (Leibniz Universit\\\"at Hannover), Juha Kontinen\n  (University of Helsinki), Julian-Steffen M\\\"uller (Leibniz Universit\\\"at\n  Hannover), Heribert Vollmer (Leibniz Universit\\\"at Hannover)", "title": "A Fragment of Dependence Logic Capturing Polynomial Time", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 10, Issue 3 (August\n  15, 2014) lmcs:795", "doi": "10.2168/LMCS-10(3:3)2014", "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the expressive power of Horn-formulae in dependence\nlogic and show that they can express NP-complete problems. Therefore we define\nan even smaller fragment D-Horn* and show that over finite successor structures\nit captures the complexity class P of all sets decidable in polynomial time.\nFurthermore we study the question which of our results can ge generalized to\nthe case of open formulae of D-Horn* and so-called downwards monotone\npolynomial time properties of teams.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2012 19:07:45 GMT"}, {"version": "v2", "created": "Tue, 11 Dec 2012 10:21:28 GMT"}, {"version": "v3", "created": "Mon, 30 Jun 2014 06:19:48 GMT"}, {"version": "v4", "created": "Wed, 13 Aug 2014 21:39:41 GMT"}, {"version": "v5", "created": "Wed, 3 Sep 2014 13:28:16 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Ebbing", "Johannes", "", "Leibniz Universität Hannover"], ["Kontinen", "Juha", "", "University of Helsinki"], ["Müller", "Julian-Steffen", "", "Leibniz Universität\n  Hannover"], ["Vollmer", "Heribert", "", "Leibniz Universität Hannover"]]}, {"id": "1210.3344", "submitter": "Andrei Bulatov", "authors": "Andrei A. Bulatov, Amir Hedayaty", "title": "Galois correspondence for counting quantifiers", "comments": "28 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new type of closure operator on the set of relations,\nmax-implementation, and its weaker analog max-quantification. Then we show that\napproximation preserving reductions between counting constraint satisfaction\nproblems (#CSPs) are preserved by these two types of closure operators.\nTogether with some previous results this means that the approximation\ncomplexity of counting CSPs is determined by partial clones of relations that\nadditionally closed under these new types of closure operators. Galois\ncorrespondence of various kind have proved to be quite helpful in the study of\nthe complexity of the CSP. While we were unable to identify a Galois\ncorrespondence for partial clones closed under max-implementation and\nmax-quantification, we obtain such results for slightly different type of\nclosure operators, k-existential quantification. This type of quantifiers are\nknown as counting quantifiers in model theory, and often used to enhance first\norder logic languages. We characterize partial clones of relations closed under\nk-existential quantification as sets of relations invariant under a set of\npartial functions that satisfy the condition of k-subset surjectivity. Finally,\nwe give a description of Boolean max-co-clones, that is, sets of relations on\n{0,1} closed under max-implementations.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2012 19:47:34 GMT"}], "update_date": "2012-10-12", "authors_parsed": [["Bulatov", "Andrei A.", ""], ["Hedayaty", "Amir", ""]]}, {"id": "1210.3637", "submitter": "Juan Bermejo-Vega", "authors": "Juan Bermejo-Vega, Maarten Van den Nest", "title": "Classical simulations of Abelian-group normalizer circuits with\n  intermediate measurements", "comments": "26 pages+appendices. Title has changed in this second version. To\n  appear in Quantum Information and Computation, Vol.14 No.3&4, 2014", "journal-ref": "Quantum Information & Computation, Volume 14 Issue 3-4, March\n  2014, Pages 181-216, Rinton Press Incorporated", "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum normalizer circuits were recently introduced as generalizations of\nClifford circuits [arXiv:1201.4867]: a normalizer circuit over a finite Abelian\ngroup $G$ is composed of the quantum Fourier transform (QFT) over G, together\nwith gates which compute quadratic functions and automorphisms. In\n[arXiv:1201.4867] it was shown that every normalizer circuit can be simulated\nefficiently classically. This result provides a nontrivial example of a family\nof quantum circuits that cannot yield exponential speed-ups in spite of usage\nof the QFT, the latter being a central quantum algorithmic primitive. Here we\nextend the aforementioned result in several ways. Most importantly, we show\nthat normalizer circuits supplemented with intermediate measurements can also\nbe simulated efficiently classically, even when the computation proceeds\nadaptively. This yields a generalization of the Gottesman-Knill theorem (valid\nfor n-qubit Clifford operations [quant-ph/9705052, quant-ph/9807006] to quantum\ncircuits described by arbitrary finite Abelian groups. Moreover, our\nsimulations are twofold: we present efficient classical algorithms to sample\nthe measurement probability distribution of any adaptive-normalizer\ncomputation, as well as to compute the amplitudes of the state vector in every\nstep of it. Finally we develop a generalization of the stabilizer formalism\n[quant-ph/9705052, quant-ph/9807006] relative to arbitrary finite Abelian\ngroups: for example we characterize how to update stabilizers under generalized\nPauli measurements and provide a normal form of the amplitudes of generalized\nstabilizer states using quadratic functions and subgroup cosets.\n", "versions": [{"version": "v1", "created": "Fri, 12 Oct 2012 21:01:34 GMT"}, {"version": "v2", "created": "Tue, 22 Oct 2013 10:06:24 GMT"}], "update_date": "2015-10-09", "authors_parsed": [["Bermejo-Vega", "Juan", ""], ["Nest", "Maarten Van den", ""]]}, {"id": "1210.3978", "submitter": "Gregory Gutin", "authors": "J. Crampton, R. Crowston, G. Gutin, M. Jones, and M. S. Ramanujan", "title": "Fixed-Parameter Tractability of Workflow Satisfiability in the Presence\n  of Seniority Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The workflow satisfiability problem is concerned with determining whether it\nis possible to find an allocation of authorized users to the steps in a\nworkflow in such a way that all constraints are satisfied. The problem is\nNP-hard in general, but is known to be fixed-parameter tractable for certain\nclasses of constraints. The known results on fixed-parameter tractability rely\non the symmetry (in some sense) of the constraints. In this paper, we provide\nthe first results that establish fixed-parameter tractability of the\nsatisfiability problem when the constraints are asymmetric. In particular, we\nintroduce the notion of seniority constraints, in which the execution of steps\nis determined, in part, by the relative seniority of the users that perform\nthem. Our results require new techniques, which make use of tree decompositions\nof the graph of the binary relation defining the constraint. Finally, we\nestablish a lower bound for the hardness of the workflow satisfiability\nproblem.\n", "versions": [{"version": "v1", "created": "Mon, 15 Oct 2012 11:11:53 GMT"}], "update_date": "2012-10-16", "authors_parsed": [["Crampton", "J.", ""], ["Crowston", "R.", ""], ["Gutin", "G.", ""], ["Jones", "M.", ""], ["Ramanujan", "M. S.", ""]]}, {"id": "1210.4120", "submitter": "Deepak Ponvel Chermakani Mr", "authors": "Deepak Ponvel Chermakani", "title": "NP-Completeness of deciding the feasibility of Linear Equations over\n  binary-variables with coefficients and constants that are 0, 1, or -1", "comments": "Proving strong NP-Completeness of our problem. Included a\n  polynomial-time reduction from the 3-SAT problem", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We convert, within polynomial-time and sequential processing, NP-Complete\nProblems into a problem of deciding feasibility of a given system S of linear\nequations with constants and coefficients of binary-variables that are 0, 1, or\n-1. S is feasible, if and only if, the NP-Complete problem has a feasible\nsolution. We show separate polynomial-time conversions to S, from the\nSUBSET-SUM and 3-SAT problems, both of which are NP-Complete. The number of\nequations and variables in S is bounded by a polynomial function of the size of\nthe NP-Complete problem, showing that deciding the feasibility of S is\nstrongly-NP-Complete. We also show how to apply the approach used for the\nSUBSET-SUM problem to decide the feasibility of Integer Linear Programs, as it\ninvolves reducing the coefficient-magnitudes of variables to the logarithm of\ntheir initial values, though the number of variables and equations are\nincreased.\n", "versions": [{"version": "v1", "created": "Fri, 12 Oct 2012 10:31:52 GMT"}, {"version": "v2", "created": "Sat, 20 Oct 2012 13:39:33 GMT"}], "update_date": "2012-10-23", "authors_parsed": [["Chermakani", "Deepak Ponvel", ""]]}, {"id": "1210.4321", "submitter": "Haoyang Wu", "authors": "Lily Chen", "title": "A quantum algorithm for solving the 3-SAT problem", "comments": "This paper is wrong", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The method in this paper is wrong.\n", "versions": [{"version": "v1", "created": "Tue, 16 Oct 2012 09:16:13 GMT"}, {"version": "v2", "created": "Thu, 18 Oct 2012 02:08:32 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Chen", "Lily", ""]]}, {"id": "1210.4408", "submitter": "Marius Zimand", "authors": "Marius Zimand", "title": "On efficient constructions of short lists containing mostly Ramsey\n  graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the earliest and best-known application of the probabilistic method is\nthe proof of existence of a 2 log n$-Ramsey graph, i.e., a graph with n nodes\nthat contains no clique or independent set of size 2 log n. The explicit\nconstruction of such a graph is a major open problem. We show that a reasonable\nhardness assumption implies that in polynomial time one can construct a list\ncontaining polylog(n) graphs such that most of them are 2 log n-Ramsey.\n", "versions": [{"version": "v1", "created": "Tue, 16 Oct 2012 13:48:53 GMT"}], "update_date": "2012-10-17", "authors_parsed": [["Zimand", "Marius", ""]]}, {"id": "1210.5083", "submitter": "Wajeb Gharibi", "authors": "Wajeb Gharibi", "title": "An Improved Lower Bound of The Spark With Application", "comments": "8 pages", "journal-ref": "International Journal of Distributed and Parallel Systems (IJDPS)\n  Vol.3, No.5, September 2012", "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spark plays a great role in studying uniqueness of sparse solutions of the\nunderdetermined linear equations. In this article, we derive a new lower bound\nof spark. As an application, we obtain a new criterion for the uniqueness of\nsparse solutions of linear equations.\n", "versions": [{"version": "v1", "created": "Thu, 18 Oct 2012 10:29:51 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Gharibi", "Wajeb", ""]]}, {"id": "1210.5648", "submitter": "Li-Yang Tan", "authors": "Per Austrin, Ryan O'Donnell, Li-Yang Tan, John Wright", "title": "New NP-hardness results for 3-Coloring and 2-to-1 Label Cover", "comments": "Corrected typos. arXiv admin note: substantial text overlap with\n  arXiv:1204.5666", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that given a 3-colorable graph, it is NP-hard to find a 3-coloring\nwith $(16/17 + \\eps)$ of the edges bichromatic. In a related result, we show\nthat given a satisfiable instance of the 2-to-1 Label Cover problem, it is\nNP-hard to find a $(23/24 + \\eps)$-satisfying assignment.\n", "versions": [{"version": "v1", "created": "Sat, 20 Oct 2012 19:34:22 GMT"}, {"version": "v2", "created": "Sun, 28 Oct 2012 21:27:24 GMT"}], "update_date": "2012-10-30", "authors_parsed": [["Austrin", "Per", ""], ["O'Donnell", "Ryan", ""], ["Tan", "Li-Yang", ""], ["Wright", "John", ""]]}, {"id": "1210.5677", "submitter": "Amit Weinstein", "authors": "Noga Alon and Amit Weinstein", "title": "Local Correction with Constant Error Rate", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Boolean function f of n variables is said to be q-locally correctable if,\ngiven a black-box access to a function g which is \"close\" to an isomorphism\nf_sigma(x)=f_sigma(x_1, ..., x_n) = f(x_sigma(1), ..., x_sigma(n)) of f, we can\ncompute f_sigma(x) for any x in {0,1}^n with good probability using q queries\nto g. It is known that degree d polynomials are O(2^d)-locally correctable, and\nthat most k-juntas are O(k log k)-locally correctable, where the closeness\nparameter, or more precisely the distance between g and f_sigma, is required to\nbe exponentially small (in d and k respectively).\n  In this work we relax the requirement for the closeness parameter by allowing\nthe distance between the functions to be a constant. We first investigate the\nfamily of juntas, and show that almost every k-junta is O(k log^2 k)-locally\ncorrectable for any distance epsilon < 0.001. A similar result is shown for the\nfamily of partially symmetric functions, that is functions which are\nindifferent to any reordering of all but a constant number of their variables.\nFor both families, the algorithms provided here use non-adaptive queries and\nare applicable to most but not all functions of each family (as it is shown to\nbe impossible to locally correct all of them).\n  Our approach utilizes the measure of symmetric influence introduced in the\nrecent analysis of testing partial symmetry of functions.\n", "versions": [{"version": "v1", "created": "Sun, 21 Oct 2012 02:29:56 GMT"}], "update_date": "2012-10-23", "authors_parsed": [["Alon", "Noga", ""], ["Weinstein", "Amit", ""]]}, {"id": "1210.5879", "submitter": "Bruno Grenet", "authors": "Bruno Grenet, Thierry Monteil, St\\'ephan Thomass\\'e", "title": "Symmetric Determinantal Representations in Characteristic 2", "comments": "24 pages, 3 figures", "journal-ref": "Linear Algebra and Its Applications 439(5), pp. 1364-1381, 2013", "doi": "10.1016/j.laa.2013.04.022", "report-no": null, "categories": "cs.CC math.RA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies Symmetric Determinantal Representations (SDR) in\ncharacteristic 2, that is the representation of a multivariate polynomial P by\na symmetric matrix M such that P=det(M), and where each entry of M is either a\nconstant or a variable.\n  We first give some sufficient conditions for a polynomial to have an SDR. We\nthen give a non-trivial necessary condition, which implies that some\npolynomials have no SDR, answering a question of Grenet et al.\n  A large part of the paper is then devoted to the case of multilinear\npolynomials. We prove that the existence of an SDR for a multilinear polynomial\nis equivalent to the existence of a factorization of the polynomial in certain\nquotient rings. We develop some algorithms to test the factorizability in these\nrings and use them to find SDRs when they exist. Altogether, this gives us\npolynomial-time algorithms to factorize the polynomials in the quotient rings\nand to build SDRs. We conclude by describing the case of Alternating\nDeterminantal Representations in any characteristic.\n", "versions": [{"version": "v1", "created": "Mon, 22 Oct 2012 12:04:05 GMT"}, {"version": "v2", "created": "Wed, 15 May 2013 16:47:32 GMT"}], "update_date": "2013-06-06", "authors_parsed": [["Grenet", "Bruno", ""], ["Monteil", "Thierry", ""], ["Thomassé", "Stéphan", ""]]}, {"id": "1210.5955", "submitter": "Ricardo Corr\\^ea", "authors": "Ricardo C. Corr\\^ea, Pablo M. S. Farias, and Cr\\'iston P. de Souza", "title": "Insertion and Sorting in a Sequence of Numbers Minimizing the Maximum\n  Sum of a Contiguous Subsequence", "comments": "This paper has been submitted for journal publication", "journal-ref": null, "doi": "10.1016/j.jda.2013.03.003", "report-no": null, "categories": "cs.DS cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $A$ be a sequence of $n \\geq 0$ real numbers. A subsequence of $A$ is a\nsequence of contiguous elements of $A$. A \\emph{maximum scoring subsequence} of\n$A$ is a subsequence with largest sum of its elements, which can be found in\nO(n) time by Kadane's dynamic programming algorithm. We consider in this paper\ntwo problems involving maximal scoring subsequences of a sequence. Both of\nthese problems arise in the context of buffer memory minimization in computer\nnetworks. The first one, which is called {\\sc Insertion in a Sequence with\nScores (ISS)}, consists in inserting a given real number $x$ in $A$ in such a\nway to minimize the sum of a maximum scoring subsequence of the resulting\nsequence, which can be easily done in $O(n^2)$ time by successively applying\nKadane's algorithm to compute the maximum scoring subsequence of the resulting\nsequence corresponding to each possible insertion position for $x$. We show in\nthis paper that the ISS problem can be solved in linear time and space with a\nmore specialized algorithm. The second problem we consider in this paper is the\n{\\sc Sorting a Sequence by Scores (SSS)} one, stated as follows: find a\npermutation $A'$ of $A$ that minimizes the sum of a maximum scoring\nsubsequence. We show that the SSS problem is strongly NP-Hard and give a\n2-approximation algorithm for it.\n", "versions": [{"version": "v1", "created": "Mon, 22 Oct 2012 16:25:18 GMT"}, {"version": "v2", "created": "Mon, 25 Feb 2013 13:05:36 GMT"}], "update_date": "2013-03-21", "authors_parsed": [["Corrêa", "Ricardo C.", ""], ["Farias", "Pablo M. S.", ""], ["de Souza", "Críston P.", ""]]}, {"id": "1210.5968", "submitter": "Tomislav Petrovi\\'c dipl. ing.", "authors": "Tomislav Petrovi\\'c", "title": "A pair of universal sequence-set betting strategies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the sequence-set betting game, a generalization of An. A.\nMuchnik's non-monotonic betting game. Instead of successively partitioning the\ninfinite binary strings by their value of a bit at a chosen position, as in the\nnon-monotonic game, the player is allowed to partition the strings into any two\nclopen sets with equal measure. We show that, while there is no single\ncomputable sequence-set betting strategy that predicts all non-Martin-L\\\"of\nrandom strings, we can construct two strategies such that every\nnon-Martin-L\\\"of random string is predicted by at least one of them.\n", "versions": [{"version": "v1", "created": "Mon, 22 Oct 2012 16:46:09 GMT"}, {"version": "v2", "created": "Wed, 31 Oct 2012 08:20:29 GMT"}, {"version": "v3", "created": "Mon, 31 Dec 2012 12:13:36 GMT"}, {"version": "v4", "created": "Mon, 14 Jan 2013 16:26:07 GMT"}, {"version": "v5", "created": "Thu, 28 Feb 2013 08:15:15 GMT"}, {"version": "v6", "created": "Thu, 14 Mar 2013 13:48:30 GMT"}, {"version": "v7", "created": "Fri, 29 Mar 2013 12:58:16 GMT"}, {"version": "v8", "created": "Tue, 3 Dec 2013 18:33:43 GMT"}, {"version": "v9", "created": "Tue, 22 Dec 2015 15:21:39 GMT"}], "update_date": "2015-12-23", "authors_parsed": [["Petrović", "Tomislav", ""]]}, {"id": "1210.6367", "submitter": "Aram Harrow", "authors": "Fernando G. S. L. Brandao and Aram W. Harrow", "title": "Quantum de Finetti Theorems under Local Measurements with Applications", "comments": "39 pages, no figure. v2: changes to references and other minor\n  improvements. v3: added some explanations, mostly about Theorem 1 and\n  Conjecture 5. STOC version. v4, v5. small improvements and fixes", "journal-ref": "Proc. of the 45th ACM Symposium on theory of computing (STOC\n  2013), pp. 861-870; Communications in Mathematical Physics, 353(2), 469-506", "doi": "10.1145/2488608.2488718; 10.1007/s00220-017-2880-3", "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum de Finetti theorems are a useful tool in the study of correlations in\nquantum multipartite states. In this paper we prove two new quantum de Finetti\ntheorems, both showing that under tests formed by local measurements one can\nget a much improved error dependence on the dimension of the subsystems. We\nalso obtain similar results for non-signaling probability distributions. We\ngive the following applications of the results:\n  We prove the optimality of the Chen-Drucker protocol for 3-SAT, under the\nexponential time hypothesis.\n  We show that the maximum winning probability of free games can be estimated\nin polynomial time by linear programming. We also show that 3-SAT with m\nvariables can be reduced to obtaining a constant error approximation of the\nmaximum winning probability under entangled strategies of O(m^{1/2})-player\none-round non-local games, in which the players communicate O(m^{1/2}) bits all\ntogether.\n  We show that the optimization of certain polynomials over the hypersphere can\nbe performed in quasipolynomial time in the number of variables n by\nconsidering O(log(n)) rounds of the Sum-of-Squares (Parrilo/Lasserre) hierarchy\nof semidefinite programs. As an application to entanglement theory, we find a\nquasipolynomial-time algorithm for deciding multipartite separability.\n  We consider a result due to Aaronson -- showing that given an unknown n qubit\nstate one can perform tomography that works well for most observables by\nmeasuring only O(n) independent and identically distributed (i.i.d.) copies of\nthe state -- and relax the assumption of having i.i.d copies of the state to\nmerely the ability to select subsystems at random from a quantum multipartite\nstate.\n  The proofs of the new quantum de Finetti theorems are based on information\ntheory, in particular on the chain rule of mutual information.\n", "versions": [{"version": "v1", "created": "Tue, 23 Oct 2012 20:17:21 GMT"}, {"version": "v2", "created": "Wed, 21 Nov 2012 22:04:57 GMT"}, {"version": "v3", "created": "Sun, 21 Apr 2013 21:31:52 GMT"}, {"version": "v4", "created": "Wed, 23 Oct 2013 03:51:07 GMT"}, {"version": "v5", "created": "Wed, 23 Jul 2014 11:55:05 GMT"}], "update_date": "2017-05-16", "authors_parsed": [["Brandao", "Fernando G. S. L.", ""], ["Harrow", "Aram W.", ""]]}, {"id": "1210.6893", "submitter": "Florent Madelaine", "authors": "Florent Madelaine and Barnaby Martin", "title": "On the complexity of the model checking problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The model checking problem for various fragments of first-order logic has\nattracted much attention over the last two decades: in particular, for the\nprimitive positive and the positive Horn fragments, which are better known as\nthe constraint satisfaction problem and the quantified constraint satisfaction\nproblem, respectively. These two fragments are in fact the only ones for which\nthere is currently no known complexity classification. All other syntactic\nfragments can be easily classified, either directly or using Schaefer's\ndichotomy theorems for SAT and QSAT, with the exception of the positive\nequality free fragment. This outstanding fragment can also be classified and\nenjoys a tetrachotomy: according to the model, the corresponding model checking\nproblem is either tractable, NP-complete, co-NP-complete or Pspace-complete.\nMoreover, the complexity drop is always witnessed by a generic solving\nalgorithm which uses quantifier relativisation. Furthermore, its complexity is\ncharacterised by algebraic means: the presence or absence of specific\nsurjective hyper-operations among those that preserve the model characterise\nthe complexity.\n", "versions": [{"version": "v1", "created": "Thu, 25 Oct 2012 16:21:37 GMT"}], "update_date": "2012-10-26", "authors_parsed": [["Madelaine", "Florent", ""], ["Martin", "Barnaby", ""]]}, {"id": "1210.7136", "submitter": "Romain Pechoux", "authors": "Romain P\\'echoux (INRIA Nancy - Grand Est / LORIA)", "title": "Synthesis of sup-interpretations: a survey", "comments": "(2012)", "journal-ref": null, "doi": "10.1016/j.tcs.2012.11.003", "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we survey the complexity of distinct methods that allow the\nprogrammer to synthesize a sup-interpretation, a function providing an upper-\nbound on the size of the output values computed by a program. It consists in a\nstatic space analysis tool without consideration of the time consumption.\nAlthough clearly related, sup-interpretation is independent from termination\nsince it only provides an upper bound on the terminating computations. First,\nwe study some undecidable properties of sup-interpretations from a theoretical\npoint of view. Next, we fix term rewriting systems as our computational model\nand we show that a sup-interpretation can be obtained through the use of a\nwell-known termination technique, the polynomial interpretations. The drawback\nis that such a method only applies to total functions (strongly normalizing\nprograms). To overcome this problem we also study sup-interpretations through\nthe notion of quasi-interpretation. Quasi-interpretations also suffer from a\ndrawback that lies in the subterm property. This property drastically restricts\nthe shape of the considered functions. Again we overcome this problem by\nintroducing a new notion of interpretations mainly based on the dependency\npairs method. We study the decidability and complexity of the\nsup-interpretation synthesis problem for all these three tools over sets of\npolynomials. Finally, we take benefit of some previous works on termination and\nruntime complexity to infer sup-interpretations.\n", "versions": [{"version": "v1", "created": "Fri, 26 Oct 2012 13:15:42 GMT"}], "update_date": "2012-11-29", "authors_parsed": [["Péchoux", "Romain", "", "INRIA Nancy - Grand Est / LORIA"]]}, {"id": "1210.7171", "submitter": "Gentian Kasa Dr.", "authors": "Gentian Kasa", "title": "Hypercomputation: Towards an extension of the classical notion of\n  Computability?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this thesis is to make an analysis of the concept of\nHypercomputation and of some hypermachines. This thesis is separated in three\nmain parts. We start in the first chapter with an analysis of the concept of\nClassical Computability with the Turing Machine and the Church-Turing thesis as\na main reference and afterwards, in the second chapter, we continue with an\nanalysis of hypercomputation and some hypermachines. Attention is given to the\npossible physical realization of these machines and their usefulness. In the\nthird chapter a superficial introduction to Quantum Computing is made and a\nbrief analysis to a quantum hypercomputational model, Tien D. Kieu's Adiabatic\nQuantum Computing.\n", "versions": [{"version": "v1", "created": "Fri, 26 Oct 2012 15:56:31 GMT"}], "update_date": "2012-10-29", "authors_parsed": [["Kasa", "Gentian", ""]]}, {"id": "1210.7420", "submitter": "Amir Ali Ahmadi", "authors": "Amir Ali Ahmadi, Anirudha Majumdar, Russ Tedrake", "title": "Complexity of Ten Decision Problems in Continuous Time Dynamical Systems", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CC cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that for continuous time dynamical systems described by polynomial\ndifferential equations of modest degree (typically equal to three), the\nfollowing decision problems which arise in numerous areas of systems and\ncontrol theory cannot have a polynomial time (or even pseudo-polynomial time)\nalgorithm unless P=NP: local attractivity of an equilibrium point, stability of\nan equilibrium point in the sense of Lyapunov, boundedness of trajectories,\nconvergence of all trajectories in a ball to a given equilibrium point,\nexistence of a quadratic Lyapunov function, invariance of a ball, invariance of\na quartic semialgebraic set under linear dynamics, local collision avoidance,\nand existence of a stabilizing control law. We also extend our earlier\nNP-hardness proof of testing local asymptotic stability for polynomial vector\nfields to the case of trigonometric differential equations of degree four.\n", "versions": [{"version": "v1", "created": "Sun, 28 Oct 2012 07:46:41 GMT"}], "update_date": "2012-10-30", "authors_parsed": [["Ahmadi", "Amir Ali", ""], ["Majumdar", "Anirudha", ""], ["Tedrake", "Russ", ""]]}, {"id": "1210.7641", "submitter": "Nicolas de Rugy-Altherre", "authors": "Nicolas de Rugy-Altherre", "title": "A Dichotomy Theorem for Homomorphism Polynomials", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present paper we show a dichotomy theorem for the complexity of\npolynomial evaluation. We associate to each graph H a polynomial that encodes\nall graphs of a fixed size homomorphic to H. We show that this family is\ncomputable by arithmetic circuits in constant depth if H has a loop or no edge\nand that it is hard otherwise (i.e., complete for VNP, the arithmetic class\nrelated to #P). We also demonstrate the hardness over the rational field of cut\neliminator, a polynomial defined by B\\\"urgisser which is known to be neither VP\nnor VNP-complete in the field of two elements, if VP is not equal to VNP (VP is\nthe class of polynomials computable by arithmetic circuit of polynomial size).\n", "versions": [{"version": "v1", "created": "Mon, 29 Oct 2012 12:37:54 GMT"}], "update_date": "2012-10-30", "authors_parsed": [["de Rugy-Altherre", "Nicolas", ""]]}, {"id": "1210.8099", "submitter": "Lane A. Hemaspaandra", "authors": "Lane A. Hemaspaandra and Ryan Williams", "title": "An Atypical Survey of Typical-Case Heuristic Algorithms", "comments": "This article is currently scheduled to appear in the December 2012\n  issue of SIGACT News", "journal-ref": null, "doi": null, "report-no": "URCS-TR-2012-984", "categories": "cs.CC cs.AI cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heuristic approaches often do so well that they seem to pretty much always\ngive the right answer. How close can heuristic algorithms get to always giving\nthe right answer, without inducing seismic complexity-theoretic consequences?\nThis article first discusses how a series of results by Berman, Buhrman,\nHartmanis, Homer, Longpr\\'{e}, Ogiwara, Sch\\\"{o}ening, and Watanabe, from the\nearly 1970s through the early 1990s, explicitly or implicitly limited how well\nheuristic algorithms can do on NP-hard problems. In particular, many desirable\nlevels of heuristic success cannot be obtained unless severe, highly unlikely\ncomplexity class collapses occur. Second, we survey work initiated by Goldreich\nand Wigderson, who showed how under plausible assumptions deterministic\nheuristics for randomized computation can achieve a very high frequency of\ncorrectness. Finally, we consider formal ways in which theory can help explain\nthe effectiveness of heuristics that solve NP-hard problems in practice.\n", "versions": [{"version": "v1", "created": "Tue, 30 Oct 2012 17:50:49 GMT"}], "update_date": "2012-10-31", "authors_parsed": [["Hemaspaandra", "Lane A.", ""], ["Williams", "Ryan", ""]]}, {"id": "1210.8338", "submitter": "Yonatan Goldhirsh", "authors": "Sourav Chakraborty, Eldar Fischer, Yonatan Goldhirsh, Arie Matsliah", "title": "On the Power of Conditional Samples in Distribution Testing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we define and examine the power of the {\\em\nconditional-sampling} oracle in the context of distribution-property testing.\nThe conditional-sampling oracle for a discrete distribution $\\mu$ takes as\ninput a subset $S \\subset [n]$ of the domain, and outputs a random sample $i\n\\in S$ drawn according to $\\mu$, conditioned on $S$ (and independently of all\nprior samples). The conditional-sampling oracle is a natural generalization of\nthe ordinary sampling oracle in which $S$ always equals $[n]$.\n  We show that with the conditional-sampling oracle, testing uniformity,\ntesting identity to a known distribution, and testing any label-invariant\nproperty of distributions is easier than with the ordinary sampling oracle. On\nthe other hand, we also show that for some distribution properties the\nsample-complexity remains near-maximal even with conditional sampling.\n", "versions": [{"version": "v1", "created": "Wed, 31 Oct 2012 14:18:59 GMT"}, {"version": "v2", "created": "Thu, 1 Nov 2012 13:26:26 GMT"}, {"version": "v3", "created": "Tue, 8 Apr 2014 14:23:02 GMT"}], "update_date": "2014-04-09", "authors_parsed": [["Chakraborty", "Sourav", ""], ["Fischer", "Eldar", ""], ["Goldhirsh", "Yonatan", ""], ["Matsliah", "Arie", ""]]}, {"id": "1210.8368", "submitter": "Christian Ikenmeyer", "authors": "Peter B\\\"urgisser and Christian Ikenmeyer", "title": "Explicit Lower Bounds via Geometric Complexity Theory", "comments": "10 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC math.RT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove the lower bound R(M_m) \\geq 3/2 m^2 - 2 on the border rank of m x m\nmatrix multiplication by exhibiting explicit representation theoretic\n(occurence) obstructions in the sense of the geometric complexity theory (GCT)\nprogram. While this bound is weaker than the one recently obtained by Landsberg\nand Ottaviani, these are the first significant lower bounds obtained within the\nGCT program. Behind the proof is the new combinatorial concept of obstruction\ndesigns, which encode highest weight vectors in Sym^d\\otimes^3(C^n)^* and\nprovide new insights into Kronecker coefficients.\n", "versions": [{"version": "v1", "created": "Wed, 31 Oct 2012 15:36:30 GMT"}, {"version": "v2", "created": "Mon, 18 Mar 2013 03:09:41 GMT"}], "update_date": "2013-03-19", "authors_parsed": [["Bürgisser", "Peter", ""], ["Ikenmeyer", "Christian", ""]]}]