[{"id": "2105.00082", "submitter": "Haoyue Ping", "authors": "Haoyue Ping, Julia Stoyanovich", "title": "Most Expected Winner: An Interpretation of Winners over Uncertain Voter\n  Preferences", "comments": "11 pages, 1 figure, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  It remains an open question how to determine the winner of an election given\nincomplete or uncertain voter preferences. One solution is to assume some\nprobability space for the voting profile and declare the candidates having the\nbest chance of winning to be the (co-)winners. We refer to this as the Most\nProbable Winner (MPW). In this paper, we propose an alternative winner\ninterpretation for positional scoring rules - the Most Expected Winner (MEW),\nbased on the expected performance of the candidates. This winner interpretation\nenjoys some desirable properties that the MPW does not. We establish the\ntheoretical hardness of MEW over incomplete voter preferences, then identify a\ncollection of tractable cases for a variety of voting profiles. An important\ncontribution of this work is to separate the voter preferences into the\ngeneration step and the observation step, which gives rise to a unified voting\nprofile combining both incomplete and probabilistic voting profiles.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2021 20:44:49 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Ping", "Haoyue", ""], ["Stoyanovich", "Julia", ""]]}, {"id": "2105.00193", "submitter": "Warut Suksompong", "authors": "Pasin Manurangsi and Warut Suksompong", "title": "Generalized Kings and Single-Elimination Winners in Random Tournaments", "comments": "Appears in the 30th International Joint Conference on Artificial\n  Intelligence (IJCAI), 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tournaments can be used to model a variety of practical scenarios including\nsports competitions and elections. A natural notion of strength of alternatives\nin a tournament is a generalized king: an alternative is said to be a $k$-king\nif it can reach every other alternative in the tournament via a directed path\nof length at most $k$. In this paper, we provide an almost complete\ncharacterization of the probability threshold such that all, a large number, or\na small number of alternatives are $k$-kings with high probability in two\nrandom models. We show that, perhaps surprisingly, all changes in the threshold\noccur in the range of constant $k$, with the biggest change being between $k=2$\nand $k=3$. In addition, we establish an asymptotically tight bound on the\nprobability threshold for which all alternatives are likely able to win a\nsingle-elimination tournament under some bracket.\n", "versions": [{"version": "v1", "created": "Sat, 1 May 2021 08:26:54 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Manurangsi", "Pasin", ""], ["Suksompong", "Warut", ""]]}, {"id": "2105.00325", "submitter": "Kamanchi Chandramouli", "authors": "Chandramouli K, Gopinath A, Girish Satyanarayana, Ravindra Babu\n  Tallamraju", "title": "A Game Theoretic Algorithm for Elite Customer Identification in Online\n  Fashion E-Commerce", "comments": null, "journal-ref": "SDM DSRE Workshop 2021", "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Myntra is an online fashion e-commerce company based in India. At Myntra, a\nmarket leader in fashion e-commerce in India, customer experience is paramount\nand a significant portion of our resources are dedicated to it. Here we\ndescribe an algorithm that identifies eligible customers to enable preferential\nproduct return processing for them by Myntra. We declare the group of\naforementioned eligible customers on the platform as elite customers. Our\nalgorithm to identify eligible/elite customers is based on sound principles of\ngame theory. It is simple, easy to implement and scalable.\n", "versions": [{"version": "v1", "created": "Sat, 1 May 2021 18:54:55 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["K", "Chandramouli", ""], ["A", "Gopinath", ""], ["Satyanarayana", "Girish", ""], ["Tallamraju", "Ravindra Babu", ""]]}, {"id": "2105.00505", "submitter": "Sixie Yu", "authors": "Sixie Yu, David Kempe, Yevgeniy Vorobeychik", "title": "Altruism Design in Networked Public Goods Games", "comments": "To appear in IJCAI 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Many collective decision-making settings feature a strategic tension between\nagents acting out of individual self-interest and promoting a common good.\nThese include wearing face masks during a pandemic, voting, and vaccination.\nNetworked public goods games capture this tension, with networks encoding\nstrategic interdependence among agents. Conventional models of public goods\ngames posit solely individual self-interest as a motivation, even though\naltruistic motivations have long been known to play a significant role in\nagents' decisions. We introduce a novel extension of public goods games to\naccount for altruistic motivations by adding a term in the utility function\nthat incorporates the perceived benefits an agent obtains from the welfare of\nothers, mediated by an altruism graph. Most importantly, we view altruism not\nas immutable, but rather as a lever for promoting the common good. Our central\nalgorithmic question then revolves around the computational complexity of\nmodifying the altruism network to achieve desired public goods game investment\nprofiles. We first show that the problem can be solved using linear programming\nwhen a principal can fractionally modify the altruism network. While the\nproblem becomes in general intractable if the principal's actions are\nall-or-nothing, we exhibit several tractable special cases.\n", "versions": [{"version": "v1", "created": "Sun, 2 May 2021 16:35:47 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Yu", "Sixie", ""], ["Kempe", "David", ""], ["Vorobeychik", "Yevgeniy", ""]]}, {"id": "2105.00621", "submitter": "Han Xiao", "authors": "Han Xiao, Qizhi Fang", "title": "Population Monotonicity in Matching Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A matching game is a cooperative profit game defined on an edge-weighted\ngraph, where the players are the vertices and the profit of a coalition is the\nmaximum weight of matchings in the subgraph induced by the coalition. A\npopulation monotonic allocation scheme is a collection of rules defining how to\nshare the profit among players in each coalition such that every player is\nbetter off when the coalition expands. In this paper, we study matching games\nand provide a necessary and sufficient characterization for the existence of\npopulation monotonic allocation schemes. Our characterization also implies that\nwhether a matching game admits population monotonic allocation schemes can be\ndetermined efficiently.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 04:01:49 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Xiao", "Han", ""], ["Fang", "Qizhi", ""]]}, {"id": "2105.00767", "submitter": "Xiong Wang", "authors": "Xiong Wang, Riheng Jia", "title": "Mean Field Equilibrium in Multi-Armed Bandit Game with Continuous Reward", "comments": "IJCAI 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mean field game facilitates analyzing multi-armed bandit (MAB) for a large\nnumber of agents by approximating their interactions with an average effect.\nExisting mean field models for multi-agent MAB mostly assume a binary reward\nfunction, which leads to tractable analysis but is usually not applicable in\npractical scenarios. In this paper, we study the mean field bandit game with a\ncontinuous reward function. Specifically, we focus on deriving the existence\nand uniqueness of mean field equilibrium (MFE), thereby guaranteeing the\nasymptotic stability of the multi-agent system. To accommodate the continuous\nreward function, we encode the learned reward into an agent state, which is in\nturn mapped to its stochastic arm playing policy and updated using realized\nobservations. We show that the state evolution is upper semi-continuous, based\non which the existence of MFE is obtained. As the Markov analysis is mainly for\nthe case of discrete state, we transform the stochastic continuous state\nevolution into a deterministic ordinary differential equation (ODE). On this\nbasis, we can characterize a contraction mapping for the ODE to ensure a unique\nMFE for the bandit game. Extensive evaluations validate our MFE\ncharacterization, and exhibit tight empirical regret of the MAB problem.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 11:50:06 GMT"}, {"version": "v2", "created": "Sat, 8 May 2021 12:37:58 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Wang", "Xiong", ""], ["Jia", "Riheng", ""]]}, {"id": "2105.00839", "submitter": "Ben Wise", "authors": "Ben Wise", "title": "Elo Ratings for Large Tournaments of Software Agents in Asymmetric Games", "comments": "75 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The Elo rating system has been used world wide for individual sports and team\nsports, as exemplified by the European Go Federation (EGF), International Chess\nFederation (FIDE), International Federation of Association Football (FIFA), and\nmany others. To evaluate the performance of artificial intelligence agents, it\nis natural to evaluate them on the same Elo scale as humans, such as the rating\nof 5185 attributed to AlphaGo Zero.\n  There are several fundamental differences between humans and AI that suggest\nmodifications to the system, which in turn require revisiting Elo's fundamental\nrationale. AI is typically trained on many more games than humans play, and we\nhave little a-priori information on newly created AI agents. Further, AI is\nbeing extended into games which are asymmetric between the players, and which\ncould even have large complex boards with different setup in every game, such\nas commercial paper strategy games. We present a revised rating system, and\nguidelines for tournaments, to reflect these differences.\n", "versions": [{"version": "v1", "created": "Fri, 23 Apr 2021 21:49:20 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Wise", "Ben", ""]]}, {"id": "2105.00984", "submitter": "Benjamin Monmege", "authors": "Benjamin Monmege, Julie Parreaux, Pierre-Alain Reynier", "title": "Playing Stochastically in Weighted Timed Games to Emulate Memory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Weighted timed games are two-player zero-sum games played in a timed\nautomaton equipped with integer weights. We consider optimal reachability\nobjectives, in which one of the players, that we call Min, wants to reach a\ntarget location while minimising the cumulated weight. While knowing if Min has\na strategy to guarantee a value lower than a given threshold is known to be\nundecidable (with two or more clocks), several conditions, one of them being\nthe divergence, have been given to recover decidability. In such weighted timed\ngames (like in untimed weighted games in the presence of negative weights), Min\nmay need finite memory to play (close to) optimally. This is thus tempting to\ntry to emulate this finite memory with other strategic capabilities. In this\nwork, we allow the players to use stochastic decisions, both in the choice of\ntransitions and of timing delays. We give for the first time a definition of\nthe expected value in weighted timed games, overcoming several theoretical\nchallenges. We then show that, in divergent weighted timed games, the\nstochastic value is indeed equal to the classical (deterministic) value, thus\nproving that Min can guarantee the same value while only using stochastic\nchoices, and no memory.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 16:33:28 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Monmege", "Benjamin", ""], ["Parreaux", "Julie", ""], ["Reynier", "Pierre-Alain", ""]]}, {"id": "2105.01425", "submitter": "Pascal Lenzner", "authors": "Simon Krogmann, Pascal Lenzner, Louise Molitor, Alexander Skopalik", "title": "Two-Stage Facility Location Games with Strategic Clients and Facilities", "comments": "To appear at the 30th International Joint Conference on Artificial\n  Intelligence (IJCAI-21), full version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider non-cooperative facility location games where both facilities and\nclients act strategically and heavily influence each other. This contrasts\nestablished game-theoretic facility location models with non-strategic clients\nthat simply select the closest opened facility. In our model, every facility\nlocation has a set of attracted clients and each client has a set of shopping\nlocations and a weight that corresponds to her spending capacity. Facility\nagents selfishly select a location for opening their facility to maximize the\nattracted total spending capacity, whereas clients strategically decide how to\ndistribute their spending capacity among the opened facilities in their\nshopping range. We focus on a natural client behavior similar to classical load\nbalancing: our selfish clients aim for a distribution that minimizes their\nmaximum waiting times for getting serviced, where a facility's waiting time\ncorresponds to its total attracted client weight.\n  We show that subgame perfect equilibria exist and give almost tight constant\nbounds on the Price of Anarchy and the Price of Stability, which even hold for\na broader class of games with arbitrary client behavior. Since facilities and\nclients influence each other, it is crucial for the facilities to anticipate\nthe selfish clients' behavior when selecting their location. For this, we\nprovide an efficient algorithm that also implies an efficient check for\nequilibrium. Finally, we show that computing a socially optimal facility\nplacement is NP-hard and that this result holds for all feasible client weight\ndistributions.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2021 11:27:09 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Krogmann", "Simon", ""], ["Lenzner", "Pascal", ""], ["Molitor", "Louise", ""], ["Skopalik", "Alexander", ""]]}, {"id": "2105.01609", "submitter": "Warut Suksompong", "authors": "Pasin Manurangsi, Warut Suksompong", "title": "Almost Envy-Freeness for Groups: Improved Bounds via Discrepancy Theory", "comments": "Appears in the 30th International Joint Conference on Artificial\n  Intelligence (IJCAI), 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the allocation of indivisible goods among groups of agents using\nwell-known fairness notions such as envy-freeness and proportionality. While\nthese notions cannot always be satisfied, we provide several bounds on the\noptimal relaxations that can be guaranteed. For instance, our bounds imply that\nwhen the number of groups is constant and the $n$ agents are divided into\ngroups arbitrarily, there exists an allocation that is envy-free up to\n$\\Theta(\\sqrt{n})$ goods, and this bound is tight. Moreover, we show that while\nsuch an allocation can be found efficiently, it is NP-hard to compute an\nallocation that is envy-free up to $o(\\sqrt{n})$ goods even when a fully\nenvy-free allocation exists. Our proofs make extensive use of tools from\ndiscrepancy theory.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2021 16:33:17 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Manurangsi", "Pasin", ""], ["Suksompong", "Warut", ""]]}, {"id": "2105.01801", "submitter": "Ayumi Igarashi", "authors": "Hiromichi Goko and Ayumi Igarashi and Yasushi Kawase and Kazuhisa\n  Makino and Hanna Sumita and Akihisa Tamura and Yu Yokoi and Makoto Yokoo", "title": "Fair and Truthful Mechanism with Limited Subsidy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The notion of \\emph{envy-freeness} is a natural and intuitive fairness\nrequirement in resource allocation. With indivisible goods, such fair\nallocations are unfortunately not guaranteed to exist. Classical works have\navoided this issue by introducing an additional divisible resource, i.e.,\nmoney, to subsidize envious agents. In this paper, we aim to design a truthful\nallocation mechanism of indivisible goods to achieve both fairness and\nefficiency criteria with a limited amount of subsidy. Following the work of\nHalpern and Shah, our central question is as follows: to what extent do we need\nto rely on the power of money to accomplish these objectives? For general\nvaluations, the impossibility theorem of combinatorial auction translates to\nour setting: even if an arbitrarily large amount of money is available for use,\nno mechanism can achieve truthfulness, envy-freeness, and utilitarian\noptimality simultaneously when agents have general monotone submodular\nvaluations. By contrast, we show that, when agents have matroidal valuations,\nthere is a truthful allocation mechanism that achieves envy-freeness and\nutilitarian optimality by subsidizing each agent with at most $1$, the maximum\nmarginal contribution of each item for each agent. The design of the mechanism\nrests crucially on the underlying matroidal M-convexity of the Lorenz\ndominating allocations.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2021 00:03:57 GMT"}], "update_date": "2021-05-06", "authors_parsed": [["Goko", "Hiromichi", ""], ["Igarashi", "Ayumi", ""], ["Kawase", "Yasushi", ""], ["Makino", "Kazuhisa", ""], ["Sumita", "Hanna", ""], ["Tamura", "Akihisa", ""], ["Yokoi", "Yu", ""], ["Yokoo", "Makoto", ""]]}, {"id": "2105.02371", "submitter": "Arvin Tashakori", "authors": "Arvin Tashakori", "title": "Survey on Multi-Agent Q-Learning frameworks for resource management in\n  wireless sensor network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This report aims to survey multi-agent Q-Learning algorithms, analyze\ndifferent game theory frameworks used, address each framework's applications,\nand report challenges and future directions. The target application for this\nstudy is resource management in the wireless sensor network.\n  In the first section, the author provided an introduction regarding the\napplications of wireless sensor networks. After that, the author presented a\nsummary of the Q-Learning algorithm, a well-known classic solution for\nmodel-free reinforcement learning problems.\n  In the third section, the author extended the Q-Learning algorithm for\nmulti-agent scenarios and discussed its challenges.\n  In the fourth section, the author surveyed sets of game-theoretic frameworks\nthat researchers used to address this problem for resource allocation and task\nscheduling in the wireless sensor networks. Lastly, the author mentioned some\ninteresting open challenges in this domain.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2021 23:43:30 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Tashakori", "Arvin", ""]]}, {"id": "2105.02669", "submitter": "Rafal Kucharski", "authors": "Andres Fielbaum, Rafal Kucharski, Oded Cats, Javier Alonso-Mora", "title": "How to split the costs among travellers sharing a ride? Aligning\n  system's optimum with users' equilibrium", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  How to form groups in a mobility system that offers shared rides, and how to\nsplit the costs within the travellers of a group, are non-trivial tasks, as two\nobjectives conflict: 1) minimising the total costs of the system, and 2) making\neach user content with her assignment. Aligning both objectives is challenging,\nas users are not aware of the externalities induced to the rest of the system.\n  In this paper, we propose protocols to share the costs within a ride so that\noptimal solutions can also constitute equilibria. To do this, we model the\nsituation as a game. We show that the traditional notions of equilibrium in\ngame theory (Nash and Strong) are not useful here, and prove that determining\nwhether a Strong Equilibrium exists is an NP-Complete problem. Hence, we\npropose three alternative equilibrium notions (stronger than Nash and weaker\nthan Strong), depending on how users can coordinate, that effectively represent\nstable ways to match the users. We then propose three cost-sharing protocols,\nfor which the optimal solutions are an equilibrium for each of the mentioned\nintermediate notions of equilibrium. The game we study can be seen as a\ngame-version of the well-known \\textit{set cover problem}.\n  Numerical simulations for Amsterdam reveal that our protocols can achieve\nstable solutions that are always close to the optimum, that there exists a\ntrade-off between total users' costs and how equal do they distribute among\nthem, and that having a central coordinator can have a large impact.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2021 13:48:37 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Fielbaum", "Andres", ""], ["Kucharski", "Rafal", ""], ["Cats", "Oded", ""], ["Alonso-Mora", "Javier", ""]]}, {"id": "2105.02699", "submitter": "Alexandros A. Voudouris", "authors": "Panagiotis Kanellopoulos, Maria Kyropoulou, Alexandros A. Voudouris", "title": "Not all Strangers are the Same: The Impact of Tolerance in Schelling\n  Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Schelling's famous model of segregation assumes agents of different types who\nwould like to be located in neighborhoods having at least a certain fraction of\nagents of the same type. We consider natural generalizations that allow for the\npossibility of agents being tolerant towards other agents, even if they are not\nof the same type. In particular, we consider an ordering of the types, and make\nthe realistic assumption that the agents are in principle more tolerant towards\nagents of types that are closer to their own according to the ordering. Based\non this, we study the strategic games induced when the agents aim to maximize\ntheir utility, for a variety of tolerance levels. We provide a collection of\nresults about the existence of equilibria, and their quality in terms of social\nwelfare.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2021 14:14:58 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Kanellopoulos", "Panagiotis", ""], ["Kyropoulou", "Maria", ""], ["Voudouris", "Alexandros A.", ""]]}, {"id": "2105.02712", "submitter": "Alexandros A. Voudouris", "authors": "Argyrios Deligkas, Aris Filos-Ratsikas, Alexandros A. Voudouris", "title": "Heterogeneous Facility Location with Limited Resources", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We initiate the study of the heterogeneous facility location problem with\nlimited resources. We mainly focus on the fundamental case where a set of\nagents are positioned in the line segment [0,1] and have approval preferences\nover two available facilities. A mechanism takes as input the positions and the\npreferences of the agents, and chooses to locate a single facility based on\nthis information. We study mechanisms that aim to maximize the social welfare\n(the total utility the agents derive from facilities they approve), under the\nconstraint of incentivizing the agents to truthfully report their positions and\npreferences. We consider three different settings depending on the level of\nagent-related information that is public or private. For each setting, we\ndesign deterministic and randomized strategyproof mechanisms that achieve a\ngood approximation of the optimal social welfare, and complement these with\nnearly-tight impossibility results.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2021 14:22:13 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Deligkas", "Argyrios", ""], ["Filos-Ratsikas", "Aris", ""], ["Voudouris", "Alexandros A.", ""]]}, {"id": "2105.03006", "submitter": "Adrian Vetta", "authors": "Arash Abizadeh and Adrian Vetta", "title": "A Recursive Measure of Voting Power that Satisfies Reasonable Postulates", "comments": "36 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We design a recursive measure of voting power based upon partial voting\nefficacy as well as full voting efficacy. In contrast, classical indicies and\nmeasures of voting power incorporate only partial voting efficacy. We motivate\nour design by representing voting games using a division lattice and via the\nnotion of random walks in stochastic processes, and show the viability of our\nrecursive measure by proving it satisfies a plethora of postulates that any\nreasonable voting measure should satisfy. These include the iso-invariance,\ndummy, dominance, donation, bloc, quarrel, and added blocker postulates.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2021 23:46:15 GMT"}], "update_date": "2021-05-10", "authors_parsed": [["Abizadeh", "Arash", ""], ["Vetta", "Adrian", ""]]}, {"id": "2105.03093", "submitter": "Yu Yokoi Dr.", "authors": "Hiromichi Goko, Kazuhisa Makino, Shuichi Miyazaki, Yu Yokoi", "title": "Maximally Satisfying Lower Quotas in the Hospitals/Residents Problem\n  with Ties", "comments": "44 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by a serious issue that hospitals in rural areas suffer from\nshortage of residents, we study the Hospitals/Residents model in which\nhospitals are associated with lower quotas and the goal is to satisfy them as\nmuch as possible. When preference lists are strict, the number of residents\nassigned to each hospital is the same in any stable matching due to the famous\nrural hospitals theorem, so there is no room for algorithmic interventions.\nHowever, when ties are introduced in preference lists, this is not the case\nsince the number of residents may vary over stable matchings. The main focus of\nthis paper is to investigate how much we can utilize this flexibility to aid\nrural hospitals, in the presence of ties. We first show that the exact\noptimization is NP-hard and incompatible with strategy-proofness for residents.\nWe then propose a linear-time strategy-proof algorithm whose approximation\nratio is substantially better than a naive algorithm that breaks ties\narbitrarily and applies the Gale-Shapley algorithm.\n", "versions": [{"version": "v1", "created": "Fri, 7 May 2021 07:46:06 GMT"}], "update_date": "2021-05-10", "authors_parsed": [["Goko", "Hiromichi", ""], ["Makino", "Kazuhisa", ""], ["Miyazaki", "Shuichi", ""], ["Yokoi", "Yu", ""]]}, {"id": "2105.03521", "submitter": "Ian Moore PhD", "authors": "Ian C. Moore and Jagdeep Sidhu", "title": "Stochastic Properties of EIP-1559 Basefees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  EIP-1559 is a new proposed pricing mechanism for the Ethereum protocol\ndeveloped to bring stability to fluctuating gas prices. To properly understand\nthis as a stochastic process, it is necessary to develop the mathematical\nfoundations to understand under what conditions the base fee gas price outcomes\nbehave as a stationary process, and when it does not. Understanding these\nmathematical fundamentals is critical to properly engineering a stable system.\n", "versions": [{"version": "v1", "created": "Fri, 7 May 2021 22:14:22 GMT"}, {"version": "v2", "created": "Thu, 20 May 2021 19:53:36 GMT"}], "update_date": "2021-05-24", "authors_parsed": [["Moore", "Ian C.", ""], ["Sidhu", "Jagdeep", ""]]}, {"id": "2105.03559", "submitter": "Qiu HouMing", "authors": "Houming Qiu, Kun Zhu, Nguyen Cong Luong, Changyan Yi, Dusit Niyato,\n  Dong In Kim", "title": "Applications of Auction and Mechanism Design in Edge Computing: A Survey", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Edge computing as a promising technology provides lower latency, more\nefficient transmission, and faster speed of data processing since the edge\nservers are closer to the user devices. Each edge server with limited resources\ncan offload latency-sensitive and computation-intensive tasks from nearby user\ndevices. However, edge computing faces challenges such as resource allocation,\nenergy consumption, security and privacy issues, etc. Auction mechanisms can\nwell characterize bidirectional interactions between edge servers and user\ndevices under the above constraints in edge computing. As demonstrated by the\nexisting works, auction and mechanism design approaches are outstanding on\nachieving optimal allocation strategy while guaranteeing mutual satisfaction\namong edge servers and user devices, especially for scenarios with scarce\nresources. In this paper, we introduce a comprehensive survey of recent\nresearches that apply auction approaches in edge computing. Firstly, a brief\noverview of edge computing including three common edge computing paradigms,\ni.e., cloudlet, fog computing and mobile edge computing, is presented. Then, we\nintroduce fundamentals and backgrounds of auction schemes commonly used in edge\ncomputing systems. After then, a comprehensive survey of applications of\nauction-based approaches applied for edge computing is provided, which is\ncategorized by different auction approaches. Finally, several open challenges\nand promising research directions are discussed.\n", "versions": [{"version": "v1", "created": "Sat, 8 May 2021 02:21:09 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Qiu", "Houming", ""], ["Zhu", "Kun", ""], ["Luong", "Nguyen Cong", ""], ["Yi", "Changyan", ""], ["Niyato", "Dusit", ""], ["Kim", "Dong In", ""]]}, {"id": "2105.03788", "submitter": "Guan-Horng Liu", "authors": "Guan-Horng Liu, Tianrong Chen, and Evangelos A. Theodorou", "title": "Dynamic Game Theoretic Neural Optimizer", "comments": "Accepted in International Conference on Machine Learning (ICML) 2021\n  as Oral", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The connection between training deep neural networks (DNNs) and optimal\ncontrol theory (OCT) has attracted considerable attention as a principled tool\nof algorithmic design. Despite few attempts being made, they have been limited\nto architectures where the layer propagation resembles a Markovian dynamical\nsystem. This casts doubts on their flexibility to modern networks that heavily\nrely on non-Markovian dependencies between layers (e.g. skip connections in\nresidual networks). In this work, we propose a novel dynamic game perspective\nby viewing each layer as a player in a dynamic game characterized by the DNN\nitself. Through this lens, different classes of optimizers can be seen as\nmatching different types of Nash equilibria, depending on the implicit\ninformation structure of each (p)layer. The resulting method, called Dynamic\nGame Theoretic Neural Optimizer (DGNOpt), not only generalizes OCT-inspired\noptimizers to richer network class; it also motivates a new training principle\nby solving a multi-player cooperative game. DGNOpt shows convergence\nimprovements over existing methods on image classification datasets with\nresidual and inception networks. Our work marries strengths from both OCT and\ngame theory, paving ways to new algorithmic opportunities from robust optimal\ncontrol and bandit-based optimization.\n", "versions": [{"version": "v1", "created": "Sat, 8 May 2021 21:56:14 GMT"}, {"version": "v2", "created": "Fri, 11 Jun 2021 15:18:50 GMT"}], "update_date": "2021-06-14", "authors_parsed": [["Liu", "Guan-Horng", ""], ["Chen", "Tianrong", ""], ["Theodorou", "Evangelos A.", ""]]}, {"id": "2105.04105", "submitter": "T-H. Hubert Chan", "authors": "T-H. Hubert Chan and Chui Shan Lee", "title": "On the Hardness of Opinion Dynamics Optimization with $L_1$-Budget on\n  Varying Susceptibility to Persuasion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Recently, Abebe et al. (KDD 2018) and Chan et al. (WWW 2019) have considered\nan opinion dynamics optimization problem that is based on a popular model for\nsocial opinion dynamics, in which each agent has some fixed innate opinion, and\na resistance that measures the importance it places on its innate opinion;\nmoreover, the agents influence one another's opinions through an iterative\nprocess. Under certain conditions, this iterative process converges to some\nequilibrium opinion vector. Previous works gave an efficient local search\nalgorithm to solve the unbudgeted variant of the problem, for which the goal is\nto modify the resistance of any number of agents (within some given range) such\nthat the sum of the equilibrium opinions is minimized. On the other hand, it\nwas proved that the $L_0$-budgeted variant is NP-hard, where the $L_0$-budget\nis a restriction given upfront on the number of agents whose resistance may be\nmodified.\n  Inspired by practical situations in which the effort to modify an agent's\nresistance increases with the magnitude of the change, we propose the\n$L_1$-budgeted variant, in which the $L_1$-budget is a restriction on the sum\nof the magnitudes of the changes over all agents' resistance parameters. In\nthis work, we show that the $L_1$-budgeted variant is NP-hard via a reduction\nfrom vertex cover. However, contrary to the $L_0$-budgeted variant, a very\ntechnical argument is needed to show that the optimal solution can be achieved\nby focusing the given $L_1$-budget on as small a number of agents as possible,\nas opposed to spreading the budget over a large number of agents.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2021 04:14:32 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Chan", "T-H. Hubert", ""], ["Lee", "Chui Shan", ""]]}, {"id": "2105.04357", "submitter": "Alejandro Ranchal-Pedrosa", "authors": "Alejandro Ranchal-Pedrosa and Vincent Gramoli", "title": "Agreement in the presence of disagreeing rational players: The Huntsman\n  Protocol", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel Byzantine consensus protocol among $n$ players is\nproposed for the partially synchronous model. In particular, by assuming that\nstandard cryptography is unbreakable, and that\n$n>\\max\\bigl(\\frac{3}{2}k+3t,2(k+t)\\bigr)$, this protocol is an equilibrium\nwhere no coalition of $k$ rational players can coordinate to increase their\nexpected utility regardless of the arbitrary behavior of up to $t$ Byzantine\nplayers. We show that a baiting strategy is necessary and sufficient to solve\nthis, so-called rational agreement problem. First, we show that it is\nimpossible to solve this rational agreement problem without implementing a\nbaiting strategy, a strategy that rewards rational players for betraying its\ncoalition, by exposing undeniable proofs of fraud. Second, we propose the\nHuntsman protocol that solves the rational agreement problem by building recent\nadvances in the context of accountable Byzantine agreement in partial\nsynchrony. This protocol finds applications in distributed ledgers where\nplayers are incentivized to steal assets by leading other players to a\ndisagreement on two distinct decisions where they ``double spend''.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2021 13:42:27 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Ranchal-Pedrosa", "Alejandro", ""], ["Gramoli", "Vincent", ""]]}, {"id": "2105.04692", "submitter": "Pavel Naumov", "authors": "Lia Bozzone and Pavel Naumov", "title": "Budget-Constrained Coalition Strategies with Discounting", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Discounting future costs and rewards is a common practice in accounting, game\ntheory, and machine learning. In spite of this, existing logics for reasoning\nabout strategies with cost and resource constraints do not account for\ndiscounting. The paper proposes a sound and complete logical system for\nreasoning about budget-constrained strategic abilities that incorporates\ndiscounting into its semantics.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2021 22:21:43 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Bozzone", "Lia", ""], ["Naumov", "Pavel", ""]]}, {"id": "2105.04755", "submitter": "Warut Suksompong", "authors": "Edith Elkind, Erel Segal-Halevi, Warut Suksompong", "title": "Graphical Cake Cutting via Maximin Share", "comments": "Appears in the 30th International Joint Conference on Artificial\n  Intelligence (IJCAI), 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the recently introduced cake-cutting setting in which the cake is\nrepresented by an undirected graph. This generalizes the canonical interval\ncake and allows for modeling the division of road networks. We show that when\nthe graph is a forest, an allocation satisfying the well-known criterion of\nmaximin share fairness always exists. Our result holds even when separation\nconstraints are imposed, in which case no multiplicative approximation of\nproportionality can be guaranteed. Furthermore, while maximin share fairness is\nnot always achievable for general graphs, we prove that ordinal relaxations can\nbe attained.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 02:32:32 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Elkind", "Edith", ""], ["Segal-Halevi", "Erel", ""], ["Suksompong", "Warut", ""]]}, {"id": "2105.05123", "submitter": "Xiangning Wang", "authors": "Yihang Hu, Zhiyi Huang, Yiheng Shen, Xiangning Wang", "title": "Targeting Makes Sample Efficiency in Auction Design", "comments": "To appear in The Twenty-Second ACM Conference on Economics and\n  Computation (EC 21)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces the targeted sampling model in optimal auction design.\nIn this model, the seller may specify a quantile interval and sample from a\nbuyer's prior restricted to the interval. This can be interpreted as allowing\nthe seller to, for example, examine the top $40$ percents bids from previous\nbuyers with the same characteristics. The targeting power is quantified with a\nparameter $\\Delta \\in [0, 1]$ which lower bounds how small the quantile\nintervals could be. When $\\Delta = 1$, it degenerates to Cole and Roughgarden's\nmodel of i.i.d. samples; when it is the idealized case of $\\Delta = 0$, it\ndegenerates to the model studied by Chen et al. (2018). For instance, for $n$\nbuyers with bounded values in $[0, 1]$, $\\tilde{O}(\\epsilon^{-1})$ targeted\nsamples suffice while it is known that at least $\\tilde{\\Omega}(n\n\\epsilon^{-2})$ i.i.d. samples are needed. In other words, targeted sampling\nwith sufficient targeting power allows us to remove the linear dependence in\n$n$, and to improve the quadratic dependence in $\\epsilon^{-1}$ to linear. In\nthis work, we introduce new technical ingredients and show that the number of\ntargeted samples sufficient for learning an $\\epsilon$-optimal auction is\nsubstantially smaller than the sample complexity of i.i.d. samples for the full\nspectrum of $\\Delta \\in [0, 1)$. Even with only mild targeting power, i.e.,\nwhenever $\\Delta = o(1)$, our targeted sample complexity upper bounds are\nstrictly smaller than the optimal sample complexity of i.i.d. samples.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 15:33:47 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Hu", "Yihang", ""], ["Huang", "Zhiyi", ""], ["Shen", "Yiheng", ""], ["Wang", "Xiangning", ""]]}, {"id": "2105.05142", "submitter": "Mashbat  Suzuki", "authors": "Jonathan A. Noel, Mashbat Suzuki, Adrian Vetta", "title": "Pirates in Wonderland: Liquid Democracy has Bicriteria Guarantees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Liquid democracy has a natural graphical representation, the delegation\ngraph. Consequently, the strategic aspects of liquid democracy can be studied\nas a game over delegation graphs, called the liquid democracy game. Our main\nresult is that this game has bicriteria approximation guarantees, in terms of\nboth rationality and social welfare. Specifically, we prove the price of\nstability for $\\epsilon$-Nash equilibria is exactly $\\epsilon$ in the liquid\ndemocracy game.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 16:01:24 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Noel", "Jonathan A.", ""], ["Suzuki", "Mashbat", ""], ["Vetta", "Adrian", ""]]}, {"id": "2105.05308", "submitter": "Sean Sinclair", "authors": "Sean R. Sinclair, Siddhartha Banerjee, Christina Lee Yu", "title": "Sequential Fair Allocation: Achieving the Optimal Envy-Efficiency\n  Tradeoff Curve", "comments": "37 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of dividing limited resources to individuals arriving\nover $T$ rounds. Each round has a random number of individuals arrive, and\nindividuals can be characterized by their type (i.e. preferences over the\ndifferent resources). A standard notion of `fairness' in this setting is that\nan allocation simultaneously satisfy envy-freeness and efficiency. The former\nis an individual guarantee, requiring that each agent prefers her own\nallocation over the allocation of any other; in contrast, efficiency is a\nglobal property, requiring that the allocations clear the available resources.\nFor divisible resources, when the number of individuals of each type are known\nupfront, the above desiderata are simultaneously achievable for a large class\nof utility functions. However, in an online setting when the number of\nindividuals of each type are only revealed round by round, no policy can\nguarantee these desiderata simultaneously, and hence the best one can do is to\ntry and allocate so as to approximately satisfy the two properties.\n  We show that in the online setting, the two desired properties (envy-freeness\nand efficiency) are in direct contention, in that any algorithm achieving\nadditive envy-freeness up to a factor of $L_T$ necessarily suffers an\nefficiency loss of at least $1 / L_T$. We complement this uncertainty principle\nwith a simple algorithm, HopeGuardrail, which allocates resources based on an\nadaptive threshold policy. We show that our algorithm is able to achieve any\nfairness-efficiency point on this frontier, and moreover, in simulation\nresults, provides allocations close to the optimal fair solution in hindsight.\nThis motivates its use in practical applications, as the algorithm is able to\nadapt to any desired fairness efficiency trade-off.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 19:09:59 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Sinclair", "Sean R.", ""], ["Banerjee", "Siddhartha", ""], ["Yu", "Christina Lee", ""]]}, {"id": "2105.05377", "submitter": "Mustafa O. Karabag", "authors": "Mustafa O. Karabag, Melkior Ornik, Ufuk Topcu", "title": "Identity Concealment Games: How I Learned to Stop Revealing and Love the\n  Coincidences", "comments": "19 Pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In an adversarial environment, a hostile player performing a task may behave\nlike a non-hostile one in order not to reveal its identity to an opponent. To\nmodel such a scenario, we define identity concealment games: zero-sum\nstochastic reachability games with a zero-sum objective of identity\nconcealment. To measure the identity concealment of the player, we introduce\nthe notion of an average player. The average player's policy represents the\nexpected behavior of a non-hostile player. We show that there exists an\nequilibrium policy pair for every identity concealment game and give the\noptimality equations to synthesize an equilibrium policy pair. If the player's\nopponent follows a non-equilibrium policy, the player can hide its identity\nbetter. For this reason, we study how the hostile player may learn the\nopponent's policy. Since learning via exploration policies would quickly reveal\nthe hostile player's identity to the opponent, we consider the problem of\nlearning a near-optimal policy for the hostile player using the game runs\ncollected under the average player's policy. Consequently, we propose an\nalgorithm that provably learns a near-optimal policy and give an upper bound on\nthe number of sample runs to be collected.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2021 00:41:58 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Karabag", "Mustafa O.", ""], ["Ornik", "Melkior", ""], ["Topcu", "Ufuk", ""]]}, {"id": "2105.05725", "submitter": "Manuel Sorge", "authors": "Jiehua Chen, Adrian Chmurovic, Fabian Jogl, and Manuel Sorge", "title": "On (Coalitional) Exchange-Stable Matching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS cs.MA", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We study (coalitional) exchange stability, which Alcalde [Economic Design,\n1995] introduced as an alternative solution concept for matching markets\ninvolving property rights, such as assigning persons to two-bed rooms. Here, a\nmatching of a given Stable Marriage or Stable Roommates instance is called\ncoalitional exchange-stable if it does not admit any exchange-blocking\ncoalition, that is, a subset S of agents in which everyone prefers the partner\nof some other agent in S. The matching is exchange-stable if it does not admit\nany exchange-blocking pair, that is, an exchange-blocking coalition of size\ntwo.\n  We investigate the computational and parameterized complexity of the\nCoalitional Exchange-Stable Marriage (resp. Coalitional Exchange Roommates)\nproblem, which is to decide whether a Stable Marriage (resp. Stable Roommates)\ninstance admits a coalitional exchange-stable matching. Our findings resolve an\nopen question and confirm the conjecture of Cechl\\'arov\\'a and Manlove\n[Discrete Applied Mathematics, 2005] that Coalitional Exchange-Stable Marriage\nis NP-hard even for complete preferences without ties. We also study\nbounded-length preference lists and a local-search variant of deciding whether\na given matching can reach an exchange-stable one after at most k swaps, where\na swap is defined as exchanging the partners of the two agents in an\nexchange-blocking pair.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2021 15:17:35 GMT"}, {"version": "v2", "created": "Mon, 17 May 2021 17:12:37 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Chen", "Jiehua", ""], ["Chmurovic", "Adrian", ""], ["Jogl", "Fabian", ""], ["Sorge", "Manuel", ""]]}, {"id": "2105.05804", "submitter": "Valentina Morandi", "authors": "Valentina Morandi", "title": "Bridging the user equilibrium and the system optimum in static traffic\n  assignment: how the cooperation among drivers can solve the congestion\n  problem in city networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Solving the road congestion problem is one of the most pressing issues in\nmoderncities since it causes time wasting, pollution, higher industrial costs\nand huge roadmaintenance costs. Advances in ITS technologies and the advent of\nautonomousvehicles are changing mobility dramatically. They enable the\nimplementation of acoordination mechanism, called coordinated traffic\nassignment, among the sat-navdevices aiming at assigning paths to drivers to\neliminate congestion and to re-duce the total travel time in traffic networks.\nAmong possible congestion avoidance methods, coordinated traffic assignment is\na valuable choice since it does not involvehuge investments to expand the road\nnetwork. Traffic assignments are traditionally devoted to two main perspectives\non which the well-known Wardropian principlesare inspired: the user equilibrium\nand the system optimum. User equilibrium is a user-driven traffic assignment in\nwhich each user chooses the most convenientpath selfishly. It guarantees that\nfairness among users is respected since, whenthe equilibrium is reached, all\nusers sharing the same origin and destination willexperience the same travel\ntime. The main drawback in a user equilibrium is thatthe system total travel\ntime is not minimized and, hence, the so-called Price ofAnarchy is paid. On the\nother hand, the system optimum is an efficient system-wide traffic assignment\nin which drivers are routed on the network in such a waythe total travel time\nis minimized but users might experience travel times that arehigher than the\nother users travelling from the same origin to the same destina-tion affecting\nthe compliance. Thus, drawbacks in implementing one of the two assignments can\nbe overcome by hybridizing the two approaches aiming at bridging users'\nfairness to system-wide efficiency. The survey reviews the state-of-the-art of\nthese trade-off approaches\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 06:45:03 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Morandi", "Valentina", ""]]}, {"id": "2105.05987", "submitter": "Niclas Boehmer", "authors": "Niclas Boehmer, Vincent Froese, Julia Henkel, Yvonne Lasars, Rolf\n  Niedermeier, Malte Renken", "title": "Two Influence Maximization Games on Graphs Made Temporal", "comments": "Accepted to IJCAI 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To address the dynamic nature of real-world networks, we generalize\ncompetitive diffusion games and Voronoi games from static to temporal graphs,\nwhere edges may appear or disappear over time. This establishes a new direction\nof studies in the area of graph games, motivated by applications such as\ninfluence spreading. As a first step, we investigate the existence of Nash\nequilibria in competitive diffusion and Voronoi games on different temporal\ngraph classes. Even when restricting our studies to temporal paths and cycles,\nthis turns out to be a challenging undertaking, revealing significant\ndifferences between the two games in the temporal setting. Notably, both games\nare equivalent on static paths and cycles. Our two main technical results are\n(algorithmic) proofs for the existence of Nash equilibria in temporal\ncompetitive diffusion and temporal Voronoi games when the edges are restricted\nnot to disappear over time.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2021 22:03:40 GMT"}], "update_date": "2021-05-14", "authors_parsed": [["Boehmer", "Niclas", ""], ["Froese", "Vincent", ""], ["Henkel", "Julia", ""], ["Lasars", "Yvonne", ""], ["Niedermeier", "Rolf", ""], ["Renken", "Malte", ""]]}, {"id": "2105.06008", "submitter": "Hanrui Zhang", "authors": "Hanrui Zhang, Vincent Conitzer", "title": "Automated Dynamic Mechanism Design", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study Bayesian automated mechanism design in unstructured dynamic\nenvironments, where a principal repeatedly interacts with an agent, and takes\nactions based on the strategic agent's report of the current state of the\nworld. Both the principal and the agent can have arbitrary and potentially\ndifferent valuations for the actions taken, possibly also depending on the\nactual state of the world. Moreover, at any time, the state of the world may\nevolve arbitrarily depending on the action taken by the principal. The goal is\nto compute an optimal mechanism which maximizes the principal's utility in the\nface of the self-interested strategic agent.\n  We give an efficient algorithm for computing optimal mechanisms, with or\nwithout payments, under different individual-rationality constraints, when the\ntime horizon is constant. Our algorithm is based on a sophisticated linear\nprogram formulation, which can be customized in various ways to accommodate\nricher constraints. For environments with large time horizons, we show that the\nprincipal's optimal utility is hard to approximate within a certain constant\nfactor, complementing our algorithmic result. We further consider a special\ncase of the problem where the agent is myopic, and give a refined efficient\nalgorithm whose time complexity scales linearly in the time horizon. Moreover,\nwe show that memoryless mechanisms do not provide a good solution for our\nproblem, in terms of both optimality and computational tractability. These\nresults paint a relatively complete picture for automated dynamic mechanism\ndesign in unstructured environments. Finally, we present experimental results\nwhere our algorithms are applied to synthetic dynamic environments with\ndifferent characteristics, which not only serve as a proof of concept for our\nalgorithms, but also exhibit intriguing phenomena in dynamic mechanism design.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 00:32:02 GMT"}], "update_date": "2021-05-14", "authors_parsed": [["Zhang", "Hanrui", ""], ["Conitzer", "Vincent", ""]]}, {"id": "2105.06561", "submitter": "Niclas Boehmer", "authors": "Luca Kreisel, Niclas Boehmer, Vincent Froese, Rolf Niedermeier", "title": "Equilibria in Schelling Games: Computational Complexity and Robustness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the simplest game-theoretic formulation of Schelling's model of\nsegregation on graphs, agents of two different types each select their own\nvertex in a given graph such as to maximize the fraction of agents of their\ntype in their occupied neighborhood. Two ways of modeling agent movement here\nare either to allow two agents to swap their vertices or to allow an agent to\njump to a free vertex. The contributions of this paper are twofold. First, we\nprove that deciding the existence of a swap-equilibrium and a jump-equilibrium\nin this simplest model of Schelling games is NP-hard, thereby answering\nquestions left open by Agarwal et al. [AAAI '20] and Elkind et al. [IJCAI '19].\nSecond, we introduce a measure for the robustness of equilibria in Schelling\ngames in terms of the minimum number of edges that need to be deleted to make\nan equilibrium unstable. We prove tight lower and upper bounds on the\nrobustness of swap-equilibria in Schelling games on different graph classes.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 21:32:50 GMT"}, {"version": "v2", "created": "Thu, 20 May 2021 10:56:10 GMT"}], "update_date": "2021-05-21", "authors_parsed": [["Kreisel", "Luca", ""], ["Boehmer", "Niclas", ""], ["Froese", "Vincent", ""], ["Niedermeier", "Rolf", ""]]}, {"id": "2105.06593", "submitter": "Woodrow Wang", "authors": "Woodrow Z. Wang, Mark Beliaev, Erdem B{\\i}y{\\i}k, Daniel A. Lazar,\n  Ramtin Pedarsani, Dorsa Sadigh", "title": "Emergent Prosociality in Multi-Agent Games Through Gifting", "comments": "9 pages, 6 figures, IJCAI 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coordination is often critical to forming prosocial behaviors -- behaviors\nthat increase the overall sum of rewards received by all agents in a\nmulti-agent game. However, state of the art reinforcement learning algorithms\noften suffer from converging to socially less desirable equilibria when\nmultiple equilibria exist. Previous works address this challenge with explicit\nreward shaping, which requires the strong assumption that agents can be forced\nto be prosocial. We propose using a less restrictive peer-rewarding mechanism,\ngifting, that guides the agents toward more socially desirable equilibria while\nallowing agents to remain selfish and decentralized. Gifting allows each agent\nto give some of their reward to other agents. We employ a theoretical framework\nthat captures the benefit of gifting in converging to the prosocial equilibrium\nby characterizing the equilibria's basins of attraction in a dynamical system.\nWith gifting, we demonstrate increased convergence of high risk, general-sum\ncoordination games to the prosocial equilibrium both via numerical analysis and\nexperiments.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 23:28:30 GMT"}], "update_date": "2021-05-17", "authors_parsed": [["Wang", "Woodrow Z.", ""], ["Beliaev", "Mark", ""], ["Bıyık", "Erdem", ""], ["Lazar", "Daniel A.", ""], ["Pedarsani", "Ramtin", ""], ["Sadigh", "Dorsa", ""]]}, {"id": "2105.06669", "submitter": "Warut Suksompong", "authors": "Edith Elkind, Erel Segal-Halevi, Warut Suksompong", "title": "Keep Your Distance: Land Division With Separation", "comments": "Appears in the 30th International Joint Conference on Artificial\n  Intelligence (IJCAI), 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is part of an ongoing endeavor to bring the theory of fair\ndivision closer to practice by handling requirements from real-life\napplications. We focus on two requirements originating from the division of\nland estates: (1) each agent should receive a plot of a usable geometric shape,\nand (2) plots of different agents must be physically separated. With these\nrequirements, the classic fairness notion of proportionality is impractical,\nsince it may be impossible to attain any multiplicative approximation of it. In\ncontrast, the ordinal maximin share approximation, introduced by Budish in\n2011, provides meaningful fairness guarantees. We prove upper and lower bounds\non achievable maximin share guarantees when the usable shapes are squares, fat\nrectangles, or arbitrary axes-aligned rectangles, and explore the algorithmic\nand query complexity of finding fair partitions in this setting.\n", "versions": [{"version": "v1", "created": "Fri, 14 May 2021 07:03:21 GMT"}], "update_date": "2021-05-17", "authors_parsed": [["Elkind", "Edith", ""], ["Segal-Halevi", "Erel", ""], ["Suksompong", "Warut", ""]]}, {"id": "2105.06686", "submitter": "James C. A. Main", "authors": "James C. A. Main, Mickael Randour, Jeremy Sproston", "title": "Time Flies When Looking out of the Window: Timed Games with Window\n  Parity Objectives", "comments": "Full version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The window mechanism was introduced by Chatterjee et al. to reinforce\nmean-payoff and total-payoff objectives with time bounds in two-player\nturn-based games on graphs. It has since proved useful in a variety of\nsettings, including parity objectives in games and both mean-payoff and parity\nobjectives in Markov decision processes.\n  We study window parity objectives in timed automata and timed games: given a\nbound on the window size, a path satisfies such an objective if, in all states\nalong the path, we see a sufficiently small window in which the smallest\npriority is even. We show that checking that all time-divergent paths of a\ntimed automaton satisfy such a window parity objective can be done in\npolynomial space, and that the corresponding timed games can be solved in\nexponential time. This matches the complexity class of timed parity games,\nwhile adding the ability to reason about time bounds. We also consider\nmulti-dimensional objectives and show that the complexity class does not\nincrease. To the best of our knowledge, this is the first study of the window\nmechanism in a real-time setting.\n", "versions": [{"version": "v1", "created": "Fri, 14 May 2021 07:52:50 GMT"}], "update_date": "2021-05-17", "authors_parsed": [["Main", "James C. A.", ""], ["Randour", "Mickael", ""], ["Sproston", "Jeremy", ""]]}, {"id": "2105.06763", "submitter": "Matteo Capucci", "authors": "Matteo Capucci, Neil Ghani, J\\'er\\'emy Ledent, Fredrik Nordvall\n  Forsberg", "title": "Translating Extensive Form Games to Open Games with Agency", "comments": "13 pages, submitted to ACT2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA math.CT", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  We show open games cover extensive form games with both perfect and imperfect\ninformation. Doing so forces us to address two current weaknesses in open\ngames: the lack of a notion of player and their agency within open games, and\nthe lack of choice operators. Using the former we construct the latter, and\nthese choice operators subsume previous proposed operators for open games,\nthereby making progress towards a core, canonical and ergonomic calculus of\ngame operators. Collectively these innovations increase the level of\ncompositionality of open games, and demonstrate their expressiveness.\n", "versions": [{"version": "v1", "created": "Fri, 14 May 2021 11:15:25 GMT"}], "update_date": "2021-05-17", "authors_parsed": [["Capucci", "Matteo", ""], ["Ghani", "Neil", ""], ["Ledent", "Jérémy", ""], ["Forsberg", "Fredrik Nordvall", ""]]}, {"id": "2105.07161", "submitter": "Felix Zhou", "authors": "Jochen Koenemann, Justin Toth, Felix Zhou", "title": "On the Complexity of Nucleolus Computation for Bipartite b-Matching\n  Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the complexity of nucleolus computation in b-matching games on\nbipartite graphs. We show that computing the nucleolus of a simple b-matching\ngame is NP-hard even on bipartite graphs of maximum degree 7. We complement\nthis with partial positive results in the special case where b values are\nbounded by 2. In particular, we describe an efficient algorithm when a constant\nnumber of vertices satisfy b(v) = 2 as well as an efficient algorithm for\ncomputing the non-simple b-matching nucleolus when b = 2.\n", "versions": [{"version": "v1", "created": "Sat, 15 May 2021 07:25:21 GMT"}, {"version": "v2", "created": "Sun, 11 Jul 2021 08:16:43 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Koenemann", "Jochen", ""], ["Toth", "Justin", ""], ["Zhou", "Felix", ""]]}, {"id": "2105.07405", "submitter": "Feng Huang", "authors": "Feng Huang, Ming Cao, and Long Wang", "title": "Optimal control of robust team stochastic games", "comments": "under review", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.AI cs.GT cs.MA cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In stochastic dynamic environments, team stochastic games have emerged as a\nversatile paradigm for studying sequential decision-making problems of fully\ncooperative multi-agent systems. However, the optimality of the derived\npolicies is usually sensitive to the model parameters, which are typically\nunknown and required to be estimated from noisy data in practice. To mitigate\nthe sensitivity of the optimal policy to these uncertain parameters, in this\npaper, we propose a model of \"robust\" team stochastic games, where players\nutilize a robust optimization approach to make decisions. This model extends\nteam stochastic games to the scenario of incomplete information and meanwhile\nprovides an alternative solution concept of robust team optimality. To seek\nsuch a solution, we develop a learning algorithm in the form of a Gauss-Seidel\nmodified policy iteration and prove its convergence. This algorithm, compared\nwith robust dynamic programming, not only possesses a faster convergence rate,\nbut also allows for using approximation calculations to alleviate the curse of\ndimensionality. Moreover, some numerical simulations are presented to\ndemonstrate the effectiveness of the algorithm by generalizing the game model\nof social dilemmas to sequential robust scenarios.\n", "versions": [{"version": "v1", "created": "Sun, 16 May 2021 10:42:09 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Huang", "Feng", ""], ["Cao", "Ming", ""], ["Wang", "Long", ""]]}, {"id": "2105.07480", "submitter": "Dario Paccagnan", "authors": "Dario Paccagnan, Martin Gairing", "title": "In Congestion Games, Taxes Achieve Optimal Approximation", "comments": "To appear at the 22nd ACM Conference on Economics & Computation\n  (EC'21)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of minimizing social cost in atomic congestion games\nand show, perhaps surprisingly, that efficiently computed taxation mechanisms\nyield the same performance achievable by the best polynomial time algorithm,\neven when the latter has full control over the players' actions. It follows\nthat no other tractable approach geared at incentivizing desirable system\nbehavior can improve upon this result, regardless of whether it is based on\ntaxations, coordination mechanisms, information provision, or any other\nprinciple. In short: Judiciously chosen taxes achieve optimal approximation.\n  Three technical contributions underpin this conclusion. First, we show that\ncomputing the minimum social cost is NP-hard to approximate within a given\nfactor depending solely on the admissible resource costs. Second, we design a\ntractable taxation mechanism whose efficiency (price of anarchy) matches this\nhardness factor, and thus is optimal. As these results extend to coarse\ncorrelated equilibria, any no-regret algorithm inherits the same performances,\nallowing us to devise polynomial time algorithms with optimal approximation.\n", "versions": [{"version": "v1", "created": "Sun, 16 May 2021 16:45:52 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Paccagnan", "Dario", ""], ["Gairing", "Martin", ""]]}, {"id": "2105.07815", "submitter": "Niclas Boehmer", "authors": "Niclas Boehmer, Robert Bredereck, Piotr Faliszewski, Rolf Niedermeier,\n  Stanis{\\l}aw Szufa", "title": "Putting a Compass on the Map of Elections", "comments": "Accepted to IJCAI 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.EM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, Szufa et al. [AAMAS 2020] presented a \"map of elections\" that\nvisualizes a set of 800 elections generated from various statistical cultures.\nWhile similar elections are grouped together on this map, there is no obvious\ninterpretation of the elections' positions. We provide such an interpretation\nby introducing four canonical \"extreme\" elections, acting as a compass on the\nmap. We use them to analyze both a dataset provided by Szufa et al. and a\nnumber of real-life elections. In effect, we find a new variant of the Mallows\nmodel and show that it captures real-life scenarios particularly well.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2021 13:28:39 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Boehmer", "Niclas", ""], ["Bredereck", "Robert", ""], ["Faliszewski", "Piotr", ""], ["Niedermeier", "Rolf", ""], ["Szufa", "Stanisław", ""]]}, {"id": "2105.07966", "submitter": "Anand Santhanakrishnan", "authors": "Santhanakrishnan Anand, Ofer Arazy, Narayan B. Mandayam and Oded Nov", "title": "A Game-Theoretic Analysis of Competitive Editing in Wikipedia:\n  Contributors' Effort to Influence Articles and the Community's Attempt to\n  Ensure Neutrality", "comments": "37 pages, 6 figures, 1 Table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer production, such as the collaborative authoring of Wikipedia articles,\ninvolves both cooperation and competition between contributors, and we focus on\nthe latter. As individuals, contributors compete to align Wikipedia articles\nwith their personal perspectives. As a community, they work collectively to\nensure a neutral point of view (NPOV). We study the interplay between\nindividuals' competition and the community's endeavor to ensure neutrality. We\ndevelop a two-level game-theoretic model, modeling the interactions of\nownership-motivated individuals and neutrality-seeking communal mechanisms as a\nStackelberg game. We present our model's predictions regarding the relation\nbetween contributors' effort (i.e. typical size of edit) and benefits (i.e. the\nportion of the article they eventually ``own''). We validate the model's\nprediction through an empirical analysis, by studying the interactions of\n219,811 distinct contributors that co-produced 864 Wikipedia articles over a\ndecade. The analysis and empirical results suggest that contributors who make\nlarge edits (``creators'') eventually lose the article's ownership to those who\nrefine the articles and typically make smaller edits (``curators''). Whereas\nneutrality-seeking mechanisms are essential for ensuring that ownership is not\nconcentrated within a small number of contributors, our findings suggest that\nthe burden of excessive governance may deter contributors from participating.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2021 15:46:48 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Anand", "Santhanakrishnan", ""], ["Arazy", "Ofer", ""], ["Mandayam", "Narayan B.", ""], ["Nov", "Oded", ""]]}, {"id": "2105.08043", "submitter": "Markus Brill", "authors": "Jonas Israel and Markus Brill", "title": "Dynamic Proportional Rankings", "comments": null, "journal-ref": "Proceedings of the the 30th International Joint Conference on\n  Artificial Intelligence (IJCAI 2021)", "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Proportional ranking rules aggregate approval-style preferences of agents\ninto a collective ranking such that groups of agents with similar preferences\nare adequately represented. Motivated by the application of live Q&A platforms,\nwhere submitted questions need to be ranked based on the interests of the\naudience, we study a dynamic extension of the proportional rankings setting. In\nour setting, the goal is to maintain the proportionality of a ranking when\nalternatives (i.e., questions) -- not necessarily from the top of the ranking\n-- get selected sequentially. We propose generalizations of well-known\naggregation rules to this setting and study their monotonicity and\nproportionality properties. We also evaluate the performance of these rules\nexperimentally, using realistic probabilistic assumptions on the selection\nprocedure.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2021 17:46:01 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Israel", "Jonas", ""], ["Brill", "Markus", ""]]}, {"id": "2105.08292", "submitter": "Linda Cai", "authors": "Linda Cai and Raghuvansh R. Saxena", "title": "99% Revenue with Constant Enhanced Competition", "comments": "Accepted to Economic and Computing 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  The enhanced competition paradigm is an attempt at bridging the gap between\nsimple and optimal auctions. In this line of work, given an auction setting\nwith $m$ items and $n$ bidders, the goal is to find the smallest $n' \\geq n$\nsuch that selling the items to $n'$ bidders through a simple auction generates\n(almost) the same revenue as the optimal auction.\n  Recently, Feldman, Friedler, and Rubinstein [EC, 2018] showed that an\narbitrarily large constant fraction of the optimal revenue from selling $m$\nitems to a single bidder can be obtained via simple auctions with a constant\nnumber of bidders. However, their techniques break down even for two bidders,\nand can only show a bound of $n' = n \\cdot O(\\log \\frac{m}{n})$.\n  Our main result is that $n' = O(n)$ bidders suffice for all values of $m$ and\n$n$. That is, we show that, for all $m$ and $n$, an arbitrarily large constant\nfraction of the optimal revenue from selling $m$ items to $n$ bidders can be\nobtained via simple auctions with $O(n)$ bidders. Moreover, when the items are\nregular, we can achieve the same result through auctions that are\nprior-independent, {\\em i.e.}, they do not depend on the distribution from\nwhich the bidders' valuations are sampled.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 05:53:56 GMT"}], "update_date": "2021-05-19", "authors_parsed": [["Cai", "Linda", ""], ["Saxena", "Raghuvansh R.", ""]]}, {"id": "2105.08376", "submitter": "Niclas Boehmer", "authors": "Niclas Boehmer, Robert Bredereck, Du\\v{s}an Knop, Junjie Luo", "title": "Fine-Grained View on Bribery for Group Identification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a set of agents qualifying or disqualifying each other, group\nidentification is the task of identifying a socially qualified subgroup of\nagents. Social qualification depends on the specific rule used to aggregate\nindividual qualifications. The classical bribery problem in this context asks\nhow many agents need to change their qualifications in order to change the\noutcome in a certain way. Complementing previous results showing\npolynomial-time solvability or NP-hardness of bribery for various social rules\nin the constructive (aiming at making specific agents socially qualified) or\ndestructive (aiming at making specific agents socially disqualified) setting,\nwe provide a comprehensive picture of the parameterized computational\ncomplexity landscape. Conceptually, we also consider a more fine-grained\nconcept of bribery cost, where we ask how many single qualifications need to be\nchanged, nonunit prices for different bribery actions, and a more general\nbribery goal that combines the constructive and destructive setting.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 09:05:47 GMT"}], "update_date": "2021-05-19", "authors_parsed": [["Boehmer", "Niclas", ""], ["Bredereck", "Robert", ""], ["Knop", "Dušan", ""], ["Luo", "Junjie", ""]]}, {"id": "2105.08540", "submitter": "Zack Fitzsimmons", "authors": "Zack Fitzsimmons and Edith Hemaspaandra", "title": "Kemeny Consensus Complexity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The computational study of election problems generally focuses on questions\nrelated to the winner or set of winners of an election. But social preference\nfunctions such as Kemeny rule output a full ranking of the candidates (a\nconsensus). We study the complexity of consensus-related questions, with a\nparticular focus on Kemeny and its qualitative version Slater. The simplest of\nthese questions is the problem of determining whether a ranking is a consensus,\nand we show that this problem is coNP-complete. We also study the natural\nquestion of the complexity of manipulative actions that have a specific\nconsensus as a goal. Though determining whether a ranking is a Kemeny consensus\nis hard, the optimal action for manipulators is to simply vote their desired\nconsensus. We provide evidence that this simplicity is caused by the\ncombination of election system (Kemeny), manipulative action (manipulation),\nand manipulative goal (consensus). In the process we provide the first\ncompleteness results at the second level of the polynomial hierarchy for\nelectoral manipulation and for optimal solution recognition.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 14:15:03 GMT"}], "update_date": "2021-05-19", "authors_parsed": [["Fitzsimmons", "Zack", ""], ["Hemaspaandra", "Edith", ""]]}, {"id": "2105.08572", "submitter": "Fang-Yi Yu", "authors": "Yiling Chen, Biaoshuai Tao, Fang-Yi Yu", "title": "Cooperation in Threshold Public Projects with Binary Actions", "comments": "14 pages, 1 figure, accepted at IJCAI'21: International Joint\n  Conference on Artificial Intelligence", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  When can cooperation arise from self-interested decisions in public goods\ngames? And how can we help agents to act cooperatively? We examine these\nclassical questions in a pivotal participation game, a variant of public good\ngames, where heterogeneous agents make binary participation decisions on\ncontributing their endowments, and the public project succeeds when it has\nenough contributions.\n  We prove it is NP-complete to decide the existence of a cooperative Nash\nequilibrium such that the project succeeds. We also identify two natural\nspecial scenarios where this decision problem is tractable. We then propose two\nalgorithms to help cooperation in the game. Our first algorithm adds an\nexternal investment to the public project, and our second algorithm uses\nmatching funds. We show that the cost to induce a cooperative Nash equilibrium\nis near-optimal for both algorithms. Finally, the cost of matching funds can\nalways be smaller than the cost of adding an external investment. Intuitively,\nmatching funds provide a greater incentive for cooperation than adding an\nexternal investment does.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 14:55:15 GMT"}], "update_date": "2021-05-19", "authors_parsed": [["Chen", "Yiling", ""], ["Tao", "Biaoshuai", ""], ["Yu", "Fang-Yi", ""]]}, {"id": "2105.09115", "submitter": "Jannik Peters", "authors": "\\'Agnes Cseh and Jannik Peters", "title": "Three-Dimensional Popular Matching with Cyclic Preferences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Two actively researched problem settings in matchings under preferences are\npopular matchings and the three-dimensional stable matching problem with cyclic\npreferences. In this paper, we apply the optimality notion of the first topic\nto the input characteristics of the second one. We investigate the connection\nbetween stability, popularity, and their strict variants, strong stability and\nstrong popularity in three-dimensional instances with cyclic preferences.\nFurthermore, we also derive results on the complexity of these problems when\nthe preferences are derived from master lists.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2021 13:18:53 GMT"}], "update_date": "2021-05-20", "authors_parsed": [["Cseh", "Ágnes", ""], ["Peters", "Jannik", ""]]}, {"id": "2105.09129", "submitter": "Florian Funke", "authors": "Christel Baier, Florian Funke, Rupak Majumdar", "title": "A Game-Theoretic Account of Responsibility Allocation", "comments": "20 pages, 3 figures, technical report associated with an IJCAI'21\n  publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  When designing or analyzing multi-agent systems, a fundamental problem is\nresponsibility ascription: to specify which agents are responsible for the\njoint outcome of their behaviors and to which extent. We model strategic\nmulti-agent interaction as an extensive form game of imperfect information and\ndefine notions of forward (prospective) and backward (retrospective)\nresponsibility. Forward responsibility identifies the responsibility of a group\nof agents for an outcome along all possible plays, whereas backward\nresponsibility identifies the responsibility along a given play. We further\ndistinguish between strategic and causal backward responsibility, where the\nformer captures the epistemic knowledge of players along a play, while the\nlatter formalizes which players -- possibly unknowingly -- caused the outcome.\nA formal connection between forward and backward notions is established in the\ncase of perfect recall. We further ascribe quantitative responsibility through\ncooperative game theory. We show through a number of examples that our approach\nencompasses several prior formal accounts of responsibility attribution.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2021 13:45:18 GMT"}], "update_date": "2021-05-20", "authors_parsed": [["Baier", "Christel", ""], ["Funke", "Florian", ""], ["Majumdar", "Rupak", ""]]}, {"id": "2105.09145", "submitter": "Thomas Orton", "authors": "Thomas Orton", "title": "Modeling Precomputation In Games Played Under Computational Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the properties of games played under computational constraints\nremains challenging. For example, how do we expect rational (but\ncomputationally bounded) players to play games with a prohibitively large\nnumber of states, such as chess? This paper presents a novel model for the\nprecomputation (preparing moves in advance) aspect of computationally\nconstrained games. A fundamental trade-off is shown between randomness of play,\nand susceptibility to precomputation, suggesting that randomization is\nnecessary in games with computational constraints. We present efficient\nalgorithms for computing how susceptible a strategy is to precomputation, and\ncomputing an $\\epsilon$-Nash equilibrium of our model. Numerical experiments\nmeasuring the trade-off between randomness and precomputation are provided for\nStockfish (a well-known chess playing algorithm).\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2021 14:06:46 GMT"}], "update_date": "2021-05-20", "authors_parsed": [["Orton", "Thomas", ""]]}, {"id": "2105.09375", "submitter": "Song Zuo", "authors": "Dirk Bergemann, Paul Duetting, Renato Paes Leme, Song Zuo", "title": "Calibrated Click-Through Auctions: An Information Design Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the optimal information design in a click-through auction with\nfixed valuations per click, but stochastic click-through rates. While the\nauctioneer takes as given the auction rule of the click-through auction, namely\nthe generalized second-price auction, the auctioneer can design the information\nflow regarding the click-through rates among the bidders. A natural requirement\nin this context is to ask for the information structure to be calibrated in the\nlearning sense. With this constraint, the auction needs to rank the ads by a\nproduct of the bid and an unbiased estimator of the click-through rates, and\nthe task of designing an optimal information structure is thus reduced to the\ntask of designing an optimal unbiased estimator.\n  We show that in a symmetric setting with uncertainty about the click-through\nrates, the optimal information structure attains both social efficiency and\nsurplus extraction. The optimal information structure requires private (rather\nthan public) signals to the bidders. It also requires correlated (rather than\nindependent) signals, even when the underlying uncertainty regarding the\nclick-through rates is independent. Beyond symmetric settings, we show that the\noptimal information structure requires partial information disclosure.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2021 19:40:25 GMT"}], "update_date": "2021-05-21", "authors_parsed": [["Bergemann", "Dirk", ""], ["Duetting", "Paul", ""], ["Leme", "Renato Paes", ""], ["Zuo", "Song", ""]]}, {"id": "2105.09383", "submitter": "Hadi Hosseini", "authors": "Hadi Hosseini and Andrew Searns", "title": "Guaranteeing Maximin Shares: Some Agents Left Behind", "comments": "Full version of a paper accepted to IJCAI 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI econ.TH", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The maximin share (MMS) guarantee is a desirable fairness notion for\nallocating indivisible goods. While MMS allocations do not always exist,\nseveral approximation techniques have been developed to ensure that all agents\nreceive a fraction of their maximin share. We focus on an alternative\napproximation notion, based on the population of agents, that seeks to\nguarantee MMS for a fraction of agents. We show that no optimal approximation\nalgorithm can satisfy more than a constant number of agents, and discuss the\nexistence and computation of MMS for all but one agent and its relation to\napproximate MMS guarantees. We then prove the existence of allocations that\nguarantee MMS for $\\frac{2}{3}$ of agents, and devise a polynomial time\nalgorithm that achieves this bound for up to nine agents. A key implication of\nour result is the existence of allocations that guarantee\n$\\text{MMS}^{\\lceil{3n/2}\\rceil}$, i.e., the value that agents receive by\npartitioning the goods into $\\lceil{\\frac{3}{2}n}\\rceil$ bundles, improving the\nbest known guarantee of $\\text{MMS}^{2n-2}$. Finally, we provide empirical\nexperiments using synthetic data.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2021 20:17:42 GMT"}], "update_date": "2021-05-21", "authors_parsed": [["Hosseini", "Hadi", ""], ["Searns", "Andrew", ""]]}, {"id": "2105.09386", "submitter": "Debmalya Mandal", "authors": "Hadi Hosseini, Debmalya Mandal, Nisarg Shah, and Kevin Shi", "title": "Surprisingly Popular Voting Recovers Rankings, Surprisingly!", "comments": "Forthcoming at IJCAI-2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The wisdom of the crowd has long become the de facto approach for eliciting\ninformation from individuals or experts in order to predict the ground truth.\nHowever, classical democratic approaches for aggregating individual\n\\emph{votes} only work when the opinion of the majority of the crowd is\nrelatively accurate. A clever recent approach, \\emph{surprisingly popular\nvoting}, elicits additional information from the individuals, namely their\n\\emph{prediction} of other individuals' votes, and provably recovers the ground\ntruth even when experts are in minority. This approach works well when the goal\nis to pick the correct option from a small list, but when the goal is to\nrecover a true ranking of the alternatives, a direct application of the\napproach requires eliciting too much information. We explore practical\ntechniques for extending the surprisingly popular algorithm to ranked voting by\npartial votes and predictions and designing robust aggregation rules. We\nexperimentally demonstrate that even a little prediction information helps\nsurprisingly popular voting outperform classical approaches.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2021 20:31:23 GMT"}], "update_date": "2021-05-21", "authors_parsed": [["Hosseini", "Hadi", ""], ["Mandal", "Debmalya", ""], ["Shah", "Nisarg", ""], ["Shi", "Kevin", ""]]}, {"id": "2105.09764", "submitter": "Tuomas Takko M.Sc.", "authors": "Tuomas Takko, Kunal Bhattacharya, Daniel Monsivais and Kimmo Kaski", "title": "Human-agent coordination in a group formation game", "comments": "Chosen to be published in Scientific Reports on 24.05.2021 with DOI:\n  10.1038/s41598-021-90123-8", "journal-ref": null, "doi": "10.1038/s41598-021-90123-8", "report-no": null, "categories": "physics.soc-ph cs.GT cs.MA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Coordination and cooperation between humans and autonomous agents in\ncooperative games raises interesting questions of human decision making and\nbehaviour changes. Here we report our findings from a group formation game in a\nsmall-world network of different mixes of human and agent players, aiming to\nachieve connected clusters of the same colour by swapping places with\nneighbouring players using non-overlapping information. In the experiments the\nhuman players are incentivized by rewarding to prioritize their own cluster\nwhile the model of agents' decision making is derived from our previous\nexperiment of purely cooperative game between human players. The experiments\nwere performed by grouping the players in three different setups to investigate\nthe overall effect of having cooperative autonomous agents within teams. We\nobserve that the change in the behavior of human subjects adjusts to playing\nwith autonomous agents by being less risk averse, while keeping the overall\nperformance efficient by splitting the behaviour into selfish and cooperative\nin the two actions performed during the rounds of the game. Moreover, results\nfrom two hybrid human-agent setups suggest that the group composition affects\nthe evolution of clusters. Our findings indicate that in purely or lesser\ncooperative settings, providing more control to humans could help in maximizing\nthe overall performance of hybrid systems.\n", "versions": [{"version": "v1", "created": "Thu, 20 May 2021 14:11:57 GMT"}], "update_date": "2021-05-21", "authors_parsed": [["Takko", "Tuomas", ""], ["Bhattacharya", "Kunal", ""], ["Monsivais", "Daniel", ""], ["Kaski", "Kimmo", ""]]}, {"id": "2105.09852", "submitter": "Naftali Waxman", "authors": "Naftali Waxman, Noam Hazon, Sarit Kraus", "title": "Manipulation of k-Coalitional Games on Social Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.GR", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In many coalition formation games the utility of the agents depends on a\nsocial network. In such scenarios there might be a manipulative agent that\nwould like to manipulate his connections in the social network in order to\nincrease his utility. We study a model of coalition formation in which a\ncentral organizer, who needs to form $k$ coalitions, obtains information about\nthe social network from the agents. The central organizer has her own\nobjective: she might want to maximize the utilitarian social welfare, maximize\nthe egalitarian social welfare, or simply guarantee that every agent will have\nat least one connection within her coalition. In this paper we study the\nsusceptibility to manipulation of these objectives, given the abilities and\ninformation that the manipulator has. Specifically, we show that if the\nmanipulator has very limited information, namely he is only familiar with his\nimmediate neighbours in the network, then a manipulation is almost always\nimpossible. Moreover, if the manipulator is only able to add connections to the\nsocial network, then a manipulation is still impossible for some objectives,\neven if the manipulator has full information on the structure of the network.\nOn the other hand, if the manipulator is able to hide some of his connections,\nthen all objectives are susceptible to manipulation, even if the manipulator\nhas limited information, i.e., when he is familiar with his immediate\nneighbours and with their neighbours.\n", "versions": [{"version": "v1", "created": "Thu, 20 May 2021 15:59:32 GMT"}], "update_date": "2021-05-21", "authors_parsed": [["Waxman", "Naftali", ""], ["Hazon", "Noam", ""], ["Kraus", "Sarit", ""]]}, {"id": "2105.10064", "submitter": "Daniel Halpern", "authors": "Daniel Halpern and Nisarg Shah", "title": "Fair and Efficient Resource Allocation with Partial Information", "comments": "Appears in the Proceedings of IJCAI 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the fundamental problem of allocating indivisible goods to agents\nwith additive preferences. We consider eliciting from each agent only a ranking\nof her $k$ most preferred goods instead of her full cardinal valuations. We\ncharacterize the value of $k$ needed to achieve envy-freeness up to one good\nand approximate maximin share guarantee, two widely studied fairness notions.\nWe also analyze the multiplicative loss in social welfare incurred due to the\nlack of full information with and without the fairness requirements.\n", "versions": [{"version": "v1", "created": "Thu, 20 May 2021 23:19:25 GMT"}, {"version": "v2", "created": "Mon, 24 May 2021 15:51:20 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Halpern", "Daniel", ""], ["Shah", "Nisarg", ""]]}, {"id": "2105.10433", "submitter": "Will Ma", "authors": "Will Ma", "title": "When is Assortment Optimization Optimal?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A classical question in economics is whether complex, randomized selling\nprotocols can improve a firm's revenue beyond that of simple,\ntake-it-or-leave-it posted prices. In 1981, Myerson answered this question with\nan emphatic ``No'' for a monopolist selling a single good. By contrast, there\nis no crisp answer for multiple goods, and a major focus of Bayesian mechanism\ndesign since then has been to understand the power of randomized lotteries over\ndeterministic pricing in different settings.\n  In this paper, we ask the same question for assortment optimization, where\ngoods have exogenously-fixed prices, and the decision is a set of substitute\ngoods to offer. To formalize this question, we introduce a Bayesian mechanism\ndesign problem with fixed prices and ordinal preferences, in which assortments\ncorrespond to deterministic mechanisms. Meanwhile, randomized mechanisms\ncorrespond to lotteries whose payment is restricted to equal the fixed price of\nthe randomly-allocated good. This models the ``fixed-price lotteries'' trending\nin designer fashion, a significant departure from traditional lotteries based\non price discounts.\n  We first show that for general ordinal distributions, lotteries under this\nrestriction can still earn greater revenue than any deterministic assortment.\nWe then derive a natural sufficient condition on the distribution which ensures\nthe optimality of assortments. Importantly, this sufficient condition captures\ncommonly-used distributions in the assortment optimization literature,\nincluding Multi-Nomial Logit, Markov Chain, Tversky's Elimination by Aspects,\nand mixtures with Independent Demand Models. The takeaway is that unless a firm\nhas a sophisticated model for consumer choice, fixed-price lotteries are no\nbetter than assortments.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 16:12:23 GMT"}, {"version": "v2", "created": "Tue, 8 Jun 2021 13:25:39 GMT"}], "update_date": "2021-06-09", "authors_parsed": [["Ma", "Will", ""]]}, {"id": "2105.10704", "submitter": "Mojtaba Hosseini", "authors": "Mojtaba Hosseini and Vijay V. Vazirani", "title": "Nash-Bargaining-Based Models for Matching Markets, with Implementations\n  and Experimental Results", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper addresses the paucity of models of matching markets, both\none-sided and two-sided, when utility functions of agents are cardinal. The\nclassical Hylland-Zeckhauser scheme \\cite{hylland}, which is the most prominent\nsuch model in economics, can be viewed as corresponding to the linear Fisher\nmodel, which is most elementary model in market equilibria. Although HZ is\nbased on the attractive idea of using a pricing mechanism, from the viewpoint\nof use in applications, it has a serious drawback, namely lack of computational\nefficiency, due to which solving instances of size even 4 or 5 is difficult.\n  We propose a variety of Nash-bargaining-based models, several of which draw\nfrom general equilibrium theory, which has defined a rich collection of market\nmodels that generalize the linear Fisher model in order to address more\nspecialized and realistic situations. The Nash bargaining solution satisfies\nPareto optimality and symmetry and the allocations it yields are remarkably\nfair. Furthermore, since the solution is captured via a convex program, it is\npolynomial time computable. In order to be used in \"industrial grade\"\napplications, we give implementations for these models that are extremely time\nefficient, solving large instances, with $n = 2000$, in one hour on a PC, even\nfor a two-sided matching market.\n  The idea underlying our work has its origins in Vazirani (2012), which viewed\nthe linear case of the Arrow-Debreu market model as a Nash bargaining game and\ngave a combinatorial, polynomial time algorithm for finding allocations via\nthis solution concept, rather than the usual approach of using a pricing\nmechanism.\n", "versions": [{"version": "v1", "created": "Sat, 22 May 2021 12:16:01 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Hosseini", "Mojtaba", ""], ["Vazirani", "Vijay V.", ""]]}, {"id": "2105.10715", "submitter": "Chittaranjan Swain", "authors": "Chittaranjan Swain, Manmath Narayan Sahoo, Anurag Satpathy", "title": "SPATO: A Student Project Allocation Based Task Offloading in IoT-Fog\n  Systems", "comments": "6 pages, 5 figures, accepted for publication in IEEE International\n  Conference on Communications (ICC)-2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Internet of Things (IoT) devices are highly reliant on cloud systems to\nmeet their storage and computational demands. However, due to the remote\nlocation of cloud servers, IoT devices often suffer from intermittent Wide Area\nNetwork (WAN) latency which makes execution of delay-critical IoT applications\ninconceivable. To overcome this, service providers (SPs) often deploy multiple\nfog nodes (FNs) at the network edge that helps in executing offloaded\ncomputations from IoT devices with improved user experience. As the FNs have\nlimited resources, matching IoT services to FNs while ensuring minimum latency\nand energy from an end-user's perspective and maximizing revenue and tasks\nmeeting deadlines from an SP's standpoint is challenging. Therefore in this\npaper, we propose a student project allocation (SPA) based efficient task\noffloading strategy called SPATO that takes into account key parameters from\ndifferent stakeholders. Thorough simulation analysis shows that SPATO is able\nto reduce the offloading energy and latency respectively by 29% and 40% and\nimproves the revenue by 25% with 99.3% of tasks executing within their\ndeadline.\n", "versions": [{"version": "v1", "created": "Sat, 22 May 2021 12:42:50 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Swain", "Chittaranjan", ""], ["Sahoo", "Manmath Narayan", ""], ["Satpathy", "Anurag", ""]]}, {"id": "2105.11097", "submitter": "Ajay Pratap", "authors": "Navneet Taunk, Naveen Kumar Mall, and Ajay Pratap", "title": "Criticality and Utility-aware Fog Computing System for Remote Health\n  Monitoring", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CY eess.SP", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Growing remote health monitoring system allows constant monitoring of the\npatient's condition and performance of preventive and control check-ups outside\nmedical facilities. However, the real-time smart-healthcare application poses a\ndelay constraint that has to be solved efficiently. Fog computing is emerging\nas an efficient solution for such real-time applications. Moreover, different\nmedical centers are getting attracted to the growing IoT-based remote\nhealthcare system in order to make a profit by hiring Fog computing resources.\nHowever, there is a need for an efficient algorithmic model for allocation of\nlimited fog computing resources in the criticality-aware smart-healthcare\nsystem considering the profit of medical centers. Thus, the objective of this\nwork is to maximize the system utility calculated as a linear combination of\nthe profit of the medical center and the loss of patients. To measure profit,\nwe propose a flat-pricing-based model. Further, we propose a swapping-based\nheuristic to maximize the system utility. The proposed heuristic is tested on\nvarious parameters and shown to perform close to the optimal with\ncriticality-awareness in its core. Through extensive simulations, we show that\nthe proposed heuristic achieves an average utility of $96\\%$ of the optimal, in\npolynomial time complexity.\n", "versions": [{"version": "v1", "created": "Mon, 24 May 2021 05:28:06 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Taunk", "Navneet", ""], ["Mall", "Naveen Kumar", ""], ["Pratap", "Ajay", ""]]}, {"id": "2105.11292", "submitter": "Tatsuya Iwase Ph.D.", "authors": "Tatsuya Iwase, Sebastian Stein, Enrico H. Gerding", "title": "A Polynomial-time, Truthful, Individually Rational and Budget Balanced\n  Ridesharing Mechanism", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ridesharing has great potential to improve transportation efficiency while\nreducing congestion and pollution. To realize this potential, mechanisms are\nneeded that allocate vehicles optimally and provide the right incentives to\nriders. However, many existing approaches consider restricted settings (e.g.,\nonly one rider per vehicle or a common origin for all riders). Moreover, naive\napplications of standard approaches, such as the Vickrey-Clarke-Groves or\ngreedy mechanisms, cannot achieve a polynomial-time, truthful, individually\nrational and budget balanced mechanism. To address this, we formulate a general\nridesharing problem and apply mechanism design to develop a novel mechanism\nwhich satisfies all four properties and whose social cost is within 8.6% of the\noptimal on average.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 08:15:26 GMT"}, {"version": "v2", "created": "Thu, 17 Jun 2021 11:32:51 GMT"}], "update_date": "2021-06-21", "authors_parsed": [["Iwase", "Tatsuya", ""], ["Stein", "Sebastian", ""], ["Gerding", "Enrico H.", ""]]}, {"id": "2105.11348", "submitter": "Pranav Garimidi", "authors": "Artem Baklanov, Pranav Garimidi, Vasilis Gkatzelis, Daniel Schoepflin", "title": "PROPm Allocations of Indivisible Goods to Multiple Agents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the classic problem of fairly allocating a set of indivisible goods\namong a group of agents, and focus on the notion of approximate proportionality\nknown as PROPm. Prior work showed that there exists an allocation that\nsatisfies this notion of fairness for instances involving up to five agents,\nbut fell short of proving that this is true in general. We extend this result\nto show that a PROPm allocation is guaranteed to exist for all instances,\nindependent of the number of agents or goods. Our proof is constructive,\nproviding an algorithm that computes such an allocation and, unlike prior work,\nthe running time of this algorithm is polynomial in both the number of agents\nand the number of goods.\n", "versions": [{"version": "v1", "created": "Mon, 24 May 2021 15:34:33 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Baklanov", "Artem", ""], ["Garimidi", "Pranav", ""], ["Gkatzelis", "Vasilis", ""], ["Schoepflin", "Daniel", ""]]}, {"id": "2105.11650", "submitter": "Ambareesh Ravi", "authors": "Ambareesh Ravi, Atharva Gokhale, Anchit Nagwekar", "title": "Using Game Theory to maximize the chance of victory in two-player sports", "comments": "Paper for a course project on Game Theory applications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Game Theory concepts have been successfully applied in a wide variety of\ndomains over the past decade. Sports and games are one of the popular areas of\ngame theory application owing to its merits and benefits in solving complex\nscenarios. With recent advancements in technology, the technical and analytical\nassistance available to players before the match, during game-play and after\nthe match in the form of post-match analysis for any kind of sport has improved\nto a great extent. In this paper, we propose three novel approaches towards the\ndevelopment of a tool that can assist the players by providing detailed\nanalysis of optimal decisions so that the player is well prepared with the most\nappropriate strategy which would produce a favourable result for a given\nopponent's strategy. We also describe how the system changes when we consider\nreal-time game-play wherein the history of the opponent's strategies in the\ncurrent rally is also taken into consideration while suggesting.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2021 03:59:06 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Ravi", "Ambareesh", ""], ["Gokhale", "Atharva", ""], ["Nagwekar", "Anchit", ""]]}, {"id": "2105.11923", "submitter": "Stanis{\\l}aw Szufa", "authors": "Stanis{\\l}aw Szufa, Piotr Faliszewski", "title": "The Complexity of Subelection Isomorphism Problems", "comments": "17 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study extensions of the Election Isomorphism problem, focused on the\nexistence of isomorphic subelections. Specifically, we propose the Subelection\nIsomorphism and the Maximum Common Subelection problems and study their\ncomputational complexity, mostly showing intractability. Additionally, we show\nexperiments indicating that our problems provide meaningful insights into the\nnature of a number of statistical models of elections.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2021 13:27:50 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Szufa", "Stanisław", ""], ["Faliszewski", "Piotr", ""]]}, {"id": "2105.12431", "submitter": "Ioannis Kordonis", "authors": "Ioannis Kordonis, Athanasios-Rafail Lagos, George P. Papavassilopoulos", "title": "Dynamic Games of Social Distancing during an Epidemic: Analysis of\n  Asymmetric Solutions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY math.OC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Individual behaviors play an essential role in the dynamics of transmission\nof infectious diseases, including COVID--19. This paper studies a dynamic game\nmodel that describes the social distancing behaviors during an epidemic,\nassuming a continuum of players and individual infection dynamics. The\nevolution of the players' infection states follows a variant of the well-known\nSIR dynamics. We assume that the players are not sure about their infection\nstate, and thus they choose their actions based on their individually perceived\nprobabilities of being susceptible, infected or removed. The cost of each\nplayer depends both on her infection state and on the contact with others. We\nprove the existence of a Nash equilibrium and characterize Nash equilibria\nusing nonlinear complementarity problems. We then exploit some monotonicity\nproperties of the optimal policies to obtain a reduced-order characterization\nfor Nash equilibrium and reduce its computation to the solution of a\nlow-dimensional optimization problem. It turns out that, even in the symmetric\ncase, where all the players have the same parameters, players may have very\ndifferent behaviors. We finally present some numerical studies that illustrate\nthis interesting phenomenon and investigate the effects of several parameters,\nincluding the players' vulnerability, the time horizon, and the maximum allowed\nactions, on the optimal policies and the players' costs.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2021 09:41:44 GMT"}], "update_date": "2021-05-27", "authors_parsed": [["Kordonis", "Ioannis", ""], ["Lagos", "Athanasios-Rafail", ""], ["Papavassilopoulos", "George P.", ""]]}, {"id": "2105.12954", "submitter": "Gabriele Farina", "authors": "Gabriele Farina, Christian Kroer, Tuomas Sandholm", "title": "Better Regularization for Sequential Decision Spaces: Fast Convergence\n  Rates for Nash, Correlated, and Team Equilibria", "comments": "Accepted for publication at EC21", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study the application of iterative first-order methods to the problem of\ncomputing equilibria of large-scale two-player extensive-form games.\nFirst-order methods must typically be instantiated with a regularizer that\nserves as a distance-generating function for the decision sets of the players.\nFor the case of two-player zero-sum games, the state-of-the-art theoretical\nconvergence rate for Nash equilibrium is achieved by using the dilated entropy\nfunction. In this paper, we introduce a new entropy-based distance-generating\nfunction for two-player zero-sum games, and show that this function achieves\nsignificantly better strong convexity properties than the dilated entropy,\nwhile maintaining the same easily-implemented closed-form proximal mapping.\nExtensive numerical simulations show that these superior theoretical properties\ntranslate into better numerical performance as well.\n  We then generalize our new entropy distance function, as well as general\ndilated distance functions, to the scaled extension operator. The scaled\nextension operator is a way to recursively construct convex sets, which\ngeneralizes the decision polytope of extensive-form games, as well as the\nconvex polytopes corresponding to correlated and team equilibria. By\ninstantiating first-order methods with our regularizers, we develop the first\naccelerated first-order methods for computing correlated equilibra and ex-ante\ncoordinated team equilibria. Our methods have a guaranteed $1/T$ rate of\nconvergence, along with linear-time proximal updates.\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2021 06:10:24 GMT"}], "update_date": "2021-05-28", "authors_parsed": [["Farina", "Gabriele", ""], ["Kroer", "Christian", ""], ["Sandholm", "Tuomas", ""]]}, {"id": "2105.12982", "submitter": "Pieter Kleer", "authors": "Pieter Kleer", "title": "Sampling from the Gibbs Distribution in Congestion Games", "comments": "Accepted at the 22nd ACM Conference on Economics and Computation (EC\n  2021)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Logit dynamics is a form of randomized game dynamics where players have a\nbias towards strategic deviations that give a higher improvement in cost. It is\nused extensively in practice. In congestion (or potential) games, the dynamics\nconverges to the so-called Gibbs distribution over the set of all strategy\nprofiles, when interpreted as a Markov chain. In general, logit dynamics might\nconverge slowly to the Gibbs distribution, but beyond that, not much is known\nabout their algorithmic aspects, nor that of the Gibbs distribution. In this\nwork, we are interested in the following two questions for congestion games: i)\nIs there an efficient algorithm for sampling from the Gibbs distribution? ii)\nIf yes, do there also exist natural randomized dynamics that converges quickly\nto the Gibbs distribution?\n  We first study these questions in extension parallel congestion games, a\nwell-studied special case of symmetric network congestion games. As our main\nresult, we show that there is a simple variation on the logit dynamics (in\nwhich we in addition are allowed to randomly interchange the strategies of two\nplayers) that converges quickly to the Gibbs distribution in such games. This\nanswers both questions above affirmatively. We also address the first question\nfor the class of so-called capacitated $k$-uniform congestion games.\n  To prove our results, we rely on the recent breakthrough work of Anari, Liu,\nOveis-Gharan and Vinzant (2019) concerning the approximate sampling of the base\nof a matroid according to strongly log-concave probability distribution.\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2021 08:00:14 GMT"}], "update_date": "2021-05-28", "authors_parsed": [["Kleer", "Pieter", ""]]}, {"id": "2105.13202", "submitter": "Leon Sering", "authors": "Leon Sering and Laura Vargas Koch and Theresa Ziemke", "title": "Convergence of a Packet Routing Model to Flows Over Time", "comments": null, "journal-ref": null, "doi": "10.1145/3465456.3467626", "report-no": null, "categories": "cs.GT cs.DS math.OC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The mathematical approaches for modeling dynamic traffic can roughly be\ndivided into two categories: discrete packet routing models and continuous flow\nover time models. Despite very vital research activities on models in both\ncategories, the connection between these approaches was poorly understood so\nfar. In this work we build this connection by specifying a (competitive) packet\nrouting model, which is discrete in terms of flow and time, and by proving its\nconvergence to the intensively studied model of flows over time with\ndeterministic queuing. More precisely, we prove that the limit of the\nconvergence process, when decreasing the packet size and time step length in\nthe packet routing model, constitutes a flow over time with multiple\ncommodities. In addition, we show that the convergence result implies the\nexistence of approximate equilibria in the competitive version of the packet\nrouting model. This is of significant interest as exact pure Nash equilibria,\nsimilar to almost all other competitive models, cannot be guaranteed in the\nmulti-commodity setting. Moreover, the introduced packet routing model with\ndeterministic queuing is very application-oriented as it is based on the\nnetwork loading module of the agent-based transport simulation MATSim. As the\npresent work is the first mathematical formalization of this simulation, it\nprovides a theoretical foundation and an environment for provable mathematical\nstatements for MATSim.\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2021 14:50:01 GMT"}], "update_date": "2021-05-28", "authors_parsed": [["Sering", "Leon", ""], ["Koch", "Laura Vargas", ""], ["Ziemke", "Theresa", ""]]}, {"id": "2105.13203", "submitter": "Julien Grand-Cl\\'ement", "authors": "Julien Grand-Cl\\'ement, Christian Kroer", "title": "Conic Blackwell Algorithm: Parameter-Free Convex-Concave Saddle-Point\n  Solving", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We develop new parameter and scale-free algorithms for solving convex-concave\nsaddle-point problems. Our results are based on a new simple regret minimizer,\nthe Conic Blackwell Algorithm$^+$ (CBA$^+$), which attains $O(1/\\sqrt{T})$\naverage regret. Intuitively, our approach generalizes to other decision sets of\ninterest ideas from the Counterfactual Regret minimization (CFR$^+$) algorithm,\nwhich has very strong practical performance for solving sequential games on\nsimplexes. We show how to implement CBA$^+$ for the simplex, $\\ell_{p}$ norm\nballs, and ellipsoidal confidence regions in the simplex, and we present\nnumerical experiments for solving matrix games and distributionally robust\noptimization problems. Our empirical results show that CBA$^+$ is a simple\nalgorithm that outperforms state-of-the-art methods on synthetic data and real\ndata instances, without the need for any choice of step sizes or other\nalgorithmic parameters.\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2021 14:50:31 GMT"}, {"version": "v2", "created": "Thu, 10 Jun 2021 12:27:34 GMT"}], "update_date": "2021-06-11", "authors_parsed": [["Grand-Clément", "Julien", ""], ["Kroer", "Christian", ""]]}, {"id": "2105.13510", "submitter": "Robin Fritsch", "authors": "Robin Fritsch and Roger Wattenhofer", "title": "A Note on Optimal Fees for Constant Function Market Makers", "comments": "11 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We suggest a framework to determine optimal trading fees for constant\nfunction market makers (CFMMs) in order to maximize liquidity provider returns.\nIn a setting of multiple competing liquidity pools, we show that no race to the\nbottom occurs, but instead pure Nash equilibria of optimal fees exist. We\ntheoretically prove the existence of these equilibria for pools using the\nconstant product trade function used in popular CFMMs like Uniswap. We also\nnumerically compute the equilibria for a number of examples and discuss the\neffects the equilibrium fees have on capital allocation among pools. Finally,\nwe use our framework to compute optimal fees for real world pools using past\ntrade data.\n", "versions": [{"version": "v1", "created": "Fri, 28 May 2021 00:01:36 GMT"}], "update_date": "2021-05-31", "authors_parsed": [["Fritsch", "Robin", ""], ["Wattenhofer", "Roger", ""]]}, {"id": "2105.13556", "submitter": "Carlos Carrion", "authors": "Carlos Carrion, Zenan Wang, Harikesh Nair, Xianghong Luo, Yulin Lei,\n  Xiliang Lin, Wenlong Chen, Qiyu Hu, Changping Peng, Yongjun Bao and Weipeng\n  Yan", "title": "Blending Advertising with Organic Content in E-Commerce: A Virtual Bids\n  Optimization Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In e-commerce platforms, sponsored and non-sponsored content are jointly\ndisplayed to users and both may interactively influence their engagement\nbehavior. The former content helps advertisers achieve their marketing goals\nand provides a stream of ad revenue to the platform. The latter content\ncontributes to users' engagement with the platform, which is key to its\nlong-term health. A burning issue for e-commerce platform design is how to\nblend advertising with content in a way that respects these interactions and\nbalances these multiple business objectives. This paper describes a system\ndeveloped for this purpose in the context of blending personalized sponsored\ncontent with non-sponsored content on the product detail pages of JD.COM, an\ne-commerce company. This system has three key features: (1) Optimization of\nmultiple competing business objectives through a new virtual bids approach and\nthe expressiveness of the latent, implicit valuation of the platform for the\nmultiple objectives via these virtual bids. (2) Modeling of users' click\nbehavior as a function of their characteristics, the individual characteristics\nof each sponsored content and the influence exerted by other sponsored and\nnon-sponsored content displayed alongside through a deep learning approach; (3)\nConsideration of externalities in the allocation of ads, thereby making it\ndirectly compatible with a Vickrey-Clarke-Groves (VCG) auction scheme for the\ncomputation of payments in the presence of these externalities. The system is\ncurrently deployed and serving all traffic through JD.COM's mobile application.\nExperiments demonstrating the performance and advantages of the system are\npresented.\n", "versions": [{"version": "v1", "created": "Fri, 28 May 2021 02:27:31 GMT"}], "update_date": "2021-05-31", "authors_parsed": [["Carrion", "Carlos", ""], ["Wang", "Zenan", ""], ["Nair", "Harikesh", ""], ["Luo", "Xianghong", ""], ["Lei", "Yulin", ""], ["Lin", "Xiliang", ""], ["Chen", "Wenlong", ""], ["Hu", "Qiyu", ""], ["Peng", "Changping", ""], ["Bao", "Yongjun", ""], ["Yan", "Weipeng", ""]]}, {"id": "2105.13729", "submitter": "Rohit Vaish", "authors": "Telikepalli Kavitha and Rohit Vaish", "title": "Matchings and Copeland's Method", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Given a graph $G = (V,E)$ where every vertex has weak preferences over its\nneighbors, we consider the problem of computing an optimal matching as per\nagent preferences. The classical notion of optimality in this setting is\nstability. However stable matchings, and more generally, popular matchings need\nnot exist when $G$ is non-bipartite. Unlike popular matchings, Copeland winners\nalways exist in any voting instance -- we study the complexity of computing a\nmatching that is a Copeland winner and show there is no polynomial-time\nalgorithm for this problem unless $\\mathsf{P} = \\mathsf{NP}$.\n  We introduce a relaxation of both popular matchings and Copeland winners\ncalled semi-Copeland winners. These are matchings with Copeland score at least\n$\\mu/2$, where $\\mu$ is the total number of matchings in $G$; the maximum\npossible Copeland score is $(\\mu-1/2)$. We show a fully polynomial-time\nrandomized approximation scheme to compute a matching with Copeland score at\nleast $\\mu/2\\cdot(1-\\varepsilon)$ for any $\\varepsilon > 0$.\n", "versions": [{"version": "v1", "created": "Fri, 28 May 2021 10:50:47 GMT"}], "update_date": "2021-05-31", "authors_parsed": [["Kavitha", "Telikepalli", ""], ["Vaish", "Rohit", ""]]}, {"id": "2105.13870", "submitter": "Konstantin Zabarnyi", "authors": "Yakov Babichenko, Inbal Talgam-Cohen, Haifeng Xu, Konstantin Zabarnyi", "title": "Regret-Minimizing Bayesian Persuasion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We study a Bayesian persuasion setting with binary actions (adopt and reject)\nfor Receiver. We examine the following question - how well can Sender perform,\nin terms of persuading Receiver to adopt, when ignorant of Receiver's utility?\nWe take a robust (adversarial) approach to study this problem; that is, our\ngoal is to design signaling schemes for Sender that perform well for all\npossible Receiver's utilities. We measure performance of signaling schemes via\nthe notion of (additive) regret: the difference between Sender's hypothetically\noptimal utility had she known Receiver's utility function and her actual\nutility induced by the given scheme.\n  On the negative side, we show that if Sender has no knowledge at all about\nReceiver's utility, then Sender has no signaling scheme that performs robustly\nwell. On the positive side, we show that if Sender only knows Receiver's\nordinal preferences of the states of nature - i.e., Receiver's utility upon\nadoption is monotonic as a function of the state - then Sender can guarantee a\nsurprisingly low regret even when the number of states tends to infinity. In\nfact, we exactly pin down the minimum regret value that Sender can guarantee in\nthis case, which turns out to be at most 1/e. We further show that such\npositive results are not possible under the alternative performance measure of\na multiplicative approximation ratio by proving that no constant ratio can be\nguaranteed even for monotonic Receiver's utility; this may serve to demonstrate\nthe merits of regret as a robust performance measure that is not too\npessimistic. Finally, we analyze an intermediate setting in between the\nno-knowledge and the ordinal-knowledge settings.\n", "versions": [{"version": "v1", "created": "Fri, 28 May 2021 14:26:24 GMT"}], "update_date": "2021-05-31", "authors_parsed": [["Babichenko", "Yakov", ""], ["Talgam-Cohen", "Inbal", ""], ["Xu", "Haifeng", ""], ["Zabarnyi", "Konstantin", ""]]}, {"id": "2105.14262", "submitter": "Yu Su", "authors": "Guocheng Liao, Yu Su, Juba Ziani, Adam Wierman, Jianwei Huang", "title": "The Privacy Paradox and Optimal Bias-Variance Trade-offs in Data\n  Acquisition", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While users claim to be concerned about privacy, often they do little to\nprotect their privacy in their online actions. One prominent explanation for\nthis \"privacy paradox\" is that when an individual shares her data, it is not\njust her privacy that is compromised; the privacy of other individuals with\ncorrelated data is also compromised. This information leakage encourages\noversharing of data and significantly impacts the incentives of individuals in\nonline platforms. In this paper, we study the design of mechanisms for data\nacquisition in settings with information leakage and verifiable data. We design\nan incentive compatible mechanism that optimizes the worst-case trade-off\nbetween bias and variance of the estimation subject to a budget constraint,\nwhere the worst-case is over the unknown correlation between costs and data.\nAdditionally, we characterize the structure of the optimal mechanism in closed\nform and study monotonicity and non-monotonicity properties of the marketplace.\n", "versions": [{"version": "v1", "created": "Sat, 29 May 2021 09:44:16 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Liao", "Guocheng", ""], ["Su", "Yu", ""], ["Ziani", "Juba", ""], ["Wierman", "Adam", ""], ["Huang", "Jianwei", ""]]}, {"id": "2105.14388", "submitter": "Paul G\\\"olz", "authors": "Narges Ahani, Paul G\\\"olz, Ariel D. Procaccia, Alexander Teytelboym\n  and Andrew C. Trapp", "title": "Dynamic Placement in Refugee Resettlement", "comments": null, "journal-ref": null, "doi": "10.1145/3465456.3467534", "report-no": null, "categories": "cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Employment outcomes of resettled refugees depend strongly on where they are\nplaced inside the host country. While the United States sets refugee capacities\nfor communities on an annual basis, refugees arrive and must be placed over the\ncourse of the year. We introduce a dynamic allocation system based on two-stage\nstochastic programming to improve employment outcomes. Our algorithm is able to\nachieve over 98 percent of the hindsight-optimal employment compared to under\n90 percent of current greedy-like approaches. This dramatic improvement\npersists even when we incorporate a vast array of practical features of the\nrefugee resettlement process including indivisible families, batching, and\nuncertainty with respect to the number of future arrivals. Our algorithm is now\npart of the Annie MOORE optimization software used by a leading American\nrefugee resettlement agency.\n", "versions": [{"version": "v1", "created": "Sat, 29 May 2021 23:35:41 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Ahani", "Narges", ""], ["Gölz", "Paul", ""], ["Procaccia", "Ariel D.", ""], ["Teytelboym", "Alexander", ""], ["Trapp", "Andrew C.", ""]]}, {"id": "2105.14998", "submitter": "Elisheva Shamash", "authors": "Tal Alon, Ron Lavi, Elisheva S. Shamash, Inbal Talgam-Cohen", "title": "Incomplete Information VCG Contracts for Common Agency", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We study contract design for welfare maximization in the well known \"common\nagency\" model of [Bernheim and Whinston, 1986]. This model combines the\nchallenges of coordinating multiple principals with the fundamental challenge\nof contract design: that principals have incomplete information of the agent's\nchoice of action. Motivated by the significant social inefficiency of standard\ncontracts for such settings (which we formally quantify using a price of\nanarchy/stability analysis), we investigate whether and how a recent toolbox\ndeveloped for the first set of challenges under a complete-information\nassumption, VCG contracts [Lavi and Shamash, 2019], can be extended to\nincomplete information.\n  We define and characterize the class of \"incomplete information VCG contracts\n(IIVCG)\", and show it is the unique class guaranteeing truthfulness of the\nprincipals and welfare maximization by the agent. Our results reveal an\ninherent tradeoff between two important properties required to ensure\nparticipation in the contract: individual rationality (for the principals) and\nlimited liability (for the agent). We design a polynomial-time algorithm for\ndetermining whether a setting has an IIVCG contract with both properties. As\nour main result we design a polynomial-time \"algorithmic IIVCG\" contract: given\nvaluation reports from the principals it returns, if possible for the setting,\na payment scheme for the agent that constitutes an IIVCG contract with all\ndesired properties. We also give a sufficient graph-theoretic condition on the\npopulation of principals that ensures the existence of such an IIVCG contract.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 14:32:32 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Alon", "Tal", ""], ["Lavi", "Ron", ""], ["Shamash", "Elisheva S.", ""], ["Talgam-Cohen", "Inbal", ""]]}, {"id": "2105.15032", "submitter": "Alexander Braun", "authors": "Alexander Braun and Thomas Kesselheim", "title": "Truthful Mechanisms for Two-Sided Markets via Prophet Inequalities", "comments": "An extended abstract will appear at EC 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We design novel mechanisms for welfare-maximization in two-sided markets.\nThat is, there are buyers willing to purchase items and sellers holding items\ninitially, both acting rationally and strategically in order to maximize\nutility. Our mechanisms are designed based on a powerful correspondence between\ntwo-sided markets and prophet inequalities. They satisfy individual\nrationality, dominant-strategy incentive compatibility, budget-balance\nconstraints and give constant-factor approximations to the optimal social\nwelfare.\n  We improve previous results in several settings: Our main focus is on matroid\ndouble auctions, where the set of buyers who obtain an item needs to be\nindependent in a matroid. We construct two mechanisms, the first being a\n$1/3$-approximation of the optimal social welfare satisfying strong\nbudget-balance and requiring the agents to trade in a customized order, the\nsecond being a $1/2$-approximation, weakly budget-balanced and able to deal\nwith online arrival determined by an adversary. In addition, we construct\nconstant-factor approximations in two-sided markets when buyers need to fulfill\na knapsack constraint. Also, in combinatorial double auctions, where buyers\nhave valuation functions over item bundles instead of being interested in only\none item, using similar techniques, we design a mechanism which is a\n$1/2$-approximation of the optimal social welfare, strongly budget-balanced and\ncan deal with online arrival of agents in an adversarial order.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 15:12:27 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Braun", "Alexander", ""], ["Kesselheim", "Thomas", ""]]}, {"id": "2105.15186", "submitter": "Shicong Cen", "authors": "Shicong Cen, Yuting Wei, Yuejie Chi", "title": "Fast Policy Extragradient Methods for Competitive Games with Entropy\n  Regularization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.IT cs.LG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the problem of computing the equilibrium of\ncompetitive games, which is often modeled as a constrained saddle-point\noptimization problem with probability simplex constraints. Despite recent\nefforts in understanding the last-iterate convergence of extragradient methods\nin the unconstrained setting, the theoretical underpinnings of these methods in\nthe constrained settings, especially those using multiplicative updates, remain\nhighly inadequate, even when the objective function is bilinear. Motivated by\nthe algorithmic role of entropy regularization in single-agent reinforcement\nlearning and game theory, we develop provably efficient extragradient methods\nto find the quantal response equilibrium (QRE) -- which are solutions to\nzero-sum two-player matrix games with entropy regularization -- at a linear\nrate. The proposed algorithms can be implemented in a decentralized manner,\nwhere each player executes symmetric and multiplicative updates iteratively\nusing its own payoff without observing the opponent's actions directly. In\naddition, by controlling the knob of entropy regularization, the proposed\nalgorithms can locate an approximate Nash equilibrium of the unregularized\nmatrix game at a sublinear rate without assuming the Nash equilibrium to be\nunique. Our methods also lead to efficient policy extragradient algorithms for\nsolving entropy-regularized zero-sum Markov games at a linear rate. All of our\nconvergence rates are nearly dimension-free, which are independent of the size\nof the state and action spaces up to logarithm factors, highlighting the\npositive role of entropy regularization for accelerating convergence.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 17:51:15 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Cen", "Shicong", ""], ["Wei", "Yuting", ""], ["Chi", "Yuejie", ""]]}]