[{"id": "0804.2273", "submitter": "Carl Lagoze", "authors": "Carl Lagoze, Herbert Van de Sompel, Michael L. Nelson, Simeon Warner,\n  Robert Sanderson, Pete Johnston", "title": "Object Re-Use & Exchange: A Resource-Centric Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The OAI Object Reuse and Exchange (OAI-ORE) framework recasts the\nrepository-centric notion of digital object to a bounded aggregation of Web\nresources. In this manner, digital library content is more integrated with the\nWeb architecture, and thereby more accessible to Web applications and clients.\nThis generalized notion of an aggregation that is independent of repository\ncontainment conforms more closely with notions in eScience and eScholarship,\nwhere content is distributed across multiple services and databases. We provide\na motivation for the OAI-ORE project, review previous interoperability efforts,\ndescribe draft ORE specifications and report on promising results from early\nexperimentation that illustrate improved interoperability and reuse of digital\nobjects.\n", "versions": [{"version": "v1", "created": "Mon, 14 Apr 2008 21:02:00 GMT"}], "update_date": "2008-04-16", "authors_parsed": [["Lagoze", "Carl", ""], ["Van de Sompel", "Herbert", ""], ["Nelson", "Michael L.", ""], ["Warner", "Simeon", ""], ["Sanderson", "Robert", ""], ["Johnston", "Pete", ""]]}, {"id": "0804.2701", "submitter": "Travis C. Brooks", "authors": "Anne Gentil-Beccot, Salvatore Mele, Annette Holtkamp, Heath B.\n  O'Connell, Travis C. Brooks", "title": "Information Resources in High-Energy Physics: Surveying the Present\n  Landscape and Charting the Future Course", "comments": "Removed internal pdf links broken on some pdf viewers", "journal-ref": "J.Am.Soc.Inf.Sci.60:150-160,2009", "doi": "10.1002/asi.20944", "report-no": "CERN-OPEN-2008-010,DESY-08-040,FERMILAB-PUB-08-077-BSS,SLAC-PUB-13199", "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Access to previous results is of paramount importance in the scientific\nprocess. Recent progress in information management focuses on building\ne-infrastructures for the optimization of the research workflow, through both\npolicy-driven and user-pulled dynamics. For decades, High-Energy Physics (HEP)\nhas pioneered innovative solutions in the field of information management and\ndissemination. In light of a transforming information environment, it is\nimportant to assess the current usage of information resources by researchers\nand HEP provides a unique test-bed for this assessment. A survey of about 10%\nof practitioners in the field reveals usage trends and information needs.\nCommunity-based services, such as the pioneering arXiv and SPIRES systems,\nlargely answer the need of the scientists, with a limited but increasing\nfraction of younger users relying on Google. Commercial services offered by\npublishers or database vendors are essentially unused in the field. The survey\noffers an insight into the most important features that users require to\noptimize their research workflow. These results inform the future evolution of\ninformation management in HEP and, as these researchers are traditionally\n``early adopters'' of innovation in scholarly communication, can inspire\ndevelopments of disciplinary repositories serving other communities.\n", "versions": [{"version": "v1", "created": "Wed, 16 Apr 2008 23:01:51 GMT"}, {"version": "v2", "created": "Tue, 22 Apr 2008 16:35:02 GMT"}], "update_date": "2009-01-08", "authors_parsed": [["Gentil-Beccot", "Anne", ""], ["Mele", "Salvatore", ""], ["Holtkamp", "Annette", ""], ["O'Connell", "Heath B.", ""], ["Brooks", "Travis C.", ""]]}, {"id": "0804.3791", "submitter": "Johan Bollen", "authors": "Johan Bollen, Herbert Van de Sompel and Marko A. Rodriguez", "title": "Towards Usage-based Impact Metrics: - First Results from the MESUR\n  Project", "comments": "Published in Proceedings of the Joint Conference on Digital Libraries\n  2008 (JCDL08), June 16, 2008, Pittsburgh, Pennsylvania, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scholarly usage data holds the potential to be used as a tool to study the\ndynamics of scholarship in real time, and to form the basis for the definition\nof novel metrics of scholarly impact. However, the formal groundwork to\nreliably and validly exploit usage data is lacking, and the exact nature,\nmeaning and applicability of usage-based metrics is poorly understood. The\nMESUR project funded by the Andrew W. Mellon Foundation constitutes a\nsystematic effort to define, validate and cross-validate a range of usage-based\nmetrics of scholarly impact. MESUR has collected nearly 1 billion usage events\nas well as all associated bibliographic and citation data from significant\npublishers, aggregators and institutional consortia to construct a large-scale\nusage data reference set. This paper describes some major challenges related to\naggregating and processing usage data, and discusses preliminary results\nobtained from analyzing the MESUR reference data set. The results confirm the\nintrinsic value of scholarly usage data, and support the feasibility of\nreliable and valid usage-based metrics of scholarly impact.\n", "versions": [{"version": "v1", "created": "Wed, 23 Apr 2008 19:23:44 GMT"}], "update_date": "2008-04-24", "authors_parsed": [["Bollen", "Johan", ""], ["Van de Sompel", "Herbert", ""], ["Rodriguez", "Marko A.", ""]]}]