[{"id": "1308.0237", "submitter": "Scott A. Hale", "authors": "Helen Z. Margetts, Peter John, Scott A. Hale, St\\'ephane Reissfelder", "title": "Leadership without Leaders? Starters and Followers in Online Collective\n  Action", "comments": null, "journal-ref": null, "doi": "10.1111/1467-9248.12075", "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet has been ascribed a prominent role in collective action,\nparticularly with widespread use of social media. But most mobilisations fail.\nWe investigate the characteristics of those few mobilisations that succeed and\nhypothesise that the presence of 'starters' with low thresholds for joining\nwill determine whether a mobilisation achieves success, as suggested by\nthreshold models. We use experimental data from public good games to identify\npersonality types associated with willingness to start in collective action. We\nfind a significant association between both extraversion and internal locus of\ncontrol, and willingness to start, while agreeableness is associated with a\ntendency to follow. Rounds without at least a minimum level of extraversion\namong the participants are unlikely to be funded, providing some support for\nthe hypothesis.\n", "versions": [{"version": "v1", "created": "Thu, 1 Aug 2013 15:08:30 GMT"}], "update_date": "2014-08-19", "authors_parsed": [["Margetts", "Helen Z.", ""], ["John", "Peter", ""], ["Hale", "Scott A.", ""], ["Reissfelder", "Stéphane", ""]]}, {"id": "1308.0239", "submitter": "Taha Yasseri", "authors": "Taha Yasseri, Scott A. Hale, and Helen Margetts", "title": "Modeling the Rise in Internet-based Petitions", "comments": "Submitted to EPJ Data Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CY cs.HC cs.SI physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Contemporary collective action, much of which involves social media and other\nInternet-based platforms, leaves a digital imprint which may be harvested to\nbetter understand the dynamics of mobilization. Petition signing is an example\nof collective action which has gained in popularity with rising use of social\nmedia and provides such data for the whole population of petition signatories\nfor a given platform. This paper tracks the growth curves of all 20,000\npetitions to the UK government over 18 months, analyzing the rate of growth and\noutreach mechanism. Previous research has suggested the importance of the first\nday to the ultimate success of a petition, but has not examined early growth\nwithin that day, made possible here through hourly resolution in the data. The\nanalysis shows that the vast majority of petitions do not achieve any measure\nof success; over 99 percent fail to get the 10,000 signatures required for an\nofficial response and only 0.1 percent attain the 100,000 required for a\nparliamentary debate. We analyze the data through a multiplicative process\nmodel framework to explain the heterogeneous growth of signatures at the\npopulation level. We define and measure an average outreach factor for\npetitions and show that it decays very fast (reducing to 0.1% after 10 hours).\nAfter 24 hours, a petition's fate is virtually set. The findings seem to\nchallenge conventional analyses of collective action from economics and\npolitical science, where the production function has been assumed to follow an\nS-shaped curve.\n", "versions": [{"version": "v1", "created": "Thu, 1 Aug 2013 15:24:15 GMT"}, {"version": "v2", "created": "Fri, 8 Nov 2013 01:10:38 GMT"}, {"version": "v3", "created": "Thu, 14 Aug 2014 14:12:25 GMT"}], "update_date": "2014-08-15", "authors_parsed": [["Yasseri", "Taha", ""], ["Hale", "Scott A.", ""], ["Margetts", "Helen", ""]]}, {"id": "1308.0309", "submitter": "Przemyslaw Grabowicz Mr", "authors": "Przemyslaw A. Grabowicz, Luca Maria Aiello, Filippo Menczer", "title": "Fast filtering and animation of large dynamic networks", "comments": "6 figures, 2 tables", "journal-ref": "EPJ Data Science, Volume 3, Issue 1, 2014", "doi": "10.1140/epjds/s13688-014-0027-8", "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Detecting and visualizing what are the most relevant changes in an evolving\nnetwork is an open challenge in several domains. We present a fast algorithm\nthat filters subsets of the strongest nodes and edges representing an evolving\nweighted graph and visualize it by either creating a movie, or by streaming it\nto an interactive network visualization tool. The algorithm is an approximation\nof exponential sliding time-window that scales linearly with the number of\ninteractions. We compare the algorithm against rectangular and exponential\nsliding time-window methods. Our network filtering algorithm: i) captures\npersistent trends in the structure of dynamic weighted networks, ii) smoothens\ntransitions between the snapshots of dynamic network, and iii) uses limited\nmemory and processor time. The algorithm is publicly available as open-source\nsoftware.\n", "versions": [{"version": "v1", "created": "Thu, 1 Aug 2013 19:29:28 GMT"}, {"version": "v2", "created": "Tue, 4 Nov 2014 11:32:18 GMT"}], "update_date": "2014-11-05", "authors_parsed": [["Grabowicz", "Przemyslaw A.", ""], ["Aiello", "Luca Maria", ""], ["Menczer", "Filippo", ""]]}, {"id": "1308.0503", "submitter": "Ehirim Henry mr", "authors": "Ehirim Henry", "title": "The Effects Of Computerizing Banking Operations", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Computerizing banking operation has a far-reaching consequences,both\npositively and negatively.But here,i have been able to deal with both effects\nand proffer solutions on the best way to go about computerizing banking\noperations.\n", "versions": [{"version": "v1", "created": "Thu, 1 Aug 2013 12:10:15 GMT"}], "update_date": "2013-08-05", "authors_parsed": [["Henry", "Ehirim", ""]]}, {"id": "1308.0683", "submitter": "Scott A. Hale", "authors": "Mark Graham, Scott A. Hale, and Devin Gaffney", "title": "Where in the World are You? Geolocation and Language Identification in\n  Twitter", "comments": null, "journal-ref": null, "doi": "10.1080/00330124.2014.907699", "report-no": null, "categories": "cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The movements of ideas and content between locations and languages are\nunquestionably crucial concerns to researchers of the information age, and\nTwitter has emerged as a central, global platform on which hundreds of millions\nof people share knowledge and information. A variety of research has attempted\nto harvest locational and linguistic metadata from tweets in order to\nunderstand important questions related to the 300 million tweets that flow\nthrough the platform each day. However, much of this work is carried out with\nonly limited understandings of how best to work with the spatial and linguistic\ncontexts in which the information was produced. Furthermore, standard,\nwell-accepted practices have yet to emerge. As such, this paper studies the\nreliability of key methods used to determine language and location of content\nin Twitter. It compares three automated language identification packages to\nTwitter's user interface language setting and to a human coding of languages in\norder to identify common sources of disagreement. The paper also demonstrates\nthat in many cases user-entered profile locations differ from the physical\nlocations users are actually tweeting from. As such, these open-ended,\nuser-generated, profile locations cannot be used as useful proxies for the\nphysical locations from which information is published to Twitter.\n", "versions": [{"version": "v1", "created": "Sat, 3 Aug 2013 11:06:58 GMT"}], "update_date": "2014-08-19", "authors_parsed": [["Graham", "Mark", ""], ["Hale", "Scott A.", ""], ["Gaffney", "Devin", ""]]}, {"id": "1308.0725", "submitter": "D P Acharjya Ph.D", "authors": "Debi Prasanna Acharjya and Debarati Bhattacharjee", "title": "A Rough Computing based Performance Evaluation Approach for Educational\n  Institutions", "comments": "18 pages", "journal-ref": "International Journal of Software Engineering and Its\n  Applications, Vol. 7, No. 4, July, 2013", "doi": null, "report-no": null, "categories": "cs.CY cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Performance evaluation of various organizations especially educational\ninstitutions is a very important area of research and needs to be cultivated\nmore. In this paper, we propose a performance evaluation for educational\ninstitutions using rough set on fuzzy approximation spaces with ordering rules\nand information entropy. In order to measure the performance of educational\ninstitutions, we construct an evaluation index system. Rough set on fuzzy\napproximation spaces with ordering is applied to explore the evaluation index\ndata of each level. Furthermore, the concept of information entropy is used to\ndetermine the weighting coefficients of evaluation indexes. Also, we find the\nmost important indexes that influence the weighting coefficients. The proposed\napproach is validated and shows the practical viability. Moreover, the proposed\napproach can be applicable to any organizations.\n", "versions": [{"version": "v1", "created": "Sat, 3 Aug 2013 17:14:02 GMT"}], "update_date": "2013-08-06", "authors_parsed": [["Acharjya", "Debi Prasanna", ""], ["Bhattacharjee", "Debarati", ""]]}, {"id": "1308.1042", "submitter": "Kafui Monu Dr.", "authors": "Kafui Monu and Paul Ralph", "title": "Beyond Gamification: Implications of Purposeful Games for the\n  Information Systems Discipline", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Gamification is an emerging design principle for information systems where\ngame design elements are applied to non-game contexts. IS researchers have\nsuggested that the IS discipline must study this area but there are other\napplications such as serious games, and simulations that also use games in\nnon-game contexts. Specifically, the management field has been using games and\nsimulations for years and these applications are now being supported by\ninformation systems. We propose in this paper that we must think beyond\ngamification, towards other uses of games in non-gaming contexts, which we call\npurposeful gaming.\n  In this paper we identify how the IS discipline can adapt to purposeful\ngaming. Specifically, we show how IT artifacts, IS design, and IS theories can\nbe used in the purposeful gaming area. We also provide three conceptual\ndimensions of purposeful gaming that can aid IS practitioners and researchers\nto classify and understand purposeful games.\n", "versions": [{"version": "v1", "created": "Fri, 2 Aug 2013 16:08:31 GMT"}], "update_date": "2013-08-06", "authors_parsed": [["Monu", "Kafui", ""], ["Ralph", "Paul", ""]]}, {"id": "1308.1158", "submitter": "Peter Gloor", "authors": "Peter A. Gloor, Maria Paasivaara", "title": "COINs change leaders - Lessons Learned from a Distributed Course", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/05", "categories": "cs.CY cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we analyze the communication network of 50 students from five\nuniversities in three countries participating in a joint course on\nCollaborative Innovation Networks (COINs). Students formed ten teams.\nInteraction variables calculated from the e-mail archive of individual team\nmembers predict the level of creativity of the team. Oscillating leadership,\nwhere members switch between central and peripheral roles is the best predictor\nof creativity, it is complemented by the variance in the amount of sending or\nreceiving information, and by answering quickly, and positive language. We\nverify our automatically generated creativity metrics with interviews.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 02:47:36 GMT"}], "update_date": "2013-08-07", "authors_parsed": [["Gloor", "Peter A.", ""], ["Paasivaara", "Maria", ""]]}, {"id": "1308.1162", "submitter": "Peter Gloor", "authors": "Stori Hybbeneth, Dirk Brunnberg, Peter A. Gloor", "title": "Increasing Knowledge Worker Efficiency through a \"Virtual Mirror\" of the\n  Social Network", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/12", "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a case study describing the combination of manual\nsurvey-based and e-mail-based social network analysis. The goal of the project\nwas to increase collaboration efficiency in a team of consultants of a major\nhigh tech manufacturer. By analyzing the social network of a team of 42\nconsultants and comparing it with their utilization as the dependent variable,\ntheir efficiency in working together was improved in various way by bridging\nstructure holes and eliminating bottlenecks, reducing stress for overburdened\nindividuals, connecting isolated individuals and identifying the best network\nstructures for high utilization and increased job satisfaction.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 02:59:00 GMT"}], "update_date": "2013-08-07", "authors_parsed": [["Hybbeneth", "Stori", ""], ["Brunnberg", "Dirk", ""], ["Gloor", "Peter A.", ""]]}, {"id": "1308.1164", "submitter": "Peter Gloor", "authors": "Dirk Brunberg, Peter A. Gloor, Gianni Giacomelli", "title": "Predicting Client Satisfaction through (E-Mail) Network Analysis: The\n  Communication Score Card", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/13", "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study seeks to better understand the network characteristics of client\nsupport teams by analyzing the teams' e-mail communication networks and\ncomparing it to client organization's satisfaction. In collaboration with a\nlarge service provider we studied the impact of network properties on the\nsatisfaction of client organizations. In particular, we found that social\nnetwork metrics correlate with client satisfaction as measured by Net Promoter\nScore (NPS). A Communication Score Card is suggested as a dashboard to\ncontinuously measure client satisfaction, illustrating that data-driven\nanalysis might help improving service providers' service quality management.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 03:02:44 GMT"}], "update_date": "2013-08-07", "authors_parsed": [["Brunberg", "Dirk", ""], ["Gloor", "Peter A.", ""], ["Giacomelli", "Gianni", ""]]}, {"id": "1308.1168", "submitter": "Peter Gloor", "authors": "Gaetano R. Lotrecchiano", "title": "Role and Discipline Relationships in a Transdisciplinary Biomedical\n  Team: Structuration, Values Override and Context Scaffolding", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/04", "categories": "cs.CY cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Though accepted that \"team science\" is needed to tackle and conquer the\nhealth problems that are plaguing our society significant empirical evidence of\nteam mechanisms and functional dynamics is still lacking in abundance. Through\ngrounded methods the relationship between scientific disciplines and team roles\nwas observed in a United States National Institutes of Health-funded (NIH)\nresearch consortium. Interviews and the Organizational Culture Assessment\nInstrument (OCAI) were employed.. Findings show strong role and discipline\nidiosyncrasies that when viewed separately provide different insights into team\nfunctioning and change receptivity. When considered simultaneously,\nvalue-latent characteristics emerged showing self-perceived contributions to\nthe team. This micro/meso analysis suggests that individual participation in\nteam level interactions can inform the structuration of roles and disciplines\nin an attempt to tackle macro level problems.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 03:13:36 GMT"}], "update_date": "2013-08-07", "authors_parsed": [["Lotrecchiano", "Gaetano R.", ""]]}, {"id": "1308.1175", "submitter": "Peter Gloor", "authors": "Tomoki Furukawazono, Shota Seshimo, Daiki Muramatsu, Takashi Iba", "title": "Designing a Pattern Language For Surviving Earthquakes", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/17", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we proposed the Survival Language, a pattern language to\nsupport survival when a catastrophic earthquake occurs. This proposal comes\nfrom the problem that the tragedies of earthquakes are repeated, because\nknowledge and wisdom on how to prepare for an earthquake and what to do during\nan earthquake have not been passed down sufficiently. This paper presented the\nfour patterns of the Survival Language: \"Daily Use of Reserves,\" \"Life over\nFurniture,\" \"Evacuation Initiator,\" and \"Kick Signal.\" In addition, we\ndescribed that the Survival Language is created and used by collaborations\nbecause a pattern language has been a tool for collaboration since it was\npresented by Christopher Alexander.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 03:38:40 GMT"}], "update_date": "2013-08-07", "authors_parsed": [["Furukawazono", "Tomoki", ""], ["Seshimo", "Shota", ""], ["Muramatsu", "Daiki", ""], ["Iba", "Takashi", ""]]}, {"id": "1308.1176", "submitter": "Peter Gloor", "authors": "Jorge Fabrega, Javier Sajuria", "title": "The Emergence of Political Discourse on Digital Networks: The Case of\n  the Occupy Movement", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/01", "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How does political discourse spread in digital networks? Can we empirically\ntest if certain conceptual frames of social movements have a correlate on their\nonline discussion networks? Through an analysis of the Twitter data from the\nOccupy movement, this paper describes the formation of political discourse over\ntime. Building on a previous set of concepts - derived from theoretical\ndiscussions about the movement and its roots - we analyse the data to observe\nwhen those concepts start to appear within the networks, who are those Twitter\nusers responsible for them, and what are the patterns through which those\nconcepts spread. Preliminary evidence shows that, although there are some signs\nof opportunistic behaviour among activists, most of them are central nodes from\nthe onset of the network, and shape the discussions across time. These central\nactivists do not only start the conversations around given frames, but also\nsustain over time and become key members of the network. From here, we aim to\nprovide a thorough account of the \"travel\" of political discourse, and the\ncorrelate of online conversational networks with theoretical accounts of the\nmovement.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 03:43:14 GMT"}], "update_date": "2013-08-07", "authors_parsed": [["Fabrega", "Jorge", ""], ["Sajuria", "Javier", ""]]}, {"id": "1308.1178", "submitter": "Peter Gloor", "authors": "Takashi Iba", "title": "Pattern Languages as Media for the Creative Society", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/07", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes new languages for basic skills in the Creative Society,\nwhere people create their own goods, tools, concepts, knowledge, and mechanisms\nwith their own hands: the skills of learning, presentation, and collaboration.\nThese languages are written as a pattern language, which is a way of describing\nthe tacit practical knowledge. In this paper, a new type of pattern languages\nare proposed as \"Pattern Languages 3.0\" and three examples are introduced:\nLearning Patterns, Collaboration Patterns, and Presentation Patterns. By\nanalyzing the functions with the social systems theory and the creative systems\ntheory, pattern languages are considered as communication media and discovery\nmedia.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 03:47:38 GMT"}], "update_date": "2013-08-07", "authors_parsed": [["Iba", "Takashi", ""]]}, {"id": "1308.1281", "submitter": "Ko Matsuzuka", "authors": "Ko Matsuzuka, Taichi Isaku, Satoshi Nishina, Takashi Iba", "title": "Global Life Patterns: A Methodology for Designing a Personal Global Life", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/08", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose the Global Life Patterns, a methodology to support\npeople to maintain individuality and design their own actions in respect to the\n\"globalizing\" society - a Global Life. Today, globalization requires each\nperson to maintain individuality in respect to Globalization. Because methods\nto acquire such ability are tacit, a clarified methodology to live a Global\nLife is needed.This methodology is based on the format of a Pattern Language -\nspecifically, this methodology is in the format of the Pattern Language 3.0\n(Iba, 2012).\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 14:22:54 GMT"}, {"version": "v2", "created": "Sun, 11 Aug 2013 05:01:06 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["Matsuzuka", "Ko", ""], ["Isaku", "Taichi", ""], ["Nishina", "Satoshi", ""], ["Iba", "Takashi", ""]]}, {"id": "1308.1284", "submitter": "Peter Gloor", "authors": "Eduardo Marisca", "title": "The Networks Are Out There: Building Cultural and Economic Resilience\n  Through Informal Communities of Practice", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/03", "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper explores the possibilities offered by informal communities of\npractice to operate as \"prototyping spaces\" for innovation in the context of\ndeveloping economies. It begins by looking at the concept of \"economic\ncomplexity\" and how it is useful in both guiding the priorities and evaluating\nthe challenges developing economies face when attempting to drive growth and\nbuild measures of resilience, and raises the question of how these economies\ncan both introduce higher complexity activities while compensating for\nlatecomer disadvantages versus more complex economies. It then examines in\ndetail the case of the Twin Eagles Group, a Peruvian video game development\ncommunity in the 1990s, and how they reverse engineered technologies and global\npractices to pursue their creative objectives. Based on this case, it concludes\nby laying out some of the methodological challenges associated to researching\nthis sort of community because of the multi-sited nature of their activities.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 14:27:13 GMT"}], "update_date": "2013-08-07", "authors_parsed": [["Marisca", "Eduardo", ""]]}, {"id": "1308.1602", "submitter": "Raphael kena Poss", "authors": "Raphael 'kena' Poss", "title": "Optimizing for confidence - Costs and opportunities at the frontier\n  between abstraction and reality", "comments": "11 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Is there a relationship between computing costs and the confidence people\nplace in the behavior of computing systems? What are the tuning knobs one can\nuse to optimize systems for human confidence instead of correctness in purely\nabstract models? This report explores these questions by reviewing the\nmechanisms by which people build confidence in the match between the physical\nworld behavior of machines and their abstract intuition of this behavior\naccording to models or programming language semantics. We highlight in\nparticular that a bottom-up approach relies on arbitrary trust in the accuracy\nof I/O devices, and that there exists clear cost trade-offs in the use of I/O\ndevices in computing systems. We also show various methods which alleviate the\nneed to trust I/O devices arbitrarily and instead build confidence\nincrementally \"from the outside\" by considering systems as black box entities.\nWe highlight cases where these approaches can reach a given confidence level at\na lower cost than bottom-up approaches.\n", "versions": [{"version": "v1", "created": "Wed, 7 Aug 2013 15:24:05 GMT"}], "update_date": "2013-08-08", "authors_parsed": [["Poss", "Raphael 'kena'", ""]]}, {"id": "1308.1611", "submitter": "Peter Gloor", "authors": "Megumi Kadotani, Aya Matsumoto, Takafumi Shibuya, Younjae Lee, Saori\n  Watanabe, Takashi Iba", "title": "Pattern Language for Good Old Future From Japanese Culture", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/09", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Having developed greatly over millennium under its culture, the ancient\nbuildings and old town atmospheres maintain a quality of comfort. However,\npeople only appreciate the \"good old\" quality and do not think further about\nthe rational reasons why they feel comfort in it. This keeps them from creating\ntheir own things and models with good old quality, relying on the imported\nwestern thinking and methods as a result of modernization. Since people are now\nstruggling under the imbalanced and complex society, we believe that support is\nneeded for generating things and frameworks with good old quality in modern\ntime situations and scenes.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 14:17:37 GMT"}], "update_date": "2013-08-08", "authors_parsed": [["Kadotani", "Megumi", ""], ["Matsumoto", "Aya", ""], ["Shibuya", "Takafumi", ""], ["Lee", "Younjae", ""], ["Watanabe", "Saori", ""], ["Iba", "Takashi", ""]]}, {"id": "1308.1612", "submitter": "Peter Gloor", "authors": "Yoshiaki Matsuzawa, Sayaka Tohyama, Sanshiro Sakai", "title": "The Course Design To Develop Meta-Cognitive Skills for Collaborative\n  Learning Through Tool-Assisted Discourse Analysis", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/06", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the course design titled \"Learning Management\" of which\nthe goal is to \"learn collaborative learning\" for a first-year undergraduate\nstudent. The objective of the class design is to help transform the student's\nbelief of learning from a passive, individual model to an active, collaborative\nmodel which is supported by the concept of \"Knowledge Building\" or\n\"Constructive Interaction\". We conducted an empirical study where the students\nanalyzed their own discourse with KBDeX which is the software they used to\nassist their analysis in the experimental group whereas the students in the\ncontrol group reflected their project activities in their own way. We examined\nthe transformation of their beliefs through the qualitative analysis of their\nreports after the course. The results showed that the design led to the\ntransforming of their learning beliefs from \"just experiences of the\nparticipation of the collaborative learning\" to \"active contribution for\ncollaborative knowledge creation\". The course succeeded in changing the\nstudents' preferences about collaborative learning from negative to positive as\nwell.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 14:40:12 GMT"}], "update_date": "2013-08-08", "authors_parsed": [["Matsuzawa", "Yoshiaki", ""], ["Tohyama", "Sayaka", ""], ["Sakai", "Sanshiro", ""]]}, {"id": "1308.1733", "submitter": "Muthiah Annamalai", "authors": "Muthiah Annamalai", "title": "Invitation to Ezhil: A Tamil Programming Language for Early\n  Computer-Science Education", "comments": "11 pages, 5 insets, 4 figures; accepted to Tamil Internet Conference,\n  2013, TI-2013, Malaysia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ezhil is a Tamil programming language with support for imperative\nprogramming, with mixed use of Tamil and English identifiers and\nfunction-names. Ezhil programing system is targeted toward the K-12 (junior\nhigh-school) level Tamil speaking students, as an early introduction to\nthinking like a computer-scientist. We believe this 'numeracy' knowledge is\neasily transferred over from a native language (Tamil) to the pervasive English\nlanguage programming systems, in Java, dot-Net, Ruby or Python. Ezhil is an\neffort to improve access to computing in the 21st Century.\n", "versions": [{"version": "v1", "created": "Thu, 8 Aug 2013 01:47:36 GMT"}], "update_date": "2013-08-12", "authors_parsed": [["Annamalai", "Muthiah", ""]]}, {"id": "1308.1746", "submitter": "Aleksandrs Slivkins", "authors": "Aleksandrs Slivkins and Jennifer Wortman Vaughan", "title": "Online Decision Making in Crowdsourcing Markets: Theoretical Challenges\n  (Position Paper)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the past decade, crowdsourcing has emerged as a cheap and efficient\nmethod of obtaining solutions to simple tasks that are difficult for computers\nto solve but possible for humans. The popularity and promise of crowdsourcing\nmarkets has led to both empirical and theoretical research on the design of\nalgorithms to optimize various aspects of these markets, such as the pricing\nand assignment of tasks. Much of the existing theoretical work on crowdsourcing\nmarkets has focused on problems that fall into the broad category of online\ndecision making; task requesters or the crowdsourcing platform itself make\nrepeated decisions about prices to set, workers to filter out, problems to\nassign to specific workers, or other things. Often these decisions are complex,\nrequiring algorithms that learn about the distribution of available tasks or\nworkers over time and take into account the strategic (or sometimes irrational)\nbehavior of workers.\n  As human computation grows into its own field, the time is ripe to address\nthese challenges in a principled way. However, it appears very difficult to\ncapture all pertinent aspects of crowdsourcing markets in a single coherent\nmodel. In this paper, we reflect on the modeling issues that inhibit\ntheoretical research on online decision making for crowdsourcing, and identify\nsome steps forward. This paper grew out of the authors' own frustration with\nthese issues, and we hope it will encourage the community to attempt to\nunderstand, debate, and ultimately address them.\n  The authors welcome feedback for future revisions of this paper.\n", "versions": [{"version": "v1", "created": "Thu, 8 Aug 2013 03:49:32 GMT"}, {"version": "v2", "created": "Fri, 15 Nov 2013 19:37:55 GMT"}, {"version": "v3", "created": "Tue, 26 Nov 2013 20:12:51 GMT"}], "update_date": "2013-11-27", "authors_parsed": [["Slivkins", "Aleksandrs", ""], ["Vaughan", "Jennifer Wortman", ""]]}, {"id": "1308.1846", "submitter": "Blesson Varghese", "authors": "Anthony Astoul, Christopher Filliter, Eric Mason, Andrew Rau-Chaplin,\n  Kunal Shridhar, Blesson Varghese, Naman Varshney", "title": "Developing and Testing the Automated Post-Event Earthquake Loss\n  Estimation and Visualisation (APE-ELEV) Technique", "comments": "Bulletin of Earthquake Engineering, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY physics.geo-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An automated, real-time, multiple sensor data source relying and globally\napplicable earthquake loss model and visualiser is desirable for post-event\nearthquake analysis. To achieve this there is a need to support rapid data\ningestion, loss estimation and integration of data from multiple data sources\nand rapid visualisation at multiple geographic levels. In this paper, the\ndesign and development of the Automated Post-Event Earthquake Loss Estimation\nand Visualisation (APE-ELEV) system for real-time estimation and visualisation\nof insured losses incurred due to earthquakes is presented. A model for\nestimating ground up and net of facultative losses due to earthquakes in near\nreal-time is implemented. Since post-event data is often available immediately\nfrom multiple disparate sources, a geo-browser is employed to facilitate the\nvisualisation and integration of earthquake hazard, exposure and loss data. The\nfeasibility of APE-ELEV is demonstrated using a test case earthquake that\noccurred in Tohoku, Japan (2011). The APE-ELEV model is further validated for\nten global earthquakes using industry loss data.\n", "versions": [{"version": "v1", "created": "Thu, 8 Aug 2013 13:30:15 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["Astoul", "Anthony", ""], ["Filliter", "Christopher", ""], ["Mason", "Eric", ""], ["Rau-Chaplin", "Andrew", ""], ["Shridhar", "Kunal", ""], ["Varghese", "Blesson", ""], ["Varshney", "Naman", ""]]}, {"id": "1308.1946", "submitter": "Eric Medvet", "authors": "A. Bartoli, E. Medvet", "title": "Citation Counts and Evaluation of Researchers in the Internet Age", "comments": "4 pages, 2 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bibliometric measures derived from citation counts are increasingly being\nused as a research evaluation tool. Their strengths and weaknesses have been\nwidely analyzed in the literature and are often subject of vigorous debate. We\nbelieve there are a few fundamental issues related to the impact of the web\nthat are not taken into account with the importance they deserve. We focus on\nevaluation of researchers, but several of our arguments may be applied also to\nevaluation of research institutions as well as of journals and conferences.\n", "versions": [{"version": "v1", "created": "Wed, 7 Aug 2013 08:18:05 GMT"}], "update_date": "2013-08-09", "authors_parsed": [["Bartoli", "A.", ""], ["Medvet", "E.", ""]]}, {"id": "1308.2362", "submitter": "Bo young Lim", "authors": "Yunsik Jake Jang, Bo young Lim", "title": "Harmonization among national cyber security and cybercrime response\n  organizations: New challenges of cybercrime", "comments": "4th Asian Criminology Conference (2012)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This paper will discuss the need for national-level organizational strategies\nto effectively combat cyber security threats and cybercrime. In many countries,\nnew agencies have been established and/or new roles have been allotted to\nexisting agencies to cope with the needs for cyber security or fighting against\ncybercrime. The two pillars of organizational structure and functions (i.e.,\nsecurity vs. law enforcement) have given new challenges to us, especially in\nthe context of traditional criminal justice system. To illustrate the\nchallenges, a case study examining the responses to major security incidents\nfollowed by nationwide debates and remarkable organizational changes in Korea\nwill be given.\n", "versions": [{"version": "v1", "created": "Sun, 11 Aug 2013 03:28:07 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["Jang", "Yunsik Jake", ""], ["Lim", "Bo young", ""]]}, {"id": "1308.2451", "submitter": "Peter Gloor", "authors": "Cristobal Garc\\'ia, Paul Chauveau, Javier Ledezma, Maria Pinto", "title": "What can Social Media teach us about protests? Analyzing the Chilean\n  2011-12 Student Movement's Network evolution through Twitter data", "comments": "Presented at COINs13 Conference, Chile, 2013 (arxiv:1308.1028)", "journal-ref": null, "doi": null, "report-no": "coins13/2013/11", "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using social media data -specially twitter -of the Chilean 2011-12 student\nmovement, we study their social network evolution over time to analyze how\nleaders and participants self-organize and spread information. Based on a few\nkey events of the student movement's timeline, we visualize the student network\ntrajectory and analyze their structural and semantic properties. Therefore, in\nthis paper we: i) describe the basic network topology of the 2011-12 Chilean\nmassive student movement; ii) explore how the 180 key central nodes of the\nmovement are connected, self-organize and spread information. We contend that\nthis social media enabled massive movement is yet another manifestation of the\nnetwork era, which leverages agents' socio-technical networks, and thus\naccelerates how agents coordinate, mobilize resources and enact collective\nintelligence.\n", "versions": [{"version": "v1", "created": "Mon, 12 Aug 2013 03:05:18 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["García", "Cristobal", ""], ["Chauveau", "Paul", ""], ["Ledezma", "Javier", ""], ["Pinto", "Maria", ""]]}, {"id": "1308.2597", "submitter": "Daniel Graziotin", "authors": "Daniel Graziotin, Xiaofeng Wang, Pekka Abrahamsson (Free University of\n  Bozen-Bolzano)", "title": "A framework for systematic analysis of Open Access journals and its\n  application in software engineering and information systems", "comments": "This is a self-archived post-print (accepted version) of the article,\n  published in Scientometrics at http://dx.doi.org/10.1007/s11192-014-1278-7.\n  37 pages, 3 figures, 5 tables", "journal-ref": null, "doi": "10.1007/s11192-014-1278-7", "report-no": null, "categories": "cs.DL cs.CY cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article is a contribution towards an understanding of Open Access (OA)\npublishing. It proposes an analysis framework of 18 core attributes, divided\ninto the areas of Bibliographic information, Activity metrics, Economics,\nAccessibility, and Predatory issues of OA journals. The framework has been\nemployed in a systematic analysis of 30 OA journals in software engineering\n(SE) and information systems (IS), which were selected among 386 OA journals in\nComputer Science from the Directory of OA Journals. An analysis is performed on\nthe sample of the journals, to provide an overview of the current situation of\nOA journals in the fields of SE and IS. The journals are then compared\nbetween-group, according to the presence of a publication fee. A within-group\nanalysis is performed on the journals requesting publication charges to\nauthors, in order to understand what is the value added according to different\nprice ranges. This article offers several contributions. It presents an\noverview of OA definitions and models. It provides an analysis framework born\nfrom the observation of data and the literature. It raises the need to study OA\nin the fields of SE and IS while offering a first analysis. Finally, it\nprovides recommendations to readers of OA journals. This paper highlights\nseveral concerns still threatening OA publishing in the fields of SE and IS.\nAmong them, it is shown that high publication fees are not sufficiently\njustified by the publishers, which often lack transparency and may prevent\nauthors from adopting OA.\n", "versions": [{"version": "v1", "created": "Mon, 12 Aug 2013 15:44:45 GMT"}, {"version": "v2", "created": "Mon, 17 Mar 2014 15:36:19 GMT"}, {"version": "v3", "created": "Tue, 8 Apr 2014 07:39:20 GMT"}], "update_date": "2014-04-09", "authors_parsed": [["Graziotin", "Daniel", "", "Free University of\n  Bozen-Bolzano"], ["Wang", "Xiaofeng", "", "Free University of\n  Bozen-Bolzano"], ["Abrahamsson", "Pekka", "", "Free University of\n  Bozen-Bolzano"]]}, {"id": "1308.2705", "submitter": "Kristina Lerman", "authors": "Tad Hogg, Kristina Lerman, Laura M. Smith", "title": "Stochastic Models Predict User Behavior in Social Media", "comments": "ASE/IEEE Social Computing Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  User response to contributed content in online social media depends on many\nfactors. These include how the site lays out new content, how frequently the\nuser visits the site, how many friends the user follows, how active these\nfriends are, as well as how interesting or useful the content is to the user.\nWe present a stochastic modeling framework that relates a user's behavior to\ndetails of the site's user interface and user activity and describe a procedure\nfor estimating model parameters from available data. We apply the model to\nstudy discussions of controversial topics on Twitter, specifically, to predict\nhow followers of an advocate for a topic respond to the advocate's posts. We\nshow that a model of user behavior that explicitly accounts for a user\ntransitioning through a series of states before responding to an advocate's\npost better predicts response than models that fail to take these states into\naccount. We demonstrate other benefits of stochastic models, such as their\nability to identify users who are highly interested in advocate's posts.\n", "versions": [{"version": "v1", "created": "Mon, 12 Aug 2013 21:51:04 GMT"}], "update_date": "2013-08-14", "authors_parsed": [["Hogg", "Tad", ""], ["Lerman", "Kristina", ""], ["Smith", "Laura M.", ""]]}, {"id": "1308.2938", "submitter": "Louis Francois Pau", "authors": "K. Jaaskelainen, L-F Pau", "title": "ERP projects Internal Stakeholder network and how it influences the\n  projects outcome", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  So far little effort has been put into researching the importance of internal\nERP project stakeholders mutual interactions,realizing the projects\ncomplexity,influence on the whole organization, and high risk for a useful\nfinal outcome. This research analyzes the stakeholders interactions and\npositions in the project network, their criticality, potential bottlenecks and\nconflicts. The main methods used are Social Network Analysis, and the\nelicitation of drivers for the individual players. Information was collected\nfrom several stakeholders from three large ERP projects all in global companies\nheadquartered in Finland, together with representatives from two different ERP\nvendors, and with two experienced ERP consultants. The analysis gives\nquantitative as well as qualitative characterization of stakeholder criticality\n(mostly the Project Manager(s), the Business Owner(s) and the Process\nOwner(s)), degree of centrality, closeness, mediating or bottleneck roles,\nrelational ties and conflicts (individual, besides those between business and\nproject organizations), and clique formations. A generic internal stakeholder\nnetwork model is established as well as the criticality of the project phases.\nThe results are summarized in the form of a list of recommendations for future\nERP projects to address the internal stakeholder impacts .Project management\nshould utilize the latest technology to provide tools to increase the\ninteraction between the stakeholders and to monitor the strength of these\nrelations. Social network analysis tools could be used in the projects to\nvisualize the stakeholder relations in order to better understand the possible\nrisks related to the relations (or lack of them).\n", "versions": [{"version": "v1", "created": "Tue, 13 Aug 2013 18:48:49 GMT"}], "update_date": "2013-08-14", "authors_parsed": [["Jaaskelainen", "K.", ""], ["Pau", "L-F", ""]]}, {"id": "1308.2940", "submitter": "Louis Francois Pau", "authors": "L. F. Pau", "title": "Mobile operators as banks or vice-versa? and: regulators interest in the\n  best efficiency for payments", "comments": "COST 605 Workshop, Paris, 2008 http://www.cost605.org/docs", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the strategic challenges of deposit banks, and payment\nclearinghouses, posed by the growing role of mobile operators as collectors and\npayment agents for flows of cash for themselves and third parties. Through\nanalysis and data analysis from selected operators, it is shown that mobile\noperators achieve as money flow handlers levels of efficiency,\nprofitability,and risk control comparable with deposit banks. Furthermore, the\npayment infrastructures deployed by both are found to be quite similar, and are\nanalyzed in relation to financial profitability, strategic challenges and\nopportunities. This paves the way to either mobile operators taking a bigger\nrole,or for banks to tie up such operators to them even more tightly,or for\nalliances/mergers to take place,all these options being subject to regulatory\nevolution which is analyzed as well . The consequences are mapped out in\noperational and regulatory terms\n", "versions": [{"version": "v1", "created": "Tue, 13 Aug 2013 18:55:35 GMT"}], "update_date": "2013-08-14", "authors_parsed": [["Pau", "L. F.", ""]]}, {"id": "1308.2944", "submitter": "Louis Francois Pau", "authors": "L. F. Pau", "title": "Smart business networks and business genetics with a high tech\n  communications supplier selection industry case", "comments": "Research report ERIM, Rotterdam school of management, Feb. 2006,\n  http://hdl.handle.net/1765/7319", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the emergence of event driven business process management, smart\nbusiness networks, social networks, etc. as important research areas in\nmanagement, for all the attractiveness of these concepts, two major challenges\nremain around their design and the partner selection rules while learning from\ninteraction events.While smart business networks should provide advantages due\nto the quick connect of business partners for selected functions in a process\ncommon to several parties, literature does not provide constructive methods\nwhereby the selection of temporary partners and functions can be done. Most\ndiscussions only rely solely on human judgment. This paper introduces both\ncomputational geometry, and genetic programming, as systematic methods whereby\nto identify, characterize, and then display on a continuing basis from event\nmonitoring such possible partnerships; such techniques also allow to plan for\ntheir effect on the organizations and thus to carry out selection. The two\nmethods are being put in the context of emergence theory. Tessellations address\nthe identification and categorization issues; business maps address the display\nand monitoring challenge with the use of Voronoii diagrams. Cellular automata\nmimicking living bodies, with genetic algorithms of which parameters are\nestimated by learning, address the selection and effect issues. To illustrate\nthe approach, some experimental results from the sourcing function in a high\ntech industry, are discussed; they address the case of how to determine the\nselection process for a systems integrator to set up joint ventures with\nsmaller technology suppliers.\n", "versions": [{"version": "v1", "created": "Tue, 13 Aug 2013 19:07:35 GMT"}], "update_date": "2013-08-14", "authors_parsed": [["Pau", "L. F.", ""]]}, {"id": "1308.2947", "submitter": "Louis Francois Pau", "authors": "L. F. Pau", "title": "How and why communications industry suppliers get squeezed out: now, and\n  the next phase", "comments": "Research report Erasmus Research Institute of management, Erasmus\n  University, Rotterdam, http://hdl.handle.net/1765/317", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The communications systems, terminals, software and deployment service,\nindustries, have undergone the past ten years a significant technological\ninternal evolution and external revolution at customer end (such as Internet,\nMobile networks and terminals, Broadband,..). Very little management research\nhas studied their financial survivability irrespective of changes in demand\nvolumes in the present technological /organizational cycle. This paper analyzes\nthe implications of genuine open mandated communications standards, of higher\nproduct volumes, of very high R&D, of the larger use of sourced /purchased\ntechnologies, and of contract manufacturing. The methodology used is\nequilibrium analyses. Two specific areas will be mentioned as examples. The\npaper also shows how eventually those industries in a later cycle will bounce\nback.\n", "versions": [{"version": "v1", "created": "Tue, 13 Aug 2013 19:13:00 GMT"}], "update_date": "2013-08-14", "authors_parsed": [["Pau", "L. F.", ""]]}, {"id": "1308.3294", "submitter": "Nicholas Kersting", "authors": "Nicholas Kersting", "title": "A Secure and Comparable Text Encryption Algorithm", "comments": "9 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CL cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discloses a simple algorithm for encrypting text messages, based\non the NP-completeness of the subset sum problem, such that the similarity\nbetween encryptions is roughly proportional to the semantic similarity between\ntheir generating messages. This allows parties to compare encrypted messages\nfor semantic overlap without trusting an intermediary and might be applied, for\nexample, as a means of finding scientific collaborators over the Internet.\n", "versions": [{"version": "v1", "created": "Thu, 15 Aug 2013 02:44:12 GMT"}], "update_date": "2013-08-16", "authors_parsed": [["Kersting", "Nicholas", ""]]}, {"id": "1308.3323", "submitter": "V. B.  Singh Dr.", "authors": "Nikita Yadav, V B Singh", "title": "E-Governance: Past, Present and Future in India", "comments": "13; 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to widespread demand of E-governance and exponentially increasing size of\ndata, new technologies like Open source solutions and cloud computing need to\nbe incorporated. In this paper, the latest trends of technology that the\ngovernment of most of the country has adopted have been discussed. While\nworking on this project we have concluded that E-Governance has made the\nworking of government more efficient and more transparent to its citizens We\nhave also presented an exhaustive list of E-Governance projects which is\ncurrently being used in India and in international scenario. We have provided a\nmechanism for improving E-Governance by including technologies such as Open\nSource and Cloud Computing.\n", "versions": [{"version": "v1", "created": "Thu, 15 Aug 2013 07:10:29 GMT"}], "update_date": "2013-08-16", "authors_parsed": [["Yadav", "Nikita", ""], ["Singh", "V B", ""]]}, {"id": "1308.3357", "submitter": "Christophe Gu\\'eret", "authors": "Marat Charlaganov, Philippe Cudr\\'e-Mauroux, Cristian Dinu, Christophe\n  Gu\\'eret, Martin Grund and Teodor Macicas", "title": "The Entity Registry System: Implementing 5-Star Linked Data Without the\n  Web", "comments": "16 pages, authors are listed in alphabetical order", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Linked Data applications often assume that connectivity to data repositories\nand entity resolution services are always available. This may not be a valid\nassumption in many cases. Indeed, there are about 4.5 billion people in the\nworld who have no or limited Web access. Many data-driven applications may have\na critical impact on the life of those people, but are inaccessible to those\npopulations due to the architecture of today's data registries. In this paper,\nwe propose and evaluate a new open-source system that can be used as a\ngeneral-purpose entity registry suitable for deployment in poorly-connected or\nad-hoc environments.\n", "versions": [{"version": "v1", "created": "Thu, 15 Aug 2013 10:53:48 GMT"}], "update_date": "2013-08-16", "authors_parsed": [["Charlaganov", "Marat", ""], ["Cudré-Mauroux", "Philippe", ""], ["Dinu", "Cristian", ""], ["Guéret", "Christophe", ""], ["Grund", "Martin", ""], ["Macicas", "Teodor", ""]]}, {"id": "1308.3579", "submitter": "Arun Joseph", "authors": "Mohit John and Arun JosephPalai", "title": "ZigBee Based Wireless Data Acquisition Using LabVIEW for Implementing\n  Smart Driving Skill Evaluation System", "comments": "19 pages", "journal-ref": null, "doi": "10.5121/ijics.2013.3301", "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Smart Driving Skill Evaluation (SDSE) System presented in this paper\nexpedite the testing of candidates aspiring for a driving license in a more\nefficient and transparent manner, as compared to the present manual testing\nprocedure existing in most parts of Asia and Pacific region. The manual test\nprocedure is also subjected to multiple limitations like time consuming, costly\nand heavily controlled by the experience of examiner in conducting the test.\nThis technological solution is developed by customizing 8051 controller based\nembedded system and LabVIEW based virtual instrument. The controller module\nsenses the motion of the test vehicle on the test track referred to as zero rpm\nmeasurement and the LabVIEW based virtual instrument provides a Graphical User\nInterface for remote end monitoring of the sensors embedded on the test track.\nThe proposed technological solution for the automation of existing manual test\nprocess enables the elimination of human intervention and improves the driving\ntest accuracy while going paperless with Driving Skill Evaluation System. As a\ncontribution to the society this technological solution can reduce the number\nof road accidents because most accidents results from lack of planning,\nanticipation and control which are highly dependent on driving skill.\n", "versions": [{"version": "v1", "created": "Fri, 16 Aug 2013 08:34:44 GMT"}], "update_date": "2013-08-19", "authors_parsed": [["John", "Mohit", ""], ["JosephPalai", "Arun", ""]]}, {"id": "1308.3603", "submitter": "Renaud Lambiotte", "authors": "Vsevolod Salnikov, Daniel Schien, Hyejin Youn, Renaud Lambiotte and\n  Michael T. Gastner", "title": "The geography and carbon footprint of mobile phone use in Cote d'Ivoire", "comments": "23 pages, 8 figures, 1 table", "journal-ref": "EPJ Data Science 2014, 3:3", "doi": "10.1140/epjds21", "report-no": null, "categories": "cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The newly released Orange D4D mobile phone data base provides new insights\ninto the use of mobile technology in a developing country. Here we perform a\nseries of spatial data analyses that reveal important geographic aspects of\nmobile phone use in Cote d'Ivoire. We first map the locations of base stations\nwith respect to the population distribution and the number and duration of\ncalls at each base station. On this basis, we estimate the energy consumed by\nthe mobile phone network. Finally, we perform an analysis of inter-city\nmobility, and identify high-traffic roads in the country.\n", "versions": [{"version": "v1", "created": "Fri, 16 Aug 2013 11:14:57 GMT"}, {"version": "v2", "created": "Mon, 24 Feb 2014 13:48:27 GMT"}], "update_date": "2014-02-25", "authors_parsed": [["Salnikov", "Vsevolod", ""], ["Schien", "Daniel", ""], ["Youn", "Hyejin", ""], ["Lambiotte", "Renaud", ""], ["Gastner", "Michael T.", ""]]}, {"id": "1308.3657", "submitter": "Anastasios Noulas Anastasios Noulas", "authors": "Amy X. Zhang, Anastasios Noulas, Salvatore Scellato, Cecilia Mascolo", "title": "Hoodsquare: Modeling and Recommending Neighborhoods in Location-based\n  Social Networks", "comments": "ASE/IEEE SocialCom 2013", "journal-ref": null, "doi": "10.1109/SocialCom.2013.17", "report-no": null, "categories": "cs.CY cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information garnered from activity on location-based social networks can be\nharnessed to characterize urban spaces and organize them into neighborhoods. In\nthis work, we adopt a data-driven approach to the identification and modeling\nof urban neighborhoods using location-based social networks. We represent\ngeographic points in the city using spatio-temporal information about\nFoursquare user check-ins and semantic information about places, with the goal\nof developing features to input into a novel neighborhood detection algorithm.\nThe algorithm first employs a similarity metric that assesses the homogeneity\nof a geographic area, and then with a simple mechanism of geographic\nnavigation, it detects the boundaries of a city's neighborhoods. The models and\nalgorithms devised are subsequently integrated into a publicly available,\nmap-based tool named Hoodsquare that allows users to explore activities and\nneighborhoods in cities around the world.\n  Finally, we evaluate Hoodsquare in the context of a recommendation\napplication where user profiles are matched to urban neighborhoods. By\ncomparing with a number of baselines, we demonstrate how Hoodsquare can be used\nto accurately predict the home neighborhood of Twitter users. We also show that\nwe are able to suggest neighborhoods geographically constrained in size, a\ndesirable property in mobile recommendation scenarios for which geographical\nprecision is key.\n", "versions": [{"version": "v1", "created": "Fri, 16 Aug 2013 15:49:38 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Zhang", "Amy X.", ""], ["Noulas", "Anastasios", ""], ["Scellato", "Salvatore", ""], ["Mascolo", "Cecilia", ""]]}, {"id": "1308.3693", "submitter": "Louis Francois Pau", "authors": "L.-F. Pau", "title": "Business and social evaluation of denial of service attacks of\n  communications networks in view of scaling economic counter-measures", "comments": null, "journal-ref": "The virtual battlefield : perspectives on cyber warfare ,\n  Cryptology and information security Series, Vol 3, IOS Press, Amsterdam,\n  2009, pp. 282-293", "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper gives an analytical method to determine the economic and indirect\nimplications of denial of service and distributed denial of service attacks. It\nis based on time preference dynamics applied to the monetary mass for the\nrestoration of capabilities, on long term investments to rebuild capabilities,\nand of the usability level of the capabilities after an attack. A simple\nillustrative example is provided for a denial of service on a corporate data\ncentre. The needed data collection methodologies are categorized by classes of\ntargets. The use of the method is explained in the context of legal or policy\ndriven dissuasive, retaliation or compensation/ restoration actions. A concrete\nset of deployment cases in mobile communications services is discussed. The\nconclusion includes policy recommendations as well as information exchange\nrequirements.\n", "versions": [{"version": "v1", "created": "Tue, 13 Aug 2013 18:38:25 GMT"}], "update_date": "2013-08-19", "authors_parsed": [["Pau", "L. -F.", ""]]}, {"id": "1308.3836", "submitter": "Loet Leydesdorff", "authors": "Inga Ivanova and Loet Leydesdorff", "title": "Redundancy Generation in University-Industry-Government Relations: The\n  Triple Helix Modeled, Measured, and Simulated", "comments": "Scientometrics, accepted for publication, January 24, 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Triple Helix (TH) of bi- and trilateral relations among universities,\nindustries, and governments can be considered as an ecosystem in which\nuncertainty can be reduced auto-catalytically. The correlations among the\ndistributions of relations span a vector space in which two vectors (P and Q)\nrepresent \"sending\" and \"receiving,\" respectively. These vectors can also be\nunderstood in terms of the generation versus reduction of uncertainty in the\ncommunication field that results from interactions among the three (bi-lateral)\ncommunication channels. We specify a set of Lotka-Volterra equations between\nthe vectors that can be solved. Redundancy generation can then be simulated and\nthe results can be decomposed in terms of the TH components. Among other\nthings, we show that the strength and frequency of the relations are\nindependent parameters. Different components in terms of frequencies in\ntriple-helix systems can also be distinguished and interpreted using Fourier\nanalysis of the empirical time-series. The case of co-authorship relations in\nJapan is analyzed as an empirical example; but \"triple contingencies\" in an\necosystem of relations can also be considered more generally as a model for\nredundancy generation by providing meaning to the (Shannon-type) information in\ninter-human communications.\n", "versions": [{"version": "v1", "created": "Sun, 18 Aug 2013 06:44:11 GMT"}, {"version": "v2", "created": "Sat, 25 Jan 2014 15:21:15 GMT"}], "update_date": "2014-01-28", "authors_parsed": [["Ivanova", "Inga", ""], ["Leydesdorff", "Loet", ""]]}, {"id": "1308.4485", "submitter": "Manoj Kumar", "authors": "Neeta Sharma and Manoj Kumar", "title": "The Wonderful Toy of 20th Century can be a Disaster in 21st\n  Century:Scenario and Policies Regarding Mobile Waste in India", "comments": "6 pages, 1 figure, 2 tables", "journal-ref": "(IJCSIT) International Journal of Computer Science and Information\n  Technologies, Vol. 2 (5) , 2011, 2198-2203 ISSN:0975-9646", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The subscribers base of mobile phones is increasing globally with a rapid\nrate.The sale of mobile phones has exceeded those of personal computers.India\nis the second largest telecommunication network in the world in terms of number\nof wireless connections after China.Telecom companies are ready to tap a large\nunexplored market in India with lucrative offerings.Smart phones sale are at\nits peak.3G technology is also ready to play a lead role in mobile\nrevolution.Due to the low average life of the mobile phones,lack of awareness\namong users and in absence of government policies,mobile waste is accumulating\nin vast amount in India.Without a proper system of recycling,the unsafe\ndisposal is causing a variety of environmental and health problems.This paper\ndiscusses the various issues related to the worldwide growth of mobile\nphones,the insecure methods of disposal and the regulations and policies in\nIndia.We intend to put forward some challenges and advices.\n", "versions": [{"version": "v1", "created": "Wed, 21 Aug 2013 05:05:42 GMT"}], "update_date": "2013-08-22", "authors_parsed": [["Sharma", "Neeta", ""], ["Kumar", "Manoj", ""]]}, {"id": "1308.4820", "submitter": "Shariq Hussain Mr.", "authors": "Shariq Hussain, Zhaoshun Wang and Sabit Rahim", "title": "E-learning Services for Rural Communities", "comments": "6 pages, 6 figures, 3 tables", "journal-ref": "International Journal of Computer Applications, vol.68, no.5,\n  2013, pp.15-20", "doi": "10.5120/11574-6888", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information and communication technologies brought-in tools and techniques in\nthe field of education that introduced new concepts of teaching and learning.\nLearning management system is one of the key tools used in educational\ninstitutes to facilitate e-learning. There is remarkable digital divide among\nurban and rural areas. In this paper, we present a model for providing\ne-learning services to remote/rural areas in order to promote and facilitate\nmodern education. A dedicated resource center, hosting the learning management\nsystem, facilitates e-learning centers through Internet. The overall goal of\nthis model is to have a cost-effective learning environment equipped with\nlatest technologies to provide learners an opportunity to get insight into new\ninformation and communication technologies and e-learning environment. The\nmodel offers new teaching methodology with enhance utilization of learning\nmanagement system in teaching and learning. Basic characteristics and technical\naspects will be considered as well. The study will also promote development and\nusage of open-source technologies.\n", "versions": [{"version": "v1", "created": "Thu, 22 Aug 2013 10:57:55 GMT"}, {"version": "v2", "created": "Sat, 31 Aug 2013 05:41:04 GMT"}], "update_date": "2013-09-03", "authors_parsed": [["Hussain", "Shariq", ""], ["Wang", "Zhaoshun", ""], ["Rahim", "Sabit", ""]]}, {"id": "1308.4862", "submitter": "Yeasir Rumi fathah", "authors": "Yeasir Fathah Rumi, Uzzal Kumar Prodhan, Mohammed Ibrahim Hussain,\n  A.H.M. Shahariar Parvez, Md. Ali Hossain", "title": "Strategy For Assessment Of Land And Complex Fields Type Analysis Through\n  GIS In Bangladesh", "comments": "13 pages, 7 Figures", "journal-ref": "International Journal of Information Sciences and Techniques\n  (IJIST) Vol.3, No.4, July 2013", "doi": "10.5121/ijist.2013.3403", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bangladesh is an over populated developing country where crisis of food is a\nmajor issue, it faces different infrastructure problem in every sector. For\nPoverty Alleviation from the country we have to confirm cultivable land to\nincrease the crop production for feeding the over population of the country.\nThis paper focuses on the measurement of cultivable land for cultivation. The\nmain purpose of this paper is to briefly describe how the GIS, Digital Mapping,\nInternet concepts and tools can effectively contribute in the modeling,\nanalysis and visualization phases within an engineering or research project\naccording to the crops by using object detection, object tracking and field\nmapping in Bangladesh. Through GIS mapping of the agricultural lands, the\nstatistics can be made of how much land is cultivable and each year how much\nland we are losing. Mapping the cultivation land will tell us how much crop we\nhave to import from other countries. Enabling real-time GIS analysis anytime,\nanywhere, the implementation of the GIS information to a wider aspect.\nAutomation is the indicator of the modern civilizations. The system will\nbenefit the food stock of the country according to the harvest. For this\nresearch we developed a new interactive system. The system will integrate with\nGIS project data in Google Earth, first finds highly accurate cluster images\nand partial images, obtains user feedback to merge or correct these digests,\nand then the supplementary visual analysis complete the partitioning of the\ndata. This study was conducted at the software laboratory, Computer Science and\nEngineering department, Jahangirnagar University, Dhaka, Bangladesh in 2013.\n", "versions": [{"version": "v1", "created": "Thu, 22 Aug 2013 13:49:04 GMT"}], "update_date": "2013-08-23", "authors_parsed": [["Rumi", "Yeasir Fathah", ""], ["Prodhan", "Uzzal Kumar", ""], ["Hussain", "Mohammed Ibrahim", ""], ["Parvez", "A. H. M. Shahariar", ""], ["Hossain", "Md. Ali", ""]]}, {"id": "1308.5010", "submitter": "Yaneer Bar-Yam", "authors": "Karla Z. Bertrand, Maya Bialik, Kawandeep Virdee, Andreas Gros and\n  Yaneer Bar-Yam", "title": "Sentiment in New York City: A High Resolution Spatial and Temporal View", "comments": "12 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": "New England Complex Systems Institute (NECSI) Report 2013-08-01", "categories": "physics.soc-ph cs.CL cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Measuring public sentiment is a key task for researchers and policymakers\nalike. The explosion of available social media data allows for a more\ntime-sensitive and geographically specific analysis than ever before. In this\npaper we analyze data from the micro-blogging site Twitter and generate a\nsentiment map of New York City. We develop a classifier specifically tuned for\n140-character Twitter messages, or tweets, using key words, phrases and\nemoticons to determine the mood of each tweet. This method, combined with\ngeotagging provided by users, enables us to gauge public sentiment on extremely\nfine-grained spatial and temporal scales. We find that public mood is generally\nhighest in public parks and lowest at transportation hubs, and locate other\nareas of strong sentiment such as cemeteries, medical centers, a jail, and a\nsewage facility. Sentiment progressively improves with proximity to Times\nSquare. Periodic patterns of sentiment fluctuate on both a daily and a weekly\nscale: more positive tweets are posted on weekends than on weekdays, with a\ndaily peak in sentiment around midnight and a nadir between 9:00 a.m. and noon.\n", "versions": [{"version": "v1", "created": "Thu, 22 Aug 2013 22:14:25 GMT"}], "update_date": "2013-08-26", "authors_parsed": [["Bertrand", "Karla Z.", ""], ["Bialik", "Maya", ""], ["Virdee", "Kawandeep", ""], ["Gros", "Andreas", ""], ["Bar-Yam", "Yaneer", ""]]}, {"id": "1308.5513", "submitter": "Lingfei Wu", "authors": "Lingfei Wu, Jiang Zhang, Min Zhao", "title": "The Metabolism and Growth of Web Forums", "comments": "6 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0102646", "report-no": null, "categories": "physics.soc-ph cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We view web forums as virtual living organisms feeding on user's attention\nand investigate how these organisms grow at the expense of collective\nattention. We find that the \"body mass\" ($PV$) and \"energy consumption\" ($UV$)\nof the studied forums exhibits the allometric growth property, i.e., $PV_t \\sim\nUV_t ^ \\theta$. This implies that within a forum, the network transporting\nattention flow between threads has a structure invariant of time, despite of\nthe continuously changing of the nodes (threads) and edges (clickstreams). The\nobserved time-invariant topology allows us to explain the dynamics of networks\nby the behavior of threads. In particular, we describe the clickstream\ndissipation on threads using the function $D_i \\sim T_i ^ \\gamma$, in which\n$T_i$ is the clickstreams to node $i$ and $D_i$ is the clickstream dissipated\nfrom $i$. It turns out that $\\gamma$, an indicator for dissipation efficiency,\nis negatively correlated with $\\theta$ and $1/\\gamma$ sets the lower boundary\nfor $\\theta$. Our findings have practical consequences. For example, $\\theta$\ncan be used as a measure of the \"stickiness\" of forums, because it quantifies\nthe stable ability of forums to convert $UV$ into $PV$, i.e., to remain users\n\"lock-in\" the forum. Meanwhile, the correlation between $\\gamma$ and $\\theta$\nprovides a convenient method to evaluate the `stickiness\" of forums. Finally,\nwe discuss an optimized \"body mass\" of forums at around $10^5$ that minimizes\n$\\gamma$ and maximizes $\\theta$.\n", "versions": [{"version": "v1", "created": "Mon, 26 Aug 2013 08:46:18 GMT"}, {"version": "v2", "created": "Wed, 28 Aug 2013 09:25:25 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Wu", "Lingfei", ""], ["Zhang", "Jiang", ""], ["Zhao", "Min", ""]]}, {"id": "1308.5937", "submitter": "Abhinov Balagoni", "authors": "Abhinov Balagoni, Vinay Kumar Chavala", "title": "A Multilayered Approach to Estimate Business Performance", "comments": "4 pages. 6th International Conference on Advanced Computing and\n  Communication Technologies (ICACCT-2012)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The performance of a business is chiefly determined by the business model\nadopted and its environment of operation. This paper emphasizes on the\nintegration of Web 2.0 services like social networking to your existing\nbusiness, which helps in the progressive sustainability of the business\norganization. The usage of Web 2.0 tools, such as Wikipedia, blogs and social\nnetworking services such as Facebook, LinkedIn, Orkut by individuals in all\nsocieties, has been pervasive and very successful in proliferating their use at\nthe professional or business levels. This paper puts forth the discussion which\nhelps in better understanding of what social networking encompasses for present\nday business. It also aims to educate business decision makers about the\nbenefits and risks associated in incorporating business model with social\nnetworking. Thus, the paper focuses on the implementation of social networking\nplatforms in business operations and discusses the different attributes of\nbusiness performance and gives an overview in choosing a social networking\nplatform for its business purposes.\n", "versions": [{"version": "v1", "created": "Tue, 27 Aug 2013 18:03:17 GMT"}, {"version": "v2", "created": "Tue, 14 Oct 2014 09:39:52 GMT"}], "update_date": "2014-10-15", "authors_parsed": [["Balagoni", "Abhinov", ""], ["Chavala", "Vinay Kumar", ""]]}, {"id": "1308.6149", "submitter": "Derek O'Callaghan", "authors": "Derek O'Callaghan, Derek Greene, Maura Conway, Joe Carthy, P\\'adraig\n  Cunningham", "title": "The Extreme Right Filter Bubble", "comments": "10 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to its status as the most popular video sharing platform, YouTube plays\nan important role in the online strategy of extreme right groups, where it is\noften used to host associated content such as music and other propaganda. In\nthis paper, we develop a categorization suitable for the analysis of extreme\nright channels found on YouTube. By combining this with an NMF-based topic\nmodelling method, we categorize channels originating from links propagated by\nextreme right Twitter accounts. This method is also used to categorize related\nchannels, which are determined using results returned by YouTube's related\nvideo service. We identify the existence of a \"filter bubble\", whereby users\nwho access an extreme right YouTube video are highly likely to be recommended\nfurther extreme right content.\n", "versions": [{"version": "v1", "created": "Wed, 28 Aug 2013 13:19:23 GMT"}], "update_date": "2013-08-29", "authors_parsed": [["O'Callaghan", "Derek", ""], ["Greene", "Derek", ""], ["Conway", "Maura", ""], ["Carthy", "Joe", ""], ["Cunningham", "Pádraig", ""]]}, {"id": "1308.6363", "submitter": "Joshua I. James", "authors": "Joshua I. James, Yunsik Jake Jang", "title": "Measuring digital crime investigation capacity to guide international\n  crime prevention strategies", "comments": "7 pages, 3 figures, Presented at FutureTech 2013", "journal-ref": "Future Information Technology. Springer Berlin Heidelberg, 2014.\n  361-366", "doi": "10.1007/978-3-642-40861-8_51", "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This work proposes a method for the measurement of a country's digital\ninvestigation capacity and saturation for the assessment of future capacity\nexpansion. The focus is on external, or international, partners being a factor\nthat could negatively affect the return on investment when attempting to expand\ninvestigation capacity nationally. This work concludes with the argument that\nwhen dealing with digital crime, target international partners should be a\nconsideration in expansion, and could potentially be a bottleneck of\ninvestigation requests.\n", "versions": [{"version": "v1", "created": "Thu, 29 Aug 2013 04:24:41 GMT"}], "update_date": "2013-08-30", "authors_parsed": [["James", "Joshua I.", ""], ["Jang", "Yunsik Jake", ""]]}, {"id": "1308.6760", "submitter": "Artus Krohn-Grimberghe", "authors": "Artus Krohn-Grimberghe Christoph Sorge", "title": "Practical Aspects of the Bitcoin System", "comments": "Covers content till end of May 2013. Was submitted to Communications\n  of the ACM but got rejected (\"well written but out of scope\")", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Digital payment schemes show an ever increasing importance. Out of the\ncountless different schemes available this article focuses on the popular\nBitcoin system. The authors provide a description of Bitcoin's unique\ntechnological basis and its accompanying ecosystem of users, miners, trading\nplatforms and vendors. Furthermore, this article discusses Bitcoin's\ncurrency-like features and the first regulatory actions take in the European\nUnion and in the United States of America.\n", "versions": [{"version": "v1", "created": "Fri, 30 Aug 2013 14:43:18 GMT"}], "update_date": "2013-09-02", "authors_parsed": [["Sorge", "Artus Krohn-Grimberghe Christoph", ""]]}]