[{"id": "0710.0043", "submitter": "Julian McAuley", "authors": "Julian J. McAuley, Tiberio S. Caetano and Marconi S. Barbosa", "title": "Graph rigidity, Cyclic Belief Propagation and Point Pattern Matching", "comments": "9 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV", "license": null, "abstract": "  A recent paper \\cite{CaeCaeSchBar06} proposed a provably optimal, polynomial\ntime method for performing near-isometric point pattern matching by means of\nexact probabilistic inference in a chordal graphical model. Their fundamental\nresult is that the chordal graph in question is shown to be globally rigid,\nimplying that exact inference provides the same matching solution as exact\ninference in a complete graphical model. This implies that the algorithm is\noptimal when there is no noise in the point patterns. In this paper, we present\na new graph which is also globally rigid but has an advantage over the graph\nproposed in \\cite{CaeCaeSchBar06}: its maximal clique size is smaller,\nrendering inference significantly more efficient. However, our graph is not\nchordal and thus standard Junction Tree algorithms cannot be directly applied.\nNevertheless, we show that loopy belief propagation in such a graph converges\nto the optimal solution. This allows us to retain the optimality guarantee in\nthe noiseless case, while substantially reducing both memory requirements and\nprocessing time. Our experimental results show that the accuracy of the\nproposed solution is indistinguishable from that of \\cite{CaeCaeSchBar06} when\nthere is noise in the point patterns.\n", "versions": [{"version": "v1", "created": "Sat, 29 Sep 2007 06:19:09 GMT"}, {"version": "v2", "created": "Wed, 3 Oct 2007 06:54:12 GMT"}], "update_date": "2007-10-03", "authors_parsed": [["McAuley", "Julian J.", ""], ["Caetano", "Tiberio S.", ""], ["Barbosa", "Marconi S.", ""]]}, {"id": "0710.0243", "submitter": "Julian McAuley", "authors": "Julian John McAuley, Tiberio S. Caetano", "title": "High-Order Nonparametric Belief-Propagation for Fast Image Inpainting", "comments": "8 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV", "license": null, "abstract": "  In this paper, we use belief-propagation techniques to develop fast\nalgorithms for image inpainting. Unlike traditional gradient-based approaches,\nwhich may require many iterations to converge, our techniques achieve\ncompetitive results after only a few iterations. On the other hand, while\nbelief-propagation techniques are often unable to deal with high-order models\ndue to the explosion in the size of messages, we avoid this problem by\napproximating our high-order prior model using a Gaussian mixture. By using\nsuch an approximation, we are able to inpaint images quickly while at the same\ntime retaining good visual results.\n", "versions": [{"version": "v1", "created": "Mon, 1 Oct 2007 09:18:36 GMT"}], "update_date": "2007-10-02", "authors_parsed": [["McAuley", "Julian John", ""], ["Caetano", "Tiberio S.", ""]]}, {"id": "0710.0410", "submitter": "Philip Baback Alipour", "authors": "Philip B. Alipour", "title": "The Theory of Unified Relativity for a Biovielectroluminescence\n  Phenomenon via Fly's Visual and Imaging System", "comments": "51 pages, 4 figures (2 multi-figures), 4 tables, 3 Appendices, 1\n  Animation clip. This is a personalized report, extension to project license\n  No. TXU001347562. A very concise report is to be published in other journals\n  encompassing the relevant categories on computing and physical sciences", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.CV", "license": null, "abstract": "  The elucidation upon fly's neuronal patterns as a link to computer graphics\nand memory cards I/O's, is investigated for the phenomenon by propounding a\nunified theory of Einstein's two known relativities. It is conclusive that\nflies could contribute a certain amount of neuromatrices indicating an imagery\nfunction of a visual-computational system into computer graphics and storage\nsystems. The visual system involves the time aspect, whereas flies possess\nfaster pulses compared to humans' visual ability due to the E-field state on an\nactive fly's eye surface. This behaviour can be tested on a dissected fly\nspecimen at its ommatidia. Electro-optical contacts and electrodes are wired\nthrough the flesh forming organic emitter layer to stimulate light emission,\nthereby to a computer circuit. The next step is applying a threshold voltage\nwith secondary voltages to the circuit denoting an array of essential\nelectrodes for bit switch. As a result, circuit's dormant pulses versus active\npulses at the specimen's area are recorded. The outcome matrix possesses a\nconstruction of RGB and time radicals expressing the time problem in\nconsumption, allocating time into computational algorithms, enhancing the\ntechnology far beyond. The obtained formulation generates consumed distance\ncons(x), denoting circuital travel between data source/sink for pixel data and\nbendable wavelengths. Once 'image logic' is in place, incorporating this point\nof graphical acceleration permits one to enhance graphics and optimize\nimmensely central processing, data transmissions between memory and computer\nvisual system. The phenomenon can be mainly used in 360-deg. display/viewing,\n3D scanning techniques, military and medicine, a robust and cheap substitution\nfor e.g. pre-motion pattern analysis, real-time rendering and LCDs.\n", "versions": [{"version": "v1", "created": "Mon, 1 Oct 2007 23:55:50 GMT"}], "update_date": "2009-12-05", "authors_parsed": [["Alipour", "Philip B.", ""]]}, {"id": "0710.0736", "submitter": "Alessandro Tomasi", "authors": "David A Kay (Oxford University Computational Laboratory), Alessandro\n  Tomasi (University of Sussex)", "title": "Colour image segmentation by the vector-valued Allen-Cahn phase-field\n  model: a multigrid solution", "comments": "17 pages, 9 figures", "journal-ref": "IEEE Trans. Im. Proc. 18.10 (2009)", "doi": "10.1109/TIP.2009.2026678", "report-no": null, "categories": "cs.CV cs.NA", "license": null, "abstract": "  We propose a new method for the numerical solution of a PDE-driven model for\ncolour image segmentation and give numerical examples of the results. The\nmethod combines the vector-valued Allen-Cahn phase field equation with initial\ndata fitting terms. This method is known to be closely related to the\nMumford-Shah problem and the level set segmentation by Chan and Vese. Our\nnumerical solution is performed using a multigrid splitting of a finite element\nspace, thereby producing an efficient and robust method for the segmentation of\nlarge images.\n", "versions": [{"version": "v1", "created": "Wed, 3 Oct 2007 08:51:44 GMT"}], "update_date": "2018-06-08", "authors_parsed": [["Kay", "David A", "", "Oxford University Computational Laboratory"], ["Tomasi", "Alessandro", "", "University of Sussex"]]}, {"id": "0710.1870", "submitter": "Mireille Boutin", "authors": "Mireille Boutin and Gregor Kemper", "title": "Lossless Representation of Graphs using Distributions", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CV", "license": null, "abstract": "  We consider complete graphs with edge weights and/or node weights taking\nvalues in some set. In the first part of this paper, we show that a large\nnumber of graphs are completely determined, up to isomorphism, by the\ndistribution of their sub-triangles. In the second part, we propose graph\nrepresentations in terms of one-dimensional distributions (e.g., distribution\nof the node weights, sum of adjacent weights, etc.). For the case when the\nweights of the graph are real-valued vectors, we show that all graphs, except\nfor a set of measure zero, are uniquely determined, up to isomorphism, from\nthese distributions. The motivating application for this paper is the problem\nof browsing through large sets of graphs.\n", "versions": [{"version": "v1", "created": "Tue, 9 Oct 2007 20:01:59 GMT"}], "update_date": "2007-10-11", "authors_parsed": [["Boutin", "Mireille", ""], ["Kemper", "Gregor", ""]]}, {"id": "0710.2037", "submitter": "Wu Jiang Mr.", "authors": "Wu Jiang, Fei Ding and Qiao-liang Xiang", "title": "An Affinity Propagation Based method for Vector Quantization Codebook\n  Design", "comments": "In this version we make some explaination about the network-support\n  similarity", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV", "license": null, "abstract": "  In this paper, we firstly modify a parameter in affinity propagation (AP) to\nimprove its convergence ability, and then, we apply it to vector quantization\n(VQ) codebook design problem. In order to improve the quality of the resulted\ncodebook, we combine the improved AP (IAP) with the conventional LBG algorithm\nto generate an effective algorithm call IAP-LBG. According to the experimental\nresults, the proposed method not only enhances the convergence abilities but\nalso is capable of providing higher-quality codebooks than conventional LBG\nmethod.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2007 15:12:20 GMT"}, {"version": "v2", "created": "Thu, 11 Oct 2007 11:32:25 GMT"}], "update_date": "2007-10-11", "authors_parsed": [["Jiang", "Wu", ""], ["Ding", "Fei", ""], ["Xiang", "Qiao-liang", ""]]}, {"id": "0710.2231", "submitter": "Daniel Keysers", "authors": "Daniel Keysers", "title": "Comparison and Combination of State-of-the-art Techniques for\n  Handwritten Character Recognition: Topping the MNIST Benchmark", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV", "license": null, "abstract": "  Although the recognition of isolated handwritten digits has been a research\ntopic for many years, it continues to be of interest for the research community\nand for commercial applications. We show that despite the maturity of the\nfield, different approaches still deliver results that vary enough to allow\nimprovements by using their combination. We do so by choosing four\nwell-motivated state-of-the-art recognition systems for which results on the\nstandard MNIST benchmark are available. When comparing the errors made, we\nobserve that the errors made differ between all four systems, suggesting the\nuse of classifier combination. We then determine the error rate of a\nhypothetical system that combines the output of the four systems. The result\nobtained in this manner is an error rate of 0.35% on the MNIST data, the best\nresult published so far. We furthermore discuss the statistical significance of\nthe combined result and of the results of the individual classifiers.\n", "versions": [{"version": "v1", "created": "Thu, 11 Oct 2007 12:22:27 GMT"}], "update_date": "2007-10-12", "authors_parsed": [["Keysers", "Daniel", ""]]}, {"id": "0710.3185", "submitter": "Harki Tanaka", "authors": "Harki Tanaka, Neli Regina Siqueira Ortega, Mauricio Stanzione Galizia,\n  Joao Batista Borges Sobrinho, and Marcelo Britto Passos Amato", "title": "Fuzzy Modeling of Electrical Impedance Tomography Image of the Lungs", "comments": "10 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CV", "license": null, "abstract": "  Electrical Impedance Tomography (EIT) is a functional imaging method that is\nbeing developed for bedside use in critical care medicine. Aiming at improving\nthe chest anatomical resolution of EIT images we developed a fuzzy model based\non EIT high temporal resolution and the functional information contained in the\npulmonary perfusion and ventilation signals. EIT data from an experimental\nanimal model were collected during normal ventilation and apnea while an\ninjection of hypertonic saline was used as a reference . The fuzzy model was\nelaborated in three parts: a modeling of the heart, a pulmonary map from\nventilation images and, a pulmonary map from perfusion images. Image\nsegmentation was performed using a threshold method and a ventilation/perfusion\nmap was generated. EIT images treated by the fuzzy model were compared with the\nhypertonic saline injection method and CT-scan images, presenting good results\nin both qualitative (the image obtained by the model was very similar to that\nof the CT-scan) and quantitative (the ROC curve provided an area equal to 0.93)\npoint of view. Undoubtedly, these results represent an important step in the\nEIT images area, since they open the possibility of developing EIT-based\nbedside clinical methods, which are not available nowadays. These achievements\ncould serve as the base to develop EIT diagnosis system for some\nlife-threatening diseases commonly found in critical care medicine.\n", "versions": [{"version": "v1", "created": "Tue, 16 Oct 2007 22:13:11 GMT"}], "update_date": "2007-10-18", "authors_parsed": [["Tanaka", "Harki", ""], ["Ortega", "Neli Regina Siqueira", ""], ["Galizia", "Mauricio Stanzione", ""], ["Sobrinho", "Joao Batista Borges", ""], ["Amato", "Marcelo Britto Passos", ""]]}, {"id": "0710.5002", "submitter": "Boris Skoric", "authors": "B. Skoric", "title": "The entropy of keys derived from laser speckle", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CV", "license": null, "abstract": "  Laser speckle has been proposed in a number of papers as a high-entropy\nsource of unpredictable bits for use in security applications. Bit strings\nderived from speckle can be used for a variety of security purposes such as\nidentification, authentication, anti-counterfeiting, secure key storage, random\nnumber generation and tamper protection. The choice of laser speckle as a\nsource of random keys is quite natural, given the chaotic properties of\nspeckle. However, this same chaotic behaviour also causes reproducibility\nproblems. Cryptographic protocols require either zero noise or very low noise\nin their inputs; hence the issue of error rates is critical to applications of\nlaser speckle in cryptography. Most of the literature uses an error reduction\nmethod based on Gabor filtering. Though the method is successful, it has not\nbeen thoroughly analysed.\n  In this paper we present a statistical analysis of Gabor-filtered speckle\npatterns. We introduce a model in which perturbations are described as random\nphase changes in the source plane. Using this model we compute the second and\nfourth order statistics of Gabor coefficients. We determine the mutual\ninformation between perturbed and unperturbed Gabor coefficients and the bit\nerror rate in the derived bit string. The mutual information provides an\nabsolute upper bound on the number of secure bits that can be reproducibly\nextracted from noisy measurements.\n", "versions": [{"version": "v1", "created": "Fri, 26 Oct 2007 06:56:23 GMT"}], "update_date": "2007-10-29", "authors_parsed": [["Skoric", "B.", ""]]}, {"id": "0710.5547", "submitter": "Miguel Angel Miron C.E.", "authors": "M. Miron Bernal, H. Coyote Estrada, J. Figueroa Nazuno", "title": "Code Similarity on High Level Programs", "comments": "Proceedings of the 18th Autumn Meeting on Communications, Computers,\n  Electronics and Industrial Exposition. (IEEE - ROCC07). Acapulco, Guerrero,\n  Mexico. 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.DS", "license": null, "abstract": "  This paper presents a new approach for code similarity on High Level\nprograms. Our technique is based on Fast Dynamic Time Warping, that builds a\nwarp path or points relation with local restrictions. The source code is\nrepresented into Time Series using the operators inside programming languages\nthat makes possible the comparison. This makes possible subsequence detection\nthat represent similar code instructions. In contrast with other code\nsimilarity algorithms, we do not make features extraction. The experiments show\nthat two source codes are similar when their respective Time Series are\nsimilar.\n", "versions": [{"version": "v1", "created": "Mon, 29 Oct 2007 22:39:21 GMT"}], "update_date": "2007-10-31", "authors_parsed": [["Bernal", "M. Miron", ""], ["Estrada", "H. Coyote", ""], ["Nazuno", "J. Figueroa", ""]]}]