[{"id": "0801.0079", "submitter": "Weizhen Wang", "authors": "Weizhen Wang and Jianan Peng", "title": "An Algorithm to Estimate Monotone Normal Means and its Application to\n  Identify the Minimum Effective Dose", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  In the standard setting of one-way ANOVA with normal errors, a new algorithm,\ncalled the Step Down Maximum Mean Selection Algorithm (SDMMSA), is proposed to\nestimate the treatment means under an assumption that the treatment mean is\nnondecreasing in the factor level. We prove that i) the SDMMSA and the Pooled\nAdjacent Violator Algorithm (PAVA), a widely used algorithm in many problems,\ngenerate the same estimators for normal means, ii) the estimators are the\nmle's, and iii) the distribution of each of the estimators is stochastically\nnondecreasing in each of the treatment means. As an application of this\nstochastic ordering, a sequence of null hypotheses to identify the minimum\neffective dose (MED) is formulated under the assumption of monotone\ntreatment(dose) means. A step-up testing procedure, which controls the\nexperimentwise error rate in the strong sense, is constructed. When the MED=1,\nthe proposed test is uniformly more powerful than Hsu and Berger's (1999).\n", "versions": [{"version": "v1", "created": "Sat, 29 Dec 2007 16:57:30 GMT"}], "update_date": "2008-01-03", "authors_parsed": [["Wang", "Weizhen", ""], ["Peng", "Jianan", ""]]}, {"id": "0801.0158", "submitter": "Celine Levy-Leduc", "authors": "C\\'eline L\\'evy-Leduc (LTCI), Eric Moulines (LTCI), Fran\\c{c}ois\n  Roueff (LTCI)", "title": "Frequency estimation based on the cumulated Lomb-Scargle periodogram", "comments": "Nombre de pages : 22", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  We consider the problem of estimating the period of an unknown periodic\nfunction observed in additive noise sampled at irregularly spaced time instants\nin a semiparametric setting. To solve this problem, we propose a novel\nestimator based on the cumulated Lomb-Scargle periodogram. We prove that this\nestimator is consistent, asymptotically Gaussian and we provide an explicit\nexpression of the asymptotic variance. Some Monte-Carlo experiments are then\npresented to support our claims.\n", "versions": [{"version": "v1", "created": "Sun, 30 Dec 2007 19:24:32 GMT"}], "update_date": "2008-01-03", "authors_parsed": [["Lévy-Leduc", "Céline", "", "LTCI"], ["Moulines", "Eric", "", "LTCI"], ["Roueff", "François", "", "LTCI"]]}, {"id": "0801.0207", "submitter": "Myriam Maumy", "authors": "Myriam Maumy (IRMA), B. Boulanger, W. Dewe, A. Gilbert, B. Govaerts", "title": "Risk management for analytical methods: conciliating objectives of\n  methods, validation phase and routine decision rules", "comments": null, "journal-ref": "Dans Actes du congr\\`es de Chimiom\\'etrie 2005 - Risk management\n  for analytical methods: conciliating objectives of methods, validation phase\n  and routine decision rules., France (2005)", "doi": null, "report-no": null, "categories": "stat.AP math.ST stat.TH", "license": null, "abstract": "  In the industries that involved either chemistry or biology, such as\npharmaceutical industries, chemical industries or food industry, the analytical\nmethods are the necessary eyes and hear of all the material produced or used.\nIf the quality of an analytical method is doubtful, then the whole set of\ndecision that will be based on those measures is questionable. For those\nreasons, being able to assess the quality of an analytical method is far more\nthan a statistical challenge; it's a matter of ethic and good business\npractices. Many regulatory documents have been releases, primarily ICH and FDA\ndocuments in the pharmaceutical industry (FDA, 1995, 1997, 2001) to address\nthat issue.\n", "versions": [{"version": "v1", "created": "Mon, 31 Dec 2007 14:05:52 GMT"}], "update_date": "2008-01-03", "authors_parsed": [["Maumy", "Myriam", "", "IRMA"], ["Boulanger", "B.", ""], ["Dewe", "W.", ""], ["Gilbert", "A.", ""], ["Govaerts", "B.", ""]]}, {"id": "0801.0345", "submitter": "Emmanuel Candes", "authors": "Emmanuel J. Cand\\`es, Yaniv Plan", "title": "Near-ideal model selection by $\\ell_1$ minimization", "comments": "Published in at http://dx.doi.org/10.1214/08-AOS653 the Annals of\n  Statistics (http://www.imstat.org/aos/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Annals of Statistics 2009, Vol. 37, No. 5A, 2145-2177", "doi": "10.1214/08-AOS653", "report-no": "IMS-AOS-AOS653", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the fundamental problem of estimating the mean of a vector\n$y=X\\beta+z$, where $X$ is an $n\\times p$ design matrix in which one can have\nfar more variables than observations, and $z$ is a stochastic error term--the\nso-called \"$p>n$\" setup. When $\\beta$ is sparse, or, more generally, when there\nis a sparse subset of covariates providing a close approximation to the unknown\nmean vector, we ask whether or not it is possible to accurately estimate\n$X\\beta$ using a computationally tractable algorithm. We show that, in a\nsurprisingly wide range of situations, the lasso happens to nearly select the\nbest subset of variables. Quantitatively speaking, we prove that solving a\nsimple quadratic program achieves a squared error within a logarithmic factor\nof the ideal mean squared error that one would achieve with an oracle supplying\nperfect information about which variables should and should not be included in\nthe model. Interestingly, our results describe the average performance of the\nlasso; that is, the performance one can expect in an vast majority of cases\nwhere $X\\beta$ is a sparse or nearly sparse superposition of variables, but not\nin all cases. Our results are nonasymptotic and widely applicable, since they\nsimply require that pairs of predictor variables are not too collinear.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jan 2008 07:06:12 GMT"}, {"version": "v2", "created": "Sun, 6 Jan 2008 01:10:27 GMT"}, {"version": "v3", "created": "Fri, 21 Aug 2009 05:15:34 GMT"}], "update_date": "2009-08-21", "authors_parsed": [["Candès", "Emmanuel J.", ""], ["Plan", "Yaniv", ""]]}, {"id": "0801.0461", "submitter": "Shane Jensen", "authors": "Hanna M. Wallach, Shane T. Jensen, Lee Dicker and Katherine A. Heller", "title": "An Alternative Prior Process for Nonparametric Bayesian Clustering", "comments": null, "journal-ref": "Proceedings of the Thirteenth International Conference on\n  Artificial Intelligence and Statistics (AISTATS) 2010, JMLR W & CP 9, pp.\n  892-899", "doi": null, "report-no": null, "categories": "stat.ME math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Prior distributions play a crucial role in Bayesian approaches to clustering.\nTwo commonly-used prior distributions are the Dirichlet and Pitman-Yor\nprocesses. In this paper, we investigate the predictive probabilities that\nunderlie these processes, and the implicit \"rich-get-richer\" characteristic of\nthe resulting partitions. We explore an alternative prior for nonparametric\nBayesian clustering -- the uniform process -- for applications where the\n\"rich-get-richer\" property is undesirable. We also explore the cost of this\nprocess: partitions are no longer exchangeable with respect to the ordering of\nvariables. We present new asymptotic and simulation-based results for the\nclustering characteristics of the uniform process and compare these with known\nresults for the Dirichlet and Pitman-Yor processes. We compare performance on a\nreal document clustering task, demonstrating the practical advantage of the\nuniform process despite its lack of exchangeability over orderings.\n", "versions": [{"version": "v1", "created": "Thu, 3 Jan 2008 01:10:20 GMT"}, {"version": "v2", "created": "Fri, 15 Oct 2010 16:17:32 GMT"}], "update_date": "2010-10-18", "authors_parsed": [["Wallach", "Hanna M.", ""], ["Jensen", "Shane T.", ""], ["Dicker", "Lee", ""], ["Heller", "Katherine A.", ""]]}, {"id": "0801.0712", "submitter": "Hanna Jankowski", "authors": "Hanna K. Jankowski, Jon A. Wellner", "title": "Nonparametric estimation of a convex bathtub-shaped hazard function", "comments": "Published in at http://dx.doi.org/10.3150/09-BEJ202 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2009, Vol. 15, No. 4, 1010-1035", "doi": "10.3150/09-BEJ202", "report-no": "IMS-BEJ-BEJ202", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the nonparametric maximum likelihood estimator (MLE)\nof a convex hazard function. We show that the MLE is consistent and converges\nat a local rate of $n^{2/5}$ at points $x_0$ where the true hazard function is\npositive and strictly convex. Moreover, we establish the pointwise asymptotic\ndistribution theory of our estimator under these same assumptions. One notable\nfeature of the nonparametric MLE studied here is that no arbitrary choice of\ntuning parameter (or complicated data-adaptive selection of the tuning\nparameter) is required.\n", "versions": [{"version": "v1", "created": "Fri, 4 Jan 2008 17:55:06 GMT"}, {"version": "v2", "created": "Thu, 14 Jan 2010 08:46:23 GMT"}], "update_date": "2010-01-14", "authors_parsed": [["Jankowski", "Hanna K.", ""], ["Wellner", "Jon A.", ""]]}, {"id": "0801.0848", "submitter": "Nathalie Villa", "authors": "Romain Boulet (IMT), Bertrand Jouve (IMT), Fabrice Rossi (INRIA\n  Rocquencourt / INRIA Sophia Antipolis), Nathalie Villa (IMT)", "title": "Batch kernel SOM and related Laplacian methods for social network\n  analysis", "comments": null, "journal-ref": "Neurocomputing / EEG Neurocomputing (2008) A para\\^itre", "doi": null, "report-no": null, "categories": "stat.AP math.ST stat.ME stat.ML stat.TH", "license": null, "abstract": "  Large graphs are natural mathematical models for describing the structure of\nthe data in a wide variety of fields, such as web mining, social networks,\ninformation retrieval, biological networks, etc. For all these applications,\nautomatic tools are required to get a synthetic view of the graph and to reach\na good understanding of the underlying problem. In particular, discovering\ngroups of tightly connected vertices and understanding the relations between\nthose groups is very important in practice. This paper shows how a kernel\nversion of the batch Self Organizing Map can be used to achieve these goals via\nkernels derived from the Laplacian matrix of the graph, especially when it is\nused in conjunction with more classical methods based on the spectral analysis\nof the graph. The proposed method is used to explore the structure of a\nmedieval social network modeled through a weighted graph that has been directly\nbuilt from a large corpus of agrarian contracts.\n", "versions": [{"version": "v1", "created": "Sun, 6 Jan 2008 08:28:15 GMT"}], "update_date": "2008-01-08", "authors_parsed": [["Boulet", "Romain", "", "IMT"], ["Jouve", "Bertrand", "", "IMT"], ["Rossi", "Fabrice", "", "INRIA\n  Rocquencourt / INRIA Sophia Antipolis"], ["Villa", "Nathalie", "", "IMT"]]}, {"id": "0801.0970", "submitter": "Nathalie Akakpo", "authors": "Nathalie Akakpo", "title": "Detecting change-points in a discrete distribution via model selection", "comments": "Submitted to the Electronic Journal of Statistics\n  (http://www.i-journals.org/ejs/) by the Institute of Mathematical Statistics\n  (http://www.imstat.org)", "journal-ref": null, "doi": null, "report-no": "IMS-EJS-EJS_2008_170", "categories": "math.ST stat.TH", "license": null, "abstract": "  This paper is concerned with the detection of multiple change-points in the\njoint distribution of independent categorical variables. The procedures\nintroduced rely on model selection and are based on a penalized least-squares\ncriterion. Their performance is assessed from a nonasymptotic point of view.\nUsing a special collection of models, a preliminary estimator is built.\nAccording to an existing model selection theorem, it satisfies an oracle-type\ninequality. Moreover, thanks to an approximation result demonstrated in this\npaper, it is also proved to be adaptive in the minimax sense. In order to\neliminate some irrelevant change-points selected by that first estimator, a\ntwo-stage procedure is proposed, that also enjoys some adaptivity property.\nBesides, the first estimator can be computed with a complexity only linear in\nthe size of the data. A heuristic method allows to implement the second\nprocedure quite satisfactorily with the same computational complexity.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2008 13:17:05 GMT"}], "update_date": "2008-01-08", "authors_parsed": [["Akakpo", "Nathalie", ""]]}, {"id": "0801.0976", "submitter": "Yann Rebille", "authors": "Yann Rebille", "title": "Laws of Large Numbers for Continuous Belief Measures on Compact Spaces", "comments": "This paper has been withdrawn by the author, due a publication. 18\n  pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove for outer continuous belief measures defined on compact spaces\nstrong and weak laws of large numbers as Kolmogorov's one for measures. These\nresults contribute to M. Marinacci's (Journal of Economic Theory 84 (1999)\n145-195) though with different methods.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2008 13:42:59 GMT"}, {"version": "v2", "created": "Mon, 1 Jun 2009 20:44:35 GMT"}], "update_date": "2009-06-02", "authors_parsed": [["Rebille", "Yann", ""]]}, {"id": "0801.0984", "submitter": "Yann Rebille", "authors": "Yann Rebille", "title": "Law of large numbers for non-additive measures", "comments": "This paper has been withdrawn by the author, due a publication. 12\n  pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our aim is to give for some classes non-additive measures some limit\ntheorems. For balanced games we obtain a weak and strong law of large numbers\nfor bounded random variables, a sharper conclusion is obtain with exact games.\nWe provide an extension to upper enveloppe measures.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2008 13:59:48 GMT"}, {"version": "v2", "created": "Mon, 1 Jun 2009 20:47:29 GMT"}], "update_date": "2009-06-02", "authors_parsed": [["Rebille", "Yann", ""]]}, {"id": "0801.1095", "submitter": "Ya'acov Ritov", "authors": "Peter J. Bickel, Ya'acov Ritov, and Alexandre B. Tsybakov", "title": "Simultaneous analysis of Lasso and Dantzig selector", "comments": "Noramlization factor corrected", "journal-ref": "The Annals of Statistics 2009, Vol. 37, No. 4, 1705-1732", "doi": "10.1214/08-AOS620", "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We exhibit an approximate equivalence between the Lasso estimator and Dantzig\nselector. For both methods we derive parallel oracle inequalities for the\nprediction risk in the general nonparametric regression model, as well as\nbounds on the $\\ell_p$ estimation loss for $1\\le p\\le 2$ in the linear model\nwhen the number of variables can be much larger than the sample size.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2008 19:05:11 GMT"}, {"version": "v2", "created": "Sun, 7 Nov 2010 14:41:57 GMT"}, {"version": "v3", "created": "Tue, 9 Nov 2010 08:17:12 GMT"}], "update_date": "2010-11-10", "authors_parsed": [["Bickel", "Peter J.", ""], ["Ritov", "Ya'acov", ""], ["Tsybakov", "Alexandre B.", ""]]}, {"id": "0801.1158", "submitter": "Ya'acov Ritov", "authors": "Peter J. Bickel, Ya'acov Ritov, and Alexander B. Tsybakov", "title": "Hierarchical selection of variables in sparse high-dimensional\n  regression", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  We study a regression model with a huge number of interacting variables. We\nconsider a specific approximation of the regression function under two\nssumptions: (i) there exists a sparse representation of the regression function\nin a suggested basis, (ii) there are no interactions outside of the set of the\ncorresponding main effects. We suggest an hierarchical randomized search\nprocedure for selection of variables and of their interactions. We show that\ngiven an initial estimator, an estimator with a similar prediction loss but\nwith a smaller number of non-zero coordinates can be found.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2008 05:21:54 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Bickel", "Peter J.", ""], ["Ritov", "Ya'acov", ""], ["Tsybakov", "Alexander B.", ""]]}, {"id": "0801.1196", "submitter": "Gert De Cooman", "authors": "Gert de Cooman, Filip Hermans", "title": "Imprecise probability trees: Bridging two theories of imprecise\n  probability", "comments": "30 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.ML stat.TH", "license": null, "abstract": "  We give an overview of two approaches to probability theory where lower and\nupper probabilities, rather than probabilities, are used: Walley's behavioural\ntheory of imprecise probabilities, and Shafer and Vovk's game-theoretic account\nof probability. We show that the two theories are more closely related than\nwould be suspected at first sight, and we establish a correspondence between\nthem that (i) has an interesting interpretation, and (ii) allows us to freely\nimport results from one theory into the other. Our approach leads to an account\nof probability trees and random processes in the framework of Walley's theory.\nWe indicate how our results can be used to reduce the computational complexity\nof dealing with imprecision in probability trees, and we prove an interesting\nand quite general version of the weak law of large numbers.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2008 09:46:44 GMT"}], "update_date": "2008-01-09", "authors_parsed": [["de Cooman", "Gert", ""], ["Hermans", "Filip", ""]]}, {"id": "0801.1265", "submitter": "Gert De Cooman", "authors": "Gert de Cooman, Erik Quaeghebeur, Enrique Miranda", "title": "Exchangeable lower previsions", "comments": "1 figure. 26 pages. Submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.ME stat.TH", "license": null, "abstract": "  We extend de Finetti's (1937) notion of exchangeability to finite and\ncountable sequences of variables, when a subject's beliefs about them are\nmodelled using coherent lower previsions rather than (linear) previsions. We\nprove representation theorems in both the finite and the countable case, in\nterms of sampling without and with replacement, respectively. We also establish\na convergence result for sample means of exchangeable sequences. Finally, we\nstudy and solve the problem of exchangeable natural extension: how to find the\nmost conservative (point-wise smallest) coherent and exchangeable lower\nprevision that dominates a given lower prevision.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2008 16:13:29 GMT"}], "update_date": "2008-01-09", "authors_parsed": [["de Cooman", "Gert", ""], ["Quaeghebeur", "Erik", ""], ["Miranda", "Enrique", ""]]}, {"id": "0801.1357", "submitter": "Weidong Liu", "authors": "Zhengyan Lin, Weidong Liu", "title": "On maxima of periodograms of stationary processes", "comments": "The constant A_n in Lemma 4.2 on page 23 (Supplementary Material) is\n  corrected. Other context remains the same", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the limit distribution of maxima of periodograms for stationary\nprocesses. Our method is based on $m$-dependent approximation for stationary\nprocesses and a moderate deviation result.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jan 2008 06:32:56 GMT"}, {"version": "v2", "created": "Tue, 29 Jan 2008 09:56:45 GMT"}, {"version": "v3", "created": "Mon, 10 Aug 2009 15:47:46 GMT"}, {"version": "v4", "created": "Tue, 11 Aug 2009 05:44:08 GMT"}], "update_date": "2009-08-11", "authors_parsed": [["Lin", "Zhengyan", ""], ["Liu", "Weidong", ""]]}, {"id": "0801.1440", "submitter": "Monia Lupparelli", "authors": "Monia Lupparelli, Giovanni M. Marchetti and Wicher P. Bergsma", "title": "Parameterizations and fitting of bi-directed graph models to categorical\n  data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML math.ST stat.TH", "license": null, "abstract": "  We discuss two parameterizations of models for marginal independencies for\ndiscrete distributions which are representable by bi-directed graph models,\nunder the global Markov property. Such models are useful data analytic tools\nespecially if used in combination with other graphical models. The first\nparameterization, in the saturated case, is also known as the multivariate\nlogistic transformation, the second is a variant that allows, in some (but not\nall) cases, variation independent parameters. An algorithm for maximum\nlikelihood fitting is proposed, based on an extension of the Aitchison and\nSilvey method.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jan 2008 14:29:17 GMT"}], "update_date": "2008-01-10", "authors_parsed": [["Lupparelli", "Monia", ""], ["Marchetti", "Giovanni M.", ""], ["Bergsma", "Wicher P.", ""]]}, {"id": "0801.1598", "submitter": "Karsten Keller", "authors": "Mathieu Sinn and Karsten Keller", "title": "Estimation of ordinal pattern probabilities in fractional Brownian\n  motion", "comments": "24 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": null, "abstract": "  For equidistant discretizations of fractional Brownian motion (fBm), the\nprobabilities of ordinal patterns of order d=2 are monotonically related to the\nHurst parameter H. By plugging the sample relative frequency of those patterns\nindicating changes between up and down into the monotonic relation to H, one\nobtains the Zero Crossing (ZC) estimator of the Hurst parameter which has found\nconsiderable attention in mathematical and applied research.\n  In this paper, we generally discuss the estimation of ordinal pattern\nprobabilities in fBm. As it turns out, according to the sufficiency principle,\nfor ordinal patterns of order d=2 any reasonable estimator is an affine\nfunctional of the sample relative frequency of changes. We establish strong\nconsistency of the estimators and show them to be asymptotically normal for\nH<3/4. Further, we derive confidence intervals for the Hurst parameter.\nSimulation studies show that the ZC estimator has larger variance but less bias\nthan the HEAF estimator of the Hurst parameter.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jan 2008 13:29:23 GMT"}], "update_date": "2008-01-11", "authors_parsed": [["Sinn", "Mathieu", ""], ["Keller", "Karsten", ""]]}, {"id": "0801.1758", "submitter": "Piero Barone", "authors": "Piero Barone", "title": "A new transform for solving the noisy complex exponentials approximation\n  problem", "comments": "42 pages, 5 figures", "journal-ref": "Journal of Approximation Theory, vol.155, pp. 1-27, 2008", "doi": "10.1016/j.jat.2008.04.007", "report-no": null, "categories": "math.ST math.NA stat.ME stat.TH", "license": null, "abstract": "  The problem of estimating a complex measure made up by a linear combination\nof Dirac distributions centered on points of the complex plane from a finite\nnumber of its complex moments affected by additive i.i.d. Gaussian noise is\nconsidered. A random measure is defined whose expectation approximates the\nunknown measure under suitable conditions. An estimator of the approximating\nmeasure is then proposed as well as a new discrete transform of the noisy\nmoments that allows to compute an estimate of the unknown measure. A small\nsimulation study is also performed to experimentally check the goodness of the\napproximations.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jan 2008 11:30:34 GMT"}], "update_date": "2012-05-03", "authors_parsed": [["Barone", "Piero", ""]]}, {"id": "0801.1951", "submitter": "Andreas Kyprianou A.E.", "authors": "A. E. Kyprianou, V. Rivero, R. Song", "title": "Convexity and smoothness of scale functions and de Finetti's control\n  problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Under appropriate conditions, we obtain smoothness and convexity properties\nof $q$-scale functions for spectrally negative L\\'evy processes. Our method\nappeals directly to very recent developments in the theory of potential\nanalysis of subordinators. As an application of the latter results to scale\nfunctions, we are able to continue the very recent work of \\cite{APP2007} and\n\\cite{Loe}. We strengthen their collective conclusions by showing, amongst\nother results, that whenever the L\\'evy measure has a density which is log\nconvex then for $q>0$ the scale function $W^{(q)}$ is convex on some half line\n$(a^*,\\infty)$ where $a^*$ is the largest value at which $W^{(q)\\prime}$\nattains its global minimum. As a consequence we deduce that de Finetti's\nclassical actuarial control problem is solved by a barrier strategy where the\nbarrier is positioned at height $a^*$.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jan 2008 12:15:27 GMT"}, {"version": "v2", "created": "Wed, 16 Jan 2008 23:57:02 GMT"}, {"version": "v3", "created": "Mon, 25 Aug 2008 11:35:32 GMT"}], "update_date": "2008-08-25", "authors_parsed": [["Kyprianou", "A. E.", ""], ["Rivero", "V.", ""], ["Song", "R.", ""]]}, {"id": "0801.1966", "submitter": "Gert De Cooman", "authors": "Gert de Cooman and Enrique Miranda", "title": "Symmetry of models versus models of symmetry", "comments": "61 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  A model for a subject's beliefs about a phenomenon may exhibit symmetry, in\nthe sense that it is invariant under certain transformations. On the other\nhand, such a belief model may be intended to represent that the subject\nbelieves or knows that the phenomenon under study exhibits symmetry. We defend\nthe view that these are fundamentally different things, even though the\ndifference cannot be captured by Bayesian belief models. In fact, the failure\nto distinguish between both situations leads to Laplace's so-called Principle\nof Insufficient Reason, which has been criticised extensively in the\nliterature.\n  We show that there are belief models (imprecise probability models, coherent\nlower previsions) that generalise and include the Bayesian belief models, but\nwhere this fundamental difference can be captured. This leads to two notions of\nsymmetry for such belief models: weak invariance (representing symmetry of\nbeliefs) and strong invariance (modelling beliefs of symmetry). We discuss\nvarious mathematical as well as more philosophical aspects of these notions. We\nalso discuss a few examples to show the relevance of our findings both to\nprobabilistic modelling and to statistical inference, and to the notion of\nexchangeability in particular.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jan 2008 16:15:17 GMT"}], "update_date": "2008-01-15", "authors_parsed": [["de Cooman", "Gert", ""], ["Miranda", "Enrique", ""]]}, {"id": "0801.2070", "submitter": "Baba Thiam", "authors": "Abdelkader Mokkadem (LM-Versailles), Mariane Pelletier\n  (LM-Versailles), Baba Thiam (LM-Versailles)", "title": "Joint behaviour of semirecursive kernel estimators of the location and\n  of the size of the mode of a probability density function", "comments": "26 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  Let $\\theta$ and $\\mu$ denote the location and the size of the mode of a\nprobability density. We study the joint convergence rates of semirecursive\nkernel estimators of $\\theta$ and $\\mu$. We show how the estimation of the size\nof the mode allows to measure the relevance of the estimation of its location.\nWe also enlighten that, beyond their computational advantage on nonrecursive\nestimators, the semirecursive estimators are preferable to use for the\nconstruction on confidence regions.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jan 2008 13:11:34 GMT"}], "update_date": "2008-01-15", "authors_parsed": [["Mokkadem", "Abdelkader", "", "LM-Versailles"], ["Pelletier", "Mariane", "", "LM-Versailles"], ["Thiam", "Baba", "", "LM-Versailles"]]}, {"id": "0801.2083", "submitter": "S. Satheesh", "authors": "S. Satheesh and E. Sandhya", "title": "Geometric Gamma Max-Infinitely Divisible Models", "comments": "6 Pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": null, "abstract": "  A transformation of gamma max-infinitely divisible laws viz. geometric gamma\nmax-infinitely divisible laws is considered in this paper. Some of its\ndistributional and divisibility properties are discussed and a random time\nchanged extremal process corresponding to this distribution is presented. A new\nkind of invariance (stability) under geometric maxima is proved and a max-AR(1)\nmodel corresponding to it is also discussed.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jan 2008 14:26:30 GMT"}], "update_date": "2008-01-15", "authors_parsed": [["Satheesh", "S.", ""], ["Sandhya", "E.", ""]]}, {"id": "0801.2224", "submitter": "Dan J. Spitzner", "authors": "Dan J. Spitzner", "title": "A powerful test based on tapering for use in functional data analysis", "comments": "Published in at http://dx.doi.org/10.1214/08-EJS172 the Electronic\n  Journal of Statistics (http://www.i-journals.org/ejs/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Electronic Journal of Statistics 2008, Vol. 2, 939-962", "doi": "10.1214/08-EJS172", "report-no": "IMS-EJS-EJS_2008_172", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A test based on tapering is proposed for use in testing a global linear\nhypothesis under a functional linear model. The test statistic is constructed\nas a weighted sum of squared linear combinations of Fourier coefficients, a\ntapered quadratic form, in which higher Fourier frequencies are down-weighted\nso as to emphasize the smooth attributes of the model. A formula is\n$Q_n^{OPT}=n\\sum_{j=1}^{p_n}j^{-1/2}\\|\\boldsymbol{Y}_{n,j}\\|^2$. Down-weighting\nby $j^{-1/2}$ is selected to achieve adaptive optimality among tests based on\ntapering with respect to its ``rates of testing,'' an asymptotic framework for\nmeasuring a test's retention of power in high dimensions under smoothness\nconstraints. Existing tests based on truncation or thresholding are known to\nhave superior asymptotic power in comparison with any test based on tapering;\nhowever, it is shown here that high-order effects can be substantial, and that\na test based on $Q_n^{OPT}$ exhibits better (non-asymptotic) power against the\nsort of alternatives that would typically be of concern in functional data\nanalysis applications. The proposed test is developed for use in practice, and\ndemonstrated in an example application.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jan 2008 07:36:08 GMT"}, {"version": "v2", "created": "Thu, 9 Oct 2008 12:49:59 GMT"}], "update_date": "2008-10-09", "authors_parsed": [["Spitzner", "Dan J.", ""]]}, {"id": "0801.2231", "submitter": "Jian-feng Yao", "authors": "C\\'ecile Hardouin, Jian-Feng Yao", "title": "Spatial modelling for mixed-state observations", "comments": "Published in at http://dx.doi.org/10.1214/08-EJS173 the Electronic\n  Journal of Statistics (http://www.i-journals.org/ejs/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Electronic Journal of Statistics 2008, Vol. 2, 213-233", "doi": "10.1214/08-EJS173", "report-no": "IMS-EJS-EJS_2008_173", "categories": "math.ST stat.TH", "license": null, "abstract": "  In several application fields like daily pluviometry data modelling, or\nmotion analysis from image sequences, observations contain two components of\ndifferent nature. A first part is made with discrete values accounting for some\nsymbolic information and a second part records a continuous (real-valued)\nmeasurement. We call such type of observations \"mixed-state observations\". This\npaper introduces spatial models suited for the analysis of these kinds of data.\nWe consider multi-parameter auto-models whose local conditional distributions\nbelong to a mixed state exponential family. Specific examples with exponential\ndistributions are detailed, and we present some experimental results for\nmodelling motion measurements from video sequences.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jan 2008 15:04:51 GMT"}, {"version": "v2", "created": "Thu, 27 Mar 2008 08:13:32 GMT"}], "update_date": "2008-03-27", "authors_parsed": [["Hardouin", "Cécile", ""], ["Yao", "Jian-Feng", ""]]}, {"id": "0801.2456", "submitter": "Aurelien Garivier", "authors": "St\\'ephane Boucheron (PMA), Aur\\'elien Garivier (LM-Orsay), Elisabeth\n  Gassiat (LM-Orsay)", "title": "Coding on countably infinite alphabets", "comments": "33 pages", "journal-ref": "Information Theory, IEEE Transactions on (Volume:55 , Issue: 1 )\n  358 - 373 Jan. 2009", "doi": "10.1109/TIT.2008.2008150", "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  This paper describes universal lossless coding strategies for compressing\nsources on countably infinite alphabets. Classes of memoryless sources defined\nby an envelope condition on the marginal distribution provide benchmarks for\ncoding techniques originating from the theory of universal coding over finite\nalphabets. We prove general upper-bounds on minimax regret and lower-bounds on\nminimax redundancy for such source classes. The general upper bounds emphasize\nthe role of the Normalized Maximum Likelihood codes with respect to minimax\nregret in the infinite alphabet context. Lower bounds are derived by tailoring\nsharp bounds on the redundancy of Krichevsky-Trofimov coders for sources over\nfinite alphabets. Up to logarithmic (resp. constant) factors the bounds are\nmatching for source classes defined by algebraically declining (resp.\nexponentially vanishing) envelopes. Effective and (almost) adaptive coding\ntechniques are described for the collection of source classes defined by\nalgebraically vanishing envelopes. Those results extend ourknowledge concerning\nuniversal coding to contexts where the key tools from parametric inference\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2008 08:52:26 GMT"}], "update_date": "2015-01-05", "authors_parsed": [["Boucheron", "Stéphane", "", "PMA"], ["Garivier", "Aurélien", "", "LM-Orsay"], ["Gassiat", "Elisabeth", "", "LM-Orsay"]]}, {"id": "0801.2509", "submitter": "Akihiko Inoue", "authors": "Akihiko Inoue, Yukio Kasahara and Punam Phartyal", "title": "Baxter's inequality for fractional Brownian motion-type processes with\n  Hurst index less than 1/2", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": null, "abstract": "  The aim of this paper is to prove an analogue of Baxter's inequality for\nfractional Brownian motion-type processes with Hurst index less than 1/2. This\ninequality is concerned with the norm estimate of the difference between\nfinite- and infinite-past predictor coefficients.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2008 15:12:02 GMT"}], "update_date": "2008-01-17", "authors_parsed": [["Inoue", "Akihiko", ""], ["Kasahara", "Yukio", ""], ["Phartyal", "Punam", ""]]}, {"id": "0801.2624", "submitter": "Claire Lacour", "authors": "Claire Lacour", "title": "Least squares type estimation of the transition density of a particular\n  hidden Markov chain", "comments": "Published in at http://dx.doi.org/10.1214/07-EJS111 the Electronic\n  Journal of Statistics (http://www.i-journals.org/ejs/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Electronic Journal of Statistics 2008, Vol. 2, 1-39", "doi": "10.1214/07-EJS111", "report-no": "IMS-EJS-EJS_2007_111", "categories": "math.ST stat.TH", "license": null, "abstract": "  In this paper, we study the following model of hidden Markov chain:\n$Y_i=X_i+\\epsilon_i$, $i=1,...,n+1$ with $(X_i)$ a real-valued stationary\nMarkov chain and $(\\epsilon_i)_{1\\leq i\\leq n+1}$ a noise having a known\ndistribution and independent of the sequence $(X_i)$. We present an estimator\nof the transition density obtained by minimization of an original contrast that\ntakes advantage of the regressive aspect of the problem. It is selected among a\ncollection of projection estimators with a model selection method. The\n$L^2$-risk and its rate of convergence are evaluated for ordinary smooth noise\nand some simulations illustrate the method. We obtain uniform risk bounds over\nclasses of Besov balls. In addition our estimation procedure requires no prior\nknowledge of the regularity of the true transition. Finally, our estimator\npermits to avoid the drawbacks of quotient estimators.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jan 2008 07:15:25 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Lacour", "Claire", ""]]}, {"id": "0801.2790", "submitter": "Mark Kliger", "authors": "Mark Kliger and Joseph M. Francos", "title": "Strongly Consistent Model Order Selection for Estimating 2-D Sinusoids\n  in Colored Noise", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME math.ST stat.TH", "license": null, "abstract": "  We consider the problem of jointly estimating the number as well as the\nparameters of two-dimensional sinusoidal signals, observed in the presence of\nan additive colored noise field. We begin by elaborating on the least squares\nestimation of 2-D sinusoidal signals, when the assumed number of sinusoids is\nincorrect. In the case where the number of sinusoidal signals is\nunder-estimated we show the almost sure convergence of the least squares\nestimates to the parameters of the dominant sinusoids. In the case where this\nnumber is over-estimated, the estimated parameter vector obtained by the least\nsquares estimator contains a sub-vector that converges almost surely to the\ncorrect parameters of the sinusoids. Based on these results, we prove the\nstrong consistency of a new model order selection rule.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jan 2008 06:56:25 GMT"}], "update_date": "2008-01-21", "authors_parsed": [["Kliger", "Mark", ""], ["Francos", "Joseph M.", ""]]}, {"id": "0801.2934", "submitter": "Lutz D\\\"umbgen", "authors": "Lutz Duembgen, Bernd-Wolfgang Igl, Axel Munk", "title": "P-values for classification", "comments": "Published in at http://dx.doi.org/10.1214/08-EJS245 the Electronic\n  Journal of Statistics (http://www.i-journals.org/ejs/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Electronic Journal of Statistics 2008, Vol. 2, 468-493", "doi": "10.1214/08-EJS245", "report-no": "IMS-EJS-EJS_2008_245", "categories": "math.ST stat.ML stat.TH", "license": null, "abstract": "  Let $(X,Y)$ be a random variable consisting of an observed feature vector\n$X\\in \\mathcal{X}$ and an unobserved class label $Y\\in \\{1,2,...,L\\}$ with\nunknown joint distribution. In addition, let $\\mathcal{D}$ be a training data\nset consisting of $n$ completely observed independent copies of $(X,Y)$. Usual\nclassification procedures provide point predictors (classifiers)\n$\\widehat{Y}(X,\\mathcal{D})$ of $Y$ or estimate the conditional distribution of\n$Y$ given $X$. In order to quantify the certainty of classifying $X$ we propose\nto construct for each $\\theta =1,2,...,L$ a p-value\n$\\pi_{\\theta}(X,\\mathcal{D})$ for the null hypothesis that $Y=\\theta$, treating\n$Y$ temporarily as a fixed parameter. In other words, the point predictor\n$\\widehat{Y}(X,\\mathcal{D})$ is replaced with a prediction region for $Y$ with\na certain confidence. We argue that (i) this approach is advantageous over\ntraditional approaches and (ii) any reasonable classifier can be modified to\nyield nonparametric p-values. We discuss issues such as optimality, single use\nand multiple use validity, as well as computational and graphical aspects.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jan 2008 16:44:02 GMT"}, {"version": "v2", "created": "Tue, 3 Jun 2008 09:34:53 GMT"}, {"version": "v3", "created": "Thu, 26 Jun 2008 08:14:11 GMT"}], "update_date": "2008-06-26", "authors_parsed": [["Duembgen", "Lutz", ""], ["Igl", "Bernd-Wolfgang", ""], ["Munk", "Axel", ""]]}, {"id": "0801.2991", "submitter": "Bercu Bernard", "authors": "Bernard Bercu and Victor Vazquez", "title": "A new concept of strong controllability via the Schur complement in\n  adaptive tracking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": null, "abstract": "  We propose a new concept of strong controllability associated with the Schur\ncomplement of a suitable limiting matrix. This concept allows us to extend the\nprevious results associated with multidimensional ARX models. On the one hand,\nwe carry out a sharp analysis of the almost sure convergence for both least\nsquares and weighted least squares algorithms. On the other hand, we also\nprovide a central limit theorem and a law of iterated logarithm for these two\nstochastic algorithms. Our asymptotic results are illustrated by numerical\nsimulations.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jan 2008 23:17:45 GMT"}], "update_date": "2008-01-22", "authors_parsed": [["Bercu", "Bernard", ""], ["Vazquez", "Victor", ""]]}, {"id": "0801.3027", "submitter": "Anthony R\\'eveillac", "authors": "Anthony R\\'eveillac", "title": "Estimation of quadratic variation for two-parameter diffusions", "comments": "29 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": null, "abstract": "  In this paper we give a central limit theorem for the weighted quadratic\nvariations process of a two-parameter Brownian motion. As an application, we\nshow that the discretized quadratic variations $\\sum_{i=1}^{[n s]}\n\\sum_{j=1}^{[n t]} | \\Delta_{i,j} Y |^2$ of a two-parameter diffusion\n$Y=(Y_{(s,t)})_{(s,t)\\in[0,1]^2}$ observed on a regular grid $G_n$ is an\nasymptotically normal estimator of the quadratic variation of $Y$ as $n$ goes\nto infinity.\n", "versions": [{"version": "v1", "created": "Sat, 19 Jan 2008 10:58:42 GMT"}], "update_date": "2008-01-22", "authors_parsed": [["Réveillac", "Anthony", ""]]}, {"id": "0801.3052", "submitter": "Richard Dudley", "authors": "R. M. Dudley, Sergiy Sidenko, Zuoqin Wang", "title": "Differentiability of M-functionals of location and scatter based on t\n  likelihoods", "comments": "47 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper aims at finding widely and smoothly defined nonparametric location\nand scatter functionals. As a convenient vehicle, maximum likelihood estimation\nof the location vector m and scatter matrix S of an elliptically symmetric t\ndistribution on d-dimensional space with degrees of freedom larger than 1\nextends to an M-functional defined on all probability distributions P in a\nweakly open, weakly dense domain U. Here U consists of P not putting too much\nmass in hyperplanes of dimension < d, as shown for empirical measures by Kent\nand Tyler, Ann. Statist. 1991. It is shown here that (m,S) is analytic on U,\nfor the bounded Lipschitz norm, or for d=1, for the sup norm on distribution\nfunctions. For k=1,2,..., and other norms, depending on k and more directly\nadapted to t functionals, one has continuous differentiability of order k,\nallowing the delta-method to be applied to (m,S) for any P in U, which can be\narbitrarily heavy-tailed. These results imply asymptotic normality of the\ncorresponding M-estimators (m_n,S_n). In dimension d=1 only, the t functionals\nextend to be defined and weakly continuous at all t.\n", "versions": [{"version": "v1", "created": "Sat, 19 Jan 2008 22:02:52 GMT"}, {"version": "v2", "created": "Thu, 19 Mar 2009 23:27:38 GMT"}], "update_date": "2009-03-20", "authors_parsed": [["Dudley", "R. M.", ""], ["Sidenko", "Sergiy", ""], ["Wang", "Zuoqin", ""]]}, {"id": "0801.3157", "submitter": "- Departement Mathematiques Orsay", "authors": "Patricia Reynaud-Bouret (DMA), Vincent Rivoirard (LM-Orsay)", "title": "Adaptive thresholding estimation of a Poisson intensity with infinite\n  support", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  The purpose of this paper is to estimate the intensity of a Poisson process\n$N$ by using thresholding rules. In this paper, the intensity, defined as the\nderivative of the mean measure of $N$ with respect to $ndx$ where $n$ is a\nfixed parameter, is assumed to be non-compactly supported. The estimator\n$\\tilde{f}_{n,\\gamma}$ based on random thresholds is proved to achieve the same\nperformance as the oracle estimator up to a logarithmic term. Oracle\ninequalities allow to derive the maxiset of $\\tilde{f}_{n,\\gamma}$. Then,\nminimax properties of $\\tilde{f}_{n,\\gamma}$ are established. We first prove\nthat the rate of this estimator on Besov spaces ${\\cal B}^\\al_{p,q}$ when\n$p\\leq 2$ is $(\\ln(n)/n)^{\\al/(1+2\\al)}$. This result has two consequences.\nFirst, it establishes that the minimax rate of Besov spaces ${\\cal\nB}^\\al_{p,q}$ with $p\\leq 2$ when non compactly supported functions are\nconsidered is the same as for compactly supported functions up to a logarithmic\nterm. This result is new. Furthermore, $\\tilde{f}_{n,\\gamma}$ is adaptive\nminimax up to a logarithmic term. When $p>2$, the situation changes\ndramatically and the rate of $\\tilde{f}_{n,\\gamma}$ on Besov spaces ${\\cal\nB}^\\al_{p,q}$ is worse than $(\\ln(n)/n)^{\\al/(1+2\\al)}$. Finally, the random\nthreshold depends on a parameter $\\gamma$ that has to be suitably chosen in\npractice. Some theoretical results provide upper and lower bounds of $\\gamma$\nto obtain satisfying oracle inequalities. Simulations reinforce these results.\n", "versions": [{"version": "v1", "created": "Mon, 21 Jan 2008 10:14:25 GMT"}], "update_date": "2008-01-22", "authors_parsed": [["Reynaud-Bouret", "Patricia", "", "DMA"], ["Rivoirard", "Vincent", "", "LM-Orsay"]]}, {"id": "0801.3319", "submitter": "Pierpaolo Brutti", "authors": "Pierpaolo Brutti", "title": "Warped Wavelet and Vertical Thresholding", "comments": "Submitted to the Electronic Journal of Statistics\n  (http://www.i-journals.org/ejs/) by the Institute of Mathematical Statistics\n  (http://www.imstat.org)", "journal-ref": null, "doi": null, "report-no": "IMS-EJS-EJS_2008_175", "categories": "math.ST stat.TH", "license": null, "abstract": "  Let $\\{(X_i,Y_i)\\}_{i\\in \\{1,..., n\\}}$ be an i.i.d. sample from the random\ndesign regression model $Y=f(X)+\\epsilon$ with $(X,Y)\\in [0,1]\\times [-M,M]$.\nIn dealing with such a model, adaptation is naturally to be intended in terms\nof $L^2([0,1],G_X)$ norm where $G_X(\\cdot)$ denotes the (known) marginal\ndistribution of the design variable $X$. Recently much work has been devoted to\nthe construction of estimators that adapts in this setting (see, for example,\n[5,24,25,32]), but only a few of them come along with a easy--to--implement\ncomputational scheme. Here we propose a family of estimators based on the\nwarped wavelet basis recently introduced by Picard and Kerkyacharian [36] and a\ntree-like thresholding rule that takes into account the hierarchical\n(across-scale) structure of the wavelet coefficients. We show that, if the\nregression function belongs to a certain class of approximation spaces defined\nin terms of $G_X(\\cdot)$, then our procedure is adaptive and converge to the\ntrue regression function with an optimal rate. The results are stated in terms\nof excess probabilities as in [19].\n", "versions": [{"version": "v1", "created": "Tue, 22 Jan 2008 07:56:26 GMT"}], "update_date": "2008-01-23", "authors_parsed": [["Brutti", "Pierpaolo", ""]]}, {"id": "0801.3352", "submitter": "Piero Barone", "authors": "Piero Barone", "title": "On the condensed density of the generalized eigenvalues of pencils of\n  Hankel Gaussian random matrices and applications", "comments": "30 pages, 16 figures, better approximations provided", "journal-ref": "Journal of Multivariate Analysis 111 (2012) 160-173", "doi": "10.1016/j.jmva.2012.05.009", "report-no": null, "categories": "math.ST math.PR stat.CO stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pencils of Hankel matrices whose elements have a joint Gaussian distribution\nwith nonzero mean and not identical covariance are considered. An approximation\nto the distribution of the squared modulus of their determinant is computed\nwhich allows to get a closed form approximation of the condensed density of the\ngeneralized eigenvalues of the pencils. Implications of this result for solving\nseveral moments problems are discussed and some numerical examples are\nprovided.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jan 2008 16:29:20 GMT"}, {"version": "v2", "created": "Tue, 7 Sep 2010 08:53:36 GMT"}], "update_date": "2012-09-28", "authors_parsed": [["Barone", "Piero", ""]]}, {"id": "0801.3490", "submitter": "Baris Erkmen", "authors": "Baris I. Erkmen and Vivek K. Goyal", "title": "Beyond Thresholding: Analysis and Improvements for Deterministic\n  Parameter Estimation", "comments": "18 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  Hard-threshold estimators are popular in signal processing applications. We\nprovide a detailed study of using hard-threshold estimators for estimating an\nunknown deterministic signal when additive white Gaussian noise corrupts\nobservations. The analysis, depending heavily on Cram{\\'e}r-Rao bounds,\nmotivates piecewise-linear estimation as a simple improvement to hard\nthresholding. We compare the performance of two piecewise-linear estimators to\na hard-threshold estimator. When either piecewise-linear estimator is optimized\nfor the decay rate of the basis coefficients, its performance is better than\nthe best possible with hard thresholding.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2008 01:37:15 GMT"}], "update_date": "2008-01-24", "authors_parsed": [["Erkmen", "Baris I.", ""], ["Goyal", "Vivek K.", ""]]}, {"id": "0801.3513", "submitter": "Christian Robert", "authors": "Christian Robert (CEREMADE), Jean-Michel Marin (INRIA Futurs)", "title": "On some difficulties with a posterior probability approximation\n  technique", "comments": "Second version, resubmitted", "journal-ref": "Bayesian Analysis(2008), 3(2), 427-442", "doi": "10.1214/08-BA316", "report-no": null, "categories": "stat.CO math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Scott (2002) and Congdon (2006), a new method is advanced to compute\nposterior probabilities of models under consideration. It is based solely on\nMCMC outputs restricted to single models, i.e., it is bypassing reversible jump\nand other model exploration techniques. While it is indeed possible to\napproximate posterior probabilities based solely on MCMC outputs from single\nmodels, as demonstrated by Gelfand and Dey (1994) and Bartolucci et al. (2006),\nwe show that the proposals of Scott (2002) and Congdon (2006) are biased and\nadvance several arguments towards this thesis, the primary one being the\nconfusion between model-based posteriors and joint pseudo-posteriors. From a\npractical point of view, the bias in Scott's (2002) approximation appears to be\nmuch more severe than the one in Congdon's (2006), the later being often of the\nsame magnitude as the posterior probability it approximates, although we also\nexhibit an example where the divergence from the true posterior probability is\nextreme.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2008 07:26:00 GMT"}, {"version": "v2", "created": "Tue, 4 Mar 2008 12:13:28 GMT"}, {"version": "v3", "created": "Tue, 18 Mar 2008 21:23:13 GMT"}, {"version": "v4", "created": "Mon, 21 Apr 2008 14:32:18 GMT"}, {"version": "v5", "created": "Thu, 5 Jun 2008 07:04:06 GMT"}], "update_date": "2010-10-11", "authors_parsed": [["Robert", "Christian", "", "CEREMADE"], ["Marin", "Jean-Michel", "", "INRIA Futurs"]]}, {"id": "0801.3887", "submitter": "Christian Robert", "authors": "Nicolas Chopin (CREST), Christian Robert (CREST, Ceremade)", "title": "Properties of Nested Sampling", "comments": "Revision submitted to Biometrika", "journal-ref": "Biometrika 97(3):741-755, 2010", "doi": "10.1093/biomet/asq021", "report-no": null, "categories": "stat.CO math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nested sampling is a simulation method for approximating marginal likelihoods\nproposed by Skilling (2006). We establish that nested sampling has an\napproximation error that vanishes at the standard Monte Carlo rate and that\nthis error is asymptotically Gaussian. We show that the asymptotic variance of\nthe nested sampling approximation typically grows linearly with the dimension\nof the parameter. We discuss the applicability and efficiency of nested\nsampling in realistic problems, and we compare it with two current methods for\ncomputing marginal likelihood. We propose an extension that avoids resorting to\nMarkov chain Monte Carlo to obtain the simulated points.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jan 2008 07:25:25 GMT"}, {"version": "v2", "created": "Sat, 25 Oct 2008 06:47:43 GMT"}, {"version": "v3", "created": "Fri, 10 Jul 2009 18:50:46 GMT"}, {"version": "v4", "created": "Fri, 10 Jul 2009 20:40:26 GMT"}], "update_date": "2010-10-11", "authors_parsed": [["Chopin", "Nicolas", "", "CREST"], ["Robert", "Christian", "", "CREST, Ceremade"]]}, {"id": "0801.4146", "submitter": "Ilia Negri", "authors": "Ilia Negri, Yoichi Nishiyama", "title": "Goodness of fit test for small diffusions by discrete observations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  We consider a nonparametric goodness of fit test problem for the drift\ncoefficient of one-dimensional small diffusions. Our test is based on discrete\nobservation of the processes, and the diffusion coefficient is a nuisance\nfunction which is estimated in our testing procedure. We prove that the limit\ndistribution of our test is the supremum of the standard Brownian motion, and\nthus our test is asymptotically distribution free. We also show that our test\nis consistent under any fixed alternatives.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jan 2008 18:28:42 GMT"}], "update_date": "2008-01-29", "authors_parsed": [["Negri", "Ilia", ""], ["Nishiyama", "Yoichi", ""]]}, {"id": "0801.4190", "submitter": "Sebastian Roch", "authors": "Constantinos Daskalakis, Elchanan Mossel, Sebastien Roch", "title": "Phylogenies without Branch Bounds: Contracting the Short, Pruning the\n  Deep", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CE cs.DS math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new phylogenetic reconstruction algorithm which, unlike most\nprevious rigorous inference techniques, does not rely on assumptions regarding\nthe branch lengths or the depth of the tree. The algorithm returns a forest\nwhich is guaranteed to contain all edges that are: 1) sufficiently long and 2)\nsufficiently close to the leaves. How much of the true tree is recovered\ndepends on the sequence length provided. The algorithm is distance-based and\nruns in polynomial time.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2008 05:10:22 GMT"}, {"version": "v2", "created": "Tue, 28 Jul 2009 01:48:27 GMT"}], "update_date": "2011-09-30", "authors_parsed": [["Daskalakis", "Constantinos", ""], ["Mossel", "Elchanan", ""], ["Roch", "Sebastien", ""]]}, {"id": "0801.4329", "submitter": "Francois Roueff", "authors": "Gilles Fay (LPP), Eric Moulines (LTCI), Fran\\c{c}ois Roueff (LTCI),\n  Murad S. Taqqu (BOSTON University)", "title": "Estimators of Long-Memory: Fourier versus Wavelets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": null, "abstract": "  There have been a number of papers written on semi-parametric estimation\nmethods of the long-memory exponent of a time series, some applied, others\ntheoretical. Some using Fourier methods, others using a wavelet-based\ntechnique. In this paper, we compare the Fourier and wavelet approaches to the\nlocal regression method and to the local Whittle method. We provide an overview\nof these methods, describe what has been done, indicate the available results\nand the conditions under which they hold. We discuss their relative strengths\nand weaknesses both from a practical and a theoretical perspective. We also\ninclude a simulation-based comparison. The software written to support this\nwork is available on demand and we illustrate its use at the end of the paper.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2008 16:43:54 GMT"}], "update_date": "2008-01-29", "authors_parsed": [["Fay", "Gilles", "", "LPP"], ["Moulines", "Eric", "", "LTCI"], ["Roueff", "François", "", "LTCI"], ["Taqqu", "Murad S.", "", "BOSTON University"]]}, {"id": "0801.4366", "submitter": "Ramon Van Handel", "authors": "Ramon van Handel", "title": "The stability of conditional Markov processes and Markov chains in\n  random environments", "comments": "Published in at http://dx.doi.org/10.1214/08-AOP448 the Annals of\n  Probability (http://www.imstat.org/aop/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Annals of Probability 2009, Vol. 37, No. 5, 1876-1925", "doi": "10.1214/08-AOP448", "report-no": "IMS-AOP-AOP448", "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a discrete time hidden Markov model where the signal is a\nstationary Markov chain. When conditioned on the observations, the signal is a\nMarkov chain in a random environment under the conditional measure. It is shown\nthat this conditional signal is weakly ergodic when the signal is ergodic and\nthe observations are nondegenerate. This permits a delicate exchange of the\nintersection and supremum of $\\sigma$-fields, which is key for the stability of\nthe nonlinear filter and partially resolves a long-standing gap in the proof of\na result of Kunita [J. Multivariate Anal. 1 (1971) 365--393]. A similar result\nis obtained also in the continuous time setting. The proofs are based on an\nergodic theorem for Markov chains in random environments in a general state\nspace.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2008 19:56:47 GMT"}, {"version": "v2", "created": "Thu, 24 Sep 2009 13:34:20 GMT"}], "update_date": "2009-09-24", "authors_parsed": [["van Handel", "Ramon", ""]]}, {"id": "0801.4410", "submitter": "Yuzo Maruyama", "authors": "Yuzo Maruyama, Edward I. George", "title": "Fully Bayes factors with a generalized g-prior", "comments": "Published in at http://dx.doi.org/10.1214/11-AOS917 the Annals of\n  Statistics (http://www.imstat.org/aos/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Annals of Statistics 2011, Vol. 39, No. 5, 2740-2765", "doi": "10.1214/11-AOS917", "report-no": "IMS-AOS-AOS917", "categories": "stat.ME math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the normal linear model variable selection problem, we propose selection\ncriteria based on a fully Bayes formulation with a generalization of Zellner's\n$g$-prior which allows for $p>n$. A special case of the prior formulation is\nseen to yield tractable closed forms for marginal densities and Bayes factors\nwhich reveal new model evaluation characteristics of potential interest.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jan 2008 01:20:08 GMT"}, {"version": "v2", "created": "Mon, 20 Sep 2010 01:57:16 GMT"}, {"version": "v3", "created": "Fri, 5 Aug 2011 05:20:01 GMT"}, {"version": "v4", "created": "Thu, 23 Feb 2012 08:38:37 GMT"}], "update_date": "2012-02-24", "authors_parsed": [["Maruyama", "Yuzo", ""], ["George", "Edward I.", ""]]}, {"id": "0801.4610", "submitter": "Karim Lounici", "authors": "Karim Lounici", "title": "Sup-norm convergence rate and sign concentration property of Lasso and\n  Dantzig estimators", "comments": "Published in at http://dx.doi.org/10.1214/08-EJS177 the Electronic\n  Journal of Statistics (http://www.i-journals.org/ejs/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Electronic Journal of Statistics 2008, Vol. 2, 90-102", "doi": "10.1214/08-EJS177", "report-no": "IMS-EJS-EJS_2008_177", "categories": "math.ST stat.TH", "license": null, "abstract": "  We derive the $l_{\\infty}$ convergence rate simultaneously for Lasso and\nDantzig estimators in a high-dimensional linear regression model under a mutual\ncoherence assumption on the Gram matrix of the design and two different\nassumptions on the noise: Gaussian noise and general noise with finite\nvariance. Then we prove that simultaneously the thresholded Lasso and Dantzig\nestimators with a proper choice of the threshold enjoy a sign concentration\nproperty provided that the non-zero components of the target vector are not too\nsmall.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2008 07:22:24 GMT"}, {"version": "v2", "created": "Tue, 12 Feb 2008 11:02:15 GMT"}], "update_date": "2008-02-12", "authors_parsed": [["Lounici", "Karim", ""]]}, {"id": "0801.4627", "submitter": "Ulrike Schneider", "authors": "Benedikt M. P\\\"otscher and Ulrike Schneider", "title": "On the Distribution of the Adaptive LASSO Estimator", "comments": "revised version; minor changes and some material added", "journal-ref": "J. Stat. Plann. Inference 139 (2009) 2775-2790", "doi": "10.1016/j.jspi.2009.01.003", "report-no": null, "categories": "math.ST stat.ME stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the distribution of the adaptive LASSO estimator (Zou (2006)) in\nfinite samples as well as in the large-sample limit. The large-sample\ndistributions are derived both for the case where the adaptive LASSO estimator\nis tuned to perform conservative model selection as well as for the case where\nthe tuning results in consistent model selection. We show that the\nfinite-sample as well as the large-sample distributions are typically highly\nnon-normal, regardless of the choice of the tuning parameter. The uniform\nconvergence rate is also obtained, and is shown to be slower than $n^{-1/2}$ in\ncase the estimator is tuned to perform consistent model selection. In\nparticular, these results question the statistical relevance of the `oracle'\nproperty of the adaptive LASSO estimator established in Zou (2006). Moreover,\nwe also provide an impossibility result regarding the estimation of the\ndistribution function of the adaptive LASSO estimator.The theoretical results,\nwhich are obtained for a regression model with orthogonal design, are\ncomplemented by a Monte Carlo study using non-orthogonal regressors.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2008 09:57:44 GMT"}, {"version": "v2", "created": "Tue, 16 Dec 2008 12:42:12 GMT"}], "update_date": "2009-04-28", "authors_parsed": [["Pötscher", "Benedikt M.", ""], ["Schneider", "Ulrike", ""]]}, {"id": "0801.4726", "submitter": "Sergey Nikitin", "authors": "S. Nikitin", "title": "Stochastic extrema as stationary phases of characteristic functions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.AP stat.TH", "license": null, "abstract": "  The paper is dealing with semi-classical asymptotics of a characteristic\nfunction for a stochastic process. The main technical tool is provided by the\nstationary phase method. The extremal range for a stochastic process is defined\nby limit values of the complex logarithm of the characteristic function. The\npaper also outlines a numerical method for calculating stochastic extrema.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2008 17:35:40 GMT"}], "update_date": "2008-01-31", "authors_parsed": [["Nikitin", "S.", ""]]}, {"id": "0801.4837", "submitter": "Elizaveta Levina", "authors": "Adam J. Rothman, Peter J. Bickel, Elizaveta Levina, Ji Zhu", "title": "Sparse permutation invariant covariance estimation", "comments": "Published in at http://dx.doi.org/10.1214/08-EJS176 the Electronic\n  Journal of Statistics (http://www.i-journals.org/ejs/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Electronic Journal of Statistics 2008, Vol. 2, 494-515", "doi": "10.1214/08-EJS176", "report-no": "IMS-EJS-EJS_2008_176", "categories": "math.ST stat.TH", "license": null, "abstract": "  The paper proposes a method for constructing a sparse estimator for the\ninverse covariance (concentration) matrix in high-dimensional settings. The\nestimator uses a penalized normal likelihood approach and forces sparsity by\nusing a lasso-type penalty. We establish a rate of convergence in the Frobenius\nnorm as both data dimension $p$ and sample size $n$ are allowed to grow, and\nshow that the rate depends explicitly on how sparse the true concentration\nmatrix is. We also show that a correlation-based version of the method exhibits\nbetter rates in the operator norm. We also derive a fast iterative algorithm\nfor computing the estimator, which relies on the popular Cholesky decomposition\nof the inverse but produces a permutation-invariant estimator. The method is\ncompared to other estimators on simulated data and on a real data example of\ntumor tissue classification using gene expression data.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2008 09:20:06 GMT"}, {"version": "v2", "created": "Thu, 26 Jun 2008 08:35:25 GMT"}], "update_date": "2008-06-26", "authors_parsed": [["Rothman", "Adam J.", ""], ["Bickel", "Peter J.", ""], ["Levina", "Elizaveta", ""], ["Zhu", "Ji", ""]]}]