[{"id": "0805.0053", "submitter": "Namrata Vaswani", "authors": "Namrata Vaswani", "title": "Particle Filtering for Large Dimensional State Spaces with Multimodal\n  Observation Likelihoods", "comments": "To appear in IEEE Trans. Signal Processing", "journal-ref": "IEEE Trans. Sig. Proc., vol. 56(10-1), pp. 4583-4597, Oct. 2008", "doi": "10.1109/TSP.2008.925969", "report-no": null, "categories": "cs.IT math.IT math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study efficient importance sampling techniques for particle filtering (PF)\nwhen either (a) the observation likelihood (OL) is frequently multimodal or\nheavy-tailed, or (b) the state space dimension is large or both. When the OL is\nmultimodal, but the state transition pdf (STP) is narrow enough, the optimal\nimportance density is usually unimodal. Under this assumption, many techniques\nhave been proposed. But when the STP is broad, this assumption does not hold.\nWe study how existing techniques can be generalized to situations where the\noptimal importance density is multimodal, but is unimodal conditioned on a part\nof the state vector. Sufficient conditions to test for the unimodality of this\nconditional posterior are derived. The number of particles, N, to accurately\ntrack using a PF increases with state space dimension, thus making any regular\nPF impractical for large dimensional tracking problems. We propose a solution\nthat partially addresses this problem. An important class of large dimensional\nproblems with multimodal OL is tracking spatially varying physical quantities\nsuch as temperature or pressure in a large area using a network of sensors\nwhich may be nonlinear and/or may have non-negligible failure probabilities.\n", "versions": [{"version": "v1", "created": "Thu, 1 May 2008 05:41:09 GMT"}], "update_date": "2011-04-13", "authors_parsed": [["Vaswani", "Namrata", ""]]}, {"id": "0805.0074", "submitter": "Jean-Marc Bardet", "authors": "Jean-Marc Bardet (CES, SAMOS), Pierre Bertrand (LMA-Clermont)", "title": "A nonparametric estimator of the spectral density of a continuous-time\n  Gaussian process observed at random times", "comments": "Scandinavian Journal of Statistics To appear (2010) 1-41", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In numerous applications data are observed at random times and an estimated\ngraph of the spectral density may be relevant for characterizing and explaining\nphenomena. By using a wavelet analysis, one derives a nonparametric estimator\nof the spectral density of a Gaussian process with stationary increments (or a\nstationary Gaussian process) from the observation of one path at random\ndiscrete times. For every positive frequency, this estimator is proved to\nsatisfy a central limit theorem with a convergence rate depending on the\nroughness of the process and the moment of random durations between successive\nobservations. In the case of stationary Gaussian processes, one can compare\nthis estimator with estimators based on the empirical periodogram. Both\nestimators reach the same optimal rate of convergence, but the estimator based\non wavelet analysis converges for a different class of random times. Simulation\nexamples and application to biological data are also provided.\n", "versions": [{"version": "v1", "created": "Thu, 1 May 2008 11:44:00 GMT"}, {"version": "v2", "created": "Thu, 3 Jul 2008 08:41:14 GMT"}, {"version": "v3", "created": "Fri, 17 Jul 2009 09:58:05 GMT"}, {"version": "v4", "created": "Fri, 27 Nov 2009 08:00:58 GMT"}], "update_date": "2009-11-27", "authors_parsed": [["Bardet", "Jean-Marc", "", "CES, SAMOS"], ["Bertrand", "Pierre", "", "LMA-Clermont"]]}, {"id": "0805.0122", "submitter": "Nanuli Lazrieva", "authors": "N. Lazrieva, T. Toronjadze", "title": "Optimal Robust Mean-Variance Hedging in Incomplete Financial Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.PR math.ST stat.AP stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimal B-robust estimate is constructed for multidimensional parameter in\ndrift coefficient of diffusion type process with small noise. Optimal\nmean-variance robust (optimal V -robust) trading strategy is find to hedge in\nmean-variance sense the contingent claim in incomplete financial market with\narbitrary information structure and misspecified volatility of asset price,\nwhich is modelled by multidimensional continuous semimartingale. Obtained\nresults are applied to stochastic volatility model, where the model of latent\nvolatility process contains unknown multidimensional parameter in drift\ncoefficient and small parameter in diffusion term.\n", "versions": [{"version": "v1", "created": "Thu, 1 May 2008 18:06:05 GMT"}], "update_date": "2008-12-10", "authors_parsed": [["Lazrieva", "N.", ""], ["Toronjadze", "T.", ""]]}, {"id": "0805.0228", "submitter": "Gabriel Lang", "authors": "Paul Doukhan, Gabriel Lang", "title": "Evaluation for moments of a ratio with application to regression\n  estimation", "comments": "Published in at http://dx.doi.org/10.3150/09-BEJ190 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2009, Vol. 15, No. 4, 1259-1286", "doi": "10.3150/09-BEJ190", "report-no": "IMS-BEJ-BEJ190", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ratios of random variables often appear in probability and statistical\napplications. We aim to approximate the moments of such ratios under several\ndependence assumptions. Extending the ideas in Collomb [C. R. Acad. Sci. Paris\n285 (1977) 289--292], we propose sharper bounds for the moments of randomly\nweighted sums and for the $L^p$-deviations from the asymptotic normal law when\nthe central limit theorem holds. We indicate suitable applications in finance\nand censored data analysis and focus on the applications in the field of\nfunctional estimation.\n", "versions": [{"version": "v1", "created": "Fri, 2 May 2008 13:27:47 GMT"}, {"version": "v2", "created": "Thu, 14 Jan 2010 10:02:52 GMT"}], "update_date": "2010-01-14", "authors_parsed": [["Doukhan", "Paul", ""], ["Lang", "Gabriel", ""]]}, {"id": "0805.0234", "submitter": "Alessandro Rinaldo", "authors": "Alessandro Rinaldo", "title": "Properties and refinements of the fused lasso", "comments": "Published in at http://dx.doi.org/10.1214/08-AOS665 the Annals of\n  Statistics (http://www.imstat.org/aos/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Annals of Statistics 2009, Vol. 37, No. 5B, 2922-2952", "doi": "10.1214/08-AOS665", "report-no": "IMS-AOS-AOS665", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider estimating an unknown signal, both blocky and sparse, which is\ncorrupted by additive noise. We study three interrelated least squares\nprocedures and their asymptotic properties. The first procedure is the fused\nlasso, put forward by Friedman et al. [Ann. Appl. Statist. 1 (2007) 302--332],\nwhich we modify into a different estimator, called the fused adaptive lasso,\nwith better properties. The other two estimators we discuss solve least squares\nproblems on sieves; one constrains the maximal $\\ell_1$ norm and the maximal\ntotal variation seminorm, and the other restricts the number of blocks and the\nnumber of nonzero coordinates of the signal. We derive conditions for the\nrecovery of the true block partition and the true sparsity patterns by the\nfused lasso and the fused adaptive lasso, and we derive convergence rates for\nthe sieve estimators, explicitly in terms of the constraining parameters.\n", "versions": [{"version": "v1", "created": "Fri, 2 May 2008 14:16:57 GMT"}, {"version": "v2", "created": "Mon, 31 Aug 2009 09:52:38 GMT"}], "update_date": "2009-08-31", "authors_parsed": [["Rinaldo", "Alessandro", ""]]}, {"id": "0805.0465", "submitter": "Jie Peng", "authors": "Debashis Paul and Jie Peng", "title": "Consistency of restricted maximum likelihood estimators of principal\n  components", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider two closely related problems : estimation of\neigenvalues and eigenfunctions of the covariance kernel of functional data\nbased on (possibly) irregular measurements, and the problem of estimating the\neigenvalues and eigenvectors of the covariance matrix for high-dimensional\nGaussian vectors. In Peng and Paul (2007), a restricted maximum likelihood\n(REML) approach has been developed to deal with the first problem. In this\npaper, we establish consistency and derive rate of convergence of the REML\nestimator for the functional data case, under appropriate smoothness\nconditions. Moreover, we prove that when the number of measurements per sample\ncurve is bounded, under squared-error loss, the rate of convergence of the REML\nestimators of eigenfunctions is near-optimal. In the case of Gaussian vectors,\nasymptotic consistency and an efficient score representation of the estimators\nare obtained under the assumption that the effective dimension grows at a rate\nslower than the sample size. These results are derived through an explicit\nutilization of the intrinsic geometry of the parameter space, which is\nnon-Euclidean. Moreover, the results derived in this paper suggest an\nasymptotic equivalence between the inference on functional data with dense\nmeasurements and that of the high dimensional Gaussian vectors.\n", "versions": [{"version": "v1", "created": "Mon, 5 May 2008 05:28:19 GMT"}], "update_date": "2008-05-06", "authors_parsed": [["Paul", "Debashis", ""], ["Peng", "Jie", ""]]}, {"id": "0805.0732", "submitter": "Nikolay Balov", "authors": "Nikolay H. Balov", "title": "Covariance of centered distributions on manifold", "comments": "17 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.DG stat.CO stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define and study a family of distributions with domain complete Riemannian\nmanifold. They are obtained by projection onto a fixed tangent space via the\ninverse exponential map. This construction is a popular choice in the\nliterature for it makes it easy to generalize well known multivariate Euclidean\ndistributions. However, most of the available solutions use coordinate specific\ndefinition that makes them less versatile. %We propose improvements in two\ndirections. We define the distributions of interest in coordinate independent\nway by utilizing co-variant 2-tensors. Then we study the relation of these\ndistributions to their Euclidean counterparts. In particular, we are interested\nin relating the covariance to the tensor that controls distribution\nconcentration. We find approximating expression for this relation in general\nand give more precise formulas in case of manifolds of constant curvature,\npositive or negative. Results are confirmed by simulation studies of the\nstandard normal distribution on the unit-sphere and hyperbolic plane.\n", "versions": [{"version": "v1", "created": "Tue, 6 May 2008 14:26:38 GMT"}], "update_date": "2008-05-07", "authors_parsed": [["Balov", "Nikolay H.", ""]]}, {"id": "0805.0745", "submitter": "Amelie Detais", "authors": "Am\\'elie Detais (IMT), Jean-Fran\\c{c}ois Dupuy (IMT)", "title": "Maximum likelihood estimation in a partially observed stratified\n  regression model with censored data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The stratified proportional intensity model generalizes Cox's proportional\nintensity model by allowing different groups of the population under study to\nhave distinct baseline intensity functions. In this article, we consider the\nproblem of estimation in this model when the variable indicating the stratum is\nunobserved for some individuals in the studied sample. In this setting, we\nconstruct nonparametric maximum likelihood estimators for the parameters of the\nstratified model and we establish their consistency and asymptotic normality.\nConsistent estimators for the limiting variances are also obtained.\n", "versions": [{"version": "v1", "created": "Tue, 6 May 2008 15:26:36 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Detais", "Amélie", "", "IMT"], ["Dupuy", "Jean-François", "", "IMT"]]}, {"id": "0805.0778", "submitter": "Francois Roueff", "authors": "Fran\\c{c}ois Roueff (LTCI), Murad S. Taqqu (BOSTON University)", "title": "Asymptotic normality of wavelet estimators of the memory parameter for\n  linear processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider linear processes, not necessarily Gaussian, with long, short or\nnegative memory. The memory parameter is estimated semi-parametrically using\nwavelets from a sample $X_1,...,X_n$ of the process. We treat both the\nlog-regression wavelet estimator and the wavelet Whittle estimator. We show\nthat these estimators are asymptotically normal as the sample size $n\\to\\infty$\nand we obtain an explicit expression for the limit variance. These results are\nderived from a general result on the asymptotic normality of the empirical\nscalogram for linear processes, conveniently centered and normalized. The\nscalogram is an array of quadratic forms of the observed sample, computed from\nthe wavelet coefficients of this sample. In contrast with quadratic forms\ncomputed on the Fourier coefficients such as the periodogram, the scalogram\ninvolves correlations which do not vanish as the sample size $n\\to\\infty$.\n", "versions": [{"version": "v1", "created": "Tue, 6 May 2008 18:53:24 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Roueff", "François", "", "LTCI"], ["Taqqu", "Murad S.", "", "BOSTON University"]]}, {"id": "0805.0779", "submitter": "Francois Roueff", "authors": "Fran\\c{c}ois Roueff (LTCI), Murad S. Taqqu (BOSTON University)", "title": "Central Limit Theorems for arrays of decimated linear processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Linear processes are defined as a discrete-time convolution between a kernel\nand an infinite sequence of i.i.d. random variables. We modify this convolution\nby introducing decimation, that is, by stretching time accordingly. We then\nestablish central limit theorems for arrays of squares of such decimated\nprocesses. These theorems are used to obtain the asymptotic behavior of\nestimators of the spectral density at specific frequencies. Another\napplication, treated elsewhere, concerns the estimation of the long-memory\nparameter in time-series, using wavelets.\n", "versions": [{"version": "v1", "created": "Tue, 6 May 2008 18:54:19 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Roueff", "François", "", "LTCI"], ["Taqqu", "Murad S.", "", "BOSTON University"]]}, {"id": "0805.1031", "submitter": "Robert Adler", "authors": "Robert J Adler", "title": "Some New Random Field Tools for Spatial Analysis", "comments": "14 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is a brief review, in relatively non-technical terms, of recent advances\nin the theory of random field geometry. These advances have provided a\ncollection of explicit new formulae describing mean values of a variety of\ngeometric characteristics of excursion sets of random fields. As well as a\nreview of the theory, we provide brief descriptions of some of the more\ninteresting applications.\n", "versions": [{"version": "v1", "created": "Wed, 7 May 2008 17:49:17 GMT"}], "update_date": "2008-05-08", "authors_parsed": [["Adler", "Robert J", ""]]}, {"id": "0805.1179", "submitter": "Yuval Nardi", "authors": "Yuval Nardi and Alessandro Rinaldo", "title": "Autoregressive Process Modeling via the Lasso Procedure", "comments": "20 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Lasso is a popular model selection and estimation procedure for linear\nmodels that enjoys nice theoretical properties. In this paper, we study the\nLasso estimator for fitting autoregressive time series models. We adopt a\ndouble asymptotic framework where the maximal lag may increase with the sample\nsize. We derive theoretical results establishing various types of consistency.\nIn particular, we derive conditions under which the Lasso estimator for the\nautoregressive coefficients is model selection consistent, estimation\nconsistent and prediction consistent. Simulation study results are reported.\n", "versions": [{"version": "v1", "created": "Thu, 8 May 2008 15:01:49 GMT"}], "update_date": "2008-05-09", "authors_parsed": [["Nardi", "Yuval", ""], ["Rinaldo", "Alessandro", ""]]}, {"id": "0805.1301", "submitter": "Thomas Kahle", "authors": "Thomas Kahle, Walter Wenzel, Nihat Ay", "title": "Hierarchical Models, Marginal Polytopes, and Linear Codes", "comments": "18 pages", "journal-ref": "Kybernetika, vol. 45 (2009), issue 2, pp. 189-207", "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we explore a connection between binary hierarchical models,\ntheir marginal polytopes and codeword polytopes, the convex hulls of linear\ncodes. The class of linear codes that are realizable by hierarchical models is\ndetermined. We classify all full dimensional polytopes with the property that\ntheir vertices form a linear code and give an algorithm that determines them.\n", "versions": [{"version": "v1", "created": "Fri, 9 May 2008 08:10:29 GMT"}, {"version": "v2", "created": "Thu, 20 Nov 2008 09:34:26 GMT"}], "update_date": "2016-04-08", "authors_parsed": [["Kahle", "Thomas", ""], ["Wenzel", "Walter", ""], ["Ay", "Nihat", ""]]}, {"id": "0805.1374", "submitter": "Nathalie Villa", "authors": "Nathalie Villa (IMT), Fabrice Rossi (INRIA Rocquencourt / INRIA Sophia\n  Antipolis), Quoc-Dinh Truong (IRIT)", "title": "Mining a medieval social network by kernel SOM and related methods", "comments": null, "journal-ref": "MASHS 2008 (Mod\\`eles et Apprentissages en Sciences Humaines et\n  Sociales), Cr\\'eteil : France (2008)", "doi": null, "report-no": null, "categories": "stat.AP math.ST physics.soc-ph stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper briefly presents several ways to understand the organization of a\nlarge social network (several hundreds of persons). We compare approaches\ncoming from data mining for clustering the vertices of a graph (spectral\nclustering, self-organizing algorithms. . .) and provide methods for\nrepresenting the graph from these analysis. All these methods are illustrated\non a medieval social network and the way they can help to understand its\norganization is underlined.\n", "versions": [{"version": "v1", "created": "Fri, 9 May 2008 16:00:35 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Villa", "Nathalie", "", "IMT"], ["Rossi", "Fabrice", "", "INRIA Rocquencourt / INRIA Sophia\n  Antipolis"], ["Truong", "Quoc-Dinh", "", "IRIT"]]}, {"id": "0805.1404", "submitter": "Evarist Gin\\'{e}", "authors": "Evarist Gin\\'e, Richard Nickl", "title": "Adaptive estimation of a distribution function and its density in\n  sup-norm loss by wavelet and spline projections", "comments": "Published in at http://dx.doi.org/10.3150/09-BEJ239 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2010, Vol. 16, No. 4, 1137-1163", "doi": "10.3150/09-BEJ239", "report-no": "IMS-BEJ-BEJ239", "categories": "math.ST math.PR stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given an i.i.d. sample from a distribution $F$ on $\\mathbb{R}$ with uniformly\ncontinuous density $p_0$, purely data-driven estimators are constructed that\nefficiently estimate $F$ in sup-norm loss and simultaneously estimate $p_0$ at\nthe best possible rate of convergence over H\\\"older balls, also in sup-norm\nloss. The estimators are obtained by applying a model selection procedure close\nto Lepski's method with random thresholds to projections of the empirical\nmeasure onto spaces spanned by wavelets or $B$-splines. The random thresholds\nare based on suprema of Rademacher processes indexed by wavelet or spline\nprojection kernels. This requires Bernstein-type analogs of the inequalities in\nKoltchinskii [Ann. Statist. 34 (2006) 2593-2656] for the deviation of suprema\nof empirical processes from their Rademacher symmetrizations.\n", "versions": [{"version": "v1", "created": "Fri, 9 May 2008 19:55:00 GMT"}, {"version": "v2", "created": "Fri, 7 Jan 2011 09:02:18 GMT"}], "update_date": "2011-01-10", "authors_parsed": [["Giné", "Evarist", ""], ["Nickl", "Richard", ""]]}, {"id": "0805.1406", "submitter": "Richard Nickl", "authors": "Evarist Gin\\'e, Richard Nickl", "title": "Uniform limit theorems for wavelet density estimators", "comments": "Published in at http://dx.doi.org/10.1214/08-AOP447 the Annals of\n  Probability (http://www.imstat.org/aop/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Annals of Probability 2009, Vol. 37, No. 4, 1605-1646", "doi": "10.1214/08-AOP447", "report-no": "IMS-AOP-AOP447", "categories": "math.ST math.PR stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $p_n(y)=\\sum_k\\hat{\\alpha}_k\\phi(y-k)+\\sum_{l=0}^{j_n-1}\\sum_k\\hat\n{\\beta}_{lk}2^{l/2}\\psi(2^ly-k)$ be the linear wavelet density estimator, where\n$\\phi$, $\\psi$ are a father and a mother wavelet (with compact support),\n$\\hat{\\alpha}_k$, $\\hat{\\beta}_{lk}$ are the empirical wavelet coefficients\nbased on an i.i.d. sample of random variables distributed according to a\ndensity $p_0$ on $\\mathbb{R}$, and $j_n\\in\\mathbb{Z}$, $j_n\\nearrow\\infty$.\nSeveral uniform limit theorems are proved: First, the almost sure rate of\nconvergence of $\\sup_{y\\in\\mathbb{R}}|p_n(y)-Ep_n(y)|$ is obtained, and a law\nof the logarithm for a suitably scaled version of this quantity is established.\nThis implies that $\\sup_{y\\in\\mathbb{R}}|p_n(y)-p_0(y)|$ attains the optimal\nalmost sure rate of convergence for estimating $p_0$, if $j_n$ is suitably\nchosen. Second, a uniform central limit theorem as well as strong invariance\nprinciples for the distribution function of $p_n$, that is, for the stochastic\nprocesses $\\sqrt{n}(F_n\n^W(s)-F(s))=\\sqrt{n}\\int_{-\\infty}^s(p_n-p_0),s\\in\\mathbb{R}$, are proved; and\nmore generally, uniform central limit theorems for the processes\n$\\sqrt{n}\\int(p_n-p_0)f$, $f\\in\\mathcal{F}$, for other Donsker classes\n$\\mathcal{F}$ of interest are considered. As a statistical application, it is\nshown that essentially the same limit theorems can be obtained for the hard\nthresholding wavelet estimator introduced by Donoho et al. [Ann. Statist. 24\n(1996) 508--539].\n", "versions": [{"version": "v1", "created": "Fri, 9 May 2008 19:59:10 GMT"}, {"version": "v2", "created": "Sat, 1 Nov 2008 11:38:34 GMT"}, {"version": "v3", "created": "Mon, 31 Aug 2009 05:48:50 GMT"}], "update_date": "2009-08-31", "authors_parsed": [["Giné", "Evarist", ""], ["Nickl", "Richard", ""]]}, {"id": "0805.1569", "submitter": "Xinjia Chen", "authors": "Xinjia Chen and Kemin Zhou", "title": "Order Statistics and Probabilistic Robust Control", "comments": "12 pages, 3 figures", "journal-ref": "published in Systems and Control Letters, vol. 35, pp. 175-182,\n  1998", "doi": null, "report-no": null, "categories": "math.OC math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Order statistics theory is applied in this paper to probabilistic robust\ncontrol theory to compute the minimum sample size needed to come up with a\nreliable estimate of an uncertain quantity under continuity assumption of the\nrelated probability distribution. Also, the concept of distribution-free\ntolerance intervals is applied to estimate the range of an uncertain quantity\nand extract the information about its distribution. To overcome the limitations\nimposed by the continuity assumption in the existing order statistics theory,\nwe have derived a cumulative distribution function of the order statistics\nwithout the continuity assumption and developed an inequality showing that this\ndistribution has an upper bound which equals to the corresponding distribution\nwhen the continuity assumption is satisfied. By applying this inequality, we\ninvestigate the minimum computational effort needed to come up with an reliable\nestimate for the upper bound (or lower bound) and the range of a quantity. We\nalso give conditions, which are much weaker than the absolute continuity\nassumption, for the existence of such minimum sample size. Furthermore, the\nissue of making tradeoff between performance level and risk is addressed and a\nguideline for making this kind of tradeoff is established. This guideline can\nbe applied in general without continuity assumption.\n", "versions": [{"version": "v1", "created": "Mon, 12 May 2008 00:32:39 GMT"}], "update_date": "2008-05-13", "authors_parsed": [["Chen", "Xinjia", ""], ["Zhou", "Kemin", ""]]}, {"id": "0805.1571", "submitter": "Xinjia Chen", "authors": "Xinjia Chen and Kemin Zhou", "title": "Constrained Optimal Synthesis and Robustness Analysis by Randomized\n  Algorithms", "comments": "14 pages, 2 figures", "journal-ref": "IEEE Transactions on Automatic Control, vol. 45, pp. 1180-1186,\n  June 2000", "doi": null, "report-no": null, "categories": "math.OC math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider robust control using randomized algorithms. We\nextend the existing order statistics distribution theory to the general case in\nwhich the distribution of population is not assumed to be continuous and the\norder statistics is associated with certain constraints. In particular, we\nderive an inequality on distribution for related order statistics. Moreover, we\nalso propose two different approaches in searching reliable solutions to the\nrobust analysis and optimal synthesis problems under constraints. Furthermore,\nminimum computational effort is investigated and bounds for sample size are\nderived.\n", "versions": [{"version": "v1", "created": "Mon, 12 May 2008 01:07:16 GMT"}], "update_date": "2008-05-13", "authors_parsed": [["Chen", "Xinjia", ""], ["Zhou", "Kemin", ""]]}, {"id": "0805.1572", "submitter": "Xinjia Chen", "authors": "Xinjia Chen, Kemin Zhou and Jorge L. Aravena", "title": "On the Binomial Confidence Interval and Probabilistic Robust Control", "comments": "6 pages, 1 figure", "journal-ref": "published in Automatica, vol. 40, pp. 1787-1789, 2004", "doi": null, "report-no": null, "categories": "math.OC math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Clopper-Pearson confidence interval has ever been documented as an exact\napproach in some statistics literature. More recently, such approach of\ninterval estimation has been introduced to probabilistic control theory and has\nbeen referred as non-conservative in control community. In this note, we\nclarify the fact that the so-called exact approach is actually conservative. In\nparticular, we derive analytic results demonstrating the extent of conservatism\nin the context of probabilistic robustness analysis. This investigation\nencourages seeking better methods of confidence interval construction for\nrobust control purpose.\n", "versions": [{"version": "v1", "created": "Mon, 12 May 2008 01:41:19 GMT"}], "update_date": "2008-05-13", "authors_parsed": [["Chen", "Xinjia", ""], ["Zhou", "Kemin", ""], ["Aravena", "Jorge L.", ""]]}, {"id": "0805.1768", "submitter": "Chihwa Kao", "authors": "Jushan Bai, Chihwa Kao, and Serena Ng", "title": "Panel Cointegration with Global Stochastic Trends", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies estimation of panel cointegration models with\ncross-sectional dependence generated by unobserved global stochastic trends.\nThe standard least squares estimator is, in general, inconsistent owing to the\nspuriousness induced by the unobservable I(1) trends. We propose two iterative\nprocedures that jointly estimate the slope parameters and the stochastic\ntrends. The resulting estimators are referred to respectively as CupBC\n(continuously-updated and bias-corrected) and the CupFM (continuously-updated\nand fully-modified) estimators. We establish their consistency and derive their\nlimiting distributions. Both are asymptotically unbiased and asymptotically\nmixed normal and permit inference to be conducted using standard test\nstatistics. The estimators are also valid when there are mixed stationary and\nnon-stationary factors, as well as when the factors are all stationary.\n", "versions": [{"version": "v1", "created": "Tue, 13 May 2008 01:18:28 GMT"}], "update_date": "2008-05-14", "authors_parsed": [["Bai", "Jushan", ""], ["Kao", "Chihwa", ""], ["Ng", "Serena", ""]]}, {"id": "0805.1805", "submitter": "Gabriele Bianchi", "authors": "Gabriele Bianchi", "title": "The cross covariogram of a pair of polygons determines both polygons,\n  with a few exceptions", "comments": "26 pages, 9 figures", "journal-ref": "Adv. in Appl. Math. 42 (2009), 519--544", "doi": "10.1016/j.aam.2008.10.002", "report-no": null, "categories": "math.MG math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The cross covariogram g_{K,L} of two convex sets K and L in R^n is the\nfunction which associates to each x in R^n the volume of the intersection of K\nand L+x.\n  Very recently Averkov and Bianchi [AB] have confirmed Matheron's conjecture\non the covariogram problem, that asserts that any planar convex body K is\ndetermined by the knowledge of g_{K,K}.\n  The problem of determining the sets from their covariogram is relevant in\nprobability, in statistical shape recognition and in the determination of the\natomic structure of a quasicrystal from X-ray diffraction images.\n  We prove that when K and L are convex polygons (and also when K and L are\nplanar convex cones) g_{K,L} determines both K and L, up to a described family\nof exceptions. These results imply that, when K and L are in these classes, the\ninformation provided by the cross covariogram is so rich as to determine not\nonly one unknown body, as required by Matheron's conjecture, but two bodies,\nwith a few classified exceptions.\n  These results are also used by Bianchi [Bia] to prove that any convex\npolytope P in R^3 is determined by g_{P,P}.\n", "versions": [{"version": "v1", "created": "Tue, 13 May 2008 09:23:40 GMT"}], "update_date": "2010-03-10", "authors_parsed": [["Bianchi", "Gabriele", ""]]}, {"id": "0805.1855", "submitter": "Eric Cator", "authors": "Eric Cator", "title": "Technical report: Adaptivity and optimality of the monotone least\n  squares estimator for four different models", "comments": "35 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we will consider the estimation of a monotone regression (or\ndensity) function in a fixed point by the least squares (Grenander) estimator.\nWe will show that this estimator is fully adaptive, in the sense that the\nattained rate is given by a functional relation using the underlying function\n$f_0$, and not by some smoothness parameter, and that this rate is optimal when\nconsidering the class of all monotone functions, in the sense that there exists\na sequence of alternative monotone functions $f_1$, such that no other\nestimator can attain a better rate for both $f_0$ and $f_1$. We also show that\nunder mild conditions the estimator attains the same rate in $L^q$ sense, and\nwe give general conditions for which we can calculate a (non-standard) limiting\ndistribution for the estimator.\n", "versions": [{"version": "v1", "created": "Tue, 13 May 2008 13:41:20 GMT"}, {"version": "v2", "created": "Fri, 11 Sep 2009 01:45:55 GMT"}], "update_date": "2009-09-11", "authors_parsed": [["Cator", "Eric", ""]]}, {"id": "0805.1949", "submitter": "Lisandro Ferm\\'in", "authors": "Lisandro J. Fermin", "title": "Aggregation of weakly dependent doubly stochastic processes", "comments": "33 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this paper is to extend the aggregation convergence results given\nin (Dacunha-Castelle and Fermin 2005, Dacunha-Castelle and Fermin 2008) to\ndoubly stochastic linear and nonlinear processes with weakly dependent\ninnovations. First, we introduce a weak dependence notion for doubly stochastic\nprocesses, based in the weak dependence definition given in (Doukhan and\nLouhichi 1999), and we exhibe several models satisfying this notion, such as:\ndoubly stochastic Volterra processes and doubly stochastic Bernoulli scheme\nwith weakly dependent innovations. Afterwards we derive a central limit theorem\nfor the partial aggregation sequence considering weakly dependent doubly\nstochastic processes. Finally, show a new SLLN for the covariance function of\nthe partial aggregation process in the case of doubly stochastic Volterra\nprocesses with interactive innovations.\n  Keywords: Aggregation, weak dependence, doubly stochastic processes, Volterra\nprocesses, Bernoulli shift, TCL, SLLN.\n", "versions": [{"version": "v1", "created": "Tue, 13 May 2008 22:31:15 GMT"}], "update_date": "2008-05-15", "authors_parsed": [["Fermin", "Lisandro J.", ""]]}, {"id": "0805.1976", "submitter": "Hwai-Chung Ho", "authors": "Tsung-Lin Cheng, Hwai-Chung Ho", "title": "On Berry--Esseen bounds for non-instantaneous filters of linear\n  processes", "comments": "Published in at http://dx.doi.org/10.3150/07-BEJ112 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2008, Vol. 14, No. 2, 301-321", "doi": "10.3150/07-BEJ112", "report-no": "IMS-BEJ-BEJ112", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $X_n=\\sum_{i=1}^{\\infty}a_i\\epsilon_{n-i}$, where the $\\epsilon_i$ are\ni.i.d. with mean 0 and at least finite second moment, and the $a_i$ are assumed\nto satisfy $|a_i|=O(i^{-\\beta})$ with $\\beta >1/2$. When $1/2<\\beta<1$, $X_n$\nis usually called a long-range dependent or long-memory process. For a certain\nclass of Borel functions $K(x_1,...,x_{d+1})$, $d\\ge0$, from\n${\\mathcal{R}}^{d+1}$ to $\\mathcal{R}$, which includes indicator functions and\npolynomials, the stationary sequence $K(X_n,X_{n+1},...,X_{n+d})$ is\nconsidered. By developing a finite orthogonal expansion of\n$K(X_n,...,X_{n+d})$, the Berry--Esseen type bounds for the normalized sum\n$Q_N/\\sqrt{N},Q_N=\\sum_{n=1}^N(K(X_\nn,...,X_{n+d})-\\mathrm{E}K(X_n,...,X_{n+d}))$ are obtained when $Q_N/\\sqrt{N}$\nobeys the central limit theorem with positive limiting variance.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2008 06:23:11 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Cheng", "Tsung-Lin", ""], ["Ho", "Hwai-Chung", ""]]}, {"id": "0805.2002", "submitter": "Nicolas Privault", "authors": "Nicolas Privault and Anthony Reveillac", "title": "Stochastic analysis on Gaussian space applied to drift estimation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider the nonparametric functional estimation of the\ndrift of Gaussian processes using Paley-Wiener and Karhunen-Lo\\`eve expansions.\nWe construct efficient estimators for the drift of such processes, and prove\ntheir minimaxity using Bayes estimators. We also construct superefficient\nestimators of Stein type for such drifts using the Malliavin integration by\nparts formula and stochastic analysis on Gaussian space, in which superharmonic\nfunctionals of the process paths play a particular role. Our results are\nillustrated by numerical simulations and extend the construction of James-Stein\ntype estimators for Gaussian processes by Berger and Wolper.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2008 08:45:02 GMT"}, {"version": "v2", "created": "Fri, 17 Aug 2018 12:11:07 GMT"}], "update_date": "2018-08-20", "authors_parsed": [["Privault", "Nicolas", ""], ["Reveillac", "Anthony", ""]]}, {"id": "0805.2015", "submitter": "Christos Dimitrakakis", "authors": "Christos Dimitrakakis and Michail G. Lagoudakis", "title": "Algorithms and Bounds for Rollout Sampling Approximate Policy Iteration", "comments": "14 pages, presented at EWRL'08", "journal-ref": null, "doi": null, "report-no": "IAS-UVA-08-03", "categories": "stat.ML cs.LO math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several approximate policy iteration schemes without value functions, which\nfocus on policy representation using classifiers and address policy learning as\na supervised learning problem, have been proposed recently. Finding good\npolicies with such methods requires not only an appropriate classifier, but\nalso reliable examples of best actions, covering the state space sufficiently.\nUp to this time, little work has been done on appropriate covering schemes and\non methods for reducing the sample complexity of such methods, especially in\ncontinuous state spaces. This paper focuses on the simplest possible covering\nscheme (a discretized grid over the state space) and performs a\nsample-complexity comparison between the simplest (and previously commonly\nused) rollout sampling allocation strategy, which allocates samples equally at\neach state under consideration, and an almost as simple method, which allocates\nsamples only as needed and requires significantly fewer samples.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2008 11:20:29 GMT"}, {"version": "v2", "created": "Fri, 18 Jul 2008 14:26:35 GMT"}], "update_date": "2009-12-30", "authors_parsed": [["Dimitrakakis", "Christos", ""], ["Lagoudakis", "Michail G.", ""]]}, {"id": "0805.2029", "submitter": "Piotr Kokoszka", "authors": "Lajos Horv\\'ath, Piotr Kokoszka", "title": "Sample autocovariances of long-memory time series", "comments": "Published in at http://dx.doi.org/10.3150/07-BEJ113 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2008, Vol. 14, No. 2, 405-418", "doi": "10.3150/07-BEJ113", "report-no": "IMS-BEJ-BEJ113", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We find the asymptotic distribution of the sample autocovariances of\nlong-memory processes in cases of finite and infinite fourth moment. Depending\non the interplay of assumptions on moments and the intensity of dependence,\nthere are three types of convergence rates and limit distributions. In\nparticular, a normal approximation with the standard rate does not always hold\nin practically relevant cases.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2008 11:18:05 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Horváth", "Lajos", ""], ["Kokoszka", "Piotr", ""]]}, {"id": "0805.2041", "submitter": "Pavle Mladenovi\\'{c}", "authors": "Pavle Mladenovi\\'c", "title": "Limit distributions for the problem of collecting pairs", "comments": "Published in at http://dx.doi.org/10.3150/07-BEJ114 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2008, Vol. 14, No. 2, 419-439", "doi": "10.3150/07-BEJ114", "report-no": "IMS-BEJ-BEJ114", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $N_n=\\{1,2,...,n\\}$. Elements are drawn from the set $N_n$ with\nreplacement, assuming that each element has probability $1/n$ of being drawn.\nWe determine the limiting distributions for the waiting time until the given\nportion of pairs $jj$, $j\\in N_n$, is sampled. Exact distributions of some\nrelated random variables and their characteristics are also obtained.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2008 11:54:35 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Mladenović", "Pavle", ""]]}, {"id": "0805.2072", "submitter": "Denis Talay", "authors": "Jean Jacod, Antoine Lejay, Denis Talay", "title": "Estimation of the Brownian dimension of a continuous It\\^{o} process", "comments": "Published in at http://dx.doi.org/10.3150/07-BEJ6190 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2008, Vol. 14, No. 2, 469-498", "doi": "10.3150/07-BEJ6190", "report-no": "IMS-BEJ-BEJ6190", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a $d$-dimensional continuous It\\^{o} process which\nis observed at $n$ regularly spaced times on a given time interval $[0,T]$.\nThis process is driven by a multidimensional Wiener process and our aim is to\nprovide asymptotic statistical procedures which give the minimal dimension of\nthe driving Wiener process, which is between 0 (a pure drift) and $d$. We\nexhibit several different procedures, all similar to asymptotic testing\nhypotheses.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2008 14:27:48 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Jacod", "Jean", ""], ["Lejay", "Antoine", ""], ["Talay", "Denis", ""]]}, {"id": "0805.2096", "submitter": "Gernot M\\\"{u}ller", "authors": "Ross A. Maller, Gernot M\\\"uller, Alex Szimayer", "title": "GARCH modelling in continuous time for irregularly spaced time series\n  data", "comments": "Published in at http://dx.doi.org/10.3150/07-BEJ6189 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2008, Vol. 14, No. 2, 519-542", "doi": "10.3150/07-BEJ6189", "report-no": "IMS-BEJ-BEJ6189", "categories": "q-fin.ST math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The discrete-time GARCH methodology which has had such a profound influence\non the modelling of heteroscedasticity in time series is intuitively well\nmotivated in capturing many `stylized facts' concerning financial series, and\nis now almost routinely used in a wide range of situations, often including\nsome where the data are not observed at equally spaced intervals of time.\nHowever, such data is more appropriately analyzed with a continuous-time model\nwhich preserves the essential features of the successful GARCH paradigm. One\npossible such extension is the diffusion limit of Nelson, but this is\nproblematic in that the discrete-time GARCH model and its continuous-time\ndiffusion limit are not statistically equivalent. As an alternative,\nKl\\\"{u}ppelberg et al. recently introduced a continuous-time version of the\nGARCH (the `COGARCH' process) which is constructed directly from a background\ndriving L\\'{e}vy process. The present paper shows how to fit this model to\nirregularly spaced time series data using discrete-time GARCH methodology, by\napproximating the COGARCH with an embedded sequence of discrete-time GARCH\nseries which converges to the continuous-time model in a strong sense (in\nprobability, in the Skorokhod metric), as the discrete approximating grid grows\nfiner. This property is also especially useful in certain other applications,\nsuch as options pricing. The way is then open to using, for the COGARCH,\nsimilar statistical techniques to those already worked out for GARCH models and\nto illustrate this, an empirical investigation using stock index data is\ncarried out.\n", "versions": [{"version": "v1", "created": "Wed, 14 May 2008 15:45:16 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Maller", "Ross A.", ""], ["Müller", "Gernot", ""], ["Szimayer", "Alex", ""]]}, {"id": "0805.2214", "submitter": "Siegfried H\\\"{o}rmann", "authors": "Siegfried H\\\"ormann", "title": "Augmented GARCH sequences: Dependence structure and asymptotics", "comments": "Published in at http://dx.doi.org/10.3150/07-BEJ120 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2008, Vol. 14, No. 2, 543-561", "doi": "10.3150/07-BEJ120", "report-no": "IMS-BEJ-BEJ120", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The augmented GARCH model is a unification of numerous extensions of the\npopular and widely used ARCH process. It was introduced by Duan and besides\nordinary (linear) GARCH processes, it contains exponential GARCH, power GARCH,\nthreshold GARCH, asymmetric GARCH, etc. In this paper, we study the\nprobabilistic structure of augmented $\\mathrm {GARCH}(1,1)$ sequences and the\nasymptotic distribution of various functionals of the process occurring in\nproblems of statistical inference. Instead of using the Markov structure of the\nmodel and implied mixing properties, we utilize independence properties of\nperturbed GARCH sequences to directly reduce their asymptotic behavior to the\ncase of independent random variables. This method applies for a very large\nclass of functionals and eliminates the fairly restrictive moment and\nsmoothness conditions assumed in the earlier theory. In particular, we derive\nfunctional CLTs for powers of the augmented GARCH variables, derive the error\nrate in the CLT and obtain asymptotic results for their empirical processes\nunder nearly optimal conditions.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 05:55:44 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Hörmann", "Siegfried", ""]]}, {"id": "0805.2216", "submitter": "Alexander Meister", "authors": "Aurore Delaigle, Alexander Meister", "title": "Density estimation with heteroscedastic error", "comments": "Published in at http://dx.doi.org/10.3150/08-BEJ121 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2008, Vol. 14, No. 2, 562-579", "doi": "10.3150/08-BEJ121", "report-no": "IMS-BEJ-BEJ121", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is common, in deconvolution problems, to assume that the measurement\nerrors are identically distributed. In many real-life applications, however,\nthis condition is not satisfied and the deconvolution estimators developed for\nhomoscedastic errors become inconsistent. In this paper, we introduce a kernel\nestimator of a density in the case of heteroscedastic contamination. We\nestablish consistency of the estimator and show that it achieves optimal rates\nof convergence under quite general conditions. We study the limits of\napplication of the procedure in some extreme situations, where we show that, in\nsome cases, our estimator is consistent, even when the scaling parameter of the\nerror is unbounded. We suggest a modified estimator for the problem where the\ndistribution of the errors is unknown, but replicated observations are\navailable. Finally, an adaptive procedure for selecting the smoothing parameter\nis proposed and its finite-sample properties are investigated on simulated\nexamples.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 06:19:47 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Delaigle", "Aurore", ""], ["Meister", "Alexander", ""]]}, {"id": "0805.2219", "submitter": "Miguel L\\'{o}pez-D\\'{{\\i}}az", "authors": "Ignacio Cascos, Miguel L\\'opez-D\\'iaz", "title": "Consistency of the $\\alpha$-trimming of a probability. Applications to\n  central regions", "comments": "Published in at http://dx.doi.org/10.3150/07-BEJ109 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2008, Vol. 14, No. 2, 580-592", "doi": "10.3150/07-BEJ109", "report-no": "IMS-BEJ-BEJ109", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The sequence of $\\alpha$-trimmings of empirical probabilities is shown to\nconverge, in the Painlev\\'{e}--Kuratowski sense, on the class of probability\nmeasures endowed with the weak topology, to the $\\alpha$-trimming of the\npopulation probability. Such a result is applied to the study of the asymptotic\nbehaviour of central regions based on the trimming of a probability.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 06:44:21 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Cascos", "Ignacio", ""], ["López-Díaz", "Miguel", ""]]}, {"id": "0805.2228", "submitter": "Bimal Sinha", "authors": "Jerzy A. Filar, Irene Hudson, Thomas Mathew, Bimal Sinha", "title": "Analytic perturbations and systematic bias in statistical modeling and\n  inference", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000022 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 17-34", "doi": "10.1214/193940307000000022", "report-no": "IMS-COLL1-IMSCOLL102", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we provide a comprehensive study of statistical inference in\nlinear and allied models which exhibit some analytic perturbations in their\ndesign and covariance matrices. We also indicate a few potential applications.\nIn the theory of perturbations of linear operators it has been known for a long\ntime that the so-called ``singular perturbations'' can have a big impact on\nsolutions of equations involving these operators even when their size is small.\nIt appears that so far the question of whether such undesirable phenomena can\nalso occur in statistical models and their solutions has not been formally\nstudied. The models considered in this article arise in the context of\nnonlinear models where a single parameter accounts for the nonlinearity.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 08:26:52 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Filar", "Jerzy A.", ""], ["Hudson", "Irene", ""], ["Mathew", "Thomas", ""], ["Sinha", "Bimal", ""]]}, {"id": "0805.2229", "submitter": "Mervyn J. Silvapulle", "authors": "N. Balakrishnan, Edsel A. Pe\\~na, Mervyn J. Silvapulle", "title": "Pranab Kumar Sen: Life and works", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000013 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 1-16", "doi": "10.1214/193940307000000013", "report-no": "IMS-COLL1-IMSCOLL101", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we describe briefly the highlights and various\naccomplishments in the personal as well as the academic life of Professor\nPranab Kumar Sen.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 08:31:01 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Balakrishnan", "N.", ""], ["Peña", "Edsel A.", ""], ["Silvapulle", "Mervyn J.", ""]]}, {"id": "0805.2231", "submitter": "Yogendra P. Chaubey", "authors": "Yogendra P. Chaubey, Arusharka Sen", "title": "Smooth estimation of mean residual life under random censoring", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000031 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 35-49", "doi": "10.1214/193940307000000031", "report-no": "IMS-COLL1-IMSCOLL103", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose here a smooth estimator of the mean residual life function based\non randomly censored data. This is derived by smoothing the product-limit\nestimator using the Chaubey-Sen technique (Chaubey and Sen (1998)). The\nresulting estimator does not suffer from boundary bias as is the case with\nstandard kernel smoothing. The asymptotic properties of the estimator are\ninvestigated. We establish strong uniform consistency and asymptotic normality.\nThis complements the work of Chaubey and Sen (1999) which considered a similar\nestimation procedure in the case of complete data. It is seen that the\nproperties are similar, though technically more difficult to prove, to those in\nthe complete data case with appropriate modifications due to censoring.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 08:59:50 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Chaubey", "Yogendra P.", ""], ["Sen", "Arusharka", ""]]}, {"id": "0805.2239", "submitter": "Subhash Kochar", "authors": "Hammou El Barmi, Subhash Kochar, Hari Mukerjee", "title": "Order restricted inference for comparing the cumulative incidence of a\n  competing risk over several populations", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000040 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 50-61", "doi": "10.1214/193940307000000040", "report-no": "IMS-COLL1-IMSCOLL104", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is a substantial literature on testing for the equality of the\ncumulative incidence functions associated with one specific cause in a\ncompeting risks setting across several populations against specific or all\nalternatives. In this paper we propose an asymptotically distribution-free test\nwhen the alternative is that the incidence functions are linearly ordered, but\nnot equal. The motivation stems from the fact that in many examples such a\nlinear ordering seems reasonable intuitively and is borne out generally from\nempirical observations. These tests are more powerful when the ordering is\njustified. We also provide estimators of the incidence functions under this\nordering constraint, derive their asymptotic properties for statistical\ninference purposes, and show improvements over the unrestricted estimators when\nthe order restriction holds.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 09:21:26 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Barmi", "Hammou El", ""], ["Kochar", "Subhash", ""], ["Mukerjee", "Hari", ""]]}, {"id": "0805.2242", "submitter": "Shyamal D. Peddada", "authors": "Eric Teoh, Abraham Nyska, Uri Wormser, Shyamal D. Peddada", "title": "Statistical inference under order restrictions on both rows and columns\n  of a matrix, with an application in toxicology", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000059 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 62-77", "doi": "10.1214/193940307000000059", "report-no": "IMS-COLL1-IMSCOLL105", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a general methodology for performing statistical inference on the\ncomponents of a real-valued matrix parameter for which rows and columns are\nsubject to order restrictions. The proposed estimation procedure is based on an\niterative algorithm developed by Dykstra and Robertson (1982) for simple order\nrestriction on rows and columns of a matrix. For any order restrictions on rows\nand columns of a matrix, sufficient conditions are derived for the algorithm to\nconverge in a single application of row and column operations. The new\nalgorithm is applicable to a broad collection of order restrictions. In\npractice, it is easy to design a study such that the sufficient conditions\nderived in this paper are satisfied. For instance, the sufficient conditions\nare satisfied in a balanced design. Using the estimation procedure developed in\nthis article, a bootstrap test for order restrictions on rows and columns of a\nmatrix is proposed. Computer simulations for ordinal data were performed to\ncompare the proposed test with some existing test procedures in terms of size\nand power. The new methodology is illustrated by applying it to a set of\nordinal data obtained from a toxicological study.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 09:47:04 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Teoh", "Eric", ""], ["Nyska", "Abraham", ""], ["Wormser", "Uri", ""], ["Peddada", "Shyamal D.", ""]]}, {"id": "0805.2246", "submitter": "Satrajit Roychoudhury", "authors": "Satrajit Roychoudhury, Manish C. Bhattacharjee", "title": "On the structure of a family of probability generating functions induced\n  by shock models", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000536 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 78-88", "doi": "10.1214/193940307000000536", "report-no": "IMS-COLL1-IMSCOLL106", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore conditions for a class of functions defined via an integral\nrepresentation to be a probability generating function of some positive integer\nvalued random variable. Interest in and research on this question is motivated\nby an apparently surprising connection between a family of classic shock models\ndue to Esary et. al. (1973) and the negatively aging nonparametric notion of\n``strongly decreasing failure rate'' (SDFR) introduced by Bhattacharjee (2005).\nA counterexample shows that there exist probability generating functions with\nour integral representation which are not discrete SDFR, but when used as shock\nresistance probabilities can give rise to a SDFR survival distribution in\ncontinuous time.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 10:06:39 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Roychoudhury", "Satrajit", ""], ["Bhattacharjee", "Manish C.", ""]]}, {"id": "0805.2258", "submitter": "Gauri S. Datta", "authors": "Archan Bhattacharya, Bertrand S. Clarke, Gauri S. Datta", "title": "A Bayesian test for excess zeros in a zero-inflated power series\n  distribution", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000068 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 89-104", "doi": "10.1214/193940307000000068", "report-no": "IMS-COLL1-IMSCOLL107", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Power series distributions form a useful subclass of one-parameter discrete\nexponential families suitable for modeling count data. A zero-inflated power\nseries distribution is a mixture of a power series distribution and a\ndegenerate distribution at zero, with a mixing probability $p$ for the\ndegenerate distribution. This distribution is useful for modeling count data\nthat may have extra zeros. One question is whether the mixture model can be\nreduced to the power series portion, corresponding to $p=0$, or whether there\nare so many zeros in the data that zero inflation relative to the pure power\nseries distribution must be included in the model i.e., $p\\geq0$. The problem\nis difficult partially because $p=0$ is a boundary point. Here, we present a\nBayesian test for this problem based on recognizing that the parameter space\ncan be expanded to allow $p$ to be negative. Negative values of $p$ are\ninconsistent with the interpretation of $p$ as a mixing probability, however,\nthey index distributions that are physically and probabilistically meaningful.\nWe compare our Bayesian solution to two standard frequentist testing procedures\nand find that using a posterior probability as a test statistic has slightly\nhigher power on the most important ranges of the sample size $n$ and parameter\nvalues than the score test and likelihood ratio test in simulations. Our method\nalso performs well on three real data sets.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 11:12:55 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Bhattacharya", "Archan", ""], ["Clarke", "Bertrand S.", ""], ["Datta", "Gauri S.", ""]]}, {"id": "0805.2264", "submitter": "Subhashis Ghosal", "authors": "Subhashis Ghosal, Anindya Roy, Yongqiang Tang", "title": "Posterior consistency of Dirichlet mixtures of beta densities in\n  estimating positive false discovery rates", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000077 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 105-115", "doi": "10.1214/193940307000000077", "report-no": "IMS-COLL1-IMSCOLL108", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, multiple hypothesis testing has come to the forefront of\nstatistical research, ostensibly in relation to applications in genomics and\nsome other emerging fields. The false discovery rate (FDR) and its variants\nprovide very important notions of errors in this context comparable to the role\nof error probabilities in classical testing problems. Accurate estimation of\npositive FDR (pFDR), a variant of the FDR, is essential in assessing and\ncontrolling this measure. In a recent paper, the authors proposed a model-based\nnonparametric Bayesian method of estimation of the pFDR function. In\nparticular, the density of p-values was modeled as a mixture of decreasing beta\ndensities and an appropriate Dirichlet process was considered as a prior on the\nmixing measure. The resulting procedure was shown to work well in simulations.\nIn this paper, we provide some theoretical results in support of the beta\nmixture model for the density of p-values, and show that, under appropriate\nconditions, the resulting posterior is consistent as the number of hypotheses\ngrows to infinity.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 11:32:52 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Ghosal", "Subhashis", ""], ["Roy", "Anindya", ""], ["Tang", "Yongqiang", ""]]}, {"id": "0805.2268", "submitter": "Malay Ghosh", "authors": "Malay Ghosh", "title": "Robust estimation in finite population sampling", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000086 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 116-122", "doi": "10.1214/193940307000000086", "report-no": "IMS-COLL1-IMSCOLL109", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper proposes some robust estimators of the finite population mean. Such\nestimators are particularly suitable in the presence of some outlying\nobservations. Included as special cases of our general result are robust\nversions of the ratio estimator and the Horvitz-Thompson estimator. The robust\nestimators are derived on the basis of certain predictive influence functions.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 11:45:41 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Ghosh", "Malay", ""]]}, {"id": "0805.2276", "submitter": "Arnab Maity", "authors": "Arnab Maity, Tatiyana V. Apanasovich, Raymond J. Carroll", "title": "Estimation of population-level summaries in general semiparametric\n  repeated measures regression models", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000095 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 123-137", "doi": "10.1214/193940307000000095", "report-no": "IMS-COLL1-IMSCOLL110", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a wide family of semiparametric repeated measures\nregression models, in which the main interest is on estimating population-level\nquantities such as mean, variance, probabilities etc. Examples of our framework\ninclude generalized linear models for clustered/longitudinal data, among many\nothers. We derive plug-in kernel-based estimators of the population level\nquantities and derive their asymptotic distribution. An example involving\nestimation of the survival function of hemoglobin measures in the Kenya\nhemoglobin study data is presented to demonstrate our methodology.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 12:14:06 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Maity", "Arnab", ""], ["Apanasovich", "Tatiyana V.", ""], ["Carroll", "Raymond J.", ""]]}, {"id": "0805.2285", "submitter": "Jeffrey D. Hart", "authors": "Jeffrey D. Hart", "title": "Smoothing-inspired lack-of-fit tests based on ranks", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000103 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 138-155", "doi": "10.1214/193940307000000103", "report-no": "IMS-COLL1-IMSCOLL111", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A rank-based test of the null hypothesis that a regressor has no effect on a\nresponse variable is proposed and analyzed. This test is identical in structure\nto the order selection test but with the raw data replaced by ranks. The test\nis nonparametric in that it is consistent against virtually any smooth\nalternative, and is completely distribution free for all sample sizes. The\nasymptotic distribution of the rank-based order selection statistic is obtained\nand seen to be the same as that of its raw data counterpart. Exact small sample\ncritical values of the test statistic are provided as well. It is shown that\nthe Pitman-Noether efficiency of the proposed rank test compares very favorably\nwith that of the order selection test. In fact, their asymptotic relative\nefficiency is identical to that of the Wilcoxon signed rank and $t$-tests. An\nexample involving microarray data illustrates the usefulness of the rank test\nin practice.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 12:39:34 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Hart", "Jeffrey D.", ""]]}, {"id": "0805.2300", "submitter": "Jana Jure\\v{c}kov\\'{a}", "authors": "Jana Jure\\v{c}kov\\'a", "title": "Regression rank scores in nonlinear models", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000121 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 173-183", "doi": "10.1214/193940307000000121", "report-no": "IMS-COLL1-IMSCOLL113", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider the nonlinear regression model $Y_i=g({\\bf x}_i,\\boldmath\n$\\theta$)+e_i,\\quad i=1,...,n$(1) with ${\\bf x}_i\\in \\mathbb{R}^k,$\n$\\boldmath{\\theta}=(\\theta_0,\\theta_1,...,\\theta_p)^{\\prime}\\in \\boldmath\n$\\Theta$$ (compact in $\\mathbb{R}^{p+1}$), where $g({\\bf x},\\boldmath\n$\\theta$)=\\theta_0+\\tilde{g}({\\bf x},\\theta_1,...,\\theta_p)$ is continuous,\ntwice differentiable in $\\boldmath $\\theta$$ and monotone in components of\n$\\boldmath $\\theta$$. Following Gutenbrunner and Jure\\v{c}kov\\'{a} (1992) and\nJure\\v{c}kov\\'{a} and Proch\\'{a}zka (1994), we introduce regression rank scores\nfor model (1), and prove their asymptotic properties under some regularity\nconditions. As an application, we propose some tests in nonlinear regression\nmodels with nuisance parameters.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 13:22:07 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Jurečková", "Jana", ""]]}, {"id": "0805.2305", "submitter": "Marc Hallin", "authors": "Marc Hallin, Davy Paindaveine", "title": "Chernoff-Savage and Hodges-Lehmann results for Wilks' test of\n  multivariate independence", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000130 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 184-196", "doi": "10.1214/193940307000000130", "report-no": "IMS-COLL1-IMSCOLL114", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend to rank-based tests of multivariate independence the\nChernoff-Savage and Hodges-Lehmann classical univariate results. More\nprecisely, we show that the Taskinen, Kankainen and Oja (2004) normal-score\nrank test for multivariate independence uniformly dominates -- in the Pitman\nsense -- the classical Wilks (1935) test, which establishes the Pitman\nnon-admissibility of the latter, and provide, for any fixed space dimensions\n$p,q$ of the marginals, the lower bound for the asymptotic relative efficiency,\nstill with respect to Wilks' test, of the Wilcoxon version of the same.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 13:39:04 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Hallin", "Marc", ""], ["Paindaveine", "Davy", ""]]}, {"id": "0805.2316", "submitter": "Juv\\^{e}ncio S. Nobre", "authors": "Juv\\^encio S. Nobre, Julio M. Singer, Mervyn J. Silvapulle", "title": "$U$-tests for variance components in one-way random effects models", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000149 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 197-210", "doi": "10.1214/193940307000000149", "report-no": "IMS-COLL1-IMSCOLL115", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a test for the hypothesis that the within-treatment variance\ncomponent in a one-way random effects model is null. This test is based on a\ndecomposition of a $U$-statistic. Its asymptotic null distribution is derived\nunder the mild regularity condition that the second moment of the random\neffects and the fourth moment of the within-treatment errors are finite. Under\nthe additional assumption that the fourth moment of the random effect is\nfinite, we also derive the distribution of the proposed $U$-test statistic\nunder a sequence of local alternative hypotheses. We report the results of a\nsimulation study conducted to compare the performance of the $U$-test with that\nof the usual $F$-test. The main conclusions of the simulation study are that\n(i) under normality or under moderate degrees of imbalance in the design, the\n$F$-test behaves well when compared to the $U$-test, and (ii) when the\ndistribution of the random effects and within-treatment errors are nonnormal,\nthe $U$-test is preferable even when the number of treatments is small.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 14:09:01 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Nobre", "Juvêncio S.", ""], ["Singer", "Julio M.", ""], ["Silvapulle", "Mervyn J.", ""]]}, {"id": "0805.2322", "submitter": "Sanat K. Sarkar", "authors": "Sanat K. Sarkar", "title": "On the Simes inequality and its generalization", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000167 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 231-242", "doi": "10.1214/193940307000000167", "report-no": "IMS-COLL1-IMSCOLL117", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Simes inequality has received considerable attention recently because of\nits close connection to some important multiple hypothesis testing procedures.\nWe revisit in this article an old result on this inequality to clarify and\nstrengthen it and a recently proposed generalization of it to offer an\nalternative simpler proof.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 14:36:12 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Sarkar", "Sanat K.", ""]]}, {"id": "0805.2328", "submitter": "Debashis Ghosh", "authors": "Debashis Ghosh", "title": "Multiple testing procedures under confounding", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000176 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 243-256", "doi": "10.1214/193940307000000176", "report-no": "IMS-COLL1-IMSCOLL118", "categories": "stat.ME math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While multiple testing procedures have been the focus of much statistical\nresearch, an important facet of the problem is how to deal with possible\nconfounding. Procedures have been developed by authors in genetics and\nstatistics. In this chapter, we relate these proposals. We propose two new\nmultiple testing approaches within this framework. The first combines\nsensitivity analysis methods with false discovery rate estimation procedures.\nThe second involves construction of shrinkage estimators that utilize the\nmixture model for multiple testing. The procedures are illustrated with\napplications to a gene expression profiling experiment in prostate cancer.\n", "versions": [{"version": "v1", "created": "Thu, 15 May 2008 14:47:39 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Ghosh", "Debashis", ""]]}, {"id": "0805.2456", "submitter": "Laura J. Simon", "authors": "Laura J. Simon, Vernon M. Chinchilli", "title": "A pattern mixture model for a paired $2\\times2$ crossover design", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000185 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 257-271", "doi": "10.1214/193940307000000185", "report-no": "IMS-COLL1-IMSCOLL119", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When conducting a paired $2\\times2$ crossover design, each subject is paired\nwith another subject with similar characteristics. The pair is then randomized\nto the same sequence of two treatments. That is, the two subjects receive the\nfirst experimental treatment, and then they cross over and receive the other\nexperimental treatment(s). The paired $2\\times2$ crossover design that was used\nin the Beta Adrenergic Response by GEnotype (BARGE) Study conducted by the\nNational Heart, Lung and Blood Institute's Asthma Clinical Research Network\n(ACRN) has been described elsewhere. When the data arising from such a design\nare balanced and complete -- or if at least any missingness that occurs is at\nrandom -- general linear mixed-effects model methods can be used to analyze the\ndata. In this paper, we present a method based on a pattern-mixture model for\nanalyzing the data arising from a paired $2\\times2$ crossover design when some\nof the data are missing in a non-ignorable fashion. Because of its inherent\nscientific interest, we focus our particular attention on the estimation of the\ntreatment-by-type of subject interaction term. Finally, we illustrate the\npattern-mixture model methods described in this paper on the data arising from\nthe BARGE study.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 06:47:41 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Simon", "Laura J.", ""], ["Chinchilli", "Vernon M.", ""]]}, {"id": "0805.2460", "submitter": "Debapriya Sengupta", "authors": "Debapriya Sengupta, Rahul Mazumder", "title": "Projected likelihood contrasts for testing homogeneity in finite mixture\n  models with nuisance parameters", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000194 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 272-281", "doi": "10.1214/193940307000000194", "report-no": "IMS-COLL1-IMSCOLL120", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops a test for homogeneity in finite mixture models where the\nmixing proportions are known a priori (taken to be 0.5) and a common nuisance\nparameter is present. Statistical tests based on the notion of Projected\nLikelihood Contrasts (PLC) are considered. The PLC is a slight modification of\nthe usual likelihood ratio statistic or the Wilk's $\\Lambda$ and is similar in\nspirit to the Rao's score test. Theoretical investigations have been carried\nout to understand the large sample statistical properties of these tests.\nSimulation studies have been carried out to understand the behavior of the null\ndistribution of the PLC statistic in the case of Gaussian mixtures with unknown\nmeans (common variance as nuisance parameter) and unknown variances (common\nmean as nuisance parameter). The results are in conformity with the theoretical\nresults obtained. Power functions of these tests have been evaluated based on\nsimulations from Gaussian mixtures.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 07:19:17 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Sengupta", "Debapriya", ""], ["Mazumder", "Rahul", ""]]}, {"id": "0805.2470", "submitter": "Michael R. Kosorok", "authors": "Michael R. Kosorok", "title": "Bootstrapping the Grenander estimator", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000202 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 282-292", "doi": "10.1214/193940307000000202", "report-no": "IMS-COLL1-IMSCOLL121", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of this paper is to study the bootstrap for the Grenander estimator.\nThe first result is a proof of the inconsistency of the nonparametric bootstrap\nfor the Grenander estimator at a given point. The second result is the\ndevelopment and verification of a bootstrap for the $L_1$ confidence band for\nthe Grenander estimator. As part of this work, kernel estimators are studied as\nalternatives to the Grenander estimator. We show that when the second\nderivative of the true density is assumed to be uniformly bounded, there exist\nkernel estimators with faster convergence rates than the Grenander estimator.\nWe study the implications of this in developing $L_1$ and uniform confidence\nbands and discuss some open questions.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 08:17:48 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Kosorok", "Michael R.", ""]]}, {"id": "0805.2473", "submitter": "Marie Hu\\v{s}kov\\'{a}", "authors": "Lajos Horv\\'ath, Zsuzsanna Horv\\'ath, Marie Hu\\v{s}kov\\'a", "title": "Ratio tests for change point detection", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000220 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 293-304", "doi": "10.1214/193940307000000220", "report-no": "IMS-COLL1-IMSCOLL122", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose new tests to detect a change in the mean of a time series. Like\nmany existing tests, the new ones are based on the CUSUM process. Existing\nCUSUM tests require an estimator of a scale parameter to make them\nasymptotically distribution free under the no change null hypothesis. Even if\nthe observations are independent, the estimation of the scale parameter is not\nsimple since the estimator for the scale parameter should be at least\nconsistent under the null as well as under the alternative. The situation is\nmuch more complicated in case of dependent data, where the empirical spectral\ndensity at 0 is used to scale the CUSUM process. To circumvent these\ndifficulties, new tests are proposed which are ratios of CUSUM functionals. We\ndemonstrate the applicability of our method to detect a change in the mean when\nthe errors are AR(1) and GARCH(1,1) sequences.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 08:32:24 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Horváth", "Lajos", ""], ["Horváth", "Zsuzsanna", ""], ["Hušková", "Marie", ""]]}, {"id": "0805.2479", "submitter": "Ma{\\l}gorzata Bogdan", "authors": "Ma{\\l}gorzata Bogdan, Jayanta K. Ghosh, Surya T. Tokdar", "title": "A comparison of the Benjamini-Hochberg procedure with some Bayesian\n  rules for multiple testing", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000158 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 211-230", "doi": "10.1214/193940307000000158", "report-no": "IMS-COLL1-IMSCOLL116", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the spirit of modeling inference for microarrays as multiple testing for\nsparse mixtures, we present a similar approach to a simplified version of\nquantitative trait loci (QTL) mapping. Unlike in case of microarrays, where the\nnumber of tests usually reaches tens of thousands, the number of tests\nperformed in scans for QTL usually does not exceed several hundreds. However,\nin typical cases, the sparsity $p$ of significant alternatives for QTL mapping\nis in the same range as for microarrays. For methodological interest, as well\nas some related applications, we also consider non-sparse mixtures. Using\nsimulations as well as theoretical observations we study false discovery rate\n(FDR), power and misclassification probability for the Benjamini-Hochberg (BH)\nprocedure and its modifications, as well as for various parametric and\nnonparametric Bayes and Parametric Empirical Bayes procedures. Our results\nconfirm the observation of Genovese and Wasserman (2002) that for small p the\nmisclassification error of BH is close to optimal in the sense of attaining the\nBayes oracle. This property is shared by some of the considered Bayes testing\nrules, which in general perform better than BH for large or moderate $p$'s.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 09:06:03 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Bogdan", "Małgorzata", ""], ["Ghosh", "Jayanta K.", ""], ["Tokdar", "Surya T.", ""]]}, {"id": "0805.2485", "submitter": "Kung-Yee Liang", "authors": "Hongling Zhou, Kung-Yee Liang", "title": "On estimating the change point in generalized linear models", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000239 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 305-320", "doi": "10.1214/193940307000000239", "report-no": "IMS-COLL1-IMSCOLL123", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Statistical models incorporating change points are common in practice,\nespecially in the area of biomedicine. This approach is appealing in that a\nspecific parameter is introduced to account for the abrupt change in the\nresponse variable relating to a particular independent variable of interest.\nThe statistical challenge one encounters is that the likelihood function is not\ndifferentiable with respect to this change point parameter. Consequently, the\nconventional asymptotic properties for the maximum likelihood estimators fail\nto hold in this situation. In this paper, we propose an estimating procedure\nfor estimating the change point along with other regression coefficients under\nthe generalized linear model framework. We show that the proposed estimators\nenjoy the conventional asymptotic properties including consistency and\nnormality. Simulation work we conducted suggests that it performs well for the\nsituations considered. We applied the proposed method to a case-control study\naimed to examine the relationship between the risk of myocardial infarction and\nalcohol intake.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 09:32:02 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Zhou", "Hongling", ""], ["Liang", "Kung-Yee", ""]]}, {"id": "0805.2492", "submitter": "Tze Leung Lai", "authors": "Tze Leung Lai, Zheng Su", "title": "Sequential nonparametrics and semiparametrics: Theory, implementation\n  and applications to clinical trials", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000257 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 332-349", "doi": "10.1214/193940307000000257", "report-no": "IMS-COLL1-IMSCOLL125", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of Pranab K. Sen's major research areas is sequential nonparametrics and\nsemiparametrics and their applications to clinical trials, to which he has made\nmany important contributions. Herein we review a number of these contributions\nand related developments. We also describe some recent work on nonparametric\nand semiparametric inference and the associated computational methods in\ntime-sequential clinical trials with survival endpoints.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 10:06:40 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Lai", "Tze Leung", ""], ["Su", "Zheng", ""]]}, {"id": "0805.2501", "submitter": "G. J. McLachlan", "authors": "G. J. McLachlan, J. Chevelu, J. Zhu", "title": "Correcting for selection bias via cross-validation in the classification\n  of microarray data", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000284 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 364-376", "doi": "10.1214/193940307000000284", "report-no": "IMS-COLL1-IMSCOLL128", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is increasing interest in the use of diagnostic rules based on\nmicroarray data. These rules are formed by considering the expression levels of\nthousands of genes in tissue samples taken on patients of known classification\nwith respect to a number of classes, representing, say, disease status or\ntreatment strategy. As the final versions of these rules are usually based on a\nsmall subset of the available genes, there is a selection bias that has to be\ncorrected for in the estimation of the associated error rates. We consider the\nproblem using cross-validation. In particular, we present explicit formulae\nthat are useful in explaining the layers of validation that have to be\nperformed in order to avoid improperly cross-validated estimates.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 10:57:00 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["McLachlan", "G. J.", ""], ["Chevelu", "J.", ""], ["Zhu", "J.", ""]]}, {"id": "0805.2516", "submitter": "Alu\\'{{\\i}}sio Pinheiro", "authors": "Alu\\'isio Pinheiro, Hildete P. Pinheiro, Samara Kiihl", "title": "An asymptotically normal test for the selective neutrality hypothesis", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000293 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 377-389", "doi": "10.1214/193940307000000293", "report-no": "IMS-COLL1-IMSCOLL129", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important parameter in the study of population evolution is\n$\\theta=4N\\nu$, where $N$ is the effective population size and $\\nu$ is the\nrate of mutation per locus per generation. Therefore, $\\theta$ represents the\nmean number of mutations per site per generation. There are many estimators of\n$\\theta$, one of them being the mean number of pairwise nucleotide differences,\nwhich we call $\\mathcal{T}_2$. Other estimators are $\\mathcal{T}_1$, based on\nthe number of segregating sites and $\\mathcal{T}_3$, based on the number of\nsingletons. The concept of selective neutrality can be interpreted as a\ndifferentiated nucleotide distribution for mutant sites when compared to the\noverall nucleotide distribution. Tajima (1989) has proposed the so-called\nTajima's test of selective neutrality based on $\\mathcal{T}_2-\\mathcal{T}_1$.\nIts complex empirical behavior (Kiihl, 2005) motivates us to propose a test\nstatistic solely based on $\\mathcal{T}_2$. We are thus able to prove asymptotic\nnormality under different assumptions on the number of sequences and number of\nsites via $U$-statistics theory.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 12:37:40 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Pinheiro", "Aluísio", ""], ["Pinheiro", "Hildete P.", ""], ["Kiihl", "Samara", ""]]}, {"id": "0805.2523", "submitter": "Mayetri Gupta", "authors": "Mayetri Gupta", "title": "Model selection and sensitivity analysis for sequence pattern models", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000301 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 1, 390-407", "doi": "10.1214/193940307000000301", "report-no": "IMS-COLL1-IMSCOLL130", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we propose a maximal a posteriori (MAP) criterion for model\nselection in the motif discovery problem and investigate conditions under which\nthe MAP asymptotically gives a correct prediction of model size. We also\ninvestigate robustness of the MAP to prior specification and provide guidelines\nfor choosing prior hyper-parameters for motif models based on sensitivity\nconsiderations.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2008 13:07:31 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Gupta", "Mayetri", ""]]}, {"id": "0805.2838", "submitter": "E. L. Lehmann", "authors": "E. L. Lehmann", "title": "On the history and use of some standard statistical models", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000419 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 2, 114-126", "doi": "10.1214/193940307000000419", "report-no": "IMS-COLL2-IMSCOLL208", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper tries to tell the story of the general linear model, which saw the\nlight of day 200 years ago, and the assumptions underlying it. We distinguish\nthree principal stages (ignoring earlier more isolated instances). The model\nwas first proposed in the context of astronomical and geodesic observations,\nwhere the main source of variation was observational error. This was the main\nuse of the model during the 19th century. In the 1920's it was developed in a\nnew direction by R.A. Fisher whose principal applications were in agriculture\nand biology. Finally, beginning in the 1930's and 40's it became an important\ntool for the social sciences. As new areas of applications were added, the\nassumptions underlying the model tended to become more questionable, and the\nresulting statistical techniques more prone to misuse.\n", "versions": [{"version": "v1", "created": "Mon, 19 May 2008 11:11:16 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Lehmann", "E. L.", ""]]}, {"id": "0805.3034", "submitter": "Peter Bickel", "authors": "Thomas Bengtsson, Peter Bickel, Bo Li", "title": "Curse-of-dimensionality revisited: Collapse of the particle filter in\n  very large scale systems", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000518 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 2, 316-334", "doi": "10.1214/193940307000000518", "report-no": "IMS-COLL2-IMSCOLL218", "categories": "math.ST stat.CO stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has been widely realized that Monte Carlo methods (approximation via a\nsample ensemble) may fail in large scale systems. This work offers some\ntheoretical insight into this phenomenon in the context of the particle filter.\nWe demonstrate that the maximum of the weights associated with the sample\nensemble converges to one as both the sample size and the system dimension\ntends to infinity. Specifically, under fairly weak assumptions, if the ensemble\nsize grows sub-exponentially in the cube root of the system dimension, the\nconvergence holds for a single update step in state-space models with\nindependent and identically distributed kernels. Further, in an important\nspecial case, more refined arguments show (and our simulations suggest) that\nthe convergence to unity occurs unless the ensemble grows super-exponentially\nin the system dimension. The weight singularity is also established in models\nwith more general multivariate likelihoods, e.g. Gaussian and Cauchy. Although\npresented in the context of atmospheric data assimilation for numerical weather\nprediction, our results are generally valid for high-dimensional particle\nfilters.\n", "versions": [{"version": "v1", "created": "Tue, 20 May 2008 09:49:07 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Bengtsson", "Thomas", ""], ["Bickel", "Peter", ""], ["Li", "Bo", ""]]}, {"id": "0805.3040", "submitter": "James Robins", "authors": "James Robins, Lingling Li, Eric Tchetgen, Aad van der Vaart", "title": "Higher order influence functions and minimax estimation of nonlinear\n  functionals", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000527 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 2, 335-421", "doi": "10.1214/193940307000000527", "report-no": "IMS-COLL2-IMSCOLL219", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a theory of point and interval estimation for nonlinear\nfunctionals in parametric, semi-, and non-parametric models based on higher\norder influence functions (Robins (2004), Section 9; Li et al. (2004), Tchetgen\net al. (2006), Robins et al. (2007)). Higher order influence functions are\nhigher order U-statistics. Our theory extends the first order semiparametric\ntheory of Bickel et al. (1993) and van der Vaart (1991) by incorporating the\ntheory of higher order scores considered by Pfanzagl (1990), Small and McLeish\n(1994) and Lindsay and Waterman (1996). The theory reproduces many previous\nresults, produces new non-$\\sqrt{n}$ results, and opens up the ability to\nperform optimal non-$\\sqrt{n}$ inference in complex high dimensional models. We\npresent novel rate-optimal point and interval estimators for various\nfunctionals of central importance to biostatistics in settings in which\nestimation at the expected $\\sqrt{n}$ rate is not possible, owing to the curse\nof dimensionality. We also show that our higher order influence functions have\na multi-robustness property that extends the double robustness property of\nfirst order influence functions described by Robins and Rotnitzky (2001) and\nvan der Laan and Robins (2003).\n", "versions": [{"version": "v1", "created": "Tue, 20 May 2008 10:24:15 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Robins", "James", ""], ["Li", "Lingling", ""], ["Tchetgen", "Eric", ""], ["van der Vaart", "Aad", ""]]}, {"id": "0805.3043", "submitter": "Persi Diaconis", "authors": "Persi Diaconis, Julia Salzman", "title": "Projection pursuit for discrete data", "comments": "Published in at http://dx.doi.org/10.1214/193940307000000482 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 2, 265-288", "doi": "10.1214/193940307000000482", "report-no": "IMS-COLL2-IMSCOLL215", "categories": "math.ST stat.AP stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops projection pursuit for discrete data using the discrete\nRadon transform. Discrete projection pursuit is presented as an exploratory\nmethod for finding informative low dimensional views of data such as binary\nvectors, rankings, phylogenetic trees or graphs. We show that for most data\nsets, most projections are close to uniform. Thus, informative summaries are\nones deviating from uniformity. Syllabic data from several of Plato's great\nworks is used to illustrate the methods. Along with some basic distribution\ntheory, an automated procedure for computing informative projections is\nintroduced.\n", "versions": [{"version": "v1", "created": "Tue, 20 May 2008 10:34:25 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Diaconis", "Persi", ""], ["Salzman", "Julia", ""]]}, {"id": "0805.3064", "submitter": "Dongchu Sun", "authors": "Dongchu Sun, James O. Berger", "title": "Objective Bayesian analysis under sequential experimentation", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000020 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 19-32", "doi": "10.1214/074921708000000020", "report-no": "IMS-COLL3-IMSCOLL302", "categories": "math.ST stat.CO stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objective priors for sequential experiments are considered. Common priors,\nsuch as the Jeffreys prior and the reference prior, will typically depend on\nthe stopping rule used for the sequential experiment. New expressions for\nreference priors are obtained in various contexts, and computational issues\ninvolving such priors are considered.\n", "versions": [{"version": "v1", "created": "Tue, 20 May 2008 12:36:52 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Sun", "Dongchu", ""], ["Berger", "James O.", ""]]}, {"id": "0805.3066", "submitter": "Subhashis Ghosal", "authors": "Bertrand Clarke, Subhashis Ghosal", "title": "J. K. Ghosh's contribution to statistics: A brief outline", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000011 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 1-18", "doi": "10.1214/074921708000000011", "report-no": "IMS-COLL3-IMSCOLL301", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Professor Jayanta Kumar Ghosh has contributed massively to various areas of\nStatistics over the last five decades. Here, we survey some of his most\nimportant contributions. In roughly chronological order, we discuss his major\nresults in the areas of sequential analysis, foundations, asymptotics, and\nBayesian inference. It is seen that he progressed from thinking about data\npoints, to thinking about data summarization, to the limiting cases of data\nsummarization in as they relate to parameter estimation, and then to more\ngeneral aspects of modeling including prior and model selection.\n", "versions": [{"version": "v1", "created": "Tue, 20 May 2008 12:40:44 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Clarke", "Bertrand", ""], ["Ghosal", "Subhashis", ""]]}, {"id": "0805.3070", "submitter": "W. J. Hall", "authors": "W. J. Hall, Keyue Ding", "title": "Sequential tests and estimates after overrunning based on $p$-value\n  combination", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000039 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 33-45", "doi": "10.1214/074921708000000039", "report-no": "IMS-COLL3-IMSCOLL303", "categories": "math.ST stat.AP stat.CO stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Often in sequential trials additional data become available after a stopping\nboundary has been reached. A method of incorporating such information from\noverrunning is developed, based on the ``adding weighted Zs'' method of\ncombining $p$-values. This yields a combined $p$-value for the primary test and\na median-unbiased estimate and confidence bounds for the parameter under test.\nWhen the amount of overrunning information is proportional to the amount\navailable upon terminating the sequential test, exact inference methods are\nprovided; otherwise, approximate methods are given and evaluated. The context\nis that of observing a Brownian motion with drift, with either linear stopping\nboundaries in continuous time or discrete-time group-sequential boundaries. The\nmethod is compared with other available methods and is exemplified with data\nfrom two sequential clinical trials.\n", "versions": [{"version": "v1", "created": "Tue, 20 May 2008 12:54:43 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Hall", "W. J.", ""], ["Ding", "Keyue", ""]]}, {"id": "0805.3073", "submitter": "Trevor J. Sweeting", "authors": "Trevor J. Sweeting", "title": "On predictive probability matching priors", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000048 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 46-59", "doi": "10.1214/074921708000000048", "report-no": "IMS-COLL3-IMSCOLL304", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We revisit the question of priors that achieve approximate matching of\nBayesian and frequentist predictive probabilities. Such priors may be thought\nof as providing frequentist calibration of Bayesian prediction or simply as\ndevices for producing frequentist prediction regions. Here we analyse the\n$O(n^{-1})$ term in the expansion of the coverage probability of a Bayesian\nprediction region, as derived in [Ann. Statist. 28 (2000) 1414--1426]. Unlike\nthe situation for parametric matching, asymptotic predictive matching priors\nmay depend on the level $\\alpha$. We investigate uniformly predictive matching\npriors (UPMPs); that is, priors for which this $O(n^{-1})$ term is zero for all\n$\\alpha$. It was shown in [Ann. Statist. 28 (2000) 1414--1426] that, in the\ncase of quantile matching and a scalar parameter, if such a prior exists then\nit must be Jeffreys' prior. In the present article we investigate UPMPs in the\nmultiparameter case and present some general results about the form, and\nuniqueness or otherwise, of UPMPs for both quantile and highest predictive\ndensity matching.\n", "versions": [{"version": "v1", "created": "Tue, 20 May 2008 13:12:22 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Sweeting", "Trevor J.", ""]]}, {"id": "0805.3082", "submitter": "Gusztav Morvai", "authors": "G. Morvai, S. Yakowitz and P. Algoet", "title": "Weakly Convergent Nonparametric Forecasting of Stationary Time Series", "comments": null, "journal-ref": "IEEE Transactions on Information Theory Vol. 43, pp. 483-498, 1997", "doi": "10.1109/18.556107", "report-no": null, "categories": "math.ST cs.IT math.IT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The conditional distribution of the next outcome given the infinite past of a\nstationary process can be inferred from finite but growing segments of the\npast. Several schemes are known for constructing pointwise consistent\nestimates, but they all demand prohibitive amounts of input data. In this paper\nwe consider real-valued time series and construct conditional distribution\nestimates that make much more efficient use of the input data. The estimates\nare consistent in a weak sense, and the question whether they are pointwise\nconsistent is still open. For finite-alphabet processes one may rely on a\nuniversal data compression scheme like the Lempel-Ziv algorithm to construct\nconditional probability mass function estimates that are consistent in expected\ninformation divergence. Consistency in this strong sense cannot be attained in\na universal sense for all stationary processes with values in an infinite\nalphabet, but weak consistency can. Some applications of the estimates to\non-line forecasting, regression and classification are discussed.\n", "versions": [{"version": "v1", "created": "Tue, 20 May 2008 13:54:09 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Morvai", "G.", ""], ["Yakowitz", "S.", ""], ["Algoet", "P.", ""]]}, {"id": "0805.3091", "submitter": "Gusztav Morvai", "authors": "L. Gy\\\"orfi, G. Lugosi and G. Morvai", "title": "A simple randomized algorithm for sequential prediction of ergodic time\n  series", "comments": null, "journal-ref": "IEEE Trans. Inform. Theory 45 (1999), no. 7, 2642--2650", "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a simple randomized procedure for the prediction of a binary\nsequence. The algorithm uses ideas from recent developments of the theory of\nthe prediction of individual sequences. We show that if the sequence is a\nrealization of a stationary and ergodic random process then the average number\nof mistakes converges, almost surely, to that of the optimum, given by the\nBayes predictor. The desirable finite-sample properties of the predictor are\nillustrated by its performance for Markov processes. In such cases the\npredictor exhibits near optimal behavior even without knowing the order of the\nMarkov process. Prediction with side information is also considered.\n", "versions": [{"version": "v1", "created": "Tue, 20 May 2008 14:38:37 GMT"}], "update_date": "2008-06-19", "authors_parsed": [["Györfi", "L.", ""], ["Lugosi", "G.", ""], ["Morvai", "G.", ""]]}, {"id": "0805.3203", "submitter": "Rahul Mukerjee", "authors": "Rahul Mukerjee", "title": "Data-dependent probability matching priors for empirical and related\n  likelihoods", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000057 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 60-70", "doi": "10.1214/074921708000000057", "report-no": "IMS-COLL3-IMSCOLL305", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a general class of empirical-type likelihoods and develop higher\norder asymptotics with a view to characterizing members thereof that allow the\nexistence of possibly data-dependent probability matching priors ensuring\napproximate frequentist validity of posterior quantiles. In particular, for the\nusual empirical likelihood, positive results are obtained. This is in contrast\nwith what happens if only data-free priors are entertained.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 06:12:13 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Mukerjee", "Rahul", ""]]}, {"id": "0805.3204", "submitter": "Malay Ghosh", "authors": "Malay Ghosh, Upasana Santra, Dalho Kim", "title": "Probability matching priors for some parameters of the bivariate normal\n  distribution", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000066 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 71-81", "doi": "10.1214/074921708000000066", "report-no": "IMS-COLL3-IMSCOLL306", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops some objective priors for certain parameters of the\nbivariate normal distribution. The parameters considered are the regression\ncoefficient, the generalized variance, and the ratio of the conditional\nvariance of one variable given the other to the marginal variance of the other\nvariable. The criterion used is the asymptotic matching of coverage\nprobabilities of Bayesian credible intervals with the corresponding frequentist\ncoverage probabilities. The paper uses various matching criteria, namely,\nquantile matching, matching of distribution functions, highest posterior\ndensity matching, and matching via inversion of test statistics. One particular\nprior is found which meets all the matching criteria individually for all the\nparameters of interest.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 06:34:24 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Ghosh", "Malay", ""], ["Santra", "Upasana", ""], ["Kim", "Dalho", ""]]}, {"id": "0805.3205", "submitter": "Glen Meeden", "authors": "Glen Meeden", "title": "Fuzzy set representation of a prior distribution", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000075 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 82-88", "doi": "10.1214/074921708000000075", "report-no": "IMS-COLL3-IMSCOLL307", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the subjective Bayesian approach uncertainty is described by a prior\ndistribution chosen by the statistician. Fuzzy set theory is another way of\nrepresenting uncertainty. Here we give a decision theoretic approach which\nallows a Bayesian to convert their prior distribution into a fuzzy set\nmembership function. This yields a formal relationship between these two\ndifferent methods of expressing uncertainty.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 07:05:33 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Meeden", "Glen", ""]]}, {"id": "0805.3209", "submitter": "Mohan Delampady", "authors": "Jean-Fran\\c{c}ois Angers, Mohan Delampady", "title": "Fuzzy sets in nonparametric Bayes regression", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000084 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 89-104", "doi": "10.1214/074921708000000084", "report-no": "IMS-COLL3-IMSCOLL308", "categories": "stat.ME math.LO math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A simple Bayesian approach to nonparametric regression is described using\nfuzzy sets and membership functions. Membership functions are interpreted as\nlikelihood functions for the unknown regression function, so that with the help\nof a reference prior they can be transformed to prior density functions. The\nunknown regression function is decomposed into wavelets and a hierarchical\nBayesian approach is employed for making inferences on the resulting wavelet\ncoefficients.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 07:30:08 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Angers", "Jean-François", ""], ["Delampady", "Mohan", ""]]}, {"id": "0805.3220", "submitter": "Gauri S. Datta", "authors": "M. J. Bayarri, James O. Berger, Gauri S. Datta", "title": "Objective Bayes testing of Poisson versus inflated Poisson models", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000093 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 105-121", "doi": "10.1214/074921708000000093", "report-no": "IMS-COLL3-IMSCOLL309", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Poisson distribution is often used as a standard model for count data.\nQuite often, however, such data sets are not well fit by a Poisson model\nbecause they have more zeros than are compatible with this model. For these\nsituations, a zero-inflated Poisson (ZIP) distribution is often proposed. This\narticle addresses testing a Poisson versus a ZIP model, using Bayesian\nmethodology based on suitable objective priors. Specific choices of objective\npriors are justified and their properties investigated. The methodology is\nextended to include covariates in regression models. Several applications are\ngiven.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 08:08:28 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Bayarri", "M. J.", ""], ["Berger", "James O.", ""], ["Datta", "Gauri S.", ""]]}, {"id": "0805.3224", "submitter": "Florentina Bunea", "authors": "Florentina Bunea", "title": "Consistent selection via the Lasso for high dimensional approximating\n  regression models", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000101 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 122-137", "doi": "10.1214/074921708000000101", "report-no": "IMS-COLL3-IMSCOLL310", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we investigate consistency of selection in regression models\nvia the popular Lasso method. Here we depart from the traditional linear\nregression assumption and consider approximations of the regression function\n$f$ with elements of a given dictionary of $M$ functions. The target for\nconsistency is the index set of those functions from this dictionary that\nrealize the most parsimonious approximation to $f$ among all linear\ncombinations belonging to an $L_2$ ball centered at $f$ and of radius\n$r_{n,M}^2$. In this framework we show that a consistent estimate of this index\nset can be derived via $\\ell_1$ penalized least squares, with a data dependent\npenalty and with tuning sequence $r_{n,M}>\\sqrt{\\log(Mn)/n}$, where $n$ is the\nsample size. Our results hold for any $1\\leq M\\leq n^{\\gamma}$, for any\n$\\gamma>0$.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 08:27:07 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Bunea", "Florentina", ""]]}, {"id": "0805.3238", "submitter": "Arijit Chakrabarti", "authors": "Arijit Chakrabarti, Tapas Samanta", "title": "Asymptotic optimality of a cross-validatory predictive approach to\n  linear model selection", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000110 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 138-154", "doi": "10.1214/074921708000000110", "report-no": "IMS-COLL3-IMSCOLL311", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we study the asymptotic predictive optimality of a model\nselection criterion based on the cross-validatory predictive density, already\navailable in the literature. For a dependent variable and associated\nexplanatory variables, we consider a class of linear models as approximations\nto the true regression function. One selects a model among these using the\ncriterion under study and predicts a future replicate of the dependent variable\nby an optimal predictor under the chosen model. We show that for squared error\nprediction loss, this scheme of prediction performs asymptotically as well as\nan oracle, where the oracle here refers to a model selection rule which\nminimizes this loss if the true regression were known.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 09:44:41 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Chakrabarti", "Arijit", ""], ["Samanta", "Tapas", ""]]}, {"id": "0805.3244", "submitter": "Nitai D. Mukhopadhyay", "authors": "Snigdhansu Chatterjee, Nitai D. Mukhopadhyay", "title": "Risk and resampling under model uncertainty", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000129 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 155-169", "doi": "10.1214/074921708000000129", "report-no": "IMS-COLL3-IMSCOLL312", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In statistical exercises where there are several candidate models, the\ntraditional approach is to select one model using some data driven criterion\nand use that model for estimation, testing and other purposes, ignoring the\nvariability of the model selection process. We discuss some problems associated\nwith this approach. An alternative scheme is to use a model-averaged estimator,\nthat is, a weighted average of estimators obtained under different models, as\nan estimator of a parameter. We show that the risk associated with a Bayesian\nmodel-averaged estimator is bounded as a function of the sample size, when\nparameter values are fixed. We establish conditions which ensure that a\nmodel-averaged estimator's distribution can be consistently approximated using\nthe bootstrap. A new, data-adaptive, model averaging scheme is proposed that\nbalances efficiency of estimation without compromising applicability of the\nbootstrap. This paper illustrates that certain desirable risk and resampling\nproperties of model-averaged estimators are obtainable when parameters are\nfixed but unknown; this complements several studies on minimaxity and other\nproperties of post-model-selected and model-averaged estimators, where\nparameters are allowed to vary.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 10:12:05 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Chatterjee", "Snigdhansu", ""], ["Mukhopadhyay", "Nitai D.", ""]]}, {"id": "0805.3248", "submitter": "Taeryon Choi", "authors": "Taeryon Choi, R. V. Ramamoorthi", "title": "Remarks on consistency of posterior distributions", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000138 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 170-186", "doi": "10.1214/074921708000000138", "report-no": "IMS-COLL3-IMSCOLL313", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, the literature in the area of Bayesian asymptotics has been\nrapidly growing. It is increasingly important to understand the concept of\nposterior consistency and validate specific Bayesian methods, in terms of\nconsistency of posterior distributions. In this paper, we build up some\nconceptual issues in consistency of posterior distributions, and discuss\npanoramic views of them by comparing various approaches to posterior\nconsistency that have been investigated in the literature. In addition, we\nprovide interesting results on posterior consistency that deal with\nnon-exponential consistency, improper priors and non i.i.d. (independent but\nnot identically distributed) observations. We describe a few examples for\nillustrative purposes.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 10:23:55 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Choi", "Taeryon", ""], ["Ramamoorthi", "R. V.", ""]]}, {"id": "0805.3252", "submitter": "A. W. van der Vaart", "authors": "A. W. van der Vaart, J. H. van Zanten", "title": "Reproducing kernel Hilbert spaces of Gaussian priors", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000156 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 200-222", "doi": "10.1214/074921708000000156", "report-no": "IMS-COLL3-IMSCOLL315", "categories": "math.FA math.OA math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We review definitions and properties of reproducing kernel Hilbert spaces\nattached to Gaussian variables and processes, with a view to applications in\nnonparametric Bayesian statistics using Gaussian priors. The rate of\ncontraction of posterior distributions based on Gaussian priors can be\ndescribed through a concentration function that is expressed in the reproducing\nHilbert space. Absolute continuity of Gaussian measures and concentration\ninequalities play an important role in understanding and deriving this result.\nSeries expansions of Gaussian variables and transformations of their\nreproducing kernel Hilbert spaces under linear maps are useful tools to compute\nthe concentration function.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 10:57:33 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["van der Vaart", "A. W.", ""], ["van Zanten", "J. H.", ""]]}, {"id": "0805.3273", "submitter": "Pranab K. Sen", "authors": "Pranab K. Sen", "title": "Kendall's tau in high-dimensional genomic parsimony", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000183 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 251-266", "doi": "10.1214/074921708000000183", "report-no": "IMS-COLL3-IMSCOLL318", "categories": "math.ST stat.ME stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High-dimensional data models, often with low sample size, abound in many\ninterdisciplinary studies, genomics and large biological systems being most\nnoteworthy. The conventional assumption of multinormality or linearity of\nregression may not be plausible for such models which are likely to be\nstatistically complex due to a large number of parameters as well as various\nunderlying restraints. As such, parametric approaches may not be very\neffective. Anything beyond parametrics, albeit, having increased scope and\nrobustness perspectives, may generally be baffled by the low sample size and\nhence unable to give reasonable margins of errors. Kendall's tau statistic is\nexploited in this context with emphasis on dimensional rather than sample size\nasymptotics. The Chen--Stein theorem has been thoroughly appraised in this\nstudy. Applications of these findings in some microarray data models are\nillustrated.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 13:13:30 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Sen", "Pranab K.", ""]]}, {"id": "0805.3282", "submitter": "Rabi Bhattacharya", "authors": "Abhishek Bhattacharya, Rabi Bhattacharya", "title": "Nonparametric statistics on manifolds with applications to shape spaces", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000200 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 282-301", "doi": "10.1214/074921708000000200", "report-no": "IMS-COLL3-IMSCOLL320", "categories": "math.GT math.ST stat.AP stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents certain recent methodologies and some new results for\nthe statistical analysis of probability distributions on manifolds. An\nimportant example considered in some detail here is the 2-D shape space of\nk-ads, comprising all configurations of $k$ planar landmarks ($k>2$)-modulo\ntranslation, scaling and rotation.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 13:53:14 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Bhattacharya", "Abhishek", ""], ["Bhattacharya", "Rabi", ""]]}, {"id": "0805.3287", "submitter": "Thomas Bengtsson", "authors": "Peter Bickel, Bo Li, Thomas Bengtsson", "title": "Sharp failure rates for the bootstrap particle filter in high dimensions", "comments": "Published in at http://dx.doi.org/10.1214/074921708000000228 the IMS\n  Collections (http://www.imstat.org/publications/imscollections.htm) by the\n  Institute of Mathematical Statistics (http://www.imstat.org)", "journal-ref": "IMS Collections 2008, Vol. 3, 318-329", "doi": "10.1214/074921708000000228", "report-no": "IMS-COLL3-IMSCOLL322", "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that the maximum of the sample importance weights in a\nhigh-dimensional Gaussian particle filter converges to unity unless the\nensemble size grows exponentially in the system dimension. Our work is\nmotivated by and parallels the derivations of Bengtsson, Bickel and Li (2007);\nhowever, we weaken their assumptions on the eigenvalues of the covariance\nmatrix of the prior distribution and establish rigorously their strong\nconjecture on when weight collapse occurs. Specifically, we remove the\nassumption that the nonzero eigenvalues are bounded away from zero, which,\nalthough the dimension of the involved vectors grow to infinity, essentially\npermits the effective system dimension to be bounded. Moreover, with some\nrestrictions on the rate of growth of the maximum eigenvalue, we relax their\nassumption that the eigenvalues are bounded from above, allowing the system to\nbe dominated by a single mode.\n", "versions": [{"version": "v1", "created": "Wed, 21 May 2008 14:24:08 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Bickel", "Peter", ""], ["Li", "Bo", ""], ["Bengtsson", "Thomas", ""]]}, {"id": "0805.3415", "submitter": "Aurelien Garivier", "authors": "Aur\\'elien Garivier (LTCI), Eric Moulines (LTCI)", "title": "On Upper-Confidence Bound Policies for Non-Stationary Bandit Problems", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-armed bandit problems are considered as a paradigm of the trade-off\nbetween exploring the environment to find profitable actions and exploiting\nwhat is already known. In the stationary case, the distributions of the rewards\ndo not change in time, Upper-Confidence Bound (UCB) policies have been shown to\nbe rate optimal. A challenging variant of the MABP is the non-stationary bandit\nproblem where the gambler must decide which arm to play while facing the\npossibility of a changing environment. In this paper, we consider the situation\nwhere the distributions of rewards remain constant over epochs and change at\nunknown time instants. We analyze two algorithms: the discounted UCB and the\nsliding-window UCB. We establish for these two algorithms an upper-bound for\nthe expected regret by upper-bounding the expectation of the number of times a\nsuboptimal arm is played. For that purpose, we derive a Hoeffding type\ninequality for self normalized deviations with a random number of summands. We\nestablish a lower-bound for the regret in presence of abrupt changes in the\narms reward distributions. We show that the discounted UCB and the\nsliding-window UCB both match the lower-bound up to a logarithmic factor.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2008 09:18:44 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Garivier", "Aurélien", "", "LTCI"], ["Moulines", "Eric", "", "LTCI"]]}, {"id": "0805.3476", "submitter": "Marianna Bolla CSc", "authors": "Marianna Bolla, Katalin Friedl, Andras Kramli", "title": "Singular value decomposition of large random matrices (for two-way\n  classification of microarrays)", "comments": "to be submitted to a special ussue of JMVA", "journal-ref": "JMVA 101 (2010) 434-446", "doi": "10.1016/j.jmva.2009.09.006", "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Asymptotic behavior of the singular value decomposition (SVD) of blown up\nmatrices and normalized blown up contingency tables exposed to Wigner-noise is\ninvestigated.It is proved that such an m\\times n matrix almost surely has a\nconstant number of large singular values (of order \\sqrt{mn}), while the rest\nof the singular values are of order \\sqrt{m+n} as m,n\\to\\infty. Concentration\nresults of Alon et al. for the eigenvalues of large symmetric random matrices\nare adapted to the rectangular case, and on this basis, almost sure results for\nthe singular values as well as for the corresponding isotropic subspaces are\nproved. An algorithm, applicable to two-way classification of microarrays, is\nalso given that finds the underlying block structure.\n", "versions": [{"version": "v1", "created": "Thu, 22 May 2008 14:53:30 GMT"}], "update_date": "2010-01-11", "authors_parsed": [["Bolla", "Marianna", ""], ["Friedl", "Katalin", ""], ["Kramli", "Andras", ""]]}, {"id": "0805.3584", "submitter": "Yang Xing", "authors": "Yang Xing", "title": "On adaptive Bayesian inference", "comments": "Published in at http://dx.doi.org/10.1214/08-EJS244 the Electronic\n  Journal of Statistics (http://www.i-journals.org/ejs/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Electronic Journal of Statistics 2008, Vol. 2, 848-862", "doi": "10.1214/08-EJS244", "report-no": "IMS-EJS-EJS_2008_244", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the rate of Bayesian consistency for hierarchical priors consisting\nof prior weights on a model index set and a prior on a density model for each\nchoice of model index. Ghosal, Lember and Van der Vaart [2] have obtained\ngeneral in-probability theorems on the rate of convergence of the resulting\nposterior distributions. We extend their results to almost sure assertions. As\nan application we study log spline densities with a finite number of models and\nobtain that the Bayes procedure achieves the optimal minimax rate\n$n^{-\\gamma/(2\\gamma+1)}$ of convergence if the true density of the\nobservations belongs to the H\\\"{o}lder space $C^{\\gamma}[0,1]$. This\nstrengthens a result in [1; 2]. We also study consistency of posterior\ndistributions of the model index and give conditions ensuring that the\nposterior distributions concentrate their masses near the index of the best\nmodel.\n", "versions": [{"version": "v1", "created": "Fri, 23 May 2008 06:29:33 GMT"}, {"version": "v2", "created": "Tue, 23 Sep 2008 09:59:48 GMT"}], "update_date": "2008-09-23", "authors_parsed": [["Xing", "Yang", ""]]}, {"id": "0805.3658", "submitter": "Anne Gegout-Petit", "authors": "Daniel Commenges (ISPED), Anne G\\'egout-Petit (IMB)", "title": "Likelihood for generally coarsened observations from multi-state or\n  counting process models", "comments": null, "journal-ref": "Scandinavian Journal of Statistics 34, 2 (2007) 432-450", "doi": "10.1111/j.1467-9469.2006.00518.x", "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider first the mixed discrete-continuous scheme of observation in\nmultistate models; this is a classical pattern in epidemiology because very\noften clinical status is assessed at discrete visit times while times of death\nor other events are observed exactly. A heuristic likelihood can be written for\nsuch models, at least for Markov models; however, a formal proof is not easy\nand has not been given yet. We present a general class of possibly non-Markov\nmultistate models which can be represented naturally as multivariate counting\nprocesses. We give a rigorous derivation of the likelihood based on applying\nJacod's formula for the full likelihood and taking conditional expectation for\nthe observed likelihood. A local description of the likelihood allows us to\nextend the result to a more general coarsening observation scheme proposed by\nCommenges & G\\'egout-Petit. The approach is illustrated by considering models\nfor dementia, institutionalization and death.\n", "versions": [{"version": "v1", "created": "Fri, 23 May 2008 15:30:55 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Commenges", "Daniel", "", "ISPED"], ["Gégout-Petit", "Anne", "", "IMB"]]}, {"id": "0805.3798", "submitter": "Clifford Lam", "authors": "Clifford Lam", "title": "Estimation of Large Precision Matrices Through Block Penalization", "comments": "42 pages article", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper focuses on exploring the sparsity of the inverse covariance matrix\n$\\bSigma^{-1}$, or the precision matrix. We form blocks of parameters based on\neach off-diagonal band of the Cholesky factor from its modified Cholesky\ndecomposition, and penalize each block of parameters using the $L_2$-norm\ninstead of individual elements. We develop a one-step estimator, and prove an\noracle property which consists of a notion of block sign-consistency and\nasymptotic normality. In particular, provided the initial estimator of the\nCholesky factor is good enough and the true Cholesky has finite number of\nnon-zero off-diagonal bands, oracle property holds for the one-step estimator\neven if $p_n \\gg n$, and can even be as large as $\\log p_n = o(n)$, where the\ndata $\\y$ has mean zero and tail probability $P(|y_j| > x) \\leq K\\exp(-Cx^d)$,\n$d > 0$, and $p_n$ is the number of variables. We also prove an operator norm\nconvergence result, showing the cost of dimensionality is just $\\log p_n$. The\nadvantage of this method over banding by Bickel and Levina (2008) or nested\nLASSO by Levina \\emph{et al.} (2007) is that it allows for elimination of\nweaker signals that precede stronger ones in the Cholesky factor. A method for\nobtaining an initial estimator for the Cholesky factor is discussed, and a\ngradient projection algorithm is developed for calculating the one-step\nestimate. Simulation results are in favor of the newly proposed method and a\nset of real data is analyzed using the new procedure and the banding method.\n", "versions": [{"version": "v1", "created": "Mon, 26 May 2008 18:56:13 GMT"}], "update_date": "2008-05-27", "authors_parsed": [["Lam", "Clifford", ""]]}, {"id": "0805.3906", "submitter": "Xianming Tan Dr", "authors": "Jiahua Chen (University of British Columbia), Xianming Tan (Nankai\n  University)", "title": "Inference for Multivariate Normal Mixtures", "comments": "30 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multivariate normal mixtures provide a flexible model for high-dimensional\ndata. They are widely used in statistical genetics, statistical finance, and\nother disciplines. Due to the unboundedness of the likelihood function,\nclassical likelihood-based methods, which may have nice practical properties,\nare inconsistent. In this paper, we recommend a penalized likelihood method for\nestimating the mixing distribution. We show that the maximum penalized\nlikelihood estimator is strongly consistent when the number of components has a\nknown upper bound. We also explore a convenient EM-algorithm for computing the\nmaximum penalized likelihood estimator. Extensive simulations are conducted to\nexplore the effectiveness and the practical limitations of both the new method\nand the ratified maximum likelihood estimators. Guidelines are provided based\non the simulation results.\n", "versions": [{"version": "v1", "created": "Mon, 26 May 2008 19:29:43 GMT"}], "update_date": "2008-05-27", "authors_parsed": [["Chen", "Jiahua", "", "University of British Columbia"], ["Tan", "Xianming", "", "Nankai\n  University"]]}, {"id": "0805.3912", "submitter": "Giacomo Aletti", "authors": "Giacomo Aletti, Enea G. Bongiorno, Vincenzo Capasso", "title": "A set-valued framework for birth-and-growth process", "comments": null, "journal-ref": null, "doi": "10.1051/ps/2010009", "report-no": null, "categories": "math.PR math.ST stat.AP stat.TH", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We propose a set-valued framework for the well-posedness of birth-and-growth\nprocess. Our birth-and-growth model is rigorously defined as a suitable\ncombination, involving Minkowski sum and Aumann integral, of two very general\nset-valued processes representing nucleation and growth respectively. The\nsimplicity of the used geometrical approach leads us to avoid problems arising\nby an analytical definition of the front growth such as boundary regularities.\nIn this framework, growth is generally anisotropic and, according to a\nmesoscale point of view, it is not local, i.e. for a fixed time instant, growth\nis the same at each space point.\n", "versions": [{"version": "v1", "created": "Mon, 26 May 2008 10:20:42 GMT"}], "update_date": "2011-09-29", "authors_parsed": [["Aletti", "Giacomo", ""], ["Bongiorno", "Enea G.", ""], ["Capasso", "Vincenzo", ""]]}, {"id": "0805.3949", "submitter": "C. Winter", "authors": "C. L. Winter and D. Nychka", "title": "A Few Results about the Geometry of Model Averages", "comments": "7 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a collection of computational models that all estimate values of the\nsame natural process, we compare the performance of the average of the\ncollection to the individual member whose estimates are nearest a given set of\nobservations. Performance is the ability of a model, or average, to reproduce a\nsequence of observations of the process. We identify a condition that\ndetermines if a single model performs better than the average. That result also\nyields a necessary condition for when the average performs better than any\nindividual model. We also give sharp bounds for the performance of the average\non a given interval. Since the observation interval is fixed, performance is\nevaluated in a vector space, and we can add intuition to our results by\nexplaining them geometrically. We conclude with some comments on directions\nstatistical tests of performance might take.\n", "versions": [{"version": "v1", "created": "Fri, 23 May 2008 20:39:43 GMT"}, {"version": "v2", "created": "Thu, 10 Jul 2008 17:25:40 GMT"}], "update_date": "2008-07-10", "authors_parsed": [["Winter", "C. L.", ""], ["Nychka", "D.", ""]]}, {"id": "0805.4141", "submitter": "Christopher Genovese", "authors": "Christopher R. Genovese, Marco Perone-Pacifico, Isabella Verdinelli,\n  Larry Wasserman", "title": "On the path density of a gradient field", "comments": "Published in at http://dx.doi.org/10.1214/08-AOS671 the Annals of\n  Statistics (http://www.imstat.org/aos/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Annals of Statistics 2009, Vol. 37, No. 6A, 3236-3271", "doi": "10.1214/08-AOS671", "report-no": "IMS-AOS-AOS671", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of reliably finding filaments in point clouds.\nRealistic data sets often have numerous filaments of various sizes and shapes.\nStatistical techniques exist for finding one (or a few) filaments but these\nmethods do not handle noisy data sets with many filaments. Other methods can be\nfound in the astronomy literature but they do not have rigorous statistical\nguarantees. We propose the following method. Starting at each data point we\nconstruct the steepest ascent path along a kernel density estimator. We locate\nfilaments by finding regions where these paths are highly concentrated.\nFormally, we define the density of these paths and we construct a consistent\nestimator of this path density.\n", "versions": [{"version": "v1", "created": "Tue, 27 May 2008 14:56:09 GMT"}, {"version": "v2", "created": "Fri, 11 Sep 2009 06:44:02 GMT"}], "update_date": "2009-09-11", "authors_parsed": [["Genovese", "Christopher R.", ""], ["Perone-Pacifico", "Marco", ""], ["Verdinelli", "Isabella", ""], ["Wasserman", "Larry", ""]]}, {"id": "0805.4154", "submitter": "Domenico Marinucci", "authors": "Xiaohong Lan and Domenico Marinucci", "title": "On The Dependence Structure of Wavelet Coefficients for Spherical Random\n  Fields", "comments": "Revised version for Stochastic Processes and their Applications", "journal-ref": "Stochastic Processes and their Applications, Vol. 119 (2009), pp.\n  3749-3766", "doi": null, "report-no": null, "categories": "math.ST astro-ph math.PR stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the correlation structure of the random coefficients for a wide\nclass of wavelet systems on the sphere (Mexican needlets) which were recently\nintroduced in the literature by Geller and Mayeli (2007). We provide necessary\nand sufficient conditions for these coefficients to be asymptotic uncorrelated\nin the real and in the frequency domain. Here, the asymptotic theory is\ndeveloped in the high resolution sense. Statistical applications are also\ndiscussed, in particular with reference to the analysis of cosmological data.\n", "versions": [{"version": "v1", "created": "Tue, 27 May 2008 15:30:53 GMT"}, {"version": "v2", "created": "Fri, 24 Apr 2009 12:34:43 GMT"}], "update_date": "2010-04-30", "authors_parsed": [["Lan", "Xiaohong", ""], ["Marinucci", "Domenico", ""]]}, {"id": "0805.4226", "submitter": "Steven Miller", "authors": "Dennis Jang, Jung Uk Kang, Alex Kruckman, Jun Kudo and Steven J.\n  Miller", "title": "Chains of distributions, hierarchical Bayesian models and Benford's Law", "comments": "15 pages, second draft: added some additional remarks on connections\n  to Hierarchical Bayes and MCMC, fixed some typos, added additional\n  explanations", "journal-ref": "Journal of Algebra, Number Theory: Advances and Applications,\n  volume 1, number 1 (March 2009), 37--60", "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Kossovsky recently conjectured that the distribution of leading digits of a\nchain of probability distributions converges to Benford's law as the length of\nthe chain grows. We prove his conjecture in many cases, and provide an\ninterpretation in terms of products of independent random variables and a\ncentral limit theorem. An interesting consequence is that in hierarchical\nBayesian models priors tend to satisfy Benford's Law as the number of levels of\nthe hierarchy increases, which allows us to develop some simple tests (based on\nBenford's law) to test proposed models. We give explicit formulas for the error\nterms as sums of Mellin transforms, which converges extremely rapidly as the\nnumber of terms in the chain grows. We may interpret our results as showing\nthat certain Markov chain Monte Carlo processes are rapidly mixing to Benford's\nlaw.\n", "versions": [{"version": "v1", "created": "Tue, 27 May 2008 21:30:48 GMT"}, {"version": "v2", "created": "Sun, 15 Jun 2008 16:38:17 GMT"}], "update_date": "2010-09-15", "authors_parsed": [["Jang", "Dennis", ""], ["Kang", "Jung Uk", ""], ["Kruckman", "Alex", ""], ["Kudo", "Jun", ""], ["Miller", "Steven J.", ""]]}, {"id": "0805.4338", "submitter": "Kush Varshney", "authors": "Kush R. Varshney and Lav R. Varshney", "title": "Quantization of Prior Probabilities for Hypothesis Testing", "comments": null, "journal-ref": "IEEE Transactions on Signal Processing, vol. 56, no. 10, October\n  2008, p. 4553-4562", "doi": "10.1109/TSP.2008.928164", "report-no": null, "categories": "cs.IT math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bayesian hypothesis testing is investigated when the prior probabilities of\nthe hypotheses, taken as a random vector, are quantized. Nearest neighbor and\ncentroid conditions are derived using mean Bayes risk error as a distortion\nmeasure for quantization. A high-resolution approximation to the\ndistortion-rate function is also obtained. Human decision making in segregated\npopulations is studied assuming Bayesian hypothesis testing with quantized\npriors.\n", "versions": [{"version": "v1", "created": "Wed, 28 May 2008 12:51:49 GMT"}], "update_date": "2008-09-20", "authors_parsed": [["Varshney", "Kush R.", ""], ["Varshney", "Lav R.", ""]]}, {"id": "0805.4373", "submitter": "Bikramjit Das", "authors": "Bikramjit Das, Sidney I. Resnick", "title": "Conditioning on an extreme component: Model consistency with regular\n  variation on cones", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ271 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 1, 226-252", "doi": "10.3150/10-BEJ271", "report-no": "IMS-BEJ-BEJ271", "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multivariate extreme value theory assumes a multivariate domain of attraction\ncondition for the distribution of a random vector. This necessitates that each\ncomponent satisfies a marginal domain of attraction condition. An approximation\nof the joint distribution of a random vector obtained by conditioning on one of\nthe components being extreme was developed by Heffernan and Tawn [12] and\nfurther studied by Heffernan and Resnick [11]. These papers left unresolved the\nconsistency of different models obtained by conditioning on different\ncomponents being extreme and we here provide clarification of this issue. We\nalso clarify the relationship between these conditional distributions,\nmultivariate extreme value theory and standard regular variation on cones of\nthe form $[0,\\infty]\\times(0,\\infty]$.\n", "versions": [{"version": "v1", "created": "Wed, 28 May 2008 16:28:54 GMT"}, {"version": "v2", "created": "Fri, 11 Jul 2008 15:20:44 GMT"}, {"version": "v3", "created": "Thu, 10 Feb 2011 12:15:08 GMT"}], "update_date": "2011-02-11", "authors_parsed": [["Das", "Bikramjit", ""], ["Resnick", "Sidney I.", ""]]}, {"id": "0805.4535", "submitter": "Gopal Basak", "authors": "Gopal K. Basak and Philip Lee", "title": "Asymptotic Properties of an Estimator of the Drift Coefficients of\n  Multidimensional Ornstein-Uhlenbeck Processes that are not Necessarily Stable", "comments": "47 pages; first presented a part of it at ISI99 (at Helsinki)\n  Corrected typos in the revised version (in the statement of Theorem 2.2 and\n  in section 6). Also, organised a bit more in the introduction and in the\n  concluding remarks", "journal-ref": "Electronic Journal of Statistics, Vol. 2 (2008) 1309 - 1344.", "doi": "10.1214/08-EJS290", "report-no": null, "categories": "math.ST math.PR stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate the consistency and asymptotic efficiency of an\nestimator of the drift matrix, $F$, of Ornstein-Uhlenbeck processes that are\nnot necessarily stable. We consider all the cases. (1) The eigenvalues of $F$\nare in the right half space (i.e., eigenvalues with positive real parts). In\nthis case the process grows exponentially fast. (2) The eigenvalues of $F$ are\non the left half space (i.e., the eigenvalues with negative or zero real\nparts). The process where all eigenvalues of $F$ have negative real parts is\ncalled a stable process and has a unique invariant (i.e., stationary)\ndistribution. In this case the process does not grow. When the eigenvalues of\n$F$ have zero real parts (i.e., the case of zero eigenvalues and purely\nimaginary eigenvalues) the process grows polynomially fast. Considering (1) and\n(2) separately, we first show that an estimator, $\\hat{F}$, of $F$ is\nconsistent. We then combine them to present results for the general\nOrnstein-Uhlenbeck processes. We adopt similar procedure to show the asymptotic\nefficiency of the estimator.\n", "versions": [{"version": "v1", "created": "Thu, 29 May 2008 13:09:21 GMT"}, {"version": "v2", "created": "Wed, 3 Sep 2008 09:49:00 GMT"}], "update_date": "2009-04-27", "authors_parsed": [["Basak", "Gopal K.", ""], ["Lee", "Philip", ""]]}]