[{"id": "1201.0058", "submitter": "Ting Yan", "authors": "Ting Yan, Yuanzhang Li, Jinfeng Xu, Yaning Yang and Ji Zhu", "title": "Wilks' theorems in some exponential random graph models", "comments": "Add new results on testing fixed dimensional null hypotheses. Changed\n  the title and rewritten the paper and cited some recent papers. Although a\n  first version was in arXiv nine years ago, we have kept on studying related\n  problems all the time", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are concerned here with the likelihood ratio statistics in two exponential\nrandom graph models -- the $\\beta$-model and the Bradley-Terry model, in which\nthe degree sequence on an undirected graph and the out-degree sequence on a\nweighted directed graph are the exclusively sufficient statistics in the\nexponential-family distributions on graphs, respectively. We prove the Wilks\ntype of theorems for some fixed and growing dimensional hypothesis testing\nproblems. More specifically, under two fixed dimensional null hypotheses $H_0:\n\\beta_i=\\beta_i^0$ for $i=1,\\ldots, r$ and $H_0: \\beta_1=\\ldots=\\beta_r$, we\nshow that $2[\\ell(\\widehat{\\boldsymbol{\\beta}}) -\n\\ell(\\widehat{\\boldsymbol{\\beta}}^0)]$ converges in distribution to a\nChi-square distribution with the respective degrees of freedoms, $r$ and $r-1$,\nas the dimension $n$ of the full parameter space goes to infinity. Here,\n$\\ell(\\boldsymbol{\\beta})$ is the log-likelihood function on the parameter\n$\\boldsymbol{\\beta}$, $\\widehat{\\boldsymbol{\\beta}}$ is the MLE under the full\nparameter space, and $\\widehat{\\boldsymbol{\\beta}}^0$ is the restricted MLE\nunder the null parameter space. For two increasing dimensional null hypotheses\n$H_0: \\beta_i = \\beta_i^0$ for $i=1, \\ldots, n$ and $H_0:\n\\beta_1=\\ldots=\\beta_r$ with $r/n \\ge c$, we show that the normalized\nlog-likelihood ratio statistics, $(2[\\ell(\\widehat{\\boldsymbol{\\beta}}) -\n\\ell(\\boldsymbol{\\beta}^0)] -n)/(2n)^{1/2}$ and\n$(2[\\ell(\\widehat{\\boldsymbol{\\beta}}) - \\ell(\\widehat{\\boldsymbol{\\beta}}^0)]\n-r)/(2r)^{1/2}$, both converge in distribution to the standard normal\ndistribution. Simulation studies and an application to NBA data illustrate the\ntheoretical results.\n", "versions": [{"version": "v1", "created": "Fri, 30 Dec 2011 03:57:35 GMT"}, {"version": "v2", "created": "Wed, 28 Mar 2012 07:15:42 GMT"}, {"version": "v3", "created": "Tue, 6 Aug 2013 02:25:57 GMT"}, {"version": "v4", "created": "Tue, 10 Feb 2015 12:13:48 GMT"}, {"version": "v5", "created": "Thu, 29 Apr 2021 23:33:42 GMT"}], "update_date": "2021-05-03", "authors_parsed": [["Yan", "Ting", ""], ["Li", "Yuanzhang", ""], ["Xu", "Jinfeng", ""], ["Yang", "Yaning", ""], ["Zhu", "Ji", ""]]}, {"id": "1201.0155", "submitter": "Robert Stelzer", "authors": "Robert Stelzer", "title": "CARMA Processes driven by Non-Gaussian Noise", "comments": "Preprint version of article available at\n  http://www.tum-ias.de/institute-for-advanced-study/publications/journal-primary-sources.html", "journal-ref": "Robert Stelzer (2011), CARMA Processes driven by Non-Gaussian\n  Noise,TUM-IAS Pimary Sources - Essays in Technology and Science, 1 no.1", "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an outline of the theory of certain L\\'evy-driven, multivariate\nstochastic processes, where the processes are represented by rational transfer\nfunctions (Continuous-time AutoRegressive Moving Average or CARMA models) and\ntheir applications in non-Gaussian time series modelling. We discuss in detail\ntheir definition, their spectral representation, the equivalence to linear\nstate space models and further properties like the second order structure and\nthe tail behaviour under a heavy-tailed input. Furthermore, we study the\nestimation of the parameters using quasi-maximum likelihood estimates for the\nauto-regressive and moving average parameters, as well as how to estimate the\ndriving L\\'evy process.\n", "versions": [{"version": "v1", "created": "Fri, 30 Dec 2011 17:11:59 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Stelzer", "Robert", ""]]}, {"id": "1201.0175", "submitter": "Yuan Liao", "authors": "Jianqing Fan, Yuan Liao, Martina Mincheva", "title": "Large Covariance Estimation by Thresholding Principal Orthogonal\n  Complements", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper deals with the estimation of a high-dimensional covariance with a\nconditional sparsity structure and fast-diverging eigenvalues. By assuming\nsparse error covariance matrix in an approximate factor model, we allow for the\npresence of some cross-sectional correlation even after taking out common but\nunobservable factors. We introduce the Principal Orthogonal complEment\nThresholding (POET) method to explore such an approximate factor structure with\nsparsity. The POET estimator includes the sample covariance matrix, the\nfactor-based covariance matrix (Fan, Fan, and Lv, 2008), the thresholding\nestimator (Bickel and Levina, 2008) and the adaptive thresholding estimator\n(Cai and Liu, 2011) as specific examples. We provide mathematical insights when\nthe factor analysis is approximately the same as the principal component\nanalysis for high-dimensional data. The rates of convergence of the sparse\nresidual covariance matrix and the conditional sparse covariance matrix are\nstudied under various norms. It is shown that the impact of estimating the\nunknown factors vanishes as the dimensionality increases. The uniform rates of\nconvergence for the unobserved factors and their factor loadings are derived.\nThe asymptotic results are also verified by extensive simulation studies.\nFinally, a real data application on portfolio allocation is presented.\n", "versions": [{"version": "v1", "created": "Fri, 30 Dec 2011 20:06:31 GMT"}, {"version": "v2", "created": "Mon, 14 Jan 2013 02:40:38 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Fan", "Jianqing", ""], ["Liao", "Yuan", ""], ["Mincheva", "Martina", ""]]}, {"id": "1201.0238", "submitter": "Yizao Wang", "authors": "Yizao Wang and Michael Woodroofe", "title": "On the asymptotic normality of kernel density estimators for linear\n  random fields", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish sufficient conditions for the asymptotic normality of kernel\ndensity estimators, applied to causal linear random fields. Our conditions on\nthe coefficients of linear random fields are weaker than known results,\nalthough our assumption on the bandwidth is not minimal. The proof is based on\nthe $m$-approximation method. As a key step, we prove a central limit theorem\nfor triangular arrays of stationary $m$-dependent random fields with unbounded\n$m$. We also apply a moment inequality recently established for stationary\nrandom fields.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 07:38:47 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Wang", "Yizao", ""], ["Woodroofe", "Michael", ""]]}, {"id": "1201.0277", "submitter": "Francesco Bartolucci", "authors": "Francesco Bartolucci", "title": "An alternative to the Baum-Welch recursions for hidden Markov models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a recursion for hidden Markov model of any order h, which allows\nus to obtain the posterior distribution of the latent state at every occasion,\ngiven the previous h states and the observed data. With respect to the\nwell-known Baum-Welch recursions, the proposed recursion has the advantage of\nbeing more direct to use and, in particular, of not requiring dummy\nrenormalizations to avoid numerical problems. We also show how this recursion\nmay be expressed in matrix notation, so as to allow for an efficient\nimplementation, and how it may be used to obtain the manifest distribution of\nthe observed data and for parameter estimation within the\nExpectation-Maximization algorithm. The approach is illustrated by an\napplication to financial data which is focused on the study of the dynamics of\nthe volatility level of log-returns.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 15:57:34 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Bartolucci", "Francesco", ""]]}, {"id": "1201.0310", "submitter": "Bala Rajaratnam", "authors": "Emanuel Ben-David and Bala Rajaratnam", "title": "Positive definite completion problems for directed acyclic graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.RA math.CO math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A positive definite completion problem pertains to determining whether the\nunspecified positions of a partial (or incomplete) matrix can be completed in a\ndesired subclass of positive definite matrices. In this paper we study an\nimportant and new class of positive definite completion problems where the\ndesired subclasses are the spaces of covariance and inverse-covariance matrices\nof probabilistic models corresponding to directed acyclic graph models (also\nknown as Bayesian networks). We provide fast procedures that determine whether\na partial matrix can be completed in either of these spaces and thereafter\nproceed to construct the completed matrices. We prove an analog of the positive\ndefinite completion result for undirected graphs in the context of directed\nacyclic graphs, and thus proceed to characterize the class of DAGs which can\nalways be completed. We also proceed to give closed form expressions for the\ninverse and the determinant of a completed matrix as a function of only the\nelements of the corresponding partial matrix.\n", "versions": [{"version": "v1", "created": "Sat, 31 Dec 2011 21:57:54 GMT"}, {"version": "v2", "created": "Tue, 3 Apr 2012 07:56:19 GMT"}], "update_date": "2012-04-04", "authors_parsed": [["Ben-David", "Emanuel", ""], ["Rajaratnam", "Bala", ""]]}, {"id": "1201.0327", "submitter": "Hau-tieng Wu", "authors": "Ming-Yen Cheng and Hau-tieng Wu", "title": "Local Linear Regression on Manifolds and its Geometric Interpretation", "comments": "58 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.NA stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High-dimensional data analysis has been an active area, and the main focuses\nhave been variable selection and dimension reduction. In practice, it occurs\noften that the variables are located on an unknown, lower-dimensional nonlinear\nmanifold. Under this manifold assumption, one purpose of this paper is\nregression and gradient estimation on the manifold, and another is developing a\nnew tool for manifold learning. To the first aim, we suggest directly reducing\nthe dimensionality to the intrinsic dimension $d$ of the manifold, and\nperforming the popular local linear regression (LLR) on a tangent plane\nestimate. An immediate consequence is a dramatic reduction in the computation\ntime when the ambient space dimension $p\\gg d$. We provide rigorous theoretical\njustification of the convergence of the proposed regression and gradient\nestimators by carefully analyzing the curvature, boundary, and non-uniform\nsampling effects. A bandwidth selector that can handle heteroscedastic errors\nis proposed. To the second aim, we analyze carefully the behavior of our\nregression estimator both in the interior and near the boundary of the\nmanifold, and make explicit its relationship with manifold learning, in\nparticular estimating the Laplace-Beltrami operator of the manifold. In this\ncontext, we also make clear that it is important to use a smaller bandwidth in\nthe tangent plane estimation than in the LLR. Simulation studies and the Isomap\nface data example are used to illustrate the computational speed and estimation\naccuracy of our methods.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jan 2012 04:19:47 GMT"}, {"version": "v2", "created": "Mon, 30 Apr 2012 05:11:45 GMT"}, {"version": "v3", "created": "Mon, 30 Jul 2012 15:51:17 GMT"}], "update_date": "2012-07-31", "authors_parsed": [["Cheng", "Ming-Yen", ""], ["Wu", "Hau-tieng", ""]]}, {"id": "1201.0341", "submitter": "Zoltan Szabo", "authors": "Zoltan Szabo, Barnabas Poczos, Andras Lorincz", "title": "Collaborative Filtering via Group-Structured Dictionary Learning", "comments": "A compressed version of the paper has been accepted for publication\n  at the 10th International Conference on Latent Variable Analysis and Source\n  Separation (LVA/ICA 2012)", "journal-ref": "International Conference on Latent Variable Analysis and Source\n  Separation (LVA/ICA), vol. 7191 of LNCS, pp. 247-254, 2012", "doi": "10.1007/978-3-642-28551-6_31", "report-no": null, "categories": "math.OC cs.LG math.ST stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Structured sparse coding and the related structured dictionary learning\nproblems are novel research areas in machine learning. In this paper we present\na new application of structured dictionary learning for collaborative filtering\nbased recommender systems. Our extensive numerical experiments demonstrate that\nthe presented technique outperforms its state-of-the-art competitors and has\nseveral advantages over approaches that do not put structured constraints on\nthe dictionary elements.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jan 2012 09:05:33 GMT"}], "update_date": "2012-03-08", "authors_parsed": [["Szabo", "Zoltan", ""], ["Poczos", "Barnabas", ""], ["Lorincz", "Andras", ""]]}, {"id": "1201.0400", "submitter": "Alexandre Patriota", "authors": "Alexandre G. Patriota", "title": "A classical measure of evidence for general null hypotheses", "comments": "26 pages, one figure and one table. Corrected version", "journal-ref": "Fuzzy sets and Systems, 233, 74-88, 2013", "doi": "10.1016/j.fss.2013.03.007", "report-no": null, "categories": "math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In science, the most widespread statistical quantities are perhaps\n$p$-values. A typical advice is to reject the null hypothesis $H_0$ if the\ncorresponding p-value is sufficiently small (usually smaller than 0.05). Many\ncriticisms regarding p-values have arisen in the scientific literature. The\nmain issue is that in general optimal p-values (based on likelihood ratio\nstatistics) are not measures of evidence over the parameter space $\\Theta$.\nHere, we propose an \\emph{objective} measure of evidence for very general null\nhypotheses that satisfies logical requirements (i.e., operations on the subsets\nof $\\Theta$) that are not met by p-values (e.g., it is a possibility measure).\nWe study the proposed measure in the light of the abstract belief calculus\nformalism and we conclude that it can be used to establish objective states of\nbelief on the subsets of $\\Theta$. Based on its properties, we strongly\nrecommend this measure as an additional summary of significance tests. At the\nend of the paper we give a short listing of possible open problems.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jan 2012 23:31:13 GMT"}, {"version": "v2", "created": "Wed, 11 Jul 2012 22:01:58 GMT"}, {"version": "v3", "created": "Tue, 12 Mar 2013 14:13:10 GMT"}, {"version": "v4", "created": "Tue, 9 Apr 2013 22:32:05 GMT"}, {"version": "v5", "created": "Fri, 15 Nov 2013 12:50:32 GMT"}], "update_date": "2013-11-18", "authors_parsed": [["Patriota", "Alexandre G.", ""]]}, {"id": "1201.0418", "submitter": "Shivakumar Jolad", "authors": "Shivakumar Jolad, Ahmed Roman, Mahesh C. Shastry, Mihir Gadgil, and\n  Ayanendranath Basu", "title": "A New Family of Bounded Divergence Measures and Application to Signal\n  Detection", "comments": "12 pages, 4 figures", "journal-ref": "Proceedings of the 5th International Conference on Pattern\n  Recognition Applications and Methods (ICPRAM 2016), pages 72-83, ISBN:\n  978-989-758-173-1", "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new one-parameter family of divergence measures, called\nbounded Bhattacharyya distance (BBD) measures, for quantifying the\ndissimilarity between probability distributions. These measures are bounded,\nsymmetric and positive semi-definite and do not require absolute continuity. In\nthe asymptotic limit, BBD measure approaches the squared Hellinger distance. A\ngeneralized BBD measure for multiple distributions is also introduced. We prove\nan extension of a theorem of Bradt and Karlin for BBD relating Bayes error\nprobability and divergence ranking. We show that BBD belongs to the class of\ngeneralized Csiszar f-divergence and derive some properties such as curvature\nand relation to Fisher Information. For distributions with vector valued\nparameters, the curvature matrix is related to the Fisher-Rao metric. We derive\ncertain inequalities between BBD and well known measures such as Hellinger and\nJensen-Shannon divergence. We also derive bounds on the Bayesian error\nprobability. We give an application of these measures to the problem of signal\ndetection where we compare two monochromatic signals buried in white noise and\ndiffering in frequency and amplitude.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jan 2012 04:00:20 GMT"}, {"version": "v2", "created": "Sat, 7 Jan 2012 19:52:32 GMT"}, {"version": "v3", "created": "Tue, 7 Feb 2012 05:57:01 GMT"}, {"version": "v4", "created": "Wed, 8 Feb 2012 12:47:03 GMT"}, {"version": "v5", "created": "Wed, 29 Aug 2012 18:45:10 GMT"}, {"version": "v6", "created": "Wed, 3 Jul 2013 05:58:58 GMT"}, {"version": "v7", "created": "Tue, 19 Aug 2014 05:33:21 GMT"}, {"version": "v8", "created": "Wed, 3 Sep 2014 05:46:29 GMT"}, {"version": "v9", "created": "Sun, 10 Apr 2016 03:28:34 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Jolad", "Shivakumar", ""], ["Roman", "Ahmed", ""], ["Shastry", "Mahesh C.", ""], ["Gadgil", "Mihir", ""], ["Basu", "Ayanendranath", ""]]}, {"id": "1201.0470", "submitter": "Mohamed EL MACHKOURI", "authors": "Ahmed El Ghini, Mohamed El Machkouri (LMRS)", "title": "Kernel deconvolution estimation for random fields", "comments": "28 pages. arXiv admin note: text overlap with arXiv:1109.2694", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we establish the asymptotic normality of the deconvolution\nkernel density estimator in the context of strongly mixing random fields. Only\nminimal conditions on the bandwidth parameter are required and a simple\ncriterion on the strong mixing coefficients is provided. Our approach is based\non the Lindeberg's method rather than on Bernstein's technique and coupling\narguments widely used in previous works on nonparametric estimation for spatial\nprocesses. We deal also with nonmixing random fields which can be written as a\n(nonlinear) functional of i.i.d. random fields by considering the physical\ndependence measure coefficients introduced by Wu (2005).\n", "versions": [{"version": "v1", "created": "Mon, 2 Jan 2012 14:11:15 GMT"}], "update_date": "2012-03-19", "authors_parsed": [["Ghini", "Ahmed El", "", "LMRS"], ["Machkouri", "Mohamed El", "", "LMRS"]]}, {"id": "1201.0472", "submitter": "Akimichi Takemura", "authors": "Hiroki Hashiguchi and Yasuhide Numata and Nobuki Takayama and Akimichi\n  Takemura", "title": "Holonomic gradient method for the distribution function of the largest\n  root of a Wishart matrix", "comments": null, "journal-ref": "Journal of Multivariate Analysis 117 (2031) 296-312", "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply the holonomic gradient method introduced by Nakayama et al.(2011) to\nthe evaluation of the exact distribution function of the largest root of a\nWishart matrix, which involves a hypergeometric function 1F1 of a matrix\nargument. Numerical evaluation of the hypergeometric function has been one of\nthe longstanding problems in multivariate distribution theory. The holonomic\ngradient method offers a totally new approach, which is complementary to the\ninfinite series expansion around the origin in terms of zonal polynomials. It\nallows us to move away from the origin by the use of partial differential\nequations satisfied by the hypergeometric function. From numerical viewpoint we\nshow that the method works well up to dimension 10. From theoretical viewpoint\nthe method offers many challenging problems both to statistics and D-module\ntheory.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jan 2012 14:28:37 GMT"}, {"version": "v2", "created": "Mon, 9 Jan 2012 11:49:06 GMT"}, {"version": "v3", "created": "Thu, 12 Jan 2012 13:10:57 GMT"}, {"version": "v4", "created": "Mon, 21 Jan 2013 00:11:58 GMT"}], "update_date": "2013-04-15", "authors_parsed": [["Hashiguchi", "Hiroki", ""], ["Numata", "Yasuhide", ""], ["Takayama", "Nobuki", ""], ["Takemura", "Akimichi", ""]]}, {"id": "1201.0480", "submitter": "Arnaud  Doucet", "authors": "Bernard Bercu, Pierre Del Moral and Arnaud Doucet", "title": "Fluctuations of Interacting Markov Chain Monte Carlo Methods", "comments": "Second revision of the INRIA-RR-6438 technical report (available\n  February 2008) at http://hal.inria.fr/docs/00/23/92/48/PDF/RR-6438.pdf To\n  appear in Stochastic Processes and Their Applications", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.CO stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a multivariate central limit theorem for a general class of\ninteracting Markov chain Monte Carlo algorithms used to solve nonlinear\nmeasure-valued equations. These algorithms generate stochastic processes which\nbelong to the class of nonlinear Markov chains interacting with their empirical\noccupation measures. We develop an original theoretical analysis based on\nresolvent operators and semigroup techniques to analyze the fluctuations of\ntheir occupation measures around their limiting values.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jan 2012 15:15:58 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Bercu", "Bernard", ""], ["Del Moral", "Pierre", ""], ["Doucet", "Arnaud", ""]]}, {"id": "1201.0514", "submitter": "Emanuel Ben-David", "authors": "Emanuel Ben-David", "title": "Maximal Invariants Over Symmetric Cones", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider some hypothesis tests within a family of Wishart\ndistributions, where both the sample space and the parameter space are\nsymmetric cones. For such testing problems, we first derive the joint density\nof the ordered eigenvalues of the generalized Wishart distribution and propose\na test statistic analog to that of classical multivariate statistics for\ntesting homoscedasticity of covariance matrix. In this generalization of\nBartlett's test for equality of variances to hypotheses of real, complex,\nquaternion, Lorentz and octonion types of covariance structures.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jan 2012 19:08:06 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Ben-David", "Emanuel", ""]]}, {"id": "1201.0571", "submitter": "Corey Manack", "authors": "Charles Hoffman and Corey Manack", "title": "Enumeration of k-Exceedance Lattice Paths with an Application to\n  Comparing Chains of Order Statistics", "comments": "10 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We enumerate the number of monotonic lattice paths starting at $(0,0)$ and\nterminating at $(m,n)$ in which $l$ of the first $k$ steps lie below the line\n$y=x\\ (0\\leq k\\leq m\\leq n)$. These closed formulas consist of terms which are\na product Catalan numbers, ballot numbers and binomial coefficients. We then\napply the combinatorial formulas to failure analysis by deriving a probability\ndistribution that compares the performance of a $k$-out-of-$m$ system to a\n$k$-out-of-$n$ system of continuous, independent, and identically distributed\nrandom variables. Lastly, we provide asymptotics in a few special cases of\n$k,m,n$ and leave others as conjecture.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 05:24:52 GMT"}, {"version": "v2", "created": "Thu, 16 Aug 2012 19:59:19 GMT"}, {"version": "v3", "created": "Thu, 20 Aug 2015 00:59:42 GMT"}], "update_date": "2015-08-21", "authors_parsed": [["Hoffman", "Charles", ""], ["Manack", "Corey", ""]]}, {"id": "1201.0586", "submitter": "Gerard Biau", "authors": "G\\'erard Biau (LPMA, LSTA, DMA, INRIA Paris - Rocquencourt), Luc\n  Devroye (SOCS), Vida Dujmovic (SCS), Adam Krzyzak (CSE)", "title": "An Affine Invariant $k$-Nearest Neighbor Regression Estimate", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We design a data-dependent metric in $\\mathbb R^d$ and use it to define the\n$k$-nearest neighbors of a given point. Our metric is invariant under all\naffine transformations. We show that, with this metric, the standard\n$k$-nearest neighbor regression estimate is asymptotically consistent under the\nusual conditions on $k$, and minimal requirements on the input data.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 07:34:57 GMT"}, {"version": "v2", "created": "Fri, 18 May 2012 06:55:46 GMT"}], "update_date": "2012-05-23", "authors_parsed": [["Biau", "Gérard", "", "LPMA, LSTA, DMA, INRIA Paris - Rocquencourt"], ["Devroye", "Luc", "", "SOCS"], ["Dujmovic", "Vida", "", "SCS"], ["Krzyzak", "Adam", "", "CSE"]]}, {"id": "1201.0590", "submitter": "Richard Nickl", "authors": "Richard Nickl and Markus Rei\\ss", "title": "A Donsker Theorem for L\\'evy Measures", "comments": "to appear in Journal of Functional Analysis", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.FA math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given $n$ equidistant realisations of a L\\'evy process $(L_t,\\,t\\ge 0)$, a\nnatural estimator $\\hat N_n$ for the distribution function $N$ of the L\\'evy\nmeasure is constructed. Under a polynomial decay restriction on the\ncharacteristic function $\\phi$, a Donsker-type theorem is proved, that is, a\nfunctional central limit theorem for the process $\\sqrt n (\\hat N_n -N)$ in the\nspace of bounded functions away from zero. The limit distribution is a\ngeneralised Brownian bridge process with bounded and continuous sample paths\nwhose covariance structure depends on the Fourier-integral operator ${\\cal\nF}^{-1}[1/\\phi(-\\cdot)]$. The class of L\\'evy processes covered includes\nseveral relevant examples such as compound Poisson, Gamma and self-decomposable\nprocesses. Main ideas in the proof include establishing pseudo-locality of the\nFourier-integral operator and recent techniques from smoothed empirical\nprocesses.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 08:43:31 GMT"}, {"version": "v2", "created": "Tue, 14 Aug 2012 06:16:04 GMT"}], "update_date": "2012-08-15", "authors_parsed": [["Nickl", "Richard", ""], ["Reiß", "Markus", ""]]}, {"id": "1201.0633", "submitter": "Joseph Rynkiewicz", "authors": "Joseph Rynkiewicz (SAMM)", "title": "General bound of overfitting for MLP regression models", "comments": null, "journal-ref": "Neurocomputing 90 (2012) 106-110", "doi": "10.1016/j.neucom.2011.11.028", "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multilayer perceptrons (MLP) with one hidden layer have been used for a long\ntime to deal with non-linear regression. However, in some task, MLP's are too\npowerful models and a small mean square error (MSE) may be more due to\noverfitting than to actual modelling. If the noise of the regression model is\nGaussian, the overfitting of the model is totally determined by the behavior of\nthe likelihood ratio test statistic (LRTS), however in numerous cases the\nassumption of normality of the noise is arbitrary if not false. In this paper,\nwe present an universal bound for the overfitting of such model under weak\nassumptions, this bound is valid without Gaussian or identifiability\nassumptions. The main application of this bound is to give a hint about\ndetermining the true architecture of the MLP model when the number of data goes\nto infinite. As an illustration, we use this theoretical result to propose and\ncompare effective criteria to find the true architecture of an MLP.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 13:57:56 GMT"}], "update_date": "2012-05-10", "authors_parsed": [["Rynkiewicz", "Joseph", "", "SAMM"]]}, {"id": "1201.0646", "submitter": "Luca Martino", "authors": "Luca Martino and Jesse Read", "title": "On the flexibility of the design of Multiple Try Metropolis schemes", "comments": null, "journal-ref": "Computational Statistics, Volume 28, Issue 6, Pages: 2797-2823,\n  2013", "doi": "10.1007/s00180-013-0429-2", "report-no": null, "categories": "stat.CO math.ST stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Multiple Try Metropolis (MTM) method is a generalization of the classical\nMetropolis-Hastings algorithm in which the next state of the chain is chosen\namong a set of samples, according to normalized weights. In the literature,\nseveral extensions have been proposed. In this work, we show and remark upon\nthe flexibility of the design of MTM-type methods, fulfilling the detailed\nbalance condition. We discuss several possibilities and show different\nnumerical results.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 14:38:14 GMT"}, {"version": "v2", "created": "Wed, 17 Oct 2012 10:57:38 GMT"}, {"version": "v3", "created": "Thu, 28 Feb 2013 14:28:35 GMT"}], "update_date": "2014-05-20", "authors_parsed": [["Martino", "Luca", ""], ["Read", "Jesse", ""]]}, {"id": "1201.0708", "submitter": "Luo Xiao Luo Xiao", "authors": "Luo Xiao, Yingxing Li, Tatiyana V. Apanasovich and David Ruppert", "title": "Local Asymptotics of P-splines", "comments": "34 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This report studies local asymptotics of P-splines with $p$th degree\nB-splines and a $m$th order difference penalty. Earlier work with $p$ and $m$\nrestricted is extended to the general case. Asymptotically, penalized splines\nare kernel estimators with equivalent kernels depending on $m$, but not on $p$.\nA central limit theorem provides simple expressions for the asymptotic mean and\nvariance. Provided it is fast enough, the divergence rate of the number of\nknots does not affect the asymptotic distribution. The optimal convergence rate\nof the penalty parameter is given.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2012 17:34:33 GMT"}, {"version": "v2", "created": "Wed, 4 Jan 2012 02:11:40 GMT"}, {"version": "v3", "created": "Sun, 10 Jun 2012 22:05:07 GMT"}], "update_date": "2012-06-12", "authors_parsed": [["Xiao", "Luo", ""], ["Li", "Yingxing", ""], ["Apanasovich", "Tatiyana V.", ""], ["Ruppert", "David", ""]]}, {"id": "1201.0868", "submitter": "Ole E. Barndorff-Nielsen", "authors": "Ole E. Barndorff-Nielsen, Jos\\'e Manuel Corcuera, Mark Podolskij", "title": "Multipower variation for Brownian semistationary processes", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ316 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1159-1194", "doi": "10.3150/10-BEJ316", "report-no": "IMS-BEJ-BEJ316", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the asymptotic behaviour of power and multipower\nvariations of processes $Y$:\\[Y_t=\\int_{-\\in\nfty}^tg(t-s)\\sigma_sW(\\mathrm{d}s)+Z_t,\\] where\n$g:(0,\\infty)\\rightarrow\\mathbb{R}$ is deterministic, $\\sigma >0$ is a random\nprocess, $W$ is the stochastic Wiener measure and $Z$ is a stochastic process\nin the nature of a drift term. Processes of this type serve, in particular, to\nmodel data of velocity increments of a fluid in a turbulence regime with spot\nintermittency $\\sigma$. The purpose of this paper is to determine the\nprobabilistic limit behaviour of the (multi)power variations of $Y$ as a basis\nfor studying properties of the intermittency process $\\sigma$. Notably the\nprocesses $Y$ are in general not of the semimartingale kind and the established\ntheory of multipower variation for semimartingales does not suffice for\nderiving the limit properties. As a key tool for the results, a general central\nlimit theorem for triangular Gaussian schemes is formulated and proved.\nExamples and an application to the realised variance ratio are given.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2012 10:33:25 GMT"}], "update_date": "2012-01-05", "authors_parsed": [["Barndorff-Nielsen", "Ole E.", ""], ["Corcuera", "José Manuel", ""], ["Podolskij", "Mark", ""]]}, {"id": "1201.0872", "submitter": "Yuqiang Li", "authors": "Yuqiang Li, Hongshuai Dai", "title": "Approximations of fractional Brownian motion", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ319 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1195-1216", "doi": "10.3150/10-BEJ319", "report-no": "IMS-BEJ-BEJ319", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Approximations of fractional Brownian motion using Poisson processes whose\nparameter sets have the same dimensions as the approximated processes have been\nstudied in the literature. In this paper, a special approximation to the\none-parameter fractional Brownian motion is constructed using a two-parameter\nPoisson process. The proof involves the tightness and identification of\nfinite-dimensional distributions.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jan 2012 11:21:18 GMT"}], "update_date": "2012-01-05", "authors_parsed": [["Li", "Yuqiang", ""], ["Dai", "Hongshuai", ""]]}, {"id": "1201.1071", "submitter": "Michael H. Neumann", "authors": "Michael H. Neumann", "title": "Absolute regularity and ergodicity of Poisson count processes", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ313 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1268-1284", "doi": "10.3150/10-BEJ313", "report-no": "IMS-BEJ-BEJ313", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a class of observation-driven Poisson count processes where the\ncurrent value of the accompanying intensity process depends on previous values\nof both processes. We show under a contractive condition that the bivariate\nprocess has a unique stationary distribution and that a stationary version of\nthe count process is absolutely regular. Moreover, since the intensities can be\nwritten as measurable functionals of the count variables, we conclude that the\nbivariate process is ergodic. As an important application of these results, we\nshow how a test method previously used in the case of independent Poisson data\ncan be used in the case of Poisson count processes.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 07:21:19 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Neumann", "Michael H.", ""]]}, {"id": "1201.1076", "submitter": "Nelson Antunes", "authors": "Nelson Antunes, Vladas Pipiras", "title": "Probabilistic sampling of finite renewal processes", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ321 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1285-1326", "doi": "10.3150/10-BEJ321", "report-no": "IMS-BEJ-BEJ321", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a finite renewal process in the sense that interrenewal times are\npositive i.i.d. variables and the total number of renewals is a random\nvariable, independent of interrenewal times. A finite point process can be\nobtained by probabilistic sampling of the finite renewal process, where each\nrenewal is sampled with a fixed probability and independently of other\nrenewals. The problem addressed in this work concerns statistical inference of\nthe original distributions of the total number of renewals and interrenewal\ntimes from a sample of i.i.d. finite point processes obtained by sampling\nfinite renewal processes. This problem is motivated by traffic measurements in\nthe Internet in order to characterize flows of packets (which can be seen as\nfinite renewal processes) and where the use of packet sampling is becoming\nprevalent due to increasing link speeds and limited storage and processing\ncapacities.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 08:07:07 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Antunes", "Nelson", ""], ["Pipiras", "Vladas", ""]]}, {"id": "1201.1089", "submitter": "Adam Os\\c{e}kowski", "authors": "Adam Os\\c{e}kowski", "title": "Sharp maximal inequalities for the moments of martingales and\n  non-negative submartingales", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ314 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1327-1343", "doi": "10.3150/10-BEJ314", "report-no": "IMS-BEJ-BEJ314", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the paper we study sharp maximal inequalities for martingales and\nnon-negative submartingales: if $f$, $g$ are martingales satisfying\n\\[|\\mathrm{d}g_n|\\leq|\\mathrm{d}f_n|,\\qquad n=0,1,2,...,\\] almost surely, then\n\\[\\Bigl\\|\\sup_{n\\geq0}|g_n|\\Bigr\\|_p\\leq p\\|f\\|_p,\\qquad p\\geq2,\\] and the\ninequality is sharp. Furthermore, if $\\alpha\\in[0,1]$, $f$ is a non-negative\nsubmartingale and $g$ satisfies \\[|\\mathrm{d}g_n|\\leq|\\mathrm{d}f_n|\\quad\nand\\quad |\\mathbb{E}(\\mathrm{d}g_{n+1}|\\mathcal\n{F}_n)|\\leq\\alpha\\mathbb{E}(\\mathrm{d}f_{n+1}|\\mathcal{F}_n),\\qquad\nn=0,1,2,...,\\] almost surely, then\n\\[\\Bigl\\|\\sup_{n\\geq0}|g_n|\\Bigr\\|_p\\leq(\\alpha+1)p\\|f\\|_p,\\qquad p\\geq2,\\] and\nthe inequality is sharp. As an application, we establish related estimates for\nstochastic integrals and It\\^{o} processes. The inequalities strengthen the\nearlier classical results of Burkholder and Choi.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 09:18:24 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Osȩkowski", "Adam", ""]]}, {"id": "1201.1124", "submitter": "Istv\\'{a}n Berkes", "authors": "Istv\\'an Berkes, Lajos Horv\\'ath, Johannes Schauer", "title": "Asymptotics of trimmed CUSUM statistics", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ318 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1344-1367", "doi": "10.3150/10-BEJ318", "report-no": "IMS-BEJ-BEJ318", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is a wide literature on change point tests, but the case of variables\nwith infinite variances is essentially unexplored. In this paper we address\nthis problem by studying the asymptotic behavior of trimmed CUSUM statistics.\nWe show that in a location model with i.i.d. errors in the domain of attraction\nof a stable law of parameter $0<\\alpha <2$, the appropriately trimmed CUSUM\nprocess converges weakly to a Brownian bridge. Thus, after moderate trimming,\nthe classical method for detecting change points remains valid also for\npopulations with infinite variance. We note that according to the classical\ntheory, the partial sums of trimmed variables are generally not asymptotically\nnormal and using random centering in the test statistics is crucial in the\ninfinite variance case. We also show that the partial sums of truncated and\ntrimmed random variables have different asymptotic behavior. Finally, we\ndiscuss resampling procedures which enable one to determine critical values in\nthe case of small and moderate sample sizes.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 11:12:18 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Berkes", "István", ""], ["Horváth", "Lajos", ""], ["Schauer", "Johannes", ""]]}, {"id": "1201.1140", "submitter": "Marten Wegkamp", "authors": "Marten Wegkamp, Ming Yuan", "title": "Support vector machines with a reject option", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ320 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1368-1385", "doi": "10.3150/10-BEJ320", "report-no": "IMS-BEJ-BEJ320", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies $\\ell_1$ regularization with high-dimensional features for\nsupport vector machines with a built-in reject option (meaning that the\ndecision of classifying an observation can be withheld at a cost lower than\nthat of misclassification). The procedure can be conveniently implemented as a\nlinear program and computed using standard software. We prove that the\nminimizer of the penalized population risk favors sparse solutions and show\nthat the behavior of the empirical risk minimizer mimics that of the population\nrisk minimizer. We also introduce a notion of classification complexity and\nprove that our minimizers adapt to the unknown complexity. Using a novel oracle\ninequality for the excess risk, we identify situations where fast rates of\nconvergence occur.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 12:02:21 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Wegkamp", "Marten", ""], ["Yuan", "Ming", ""]]}, {"id": "1201.1146", "submitter": "Yonggang Hu", "authors": "Yonggang Hu, Yong Wang, Yi Wu", "title": "Tensor-based projection depth", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ317 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1386-1399", "doi": "10.3150/10-BEJ317", "report-no": "IMS-BEJ-BEJ317", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The conventional definition of a depth function is vector-based. In this\npaper, a novel projection depth (PD) technique directly based on tensors, such\nas matrices, is instead proposed. Tensor projection depth (TPD) is still an\nideal depth function and its computation can be achieved through the iteration\nof PD. Furthermore, we also discuss the cases for sparse samples and higher\norder tensors. Experimental results in data classification with the two\nprojection depths show that TPD performs much better than PD for data with a\nnatural tensor form, and even when the data have a natural vector form, TPD\nappears to perform no worse than PD.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 12:25:08 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Hu", "Yonggang", ""], ["Wang", "Yong", ""], ["Wu", "Yi", ""]]}, {"id": "1201.1155", "submitter": "Jianhua Hu", "authors": "Jianhua Hu, Guohua Yan, Jinhong You", "title": "Estimation for an additive growth curve model with orthogonal design\n  matrices", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ315 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1400-1419", "doi": "10.3150/10-BEJ315", "report-no": "IMS-BEJ-BEJ315", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An additive growth curve model with orthogonal design matrices is proposed in\nwhich observations may have different profile forms. The proposed model allows\nus to fit data and then estimate parameters in a more parsimonious way than the\ntraditional growth curve model. Two-stage generalized least-squares estimators\nfor the regression coefficients are derived where a quadratic estimator for the\ncovariance of observations is taken as the first-stage estimator. Consistency,\nasymptotic normality and asymptotic independence of these estimators are\ninvestigated. Simulation studies and a numerical example are given to\nillustrate the efficiency and parsimony of the proposed model for model\nspecifications in the sense of minimizing Akaike's information criterion (AIC).\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 12:50:46 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Hu", "Jianhua", ""], ["Yan", "Guohua", ""], ["You", "Jinhong", ""]]}, {"id": "1201.1166", "submitter": "Abhishek Bhattacharya Dr.", "authors": "Abhishek Bhattacharya and Arup Bose", "title": "Resampling in Time Series Models", "comments": "Master's Project", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This project revolves around studying estimators for parameters in different\nTime Series models and studying their assymptotic properties. We introduce\nvarious bootstrap techniques for the estimators obtained. Our special emphasis\nis on Weighted Bootstrap. We establish the consistency of this scheme in a AR\nmodel and its variations. Numerical calculations lend further support to our\nconsistency results. Next we analyze ARCH models, and study various estimators\nused for different error distributions. We also present resampling techniques\nfor estimating the distribution of the estimators. Finally by simulating data,\nwe analyze the numerical properties of the estimators.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 13:26:40 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Bhattacharya", "Abhishek", ""], ["Bose", "Arup", ""]]}, {"id": "1201.1171", "submitter": "Subhajit Dutta", "authors": "Subhajit Dutta, Anil K. Ghosh, Probal Chaudhuri", "title": "Some intriguing properties of Tukey's half-space depth", "comments": "Published in at http://dx.doi.org/10.3150/10-BEJ322 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2011, Vol. 17, No. 4, 1420-1434", "doi": "10.3150/10-BEJ322", "report-no": "IMS-BEJ-BEJ322", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For multivariate data, Tukey's half-space depth is one of the most popular\ndepth functions available in the literature. It is conceptually simple and\nsatisfies several desirable properties of depth functions. The Tukey median,\nthe multivariate median associated with the half-space depth, is also a\nwell-known measure of center for multivariate data with several interesting\nproperties. In this article, we derive and investigate some interesting\nproperties of half-space depth and its associated multivariate median. These\nproperties, some of which are counterintuitive, have important statistical\nconsequences in multivariate analysis. We also investigate a natural extension\nof Tukey's half-space depth and the related median for probability\ndistributions on any Banach space (which may be finite- or\ninfinite-dimensional) and prove some results that demonstrate anomalous\nbehavior of half-space depth in infinite-dimensional spaces.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 13:51:47 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Dutta", "Subhajit", ""], ["Ghosh", "Anil K.", ""], ["Chaudhuri", "Probal", ""]]}, {"id": "1201.1278", "submitter": "Ferkan Yilmaz", "authors": "Ferkan Yilmaz and Mohamed-Slim Alouini", "title": "Novel Relations between the Ergodic Capacity and the Average Bit Error\n  Rate", "comments": "This work has been presented by Ferkan Yilmaz in IEEE International\n  Symposium on Wireless Communication Systems (ISWCS 2011), Aachen, Germany,\n  6th-9th November, 2011. (Including 6 pages, 2 figures)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ergodic capacity and average bit error rate have been widely used to compare\nthe performance of different wireless communication systems. As such recent\nscientific research and studies revealed strong impact of designing and\nimplementing wireless technologies based on these two performance indicators.\nHowever and to the best of our knowledge, the direct links between these two\nperformance indicators have not been explicitly proposed in the literature so\nfar. In this paper, we propose novel relations between the ergodic capacity and\nthe average bit error rate of an overall communication system using binary\nmodulation schemes for signaling with a limited bandwidth and operating over\ngeneralized fading channels. More specifically, we show that these two\nperformance measures can be represented in terms of each other, without the\nneed to know the exact end-to-end statistical characterization of the\ncommunication channel. We validate the correctness and accuracy of our newly\nproposed relations and illustrated their usefulness by considering some\nclassical examples.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2012 20:31:49 GMT"}], "update_date": "2012-01-06", "authors_parsed": [["Yilmaz", "Ferkan", ""], ["Alouini", "Mohamed-Slim", ""]]}, {"id": "1201.1461", "submitter": "Robert Stelzer", "authors": "Victor P\\'erez-Abreu and Robert Stelzer", "title": "A Class of Infinitely Divisible Multivariate and Matrix Gamma\n  Distributions and Cone-valued Generalised Gamma Convolutions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Classes of multivariate and cone valued infinitely divisible Gamma\ndistributions are introduced. Particular emphasis is put on the cone-valued\ncase, due to the relevance of infinitely divisible distributions on the\npositive semi-definite matrices in applications. The cone-valued class of\ngeneralised Gamma convolutions is studied. In particular, a characterisation in\nterms of an It\\^o-Wiener integral with respect to an infinitely divisible\nrandom measure associated to the jumps of a L\\'evy process is established.\n  A new example of an infinitely divisible positive definite Gamma random\nmatrix is introduced. It has properties which make it appealing for modelling\nunder an infinite divisibility framework. An interesting relation of the\nmoments of the L\\'evy measure and the Wishart distribution is highlighted which\nwe suppose to be important when considering the limiting distribution of the\neigenvalues .\n", "versions": [{"version": "v1", "created": "Fri, 6 Jan 2012 18:01:12 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Pérez-Abreu", "Victor", ""], ["Stelzer", "Robert", ""]]}, {"id": "1201.1493", "submitter": "Robin Blume-Kohout", "authors": "Christopher Ferrie and Robin Blume-Kohout", "title": "Estimating the bias of a noisy coin", "comments": "10 pages", "journal-ref": "AIP Conf. Proc. 1443, pp. 14-21 (2012)", "doi": "10.1063/1.3703615", "report-no": null, "categories": "math.ST quant-ph stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimal estimation of a coin's bias using noisy data is surprisingly\ndifferent from the same problem with noiseless data. We study this problem\nusing entropy risk to quantify estimators' accuracy. We generalize the \"add\nBeta\" estimators that work well for noiseless coins, and we find that these\nhedged maximum-likelihood (HML) estimators achieve a worst-case risk of\nO(N^{-1/2}) on noisy coins, in contrast to O(1/N) in the noiseless case. We\ndemonstrate that this increased risk is unavoidable and intrinsic to noisy\ncoins, by constructing minimax estimators (numerically). However, minimax\nestimators introduce extreme bias in return for slight improvements in the\nworst-case risk. So we introduce a pointwise lower bound on the minimum\nachievable risk as an alternative to the minimax criterion, and use this bound\nto show that HML estimators are pretty good. We conclude with a survey of\nscientific applications of the noisy coin model in social science, physical\nscience, and quantum information science.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jan 2012 20:47:37 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Ferrie", "Christopher", ""], ["Blume-Kohout", "Robin", ""]]}, {"id": "1201.1578", "submitter": "Brahimi Brahim", "authors": "Brahim Brahimi, Djamel Meraghni, Abdelhakim Necir, Djabrane Yahia", "title": "A Bias-reduced Estimator for the Mean of a Heavy-tailed Distribution\n  with an Infinite Second Moment", "comments": "Submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME math.ST stat.CO stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use bias-reduced estimators of high quantiles, of heavy-tailed\ndistributions, to introduce a new estimator of the mean in the case of infinite\nsecond moment. The asymptotic normality of the proposed estimator is\nestablished and checked, in a simulation study, by four of the most popular\ngoodness-of-fit tests for different sample sizes. Moreover, we compare, in\nterms of bias and mean squared error, our estimator with Peng's estimator\n(Peng, 2001) and we evaluate the accuracy of some resulting confidence\nintervals.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jan 2012 17:40:49 GMT"}, {"version": "v2", "created": "Tue, 10 Jan 2012 19:10:14 GMT"}], "update_date": "2014-05-09", "authors_parsed": [["Brahimi", "Brahim", ""], ["Meraghni", "Djamel", ""], ["Necir", "Abdelhakim", ""], ["Yahia", "Djabrane", ""]]}, {"id": "1201.1623", "submitter": "Sergio G\\'omez", "authors": "Sergio Gomez, Justo Montiel, David Torres, Alberto Fernandez", "title": "MultiDendrograms: Variable-Group Agglomerative Hierarchical Clusterings", "comments": "Article upgraded to MultiDendrograms 3.0. Software available at\n  http://deim.urv.cat/~sgomez/multidendrograms.php", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR math.ST physics.comp-ph physics.data-an q-fin.CP stat.CO stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MultiDendrograms is a Java-written application that computes agglomerative\nhierarchical clusterings of data. Starting from a distances (or weights)\nmatrix, MultiDendrograms is able to calculate its dendrograms using the most\ncommon agglomerative hierarchical clustering methods. The application\nimplements a variable-group algorithm that solves the non-uniqueness problem\nfound in the standard pair-group algorithm. This problem arises when two or\nmore minimum distances between different clusters are equal during the\nagglomerative process, because then different output clusterings are possible\ndepending on the criterion used to break ties between distances.\nMultiDendrograms solves this problem implementing a variable-group algorithm\nthat groups more than two clusters at the same time when ties occur.\n", "versions": [{"version": "v1", "created": "Sun, 8 Jan 2012 11:03:42 GMT"}, {"version": "v2", "created": "Tue, 4 Dec 2012 15:44:04 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Gomez", "Sergio", ""], ["Montiel", "Justo", ""], ["Torres", "David", ""], ["Fernandez", "Alberto", ""]]}, {"id": "1201.2014", "submitter": "Piero Barone", "authors": "Piero Barone", "title": "On the condensed density of the zeros of the Cauchy transform of a\n  complex atomic random measure with Gaussian moments", "comments": "3 figures", "journal-ref": "Statistics and Probability Letters, vol.83, pp.2569-2576, 2013", "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An atomic random complex measure defined on the unit disk with Normally\ndistributed moments is considered. An approximation to the distribution of the\nzeros of its Cauchy transform is computed. Implications of this result for\nsolving several moments problems are discussed.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2012 10:42:09 GMT"}], "update_date": "2014-04-17", "authors_parsed": [["Barone", "Piero", ""]]}, {"id": "1201.2343", "submitter": "S\\'andor Zolt\\'an N\\'emeth", "authors": "A. B. N\\'emeth and S. Z. N\\'emeth", "title": "How to project onto the monotone nonnegative cone using Pool Adjacent\n  Violators type algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.OC stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The metric projection onto an order nonnegative cone from the metric\nprojection onto the corresponding order cone is derived. Particularly, we can\nuse Pool Adjacent Violators-type algorithms developed for projecting onto the\nmonotone cone for projecting onto the monotone nonnegative cone too.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 16:28:50 GMT"}, {"version": "v2", "created": "Fri, 20 Jan 2012 14:21:05 GMT"}], "update_date": "2012-01-23", "authors_parsed": [["Németh", "A. B.", ""], ["Németh", "S. Z.", ""]]}, {"id": "1201.2377", "submitter": "Alberto  Ohashi", "authors": "Dorival Le\\~ao and Alberto Ohashi", "title": "On the Discrete Cram\\'er-von Mises Statistics under Random Censorship", "comments": "50 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, nonparametric log-rank-type statistical tests are introduced in\norder to verify homogeneity of purely discrete variables subject to arbitrary\nright-censoring for infinitely many categories. In particular, the Cram\\'er-von\nMises test statistics for discrete models under censoring is established. In\norder to introduce the test, we develop the weighted log-rank statistics in a\ngeneral multivariate discrete setup which complements previous fundamental\nresults of Gill (1980) and Andersen et al. (1982). Due to the presence of\npersistent jumps over the unbounded set of categories, the asymptotic\ndistribution of the test is not distribution-free. The statistical test for a\nlarge class of weighted processes is described as a weighted series of\nindependent chi-squared variables whose weights can be consistently estimated\nand the associated limiting covariance operator can be infinite-dimensional.\nThe test is consistent to any alternative hypothesis and, in particular, it\nallows us to deal with crossing hazard functions. We also provide a simulation\nstudy in order to illustrate the theoretical results.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 18:59:21 GMT"}], "update_date": "2012-01-12", "authors_parsed": [["Leão", "Dorival", ""], ["Ohashi", "Alberto", ""]]}, {"id": "1201.2395", "submitter": "Jacob Hinkle", "authors": "Jacob Hinkle and Prasanna Muralidharan and P. Thomas Fletcher and\n  Sarang Joshi", "title": "Polynomial Regression on Riemannian Manifolds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.CV math.DG stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we develop the theory of parametric polynomial regression in\nRiemannian manifolds and Lie groups. We show application of Riemannian\npolynomial regression to shape analysis in Kendall shape space. Results are\npresented, showing the power of polynomial regression on the classic rat skull\ngrowth data of Bookstein as well as the analysis of the shape changes\nassociated with aging of the corpus callosum from the OASIS Alzheimer's study.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jan 2012 20:27:32 GMT"}, {"version": "v2", "created": "Thu, 1 Mar 2012 17:26:24 GMT"}], "update_date": "2012-03-02", "authors_parsed": [["Hinkle", "Jacob", ""], ["Muralidharan", "Prasanna", ""], ["Fletcher", "P. Thomas", ""], ["Joshi", "Sarang", ""]]}, {"id": "1201.2462", "submitter": "Adel Javanmard", "authors": "Adel Javanmard and Li Zhang", "title": "The minimax risk of truncated series estimators for symmetric convex\n  polytopes", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.IT math.IT math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the optimality of the minimax risk of truncated series estimators\nfor symmetric convex polytopes. We show that the optimal truncated series\nestimator is within $O(\\log m)$ factor of the optimal if the polytope is\ndefined by $m$ hyperplanes. This represents the first such bounds towards\ngeneral convex bodies. In proving our result, we first define a geometric\nquantity, called the \\emph{approximation radius}, for lower bounding the\nminimax risk. We then derive our bounds by establishing a connection between\nthe approximation radius and the Kolmogorov width, the quantity that provides\nupper bounds for the truncated series estimator. Besides, our proof contains\nseveral ingredients which might be of independent interest: 1. The notion of\napproximation radius depends on the volume of the body. It is an intuitive\nnotion and is flexible to yield strong minimax lower bounds; 2. The connection\nbetween the approximation radius and the Kolmogorov width is a consequence of a\nnovel duality relationship on the Kolmogorov width, developed by utilizing some\ndeep results from convex geometry.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2012 02:11:13 GMT"}], "update_date": "2012-01-13", "authors_parsed": [["Javanmard", "Adel", ""], ["Zhang", "Li", ""]]}, {"id": "1201.2577", "submitter": "Karim Lounici", "authors": "Karim Lounici", "title": "High-dimensional covariance matrix estimation with missing observations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the problem of high-dimensional approximately\nlow-rank covariance matrix estimation with missing observations. We propose a\nsimple procedure computationally tractable in high-dimension and that does not\nrequire imputation of the missing data. We establish non-asymptotic sparsity\noracle inequalities for the estimation of the covariance matrix with the\nFrobenius and spectral norms, valid for any setting of the sample size and the\ndimension of the observations. We further establish minimax lower bounds\nshowing that our rates are minimax optimal up to a logarithmic factor.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2012 14:34:24 GMT"}, {"version": "v2", "created": "Tue, 17 Jan 2012 15:56:53 GMT"}, {"version": "v3", "created": "Wed, 22 Feb 2012 16:30:16 GMT"}, {"version": "v4", "created": "Fri, 27 Apr 2012 14:47:52 GMT"}, {"version": "v5", "created": "Fri, 11 May 2012 16:55:00 GMT"}], "update_date": "2012-05-14", "authors_parsed": [["Lounici", "Karim", ""]]}, {"id": "1201.2591", "submitter": "Thomas Kahle", "authors": "Thomas Kahle and Johannes Rauh and Seth Sullivant", "title": "Positive margins and primary decomposition", "comments": "26 pages, 3 figures, v2: various small improvements, v3: added\n  K_(3,3) as an example of a non-radical global Markov ideal + small\n  improvements", "journal-ref": "J. Commut. Algebra, Volume 6, Number 2 (2014), 173-208", "doi": "10.1216/JCA-2014-6-2-173", "report-no": null, "categories": "math.AC math.CO math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study random walks on contingency tables with fixed marginals,\ncorresponding to a (log-linear) hierarchical model. If the set of allowed moves\nis not a Markov basis, then there exist tables with the same marginals that are\nnot connected. We study linear conditions on the values of the marginals that\nensure that all tables in a given fiber are connected. We show that many\ngraphical models have the positive margins property, which says that all fibers\nwith strictly positive marginals are connected by the quadratic moves that\ncorrespond to conditional independence statements. The property persists under\nnatural operations such as gluing along cliques, but we also construct examples\nof graphical models not enjoying this property. We also provide a negative\nanswer to a question of Engstr\\\"om, Kahle, and Sullivant by demonstrating that\nthe global Markov ideal of the complete bipartite graph K_(3,3) is not radical.\n  Our analysis of the positive margins property depends on computing the\nprimary decomposition of the associated conditional independence ideal. The\nmain technical results of the paper are primary decompositions of the\nconditional independence ideals of graphical models of the $N$-cycle and the\ncomplete bipartite graph $K_(2,N-2)$, with various restrictions on the size of\nthe nodes.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2012 15:26:26 GMT"}, {"version": "v2", "created": "Wed, 29 Feb 2012 12:18:42 GMT"}, {"version": "v3", "created": "Thu, 21 Jun 2012 01:55:36 GMT"}], "update_date": "2016-04-08", "authors_parsed": [["Kahle", "Thomas", ""], ["Rauh", "Johannes", ""], ["Sullivant", "Seth", ""]]}, {"id": "1201.2617", "submitter": "Theofanis Sapatinas", "authors": "Efstathios Paparoditis and Theofanis Sapatinas", "title": "Short-Term Load Forecasting: The Similar Shape Functional Time Series\n  Predictor", "comments": "22 pages, 6 Figures, 1 Table", "journal-ref": "IEEE Transactions on Power Systems, Vol. 28, 3818-3825 (2013)", "doi": "10.1109/TPWRS.2013.2272326", "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a novel functional time series methodology for short-term load\nforecasting. The prediction is performed by means of a weighted average of past\ndaily load segments, the shape of which is similar to the expected shape of the\nload segment to be predicted. The past load segments are identified from the\navailable history of the observed load segments by means of their closeness to\na so-called reference load segment, the later being selected in a manner that\ncaptures the expected qualitative and quantitative characteristics of the load\nsegment to be predicted. Weak consistency of the suggested functional similar\nshape predictor is established. As an illustration, we apply the suggested\nfunctional time series forecasting methodology to historical daily load data in\nCyprus and compare its performance to that of a recently proposed alternative\nfunctional time series methodology for short-term load forecasting.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jan 2012 17:06:23 GMT"}], "update_date": "2013-11-07", "authors_parsed": [["Paparoditis", "Efstathios", ""], ["Sapatinas", "Theofanis", ""]]}, {"id": "1201.2716", "submitter": "Stavros Vakeroudis", "authors": "Stavros Vakeroudis, Marc Yor", "title": "Integrability properties and limit theorems for the exit time from a\n  cone of planar Brownian motion", "comments": "Published in at http://dx.doi.org/10.3150/12-BEJ438 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2013, Vol. 19, No. 5A, 2000-2009", "doi": "10.3150/12-BEJ438", "report-no": "IMS-BEJ-BEJ438", "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We obtain some integrability properties and some limit theorems for the exit\ntime from a cone of a planar Brownian motion, and we check that our\ncomputations are correct via Bougerol's identity.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jan 2012 00:43:16 GMT"}, {"version": "v2", "created": "Wed, 11 Dec 2013 09:22:14 GMT"}], "update_date": "2013-12-12", "authors_parsed": [["Vakeroudis", "Stavros", ""], ["Yor", "Marc", ""]]}, {"id": "1201.3102", "submitter": "Ryan Martin", "authors": "Ryan Martin, Liang Hong, and Stephen G. Walker", "title": "A note on Bayesian convergence rates under local prior support\n  conditions", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bounds on Bayesian posterior convergence rates, assuming the prior satisfies\nboth local and global support conditions, are now readily available. In this\npaper we explore, in the context of density estimation, Bayesian convergence\nrates assuming only local prior support conditions. Our results give optimal\nrates under minimal conditions using very simple arguments.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jan 2012 16:35:14 GMT"}, {"version": "v2", "created": "Sat, 29 Sep 2012 13:03:35 GMT"}, {"version": "v3", "created": "Tue, 2 Oct 2012 00:50:49 GMT"}, {"version": "v4", "created": "Sat, 15 Dec 2012 19:52:17 GMT"}, {"version": "v5", "created": "Mon, 3 Jun 2013 11:14:07 GMT"}, {"version": "v6", "created": "Fri, 27 Sep 2013 22:04:31 GMT"}, {"version": "v7", "created": "Tue, 24 Dec 2013 12:55:02 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Martin", "Ryan", ""], ["Hong", "Liang", ""], ["Walker", "Stephen G.", ""]]}, {"id": "1201.3239", "submitter": "Tamio Koyama", "authors": "Tamio Koyama, Hiromasa Nakayama, Kenta Nishiyama, Nobuki Takayama", "title": "Holonomic Gradient Descent for the Fisher-Bingham Distribution on the\n  $d$-dimensional Sphere", "comments": "23 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an accelerated version of the holonomic gradient descent and apply\nit to calculating the maximum likelihood estimate (MLE) of the Fisher-Bingham\ndistribution on a $d$-dimensional sphere. We derive a Pfaffian system (an\nintegrable connection) and a series expansion associated with the normalizing\nconstant with an error estimation. These enable us to solve some MLE problems\nup to dimension $d=7$ with a specified accuracy.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jan 2012 12:58:33 GMT"}, {"version": "v2", "created": "Wed, 30 May 2012 03:55:35 GMT"}, {"version": "v3", "created": "Wed, 22 Aug 2012 08:47:18 GMT"}, {"version": "v4", "created": "Wed, 9 Jan 2013 01:54:40 GMT"}, {"version": "v5", "created": "Sat, 22 Jun 2013 06:22:50 GMT"}], "update_date": "2013-06-25", "authors_parsed": [["Koyama", "Tamio", ""], ["Nakayama", "Hiromasa", ""], ["Nishiyama", "Kenta", ""], ["Takayama", "Nobuki", ""]]}, {"id": "1201.3283", "submitter": "Clement Marteau", "authors": "S\\'ebastien Loustau (LAREMA), Cl\\'ement Marteau (IMT)", "title": "Minimax fast rates for discriminant analysis with errors in variables", "comments": null, "journal-ref": "Bernoulli, Bernoulli Society for Mathematical Statistics and\n  Probability, 2015, pp.30", "doi": "10.3150/13-BEJ564", "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The effect of measurement errors in discriminant analysis is investigated.\nGiven observations $Z=X+\\epsilon$, where $\\epsilon$ denotes a random noise, the\ngoal is to predict the density of $X$ among two possible candidates $f$ and\n$g$. We suppose that we have at our disposal two learning samples. The aim is\nto approach the best possible decision rule $G^\\star$ defined as a minimizer of\nthe Bayes risk. In the free-noise case $(\\epsilon=0)$, minimax fast rates of\nconvergence are well-known under the margin assumption in discriminant analysis\n(see \\cite{mammen}) or in the more general classification framework (see\n\\cite{tsybakov2004,AT}). In this paper we intend to establish similar results\nin the noisy case, i.e. when dealing with errors in variables. We prove minimax\nlower bounds for this problem and explain how can these rates be attained,\nusing in particular an Empirical Risk Minimizer (ERM) method based on\ndeconvolution kernel estimators.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jan 2012 15:32:13 GMT"}, {"version": "v2", "created": "Fri, 12 Jul 2013 11:18:07 GMT"}, {"version": "v3", "created": "Tue, 12 May 2015 14:40:45 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Loustau", "Sébastien", "", "LAREMA"], ["Marteau", "Clément", "", "IMT"]]}, {"id": "1201.3611", "submitter": "William Briggs", "authors": "William M. Briggs", "title": "On Probability Leakage", "comments": "1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The probability leakage of model M with respect to evidence E is defined.\nProbability leakage is a kind of model error. It occurs when M implies that\nevents $y$, which are impossible given E, have positive probability. Leakage\ndoes not imply model falsification. Models with probability leakage cannot be\ncalibrated empirically. Regression models, which are ubiquitous in statistical\npractice, often evince probability leakage.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jan 2012 20:21:48 GMT"}], "update_date": "2012-01-18", "authors_parsed": [["Briggs", "William M.", ""]]}, {"id": "1201.3828", "submitter": "Oliver Pfaffel", "authors": "Oliver Pfaffel and Eckhard Schlemm", "title": "Eigenvalue distribution of large sample covariance matrices of linear\n  processes", "comments": "12 pages", "journal-ref": "Probab. Math. Statist., 31 (2), 313-329, 2011", "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive the distribution of the eigenvalues of a large sample covariance\nmatrix when the data is dependent in time. More precisely, the dependence for\neach variable $i=1,...,p$ is modelled as a linear process\n$(X_{i,t})_{t=1,...,n}=(\\sum_{j=0}^\\infty c_j Z_{i,t-j})_{t=1,...,n}$, where\n$\\{Z_{i,t}\\}$ are assumed to be independent random variables with finite fourth\nmoments. If the sample size $n$ and the number of variables $p=p_n$ both\nconverge to infinity such that $y=\\lim_{n\\to\\infty}{n/p_n}>0$, then the\nempirical spectral distribution of $p^{-1}\\X\\X^T$ converges to a\nnon\\hyp{}random distribution which only depends on $y$ and the spectral density\nof $(X_{1,t})_{t\\in\\Z}$. In particular, our results apply to (fractionally\nintegrated) ARMA processes, which we illustrate by some examples.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2012 15:37:12 GMT"}], "update_date": "2012-01-19", "authors_parsed": [["Pfaffel", "Oliver", ""], ["Schlemm", "Eckhard", ""]]}, {"id": "1201.4058", "submitter": "Marco Scutari", "authors": "Marco Scutari", "title": "On the Prior and Posterior Distributions Used in Graphical Modelling", "comments": "28 pages, 6 figures", "journal-ref": "Bayesian Analysis 2013, 8(3), 505-532", "doi": null, "report-no": null, "categories": "math.ST stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Graphical model learning and inference are often performed using Bayesian\ntechniques. In particular, learning is usually performed in two separate steps.\nFirst, the graph structure is learned from the data; then the parameters of the\nmodel are estimated conditional on that graph structure. While the probability\ndistributions involved in this second step have been studied in depth, the ones\nused in the first step have not been explored in as much detail.\n  In this paper, we will study the prior and posterior distributions defined\nover the space of the graph structures for the purpose of learning the\nstructure of a graphical model. In particular, we will provide a\ncharacterisation of the behaviour of those distributions as a function of the\npossible edges of the graph. We will then use the properties resulting from\nthis characterisation to define measures of structural variability for both\nBayesian and Markov networks, and we will point out some of their possible\napplications.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2012 13:43:08 GMT"}, {"version": "v2", "created": "Tue, 13 Nov 2012 15:55:39 GMT"}], "update_date": "2013-09-09", "authors_parsed": [["Scutari", "Marco", ""]]}, {"id": "1201.4129", "submitter": "Taiane Prass", "authors": "S\\'ilvia R. C. Lopes and Taiane S. Prass", "title": "Theoretical Results on FIEGARCH Processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.AP stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we present a theoretical study on the main properties of Fractionally\nIntegrated Exponential Generalized Autoregressive Conditional Heteroskedastic\n(FIEGARCH) processes. We analyze the conditions for the existence, the\ninvertibility, the stationarity and the ergodicity of these processes. We prove\nthat, if $\\{X_t\\}_{t \\in \\mathds{Z}}$ is a FIEGARCH$(p,d,q)$ process then,\nunder mild conditions, $\\{\\ln(X_t^2)\\}_{t\\in\\mathds{Z}}$ is an ARFIMA$(q,d,0)$,\nthat is, an autoregressive fractionally integrated moving average process. The\nconvergence order for the polynomial coefficients that describes the volatility\nis presented and results related to the spectral representation and to the\ncovariance structure of both processes $\\{\\ln(X_t^2)\\}_{t\\in\\mathds{Z}}$ and $\\\n{\\ln(\\sigma_t^2)\\}_{t\\in\\mathds{Z}}$ are also discussed. Expressions for the\nkurtosis and the asymmetry measures for any stationary FIEGARCH$(p,d,q)$\nprocess are also derived. The $h$-step ahead forecast for the processes\n$\\{X_t\\}_{t \\in \\mathds{Z}}$, $\\{\\ln(\\sigma_t^2)\\}_{t\\in\\mathds{Z}}$ and\n$\\{\\ln(X_t^2)\\}_{t\\in\\mathds{Z}}$ are given with their respective mean square\nerror forecast. The work also presents a Monte Carlo simulation study showing\nhow to generate, estimate and forecast based on six different FIEGARCH models.\nThe forecasting performance of six models belonging to the class of\nautoregressive conditional heteroskedastic models (namely, ARCH-type models)\nand radial basis models is compared through an empirical application to\nBrazilian stock market exchange index.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2012 18:17:05 GMT"}, {"version": "v2", "created": "Mon, 25 Mar 2013 17:58:00 GMT"}], "update_date": "2013-03-26", "authors_parsed": [["Lopes", "Sílvia R. C.", ""], ["Prass", "Taiane S.", ""]]}, {"id": "1201.4469", "submitter": "Tryphon Georgiou", "authors": "Johan Karlsson and Tryphon T. Georgiou", "title": "Uncertainty Bounds for Spectral Estimation", "comments": "8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY math.OC math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this paper is to study metrics suitable for assessing\nuncertainty of power spectra when these are based on finite second-order\nstatistics. The family of power spectra which is consistent with a given range\nof values for the estimated statistics represents the uncertainty set about the\n\"true\" power spectrum. Our aim is to quantify the size of this uncertainty set\nusing suitable notions of distance, and in particular, to compute the diameter\nof the set since this represents an upper bound on the distance between any\nchoice of a nominal element in the set and the \"true\" power spectrum. Since the\nuncertainty set may contain power spectra with lines and discontinuities, it is\nnatural to quantify distances in the weak topology---the topology defined by\ncontinuity of moments. We provide examples of such weakly-continuous metrics\nand focus on particular metrics for which we can explicitly quantify spectral\nuncertainty. We then consider certain high resolution techniques which utilize\nfilter-banks for pre-processing, and compute worst-case a priori uncertainty\nbounds solely on the basis of the filter dynamics. This allows the a priori\ntuning of the filter-banks for improved resolution over selected frequency\nbands.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jan 2012 13:28:55 GMT"}, {"version": "v2", "created": "Sat, 15 Sep 2012 13:49:59 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Karlsson", "Johan", ""], ["Georgiou", "Tryphon T.", ""]]}, {"id": "1201.4507", "submitter": "Prof. A. Plastino", "authors": "E. Rufeil Fiori, A. Plastino", "title": "A Shannon-Tsallis transformation", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2012.12.037", "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We determine a general link between two different solutions of the MaxEnt\nvariational problem, namely, the ones that correspond to using either Shannon's\nor Tsallis' entropies in the concomitant variational problem. It is shown that\nthe two variations lead to equivalent solutions that take different appearances\nbut contain the same information. These solutions are linked by our\ntransformation.\n", "versions": [{"version": "v1", "created": "Sat, 21 Jan 2012 20:54:22 GMT"}, {"version": "v2", "created": "Sat, 28 Jan 2012 15:19:51 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Fiori", "E. Rufeil", ""], ["Plastino", "A.", ""]]}, {"id": "1201.4579", "submitter": "James Ledoux", "authors": "Deborah Ferre (IRMAR), Lo\\\"ic Herv\\'e (IRMAR), James Ledoux (IRMAR)", "title": "Limit theorems for stationary Markov processes with L2-spectral gap", "comments": "35 pages Accepted(6 january 2011) for publication in Annales de\n  l'Institut Henri Poincare - Probabilites et Statistiques", "journal-ref": "Annales de l'IHP - Probabilit\\'es et Statistiques 48, 2 (2012)\n  396-423", "doi": "10.1214/11-AIHP413", "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $(X_t, Y_t)_{t\\in T}$ be a discrete or continuous-time Markov process\nwith state space $X \\times R^d$ where $X$ is an arbitrary measurable set. Its\ntransition semigroup is assumed to be additive with respect to the second\ncomponent, i.e. $(X_t, Y_t)_{t\\in T}$ is assumed to be a Markov additive\nprocess. In particular, this implies that the first component $(X_t)_{t\\in T}$\nis also a Markov process. Markov random walks or additive functionals of a\nMarkov process are special instances of Markov additive processes. In this\npaper, the process $(Y_t)_{t\\in T}$ is shown to satisfy the following classical\nlimit theorems: (a) the central limit theorem, (b) the local limit theorem, (c)\nthe one-dimensional Berry-Esseen theorem, (d) the one-dimensional first-order\nEdgeworth expansion, provided that we have sup{t\\in(0,1]\\cap T : E{\\pi,0}[|Y_t|\n^{\\alpha}] < 1 with the expected order with respect to the independent case (up\nto some $\\varepsilon > 0$ for (c) and (d)). For the statements (b) and (d), a\nMarkov nonlattice condition is also assumed as in the independent case. All the\nresults are derived under the assumption that the Markov process $(X_t)_{t\\in\nT}$ has an invariant probability distribution $\\pi$, is stationary and has the\n$L^2(\\pi)$-spectral gap property (that is, $(X_t)t\\in N}$ is $\\rho$-mixing in\nthe discrete-time case). The case where $(X_t)_{t\\in T}$ is non-stationary is\nbriefly discussed. As an application, we derive a Berry-Esseen bound for the\nM-estimators associated with $\\rho$-mixing Markov chains.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jan 2012 17:31:11 GMT"}], "update_date": "2012-07-27", "authors_parsed": [["Ferre", "Deborah", "", "IRMAR"], ["Hervé", "Loïc", "", "IRMAR"], ["Ledoux", "James", "", "IRMAR"]]}, {"id": "1201.4743", "submitter": "Iead Rezek", "authors": "Sreejith Das and Iead Rezek", "title": "Voting Power : A Generalised Framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.CY cs.GT cs.MA stat.OT stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines an area of Game Theory called Voting Power Theory. With\nthe adoption of a measure theoretic framework it argues that the many different\nindices and tools currently used for measuring voting power can be replaced by\njust three simple probabilities. The framework is sufficiently general to be\napplicable to every conceivable type of voting game, and every possible\ndecision rule.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jan 2012 15:39:00 GMT"}], "update_date": "2012-01-24", "authors_parsed": [["Das", "Sreejith", ""], ["Rezek", "Iead", ""]]}, {"id": "1201.4831", "submitter": "Francois Roueff", "authors": "Marianne Clausel (LJK), Fran\\c{c}ois Roueff (LTCI), Murad S. Taqqu,\n  Ciprian A. Tudor (LPP)", "title": "High order chaotic limits of wavelet scalograms under long--range\n  dependence", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $G$ be a non--linear function of a Gaussian process\n$\\{X_t\\}_{t\\in\\mathbb{Z}}$ with long--range dependence. The resulting process\n$\\{G(X_t)\\}_{t\\in\\mathbb{Z}}$ is not Gaussian when $G$ is not linear. We\nconsider random wavelet coefficients associated with\n$\\{G(X_t)\\}_{t\\in\\mathbb{Z}}$ and the corresponding wavelet scalogram which is\nthe average of squares of wavelet coefficients over locations. We obtain the\nasymptotic behavior of the scalogram as the number of observations and scales\ntend to infinity. It is known that when $G$ is a Hermite polynomial of any\norder, then the limit is either the Gaussian or the Rosenblatt distribution,\nthat is, the limit can be represented by a multiple Wiener-It\\^o integral of\norder one or two. We show, however, that there are large classes of functions\n$G$ which yield a higher order Hermite distribution, that is, the limit can be\nrepresented by a a multiple Wiener-It\\^o integral of order greater than two.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jan 2012 19:37:52 GMT"}, {"version": "v2", "created": "Wed, 27 Nov 2013 18:10:57 GMT"}], "update_date": "2013-11-28", "authors_parsed": [["Clausel", "Marianne", "", "LJK"], ["Roueff", "François", "", "LTCI"], ["Taqqu", "Murad S.", "", "LPP"], ["Tudor", "Ciprian A.", "", "LPP"]]}, {"id": "1201.5507", "submitter": "Davit Varron", "authors": "Davit Varron and Ingrid Van Keilegom", "title": "Uniform in bandwidth exact rates for a class of kernel estimators", "comments": "Published in the Annals of the Institute of Statistical Mathematics\n  Volume 63, p. 1077-1102 (2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given an i.i.d sample $(Y_i,Z_i)$, taking values in $\\RRR^{d'}\\times \\RRR^d$,\nwe consider a collection Nadarya-Watson kernel estimators of the conditional\nexpectations $\\EEE(<c_g(z),g(Y)>+d_g(z)\\mid Z=z)$, where $z$ belongs to a\ncompact set $H\\subset \\RRR^d$, $g$ a Borel function on $\\RRR^{d'}$ and\n$c_g(\\cdot),d_g(\\cdot)$ are continuous functions on $\\RRR^d$. Given two\nbandwidth sequences $h_n<\\wth_n$ fulfilling mild conditions, we obtain an exact\nand explicit almost sure limit bounds for the deviations of these estimators\naround their expectations, uniformly in $g\\in\\GG,\\;z\\in H$ and $h_n\\le h\\le\n\\wth_n$ under mild conditions on the density $f_Z$, the class $\\GG$, the kernel\n$K$ and the functions $c_g(\\cdot),d_g(\\cdot)$. We apply this result to prove\nthat smoothed empirical likelihood can be used to build confidence intervals\nfor conditional probabilities $\\PPP(Y\\in C\\mid Z=z)$, that hold uniformly in\n$z\\in H,\\; C\\in \\CC,\\; h\\in [h_n,\\wth_n]$. Here $\\CC$ is a Vapnik-Chervonenkis\nclass of sets.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 13:20:26 GMT"}], "update_date": "2012-01-27", "authors_parsed": [["Varron", "Davit", ""], ["Van Keilegom", "Ingrid", ""]]}, {"id": "1201.5515", "submitter": "Davit Varron", "authors": "Davit Varron", "title": "A nonstandard uniform functional limit law for the increments of the\n  multivariate empirical distribution function", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $(Z_i)_{i\\geq 1}$ be an independent, identically distributed sequence of\nrandom variables on $\\RRR^d$. Under mild conditions on the density of $Z_1$, we\nprovide a nonstandard uniform functional limit law for the following processes\non $[0,1)^d$: $$\\Delta_n(z,h_n,\\cdot):=s\\mapsto \\frac{\\sliin\n1_{[0,s_1]\\times...\\times[0,s_d]}\\poo\\frac{Z_i-z}{h_n^{1/d}}\\pff}{c\\log\nn},\\;s\\in [0,1)^d,$$ along a sequence $(h_n)\\suite$ fulfilling $h_n\\downarrow\n0,\\;nh_n\\uparrow,\\;nh_n/\\log c\\rar c>0$. Here $z$ ranges through a compact set\nof $\\RRR^d$. This result is an extension of a theorem of Deheuvels and Mason\n(1992) to the multivariate, non uniform case.\\lb\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 13:45:50 GMT"}], "update_date": "2012-01-27", "authors_parsed": [["Varron", "Davit", ""]]}, {"id": "1201.5516", "submitter": "Davit Varron", "authors": "Davit Varron", "title": "Some new almost sure results on the functional increments of the uniform\n  empirical process", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given an observation of the uniform empirical process $\\alp_n$, its\nfunctional increments $\\alp_n(u+a_n\\cdot)-\\alp_n(u)$ can be viewed as a single\nrandom process, when $u$ is distributed under the Lebesgue measure. We\ninvestigate the almost sure limit behaviour of the multivariate versions of\nthese processes as $\\nif$ and $a_n\\downarrow 0$. Under mild conditions on\n$a_n$, a convergence in distribution and functional limit laws are established.\nThe proofs rely on a new extension of usual Poissonisation tools for the local\nempirical process.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 13:49:29 GMT"}], "update_date": "2012-01-27", "authors_parsed": [["Varron", "Davit", ""]]}, {"id": "1201.5517", "submitter": "Davit Varron", "authors": "Davit Varron", "title": "Some uniform in bandwidth functional results for the tail uniform\n  empirical and quantile processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For fixed $t\\in [0,1)$ and $h>0$, consider the local uniform empirical\nprocess $$\\DD_{n,h,t}(s):=n^{-1/2}\\coo\\sliin 1_{[t,t+hs]}(U_i)-hs\\cff,\\;s\\in\n[0,1],$$ where the $U_i$ are independent and uniformly distributed on $[0,1]$.\nWe investigate the functional limit behaviour of $\\DD_{n,h,t}$ uniformly in\n$\\wth_n\\le h\\le h_n$ when $n\\wth_n/\\log\\log n\\rar \\infty$ and $h_n\\rar 0$.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 13:59:10 GMT"}], "update_date": "2012-01-27", "authors_parsed": [["Varron", "Davit", ""]]}, {"id": "1201.5520", "submitter": "Davit Varron", "authors": "Davit Varron", "title": "Some asymptotic results on density estimators by wavelet projections", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $(X_i)_{i\\geq 1}$ be an i.i.d. sample on $\\RRR^d$ having density $f$.\nGiven a real function $\\phi$ on $\\RRR^d$ with finite variation and given an\ninteger valued sequence $(j_n)$, let $\\fn$ denote the estimator of $f$ by\nwavelet projection based on $\\phi$ and with multiresolution level equal to\n$j_n$. We provide exact rates of almost sure convergence to 0 of the quantity\n$\\sup_{x\\in H}\\mid \\fn(x)-\\EEE(\\fn)(x)\\mid$, when $n2^{-dj_n}/\\log n \\rar\n\\infty$ and $H$ is a given hypercube of $\\RRR^d$. We then show that, if\n$n2^{-dj_n}/\\log n \\rar c$ for a constant $c>0$, then the quantity $\\sup_{x\\in\nH}\\mid \\fn(x)-f\\mid$ almost surely fails to converge to 0.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 14:04:21 GMT"}], "update_date": "2012-01-27", "authors_parsed": [["Varron", "Davit", ""]]}, {"id": "1201.5521", "submitter": "Davit Varron", "authors": "Davit Varron", "title": "Clustering rates and Chung type functional laws of the iterated\n  logarithm for empirical and quantile processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Following the works of Berthet (1997), we first obtain exact clustering rates\nin the functional law of the iterated logarithm for the uniform empirical and\nquantile processes and for their increments. In a second time, we obtain\nfunctional Chung-type limit laws for the local empirical process for a class of\ntarget functions on the border of the Strassen set.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 14:08:52 GMT"}], "update_date": "2012-01-27", "authors_parsed": [["Varron", "Davit", ""]]}, {"id": "1201.5528", "submitter": "Davit Varron", "authors": "Davit Varron and Myriam Maumy", "title": "Non standard functional limit laws for the increments of the compound\n  empirical distribution function", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $(Y_i,Z_i)_{i\\geq 1}$ be a sequence of independent, identically\ndistributed (i.i.d.) random vectors taking values in $\\RRR^k\\times\\RRR^d$, for\nsome integers $k$ and $d$. Given $z\\in \\RRR^d$, we provide a nonstandard\nfunctional limit law for the sequence of functional increments of the compound\nempirical process, namely $$\\mathbf{\\Delta}_{n,\\cc}(h_n,z,\\cdot):=\n\\frac{1}{nh_n}\\sliin 1_{[0,\\cdot)}\\poo \\frac{Z_i-z}{{h_n}^{1/d}}\\pff Y_i.$$\nProvided that $nh_n\\sim c\\log n $ as $\\nif$, we obtain, under some natural\nconditions on the conditional exponential moments of $Y\\mid Z=z$, that\n$$\\mathbf{\\Delta}_{n,\\cc}(h_n,z,\\cdot)\\leadsto \\Gam\\text{almost surely},$$\nwhere $\\leadsto$ denotes the clustering process under the sup norm on $\\Idd$.\nHere, $\\Gam$ is a compact set that is related to the large deviations of\ncertain compound Poisson processes.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jan 2012 14:16:43 GMT"}], "update_date": "2012-01-27", "authors_parsed": [["Varron", "Davit", ""], ["Maumy", "Myriam", ""]]}, {"id": "1201.5690", "submitter": "Jongwook  Kim", "authors": "Jongwook Kim and Gabjin Oh", "title": "Heavy-tail driven by memory", "comments": "This paper was withdrawn by the authors because of the change in\n  authorship. The work is replaced by the new one with considerable improvement\n  which is available at arXiv", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a stochastic process driven by memory effect with novel\ndistributions including both exponential and leptokurtic heavy-tailed\ndistributions. A class of distribution is analytically derived from the\ncontinuum limit of the discrete binary process with the renormalized\nauto-correlation and the closed form moment generating function is obtained,\nthus the cumulants are calculated and shown to be convergent. The other class\nof distributions are numerically investigated. The concoction of the two\nstochastic processes of the different signs of memory under regime switching\nmechanism does incarnate power-law decay behavior, which strongly implies that\nmemory is the alternative origin of heavy-tail.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jan 2012 02:33:44 GMT"}, {"version": "v2", "created": "Mon, 26 Mar 2012 07:23:48 GMT"}, {"version": "v3", "created": "Thu, 9 May 2013 08:55:25 GMT"}, {"version": "v4", "created": "Mon, 13 May 2013 04:00:15 GMT"}], "update_date": "2013-05-14", "authors_parsed": [["Kim", "Jongwook", ""], ["Oh", "Gabjin", ""]]}, {"id": "1201.5705", "submitter": "Jose A. Diaz-Garcia", "authors": "Francisco J. Caro-Lopera and Jose A. Diaz-Garcia", "title": "Matrix Kummer-Pearson VII Relation and its Application in Affine Shape", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A case of the matrix Kummer relation of Herz (1955) based on the Pearson VII\ntype matrix model is derived in this paper. As a consequence, the polynomial\nPearson VII configuration density is obtained and this set the corresponding\nexact inference as a solvable aspect in shape theory.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jan 2012 05:50:56 GMT"}], "update_date": "2012-01-30", "authors_parsed": [["Caro-Lopera", "Francisco J.", ""], ["Diaz-Garcia", "Jose A.", ""]]}, {"id": "1201.5833", "submitter": "Johanna F. Ziegel", "authors": "Johanna Ziegel", "title": "Convolution roots and differentiability of isotropic positive definite\n  functions on spheres", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that any isotropic positive definite function on the sphere can be\nwritten as the spherical self-convolution of an isotropic real-valued function.\nIt is known that isotropic positive definite functions on d-dimensional\nEuclidean space admit a continuous derivative of order [(d-1)/2]. We show that\nthe same holds true for isotropic positive definite functions on spheres and\nprove that this result is optimal for all odd dimensions.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jan 2012 17:00:21 GMT"}, {"version": "v2", "created": "Wed, 4 Jul 2012 10:28:41 GMT"}, {"version": "v3", "created": "Mon, 28 Oct 2013 09:16:12 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Ziegel", "Johanna", ""]]}, {"id": "1201.5871", "submitter": "Patrick Perry", "authors": "Patrick O. Perry, Patrick J. Wolfe", "title": "Null models for network data", "comments": "12 pages, 2 figures; submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST cs.SI stat.ME stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The analysis of datasets taking the form of simple, undirected graphs\ncontinues to gain in importance across a variety of disciplines. Two choices of\nnull model, the logistic-linear model and the implicit log-linear model, have\ncome into common use for analyzing such network data, in part because each\naccounts for the heterogeneity of network node degrees typically observed in\npractice. Here we show how these both may be viewed as instances of a broader\nclass of null models, with the property that all members of this class give\nrise to essentially the same likelihood-based estimates of link probabilities\nin sparse graph regimes. This facilitates likelihood-based computation and\ninference, and enables practitioners to choose the most appropriate null model\nfrom this family based on application context. Comparative model fits for a\nvariety of network datasets demonstrate the practical implications of our\nresults.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jan 2012 19:30:46 GMT"}], "update_date": "2012-02-13", "authors_parsed": [["Perry", "Patrick O.", ""], ["Wolfe", "Patrick J.", ""]]}, {"id": "1201.5990", "submitter": "Francesco Bartolucci", "authors": "F. Bartolucci, A. Farcomeni, F. Pennoni", "title": "A note on the application of the Oakes' identity to obtain the observed\n  information matrix of hidden Markov models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive the observed information matrix of hidden Markov models by the\napplication of the Oakes (1999)'s identity. The method only requires the first\nderivative of the forward-backward recursions of Baum and Welch (1970), instead\nof the second derivative of the forward recursion, which is required within the\napproach of Lystig and Hughes (2002). The method is illustrated by an example\nbased on the analysis of a longitudinal dataset which is well known in\nsociology.\n", "versions": [{"version": "v1", "created": "Sat, 28 Jan 2012 20:17:50 GMT"}], "update_date": "2012-01-31", "authors_parsed": [["Bartolucci", "F.", ""], ["Farcomeni", "A.", ""], ["Pennoni", "F.", ""]]}, {"id": "1201.6052", "submitter": "Clement Levrard", "authors": "Cl\\'ement Levrard (UP11, UPMC, INRIA Saclay - Ile de France)", "title": "Fast rates for empirical vector quantization", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the rate of convergence of the expected loss of empirically\noptimal vector quantizers. Earlier results show that the mean-squared expected\ndistortion for any fixed distribution supported on a bounded set and satisfying\nsome regularity conditions decreases at the rate O(log n/n). We prove that this\nrate is actually O(1/n). Although these conditions are hard to check, we show\nthat well-polarized distributions with continuous densities supported on a\nbounded set are included in the scope of this result.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jan 2012 16:11:55 GMT"}], "update_date": "2012-02-01", "authors_parsed": [["Levrard", "Clément", "", "UP11, UPMC, INRIA Saclay - Ile de France"]]}, {"id": "1201.6115", "submitter": "Sebastien Loustau", "authors": "S\\'ebastien Loustau (LAREMA)", "title": "Statistical learning with indirect observations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $(X,Y)\\in\\mathcal{X}\\times \\mathcal{Y}$ be a random couple with unknown\ndistribution $P$. Let $\\GG$ be a class of measurable functions and $\\ell$ a\nloss function. The problem of statistical learning deals with the estimation of\nthe Bayes: $$g^*=\\arg\\min_{g\\in\\GG}\\E_P \\ell(g(X),Y). $$ In this paper, we\nstudy this problem when we deal with a contaminated sample $(Z_1,Y_1),...,\n(Z_n,Y_n)$ of i.i.d. indirect observations. Each input $Z_i$, $i=1,...,n$ is\ndistributed from a density $Af$, where $A$ is a known compact linear operator\nand $f$ is the density of the direct input $X$. We derive fast rates of\nconvergence for empirical risk minimizers based on regularization methods, such\nas deconvolution kernel density estimators or spectral cut-off. These results\nare comparable to the existing fast rates in Koltchinskii for the direct case.\nIt gives some insights into the effect of indirect measurements in the presence\nof fast rates of convergence.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 06:57:56 GMT"}, {"version": "v2", "created": "Wed, 15 Feb 2012 13:05:55 GMT"}, {"version": "v3", "created": "Tue, 10 Jul 2012 08:17:17 GMT"}], "update_date": "2012-07-12", "authors_parsed": [["Loustau", "Sébastien", "", "LAREMA"]]}, {"id": "1201.6161", "submitter": "Nicolas Chopin", "authors": "Nicolas Chopin", "title": "On the equivalence between standard and sequentially ordered hidden\n  Markov models", "comments": null, "journal-ref": "Statistics & Probability Letters 2008, volume 78, number 14, pages\n  2171 - 2174", "doi": "10.1016/j.spl.2008.02.010", "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chopin (2007) introduced a sequentially ordered hidden Markov model, for\nwhich states are ordered according to their order of appearance, and claimed\nthat such a model is a re-parametrisation of a standard Markov model. This note\ngives a formal proof that this equivalence holds in Bayesian terms, as both\nformulations generate equivalent posterior distributions, but does not hold in\nFrequentist terms, as both formulations generate incompatible likelihood\nfunctions. Perhaps surprisingly, this shows that Bayesian re-parametrisation\nand Frequentist re-parametrisation are not identical concepts.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 10:38:22 GMT"}], "update_date": "2012-01-31", "authors_parsed": [["Chopin", "Nicolas", ""]]}, {"id": "1201.6211", "submitter": "Dimitris N. Politis", "authors": "Jens-Peter Kreiss, Efstathios Paparoditis, Dimitris N. Politis", "title": "On the range of validity of the autoregressive sieve bootstrap", "comments": "Published in at http://dx.doi.org/10.1214/11-AOS900 the Annals of\n  Statistics (http://www.imstat.org/aos/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Annals of Statistics 2011, Vol. 39, No. 4, 2103-2130", "doi": "10.1214/11-AOS900", "report-no": "IMS-AOS-AOS900", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the limits of the autoregressive (AR) sieve bootstrap, and show\nthat its applicability extends well beyond the realm of linear time series as\nhas been previously thought. In particular, for appropriate statistics, the\nAR-sieve bootstrap is valid for stationary processes possessing a general\nWold-type autoregressive representation with respect to a white noise; in\nessence, this includes all stationary, purely nondeterministic processes, whose\nspectral density is everywhere positive. Our main theorem provides a simple and\neffective tool in assessing whether the AR-sieve bootstrap is asymptotically\nvalid in any given situation. In effect, the large-sample distribution of the\nstatistic in question must only depend on the first and second order moments of\nthe process; prominent examples include the sample mean and the spectral\ndensity. As a counterexample, we show how the AR-sieve bootstrap is not always\nvalid for the sample autocovariance even when the underlying process is linear.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 13:58:27 GMT"}], "update_date": "2012-01-31", "authors_parsed": [["Kreiss", "Jens-Peter", ""], ["Paparoditis", "Efstathios", ""], ["Politis", "Dimitris N.", ""]]}, {"id": "1201.6216", "submitter": "Ke Zhu", "authors": "Ke Zhu, Shiqing Ling", "title": "Global self-weighted and local quasi-maximum exponential likelihood\n  estimators for ARMA--GARCH/IGARCH models", "comments": "Published in at http://dx.doi.org/10.1214/11-AOS895 the Annals of\n  Statistics (http://www.imstat.org/aos/) by the Institute of Mathematical\n  Statistics (http://www.imstat.org)", "journal-ref": "Annals of Statistics 2011, Vol. 39, No. 4, 2131-2163", "doi": "10.1214/11-AOS895", "report-no": "IMS-AOS-AOS895", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the asymptotic theory of the quasi-maximum\nexponential likelihood estimators (QMELE) for ARMA--GARCH models. Under only a\nfractional moment condition, the strong consistency and the asymptotic\nnormality of the global self-weighted QMELE are obtained. Based on this\nself-weighted QMELE, the local QMELE is showed to be asymptotically normal for\nthe ARMA model with GARCH (finite variance) and IGARCH errors. A formal\ncomparison of two estimators is given for some cases. A simulation study is\ncarried out to assess the performance of these estimators, and a real example\non the world crude oil price is given.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 14:10:37 GMT"}], "update_date": "2012-01-31", "authors_parsed": [["Zhu", "Ke", ""], ["Ling", "Shiqing", ""]]}, {"id": "1201.6307", "submitter": "Valentin Konakov", "authors": "Valentin Konakov, Enno Mammen, Jeannette Woerner", "title": "Statistical convergence of Markov experiments to diffusion limits", "comments": "Published in at http://dx.doi.org/10.3150/12-BEJ500 the Bernoulli\n  (http://isi.cbs.nl/bernoulli/) by the International Statistical\n  Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)", "journal-ref": "Bernoulli 2014, Vol. 20, No. 2, 623-644", "doi": "10.3150/12-BEJ500", "report-no": "IMS-BEJ-BEJ500", "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assume that one observes the $k$th, $2k$th$,\\ldots,nk$th value of a Markov\nchain $X_{1,h},\\ldots,X_{nk,h}$. That means we assume that a high frequency\nMarkov chain runs in the background on a very fine time grid but that it is\nonly observed on a coarser grid. This asymptotics reflects a set up occurring\nin the high frequency statistical analysis for financial data where diffusion\napproximations are used only for coarser time scales. In this paper, we show\nthat under appropriate conditions the L$_1$-distance between the joint\ndistribution of the Markov chain and the distribution of the discretized\ndiffusion limit converges to zero. The result implies that the LeCam deficiency\ndistance between the statistical Markov experiment and its diffusion limit\nconverges to zero. This result can be applied to Euler approximations for the\njoint distribution of diffusions observed at points\n$\\Delta,2\\Delta,\\ldots,n\\Delta$. The joint distribution can be approximated by\ngenerating Euler approximations at the points $\\Delta k^{-1},2\\Delta\nk^{-1},\\ldots,n\\Delta$. Our result implies that under our regularity conditions\nthe Euler approximation is consistent for $n\\to\\infty$ if $nk^{-2}\\to0$.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 18:05:08 GMT"}, {"version": "v2", "created": "Fri, 14 Mar 2014 14:31:55 GMT"}], "update_date": "2014-03-17", "authors_parsed": [["Konakov", "Valentin", ""], ["Mammen", "Enno", ""], ["Woerner", "Jeannette", ""]]}, {"id": "1201.6387", "submitter": "Davide Di Cecco", "authors": "Davide Di Cecco", "title": "Upper and lower bounds for the reliability measure of a discrete\n  distribution conditionally on the first three moments", "comments": "11 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give sharp bounds for the reliability measure of a discrete r.v. defined\non {0, ..., n}, conditionally on the knowledge of the first three moments of\nthe r.v. The present work is as an extension of the results given in [Di Cecco,\nStat. Prob. Lett., 81(2011), 411-416].\n", "versions": [{"version": "v1", "created": "Mon, 30 Jan 2012 21:49:39 GMT"}], "update_date": "2012-02-01", "authors_parsed": [["Di Cecco", "Davide", ""]]}, {"id": "1201.6551", "submitter": "Yannick Baraud", "authors": "Yannick Baraud (JAD)", "title": "Estimation of the density of a determinantal process", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of estimating the density $\\Pi$ of a determinantal\nprocess $N$ from the observation of $n$ independent copies of it. We use an\naggregation procedure based on robust testing to build our estimator. We\nestablish non-asymptotic risk bounds with respect to the Hellinger loss and\ndeduce, when $n$ goes to infinity, uniform rates of convergence over classes of\ndensities $\\Pi$ of interest.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jan 2012 14:33:31 GMT"}, {"version": "v2", "created": "Thu, 14 Mar 2013 08:42:34 GMT"}], "update_date": "2013-03-15", "authors_parsed": [["Baraud", "Yannick", "", "JAD"]]}, {"id": "1201.6611", "submitter": "Stefan Aulbach", "authors": "Stefan Aulbach and Michael Falk", "title": "Testing for a generalized Pareto process", "comments": "22 pages, 1 figure, 4th International Conference of the ERCIM WG on\n  Computing & Statistics (ERCIM'11), 17-19 December, 2011, University of London", "journal-ref": "Electron. J. Stat. 6 (2012) 1779-1802", "doi": "10.1214/12-EJS728", "report-no": null, "categories": "math.ST math.PR stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate two models for the following setup: We consider a stochastic\nprocess X \\in C[0,1] whose distribution belongs to a parametric family indexed\nby \\vartheta \\in {\\Theta} \\subset R. In case \\vartheta = 0, X is a generalized\nPareto process. Based on n independent copies X(1),...,X(n) of X, we establish\nlocal asymptotic normality (LAN) of the point process of exceedances among\nX(1),...,X(n) above an increasing threshold line in each model.\n  The corresponding central sequences provide asymptotically optimal sequences\nof tests for testing H0 : \\vartheta = 0 against a sequence of alternatives Hn :\n\\vartheta = \\varthetan converging to zero as n increases. In one model, with an\nunderlying exponential family, the central sequence is provided by the number\nof exceedances only, whereas in the other one the exceedances themselves\ncontribute, too. However it turns out that, in both cases, the test statistics\nalso depend on some additional and usually unknown model parameters.\n  We, therefore, consider an omnibus test statistic sequence as well and\ncompute its asymptotic relative efficiency with respect to the optimal test\nsequence.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jan 2012 16:48:42 GMT"}], "update_date": "2012-11-13", "authors_parsed": [["Aulbach", "Stefan", ""], ["Falk", "Michael", ""]]}, {"id": "1201.6634", "submitter": "Eberhard Mayerhofer", "authors": "Eberhard Mayerhofer", "title": "Wishart Processes and Wishart Distributions: An Affine Processes Point\n  of View", "comments": "This is the final version of Part II of the CIMPA lecture notes on\n  Wishart processes, to be published jointly with Piotr Graczyk (part I) in a\n  corresponding volume in September 2012. They are based on presentations at\n  the CIMPA workshop in Hammamet, Tunesia (Sept. 2011)", "journal-ref": "Modern methods in multivariate statistics, Travaux en Cours,\n  Hermann, Paris, 2014", "doi": null, "report-no": null, "categories": "math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  These lecture notes provide an introduction to the theory of Wishart\ndistributions and Wishart processes, particularly what concerns their existence\nand their realizations as solutions of Wishart SDEs. The material is based on\nrecent developments in the theory of affine processes and related fields.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jan 2012 17:54:44 GMT"}, {"version": "v2", "created": "Thu, 30 Aug 2012 09:23:06 GMT"}], "update_date": "2021-01-12", "authors_parsed": [["Mayerhofer", "Eberhard", ""]]}]