[{"id": "0904.1234", "submitter": "Mark Herrera", "authors": "Mark Herrera, David C. Roberts, Natali Gulbahce", "title": "Mapping the evolution of scientific fields", "comments": "v3: re-ran analysis with new noise parameter choice; 10 pages for\n  main paper; 11 pages for suppl. info", "journal-ref": "PLoS ONE 5(5): e10355. 2010", "doi": "10.1371/journal.pone.0010355", "report-no": null, "categories": "physics.soc-ph cs.DL cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the apparent cross-disciplinary interactions among scientific fields,\na formal description of their evolution is lacking. Here we describe a novel\napproach to study the dynamics and evolution of scientific fields using a\nnetwork-based analysis. We build an idea network consisting of American\nPhysical Society Physics and Astronomy Classification Scheme (PACS) numbers as\nnodes representing scientific concepts. Two PACS numbers are linked if there\nexist publications that reference them simultaneously. We locate scientific\nfields using a community finding algorithm, and describe the time evolution of\nthese fields over the course of 1985-2006. The communities we identify map to\nknown scientific fields, and their age depends on their size and activity. We\nexpect our approach to quantifying the evolution of ideas to be relevant for\nmaking predictions about the future of science and thus help to guide its\ndevelopment.\n", "versions": [{"version": "v1", "created": "Tue, 7 Apr 2009 22:24:11 GMT"}, {"version": "v2", "created": "Tue, 15 Sep 2009 20:58:03 GMT"}, {"version": "v3", "created": "Fri, 23 Apr 2010 02:53:29 GMT"}], "update_date": "2011-02-03", "authors_parsed": [["Herrera", "Mark", ""], ["Roberts", "David C.", ""], ["Gulbahce", "Natali", ""]]}, {"id": "0904.1299", "submitter": "Andreas W. Liehr", "authors": "Moritz Riede, Rico Schueppel, Kristian O. Sylvester-Hvid, Martin\n  Kuehne, Michael C. Roettger, Klaus Zimmermann and Andreas W. Liehr", "title": "On the Communication of Scientific Results: The Full-Metadata Format", "comments": null, "journal-ref": "Comput.Phys.Commun.181:651-662,2010", "doi": "10.1016/j.cpc.2009.11.014", "report-no": "SI20090302a", "categories": "cs.DL cs.IR physics.comp-ph physics.ins-det", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce a scientific format for text-based data files,\nwhich facilitates storing and communicating tabular data sets. The so-called\nFull-Metadata Format builds on the widely used INI-standard and is based on\nfour principles: readable self-documentation, flexible structure, fail-safe\ncompatibility, and searchability. As a consequence, all metadata required to\ninterpret the tabular data are stored in the same file, allowing for the\nautomated generation of publication-ready tables and graphs and the semantic\nsearchability of data file collections. The Full-Metadata Format is introduced\non the basis of three comprehensive examples. The complete format and syntax is\ngiven in the appendix.\n", "versions": [{"version": "v1", "created": "Wed, 8 Apr 2009 10:07:02 GMT"}], "update_date": "2010-01-21", "authors_parsed": [["Riede", "Moritz", ""], ["Schueppel", "Rico", ""], ["Sylvester-Hvid", "Kristian O.", ""], ["Kuehne", "Martin", ""], ["Roettger", "Michael C.", ""], ["Zimmermann", "Klaus", ""], ["Liehr", "Andreas W.", ""]]}]