[{"id": "1010.2706", "submitter": "Willemien Visser", "authors": "Willemien Visser (LTCI)", "title": "Function and form of gestures in a collaborative design meeting", "comments": null, "journal-ref": "Gesture in embodied communication and human-computer interaction.\n  8th International Gesture Workshop, GW 2009. Bielefeld, Germany, February\n  25-27, 2009. Revised selected papers, Kopp, S. and Wachsmuth, I. (Ed.) (2010)\n  61-72", "doi": "10.1007/978-3-642-12553-9_6", "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines the relationship between gestures' function and form in\ndesign collaboration. It adopts a cognitive design research viewpoint. The\nanalysis is restricted to gesticulations and emblems. The data analysed come\nfrom an empirical study conducted on an architectural design meeting. Based on\na previous analysis of the data, guided by our model of design as the\nconstruction of representations, we distinguish representational and\norganisational functions. The results of the present analysis are that, even if\nform-function association tendencies exist, gestures with a particular function\nmay take various forms, and particular gestural movements as regards form can\nfulfil different functions. Reconsidering these results and other research on\ngesture, we formulate the assumption that, if formal characteristics do not\nallow differentiating functional gestures in collaboration, context-dependent,\nsemantic characteristics may be more appropriate. We also envision the\npossibility that closer inspection of the data reveal tendencies of another\nnature.\n", "versions": [{"version": "v1", "created": "Wed, 13 Oct 2010 17:09:32 GMT"}], "update_date": "2010-10-14", "authors_parsed": [["Visser", "Willemien", "", "LTCI"]]}, {"id": "1010.3325", "submitter": "Arun Dua Dr.", "authors": "Arun Dua", "title": "Wireless Sensor Network based Future of Telecom Applications", "comments": "8 pages,4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A system and method for enabling human beings to communicate by way of their\nmonitored brain activity. The brain activity of an individual is monitored and\ntransmitted to a remote location (e.g. by satellite). At the remote location,\nthe monitored brain activity is compared with pre-recorded normalized brain\nactivity curves, waveforms, or patterns to determine if a match or substantial\nmatch is found. If such a match is found, then the computer at the remote\nlocation determines that the individual was attempting to communicate the word,\nphrase, or thought corresponding to the matched stored normalized signal.\n", "versions": [{"version": "v1", "created": "Sat, 16 Oct 2010 06:16:08 GMT"}], "update_date": "2010-10-19", "authors_parsed": [["Dua", "Arun", ""]]}, {"id": "1010.4934", "submitter": "Jaros{\\l}aw Miszczak", "authors": "Jaros{\\l}aw Adam Miszczak, Izabela Sobota-Miszczak", "title": "Design-on-demand or how to create a target-oriented social web-site", "comments": "12 pages, no figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe an informal methodology for developing on-line applications,\nwhich is, to some extent, complementary to the Web 2.0 aspects of web\ndevelopment. The presented methodology is suitable for developing low-cost and\nnon-cost web sites targeted at medium-sized communities. We present basic\nbuilding blocks used in the described strategy. To achieve a better\nunderstanding of the discussed concepts we comment on their application during\nthe realization of two web projects. We focus on the role of community-driven\ndevelopment, which is crucial for projects of the discussed type.\n", "versions": [{"version": "v1", "created": "Sun, 24 Oct 2010 07:04:24 GMT"}], "update_date": "2010-10-26", "authors_parsed": [["Miszczak", "Jarosław Adam", ""], ["Sobota-Miszczak", "Izabela", ""]]}, {"id": "1010.5854", "submitter": "Shahrukh Khalid Mr", "authors": "Shahrukh Khalid, Adnan Ali Khan", "title": "An Alternative Approach to Data Acquisition Using Keyboard Emulation\n  Technique", "comments": "4 pages, 7 figures, conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  A number of data acquisition systems depend on human interface to access\ncomputer for measuring, processing and analyzing data and to prepare it for\npresentation and storage. Data acquisition software is installed on the\ncomputer and all intended operations are performed manually. The data\nacquisition software requires user intervention for operations like selection\nof measurement setup, acquisition and storage of data to computer. The duty of\nusers becomes laborious if the data acquisition process lasts for a long\nduration and requires continuous repetition of steps. An appropriate solution\nto overcome such problem is to replace the physical operator with a virtual\nuser. This software generated simulated user sits at the data acquisition\nprocess through out and automate all the intended steps of data acquisition.\nThis paper presents a new approach for data acquisition by using keyboard\nemulation technique. A keyboard emulation software is developed which runs\nbeside the main data acquisition software and acts as a virtual user. All the\noperations which require user interface are performed through fully automated\ncomputer program. The developed software/system is executed in a real time\nenvironment and the functionality of the software is verified. In the end,\npotential application areas of the designed keyboard emulation software are\nexplored.\n", "versions": [{"version": "v1", "created": "Thu, 28 Oct 2010 04:10:40 GMT"}, {"version": "v2", "created": "Fri, 29 Oct 2010 09:54:47 GMT"}], "update_date": "2010-11-01", "authors_parsed": [["Khalid", "Shahrukh", ""], ["Khan", "Adnan Ali", ""]]}]