[{"id": "0909.0067", "submitter": "Juan L. Varona", "authors": "L. D. Abreu, \\'O. Ciaurri and J. L. Varona", "title": "Bilinear biorthogonal expansions and the Dunkl kernel on the real line", "comments": "16 pages", "journal-ref": "Expo. Math. 30 (2012), 32-48", "doi": null, "report-no": null, "categories": "math.FA cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study an extension of the classical Paley-Wiener space structure, which is\nbased on bilinear expansions of integral kernels into biorthogonal sequences of\nfunctions. The structure includes both sampling expansions and Fourier-Neumann\ntype series as special cases, and it also provides a bilinear expansion for the\nDunkl kernel (in the rank 1 case) which is a Dunkl analogue of Gegenbauer's\nexpansion of the plane wave and the corresponding sampling expansions. In fact,\nwe show how to derive sampling and Fourier-Neumann type expansions from the\nresults related to the bilinear expansion for the Dunkl kernel.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2009 01:33:42 GMT"}, {"version": "v2", "created": "Mon, 5 Nov 2012 01:16:18 GMT"}, {"version": "v3", "created": "Tue, 6 Nov 2012 01:47:14 GMT"}], "update_date": "2012-11-07", "authors_parsed": [["Abreu", "L. D.", ""], ["Ciaurri", "Ó.", ""], ["Varona", "J. L.", ""]]}, {"id": "0909.0105", "submitter": "Zachary Chance", "authors": "Zachary Chance and David J. Love", "title": "Concatenated Coding for the AWGN Channel with Noisy Feedback", "comments": "Accepted to IEEE Trans. on Information Theory, January 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of open-loop coding can be easily extended to a closed-loop\nconcatenated code if the channel has access to feedback. This can be done by\nintroducing a feedback transmission scheme as an inner code. In this paper,\nthis process is investigated for the case when a linear feedback scheme is\nimplemented as an inner code and, in particular, over an additive white\nGaussian noise (AWGN) channel with noisy feedback. To begin, we look to derive\nan optimal linear feedback scheme by optimizing over the received\nsignal-to-noise ratio. From this optimization, an asymptotically optimal linear\nfeedback scheme is produced and compared to other well-known schemes. Then, the\nlinear feedback scheme is implemented as an inner code to a concatenated code\nover the AWGN channel with noisy feedback. This code shows improvements not\nonly in error exponent bounds, but also in bit-error-rate and frame-error-rate.\nIt is also shown that the if the concatenated code has total blocklength L and\nthe inner code has blocklength, N, the inner code blocklength should scale as N\n= O(C/R), where C is the capacity of the channel and R is the rate of the\nconcatenated code. Simulations with low density parity check (LDPC) and turbo\ncodes are provided to display practical applications and their error rate\nbenefits.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2009 14:47:57 GMT"}, {"version": "v2", "created": "Thu, 3 Sep 2009 18:02:42 GMT"}, {"version": "v3", "created": "Fri, 20 Nov 2009 21:08:34 GMT"}, {"version": "v4", "created": "Thu, 17 Jun 2010 19:13:38 GMT"}, {"version": "v5", "created": "Mon, 21 Feb 2011 21:48:58 GMT"}], "update_date": "2011-02-23", "authors_parsed": [["Chance", "Zachary", ""], ["Love", "David J.", ""]]}, {"id": "0909.0206", "submitter": "Somantika Datta", "authors": "Somantika Datta, Stephen Howard, Douglas Cochran", "title": "Geometry of the Welch Bounds", "comments": "changes from previous version include: correction of typos,\n  additional references added, new Example 3.3", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A geometric perspective involving Grammian and frame operators is used to\nderive the entire family of Welch bounds. This perspective unifies a number of\nobservations that have been made regarding tightness of the bounds and their\nconnections to symmetric k-tensors, tight frames, homogeneous polynomials, and\nt-designs. In particular. a connection has been drawn between sampling of\nhomogeneous polynomials and frames of symmetric k-tensors. It is also shown\nthat tightness of the bounds requires tight frames. The lack of tight frames in\nsymmetric k-tensors in many cases, however, leads to consideration of sets that\ncome as close as possible to attaining the bounds. The geometric derivation is\nthen extended in the setting of generalized or continuous frames. The Welch\nbounds for finite sets and countably infinite sets become special cases of this\ngeneral setting.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2009 15:30:31 GMT"}, {"version": "v2", "created": "Wed, 30 May 2012 01:13:11 GMT"}], "update_date": "2012-05-31", "authors_parsed": [["Datta", "Somantika", ""], ["Howard", "Stephen", ""], ["Cochran", "Douglas", ""]]}, {"id": "0909.0247", "submitter": "R Doomun", "authors": "Abu Shamim Mohammad Arif, Asif Mahamud, Rashedul Islam", "title": "An Enhanced Static Data Compression Scheme Of Bengali Short Message", "comments": "7 Pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS 2009, ISSN 1947 5500, Impact factor 0.423\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 4, No. 1 & 2, August 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper concerns a modified approach of compressing Short Bengali Text\nMessage for small devices. The prime objective of this research technique is to\nestablish a low complexity compression scheme suitable for small devices having\nsmall memory and relatively lower processing speed. The basic aim is not to\ncompress text of any size up to its maximum level without having any constraint\non space and time, rather than the main target is to compress short messages up\nto an optimal level which needs minimum space, consume less time and the\nprocessor requirement is lower. We have implemented Character Masking,\nDictionary Matching, Associative rule of data mining and Hyphenation algorithm\nfor syllable based compression in hierarchical steps to achieve low complexity\nlossless compression of text message for any mobile devices. The scheme to\nchoose the diagrams are performed on the basis of extensive statistical model\nand the static Huffman coding is done through the same context.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2009 19:54:57 GMT"}, {"version": "v2", "created": "Tue, 8 Sep 2009 02:47:43 GMT"}], "update_date": "2009-09-08", "authors_parsed": [["Arif", "Abu Shamim Mohammad", ""], ["Mahamud", "Asif", ""], ["Islam", "Rashedul", ""]]}, {"id": "0909.0251", "submitter": "Kazi  Huq", "authors": "Kazi Mohammed Saidul Huq, Miguel Bergano, Atilio Gameiro, Md. Taslim\n  Arefin", "title": "Channel Equalization in Digital Transmission", "comments": "not published", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 4, No. 1 & 2, August 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Channel equalization is the process of reducing amplitude, frequency and\nphase distortion in a radio channel with the intent of improving transmission\nperformance. Different types of equalizers, their applications and some\npractical example is given. Especially, in the digital communication scenario\nhow equalization works is shown. This paper presents a vivid description on\nchannel equalization in digital transmission system.\n", "versions": [{"version": "v1", "created": "Tue, 1 Sep 2009 19:26:44 GMT"}, {"version": "v2", "created": "Fri, 30 Apr 2010 19:44:27 GMT"}], "update_date": "2020-01-21", "authors_parsed": [["Huq", "Kazi Mohammed Saidul", ""], ["Bergano", "Miguel", ""], ["Gameiro", "Atilio", ""], ["Arefin", "Md. Taslim", ""]]}, {"id": "0909.0400", "submitter": "Noam Shental", "authors": "Noam Shental, Amnon Amir and Or Zuk", "title": "Rare-Allele Detection Using Compressed Se(que)nsing", "comments": "29 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.IT cs.LG math.IT q-bio.QM stat.AP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Detection of rare variants by resequencing is important for the\nidentification of individuals carrying disease variants. Rapid sequencing by\nnew technologies enables low-cost resequencing of target regions, although it\nis still prohibitive to test more than a few individuals. In order to improve\ncost trade-offs, it has recently been suggested to apply pooling designs which\nenable the detection of carriers of rare alleles in groups of individuals.\nHowever, this was shown to hold only for a relatively low number of individuals\nin a pool, and requires the design of pooling schemes for particular cases.\n  We propose a novel pooling design, based on a compressed sensing approach,\nwhich is both general, simple and efficient. We model the experimental\nprocedure and show via computer simulations that it enables the recovery of\nrare allele carriers out of larger groups than were possible before, especially\nin situations where high coverage is obtained for each individual.\n  Our approach can also be combined with barcoding techniques to enhance\nperformance and provide a feasible solution based on current resequencing\ncosts. For example, when targeting a small enough genomic region (~100\nbase-pairs) and using only ~10 sequencing lanes and ~10 distinct barcodes, one\ncan recover the identity of 4 rare allele carriers out of a population of over\n4000 individuals.\n", "versions": [{"version": "v1", "created": "Wed, 2 Sep 2009 13:25:48 GMT"}], "update_date": "2009-09-03", "authors_parsed": [["Shental", "Noam", ""], ["Amir", "Amnon", ""], ["Zuk", "Or", ""]]}, {"id": "0909.0553", "submitter": "Jie Luo", "authors": "Jie Luo, Anthony Ephremides", "title": "A New Approach to Random Access: Reliable Communication and Reliable\n  Collision Detection", "comments": "submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2173705", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper applies Information Theoretic analysis to packet-based random\nmultiple access communication systems. A new channel coding approach is\nproposed for coding within each data packet with built-in support for bursty\ntraffic properties, such as message underflow, and for random access\nproperties, such as packet collision detection. The coding approach does not\nrequire joint communication rate determination either among the transmitters or\nbetween the transmitters and the receiver. Its performance limitation is\ncharacterized by an achievable region defined in terms of communication rates,\nsuch that reliable packet recovery is supported for all rates inside the region\nand reliable collision detection is supported for all rates outside the region.\nFor random access communication over a discrete-time memoryless channel, it is\nshown that the achievable rate region of the introduced coding approach equals\nthe Shannon information rate region without a convex hull operation. Further\nconnections between the achievable rate region and the Shannon information rate\nregion are developed and explained.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2009 00:36:58 GMT"}, {"version": "v2", "created": "Fri, 13 Aug 2010 21:40:49 GMT"}, {"version": "v3", "created": "Mon, 9 May 2011 05:26:16 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Luo", "Jie", ""], ["Ephremides", "Anthony", ""]]}, {"id": "0909.0555", "submitter": "Boyu Li", "authors": "Boyu Li and Ender Ayanoglu", "title": "Reduced Complexity Sphere Decoding", "comments": "accepted to Journal. arXiv admin note: substantial text overlap with\n  arXiv:1009.3514", "journal-ref": "Wiley WCMC, Vol. 11, No. 12, pages 1518-1527, Dec. 2011", "doi": "10.1002/wcm.1216", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Multiple-Input Multiple-Output (MIMO) systems, Sphere Decoding (SD) can\nachieve performance equivalent to full search Maximum Likelihood (ML) decoding,\nwith reduced complexity. Several researchers reported techniques that reduce\nthe complexity of SD further. In this paper, a new technique is introduced\nwhich decreases the computational complexity of SD substantially, without\nsacrificing performance. The reduction is accomplished by deconstructing the\ndecoding metric to decrease the number of computations and exploiting the\nstructure of a lattice representation. Furthermore, an application of SD,\nemploying a proposed smart implementation with very low computational\ncomplexity is introduced. This application calculates the soft bit metrics of a\nbit-interleaved convolutional-coded MIMO system in an efficient manner. Based\non the reduced complexity SD, the proposed smart implementation employs the\ninitial radius acquired by Zero-Forcing Decision Feedback Equalization (ZF-DFE)\nwhich ensures no empty spheres. Other than that, a technique of a particular\ndata structure is also incorporated to efficiently reduce the number of\nexecutions carried out by SD. Simulation results show that these approaches\nachieve substantial gains in terms of the computational complexity for both\nuncoded and coded MIMO systems.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2009 00:46:16 GMT"}, {"version": "v2", "created": "Mon, 15 Mar 2010 23:50:42 GMT"}, {"version": "v3", "created": "Thu, 15 Sep 2011 08:03:57 GMT"}, {"version": "v4", "created": "Mon, 30 Jan 2012 22:02:05 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Li", "Boyu", ""], ["Ayanoglu", "Ender", ""]]}, {"id": "0909.0588", "submitter": "Jos\\'e Ignacio Iglesias Curto", "authors": "Jose Ignacio Iglesias Curto, Uwe Helmke", "title": "Receding horizon decoding of convolutional codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Decoding of convolutional codes poses a significant challenge for coding\ntheory. Classical methods, based on e.g. Viterbi decoding, suffer from being\ncomputationally expensive and are restricted therefore to codes of small\ncomplexity. Based on analogies with model predictive optimal control, we\npropose a new iterative method for convolutional decoding that is cheaper to\nimplement than established algorithms, while still offering significant error\ncorrection capabilities. The algorithm is particularly well-suited for decoding\nspecial types of convolutional codes, such as e.g. cyclic convolutional codes.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2009 08:27:59 GMT"}], "update_date": "2009-09-04", "authors_parsed": [["Curto", "Jose Ignacio Iglesias", ""], ["Helmke", "Uwe", ""]]}, {"id": "0909.0635", "submitter": "Fabrice Rossi", "authors": "Michel Verleysen (DICE - MLG), Fabrice Rossi (LTCI), Damien\n  Fran\\c{c}ois (CESAME)", "title": "Advances in Feature Selection with Mutual Information", "comments": null, "journal-ref": "Similarity-Based Clustering, Villmann, Th.; Biehl, M.; Hammer, B.;\n  Verleysen, M. (Ed.) (2009) 52-69", "doi": "10.1007/978-3-642-01805-3_4", "report-no": null, "categories": "cs.LG cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The selection of features that are relevant for a prediction or\nclassification problem is an important problem in many domains involving\nhigh-dimensional data. Selecting features helps fighting the curse of\ndimensionality, improving the performances of prediction or classification\nmethods, and interpreting the application. In a nonlinear context, the mutual\ninformation is widely used as relevance criterion for features and sets of\nfeatures. Nevertheless, it suffers from at least three major limitations:\nmutual information estimators depend on smoothing parameters, there is no\ntheoretically justified stopping criterion in the feature selection greedy\nprocedure, and the estimation itself suffers from the curse of dimensionality.\nThis chapter shows how to deal with these problems. The two first ones are\naddressed by using resampling techniques that provide a statistical basis to\nselect the estimator parameters and to stop the search procedure. The third one\nis addressed by modifying the mutual information criterion into a measure of\nhow features are complementary (and not only informative) for the problem at\nhand.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2009 12:04:57 GMT"}], "update_date": "2009-09-04", "authors_parsed": [["Verleysen", "Michel", "", "DICE - MLG"], ["Rossi", "Fabrice", "", "LTCI"], ["François", "Damien", "", "CESAME"]]}, {"id": "0909.0641", "submitter": "Oliver Johnson", "authors": "Oliver Johnson and Yaming Yu", "title": "Monotonicity, thinning and discrete versions of the Entropy Power\n  Inequality", "comments": "9 pages (revised to take account of referees' comments)", "journal-ref": "IEEE Transactions on Information Theory, Vol 56/11, 2010, pages\n  5387-5395", "doi": "10.1109/TIT.2010.2070570", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the entropy of sums of independent discrete random variables, in\nanalogy with Shannon's Entropy Power Inequality, where equality holds for\nnormals. In our case, infinite divisibility suggests that equality should hold\nfor Poisson variables. We show that some natural analogues of the Entropy Power\nInequality do not in fact hold, but propose an alternative formulation which\ndoes always hold. The key to many proofs of Shannon's Entropy Power Inequality\nis the behaviour of entropy on scaling of continuous random variables. We\nbelieve that R\\'{e}nyi's operation of thinning discrete random variables plays\na similar role to scaling, and give a sharp bound on how the entropy of ultra\nlog-concave random variables behaves on thinning. In the spirit of the\nmonotonicity results established by Artstein, Ball, Barthe and Naor, we prove a\nstronger version of concavity of entropy, which implies a strengthened form of\nour discrete Entropy Power Inequality.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2009 16:22:01 GMT"}, {"version": "v2", "created": "Thu, 15 Jul 2010 10:27:00 GMT"}], "update_date": "2010-10-21", "authors_parsed": [["Johnson", "Oliver", ""], ["Yu", "Yaming", ""]]}, {"id": "0909.0704", "submitter": "Lav Varshney", "authors": "Ha Q. Nguyen, Lav R. Varshney, and Vivek K Goyal", "title": "Concentric Permutation Source Codes", "comments": null, "journal-ref": "IEEE Transactions on Communications, vol. 58, no. 11, pp.\n  3154-3164, November 2010", "doi": "10.1109/TCOMM.2010.101210.090535", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Permutation codes are a class of structured vector quantizers with a\ncomputationally-simple encoding procedure based on sorting the scalar\ncomponents. Using a codebook comprising several permutation codes as subcodes\npreserves the simplicity of encoding while increasing the number of\nrate-distortion operating points, improving the convex hull of operating\npoints, and increasing design complexity. We show that when the subcodes are\ndesigned with the same composition, optimization of the codebook reduces to a\nlower-dimensional vector quantizer design within a single cone. Heuristics for\nreducing design complexity are presented, including an optimization of the rate\nallocation in a shape-gain vector quantizer with gain-dependent wrapped\nspherical shape codebook.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2009 16:33:18 GMT"}, {"version": "v2", "created": "Sat, 19 Sep 2009 21:32:37 GMT"}, {"version": "v3", "created": "Wed, 14 Apr 2010 01:10:13 GMT"}, {"version": "v4", "created": "Wed, 23 Jun 2010 19:19:31 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Nguyen", "Ha Q.", ""], ["Varshney", "Lav R.", ""], ["Goyal", "Vivek K", ""]]}, {"id": "0909.0760", "submitter": "Antonio Marques", "authors": "Antonio G. Marques, Georgios B. Giannakis, Javier Ramos", "title": "Optimizing Orthogonal Multiple Access based on Quantized Channel State\n  Information", "comments": "30 pages, 6 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The performance of systems where multiple users communicate over wireless\nfading links benefits from channel-adaptive allocation of the available\nresources. Different from most existing approaches that allocate resources\nbased on perfect channel state information, this work optimizes channel\nscheduling along with per user rate and power loadings over orthogonal fading\nchannels, when both terminals and scheduler rely on quantized channel state\ninformation. Channel-adaptive policies are designed to optimize an average\ntransmit-performance criterion subject to average quality of service\nrequirements. While the resultant optimal policy per fading realization shows\nthat the individual rate and power loadings can be obtained separately for each\nuser, the optimal scheduling is slightly more complicated. Specifically, per\nfading realization each channel is allocated either to a single (winner) user,\nor, to a small group of winner users whose percentage of shared resources is\nfound by solving a linear program. A single scheduling scheme combining both\nalternatives becomes possible by smoothing the original disjoint scheme. The\nsmooth scheduling is asymptotically optimal and incurs reduced computational\ncomplexity. Different alternatives to obtain the Lagrange multipliers required\nto implement the channel-adaptive policies are proposed, including stochastic\niterations that are provably convergent and do not require knowledge of the\nchannel distribution. The development of the optimal channel-adaptive\nallocation is complemented with discussions on the overhead required to\nimplement the novel policies.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2009 20:54:43 GMT"}], "update_date": "2009-09-07", "authors_parsed": [["Marques", "Antonio G.", ""], ["Giannakis", "Georgios B.", ""], ["Ramos", "Javier", ""]]}, {"id": "0909.0777", "submitter": "Arian Maleki", "authors": "Arian Maleki, David L. Donoho", "title": "Optimally Tuned Iterative Reconstruction Algorithms for Compressed\n  Sensing", "comments": "12 pages, 14 figures", "journal-ref": null, "doi": "10.1109/JSTSP.2009.2039176", "report-no": null, "categories": "cs.NA cs.IT cs.MS math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We conducted an extensive computational experiment, lasting multiple\nCPU-years, to optimally select parameters for two important classes of\nalgorithms for finding sparse solutions of underdetermined systems of linear\nequations. We make the optimally tuned implementations available at {\\tt\nsparselab.stanford.edu}; they run `out of the box' with no user tuning: it is\nnot necessary to select thresholds or know the likely degree of sparsity. Our\nclass of algorithms includes iterative hard and soft thresholding with or\nwithout relaxation, as well as CoSaMP, subspace pursuit and some natural\nextensions. As a result, our optimally tuned algorithms dominate such\nproposals. Our notion of optimality is defined in terms of phase transitions,\ni.e. we maximize the number of nonzeros at which the algorithm can successfully\noperate. We show that the phase transition is a well-defined quantity with our\nsuite of random underdetermined linear systems. Our tuning gives the highest\ntransition possible within each class of algorithms.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2009 22:26:32 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Maleki", "Arian", ""], ["Donoho", "David L.", ""]]}, {"id": "0909.0801", "submitter": "Marcus Hutter", "authors": "Joel Veness and Kee Siong Ng and Marcus Hutter and William Uther and\n  David Silver", "title": "A Monte Carlo AIXI Approximation", "comments": "51 LaTeX pages, 11 figures, 6 tables, 4 algorithms", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.IT cs.LG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces a principled approach for the design of a scalable\ngeneral reinforcement learning agent. Our approach is based on a direct\napproximation of AIXI, a Bayesian optimality notion for general reinforcement\nlearning agents. Previously, it has been unclear whether the theory of AIXI\ncould motivate the design of practical algorithms. We answer this hitherto open\nquestion in the affirmative, by providing the first computationally feasible\napproximation to the AIXI agent. To develop our approximation, we introduce a\nnew Monte-Carlo Tree Search algorithm along with an agent-specific extension to\nthe Context Tree Weighting algorithm. Empirically, we present a set of\nencouraging results on a variety of stochastic and partially observable\ndomains. We conclude by proposing a number of directions for future research.\n", "versions": [{"version": "v1", "created": "Fri, 4 Sep 2009 03:13:58 GMT"}, {"version": "v2", "created": "Sun, 26 Dec 2010 11:01:10 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Veness", "Joel", ""], ["Ng", "Kee Siong", ""], ["Hutter", "Marcus", ""], ["Uther", "William", ""], ["Silver", "David", ""]]}, {"id": "0909.0809", "submitter": "Dae San Kim", "authors": "Dae San Kim", "title": "An Infinite Family of Recursive Formulas Generating Power Moments of\n  Kloosterman Sums with Trace One Arguments: O(2n+1,2^r) Case", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we construct an infinite family of binary linear codes\nassociated with double cosets with respect to certain maximal parabolic\nsubgroup of the orthogonal group O(2n+1,q). Here q is a power of two. Then we\nobtain an infinite family of recursive formulas generating the odd power\nmoments of Kloosterman sums with trace one arguments in terms of the\nfrequencies of weights in the codes associated with those double cosets in\nO(2n+1,q) and in the codes associated with similar double cosets in the\nsymplectic group Sp(2n,q). This is done via Pless power moment identity and by\nutilizing the explicit expressions of exponential sums over those double cosets\nrelated to the evaluations of \"Gauss sums\" for the orthogonal group O(2n+1,q).\n", "versions": [{"version": "v1", "created": "Fri, 4 Sep 2009 04:56:31 GMT"}], "update_date": "2009-09-07", "authors_parsed": [["Kim", "Dae San", ""]]}, {"id": "0909.0811", "submitter": "Dae San Kim", "authors": "Dae San Kim", "title": "Ternary Codes Associated with O^-(2n,q) and Power Moments of Kloosterman\n  Sums with Square Arguments", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we construct three ternary linear codes associated with the\northogonal group O^-(2,q) and the special orthogonal groups SO^-(2,q) and\nSO^-(4,q). Here q is a power of three. Then we obtain recursive formulas for\nthe power moments of Kloosterman sums with square arguments and for the even\npower moments of those in terms of the frequencies of weights in the codes.\nThis is done via Pless power moment identity and by utilizing the explicit\nexpressions of \"Gauss sums\" for the orthogonal and special orthogonal groups\nO^-(2n,q) and SO^-(2n,q).\n", "versions": [{"version": "v1", "created": "Fri, 4 Sep 2009 05:18:10 GMT"}], "update_date": "2009-09-07", "authors_parsed": [["Kim", "Dae San", ""]]}, {"id": "0909.0996", "submitter": "Ravi Teja Sukhavasi", "authors": "Ravi Teja Sukhavasi, Babak Hassibi", "title": "The Kalman Like Particle Filter : Optimal Estimation With Quantized\n  Innovations/Measurements", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of optimal estimation and control of linear systems\nusing quantized measurements, with a focus on applications over sensor\nnetworks. We show that the state conditioned on a causal quantization of the\nmeasurements can be expressed as the sum of a Gaussian random vector and a\ncertain truncated Gaussian vector. This structure bears close resemblance to\nthe full information Kalman filter and so allows us to effectively combine the\nKalman structure with a particle filter to recursively compute the state\nestimate. We call the resulting filter the Kalman like particle filter (KLPF)\nand observe that it delivers close to optimal performance using far fewer\nparticles than that of a particle filter directly applied to the original\nproblem. We show that the conditional state density follows a, so called,\ngeneralized closed skew-normal (GCSN) distribution. We further show that for\nsuch systems the classical separation property between control and estimation\nholds and that the certainty equivalent control law is LQG optimal.\n", "versions": [{"version": "v1", "created": "Sat, 5 Sep 2009 04:22:42 GMT"}, {"version": "v2", "created": "Wed, 5 Jan 2011 07:32:45 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Sukhavasi", "Ravi Teja", ""], ["Hassibi", "Babak", ""]]}, {"id": "0909.1011", "submitter": "Vaneet Aggarwal", "authors": "Vaneet Aggarwal and Ashutosh Sabharwal", "title": "Bits About the Channel: Multi-round Protocols for Two-way Fading\n  Channels", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": "IEEE Transactions on Information Theory, vol.57, no.6,\n  pp.3352,3370, June 2011", "doi": "10.1109/TIT.2011.2137090", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most communication systems use some form of feedback, often related to\nchannel state information. In this paper, we study diversity multiplexing\ntradeoff for both FDD and TDD systems, when both receiver and transmitter\nknowledge about the channel is noisy and potentially mismatched. For FDD\nsystems, we first extend the achievable tradeoff region for 1.5 rounds of\nmessage passing to get higher diversity compared to the best known scheme, in\nthe regime of higher multiplexing gains. We then break the mold of all current\nchannel state based protocols by using multiple rounds of conferencing to\nextract more bits about the actual channel. This iterative refinement of the\nchannel increases the diversity order with every round of communication. The\nprotocols are on-demand in nature, using high powers for training and feedback\nonly when the channel is in poor states. The key result is that the diversity\nmultiplexing tradeoff with perfect training and K levels of perfect feedback\ncan be achieved, even when there are errors in training the receiver and errors\nin the feedback link, with a multi-round protocol which has K rounds of\ntraining and K-1 rounds of binary feedback. The above result can be viewed as a\ngeneralization of Zheng and Tse, and Aggarwal and Sabharwal, where the result\nwas shown to hold for K=1 and K=2 respectively. For TDD systems, we also\ndevelop new achievable strategies with multiple rounds of communication between\nthe transmitter and the receiver, which use the reciprocity of the forward and\nthe feedback channel. The multi-round TDD protocol achieves a\ndiversity-multiplexing tradeoff which uniformly dominates its FDD counterparts,\nwhere no channel reciprocity is available.\n", "versions": [{"version": "v1", "created": "Sat, 5 Sep 2009 09:35:25 GMT"}], "update_date": "2014-07-15", "authors_parsed": [["Aggarwal", "Vaneet", ""], ["Sabharwal", "Ashutosh", ""]]}, {"id": "0909.1115", "submitter": "Yan Zhu", "authors": "Yan Zhu and Dongning Guo", "title": "Capacity Region of Layered Erasure One-sided Interference Channels\n  without CSIT", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a layered erasure interference channel model, which is a\nsimplification of the Gaussian interference channel with fading using the\ndeterministic model approach. In particular, the capacity region of the layered\nerasure one-sided interference channel is completely determined, assuming that\nthe channel state information (CSI) is known to the receivers, but there is no\nCSI at transmitters (CSIT). The result holds for arbitrary fading statistics.\nPrevious results of Aggarwal, Sankar, Calderbank and Poor on the capacity\nregion or sum capacity under several interference configurations are shown to\nbe special cases of the capacity region shown in this paper.\n", "versions": [{"version": "v1", "created": "Sun, 6 Sep 2009 21:37:21 GMT"}], "update_date": "2009-09-08", "authors_parsed": [["Zhu", "Yan", ""], ["Guo", "Dongning", ""]]}, {"id": "0909.1153", "submitter": "Dae San Kim", "authors": "Dae San Kim", "title": "Recursive formulas generating power moments of multi-dimensional\n  Kloosterman sums and $m$-multiple power moments of Kloosterman sums", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we construct two binary linear codes associated with\nmulti-dimensional and $m -$multiple power Kloosterman sums (for any fixed $m$)\nover the finite field $\\mathbb{F}_{q}$. Here $q$ is a power of two. The former\ncodes are dual to a subcode of the binary hyper-Kloosterman code. Then we\nobtain two recursive formulas for the power moments of multi-dimensional\nKloosterman sums and for the $m$-multiple power moments of Kloosterman sums in\nterms of the frequencies of weights in the respective codes. This is done via\nPless power moment identity and yields, in the case of power moments of\nmulti-dimensional Kloosterman sums, much simpler recursive formulas than those\nassociated with finite special linear groups obtained previously.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2009 07:00:11 GMT"}], "update_date": "2009-09-08", "authors_parsed": [["Kim", "Dae San", ""]]}, {"id": "0909.1156", "submitter": "Dae San Kim", "authors": "Dae San Kim", "title": "Ternary Codes Associated with $O(3,3^r)$ and Power Moments of\n  Kloosterman Sums with Trace Nonzero Square Arguments", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we construct two ternary linear codes $C(SO(3,q))$ and\n$C(O(3,q))$, respectively associated with the orthogonal groups $SO(3,q)$ and\n$O(3,q)$. Here $q$ is a power of three. Then we obtain two recursive formulas\nfor the power moments of Kloosterman sums with $``$trace nonzero square\narguments\" in terms of the frequencies of weights in the codes. This is done\nvia Pless power moment identity and by utilizing the explicit expressions of\nGauss sums for the orthogonal groups.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2009 07:35:12 GMT"}], "update_date": "2009-09-08", "authors_parsed": [["Kim", "Dae San", ""]]}, {"id": "0909.1175", "submitter": "Dae San Kim", "authors": "Dae San Kim", "title": "Infinite Families of Recursive Formulas Generating Power Moments of\n  Ternary Kloosterman Sums with Trace Nonzero Square Arguments: $O(2n+1,2^{r})$\n  Case", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we construct four infinite families of ternary linear codes\nassociated with double cosets in $O(2n+1,q)$ with respect to certain maximal\nparabolic subgroup of the special orthogonal group $SO(2n+1,q)$. Here $q$ is a\npower of three. Then we obtain two infinite families of recursive formulas, the\none generating the power moments of Kloosterman sums with $``$trace nonzero\nsquare arguments\" and the other generating the even power moments of those.\nBoth of these families are expressed in terms of the frequencies of weights in\nthe codes associated with those double cosets in $O(2n+1,q)$ and in the codes\nassociated with similar double cosets in the symplectic group $Sp(2n,q)$. This\nis done via Pless power moment identity and by utilizing the explicit\nexpressions of exponential sums over those double cosets related to the\nevaluations of $\"$Gauss sums\" for the orthogonal group $O(2n+1,q)$.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2009 09:01:10 GMT"}], "update_date": "2009-09-08", "authors_parsed": [["Kim", "Dae San", ""]]}, {"id": "0909.1178", "submitter": "Dae San Kim", "authors": "Dae San Kim", "title": "Infinite Families of Recursive Formulas Generating Power Moments of\n  Ternary Kloosterman Sums with Square Arguments Associated with\n  $O^{-}_{}(2n,q)$", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we construct eight infinite families of ternary linear codes\nassociated with double cosets with respect to certain maximal parabolic\nsubgroup of the special orthogonal group $SO^{-}(2n,q)$. Here ${q}$ is a power\nof three. Then we obtain four infinite families of recursive formulas for power\nmoments of Kloosterman sums with square arguments and four infinite families of\nrecursive formulas for even power moments of those in terms of the frequencies\nof weights in the codes. This is done via Pless power moment identity and by\nutilizing the explicit expressions of exponential sums over those double cosets\nrelated to the evaluations of $\"$Gauss sums\" for the orthogonal groups\n$O^{-}(2n,q)$.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2009 09:10:01 GMT"}], "update_date": "2009-09-08", "authors_parsed": [["Kim", "Dae San", ""]]}, {"id": "0909.1209", "submitter": "Doron Ezri", "authors": "Oded Redlich, Doron Ezri and Dov Wulich", "title": "SNR Estimation in Maximum Likelihood Decoded Spatial Multiplexing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Link adaptation is a crucial part of many modern communications systems,\nallowing the system to adapt the transmission and reception strategies to\nchanges in channel conditions. One of the fundamental components of the link\nadaptation mechanism is signal to noise ratio (SNR) estimation, measuring the\ninstantaneous (mostly post processing) SNR at the receiver. That is, the SNR at\nthe decoder input, which is an important metric for the prediction of decoder\nperformance. In linearly decoded MIMO, which is the common MIMO decoding\nstrategy, the post processing SNR is well defined. However, this is not the\ncase in optimal maximum likelihood (ML) decoding applied to spatial\nmultiplexing (SM). This gap is interesting since ML decoded SM is gaining ever\ngrowing interest in recent research and practice due to the rapid increase in\ncomputation power, and available near optimal low complexity schemes. In this\npaper we close the gap and provide SNR estimation schemes for ML decoded SM,\nwhich are based on various approximations of the \"per stream\" error\nprobability. The proposed methods are applicable for both horizonal and\nvertical decoding. Moreover, we propose a very low complexity implementation\nfor the SNR estimation mechanism employing the ML decoder itself with\nnegligible overhead.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2009 11:05:42 GMT"}], "update_date": "2009-09-08", "authors_parsed": [["Redlich", "Oded", ""], ["Ezri", "Doron", ""], ["Wulich", "Dov", ""]]}, {"id": "0909.1338", "submitter": "Keigo Hirakawa", "authors": "Keigo Hirakawa and Patrick J. Wolfe", "title": "\"Rewiring\" Filterbanks for Local Fourier Analysis: Theory and Practice", "comments": null, "journal-ref": "IEEE Transactions on Information Theory, vol. 57, pp. 5360-5374,\n  2011", "doi": "10.1109/TIT.2011.2158895", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article describes a series of new results outlining equivalences between\ncertain \"rewirings\" of filterbank system block diagrams, and the corresponding\nactions of convolution, modulation, and downsampling operators. This gives rise\nto a general framework of reverse-order and convolution subband structures in\nfilterbank transforms, which we show to be well suited to the analysis of\nfilterbank coefficients arising from subsampled or multiplexed signals. These\nresults thus provide a means to understand time-localized aliasing and\nmodulation properties of such signals and their subband\nrepresentations--notions that are notably absent from the global viewpoint\nafforded by Fourier analysis. The utility of filterbank rewirings is\ndemonstrated by the closed-form analysis of signals subject to degradations\nsuch as missing data, spatially or temporally multiplexed data acquisition, or\nsignal-dependent noise, such as are often encountered in practical signal\nprocessing applications.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2009 20:58:01 GMT"}], "update_date": "2012-10-15", "authors_parsed": [["Hirakawa", "Keigo", ""], ["Wolfe", "Patrick J.", ""]]}, {"id": "0909.1344", "submitter": "Hoon Huh", "authors": "Hoon Huh, Haralabos C. Papadopoulos, and Giuseppe Caire", "title": "Multiuser MISO Transmitter Optimization for Inter-Cell Interference\n  Mitigation", "comments": "30 pages, 10 figures, and 1 table. revised and resubmitted to IEEE\n  Transactions on Signal Processing", "journal-ref": null, "doi": "10.1109/TSP.2010.2048564", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The transmitter optimization (i.e., steering vectors and power allocation)\nfor a MISO Broadcast Channel (MISO-BC) subject to general linear constraints is\nconsidered. Such constraints include, as special cases, the sum power, the\nper-antenna or per-group-of-antennas power, and \"forbidden interference\ndirection\" constraints. We consider both the optimal dirty-paper coding and the\nsimple suboptimal linear zero-forcing beamforming strategies, and provide\nnumerically efficient algorithms that solve the problem in its most general\nform. As an application, we consider a multi-cell scenario with partial cell\ncooperation, where each cell optimizes its precoder by taking into account\ninterference constraints on specific users in adjacent cells. The effectiveness\nof the proposed methods is evaluated in a simple system scenario including two\nadjacent cells, under different fairness criteria that emphasize the bottleneck\nrole of users near the cell \"boundary\". Our results show that \"active\"\nInter-Cell Interference (ICI) mitigation outperforms the conventional \"static\"\nICI mitigation based on fractional frequency reuse.\n", "versions": [{"version": "v1", "created": "Mon, 7 Sep 2009 21:14:34 GMT"}, {"version": "v2", "created": "Tue, 2 Mar 2010 01:16:07 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Huh", "Hoon", ""], ["Papadopoulos", "Haralabos C.", ""], ["Caire", "Giuseppe", ""]]}, {"id": "0909.1426", "submitter": "Kunal Narayan Chaudhury", "authors": "Kunal N. Chaudhury", "title": "L^p boundedness of the Hilbert transform", "comments": "Notes on the L^p boundedness of the Hilbert transform", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Hilbert transform is essentially the \\textit{only} singular operator in\none dimension. This undoubtedly makes it one of the the most important linear\noperators in harmonic analysis. The Hilbert transform has had a profound\nbearing on several theoretical and physical problems across a wide range of\ndisciplines; this includes problems in Fourier convergence, complex analysis,\npotential theory, modulation theory, wavelet theory, aerofoil design,\ndispersion relations and high-energy physics, to name a few.\n  In this monograph, we revisit some of the established results concerning the\nglobal behavior of the Hilbert transform, namely that it is is weakly bounded\non $\\eL^1(\\R)$, and strongly bounded on $\\eL^p(\\R)$ for $1 < p <\\infty$, and\nprovide a self-contained derivation of the same using real-variable techniques.\n", "versions": [{"version": "v1", "created": "Tue, 8 Sep 2009 11:43:09 GMT"}, {"version": "v2", "created": "Thu, 10 Sep 2009 15:36:51 GMT"}, {"version": "v3", "created": "Fri, 11 Sep 2009 14:38:22 GMT"}, {"version": "v4", "created": "Mon, 25 Jan 2010 09:13:17 GMT"}, {"version": "v5", "created": "Fri, 29 Jan 2010 14:34:06 GMT"}, {"version": "v6", "created": "Thu, 18 Feb 2010 14:14:44 GMT"}, {"version": "v7", "created": "Tue, 2 Mar 2010 15:45:59 GMT"}, {"version": "v8", "created": "Wed, 14 Jul 2010 09:05:50 GMT"}, {"version": "v9", "created": "Tue, 2 Oct 2012 13:52:04 GMT"}], "update_date": "2012-10-03", "authors_parsed": [["Chaudhury", "Kunal N.", ""]]}, {"id": "0909.1525", "submitter": "Harshan Jagadeesh", "authors": "J. Harshan, B. Sundar Rajan, Are Hj{\\o}rungnes", "title": "Training-Embedded, Single-Symbol ML-Decodable, Distributed STBCs for\n  Relay Networks", "comments": "7 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, a special class of complex designs called Training-Embedded Complex\nOrthogonal Designs (TE-CODs) has been introduced to construct single-symbol\nMaximum Likelihood (ML) decodable (SSD) distributed space-time block codes\n(DSTBCs) for two-hop wireless relay networks using the amplify and forward\nprotocol. However, to implement DSTBCs from square TE-CODs, the overhead due to\nthe transmission of training symbols becomes prohibitively large as the number\nof relays increase. In this paper, we propose TE-Coordinate Interleaved\nOrthogonal Designs (TE-CIODs) to construct SSD DSTBCs. Exploiting the block\ndiagonal structure of TE-CIODs, we show that, the overhead due to the\ntransmission of training symbols to implement DSTBCs from TE-CIODs is smaller\nthan that for TE-CODs. We also show that DSTBCs from TE-CIODs offer higher rate\nthan those from TE-CODs for identical number of relays while maintaining the\nSSD and full-diversity properties.\n", "versions": [{"version": "v1", "created": "Tue, 8 Sep 2009 17:37:48 GMT"}, {"version": "v2", "created": "Tue, 15 Sep 2009 14:04:47 GMT"}], "update_date": "2009-09-15", "authors_parsed": [["Harshan", "J.", ""], ["Rajan", "B. Sundar", ""], ["Hjørungnes", "Are", ""]]}, {"id": "0909.1599", "submitter": "Vivek Goyal", "authors": "Ha Q. Nguyen, Vivek K Goyal, and Lav R. Varshney", "title": "Frame Permutation Quantization", "comments": "29 pages, 5 figures; detailed added to proof of Theorem 4.3 and a few\n  minor corrections", "journal-ref": "Applied and Computational Harmonic Analysis, vol 31, no, 1, pp,.\n  74-97, July 2011", "doi": "10.1016/j.acha.2010.10.003", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Frame permutation quantization (FPQ) is a new vector quantization technique\nusing finite frames. In FPQ, a vector is encoded using a permutation source\ncode to quantize its frame expansion. This means that the encoding is a partial\nordering of the frame expansion coefficients. Compared to ordinary permutation\nsource coding, FPQ produces a greater number of possible quantization rates and\na higher maximum rate. Various representations for the partitions induced by\nFPQ are presented, and reconstruction algorithms based on linear programming,\nquadratic programming, and recursive orthogonal projection are derived.\nImplementations of the linear and quadratic programming algorithms for uniform\nand Gaussian sources show performance improvements over entropy-constrained\nscalar quantization for certain combinations of vector dimension and coding\nrate. Monte Carlo evaluation of the recursive algorithm shows that mean-squared\nerror (MSE) decays as 1/M^4 for an M-element frame, which is consistent with\nprevious results on optimal decay of MSE. Reconstruction using the canonical\ndual frame is also studied, and several results relate properties of the\nanalysis frame to whether linear reconstruction techniques provide consistent\nreconstructions.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2009 01:01:52 GMT"}, {"version": "v2", "created": "Wed, 1 Sep 2010 22:23:57 GMT"}, {"version": "v3", "created": "Mon, 22 Nov 2010 19:40:33 GMT"}], "update_date": "2015-03-24", "authors_parsed": [["Nguyen", "Ha Q.", ""], ["Goyal", "Vivek K", ""], ["Varshney", "Lav R.", ""]]}, {"id": "0909.1623", "submitter": "Sudarshan Shinde", "authors": "Sudarshan Shinde", "title": "Two channel paraunitary filter banks based on linear canonical transform", "comments": "10 pages, IEEE format", "journal-ref": null, "doi": "10.1109/TSP.2010.2089681", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper a two channel paraunitary filter bank is proposed, which is\nbased on linear canonical transform, instead of discrete Fourier transform.\nInput-output relation for such a filter bank are derived in terms of polyphase\nmatrices and modulation matrices. It is shown that like conventional filter\nbanks, the LCT based paraunitary filter banks need only one filter to be\ndesigned and rest of the filters can be obtained from it. It is also shown that\nLCT based paraunitary filter banks can be designed by using conventional\npower-symmetric filter design in Fourier domain.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2009 06:57:41 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Shinde", "Sudarshan", ""]]}, {"id": "0909.1626", "submitter": "Massimiliano Sala Dr.", "authors": "Eleonora Guerrini, Emmanuela Orsini, Massimiliano Sala", "title": "Computing the distance distribution of systematic non-linear codes", "comments": null, "journal-ref": "Journal of Algebra and its Applications, 2010, vol. 9, p. 241-256", "doi": null, "report-no": null, "categories": "cs.DM cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The most important families of non-linear codes are systematic. A brute-force\ncheck is the only known method to compute their weight distribution and\ndistance distribution. On the other hand, it outputs also all closest word\npairs in the code. In the black-box complexity model, the check is optimal\namong closest-pair algorithms. In this paper we provide a Groebner basis\ntechnique to compute the weight/distance distribution of any systematic\nnon-linear code. Also our technique outputs all closest pairs. Unlike the\ncheck, our method can be extended to work on code families.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2009 05:47:23 GMT"}], "update_date": "2016-04-01", "authors_parsed": [["Guerrini", "Eleonora", ""], ["Orsini", "Emmanuela", ""], ["Sala", "Massimiliano", ""]]}, {"id": "0909.1638", "submitter": "Krishnan Prasad", "authors": "K. Prasad and B. Sundar Rajan", "title": "Single-generation Network Coding for Networks with Delay", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A single-source network is said to be \\textit{memory-free} if all of the\ninternal nodes (those except the source and the sinks) do not employ memory but\nmerely send linear combinations of the incoming symbols (received at their\nincoming edges) on their outgoing edges. Memory-free networks with delay using\nnetwork coding are forced to do inter-generation network coding, as a result of\nwhich the problem of some or all sinks requiring a large amount of memory for\ndecoding is faced. In this work, we address this problem by utilizing memory\nelements at the internal nodes of the network also, which results in the\nreduction of the number of memory elements used at the sinks. We give an\nalgorithm which employs memory at the nodes to achieve single-generation\nnetwork coding. For fixed latency, our algorithm reduces the total number of\nmemory elements used in the network to achieve single-generation network\ncoding. We also discuss the advantages of employing single-generation network\ncoding together with convolutional network-error correction codes (CNECCs) for\nnetworks with unit-delay and illustrate the performance gain of CNECCs by using\nmemory at the intermediate nodes using simulations on an example network under\na probabilistic network error model.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2009 07:09:21 GMT"}], "update_date": "2009-09-10", "authors_parsed": [["Prasad", "K.", ""], ["Rajan", "B. Sundar", ""]]}, {"id": "0909.1801", "submitter": "Vaibhav Srivastava", "authors": "Vaibhav Srivastava, Kurt Plarre, Francesco Bullo", "title": "Randomized Sensor Selection in Sequential Hypothesis Testing", "comments": "10 pages, 1 figure, Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of sensor selection for time-optimal detection of a\nhypothesis. We consider a group of sensors transmitting their observations to a\nfusion center. The fusion center considers the output of only one randomly\nchosen sensor at the time, and performs a sequential hypothesis test. We\nconsider the class of sequential tests which are easy to implement,\nasymptotically optimal, and computationally amenable. For three distinct\nperformance metrics, we show that, for a generic set of sensors and binary\nhypothesis, the fusion center needs to consider at most two sensors. We also\nshow that for the case of multiple hypothesis, the optimal policy needs at most\nas many sensors to be observed as the number of underlying hypotheses.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2009 19:56:32 GMT"}], "update_date": "2009-09-10", "authors_parsed": [["Srivastava", "Vaibhav", ""], ["Plarre", "Kurt", ""], ["Bullo", "Francesco", ""]]}, {"id": "0909.1817", "submitter": "Muryong Kim", "authors": "Muryong Kim, Sae-Young Chung", "title": "Cooperative Transmission for a Vector Gaussian Parallel Relay Network", "comments": "35 pages, 10 figures, submitted to IEEE Transactions on Information\n  Theory", "journal-ref": null, "doi": "10.1109/TIT.2011.2162162", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a parallel relay network where two relays\ncooperatively help a source transmit to a destination. We assume the source and\nthe destination nodes are equipped with multiple antennas. Three basic schemes\nand their achievable rates are studied: Decode-and-Forward (DF),\nAmplify-and-Forward (AF), and Compress-and-Forward (CF). For the DF scheme, the\nsource transmits two private signals, one for each relay, where dirty paper\ncoding (DPC) is used between the two private streams, and a common signal for\nboth relays. The relays make efficient use of the common information to\nintroduce a proper amount of correlation in the transmission to the\ndestination. We show that the DF scheme achieves the capacity under certain\nconditions. We also show that the CF scheme is asymptotically optimal in the\nhigh relay power limit, regardless of channel ranks. It turns out that the AF\nscheme also achieves the asymptotic optimality but only when the\nrelays-to-destination channel is full rank. The relative advantages of the\nthree schemes are discussed with numerical results.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2009 15:30:18 GMT"}], "update_date": "2017-01-27", "authors_parsed": [["Kim", "Muryong", ""], ["Chung", "Sae-Young", ""]]}, {"id": "0909.2009", "submitter": "Claudio Weidmann", "authors": "Claudio Weidmann and Gottfried Lechner", "title": "A Fresh Look at Coding for q-ary Symmetric Channels", "comments": "12 pages, 6 figures; revision submitted to IEEE Trans. Inform. Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies coding schemes for the $q$-ary symmetric channel based on\nbinary low-density parity-check (LDPC) codes that work for any alphabet size\n$q=2^m$, $m\\in\\mathbb{N}$, thus complementing some recently proposed\npacket-based schemes requiring large $q$. First, theoretical optimality of a\nsimple layered scheme is shown, then a practical coding scheme based on a\nsimple modification of standard binary LDPC decoding is proposed. The decoder\nis derived from first principles and using a factor-graph representation of a\nfront-end that maps $q$-ary symbols to groups of $m$ bits connected to a binary\ncode. The front-end can be processed with a complexity that is linear in\n$m=\\log_2 q$. An extrinsic information transfer chart analysis is carried out\nand used for code optimization. Finally, it is shown how the same decoder\nstructure can also be applied to a larger class of $q$-ary channels.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2009 18:17:30 GMT"}, {"version": "v2", "created": "Tue, 6 Dec 2011 15:52:39 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Weidmann", "Claudio", ""], ["Lechner", "Gottfried", ""]]}, {"id": "0909.2017", "submitter": "Laura Rebollo-Neira", "authors": "James Bowley and Laura Rebollo-Neira", "title": "Sparsity and `Something Else': An Approach to Encrypted Image Folding", "comments": "Revised manuscript- Software for implementing the Encrypted Image\n  Folding proposed in this paper is available on\n  http://www.nonlinear-approx.info/", "journal-ref": "IEEE Signal Processing Letters, Vol. 8 No 3, 189--192, 2011", "doi": "10.1109/LSP.2011.2106496", "report-no": null, "categories": "cs.CV cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A property of sparse representations in relation to their capacity for\ninformation storage is discussed. It is shown that this feature can be used for\nan application that we term Encrypted Image Folding. The proposed procedure is\nrealizable through any suitable transformation. In particular, in this paper we\nillustrate the approach by recourse to the Discrete Cosine Transform and a\ncombination of redundant Cosine and Dirac dictionaries. The main advantage of\nthe proposed technique is that both storage and encryption can be achieved\nsimultaneously using simple processing steps.\n", "versions": [{"version": "v1", "created": "Thu, 10 Sep 2009 19:21:04 GMT"}, {"version": "v2", "created": "Tue, 26 Oct 2010 14:39:05 GMT"}, {"version": "v3", "created": "Fri, 11 Feb 2011 09:54:37 GMT"}, {"version": "v4", "created": "Wed, 1 Feb 2012 22:26:15 GMT"}, {"version": "v5", "created": "Wed, 12 Sep 2012 16:56:33 GMT"}], "update_date": "2012-09-13", "authors_parsed": [["Bowley", "James", ""], ["Rebollo-Neira", "Laura", ""]]}, {"id": "0909.2074", "submitter": "V. Sreekanth Annapureddy", "authors": "V. Sreekanth Annapureddy and Venugopal V. Veeravalli", "title": "Sum Capacity of MIMO Interference Channels in the Low Interference\n  Regime", "comments": "Submitted to IEEE Transactions on Information Theory, Sept. 2009,\n  revised Oct. 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using Gaussian inputs and treating interference as noise at the receivers has\nrecently been shown to be sum capacity achieving for the two-user single-input\nsingle-output (SISO) Gaussian interference channel in a low interference\nregime, where the interference levels are below certain thresholds. In this\npaper, such a low interference regime is characterized for multiple-input\nmultiple-output (MIMO) Gaussian interference channels. Conditions are provided\non the direct and cross channel gain matrices under which using Gaussian inputs\nand treating interference as noise at the receivers is sum capacity achieving.\nFor the special cases of the symmetric multiple-input single-output (MISO) and\nsingle-input multiple-output (SIMO) Gaussian interference channels, more\nexplicit expressions for the low interference regime are derived. In\nparticular, the threshold on the interference levels that characterize low\ninterference regime is related to the input SNR and the angle between the\ndirect and cross channel gain vectors. It is shown that the low interference\nregime can be quite significant for MIMO interference channels, with the low\ninterference threshold being at least as large as the sine of the angle between\nthe direct and cross channel gain vectors for the MISO and SIMO cases.\n", "versions": [{"version": "v1", "created": "Fri, 11 Sep 2009 01:28:52 GMT"}, {"version": "v2", "created": "Fri, 22 Oct 2010 18:57:21 GMT"}], "update_date": "2010-10-25", "authors_parsed": [["Annapureddy", "V. Sreekanth", ""], ["Veeravalli", "Venugopal V.", ""]]}, {"id": "0909.2234", "submitter": "Jayakrishnan Unnikrishnan", "authors": "Jayakrishnan Unnikrishnan, Dayu Huang, Sean Meyn, Amit Surana and\n  Venugopal Veeravalli", "title": "Universal and Composite Hypothesis Testing via Mismatched Divergence", "comments": "Accepted to IEEE Transactions on Information Theory, July 2010", "journal-ref": null, "doi": "10.1109/TIT.2011.2104670", "report-no": null, "categories": "cs.IT cs.LG math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the universal hypothesis testing problem, where the goal is to decide\nbetween the known null hypothesis distribution and some other unknown\ndistribution, Hoeffding proposed a universal test in the nineteen sixties.\nHoeffding's universal test statistic can be written in terms of\nKullback-Leibler (K-L) divergence between the empirical distribution of the\nobservations and the null hypothesis distribution. In this paper a modification\nof Hoeffding's test is considered based on a relaxation of the K-L divergence\ntest statistic, referred to as the mismatched divergence. The resulting\nmismatched test is shown to be a generalized likelihood-ratio test (GLRT) for\nthe case where the alternate distribution lies in a parametric family of the\ndistributions characterized by a finite dimensional parameter, i.e., it is a\nsolution to the corresponding composite hypothesis testing problem. For certain\nchoices of the alternate distribution, it is shown that both the Hoeffding test\nand the mismatched test have the same asymptotic performance in terms of error\nexponents. A consequence of this result is that the GLRT is optimal in\ndifferentiating a particular distribution from others in an exponential family.\nIt is also shown that the mismatched test has a significant advantage over the\nHoeffding test in terms of finite sample size performance. This advantage is\ndue to the difference in the asymptotic variances of the two test statistics\nunder the null hypothesis. In particular, the variance of the K-L divergence\ngrows linearly with the alphabet size, making the test impractical for\napplications involving large alphabet distributions. The variance of the\nmismatched divergence on the other hand grows linearly with the dimension of\nthe parameter space, and can hence be controlled through a prudent choice of\nthe function class defining the mismatched divergence.\n", "versions": [{"version": "v1", "created": "Fri, 11 Sep 2009 18:35:52 GMT"}, {"version": "v2", "created": "Wed, 28 Apr 2010 16:49:01 GMT"}, {"version": "v3", "created": "Thu, 9 Sep 2010 06:56:44 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Unnikrishnan", "Jayakrishnan", ""], ["Huang", "Dayu", ""], ["Meyn", "Sean", ""], ["Surana", "Amit", ""], ["Veeravalli", "Venugopal", ""]]}, {"id": "0909.2292", "submitter": "Wei E.I. Sha", "authors": "Xiao Z. Wang and Wei E.I. Sha", "title": "Random Sampling Using Shannon Interpolation and Poisson Summation\n  Formulae", "comments": "This is a preprint version of research report, which may submit to\n  some conference or journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CE math.IT math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This report mainly focused on the basic concepts and the recovery methods for\nthe random sampling. The recovery methods involve the orthogonal matching\npursuit algorithm and the gradient-based total variation strategy. In\nparticular, a fast and efficient observation matrix filling technique was\nimplemented by the classic Shannon interpolation and Poisson summation\nformulae. The numerical results for the trigonometric signal, the\nGaussian-modulated sinusoidal pulse, and the square wave were demonstrated and\ndiscussed. The work may give some help for future work in theoretical study and\npractical implementation of the random sampling.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2009 01:43:44 GMT"}, {"version": "v2", "created": "Wed, 30 Sep 2009 14:51:47 GMT"}, {"version": "v3", "created": "Thu, 1 Oct 2009 09:43:29 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Wang", "Xiao Z.", ""], ["Sha", "Wei E. I.", ""]]}, {"id": "0909.2408", "submitter": "Paul Cuff", "authors": "Paul Cuff (Princeton University), Haim Permuter (Ben-Gurion\n  University) and Thomas Cover (Stanford University)", "title": "Coordination Capacity", "comments": "Accepted to IEEE Trans. on Info. Theory, 25 pages, 23 eps figure,\n  uses IEEEtran.cls", "journal-ref": "IEEE Trans. on Info. Theory, vol.56, no.9, pp.4181-4206, Sept.\n  2010", "doi": "10.1109/TIT.2010.2054651", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop elements of a theory of cooperation and coordination in networks.\nRather than considering a communication network as a means of distributing\ninformation, or of reconstructing random processes at remote nodes, we ask what\ndependence can be established among the nodes given the communication\nconstraints. Specifically, in a network with communication rates {R_{i,j}}\nbetween the nodes, we ask what is the set of all achievable joint distributions\np(x1, ..., xm) of actions at the nodes of the network. Several networks are\nsolved, including arbitrarily large cascade networks.\n  Distributed cooperation can be the solution to many problems such as\ndistributed games, distributed control, and establishing mutual information\nbounds on the influence of one part of a physical system on another.\n", "versions": [{"version": "v1", "created": "Sun, 13 Sep 2009 09:13:36 GMT"}, {"version": "v2", "created": "Wed, 26 May 2010 04:31:25 GMT"}], "update_date": "2011-04-04", "authors_parsed": [["Cuff", "Paul", "", "Princeton University"], ["Permuter", "Haim", "", "Ben-Gurion\n  University"], ["Cover", "Thomas", "", "Stanford University"]]}, {"id": "0909.2526", "submitter": "Olli Pottonen", "authors": "Patric R. J. \\\"Osterg{\\aa}rd and Olli Pottonen", "title": "Two Optimal One-Error-Correcting Codes of Length 13 That Are Not Doubly\n  Shortened Perfect Codes", "comments": "v2: a correction concerning shortened codes of length 12", "journal-ref": null, "doi": "10.1007/s10623-010-9450-4", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The doubly shortened perfect codes of length 13 are classified utilizing the\nclassification of perfect codes in [P.R.J. \\\"Osterg{\\aa}rd and O. Pottonen, The\nperfect binary one-error-correcting codes of length 15: Part I -\nClassification, IEEE Trans. Inform. Theory, to appear]; there are 117821 such\n(13,512,3) codes. By applying a switching operation to those codes, two more\n(13,512,3) codes are obtained, which are then not doubly shortened perfect\ncodes.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2009 12:04:50 GMT"}, {"version": "v2", "created": "Mon, 28 Feb 2011 13:57:11 GMT"}], "update_date": "2011-03-01", "authors_parsed": [["Östergård", "Patric R. J.", ""], ["Pottonen", "Olli", ""]]}, {"id": "0909.2542", "submitter": "Vadim Yatsenko", "authors": "Vadim Yatsenko (State Design Office Yuzhnoye, Ukraine)", "title": "Stochastic Optimization of Linear Dynamic Systems with Parametric\n  Uncertainties", "comments": "Submitted to Journal of Automation and Information Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This paper describes a new approach to solving some stochastic optimization\nproblems for linear dynamic system with various parametric uncertainties.\nProposed approach is based on application of tensor formalism for creation the\nmathematical model of parametric uncertainties. Within proposed approach\nfollowing problems are considered: prediction, data processing and optimal\ncontrol. Outcomes of carried out simulation are used as illustration of\nproperties and effectiveness of proposed methods.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2009 13:02:31 GMT"}], "update_date": "2009-09-15", "authors_parsed": [["Yatsenko", "Vadim", "", "State Design Office Yuzhnoye, Ukraine"]]}, {"id": "0909.2622", "submitter": "Jiangyuan Li", "authors": "Jiangyuan Li and Athina Petropulu", "title": "Transmitter Optimization for Achieving Secrecy Capacity in Gaussian MIMO\n  Wiretap Channels", "comments": "29 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a Gaussian multiple-input multiple-output (MIMO) wiretap channel\nmodel, where there exists a transmitter, a legitimate receiver and an\neavesdropper, each node equipped with multiple antennas. We study the problem\nof finding the optimal input covariance matrix that achieves secrecy capacity\nsubject to a power constraint, which leads to a non-convex optimization problem\nthat is in general difficult to solve. Existing results for this problem\naddress the case in which the transmitter and the legitimate receiver have two\nantennas each and the eavesdropper has one antenna. For the general cases, it\nhas been shown that the optimal input covariance matrix has low rank when the\ndifference between the Grams of the eavesdropper and the legitimate receiver\nchannel matrices is indefinite or semi-definite, while it may have low rank or\nfull rank when the difference is positive definite. In this paper, the\naforementioned non-convex optimization problem is investigated. In particular,\nfor the multiple-input single-output (MISO) wiretap channel, the optimal input\ncovariance matrix is obtained in closed form. For general cases, we derive the\nnecessary conditions for the optimal input covariance matrix consisting of a\nset of equations. For the case in which the transmitter has two antennas, the\nderived necessary conditions can result in a closed form solution; For the case\nin which the difference between the Grams is indefinite and has all negative\neigenvalues except one positive eigenvalue, the optimal input covariance matrix\nhas rank one and can be obtained in closed form; For other cases, the solution\nis proved to be a fixed point of a mapping from a convex set to itself and an\niterative procedure is provided to search for it. Numerical results are\npresented to illustrate the proposed theoretical findings.\n", "versions": [{"version": "v1", "created": "Mon, 14 Sep 2009 19:07:49 GMT"}], "update_date": "2009-09-15", "authors_parsed": [["Li", "Jiangyuan", ""], ["Petropulu", "Athina", ""]]}, {"id": "0909.2705", "submitter": "Wei Dai", "authors": "Wei Dai and Olgica Milenkovic", "title": "SET: an algorithm for consistent matrix completion", "comments": "4+ pages, submitted to ICASSP 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new algorithm, termed subspace evolution and transfer (SET), is proposed\nfor solving the consistent matrix completion problem. In this setting, one is\ngiven a subset of the entries of a low-rank matrix, and asked to find one\nlow-rank matrix consistent with the given observations. We show that this\nproblem can be solved by searching for a column space that matches the\nobservations. The corresponding algorithm consists of two parts -- subspace\nevolution and subspace transfer. In the evolution part, we use a line search\nprocedure to refine the column space. However, line search is not guaranteed to\nconverge, as there may exist barriers along the search path that prevent the\nalgorithm from reaching a global optimum. To address this problem, in the\ntransfer part, we design mechanisms to detect barriers and transfer the\nestimated column space from one side of the barrier to the another. The SET\nalgorithm exhibits excellent empirical performance for very low-rank matrices.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2009 02:42:58 GMT"}, {"version": "v2", "created": "Wed, 16 Sep 2009 20:26:21 GMT"}, {"version": "v3", "created": "Sat, 19 Sep 2009 05:23:28 GMT"}, {"version": "v4", "created": "Tue, 29 Sep 2009 19:33:47 GMT"}, {"version": "v5", "created": "Wed, 3 Feb 2010 16:49:26 GMT"}], "update_date": "2010-02-03", "authors_parsed": [["Dai", "Wei", ""], ["Milenkovic", "Olgica", ""]]}, {"id": "0909.2737", "submitter": "Yin Xiang", "authors": "Yin Xiang, Lianlin Li, Fang Li", "title": "Compressive sensing by white random convolution", "comments": "10 pages with 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A different compressive sensing framework, convolution with white noise\nwaveform followed by subsampling at fixed (not randomly selected) locations, is\nstudied in this paper. We show that its recoverability for sparse signals\ndepends on the coherence (denoted by mu) between the signal representation and\nthe Fourier basis. In particular, an n-dimensional signal which is S-sparse in\nsuch a basis can be recovered with a probability exceeding 1-delta from any\nfixed m~O(mu^2*S*log(n/delta)^(3/2)) output samples of the random convolution.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2009 08:05:42 GMT"}, {"version": "v2", "created": "Wed, 30 Sep 2009 09:32:15 GMT"}], "update_date": "2009-09-30", "authors_parsed": [["Xiang", "Yin", ""], ["Li", "Lianlin", ""], ["Li", "Fang", ""]]}, {"id": "0909.2777", "submitter": "Hossein Bagheri", "authors": "Hossein Bagheri, Abolfazl S. Motahari, and Amir K. Khandani", "title": "On the Symmetric Gaussian Interference Channel with Partial\n  Unidirectional Cooperation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A two-user symmetric Gaussian Interference Channel (IC) is considered in\nwhich a noiseless unidirectional link connects one encoder to the other. Having\na constant capacity, the additional link provides partial cooperation between\nthe encoders. It is shown that the available cooperation can dramatically\nincrease the sum-capacity of the channel. This fact is proved based on\ncomparison of proposed lower and upper bounds on the sum-capacity. Partitioning\nthe data into three independent messages, namely private, common, and\ncooperative ones, the transmission strategy used to obtain the lower bound\nenjoys a simple type of Han-Kobayashi scheme together with a cooperative\ncommunication scheme. A Genie-aided upper bound is developed which incorporates\nthe capacity of the cooperative link. Other upper bounds are based on the\nsum-capacity of the Cognitive Radio Channel and cut-set bounds. For the strong\ninterference regime, the achievablity scheme is simplified to employ common\nand/or cooperative messages but not the private one. Through a careful analysis\nit is shown that the gap between these bounds is at most one and two bits per\nreal dimension for strong and weak interference regimes, respectively.\nMoreover, the Generalized Degrees-of-Freedom of the channel is characterized.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2009 11:48:57 GMT"}], "update_date": "2009-09-16", "authors_parsed": [["Bagheri", "Hossein", ""], ["Motahari", "Abolfazl S.", ""], ["Khandani", "Amir K.", ""]]}, {"id": "0909.2817", "submitter": "ShinnYih Huang", "authors": "ShinnYih Huang and Hoda Bidkhori", "title": "Strongly Cancellative and Recovering Sets On Lattices", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use information theory to study recovering sets $\\R_L$ and strongly\ncancellative sets $\\C_L$ on different lattices. These sets are special classes\nof recovering pairs and cancellative sets previously discussed in [1], [3] and\n[5]. We mainly focus on the lattices $B_n$ and $D_{l}^{k}$. Specifically, we\nfind upper bounds and constructions for the sets $\\R_{B_n}$, $\\C_{B_n}$, and\n$\\C_{D_{l}^{k}}$.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2009 16:49:58 GMT"}], "update_date": "2009-09-16", "authors_parsed": [["Huang", "ShinnYih", ""], ["Bidkhori", "Hoda", ""]]}, {"id": "0909.2894", "submitter": "Jun Zhang", "authors": "Jun Zhang and Jeffrey G. Andrews", "title": "Adaptive Spatial Intercell Interference Cancellation in Multicell\n  Wireless Networks", "comments": "26 pages, submitted to IEEE J. Select. Areas Commun. special issue on\n  Cooperative Communications in MIMO Cellular Networks, Sept. 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Downlink spatial intercell interference cancellation (ICIC) is considered for\nmitigating other-cell interference using multiple transmit antennas. A\nprinciple question we explore is whether it is better to do ICIC or simply\nstandard single-cell beamforming. We explore this question analytically and\nshow that beamforming is preferred for all users when the edge SNR\n(signal-to-noise ratio) is low ($<0$ dB), and ICIC is preferred when the edge\nSNR is high ($>10$ dB), for example in an urban setting. At medium SNR, a\nproposed adaptive strategy, where multiple base stations jointly select\ntransmission strategies based on the user location, outperforms both while\nrequiring a lower feedback rate than the pure ICIC approach. The employed\nmetric is sum rate, which is normally a dubious metric for cellular systems,\nbut surprisingly we show that even with this reward function the adaptive\nstrategy also improves fairness. When the channel information is provided by\nlimited feedback, the impact of the induced quantization error is also\ninvestigated. It is shown that ICIC with well-designed feedback strategies\nstill provides significant throughput gain.\n", "versions": [{"version": "v1", "created": "Tue, 15 Sep 2009 22:32:22 GMT"}, {"version": "v2", "created": "Tue, 22 Sep 2009 19:22:16 GMT"}], "update_date": "2009-09-22", "authors_parsed": [["Zhang", "Jun", ""], ["Andrews", "Jeffrey G.", ""]]}, {"id": "0909.3055", "submitter": "Syed Qaseem", "authors": "Syed T. Qaseem, Tareq Y. Al-Naffouri", "title": "Compressive Sensing Based Opportunistic Protocol for Throughput\n  Improvement in Wireless Networks", "comments": "Submitted to IEEE Transactions on Communications, August 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A key feature in the design of any MAC protocol is the throughput it can\nprovide. In wireless networks, the channel of a user is not fixed but varies\nrandomly. Thus, in order to maximize the throughput of the MAC protocol at any\ngiven time, only users with large channel gains should be allowed to transmit.\nIn this paper, compressive sensing based opportunistic protocol for throughput\nimprovement in wireless networks is proposed. The protocol is based on the\ntraditional protocol of R-ALOHA which allows users to compete for channel\naccess before reserving the channel to the best user. We use compressive\nsensing to find the best user, and show that the proposed protocol requires\nless time for reservation and so it outperforms other schemes proposed in\nliterature. This makes the protocol particularly suitable for enhancing R-ALOHA\nin fast fading environments. We consider both analog and digital versions of\nthe protocol where the channel gains sent by the user are analog and digital,\nrespectively.\n", "versions": [{"version": "v1", "created": "Wed, 16 Sep 2009 16:21:26 GMT"}], "update_date": "2009-09-17", "authors_parsed": [["Qaseem", "Syed T.", ""], ["Al-Naffouri", "Tareq Y.", ""]]}, {"id": "0909.3131", "submitter": "Shengtian Yang", "authors": "Shengtian Yang, Thomas Honold, Yan Chen, Zhaoyang Zhang, Peiliang Qiu", "title": "Constructing Linear Encoders with Good Spectra", "comments": "v5.5.5, no. 201408271350, 40 pages, 3 figures, extended version of\n  the paper to be published in IEEE Transactions on Information Theory", "journal-ref": "IEEE Trans. Inf. Theory 60 (2014) 5950-5965", "doi": "10.1109/TIT.2014.2341560", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Linear encoders with good joint spectra are suitable candidates for optimal\nlossless joint source-channel coding (JSCC), where the joint spectrum is a\nvariant of the input-output complete weight distribution and is considered good\nif it is close to the average joint spectrum of all linear encoders (of the\nsame coding rate). In spite of their existence, little is known on how to\nconstruct such encoders in practice. This paper is devoted to their\nconstruction. In particular, two families of linear encoders are presented and\nproved to have good joint spectra. The first family is derived from Gabidulin\ncodes, a class of maximum-rank-distance codes. The second family is constructed\nusing a serial concatenation of an encoder of a low-density parity-check code\n(as outer encoder) with a low-density generator matrix encoder (as inner\nencoder). In addition, criteria for good linear encoders are defined for three\ncoding applications: lossless source coding, channel coding, and lossless JSCC.\nIn the framework of the code-spectrum approach, these three scenarios\ncorrespond to the problems of constructing linear encoders with good kernel\nspectra, good image spectra, and good joint spectra, respectively. Good joint\nspectra imply both good kernel spectra and good image spectra, and for every\nlinear encoder having a good kernel (resp., image) spectrum, it is proved that\nthere exists a linear encoder not only with the same kernel (resp., image) but\nalso with a good joint spectrum. Thus a good joint spectrum is the most\nimportant feature of a linear encoder.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2009 00:18:28 GMT"}, {"version": "v10", "created": "Fri, 18 Jul 2014 07:32:23 GMT"}, {"version": "v11", "created": "Wed, 27 Aug 2014 06:08:43 GMT"}, {"version": "v2", "created": "Fri, 16 Oct 2009 06:02:09 GMT"}, {"version": "v3", "created": "Thu, 7 Oct 2010 23:48:31 GMT"}, {"version": "v4", "created": "Mon, 14 May 2012 02:15:56 GMT"}, {"version": "v5", "created": "Mon, 18 Feb 2013 01:16:46 GMT"}, {"version": "v6", "created": "Tue, 3 Sep 2013 02:24:18 GMT"}, {"version": "v7", "created": "Wed, 8 Jan 2014 05:01:23 GMT"}, {"version": "v8", "created": "Mon, 3 Feb 2014 00:50:00 GMT"}, {"version": "v9", "created": "Mon, 12 May 2014 04:15:23 GMT"}], "update_date": "2016-02-02", "authors_parsed": [["Yang", "Shengtian", ""], ["Honold", "Thomas", ""], ["Chen", "Yan", ""], ["Zhang", "Zhaoyang", ""], ["Qiu", "Peiliang", ""]]}, {"id": "0909.3135", "submitter": "Jia Wang", "authors": "Jia Wang, Jun Chen, Lei Zhao, Paul Cuff, and Haim Permuter", "title": "A Random Variable Substitution Lemma With Applications to Multiple\n  Description Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish a random variable substitution lemma and use it to investigate\nthe role of refinement layer in multiple description coding, which clarifies\nthe relationship among several existing achievable multiple description\nrate-distortion regions. Specifically, it is shown that the El Gamal-Cover\n(EGC) region is equivalent to the EGC* region (an antecedent version of the EGC\nregion) while the Venkataramani-Kramer-Goyal (VKG) region (when specialized to\nthe 2-description case) is equivalent to the Zhang-Berger (ZB) region.\nMoreover, we prove that for multiple description coding with individual and\nhierarchical distortion constraints, the number of layers in the VKG scheme can\nbe significantly reduced when only certain weighted sum rates are concerned.\nThe role of refinement layer in scalable coding (a special case of multiple\ndescription coding) is also studied.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2009 00:59:01 GMT"}], "update_date": "2009-09-18", "authors_parsed": [["Wang", "Jia", ""], ["Chen", "Jun", ""], ["Zhao", "Lei", ""], ["Cuff", "Paul", ""], ["Permuter", "Haim", ""]]}, {"id": "0909.3146", "submitter": "Fr\\'ed\\'erique Oggier", "authors": "Frederique Oggier and Hanane Fathi", "title": "An Authentication Code against Pollution Attacks in Network Coding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Systems exploiting network coding to increase their throughput suffer greatly\nfrom pollution attacks which consist of injecting malicious packets in the\nnetwork. The pollution attacks are amplified by the network coding process,\nresulting in a greater damage than under traditional routing. In this paper, we\naddress this issue by designing an unconditionally secure authentication code\nsuitable for multicast network coding. The proposed scheme is robust against\npollution attacks from outsiders, as well as coalitions of malicious insiders.\nIntermediate nodes can verify the integrity and origin of the packets received\nwithout having to decode, and thus detect and discard the malicious messages\nin-transit that fail the verification. This way, the pollution is canceled out\nbefore reaching the destinations. We analyze the performance of the scheme in\nterms of both multicast throughput and goodput, and show the goodput gains. We\nalso discuss applications to file distribution.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2009 06:05:44 GMT"}], "update_date": "2009-09-18", "authors_parsed": [["Oggier", "Frederique", ""], ["Fathi", "Hanane", ""]]}, {"id": "0909.3165", "submitter": "Yilun Shang", "authors": "Yilun Shang", "title": "Finite-time Consensus for Nonlinear Multi-agent Systems with Fixed\n  Topologies", "comments": "11 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.MA math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study finite-time state consensus problems for continuous\nnonlinear multi-agent systems. Building on the theory of finite-time Lyapunov\nstability, we propose sufficient criteria which guarantee the system to reach a\nconsensus in finite time, provided that the underlying directed network\ncontains a spanning tree. Novel finite-time consensus protocols are introduced\nas examples for applying the criteria. Simulations are also presented to\nillustrate our theoretical results.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2009 08:52:35 GMT"}], "update_date": "2009-09-18", "authors_parsed": [["Shang", "Yilun", ""]]}, {"id": "0909.3185", "submitter": "Lorena Ronquillo", "authors": "J. Pujol, J. Rif\\`a, L. Ronquillo", "title": "Construction of Additive Reed-Muller Codes", "comments": "7 pages, Part of the material in this paper was presented without\n  proofs at the 18-th Symposium on Applied algebra, Algebraic algorithms, and\n  Error Correcting Codes (AAECC 2009), Tarragona, Spain, June 8-12, 2009", "journal-ref": "J. Pujol, J. Rifa and L. Ronquillo. Construction of Additive\n  Reed-Muller Codes. Applied Algebra, Algebraic Algorithms and Error-Correcting\n  Codes, LNCS 5527 (June 2009), pages 223-226", "doi": "10.1007/978-3-642-02181-7", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The well known Plotkin construction is, in the current paper, generalized and\nused to yield new families of Z2Z4-additive codes, whose length, dimension as\nwell as minimum distance are studied. These new constructions enable us to\nobtain families of Z2Z4-additive codes such that, under the Gray map, the\ncorresponding binary codes have the same parameters and properties as the usual\nbinary linear Reed-Muller codes. Moreover, the first family is the usual binary\nlinear Reed-Muller family.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2009 11:13:02 GMT"}, {"version": "v2", "created": "Wed, 28 Dec 2011 11:52:08 GMT"}], "update_date": "2011-12-30", "authors_parsed": [["Pujol", "J.", ""], ["Rifà", "J.", ""], ["Ronquillo", "L.", ""]]}, {"id": "0909.3226", "submitter": "Stefano Buzzi", "authors": "Stefano Buzzi, Luca Venturino, Alessio Zappone, Antonio De Maio", "title": "Blind user detection in doubly-dispersive DS/CDMA channels", "comments": "Accepted for publication on IEEE Transactions on Signal Processing", "journal-ref": "IEEE Transactions on Signal Processing, Vol. 58, No. 3, pp. 1446 -\n  1451, March 2010", "doi": "10.1109/TSP.2009.2033001", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we consider the problem of detecting the presence of a new user\nin a direct-sequence/code-division-multiple-access (DS/CDMA) system with a\ndoubly-dispersive fading channel, and we propose a novel blind detection\nstrategy which only requires knowledge of the spreading code of the user to be\ndetected, but no prior information as to the time-varying channel impulse\nresponse and the structure of the multiaccess interference. The proposed\ndetector has a bounded constant false alarm rate (CFAR) under the design\nassumptions, while providing satisfactory detection performance even in the\npresence of strong cochannel interference and high user mobility.\n", "versions": [{"version": "v1", "created": "Thu, 17 Sep 2009 14:10:09 GMT"}], "update_date": "2010-02-17", "authors_parsed": [["Buzzi", "Stefano", ""], ["Venturino", "Luca", ""], ["Zappone", "Alessio", ""], ["De Maio", "Antonio", ""]]}, {"id": "0909.3382", "submitter": "Atsushi Hatabu", "authors": "Atsushi Hatabu, Koujin Takeda, Yoshiyuki Kabashima", "title": "Statistical mechanical analysis of the Kronecker channel model for MIMO\n  wireless communication", "comments": null, "journal-ref": "Phys. Rev. E 80, 061124 (2009)", "doi": "10.1103/PhysRevE.80.061124", "report-no": null, "categories": "cs.IT cond-mat.dis-nn cond-mat.stat-mech math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Kronecker channel model of wireless communication is analyzed using\nstatistical mechanics methods. In the model, spatial proximities among\ntransmission/reception antennas are taken into account as certain correlation\nmatrices, which generally yield non-trivial dependence among symbols to be\nestimated. This prevents accurate assessment of the communication performance\nby naively using a previously developed analytical scheme based on a matrix\nintegration formula. In order to resolve this difficulty, we develop a\nformalism that can formally handle the correlations in Kronecker models based\non the known scheme. Unfortunately, direct application of the developed scheme\nis, in general, practically difficult. However, the formalism is still useful,\nindicating that the effect of the correlations generally increase after the\nfourth order with respect to correlation strength. Therefore, the known\nanalytical scheme offers a good approximation in performance evaluation when\nthe correlation strength is sufficiently small. For a class of specific\ncorrelation, we show that the performance analysis can be mapped to the problem\nof one-dimensional spin systems in random fields, which can be investigated\nwithout approximation by the belief propagation algorithm.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2009 08:34:30 GMT"}], "update_date": "2010-04-19", "authors_parsed": [["Hatabu", "Atsushi", ""], ["Takeda", "Koujin", ""], ["Kabashima", "Yoshiyuki", ""]]}, {"id": "0909.3388", "submitter": "Koji Nuida", "authors": "Koji Nuida", "title": "Pattern occurrence in the dyadic expansion of square root of two and an\n  analysis of pseudorandom number generators", "comments": "21 pages, extended abstract presented in FPSAC 2009", "journal-ref": "A part of this paper was published in: Electronic Journal of\n  Combinatorial Number Theory, vol.10 (2010) 111-127", "doi": null, "report-no": null, "categories": "math.CO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, designs of pseudorandom number generators (PRNGs) using\ninteger-valued variants of logistic maps and their applications to some\ncryptographic schemes have been studied, due mostly to their ease of\nimplementation and performance. However, it has been noted that this ease is\nreduced for some choices of the PRNGs accuracy parameters. In this article, we\nshow that the distribution of such undesirable accuracy parameters is closely\nrelated to the occurrence of some patterns in the dyadic expansion of the\nsquare root of 2. We prove that for an arbitrary infinite binary word, the\nasymptotic occurrence rate of these patterns is bounded in terms of the\nasymptotic occurrence rate of zeroes. We also present examples of infinite\nbinary words that tightly achieve the bounds. As a consequence, a classical\nconjecture on asymptotic evenness of occurrence of zeroes and ones in the\ndyadic expansion of the square root of 2 implies that the asymptotic rate of\nthe undesirable accuracy parameters for the PRNGs is at least 1/6.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2009 08:42:23 GMT"}], "update_date": "2010-07-06", "authors_parsed": [["Nuida", "Koji", ""]]}, {"id": "0909.3475", "submitter": "Yilun Shang", "authors": "Yilun Shang", "title": "Multi-agent Coordination in Directed Moving Neighborhood Random Networks", "comments": "9 pages", "journal-ref": "Chinese physics b, 2010", "doi": "10.1088/1674-1056/19/7/070201", "report-no": null, "categories": "cs.MA cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the consensus problem of dynamical multiple agents\nthat communicate via a directed moving neighborhood random network. Each agent\nperforms random walk on a weighted directed network. Agents interact with each\nother through random unidirectional information flow when they coincide in the\nunderlying network at a given instant. For such a framework, we present\nsufficient conditions for almost sure asymptotic consensus. Some existed\nconsensus schemes are shown to be reduced versions of the current model.\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2009 15:58:43 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Shang", "Yilun", ""]]}, {"id": "0909.3508", "submitter": "Mahdi Cheraghchi", "authors": "Mahdi Cheraghchi, Ali Hormati, Amin Karbasi, Martin Vetterli", "title": "Compressed Sensing with Probabilistic Measurements: A Group Testing\n  Solution", "comments": "In Proceedings of the Forty-Seventh Annual Allerton Conference on\n  Communication, Control, and Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Detection of defective members of large populations has been widely studied\nin the statistics community under the name \"group testing\", a problem which\ndates back to World War II when it was suggested for syphilis screening. There\nthe main interest is to identify a small number of infected people among a\nlarge population using collective samples. In viral epidemics, one way to\nacquire collective samples is by sending agents inside the population. While in\nclassical group testing, it is assumed that the sampling procedure is fully\nknown to the reconstruction algorithm, in this work we assume that the decoder\npossesses only partial knowledge about the sampling process. This assumption is\njustified by observing the fact that in a viral sickness, there is a chance\nthat an agent remains healthy despite having contact with an infected person.\nTherefore, the reconstruction method has to cope with two different types of\nuncertainty; namely, identification of the infected population and the\npartially unknown sampling procedure.\n  In this work, by using a natural probabilistic model for \"viral infections\",\nwe design non-adaptive sampling procedures that allow successful identification\nof the infected population with overwhelming probability 1-o(1). We propose\nboth probabilistic and explicit design procedures that require a \"small\" number\nof agents to single out the infected individuals. More precisely, for a\ncontamination probability p, the number of agents required by the probabilistic\nand explicit designs for identification of up to k infected members is bounded\nby m = O(k^2 (log n)/p^2) and m = O(k^2 (log n)^2 /p^2), respectively. In both\ncases, a simple decoder is able to successfully identify the infected\npopulation in time O(mn).\n", "versions": [{"version": "v1", "created": "Fri, 18 Sep 2009 19:29:42 GMT"}, {"version": "v2", "created": "Mon, 28 Sep 2009 12:31:25 GMT"}], "update_date": "2009-09-28", "authors_parsed": [["Cheraghchi", "Mahdi", ""], ["Hormati", "Ali", ""], ["Karbasi", "Amin", ""], ["Vetterli", "Martin", ""]]}, {"id": "0909.3647", "submitter": "Denes Petz", "authors": "Denes Petz", "title": "From f-divergence to quantum quasi-entropies and their use", "comments": "Written version of the lecture in the conference \"Information and\n  Communication\" held in Budapest", "journal-ref": null, "doi": "10.3390/e12030304", "report-no": null, "categories": "cs.IT math.IT math.ST quant-ph stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Csiszar's f-divergence of two probability distributions was extended to the\nquantum case by the author in 1985. In the quantum setting positive\nsemidefinite matrices are in the place of probability distributions and the\nquantum generalization is called quasi-entropy which is related to some other\nimportant concepts as covariance, quadratic costs, Fisher information,\nCramer-Rao inequality and uncertainty relation. A conjecture about the scalar\ncurvature of a Fisher information geometry is explained. The described subjects\nare overviewed in details in the matrix setting, but at the very end the von\nNeumann algebra approach is sketched shortly.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2009 18:10:11 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Petz", "Denes", ""]]}, {"id": "0909.3648", "submitter": "Joel Ratsaby", "authors": "Joel Ratsaby", "title": "Random scattering of bits by prediction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a population of binary mistake sequences that result from\nlearning with parametric models of different order. We obtain estimates of\ntheir error, algorithmic complexity and divergence from a purely random\nBernoulli sequence. We study the relationship of these variables to the\nlearner's information density parameter which is defined as the ratio between\nthe lengths of the compressed to uncompressed files that contain the learner's\ndecision rule. The results indicate that good learners have a low information\ndensity$\\rho$ while bad learners have a high $\\rho$. Bad learners generate\nmistake sequences that are atypically complex or diverge stochastically from a\npurely random Bernoulli sequence. Good learners generate typically complex\nsequences with low divergence from Bernoulli sequences and they include mistake\nsequences generated by the Bayes optimal predictor. Based on the static\nalgorithmic interference model of \\cite{Ratsaby_entropy} the learner here acts\nas a static structure which \"scatters\" the bits of an input sequence (to be\npredicted) in proportion to its information density $\\rho$ thereby deforming\nits randomness characteristics.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2009 18:10:55 GMT"}, {"version": "v2", "created": "Wed, 13 Oct 2010 19:03:58 GMT"}], "update_date": "2010-10-14", "authors_parsed": [["Ratsaby", "Joel", ""]]}, {"id": "0909.3658", "submitter": "Narasimha Shashidhar", "authors": "Aggelos Kiayias, Yona Raekow, Alexander Russell, Narasimha Shashidhar", "title": "Efficient Steganography with Provable Security Guarantees", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a new provably-secure steganographic encryption protocol that is\nproven secure in the complexity-theoretic framework of Hopper et al. The\nfundamental building block of our steganographic encryption protocol is a\n\"one-time stegosystem\" that allows two parties to transmit messages of length\nshorter than the shared key with information-theoretic security guarantees. The\nemployment of a pseudorandom generator (PRG) permits secure transmission of\nlonger messages in the same way that such a generator allows the use of\none-time pad encryption for messages longer than the key in symmetric\nencryption. The advantage of our construction, compared to that of Hopper et\nal., is that it avoids the use of a pseudorandom function family and instead\nrelies (directly) on a pseudorandom generator in a way that provides linear\nimprovement in the number of applications of the underlying one-way permutation\nper transmitted bit. This advantageous trade-off is achieved by substituting\nthe pseudorandom function family employed in the previous construction with an\nappropriate combinatorial construction that has been used extensively in\nderandomization, namely almost t-wise independent function families.\n", "versions": [{"version": "v1", "created": "Sun, 20 Sep 2009 22:54:26 GMT"}], "update_date": "2009-09-22", "authors_parsed": [["Kiayias", "Aggelos", ""], ["Raekow", "Yona", ""], ["Russell", "Alexander", ""], ["Shashidhar", "Narasimha", ""]]}, {"id": "0909.3966", "submitter": "Ananthanarayanan Chockalingam", "authors": "P. Ubaidulla and A. Chockalingam", "title": "Robust THP Transceiver Designs for Multiuser MIMO Downlink with\n  Imperfect CSIT", "comments": "Accepted for publication in EURASIP Journal on Advances in Signal\n  Processing: Special Issue on Multiuser MIMO Transmission with Limited\n  Feedback, Cooperation, and Coordination", "journal-ref": null, "doi": "10.1155/2009/473930", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present robust joint non-linear transceiver designs for\nmultiuser multiple-input multiple-output (MIMO) downlink in the presence of\nimperfections in the channel state information at the transmitter (CSIT). The\nbase station (BS) is equipped with multiple transmit antennas, and each user\nterminal is equipped with one or more receive antennas. The BS employs\nTomlinson-Harashima precoding (THP) for inter-user interference\npre-cancellation at the transmitter. We consider robust transceiver designs\nthat jointly optimize the transmit THP filters and receive filter for two\nmodels of CSIT errors. The first model is a stochastic error (SE) model, where\nthe CSIT error is Gaussian-distributed. This model is applicable when the CSIT\nerror is dominated by channel estimation error. In this case, the proposed\nrobust transceiver design seeks to minimize a stochastic function of the sum\nmean square error (SMSE) under a constraint on the total BS transmit power. We\npropose an iterative algorithm to solve this problem. The other model we\nconsider is a norm-bounded error (NBE) model, where the CSIT error can be\nspecified by an uncertainty set. This model is applicable when the CSIT error\nis dominated by quantization errors. In this case, we consider a worst-case\ndesign. For this model, we consider robust i) minimum SMSE, ii)\nMSE-constrained, and iii) MSE-balancing transceiver designs. We propose\niterative algorithms to solve these problems, wherein each iteration involves a\npair of semi-definite programs (SDP). Further, we consider an extension of the\nproposed algorithm to the case with per-antenna power constraints.\n", "versions": [{"version": "v1", "created": "Tue, 22 Sep 2009 11:24:03 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Ubaidulla", "P.", ""], ["Chockalingam", "A.", ""]]}, {"id": "0909.4017", "submitter": "Chiachi Huang", "authors": "Chiachi Huang, Syed A. Jafar, Shlomo Shamai (Shitz), Sriram Vishwanath", "title": "On Degrees of Freedom Region of MIMO Networks without CSIT", "comments": "14 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the effect of the absence of channel knowledge for\nmultiple-input-multiple-output (MIMO) networks. Specifically, we assume perfect\nchannel state information at the receivers, no channel state information at the\ntransmitter(s), and independent identically distributed (i.i.d.) Rayleigh\nfading across antennas, users and time slots. We provide the characterization\nof the degrees of freedom (DoF) region for a 2-user MIMO broadcast channel. We\nthen provide a DoF region outer bound for a 2-user MIMO interference channel.\nThis bound is shown to be tight for all possible combinations of the number of\nantennas at each node except for one case. As a byproduct of this analysis we\npoint out the potential of interference alignment in the 2-user MIMO\ninterference channel with no CSIT.\n", "versions": [{"version": "v1", "created": "Tue, 22 Sep 2009 15:35:05 GMT"}], "update_date": "2009-09-23", "authors_parsed": [["Huang", "Chiachi", "", "Shitz"], ["Jafar", "Syed A.", "", "Shitz"], ["Shamai", "Shlomo", "", "Shitz"], ["Vishwanath", "Sriram", ""]]}, {"id": "0909.4126", "submitter": "Yaming Yu", "authors": "Yaming Yu", "title": "On an Inequality of Karlin and Rinott Concerning Weighted Sums of i.i.d.\n  Random Variables", "comments": "<= 4 pages", "journal-ref": "Adv. in Appl. Probab. 40 (2008) 1223-1226", "doi": "10.1239/aap/1231340171", "report-no": null, "categories": "cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an entropy comparison result concerning weighted sums of\nindependent and identically distributed random variables.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2009 03:14:47 GMT"}], "update_date": "2009-09-24", "authors_parsed": [["Yu", "Yaming", ""]]}, {"id": "0909.4177", "submitter": "Tiangao Gou", "authors": "Tiangao Gou, Syed A. Jafar, Chenwei Wang", "title": "On the Degrees of Freedom of Finite State Compound Wireless Networks -\n  Settling a Conjecture by Weingarten et. al", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the degrees of freedom (DoF) of three classes of finite state\ncompound wireless networks in this paper. First, we study the multiple-input\nsingle-output (MISO) finite state compound broadcast channel (BC) with\narbitrary number of users and antennas at the transmitter. In prior work,\nWeingarten et. al. have found inner and outer bounds on the DoF with 2 users.\nThe bounds have a different character. While the inner bound collapses to unity\nas the number of states increases, the outer bound does not diminish with the\nincreasing number of states beyond a threshold value. It has been conjectured\nthat the outer bound is loose and the inner bound represents the actual DoF. In\nthe complex setting (all signals, noise, and channel coefficients are complex\nvariables) we solve a few cases to find that the outer bound -and not the inner\nbound- of Weingarten et. al. is tight. For the real setting (all signals, noise\nand channel coefficients are real variables) we completely characterize the\nDoF, once again proving that the outer bound of Weingarten et. al. is tight. We\nalso extend the results to arbitrary number of users. Second, we characterize\nthe DoF of finite state scalar (single antenna nodes) compound X networks with\narbitrary number of users in the real setting. Third, we characterize the DoF\nof finite state scalar compound interference networks with arbitrary number of\nusers in both the real and complex setting. The key finding is that scalar\ninterference networks and (real) X networks do not lose any DoF due to channel\nuncertainty at the transmitter in the finite state compound setting. The finite\nstate compound MISO BC does lose DoF relative to the perfect CSIT scenario.\nHowever, what is lost is only the DoF benefit of joint processing at transmit\nantennas, without which the MISO BC reduces to an X network.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2009 19:59:23 GMT"}], "update_date": "2009-09-24", "authors_parsed": [["Gou", "Tiangao", ""], ["Jafar", "Syed A.", ""], ["Wang", "Chenwei", ""]]}, {"id": "0909.4203", "submitter": "Amos Lapidoth", "authors": "Young-Han Kim, Amos Lapidoth, and Tsachy Weissman", "title": "Error Exponents for the Gaussian Channel with Active Noisy Feedback", "comments": "Submitted to the IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the best exponential decay in the blocklength of the probability of\nerror that can be achieved in the transmission of a single bit over the\nGaussian channel with an active noisy Gaussian feedback link. We impose an\n\\emph{expected} block power constraint on the forward link and study both\n\\emph{almost-sure} and \\emph{expected} block power constraints on the feedback\nlink. In both cases the best achievable error exponents are finite and grow\napproximately proportionally to the larger between the signal-to-noise ratios\non the forward and feedback links. The error exponents under almost-sure block\npower constraints are typically strictly smaller than under expected\nconstraints. Some of the results extend to communication at arbitrary rates\nbelow capacity and to general discrete memoryless channels.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2009 13:19:56 GMT"}], "update_date": "2009-09-24", "authors_parsed": [["Kim", "Young-Han", ""], ["Lapidoth", "Amos", ""], ["Weissman", "Tsachy", ""]]}, {"id": "0909.4233", "submitter": "Jacob Ziv", "authors": "Jacob Ziv", "title": "On the optimality of universal classifiers for finite-length individual\n  test sequences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider pairs of finite-length individual sequences that are realizations\nof unknown, finite alphabet, stationary sources in a clas M of sources with\nvanishing memory (e.g. stationary Markov sources).\n  The task of a universal classifier is to decide whether the two sequences are\nemerging from the same source or are emerging from two distinct sources in M,\nand it has to carry this task without any prior knowledge of the two underlying\nprobability measures.\n  Given a fidelity function and a fidelity criterion, the probability of\nclassification error for a given universal classifier is defined.\n  Two universal classifiers are defined for pairs of $N$ -sequence: A\n\"classical\" fixed-length (FL) universal classifier and an alternative\nvariable-length (VL) universal classifier.\n  Following Wyner and Ziv (1996) it is demonstrated that if the length of the\nindividual sequences N is smaller than a cut-off value that is determined by\nthe properties of the class M, any universal classifier will fail with high\nprobability .\n  It is demonstrated that for values of N larger than the cut-off rate, the\nclassification error relative to either one of the two classifiers tends to\nzero as the length of the sequences tends to infinity.\n  However, the probability of classification error that is associated with the\nvariable-length universal classifier is uniformly smaller (or equal) to the one\nthat is associated with the \"classical\" fixed-length universal classifier, for\nany finite length.\n", "versions": [{"version": "v1", "created": "Wed, 23 Sep 2009 16:04:19 GMT"}, {"version": "v2", "created": "Wed, 23 Sep 2009 21:19:07 GMT"}, {"version": "v3", "created": "Thu, 8 Oct 2009 14:03:44 GMT"}, {"version": "v4", "created": "Fri, 16 Oct 2009 11:39:55 GMT"}, {"version": "v5", "created": "Thu, 25 Nov 2010 11:16:18 GMT"}, {"version": "v6", "created": "Mon, 4 Jul 2011 08:11:03 GMT"}, {"version": "v7", "created": "Wed, 26 Oct 2011 19:28:55 GMT"}, {"version": "v8", "created": "Mon, 7 Nov 2011 04:32:41 GMT"}], "update_date": "2011-11-08", "authors_parsed": [["Ziv", "Jacob", ""]]}, {"id": "0909.4349", "submitter": "Yilun Shang", "authors": "Yilun Shang", "title": "Leader-following Consensus Problems with a Time-varying Leader under\n  Measurement Noises", "comments": "12 pages 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a leader-following consensus problem for networks\nof continuous-time integrator agents with a time-varying leader under\nmeasurement noises. We propose a neighbor-based state-estimation protocol for\nevery agent to track the leader, and time-varying consensus gains are\nintroduced to attenuate the noises. By combining the tools of stochastic\nanalysis and algebraic graph theory, we study mean square convergence of this\nmulti-agent system under directed fixed as well as switching interconnection\ntopologies. Sufficient conditions are given for mean square consensus in both\ncases. Finally, a numerical example is given to illustrate our theoretical\nresults.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2009 02:05:06 GMT"}], "update_date": "2009-09-25", "authors_parsed": [["Shang", "Yilun", ""]]}, {"id": "0909.4359", "submitter": "Yilun Wang", "authors": "Yilun Wang and Wotao Yin", "title": "Sparse Signal Reconstruction via Iterative Support Detection", "comments": null, "journal-ref": "SIAM Journal on Imaging Sciences, 3(3), 462-491, 2010", "doi": "10.1137/090772447", "report-no": null, "categories": "cs.IT math.IT math.NA math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a novel sparse signal reconstruction method \"ISD\", aiming to\nachieve fast reconstruction and a reduced requirement on the number of\nmeasurements compared to the classical l_1 minimization approach. ISD addresses\nfailed reconstructions of l_1 minimization due to insufficient measurements. It\nestimates a support set I from a current reconstruction and obtains a new\nreconstruction by solving the minimization problem \\min{\\sum_{i\\not\\in\nI}|x_i|:Ax=b}, and it iterates these two steps for a small number of times. ISD\ndiffers from the orthogonal matching pursuit (OMP) method, as well as its\nvariants, because (i) the index set I in ISD is not necessarily nested or\nincreasing and (ii) the minimization problem above updates all the components\nof x at the same time. We generalize the Null Space Property to Truncated Null\nSpace Property and present our analysis of ISD based on the latter.\n  We introduce an efficient implementation of ISD, called threshold--ISD, for\nrecovering signals with fast decaying distributions of nonzeros from\ncompressive sensing measurements. Numerical experiments show that\nthreshold--ISD has significant advantages over the classical l_1 minimization\napproach, as well as two state--of--the--art algorithms: the iterative\nreweighted l_1 minimization algorithm (IRL1) and the iterative reweighted\nleast--squares algorithm (IRLS).\n  MATLAB code is available for download from\nhttp://www.caam.rice.edu/~optimization/L1/ISD/.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2009 04:11:33 GMT"}, {"version": "v2", "created": "Mon, 5 Jul 2010 19:32:39 GMT"}], "update_date": "2015-11-23", "authors_parsed": [["Wang", "Yilun", ""], ["Yin", "Wotao", ""]]}, {"id": "0909.4484", "submitter": "Walid Hachem", "authors": "Walid Hachem, Eric Moulines, Francois Roueff", "title": "Error exponents for Neyman-Pearson detection of a continuous-time\n  Gaussian Markov process from noisy irregular samples", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the detection of a stochastic process in noise from\nirregular samples. We consider two hypotheses. The \\emph{noise only} hypothesis\namounts to model the observations as a sample of a i.i.d. Gaussian random\nvariables (noise only). The \\emph{signal plus noise} hypothesis models the\nobservations as the samples of a continuous time stationary Gaussian process\n(the signal) taken at known but random time-instants corrupted with an additive\nnoise. Two binary tests are considered, depending on which assumptions is\nretained as the null hypothesis. Assuming that the signal is a linear\ncombination of the solution of a multidimensional stochastic differential\nequation (SDE), it is shown that the minimum Type II error probability\ndecreases exponentially in the number of samples when the False Alarm\nprobability is fixed. This behavior is described by \\emph{error exponents} that\nare completely characterized. It turns out that they are related with the\nasymptotic behavior of the Kalman Filter in random stationary environment,\nwhich is studied in this paper. Finally, numerical illustrations of our claims\nare provided in the context of sensor networks.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2009 16:00:41 GMT"}], "update_date": "2009-09-25", "authors_parsed": [["Hachem", "Walid", ""], ["Moulines", "Eric", ""], ["Roueff", "Francois", ""]]}, {"id": "0909.4573", "submitter": "Chris Ng", "authors": "Chris T. K. Ng and Howard Huang", "title": "Efficient Linear Precoding in Downlink Cooperative Cellular Networks\n  with Soft Interference Nulling", "comments": "To appear at the Forty-Seventh Annual Allerton Conference on\n  Communication, Control, and Computing, September 30 - October 2, 2009,\n  Monticello, Illinois", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A simple line network model is proposed to study the downlink cellular\nnetwork. Without base station cooperation, the system is interference-limited.\nThe interference limitation is overcome when the base stations are allowed to\njointly encode the user signals, but the capacity-achieving dirty paper coding\nscheme can be too complex for practical implementation. A new linear precoding\ntechnique called soft interference nulling (SIN) is proposed, which performs at\nleast as well as zero-forcing (ZF) beamforming under full network coordination.\nUnlike ZF, SIN allows the possibility of but over-penalizes interference. The\nSIN precoder is computed by solving a convex optimization problem, and the\nformulation is extended to multiple-antenna channels. SIN can be applied when\nonly a limited number of base stations cooperate; it is shown that SIN under\npartial network coordination can outperform full network coordination ZF at\nmoderate SNRs.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2009 23:28:25 GMT"}], "update_date": "2009-09-28", "authors_parsed": [["Ng", "Chris T. K.", ""], ["Huang", "Howard", ""]]}, {"id": "0909.4575", "submitter": "Narasimha Shashidhar", "authors": "Aggelos Kiayias, Alexander Russell, Narasimha Shashidhar", "title": "Randomness Efficient Steganography", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Steganographic protocols enable one to embed covert messages into\ninconspicuous data over a public communication channel in such a way that no\none, aside from the sender and the intended receiver, can even detect the\npresence of the secret message. In this paper, we provide a new\nprovably-secure, private-key steganographic encryption protocol secure in the\nframework of Hopper et al. We first present a \"one-time stegosystem\" that\nallows two parties to transmit messages of length at most that of the shared\nkey with information-theoretic security guarantees. The employment of a\npseudorandom generator (PRG) permits secure transmission of longer messages in\nthe same way that such a generator allows the use of one-time pad encryption\nfor messages longer than the key in symmetric encryption. The advantage of our\nconstruction, compared to all previous work is randomness efficiency: in the\ninformation theoretic setting our protocol embeds a message of length n bits\nusing a shared secret key of length (1+o(1))n bits while achieving security\n2^{-n/log^{O(1)}n}; simply put this gives a rate of key over message that is 1\nas n tends to infinity (the previous best result achieved a constant rate\ngreater than 1 regardless of the security offered). In this sense, our protocol\nis the first truly randomness efficient steganographic system. Furthermore, in\nour protocol, we can permit a portion of the shared secret key to be public\nwhile retaining precisely n private key bits. In this setting, by separating\nthe public and the private randomness of the shared key, we achieve security of\n2^{-n}. Our result comes as an effect of the application of randomness\nextractors to stegosystem design. To the best of our knowledge this is the\nfirst time extractors have been applied in steganography.\n", "versions": [{"version": "v1", "created": "Thu, 24 Sep 2009 23:47:05 GMT"}, {"version": "v2", "created": "Fri, 3 Feb 2012 17:43:49 GMT"}], "update_date": "2012-02-06", "authors_parsed": [["Kiayias", "Aggelos", ""], ["Russell", "Alexander", ""], ["Shashidhar", "Narasimha", ""]]}, {"id": "0909.4588", "submitter": "Marcus Hutter", "authors": "Marcus Hutter", "title": "Discrete MDL Predicts in Total Variation", "comments": "15 LaTeX pages", "journal-ref": "Advances in Neural Information Processing Systems 22 (NIPS 2009)\n  pages 817-825", "doi": null, "report-no": null, "categories": "math.PR cs.IT cs.LG math.IT math.ST stat.ML stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Minimum Description Length (MDL) principle selects the model that has the\nshortest code for data plus model. We show that for a countable class of\nmodels, MDL predictions are close to the true distribution in a strong sense.\nThe result is completely general. No independence, ergodicity, stationarity,\nidentifiability, or other assumption on the model class need to be made. More\nformally, we show that for any countable class of models, the distributions\nselected by MDL (or MAP) asymptotically predict (merge with) the true measure\nin the class in total variation distance. Implications for non-i.i.d. domains\nlike time-series forecasting, discriminative learning, and reinforcement\nlearning are discussed.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2009 02:57:17 GMT"}], "update_date": "2010-12-30", "authors_parsed": [["Hutter", "Marcus", ""]]}, {"id": "0909.4589", "submitter": "Kai Cai", "authors": "Kai Cai, Rongquan Feng, and Zhiming Zheng", "title": "Cross-correlation properties of cyclotomic sequences", "comments": null, "journal-ref": "This paper have been published in IEICE Trans. Fund., 2007", "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.CO math.IT", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Sequences with good correlation properties are widely used in engineering\napplications, especially in the area of communications. Among the known\nsequences, cyclotomic families have the optimal autocorrelation property. In\nthis paper, we decide the cross-correlation function of the known cyclotomic\nsequences completely. Moreover, to get our results, the relations between the\nmultiplier group and the decimations of the characteristic sequence are also\nestablished for an arbitrary difference set.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2009 02:57:51 GMT"}], "update_date": "2009-09-28", "authors_parsed": [["Cai", "Kai", ""], ["Feng", "Rongquan", ""], ["Zheng", "Zhiming", ""]]}, {"id": "0909.4592", "submitter": "Kai Cai", "authors": "Kai Cai", "title": "Autocorrelation-Run Formula for Binary Sequences", "comments": "18 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DM math.CO math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The autocorrelation function and the run structure are two basic notions for\nbinary sequences, and have been used as two independent postulates to test\nrandomness of binary sequences ever since Golomb 1955. In this paper, we prove\nfor binary sequence that the autocorrelation function is in fact completely\ndetermined by its run structure.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2009 03:16:07 GMT"}, {"version": "v2", "created": "Sun, 22 Aug 2010 08:05:03 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Cai", "Kai", ""]]}, {"id": "0909.4601", "submitter": "Ning Chen", "authors": "Ning Chen, Zhiyuan Yan, Maximilien Gadouleau, Ying Wang, and Bruce W.\n  Suter", "title": "Rank Metric Decoder Architectures for Random Linear Network Coding with\n  Error Control", "comments": "14 pages, 12 figures, accepted by IEEE Trans. VLSI Syst", "journal-ref": null, "doi": "10.1109/TVLSI.2010.2096239", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While random linear network coding is a powerful tool for disseminating\ninformation in communication networks, it is highly susceptible to errors\ncaused by various sources. Due to error propagation, errors greatly deteriorate\nthe throughput of network coding and seriously undermine both reliability and\nsecurity of data. Hence error control for network coding is vital. Recently,\nconstant-dimension codes (CDCs), especially K\\\"otter-Kschischang (KK) codes,\nhave been proposed for error control in random linear network coding. KK codes\ncan also be constructed from Gabidulin codes, an important class of rank metric\ncodes. Rank metric decoders have been recently proposed for both Gabidulin and\nKK codes, but they have high computational complexities. Furthermore, it is not\nclear whether such decoders are feasible and suitable for hardware\nimplementations. In this paper, we reduce the complexities of rank metric\ndecoders and propose novel decoder architectures for both codes. The synthesis\nresults of our decoder architectures for Gabidulin and KK codes with limited\nerror-correcting capabilities over small fields show that our architectures not\nonly are affordable, but also achieve high throughput.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2009 04:20:29 GMT"}, {"version": "v2", "created": "Wed, 14 Jul 2010 05:35:45 GMT"}, {"version": "v3", "created": "Sat, 22 Jan 2011 06:46:46 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Chen", "Ning", ""], ["Yan", "Zhiyuan", ""], ["Gadouleau", "Maximilien", ""], ["Wang", "Ying", ""], ["Suter", "Bruce W.", ""]]}, {"id": "0909.4604", "submitter": "Akbar Ghasemi", "authors": "Akbar Ghasemi, Abolfazl Seyed Motahari, and Amir Keyvan Khandani", "title": "Interference Alignment for the $K$ User MIMO Interference Channel", "comments": "25 pages, 4 figures, Presented in part at ISIT 2010, submitted to\n  IEEE Transactions on Information Theory, June 2011", "journal-ref": null, "doi": "10.1109/ISIT.2010.5513347", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the $K$-user Multiple Input Multiple Output (MIMO) Gaussian\ninterference channel with $M$ antennas at each transmitter and $N$ antennas at\neach receiver. It is assumed that channel coefficients are constant and are\navailable at all transmitters and at all receivers. The main objective of this\npaper is to characterize the Degrees of Freedom (DoF) for this channel. Using a\nnew interference alignment technique which has been recently introduced in\n\\cite{abolfazl-final}, we show that $\\frac{MN}{M+N} K$ degrees of freedom can\nbe achieved for almost all channel realizations. Also, a new upper-bound on the\nDoF of this channel is provided. This upper-bound coincides with our achievable\nDoF for $K\\geq K_u\\define\\frac{M+N}{\\gcd(M,N)}$, where $\\gcd(M,N)$ denotes the\ngreatest common divisor of $M$ and $N$. This gives an exact characterization of\nDoF for $M\\times N$ MIMO Gaussian interference channel in the case of $K\\geq\nK_u$.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2009 18:57:37 GMT"}, {"version": "v2", "created": "Wed, 21 Sep 2011 21:47:24 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Ghasemi", "Akbar", ""], ["Motahari", "Abolfazl Seyed", ""], ["Khandani", "Amir Keyvan", ""]]}, {"id": "0909.4767", "submitter": "Christine Bachoc", "authors": "Christine Bachoc (IMB)", "title": "Semidefinite programming, harmonic analysis and coding theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  These lecture notes where presented as a course of the CIMPA summer school in\nManila, July 20-30, 2009, Semidefinite programming in algebraic combinatorics.\nThis version is an update June 2010.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2009 19:04:18 GMT"}, {"version": "v2", "created": "Wed, 8 Sep 2010 11:37:01 GMT"}], "update_date": "2010-09-09", "authors_parsed": [["Bachoc", "Christine", "", "IMB"]]}, {"id": "0909.4807", "submitter": "Dusan Jakovetic", "authors": "Dusan Jakovetic, Joao Xavier, Jose' M. F. Moura", "title": "Consensus in Correlated Random Topologies: Weights for Finite Time\n  Horizon", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the weight design problem for the consensus algorithm under a\nfinite time horizon. We assume that the underlying network is random where the\nlinks fail at each iteration with certain probability and the link failures can\nbe spatially correlated. We formulate a family of weight design criteria\n(objective functions) that minimize n, n = 1,...,N (out of N possible) largest\n(slowest) eigenvalues of the matrix that describes the mean squared consensus\nerror dynamics. We show that the objective functions are convex; hence,\nglobally optimal weights (with respect to the design criteria) can be\nefficiently obtained. Numerical examples on large scale, sparse random networks\nwith spatially correlated link failures show that: 1) weights obtained\naccording to our criteria lead to significantly faster convergence than the\nchoices available in the literature; 2) different design criteria that\ncorresponds to different n, exhibits very interesting tradeoffs: faster\ntransient performance leads to slower long time run performance and vice versa.\nThus, n is a valuable degree of freedom and can be appropriately selected for\nthe given time horizon.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2009 21:30:44 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Jakovetic", "Dusan", ""], ["Xavier", "Joao", ""], ["Moura", "Jose' M. F.", ""]]}, {"id": "0909.4808", "submitter": "Christina Fragouli", "authors": "Javad Ebrahimi and Christina Fragouli", "title": "Combinatiorial Algorithms for Wireless Information Flow", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A long-standing open question in information theory is to characterize the\nunicast capacity of a wireless relay network. The difficulty arises due to the\ncomplex signal interactions induced in the network, since the wireless channel\ninherently broadcasts the signals and there is interference among\ntransmissions. Recently, Avestimehr, Diggavi and Tse proposed a linear\ndeterministic model that takes into account the shared nature of wireless\nchannels, focusing on the signal interactions rather than the background noise.\nThey generalized the min-cut max-flow theorem for graphs to networks of\ndeterministic channels and proved that the capacity can be achieved using\ninformation theoretical tools. They showed that the value of the minimum cut is\nin this case the minimum rank of all the adjacency matrices describing\nsource-destination cuts.\n  In this paper, we develop a polynomial time algorithm that discovers the\nrelay encoding strategy to achieve the min-cut value in linear deterministic\n(wireless) networks, for the case of a unicast connection. Our algorithm\ncrucially uses a notion of linear independence between channels to calculate\nthe capacity in polynomial time. Moreover, we can achieve the capacity by using\nvery simple one-symbol processing at the intermediate nodes, thereby\nconstructively yielding finite length strategies that achieve the unicast\ncapacity of the linear deterministic (wireless) relay network.\n", "versions": [{"version": "v1", "created": "Fri, 25 Sep 2009 21:33:35 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Ebrahimi", "Javad", ""], ["Fragouli", "Christina", ""]]}, {"id": "0909.4828", "submitter": "Ofer Shayevitz", "authors": "Ofer Shayevitz and Meir Feder", "title": "Optimal Feedback Communication via Posterior Matching", "comments": "IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a fundamental principle for optimal communication\nover general memoryless channels in the presence of noiseless feedback, termed\nposterior matching. Using this principle, we devise a (simple, sequential)\ngeneric feedback transmission scheme suitable for a large class of memoryless\nchannels and input distributions, achieving any rate below the corresponding\nmutual information. This provides a unified framework for optimal feedback\ncommunication in which the Horstein scheme (BSC) and the Schalkwijk-Kailath\nscheme (AWGN channel) are special cases. Thus, as a corollary, we prove that\nthe Horstein scheme indeed attains the BSC capacity, settling a longstanding\nconjecture. We further provide closed form expressions for the error\nprobability of the scheme over a range of rates, and derive the achievable\nrates in a mismatch setting where the scheme is designed according to the wrong\nchannel model. Several illustrative examples of the posterior matching scheme\nfor specific channels are given, and the corresponding error probability\nexpressions are evaluated. The proof techniques employed utilize novel\nrelations between information rates and contraction properties of iterated\nfunction systems.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2009 09:20:00 GMT"}, {"version": "v2", "created": "Tue, 10 Aug 2010 05:53:13 GMT"}], "update_date": "2010-08-11", "authors_parsed": [["Shayevitz", "Ofer", ""], ["Feder", "Meir", ""]]}, {"id": "0909.4830", "submitter": "Luis Daniel Abreu", "authors": "Luis Daniel Abreu", "title": "Super-wavelets versus poly-Bergman spaces", "comments": "Preliminar version; 19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.FA cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by potential applications in multiplexing and by recent results on\nGabor analysis with Hermite windows due to Gr\\\"{o}chenig and Lyubarskii, we\ninvestigate vector-valued wavelet transforms and vector-valued wavelet frames,\nwhich constitute special cases of super-wavelets, with a particular attention\nto the case when the analyzing wavelet vector is related to Fourier transforms\nof Laguerre functions. We construct an isometric isomorphism between\n$L^{2}(\\mathbb{R}^{+},\\mathbf{C}^{n})$ and poly-Bergman spaces, with a view to\nrelate the sampling sequences in the poly-Bergman spaces to the wavelet frames\nand super-frames with the windows $\\Phi_{n}$. One of the applications of the\ntheory is a proof that $b\\ln a<2\\pi (n+1)$ is a necessary condition for the\n(scalar) wavelet frame associated to the $\\Phi_{n}$ to exist. This seems to be\nthe first known result of this type outside the setting of analytic functions\n(the case $n=0$, which has been completely studied by Seip in 1993).\n", "versions": [{"version": "v1", "created": "Sat, 26 Sep 2009 03:46:48 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Abreu", "Luis Daniel", ""]]}, {"id": "0909.4876", "submitter": "Mani A", "authors": "A. Mani", "title": "A Program in Dialectical Rough Set Theory", "comments": "8 Pages, Brief Version of forthcoming paper. My conference\n  presentation at \"Internat. Conf. on Rough Sets, Fuzzy Sets and Soft\n  Computing, Agartala, Tripura University, India, 2009\" includes many parts of\n  this paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A dialectical rough set theory focussed on the relation between roughly\nequivalent objects and classical objects was introduced in \\cite{AM699} by the\npresent author. The focus of our investigation is on elucidating the minimal\nconditions on the nature of granularity, underlying semantic domain and nature\nof the general rough set theories (RST) involved for possible extension of the\nsemantics to more general RST on a paradigm. On this basis we also formulate a\nprogram in dialectical rough set theory. The dialectical approach provides\nbetter semantics in many difficult cases and helps in formalising a wide\nvariety of concepts and notions that remain untamed at meta levels in the usual\napproaches. This is a brief version of a more detailed forthcoming paper by the\npresent author.\n", "versions": [{"version": "v1", "created": "Sun, 27 Sep 2009 01:39:27 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Mani", "A.", ""]]}, {"id": "0909.4983", "submitter": "Kaibin Huang", "authors": "Kaibin Huang, Vincent K. N. Lau, and Dongku Kim", "title": "Event-Driven Optimal Feedback Control for Multi-Antenna Beamforming", "comments": "29 pages; submitted for publication", "journal-ref": null, "doi": "10.1109/TSP.2010.2045426", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transmit beamforming is a simple multi-antenna technique for increasing\nthroughput and the transmission range of a wireless communication system. The\nrequired feedback of channel state information (CSI) can potentially result in\nexcessive overhead especially for high mobility or many antennas. This work\nconcerns efficient feedback for transmit beamforming and establishes a new\napproach of controlling feedback for maximizing net throughput, defined as\nthroughput minus average feedback cost. The feedback controller using a\nstationary policy turns CSI feedback on/off according to the system state that\ncomprises the channel state and transmit beamformer. Assuming channel isotropy\nand Markovity, the controller's state reduces to two scalars. This allows the\noptimal control policy to be efficiently computed using dynamic programming.\nConsider the perfect feedback channel free of error, where each feedback\ninstant pays a fixed price. The corresponding optimal feedback control policy\nis proved to be of the threshold type. This result holds regardless of whether\nthe controller's state space is discretized or continuous. Under the\nthreshold-type policy, feedback is performed whenever a state variable\nindicating the accuracy of transmit CSI is below a threshold, which varies with\nchannel power. The practical finite-rate feedback channel is also considered.\nThe optimal policy for quantized feedback is proved to be also of the threshold\ntype. The effect of CSI quantization is shown to be equivalent to an increment\non the feedback price. Moreover, the increment is upper bounded by the expected\nlogarithm of one minus the quantization error. Finally, simulation shows that\nfeedback control increases net throughput of the conventional periodic feedback\nby up to 0.5 bit/s/Hz without requiring additional bandwidth or antennas.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2009 01:14:54 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Huang", "Kaibin", ""], ["Lau", "Vincent K. N.", ""], ["Kim", "Dongku", ""]]}, {"id": "0909.4995", "submitter": "Marko Jankovic", "authors": "Marko V. Jankovic", "title": "Geometrical Interpretation of Shannon's Entropy Based on the Born Rule", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NE math.IT math.PR physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we will analyze discrete probability distributions in which\nprobabilities of particular outcomes of some experiment (microstates) can be\nrepresented by the ratio of natural numbers (in other words, probabilities are\nrepresented by digital numbers of finite representation length). We will\nintroduce several results that are based on recently proposed JoyStick\nProbability Selector, which represents a geometrical interpretation of the\nprobability based on the Born rule. The terms of generic space and generic\ndimension of the discrete distribution, as well as, effective dimension are\ngoing to be introduced. It will be shown how this simple geometric\nrepresentation can lead to an optimal code length coding of the sequence of\nsignals. Then, we will give a new, geometrical, interpretation of the Shannon\nentropy of the discrete distribution. We will suggest that the Shannon entropy\nrepresents the logarithm of the effective dimension of the distribution.\nProposed geometrical interpretation of the Shannon entropy can be used to prove\nsome information inequalities in an elementary way.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2009 02:47:52 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Jankovic", "Marko V.", ""]]}, {"id": "0909.5006", "submitter": "Mohammad Ali Maddah-Ali Mr.", "authors": "Mohammad Ali Maddah-Ali", "title": "On the Degrees of Freedom of the Compound MIMO Broadcast Channels with\n  Finite States", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple-antenna broadcast channels with $M$ transmit antennas and $K$\nsingle-antenna receivers is considered, where the channel of receiver $r$ takes\none of the $J_r$ finite values. It is assumed that the channel states of each\nreceiver are randomly selected from $\\mathds{R}^{M\\times 1}$ (or from\n$\\mathds{C}^{M\\times 1}$). It is shown that no matter what $J_r$ is, the\ndegrees of freedom (DoF) of $\\frac{MK}{M+K-1}$ is achievable. The achievable\nscheme relies on the idea of interference alignment at receivers, without\nexploiting the possibility of cooperation among transmit antennas. It is proven\nthat if $J_r \\geq M$, $r=1,...,K$, this scheme achieves the optimal DoF. This\nresults implies that when the uncertainty of the base station about the channel\nrealization is considerable, the system loses the gain of cooperation. However,\nit still benefits from the gain of interference alignment. In fact, in this\ncase, the compound broadcast channel is treated as a compound X channel.\n  Moreover, it is shown that when the base station knows the channel states of\nsome of the receivers, a combination of transmit cooperation and interference\nalignment would achieve the optimal DoF.\n  Like time-invariant $K$-user interference channels, the naive vector-space\napproaches of interference management seem insufficient to achieve the optimal\nDoF of this channel. In this paper, we use the Number-Theory approach of\nalignment, recently developed by Motahari et al.[1]. We extend the approach of\n[1] to complex channels as well, therefore all the results that we present are\nvalid for both real and complex channels.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2009 18:38:44 GMT"}, {"version": "v2", "created": "Tue, 29 Sep 2009 19:29:45 GMT"}, {"version": "v3", "created": "Sun, 4 Oct 2009 02:05:21 GMT"}], "update_date": "2009-10-05", "authors_parsed": [["Maddah-Ali", "Mohammad Ali", ""]]}, {"id": "0909.5007", "submitter": "Kenneth Shum", "authors": "Kenneth W. Shum and Chi Wan Sung", "title": "Achieving Capacity of Bi-Directional Tandem Collision Network by Joint\n  Medium-Access Control and Channel-Network Coding", "comments": "Submitted to IEEE Trans. Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In ALOHA-type packetized network, the transmission times of packets follow a\nstochastic process. In this paper, we advocate a deterministic approach for\nchannel multiple-access. Each user is statically assigned a periodic protocol\nsignal, which takes value either zero or one, and transmit packets whenever the\nvalue of the protocol signal is equal to one. On top of this multiple-access\nprotocol, efficient channel coding and network coding schemes are devised. We\nillustrate the idea by constructing a transmission scheme for the tandem\ncollision network, for both slot-synchronous and slot-asynchronous systems.\nThis cross-layer approach is able to achieve the capacity region when the\nnetwork is bi-directional.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2009 05:58:47 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Shum", "Kenneth W.", ""], ["Sung", "Chi Wan", ""]]}, {"id": "0909.5119", "submitter": "Marios Kountouris", "authors": "Jeffrey G. Andrews, Steven Weber, Marios Kountouris, Martin Haenggi", "title": "Random Access Transport Capacity", "comments": "Submitted to IEEE Trans. on Wireless Communications, Sept. 2009", "journal-ref": null, "doi": "10.1109/TWC.2010.06.091432", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a new metric for quantifying end-to-end throughput in multihop\nwireless networks, which we term random access transport capacity, since the\ninterference model presumes uncoordinated transmissions. The metric quantifies\nthe average maximum rate of successful end-to-end transmissions, multiplied by\nthe communication distance, and normalized by the network area. We show that a\nsimple upper bound on this quantity is computable in closed-form in terms of\nkey network parameters when the number of retransmissions is not restricted and\nthe hops are assumed to be equally spaced on a line between the source and\ndestination. We also derive the optimum number of hops and optimal per hop\nsuccess probability and show that our result follows the well-known square root\nscaling law while providing exact expressions for the preconstants as well.\nNumerical results demonstrate that the upper bound is accurate for the purpose\nof determining the optimal hop count and success (or outage) probability.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2009 16:34:00 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Andrews", "Jeffrey G.", ""], ["Weber", "Steven", ""], ["Kountouris", "Marios", ""], ["Haenggi", "Martin", ""]]}, {"id": "0909.5120", "submitter": "George Amariucai", "authors": "George Amariucai and Shuangqing Wei", "title": "Feedback-Based Collaborative Secrecy Encoding over Binary Symmetric\n  Channels", "comments": "Submitted to IEEE Transactions on Information Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CR math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a feedback scheme for transmitting secret messages\nbetween two legitimate parties, over an eavesdropped communication link.\nRelative to Wyner's traditional encoding scheme \\cite{wyner1}, our\nfeedback-based encoding often yields larger rate-equivocation regions and\nachievable secrecy rates. More importantly, by exploiting the channel\nrandomness inherent in the feedback channels, our scheme achieves a strictly\npositive secrecy rate even when the eavesdropper's channel is less noisy than\nthe legitimate receiver's channel. All channels are modeled as binary and\nsymmetric (BSC). We demonstrate the versatility of our feedback-based encoding\nmethod by using it in three different configurations: the stand-alone\nconfiguration, the mixed configuration (when it combines with Wyner's scheme\n\\cite{wyner1}), and the reversed configuration. Depending on the channel\nconditions, significant improvements over Wyner's secrecy capacity can be\nobserved in all configurations.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2009 15:45:18 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Amariucai", "George", ""], ["Wei", "Shuangqing", ""]]}, {"id": "0909.5179", "submitter": "Moshe Mishali", "authors": "Moshe Mishali and Yonina C. Eldar", "title": "Expected RIP: Conditioning of The Modulated Wideband Converter", "comments": "5 pages, 2 figures, to appear ITW'09", "journal-ref": null, "doi": null, "report-no": "CCIT Report #736 July-09, EE Pub No. 1693, EE Dept., Technion -\n  Israel Institute of Technology", "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The sensing matrix of a compressive system impacts the stability of the\nassociated sparse recovery problem. In this paper, we study the sensing matrix\nof the modulated wideband converter, a recently proposed system for sub-Nyquist\nsampling of analog sparse signals. Attempting to quantify the conditioning of\nthe converter sensing matrix with existing approaches leads to unreasonable\nrate requirements, due to the relatively small size of this matrix. We propose\na new conditioning criterion, named the expected restricted isometry property,\nand derive theoretical guarantees for the converter to satisfy this property.\nWe then show that applying these conditions to popular binary sequences, such\nas maximal codes or Gold codes, leads to practical rate requirements.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2009 19:58:59 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Mishali", "Moshe", ""], ["Eldar", "Yonina C.", ""]]}, {"id": "0909.5216", "submitter": "Vincent Tan", "authors": "Vincent Y. F. Tan, Animashree Anandkumar and Alan S. Willsky", "title": "Learning Gaussian Tree Models: Analysis of Error Exponents and Extremal\n  Structures", "comments": "Submitted to Transactions on Signal Processing", "journal-ref": "IEEE Transactions on Signal Processing, May 2010, Volume: 58\n  Issue:5, pages 2701 - 2714", "doi": "10.1109/TSP.2010.2042478", "report-no": null, "categories": "stat.ML cs.IT math.IT math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of learning tree-structured Gaussian graphical models from\nindependent and identically distributed (i.i.d.) samples is considered. The\ninfluence of the tree structure and the parameters of the Gaussian distribution\non the learning rate as the number of samples increases is discussed.\nSpecifically, the error exponent corresponding to the event that the estimated\ntree structure differs from the actual unknown tree structure of the\ndistribution is analyzed. Finding the error exponent reduces to a least-squares\nproblem in the very noisy learning regime. In this regime, it is shown that the\nextremal tree structure that minimizes the error exponent is the star for any\nfixed set of correlation coefficients on the edges of the tree. If the\nmagnitudes of all the correlation coefficients are less than 0.63, it is also\nshown that the tree structure that maximizes the error exponent is the Markov\nchain. In other words, the star and the chain graphs represent the hardest and\nthe easiest structures to learn in the class of tree-structured Gaussian\ngraphical models. This result can also be intuitively explained by correlation\ndecay: pairs of nodes which are far apart, in terms of graph distance, are\nunlikely to be mistaken as edges by the maximum-likelihood estimator in the\nasymptotic regime.\n", "versions": [{"version": "v1", "created": "Mon, 28 Sep 2009 20:49:32 GMT"}, {"version": "v2", "created": "Tue, 5 Jan 2010 02:26:58 GMT"}], "update_date": "2010-05-06", "authors_parsed": [["Tan", "Vincent Y. F.", ""], ["Anandkumar", "Animashree", ""], ["Willsky", "Alan S.", ""]]}, {"id": "0909.5268", "submitter": "Bikash Kumar Dey", "authors": "Sagar Shenvi and Bikash Kumar Dey", "title": "A Simple Necessary and Sufficient Condition for the Double Unicast\n  Problem", "comments": "5 pages, 6 figures. Revised Version. Final manuscript for ICC 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a directed acyclic network where there are two source-terminal\npairs and the terminals need to receive the symbols generated at the respective\nsources. Each source independently generates an i.i.d. random process over the\nsame alphabet. Each edge in the network is error-free, delay-free, and can\ncarry one symbol from the alphabet per use. We give a simple necessary and\nsufficient condition for being able to simultaneously satisfy the unicast\nrequirements of the two source-terminal pairs at rate-pair $(1,1)$ using vector\nnetwork coding. The condition is also sufficient for doing this using only\n\"XOR\" network coding and is much simpler compared to the necessary and\nsufficient conditions known from previous work. Our condition also yields a\nsimple characterization of the capacity region of a double-unicast network\nwhich does not support the rate-pair $(1,1)$.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2009 06:15:14 GMT"}, {"version": "v2", "created": "Thu, 1 Oct 2009 11:47:48 GMT"}, {"version": "v3", "created": "Thu, 4 Feb 2010 16:52:04 GMT"}], "update_date": "2010-02-04", "authors_parsed": [["Shenvi", "Sagar", ""], ["Dey", "Bikash Kumar", ""]]}, {"id": "0909.5310", "submitter": "Doha Hamza Mrs.", "authors": "Doha Hamza, Mohammed Nafie", "title": "Cognitive Power Control Under Correlated Fading and Primary-Link CSI", "comments": "5 pages, 4 figures, submitted to ICC 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the cognitive power control problem of maximizing the secondary\nthroughput under an outage probability constraint on a constant-power\nconstant-rate primary link. We assume a temporally correlated primary channel\nwith two types of feedback: perfect delayed channel state information (CSI) and\none-bit automatic repeat request (ARQ). We use channel correlation to enhance\nthe primary and secondary throughput via exploiting the CSI feedback to predict\nthe future primary channel gain. We provide a numerical solution for the power\ncontrol optimization problem under delayed CSI. In order to make the solution\ntractable under ARQ-CSI, we re-formulate the cognitive power control problem as\nthe maximization of the instantaneous weighted sum of primary and secondary\nthroughput. We propose a greedy ARQ-CSI algorithm that is shown to achieve an\naverage throughput comparable to that attained under the delayed-CSI algorithm,\nwhich we solve optimally.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2009 11:50:40 GMT"}], "update_date": "2009-09-30", "authors_parsed": [["Hamza", "Doha", ""], ["Nafie", "Mohammed", ""]]}, {"id": "0909.5424", "submitter": "Chinmay Vaze", "authors": "Chinmay S. Vaze and Mahesh K. Varanasi", "title": "The Degrees of Freedom Regions of MIMO Broadcast, Interference, and\n  Cognitive Radio Channels with No CSIT", "comments": "49 pages, 11 figures, under review, IEEE Trans. Inform. Th. Submitted\n  Sept. 2009, Revised Jan. 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The degrees of freedom (DoF) regions are characterized for the multiple-input\nmultiple-output (MIMO) broadcast channel (BC), interference channels (IC)\n(including X and multi-hop interference channels) and the cognitive radio\nchannel (CRC), when there is perfect and no channel state information at the\nreceivers and the transmitter(s) (CSIR and CSIT), respectively. For the K-user\nMIMO BC, the exact characterization of the DoF region is obtained, which shows\nthat a simple time-division-based transmission scheme is DoF-region optimal.\nUsing the techniques developed for the MIMO BC, the corresponding problems for\nthe two-user MIMO IC and the CRC are addressed. For both of these channels,\ninner and outer bounds to the DoF region are obtained and are seen to coincide\nfor a vast majority of the relative numbers of antennas at the four terminals,\nthereby characterizing DoF regions for all but a few cases. Finally, the DoF\nregions of the $K$-user MIMO IC, the CRC, and X networks are derived for\ncertain classes of these networks, including the one where all transmitters\nhave an equal number of antennas and so do all receivers. The results of this\npaper are derived for distributions of fading channel matrices and additive\nnoises that are more general than those considered in other simultaneous\nrelated works. The DoF regions with and without CSIT are compared and\nconditions on the relative numbers of antennas at the terminals under which a\nlack of CSIT does, or does not, result in the loss of DoF are identified,\nthereby providing, on the one hand, simple and robust communication schemes\nthat don't require CSIT but have the same DoF performance as their previously\nfound CSIT counterparts, and on the other hand, identifying situations where\nCSI feedback to transmitters would provide gains that are significant enough\nthat even the DoF performance could be improved.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2009 19:59:16 GMT"}, {"version": "v2", "created": "Mon, 19 Oct 2009 16:36:27 GMT"}, {"version": "v3", "created": "Sun, 23 Jan 2011 06:03:41 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Vaze", "Chinmay S.", ""], ["Varanasi", "Mahesh K.", ""]]}, {"id": "0909.5450", "submitter": "Cihan Tepedelenlioglu", "authors": "Cihan Tepedelenlioglu and Adarsh B. Narasimhamurthy", "title": "Robust Distributed Estimation over Multiple Access Channels with\n  Constant Modulus Signaling", "comments": "28 pages, 10 figures, submitted to IEEE Transactions on Signal\n  Processing for consideration", "journal-ref": null, "doi": "10.1109/TSP.2010.2051432", "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A distributed estimation scheme where the sensors transmit with constant\nmodulus signals over a multiple access channel is considered. The proposed\nestimator is shown to be strongly consistent for any sensing noise distribution\nin the i.i.d. case both for a per-sensor power constraint, and a total power\nconstraint. When the distributions of the sensing noise are not identical, a\nbound on the variances is shown to establish strong consistency. The estimator\nis shown to be asymptotically normal with a variance (AsV) that depends on the\ncharacteristic function of the sensing noise. Optimization of the AsV is\nconsidered with respect to a transmission phase parameter for a variety of\nnoise distributions exhibiting differing levels of impulsive behavior. The\nrobustness of the estimator to impulsive sensing noise distributions such as\nthose with positive excess kurtosis, or those that do not have finite moments\nis shown. The proposed estimator is favorably compared with the amplify and\nforward scheme under an impulsive noise scenario. The effect of fading is shown\nto not affect the consistency of the estimator, but to scale the asymptotic\nvariance by a constant fading penalty depending on the fading statistics.\nSimulations corroborate our analytical results.\n", "versions": [{"version": "v1", "created": "Tue, 29 Sep 2009 21:35:28 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Tepedelenlioglu", "Cihan", ""], ["Narasimhamurthy", "Adarsh B.", ""]]}, {"id": "0909.5457", "submitter": "Prateek Jain", "authors": "Raghu Meka, Prateek Jain, Inderjit S. Dhillon", "title": "Guaranteed Rank Minimization via Singular Value Projection", "comments": "An earlier version of this paper was submitted to NIPS-2009 on June\n  5, 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Minimizing the rank of a matrix subject to affine constraints is a\nfundamental problem with many important applications in machine learning and\nstatistics. In this paper we propose a simple and fast algorithm SVP (Singular\nValue Projection) for rank minimization with affine constraints (ARMP) and show\nthat SVP recovers the minimum rank solution for affine constraints that satisfy\nthe \"restricted isometry property\" and show robustness of our method to noise.\nOur results improve upon a recent breakthrough by Recht, Fazel and Parillo\n(RFP07) and Lee and Bresler (LB09) in three significant ways:\n  1) our method (SVP) is significantly simpler to analyze and easier to\nimplement,\n  2) we give recovery guarantees under strictly weaker isometry assumptions\n  3) we give geometric convergence guarantees for SVP even in presense of noise\nand, as demonstrated empirically, SVP is significantly faster on real-world and\nsynthetic problems.\n  In addition, we address the practically important problem of low-rank matrix\ncompletion (MCP), which can be seen as a special case of ARMP. We empirically\ndemonstrate that our algorithm recovers low-rank incoherent matrices from an\nalmost optimal number of uniformly sampled entries. We make partial progress\ntowards proving exact recovery and provide some intuition for the strong\nperformance of SVP applied to matrix completion by showing a more restricted\nisometry property. Our algorithm outperforms existing methods, such as those of\n\\cite{RFP07,CR08,CT09,CCS08,KOM09,LB09}, for ARMP and the matrix-completion\nproblem by an order of magnitude and is also significantly more robust to\nnoise.\n", "versions": [{"version": "v1", "created": "Wed, 30 Sep 2009 14:44:54 GMT"}, {"version": "v2", "created": "Mon, 19 Oct 2009 19:32:44 GMT"}, {"version": "v3", "created": "Mon, 19 Oct 2009 21:21:57 GMT"}], "update_date": "2009-10-20", "authors_parsed": [["Meka", "Raghu", ""], ["Jain", "Prateek", ""], ["Dhillon", "Inderjit S.", ""]]}, {"id": "0909.5507", "submitter": "Cuizhu Shi", "authors": "Cuizhu Shi and Aditya Ramamoorthy", "title": "Fast Algorithm for Finding Unicast Capacity of Linear Deterministic\n  Wireless Relay Networks", "comments": "27 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The deterministic channel model for wireless relay networks proposed by\nAvestimehr, Diggavi and Tse `07 has captured the broadcast and inference nature\nof wireless communications and has been widely used in approximating the\ncapacity of wireless relay networks. The authors generalized the max-flow\nmin-cut theorem to the linear deterministic wireless relay networks and\ncharacterized the unicast capacity of such deterministic network as the minimum\nrank of all the binary adjacency matrices describing source-destination cuts\nwhose number grows exponentially with the size of the network. In this paper,\nwe developed a fast algorithm for finding the unicast capacity of a linear\ndeterministic wireless relay network by finding the maximum number of linearly\nindependent paths using the idea of path augmentation. We developed a modified\ndepth-first search algorithm tailored for the linear deterministic relay\nnetworks for finding linearly independent paths whose total number proved to\nequal the unicast capacity of the underlying network. The result of our\nalgorithm suggests a capacity-achieving transmission strategy with one-bit\nlength linear encoding at the relay nodes in the concerned linear deterministic\nwireless relay network. The correctness of our algorithm for universal cases is\ngiven by our proof in the paper. Moreover, our algorithm has a computational\ncomplexity bounded by $O(|{\\cal{V}}_x|\\cdot C^4+d\\cdot |{\\cal{V}}_x|\\cdot C^3)$\nwhich shows a significant improvement over the previous results for solving the\nsame problem by Amaudruz and Fragouli (whose complexity is bounded by $O(M\\cdot\n|{\\cal{E}}|\\cdot C^5)$ with $M\\geq d$ and $|{\\cal{E}}|\\geq|{\\cal{V}}_x|$) and\nby Yazdi and Savari (whose complexity is bounded by $O(L^8\\cdot M^{12}\\cdot\nh_0^3+L\\cdot M^6\\cdot C\\cdot h_0^4)$ with $h_0\\geq C$).\n", "versions": [{"version": "v1", "created": "Wed, 30 Sep 2009 04:29:48 GMT"}], "update_date": "2009-10-01", "authors_parsed": [["Shi", "Cuizhu", ""], ["Ramamoorthy", "Aditya", ""]]}, {"id": "0909.5669", "submitter": "Alexander Davydov A", "authors": "Alexander A. Davydov, Massimo Giulietti, Stefano Marcugini and\n  Fernanda Pambianco", "title": "Some combinatorial aspects of constructing bipartite-graph codes", "comments": "27 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose geometrical methods for constructing square 01-matrices with the\nsame number n of units in every row and column, and such that any two rows of\nthe matrix contain at most one unit in common. These matrices are equivalent to\nn-regular bipartite graphs without 4-cycles, and therefore can be used for the\nconstruction of efficient bipartite-graph codes such that both the classes of\nits vertices are associated with local constraints. We significantly extend the\nregion of parameters m,n for which there exist an n-regular bipartite graph\nwith 2m vertices and without 4-cycles. In that way we essentially increase the\nregion of lengths and rates of the corresponding bipartite-graph codes. Many\nnew matrices are either circulant or consist of circulant submatrices: this\nprovides code parity-check matrices consisting of circulant submatrices, and\nhence quasi-cyclic bipartite-graph codes with simple implementation.\n", "versions": [{"version": "v1", "created": "Wed, 30 Sep 2009 17:21:18 GMT"}], "update_date": "2009-10-01", "authors_parsed": [["Davydov", "Alexander A.", ""], ["Giulietti", "Massimo", ""], ["Marcugini", "Stefano", ""], ["Pambianco", "Fernanda", ""]]}]