[{"id": "1802.00162", "submitter": "Shahbaz Rezaei", "authors": "Shahbaz Rezaei, Mohammed Gharib, and Ali Movaghar", "title": "Throughput Analysis of IEEE 802.11 Multi-hop Wireless Networks with\n  Routing Consideration: A General Framework", "comments": null, "journal-ref": "IEEE Transactions on Communications 66 (2018) 5430-5443", "doi": "10.1109/TCOMM.2018.2848905", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The end-to-end throughput of multi-hop communication in wireless ad hoc\nnetworks is affected by the conflict between forwarding nodes. It has been\nshown that sending more packets than maximum achievable end-to-end throughput\nnot only fails to increase throughput, but also decreases throughput owing to\nhigh contention and collision. Accordingly, it is of crucial importance for a\nsource node to know the maximum end-to-end throughput. The end-to-end\nthroughput depends on multiple factors, such as physical layer limitations, MAC\nprotocol properties, routing policy and nodes distribution. There have been\nmany studies on analytical modeling of end-to-end throughput but none of them\nhas taken routing policy and nodes distribution as well as MAC layer altogether\ninto account. In this paper, the end-to-end throughput with perfect MAC layer\nis obtained based on routing policy and nodes distribution in one and two\ndimensional networks. Then, imperfections of IEEE 802:11 protocol is added to\nthe model to obtain precise value. An exhaustive simulation is also made to\nvalidate the proposed models using NS2 simulator. Results show that if the\ndistribution to the next hop for a particular routing policy is known, our\nmethodology can obtain the maximum end-to-end throughput precisely.\n", "versions": [{"version": "v1", "created": "Thu, 1 Feb 2018 05:36:41 GMT"}], "update_date": "2019-05-15", "authors_parsed": [["Rezaei", "Shahbaz", ""], ["Gharib", "Mohammed", ""], ["Movaghar", "Ali", ""]]}, {"id": "1802.00163", "submitter": "Shahbaz Rezaei", "authors": "Shahbaz Rezaei, and Ali Mohammad Afshin Hemmatyar", "title": "Study of Uniform Jitter Mechanism for Metric-based Wireless Routing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many wireless protocols wait a small and random amount of time which is\ncalled jitter before sending a packet to avoid high contention and packet\ncollision. Jitter has been already proposed for many routing protocols\nincluding AODV and LOADng. However, since they do not consider any link quality\nparameters or metrics (such as ETX) in routing, they fail to be efficient in\nmetric-based routing protocols. A metric-based jitter mechanism is proposed in\nthis paper and a closed form expression is derived that enables us to obtain\nthe probability of delay inversion for all jitter mechanisms available.\nSimulation results are also presented to show the performance of different\njitter mechanisms.\n", "versions": [{"version": "v1", "created": "Thu, 1 Feb 2018 05:41:22 GMT"}], "update_date": "2018-02-02", "authors_parsed": [["Rezaei", "Shahbaz", ""], ["Hemmatyar", "Ali Mohammad Afshin", ""]]}, {"id": "1802.00342", "submitter": "Alexandros A. Voudouris", "authors": "Adelina Madhja, Sotiris Nikoletseas, Alexandros A. Voudouris", "title": "Adaptive wireless power transfer in mobile Ad Hoc networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the interesting impact of mobility on the problem of efficient\nwireless power transfer in ad hoc networks. We consider a set of mobile agents\n(consuming energy to perform certain sensing and communication tasks), and a\nsingle static charger (with finite energy) which can recharge the agents when\nthey get in its range. In particular, we focus on the problem of efficiently\ncomputing the appropriate range of the charger with the goal of prolonging the\nnetwork lifetime. We first demonstrate (under the realistic assumption of fixed\nenergy supplies) the limitations of any fixed charging range and, therefore,\nthe need for (and power of) a dynamic selection of the charging range, by\nadapting to the behavior of the mobile agents which is revealed in an online\nmanner. We investigate the complexity of optimizing the selection of such an\nadaptive charging range, by showing that two simplified offline optimization\nproblems (closely related to the online one) are NP-hard. To effectively\naddress the involved performance trade-offs, we finally present a variety of\nadaptive heuristics, assuming different levels of agent information regarding\ntheir mobility and energy.\n", "versions": [{"version": "v1", "created": "Thu, 1 Feb 2018 15:22:37 GMT"}, {"version": "v2", "created": "Mon, 12 Mar 2018 16:17:09 GMT"}, {"version": "v3", "created": "Wed, 8 Apr 2020 16:30:50 GMT"}], "update_date": "2020-04-09", "authors_parsed": [["Madhja", "Adelina", ""], ["Nikoletseas", "Sotiris", ""], ["Voudouris", "Alexandros A.", ""]]}, {"id": "1802.00402", "submitter": "Joerg-Peter Elbers", "authors": "Klaus Grobe and Joerg-Peter Elbers", "title": "Analysis of WDM-PON for Next-Generation Back- and Fronthaul", "comments": "The work leading to these results has received funding from the\n  European Union's Seventh Framework Program (FP7) under Grant Agreement No.\n  317762 (COMBO), and from the European Union's Horizon 2020 Research and\n  Innovation Program under Grant Agreement No. 644526 (iCirrus)", "journal-ref": "Proc. 10th ITG-Symposium on Broadband Coverage in Germany (2016),\n  ISBN 978-3-8007-4193-9", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An analysis of next-generation infrastructure for mobile back- and fronthaul\nis presented. The same infrastructure can be used for wireline backhaul and\ndedicated business access. Possible coexistence with FTTH residential access\nbased on NG-PON2 TWDM is also analyzed. Further, different locations for pools\nof base-band units in fronthaul scenarios are compared with regard to resulting\ncost. It turns out that fronthaul with highly concentrated base-band unit pools\ncan be cost-efficient even if fronthaul bit rates reach 10 Gb/s.\n", "versions": [{"version": "v1", "created": "Thu, 1 Feb 2018 17:24:23 GMT"}], "update_date": "2018-02-02", "authors_parsed": [["Grobe", "Klaus", ""], ["Elbers", "Joerg-Peter", ""]]}, {"id": "1802.00431", "submitter": "Abdulrahman Baknina", "authors": "Abdulrahman Baknina and Sennur Ulukus", "title": "Coded Status Updates in an Energy Harvesting Erasure Channel", "comments": "To appear in CISS 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI eess.SP math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an energy harvesting transmitter sending status updates to a\nreceiver over an erasure channel, where each status update is of length $k$\nsymbols. The energy arrivals and the channel erasures are independent and\nidentically distributed (i.i.d.) and Bernoulli distributed in each slot. In\norder to combat the effects of the erasures in the channel and the uncertainty\nin the energy arrivals, we use channel coding to encode the status update\nsymbols. We consider two types of channel coding: maximum distance separable\n(MDS) codes and rateless erasure codes. For each of these models, we study two\nachievable schemes: best-effort and save-and-transmit. In the best-effort\nscheme, the transmitter starts transmission right away, and sends a symbol if\nit has energy. In the save-and-transmit scheme, the transmitter remains silent\nin the beginning in order to save some energy to minimize energy outages in\nfuture slots. We analyze the average age of information (AoI) under each of\nthese policies. We show through numerical results that as the average recharge\nrate decreases, MDS coding with save-and-transmit outperforms all best-effort\nschemes. We show that rateless coding with save-and-transmit outperforms all\nthe other schemes.\n", "versions": [{"version": "v1", "created": "Thu, 1 Feb 2018 18:50:13 GMT"}], "update_date": "2018-02-02", "authors_parsed": [["Baknina", "Abdulrahman", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1802.00508", "submitter": "Somnath Chakrabarti", "authors": "Dmitrii Kuvaiskii, Somnath Chakrabarti, Mona Vij", "title": "Snort Intrusion Detection System with Intel Software Guard Extension\n  (Intel SGX)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network Function Virtualization (NFV) promises the benefits of reduced\ninfrastructure, personnel, and management costs by outsourcing network\nmiddleboxes to the public or private cloud. Unfortunately, running network\nfunctions in the cloud entails security challenges, especially for complex\nstateful services. In this paper, we describe our experiences with hardening\nthe king of middleboxes - Intrusion Detection Systems (IDS) - using Intel\nSoftware Guard Extensions (Intel SGX) technology. Our IDS secured using Intel\nSGX, called SEC-IDS, is an unmodified Snort 3 with a DPDK network layer that\nachieves 10Gbps line rate. SEC-IDS guarantees computational integrity by\nrunning all Snort code inside an Intel SGX enclave. At the same time, SEC-IDS\nachieves near-native performance, with throughput close to 100 percent of\nvanilla Snort 3, by retaining network I/O outside of the enclave. Our\nexperiments indicate that performance is only constrained by the modest Enclave\nPage Cache size available on current Intel SGX Skylake based E3 Xeon platforms.\nFinally, we kept the porting effort minimal by using the Graphene-SGX library\nOS. Only 27 Lines of Code (LoC) were modified in Snort and 178 LoC in\nGraphene-SGX itself.\n", "versions": [{"version": "v1", "created": "Thu, 1 Feb 2018 22:11:50 GMT"}], "update_date": "2018-02-05", "authors_parsed": [["Kuvaiskii", "Dmitrii", ""], ["Chakrabarti", "Somnath", ""], ["Vij", "Mona", ""]]}, {"id": "1802.00521", "submitter": "Anil Kumar Chorppath", "authors": "Frank Gabriel, Anil Kumar Chorppath, Ievgenii Tsokalo, Frank H.P.\n  Fitzek", "title": "Multipath Communication with Finite Sliding Window Network Coding for\n  Ultra-Reliability and Low Latency", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use random linear network coding (RLNC) based scheme for multipath\ncommunication in the presence of lossy links with different delay\ncharacteristics to obtain ultra-reliability and low latency. A sliding window\nversion of RLNC is proposed where the coded packets are generated using packets\nin a window size and are inserted among systematic packets in different paths.\nThe packets are scheduled in the paths in a round robin fashion proportional to\nthe data rates. We use finite encoding and decoding window size and do not rely\non feedback for closing the sliding window, unlike the previous work. Our\nimplementation of two paths with LTE and WiFi characteristics shows that the\nproposed sliding window scheme achieves better latency compared to the block\nRLNC code. It is also shown that the proposed scheme achieves low latency\ncommunication through multiple paths compared to the individual paths for\nbursty traffic by translating the throughput on both the paths into latency\ngain.\n", "versions": [{"version": "v1", "created": "Fri, 2 Feb 2018 00:03:53 GMT"}], "update_date": "2018-02-05", "authors_parsed": [["Gabriel", "Frank", ""], ["Chorppath", "Anil Kumar", ""], ["Tsokalo", "Ievgenii", ""], ["Fitzek", "Frank H. P.", ""]]}, {"id": "1802.00800", "submitter": "Ashkan Yousefpour", "authors": "Ashkan Yousefpour, Ashish Patil, Genya Ishigaki, Inwoong Kim, Xi Wang,\n  Hakki C. Cankaya, Qiong Zhang, Weisheng Xie, Jason P. Jue", "title": "QoS-aware Dynamic Fog Service Provisioning", "comments": "Accepted for publication in IEEE Internet of Things Journal, 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent advances in the areas of Internet of Things (IoT), Big Data, and\nMachine Learning have contributed to the rise of a growing number of complex\napplications. These applications will be data-intensive, delay-sensitive, and\nreal-time as smart devices prevail more in our daily life. Ensuring Quality of\nService (QoS) for delay-sensitive applications is a must, and fog computing is\nseen as one of the primary enablers for satisfying such tight QoS requirements,\nas it puts compute, storage, and networking resources closer to the user. In\nthis paper, we first introduce FogPlan, a framework for QoS-aware Dynamic Fog\nService Provisioning (QDFSP). QDFSP concerns the dynamic deployment of\napplication services on fog nodes, or the release of application services that\nhave previously been deployed on fog nodes, in order to meet low latency and\nQoS requirements of applications while minimizing cost. FogPlan framework is\npractical and operates with no assumptions and minimal information about IoT\nnodes. Next, we present a possible formulation (as an optimization problem) and\ntwo efficient greedy algorithms for addressing the QDFSP at one instance of\ntime. Finally, the FogPlan framework is evaluated using a simulation based on\nreal-world traffic traces.\n", "versions": [{"version": "v1", "created": "Fri, 2 Feb 2018 18:51:08 GMT"}, {"version": "v2", "created": "Sat, 26 Jan 2019 23:15:17 GMT"}], "update_date": "2019-01-29", "authors_parsed": [["Yousefpour", "Ashkan", ""], ["Patil", "Ashish", ""], ["Ishigaki", "Genya", ""], ["Kim", "Inwoong", ""], ["Wang", "Xi", ""], ["Cankaya", "Hakki C.", ""], ["Zhang", "Qiong", ""], ["Xie", "Weisheng", ""], ["Jue", "Jason P.", ""]]}, {"id": "1802.00893", "submitter": "Yuhua Zhang", "authors": "Xiaofei Wang, Yuhua Zhang, Victor C. M. Leung, Nadra Guizani, Tianpeng\n  Jiang", "title": "D2D Big Data: Content Deliveries over Wireless Device-to-Device Sharing\n  in Large Scale Mobile Networks", "comments": "13 pages, 6 figures, IEEE Wireless Communications Magazine", "journal-ref": "IEEE Wireless Commun., vol. 25, no.1, pp. 1-10, 2018", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently the topic of how to effectively offload cellular traffic onto\ndevice-to-device (D2D) sharing among users in proximity has been gaining more\nand more attention of global researchers and engineers. Users utilize wireless\nshort-range D2D communications for sharing contents locally, due to not only\nthe rapid sharing experience and free cost, but also high accuracy on\ndeliveries of interesting and popular contents, as well as strong social\nimpacts among friends. Nevertheless, the existing related studies are mostly\nconfined to small-scale datasets, limited dimensions of user features, or\nunrealistic assumptions and hypotheses on user behaviors. In this article,\ndriven by emerging Big Data techniques, we propose to design a big data\nplatform, named D2D Big Data, in order to encourage the wireless D2D\ncommunications among users effectively, to promote contents for providers\naccurately, and to carry out offloading intelligence for operators efficiently.\nWe deploy a big data platform and further utilize a large-scale dataset (3.56\nTBytes) from a popular D2D sharing application (APP), which contains 866\nmillion D2D sharing activities on 4.5 million files disseminated via nearly 850\nmillion users in 13 weeks. By abstracting and analyzing multidimensional\nfeatures, including online behaviors, content properties, location relations,\nstructural characteristics, meeting dynamics, social arborescence, privacy\npreservation policies and so on, we verify and evaluate the D2D Big Data\nplatform regarding predictive content propagating coverage. Finally, we discuss\nchallenges and opportunities regarding D2D Big Data and propose to unveil a\npromising upcoming future of wireless D2D communications.\n", "versions": [{"version": "v1", "created": "Sat, 3 Feb 2018 01:53:24 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Wang", "Xiaofei", ""], ["Zhang", "Yuhua", ""], ["Leung", "Victor C. M.", ""], ["Guizani", "Nadra", ""], ["Jiang", "Tianpeng", ""]]}, {"id": "1802.00922", "submitter": "Amr Alanwar", "authors": "Amr Alanwar, Fatima M. Anwar, Joao P Hespanha, Mani Srivastava", "title": "Realizing Uncertainty-Aware Timing Stack in Embedded Operating System", "comments": "In Proc. of the Embedded Operating Systems Workshop, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.NI cs.OS cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Time awareness is critical to a broad range of emerging applications -- in\nCyber-Physical Systems and Internet of Things -- running on commodity platforms\nand operating systems. Traditionally, time is synchronized across devices\nthrough a best-effort background service whose performance is neither\nobservable nor controllable, thus consuming system resources independently of\napplication needs while not allowing the applications and OS services to adapt\nto changes in uncertainty in system time. We advocate for rethinking how time\nis managed in a system stack. In this paper, we propose a new clock model that\ncharacterizes various sources of timing uncertainties in true time. We then\npresent a Kalman filter based time synchronization protocol that adapts to the\nuncertainties exposed by the clock model. Our realization of a\nuncertainty-aware clock model and synchronization protocol is based on a\nstandard embedded Linux platform.\n", "versions": [{"version": "v1", "created": "Sat, 3 Feb 2018 06:18:56 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Alanwar", "Amr", ""], ["Anwar", "Fatima M.", ""], ["Hespanha", "Joao P", ""], ["Srivastava", "Mani", ""]]}, {"id": "1802.01088", "submitter": "Jeemin  Kim", "authors": "Seunghwan Kim, Han Cha, Jeemin Kim, Seung-Woo Ko, and Seong-Lyun Kim", "title": "Sense-and-Predict: Harnessing Spatial Interference Correlation for\n  Cognitive Radio Networks", "comments": null, "journal-ref": "IEEE Transactions on Wireless Communications ( Volume: 18 , Issue:\n  5 , May 2019 )", "doi": "10.1109/TWC.2019.2908168", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cognitive radio (CR) is a key enabler realizing future networks to achieve\nhigher spectral efficiency by allowing spectrum sharing between different\nwireless networks. It is important to explore whether spectrum access\nopportunities are available, but conventional CR based on transmitter (TX)\nsensing cannot be used to this end because the paired receiver (RX) may\nexperience different levels of interference, according to the extent of their\nseparation, blockages, and beam directions. To address this problem, this paper\nproposes a novel form of medium access control (MAC) termed sense-and-predict\n(SaP), whereby each secondary TX predicts the interference level at the RX\nbased on the sensed interference at the TX; this can be quantified in terms of\na spatial interference correlation between the two locations. Using stochastic\ngeometry, the spatial interference correlation can be expressed in the form of\na conditional coverage probability, such that the signal-to-interference ratio\n(SIR) at the RX is no less than a predetermined threshold given the sensed\ninterference at the TX, defined as an opportunistic probability (OP). The\nsecondary TX randomly accesses the spectrum depending on OP. We optimize the\nSaP framework to maximize the area spectral efficiencies (ASEs) of secondary\nnetworks while guaranteeing the service quality of the primary networks.\nTestbed experiments using USRP and MATLAB simulations show that SaP affords\nhigher ASEs compared with CR without prediction.\n", "versions": [{"version": "v1", "created": "Sun, 4 Feb 2018 08:07:32 GMT"}, {"version": "v2", "created": "Fri, 5 Oct 2018 07:26:02 GMT"}, {"version": "v3", "created": "Mon, 8 Oct 2018 02:54:55 GMT"}, {"version": "v4", "created": "Mon, 4 Feb 2019 20:39:55 GMT"}], "update_date": "2019-12-17", "authors_parsed": [["Kim", "Seunghwan", ""], ["Cha", "Han", ""], ["Kim", "Jeemin", ""], ["Ko", "Seung-Woo", ""], ["Kim", "Seong-Lyun", ""]]}, {"id": "1802.01104", "submitter": "Megumi Kaneko", "authors": "Nicolas Pontois, Megumi Kaneko, Thi Ha Ly Dinh and Lila Boukhatem", "title": "User Pre-Scheduling and Beamforming with Imperfect CSI in 5G Fog Radio\n  Access Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the user-to-cell association (or user-clustering) and\nbeamforming design for Cloud Radio Access Networks (CRANs) and Fog Radio Access\nNetworks (FogRANs) for 5G. CRAN enables cloud centralized resource and power\nallocation optimization over all the small cells served by multiple Access\nPoints (APs). However, the fronthaul links connecting each AP to the cloud\nintroduce delays and cause outdated Channel State Information (CSI). By\ncontrast, FogRAN enables lower latencies and better CSI qualities, at the cost\nof local optimization. To alleviate these issues, we propose a hybrid algorithm\nexploiting both the centralized feature of the cloud for globally-optimized\npre-scheduling using outdated CSIs and the distributed nature of FogRAN for\naccurate beamforming with high quality CSIs. The centralized phase enables to\nconsider the interference patterns over the global network, while the\ndistributed phase allows for latency reduction. Simulation results show that\nour hybrid algorithm for FogRAN outperforms the centralized algorithm under\nimperfect CSI, both in terms of throughput and delays.\n", "versions": [{"version": "v1", "created": "Sun, 4 Feb 2018 10:19:45 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Pontois", "Nicolas", ""], ["Kaneko", "Megumi", ""], ["Dinh", "Thi Ha Ly", ""], ["Boukhatem", "Lila", ""]]}, {"id": "1802.01117", "submitter": "Syed Awais Wahab Shah", "authors": "Syed Awais Wahab Shah, Tamer Khattab, Muhammad Zeeshan Shakir,\n  Mohammad Galal Khafagy, Mazen Omar Hasna", "title": "Small Cell Association with Networked Flying Platforms: Novel Algorithms\n  and Performance Bounds", "comments": "Submitted to IEEE JSAC Special Issue on Airborne Communication\n  Networks 2018, 30 pages and 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fifth generation (5G) and beyond-5G (B5G) systems expect coverage and\ncapacity enhancements along with the consideration of limited power, cost and\nspectrum. Densification of small cells (SCs) is a promising approach to cater\nthese demands of 5G and B5G systems. However, such an ultra dense network of\nSCs requires provision of smart backhaul and fronthaul networks. In this paper,\nwe employ a scalable idea of using networked flying platforms (NFPs) as aerial\nhubs to provide fronthaul connectivity to the SCs. We consider the association\nproblem of SCs and NFPs in a SC network and study the effect of practical\nconstraints related to the system and NFPs. Mainly, we show that the\nassociation problem is related to the generalized assignment problem (GAP).\nUsing this relation with the GAP, we show the NP-hard complexity of the\nassociation problem and further derive an upper bound for the maximum\nachievable sum data rate. Linear Programming relaxation of the problem is also\nstudied to compare the results with the derived bounds. Finally, two efficient\n(less complex) greedy solutions of the association problem are presented, where\none of them is a distributed solution and the other one is its centralized\nversion. Numerical results show a favorable performance of the presented\nalgorithms with respect to the exhaustive search and derived bounds. The\ncomputational complexity comparison of the algorithms with the exhaustive\nsearch is also presented to show that the presented algorithms can be\npractically implemented.\n", "versions": [{"version": "v1", "created": "Sun, 4 Feb 2018 12:38:33 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Shah", "Syed Awais Wahab", ""], ["Khattab", "Tamer", ""], ["Shakir", "Muhammad Zeeshan", ""], ["Khafagy", "Mohammad Galal", ""], ["Hasna", "Mazen Omar", ""]]}, {"id": "1802.01289", "submitter": "Wee Peng Tay", "authors": "Wuqiong Luo and Wee Peng Tay and Peng Sun and Yonggang Wen", "title": "On Distributed Algorithms for Cost-Efficient Data Center Placement in\n  Cloud Computing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing popularity of cloud computing has resulted in a proliferation\nof data centers. Effective placement of data centers improves network\nperformance and minimizes clients' perceived latency. The problem of\ndetermining the optimal placement of data centers in a large network is a\nclassical uncapacitated $k$-median problem. Traditional works have focused on\ncentralized algorithms, which requires knowledge of the overall network\ntopology and information about the customers' service demands. Moreover,\ncentralized algorithms are computationally expensive and do not scale well with\nthe size of the network. We propose a fully distributed algorithm with linear\ncomplexity to optimize the locations of data centers. The proposed algorithm\nutilizes an iterative two-step optimization approach. Specifically, in each\niteration, it first partitions the whole network into $k$ regions through a\ndistributed partitioning algorithm; then within each region, it determines the\nlocal approximate optimal location through a distributed message-passing\nalgorithm. When the underlying network is a tree topology, we show that the\noverall cost is monotonically decreasing between successive iterations and the\nproposed algorithm converges in a finite number of iterations. Extensive\nsimulations on both synthetic and real Internet topologies show that the\nproposed algorithm achieves performance comparable with that of centralized\nalgorithms that require global information and have higher computational\ncomplexity.\n", "versions": [{"version": "v1", "created": "Mon, 5 Feb 2018 07:26:12 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Luo", "Wuqiong", ""], ["Tay", "Wee Peng", ""], ["Sun", "Peng", ""], ["Wen", "Yonggang", ""]]}, {"id": "1802.01316", "submitter": "Mattia Rebato", "authors": "Mattia Rebato and Laura Resteghini and Christian Mazzucco and Michele\n  Zorzi", "title": "Study of Realistic Antenna Patterns in 5G mmWave Cellular Scenarios", "comments": "to be published in 2018 IEEE ICC Communications QoS, Reliability, and\n  Modeling Symposium (ICC18 CQRM), Kansas City, USA, May 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large antenna arrays and millimeter-wave (mmWave) frequencies have been\nattracting growing attention as possible candidates to meet the high\nrequirements of future 5G mobile networks. In view of the large path loss\nattenuation in these bands, beamforming techniques that create a beam in the\ndirection of the user equipment are essential to perform the transmission. For\nthis purpose, in this paper, we aim at characterizing realistic antenna\nradiation patterns, motivated by the need to properly capture mmWave\npropagation behaviors and understand the achievable performance in 5G cellular\nscenarios. In particular, we highlight how the performance changes with the\nradiation pattern used. Consequently, we conclude that it is crucial to use an\naccurate and realistic radiation model for proper performance assessment and\nsystem dimensioning.\n", "versions": [{"version": "v1", "created": "Mon, 5 Feb 2018 09:56:17 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Rebato", "Mattia", ""], ["Resteghini", "Laura", ""], ["Mazzucco", "Christian", ""], ["Zorzi", "Michele", ""]]}, {"id": "1802.01360", "submitter": "Paul Patras", "authors": "Andres Garcia-Saavedra, Paul Patras, Victor Valls, Xavier Costa-Perez,\n  and Douglas J. Leith", "title": "ORLA/OLAA: Orthogonal Coexistence of LAA and WiFi in Unlicensed Spectrum", "comments": "14 pages, 7 figures, submitted to IEEE/ACM Transactions on Networking", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Future mobile networks will exploit unlicensed spectrum to boost capacity and\nmeet growing user demands cost-effectively. The 3GPP has recently defined a\nLicensed-Assisted Access (LAA) scheme to enable global Unlicensed LTE (U-LTE)\ndeployment, aiming at ($i$) ensuring fair coexistence with incumbent WiFi\nnetworks, i.e., impacting on their performance no more than another WiFi\ndevice, and ($ii$) achieving superior airtime efficiency as compared to WiFi.\nIn this paper we show the standardized LAA fails to simultaneously fulfill\nthese objectives, and design an alternative orthogonal (collision-free)\nlisten-before-talk coexistence paradigm that provides a substantial improvement\nin performance, yet imposes no penalty on existing WiFi networks. We derive two\nLAA optimal transmission policies, ORLA and OLAA, that maximize LAA throughput\nin both asynchronous and synchronous (i.e., with alignment to licensed anchor\nframe boundaries) modes of operation, respectively. We present a comprehensive\nperformance evaluation through which we demonstrate that, when aggregating\npackets, IEEE 802.11ac WiFi can be more efficient than 3GPP LAA, whereas our\nproposals can attain 100% higher throughput, without harming WiFi. We further\nshow that long U-LTE frames incur up to 92% throughput losses on WiFi when\nusing 3GPP LAA, whilst ORLA/OLAA sustain $>$200% gains at no cost, even in the\npresence of non-saturated WiFi and/or in multi-rate scenarios.\n", "versions": [{"version": "v1", "created": "Mon, 5 Feb 2018 12:05:36 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Garcia-Saavedra", "Andres", ""], ["Patras", "Paul", ""], ["Valls", "Victor", ""], ["Costa-Perez", "Xavier", ""], ["Leith", "Douglas J.", ""]]}, {"id": "1802.01395", "submitter": "Thomas Szyrkowiec", "authors": "Mohit Chamania, Thomas Szyrkowiec, Michele Santuari, Domenico\n  Siracusa, Achim Autenrieth, Victor Lopez, Pontus Sk\\\"oldstr\\\"om and\n  St\\'ephane Junique", "title": "Intent-Based In-flight Service Encryption in Multi-Layer Transport\n  Networks", "comments": "Optical Fiber Communication Conference", "journal-ref": null, "doi": "10.1364/OFC.2017.Tu3L.10", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate multi-layer encrypted service provisioning via the ACINO\norchestrator. ACINO combines a novel intent interface with an ONOS-based SDN\norchestrator to facilitate encrypted services at IP, Ethernet and optical\nnetwork layers.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jan 2018 14:55:43 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Chamania", "Mohit", ""], ["Szyrkowiec", "Thomas", ""], ["Santuari", "Michele", ""], ["Siracusa", "Domenico", ""], ["Autenrieth", "Achim", ""], ["Lopez", "Victor", ""], ["Sköldström", "Pontus", ""], ["Junique", "Stéphane", ""]]}, {"id": "1802.01414", "submitter": "Dong Liu", "authors": "Dong Liu and Chenyang Yang", "title": "A Learning-based Approach to Joint Content Caching and Recommendation at\n  Base Stations", "comments": "Accepted by IEEE GLOBECOM 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recommendation system is able to shape user demands, which can be used for\nboosting caching gain. In this paper, we jointly optimize content caching and\nrecommendation at base stations to maximize the caching gain meanwhile not\ncompromising the user preference. We first propose a model to capture the\nimpact of recommendation on user demands, which is controlled by a\nuser-specific psychological threshold. We then formulate a joint caching and\nrecommendation problem maximizing the successful offloading probability, which\nis a mixed integer programming problem. We develop a hierarchical iterative\nalgorithm to solve the problem when the threshold is known. Since the user\nthreshold is unknown in practice, we proceed to propose an $\\varepsilon$-greedy\nalgorithm to find the solution by learning the threshold via interactions with\nusers. Simulation results show that the proposed algorithms improve the\nsuccessful offloading probability compared with prior works with/without\nrecommendation. The $\\varepsilon$-greedy algorithm learns the user threshold\nquickly, and achieves more than $1-\\varepsilon$ of the performance obtained by\nthe algorithm with known threshold.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jan 2018 01:54:58 GMT"}, {"version": "v2", "created": "Fri, 26 Oct 2018 06:57:11 GMT"}], "update_date": "2018-10-29", "authors_parsed": [["Liu", "Dong", ""], ["Yang", "Chenyang", ""]]}, {"id": "1802.01415", "submitter": "Mohammed Hadi", "authors": "Mohammed S. Hadi, Ahmed Q. Lawey, Taisir E. H. El-Gorashi, and Jaafar\n  M. H. Elmirghani", "title": "Big Data Analytics for Wireless and Wired Network Design: A Survey", "comments": "23 pages, 4 figures, 2 tables, Journal paper accepted for publication\n  at Elsevier Computer Networks Journal", "journal-ref": null, "doi": "10.1016/j.comnet.2018.01.016", "report-no": null, "categories": "cs.NI stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Currently, the world is witnessing a mounting avalanche of data due to the\nincreasing number of mobile network subscribers, Internet websites, and online\nservices. This trend is continuing to develop in a quick and diverse manner in\nthe form of big data. Big data analytics can process large amounts of raw data\nand extract useful, smaller-sized information, which can be used by different\nparties to make reliable decisions. In this paper, we conduct a survey on the\nrole that big data analytics can play in the design of data communication\nnetworks. Integrating the latest advances that employ big data analytics with\nthe networks control/traffic layers might be the best way to build robust data\ncommunication networks with refined performance and intelligent features.\nFirst, the survey starts with the introduction of the big data basic concepts,\nframework, and characteristics. Second, we illustrate the main network design\ncycle employing big data analytics. This cycle represents the umbrella concept\nthat unifies the surveyed topics. Third, there is a detailed review of the\ncurrent academic and industrial efforts toward network design using big data\nanalytics. Forth, we identify the challenges confronting the utilization of big\ndata analytics in network design. Finally, we highlight several future research\ndirections. To the best of our knowledge, this is the first survey that\naddresses the use of big data analytics techniques for the design of a broad\nrange of networks.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jan 2018 16:35:48 GMT"}], "update_date": "2018-02-12", "authors_parsed": [["Hadi", "Mohammed S.", ""], ["Lawey", "Ahmed Q.", ""], ["El-Gorashi", "Taisir E. H.", ""], ["Elmirghani", "Jaafar M. H.", ""]]}, {"id": "1802.01424", "submitter": "Henry S Thompson", "authors": "Henry S. Thompson, Jian Tong", "title": "Can Common Crawl reliably track persistent identifier (PID) use over\n  time?", "comments": "7 pages, 1 figure, submitted to TempWeb2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report here on the results of two studies using two and four monthly web\ncrawls respectively from the Common Crawl (CC) initiative between 2014 and\n2017, whose initial goal was to provide empirical evidence for the changing\npatterns of use of so-called persistent identifiers. This paper focusses on the\ntooling needed for dealing with CC data, and the problems we found with it. The\nfirst study is based on over $10^{12}$ URIs from over $5 * 10^9$ pages crawled\nin April 2014 and April 2017, the second study adds a further $3 * 10^9$ pages\nfrom the April 2015 and April 2016 crawls. We conclude with suggestions on\nspecific actions needed to enable studies based on CC to give reliable\nlongitudinal information.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jan 2018 16:44:44 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Thompson", "Henry S.", ""], ["Tong", "Jian", ""]]}, {"id": "1802.01425", "submitter": "Abhay Karandikar", "authors": "Pranav Jha, Abhay Karandikar", "title": "SDN based Control and Management of WLANs in the 3GPP 5G Network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The exponential growth in mobile broadband usage [1] has catalyzed the need\nfor high data rate communication systems. In this regard, activities for\nstandardizing the next generation mobile broadband system, known as the Fifth\nGeneration(5G) system are underway. The 5G system also enables the integration\nof Institute of Electrical and Electronic Engineers (IEEE) Wireless Local Area\nNetworks (WLANs) for providing cost-effective broadband connectivity. It is\ntherefore imperative to find solutions for control and management of WLANs,\nwhile providing seamless inter-working capabilities with the cellular network.\nIn this paper, we propose a novel Software Defined Networking (SDN) based\narchitecture for efficient control and management of IEEE WLANs while providing\na mechanism for smooth integration of WLANs within the 5G system.\n", "versions": [{"version": "v1", "created": "Sat, 27 Jan 2018 05:31:11 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Jha", "Pranav", ""], ["Karandikar", "Abhay", ""]]}, {"id": "1802.01471", "submitter": "Christophe Jurczak", "authors": "Christophe Jurczak", "title": "Review of LiFi visible light communications : research and use cases", "comments": "15 pages, 8 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.app-ph cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  LiFi is a networked wireless communication technology transforming\nsolid-state indoor lighting into a backbone for information. The technology has\nreached maturity, with the first LiFi LED luminaire commercialized in 2016.\nReal life deployments with a variety of use cases, as well as staggering\nbandwidth improvements in the lab superior to 10 Gbps, hint to a luminous\nfuture for LiFi as a powerful complement or alternative to WiFi and 4G/5G.\n", "versions": [{"version": "v1", "created": "Tue, 31 Oct 2017 03:23:21 GMT"}, {"version": "v2", "created": "Tue, 6 Feb 2018 01:38:20 GMT"}], "update_date": "2018-02-07", "authors_parsed": [["Jurczak", "Christophe", ""]]}, {"id": "1802.01563", "submitter": "Ahmed Arafa", "authors": "Ahmed Arafa, Jing Yang, Sennur Ulukus", "title": "Age-Minimal Online Policies for Energy Harvesting Sensors with Random\n  Battery Recharges", "comments": "To appear in ICC 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI eess.SP math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an energy harvesting sensor that is sending measurement updates\nregarding some physical phenomenon to a destination. The sensor relies on\nenergy harvested from nature to measure and send its updates, and is equipped\nwith a battery of finite size to collect its harvested energy. The energy\nharvesting process is Poisson with unit rate, and arrives in amounts that fully\nrecharge the battery. Our setting is online in the sense that the times of\nenergy arrivals are revealed causally to the sensor after the energy is\nharvested; only the statistics of the arrival process is known a priori.\nUpdates need to be sent in a timely manner to the destination, namely, such\nthat the long term average age of information is minimized over the course of\ncommunication. The age of information is defined as the time elapsed since the\nfreshest update has reached the destination. We first show that the optimal\nscheduling update policy is a renewal policy, and then show that it has a multi\nthreshold structure: the sensor sends an update only if the age of information\ngrows above a certain threshold that depends on the available energy.\n", "versions": [{"version": "v1", "created": "Mon, 5 Feb 2018 18:50:08 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Arafa", "Ahmed", ""], ["Yang", "Jing", ""], ["Ulukus", "Sennur", ""]]}, {"id": "1802.01570", "submitter": "Mingliang Xiong", "authors": "Mingqing Liu, Mingliang Xiong, Hao Deng, Qingwen Liu", "title": "Mobile Power Network for Ultimate Mobility without Battery Life Anxiety", "comments": "10 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Similar to the evolution from the wired Internet to mobile Internet (MI), the\ngrowing demand for power delivery anywhere and anytime appeals for power grid\ntransformation from wired to mobile domain. We propose here the next generation\nof power delivery network -- mobile power network (MPN) for wireless power\ntransfer within a mobile range from several meters to tens of meters. At first,\nwe present the MPN's concept evolution and application scenarios. Then, we\nintroduce the MPN's supporting technology, namely resonant beam charging (RBC).\nAs a long-range wireless power transfer (WPT) method, RBC can safely deliver\nmulti-Watt power to multiple devices concurrently. Meanwhile, the recent\nprogress in RBC research has been summarized. Next, we specify the MPN's\narchitecture to provide the wide-area WPT coverage. Finally, we discuss the\nMPN's features and challenges. MPN can enable the ultimate mobility by cutting\nthe final cord of mobile devices, realizing the \"last-mile\" mobile power\ndelivery.\n", "versions": [{"version": "v1", "created": "Sat, 3 Feb 2018 12:39:52 GMT"}, {"version": "v2", "created": "Fri, 23 Feb 2018 01:26:12 GMT"}, {"version": "v3", "created": "Mon, 24 Sep 2018 05:01:04 GMT"}, {"version": "v4", "created": "Sat, 2 Nov 2019 03:42:21 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Liu", "Mingqing", ""], ["Xiong", "Mingliang", ""], ["Deng", "Hao", ""], ["Liu", "Qingwen", ""]]}, {"id": "1802.01719", "submitter": "Christian Miranda", "authors": "Christian Miranda, Georges Kaddoum, Elias Bou-Harb", "title": "Cross-Layer Authentication Protocol Design for Ultra-Dense 5G HetNets", "comments": "Strong Cross-Layer Authentication Protocol Design for Ultra-Dense 5G\n  HetNets", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Creating a secure environment for communications is becoming a significantly\nchallenging task in 5G Heterogeneous Networks (HetNets) given the stringent\nlatency and high capacity requirements of 5G networks. This is particularly\nfactual knowing that the infrastructure tends to be highly diversified\nespecially with the continuous deployment of small cells. In fact, frequent\nhandovers in these cells introduce unnecessarily recurring authentications\nleading to increased latency. In this paper, we propose a software-defined\nwireless network (SDWN)-enabled fast cross-authentication scheme which combines\nnon-cryptographic and cryptographic algorithms to address the challenges of\nlatency and weak security. Initially, the received radio signal strength\nvectors at the mobile terminal (MT) is used as a fingerprinting source to\ngenerate an unpredictable secret key. Subsequently, a cryptographic mechanism\nbased upon the authentication and key agreement protocol by employing the\ngenerated secret key is performed in order to improve the confidentiality and\nintegrity of the authentication handover. Further, we propose a radio trusted\nzone database aiming to enhance the frequent authentication of radio devices\nwhich are present in the network. In order to reduce recurring authentications,\na given covered area is divided into trusted zones where each zone contains\nmore than one small cell, thus permitting the MT to initiate a single\nauthentication request per zone, even if it keeps roaming between different\ncells. The proposed scheme is analyzed under different attack scenarios and its\ncomplexity is compared with cryptographic and non-cryptographic approaches to\ndemonstrate its security resilience and computational efficiency.\n", "versions": [{"version": "v1", "created": "Mon, 5 Feb 2018 22:45:42 GMT"}], "update_date": "2018-02-07", "authors_parsed": [["Miranda", "Christian", ""], ["Kaddoum", "Georges", ""], ["Bou-Harb", "Elias", ""]]}, {"id": "1802.01870", "submitter": "Xiao-Liang Wang", "authors": "Zhi Wang, Xiaoliang Wang, Zhuzhong Qian, Baoliu Ye, Sanglu Lu", "title": "RDMAvisor: Toward Deploying Scalable and Simple RDMA as a Service in\n  Datacenters", "comments": "submitted to USENIX ATC 2017, No.9", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  RDMA is increasingly adopted by cloud computing platforms to provide low CPU\noverhead, low latency, high throughput network services. On the other hand,\nhowever, it is still challenging for developers to realize fast deployment of\nRDMA-aware applications in the datacenter, since the performance is highly\nrelated to many lowlevel details of RDMA operations. To address this problem,\nwe present a simple and scalable RDMA as Service (RaaS) to mitigate the impact\nof RDMA operational details. RaaS provides careful message buffer management to\nimprove CPU/memory utilization and improve the scalability of RDMA operations.\nThese optimized designs lead to simple and flexible programming model for\ncommon and knowledgeable users. We have implemented a prototype of RaaS, named\nRDMAvisor, and evaluated its performance on a cluster with a large number of\nconnections. Our experiment results demonstrate that RDMAvisor achieves high\nthroughput for thousand of connections and maintains low CPU and memory\noverhead through adaptive RDMA transport selection.\n", "versions": [{"version": "v1", "created": "Tue, 6 Feb 2018 10:09:12 GMT"}], "update_date": "2018-02-07", "authors_parsed": [["Wang", "Zhi", ""], ["Wang", "Xiaoliang", ""], ["Qian", "Zhuzhong", ""], ["Ye", "Baoliu", ""], ["Lu", "Sanglu", ""]]}, {"id": "1802.01955", "submitter": "Babatope S. Ayo", "authors": "Babatope S. Ayo", "title": "Development of a Home Automation System Using Wireless Sensor/Actuator\n  Nodes", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work presents the design and implementation of a wireless home\nmonitoring and automation system consisting of wireless sensor/actuator nodes,\nwireless camera, and a home server. The low-cost wireless sensor/actuator node\nfeatures temperature, light intensity and motion sensors, and actuator driver\ncircuits for the control of motors, heaters, and lights. Server and client\nprograms used to monitor and control the home were also developed. The home\nserver receives and processes sensor readings, such as temperature and light\nintensity readings, and also transmits user commands to wireless nodes. The\nsystem provides ambient condition monitoring, graphing of sensor data,\nintrusion detection, automated device control, and video monitoring in order to\nachieve improved security and comfort in the home. In addition, users have the\nflexibility of determining sensor-actuator interaction at run-time. The\ndeveloped system could also put the home in various configurable modes based on\nuser requests, time or environmental cues.\n", "versions": [{"version": "v1", "created": "Mon, 5 Feb 2018 14:44:39 GMT"}], "update_date": "2018-02-07", "authors_parsed": [["Ayo", "Babatope S.", ""]]}, {"id": "1802.01970", "submitter": "Cheng Zhang", "authors": "Cheng Zhang, Zhi Liu, Bo Gu, Kyoko Yamori, and Yoshiaki Tanaka", "title": "A Deep Reinforcement Learning Based Approach for Cost- and Energy-Aware\n  Multi-Flow Mobile Data Offloading", "comments": "9 pages, 8 figures. arXiv admin note: substantial text overlap with\n  arXiv:1801.10152", "journal-ref": "IEICE Transactions on Communications, Vol.E101-B, No.7, Jul. 2018", "doi": "10.1587/transcom.2017CQP0014", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the rapid increase in demand for mobile data, mobile network operators\nare trying to expand wireless network capacity by deploying wireless local area\nnetwork (LAN) hotspots on to which they can offload their mobile traffic.\nHowever, these network-centric methods usually do not fulfill the interests of\nmobile users (MUs). Taking into consideration many issues such as different\napplications' deadlines, monetary cost and energy consumption, how the MU\ndecides whether to offload their traffic to a complementary wireless LAN is an\nimportant issue. Previous studies assume the MU's mobility pattern is known in\nadvance, which is not always true. In this paper, we study the MU's policy to\nminimize his monetary cost and energy consumption without known MU mobility\npattern. We propose to use a kind of reinforcement learning technique called\ndeep Q-network (DQN) for MU to learn the optimal offloading policy from past\nexperiences. In the proposed DQN based offloading algorithm, MU's mobility\npattern is no longer needed. Furthermore, MU's state of remaining data is\ndirectly fed into the convolution neural network in DQN without discretization.\nTherefore, not only does the discretization error present in previous work\ndisappear, but also it makes the proposed algorithm has the ability to\ngeneralize the past experiences, which is especially effective when the number\nof states is large. Extensive simulations are conducted to validate our\nproposed offloading algorithms.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jan 2018 04:02:31 GMT"}], "update_date": "2018-02-07", "authors_parsed": [["Zhang", "Cheng", ""], ["Liu", "Zhi", ""], ["Gu", "Bo", ""], ["Yamori", "Kyoko", ""], ["Tanaka", "Yoshiaki", ""]]}, {"id": "1802.02085", "submitter": "Trung Kien Vu", "authors": "Trung Kien Vu, Chen-Feng Liu, Mehdi Bennis, Merouane Debbah, and Matti\n  Latva-aho", "title": "Path Selection and Rate Allocation in Self-Backhauled mmWave Networks", "comments": "Accepted in Proc. IEEE Wireless Commun. Netw. Conf., (WCNC) Apr.\n  2018, Barcelona, Spain", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the problem of multi-hop scheduling in self-backhauled\nmillimeter wave (mmWave) networks. Owing to the high path loss and blockage of\nmmWave links, multi-hop paths between the macro base station and the intended\nusers via full-duplex small cells need to be carefully selected. This paper\naddresses the fundamental question: how to select the best paths and how to\nallocate rates over these paths subject to latency constraints. To answer this\nquestion, we propose a new system design, which factors in mmWave-specific\nchannel variations and network dynamics. The problem is cast as a network\nutility maximization subject to a bounded delay constraint and network\nstability. The studied problem is decoupled into: (i) a path selection and (ii)\nrate allocation, whereby learning the best paths is done by means of a\nreinforcement learning algorithm, and the rate allocation is solved by applying\nthe successive convex approximation method. Via numerical results, our approach\nensures reliable communication with a guaranteed probability of 99.9999%, and\nreduces latency by 50.64% and 92.9% as compared to baselines.\n", "versions": [{"version": "v1", "created": "Tue, 6 Feb 2018 17:32:20 GMT"}, {"version": "v2", "created": "Thu, 26 Apr 2018 07:44:18 GMT"}], "update_date": "2018-04-27", "authors_parsed": [["Vu", "Trung Kien", ""], ["Liu", "Chen-Feng", ""], ["Bennis", "Mehdi", ""], ["Debbah", "Merouane", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1802.02129", "submitter": "Ahmed Arafa", "authors": "Ahmed Arafa, Jing Yang, Sennur Ulukus, H. Vincent Poor", "title": "Age-Minimal Online Policies for Energy Harvesting Sensors with\n  Incremental Battery Recharges", "comments": "Appeared in ITA 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI eess.SP math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A sensor node that is sending measurement updates regarding some physical\nphenomenon to a destination is considered. The sensor relies on energy\nharvested from nature to transmit its updates, and is equipped with a finite\n$B$-sized battery to save its harvested energy. Energy recharges the battery\nincrementally in units, according to a Poisson process, and one update consumes\none energy unit to reach the destination. The setting is online, where the\nenergy arrival times are revealed causally after the energy is harvested. The\ngoal is to update the destination in a timely manner, namely, such that the\nlong term average age of information is minimized, subject to energy causality\nconstraints. The age of information at a given time is defined as the time\nspent since the latest update has reached the destination. It is shown that the\noptimal update policy follows a renewal structure, where the inter-update times\nare independent, and the time durations between any two consecutive events of\nsubmitting an update and having $k$ units of energy remaining in the battery\nare independent and identically distributed for a given $k\\leq B-1$. The\noptimal renewal policy for the case of $B=2$ energy units is explicitly\ncharacterized, and it is shown that it has an energy-dependent threshold\nstructure, where the sensor updates only if the age grows above a certain\nthreshold that is a function of the amount of energy in its battery.\n", "versions": [{"version": "v1", "created": "Tue, 6 Feb 2018 18:50:18 GMT"}, {"version": "v2", "created": "Thu, 22 Feb 2018 19:56:27 GMT"}], "update_date": "2018-02-26", "authors_parsed": [["Arafa", "Ahmed", ""], ["Yang", "Jing", ""], ["Ulukus", "Sennur", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1802.02480", "submitter": "Michele Benini", "authors": "Nicola Zingirian and Michele Benini", "title": "Click Spam Prevention Model for On-Line Advertisement", "comments": "12 pages, 8 figures, presented to cnsa 2018", "journal-ref": "International Journal of Network Security & Its Applications\n  (2018)", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper shows a vulnerability of the pay-per-click accounting of Google\nAds and proposes a statistical tradeoff-based approach to manage this\nvulnerability. The result of this paper is a model to calculate the overhead\ncost per click necessary to protect the subscribers and a simple algorithm to\nimplement this protection. Simulations validate the correctness of the model\nand the economical applicability.\n", "versions": [{"version": "v1", "created": "Wed, 7 Feb 2018 15:33:35 GMT"}], "update_date": "2018-02-08", "authors_parsed": [["Zingirian", "Nicola", ""], ["Benini", "Michele", ""]]}, {"id": "1802.02651", "submitter": "Quirin Scheitle", "authors": "Quirin Scheitle, Jonas Jelten, Oliver Hohlfeld, Luca Ciprian, Georg\n  Carle", "title": "Structure and Stability of Internet Top Lists", "comments": "To appear at PAM'18 poster session", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Active Internet measurement studies rely on a list of targets to be scanned.\nWhile probing the entire IPv4 address space is feasible for scans of limited\ncomplexity, more complex scans do not scale to measuring the full Internet.\nThus, a sample of the Internet can be used instead, often in form of a \"top\nlist\". The most widely used list is the Alexa Global Top1M list. Despite their\nprevalence, use of top lists is seldomly questioned. Little is known about\ntheir creation, representativity, potential biases, stability, or overlap\nbetween lists. As a result, potential consequences of applying top lists in\nresearch are not known. In this study, we aim to open the discussion on top\nlists by investigating the aptness of frequently used top lists for empirical\nInternet scans, including stability, correlation, and potential biases of such\nlists.\n", "versions": [{"version": "v1", "created": "Wed, 7 Feb 2018 21:50:27 GMT"}], "update_date": "2018-02-09", "authors_parsed": [["Scheitle", "Quirin", ""], ["Jelten", "Jonas", ""], ["Hohlfeld", "Oliver", ""], ["Ciprian", "Luca", ""], ["Carle", "Georg", ""]]}, {"id": "1802.02828", "submitter": "Yuhang Ye", "authors": "Yuhang Ye, Brian Lee, Ronan Flynn, Niall Murray, Guiming Fang, Jianwen\n  Cao, Yuansong Qiao", "title": "PTP: Path-specified Transport Protocol for Concurrent Multipath\n  Transmission in Named Data Networks", "comments": "journal, 21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Named Data Networking (NDN) is a promising Future Internet architecture to\nsupport content distribution. Its inherent addressless routing paradigm brings\nvaluable characteristics to improve the transmission robustness and efficiency,\ne.g. users are enabled to download content from multiple providers\nconcurrently. However, multipath transmission NDN is different from that in\nMultipath TCP, i.e. the \"paths\" in NDN are transparent to and uncontrollable by\nusers. To this end, the user controls the traffic on all transmission paths as\nan entirety, which leads to a noticeable problem of low bandwidth utilization.\nIn particular, the congestion of a certain path will trigger the traffic\nreduction on the other transmission paths that are underutilized. Some\nsolutions have been proposed by letting routers balance the loads of different\npaths to avoid congesting a certain path prematurely. However, the complexity\nof obtaining an optimal load balancing solution (of solving a Multi-Commodity\nFlow problem) becomes higher with the increasing network size, which limits the\nuniversal NDN deployments. This paper introduces a compromising solution -\nPath-specified Transport Protocol (PTP). PTP supports both the label switching\nand the addressless routing schemes. Specifically, the label switching scheme\nfacilitates users to precisely control the traffic on each transmission path,\nand the addressless routing scheme maintains the valuable feature of retrieving\ncontent from any provider to guarantee robustness. As the traffic on a\ntransmission path can be explicitly controlled by consumers, load balancing is\nno longer needed in routers, which reduce the computational burden of routers\nand consequently increase the system scalability. The experimental results show\nthat PTP significantly increases the users' downloading rates and improved the\nnetwork throughput.\n", "versions": [{"version": "v1", "created": "Thu, 8 Feb 2018 12:38:18 GMT"}, {"version": "v2", "created": "Fri, 24 Aug 2018 16:14:24 GMT"}], "update_date": "2018-08-27", "authors_parsed": [["Ye", "Yuhang", ""], ["Lee", "Brian", ""], ["Flynn", "Ronan", ""], ["Murray", "Niall", ""], ["Fang", "Guiming", ""], ["Cao", "Jianwen", ""], ["Qiao", "Yuansong", ""]]}, {"id": "1802.02895", "submitter": "Apostolos Destounis", "authors": "Apostolos Destounis, Asma Ghorbel, Georgios S. Paschos, Mari Kobayashi", "title": "Adaptive Coded Caching for Fair Delivery over Fading Channels", "comments": "arXiv admin note: substantial text overlap with arXiv:1701.07730", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The performance of existing coded caching schemes is sensitive to the worst\nchannel quality, a problem which is exacerbated when communicating over fading\nchannels. In this paper, we address this limitation in the following manner: in\nshort-term, we allow transmissions to subsets of users with good channel\nquality, avoiding users with fades, while in long-term we ensure fairness among\nusers. Our online scheme combines (i) the classical decentralized coded caching\nscheme \\cite{maddah2013decentralized} with (ii) joint scheduling and power\ncontrol for the fading broadcast channel, as well as (iii) congestion control\nfor ensuring the optimal long-term average performance. We prove that our\nonline delivery scheme maximizes the alpha-fair utility among all schemes\nrestricted to decentralized placement. By tuning the value of alpha, the\nproposed scheme can achieve different operating points on the average delivery\nrate region and tune performance according to an operator's choice.\n  We demonstrate via simulations that our scheme outperforms two baseline\nschemes: (a) standard coded caching with multicast transmission, limited by the\nworst channel user yet exploiting the global caching gain; (b) opportunistic\nscheduling with unicast transmissions exploiting the fading diversity but\nlimited to local caching gain.\n", "versions": [{"version": "v1", "created": "Wed, 7 Feb 2018 00:08:20 GMT"}, {"version": "v2", "created": "Mon, 10 Feb 2020 13:29:17 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Destounis", "Apostolos", ""], ["Ghorbel", "Asma", ""], ["Paschos", "Georgios S.", ""], ["Kobayashi", "Mari", ""]]}, {"id": "1802.02932", "submitter": "Zaid Allybokus", "authors": "Zaid Allybokus and Konstantin Avrachenkov and J\\'er\\'emie Leguay and\n  Lorenzo Maggi", "title": "Lower Bounds for the Fair Resource Allocation Problem", "comments": "in IFIP WG 7.3 Performance 2017, New York, NY USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The $\\alpha$-fair resource allocation problem has received remarkable\nattention and has been studied in numerous application fields. Several\nalgorithms have been proposed in the context of $\\alpha$-fair resource sharing\nto distributively compute its value. However, little work has been done on its\nstructural properties. In this work, we present a lower bound for the optimal\nsolution of the weighted $\\alpha$-fair resource allocation problem and compare\nit with existing propositions in the literature. Our derivations rely on a\nlocalization property verified by optimization problems with separable\nobjective that permit one to better exploit their local structures. We give a\nlocal version of the well-known midpoint domination axiom used to axiomatically\nbuild the Nash Bargaining Solution (or proportionally fair resource allocation\nproblem). Moreover, we show how our lower bound can improve the performances of\na distributed algorithm based on the Alternating Directions Method of\nMultipliers (ADMM). The evaluation of the algorithm shows that our lower bound\ncan considerably reduce its convergence time up to two orders of magnitude\ncompared to when the bound is not used at all or is simply looser.\n", "versions": [{"version": "v1", "created": "Thu, 8 Feb 2018 15:44:59 GMT"}], "update_date": "2018-02-09", "authors_parsed": [["Allybokus", "Zaid", ""], ["Avrachenkov", "Konstantin", ""], ["Leguay", "Jérémie", ""], ["Maggi", "Lorenzo", ""]]}, {"id": "1802.03012", "submitter": "Peyman Tehrani", "authors": "Peyman Tehrani, Farshad Lahouti, Michele Zorzi", "title": "Resource Allocation in Heterogenous Full-duplex OFDMA Networks: Design\n  and Analysis", "comments": "arXiv admin note: text overlap with arXiv:1605.01947", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent studies indicate the feasibility of full-duplex (FD) bidirectional\nwireless communications. Due to its potential to increase the capacity,\nanalyzing the performance of a cellular network that contains full-duplex\ndevices is crucial. In this paper, we consider maximizing the weighted sum-rate\nof downlink and uplink of an FD heterogeneous OFDMA network where each cell\nconsists of an imperfect FD base-station (BS) and a mixture of half-duplex and\nimperfect full-duplex mobile users. To this end, first, the joint problem of\nsub-channel assignment and power allocation for a single cell network is\ninvestigated. Then, the proposed algorithms are extended for solving the\noptimization problem for an FD heterogeneous network in which intra-cell and\ninter-cell interferences are taken into account. Simulation results demonstrate\nthat in a single cell network, when all the users and the BSs are perfect FD\nnodes, the network throughput could be doubled. Otherwise, the performance\nimprovement is limited by the inter-cell interference, inter-node interference,\nand self-interference. We also investigate the effect of the percentage of FD\nusers on the network performance in both indoor and outdoor scenarios, and\nanalyze the effect of the self-interference cancellation capability of the FD\nnodes on the network performance.\n", "versions": [{"version": "v1", "created": "Thu, 8 Feb 2018 00:35:13 GMT"}], "update_date": "2018-02-12", "authors_parsed": [["Tehrani", "Peyman", ""], ["Lahouti", "Farshad", ""], ["Zorzi", "Michele", ""]]}, {"id": "1802.03033", "submitter": "Robert Falkenberg", "authors": "Robert Falkenberg and Jens Drenhaus and Benjamin Sliwa and Christian\n  Wietfeld", "title": "System-in-the-loop Design Space Exploration for Efficient Communication\n  in Large-scale IoT-based Warehouse Systems", "comments": null, "journal-ref": "2018 Annual IEEE International Systems Conference (SysCon)", "doi": "10.1109/SYSCON.2018.8369572", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Instead of treating inventory items as static resources, future intelligent\nwarehouses will transcend containers to Cyber Physical Systems (CPS) that\nactively and autonomously participate in the optimization of the logistical\nprocesses. Consequently, new challenges that are system-immanent for the\nmassive Internet of Things (IoT) context, such as channel access in a shared\ncommunication medium, have to be addressed. In this paper, we present a\nmulti-methodological system model that brings together testbed experiments for\nmeasuring real hardware properties and simulative evaluations for large-scale\nconsiderations. As an example case study, we will particularly focus on\nparametrization of the 802.15.4-based radio communication system, which has to\nbe energy-efficient due to scarce amount of harvested energy, but avoid\nlatencies for the maintenance of scalability of the overlaying warehouse\nsystem. The results show, that a modification of the initial backoff time can\nlead to both, energy and time savings in the order of 50% compared to the\nstandard.\n", "versions": [{"version": "v1", "created": "Thu, 8 Feb 2018 19:54:51 GMT"}, {"version": "v2", "created": "Tue, 12 Jun 2018 06:50:11 GMT"}], "update_date": "2020-02-20", "authors_parsed": [["Falkenberg", "Robert", ""], ["Drenhaus", "Jens", ""], ["Sliwa", "Benjamin", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1802.03072", "submitter": "Spyridon Mastorakis", "authors": "Spyridon Mastorakis, Kevin Chan, Bongjun Ko, Alexander Afanasyev and\n  Lixia Zhang", "title": "Experimentation With Fuzzy Interest Forwarding in Named Data Networking", "comments": "10 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the current Named Data Networking implementation, forwarding a data\nrequest requires finding an exact match between the prefix of the name carried\nin the request and a forwarding table entry. However, consumers may not always\nknow the exact naming, or an exact prefix, of their desired data. The current\napproach to this problem-establishing naming conventions and performing name\nlookup-can be infeasible in highly ad hoc, heterogeneous, and dynamic\nenvironments: the same data can be named using different terms or even\nlanguages, naming conventions may be minimal if they exist at all, and name\nlookups can be costly. In this paper, we present a fuzzy Interest forwarding\napproach that exploits semantic similarities between the names carried in\nInterest packets and the names of potentially matching data in CS and entries\nin FIB. We describe the fuzzy Interest forwarding approach, outline the\nsemantic understanding function that determines the name matching, and present\nour simulation study along with extended evaluation results.\n", "versions": [{"version": "v1", "created": "Thu, 8 Feb 2018 23:09:56 GMT"}, {"version": "v2", "created": "Wed, 14 Feb 2018 05:24:41 GMT"}], "update_date": "2018-02-15", "authors_parsed": [["Mastorakis", "Spyridon", ""], ["Chan", "Kevin", ""], ["Ko", "Bongjun", ""], ["Afanasyev", "Alexander", ""], ["Zhang", "Lixia", ""]]}, {"id": "1802.03373", "submitter": "Sai Qian Zhang", "authors": "Sai Qian Zhang, H.T. Kung, Youngjune Gwon", "title": "InferBeam: A Fast Beam Alignment Protocol for Millimeter-wave Networking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce fast millimeter-wave base station (BS) and its antenna sector\nselection for user equipment based on its location. Using a conditional random\nfield inference model with specially designed parameters, which are robust to\nchange of environment, InferBeam allows the use of measurement samples on best\nbeam selection at a small number of locations to infer the rest dynamically.\nCompared to beam-sweeping based approaches in the literature, InferBeam can\ndrastically reduce the setup cost for beam alignment for a new environment, and\nalso the latency in acquiring a new beam under intermittent blockage. We have\nevaluated InferBeam using a discrete event simulation. Our results indicate\nthat the system can make best beam selection for 98% of locations in test\nenvironments comprising smallsized apartment or office spaces, while sampling\nfewer than 1% of locations. InferBeam is a complete protocol for best beam\ninference that can be integrated into millimeter-wave standards for\naccelerating the much-needed fast and economic beam alignment capability.\n", "versions": [{"version": "v1", "created": "Fri, 9 Feb 2018 18:19:25 GMT"}, {"version": "v2", "created": "Mon, 5 Mar 2018 16:02:03 GMT"}], "update_date": "2018-03-06", "authors_parsed": [["Zhang", "Sai Qian", ""], ["Kung", "H. T.", ""], ["Gwon", "Youngjune", ""]]}, {"id": "1802.03450", "submitter": "Jihong Park", "authors": "Jihong Park, Petar Popovski, Osvaldo Simeone", "title": "Minimizing Latency to Support VR Social Interactions over Wireless\n  Cellular Systems via Bandwidth Allocation", "comments": "4 pages, 3 figures, to appear in IEEE Wireless Communications Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Immersive social interactions of mobile users are soon to be enabled within a\nvirtual space, by means of virtual reality (VR) technologies and wireless\ncellular systems. In a VR mobile social network, the states of all interacting\nusers should be updated synchronously and with low latency via two-way\ncommunications with edge computing servers. The resulting end-to-end latency\ndepends on the relationship between the virtual and physical locations of the\nwireless VR users and of the edge servers. In this work, the problem of\nanalyzing and optimizing the end-to-end latency is investigated for a simple\nnetwork topology, yielding important insights into the interplay between\nphysical and virtual geometries.\n", "versions": [{"version": "v1", "created": "Fri, 9 Feb 2018 21:26:06 GMT"}, {"version": "v2", "created": "Wed, 4 Apr 2018 00:03:41 GMT"}], "update_date": "2018-04-05", "authors_parsed": [["Park", "Jihong", ""], ["Popovski", "Petar", ""], ["Simeone", "Osvaldo", ""]]}, {"id": "1802.03455", "submitter": "Alexander Fr\\\"ommgen", "authors": "Alexander Fr\\\"ommgen and Denny Stohr and Boris Koldehofe and Amr Rizk", "title": "Don't Repeat Yourself: Seamless Execution and Analysis of Extensive\n  Network Experiments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents MACI, the first bespoke framework for the management, the\nscalable execution, and the interactive analysis of a large number of network\nexperiments. Driven by the desire to avoid repetitive implementation of just a\nfew scripts for the execution and analysis of experiments, MACI emerged as a\ngeneric framework for network experiments that significantly increases\nefficiency and ensures reproducibility. To this end, MACI incorporates and\nintegrates established simulators and analysis tools to foster rapid but\nsystematic network experiments.\n  We found MACI indispensable in all phases of the research and development\nprocess of various communication systems, such as i) an extensive DASH video\nstreaming study, ii) the systematic development and improvement of Multipath\nTCP schedulers, and iii) research on a distributed topology graph pattern\nmatching algorithm. With this work, we make MACI publicly available to the\nresearch community to advance efficient and reproducible network experiments.\n", "versions": [{"version": "v1", "created": "Fri, 9 Feb 2018 21:51:52 GMT"}], "update_date": "2018-02-13", "authors_parsed": [["Frömmgen", "Alexander", ""], ["Stohr", "Denny", ""], ["Koldehofe", "Boris", ""], ["Rizk", "Amr", ""]]}, {"id": "1802.03837", "submitter": "Omid Semiari", "authors": "Omid Semiari, Walid Saad, Mehdi Bennis, and Merouane Debbah", "title": "Integrated Millimeter Wave and Sub-6 GHz Wireless Networks: A Roadmap\n  for Joint Mobile Broadband and Ultra-Reliable Low-Latency Communications", "comments": "Accepted in IEEE Wireless Communications Magazine", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Next-generation wireless networks must enable emerging technologies such as\naugmented reality and connected autonomous vehicles via wide range of wireless\nservices that span enhanced mobile broadband (eMBB), as well as ultra-reliable\nlow-latency communication (URLLC). Existing wireless systems that solely rely\non the scarce sub-6 GHz, microwave ($\\mu$W) frequency bands will be unable to\nmeet such stringent and mixed service requirements for future wireless services\ndue to spectrum scarcity. Meanwhile, operating at high-frequency millimeter\nwave (mmWave) bands is seen as an attractive solution, primarily due to the\nbandwidth availability and possibility of large-scale multi-antenna\ncommunication. However, mmWave communication is inherently unreliable due to\nits susceptibility to blockage, high path loss, and channel uncertainty. Hence,\nto provide URLLC and high-speed wireless access, it is desirable to seamlessly\nintegrate the reliability of $\\mu$W networks with the high capacity of mmWave\nnetworks. To this end, in this paper, the first comprehensive tutorial for\n\\emph{integrated mmWave-$\\mu$W} communications is introduced. This envisioned\nintegrated design will enable wireless networks to achieve URLLC along with\neMBB by leveraging the best of two worlds: reliable, long-range communications\nat the $\\mu$W bands and directional high-speed communications at the mmWave\nfrequencies. To achieve this goal, key solution concepts are discussed that\ninclude new architectures for the radio interface, URLLC-aware frame structure\nand resource allocation methods along with mobility management, to realize the\npotential of integrated mmWave-$\\mu$W communications. The opportunities and\nchallenges of each proposed scheme are discussed and key results are presented\nto show the merits of the developed integrated mmWave-$\\mu$W framework.\n", "versions": [{"version": "v1", "created": "Sun, 11 Feb 2018 23:11:03 GMT"}, {"version": "v2", "created": "Tue, 30 Oct 2018 22:54:04 GMT"}], "update_date": "2018-11-01", "authors_parsed": [["Semiari", "Omid", ""], ["Saad", "Walid", ""], ["Bennis", "Mehdi", ""], ["Debbah", "Merouane", ""]]}, {"id": "1802.03843", "submitter": "Nabil Giweli Mr", "authors": "Nabil Giweli, Seyed Shahrestani and Hon Cheung", "title": "Spectrum Sensing Strategy to Enhance the QoS in White-Fi Networks", "comments": "12 pages, 7 figures, 2 tables", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.10, No.1, January 2018", "doi": "10.5121/ijcnc.2018.10101", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapidly growing number of wireless devices running applications that\nrequire high bandwidths, has resulted in increasing demands for the unlicensed\nfrequency spectrum. Given the scarcity of allocated unlicensed frequencies,\nmeeting such demands can become a serious concern. Cognitive Radio\n(CR)technology opens the door for the opportunistic use of the licensed\nspectrum to partially address the issues relevant to the limited availability\nof unlicensed frequencies. Combining CR and Wi-Fi to form the socalled White-Fi\nnetworks, has been proposed for achieving higher spectrum utilization. This\narticle discusses the spectrum sensing in White-Fi networks and the impacts\nthat it has on the QoS of typical applications. It also reports the analysis of\nsuch impacts through various simulation studies. Our results demonstrate the\nadvantages of an adaptive sensing strategy that is capable of changing the\nrelated parameters based on QoS requirements. We also propose such a sensing\nstrategy that can adapt to the IEEE 802.11e requirements. The goal of the\nproposed strategy is the enhancement of the overall QoS of the applications\nwhile maintaining efficient sensing of the spectrum. Simulation results of the\nscenarios that implement the proposed mechanisms demonstrate noticeable QoS\nimprovements compared to cases where common sensing methods are utilized in\nIEEE802.11 networks.\n", "versions": [{"version": "v1", "created": "Sun, 11 Feb 2018 23:58:08 GMT"}], "update_date": "2018-02-13", "authors_parsed": [["Giweli", "Nabil", ""], ["Shahrestani", "Seyed", ""], ["Cheung", "Hon", ""]]}, {"id": "1802.03878", "submitter": "Trung Kien Vu", "authors": "Trung Kien Vu, Mehdi Bennis, Merouane Debbah, Matti Latva-aho, Choong\n  Seon Hong", "title": "Ultra-Reliable Communication in 5G mmWave Networks: A Risk-Sensitive\n  Approach", "comments": "IEEE Communications Letters. Topic is Ultra-Reliable Communication in\n  5G mmWave Networks", "journal-ref": null, "doi": "10.1109/LCOMM.2018.2802902", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This letter investigates the problem of providing gigabit wireless access\nwith reliable communication in 5G millimeter-Wave (mmWave) massive\nmultiple-input multiple-output (MIMO) networks. In contrast to the classical\nnetwork design based on average metrics, a distributed risk-sensitive\nreinforcement learning-based framework is proposed to jointly optimize the\nbeamwidth and transmit power, while taking into account the sensitivity of\nmmWave links due to blockage. Numerical results show that our proposed\nalgorithm achieves more than 9 Gbps of user throughput with a guaranteed\nprobability of 90%, whereas the baselines guarantee less than 7.5 Gbps. More\nimportantly, there exists a rate-reliability-network density tradeoff, in which\nas the user density increases from 16 to 96 per km2, the fraction of users that\nachieve 4 Gbps are reduced by 11.61% and 39.11% in the proposed and the\nbaseline models, respectively.\n", "versions": [{"version": "v1", "created": "Mon, 12 Feb 2018 03:59:55 GMT"}, {"version": "v2", "created": "Wed, 14 Aug 2019 20:39:29 GMT"}], "update_date": "2019-08-16", "authors_parsed": [["Vu", "Trung Kien", ""], ["Bennis", "Mehdi", ""], ["Debbah", "Merouane", ""], ["Latva-aho", "Matti", ""], ["Hong", "Choong Seon", ""]]}, {"id": "1802.03898", "submitter": "Xiaoyang Zhong", "authors": "Xiaoyang Zhong and Yao Liang", "title": "Scalable Downward Routing for Wireless Sensor Networks and Internet of\n  Things Actuation", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the downward routing for network control/actuation in\nlarge-scale and heterogeneous wireless sensor networks (WSNs) and Internet of\nThings (IoT). We propose the Opportunistic Source Routing (OSR), a scalable and\nreliable downward routing protocol for WSNs/IoT. OSR introduces opportunistic\nrouting into traditional source routing based on the parent set of a node's\nupward routing in data collection, significantly addressing the drastic link\ndynamics in low-power and lossy WSNs. We devise a novel adaptive Bloom filter\nmechanism to effectively and efficiently encode a downward source-route in OSR,\nwhich enables a significant reduction of the length of source-route field in\npacket header. OSR is scalable to very large-size WSN/IoT deployments, since\neach resource-constrained node in the network only stores the set of its direct\nchildren. The probabilistic nature of the Bloom filter passively explores\nopportunistic routing. Upon a delivery failure at any hop along the downward\npath, OSR actively performs opportunistic routing to bypass the obsolete/bad\nlink. We demonstrate the desirable scalability of OSR against the standard RPL\ndownward routing. We evaluate the performance of OSR via both simulations and\nreal-world testbed experiments, in comparison with the standard RPL (both\nstoring mode and non-storing mode), ORPL, and the representative dissemination\nprotocol Drip. Our results show that OSR significantly outperforms RPL and ORPL\nin scalability and reliability. OSR also achieves significantly better energy\nefficiency compared to TinyRPL and Drip which are based on the same TinyOS\nplatform as OSR implementation.\n", "versions": [{"version": "v1", "created": "Mon, 12 Feb 2018 05:39:13 GMT"}], "update_date": "2018-02-13", "authors_parsed": [["Zhong", "Xiaoyang", ""], ["Liang", "Yao", ""]]}, {"id": "1802.04222", "submitter": "Joseph Finnegan", "authors": "Joseph Finnegan, Stephen Brown", "title": "A Comparative Survey of LPWA Networking", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the increasing variance of suggested Internet of Things (IoT)\napplications and the lack of suitability of current wireless technologies in\nscalable, long range deployments, a number of diverging Low Power Wide Area\n(LPWA) technologies have been developed. These technologies promise to enable a\nscalable high range network on cheap low power devices, facilitating the\ndevelopment of a ubiquitous IoT. This paper provides a definition of this new\nLPWA paradigm, presents a systematic approach to defined suitable use cases,\nand undertakes a detailed comparison of current LPWA standards, including the\nprimary technologies, upcoming cellular options, and remaining proprietary\nsolutions.\n", "versions": [{"version": "v1", "created": "Mon, 12 Feb 2018 18:04:42 GMT"}], "update_date": "2018-02-13", "authors_parsed": [["Finnegan", "Joseph", ""], ["Brown", "Stephen", ""]]}, {"id": "1802.04327", "submitter": "Cristina Cano", "authors": "Cristina Cano and Gergely Neu", "title": "Wireless Optimisation via Convex Bandits: Unlicensed LTE/WiFi\n  Coexistence", "comments": "11 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bandit Convex Optimisation (BCO) is a powerful framework for sequential\ndecision-making in non-stationary and partially observable environments. In a\nBCO problem, a decision-maker sequentially picks actions to minimize the\ncumulative cost associated with these decisions, all while receiving partial\nfeedback about the state of the environment. This formulation is a very natural\nfit for wireless-network optimisation problems and has great application\npotential since: i) instead of assuming full observability of the network\nstate, it only requires the metric to optimise as input, and ii) it provides\nstrong performance guarantees while making only minimal assumptions about the\nnetwork dynamics. Despite these advantages, BCO has not yet been explored in\nthe context of wireless-network optimisation. In this paper, we make the first\nsteps to demonstrate the potential of BCO techniques by formulating an\nunlicensed LTE/WiFi fair coexistence use case in the framework, and providing\nexperimental results in a simulated environment. On the algorithmic front, we\npropose a simple and natural sequential multi-point BCO algorithm amenable to\nwireless networking optimisation, and provide its theoretical analysis. We\nexpect the contributions of this paper to pave the way to further research on\nthe application of online convex methods in the bandit setting.\n", "versions": [{"version": "v1", "created": "Mon, 5 Feb 2018 17:34:40 GMT"}], "update_date": "2018-02-14", "authors_parsed": [["Cano", "Cristina", ""], ["Neu", "Gergely", ""]]}, {"id": "1802.04338", "submitter": "Neyre Tekbiyik Ersoy", "authors": "Neyre Tekbiyik-Ersoy, Elif T. Ceran, Kemal Leblebicioglu, Tolga\n  Girici, and Elif Uysal-Biyikoglu", "title": "Kalman Prediction Based Proportional Fair Resource Allocation for a\n  Solar Powered Wireless Downlink", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimization of a Wireless Sensor Network (WSN) downlink with an energy\nharvesting transmitter (base station) is considered. The base station (BS),\nwhich is attached to the central controller of the network, sends control\ninformation to the gateways of individual WSNs in the downlink. This paper\nspecifically addresses the case where the BS is supplied with solar energy.\nLeveraging the daily periodicity inherent in solar energy harvesting, the\nschedule for delivery of maintenance messages from the BS to the nodes of a\ndistributed network is optimized. Differences in channel gain from the BS to\nsensor nodes make it a challenge to provide service to each of them while\nefficiently spending the harvested energy. Based on PTF (Power-Time-Fair), a\nclose-to-optimal solution for fair allocation of harvested energy in a wireless\ndownlink proposed in previous work, we develop an online algorithm, PTF-On,\nthat operates two algorithms in tandem: A prediction algorithm based on a\nKalman filter that operates on solar irradiation measurements, and a modified\nversion of PTF. PTF-On can predict the energy arrival profile throughout the\nday and schedule transmission to nodes to maximize total throughput in a\nproportionally fair way.\n", "versions": [{"version": "v1", "created": "Mon, 12 Feb 2018 20:10:52 GMT"}], "update_date": "2018-02-14", "authors_parsed": [["Tekbiyik-Ersoy", "Neyre", ""], ["Ceran", "Elif T.", ""], ["Leblebicioglu", "Kemal", ""], ["Girici", "Tolga", ""], ["Uysal-Biyikoglu", "Elif", ""]]}, {"id": "1802.04345", "submitter": "Usman Khan", "authors": "Sam Safavi, Usman A. Khan, Soummya Kar, Jos\\'e M. F. Moura", "title": "Localization in internets of mobile agents: A linear approach", "comments": "Technical Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fifth generation~(5G) networks providing much higher bandwidth and faster\ndata rates will allow connecting vast number of static and mobile devices,\nsensors, agents, users, machines, and vehicles, supporting Internet-of-Things\n(IoT), real-time dynamic networks of mobile things. Positioning and location\nawareness will become increasingly important, enabling deployment of new\nservices and contributing to significantly improving the overall performance of\nthe 5G~system. Many of the currently talked about solutions to positioning\nin~5G are centralized, mostly requiring direct line-of-sight (LoS) to deployed\naccess nodes or anchors at the same time, which in turn requires high-density\ndeployments of anchors. But these LoS and centralized positioning solutions may\nbecome unwieldy as the number of users and devices continues to grow without\nlimit in sight. As an alternative to the centralized solutions, this paper\ndiscusses distributed localization in a 5G enabled IoT environment where many\nlow power devices, users, or agents are to locate themselves without global or\nLoS access to anchors. Even though positioning is essentially a non-linear\nproblem (solving circle equations by trilateration or triangulation), we\ndiscuss a cooperative \\textit{linear} distributed iterative solution with only\nlocal measurements, communication and computation needed at each agent.\nLinearity is obtained by reparametrization of the agent location through\nbarycentric coordinate representations based on local neighborhood geometry\nthat may be computed in terms of certain Cayley-Menger determinants involving\nrelative local inter-agent distance measurements.\n", "versions": [{"version": "v1", "created": "Mon, 12 Feb 2018 20:24:05 GMT"}], "update_date": "2018-02-14", "authors_parsed": [["Safavi", "Sam", ""], ["Khan", "Usman A.", ""], ["Kar", "Soummya", ""], ["Moura", "José M. F.", ""]]}, {"id": "1802.04587", "submitter": "Benjamin Baron", "authors": "Benjamin Baron, Prom\\'eth\\'ee Spathis, Marcelo Dias de Amorim, Yannis\n  Viniotis, and Mostafa H. Ammar", "title": "Mobility as an Alternative Communication Channel: A Survey", "comments": null, "journal-ref": "IEEE Communications Surveys & Tutorials, 2018", "doi": "10.1109/COMST.2018.2841192", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We review the research literature investigating systems in which mobile\nentities can carry data while they move. These entities can be either mobile by\nnature (e.g., human beings and animals) or mobile by design (e.g., trains,\nairplanes, and cars). The movements of such entities equipped with storage\ncapabilities create a communication channel which can help overcome the\nlimitations or the lack of conventional data networks. Common limitations\ninclude the mismatch between the capacity offered by these networks and the\ntraffic demand or their limited deployment owing to environmental factors.\nApplication scenarios include offloading traffic off legacy networks for\ncapacity improvement, bridging connectivity gaps, or deploying ad hoc networks\nin challenging environments for coverage enhancement.\n", "versions": [{"version": "v1", "created": "Tue, 13 Feb 2018 12:30:34 GMT"}, {"version": "v2", "created": "Thu, 22 Feb 2018 16:54:19 GMT"}, {"version": "v3", "created": "Thu, 31 May 2018 08:42:07 GMT"}], "update_date": "2018-06-01", "authors_parsed": [["Baron", "Benjamin", ""], ["Spathis", "Prométhée", ""], ["de Amorim", "Marcelo Dias", ""], ["Viniotis", "Yannis", ""], ["Ammar", "Mostafa H.", ""]]}, {"id": "1802.04655", "submitter": "Danish Sattar", "authors": "Danish Sattar and Ashraf Matrawy", "title": "Optimal Slice Allocation in 5G Core Networks", "comments": null, "journal-ref": "IEEE Networking Letters ( Early Access ), 2019", "doi": "10.1109/LNET.2019.2908351", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  5G network slicing is essential to providing flexible, scalable and on-demand\nsolutions for the vast array of applications in 5G networks. Two key challenges\nof 5G network slicing are function isolation (intra-slice) and guaranteeing\nend-to-end delay for a slice. In this paper, we address the question of optimal\nallocation of a slice in 5G core networks by tackling these two challenges. We\nadopt and extend the work by D. Dietrich [1] to create a model that satisfies\nconstraints on end-to-end delay as well as isolation between components of a\nslice for reliability.\n", "versions": [{"version": "v1", "created": "Tue, 13 Feb 2018 14:52:24 GMT"}, {"version": "v2", "created": "Fri, 9 Nov 2018 00:32:54 GMT"}, {"version": "v3", "created": "Wed, 19 Dec 2018 17:55:42 GMT"}, {"version": "v4", "created": "Fri, 19 Apr 2019 13:34:02 GMT"}], "update_date": "2019-04-22", "authors_parsed": [["Sattar", "Danish", ""], ["Matrawy", "Ashraf", ""]]}, {"id": "1802.04873", "submitter": "Andrea Tassi", "authors": "Dejan Vukobratovic, Andrea Tassi, Savo Delic, Chadi Khirallah", "title": "Random Linear Network Coding for 5G Mobile Video Delivery", "comments": "Invited paper for Special Issue \"Network and Rateless Coding for\n  Video Streaming\" - MDPI Information", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An exponential increase in mobile video delivery will continue with the\ndemand for higher resolution, multi-view and large-scale multicast video\nservices. Novel fifth generation (5G) 3GPP New Radio (NR) standard will bring a\nnumber of new opportunities for optimizing video delivery across both 5G core\nand radio access networks. One of the promising approaches for video quality\nadaptation, throughput enhancement and erasure protection is the use of\npacket-level random linear network coding (RLNC). In this review paper, we\ndiscuss the integration of RLNC into the 5G NR standard, building upon the\nideas and opportunities identified in 4G LTE. We explicitly identify and\ndiscuss in detail novel 5G NR features that provide support for RLNC-based\nvideo delivery in 5G, thus pointing out to the promising avenues for future\nresearch.\n", "versions": [{"version": "v1", "created": "Tue, 13 Feb 2018 21:56:33 GMT"}, {"version": "v2", "created": "Tue, 3 Apr 2018 12:10:27 GMT"}], "update_date": "2018-04-04", "authors_parsed": [["Vukobratovic", "Dejan", ""], ["Tassi", "Andrea", ""], ["Delic", "Savo", ""], ["Khirallah", "Chadi", ""]]}, {"id": "1802.05113", "submitter": "Essaid Sabir", "authors": "Wissal Attaoui and Essaid Sabir", "title": "Multi-Criteria Virtual Machine Placement in Cloud Computing\n  Environments: A literature Review", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Cloud computing is a revolutionary process that has impacted the manner of\nusing networks. It allows a high level of flexibility as Virtual Machines (VMs)\nrun elastically workloads on physical machines in data centers. The issue of\nplacing virtual machines (VMP) in cloud environments is an important challenge\nthat has been thoroughly addressed, although not yet completely resolved. This\narticle discusses the different problems that may disrupt the placement of VMs\nand Virtual Network Functions (VNFs), and classifies the existing solutions\ninto five major objective functions based on multiple performance metrics such\nas energy consumption, Quality of Service, Service Level Agreement, and\nincurred cost. The existing solutions are also classified based on whether they\nadopt heuristic, deterministic, meta-heuristic or approximation algorithms. The\nVNF placement in 5G network is also discussed to highlight the convergence\ntoward optimal usage of mobile services by including\nNFV/Software-Defined-Network technologies.\n", "versions": [{"version": "v1", "created": "Mon, 5 Feb 2018 21:06:21 GMT"}], "update_date": "2018-02-20", "authors_parsed": [["Attaoui", "Wissal", ""], ["Sabir", "Essaid", ""]]}, {"id": "1802.05169", "submitter": "AbdelRahman Abdou", "authors": "AbdelRahman Abdou", "title": "Internet Location Verification: Challenges and Solutions", "comments": null, "journal-ref": "PhD Thesis, Carleton University, Ottawa, Canada, 2015", "doi": null, "report-no": null, "categories": "cs.CR cs.ET cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This thesis addresses the problem of verifying the geographic locations of\nInternet clients. First, we demonstrate how current state-of-the-art\ndelay-based geolocation techniques are susceptible to evasion through delay\nmanipulations, which involve both increasing and decreasing the Internet delays\nthat are observed between a client and a remote measuring party. We then\npropose Client Presence Verification (CPV) as a delay-based technique to verify\nan assertion about a client's physical presence in a prescribed geographic\nregion. Three verifiers geographically encapsulating a client's asserted\nlocation are used to corroborate that assertion by measuring the delays between\nthemselves and the client. CPV infers geographic distances from these delays\nand thus, using the smaller of the forward and reverse one-way delay between\neach verifier and the client is expected to result in a more accurate distance\ninference than using the conventional round-trip times. Accordingly, we devise\na novel protocol for accurate one-way delay measurements between the client and\nthe three verifiers to be used by CPV, taking into account that the client\ncould manipulate the measurements to defeat the verification process. We\nevaluate CPV through extensive real-world experiments with legitimate clients\n(those truly present at where they asserted to be) modeled to use both wired\nand wireless access networks. Wired evaluation is done using the PlanetLab\ntestbed, during which we examine various factors affecting CPV's efficacy, such\nas the client's geographical nearness to the verifiers. For wireless\nevaluation, we leverage the Internet delay information collected for wired\nclients from PlanetLab, and model additional delays representing the last-mile\nwireless link. Finally, we reinforce CPV against a (hypothetical) middlebox\nthat an adversary specifically customizes to defeat CPV.\n", "versions": [{"version": "v1", "created": "Wed, 14 Feb 2018 15:51:06 GMT"}], "update_date": "2018-02-15", "authors_parsed": [["Abdou", "AbdelRahman", ""]]}, {"id": "1802.05198", "submitter": "George Xylomenos", "authors": "Nikos Fotiou and George Xylomenos and George C. Polyzos and Hasan\n  Islam and Dmitrij Lagutin and Teemu Hakala and Eero Hakala", "title": "ICN enabling CoAP Extensions for IP based IoT devices", "comments": null, "journal-ref": "Proceedings of the 4th ACM Conference on Information-Centric\n  Networking, Pages 218-219, Berlin, Germany, September 26 - 28, 2017", "doi": "10.1145/3125719.3132105", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Constrained Application Protocol (CoAP) and its extensions, such as\nobserve and group communication, offer the potential for developing novel IoT\napplications. However, a full-fledged CoAP-based application requires\ndelay-tolerant communication and support for multicast: since these properties\ncannot be easily provided by existing IP networks, developers cannot take full\nadvantage of CoAP, preferring to use HTTP instead. In this demo we show how\nproxying CoAP traffic over an ICN network can unleash the full potential of\nCoAP, simultaneously shifting overhead and complexity from the (constrained)\nendpoints to the network.\n", "versions": [{"version": "v1", "created": "Wed, 14 Feb 2018 16:44:01 GMT"}], "update_date": "2018-02-15", "authors_parsed": [["Fotiou", "Nikos", ""], ["Xylomenos", "George", ""], ["Polyzos", "George C.", ""], ["Islam", "Hasan", ""], ["Lagutin", "Dmitrij", ""], ["Hakala", "Teemu", ""], ["Hakala", "Eero", ""]]}, {"id": "1802.05348", "submitter": "Chuang Ye", "authors": "Chuang Ye, M. Cenk Gursoy, and Senem Velipasalar", "title": "Power Control and Mode Selection for VBR Video Streaming in D2D Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate the problem of power control for streaming\nvariable-bit-rate (VBR) videos in a device-to-device (D2D) wireless network. A\nVBR video traffic model that considers video frame sizes and playout buffers at\nthe mobile users is adopted. A setup with one pair of D2D users (DUs) and one\ncellular user (CU) is considered and three modes, namely cellular mode,\ndedicated mode and reuse mode, are employed. Mode selection for the data\ndelivery is determined and the transmit powers of the base station (BS) and\ndevice transmitter are optimized with the goal of maximizing the overall\ntransmission rate while VBR video data can be delivered to the CU and DU\nwithout causing playout buffer underflows or overflows. A low-complexity\nalgorithm is proposed. Through simulations with VBR video traces over fading\nchannels, we demonstrate that video delivery with mode selection and power\ncontrol achieves a better performance than just using a single mode throughout\nthe transmission.\n", "versions": [{"version": "v1", "created": "Wed, 14 Feb 2018 22:56:20 GMT"}], "update_date": "2018-02-16", "authors_parsed": [["Ye", "Chuang", ""], ["Gursoy", "M. Cenk", ""], ["Velipasalar", "Senem", ""]]}, {"id": "1802.05755", "submitter": "Usman Asghar", "authors": "Usman Asghar, Farid Touati, Damiano Crescini, Alessio Galli, Adel Ben\n  Mnaouer", "title": "Development of Highly Efficient Multi-invariable Wireless Sensor System\n  Design for Energy Harvesting", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Capillary wireless sensor networks devoted to air quality monitoring have\nprovided vital information on dangerous air conditions. In adopting the\nenvironmentally generated energy as the fundamental energy source the main\nchallenge is the implementation of capillary networks rather than replacing the\nbatteries on a set period of times that leads to functional dilemma of devices\nmanagement and high costs. In this paper we present a battery-less,\nself-governing, multi-parametric sensing platform for air quality monitoring\nthat harvests environment energy for long run. Furthermore study on sensor\nsection with their results have also been described in the paper. A customized\nprocess of calibration to check the sensors' sensitivity and a basic portfolio\nof variant energy sources over the power recovery section could productively\nimprove air quality standards tracing in indoor and outdoor application, in a\nkind of 'set and forget' scenario.\n", "versions": [{"version": "v1", "created": "Thu, 15 Feb 2018 20:46:04 GMT"}], "update_date": "2018-02-19", "authors_parsed": [["Asghar", "Usman", ""], ["Touati", "Farid", ""], ["Crescini", "Damiano", ""], ["Galli", "Alessio", ""], ["Mnaouer", "Adel Ben", ""]]}, {"id": "1802.05943", "submitter": "Yuhao Zhu", "authors": "Yuhao Zhu, Gu-Yeon Wei, David Brooks", "title": "Cloud No Longer a Silver Bullet, Edge to the Rescue", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper takes the position that, while cognitive computing today relies\nheavily on the cloud, we will soon see a paradigm shift where cognitive\ncomputing primarily happens on network edges. The shift toward edge devices is\nfundamentally propelled both by technological constraints in data centers and\nwireless network infrastructures, as well as practical considerations such as\nprivacy and safety. The remainder of this paper lays out our view of how these\nconstraints will impact future cognitive computing. Bringing cognitive\ncomputing to edge devices opens up several new opportunities and challenges,\nsome of which demand new solutions and some of which require us to revisit\nentrenched techniques in light of new technologies. We close the paper with a\ncall to action for future research.\n", "versions": [{"version": "v1", "created": "Thu, 15 Feb 2018 06:18:54 GMT"}], "update_date": "2018-02-19", "authors_parsed": [["Zhu", "Yuhao", ""], ["Wei", "Gu-Yeon", ""], ["Brooks", "David", ""]]}, {"id": "1802.06042", "submitter": "Karthikeyan Sundaresan", "authors": "Karthikeyan Sundaresan, Eugene Chai, Ayon Chakraborty, Sampath\n  Rangarajan", "title": "SkyLiTE: End-to-End Design of Low-Altitude UAV Networks for Providing\n  LTE Connectivity", "comments": null, "journal-ref": null, "doi": null, "report-no": "NEC Labs America Technical Report 2018-TR001", "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Un-manned aerial vehicle (UAVs) have the potential to change the landscape of\nwide-area wireless connectivity by bringing them to areas where connectivity\nwas sparing or non-existent (e.g. rural areas) or has been compromised due to\ndisasters. While Google's Project Loon and Facebook's Project Aquila are\nexamples of high-altitude, long-endurance UAV-based connectivity efforts in\nthis direction, the telecom operators (e.g. AT&T and Verizon) have been\nexploring low-altitude UAV-based LTE solutions for on-demand deployments.\nUnderstandably, these projects are in their early stages and face formidable\nchallenges in their realization and deployment. The goal of this document is to\nexpose the reader to both the challenges as well as the potential offered by\nthese unconventional connectivity solutions. We aim to explore the end-to-end\ndesign of such UAV-based connectivity networks particularly in the context of\nlow-altitude UAV networks providing LTE connectivity. Specifically, we aim to\nhighlight the challenges that span across multiple layers (access, core\nnetwork, and backhaul) in an inter-twined manner as well as the richness and\ncomplexity of the design space itself. To help interested readers navigate this\ncomplex design space towards a solution, we also articulate the overview of one\nsuch end-to-end design, namely SkyLiTE-- a self-organizing network of\nlow-altitude UAVs that provide optimized LTE connectivity in a desired region.\n", "versions": [{"version": "v1", "created": "Fri, 16 Feb 2018 17:34:35 GMT"}, {"version": "v2", "created": "Tue, 20 Feb 2018 20:50:48 GMT"}], "update_date": "2018-02-22", "authors_parsed": [["Sundaresan", "Karthikeyan", ""], ["Chai", "Eugene", ""], ["Chakraborty", "Ayon", ""], ["Rangarajan", "Sampath", ""]]}, {"id": "1802.06450", "submitter": "Yanpeng Yang", "authors": "Yanpeng Yang, Hossein S. Ghadikolaei, Carlo Fischione, Marina Petrova,\n  Ki Won Sung", "title": "Reducing Initial Cell-search Latency in mmWave Networks", "comments": "6 pages, 5 figures, accepted by mmSys workshop at Infocom 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Millimeter-wave (mmWave) networks rely on directional transmissions, in both\ncontrol plane and data plane, to overcome severe path-loss. Nevertheless, the\nuse of narrow beams complicates the initial cell-search procedure where we lack\nsufficient information for beamforming. In this paper, we investigate the\nfeasibility of random beamforming for cell-search. We develop a stochastic\ngeometry framework to analyze the performance in terms of failure probability\nand expected latency of cell-search. Meanwhile, we compare our results with the\nnaive, but heavily used, exhaustive search scheme. Numerical results show that,\nfor a given discovery failure probability, random beamforming can substantially\nreduce the latency of exhaustive search, especially in dense networks. Our work\ndemonstrates that developing complex cell-discovery algorithms may be\nunnecessary in dense mmWave networks and thus shed new lights on mmWave system\ndesign.\n", "versions": [{"version": "v1", "created": "Sun, 18 Feb 2018 21:31:39 GMT"}], "update_date": "2018-02-20", "authors_parsed": [["Yang", "Yanpeng", ""], ["Ghadikolaei", "Hossein S.", ""], ["Fischione", "Carlo", ""], ["Petrova", "Marina", ""], ["Sung", "Ki Won", ""]]}, {"id": "1802.06581", "submitter": "Chang-Heng Wang", "authors": "Chang-Heng Wang, Jaime Llorca, Antonia M. Tulino, Tara Javidi", "title": "Dynamic Cloud Network Control under Reconfiguration Delay and Cost", "comments": "15 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network virtualization and programmability allow operators to deploy a wide\nrange of services over a common physical infrastructure and elastically\nallocate cloud and network resources according to changing requirements. While\nthe elastic reconfiguration of virtual resources enables dynamically scaling\ncapacity in order to support service demands with minimal operational cost,\nreconfiguration operations make resources unavailable during a given time\nperiod and may incur additional cost. In this paper, we address the dynamic\ncloud network control problem under non-negligible reconfiguration delay and\ncost. We show that while the capacity region remains unchanged regardless of\nthe reconfiguration delay/cost values, a reconfiguration-agnostic policy may\nfail to guarantee throughput-optimality and minimum cost under nonzero\nreconfiguration delay/cost. We then present an adaptive dynamic cloud network\ncontrol policy that allows network nodes to make local flow scheduling and\nresource allocation decisions while controlling the frequency of\nreconfiguration in order to support any input rate in the capacity region and\nachieve arbitrarily close to minimum cost for any finite reconfiguration\ndelay/cost values.\n", "versions": [{"version": "v1", "created": "Mon, 19 Feb 2018 10:54:32 GMT"}], "update_date": "2018-02-20", "authors_parsed": [["Wang", "Chang-Heng", ""], ["Llorca", "Jaime", ""], ["Tulino", "Antonia M.", ""], ["Javidi", "Tara", ""]]}, {"id": "1802.06656", "submitter": "Fariba Aalamifar", "authors": "Fariba Aalamifar, Lutz Lampe", "title": "Cost-efficient QoS-Aware Data Acquisition Point Placement for Advanced\n  Metering Infrastructure", "comments": "31 pages, IEEE Transactions", "journal-ref": "IEEE Transactions on Communications (Early Access), Volume 66,\n  Issue 12, 2018", "doi": "10.1109/TCOMM.2018.2858263", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In an advanced metering infrastructure (AMI), data acquisition points (DAPs)\nare responsible for collecting traffic from several smart meters and automated\ndevices and transmitting them to the utility control center. Although the\nproblem of optimized data collector placement has already been addressed for\nwireless broadband and sensor networks, DAP placement is quite a new research\narea for AMIs. In this paper, we investigate the minimum required number of\nDAPs and their optimized locations on top of the existing utility poles in a\ndistribution grid such that smart grid quality of service requirements can best\nbe provided. In order to solve the problem for large-scale AMIs, we devise a\nnovel heuristic algorithm using a greedy approach for identifying potential\npole locations for DAP placement and the Dijkstra shortest path algorithm for\nconstructing reliable routes. We employ the characteristics of medium access\nschemes from the IEEE 802.15.4g smart utility network (SUN) standard, and\nconsider mission-critical and non-critical smart grid traffic. The performance\nand time-complexity of our algorithm are compared with those obtained by the\nIBM CPLEX software for small scenarios. Finally, we apply our devised DAP\nplacement algorithm to examples of realistic smart grid AMI topologies.\n", "versions": [{"version": "v1", "created": "Mon, 19 Feb 2018 14:50:11 GMT"}], "update_date": "2018-08-21", "authors_parsed": [["Aalamifar", "Fariba", ""], ["Lampe", "Lutz", ""]]}, {"id": "1802.06706", "submitter": "Michele Polese", "authors": "Tommaso Zugno, Michele Polese, Michele Zorzi", "title": "Integration of Carrier Aggregation and Dual Connectivity for the ns-3\n  mmWave Module", "comments": "9 pages, 7 figures, submitted to the Workshop on ns-3 (WNS3) 2018", "journal-ref": null, "doi": "10.1145/3199902.3199909", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Thanks to the wide availability of bandwidth, the millimeter wave (mmWave)\nfrequencies will provide very high data rates to mobile users in next\ngeneration 5G cellular networks. However, mmWave links suffer from high\nisotropic pathloss and blockage from common materials, and are subject to an\nintermittent channel quality. Therefore, protocols and solutions at different\nlayers in the cellular network and the TCP/IP protocol stack have been proposed\nand studied. A valuable tool for the end-to-end performance analysis of mmWave\ncellular networks is the ns-3 mmWave module, which already models in detail the\nchannel, Physical (PHY) and Medium Access Control (MAC) layers, and extends the\nLong Term Evolution (LTE) stack for the higher layers. In this paper we present\nan implementation for the ns-3 mmWave module of multi connectivity techniques\nfor 3GPP New Radio (NR) at mmWave frequencies, namely Carrier Aggregation (CA)\nand Dual Connectivity (DC), and discuss how they can be integrated to increase\nthe functionalities offered by the ns-3 mmWave module.\n", "versions": [{"version": "v1", "created": "Mon, 19 Feb 2018 17:08:20 GMT"}], "update_date": "2018-09-06", "authors_parsed": [["Zugno", "Tommaso", ""], ["Polese", "Michele", ""], ["Zorzi", "Michele", ""]]}, {"id": "1802.06902", "submitter": "Roman Kovalchukov", "authors": "Antonino Orsino, Roman Kovalchukov, Andrey Samuylov, Dmitri\n  Moltchanov, Sergey Andreev, Yevgeni Koucheryavy and Mikko Valkama", "title": "Caching-Aided Collaborative D2D Operation for Predictive Data\n  Dissemination in Industrial IoT", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Industrial automation deployments constitute challenging environments where\nmoving IoT machines may produce high-definition video and other heavy sensor\ndata during surveying and inspection operations. Transporting massive contents\nto the edge network infrastructure and then eventually to the remote human\noperator requires reliable and high-rate radio links supported by intelligent\ndata caching and delivery mechanisms. In this work, we address the challenges\nof contents dissemination in characteristic factory automation scenarios by\nproposing to engage moving industrial machines as device-to-device (D2D)\ncaching helpers. With the goal to improve reliability of high-rate\nmillimeter-wave (mmWave) data connections, we introduce the alternative\ncontents dissemination modes and then construct a novel mobility-aware\nmethodology that helps develop predictive mode selection strategies based on\nthe anticipated radio link conditions. We also conduct a thorough system-level\nevaluation of representative data dissemination strategies to confirm the\nbenefits of predictive solutions that employ D2D-enabled collaborative caching\nat the wireless edge to lower contents delivery latency and improve data\nacquisition reliability.\n", "versions": [{"version": "v1", "created": "Mon, 19 Feb 2018 22:58:41 GMT"}], "update_date": "2018-02-21", "authors_parsed": [["Orsino", "Antonino", ""], ["Kovalchukov", "Roman", ""], ["Samuylov", "Andrey", ""], ["Moltchanov", "Dmitri", ""], ["Andreev", "Sergey", ""], ["Koucheryavy", "Yevgeni", ""], ["Valkama", "Mikko", ""]]}, {"id": "1802.06910", "submitter": "Mohammad Reza Javan", "authors": "Mohammad R. Abedi, Nader Mokari, Mohammad R. Javan, and Eduard.A.\n  Jorswieck", "title": "Single or Multiple Frames Content Delivery for Next-Generation Networks?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the four enabling technologies, namely multi-user sparse\ncode multiple access (SCMA), content caching, energy harvesting, and physical\nlayer security for proposing an energy and spectral efficient resource\nallocation algorithm for the access and backhaul links in heterogeneous\ncellular networks. Although each of the above mentioned issues could be a topic\nof research, in a real situation, we would face a complicated scenario where\nthey should be considered jointly, and hence, our target is to consider these\ntechnologies jointly in a unified framework. Moreover, we propose two novel\ncontent delivery scenarios: 1) single frame content delivery (SFCD), and 2)\nmultiple frames content delivery (MFCD), where the time duration of serving\nuser requests is divided into several frames. In the first scenario, the\nrequested content by each user is served over one frame. However, in the second\nscenario, the requested content by each user can be delivered over several\nframes. We formulate the resource allocation for the proposed scenarios as\noptimization problems where our main aim is to maximize the energy efficiency\nof access links subject to the transmit power and rate constraints of access\nand backhaul links, caching and energy harvesting constraints, and SCMA\ncodebook allocation limitations. Due to the practical limitations, we assume\nthat the channel state information values between eavesdroppers and base\nstations are uncertain and design the network for the worst case scenario.\nSince the corresponding optimization problems are mixed integer non-linear and\nnonconvex programming, NP-hard, and intractable, we propose an iterative\nalgorithm based on the well-known alternate and successive convex approximation\nmethods.\n", "versions": [{"version": "v1", "created": "Mon, 19 Feb 2018 23:42:18 GMT"}, {"version": "v2", "created": "Tue, 14 Aug 2018 14:41:34 GMT"}], "update_date": "2018-08-15", "authors_parsed": [["Abedi", "Mohammad R.", ""], ["Mokari", "Nader", ""], ["Javan", "Mohammad R.", ""], ["Jorswieck", "Eduard. A.", ""]]}, {"id": "1802.06958", "submitter": "Shangxing Wang", "authors": "Shangxing Wang, Hanpeng Liu, Pedro Henrique Gomes and Bhaskar\n  Krishnamachari", "title": "Deep Reinforcement Learning for Dynamic Multichannel Access in Wireless\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a dynamic multichannel access problem, where multiple correlated\nchannels follow an unknown joint Markov model. A user at each time slot selects\na channel to transmit data and receives a reward based on the success or\nfailure of the transmission. The objective is to find a policy that maximizes\nthe expected long-term reward. The problem is formulated as a partially\nobservable Markov decision process (POMDP) with unknown system dynamics. To\novercome the challenges of unknown system dynamics as well as prohibitive\ncomputation, we apply the concept of reinforcement learning and implement a\nDeep Q-Network (DQN) that can deal with large state space without any prior\nknowledge of the system dynamics. We provide an analytical study on the optimal\npolicy for fixed-pattern channel switching with known system dynamics and show\nthrough simulations that DQN can achieve the same optimal performance without\nknowing the system statistics. We compare the performance of DQN with a Myopic\npolicy and a Whittle Index-based heuristic through both simulations as well as\nreal-data trace and show that DQN achieves near-optimal performance in more\ncomplex situations. Finally, we propose an adaptive DQN approach with the\ncapability to adapt its learning in time-varying, dynamic scenarios.\n", "versions": [{"version": "v1", "created": "Tue, 20 Feb 2018 04:06:08 GMT"}], "update_date": "2018-02-21", "authors_parsed": [["Wang", "Shangxing", ""], ["Liu", "Hanpeng", ""], ["Gomes", "Pedro Henrique", ""], ["Krishnamachari", "Bhaskar", ""]]}, {"id": "1802.06970", "submitter": "Spyridon Mastorakis", "authors": "Spyridon Mastorakis, Tahrina Ahmed and Jayaprakash Pisharath", "title": "ISA-Based Trusted Network Functions And Server Applications In The\n  Untrusted Cloud", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, enterprises widely deploy Network Functions (NFs) and server\napplications in the cloud. However, processing of sensitive data and trusted\nexecution cannot be securely deployed in the untrusted cloud. Cloud providers\nthemselves could accidentally leak private information (e.g., due to\nmisconfigurations) or rogue users could exploit vulnerabilities of the\nproviders' systems to compromise execution integrity, posing a threat to the\nconfidentiality of internal enterprise and customer data. In this paper, we\nidentify (i) a number of NF and server application use-cases that trusted\nexecution can be applied to, (ii) the assets and impact of compromising the\nprivate data and execution integrity of each use-case, and (iii) we leverage\nIntel's Software Guard Extensions (SGX) architecture to design Trusted\nExecution Environments (TEEs) for cloud-based NFs and server applications. We\ncombine SGX with the Data Plane Development KIT (DPDK) to prototype and\nevaluate our TEEs for a number of application scenarios (Layer 2 frame and\nLayer 3 packet processing for plain and encrypted traffic, traffic\nload-balancing and back-end server processing). Our results indicate that NFs\ninvolving plain traffic can achieve almost native performance (e.g., ~22\nMillion Packets Per Second for Layer 3 forwarding for 64-byte frames), while\nNFs involving encrypted traffic and server processing can still achieve\ncompetitive performance (e.g., ~12 Million Packets Per Second for server\nprocessing for 64-byte frames).\n", "versions": [{"version": "v1", "created": "Tue, 20 Feb 2018 05:24:14 GMT"}], "update_date": "2018-02-21", "authors_parsed": [["Mastorakis", "Spyridon", ""], ["Ahmed", "Tahrina", ""], ["Pisharath", "Jayaprakash", ""]]}, {"id": "1802.07016", "submitter": "Roberto Calvo-Palomino", "authors": "Roberto Calvo-Palomino, Fabio Ricciato, Blaz Repas, Domenico\n  Giustiniano and Vincent Lenders", "title": "Nanosecond-precision Time-of-Arrival Estimation for Aircraft Signals\n  with low-cost SDR Receivers", "comments": "IPSN 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Precise Time-of-Arrival (TOA) estimations of aircraft and drone signals are\nimportant for a wide set of applications including aircraft/drone tracking, air\ntraffic data verification, or self-localization. Our focus in this work is on\nTOA estimation methods that can run on low-cost software-defined radio (SDR)\nreceivers, as widely deployed in Mode S / ADS-B crowdsourced sensor networks\nsuch as the OpenSky Network. We evaluate experimentally classical TOA\nestimation methods which are based on a cross-correlation with a reconstructed\nmessage template and find that these methods are not optimal for such signals.\nWe propose two alternative methods that provide superior results for real-world\nMode S / ADS-B signals captured with low-cost SDR receivers. The best method\nachieves a standard deviation error of 1.5 ns.\n", "versions": [{"version": "v1", "created": "Tue, 20 Feb 2018 08:59:02 GMT"}], "update_date": "2018-02-21", "authors_parsed": [["Calvo-Palomino", "Roberto", ""], ["Ricciato", "Fabio", ""], ["Repas", "Blaz", ""], ["Giustiniano", "Domenico", ""], ["Lenders", "Vincent", ""]]}, {"id": "1802.07023", "submitter": "Gewu Bu", "authors": "Gewu Bu, Maria Potop-Butucaru", "title": "BAN-GZKP: Optimal Zero Knowledge Proof based Scheme for Wireless Body\n  Area Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BANZKP is the best to date Zero Knowledge Proof (ZKP) based secure\nlightweight and energy efficient authentication scheme designed for Wireless\nArea Network (WBAN). It is vulnerable to several security attacks such as the\nreplay attack, Distributed Denial-of-Service (DDoS) attacks at sink and\nredundancy information crack. However, BANZKP needs an end-to-end\nauthentication which is not compliant with the human body postural mobility. We\npropose a new scheme BAN-GZKP. Our scheme improves both the security and\npostural mobility resilience of BANZKP. Moreover, BAN-GZKP uses only a\nthree-phase authentication which is optimal in the class of ZKP protocols. To\nfix the security vulnerabilities of BANZKP, BAN-GZKP uses a novel random key\nallocation and a Hop-by-Hop authentication definition. We further prove the\nreliability of our scheme to various attacks including those to which BANZKP is\nvulnerable. Furthermore, via extensive simulations we prove that our scheme,\nBAN-GZKP, outperforms BANZKP in terms of reliability to human body postural\nmobility for various network parameters (end-to-end delay, number of packets\nexchanged in the network, number of transmissions). We compared both schemes\nusing representative convergecast strategies with various transmission rates\nand human postural mobility. Finally, it is important to mention that BAN-GZKP\nhas no additional cost compared to BANZKP in terms memory, computational\ncomplexity or energy consumption.\n", "versions": [{"version": "v1", "created": "Tue, 20 Feb 2018 09:19:11 GMT"}], "update_date": "2018-02-21", "authors_parsed": [["Bu", "Gewu", ""], ["Potop-Butucaru", "Maria", ""]]}, {"id": "1802.07222", "submitter": "Behnaz Arzani", "authors": "Behnaz Arzani, Selim Ciraci, Luiz Chamon, Yibo Zhu, Hingqiang Liu,\n  Jitu Padhye, Boon Thau Loo, Geoff Outhred", "title": "007: Democratically Finding The Cause of Packet Drops", "comments": "15th USENIX Symposium on Networked Systems Design and Implementation\n  (NSDI 18).USENIX Association, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network failures continue to plague datacenter operators as their symptoms\nmay not have direct correlation with where or why they occur. We introduce 007,\na lightweight, always-on diagnosis application that can find problematic links\nand also pinpoint problems for each TCP connection. 007 is completely contained\nwithin the end host. During its two month deployment in a tier-1 datacenter, it\ndetected every problem found by previously deployed monitoring tools while also\nfinding the sources of other problems previously undetected.\n", "versions": [{"version": "v1", "created": "Tue, 20 Feb 2018 18:00:10 GMT"}], "update_date": "2018-02-21", "authors_parsed": [["Arzani", "Behnaz", ""], ["Ciraci", "Selim", ""], ["Chamon", "Luiz", ""], ["Zhu", "Yibo", ""], ["Liu", "Hingqiang", ""], ["Padhye", "Jitu", ""], ["Loo", "Boon Thau", ""], ["Outhred", "Geoff", ""]]}, {"id": "1802.07429", "submitter": "Xiang Shi", "authors": "Xiang Shi, Lin Wang, Fa Zhang, Kai Zheng, Max M\\\"uhlh\\\"auser and\n  Zhiyong Liu", "title": "PABO: Mitigating Congestion via Packet Bounce in Data Center Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In today's data center, a diverse mix of throughput-sensitive long flows and\ndelay-sensitive short flows are commonly presented in shallow-buffered\nswitches. Long flows could potentially block the transmission of\ndelay-sensitive short flows, leading to degraded performance. Congestion can\nalso be caused by the synchronization of multiple TCP connections for short\nflows, as typically seen in the partition/aggregate traffic pattern. While\nmultiple end-to-end transport-layer solutions have been proposed, none of them\nhave tackled the real challenge: reliable transmission in the network. In this\npaper, we fill this gap by presenting PABO -- a novel link-layer design that\ncan mitigate congestion by temporarily bouncing packets to upstream switches.\nPABO's design fulfills the following goals: i) providing per-flow based flow\ncontrol on the link layer, ii) handling transient congestion without the\nintervention of end devices, and iii) gradually back propagating the congestion\nsignal to the source when the network is not capable to handle the\ncongestion.Experiment results show that PABO can provide prominent advantage of\nmitigating transient congestions and can achieve significant gain on end-to-end\ndelay.\n", "versions": [{"version": "v1", "created": "Wed, 21 Feb 2018 05:38:31 GMT"}, {"version": "v2", "created": "Fri, 3 Aug 2018 09:23:17 GMT"}], "update_date": "2018-08-06", "authors_parsed": [["Shi", "Xiang", ""], ["Wang", "Lin", ""], ["Zhang", "Fa", ""], ["Zheng", "Kai", ""], ["Mühlhäuser", "Max", ""], ["Liu", "Zhiyong", ""]]}, {"id": "1802.07470", "submitter": "Pat Pannuto", "authors": "Pat Pannuto, Benjamin Kempke, and Prabal Dutta", "title": "Slocalization: Sub-{\\mu}W Ultra Wideband Backscatter Localization", "comments": "Published at the 17th ACM/IEEE Conference on Information Processing\n  in Sensor Networks (IPSN'18)", "journal-ref": null, "doi": "10.1109/IPSN.2018.00052", "report-no": null, "categories": "cs.NI eess.SP", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Ultra wideband technology has shown great promise for providing high-quality\nlocation estimation, even in complex indoor multipath environments, but\nexisting ultra wideband systems require tens to hundreds of milliwatts during\noperation. Backscatter communication has demonstrated the viability of\nastonishingly low-power tags, but has thus far been restricted to narrowband\nsystems with low localization resolution. The challenge to combining these\ncomplimentary technologies is that they share a compounding limitation,\nconstrained transmit power. Regulations limit ultra wideband transmissions to\njust -41.3 dBm/MHz, and a backscatter device can only reflect the power it\nreceives. The solution is long-term integration of this limited power, lifting\nthe initially imperceptible signal out of the noise. This integration only\nworks while the target is stationary. However, stationary describes the vast\nmajority of objects, especially lost ones. With this insight, we design\nSlocalization, a sub-microwatt, decimeter-accurate localization system that\nopens a new tradeoff space in localization systems and realizes an energy,\nsize, and cost point that invites the localization of every thing. To evaluate\nthis concept, we implement an energy-harvesting Slocalization tag and find that\nSlocalization can recover ultra wideband backscatter in under fifteen minutes\nacross thirty meters of space and localize tags with a mean 3D Euclidean error\nof only 30 cm.\n", "versions": [{"version": "v1", "created": "Wed, 21 Feb 2018 09:02:23 GMT"}], "update_date": "2018-11-20", "authors_parsed": [["Pannuto", "Pat", ""], ["Kempke", "Benjamin", ""], ["Dutta", "Prabal", ""]]}, {"id": "1802.07475", "submitter": "Benjamin Sliwa", "authors": "Johannes Pillmann and Benjamin Sliwa and Jens Schmutzler and Christoph\n  Ide and Christian Wietfeld", "title": "Car-to-Cloud Communication Traffic Analysis Based on the Common Vehicle\n  Information Model", "comments": null, "journal-ref": "Vehicular Technology Conference (VTC Spring), 2017 IEEE 85th", "doi": "10.1109/VTCSpring.2017.8108664", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although connectivity services have been introduced already today in many of\nthe most recent car models, the potential of vehicles serving as highly mobile\nsensor platform in the Internet of Things (IoT) has not been sufficiently\nexploited yet. The European AutoMat project has therefore defined an open\nCommon Vehicle Information Model (CVIM) in combination with a cross-industry,\ncloud-based big data marketplace. Thereby, vehicle sensor data can be leveraged\nfor the design of entirely new services even beyond traffic-related\napplications (such as localized weather forecasts). This paper focuses on the\nprediction of the achievable data rate making use of an analytical model based\non empirical measurements. For an in-depth analysis, the CVIM has been\nintegrated in a vehicle traffic simulator to produce CVIM-complaint data\nstreams as a result of the individual behavior of each vehicle (speed, brake\nactivity, steering activity, etc.). In a next step, a simulation of vehicle\ntraffic in a realistically modeled, large-area street network has been used in\ncombination with a cellular Long Term Evolution (LTE) network to determine the\ncumulated amount of data produced within each network cell. As a result, a new\ncar-to-cloud communication traffic model has been derived, which quantifies the\ndata rate of aggregated car-to-cloud data producible by vehicles depending on\nthe current traffic situations (free flow and traffic jam). The results provide\na reference for network planning and resource scheduling for car-to-cloud type\nservices in the context of smart cities.\n", "versions": [{"version": "v1", "created": "Wed, 21 Feb 2018 09:23:43 GMT"}], "update_date": "2018-02-22", "authors_parsed": [["Pillmann", "Johannes", ""], ["Sliwa", "Benjamin", ""], ["Schmutzler", "Jens", ""], ["Ide", "Christoph", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1802.07476", "submitter": "Benjamin Sliwa", "authors": "Johannes Pillmann and Benjamin Sliwa and Christian Kastin and\n  Christian Wietfeld", "title": "Empirical evaluation of predictive channel-aware transmission for\n  resource efficient car-to-cloud communication", "comments": null, "journal-ref": "Vehicular Networking Conference (VNC), 2017 IEEE", "doi": "10.1109/VNC.2017.8275635", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays vehicles are by default equipped with communication hardware. This\nenables new possibilities of connected services, like vehicles serving as\nhighly mobile sensor platforms in the Internet of Things (IoT) context. Hereby,\ncars need to upload and transfer their data via a mobile communication network\ninto the cloud for further evaluation. As wireless resources are limited and\nshared by all users, data transfers need to be conducted efficiently. Within\nthe scope of this work three car-to-cloud data transmission algorithms\nChannel-Aware Transmission (CAT), predictive CAT (pCAT) and a periodic scheme\nare evaluated in an empirical setup. CAT leverages channel quality measurements\nto start data uploads preferably when the channel quality is good. CAT's\nextension pCAT uses past measurements in addition to estimate future channel\nconditions. For the empirical evaluation, a research vehicle was equipped with\na measurement platform. On test drives along a reference route vehicle sensor\ndata was collected and subsequently uploaded to a cloud server via a Long Term\nEvolution (LTE) network.\n", "versions": [{"version": "v1", "created": "Wed, 21 Feb 2018 09:24:20 GMT"}], "update_date": "2018-02-22", "authors_parsed": [["Pillmann", "Johannes", ""], ["Sliwa", "Benjamin", ""], ["Kastin", "Christian", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1802.07479", "submitter": "Junnan Yang", "authors": "Junnan Yang, Ming Ding, Guoqiang Mao, Zihuai Lin, De-gan Zhang, Tom\n  Hao Luan", "title": "Optimal Base Station Antenna Downtilt in Downlink Cellular Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  From very recent studies, the area spectral efficiency (ASE) performance of\ndownlink (DL) cellular networks will continuously decrease and finally to zero\nwith the network densification in a fully loaded ultra-dense network (UDN) when\nthe absolute height difference between a base station (BS) antenna and a user\nequipment (UE) antenna is larger than zero, which is referred as the ASE Crash.\nWe revisit this issue by considering the impact of the BS antenna downtilt on\nthe downlink network capacity. In general, there exists a height difference\nbetween a BS and a UE in practical networks. It is common to utilize antenna\ndowntilt to adjust the direction of the vertical antenna pattern, and thus\nincrease received signal power or reduce inter-cell interference power to\nimprove network performance. This paper focuses on investigating the\nrelationship between the base station antenna downtilt and the downlink network\ncapacity in terms of the coverage probability and the ASE. The analytical\nresults of the coverage probability and the ASE are derived, and we find that\nthere exists an optimal antenna downtilt to achieve the maximal coverage\nprobability for each base station density. Moreover, we derive numerically\nsolvable expressions for the optimal antenna downtilt, which is a function of\nthe base station density. Our theoretical and numerical results show that after\napplying the optimal antenna downtilt, the network performance can be improved\nsignificantly. Specifically, with the optimal antenna downtilt, the ASE crash\ncan be delayed by nearly one order of magnitude in terms of the base station\ndensity.\n", "versions": [{"version": "v1", "created": "Wed, 21 Feb 2018 09:32:06 GMT"}], "update_date": "2018-02-22", "authors_parsed": [["Yang", "Junnan", ""], ["Ding", "Ming", ""], ["Mao", "Guoqiang", ""], ["Lin", "Zihuai", ""], ["Zhang", "De-gan", ""], ["Luan", "Tom Hao", ""]]}, {"id": "1802.07840", "submitter": "Mohammad Mahdi Tajiki", "authors": "Mohammad Mahdi Tajiki and Behzad Akbari and Mohammad Shojafar and\n  Seyed Hesamedin Ghasemi Petroudi and Mahdi Latifi Barazandeh and Nader Mokari\n  and Luca Chiaraviglio and Michael Zink", "title": "CECT: Computationally Efficient Congestion-avoidance and Traffic\n  Engineering in Software-defined Cloud Data Centers", "comments": null, "journal-ref": null, "doi": "10.1007/s10586-018-2815-6", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The proliferation of cloud data center applications and network function\nvirtualization (NFV) boosts dynamic and QoS dependent traffic into the data\ncenters network. Currently, lots of network routing protocols are requirement\nagnostic, while other QoS-aware protocols are computationally complex and\ninefficient for small flows. In this paper, a computationally efficient\ncongestion avoidance scheme, called CECT, for software-defined cloud data\ncenters is proposed. The proposed algorithm, CECT, not only minimizes network\ncongestion but also reallocates the resources based on the flow requirements.\nTo this end, we use a routing architecture to reconfigure the network resources\ntriggered by two events: 1) the elapsing of a predefined time interval, or, 2)\nthe occurrence of congestion. Moreover, a forwarding table entries compression\ntechnique is used to reduce the computational complexity of CECT. In this way,\nwe mathematically formulate an optimization problem and define a genetic\nalgorithm to solve the proposed optimization problem. We test the proposed\nalgorithm on real-world network traffic. Our results show that CECT is\ncomputationally fast and the solution is feasible in all cases. In order to\nevaluate our algorithm in term of throughput, CECT is compared with ECMP (where\nthe shortest path algorithm is used as the cost function). Simulation results\nconfirm that the throughput obtained by running CECT is improved up to 3x\ncompared to ECMP while packet loss is decreased up to 2x.\n", "versions": [{"version": "v1", "created": "Wed, 21 Feb 2018 22:57:26 GMT"}, {"version": "v2", "created": "Wed, 30 Dec 2020 09:54:14 GMT"}], "update_date": "2021-01-01", "authors_parsed": [["Tajiki", "Mohammad Mahdi", ""], ["Akbari", "Behzad", ""], ["Shojafar", "Mohammad", ""], ["Petroudi", "Seyed Hesamedin Ghasemi", ""], ["Barazandeh", "Mahdi Latifi", ""], ["Mokari", "Nader", ""], ["Chiaraviglio", "Luca", ""], ["Zink", "Michael", ""]]}, {"id": "1802.07855", "submitter": "Tao Gong", "authors": "Song Han and Tao Gong and Mark Nixon and Eric Rotvold and Kam-yiu Lam\n  and Krithi Ramamritham", "title": "RT-DAP: A Real-Time Data Analytics Platform for Large-scale Industrial\n  Process Monitoring and Control", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In most process control systems nowadays, process measurements are\nperiodically collected and archived in historians. Analytics applications\nprocess the data, and provide results offline or in a time period that is\nconsiderably slow in comparison to the performance of the manufacturing\nprocess. Along with the proliferation of Internet-of-Things (IoT) and the\nintroduction of \"pervasive sensors\" technology in process industries,\nincreasing number of sensors and actuators are installed in process plants for\npervasive sensing and control, and the volume of produced process data is\ngrowing exponentially. To digest these data and meet the ever-growing\nrequirements to increase production efficiency and improve product quality,\nthere needs to be a way to both improve the performance of the analytics system\nand scale the system to closely monitor a much larger set of plant resources.\nIn this paper, we present a real-time data analytics platform, called RT-DAP,\nto support large-scale continuous data analytics in process industries. RT-DAP\nis designed to be able to stream, store, process and visualize a large volume\nof realtime data flows collected from heterogeneous plant resources, and\nfeedback to the control system and operators in a realtime manner. A prototype\nof the platform is implemented on Microsoft Azure. Our extensive experiments\nvalidate the design methodologies of RT-DAP and demonstrate its efficiency in\nboth component and system levels.\n", "versions": [{"version": "v1", "created": "Thu, 22 Feb 2018 00:25:25 GMT"}], "update_date": "2018-02-23", "authors_parsed": [["Han", "Song", ""], ["Gong", "Tao", ""], ["Nixon", "Mark", ""], ["Rotvold", "Eric", ""], ["Lam", "Kam-yiu", ""], ["Ramamritham", "Krithi", ""]]}, {"id": "1802.08386", "submitter": "Di Zhuang", "authors": "Di Zhuang and J. Morris Chang", "title": "Enhanced PeerHunter: Detecting Peer-to-peer Botnets through Network-Flow\n  Level Community Behavior Analysis", "comments": "16 pages, 7 figures, 15 tables, Accepted for IEEE Transactions on\n  Information Forensics and Security. arXiv admin note: substantial text\n  overlap with arXiv:1709.06440", "journal-ref": null, "doi": "10.1109/TIFS.2018.2881657", "report-no": null, "categories": "cs.CR cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer-to-peer (P2P) botnets have become one of the major threats in network\nsecurity for serving as the fundamental infrastructure for various\ncyber-crimes. More challenges are involved in the problem of detecting P2P\nbotnets, despite a few work claimed to detect centralized botnets effectively.\nWe propose Enhanced PeerHunter, a network-flow level community behavior\nanalysis based system, to detect P2P botnets. Our system starts from a P2P\nnetwork flow detection component. Then, it uses \"mutual contacts\" to cluster\nbots into communities. Finally, it uses network-flow level community behavior\nanalysis to detect potential botnets. In the experimental evaluation, we\npropose two evasion attacks, where we assume the adversaries know our\ntechniques in advance and attempt to evade our system by making the P2P bots\nmimic the behavior of legitimate P2P applications. Our results showed that\nEnhanced PeerHunter can obtain high detection rate with few false positives,\nand high robustness against the proposed attacks.\n", "versions": [{"version": "v1", "created": "Fri, 23 Feb 2018 04:52:40 GMT"}, {"version": "v2", "created": "Sat, 18 Aug 2018 14:40:52 GMT"}, {"version": "v3", "created": "Wed, 14 Nov 2018 02:49:42 GMT"}], "update_date": "2018-11-15", "authors_parsed": [["Zhuang", "Di", ""], ["Chang", "J. Morris", ""]]}, {"id": "1802.08442", "submitter": "Laurent Decreusefond", "authors": "Anais Vergne (LTCI), Laurent Decreusefond (LTCI), Philippe Martins\n  (LTCI)", "title": "Building a coverage hole-free communication tree", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless networks are present everywhere but their management can be tricky\nsince their coverage may contain holes even if the network is fully connected.\nIn this paper we propose an algorithm that can build a communication tree\nbetween nodes of a wireless network with guarantee that there is no coverage\nhole in the tree. We use simplicial homology to compute mathematically the\ncoverage, and Prim's algorithm principle to build the communication tree. Some\nsimulation results are given to study the performance of the algorithm and\ncompare different metrics. In the end, we show that our algorithm can be used\nto create coverage hole-free communication groups with a limited number of\nhops.\n", "versions": [{"version": "v1", "created": "Fri, 23 Feb 2018 08:40:49 GMT"}], "update_date": "2018-02-26", "authors_parsed": [["Vergne", "Anais", "", "LTCI"], ["Decreusefond", "Laurent", "", "LTCI"], ["Martins", "Philippe", "", "LTCI"]]}, {"id": "1802.08463", "submitter": "Lianghai Ji", "authors": "Ji Lianghai, Andreas Weinand, Bin Han and Hans D. Schotten", "title": "Multi-RATs Support to Improve V2X Communication", "comments": "accepted by IEEE Wireless Communications and Networking Conference,\n  2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the next generation of wireless system targets at providing a wider range\nof services with divergent QoS requirements, new applications will be enabled\nby the fifth generation (5G) network. Among the emerging applications,\nvehicle-to-everything (V2X) communication is an important use case targeted by\n5G to enable an improved traffic safety and traffic efficiency. Since the V2X\ncommunication requires a low end-to-end (E2E) latency and an ultra-high\nreliability, the legacy cellular networks can not meet the service requirement.\nIn this work, we inspect on the system performance of applying the LTE-Uu and\nPC5 interfaces to enable the V2X communication. With the LTE-Uu interface, one\nV2X data packet is transmitted through the cellular network infrastructure,\nwhile the PC5 interface facilitates the direct V2X communication without\ninvolving the network infrastructure in user-plane. In addition, due to the\nhigh reliability requirement, the application of a single V2X transmission\ntechnology can not meet the targets in some scenarios. Therefore, we also\npropose a multi-radio access technologies (multi-RATs) scheme where the data\npacket travels through both the LTE-Uu and PC5 interfaces to obtain a diversity\ngain. Last but not least, in order to derive the system performance, a system\nlevel simulator is implemented in this work. The numerical results provide us\ninsights on how the different technologies will perform in different scenarios\nand also validate the proposed multi-RATs scheme.\n", "versions": [{"version": "v1", "created": "Fri, 23 Feb 2018 09:59:02 GMT"}], "update_date": "2018-02-26", "authors_parsed": [["Lianghai", "Ji", ""], ["Weinand", "Andreas", ""], ["Han", "Bin", ""], ["Schotten", "Hans D.", ""]]}, {"id": "1802.08730", "submitter": "Prateesh Goyal", "authors": "Prateesh Goyal, Akshay Narayan, Frank Cangialosi, Srinivas Narayana,\n  Mohammad Alizadeh, Hari Balakrishnan", "title": "Elasticity Detection: A Building Block for Internet Congestion Control", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces Nimbus, a robust technique to detect whether the cross\ntraffic competing with a flow is \"elastic\", and shows that this elasticity\ndetector improves congestion control. If cross traffic is inelastic, then a\nsender can control queueing delays while achieving high throughput, but in the\npresence of elastic traffic, it may lose throughput if it attempts to control\npacket delay. To estimate elasticity, Nimbus modulates the flow's sending rate\nwith sinusoidal pulses that create small traffic fluctuations at the bottleneck\nlink, and measures the frequency response of the rate of the cross traffic. Our\nresults on emulated and real-world paths show that congestion control using\nelasticity detection achieves throughput comparable to Cubic, but with delays\nthat are 50-70 ms lower when cross traffic is inelastic. Nimbus detects the\nnature of the cross traffic more accurately than Copa, and is usable as a\nbuilding block by other end-to-end algorithms.\n", "versions": [{"version": "v1", "created": "Fri, 23 Feb 2018 20:39:08 GMT"}, {"version": "v2", "created": "Sun, 22 Jul 2018 14:14:28 GMT"}, {"version": "v3", "created": "Tue, 24 Sep 2019 01:01:19 GMT"}, {"version": "v4", "created": "Sat, 15 Feb 2020 22:04:24 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Goyal", "Prateesh", ""], ["Narayan", "Akshay", ""], ["Cangialosi", "Frank", ""], ["Narayana", "Srinivas", ""], ["Alizadeh", "Mohammad", ""], ["Balakrishnan", "Hari", ""]]}, {"id": "1802.08776", "submitter": "Chiranjib Saha", "authors": "Chiranjib Saha, Mehrnaz Afshang, and Harpreet S. Dhillon", "title": "Bandwidth Partitioning and Downlink Analysis in Millimeter Wave\n  Integrated Access and Backhaul for 5G", "comments": "A part of this paper was presented at IEEE ICC 2018. It is available\n  at arXiv:1710.06255", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the increasing network densification, it has become exceedingly\ndifficult to provide traditional fiber backhaul access to each cell site, which\nis especially true for small cell base stations (SBSs). The increasing maturity\nof millimeter wave (mm-wave) communication has opened up the possibility of\nproviding high-speed wireless backhaul to such cell sites. Since mm-wave is\nalso suitable for access links, the third generation partnership project (3GPP)\nis envisioning an integrated access and backhaul (IAB) architecture for the\nfifth generation (5G) cellular networks in which the same infrastructure and\nspectral resources will be used for both access and backhaul. In this paper, we\ndevelop an analytical framework for IAB-enabled cellular network using which\nits downlink rate coverage probability is accurately characterized. Using this\nframework, we study the performance of three backhaul bandwidth (BW) partition\nstrategies: 1) equal partition: when all SBSs obtain equal share of the\nbackhaul BW; 2) instantaneous load-based partition: when the backhaul BW share\nof an SBS is proportional to its instantaneous load; and 3) average load-based\npartition: when the backhaul BW share of an SBS is proportional to its average\nload. Our analysis shows that depending on the choice of the partition\nstrategy, there exists an optimal split of access and backhaul BW for which the\nrate coverage is maximized. Further, there exists a critical volume of\ncell-load (total number of users) beyond which the gains provided by the\nIAB-enabled network disappear and its performance converges to that of the\ntraditional macro-only network with no SBSs.\n", "versions": [{"version": "v1", "created": "Sat, 24 Feb 2018 01:03:36 GMT"}, {"version": "v2", "created": "Sun, 11 Nov 2018 00:38:21 GMT"}], "update_date": "2018-11-13", "authors_parsed": [["Saha", "Chiranjib", ""], ["Afshang", "Mehrnaz", ""], ["Dhillon", "Harpreet S.", ""]]}, {"id": "1802.08782", "submitter": "Dimitrios Sikeridis", "authors": "Dimitrios Sikeridis, Ioannis Papapanagiotou, and Michael Devetsikiotis", "title": "BLEBeacon: A Real-Subject Trial Dataset from Mobile Bluetooth Low Energy\n  Beacons", "comments": null, "journal-ref": "Presented at the 1st New Mexico Electrical and Computer\n  Engineering Student Conference (NM-ECE-SC), April 2018", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The BLEBeacon dataset is a collection of Bluetooth Low Energy (BLE)\nadvertisement packets/traces generated from BLE beacons carried by people\nfollowing their daily routine inside a university building. A network of\nRaspberry Pi 3 (RPi)-based edge devices were deployed inside a multi-floor\nfacility continuously gathering BLE advertisement packets and storing them in a\ncloud-based environment. The data were collected during an IRB (Institutional\nReview Board forhe Protection of Human Subjects in Research) approved one-month\ntrial. Each facility occupant/participant was handed a BLE beacon to carry with\nhim at all times. The focus is on presenting a real-life realization of a\nlocation-aware sensing infrastructure, that can provide insights for smart\nsensing platforms, crowd-based applications, building management, and\nuser-localization frameworks. This work describes and documents the published\nBLEBeacon dataset.\n", "versions": [{"version": "v1", "created": "Sat, 24 Feb 2018 01:53:43 GMT"}, {"version": "v2", "created": "Thu, 9 May 2019 06:08:33 GMT"}], "update_date": "2020-09-01", "authors_parsed": [["Sikeridis", "Dimitrios", ""], ["Papapanagiotou", "Ioannis", ""], ["Devetsikiotis", "Michael", ""]]}, {"id": "1802.08818", "submitter": "Mohammad Riyaz Belgaum", "authors": "P Veeresh, R Praveen Sam, Mohammad Riyaz Belgaum", "title": "Optimal QoS Constraint Service Composition in Mobile Ad Hoc Networks", "comments": "6 pages, 6 figures, 4th IEEE International Conference on Engineering\n  Technologies and Applied Sciences (ICETAS), 2017", "journal-ref": null, "doi": "10.1109/ICETAS.2017.8277870", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent year's computational capability of the mobile nodes have been\ngreatly improved. The mobile nodes have the capability of running different\napplications. Implementation of services in Mobile Ad Hoc Networks (MANETs)\nincreases the flexibility of using mobile devices for running a wide variety of\napplications. Single service cannot satisfy the user needs. The complex needs\nof the users can be satisfied by the service composition. Service composition\nmeans, combining the atomic services into a complex service. In this paper we\npropose QoS constraint service composition in MANETs. We considered both\nservice QoS parameters as well node parameters. Response time and throughput as\nparameters for services and energy and hop count as node parameters. These four\nQoS parameters are optimized using a mathematical model Hammerstein model to\ngenerate a single output. Based on generated output, max valued (optimal)\nservices are considered in service composition path. The simulation results\nshown that, our proposed method outperforms than the traditional AODV method of\nservice composition.\n", "versions": [{"version": "v1", "created": "Sat, 24 Feb 2018 08:35:12 GMT"}], "update_date": "2020-10-02", "authors_parsed": [["Veeresh", "P", ""], ["Sam", "R Praveen", ""], ["Belgaum", "Mohammad Riyaz", ""]]}, {"id": "1802.09080", "submitter": "Mohammad Noormohammadpour", "authors": "Mohammad Noormohammadpour and Cauligi S. Raghavendra", "title": "Minimizing Flow Completion Times using Adaptive Routing over\n  Inter-Datacenter Wide Area Networks", "comments": "Accepted into IEEE INFOCOM 2018 Poster Sessions, Honolulu, HI, USA", "journal-ref": "IEEE INFOCOM 2018 - IEEE Conference on Computer Communications\n  Workshops (2018) 1046-1047", "doi": "10.1109/INFCOMW.2018.8406853", "report-no": null, "categories": "cs.NI cs.DC cs.PF cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inter-datacenter networks connect dozens of geographically dispersed\ndatacenters and carry traffic flows with highly variable sizes and different\nclasses. Adaptive flow routing can improve efficiency and performance by\nassigning paths to new flows according to network status and flow properties. A\npopular approach widely used for traffic engineering is based on current\nbandwidth utilization of links. We propose an alternative that reduces\nbandwidth usage by up to at least 50% and flow completion times by up to at\nleast 40% across various scheduling policies and flow size distributions.\n", "versions": [{"version": "v1", "created": "Sun, 25 Feb 2018 21:14:30 GMT"}], "update_date": "2018-07-11", "authors_parsed": [["Noormohammadpour", "Mohammad", ""], ["Raghavendra", "Cauligi S.", ""]]}, {"id": "1802.09118", "submitter": "Yonatan Naamad", "authors": "Moses Charikar, Yonatan Naamad, Jennifer Rexford, X. Kelvin Zou", "title": "Multi-Commodity Flow with In-Network Processing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern networks run \"middleboxes\" that offer services ranging from network\naddress translation and server load balancing to firewalls, encryption, and\ncompression. In an industry trend known as Network Functions Virtualization\n(NFV), these middleboxes run as virtual machines on any commodity server, and\nthe switches steer traffic through the relevant chain of services. Network\nadministrators must decide how many middleboxes to run, where to place them,\nand how to direct traffic through them, based on the traffic load and the\nserver and network capacity. Rather than placing specific kinds of middleboxes\non each processing node, we argue that server virtualization allows each server\nnode to host all middlebox functions, and simply vary the fraction of resources\ndevoted to each one. This extra flexibility fundamentally changes the\noptimization problem the network administrators must solve to a new kind of\nmulti-commodity flow problem, where the traffic flows consume bandwidth on the\nlinks as well as processing resources on the nodes. We show that allocating\nresources to maximize the processed flow can be optimized exactly via a linear\nprogramming formulation, and to arbitrary accuracy via an efficient\ncombinatorial algorithm. Our experiments with real traffic and topologies show\nthat a joint optimization of node and link resources leads to an efficient use\nof bandwidth and processing capacity. We also study a class of design problems\nthat decide where to provide node capacity to best process and route a given\nset of demands, and demonstrate both approximation algorithms and hardness\nresults for these problems.\n", "versions": [{"version": "v1", "created": "Mon, 26 Feb 2018 01:07:32 GMT"}], "update_date": "2018-02-27", "authors_parsed": [["Charikar", "Moses", ""], ["Naamad", "Yonatan", ""], ["Rexford", "Jennifer", ""], ["Zou", "X. Kelvin", ""]]}, {"id": "1802.09262", "submitter": "Fabian Eckermann", "authors": "Fabian Eckermann, Philipp Gorczak, Christian Wietfeld", "title": "tinyLTE: Lightweight, Ad-Hoc Deployable Cellular Network for Vehicular\n  Communication", "comments": null, "journal-ref": "2018 IEEE 87th Vehicular Technology Conference (VTC Spring)", "doi": "10.1109/VTCSpring.2018.8417761", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The application of LTE technology has evolved from infrastructure-based\ndeployments in licensed bands to new use cases covering ad hoc,\ndevice-to-device communications and unlicensed band operation. Vehicular\ncommunication is an emerging field of particular interest for LTE, covering in\nour understanding both automotive (cars) as well as unmanned aerial vehicles.\nExisting commercial equipment is designed for infrastructure making it\nunsuitable for vehicular applications requiring low weight and unlicensed band\nsupport (e.g. 5.9 GHz ITS-band). In this work, we present tinyLTE, a system\ndesign which provides fully autonomous, multi-purpose and ultra-compact LTE\ncells by utilizing existing open source eNB and EPC implementations. Due to its\nsmall form factor and low weight, the tinyLTE system enables mobile deployment\non board of cars and drones as well as smooth integration with existing\nroadside infrastructure. Additionally, the standalone design allows for systems\nto be chained in a multi-hop configuration. The paper describes the lean and\nlow-cost design concept and implementation followed by a performance evaluation\nfor single and two-hop configurations at 5.9 GHz. The results from both lab and\nfield experiments validate the feasibility of the tinyLTE approach and\ndemonstrate its potential to even support real-time vehicular applications\n(e.g. with a lowest average end-to-end latency of around 7 ms in the lab\nexperiment).\n", "versions": [{"version": "v1", "created": "Mon, 26 Feb 2018 11:56:42 GMT"}], "update_date": "2018-08-03", "authors_parsed": [["Eckermann", "Fabian", ""], ["Gorczak", "Philipp", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1802.09591", "submitter": "Salvatore D'Oro", "authors": "Salvatore D'Oro, Alessio Zappone, Sergio Palazzo, Marco Lops", "title": "A Learning Approach for Low-Complexity Optimization of Energy Efficiency\n  in Multi-Carrier Wireless Networks", "comments": null, "journal-ref": "IEEE Transactions on Wireless Communications, 2018", "doi": "10.1109/TWC.2018.2808490", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes computationally efficient algorithms to maximize the\nenergy efficiency in multi-carrier wireless interference networks, by a\nsuitable allocation of the system radio resources, namely the transmit powers\nand subcarrier assignment. The problem is formulated as the maximization of the\nsystem Global Energy-Efficiency subject to both maximum power and minimum rate\nconstraints. This leads to a challenging non-convex fractional problem, which\nis tackled through an interplay of fractional programming, learning, and game\ntheory. The proposed algorithmic framework is provably convergent and has a\ncomplexity linear in both the number of users and subcarriers, whereas other\navailable solutions can only guarantee a polynomial complexity in the number of\nusers and subcarriers. Numerical results show that the proposed method performs\nsimilarly as other, more complex, algorithms.\n", "versions": [{"version": "v1", "created": "Mon, 26 Feb 2018 20:28:02 GMT"}], "update_date": "2018-03-02", "authors_parsed": [["D'Oro", "Salvatore", ""], ["Zappone", "Alessio", ""], ["Palazzo", "Sergio", ""], ["Lops", "Marco", ""]]}, {"id": "1802.09705", "submitter": "Fan Yang", "authors": "Fan Yang, Shining Li, Zhe Yang, Tao Gu and Cheng Qian", "title": "Enabling Multiple Access for Non-Line-of-Sight Light-to-Camera\n  Communications", "comments": "12 pages, 13 figures", "journal-ref": null, "doi": "10.1109/TMC.2018.2880442", "report-no": null, "categories": "cs.ET cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Light-to-Camera Communications (LCC) have emerged as a new wireless\ncommunication technology with great potential to benefit a broad range of\napplications. However, the existing LCC systems either require cameras directly\nfacing to the lights or can only communicate over a single link, resulting in\nlow throughputs and being fragile to ambient illuminant interference. We\npresent HYCACO, a novel LCC system, which enables multiple light emitting\ndiodes (LEDs) with an unaltered camera to communicate via the non-line-of-sight\n(NLoS) links. Different from other NLoS LCC systems, the proposed scheme is\nresilient to the complex indoor luminous environment. HYCACO can decode the\nmessages by exploring the mixed reflected optical signals transmitted from\nmultiple LEDs. By further exploiting the rolling shutter mechanism, we present\nthe optimal optical frequencies and camera exposure duration selection strategy\nto achieve the best performance. We built a hardware prototype to demonstrate\nthe efficiency of the proposed scheme under different application scenarios.\nThe experimental results show that the system throughput reaches 4.5 kbps on\niPhone 6s with three transmitters. With the robustness, improved system\nthroughput and ease of use, HYCACO has great potentials to be used in a wide\nrange of applications such as advertising, tagging objects, and device\ncertifications.\n", "versions": [{"version": "v1", "created": "Tue, 27 Feb 2018 03:31:35 GMT"}, {"version": "v2", "created": "Wed, 1 Aug 2018 16:38:57 GMT"}], "update_date": "2018-11-21", "authors_parsed": [["Yang", "Fan", ""], ["Li", "Shining", ""], ["Yang", "Zhe", ""], ["Gu", "Tao", ""], ["Qian", "Cheng", ""]]}, {"id": "1802.09815", "submitter": "Muhammad Shahbaz", "authors": "Muhammad Shahbaz, Lalith Suresh, Jen Rexford, Nick Feamster, Ori\n  Rottenstreich, and Mukesh Hira", "title": "Elmo: Source-Routed Multicast for Cloud Services", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present Elmo, a system that addresses the multicast scalability problem in\nmulti-tenant data centers. Modern cloud applications frequently exhibit\none-to-many communication patterns and, at the same time, require\nsub-millisecond latencies and high throughput. IP multicast can achieve these\nrequirements but has control- and data-plane scalability limitations that make\nit challenging to offer it as a service for hundreds of thousands of tenants,\ntypical of cloud environments. Tenants, therefore, must rely on unicast-based\napproaches (e.g., application-layer or overlay-based) to support multicast in\ntheir applications, imposing overhead on throughput and end host CPU\nutilization, with higher and unpredictable latencies.\n  Elmo scales network multicast by taking advantage of emerging programmable\nswitches and the unique characteristics of data-center networks; specifically,\nthe symmetric topology and short paths in a data center. Elmo encodes multicast\ngroup information inside packets themselves, reducing the need to store the\nsame information in network switches. In a three-tier data-center topology with\n27K hosts, Elmo supports a million multicast groups using a 325-byte packet\nheader, requiring as few as 1.1K multicast group-table entries on average in\nleaf switches, with a traffic overhead as low as 5% over ideal multicast.\n", "versions": [{"version": "v1", "created": "Tue, 27 Feb 2018 10:41:47 GMT"}, {"version": "v2", "created": "Thu, 31 May 2018 16:38:21 GMT"}], "update_date": "2018-06-01", "authors_parsed": [["Shahbaz", "Muhammad", ""], ["Suresh", "Lalith", ""], ["Rexford", "Jen", ""], ["Feamster", "Nick", ""], ["Rottenstreich", "Ori", ""], ["Hira", "Mukesh", ""]]}, {"id": "1802.10140", "submitter": "Chinmaya Samal", "authors": "Chinmaya Samal, Liyuan Zheng, Fangzhou Sun, Lillian J. Ratliff,\n  Abhishek Dubey", "title": "Towards a Socially Optimal Multi-Modal Routing Platform", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing rate of urbanization has added pressure on the already\nconstrained transportation networks in our communities. Ride-sharing platforms\nsuch as Uber and Lyft are becoming a more commonplace, particularly in urban\nenvironments. While such services may be deemed more convenient than riding\npublic transit due to their on-demand nature, reports show that they do not\nnecessarily decrease the congestion in major cities. One of the key problems is\nthat typically mobility decision support systems focus on individual utility\nand react only after congestion appears. In this paper, we propose socially\nconsiderate multi-modal routing algorithms that are proactive and consider, via\npredictions, the shared effect of riders on the overall efficacy of mobility\nservices. We have adapted the MATSim simulator framework to incorporate the\nproposed algorithms present a simulation analysis of a case study in Nashville,\nTennessee that assesses the effects of our routing models on the traffic\ncongestion for different levels of penetration and adoption of socially\nconsiderate routes. Our results indicate that even at a low penetration (social\nratio), we are able to achieve an improvement in system-level performance.\n", "versions": [{"version": "v1", "created": "Tue, 27 Feb 2018 19:50:28 GMT"}], "update_date": "2018-03-01", "authors_parsed": [["Samal", "Chinmaya", ""], ["Zheng", "Liyuan", ""], ["Sun", "Fangzhou", ""], ["Ratliff", "Lillian J.", ""], ["Dubey", "Abhishek", ""]]}, {"id": "1802.10338", "submitter": "Khaled Abdelfadeel", "authors": "Khaled Q. Abdelfadeel, Victor Cionca, Dirk Pesch", "title": "Fair Adaptive Data Rate Allocation and Power Control in LoRaWAN", "comments": "9 pages, 7 figures, 1 algorithm, submitted to WoWMoM 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present results of a study of the data rate fairness among\nnodes within a LoRaWAN cell. Since LoRa/LoRaWAN supports various data rates, we\nfirstly derive the fairest ratios of deploying each data rate within a cell for\na fair collision probability. LoRa/LoRaWAN, like other frequency modulation\nbased radio interfaces, exhibits the \\textit{capture effect} in which only the\nstronger signal of colliding signals will be extracted. This leads to\nunfairness, where far nodes or nodes experiencing higher attenuation are less\nlikely to see their packets received correctly. Therefore, we secondly develop\na transmission power control algorithm to balance the received signal powers\nfrom all nodes regardless of their distances from the gateway for a fair data\nextraction. Simulations show that our approach achieves higher fairness in data\nrate than the state-of-art in almost all network configurations.\n", "versions": [{"version": "v1", "created": "Wed, 28 Feb 2018 10:16:42 GMT"}], "update_date": "2018-03-01", "authors_parsed": [["Abdelfadeel", "Khaled Q.", ""], ["Cionca", "Victor", ""], ["Pesch", "Dirk", ""]]}, {"id": "1802.10438", "submitter": "Banu Kabakulak", "authors": "Banu Kabakulak", "title": "Sensor and Sink Placement, Scheduling and Routing Algorithms for\n  Connected Coverage of Wireless Sensor Networks", "comments": "30 pages, 1 figure, 7 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A sensor is a small electronic device which has the ability to sense, compute\nand communicate either with other sensors or directly with a base station\n(sink). In a wireless sensor network (WSN), the sensors monitor a region and\ntransmit the collected data packets through routes to the sinks. In this study,\nwe propose a mixed--integer linear programming (MILP) model to maximize the\nnumber of time periods that a WSN carries out the desired tasks with limited\nenergy and budget. Our sink and sensor placement, scheduling, routing with\nconnected coverage ($SPSRC$) model is the first in the literature that combines\nthe decisions for the locations of sinks and sensors, activity schedules of the\ndeployed sensors, and data flow routes from each active sensor to its assigned\nsink for connected coverage of the network over a finite planning horizon. The\nproblem is NP--hard and difficult to solve even for small instances. Assuming\nthat the sink locations are known, we develop heuristics which construct a\nfeasible solution of the problem by gradually satisfying the constraints. Then,\nwe introduce search heuristics to determine the locations of the sinks to\nmaximize the network lifetime. Computational experiments reveal that our\nheuristic methods can find near optimal solutions in an acceptable amount of\ntime compared to the commercial solver CPLEX 12.7.0.\n", "versions": [{"version": "v1", "created": "Wed, 28 Feb 2018 14:43:30 GMT"}], "update_date": "2018-03-01", "authors_parsed": [["Kabakulak", "Banu", ""]]}, {"id": "1802.10472", "submitter": "Andrea Tassi", "authors": "Ioannis Mavromatis, Andrea Tassi, Robert J. Piechocki, Andrew Nix", "title": "Efficient V2V Communication Scheme for 5G MmWave Hyper-Connected CAVs", "comments": "To be presented at the IEEE ICC 2018 Workshop - 5G and Cooperative\n  Autonomous Driving", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Connected and Autonomous Vehicles (CAVs) require continuous access to sensory\ndata to perform complex high-speed maneuvers and advanced trajectory planning.\nHigh priority CAVs are particularly reliant on extended perception horizon\nfacilitated by sensory data exchange between CAVs. Existing technologies such\nas the Dedicated Short Range Communications (DSRC) are ill-equipped to provide\nadvanced cooperative perception service. This creates the need for more\nsophisticated technologies such as the 5G Millimetre-Waves (mmWaves). In this\nwork, we propose a distributed Vehicle-to-Vehicle (V2V) mmWaves association\nscheme operating in a heterogeneous manner. Our system utilises the information\nexchanged within the DSRC frequency band to bootstrap the best CAV pairs\nformation. Using a Stable Fixtures Matching Game, we form V2V\nmultipoint-to-multipoint links. Compared to more traditional point-to-point\nlinks, our system provides almost twice as much sensory data exchange capacity\nfor high priority CAVs while doubling the mmWaves channel utilisation for all\nthe vehicles in the network.\n", "versions": [{"version": "v1", "created": "Wed, 28 Feb 2018 15:17:13 GMT"}, {"version": "v2", "created": "Fri, 2 Mar 2018 12:43:19 GMT"}], "update_date": "2018-03-05", "authors_parsed": [["Mavromatis", "Ioannis", ""], ["Tassi", "Andrea", ""], ["Piechocki", "Robert J.", ""], ["Nix", "Andrew", ""]]}, {"id": "1802.10552", "submitter": "Mehrnaz Afshang", "authors": "Mehrnaz Afshang, Chiranjib Saha, and Harpreet S. Dhillon", "title": "Equi-coverage Contours in Cellular Networks", "comments": "To appear in IEEE Wireless Communications Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this letter, we introduce a general cellular network model where i) users\nand BSs are distributed as two general point processes that may be coupled, ii)\npathloss is assumed to follow a multi-slope power-law pathloss model, and iii)\nfading (power) is assumed to be independent across all wireless links. For this\nsetup, we first obtain a set of contours representing the same meta\ndistribution of SIR, which is the distribution of the conditional coverage\nprobability given the point process, for different values of the parameters of\nthe pathloss function and BS and user point processes. This general result is\nthen specialized to 3GPP-inspired user and BS configurations obtained by\ncombining Poisson point process (PPP) and Poisson cluster process (PCP).\n", "versions": [{"version": "v1", "created": "Wed, 28 Feb 2018 17:42:51 GMT"}], "update_date": "2018-03-01", "authors_parsed": [["Afshang", "Mehrnaz", ""], ["Saha", "Chiranjib", ""], ["Dhillon", "Harpreet S.", ""]]}]