[{"id": "0903.0419", "submitter": "Gourab Ghoshal", "authors": "Gourab Ghoshal, Vinko Zlatic, Guido Caldarelli, and M. E. J. Newman", "title": "Random hypergraphs and their applications", "comments": "11 pages, 7 figures", "journal-ref": "Phys. Rev. E 79, 066118 (2009)", "doi": "10.1103/PhysRevE.79.066118", "report-no": null, "categories": "physics.soc-ph cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last few years we have witnessed the emergence, primarily in on-line\ncommunities, of new types of social networks that require for their\nrepresentation more complex graph structures than have been employed in the\npast. One example is the folksonomy, a tripartite structure of users,\nresources, and tags -- labels collaboratively applied by the users to the\nresources in order to impart meaningful structure on an otherwise\nundifferentiated database. Here we propose a mathematical model of such\ntripartite structures which represents them as random hypergraphs. We show that\nit is possible to calculate many properties of this model exactly in the limit\nof large network size and we compare the results against observations of a real\nfolksonomy, that of the on-line photography web site Flickr. We show that in\nsome cases the model matches the properties of the observed network well, while\nin others there are significant differences, which we find to be attributable\nto the practice of multiple tagging, i.e., the application by a single user of\nmany tags to one resource, or one tag to many resources.\n", "versions": [{"version": "v1", "created": "Tue, 3 Mar 2009 03:38:09 GMT"}], "update_date": "2009-08-13", "authors_parsed": [["Ghoshal", "Gourab", ""], ["Zlatic", "Vinko", ""], ["Caldarelli", "Guido", ""], ["Newman", "M. E. J.", ""]]}, {"id": "0903.1680", "submitter": "Chao He", "authors": "H. Zhuge, C. He", "title": "Faceted Exploration of Emerging Resource Spaces", "comments": "20 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.DL cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Humans have the ability to regcognize the real world from different facets.\nFaceted exploration is a mechanism for browsing and understanding large-scale\nresources in information network by multiple facets. This paper proposes an\nEmerging Resource Space Model, whose schema is a partially ordered set of\nconcepts with subclassOf relation and each resource is categorized by multiple\nconcepts. Emering Resource Space (ERS) is a class of resources characterized by\na concept set. ERSes compose a lattice (ERSL) via concept association. A series\nof exploration operations is proposed to guide users to explore through ERSL\nwith more demanding and richer semantics than current faceted navigation. To\nfulfill instant response during faceted exploration, we devise an efficient\nalgorithm for mining and indexing ERSL. The proposed model can effectively\nsupport faceted exploration in various applications from personal information\nmanagement to large-scale information sharing.\n", "versions": [{"version": "v1", "created": "Tue, 10 Mar 2009 04:01:15 GMT"}, {"version": "v2", "created": "Tue, 5 Oct 2010 09:38:02 GMT"}], "update_date": "2010-10-06", "authors_parsed": [["Zhuge", "H.", ""], ["He", "C.", ""]]}, {"id": "0903.3228", "submitter": "Alberto Accomazzi", "authors": "Michael J. Kurtz, Alberto Accomazzi, Stephen S. Murray", "title": "The Smithsonian/NASA Astrophysics Data System (ADS) Decennial Report", "comments": "6 pages, whitepaper submitted to the National Research Council\n  Astronomy and Astrophysics Decadal Survey", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Eight years after the ADS first appeared the last decadal survey wrote:\n\"NASA's initiative for the Astrophysics Data System has vastly increased the\naccessibility of the scientific literature for astronomers. NASA deserves\ncredit for this valuable initiative and is urged to continue it.\" Here we\nsummarize some of the changes concerning the ADS which have occurred in the\npast ten years, and we describe the current status of the ADS. We then point\nout two areas where the ADS is building an improved capability which could\nbenefit from a policy statement of support in the ASTRO2010 report. These are:\nThe Semantic Interlinking of Astronomy Observations and Datasets and The\nIndexing of the Full Text of Astronomy Research Publications.\n", "versions": [{"version": "v1", "created": "Wed, 18 Mar 2009 19:36:57 GMT"}], "update_date": "2009-03-19", "authors_parsed": [["Kurtz", "Michael J.", ""], ["Accomazzi", "Alberto", ""], ["Murray", "Stephen S.", ""]]}, {"id": "0903.3562", "submitter": "Andrea Scharnhorst", "authors": "Katy Boerner, Andrea Scharnhorst", "title": "Visual Conceptualizations and Models of Science", "comments": "Guest Editor's Introduction to the 2009 Journal of Informetrics\n  Special Issue on the Science of Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This Journal of Informetrics special issue aims to improve our understanding\nof the structure and dynamics of science by reviewing and advancing existing\nconceptualizations and models of scholarly activity. Several of these\nconceptualizations and models have visual manifestations supporting the\ncombination and comparison of theories and approaches developed in different\ndisciplines of science. Subsequently, we discuss challenges towards a\ntheoretically grounded and practically useful science of science and provide a\nbrief chronological review of relevant work. Then, we exemplarily present three\nconceptualizations of science that attempt to provide frameworks for the\ncomparison and combination of existing approaches, theories, laws, and\nmeasurements. Finally, we discuss the contributions of and interlinkages among\nthe eight papers included in this issue. Each paper makes a unique contribution\ntowards conceptualizations and models of science and roots this contribution in\na review and comparison with existing work.\n", "versions": [{"version": "v1", "created": "Fri, 20 Mar 2009 16:35:18 GMT"}], "update_date": "2009-03-23", "authors_parsed": [["Boerner", "Katy", ""], ["Scharnhorst", "Andrea", ""]]}, {"id": "0903.5254", "submitter": "David Campbell", "authors": "Eric Archambault, David Campbell, Yves Gingras, Vincent Lariviere", "title": "Comparing Bibliometric Statistics Obtained from the Web of Science and\n  Scopus", "comments": "9 pages, 6 figures", "journal-ref": null, "doi": "10.1002/asi.21062", "report-no": null, "categories": "cs.IR cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For more than 40 years, the Institute for Scientific Information (ISI, now\npart of Thomson Reuters) produced the only available bibliographic databases\nfrom which bibliometricians could compile large-scale bibliometric indicators.\nISI's citation indexes, now regrouped under the Web of Science (WoS), were the\nmajor sources of bibliometric data until 2004, when Scopus was launched by the\npublisher Reed Elsevier. For those who perform bibliometric analyses and\ncomparisons of countries or institutions, the existence of these two major\ndatabases raises the important question of the comparability and stability of\nstatistics obtained from different data sources. This paper uses macro-level\nbibliometric indicators to compare results obtained from the WoS and Scopus. It\nshows that the correlations between the measures obtained with both databases\nfor the number of papers and the number of citations received by countries, as\nwell as for their ranks, are extremely high (R2 > .99). There is also a very\nhigh correlation when countries' papers are broken down by field. The paper\nthus provides evidence that indicators of scientific production and citations\nat the country level are stable and largely independent of the database.\n", "versions": [{"version": "v1", "created": "Mon, 30 Mar 2009 15:56:49 GMT"}], "update_date": "2009-03-31", "authors_parsed": [["Archambault", "Eric", ""], ["Campbell", "David", ""], ["Gingras", "Yves", ""], ["Lariviere", "Vincent", ""]]}]