[{"id": "1512.00421", "submitter": "L\\'aszl\\'o Csat\\'o", "authors": "L\\'aszl\\'o Csat\\'o", "title": "On the additivity of preference aggregation methods", "comments": "24 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper reviews some axioms of additivity concerning ranking methods used\nfor generalized tournaments with possible missing values and multiple\ncomparisons. It is shown that one of the most natural properties, called\nconsistency, has strong links to independence of irrelevant comparisons, an\naxiom judged unfavourable when players have different opponents. Therefore some\ndirections of weakening consistency are suggested, and several ranking methods,\nthe score, generalized row sum and least squares as well as fair bets and its\ntwo variants (one of them entirely new) are analysed whether they satisfy the\nproperties discussed. It turns out that least squares and generalized row sum\nwith an appropriate parameter choice preserve the relative ranking of two\nobjects if the ranking problems added have the same comparison structure.\n", "versions": [{"version": "v1", "created": "Mon, 30 Nov 2015 13:38:35 GMT"}], "update_date": "2015-12-02", "authors_parsed": [["Csató", "László", ""]]}, {"id": "1512.01375", "submitter": "Veerle Timmermans", "authors": "Tobias Harks, Veerle Timmermans", "title": "Uniqueness of Equilibria in Atomic Splittable Polymatroid Congestion\n  Games", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study uniqueness of Nash equilibria in atomic splittable congestion games\nand derive a uniqueness result based on polymatroid theory: when the strategy\nspace of every player is a bidirectional flow polymatroid, then equilibria are\nunique. Bidirectional flow polymatroids are introduced as a subclass of\npolymatroids possessing certain exchange properties. We show that important\ncases such as base orderable matroids can be recovered as a special case of\nbidirectional flow polymatroids. On the other hand we show that matroidal set\nsystems are in some sense necessary to guarantee uniqueness of equilibria: for\nevery atomic splittable congestion game with at least three players and\nnonmatroidal set systems per player, there is an isomorphic game having\nmultiple equilibria. Our results leave a gap between base orderable matroids\nand general matroids for which we do not know whether equilibria are unique.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2015 11:25:25 GMT"}, {"version": "v2", "created": "Tue, 8 Mar 2016 09:19:22 GMT"}, {"version": "v3", "created": "Wed, 8 Aug 2018 07:01:46 GMT"}], "update_date": "2018-08-09", "authors_parsed": [["Harks", "Tobias", ""], ["Timmermans", "Veerle", ""]]}, {"id": "1512.01764", "submitter": "Piotr Szczepa\\'nski", "authors": "Piotr Lech Szczepa\\'nski", "title": "Fast Algorithms for Game-Theoretic Centrality Measures", "comments": "Doctoral Dissertation at Warsaw University of Technology, Faculty of\n  Electronics and Information Technology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this dissertation, we analyze the computational properties of\ngame-theoretic centrality measures. The key idea behind game-theoretic approach\nto network analysis is to treat nodes as players in a cooperative game, where\nthe value of each coalition of nodes is determined by certain graph properties.\nNext, the centrality of any individual node is determined by a chosen\ngame-theoretic solution concept (notably, the Shapley value) in the same way as\nthe payoff of a player in a cooperative game. On one hand, the advantage of\ngame-theoretic centrality measures is that nodes are ranked not only according\nto their individual roles but also according to how they contribute to the role\nplayed by all possible subsets of nodes. On the other hand, the disadvantage is\nthat the game-theoretic solution concepts are typically computationally\nchallenging. The main contribution of this dissertation is that we show that a\nwide variety of game-theoretic solution concepts on networks can be computed in\npolynomial time. Our focus is on centralities based on the Shapley value and\nits various extensions, such as the Semivalues and Coalitional Semivalues.\nFurthermore, we prove #P-hardness of computing the Shapley value in\nconnectivity games and propose an algorithm to compute it. Finally, we analyse\ncomputational properties of generalized version of cooperative games in which\norder of player matters. We propose a new representation for such games, called\ngeneralized marginal contribution networks, that allows for polynomial\ncomputation in the size of the representation of two dedicated extensions of\nthe Shapley value to this class of games.\n", "versions": [{"version": "v1", "created": "Sun, 6 Dec 2015 09:56:48 GMT"}], "update_date": "2015-12-08", "authors_parsed": [["Szczepański", "Piotr Lech", ""]]}, {"id": "1512.02078", "submitter": "Yanjing Wang", "authors": "Kai Li and Yanjing Wang", "title": "From rules to runs: A dynamic epistemic take on imperfect information\n  games", "comments": "draft of a paper accepted by Studies in Logic (published by Sun\n  Yat-Sen University)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the literature of game theory, the information sets of extensive form\ngames have different interpretations, which may lead to confusions and\nparadoxical cases. We argue that the problem lies in the mix-up of two\ninterpretations of the extensive form game structures: game rules or game runs\nwhich do not always coincide. In this paper, we try to separate and connect\nthese two views by proposing a dynamic epistemic framework in which we can\ncompute the runs step by step from the game rules plus the given assumptions of\nthe players. We propose a modal logic to describe players' knowledge and its\nchange during the plays, and provide a complete axiomatization. We also show\nthat, under certain conditions, the mix-up of the rules and the runs is not\nharmful due to the structural similarity of the two.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2015 15:01:18 GMT"}], "update_date": "2015-12-08", "authors_parsed": [["Li", "Kai", ""], ["Wang", "Yanjing", ""]]}, {"id": "1512.02160", "submitter": "Holly Borowski", "authors": "Holly P. Borowski, Jason R. Marden, and Jeff S. Shamma", "title": "Learning Efficient Correlated Equilibria", "comments": "11 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The majority of distributed learning literature focuses on convergence to\nNash equilibria. Correlated equilibria, on the other hand, can often\ncharacterize more efficient collective behavior than even the best Nash\nequilibrium. However, there are no existing distributed learning algorithms\nthat converge to specific correlated equilibria. In this paper, we provide one\nsuch algorithm which guarantees that the agents' collective joint strategy will\nconstitute an efficient correlated equilibrium with high probability. The key\nto attaining efficient correlated behavior through distributed learning\ninvolves incorporating a common random signal into the learning environment.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2015 18:42:13 GMT"}], "update_date": "2015-12-08", "authors_parsed": [["Borowski", "Holly P.", ""], ["Marden", "Jason R.", ""], ["Shamma", "Jeff S.", ""]]}, {"id": "1512.02285", "submitter": "Shravas Rao", "authors": "Richard Cole and Shravas Rao", "title": "Applications of $\\alpha$-strongly regular distributions to Bayesian\n  auctions", "comments": "Added references, corrected typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two classes of distributions that are widely used in the analysis of Bayesian\nauctions are the Monotone Hazard Rate (MHR) and Regular distributions. They can\nboth be characterized in terms of the rate of change of the associated virtual\nvalue functions: for MHR distributions the condition is that for values $v <\nv'$, $\\phi(v') - \\phi(v) \\ge v' - v$, and for regular distributions, $\\phi(v')\n- \\phi(v) \\ge 0$. Cole and Roughgarden introduced the interpolating class of\n$\\alpha$-Strongly Regular distributions ($\\alpha$-SR distributions for short),\nfor which $\\phi(v') - \\phi(v) \\ge \\alpha(v' - v)$, for $0 \\le \\alpha \\le 1$.\n  In this paper, we investigate five distinct auction settings for which good\nexpected revenue bounds are known when the bidders' valuations are given by MHR\ndistributions. In every case, we show that these bounds degrade gracefully when\nextended to $\\alpha$-SR distributions. For four of these settings, the auction\nmechanism requires knowledge of these distribution(s) (in the other setting,\nthe distributions are needed only to ensure good bounds on the expected\nrevenue). In these cases we also investigate what happens when the\ndistributions are known only approximately via samples, specifically how to\nmodify the mechanisms so that they remain effective and how the expected\nrevenue depends on the number of samples.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2015 23:23:54 GMT"}, {"version": "v2", "created": "Mon, 18 Jul 2016 19:47:19 GMT"}], "update_date": "2016-07-19", "authors_parsed": [["Cole", "Richard", ""], ["Rao", "Shravas", ""]]}, {"id": "1512.02300", "submitter": "Will Ma", "authors": "Will Ma, David Simchi-Levi", "title": "Reaping the Benefits of Bundling under High Production Costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well-known that selling different goods in a single bundle can\nsignificantly increase revenue. However, bundling is no longer profitable if\nthe goods have high production costs. To overcome this challenge, we introduce\na new mechanism, Pure Bundling with Disposal for Cost (PBDC), where after\nbuying the bundle, the customer is allowed to return any subset of goods for\ntheir costs.\n  We provide two types of guarantees on the profit of PBDC mechanisms relative\nto the optimum in the presence of production costs, under the assumption that\ncustomers have valuations which are additive over the items and drawn\nindependently. We first provide a distribution-dependent guarantee which shows\nthat PBDC earns at least 1-6c^{2/3} of the optimal profit, where c denotes the\ncoefficient of variation of the welfare random variable. c approaches 0 if\nthere are a large number of items whose individual valuations have bounded\ncoefficients of variation, and our constants improve upon those from the\nclassical result of Bakos and Brynjolfsson (1999) without costs.\n  We then provide a distribution-free guarantee which shows that either PBDC or\nindividual sales earns at least 1/5.2 times the optimal profit, generalizing\nand improving the constant of 1/6 from the celebrated result of Babaioff et al.\n(2014). Conversely, we also provide the best-known upper bound on the\nperformance of any partitioning mechanism (which captures both individual sales\nand pure bundling), of 1/1.19 times the optimal profit, improving on the\npreviously-known upper bound of 1/1.08.\n  Finally, we conduct simulations under the same playing field as the extensive\nnumerical study of Chu et al. (2011), which confirm that PBDC outperforms other\nsimple pricing schemes overall.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2015 01:31:06 GMT"}, {"version": "v2", "created": "Fri, 15 Jan 2016 04:37:44 GMT"}, {"version": "v3", "created": "Tue, 13 Sep 2016 00:38:21 GMT"}, {"version": "v4", "created": "Sat, 20 Feb 2021 22:18:39 GMT"}], "update_date": "2021-02-23", "authors_parsed": [["Ma", "Will", ""], ["Simchi-Levi", "David", ""]]}, {"id": "1512.02317", "submitter": "Siddhartha Sahi", "authors": "Pradeep Dubey, Siddhartha Sahi and Martin Shubik", "title": "Money as Minimal Complexity", "comments": "34 pages, v2, fixed typos/references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider mechanisms that provide traders the opportunity to exchange\ncommodity $i$ for commodity $j$, for certain ordered pairs $ij$. Given any\nconnected graph $G$ of opportunities, we show that there is a unique mechanism\n$M_{G}$ that satisfies some natural conditions of \"fairness\" and \"convenience\".\nLet $\\mathfrak{M}(m)$ denote the class of mechanisms $M_{G}$ obtained by\nvarying $G$ on the commodity set $\\left\\{1,\\ldots,m\\right\\} $. We define the\ncomplexity of a mechanism $M$ in $\\mathfrak{M(m)}$ to be a certain pair of\nintegers $\\tau(M),\\pi(M)$ which represent the time required to exchange $i$ for\n$j$ and the information needed to determine the exchange ratio (each in the\nworst case scenario, across all $i\\neq j$). This induces a quasiorder $\\preceq$\non $\\mathfrak{M}(m)$ by the rule \\[ M\\preceq\nM^{\\prime}\\text{if}\\tau(M)\\leq\\tau(M^{\\prime})\\text{and}\\pi(M)\\leq\\pi(M^{\\prime}).\n\\] We show that, for $m>3$, there are precisely three $\\preceq$-minimal\nmechanisms $M_{G}$ in $\\mathfrak{M}(m)$, where $G$ corresponds to the star,\ncycle and complete graphs. The star mechanism has a distinguished commodity --\nthe money -- that serves as the sole medium of exchange and mediates trade\nbetween decentralized markets for the other commodities.\n  Our main result is that, for any weights $\\lambda,\\mu>0,$ the star mechanism\nis the unique minimizer of $\\lambda\\tau(M)+\\mu\\pi(M)$ on $\\mathfrak{M}(m)$ for\nlarge enough $m$.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2015 04:22:19 GMT"}, {"version": "v2", "created": "Wed, 16 Dec 2015 13:42:46 GMT"}], "update_date": "2015-12-17", "authors_parsed": [["Dubey", "Pradeep", ""], ["Sahi", "Siddhartha", ""], ["Shubik", "Martin", ""]]}, {"id": "1512.02668", "submitter": "Philipp Zahn", "authors": "William Zeng, Philipp Zahn", "title": "Contextuality and the Weak Axiom in the Theory of Choice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent work on the logical structure of non-locality has constructed\nscenarios where observations of multi-partite systems cannot be adequately\ndescribed by compositions of non-signaling subsystems. In this paper we apply\nthese frameworks to economics. First we construct a empirical model of choice,\nwhere choices are understood as observable outcomes in a certain sense. An\nanalysis of contextuality within this framework allows us to characterize which\nscenarios allow for the possible construction of an adequate global choice\nrule. In essence, we mathematically characterize when it makes sense to\nconsider the choices of a group as composed of individual choices. We then map\nout the logical space of some relevant empirical principles, relating\nproperties of these contextual choice scenarios to no-signalling theories and\nto the weak axiom of revealed preference.\n", "versions": [{"version": "v1", "created": "Mon, 23 Nov 2015 14:41:22 GMT"}], "update_date": "2015-12-10", "authors_parsed": [["Zeng", "William", ""], ["Zahn", "Philipp", ""]]}, {"id": "1512.02698", "submitter": "Ryan Rogers", "authors": "Michael Kearns, Mallesh M. Pai, Ryan Rogers, Aaron Roth, Jonathan\n  Ullman", "title": "Robust Mediators in Large Games", "comments": "This work unifies and subsumes the two papers \"Mechanism design in\n  large games: incentives and privacy\" ITCS'14 (arXiv:1207.4084) and\n  \"Asymptotically truthful equilibrium selection in large congestion games\" EC\n  '14 (arXiv:1311.2625)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A mediator is a mechanism that can only suggest actions to players, as a\nfunction of all agents' reported types, in a given game of incomplete\ninformation. We study what is achievable by two kinds of mediators, \"strong\"\nand \"weak.\" Players can choose to opt-out of using a strong mediator but cannot\nmisrepresent their type if they opt-in. Such a mediator is \"strong\" because we\ncan view it as having the ability to verify player types. Weak mediators lack\nthis ability--- players are free to misrepresent their type to a weak mediator.\nWe show a striking result---in a prior-free setting, assuming only that the\ngame is large and players have private types, strong mediators can implement\napproximate equilibria of the complete-information game. If the game is a\ncongestion game, then the same result holds using only weak mediators. Our\nresult follows from a novel application of differential privacy, in particular,\na variant we propose called joint differential privacy.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2015 23:37:50 GMT"}, {"version": "v2", "created": "Fri, 11 Dec 2015 03:45:07 GMT"}], "update_date": "2015-12-14", "authors_parsed": [["Kearns", "Michael", ""], ["Pai", "Mallesh M.", ""], ["Rogers", "Ryan", ""], ["Roth", "Aaron", ""], ["Ullman", "Jonathan", ""]]}, {"id": "1512.03223", "submitter": "Thijs Van Ommen", "authors": "Thijs van Ommen, Wouter M. Koolen, Thijs E. Feenstra, Peter D.\n  Gr\\\"unwald", "title": "Robust Probability Updating", "comments": "47 pages, 4 figures. This second version is the accepted manuscript:\n  it incorporates reviewer comments and has a new title", "journal-ref": "International Journal of Approximate Reasoning 74 (2016) 30-57", "doi": "10.1016/j.ijar.2016.03.001", "report-no": null, "categories": "stat.ME cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses an alternative to conditioning that may be used when the\nprobability distribution is not fully specified. It does not require any\nassumptions (such as CAR: coarsening at random) on the unknown distribution.\nThe well-known Monty Hall problem is the simplest scenario where neither naive\nconditioning nor the CAR assumption suffice to determine an updated probability\ndistribution. This paper thus addresses a generalization of that problem to\narbitrary distributions on finite outcome spaces, arbitrary sets of `messages',\nand (almost) arbitrary loss functions, and provides existence and\ncharacterization theorems for robust probability updating strategies. We find\nthat for logarithmic loss, optimality is characterized by an elegant condition,\nwhich we call RCAR (reverse coarsening at random). Under certain conditions,\nthe same condition also characterizes optimality for a much larger class of\nloss functions, and we obtain an objective and general answer to how one should\nupdate probabilities in the light of new information.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2015 11:51:52 GMT"}, {"version": "v2", "created": "Mon, 2 May 2016 14:47:47 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["van Ommen", "Thijs", ""], ["Koolen", "Wouter M.", ""], ["Feenstra", "Thijs E.", ""], ["Grünwald", "Peter D.", ""]]}, {"id": "1512.03253", "submitter": "Nicolas Loizou", "authors": "Nicolas Loizou", "title": "Distributionally Robust Game Theory", "comments": "MSc Thesis, Imperial College London", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The classical, complete-information two-player games assume that the problem\ndata (in particular the payoff matrix) is known exactly by both players. In a\nnow famous result, Nash has shown that any such game has an equilibrium in\nmixed strategies. This result was later extended to a class of\nincomplete-information two-player games by Harsanyi, who assumed that the\npayoff matrix is not known exactly but rather represents a random variable that\nis governed by a probability distribution known to both players.\n  In 2006, Bertsimas and Aghassi proposed a new class of distribution-free\ntwo-player games where the payoff matrix is only known to belong to a given\nuncertainty set. This model relaxes the distributional assumptions of\nHarsanyi's Bayesian games, and it gives rise to an alternative\ndistribution-free equilibrium concept.\n  In this thesis we present a new model of incomplete information games without\nprivate information in which the players use a distributionally robust\noptimization approach to cope with the payoff uncertainty. With some specific\nrestrictions, we show that our \"Distributionally Robust Game\" constitutes a\ntrue generalization of the three aforementioned finite games (Nash games,\nBayesian Games and Robust Games). Subsequently, we prove that the set of\nequilibria of an arbitrary distributionally robust game with specified\nambiguity set can be computed as the component-wise projection of the solution\nset of a multi-linear system of equations and inequalities. Finally, we\ndemonstrate the applicability of our new model of games and highlight its\nimportance.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2015 13:46:56 GMT"}], "update_date": "2015-12-11", "authors_parsed": [["Loizou", "Nicolas", ""]]}, {"id": "1512.03315", "submitter": "Argyrios Deligkas", "authors": "Artur Czumaj, Argyrios Deligkas, Michail Fasoulakis, John Fearnley,\n  Marcin Jurdzi\\'nski, Rahul Savani", "title": "Distributed Methods for Computing Approximate Equilibria", "comments": null, "journal-ref": null, "doi": "10.1007/s00453-018-0465-y", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new, distributed method to compute approximate Nash equilibria\nin bimatrix games. In contrast to previous approaches that analyze the two\npayoff matrices at the same time (for example, by solving a single LP that\ncombines the two players payoffs), our algorithm first solves two independent\nLPs, each of which is derived from one of the two payoff matrices, and then\ncompute approximate Nash equilibria using only limited communication between\nthe players.\n  Our method has several applications for improved bounds for efficient\ncomputations of approximate Nash equilibria in bimatrix games. First, it yields\na best polynomial-time algorithm for computing \\emph{approximate well-supported\nNash equilibria (WSNE)}, which guarantees to find a 0.6528-WSNE in polynomial\ntime. Furthermore, since our algorithm solves the two LPs separately, it can be\nused to improve upon the best known algorithms in the limited communication\nsetting: the algorithm can be implemented to obtain a randomized\nexpected-polynomial-time algorithm that uses poly-logarithmic communication and\nfinds a 0.6528-WSNE. The algorithm can also be carried out to beat the best\nknown bound in the query complexity setting, requiring $O(n \\log n)$ payoff\nqueries to compute a 0.6528-WSNE. Finally, our approach can also be adapted to\nprovide the best known communication efficient algorithm for computing\n\\emph{approximate Nash equilibria}: it uses poly-logarithmic communication to\nfind a 0.382-approximate Nash equilibrium.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2015 16:39:38 GMT"}], "update_date": "2018-10-12", "authors_parsed": [["Czumaj", "Artur", ""], ["Deligkas", "Argyrios", ""], ["Fasoulakis", "Michail", ""], ["Fearnley", "John", ""], ["Jurdziński", "Marcin", ""], ["Savani", "Rahul", ""]]}, {"id": "1512.03440", "submitter": "Chathurika Mediwaththe", "authors": "Chathurika P. Mediwaththe, Edward R. Stephens, David B. Smith, Anirban\n  Mahanti", "title": "Competitive Energy Trading Framework for Demand-side Management in\n  Neighborhood Area Networks", "comments": "Accepted for publication in IEEE Transactions on Smart Grid", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper, by comparing three potential energy trading systems, studies the\nfeasibility of integrating a community energy storage (CES) device with\nconsumer-owned photovoltaic (PV) systems for demand-side management of a\nresidential neighborhood area network. We consider a fully-competitive CES\noperator in a non-cooperative Stackelberg game, a benevolent CES operator that\nhas socially favorable regulations with competitive users, and a centralized\ncooperative CES operator that minimizes the total community energy cost. The\nformer two game-theoretic systems consider that the CES operator first\nmaximizes their revenue by setting a price signal and trading energy with the\ngrid. Then the users with PV panels play a non-cooperative repeated game\nfollowing the actions of the CES operator to trade energy with the CES device\nand the grid to minimize energy costs. The centralized CES operator cooperates\nwith the users to minimize the total community energy cost without appropriate\nincentives. The non-cooperative Stackelberg game with the fully-competitive CES\noperator has a unique Stackelberg equilibrium at which the CES operator\nmaximizes revenue and users obtain unique Pareto-optimal Nash equilibrium CES\nenergy trading strategies. Extensive simulations show that the\nfully-competitive CES model gives the best trade-off of operating environment\nbetween the CES operator and the users.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2015 21:13:50 GMT"}, {"version": "v2", "created": "Sun, 3 Apr 2016 01:28:25 GMT"}, {"version": "v3", "created": "Tue, 5 Apr 2016 01:27:02 GMT"}, {"version": "v4", "created": "Tue, 26 Apr 2016 02:24:36 GMT"}, {"version": "v5", "created": "Tue, 24 Jan 2017 23:51:21 GMT"}], "update_date": "2017-01-26", "authors_parsed": [["Mediwaththe", "Chathurika P.", ""], ["Stephens", "Edward R.", ""], ["Smith", "David B.", ""], ["Mahanti", "Anirban", ""]]}, {"id": "1512.03484", "submitter": "Akaki Mamageishvili", "authors": "Akaki Mamageishvili and Paolo Penna", "title": "Tighter Bounds on the Inefficiency Ratio of Stable Equilibria in Load\n  Balancing Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the inefficiency ratio of stable equilibria in load\nbalancing games introduced by Asadpour and Saberi [3]. We prove tighter lower\nand upper bounds of 7/6 and 4/3, respectively. This improves over the best\nknown bounds in problem (19/18 and 3/2, respectively). Equivalently, the\nresults apply to the question of how well the optimum for the $L_2$ -norm can\napproximate the $L_{\\infty}$-norm (makespan) in identical machines scheduling.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2015 23:35:39 GMT"}], "update_date": "2015-12-14", "authors_parsed": [["Mamageishvili", "Akaki", ""], ["Penna", "Paolo", ""]]}, {"id": "1512.03485", "submitter": "Wayes Tushar", "authors": "Wayes Tushar, Chau Yuen, David Smith and H. Vincent Poor", "title": "Price discrimination for energy trading in smart grid: A game theoretic\n  approach", "comments": "Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pricing schemes are an important smart grid feature to affect typical energy\nusage behavior of energy users (EUs). However, most existing schemes use the\nassumption that a buyer pays the same price per unit of energy to all suppliers\nat any particular time when energy is bought. By contrast, here a discriminate\npricing technique using game theory is studied. A cake cutting game is\ninvestigated, in which participating EUs in a smart community decide on the\nprice per unit of energy to charge a shared facility controller (SFC) in order\nto sell surplus energy. The focus is to study fairness criteria to maximize sum\nbenefits to EUs and ensure an envy-free energy trading market. A benefit\nfunction is designed that leverages generation of discriminate pricing by each\nEU, according to the amount of surplus energy that an EU trades with the SFC\nand the EU's sensitivity to price. It is shown that the game possesses a\nsocially optimal, and hence also Pareto optimal, solution. Further, an\nalgorithm that can be implemented by each EU in a distributed manner to reach\nthe optimal solution is proposed. Numerical case studies are given that\ndemonstrate beneficial properties of the scheme.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2015 23:40:14 GMT"}], "update_date": "2015-12-14", "authors_parsed": [["Tushar", "Wayes", ""], ["Yuen", "Chau", ""], ["Smith", "David", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1512.03543", "submitter": "Yu Cheng", "authors": "Umang Bhaskar, Yu Cheng, Young Kun Ko and Chaitanya Swamy", "title": "Hardness Results for Signaling in Bayesian Zero-Sum and Network Routing\n  Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the optimization problem faced by a perfectly informed principal in\na Bayesian game, who reveals information to the players about the state of\nnature to obtain a desirable equilibrium. This signaling problem is the natural\ndesign question motivated by uncertainty in games and has attracted much recent\nattention. We present new hardness results for signaling problems in (a)\nBayesian two-player zero-sum games, and (b) Bayesian network routing games.\n  For Bayesian zero-sum games, when the principal seeks to maximize the\nequilibrium utility of a player, we show that it is NP-hard to obtain an\nadditive FPTAS. Our hardness proof exploits duality and the equivalence of\nseparation and optimization in a novel way. Further, we rule out an additive\nPTAS assuming planted clique hardness, which states that no polynomial time\nalgorithm can recover a planted clique from an Erd\\H{o}s-R\\'enyi random graph.\nComplementing these, we obtain a PTAS for a structured class of zero-sum games\n(where obtaining an FPTAS is still NP-hard) when the payoff matrices obey a\nLipschitz condition. Previous results ruled out an FPTAS assuming\nplanted-clique hardness, and a PTAS only for implicit games with\nquasi-polynomial-size strategy sets.\n  For Bayesian network routing games, wherein the principal seeks to minimize\nthe average latency of the Nash flow, we show that it is NP-hard to obtain a\n(multiplicative) $(4/3 - \\epsilon)$-approximation, even for linear latency\nfunctions. This is the optimal inapproximability result for linear latencies,\nsince we show that full revelation achieves a $(4/3)$-approximation for linear\nlatencies.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2015 07:46:04 GMT"}, {"version": "v2", "created": "Sun, 30 Oct 2016 05:40:40 GMT"}], "update_date": "2016-11-01", "authors_parsed": [["Bhaskar", "Umang", ""], ["Cheng", "Yu", ""], ["Ko", "Young Kun", ""], ["Swamy", "Chaitanya", ""]]}, {"id": "1512.04017", "submitter": "Paolo Penna", "authors": "Paolo Penna", "title": "The price of anarchy and stability in general noisy best-response\n  dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Logit-response dynamics (Alos-Ferrer and Netzer, Games and Economic Behavior\n2010) are a rich and natural class of noisy best-response dynamics. In this\nwork we revise the price of anarchy and the price of stability by considering\nthe quality of long-run equilibria in these dynamics. Our results show that\nprior studies on simpler dynamics of this type can strongly depend on a\nsynchronous schedule of the players' moves. In particular, a small noise by\nitself is not enough to improve the quality of equilibria as soon as other very\nnatural schedules are used.\n", "versions": [{"version": "v1", "created": "Sun, 13 Dec 2015 08:48:34 GMT"}], "update_date": "2015-12-15", "authors_parsed": [["Penna", "Paolo", ""]]}, {"id": "1512.04152", "submitter": "Chansoo Lee", "authors": "Jacob Abernethy, Chansoo Lee, Ambuj Tewari", "title": "Fighting Bandits with a New Kind of Smoothness", "comments": "In Proceedings of NIPS, 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a novel family of algorithms for the adversarial multi-armed bandit\nproblem, and provide a simple analysis technique based on convex smoothing. We\nprove two main results. First, we show that regularization via the\n\\emph{Tsallis entropy}, which includes EXP3 as a special case, achieves the\n$\\Theta(\\sqrt{TN})$ minimax regret. Second, we show that a wide class of\nperturbation methods achieve a near-optimal regret as low as $O(\\sqrt{TN \\log\nN})$ if the perturbation distribution has a bounded hazard rate. For example,\nthe Gumbel, Weibull, Frechet, Pareto, and Gamma distributions all satisfy this\nkey property.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2015 01:57:02 GMT"}], "update_date": "2015-12-15", "authors_parsed": [["Abernethy", "Jacob", ""], ["Lee", "Chansoo", ""], ["Tewari", "Ambuj", ""]]}, {"id": "1512.04255", "submitter": "Guillermo P\\'erez", "authors": "Guillermo A. P\\'erez", "title": "The Fixed Initial Credit Problem for Partial-Observation Energy Games is\n  Ack-complete", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study two-player games with asymmetric partial observation\nand an energy objective. Such games are played on a weighted automaton by Eve,\nchoosing actions, and Adam, choosing a transition labelled with the given\naction. Eve attempts to maintain the sum of the weights (of the transitions\ntaken) non-negative while Adam tries to do the opposite. Eve does not know the\nexact state of the game, she is only given an equivalence class of states which\ncontains it. In contrast, Adam has full observation. We show the fixed initial\ncredit problem for these games is Ack-complete.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2015 11:06:33 GMT"}, {"version": "v2", "created": "Tue, 15 Dec 2015 15:08:23 GMT"}, {"version": "v3", "created": "Sun, 27 Dec 2015 18:47:29 GMT"}, {"version": "v4", "created": "Thu, 21 Jan 2016 17:04:08 GMT"}, {"version": "v5", "created": "Sun, 14 Feb 2016 16:41:46 GMT"}, {"version": "v6", "created": "Wed, 16 Nov 2016 07:29:20 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Pérez", "Guillermo A.", ""]]}, {"id": "1512.04277", "submitter": "Paolo Penna", "authors": "Mat\\'u\\v{s} Mihal\\'ak, Paolo Penna, Peter Widmayer", "title": "Bribeproof mechanisms for two-values domains", "comments": "Extended abstract accepted to SAGT 2016. This ArXiv version corrects\n  typos in the proofs of Theorem 7 and Claims 28-29 of prior ArXiv version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Schummer (Journal of Economic Theory 2000) introduced the concept of\nbribeproof mechanism which, in a context where monetary transfer between agents\nis possible, requires that manipulations through bribes are ruled out.\nUnfortunately, in many domains, the only bribeproof mechanisms are the trivial\nones which return a fixed outcome.\n  This work presents one of the few constructions of non-trivial bribeproof\nmechanisms for these quasi-linear environments. Though the suggested\nconstruction applies to rather restricted domains, the results obtained are\ntight: For several natural problems, the method yields the only possible\nbribeproof mechanism and no such mechanism is possible on more general domains.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2015 12:25:46 GMT"}, {"version": "v2", "created": "Tue, 9 Aug 2016 08:32:14 GMT"}], "update_date": "2016-08-10", "authors_parsed": [["Mihalák", "Matúš", ""], ["Penna", "Paolo", ""], ["Widmayer", "Peter", ""]]}, {"id": "1512.04637", "submitter": "Siddhartha Sahi", "authors": "Pradeep Dubey, Siddhartha Sahi, Martin Shubik", "title": "Graphical Exchange Mechanisms", "comments": "26 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider an exchange mechanism which accepts diversified offers of various\ncommodities and redistributes everything it receives. We impose certain\nconditions of fairness and convenience on such a mechanism and show that it\nadmits unique prices, which equalize the value of offers and returns for each\nindividual.\n  We next define the complexity of a mechanism in terms of certain integers\n$\\tau_{ij},\\pi_{ij}$ and $k_{i}$ that represent the time required to exchange\n$i$ for $j$, the difficulty in determining the exchange ratio, and the\ndimension of the message space. We show that there are a finite number of\nminimally complex mechanisms, in each of which all trade is conducted through\nmarkets for commodity pairs.\n  Finally we consider minimal mechanisms with smallest worst-case complexities\n$\\tau=\\max\\tau_{ij}$ and $\\pi=\\max\\pi_{ij}$. For $m>3$ commodities, there are\nprecisely three such mechanisms, one of which has a distinguished commodity --\nthe money -- that serves as the sole medium of exchange. As $m\\rightarrow\n\\infty$ the money mechanism is the only one with bounded $\\left( \\pi\n,\\tau\\right) $.\n", "versions": [{"version": "v1", "created": "Tue, 15 Dec 2015 04:00:48 GMT"}], "update_date": "2015-12-16", "authors_parsed": [["Dubey", "Pradeep", ""], ["Sahi", "Siddhartha", ""], ["Shubik", "Martin", ""]]}, {"id": "1512.05075", "submitter": "Hoang Dinh Thai DTH", "authors": "Dusit Niyato, Dinh Thai Hoang, Nguyen Cong Luong, Ping Wang, Dong In\n  Kim, and Zhu Han", "title": "Smart Data Pricing Models for Internet-of-Things (IoT): A Bundling\n  Strategy Approach", "comments": "17 pages, 6 figures, 1 table, IEEE Network Magazine, 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet of things (IoT) has emerged as a new paradigm for the future\nInternet. In IoT, enormous devices are connected to the Internet and thereby\nbeing a huge data source for numerous applications. In this article, we focus\non addressing data management in IoT through using a smart data pricing (SDP)\napproach. With SDP, data can be managed flexibly and efficiently through\nintelligent and adaptive incentive mechanisms. Moreover, it is a major source\nof revenue for providers and partners. We propose a new pricing scheme for IoT\nservice providers to determine the sensing data buying price and IoT service\nsubscription fee offered to sensor owners and service users, respectively.\nAdditionally, we adopt the bundling strategy that allows multiple providers to\nform a coalition and bid their services as a bundle, attracting more users and\nachieving higher revenue. Finally, we outline some important open research\nissues for SDP and IoT.\n", "versions": [{"version": "v1", "created": "Wed, 16 Dec 2015 07:41:55 GMT"}], "update_date": "2015-12-17", "authors_parsed": [["Niyato", "Dusit", ""], ["Hoang", "Dinh Thai", ""], ["Luong", "Nguyen Cong", ""], ["Wang", "Ping", ""], ["Kim", "Dong In", ""], ["Han", "Zhu", ""]]}, {"id": "1512.05141", "submitter": "Evangelos Spyrou", "authors": "Evangelos D. Spyrou and Dimitrios K. Mitrakos", "title": "Approximating Nash Equilibrium Uniqueness of Power Control In Practical\n  WSNs", "comments": "16 pages, 10 figures, Game theory, Wireless Sensor Networks,\n  International Journal of Computer Networks & Communications (IJCNC) Vol.7,\n  No.6, November 2015", "journal-ref": null, "doi": "10.5121/ijcnc.2015.7604", "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transmission power has a major impact on link and communication reliability\nand network lifetime in Wireless Sensor Networks. We study power control in a\nmulti-hop Wireless Sensor Network where nodes' communication interfere with\neach other. Our objective is to determine each node's transmission power level\nthat will reduce the communication interference and keep energy consumption to\na minimum. We propose a potential game approach to obtain the unique\nequilibrium of the network transmission power allocation. The unique\nequilibrium is located in a continuous domain. However, radio transceivers\naccept only discrete values for transmission power level setting. We study the\nviability and performance of mapping the continuous solution from the potential\ngame to the discrete domain required by the radio. We demonstrate the success\nof our approach through TOSSIM simulation when nodes use the Collection Tree\nProtocol for routing the data. Also, we show results of our method from the\nIndriya testbed. We compare it with the case where the motes use Collection\nTree Protocol with the maximum transmission power.\n", "versions": [{"version": "v1", "created": "Wed, 16 Dec 2015 12:08:00 GMT"}], "update_date": "2015-12-17", "authors_parsed": [["Spyrou", "Evangelos D.", ""], ["Mitrakos", "Dimitrios K.", ""]]}, {"id": "1512.05504", "submitter": "Shreyas Sekar", "authors": "Elliot Anshelevich and Shreyas Sekar", "title": "Blind, Greedy, and Random: Ordinal Approximation Algorithms for Matching\n  and Clustering", "comments": "This paper contains the results that appeared in a AAAI'16 paper\n  along with some new results for other problems", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study Matching and other related problems in a partial information setting\nwhere the agents' utilities for being matched to other agents are hidden and\nthe mechanism only has access to ordinal preference information. Our model is\nmotivated by the fact that in many settings, agents cannot express the\nnumerical values of their utility for different outcomes, but are still able to\nrank the outcomes in their order of preference. Specifically, we study problems\nwhere the ground truth exists in the form of a weighted graph, and look to\ndesign algorithms that approximate the true optimum matching using only the\npreference orderings for each agent (induced by the hidden weights) as input.\nIf no restrictions are placed on the weights, then one cannot hope to do better\nthan the simple greedy algorithm, which yields a half optimal matching. Perhaps\nsurprisingly, we show that by imposing a little structure on the weights, we\ncan improve upon the trivial algorithm significantly: we design a\n1.6-approximation algorithm for instances where the hidden weights obey the\nmetric inequality. Using our algorithms for matching as a black-box, we also\ndesign new approximation algorithms for other closely related problems: these\ninclude a a 3.2-approximation for the problem of clustering agents into equal\nsized partitions, a 4-approximation algorithm for Densest k-subgraph, and a\n2.14-approximation algorithm for Max TSP. These results are the first\nnon-trivial ordinal approximation algorithms for such problems, and indicate\nthat we can design robust algorithms even when we are agnostic to the precise\nagent utilities.\n", "versions": [{"version": "v1", "created": "Thu, 17 Dec 2015 09:29:48 GMT"}, {"version": "v2", "created": "Mon, 1 Aug 2016 21:29:51 GMT"}], "update_date": "2016-08-03", "authors_parsed": [["Anshelevich", "Elliot", ""], ["Sekar", "Shreyas", ""]]}, {"id": "1512.05568", "submitter": "Mickael Randour", "authors": "Romain Brenguier, Lorenzo Clemente, Paul Hunter, Guillermo A. P\\'erez,\n  Mickael Randour, Jean-Fran\\c{c}ois Raskin, Ocan Sankur, Mathieu Sassolas", "title": "Non-Zero Sum Games for Reactive Synthesis", "comments": "LATA'16 invited paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this invited contribution, we summarize new solution concepts useful for\nthe synthesis of reactive systems that we have introduced in several recent\npublications. These solution concepts are developed in the context of non-zero\nsum games played on graphs. They are part of the contributions obtained in the\ninVEST project funded by the European Research Council.\n", "versions": [{"version": "v1", "created": "Thu, 17 Dec 2015 13:02:03 GMT"}], "update_date": "2016-08-06", "authors_parsed": [["Brenguier", "Romain", ""], ["Clemente", "Lorenzo", ""], ["Hunter", "Paul", ""], ["Pérez", "Guillermo A.", ""], ["Randour", "Mickael", ""], ["Raskin", "Jean-François", ""], ["Sankur", "Ocan", ""], ["Sassolas", "Mathieu", ""]]}, {"id": "1512.05868", "submitter": "Iddan Golomb", "authors": "Michal Feldman, Amos Fiat, Iddan Golomb", "title": "On Voting and Facility Location", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study mechanisms for candidate selection that seek to minimize the social\ncost, where voters and candidates are associated with points in some underlying\nmetric space. The social cost of a candidate is the sum of its distances to\neach voter. Some of our work assumes that these points can be modeled on a real\nline, but other results of ours are more general.\n  A question closely related to candidate selection is that of minimizing the\nsum of distances for facility location. The difference is that in our setting\nthere is a fixed set of candidates, whereas the large body of work on facility\nlocation seems to consider every point in the metric space to be a possible\ncandidate. This gives rise to three types of mechanisms which differ in the\ngranularity of their input space (voting, ranking and location mechanisms). We\nstudy the relationships between these three classes of mechanisms.\n  While it may seem that Black's 1948 median algorithm is optimal for candidate\nselection on the line, this is not the case. We give matching upper and lower\nbounds for a variety of settings. In particular, when candidates and voters are\non the line, our universally truthful spike mechanism gives a [tight]\napproximation of two. When assessing candidate selection mechanisms, we seek\nseveral desirable properties: (a) efficiency (minimizing the social cost) (b)\ntruthfulness (dominant strategy incentive compatibility) and (c) simplicity (a\nsmaller input space). We quantify the effect that truthfulness and simplicity\nimpose on the efficiency.\n", "versions": [{"version": "v1", "created": "Fri, 18 Dec 2015 07:48:16 GMT"}], "update_date": "2015-12-29", "authors_parsed": [["Feldman", "Michal", ""], ["Fiat", "Amos", ""], ["Golomb", "Iddan", ""]]}, {"id": "1512.05974", "submitter": "Omar Darwish", "authors": "Omar Darwish and Kurt Mehlhorn", "title": "Improved Balanced Flow Computation Using Parametric Flow", "comments": "Article will appear in Information Processing Letters", "journal-ref": null, "doi": "10.1016/j.ipl.2016.04.008", "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new algorithm for computing balanced flows in equality networks\narising in market equilibrium computations. The current best time bound for\ncomputing balanced flows in such networks requires $O(n)$ maxflow computations,\nwhere $n$ is the number of nodes in the network [Devanur et al. 2008]. Our\nalgorithm requires only a single parametric flow computation. The best\nalgorithm for computing parametric flows [Gallo et al. 1989] is only by a\nlogarithmic factor slower than the best algorithms for computing maxflows.\nHence, the running time of the algorithms in [Devanur et al. 2008] and [Duan\nand Mehlhorn 2015] for computing market equilibria in linear Fisher and\nArrow-Debreu markets improve by almost a factor of $n$.\n", "versions": [{"version": "v1", "created": "Fri, 18 Dec 2015 14:41:01 GMT"}, {"version": "v2", "created": "Fri, 13 May 2016 11:34:17 GMT"}], "update_date": "2016-05-16", "authors_parsed": [["Darwish", "Omar", ""], ["Mehlhorn", "Kurt", ""]]}, {"id": "1512.06197", "submitter": "Jiangbin Lyu Dr.", "authors": "Jiangbin Lyu, Yong Huat Chew, Wai-Choong Wong", "title": "A Stackelberg Game Model for Overlay D2D Transmission with Heterogeneous\n  Rate Requirements", "comments": "32 pages, 11 figures, accepted for publication in IEEE Transactions\n  on Vehicular Technology, Dec 11, 2015", "journal-ref": null, "doi": "10.1109/TVT.2015.2511924", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the performance of overlay device-to-device (D2D)\ncommunication links via carrier sense multiple access (CSMA) protocols. We\nassume that the D2D links have heterogeneous rate requirements and different\nwillingness to pay, and each of them acts non-altruistically to achieve its\ntarget rate while maximizing its own payoff. Spatial reuse is allowed if the\nlinks are not interfering with each other. A non-cooperative game model is used\nto address the resource allocation among the D2D links, at the same time\nleveraging on the ideal CSMA network (ICN) model to address the physical\nchannel access issue. We propose a Stackelberg game in which the base station\nin the cellular network acts as a Stackelberg leader to regulate the individual\npayoff by modifying the unit service price so that the total D2D throughput is\nmaximized. The problem is shown to be quasi-convex and can be solved by a\nsequence of equivalent convex optimization problems. The pricing strategies are\ndesigned so that the network always operates within the feasible throughput\nregion. The results are verified by simulations.\n", "versions": [{"version": "v1", "created": "Sat, 19 Dec 2015 06:06:55 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Lyu", "Jiangbin", ""], ["Chew", "Yong Huat", ""], ["Wong", "Wai-Choong", ""]]}, {"id": "1512.06808", "submitter": "Giacomo Bonanno", "authors": "Giacomo Bonanno", "title": "Game Theory (Open Access textbook with 165 solved exercises)", "comments": "578 pages, 163 figures", "journal-ref": null, "doi": "10.13140/RG.2.1.3369.7360", "report-no": null, "categories": "math.HO cs.GT cs.MA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This is an Open Access textbook on non-cooperative Game Theory with 165\nsolved exercises.\n", "versions": [{"version": "v1", "created": "Mon, 21 Dec 2015 20:31:49 GMT"}], "update_date": "2015-12-22", "authors_parsed": [["Bonanno", "Giacomo", ""]]}, {"id": "1512.07010", "submitter": "Pierre Lescanne", "authors": "Pierre Lescanne (LIP)", "title": "The risk of divergence", "comments": "3rd International Workshop on Strategic Reasoning, Dec 2015, Oxford,\n  United Kingdom. 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present infinite extensive strategy profiles with perfect information and\nwe show that replacing finite by infinite changes the notions and the reasoning\ntools. The presentation uses a formalism recently developed by logicians and\ncomputer science theoreticians, called coinduction. This builds a bridge\nbetween economic game theory and the most recent advance in theoretical\ncomputer science and logic. The key result is that rational agents may have\nstrategy leading to divergence .\n", "versions": [{"version": "v1", "created": "Tue, 22 Dec 2015 10:00:58 GMT"}], "update_date": "2015-12-23", "authors_parsed": [["Lescanne", "Pierre", "", "LIP"]]}, {"id": "1512.07590", "submitter": "Elliot Anshelevich", "authors": "Elliot Anshelevich and John Postl", "title": "Randomized Social Choice Functions Under Metric Preferences", "comments": "Portions appeared in IJCAI 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We determine the quality of randomized social choice mechanisms in a setting\nin which the agents have metric preferences: every agent has a cost for each\nalternative, and these costs form a metric. We assume that these costs are\nunknown to the mechanisms (and possibly even to the agents themselves), which\nmeans we cannot simply select the optimal alternative, i.e. the alternative\nthat minimizes the total agent cost (or median agent cost). However, we do\nassume that the agents know their ordinal preferences that are induced by the\nmetric space. We examine randomized social choice functions that require only\nthis ordinal information and select an alternative that is good in expectation\nwith respect to the costs from the metric. To quantify how good a randomized\nsocial choice function is, we bound the distortion, which is the worst-case\nratio between expected cost of the alternative selected and the cost of the\noptimal alternative. We provide new distortion bounds for a variety of\nrandomized mechanisms, for both general metrics and for important special\ncases. Our results show a sizable improvement in distortion over deterministic\nmechanisms.\n", "versions": [{"version": "v1", "created": "Wed, 23 Dec 2015 19:09:35 GMT"}, {"version": "v2", "created": "Mon, 26 Sep 2016 18:42:38 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Anshelevich", "Elliot", ""], ["Postl", "John", ""]]}, {"id": "1512.08106", "submitter": "Mickael Randour", "authors": "Patricia Bouyer and Nicolas Markey and Mickael Randour and Kim G.\n  Larsen and Simon Laursen", "title": "Average-energy games (full version)", "comments": "Full version of GandALF 2015 paper (arXiv:1509.07205)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two-player quantitative zero-sum games provide a natural framework to\nsynthesize controllers with performance guarantees for reactive systems within\nan uncontrollable environment. Classical settings include mean-payoff games,\nwhere the objective is to optimize the long-run average gain per action, and\nenergy games, where the system has to avoid running out of energy.\n  We study average-energy games, where the goal is to optimize the long-run\naverage of the accumulated energy. We show that this objective arises naturally\nin several applications, and that it yields interesting connections with\nprevious concepts in the literature. We prove that deciding the winner in such\ngames is in NP $\\cap$ coNP and at least as hard as solving mean-payoff games,\nand we establish that memoryless strategies suffice to win. We also consider\nthe case where the system has to minimize the average-energy while maintaining\nthe accumulated energy within predefined bounds at all times: this corresponds\nto operating with a finite-capacity storage for energy. We give results for\none-player and two-player games, and establish complexity bounds and memory\nrequirements.\n", "versions": [{"version": "v1", "created": "Sat, 26 Dec 2015 12:52:44 GMT"}, {"version": "v2", "created": "Thu, 28 Jan 2016 10:33:40 GMT"}, {"version": "v3", "created": "Fri, 8 Jul 2016 15:13:24 GMT"}], "update_date": "2016-07-11", "authors_parsed": [["Bouyer", "Patricia", ""], ["Markey", "Nicolas", ""], ["Randour", "Mickael", ""], ["Larsen", "Kim G.", ""], ["Laursen", "Simon", ""]]}, {"id": "1512.08427", "submitter": "Li Han", "authors": "Li Han, David Kempe, Ruixin Qiang", "title": "Incentivizing Exploration with Heterogeneous Value of Money", "comments": "WINE 2015", "journal-ref": "LNCS 9470 (2015) 370-383", "doi": "10.1007/978-3-662-48995-6_27", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, Frazier et al. proposed a natural model for crowdsourced\nexploration of different a priori unknown options: a principal is interested in\nthe long-term welfare of a population of agents who arrive one by one in a\nmulti-armed bandit setting. However, each agent is myopic, so in order to\nincentivize him to explore options with better long-term prospects, the\nprincipal must offer the agent money. Frazier et al. showed that a simple class\nof policies called time-expanded are optimal in the worst case, and\ncharacterized their budget-reward tradeoff.\n  The previous work assumed that all agents are equally and uniformly\nsusceptible to financial incentives. In reality, agents may have different\nutility for money. We therefore extend the model of Frazier et al. to allow\nagents that have heterogeneous and non-linear utilities for money. The\nprincipal is informed of the agent's tradeoff via a signal that could be more\nor less informative.\n  Our main result is to show that a convex program can be used to derive a\nsignal-dependent time-expanded policy which achieves the best possible\nLagrangian reward in the worst case. The worst-case guarantee is matched by\nso-called \"Diamonds in the Rough\" instances; the proof that the guarantees\nmatch is based on showing that two different convex programs have the same\noptimal solution for these specific instances. These results also extend to the\nbudgeted case as in Frazier et al. We also show that the optimal policy is\nmonotone with respect to information, i.e., the approximation ratio of the\noptimal policy improves as the signals become more informative.\n", "versions": [{"version": "v1", "created": "Mon, 28 Dec 2015 14:50:45 GMT"}], "update_date": "2015-12-29", "authors_parsed": [["Han", "Li", ""], ["Kempe", "David", ""], ["Qiang", "Ruixin", ""]]}, {"id": "1512.09239", "submitter": "Corinne Touati", "authors": "Eitan Altman (MAESTRO), Corinne Touati", "title": "Load Balancing Congestion Games and their Asymptotic Behavior", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A central question in routing games has been to establish conditions for the\nuniqueness of the equilibrium, either in terms of network topology or in terms\nof costs. This question is well understood in two classes of routing games. The\nfirst is the non-atomic routing introduced by Wardrop on 1952 in the context of\nroad traffic in which each player (car) is infinitesimally small; a single car\nhas a negligible impact on the congestion. Each car wishes to minimize its\nexpected delay. Under arbitrary topology, such games are known to have a convex\npotential and thus a unique equilibrium. The second framework is splitable\natomic games: there are finitely many players, each controlling the route of a\npopulation of individuals (let them be cars in road traffic or packets in the\ncommunication networks). In this paper, we study two other frameworks of\nrouting games in which each of several players has an integer number of\nconnections (which are population of packets) to route and where there is a\nconstraint that a connection cannot be split. Through a particular game with a\nsimple three link topology, we identify various novel and surprising properties\nof games within these frameworks. We show in particular that equilibria are non\nunique even in the potential game setting of Rosenthal with strictly convex\nlink costs. We further show that non-symmetric equilibria arise in symmetric\nnetworks. I. INTRODUCTION A central question in routing games has been to\nestablish conditions for the uniqueness of the equilibria, either in terms of\nthe network topology or in terms of the costs. A survey on these issues is\ngiven in [1]. The question of uniqueness of equilibria has been studied in two\ndifferent frameworks. The first, which we call F1, is the non-atomic routing\nintroduced by Wardrop on 1952 in the context of road traffic in which each\nplayer (car) is infinitesimally small; a single car has a negligible impact on\nthe congestion. Each car wishes to minimize its expected delay. Under arbitrary\ntopology, such games are known to have a convex potential and thus have a\nunique equilibrium [2]. The second framework, denoted by F2, is splitable\natomic games. There are finitely many players, each controlling the route of a\npopulation of individuals. This type of games have already been studied in the\ncontext of road traffic by Haurie and Marcotte [3] but have become central in\nthe telecom community to model routing decisions of Internet Service Providers\nthat can decide how to split the traffic of their subscribers among various\nroutes so as to minimize network congestion [4]. In this paper we study\nproperties of equilibria in two other frameworks of routing games which exhibit\nsurprising\n", "versions": [{"version": "v1", "created": "Thu, 31 Dec 2015 08:21:35 GMT"}], "update_date": "2016-01-01", "authors_parsed": [["Altman", "Eitan", "", "MAESTRO"], ["Touati", "Corinne", ""]]}, {"id": "1512.09335", "submitter": "Mathieu Dahan", "authors": "Mathieu Dahan and Saurabh Amin", "title": "Network Flow Routing under Strategic Link Disruptions", "comments": "8 pages, 6 figures, Proceedings of the 53rd Annual Allerton\n  Conference on Communication, Control, and Computing, Urbana, IL, October 2015", "journal-ref": null, "doi": "10.1109/ALLERTON.2015.7447026", "report-no": null, "categories": "cs.GT cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a 2-player strategic game for network routing under link\ndisruptions. Player 1 (defender) routes flow through a network to maximize her\nvalue of effective flow while facing transportation costs. Player 2 (attacker)\nsimultaneously disrupts one or more links to maximize her value of lost flow\nbut also faces cost of disrupting links. This game is strategically equivalent\nto a zero-sum game. Linear programming duality and the max-flow min-cut theorem\nare applied to obtain properties that are satisfied in any mixed Nash\nequilibrium. In any equilibrium, both players achieve identical payoffs. While\nthe defender's expected transportation cost decreases in attacker's marginal\nvalue of lost flow, the attacker's expected cost of attack increases in\ndefender's marginal value of effective flow. Interestingly, the expected amount\nof effective flow decreases in both these parameters. These results can be\nviewed as a generalization of the classical max-flow with minimum\ntransportation cost problem to adversarial environments.\n", "versions": [{"version": "v1", "created": "Thu, 31 Dec 2015 18:36:46 GMT"}, {"version": "v2", "created": "Tue, 26 Jan 2016 16:55:39 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Dahan", "Mathieu", ""], ["Amin", "Saurabh", ""]]}]