[{"id": "1501.00027", "submitter": "Dr. Paul J. Werbos", "authors": "Paul J. Werbos", "title": "Time-Symmetric Physics: A Radical Approach to the Decoherence Problem", "comments": "5 pages, 2 figures. Invited keynote talk for Quantum Computing\n  workshop at Pacific Rim AI (PRICAI) conference, December 2014. Simple summary\n  and link to the slides and audio of the talk posted at\n  http://www.werbos.com/quantum.htm", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH quant-ph", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  The most powerful form of quantum learning system possible would somehow\nlearn the parameters W of a quantum system f(X, W), for f representing the\nlargest, most powerful set of possible input-output relations. This paper\naddresses the issue of how to enlarge the set represented by f, by using a new\nformulation of time-symmetric physics to model analog quantum computers based\non spin and by exploring possible sources of backwards-time free energy so as\nto address problems of decoherence and dissipation.\n", "versions": [{"version": "v1", "created": "Tue, 23 Dec 2014 21:30:24 GMT"}], "update_date": "2015-01-05", "authors_parsed": [["Werbos", "Paul J.", ""]]}, {"id": "1501.00491", "submitter": "Paolo D'Alberto", "authors": "Paolo D'Alberto and Veronica Milenkly", "title": "Mapping and Matching Algorithms: Data Mining by Adaptive Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Assume we have two bijective functions $U(x)$ and $M(x)$ with $M(x)\\neq U(x)$\nfor all $x$ and $M,N: \\N \\rightarrow \\N$ . Every day and in different\nlocations, we see the different results of $U$ and $M$ without seeing $x$. We\nare not assured about the time stamp nor the order within the day but at least\nthe location is fully defined. We want to find the matching between $U(x)$ and\n$M(x)$ (i.e., we will not know $x$). We formulate this problem as an adaptive\ngraph mining: we develop the theory, the solution, and the implementation. This\nwork stems from a practical problem thus our definitions. The solution is\nsimple, clear, and the implementation parallel and efficient. In our\nexperience, the problem and the solution are novel and we want to share our\nfinding.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jan 2015 18:05:04 GMT"}], "update_date": "2015-01-06", "authors_parsed": [["D'Alberto", "Paolo", ""], ["Milenkly", "Veronica", ""]]}, {"id": "1501.01109", "submitter": "Md. Abdullah- Al-Mashud Mashud", "authors": "M.A.A. Mashud, M. R. Hossain, Mustari Zaman and M.A. Razzaque", "title": "PC Guided Automatic Vehicle System", "comments": "10 pages, International Journal on Cybernetics & Informatics\n  (IJCI);2014", "journal-ref": null, "doi": "10.5121/ijci.2014.3601", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main objective of this paper is to design and develop an automatic\nvehicle, fully controlled by a computer system. The vehicle designed in the\npresent work can move in a pre-determined path and work automatically without\nthe need of any human operator and it also controlled by human operator. Such a\nvehicle is capable of performing wide variety of difficult tasks in space\nresearch, domestic, scientific and industrial fields. For this purpose, an IBM\ncompatible PC with Pentium microprocessor has been used which performed the\nfunction of the system controller. Its parallel printer port has been used as\ndata communication port to interface the vehicle. A suitable software program\nhas been developed for the system controller to send commands to the vehicle.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jan 2015 08:27:46 GMT"}], "update_date": "2015-01-07", "authors_parsed": [["Mashud", "M. A. A.", ""], ["Hossain", "M. R.", ""], ["Zaman", "Mustari", ""], ["Razzaque", "M. A.", ""]]}, {"id": "1501.01539", "submitter": "Faheem Zafari", "authors": "Faheem Zafari, Ioannis Papapanagiotou, Konstantinos Christidis", "title": "Micro-location for Internet of Things equipped Smart Buildings", "comments": "\"This work has been published in IEEE Internet of Things Journal", "journal-ref": "IEEE Internet of Things Journal Volume: 3, Issue: 1, Feb. 2016", "doi": "10.1109/JIOT.2015.2442956", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Micro-location is the process of locating any entity with high accuracy\n(possibly in centimeters), while geofencing is the process of creating a\nvirtual fence around a so-called Point of Interest (PoI). In this paper, we\npresent an insight into various micro-location enabling technologies and\nservices. We also discuss how these can accelerate the incorporation of\nInternet of Things (IoT) in smart buildings. We argue that micro-location based\nlocation-aware solutions can play a significant role in facilitating the\ntenants of an IoT equipped smart building. Also, such advanced technologies\nwill enable the smart building control system through minimal actions performed\nby the tenants. We also highlight the existing and envisioned services to be\nprovided by using micro-location enabling technologies. We describe the\nchallenges and propose some potential solutions such that micro-location\nenabling technologies and services are thoroughly integrated with IoT equipped\nsmart building.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jan 2015 16:13:48 GMT"}, {"version": "v2", "created": "Thu, 25 May 2017 11:45:05 GMT"}], "update_date": "2017-05-26", "authors_parsed": [["Zafari", "Faheem", ""], ["Papapanagiotou", "Ioannis", ""], ["Christidis", "Konstantinos", ""]]}, {"id": "1501.01930", "submitter": "Seyedmeysam Khaleghian", "authors": "Anahita Emami, Seyedmeysam Khaleghian and Mohammad Mahjoob Jahromi", "title": "Design, Analysis, and Simulation of a Pipe-Welding Robot with Fixed\n  Plinth", "comments": "6 pages, 11 figures, 3rd International Conference on Manufacturing\n  Engineering, ICME2011, Tehran, Iran", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Industrial requirements concerning the increased efficiency and high rate of\nmanufacturing result in the development of manufacturer robots, and a vast\ngroup of these types of robots is used for welding. This study presented the\ndesign, analysis, and simulation of a pipe-welding robot with fixed plinth for\na constant circular welding around the pipes. Design of a welding robot capable\nof keeping the electrode orientation, welding speed, and distance between\nelectrode and pipe surface constant can improve the quality of welding; thus, a\nfive-linked articulated robot was designed for this purpose. Solving of direct\nand diverse kinematics and dynamics equations of the robot was done by means of\nMatlab software. The robot was also simulated using a program written in Matlab\nand the diagrams of angles, velocities, and accelerations of all the arms, and\nthe applied force and torque of each arm required for drive the mechanism were\nobtained.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jan 2015 05:14:45 GMT"}], "update_date": "2015-01-09", "authors_parsed": [["Emami", "Anahita", ""], ["Khaleghian", "Seyedmeysam", ""], ["Jahromi", "Mohammad Mahjoob", ""]]}, {"id": "1501.02185", "submitter": "Paolo D'Alberto", "authors": "Paolo D'Alberto", "title": "Multiple-Campaign Ad-Targeting Deployment: Parallel Response Modeling,\n  Calibration and Scoring Without Personal User Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.OH", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We present a vertical introduction to campaign optimization; that is, the\nability to predict the user response to an ad campaign without any users'\nprofiles on average and for each exposed ad. In practice, we present an\napproach to build a polytomous model, multi response, composed by several\nhundred binary models using generalized linear models. The theory has been\nintroduced twenty years ago and it has been applied in different fields since\nthen. Here, we show how we optimize hundreds campaigns and how this large\nnumber of campaigns may overcome a few characteristic caveats of single\ncampaign optimization. We discuss the problem and solution of training and\ncalibration at scale. We present statistical performance as {\\em coverage},\n{\\em precision} and {\\em recall} used in classification. We present also a\ndiscussion about the potential performance as throughput: how many decisions\ncan be done per second streaming the bid auctions also by using dedicated\nhardware.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jan 2015 18:02:52 GMT"}, {"version": "v2", "created": "Mon, 11 May 2015 00:30:00 GMT"}], "update_date": "2015-05-12", "authors_parsed": [["D'Alberto", "Paolo", ""]]}, {"id": "1501.02245", "submitter": "Meysam Khaleghian", "authors": "Seyedmeysam Khaleghian, Anahita Emami and Nasser Soltani", "title": "Image Processing Code for Sharpening Photoelastic Fringe Patterns and\n  Its Usage in Determination of Stress Intensity Factors in a Sample Contact\n  Problem", "comments": "4 pages, 5 figures, ICME 2011, Tehran, Iran", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.mtrl-sci cs.OH physics.optics", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study presented a type of image processing code which is used for\nsharpening photoelastic fringe patterns of transparent materials in\nphotoelastic experiences to determine the stress distribution. C-Sharp software\nwas utilized for coding the algorithm of this image processing method. For\nevaluation of this code, the results of a photoelastic experience of a sample\ncontact problem between a half-plane with an oblique edge crack and a tilted\nwedge using this image processing method was compared with the FEM results of\nthe same problem in order to obtain the stress intensity factors (SIF) of the\nspecimen. A good agreement between experimental results extracted from this\nmethod of image processing and computational results was observed.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jan 2015 06:13:59 GMT"}], "update_date": "2015-01-12", "authors_parsed": [["Khaleghian", "Seyedmeysam", ""], ["Emami", "Anahita", ""], ["Soltani", "Nasser", ""]]}, {"id": "1501.02954", "submitter": "Dominik Egarter", "authors": "Dominik Egarter and Manfred P\\\"ochacker and Wilfried Elmenreich", "title": "Complexity of Power Draws for Load Disaggregation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-Intrusive Load Monitoring (NILM) is a technology offering methods to\nidentify appliances in homes based on their consumption characteristics and the\ntotal household demand. Recently, many different novel NILM approaches were\nintroduced, tested on real-world data and evaluated with a common evaluation\nmetric. However, the fair comparison between different NILM approaches even\nwith the usage of the same evaluation metric is nearly impossible due to\nincomplete or missing problem definitions. Each NILM approach typically is\nevaluated under different test scenarios. Test results are thus influenced by\nthe considered appliances, the number of used appliances, the device type\nrepresenting the appliance and the pre-processing stages denoising the\nconsumption data. This paper introduces a novel complexity measure of\naggregated consumption data providing an assessment of the problem complexity\naffected by the used appliances, the appliance characteristics and the\nappliance usage over time. We test our load disaggregation complexity on\ndifferent real-world datasets and with a state-of-the-art NILM approach. The\nintroduced disaggregation complexity measure is able to classify the\ndisaggregation problem based on the used appliance set and the considered\nmeasurement noise.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jan 2015 11:09:51 GMT"}], "update_date": "2015-01-14", "authors_parsed": [["Egarter", "Dominik", ""], ["Pöchacker", "Manfred", ""], ["Elmenreich", "Wilfried", ""]]}, {"id": "1501.05581", "submitter": "Daniele Riboni", "authors": "Daniele Riboni, Claudio Bettini, Gabriele Civitarese, Zaffar Haider\n  Janjua, Rim Helaoui", "title": "Extended Report: Fine-grained Recognition of Abnormal Behaviors for\n  Early Detection of Mild Cognitive Impairment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  According to the World Health Organization, the rate of people aged 60 or\nmore is growing faster than any other age group in almost every country, and\nthis trend is not going to change in a near future. Since senior citizens are\nat high risk of non communicable diseases requiring long-term care, this trend\nwill challenge the sustainability of the entire health system. Pervasive\ncomputing can provide innovative methods and tools for early detecting the\nonset of health issues. In this paper we propose a novel method to detect\nabnormal behaviors of elderly people living at home. The method relies on\nmedical models, provided by cognitive neuroscience researchers, describing\nabnormal activity routines that may indicate the onset of early symptoms of\nmild cognitive impairment. A non-intrusive sensor-based infrastructure acquires\nlow-level data about the interaction of the individual with home appliances and\nfurniture, as well as data from environmental sensors. Based on those data, a\nnovel hybrid statistical-symbolical technique is used to detect the abnormal\nbehaviors of the patient, which are communicated to the medical center.\nDifferently from related works, our method can detect abnormal behaviors at a\nfine-grained level, thus providing an important tool to support the medical\ndiagnosis. In order to evaluate our method we have developed a prototype of the\nsystem and acquired a large dataset of abnormal behaviors carried out in an\ninstrumented smart home. Experimental results show that our technique is able\nto detect most anomalies while generating a small number of false positives.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jan 2015 17:34:16 GMT"}], "update_date": "2015-01-23", "authors_parsed": [["Riboni", "Daniele", ""], ["Bettini", "Claudio", ""], ["Civitarese", "Gabriele", ""], ["Janjua", "Zaffar Haider", ""], ["Helaoui", "Rim", ""]]}, {"id": "1501.06473", "submitter": "Prasant Misra", "authors": "Prasant Misra, Wen Hu, Mingrui Yang, Marco Duarte, Sanjay Jha", "title": "Sparsity based Efficient Cross-Correlation Techniques in Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cross-correlation is a popular signal processing technique used in numerous\nlocation tracking systems for obtaining reliable range information. However,\nits efficient design and practical implementation has not yet been achieved on\nmote platforms that are typical in wireless sensor network due to resource\nconstrains. In this paper, we propose SparseS-XCorr: cross-correlation via\nstructured sparse representation, a new computing framework for ranging based\non L1-minimization and structured sparsity. The key idea is to compress the\nranging signal samples on the mote by efficient random projections and transfer\nthem to a central device; where a convex optimization process estimates the\nrange by exploiting the sparse signal structure in the proposed correlation\ndictionary. Through theoretical validation, extensive empirical studies and\nexperiments on an end-to-end acoustic ranging system implemented on resource\nlimited off-the-shelf sensor nodes, we show that the proposed framework can\nachieve up to two orders of magnitude better performance compared to other\napproaches such as working on DCT domain and downsampling. Compared to the\nstandard cross-correlation, it is able to obtain range estimates with a bias of\n2-6cm with 30% and approximately 100cm with 5% compressed measurements. Its\nstructured sparsity model is able to improve the ranging accuracy by 40% under\nchallenging recovery conditions (such as high compression factor and low\nsignal-to-noise ratio) by overcoming limitations due to dictionary coherence.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jan 2015 16:38:34 GMT"}, {"version": "v2", "created": "Fri, 8 Apr 2016 10:08:11 GMT"}, {"version": "v3", "created": "Sat, 11 Jun 2016 05:21:06 GMT"}], "update_date": "2016-06-14", "authors_parsed": [["Misra", "Prasant", ""], ["Hu", "Wen", ""], ["Yang", "Mingrui", ""], ["Duarte", "Marco", ""], ["Jha", "Sanjay", ""]]}, {"id": "1501.06802", "submitter": "Gamal Abd El-Nasser A. Said", "authors": "Gamal Abd El-Nasser A. Said, El-Sayed M. El-Horbaty", "title": "A Simulation Modeling Approach for Optimization of Storage Space\n  Allocation in Container Terminal", "comments": "International Journal of Computer, Information, Systems and Control\n  Engineering Vol:9 No:1, 2015", "journal-ref": "Information, Systems and Control Engineering Vol. 9, No. 1, 2015,\n  pp. 168-173", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Container handling problems at container terminals are NP-hard problems. This\npaper presents an approach using discrete-event simulation modeling to optimize\nsolution for storage space allocation problem, taking into account all various\ninterrelated container terminal handling activities. The proposed approach is\napplied on a real case study data of container terminal at Alexandria port. The\ncomputational results show the effectiveness of the proposed model for\noptimization of storage space allocation in container terminal where 54%\nreduction in containers handling time in port is achieved.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jan 2015 16:10:23 GMT"}], "update_date": "2015-04-14", "authors_parsed": [["Said", "Gamal Abd El-Nasser A.", ""], ["El-Horbaty", "El-Sayed M.", ""]]}, {"id": "1501.07438", "submitter": "Julien Mineraud", "authors": "Julien Mineraud, Oleksiy Mazhelis, Xiang Su and Sasu Tarkoma", "title": "Contemporary Internet of Things platforms", "comments": "6 pages, 0 figure, techreport, review of IoT platforms", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This document regroups a representative, but non-exhaustive, list of\ncontemporary IoT platforms. The platforms are ordered alphabetically. The aim\nof this document is to provide the a quick review of current IoT platforms, as\nwell as relevant information.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jan 2015 12:51:41 GMT"}], "update_date": "2015-01-30", "authors_parsed": [["Mineraud", "Julien", ""], ["Mazhelis", "Oleksiy", ""], ["Su", "Xiang", ""], ["Tarkoma", "Sasu", ""]]}]