[{"id": "0807.2043", "submitter": "Aikaterini Mitrokotsa", "authors": "Aikaterini Mitrokotsa and Christos Dimitrakakis and Christos\n  Douligeris", "title": "Intrusion Detection Using Cost-Sensitive Classification", "comments": "13 pages, 6 figures, presented at EC2ND 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CV cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intrusion Detection is an invaluable part of computer networks defense. An\nimportant consideration is the fact that raising false alarms carries a\nsignificantly lower cost than not detecting at- tacks. For this reason, we\nexamine how cost-sensitive classification methods can be used in Intrusion\nDetection systems. The performance of the approach is evaluated under different\nexperimental conditions, cost matrices and different classification models, in\nterms of expected cost, as well as detection and false alarm rates. We find\nthat even under unfavourable conditions, cost-sensitive classification can\nimprove performance significantly, if only slightly.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jul 2008 16:54:13 GMT"}], "update_date": "2008-07-15", "authors_parsed": [["Mitrokotsa", "Aikaterini", ""], ["Dimitrakakis", "Christos", ""], ["Douligeris", "Christos", ""]]}, {"id": "0807.2047", "submitter": "Mahzad Kalantari", "authors": "Mahzad Kalantari, Franck Jung, JeanPierre Guedon, Nicolas Paparoditis", "title": "The Five Points Pose Problem : A New and Accurate Solution Adapted to\n  any Geometric Configuration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of this paper is to estimate directly the rotation and translation\nbetween two stereoscopic images with the help of five homologous points. The\nmethodology presented does not mix the rotation and translation parameters,\nwhich is comparably an important advantage over the methods using the\nwell-known essential matrix. This results in correct behavior and accuracy for\nsituations otherwise known as quite unfavorable, such as planar scenes, or\npanoramic sets of images (with a null base length), while providing quite\ncomparable results for more \"standard\" cases. The resolution of the algebraic\npolynomials resulting from the modeling of the coplanarity constraint is made\nwith the help of powerful algebraic solver tools (the Groebner bases and the\nRational Univariate Representation).\n", "versions": [{"version": "v1", "created": "Sun, 13 Jul 2008 18:37:06 GMT"}, {"version": "v2", "created": "Mon, 14 Jul 2008 20:17:12 GMT"}, {"version": "v3", "created": "Wed, 16 Jul 2008 15:20:03 GMT"}], "update_date": "2008-07-16", "authors_parsed": [["Kalantari", "Mahzad", ""], ["Jung", "Franck", ""], ["Guedon", "JeanPierre", ""], ["Paparoditis", "Nicolas", ""]]}, {"id": "0807.2928", "submitter": "Guoshen Yu", "authors": "Guoshen Yu and Jean-Jacques Slotine", "title": "Visual Grouping by Neural Oscillators", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed synchronization is known to occur at several scales in the brain,\nand has been suggested as playing a key functional role in perceptual grouping.\nState-of-the-art visual grouping algorithms, however, seem to give\ncomparatively little attention to neural synchronization analogies. Based on\nthe framework of concurrent synchronization of dynamic systems, simple networks\nof neural oscillators coupled with diffusive connections are proposed to solve\nvisual grouping problems. Multi-layer algorithms and feedback mechanisms are\nalso studied. The same algorithm is shown to achieve promising results on\nseveral classical visual grouping problems, including point clustering, contour\nintegration and image segmentation.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jul 2008 11:23:27 GMT"}], "update_date": "2008-07-21", "authors_parsed": [["Yu", "Guoshen", ""], ["Slotine", "Jean-Jacques", ""]]}, {"id": "0807.4478", "submitter": "Carlos Miravet", "authors": "Carlos Miravet, Luis Pascual, Eloise Krouch, Juan Manuel del Cura", "title": "An Image-Based Sensor System for Autonomous Rendez-Vous with\n  Uncooperative Satellites", "comments": "12 pages, 13 figures. Presented in the 7th International ESA\n  Conference on Guidance, Navigation & Control Systems, Tralee, Ireland, 2008", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper are described the image processing algorithms developed by\nSENER, Ingenieria y Sistemas to cope with the problem of image-based,\nautonomous rendez-vous (RV) with an orbiting satellite. The methods developed\nhave a direct application in the OLEV (Orbital Life Extension Extension\nVehicle) mission. OLEV is a commercial mission under development by a\nconsortium formed by Swedish Space Corporation, Kayser-Threde and SENER, aimed\nto extend the operational life of geostationary telecommunication satellites by\nsupplying them control, navigation and guidance services. OLEV is planned to\nuse a set of cameras to determine the angular position and distance to the\nclient satellite during the complete phases of rendez-vous and docking, thus\nenabling the operation with satellites not equipped with any specific\nnavigational aid to provide support during the approach. The ability to operate\nwith un-equipped client satellites significantly expands the range of\napplicability of the system under development, compared to other competing\nvideo technologies already tested in previous spatial missions, such as the\nones described here below.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jul 2008 15:46:02 GMT"}], "update_date": "2008-07-29", "authors_parsed": [["Miravet", "Carlos", ""], ["Pascual", "Luis", ""], ["Krouch", "Eloise", ""], ["del Cura", "Juan Manuel", ""]]}, {"id": "0807.4701", "submitter": "Amelia Sparavigna", "authors": "A. Sparavigna, R. Marazzato", "title": "An image processing analysis of skin textures", "comments": null, "journal-ref": "Skin Research and Technology, Volume 16 Issue 2, Pages 161 - 167,\n  2010", "doi": "10.1111/j.1600-0846.2009.00413.x", "report-no": null, "categories": "cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Colour and coarseness of skin are visually different. When image processing\nis involved in the skin analysis, it is important to quantitatively evaluate\nsuch differences using texture features. In this paper, we discuss a texture\nanalysis and measurements based on a statistical approach to the pattern\nrecognition. Grain size and anisotropy are evaluated with proper diagrams. The\npossibility to determine the presence of pattern defects is also discussed.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jul 2008 16:28:44 GMT"}], "update_date": "2010-05-11", "authors_parsed": [["Sparavigna", "A.", ""], ["Marazzato", "R.", ""]]}]