[{"id": "1204.1458", "submitter": "Steffen Bartsch", "authors": "Steffen Bartsch and Karsten Sohr and Michaela Bunke and Oliver\n  Hofrichter and Bernhard Berger", "title": "The Transitivity of Trust Problem in the Interaction of Android\n  Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": "TZI-2012-64", "categories": "cs.CR cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile phones have developed into complex platforms with large numbers of\ninstalled applications and a wide range of sensitive data. Application security\npolicies limit the permissions of each installed application. As applications\nmay interact, restricting single applications may create a false sense of\nsecurity for the end users while data may still leave the mobile phone through\nother applications. Instead, the information flow needs to be policed for the\ncomposite system of applications in a transparent and usable manner. In this\npaper, we propose to employ static analysis based on the software architecture\nand focused data flow analysis to scalably detect information flows between\ncomponents. Specifically, we aim to reveal transitivity of trust problems in\nmulti-component mobile platforms. We demonstrate the feasibility of our\napproach with Android applications, although the generalization of the analysis\nto similar composition-based architectures, such as Service-oriented\nArchitecture, can also be explored in the future.\n", "versions": [{"version": "v1", "created": "Fri, 6 Apr 2012 11:48:20 GMT"}], "update_date": "2012-05-01", "authors_parsed": [["Bartsch", "Steffen", ""], ["Sohr", "Karsten", ""], ["Bunke", "Michaela", ""], ["Hofrichter", "Oliver", ""], ["Berger", "Bernhard", ""]]}, {"id": "1204.1868", "submitter": "Konstantinos Chorianopoulos", "authors": "Konstantinos Chorianopoulos", "title": "User-based key frame detection in social web video", "comments": "4 pages, 4 figures", "journal-ref": null, "doi": "10.1145/2382636.2382642", "report-no": null, "categories": "cs.MM cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Video search results and suggested videos on web sites are represented with a\nvideo thumbnail, which is manually selected by the video up-loader among three\nrandomly generated ones (e.g., YouTube). In contrast, we present a grounded\nuser-based approach for automatically detecting interesting key-frames within a\nvideo through aggregated users' replay interactions with the video player.\nPrevious research has focused on content-based systems that have the benefit of\nanalyzing a video without user interactions, but they are monolithic, because\nthe resulting video thumbnails are the same regardless of the user preferences.\nWe constructed a user interest function, which is based on aggregate video\nreplays, and analyzed hundreds of user interactions. We found that the local\nmaximum of the replaying activity stands for the semantics of information rich\nvideos, such as lecture, and how-to. The concept of user-based key-frame\ndetection could be applied to any video on the web, in order to generate a\nuser-based and dynamic video thumbnail in search results.\n", "versions": [{"version": "v1", "created": "Mon, 9 Apr 2012 12:23:36 GMT"}], "update_date": "2018-04-17", "authors_parsed": [["Chorianopoulos", "Konstantinos", ""]]}, {"id": "1204.2138", "submitter": "Mohammadi Akheela Khanum Mrs", "authors": "Munesh Chandra Trivedi and Mohammadi Akheela Khanum", "title": "Role of context in usability evaluations: A review", "comments": "10 pages, 2 tables, ACIJ- Vol3.No.2 March 2012", "journal-ref": null, "doi": "10.5121/acij.2012.3208", "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Usability is often defined as the ability of a system to carry out specific\ntasks by specific users in a specific context. Usability evaluation involves\ntesting the system for its expected usability. Usability testing is performed\nin natural environment (field) or artificial environment (laboratory). The\nresult of usability evaluation is affected by the environment in which it is\ncarried out. Previous studies have focused only on the physical environment\n(lab and field) effect on the results but rarely focused on the effect of\nsocial environment (people present during testing). Therefore, this study aims\nto review how important it is to take context into account during usability\nevaluation. Context is explored through the theory of behaviour settings,\naccording to which behaviour of individuals is strongly influenced by the\nphysical as well as the social environment in which they function. The result\nof this review indicates that the physical and social context plays a\nsubstantial role in usability evaluations. Further, it also suggests that the\nusability evaluation model should encompass context as an important component\nin the framework.\n", "versions": [{"version": "v1", "created": "Tue, 10 Apr 2012 13:18:51 GMT"}], "update_date": "2012-04-11", "authors_parsed": [["Trivedi", "Munesh Chandra", ""], ["Khanum", "Mohammadi Akheela", ""]]}, {"id": "1204.2712", "submitter": "David Vallet David Vallet", "authors": "Sumio Fujita, Georges Dupret and Ricardo Baeza-Yates", "title": "Learning to Rank Query Recommendations by Semantic Similarities", "comments": "2nd International Workshop on Usage Analysis and the Web of Data\n  (USEWOD2012) in the 21st International World Wide Web Conference (WWW2012),\n  Lyon, France, April 17th, 2012", "journal-ref": null, "doi": null, "report-no": "WWW2012USEWOD/2012/fuduba", "categories": "cs.AI cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Logs of the interactions with a search engine show that users often\nreformulate their queries. Examining these reformulations shows that\nrecommendations that precise the focus of a query are helpful, like those based\non expansions of the original queries. But it also shows that queries that\nexpress some topical shift with respect to the original query can help user\naccess more rapidly the information they need. We propose a method to identify\nfrom the query logs of past users queries that either focus or shift the\ninitial query topic. This method combines various click-based, topic-based and\nsession based ranking strategies and uses supervised learning in order to\nmaximize the semantic similarities between the query and the recommendations,\nwhile at the same diversifying them. We evaluate our method using the\nquery/click logs of a Japanese web search engine and we show that the\ncombination of the three methods proposed is significantly better than any of\nthem taken individually.\n", "versions": [{"version": "v1", "created": "Thu, 12 Apr 2012 13:15:43 GMT"}], "update_date": "2012-04-13", "authors_parsed": [["Fujita", "Sumio", ""], ["Dupret", "Georges", ""], ["Baeza-Yates", "Ricardo", ""]]}, {"id": "1204.2713", "submitter": "Julia Hoxha", "authors": "Julia Hoxha, Martin Junghans and Sudhir Agarwal", "title": "Enabling Semantic Analysis of User Browsing Patterns in the Web of Data", "comments": "2nd International Workshop on Usage Analysis and the Web of Data\n  (USEWOD2012) in the 21st International World Wide Web Conference (WWW2012),\n  Lyon, France, April 17th, 2012", "journal-ref": null, "doi": null, "report-no": "WWW2012USEWOD/2012/hojuag", "categories": "cs.AI cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A useful step towards better interpretation and analysis of the usage\npatterns is to formalize the semantics of the resources that users are\naccessing in the Web. We focus on this problem and present an approach for the\nsemantic formalization of usage logs, which lays the basis for eective\ntechniques of querying expressive usage patterns. We also present a query\nanswering approach, which is useful to nd in the logs expressive patterns of\nusage behavior via formulation of semantic and temporal-based constraints. We\nhave processed over 30 thousand user browsing sessions extracted from usage\nlogs of DBPedia and Semantic Web Dog Food. All these events are formalized\nsemantically using respective domain ontologies and RDF representations of the\nWeb resources being accessed. We show the eectiveness of our approach through\nexperimental results, providing in this way an exploratory analysis of the way\nusers browse theWeb of Data.\n", "versions": [{"version": "v1", "created": "Thu, 12 Apr 2012 13:17:01 GMT"}, {"version": "v2", "created": "Mon, 16 Apr 2012 16:54:08 GMT"}, {"version": "v3", "created": "Tue, 17 Apr 2012 06:46:51 GMT"}], "update_date": "2012-04-18", "authors_parsed": [["Hoxha", "Julia", ""], ["Junghans", "Martin", ""], ["Agarwal", "Sudhir", ""]]}, {"id": "1204.2715", "submitter": "David Vallet David Vallet", "authors": "Magnus Knuth, Johannes Hercher and Harald Sack", "title": "Collaboratively Patching Linked Data", "comments": "2nd International Workshop on Usage Analysis and the Web of Data\n  (USEWOD2012) in the 21st International World Wide Web Conference (WWW2012),\n  Lyon, France, April 17th, 2012", "journal-ref": null, "doi": null, "report-no": "WWW2012USEWOD/2012/knhesa", "categories": "cs.IR cs.DL cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today's Web of Data is noisy. Linked Data often needs extensive preprocessing\nto enable efficient use of heterogeneous resources. While consistent and valid\ndata provides the key to efficient data processing and aggregation we are\nfacing two main challenges: (1st) Identification of erroneous facts and\ntracking their origins in dynamically connected datasets is a difficult task,\nand (2nd) efforts in the curation of deficient facts in Linked Data are\nexchanged rather rarely. Since erroneous data often is duplicated and\n(re-)distributed by mashup applications it is not only the responsibility of a\nfew original publishers to keep their data tidy, but progresses to be a mission\nfor all distributers and consumers of Linked Data too. We present a new\napproach to expose and to reuse patches on erroneous data to enhance and to add\nquality information to the Web of Data. The feasibility of our approach is\ndemonstrated by example of a collaborative game that patches statements in\nDBpedia data and provides notifications for relevant changes.\n", "versions": [{"version": "v1", "created": "Thu, 12 Apr 2012 13:27:08 GMT"}], "update_date": "2012-04-13", "authors_parsed": [["Knuth", "Magnus", ""], ["Hercher", "Johannes", ""], ["Sack", "Harald", ""]]}, {"id": "1204.2718", "submitter": "David Vallet David Vallet", "authors": "Andreas Thalhammer, Ioan Toma, Antonio Roa-Valverde and Dieter Fensel", "title": "Leveraging Usage Data for Linked Data Movie Entity Summarization", "comments": "2nd International Workshop on Usage Analysis and the Web of Data\n  (USEWOD2012) in the 21st International World Wide Web Conference (WWW2012),\n  Lyon, France, April 17th, 2012", "journal-ref": null, "doi": null, "report-no": "WWW2012USEWOD/2012/thtorofe", "categories": "cs.AI cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Novel research in the field of Linked Data focuses on the problem of entity\nsummarization. This field addresses the problem of ranking features according\nto their importance for the task of identifying a particular entity. Next to a\nmore human friendly presentation, these summarizations can play a central role\nfor semantic search engines and semantic recommender systems. In current\napproaches, it has been tried to apply entity summarization based on patterns\nthat are inherent to the regarded data.\n  The proposed approach of this paper focuses on the movie domain. It utilizes\nusage data in order to support measuring the similarity between movie entities.\nUsing this similarity it is possible to determine the k-nearest neighbors of an\nentity. This leads to the idea that features that entities share with their\nnearest neighbors can be considered as significant or important for these\nentities. Additionally, we introduce a downgrading factor (similar to TF-IDF)\nin order to overcome the high number of commonly occurring features. We\nexemplify the approach based on a movie-ratings dataset that has been linked to\nFreebase entities.\n", "versions": [{"version": "v1", "created": "Thu, 12 Apr 2012 13:31:52 GMT"}], "update_date": "2012-04-13", "authors_parsed": [["Thalhammer", "Andreas", ""], ["Toma", "Ioan", ""], ["Roa-Valverde", "Antonio", ""], ["Fensel", "Dieter", ""]]}, {"id": "1204.2995", "submitter": "Michael Bernstein", "authors": "Michael S. Bernstein, David R. Karger, Robert C. Miller, Joel Brandt", "title": "Analytic Methods for Optimizing Realtime Crowdsourcing", "comments": "Presented at Collective Intelligence conference, 2012", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/12", "categories": "cs.SI cs.HC physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Realtime crowdsourcing research has demonstrated that it is possible to\nrecruit paid crowds within seconds by managing a small, fast-reacting worker\npool. Realtime crowds enable crowd-powered systems that respond at interactive\nspeeds: for example, cameras, robots and instant opinion polls. So far, these\ntechniques have mainly been proof-of-concept prototypes: research has not yet\nattempted to understand how they might work at large scale or optimize their\ncost/performance trade-offs. In this paper, we use queueing theory to analyze\nthe retainer model for realtime crowdsourcing, in particular its expected wait\ntime and cost to requesters. We provide an algorithm that allows requesters to\nminimize their cost subject to performance requirements. We then propose and\nanalyze three techniques to improve performance: push notifications, shared\nretainer pools, and precruitment, which involves recalling retainer workers\nbefore a task actually arrives. An experimental validation finds that\nprecruited workers begin a task 500 milliseconds after it is posted, delivering\nresults below the one-second cognitive threshold for an end-user to stay in\nflow.\n", "versions": [{"version": "v1", "created": "Fri, 13 Apr 2012 13:49:18 GMT"}], "update_date": "2012-04-16", "authors_parsed": [["Bernstein", "Michael S.", ""], ["Karger", "David R.", ""], ["Miller", "Robert C.", ""], ["Brandt", "Joel", ""]]}, {"id": "1204.3353", "submitter": "Terrell Russell", "authors": "Terrell G. Russell", "title": "Collective Cognitive Authority: Expertise Location via Social Labeling", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991), 8 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/46", "categories": "cs.SI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of knowing who knows what is multi-faceted. Knowledge and\nexpertise lie on a spectrum and one's expertise in one topic area may have\nlittle bearing on one's knowledge in a disparate topic area. In addition, we\ncontinue to learn new things over time. Each of us see but a sliver of our\nacquaintances' and co-workers' areas of expertise. By making explicit and\nvisible many individual perceptions of cognitive authority, this work shows\nthat a group can know what its members know about in a relatively efficient and\ninexpensive manner.\n", "versions": [{"version": "v1", "created": "Mon, 16 Apr 2012 03:24:33 GMT"}], "update_date": "2012-04-17", "authors_parsed": [["Russell", "Terrell G.", ""]]}, {"id": "1204.3367", "submitter": "Dmitry Rudoy", "authors": "Dmitry Rudoy, Dan B. Goldman, Eli Shechtman, Lihi Zelnik-Manor", "title": "Crowdsourcing Gaze Data Collection", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991)", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/106", "categories": "cs.SI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Knowing where people look is a useful tool in many various image and video\napplications. However, traditional gaze tracking hardware is expensive and\nrequires local study participants, so acquiring gaze location data from a large\nnumber of participants is very problematic. In this work we propose a\ncrowdsourced method for acquisition of gaze direction data from a virtually\nunlimited number of participants, using a robust self-reporting mechanism (see\nFigure 1). Our system collects temporally sparse but spatially dense\npoints-of-attention in any visual information. We apply our approach to an\nexisting video data set and demonstrate that we obtain results similar to\ntraditional gaze tracking. We also explore the parameter ranges of our method,\nand collect gaze tracking data for a large set of YouTube videos.\n", "versions": [{"version": "v1", "created": "Mon, 16 Apr 2012 05:54:36 GMT"}], "update_date": "2012-04-17", "authors_parsed": [["Rudoy", "Dmitry", ""], ["Goldman", "Dan B.", ""], ["Shechtman", "Eli", ""], ["Zelnik-Manor", "Lihi", ""]]}, {"id": "1204.3481", "submitter": "Robert Morris R", "authors": "Robert R. Morris and Rosalind Picard", "title": "Crowdsourcing Collective Emotional Intelligence", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991)", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/81", "categories": "cs.SI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the hallmarks of emotional intelligence is the ability to regulate\nemotions. Research suggests that cognitive reappraisal - a technique that\ninvolves reinterpreting the meaning of a thought or situation - can\ndown-regulate negative emotions, without incurring significant psychological or\nphysiological costs. Habitual use of this strategy is also linked to many key\nindices of physical and emotional health. Unfortunately, this technique is not\nalways easy to apply. Thinking flexibly about stressful thoughts and situations\nrequires creativity and poise, faculties that often elude us when we need them\nthe most. In this paper, we propose an assistive technology that coordinates\ncollective intelligence on demand, to help individuals reappraise stressful\nthoughts and situations. In two experiments, we assess key features of our\ndesign and we demonstrate the feasibility of crowdsourcing empathetic\nreappraisals with on demand workforces, such as Amazon's Mechanical Turk.\n", "versions": [{"version": "v1", "created": "Mon, 16 Apr 2012 13:40:43 GMT"}], "update_date": "2012-04-17", "authors_parsed": [["Morris", "Robert R.", ""], ["Picard", "Rosalind", ""]]}, {"id": "1204.3491", "submitter": "Lu Xiao", "authors": "Lu Xiao", "title": "Rationale awareness for quality assurance in iterative human computation\n  processes", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991)", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/84", "categories": "cs.HC cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Human computation refers to the outsourcing of computation tasks to human\nworkers. It offers a new direction for solving a variety of problems and calls\nfor innovative ways of managing human computation processes. The majority of\nhuman computation tasks take a parallel approach, whereas the potential of an\niterative approach, i.e., having workers iteratively build on each other's\nwork, has not been sufficiently explored. This study investigates whether and\nhow human workers' awareness of previous workers' rationales affects the\nperformance of the iterative approach in a brainstorming task and a rating\ntask. Rather than viewing this work as a conclusive piece, the author believes\nthat this research endeavor is just the beginning of a new research focus that\nexamines and supports meta-cognitive processes in crowdsourcing activities.\n", "versions": [{"version": "v1", "created": "Mon, 16 Apr 2012 14:06:28 GMT"}], "update_date": "2012-04-17", "authors_parsed": [["Xiao", "Lu", ""]]}, {"id": "1204.3596", "submitter": "Ian Spiro", "authors": "Ian Spiro, Thomas Huston, Christoph Bregler", "title": "Markerless Motion Capture in the Crowd", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991)", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/51", "categories": "cs.SI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work uses crowdsourcing to obtain motion capture data from video\nrecordings. The data is obtained by information workers who click repeatedly to\nindicate body configurations in the frames of a video, resulting in a model of\n2D structure over time. We discuss techniques to optimize the tracking task and\nstrategies for maximizing accuracy and efficiency. We show visualizations of a\nvariety of motions captured with our pipeline then apply reconstruction\ntechniques to derive 3D structure.\n", "versions": [{"version": "v1", "created": "Mon, 16 Apr 2012 18:50:44 GMT"}], "update_date": "2012-04-17", "authors_parsed": [["Spiro", "Ian", ""], ["Huston", "Thomas", ""], ["Bregler", "Christoph", ""]]}, {"id": "1204.3678", "submitter": "Walter Lasecki", "authors": "Walter S. Lasecki, Samuel C. White, Kyle I. Murray, and Jeffrey P.\n  Bigham", "title": "Crowd Memory: Learning in the Collective", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991)", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/27", "categories": "cs.SI cs.HC physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Crowd algorithms often assume workers are inexperienced and thus fail to\nadapt as workers in the crowd learn a task. These assumptions fundamentally\nlimit the types of tasks that systems based on such algorithms can handle. This\npaper explores how the crowd learns and remembers over time in the context of\nhuman computation, and how more realistic assumptions of worker experience may\nbe used when designing new systems. We first demonstrate that the crowd can\nrecall information over time and discuss possible implications of crowd memory\nin the design of crowd algorithms. We then explore crowd learning during a\ncontinuous control task. Recent systems are able to disguise dynamic groups of\nworkers as crowd agents to support continuous tasks, but have not yet\nconsidered how such agents are able to learn over time. We show, using a\nreal-time gaming setting, that crowd agents can learn over time, and `remember'\nby passing strategies from one generation of workers to the next, despite high\nturnover rates in the workers comprising them. We conclude with a discussion of\nfuture research directions for crowd memory and learning.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 01:10:24 GMT"}, {"version": "v2", "created": "Thu, 19 Apr 2012 00:54:02 GMT"}], "update_date": "2012-04-20", "authors_parsed": [["Lasecki", "Walter S.", ""], ["White", "Samuel C.", ""], ["Murray", "Kyle I.", ""], ["Bigham", "Jeffrey P.", ""]]}, {"id": "1204.3698", "submitter": "Bruno Lepri", "authors": "Wen Dong, Bruno Lepri, Alex Pentland", "title": "Automatic Prediction Of Small Group Performance In Information Sharing\n  Tasks", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991)", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/96", "categories": "cs.SI cs.HC physics.soc-ph", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper, we describe a novel approach, based on Markov jump processes,\nto model small group conversational dynamics and to predict small group\nperformance. More precisely, we estimate conversational events such as turn\ntaking, backchannels, turn-transitions at the micro-level (1 minute windows)\nand then we bridge the micro-level behavior and the macro-level performance. We\ntested our approach with a cooperative task, the Information Sharing task, and\nwe verified the relevance of micro- level interaction dynamics in determining a\ngood group performance (e.g. higher speaking turns rate and more balanced\nparticipation among group members).\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 04:21:45 GMT"}], "update_date": "2012-04-18", "authors_parsed": [["Dong", "Wen", ""], ["Lepri", "Bruno", ""], ["Pentland", "Alex", ""]]}, {"id": "1204.3724", "submitter": "Sharoda Paul", "authors": "Sharoda A. Paul, Lichan Hong, Ed H. Chi", "title": "Who is Authoritative? Understanding Reputation Mechanisms in Quora", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991)", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/36", "categories": "cs.SI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As social Q&A sites gain popularity, it is important to understand how users\njudge the authoritativeness of users and content, build reputation, and\nidentify and promote high quality content. We conducted a study of emerging\nsocial Q&A site Quora. First, we describe user activity on Quora by analyzing\ndata across 60 question topics and 3917 users. Then we provide a rich\nunderstanding of issues of authority, reputation, and quality from in-depth\ninterviews with ten Quora users. Our results show that primary sources of\ninformation on Quora are judged authoritative. Also, users judge the reputation\nof other users based on their past contributions. Social voting helps users\nidentify and promote good content but is prone to preferential attachment.\nCombining social voting with sophisticated algorithms for ranking content might\nenable users to better judge others' reputation and promote high quality\ncontent.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 08:18:58 GMT"}], "update_date": "2012-04-18", "authors_parsed": [["Paul", "Sharoda A.", ""], ["Hong", "Lichan", ""], ["Chi", "Ed H.", ""]]}, {"id": "1204.3890", "submitter": "Lixiu Yu", "authors": "Lixiu Yu, Jeffrey V. Nickerson, Yasuaki Sakamoto", "title": "Collective Creativity: Where we are and where we might go", "comments": "Presented at Collective Intelligence conference, 2012\n  (arXiv:1204.2991)", "journal-ref": null, "doi": null, "report-no": "CollectiveIntelligence/2012/17", "categories": "cs.SI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Creativity is individual, and it is social. The social aspects of creativity\nhave become of increasing interest as systems have emerged that mobilize large\nnumbers of people to engage in creative tasks. We examine research related to\ncollective intelligence and differentiate work on collective creativity from\nother collective activities by analyzing systems with respect to the tasks that\nare performed and the outputs that result. Three types of systems are\ndiscussed: games, contests and networks. We conclude by suggesting how systems\nthat generate collective creativity can be improved and how new systems might\nbe constructed.\n", "versions": [{"version": "v1", "created": "Tue, 17 Apr 2012 01:50:06 GMT"}], "update_date": "2012-04-19", "authors_parsed": [["Yu", "Lixiu", ""], ["Nickerson", "Jeffrey V.", ""], ["Sakamoto", "Yasuaki", ""]]}, {"id": "1204.4015", "submitter": "Sudarshan Iyengar", "authors": "Amitash Ramesh, Soumya Ramesh, Sudarshan Iyengar, Vinod Sekhar", "title": "Human Navigational Performance in a Complex Network with Progressive\n  Disruptions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.HC cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The current paper is an investigation towards understanding the navigational\nperformance of humans on a network when the \"landmark\" nodes are blocked. We\nobserve that humans learn to cope up, despite the continued introduction of\nblockages in the network. The experiment proposed involves the task of\nnavigating on a word network based on a puzzle called the wordmorph. We\nintroduce blockages in the network and report an incremental improvement in\nperformance with respect to time. We explain this phenomenon by analyzing the\nevolution of the knowledge in the human participants of the underlying network\nas more and more landmarks are removed. We hypothesize that humans learn the\nbare essentials to navigate unless we introduce blockages in the network which\nwould whence enforce upon them the need to explore newer ways of navigating. We\ndraw a parallel to human problem solving and postulate that obstacles are\ncatalysts for humans to innovate techniques to solve a restricted variant of a\nfamiliar problem.\n", "versions": [{"version": "v1", "created": "Wed, 18 Apr 2012 08:42:05 GMT"}], "update_date": "2012-04-19", "authors_parsed": [["Ramesh", "Amitash", ""], ["Ramesh", "Soumya", ""], ["Iyengar", "Sudarshan", ""], ["Sekhar", "Vinod", ""]]}, {"id": "1204.4093", "submitter": "Casey Bennett", "authors": "Casey Bennett", "title": "Utilizing RxNorm to Support Practical Computing Applications: Capturing\n  Medication History in Live Electronic Health Records", "comments": "Appendix (including SQL/DDL Code) available by author request.\n  Keywords: RxNorm; Electronic Health Record; Medication History;\n  Interoperability; Unified Medical Language System; Search Optimization", "journal-ref": "Journal of Biomedical Informatics 45: 634-641 (2012)", "doi": "10.1016/j.jbi.2012.02.011", "report-no": null, "categories": "cs.DB cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  RxNorm was utilized as the basis for direct-capture of medication history\ndata in a live EHR system deployed in a large, multi-state outpatient\nbehavioral healthcare provider in the United States serving over 75,000\ndistinct patients each year across 130 clinical locations. This tool\nincorporated auto-complete search functionality for medications and proper\ndosage identification assistance. The overarching goal was to understand if and\nhow standardized terminologies like RxNorm can be used to support practical\ncomputing applications in live EHR systems. We describe the stages of\nimplementation, approaches used to adapt RxNorm's data structure for the\nintended EHR application, and the challenges faced. We evaluate the\nimplementation using a four-factor framework addressing flexibility, speed,\ndata integrity, and medication coverage. RxNorm proved to be functional for the\nintended application, given appropriate adaptations to address high-speed\ninput/output (I/O) requirements of a live EHR and the flexibility required for\ndata entry in multiple potential clinical scenarios. Future research around\nsearch optimization for medication entry, user profiling, and linking RxNorm to\ndrug classification schemes holds great potential for improving the user\nexperience and utility of medication data in EHRs.\n", "versions": [{"version": "v1", "created": "Wed, 18 Apr 2012 14:27:42 GMT"}, {"version": "v2", "created": "Wed, 15 Aug 2012 17:09:00 GMT"}], "update_date": "2012-08-16", "authors_parsed": [["Bennett", "Casey", ""]]}, {"id": "1204.4332", "submitter": "Patrick Taillandier", "authors": "Patrick Taillandier (UMMISCO), Julien Gaffuri (COGIT)", "title": "Designing generalisation evaluation function through human-machine\n  dialogue", "comments": null, "journal-ref": "GIScience, Zurich : Switzerland (2010)", "doi": null, "report-no": null, "categories": "cs.HC cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automated generalisation has known important improvements these last few\nyears. However, an issue that still deserves more study concerns the automatic\nevaluation of generalised data. Indeed, many automated generalisation systems\nrequire the utilisation of an evaluation function to automatically assess\ngeneralisation outcomes. In this paper, we propose a new approach dedicated to\nthe design of such a function. This approach allows an imperfectly defined\nevaluation function to be revised through a man-machine dialogue. The user\ngives its preferences to the system by comparing generalisation outcomes.\nMachine Learning techniques are then used to improve the evaluation function.\nAn experiment carried out on buildings shows that our approach significantly\nimproves generalisation evaluation functions defined by users.\n", "versions": [{"version": "v1", "created": "Thu, 19 Apr 2012 12:10:10 GMT"}], "update_date": "2012-04-20", "authors_parsed": [["Taillandier", "Patrick", "", "UMMISCO"], ["Gaffuri", "Julien", "", "COGIT"]]}, {"id": "1204.4990", "submitter": "Patrick Taillandier", "authors": "Patrick Taillandier (UMMISCO), Julien Gaffuri (COGIT)", "title": "Objective Function Designing Led by User Preferences Acquisition", "comments": "International Conference on Information Technology and Applications,\n  Hanoi : Viet Nam (2009)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many real world problems can be defined as optimisation problems in which the\naim is to maximise an objective function. The quality of obtained solution is\ndirectly linked to the pertinence of the used objective function. However,\ndesigning such function, which has to translate the user needs, is usually\nfastidious. In this paper, a method to help user objective functions designing\nis proposed. Our approach, which is highly interactive, is based on man machine\ndialogue and more particularly on the comparison of problem instance solutions\nby the user. We propose an experiment in the domain of cartographic\ngeneralisation that shows promising results.\n", "versions": [{"version": "v1", "created": "Mon, 23 Apr 2012 08:02:19 GMT"}], "update_date": "2012-04-24", "authors_parsed": [["Taillandier", "Patrick", "", "UMMISCO"], ["Gaffuri", "Julien", "", "COGIT"]]}, {"id": "1204.5267", "submitter": "K.S.Kuppusamy", "authors": "K.S. Kuppusamy, Leena Mary Francis, G. Aghila", "title": "WILI - Web Interface for people with Lowvision Issues", "comments": "8 Pages; 6 Figures, International Journal on Computational Sciences &\n  Applications (IJCSA) Vo2, No.2, April 2012, ISSN: 2200-0011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Though World Wide Web is the single largest source of information, it is\nill-equipped to serve the people with vision related problems. With the\nprolific increase in the interest to make the web accessible to all sections of\nthe society, solving this accessibility problem becomes mandatory. This paper\npresents a technique for making web pages accessible for people with low vision\nissues. A model for making web pages accessible, WILI (Web Interface for people\nwith Low-vision Issues) has been proposed. The approach followed in this work\nis to automatically replace the existing display style of a web page with a new\nskin following the guidelines given by Clear Print Booklet provided by Royal\nNational Institute of Blind. \"Single Click Solution\" is one of the primary\nadvantages provided by WILI. A prototype using the WILI model is implemented\nand various experiments are conducted. The results of experiments conducted on\nWILI indicate 82% effective conversion rate.\n", "versions": [{"version": "v1", "created": "Tue, 24 Apr 2012 04:11:26 GMT"}], "update_date": "2012-04-25", "authors_parsed": [["Kuppusamy", "K. S.", ""], ["Francis", "Leena Mary", ""], ["Aghila", "G.", ""]]}, {"id": "1204.6321", "submitter": "Konstantinos Chorianopoulos", "authors": "Ioannis Leftheriotis, Chrysoula Gkonela, Konstantinos Chorianopoulos", "title": "Efficient Video Indexing on the Web: A System that Leverages User\n  Interactions with a Video Player", "comments": "9 pages, 3 figures, UCMedia 2010: 2nd International ICST Conference\n  on User Centric Media", "journal-ref": null, "doi": "10.1007/978-3-642-35145-7_16", "report-no": null, "categories": "cs.MM cs.DL cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a user-based video indexing method, that\nautomatically generates thumbnails of the most important scenes of an online\nvideo stream, by analyzing users' interactions with a web video player. As a\ntest bench to verify our idea we have extended the YouTube video player into\nthe VideoSkip system. In addition, VideoSkip uses a web-database (Google\nApplication Engine) to keep a record of some important parameters, such as the\ntiming of basic user actions (play, pause, skip). Moreover, we implemented an\nalgorithm that selects representative thumbnails. Finally, we populated the\nsystem with data from an experiment with nine users. We found that the\nVideoSkip system indexes video content by leveraging implicit users\ninteractions, such as pause and thirty seconds skip. Our early findings point\ntoward improvements of the web video player and its thumbnail generation\ntechnique. The VideSkip system could compliment content-based algorithms, in\norder to achieve efficient video-indexing in difficult videos, such as lectures\nor sports.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2012 20:00:20 GMT"}], "update_date": "2018-04-17", "authors_parsed": [["Leftheriotis", "Ioannis", ""], ["Gkonela", "Chrysoula", ""], ["Chorianopoulos", "Konstantinos", ""]]}, {"id": "1204.6325", "submitter": "Konstantinos Chorianopoulos", "authors": "Konstantinos Chorianopoulos, Vassiliki Tsaknaki", "title": "CELL: Connecting Everyday Life in an archipeLago", "comments": "This paper has been withdrawn by the author due to some errors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the design of a seamless broadcast communication system that\nbrings together the distributed community of remote secondary education\nschools. In contrast to higher education, primary and secondary education\nestablishments should remain distributed, in order to maintain a balance of\nurban and rural life in the developing and the developed world. We plan to\ndeploy an ambient and social interactive TV platform (physical installation,\nauthoring tools, interactive content) that supports social communication in a\npositive way. In particular, we present the physical design and the conceptual\nmodel of the system.\n", "versions": [{"version": "v1", "created": "Fri, 27 Apr 2012 20:10:16 GMT"}, {"version": "v2", "created": "Sun, 3 Jun 2012 08:45:46 GMT"}], "update_date": "2012-06-05", "authors_parsed": [["Chorianopoulos", "Konstantinos", ""], ["Tsaknaki", "Vassiliki", ""]]}, {"id": "1204.6411", "submitter": "Wolfgang Slany", "authors": "Wolfgang Slany", "title": "Catroid: A Mobile Visual Programming System for Children", "comments": "4 pages. Demo paper at the 11th International Conference on\n  Interaction Design and Children (IDC 2012)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PL cs.CY cs.HC cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Catroid is a free and open source visual programming language, programming\nenvironment, image manipulation program, and website. Catroid allows casual and\nfirst-time users starting from age eight to develop their own animations and\ngames solely using their Android phones or tablets. Catroid also allows to\nwirelessly control external hardware such as Lego Mindstorms robots via\nBluetooth, Bluetooth Arduino boards, as well as Parrot's popular and\ninexpensive AR.Drone quadcopters via WiFi.\n", "versions": [{"version": "v1", "created": "Sat, 28 Apr 2012 14:26:56 GMT"}], "update_date": "2012-05-01", "authors_parsed": [["Slany", "Wolfgang", ""]]}]