[{"id": "2107.00052", "submitter": "Nicolas Loizou", "authors": "Nicolas Loizou, Hugo Berard, Gauthier Gidel, Ioannis Mitliagkas, Simon\n  Lacoste-Julien", "title": "Stochastic Gradient Descent-Ascent and Consensus Optimization for Smooth\n  Games: Convergence Analysis under Expected Co-coercivity", "comments": "35 pages, 3 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT math.OC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two of the most prominent algorithms for solving unconstrained smooth games\nare the classical stochastic gradient descent-ascent (SGDA) and the recently\nintroduced stochastic consensus optimization (SCO) (Mescheder et al., 2017).\nSGDA is known to converge to a stationary point for specific classes of games,\nbut current convergence analyses require a bounded variance assumption. SCO is\nused successfully for solving large-scale adversarial problems, but its\nconvergence guarantees are limited to its deterministic variant. In this work,\nwe introduce the expected co-coercivity condition, explain its benefits, and\nprovide the first last-iterate convergence guarantees of SGDA and SCO under\nthis condition for solving a class of stochastic variational inequality\nproblems that are potentially non-monotone. We prove linear convergence of both\nmethods to a neighborhood of the solution when they use constant step-size, and\nwe propose insightful stepsize-switching rules to guarantee convergence to the\nexact solution. In addition, our convergence guarantees hold under the\narbitrary sampling paradigm, and as such, we give insights into the complexity\nof minibatching.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jun 2021 18:32:46 GMT"}], "update_date": "2021-07-02", "authors_parsed": [["Loizou", "Nicolas", ""], ["Berard", "Hugo", ""], ["Gidel", "Gauthier", ""], ["Mitliagkas", "Ioannis", ""], ["Lacoste-Julien", "Simon", ""]]}, {"id": "2107.00357", "submitter": "Tomer Ezra", "authors": "Tomer Ezra, Michal Feldman, Ron Kupfer", "title": "Prophet Inequality with Competing Agents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We introduce a model of competing agents in a prophet setting, where rewards\narrive online, and decisions are made immediately and irrevocably. The rewards\nare unknown from the outset, but they are drawn from a known probability\ndistribution. In the standard prophet setting, a single agent makes selection\ndecisions in an attempt to maximize her expected reward. The novelty of our\nmodel is the introduction of a competition setting, where multiple agents\ncompete over the arriving rewards, and make online selection decisions\nsimultaneously, as rewards arrive. If a given reward is selected by more than a\nsingle agent, ties are broken either randomly or by a fixed ranking of the\nagents. The consideration of competition turns the prophet setting from an\nonline decision making scenario to a multi-agent game.\n  For both random and ranked tie-breaking rules, we present simple threshold\nstrategies for the agents that give them high guarantees, independent of the\nstrategies taken by others. In particular, for random tie-breaking, every agent\ncan guarantee herself at least $\\frac{1}{k+1}$ of the highest reward, and at\nleast $\\frac{1}{2k}$ of the optimal social welfare. For ranked tie-breaking,\nthe $i$th ranked agent can guarantee herself at least a half of the $i$th\nhighest reward. We complement these results by matching upper bounds, even with\nrespect to equilibrium profiles. For ranked tie-breaking rule, we also show a\ncorrespondence between the equilibrium of the $k$-agent game and the optimal\nstrategy of a single decision maker who can select up to $k$ rewards.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2021 10:46:26 GMT"}], "update_date": "2021-07-02", "authors_parsed": [["Ezra", "Tomer", ""], ["Feldman", "Michal", ""], ["Kupfer", "Ron", ""]]}, {"id": "2107.00464", "submitter": "Junchi Li", "authors": "Chris Junchi Li, Yaodong Yu, Nicolas Loizou, Gauthier Gidel, Yi Ma,\n  Nicolas Le Roux, Michael I. Jordan", "title": "On the Convergence of Stochastic Extragradient for Bilinear Games with\n  Restarted Iteration Averaging", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the stochastic bilinear minimax optimization problem, presenting an\nanalysis of the Stochastic ExtraGradient (SEG) method with constant step size,\nand presenting variations of the method that yield favorable convergence. We\nfirst note that the last iterate of the basic SEG method only contracts to a\nfixed neighborhood of the Nash equilibrium, independent of the step size. This\ncontrasts sharply with the standard setting of minimization where standard\nstochastic algorithms converge to a neighborhood that vanishes in proportion to\nthe square-root (constant) step size. Under the same setting, however, we prove\nthat when augmented with iteration averaging, SEG provably converges to the\nNash equilibrium, and such a rate is provably accelerated by incorporating a\nscheduled restarting procedure. In the interpolation setting, we achieve an\noptimal convergence rate up to tight constants. We present numerical\nexperiments that validate our theoretical findings and demonstrate the\neffectiveness of the SEG method when equipped with iteration averaging and\nrestarting.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jun 2021 17:51:36 GMT"}], "update_date": "2021-07-02", "authors_parsed": [["Li", "Chris Junchi", ""], ["Yu", "Yaodong", ""], ["Loizou", "Nicolas", ""], ["Gidel", "Gauthier", ""], ["Ma", "Yi", ""], ["Roux", "Nicolas Le", ""], ["Jordan", "Michael I.", ""]]}, {"id": "2107.00526", "submitter": "Alexander Braun", "authors": "Alexander Braun, Matthias Buttkus and Thomas Kesselheim", "title": "Asymptotically Optimal Welfare of Posted Pricing for Multiple Items with\n  MHR Distributions", "comments": "To appear at the 29th Annual European Symposium on Algorithms (ESA\n  2021)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of posting prices for unit-demand buyers if all $n$\nbuyers have identically distributed valuations drawn from a distribution with\nmonotone hazard rate. We show that even with multiple items asymptotically\noptimal welfare can be guaranteed.\n  Our main results apply to the case that either a buyer's value for different\nitems are independent or that they are perfectly correlated. We give mechanisms\nusing dynamic prices that obtain a $1 - \\Theta \\left( \\frac{1}{\\log\nn}\\right)$-fraction of the optimal social welfare in expectation. Furthermore,\nwe devise mechanisms that only use static item prices and are $1 - \\Theta\n\\left( \\frac{\\log\\log\\log n}{\\log n}\\right)$-competitive compared to the\noptimal social welfare. As we show, both guarantees are asymptotically optimal,\neven for a single item and exponential distributions.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2021 15:11:49 GMT"}], "update_date": "2021-07-02", "authors_parsed": [["Braun", "Alexander", ""], ["Buttkus", "Matthias", ""], ["Kesselheim", "Thomas", ""]]}, {"id": "2107.00711", "submitter": "Dmitry Levando", "authors": "Dmitry Levando", "title": "Formation of coalition structures as a non-cooperative game", "comments": "Submitted to the Dynamic Games and Applications; Special Issue: Group\n  Formation and Farsightedness", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  We study coalition structure formation with intra and inter-coalition\nexternalities in the introduced family of nested non-cooperative simultaneous\nfinite games. A non-cooperative game embeds a coalition structure formation\nmechanism, and has two outcomes: an allocation of players over coalitions and a\npayoff for every player. Coalition structures of a game are described by Young\ndiagrams. They serve to enumerate coalition structures and allocations of\nplayers over them. For every coalition structure a player has a set of finite\nstrategies. A player chooses a coalition structure and a strategy.\n  A (social) mechanism eliminates conflicts in individual choices and produces\nfinal coalition structures. Every final coalition structure is a\nnon-cooperative game. Mixed equilibrium always exists and consists of a mixed\nstrategy profile, payoffs and equilibrium coalition structures. We use a\nmaximum coalition size to parametrize the family of the games. The\nnon-cooperative game of Nash is a partial case of the model. The result is\ndifferent from the Shapley value, a strong Nash, coalition-proof equilibria,\ncore solutions, and other equilibrium concepts. We supply few non-cooperative\ncoalition structure stability criteria.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jul 2021 19:37:22 GMT"}], "update_date": "2021-07-05", "authors_parsed": [["Levando", "Dmitry", ""]]}, {"id": "2107.00901", "submitter": "Do Hyeon Kim", "authors": "Do Hyeon Kim, Aunas Manzoor, Madyan Alsenwi, Yan Kyaw TUn, Walid Saad,\n  Choong Seon Hong", "title": "Ruin Theory for User Association and Energy Optimization in Multi-access\n  Edge Computing", "comments": "This paper has been submitted to IEEE Wireless Communications Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this letter, a novel framework is proposed for analyzing data offloading\nin a multi-access edge computing system. Specifically, a two-phase algorithm,\nis proposed, including two key phases: user association phase} and task\noffloading phase}. In the first phase, a ruin theory-based approach is\ndeveloped to obtain the users association considering the users' transmission\nreliability. Meanwhile, in the second phase, an optimization-based algorithm is\nused to optimize the data offloading process. In particular, ruin theory is\nused to manage the user association phase, and a ruin probability-based\npreference profile is considered to control the priority of proposing users.\nHere, ruin probability is derived by the surplus buffer space of each edge node\nat each time slot. Giving the association results, an optimization problem is\nformulated to optimize the amount of offloaded data aiming at minimizing the\nenergy consumption of users. Simulation results show that the developed\nsolutions guarantee system reliability under a tolerable value of surplus\nbuffer size and minimize the total energy consumption of all users.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jul 2021 08:29:26 GMT"}, {"version": "v2", "created": "Tue, 20 Jul 2021 04:10:29 GMT"}], "update_date": "2021-07-21", "authors_parsed": [["Kim", "Do Hyeon", ""], ["Manzoor", "Aunas", ""], ["Alsenwi", "Madyan", ""], ["TUn", "Yan Kyaw", ""], ["Saad", "Walid", ""], ["Hong", "Choong Seon", ""]]}, {"id": "2107.01042", "submitter": "Daniel Halpern", "authors": "Manon Revel, Tao Lin, Daniel Halpern", "title": "The Optimal Size of an Epistemic Congress", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the optimal size of a congress in a representative democracy. We\ntake an epistemic view where voters decide on a binary issue with one ground\ntruth outcome, and each voter votes correctly according to their competence\nlevels in $[0, 1]$. Assuming that we can sample the best experts to form an\nepistemic congress, we find that the optimal congress size should be linear in\nthe population size. This result is striking because it holds even when\nallowing the top representatives to be accurate with arbitrarily high\nprobabilities. We then analyze real world data, finding that the actual sizes\nof congresses are much smaller than the optimal size our theoretical results\nsuggest. We conclude by analyzing under what conditions congresses of\nsub-optimal sizes would still outperform direct democracy, in which all voters\nvote.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jul 2021 12:51:11 GMT"}], "update_date": "2021-07-05", "authors_parsed": [["Revel", "Manon", ""], ["Lin", "Tao", ""], ["Halpern", "Daniel", ""]]}, {"id": "2107.01048", "submitter": "Vitor Bosshard", "authors": "Vitor Bosshard and Sven Seuken", "title": "Shapley-Based Core-Selecting Payment Rules", "comments": "Research Note", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this research note, we lay some groundwork for analyzing the\nmanipulability of core-selecting payment rules in combinatorial auctions. In\nparticular, we focus on payment rules based on the bidders' Shapley values. We\ndefine a sensitivity metric, and provide analytical results for this metric in\nLLG, for six different payment vectors used as reference points for\nminimum-revenue core-selecting payment rules. We furthermore show how this\nsensitivity affects the derivative of the resulting payment rules.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jul 2021 12:55:40 GMT"}], "update_date": "2021-07-05", "authors_parsed": [["Bosshard", "Vitor", ""], ["Seuken", "Sven", ""]]}, {"id": "2107.01442", "submitter": "Han Xiao", "authors": "Han Xiao, Tianhang Lu, Qizhi Fang", "title": "Approximate Core Allocations for Multiple Partners Matching Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The multiple partners matching game is a cooperative profit-sharing game,\nwhich generalizes the classic matching game by allowing each player to have\nmore than one partner. The core is one of the most important concepts in\ncooperative game theory, which consists all possible ways of allocating the\ntotal profit of the game among individual players such that the grand coalition\nremains intact. For the multiple partners matching game, the core may be empty\nin general [Deng et al., Algorithmic aspects of the core of combinatorial\noptimization games, Math. Oper. Res., 1999.]; even when the core is non-empty,\nthe core membership problem is intractable in general [Biro et al., The stable\nfixtures problem with payments, Games Econ. Behav., 2018]. Thus we study\napproximate core allocations for the multiple partners matching game, and\nprovide an LP-based mechanism guaranteeing that no coalition is paid less than\n$2/3$ times the profit it makes on its own. Moreover, we show that the factor\n$2/3$ is best possible in general, but can be improved depending on how\nseverely constrained the players are. Our result generalizes the recent work of\nVazirani [Vazirani, The general graph matching game: approximate core, arXiv,\n2021] from matching games to multiple partners matching games.\n", "versions": [{"version": "v1", "created": "Sat, 3 Jul 2021 14:20:07 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Xiao", "Han", ""], ["Lu", "Tianhang", ""], ["Fang", "Qizhi", ""]]}, {"id": "2107.01471", "submitter": "Hanyu Li", "authors": "Zhaohua Chen, Xiaotie Deng, Wenhan Huang, Hanyu Li and Yuhao Li", "title": "On Tightness of the Tsaknakis-Spirakis Algorithm for Approximate Nash\n  Equilibrium", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Finding the minimum approximate ratio for Nash equilibrium of bi-matrix games\nhas derived a series of studies, started with 3/4, followed by 1/2, 0.38 and\n0.36, finally the best approximate ratio of 0.3393 by Tsaknakis and Spirakis\n(TS algorithm for short). Efforts to improve the results remain not successful\nin the past 14 years. This work makes the first progress to show that the bound\nof 0.3393 is indeed tight for the TS algorithm. Next, we characterize all\npossible tight game instances for the TS algorithm. It allows us to conduct\nextensive experiments to study the nature of the TS algorithm and to compare it\nwith other algorithms. We find that this lower bound is not smoothed for the TS\nalgorithm in that any perturbation on the initial point may deviate away from\nthis tight bound approximate solution. Other approximate algorithms such as\nFictitious Play and Regret Matching also find better approximate solutions.\nHowever, the new distributed algorithm for approximate Nash equilibrium by\nCzumaj et al. performs consistently at the same bound of 0.3393. This proves\nour lower bound instances generated against the TS algorithm can serve as a\nbenchmark in design and analysis of approximate Nash equilibrium algorithms.\n", "versions": [{"version": "v1", "created": "Sat, 3 Jul 2021 17:49:52 GMT"}, {"version": "v2", "created": "Tue, 20 Jul 2021 13:52:05 GMT"}], "update_date": "2021-07-21", "authors_parsed": [["Chen", "Zhaohua", ""], ["Deng", "Xiaotie", ""], ["Huang", "Wenhan", ""], ["Li", "Hanyu", ""], ["Li", "Yuhao", ""]]}, {"id": "2107.01595", "submitter": "Panayotis Mertikopoulos", "authors": "Saeed Hadikhanloo and Rida Laraki and Panayotis Mertikopoulos and\n  Sylvain Sorin", "title": "Learning in nonatomic games, Part I: Finite action spaces and population\n  games", "comments": "27 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine the long-run behavior of a wide range of dynamics for learning in\nnonatomic games, in both discrete and continuous time. The class of dynamics\nunder consideration includes fictitious play and its regularized variants, the\nbest-reply dynamics (again, possibly regularized), as well as the dynamics of\ndual averaging / \"follow the regularized leader\" (which themselves include as\nspecial cases the replicator dynamics and Friedman's projection dynamics). Our\nanalysis concerns both the actual trajectory of play and its time-average, and\nwe cover potential and monotone games, as well as games with an evolutionarily\nstable state (global or otherwise). We focus exclusively on games with finite\naction spaces; nonatomic games with continuous action spaces are treated in\ndetail in Part II of this paper.\n", "versions": [{"version": "v1", "created": "Sun, 4 Jul 2021 11:20:45 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Hadikhanloo", "Saeed", ""], ["Laraki", "Rida", ""], ["Mertikopoulos", "Panayotis", ""], ["Sorin", "Sylvain", ""]]}, {"id": "2107.01649", "submitter": "Chenhao Wang", "authors": "Hau Chan, Minming Li, Chenhao Wang", "title": "Facility Location Games with Ordinal Preferences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a new setting of facility location games with ordinal\npreferences. In such a setting, we have a set of agents and a set of\nfacilities. Each agent is located on a line and has an ordinal preference over\nthe facilities. Our goal is to design strategyproof mechanisms that elicit\ntruthful information (preferences and/or locations) from the agents and locate\nthe facilities to minimize both maximum and total cost objectives as well as to\nmaximize both minimum and total utility objectives. For the four possible\nobjectives, we consider the 2-facility settings in which only preferences are\nprivate, or locations are private. For each possible combination of the\nobjectives and settings, we provide lower and upper bounds on the approximation\nratios of strategyproof mechanisms, which are asymptotically tight up to a\nconstant. Finally, we discuss the generalization of our results beyond two\nfacilities and when the agents can misreport both locations and preferences.\n", "versions": [{"version": "v1", "created": "Sun, 4 Jul 2021 14:31:59 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Chan", "Hau", ""], ["Li", "Minming", ""], ["Wang", "Chenhao", ""]]}, {"id": "2107.01854", "submitter": "Ke Ma", "authors": "Ke Ma and Qianqian Xu and Jinshan Zeng and Xiaochun Cao and Qingming\n  Huang", "title": "Poisoning Attack against Estimating from Pairwise Comparisons", "comments": "31 pages", "journal-ref": null, "doi": "10.1109/TPAMI.2021.3087514", "report-no": null, "categories": "cs.LG cs.AI cs.CR cs.GT", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  As pairwise ranking becomes broadly employed for elections, sports\ncompetitions, recommendations, and so on, attackers have strong motivation and\nincentives to manipulate the ranking list. They could inject malicious\ncomparisons into the training data to fool the victim. Such a technique is\ncalled poisoning attack in regression and classification tasks. In this paper,\nto the best of our knowledge, we initiate the first systematic investigation of\ndata poisoning attacks on pairwise ranking algorithms, which can be formalized\nas the dynamic and static games between the ranker and the attacker and can be\nmodeled as certain kinds of integer programming problems. To break the\ncomputational hurdle of the underlying integer programming problems, we\nreformulate them into the distributionally robust optimization (DRO) problems,\nwhich are computationally tractable. Based on such DRO formulations, we propose\ntwo efficient poisoning attack algorithms and establish the associated\ntheoretical guarantees. The effectiveness of the suggested poisoning attack\nstrategies is demonstrated by a series of toy simulations and several real data\nexperiments. These experimental results show that the proposed methods can\nsignificantly reduce the performance of the ranker in the sense that the\ncorrelation between the true ranking list and the aggregated results can be\ndecreased dramatically.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jul 2021 08:16:01 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Ma", "Ke", ""], ["Xu", "Qianqian", ""], ["Zeng", "Jinshan", ""], ["Cao", "Xiaochun", ""], ["Huang", "Qingming", ""]]}, {"id": "2107.01997", "submitter": "Attila Szolnoki", "authors": "A. Szolnoki and M. Perc", "title": "The self-organizing impact of averaged payoffs on the evolution of\n  cooperation", "comments": "16 pages, 7 figures; accepted for publication in New Journal of\n  Physics", "journal-ref": "New J. Phys. 23, 063068 (2021)", "doi": "10.1088/1367-2630/ac0756", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.GT q-bio.PE", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  According to the fundamental principle of evolutionary game theory, the more\nsuccessful strategy in a population should spread. Hence, during a strategy\nimitation process a player compares its payoff value to the payoff value held\nby a competing strategy. But this information is not always accurate. To avoid\nambiguity a learner may therefore decide to collect a more reliable statistics\nby averaging the payoff values of its opponents in the neighborhood, and makes\na decision afterwards. This simple alteration of the standard microscopic\nprotocol significantly improves the cooperation level in a population.\nFurthermore, the positive impact can be strengthened by increasing the role of\nthe environment and the size of the evaluation circle. The mechanism that\nexplains this improvement is based on a self-organizing process which reveals\nthe detrimental consequence of defector aggregation that remains partly hidden\nduring face-to-face comparisons. Notably, the reported phenomenon is not\nlimited to lattice populations but remains valid also for systems described by\nirregular interaction networks.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jul 2021 13:16:59 GMT"}], "update_date": "2021-07-07", "authors_parsed": [["Szolnoki", "A.", ""], ["Perc", "M.", ""]]}, {"id": "2107.02058", "submitter": "Jiashuo Jiang", "authors": "Jiashuo Jiang, Will Ma, Jiawei Zhang", "title": "Tight Guarantees for Multi-unit Prophet Inequalities and Online\n  Stochastic Knapsack", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Prophet inequalities are a useful tool for designing online allocation\nprocedures and comparing their performance to the optimal offline allocation.\nIn the basic setting of $k$-unit prophet inequalities, the magical procedure of\nAlaei (2011) with its celebrated performance guarantee of\n$1-\\frac{1}{\\sqrt{k+3}}$ has found widespread adoption in mechanism design and\nother online allocation problems in online advertising, healthcare scheduling,\nand revenue management. Despite being commonly used for implementing online\nallocation, the tightness of Alaei's procedure for a given $k$ has remained\nunknown. In this paper we resolve this question, characterizing the tight bound\nby identifying the structure of the optimal online implementation, and\nconsequently improving the best-known guarantee for $k$-unit prophet\ninequalities for all $k>1$. We also consider a more general online stochastic\nknapsack problem where each individual allocation can consume an arbitrary\nfraction of the initial capacity. We introduce a new \"best-fit\" procedure for\nimplementing a fractionally-feasible knapsack solution online, with a\nperformance guarantee of $\\frac{1}{3+e^{-2}}\\approx0.319$, which we also show\nis tight. This improves the previously best-known guarantee of 0.2 for online\nknapsack. Our analysis differs from existing ones by eschewing the need to\nsplit items into \"large\" or \"small\" based on capacity consumption, using\ninstead an invariant for the overall utilization on different sample paths.\nFinally, we refine our technique for the unit-density special case of knapsack,\nand improve the guarantee from 0.321 to 0.3557 in the multi-resource\nappointment scheduling application of Stein et al. (2020). All in all, our\nresults imply \\textit{tight} Online Contention Resolution Schemes for\n$k$-uniform matroids and the knapsack polytope, respectively, which has further\nimplications in mechanism design.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jul 2021 14:42:29 GMT"}, {"version": "v2", "created": "Fri, 23 Jul 2021 03:43:05 GMT"}], "update_date": "2021-07-26", "authors_parsed": [["Jiang", "Jiashuo", ""], ["Ma", "Will", ""], ["Zhang", "Jiawei", ""]]}, {"id": "2107.02489", "submitter": "Ioannis Anagnostides", "authors": "Ioannis Anagnostides, Dimitris Fotakis, Panagiotis Patsilinakos", "title": "Metric-Distortion Bounds under Limited Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we study the metric distortion problem in voting theory under a\nlimited amount of ordinal information. Our primary contribution is threefold.\nFirst, we consider mechanisms which perform a sequence of pairwise comparisons\nbetween candidates. We show that a widely-popular deterministic mechanism\nemployed in most knockout phases yields distortion $\\mathcal{O}(\\log m)$ while\neliciting only $m-1$ out of $\\Theta(m^2)$ possible pairwise comparisons, where\n$m$ represents the number of candidates. Our analysis for this mechanism\nleverages a powerful technical lemma recently developed by Kempe\n\\cite{DBLP:conf/aaai/000120a}. We also provide a matching lower bound on its\ndistortion. In contrast, we prove that any mechanism which performs fewer than\n$m-1$ pairwise comparisons is destined to have unbounded distortion. Moreover,\nwe study the power of deterministic mechanisms under incomplete rankings. Most\nnotably, when every agent provides her $k$-top preferences we show an upper\nbound of $6 m/k + 1$ on the distortion, for any $k \\in \\{1, 2, \\dots, m\\}$.\nThus, we substantially improve over the previous bound of $12 m/k$ recently\nestablished by Kempe \\cite{DBLP:conf/aaai/000120a,DBLP:conf/aaai/000120b}, and\nwe come closer to matching the best-known lower bound. Finally, we are\nconcerned with the sample complexity required to ensure near-optimal distortion\nwith high probability. Our main contribution is to show that a random sample of\n$\\Theta(m/\\epsilon^2)$ voters suffices to guarantee distortion $3 + \\epsilon$\nwith high probability, for any sufficiently small $\\epsilon > 0$. This result\nis based on analyzing the sensitivity of the deterministic mechanism introduced\nby Gkatzelis, Halpern, and Shah \\cite{DBLP:conf/focs/Gkatzelis0020}.\nImportantly, all of our sample-complexity bounds are distribution-independent.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jul 2021 09:05:54 GMT"}], "update_date": "2021-07-07", "authors_parsed": [["Anagnostides", "Ioannis", ""], ["Fotakis", "Dimitris", ""], ["Patsilinakos", "Panagiotis", ""]]}, {"id": "2107.02798", "submitter": "Daniel Lehmann Prof.", "authors": "Daniel Lehmann", "title": "Representing choice functions by a total hyper-order", "comments": "2 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Choice functions over a set $X$ that satisfy the Outcast, a.k.a. Aizerman,\nproperty are exactly those that attach to any set its maximal subset relative\nto some total order of ${2}^{X}$.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jul 2021 11:21:38 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["Lehmann", "Daniel", ""]]}, {"id": "2107.02850", "submitter": "Ethan C. Zell", "authors": "Anthony DiGiovanni, Ethan C. Zell", "title": "Survey of Self-Play in Reinforcement Learning", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In reinforcement learning (RL), the term self-play describes a kind of\nmulti-agent learning (MAL) that deploys an algorithm against copies of itself\nto test compatibility in various stochastic environments. As is typical in MAL,\nthe literature draws heavily from well-established concepts in classical game\ntheory and so this survey quickly reviews some fundamental concepts. In what\nfollows, we present a brief survey of self-play literature, its major themes,\ncriteria, and techniques, and then conclude with an assessment of current\nshortfalls of the literature as well as suggestions for future directions.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jul 2021 19:33:53 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["DiGiovanni", "Anthony", ""], ["Zell", "Ethan C.", ""]]}, {"id": "2107.03040", "submitter": "Tesshu Hanaka", "authors": "Tesshu Hanaka, Toshiyuki Hirose, Hirotaka Ono", "title": "Capacitated Network Design Games on a Generalized Fair Allocation Model", "comments": "13 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The cost-sharing connection game is a variant of routing games on a network.\nIn this model, given a directed graph with edge-costs and edge-capacities, each\nagent wants to construct a path from a source to a sink with low cost. The cost\nof each edge is shared by the users based on a cost-sharing function. One of\nsimple cost-sharing functions is defined as the cost divided by the number of\nusers. In fact, most of the previous papers about cost-sharing connection games\naddressed this cost-sharing function. It models an ideal setting, where no\noverhead arises when people share things, though it might be quite rare in real\nlife; it is more realistic to consider the setting that the cost paid by an\nagent is the original cost per the number of the agents plus the overhead. In\nthis paper, we model the more realistic scenario of cost-sharing connection\ngames by generalizing cost-sharing functions. The arguments on the model do not\ndepend on specific cost-sharing functions, and are applicable for a wide class\nof cost-sharing functions satisfying the following natural properties: they are\n(1) non-increasing, (2) lower bounded by the original cost per the number of\nthe agents, and (3) upper bounded by the original cost, which enables to\nrepresent various scenarios of cost-sharing. We investigate the Price of\nAnarchy (PoA) and the Price of Stability (PoS) under sum-cost and max-cost\ncriteria with the generalized cost-sharing function. In spite of the\ngeneralization, we obtain the same bounds of PoA and PoS as the cost-sharing\nwith no overhead except PoS under sum-cost. Note that these bounds are tight.\nIn the case of sum-cost, the lower bound on PoS increases from $\\log n$ to\n$n+1/n-1$ by the generalization, which is also almost tight because the upper\nbound is $n$.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2021 06:46:46 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["Hanaka", "Tesshu", ""], ["Hirose", "Toshiyuki", ""], ["Ono", "Hirotaka", ""]]}, {"id": "2107.03076", "submitter": "Yu Yokoi Dr.", "authors": "Yu Yokoi", "title": "An Approximation Algorithm for Maximum Stable Matching with Ties and\n  Constraints", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a polynomial-time $\\frac{3}{2}$-approximation algorithm for the\nproblem of finding a maximum-cardinality stable matching in a many-to-many\nmatching model with ties and laminar constraints on both sides. We formulate\nour problem using a bipartite multigraph whose vertices are called workers and\nfirms, and edges are called contracts. Our algorithm is described as the\ncomputation of a stable matching in an auxiliary instance, in which each\ncontract is replaced with three of its copies and all agents have strict\npreferences on the copied contracts. The construction of this auxiliary\ninstance is symmetric for the two sides, which facilitates a simple symmetric\nanalysis. We use the notion of matroid-kernel for computation in the auxiliary\ninstance and exploit the base-orderability of laminar matroids to show the\napproximation ratio.\n  In a special case in which each worker is assigned at most one contract and\neach firm has a strict preference, our algorithm defines a\n$\\frac{3}{2}$-approximation mechanism that is strategy-proof for workers.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2021 08:46:03 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["Yokoi", "Yu", ""]]}, {"id": "2107.03123", "submitter": "Koki Hamada", "authors": "Koki Hamada (1 and 2), Shuichi Miyazaki (3) ((1) NTT Corporation, (2)\n  Graduate School of Informatics, Kyoto University, (3) Academic Center for\n  Computing and Media Studies, Kyoto University)", "title": "Refined Computational Complexities of Hospitals/Residents Problem with\n  Regional Caps", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Hospitals/Residents problem (HR) is a many-to-one matching problem whose\nsolution concept is stability. It is widely used in assignment systems such as\nassigning medical students (residents) to hospitals. To resolve imbalance in\nthe number of residents assigned to hospitals, an extension called HR with\nregional caps (HRRC) was introduced. In this problem, a positive integer\n(called a regional cap) is associated with a subset of hospitals (called a\nregion), and the total number of residents assigned to hospitals in a region\nmust be at most its regional cap. Kamada and Kojima defined strong stability\nfor HRRC and demonstrated that a strongly stable matching does not necessarily\nexist. Recently, Aziz et al. proved that the problem of determining if a\nstrongly stable matching exists is NP-complete in general. In this paper, we\nrefine Aziz et al.'s result by investigating the computational complexity of\nthe problem in terms of the length of preference lists, the size of regions,\nand whether or not regions can overlap, and completely classify tractable and\nintractable cases.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2021 10:12:40 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["Hamada", "Koki", "", "1 and 2"], ["Miyazaki", "Shuichi", ""]]}, {"id": "2107.03255", "submitter": "Daizhan Cheng Dr", "authors": "Daizhan Cheng", "title": "A Formula for Designing Zero-Determinant Strategies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A formula is presented for designing zero-determinant(ZD) strategies of\ngeneral finite games, which have $n$ players and players can have different\nnumbers of strategies. To this end, using semi-tensor product (STP) of\nmatrices, the profile evolutionary equation for repeated finite games is\nobtained. Starting from it, the ZD strategies are developed for general finite\ngames, based on the same technique proposed by Press and Dyson \\cite{pre12}. A\nformula is obtain to design ZD strategies for any player directly, ignoring the\noriginal ZD design process. Necessary and sufficient condition is obtained to\nensure the effectiveness of the designed ZD strategies. As a consequence, it is\nalso clear that player $i$ is able to unilaterally design $|S_i|-1$ dominating\nlinear relations about the expected payoffs of all players. Finally, the\nfictitious opponent player is proposed for networked evolutionary networks\n(NEGs). Using it, the ZD-strategies are applied to NEGs. It is surprising that\nan individual in a network may use ZD strategies to conflict the whole rest\nnetwork.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2021 14:35:09 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["Cheng", "Daizhan", ""]]}, {"id": "2107.03367", "submitter": "Seyed Moeen Nehzati", "authors": "MohammadAmin Fazli, Seyed Moeen Nehzati, MohammadAmin Salarkia", "title": "Building Stable Off-chain Payment Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Payment channel is a protocol which allows cryptocurrency users to route\nmultiple transactions through network without committing them to the main\nblockchain network (mainnet). This ability makes them the most prominent\nsolution to blockchains' scalability problem. Each modification of payment\nchannels requires a transaction on the mainnet and therefore, big transaction\nfees. In this paper, we assume that a set of payment transactions are given\n(batch or online) and we study the problem of scheduling modificiations on\npayment channels to route all of the transactions with minimum modification\ncost.\n  We investigate two cost models for aforementioned problem: the step cost\nfunction in which every channel modification has a constant cost and the linear\ncost function in which modification costs are proportional to the amount of\nchange. For the step cost function model, we prove impossibility results for\nboth batch and online case. Moreover, some heuristic methods for the batch case\nare presented and compared. For the linear cost we propose a polynomial time\nalgorithm using linear programming for the batch case.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2021 17:25:01 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["Fazli", "MohammadAmin", ""], ["Nehzati", "Seyed Moeen", ""], ["Salarkia", "MohammadAmin", ""]]}, {"id": "2107.03427", "submitter": "Sai Srivatsa Ravindranath", "authors": "Sai Srivatsa Ravindranath, Zhe Feng, Shira Li, Jonathan Ma, Scott D.\n  Kominers, David C. Parkes", "title": "Deep Learning for Two-Sided Matching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We initiate the use of a multi-layer neural network to model two-sided\nmatching and to explore the design space between strategy-proofness and\nstability. It is well known that both properties cannot be achieved\nsimultaneously but the efficient frontier in this design space is not\nunderstood. We show empirically that it is possible to achieve a good\ncompromise between stability and strategy-proofness-substantially better than\nthat achievable through a convex combination of deferred acceptance (stable and\nstrategy-proof for only one side of the market) and randomized serial\ndictatorship (strategy-proof but not stable).\n", "versions": [{"version": "v1", "created": "Wed, 7 Jul 2021 18:22:11 GMT"}], "update_date": "2021-07-09", "authors_parsed": [["Ravindranath", "Sai Srivatsa", ""], ["Feng", "Zhe", ""], ["Li", "Shira", ""], ["Ma", "Jonathan", ""], ["Kominers", "Scott D.", ""], ["Parkes", "David C.", ""]]}, {"id": "2107.03801", "submitter": "Jannik Peters", "authors": "\\'Agnes Cseh and Tobias Friedrich and Jannik Peters", "title": "Pareto optimal and popular house allocation with lower and upper quotas", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In the house allocation problem with lower and upper quotas, we are given a\nset of applicants and a set of projects. Each applicant has a strictly ordered\npreference list over the projects, while the projects are equipped with a lower\nand an upper quota. A feasible matching assigns the applicants to the projects\nin such a way that a project is either matched to no applicant or to a number\nof applicants between its lower and upper quota.\n  In this model we study two classic optimality concepts: Pareto optimality and\npopularity. We show that finding a popular matching is hard even if the maximum\nlower quota is 2 and that finding a perfect Pareto optimal matching, verifying\nPareto optimality, and verifying popularity are all NP-complete even if the\nmaximum lower quota is 3. We complement the last three negative results by\nshowing that the problems become polynomial-time solvable when the maximum\nlower quota is 2, thereby answering two open questions of Cechl\\'arov\\'a and\nFleiner. Finally, we also study the parameterized complexity of all four\nmentioned problems.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2021 12:17:49 GMT"}], "update_date": "2021-07-09", "authors_parsed": [["Cseh", "Ágnes", ""], ["Friedrich", "Tobias", ""], ["Peters", "Jannik", ""]]}, {"id": "2107.03898", "submitter": "Matthew Katzman", "authors": "Paul W. Goldberg, Matthew J. Katzman", "title": "Lower Bounds for the Query Complexity of Equilibria in Lipschitz Games", "comments": "19 pages, 3 figures, accepted for publication in the 14th\n  International Symposium on Algorithmic Game Theory", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Nearly a decade ago, Azrieli and Shmaya introduced the class of\n$\\lambda$-Lipschitz games in which every player's payoff function is\n$\\lambda$-Lipschitz with respect to the actions of the other players. They\nshowed that such games admit $\\epsilon$-approximate pure Nash equilibria for\ncertain settings of $\\epsilon$ and $\\lambda$. They left open, however, the\nquestion of how hard it is to find such an equilibrium. In this work, we\ndevelop a query-efficient reduction from more general games to Lipschitz games.\nWe use this reduction to show a query lower bound for any randomized algorithm\nfinding $\\epsilon$-approximate pure Nash equilibria of $n$-player,\nbinary-action, $\\lambda$-Lipschitz games that is exponential in\n$\\frac{n\\lambda}{\\epsilon}$. In addition, we introduce ``Multi-Lipschitz\ngames,'' a generalization involving player-specific Lipschitz values, and\nprovide a reduction from finding equilibria of these games to finding\nequilibria of Lipschitz games, showing that the value of interest is the sum of\nthe individual Lipschitz parameters. Finally, we provide an exponential lower\nbound on the deterministic query complexity of finding $\\epsilon$-approximate\ncorrelated equilibria of $n$-player, $m$-action, $\\lambda$-Lipschitz games for\nstrong values of $\\epsilon$, motivating the consideration of explicitly\nrandomized algorithms in the above results. Our proof is arguably simpler than\nthose previously used to show similar results.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2021 15:30:52 GMT"}], "update_date": "2021-07-09", "authors_parsed": [["Goldberg", "Paul W.", ""], ["Katzman", "Matthew J.", ""]]}, {"id": "2107.04069", "submitter": "Matheus Venturyne Xavier Ferreira", "authors": "Matheus V. X. Ferreira and S. Matthew Weinberg", "title": "Proof-of-Stake Mining Games with Perfect Randomness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR econ.TH", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Proof-of-Stake blockchains based on a longest-chain consensus protocol are an\nattractive energy-friendly alternative to the Proof-of-Work paradigm. However,\nformal barriers to \"getting the incentives right\" were recently discovered,\ndriven by the desire to use the blockchain itself as a source of\npseudorandomness \\cite{brown2019formal}.\n  We consider instead a longest-chain Proof-of-Stake protocol with perfect,\ntrusted, external randomness (e.g. a randomness beacon). We produce two main\nresults.\n  First, we show that a strategic miner can strictly outperform an honest miner\nwith just $32.8\\%$ of the total stake. Note that a miner of this size {\\em\ncannot} outperform an honest miner in the Proof-of-Work model. This establishes\nthat even with access to a perfect randomness beacon, incentives in\nProof-of-Work and Proof-of-Stake longest-chain protocols are fundamentally\ndifferent.\n  Second, we prove that a strategic miner cannot outperform an honest miner\nwith $30.8\\%$ of the total stake. This means that, while not quite as secure as\nthe Proof-of-Work regime, desirable incentive properties of Proof-of-Work\nlongest-chain protocols can be approximately recovered via Proof-of-Stake with\na perfect randomness beacon.\n  The space of possible strategies in a Proof-of-Stake mining game is {\\em\nsignificantly} richer than in a Proof-of-Work game. Our main technical\ncontribution is a characterization of potentially optimal strategies for a\nstrategic miner, and in particular, a proof that the corresponding\ninfinite-state MDP admits an optimal strategy that is positive recurrent.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2021 19:01:58 GMT"}], "update_date": "2021-07-12", "authors_parsed": [["Ferreira", "Matheus V. X.", ""], ["Weinberg", "S. Matthew", ""]]}, {"id": "2107.04075", "submitter": "Alexander Outkin", "authors": "Alexander V. Outkin, Patricia V. Schulz, Timothy Schulz, Thomas D.\n  Tarman, and Ali Pinar", "title": "Defender Policy Evaluation and Resource Allocation Using MITRE ATT&CK\n  Evaluations Data", "comments": null, "journal-ref": null, "doi": null, "report-no": "SAND2021-7713", "categories": "cs.CR cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protecting against multi-step attacks of uncertain duration and timing forces\ndefenders into an indefinite, always ongoing, resource-intensive response. To\neffectively allocate resources, a defender must be able to analyze multi-step\nattacks under assumption of constantly allocating resources against an\nuncertain stream of potentially undetected attacks. To achieve this goal, we\npresent a novel methodology that applies a game-theoretic approach to the\nattack, attacker, and defender data derived from MITRE's ATT&CK Framework. Time\nto complete attack steps is drawn from a probability distribution determined by\nattacker and defender strategies and capabilities. This constraints attack\nsuccess parameters and enables comparing different defender resource allocation\nstrategies. By approximating attacker-defender games as Markov processes, we\nrepresent the attacker-defender interaction, estimate the attack success\nparameters, determine the effects of attacker and defender strategies, and\nmaximize opportunities for defender strategy improvements against an uncertain\nstream of attacks. This novel representation and analysis of multi-step attacks\nenables defender policy optimization and resource allocation, which we\nillustrate using the data from MITRE's APT3 ATT&CK Evaluations.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2021 19:26:06 GMT"}], "update_date": "2021-07-12", "authors_parsed": [["Outkin", "Alexander V.", ""], ["Schulz", "Patricia V.", ""], ["Schulz", "Timothy", ""], ["Tarman", "Thomas D.", ""], ["Pinar", "Ali", ""]]}, {"id": "2107.04081", "submitter": "Benjamin Bordais", "authors": "Benjamin Bordais, Patricia Bouyer, St\\'ephane Le Roux", "title": "From local to global determinacy in concurrent graph games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In general, finite concurrent two-player reachability games are only\ndetermined in a weak sense: the supremum probability to win can be approached\nvia stochastic strategies, but cannot be realized.\n  We introduce a class of concurrent games that are determined in a much\nstronger sense, and in a way, it is the larger class with this property. To\nthis end, we introduce the notion of \\emph{local interaction} at a state of a\ngraph game: it is a \\emph{game form} whose outcomes (i.e. a table whose\nentries) are the next states, which depend on the concurrent actions of the\nplayers. By definition, a game form is \\emph{determined} iff it always yields\ngames that are determined via deterministic strategies when used as a local\ninteraction in a Nature-free, one-shot reachability game. We show that if all\nthe local interactions of a graph game with Borel objective are determined game\nforms, the game itself is determined: if Nature does not play, one player has a\nwinning strategy; if Nature plays, both players have deterministic strategies\nthat maximize the probability to win. This constitutes a clear-cut separation:\neither a game form behaves poorly already when used alone with basic\nobjectives, or it behaves well even when used together with other well-behaved\ngame forms and complex objectives.\n  Existing results for positional and finite-memory determinacy in turn-based\ngames are extended this way to concurrent games with determined local\ninteractions (CG-DLI).\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2021 19:35:29 GMT"}], "update_date": "2021-07-12", "authors_parsed": [["Bordais", "Benjamin", ""], ["Bouyer", "Patricia", ""], ["Roux", "Stéphane Le", ""]]}, {"id": "2107.04185", "submitter": "Benjamin Golub", "authors": "Matthew Elliott, Benjamin Golub", "title": "A Network Approach to Public Goods: A Short Summary", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Suppose agents can exert costly effort that creates nonrival, heterogeneous\nbenefits for each other. At each possible outcome, a weighted, directed network\ndescribing marginal externalities is defined. We show that Pareto efficient\noutcomes are those at which the largest eigenvalue of the network is 1. An\nimportant set of efficient solutions, Lindahl outcomes, are characterized by\ncontributions being proportional to agents' eigenvector centralities in the\nnetwork. The outcomes we focus on are motivated by negotiations. We apply the\nresults to identify who is essential for Pareto improvements, how to\nefficiently subdivide negotiations, and whom to optimally add to a team.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2021 03:18:05 GMT"}], "update_date": "2021-07-12", "authors_parsed": [["Elliott", "Matthew", ""], ["Golub", "Benjamin", ""]]}, {"id": "2107.04300", "submitter": "Kristoffer Arnsfelt Hansen", "authors": "Kristoffer Arnsfelt Hansen and Troels Bjerre Lund", "title": "Computational Complexity of Computing a Quasi-Proper Equilibrium", "comments": "Full version of paper to appear at the 23rd International Symposium\n  on Fundamentals of Computation Theory (FCT 2021)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the computational complexity of computing or approximating a\nquasi-proper equilibrium for a given finite extensive form game of perfect\nrecall. We show that the task of computing a symbolic quasi-proper equilibrium\nis $\\mathrm{PPAD}$-complete for two-player games. For the case of zero-sum\ngames we obtain a polynomial time algorithm based on Linear Programming. For\ngeneral $n$-player games we show that computing an approximation of a\nquasi-proper equilibrium is $\\mathrm{FIXP}_a$-complete.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2021 08:22:06 GMT"}], "update_date": "2021-07-12", "authors_parsed": [["Hansen", "Kristoffer Arnsfelt", ""], ["Lund", "Troels Bjerre", ""]]}, {"id": "2107.04368", "submitter": "Michael McKay", "authors": "Michael McKay and David Manlove", "title": "The Three-Dimensional Stable Roommates Problem with Additively Separable\n  Preferences", "comments": "A full version of a paper accepted to the 14th International\n  Symposium on Algorithmic Game Theory (SAGT 2021), with 38 pages (including 2\n  pages of references) and 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Stable Roommates problem involves matching a set of agents into pairs\nbased on the agents' strict ordinal preference lists. The matching must be\nstable, meaning that no two agents strictly prefer each other to their assigned\npartners. A number of three-dimensional variants exist, in which agents are\ninstead matched into triples. Both the original problem and these variants can\nalso be viewed as hedonic games. We formalise a three-dimensional variant using\ngeneral additively separable preferences, in which each agent provides an\ninteger valuation of every other agent. In this variant, we show that a stable\nmatching may not exist and that the related decision problem is NP-complete,\neven when the valuations are binary. In contrast, we show that if the\nvaluations are binary and symmetric then a stable matching must exist and can\nbe found in polynomial time. We also consider the related problem of finding a\nstable matching with maximum utilitarian welfare when valuations are binary and\nsymmetric. We show that this optimisation problem is NP-hard and present a\nnovel 2-approximation algorithm.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2021 11:20:03 GMT"}], "update_date": "2021-07-12", "authors_parsed": [["McKay", "Michael", ""], ["Manlove", "David", ""]]}, {"id": "2107.04393", "submitter": "Nikolaj Ignatieff Schwartzbach", "authors": "Mathias Hall-Andersen and Nikolaj I. Schwartzbach", "title": "Game theory on the blockchain: a model for games with smart contracts", "comments": null, "journal-ref": "SAGT 2021: 14th International Symposium on Algorithmic Game Theory", "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model for games in which the players have shared access to a\nblockchain that allows them to deploy smart contracts to act on their behalf.\nThis changes fundamental game-theoretic assumptions about rationality since a\ncontract can commit a player to act irrationally in specific subgames, making\ncredible otherwise non-credible threats. This is further complicated by\nconsidering the interaction between multiple contracts which can reason about\neach other. This changes the nature of the game in a nontrivial way as choosing\nwhich contract to play can itself be considered a move in the game. Our model\ngeneralizes known notions of equilibria, with a single contract being\nequivalent to a Stackelberg equilibrium, and two contracts being equivalent to\na reverse Stackelberg equilibrium. We prove a number of bounds on the\ncomplexity of computing SPE in such games with smart contracts. We show that\ncomputing an SPE is $\\textsf{PSPACE}$-hard in the general case. Specifically,\nin games with $k$ contracts, we show that computing an SPE is\n$\\Sigma_k^\\textsf{P}$-hard for games of imperfect information. We show that\ncomputing an SPE remains $\\textsf{PSPACE}$-hard in games of perfect information\nif we allow for an unbounded number of contracts. We give an algorithm for\ncomputing an SPE in two-contract games of perfect information that runs in time\n$O(m\\ell)$ where $m$ is the size of the game tree and $\\ell$ is the number of\nterminal nodes. Finally, we conjecture the problem to be $\\textsf{NP}$-complete\nfor three contracts.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2021 12:43:04 GMT"}], "update_date": "2021-07-12", "authors_parsed": [["Hall-Andersen", "Mathias", ""], ["Schwartzbach", "Nikolaj I.", ""]]}, {"id": "2107.04638", "submitter": "Zhe Feng", "authors": "Zhe Feng and S\\'ebastien Lahaie", "title": "Robust Clearing Price Mechanisms for Reserve Price Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Setting an effective reserve price for strategic bidders in repeated auctions\nis a central question in online advertising. In this paper, we investigate how\nto set an anonymous reserve price in repeated auctions based on historical bids\nin a way that balances revenue and incentives to misreport. We propose two\nsimple and computationally efficient methods to set reserve prices based on the\nnotion of a clearing price and make them robust to bidder misreports. The first\napproach adds random noise to the reserve price, drawing on techniques from\ndifferential privacy. The second method applies a smoothing technique by adding\nnoise to the training bids used to compute the reserve price. We provide\ntheoretical guarantees on the trade-offs between the revenue performance and\nbid-shading incentives of these two mechanisms. Finally, we empirically\nevaluate our mechanisms on synthetic data to validate our theoretical findings.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2021 19:20:48 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Feng", "Zhe", ""], ["Lahaie", "Sébastien", ""]]}, {"id": "2107.04679", "submitter": "Jan Bok", "authors": "Jan Bok, Martin \\v{C}ern\\'y", "title": "1-convex extensions of partially defined cooperative games and the\n  average value", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Partially defined cooperative games are a generalisation of classical\ncooperative games in which the worth of some of the coalitions is not known.\nTherefore, they are one of the possible approaches to uncertainty in\ncooperative game theory. The main focus of this paper is the class of 1-convex\ncooperative games under this framework.\n  For incomplete cooperative games with minimal information, we present a\ncompact description of the set of 1-convex extensions employing its extreme\npoints and its extreme rays. Then we investigate generalisations of three\nsolution concepts for complete games, namely the $\\tau$-value, the Shapley\nvalue and the nucleolus. We consider two variants where we compute the centre\nof gravity of either extreme games or of a combination of extreme games and\nextreme rays. We show that all of the generalised values coincide for games\nwith minimal information and we call this solution concept the \\emph{average\nvalue}. Further, we provide three different axiomatisations of the average\nvalue and outline a method to generalise several axiomatisations of the\n$\\tau$-value and the Shapley value into an axiomatisation of the average value.\n  We also briefly mention a similar derivation for incomplete games with\ndefined upper vector and indicate several open questions.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2021 21:04:47 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Bok", "Jan", ""], ["Černý", "Martin", ""]]}, {"id": "2107.04685", "submitter": "Yongjie Yang", "authors": "Yongjie Yang and Jianxin Wang", "title": "Parameterized Complexity of Multi-winner Determination: More Effort\n  Towards Fixed-Parameter Tractability", "comments": "27 pages, 2 figures, AAMAS 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study winner determination for three prevalent $k$-committee selection\nrules, namely minimax approval voting (MAV), proportional approval voting\n(PAV), and Chamberlin-Courant's approval voting (CCAV). It is known that winner\ndetermination for these rules is NP-hard. Parameterized complexity of the\nproblem has been studied with respect to some natural parameters recently.\nHowever, there are still numerous parameters that have not been considered. We\nrevisit the parameterized complexity of winner determination by considering\nseveral important single parameters, combined parameters, and structural\nparameters, aiming at detecting more interesting parameters leading to\nfixed-parameter tractability res\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2021 21:21:18 GMT"}], "update_date": "2021-07-14", "authors_parsed": [["Yang", "Yongjie", ""], ["Wang", "Jianxin", ""]]}, {"id": "2107.04709", "submitter": "Rui Yan", "authors": "Rui Yan, Ruiliang Deng, Haowen Lai, Weixian Zhang, Zongying Shi, and\n  Yisheng Zhong", "title": "Multiplayer Homicidal Chauffeur Reach-Avoid Games via Guaranteed Winning\n  Strategies", "comments": "15 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies a planar multiplayer Homicidal Chauffeur reach-avoid\ndifferential game, where each pursuer is a Dubins car and each evader has\nsimple motion. The pursuers aim to protect a goal region cooperatively from the\nevaders. Due to the high-dimensional strategy space among pursuers, we\ndecompose the whole game into multiple one-pursuer-one-evader subgames, each of\nwhich is solved in an analytical approach instead of solving\nHamilton-Jacobi-Isaacs equations. For each subgame, an evasion region (ER) is\nintroduced, based on which a pursuit strategy guaranteeing the winning of a\nsimple-motion pursuer under specific conditions is proposed. Motivated by the\nsimple-motion pursuer, a strategy for a Dubins-car pursuer is proposed when the\npursuer-evader configuration satisfies separation condition (SC) and\ninterception orientation (IO). The necessary and sufficient condition on\ncapture radius, minimum turning radius and speed ratio to guarantee the pursuit\nwinning is derived. When the IO is not satisfied (Non-IO), a heading adjustment\npursuit strategy is proposed, and the condition to achieve IO within a finite\ntime, is given. Then, a two-step pursuit strategy is proposed for the SC and\nNon-IO case. A non-convex optimization problem is introduced to give a\ncondition guaranteeing the winning of the pursuer. A polynomial equation gives\na lower bound of the non-convex problem, providing a sufficient and efficient\npursuit winning condition. Finally, these pairwise outcomes are collected for\nthe pursuer-evader matching. Simulations are provided to illustrate the\ntheoretical results.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jul 2021 22:54:05 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Yan", "Rui", ""], ["Deng", "Ruiliang", ""], ["Lai", "Haowen", ""], ["Zhang", "Weixian", ""], ["Shi", "Zongying", ""], ["Zhong", "Yisheng", ""]]}, {"id": "2107.04754", "submitter": "Aleck Johnsen", "authors": "Jason Hartline and Aleck Johnsen", "title": "Lower Bounds for Prior Independent Algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The prior independent framework for algorithm design considers how well an\nalgorithm that does not know the distribution of its inputs approximates the\nexpected performance of the optimal algorithm for this distribution. This paper\ngives a method that is agnostic to problem setting for proving lower bounds on\nthe prior independent approximation factor of any algorithm. The method\nconstructs a correlated distribution over inputs that can be generated both as\na distribution over i.i.d. good-for-algorithms distributions and as a\ndistribution over i.i.d. bad-for-algorithms distributions. Prior independent\nalgorithms are upper-bounded by the optimal algorithm for the latter\ndistribution even when the true distribution is the former. Thus, the ratio of\nthe expected performances of the Bayesian optimal algorithms for these two\ndecompositions is a lower bound on the prior independent approximation ratio.\nThe techniques of the paper connect prior independent algorithm design, Yao's\nMinimax Principle, and information design. We apply this framework to give new\nlower bounds on several canonical prior independent mechanism design problems.\n", "versions": [{"version": "v1", "created": "Sat, 10 Jul 2021 04:03:08 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Hartline", "Jason", ""], ["Johnsen", "Aleck", ""]]}, {"id": "2107.05051", "submitter": "Maximilian Fichtl", "authors": "Maximilian Fichtl", "title": "On the Expressiveness of Assignment Messages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this note we prove that the class of valuation functions representable via\nintegral assignment messages is a proper subset of strong substitutes\nvaluations. Thus, there are strong substitutes valuations not expressible via\nassignment messages.\n", "versions": [{"version": "v1", "created": "Sun, 11 Jul 2021 13:52:19 GMT"}, {"version": "v2", "created": "Thu, 15 Jul 2021 10:44:46 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Fichtl", "Maximilian", ""]]}, {"id": "2107.05131", "submitter": "Krist\\'of B\\'erczi", "authors": "Krist\\'of B\\'erczi, Erika R. B\\'erczi-Kov\\'acs, Evelin Sz\\\"ogi", "title": "A dual approach for dynamic pricing in multi-demand markets", "comments": "16 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Dynamic pricing schemes were introduced as an alternative to posted-price\nmechanisms. In contrast to static models, the dynamic setting allows to update\nthe prices between buyer-arrivals based on the remaining sets of items and\nbuyers, and so it is capable of maximizing social welfare without the need for\na central coordinator. In this paper, we study the existence of optimal dynamic\npricing schemes in combinatorial markets. In particular, we concentrate on\nmulti-demand valuations, a natural extension of unit-demand valuations. The\nproposed approach is based on computing an optimal dual solution of the maximum\nsocial welfare problem with distinguished structural properties.\n  Our contribution is twofold. By relying on an optimal dual solution, we show\nthe existence of optimal dynamic prices in unit-demand markets and in\nmulti-demand markets up to three buyers, thus giving new interpretations of\nresults of Cohen-Addad et al. and Berger et al. , respectively. Furthermore, we\nprovide an optimal dynamic pricing scheme for bi-demand valuations with an\narbitrary number of buyers. In all cases, our proofs also provide efficient\nalgorithms for determining the optimal dynamic prices.\n", "versions": [{"version": "v1", "created": "Sun, 11 Jul 2021 21:17:44 GMT"}, {"version": "v2", "created": "Thu, 15 Jul 2021 16:15:11 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Bérczi", "Kristóf", ""], ["Bérczi-Kovács", "Erika R.", ""], ["Szögi", "Evelin", ""]]}, {"id": "2107.05138", "submitter": "S. Rasoul Etesami", "authors": "S. Rasoul Etesami", "title": "Open-Loop Equilibrium Strategies for Dynamic Influence Maximization Game\n  Over Social Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA cs.SY eess.SY math.OC", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We consider the problem of budget allocation for competitive influence\nmaximization over social networks. In this problem, multiple competing parties\n(players) want to distribute their limited advertising resources over a set of\nsocial individuals to maximize their long-run cumulative payoffs. It is assumed\nthat the individuals are connected via a social network and update their\nopinions based on the classical DeGroot model. The players must decide the\nbudget distribution among the individuals at a finite number of campaign times\nto maximize their overall payoff given as a function of individuals' opinions.\nWe show that i) the optimal investment strategy for the case of a single-player\ncan be found in polynomial time by solving a concave program, and ii) the\nopen-loop equilibrium strategies for the multiplayer dynamic game can be\ncomputed efficiently by following natural regret minimization dynamics. Our\nresults extend the earlier work on the static version of the problem to a\ndynamic multistage game.\n", "versions": [{"version": "v1", "created": "Sun, 11 Jul 2021 22:31:08 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Etesami", "S. Rasoul", ""]]}, {"id": "2107.05175", "submitter": "Hoyu Zhou", "authors": "Houyu Zhou, Minming Li and Hau Chan", "title": "Strategyproof Mechanisms For Group-Fair Facility Location Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the societal need to provide fair accessibility or\nrepresentation among groups of agents, we study the group-fair facility\nlocation problems where agents are divided into groups based on criteria such\nas race, gender, or age. The agents are located on a real line, modeling\nagents' private ideal preferences/points for the facility's location (e.g., a\npublic school or representative). Our aim is to design mechanisms to locate a\nfacility to (approximately) minimize the costs of groups of agents to the\nfacility fairly while eliciting the agents' private locations truthfully. We\nfirst introduce various well-motivated group-fair cost objectives and show that\nmany natural objectives have an unbounded approximation ratio. We then consider\nthe objectives of minimizing the maximum total group cost and minimizing the\naverage group cost. For the first objective, we show that the approximation\nratio of the median mechanism depends on the number of groups and provide a new\ngroup-based mechanism with an approximation ratio of 3. For the second\nobjective, the median mechanism obtains a ratio of 3, and we propose a\nrandomized mechanism that obtains a better approximation ratio. We also provide\nlower bounds for both objectives. We then study the notion of intergroup and\nintragroup fairness that measures fairness between groups and within each\ngroup. We consider various objectives and provide mechanisms with tight\napproximation ratios.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2021 03:30:30 GMT"}, {"version": "v2", "created": "Mon, 19 Jul 2021 09:24:52 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Zhou", "Houyu", ""], ["Li", "Minming", ""], ["Chan", "Hau", ""]]}, {"id": "2107.05302", "submitter": "Burak Can", "authors": "Burak Can, Jens Leth Hougaard, Mohsen Pourpouneh", "title": "On Reward Sharing in Blockchain Mining Pools", "comments": null, "journal-ref": null, "doi": "10.26481/umagsb.2021009", "report-no": null, "categories": "cs.GT econ.TH", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper proposes a conceptual framework for the analysis of reward sharing\nschemes in mining pools, such as those associated with Bitcoin. The framework\nis centered around the reported shares in a pool instead of agents and results\nin two new fairness criteria, absolute and relative redistribution. These\ncriteria impose that the addition of a share to the pool affects all previous\nshares in the same way, either in absolute amount or in relative ratio. We\ncharacterize two large classes of economically viable reward sharing schemes\ncorresponding to each of these fairness criteria in turn. We further show that\nthe intersection of these classes brings about a generalization of the\nwell-known proportional scheme, which also leads to a new characterization of\nthe proportional scheme as a corollary.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2021 10:25:23 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Can", "Burak", ""], ["Hougaard", "Jens Leth", ""], ["Pourpouneh", "Mohsen", ""]]}, {"id": "2107.05456", "submitter": "Alexandros A. Voudouris", "authors": "Elliot Anshelevich, Aris Filos-Ratsikas, Alexandros A. Voudouris", "title": "The Distortion of Distributed Metric Social Choice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a social choice setting with agents that are partitioned into\ndisjoint groups, and have metric preferences over a set of alternatives. Our\ngoal is to choose a single alternative aiming to optimize various objectives\nthat are functions of the distances between agents and alternatives in the\nmetric space, under the constraint that this choice must be made in a\ndistributed way: The preferences of the agents within each group are first\naggregated into a representative alternative for the group, and then these\ngroup representatives are aggregated into the final winner. Deciding the winner\nin such a way naturally leads to loss of efficiency, even when complete\ninformation about the metric space is available. We provide a series of (mostly\ntight) bounds on the distortion of distributed mechanisms for variations of\nwell-known objectives, such as the (average) total cost and the maximum cost,\nand also for new objectives that are particularly appropriate for this\ndistributed setting and have not been studied before.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2021 14:27:57 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Anshelevich", "Elliot", ""], ["Filos-Ratsikas", "Aris", ""], ["Voudouris", "Alexandros A.", ""]]}, {"id": "2107.05690", "submitter": "Zihan Tan", "authors": "Zihan Tan, Yifeng Teng, Mingfei Zhao", "title": "Worst-Case Welfare of Item Pricing in the Tollbooth Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study the worst-case welfare of item pricing in the tollbooth problem. The\nproblem was first introduced by Guruswami et al, and is a special case of the\ncombinatorial auction in which (i) each of the $m$ items in the auction is an\nedge of some underlying graph; and (ii) each of the $n$ buyers is single-minded\nand only interested in buying all edges of a single path. We consider the\ncompetitive ratio between the hindsight optimal welfare and the optimal\nworst-case welfare among all item-pricing mechanisms, when the order of the\narriving buyers is adversarial. On the one hand, we prove an $\\Omega(m^{1/8})$\nlower bound of the competitive ratio for general graphs. We show that an\n$m^{\\Omega(1)}$ competitive ratio is unavoidable even if the graph is a grid,\nor if the capacity of every edge is augmented by a constant $c$. On the other\nhand, we study the competitive ratio for special families of graphs. In\nparticular, we improve the ratio when the input graph $G$ is a tree, from 8\n(proved by Cheung and Swamy) to 3. We prove that the ratio is $2$ (tight) when\n$G$ is a cycle and $O(\\log^2 m)$ when $G$ is an outerplanar graph.\n  All positive results above require that the seller can choose a proper\ntie-breaking rule to maximize the welfare. In the paper we also consider the\nsetting where the tie-breaking power is on the buyers' side, i.e. the buyer can\nchoose whether or not to buy her demand path when the total price of edges in\nthe path equals her value. We show that the gap between the two settings is at\nleast a constant even when the underlying graph is a single path (this special\ncase is also known as the highway problem). Meanwhile, in this setting where\nbuyers have the tie-breaking power, we also prove an $O(1)$ upper bound of\ncompetitive ratio for special families of graphs.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2021 19:02:19 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Tan", "Zihan", ""], ["Teng", "Yifeng", ""], ["Zhao", "Mingfei", ""]]}, {"id": "2107.05700", "submitter": "Yixin Tao", "authors": "Jugal Garg, Yixin Tao, L\\'aszl\\'o A. V\\'egh", "title": "Approximating Equilibrium under Constrained Piecewise Linear Concave\n  Utilities with Applications to Matching Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We study the equilibrium computation problem in the Fisher market model with\nconstrained piecewise linear concave (PLC) utilities. This general class\ncaptures many well-studied special cases, including markets with PLC utilities,\nmarkets with satiation, and matching markets. For the special case of PLC\nutilities, although the problem is PPAD-hard, Devanur and Kannan (FOCS 2008)\ngave a polynomial-time algorithm when the number of items is constant. Our main\nresult is a fixed parameter approximation scheme for computing an approximate\nequilibrium, where the parameters are the number of agents and the\napproximation accuracy. This provides an answer to an open question by Devanur\nand Kannan for PLC utilities, and gives a simpler and faster algorithm for\nmatching markets as the one by Alaei, Jalaly and Tardos (EC 2017).\n  The main technical idea is to work with the stronger concept of thrifty\nequilibria, and approximating the input utility functions by `robust' utilities\nthat have favorable marginal properties. With some restrictions, the results\nalso extend to the Arrow--Debreu exchange market model.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2021 19:35:49 GMT"}], "update_date": "2021-07-14", "authors_parsed": [["Garg", "Jugal", ""], ["Tao", "Yixin", ""], ["Végh", "László A.", ""]]}, {"id": "2107.05746", "submitter": "Binghui Peng", "authors": "Thomas Chen, Xi Chen, Binghui Peng, Mihalis Yannakakis", "title": "Computational Hardness of the Hylland-Zeckhauser Scheme", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study the complexity of the classic Hylland-Zeckhauser scheme [HZ'79] for\none-sided matching markets. We show that the problem of finding an\n$\\epsilon$-approximate equilibrium in the HZ scheme is PPAD-hard, and this\nholds even when $\\epsilon$ is polynomially small and when each agent has no\nmore than four distinct utility values. Our hardness result, when combined with\nthe PPAD membership result of [VY'21], resolves the approximation complexity of\nthe HZ scheme. We also show that the problem of approximating the optimal\nsocial welfare (the weight of the matching) achievable by HZ equilibria within\na certain constant factor is NP-hard.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2021 21:31:28 GMT"}], "update_date": "2021-07-14", "authors_parsed": [["Chen", "Thomas", ""], ["Chen", "Xi", ""], ["Peng", "Binghui", ""], ["Yannakakis", "Mihalis", ""]]}, {"id": "2107.05853", "submitter": "Yingkai Li", "authors": "Moshe Babaioff, Nicole Immorlica, Yingkai Li, Brendan Lucier", "title": "On the Impact of Information Acquisition and Aftermarkets on Auction\n  Efficiency", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A common assumption in auction theory is that the information available to\nthe agents is given exogenously and that the auctioneer has full control over\nthe market. In practice, agents might be able to acquire information about\ntheir competitors before the auction (by exerting some costly effort), and\nmight be able to resell acquired items in an aftermarket. The auctioneer has no\ncontrol over those aspects, yet their existence influences agents' strategic\nbehavior and the overall equilibrium welfare can strictly decrease as a result.\n  We show that if an auction is smooth (e.g., first-price auction, all-pay\nauction), then the corresponding price of anarchy bound due to smoothness\ncontinues to hold in any environment with (a) information acquisition on\nopponents' valuations, and/or (b) an aftermarket satisfying two mild conditions\n(voluntary participation and weak budget balance). We also consider the special\ncase with two ex ante symmetric bidders, where the first-price auction is known\nto be efficient in isolation. We show that information acquisition can lead to\nefficiency loss in this environment, but aftermarkets do not: any equilibrium\nof a first-price or all-pay auction combined with an aftermarket is still\nefficient.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 05:19:34 GMT"}], "update_date": "2021-07-14", "authors_parsed": [["Babaioff", "Moshe", ""], ["Immorlica", "Nicole", ""], ["Li", "Yingkai", ""], ["Lucier", "Brendan", ""]]}, {"id": "2107.06259", "submitter": "Wenshuo Guo", "authors": "Wenshuo Guo, Michael I. Jordan, Manolis Zampetakis", "title": "Robust Learning of Optimal Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of learning revenue-optimal multi-bidder auctions from\nsamples when the samples of bidders' valuations can be adversarially corrupted\nor drawn from distributions that are adversarially perturbed. First, we prove\ntight upper bounds on the revenue we can obtain with a corrupted distribution\nunder a population model, for both regular valuation distributions and\ndistributions with monotone hazard rate (MHR). We then propose new algorithms\nthat, given only an ``approximate distribution'' for the bidder's valuation,\ncan learn a mechanism whose revenue is nearly optimal simultaneously for all\n``true distributions'' that are $\\alpha$-close to the original distribution in\nKolmogorov-Smirnov distance. The proposed algorithms operate beyond the setting\nof bounded distributions that have been studied in prior works, and are\nguaranteed to obtain a fraction $1-O(\\alpha)$ of the optimal revenue under the\ntrue distribution when the distributions are MHR. Moreover, they are guaranteed\nto yield at least a fraction $1-O(\\sqrt{\\alpha})$ of the optimal revenue when\nthe distributions are regular. We prove that these upper bounds cannot be\nfurther improved, by providing matching lower bounds. Lastly, we derive sample\ncomplexity upper bounds for learning a near-optimal auction for both MHR and\nregular distributions.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 17:37:21 GMT"}], "update_date": "2021-07-14", "authors_parsed": [["Guo", "Wenshuo", ""], ["Jordan", "Michael I.", ""], ["Zampetakis", "Manolis", ""]]}, {"id": "2107.06312", "submitter": "Marco Scarsini", "authors": "Frederic Koessler, Marco Scarsini, and Tristan Tomala", "title": "Information Design in Large Games", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define the notion of Bayes correlated Wardrop equilibrium for general\nnonatomic games with anonymous players and incomplete information. Bayes\ncorrelated Wardrop equilibria describe the set of equilibrium outcomes when a\nmediator, such as a traffic information system, provides information to the\nplayers. We relate this notion to Bayes Wardrop equilibrium. Then, we provide\nconditions -- existence of a convex potential and complete information -- under\nwhich mediation does not improve equilibrium outcomes. We then study full\nimplementation and, finally, information design in anonymous games with a\nfinite set of players, when the number of players tends to infinity.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 18:13:40 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Koessler", "Frederic", ""], ["Scarsini", "Marco", ""], ["Tomala", "Tristan", ""]]}, {"id": "2107.06327", "submitter": "Pier Giuseppe Sessa", "authors": "Pier Giuseppe Sessa, Ilija Bogunovic, Andreas Krause, Maryam\n  Kamgarpour", "title": "Contextual Games: Multi-Agent Learning with Side Information", "comments": null, "journal-ref": "Proc. of Neural Information Processing Systems (NeurIPS), 2020", "doi": null, "report-no": null, "categories": "cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We formulate the novel class of contextual games, a type of repeated games\ndriven by contextual information at each round. By means of kernel-based\nregularity assumptions, we model the correlation between different contexts and\ngame outcomes and propose a novel online (meta) algorithm that exploits such\ncorrelations to minimize the contextual regret of individual players. We define\ngame-theoretic notions of contextual Coarse Correlated Equilibria (c-CCE) and\noptimal contextual welfare for this new class of games and show that c-CCEs and\noptimal welfare can be approached whenever players' contextual regrets vanish.\nFinally, we empirically validate our results in a traffic routing experiment,\nwhere our algorithm leads to better performance and higher welfare compared to\nbaselines that do not exploit the available contextual information or the\ncorrelations present in the game.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 18:37:37 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Sessa", "Pier Giuseppe", ""], ["Bogunovic", "Ilija", ""], ["Krause", "Andreas", ""], ["Kamgarpour", "Maryam", ""]]}, {"id": "2107.06331", "submitter": "Rahul Chandan", "authors": "Rahul Chandan, Dario Paccagnan and Jason R. Marden", "title": "The Anarchy-Stability Tradeoff in Congestion Games", "comments": "27 pages, 1 figure, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work focuses on the design of incentive mechanisms in congestion games,\na commonly studied model for competitive resource sharing. While the majority\nof the existing literature on this topic focuses on unilaterally optimizing the\nworst case performance (i.e., price of anarchy), in this manuscript we\ninvestigate whether optimizing for the worst case has consequences on the best\ncase performance (i.e., price of stability). Perhaps surprisingly, our results\nshow that there is a fundamental tradeoff between these two measures of\nperformance. Our main result provides a characterization of this tradeoff in\nterms of upper and lower bounds on the Pareto frontier between the price of\nanarchy and the price of stability. Interestingly, we demonstrate that the\nmechanism that optimizes the price of anarchy inherits a matching price of\nstability, thereby implying that the best equilibrium is not necessarily any\nbetter than the worst equilibrium for such a design choice. Our results also\nestablish that, in several well-studied cases, the unincentivized setting does\nnot even lie on the Pareto frontier, and that any incentive with price of\nstability equal to 1 incurs a much higher price of anarchy.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 18:51:46 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Chandan", "Rahul", ""], ["Paccagnan", "Dario", ""], ["Marden", "Jason R.", ""]]}, {"id": "2107.06362", "submitter": "Omri Ben-Eliezer", "authors": "Omri Ben-Eliezer and Elchanan Mossel and Madhu Sudan", "title": "Information Spread with Error Correction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.GT cs.MA math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the process of information dispersal in a network with communication\nerrors and local error-correction. Specifically we consider a simple model\nwhere a single bit of information initially known to a single source is\ndispersed through the network, and communication errors lead to differences in\nthe agents' opinions on this information.\n  Naturally, such errors can very quickly make the communication completely\nunreliable, and in this work we study to what extent this unreliability can be\nmitigated by local error-correction, where nodes periodically correct their\nopinion based on the opinion of (some subset of) their neighbors. We analyze\nhow the error spreads in the \"early stages\" of information dispersal by\nmonitoring the average opinion, i.e., the fraction of agents that have the\ncorrect information among all nodes that hold an opinion at a given time. Our\nmain results show that even with significant effort in error-correction, tiny\namounts of noise can lead the average opinion to be nearly uncorrelated with\nthe truth in early stages. We also propose some local methods to help agents\ngauge when the information they have has stabilized.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 19:58:18 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Ben-Eliezer", "Omri", ""], ["Mossel", "Elchanan", ""], ["Sudan", "Madhu", ""]]}, {"id": "2107.06435", "submitter": "Lirong Xia", "authors": "Lirong Xia", "title": "A Smoothed Impossibility Theorem on Condorcet Criterion and\n  Participation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 1988, Moulin proved an insightful and surprising impossibility theorem\nthat reveals a fundamental incompatibility between two commonly-studied axioms\nof voting: no resolute voting rule (which outputs a single winner) satisfies\nCondorcet Criterion and Participation simultaneously when the number of\nalternatives m is at least four. In this paper, we prove an extension of this\nimpossibility theorem using smoothed analysis: for any fixed $m\\ge 4$ and any\nvoting rule r, under mild conditions, the smoothed likelihood for both\nCondorcet Criterion and Participation to be satisfied is at most\n$1-\\Omega(n^{-3})$, where n is the number of voters that is sufficiently large.\nOur theorem immediately implies a quantitative version of the theorem for\ni.i.d. uniform distributions, known as the Impartial Culture in social choice\ntheory.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jul 2021 00:39:33 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Xia", "Lirong", ""]]}, {"id": "2107.06623", "submitter": "Panagiotis Kanellopoulos", "authors": "Panagiotis Kanellopoulos, Maria Kyropoulou, Hao Zhou", "title": "Financial Network Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CE q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study financial systems from a game-theoretic standpoint. A financial\nsystem is represented by a network, where nodes correspond to firms, and\ndirected labeled edges correspond to debt contracts between them. The existence\nof cycles in the network indicates that a payment of a firm to one of its\nlenders might result to some incoming payment. So, if a firm cannot fully repay\nits debt, then the exact (partial) payments it makes to each of its creditors\ncan affect the cash inflow back to itself. We naturally assume that the firms\nare interested in their financial well-being (utility) which is aligned with\nthe amount of incoming payments they receive from the network. This defines a\ngame among the firms, that can be seen as utility-maximizing agents who can\nstrategize over their payments.\n  We are the first to study financial network games that arise under a natural\nset of payment strategies called priority-proportional payments. We investigate\nthe existence and (in)efficiency of equilibrium strategies, under different\nassumptions on how the firms' utility is defined, on the types of debt\ncontracts allowed between the firms, and on the presence of other financial\nfeatures that commonly arise in practice. Surprisingly, even if all firms'\nstrategies are fixed, the existence of a unique payment profile is not\nguaranteed. So, we also investigate the existence and computation of valid\npayment profiles for fixed payment strategies.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jul 2021 11:50:54 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Kanellopoulos", "Panagiotis", ""], ["Kyropoulou", "Maria", ""], ["Zhou", "Hao", ""]]}, {"id": "2107.06649", "submitter": "Shant Boodaghians", "authors": "Shant Boodaghians, Bhaskar Ray Chaudhury, Ruta Mehta", "title": "Polynomial Time Algorithms to Find an Approximate Competitive\n  Equilibrium for Chores", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Competitive equilibrium with equal income (CEEI) is considered one of the\nbest mechanisms to allocate a set of items among agents fairly and efficiently.\nIn this paper, we study the computation of CEEI when items are chores that are\ndisliked (negatively valued) by agents, under 1-homogeneous and concave utility\nfunctions which includes linear functions as a subcase. It is well-known that,\neven with linear utilities, the set of CEEI may be non-convex and disconnected,\nand the problem is PPAD-hard in the more general exchange model. In contrast to\nthese negative results, we design FPTAS: A polynomial-time algorithm to compute\n$\\epsilon$-approximate CEEI where the running-time depends polynomially on\n$1/\\epsilon$.\n  Our algorithm relies on the recent characterization due to Bogomolnaia et\nal.~(2017) of the CEEI set as exactly the KKT points of a non-convex\nminimization problem that have all coordinates non-zero. Due to this non-zero\nconstraint, naive gradient-based methods fail to find the desired local minima\nas they are attracted towards zero. We develop an exterior-point method that\nalternates between guessing non-zero KKT points and maximizing the objective\nalong supporting hyperplanes at these points. We show that this procedure must\nconverge quickly to an approximate KKT point which then can be mapped to an\napproximate CEEI; this exterior point method may be of independent interest.\nWhen utility functions are linear, we give explicit procedures for finding the\nexact iterates, and as a result show that a stronger form of approximate CEEI\ncan be found in polynomial time. Finally, we note that our algorithm extends to\nthe setting of un-equal incomes (CE), and to mixed manna with linear utilities\nwhere each agent may like (positively value) some items and dislike (negatively\nvalue) others.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2021 22:15:31 GMT"}, {"version": "v2", "created": "Sat, 17 Jul 2021 14:06:35 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Boodaghians", "Shant", ""], ["Chaudhury", "Bhaskar Ray", ""], ["Mehta", "Ruta", ""]]}, {"id": "2107.06650", "submitter": "Tian Zhou", "authors": "Tian Zhou, Hao He, Shengjun Pan, Niklas Karlsson, Bharatbhushan\n  Shetty, Brendan Kitts, Djordje Gligorijevic, San Gultekin, Tingyu Mao, Junwei\n  Pan, Jianlong Zhang and Aaron Flores", "title": "An Efficient Deep Distribution Network for Bid Shading in First-Price\n  Auctions", "comments": "In Proceedings of the 27th ACM SIGKDD Conference on Knowledge\n  Discovery and Data Mining (KDD'21), August 14-18, 2021, Singapore", "journal-ref": null, "doi": "10.1145/3447548.3467167", "report-no": null, "categories": "cs.GT cs.LG stat.ML", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Since 2019, most ad exchanges and sell-side platforms (SSPs), in the online\nadvertising industry, shifted from second to first price auctions. Due to the\nfundamental difference between these auctions, demand-side platforms (DSPs)\nhave had to update their bidding strategies to avoid bidding unnecessarily high\nand hence overpaying. Bid shading was proposed to adjust the bid price intended\nfor second-price auctions, in order to balance cost and winning probability in\na first-price auction setup. In this study, we introduce a novel deep\ndistribution network for optimal bidding in both open (non-censored) and closed\n(censored) online first-price auctions. Offline and online A/B testing results\nshow that our algorithm outperforms previous state-of-art algorithms in terms\nof both surplus and effective cost per action (eCPX) metrics. Furthermore, the\nalgorithm is optimized in run-time and has been deployed into VerizonMedia DSP\nas production algorithm, serving hundreds of billions of bid requests per day.\nOnline A/B test shows that advertiser's ROI are improved by +2.4%, +2.4%, and\n+8.6% for impression based (CPM), click based (CPC), and conversion based (CPA)\ncampaigns respectively.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jul 2021 22:44:39 GMT"}, {"version": "v2", "created": "Thu, 15 Jul 2021 17:24:42 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Zhou", "Tian", ""], ["He", "Hao", ""], ["Pan", "Shengjun", ""], ["Karlsson", "Niklas", ""], ["Shetty", "Bharatbhushan", ""], ["Kitts", "Brendan", ""], ["Gligorijevic", "Djordje", ""], ["Gultekin", "San", ""], ["Mao", "Tingyu", ""], ["Pan", "Junwei", ""], ["Zhang", "Jianlong", ""], ["Flores", "Aaron", ""]]}, {"id": "2107.06667", "submitter": "Elena Sartori", "authors": "Dai Pra Paolo, Sartori Elena, Tolotti Marco", "title": "Polarization and coherence in mean field games driven by private and\n  social utility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.PR", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We study a mean field game in continuous time over a finite horizon, T, where\nthe state of each agent is binary and where players base their strategic\ndecisions on two, possibly competing, factors: the willingness to align with\nthe majority (conformism) and the aspiration of sticking with the own type\n(stubbornness). We also consider a quadratic cost related to the rate at which\na change in the state happens: changing opinion may be a costly operation.\nDepending on the parameters of the model, the game may have more than one Nash\nequilibrium, even though the corresponding N-player game does not. Moreover, it\nexhibits a very rich phase diagram, where polarized/unpolarized,\ncoherent/incoherent equilibria may coexist, except for T small, where the\nequilibrium is always unique. We fully describe such phase diagram in closed\nform and provide a detailed numerical analysis of the N-player counterpart of\nthe mean field game. In this finite dimensional setting, the equilibrium\nselected by the population of players is always coherent (favoring the\nsubpopulation whose type is aligned with the initial condition), but it does\nnot necessarily minimize the cost functional. Rather, it seems that, among the\ncoherent ones, the equilibrium prevailing is the one that most benefits the\nunderdog subpopulation forced to change opinion.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 15:13:09 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Paolo", "Dai Pra", ""], ["Elena", "Sartori", ""], ["Marco", "Tolotti", ""]]}, {"id": "2107.06961", "submitter": "Edin Husic", "authors": "Edin Husi\\'c, Georg Loho, Ben Smith, L\\'aszl\\'o A. V\\'egh", "title": "On complete classes of valuated matroids", "comments": "53 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.GT math.OC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We characterize a rich class of valuated matroids, called R-minor valuated\nmatroids that includes the indicator functions of matroids, and is closed under\noperations such as taking minors, duality, and induction by network. We refute\nthe refinement of a 2003 conjecture by Frank, exhibiting valuated matroids that\nare not R-minor. The family of counterexamples is based on sparse paving\nmatroids. Valuated matroids are inherently related to gross substitute\nvaluations in mathematical economics. By the same token we refute the Matroid\nBased Valuation Conjecture by Ostrovsky and Paes Leme (Theoretical Economics\n2015) asserting that every gross substitute valuation arises from weighted\nmatroid rank functions by repeated applications of merge and endowment\noperations. Our result also has implications in the context of Lorentzian\npolynomials: it reveals the limitations of known construction operations.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jul 2021 19:47:19 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Husić", "Edin", ""], ["Loho", "Georg", ""], ["Smith", "Ben", ""], ["Végh", "László A.", ""]]}, {"id": "2107.06980", "submitter": "Yifeng Teng", "authors": "Melika Abolhassani, Hossein Esfandiari, Yasamin Nazari,\n  Balasubramanian Sivan, Yifeng Teng, Creighton Thomas", "title": "Online Allocation and Display Ads Optimization with Surplus Supply", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this work, we study a scenario where a publisher seeks to maximize its\ntotal revenue across two sales channels: guaranteed contracts that promise to\ndeliver a certain number of impressions to the advertisers, and spot demands\nthrough an Ad Exchange. On the one hand, if a guaranteed contract is not fully\ndelivered, it incurs a penalty for the publisher. On the other hand, the\npublisher might be able to sell an impression at a high price in the Ad\nExchange. How does a publisher maximize its total revenue as a sum of the\nrevenue from the Ad Exchange and the loss from the under-delivery penalty? We\nstudy this problem parameterized by \\emph{supply factor $f$}: a notion we\nintroduce that, intuitively, captures the number of times a publisher can\nsatisfy all its guaranteed contracts given its inventory supply. In this work\nwe present a fast simple deterministic algorithm with the optimal competitive\nratio. The algorithm and the optimal competitive ratio are a function of the\nsupply factor, penalty, and the distribution of the bids in the Ad Exchange.\n  Beyond the yield optimization problem, classic online allocation problems\nsuch as online bipartite matching of [Karp-Vazirani-Vazirani '90] and its\nvertex-weighted variant of [Aggarwal et al. '11] can be studied in the presence\nof the additional supply guaranteed by the supply factor. We show that a supply\nfactor of $f$ improves the approximation factors from $1-1/e$ to $f-fe^{-1/f}$.\nOur approximation factor is tight and approaches $1$ as $f \\to \\infty$.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jul 2021 20:32:14 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Abolhassani", "Melika", ""], ["Esfandiari", "Hossein", ""], ["Nazari", "Yasamin", ""], ["Sivan", "Balasubramanian", ""], ["Teng", "Yifeng", ""], ["Thomas", "Creighton", ""]]}, {"id": "2107.07083", "submitter": "Nikhil Garg", "authors": "Nikhil Garg, Wes Gurnee, David Rothschild, and David Shmoys", "title": "Combatting Gerrymandering with Social Choice: the Design of Multi-member\n  Districts", "comments": "24 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Every representative democracy must specify a mechanism under which voters\nchoose their representatives. The most common mechanism in the United States --\nwinner-take-all single-member districts -- both enables substantial partisan\ngerrymandering and constrains `fair' redistricting, preventing proportional\nrepresentation in legislatures. We study the design of \\textit{multi-member\ndistricts (MMDs)}, in which each district elects multiple representatives,\npotentially through a non-winner-takes-all voting rule. We carry out\nlarge-scale analyses for the U.S. House of Representatives under MMDs with\ndifferent social choice functions, under algorithmically generated maps\noptimized for either partisan benefit or proportionality. Doing so requires\nefficiently incorporating predicted partisan outcomes -- under various\nmulti-winner social choice functions -- into an algorithm that optimizes over\nan ensemble of maps. We find that with three-member districts using Single\nTransferable Vote, fairness-minded independent commissions would be able to\nachieve proportional outcomes in every state up to rounding, \\textit{and}\nadvantage-seeking partisans would have their power to gerrymander significantly\ncurtailed. Simultaneously, such districts would preserve geographic cohesion,\nan arguably important aspect of representative democracies. In the process, we\nopen up a rich research agenda at the intersection of social choice and\ncomputational redistricting.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jul 2021 02:29:46 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Garg", "Nikhil", ""], ["Gurnee", "Wes", ""], ["Rothschild", "David", ""], ["Shmoys", "David", ""]]}, {"id": "2107.07356", "submitter": "Kunal Relia", "authors": "Kunal Relia", "title": "DiRe Committee : Diversity and Representation Constraints in Multiwinner\n  Elections", "comments": "30 pages, 8 figures, 2 tables, 4 algorithms", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.CY", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  The study of fairness in multiwinner elections focuses on settings where\ncandidates have attributes. However, voters may also be divided into predefined\npopulations under one or more attributes (e.g., \"California\" and \"Illinois\"\npopulations under the \"state\" attribute), which may be same or different from\ncandidate attributes. The models that focus on candidate attributes alone may\nsystematically under-represent smaller voter populations. Hence, we develop a\nmodel, DiRe Committee Winner Determination (DRCWD), which delineates candidate\nand voter attributes to select a committee by specifying diversity and\nrepresentation constraints and a voting rule. We show the generalizability of\nour model, and analyze its computational complexity, inapproximability, and\nparameterized complexity. We develop a heuristic-based algorithm, which finds\nthe winning DiRe committee in under two minutes on 63% of the instances of\nsynthetic datasets and on 100% of instances of real-world datasets. We present\nan empirical analysis of the running time, feasibility, and utility traded-off.\n  Overall, DRCWD motivates that a study of multiwinner elections should\nconsider both its actors, namely candidates and voters, as candidate-specific\n\"fair\" models can unknowingly harm voter populations, and vice versa.\nAdditionally, even when the attributes of candidates and voters coincide, it is\nimportant to treat them separately as having a female candidate on the\ncommittee, for example, is different from having a candidate on the committee\nwho is preferred by the female voters, and who themselves may or may not be\nfemale.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jul 2021 14:32:56 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Relia", "Kunal", ""]]}, {"id": "2107.07404", "submitter": "Evi Micha", "authors": "Rupert Freeman, Evi Micha and Nisarg Shah", "title": "Two-Sided Matching Meets Fair Division", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We introduce a new model for two-sided matching which allows us to borrow\npopular fairness notions from the fair division literature such as\nenvy-freeness up to one good and maximin share guarantee. In our model, each\nagent is matched to multiple agents on the other side over whom she has\nadditive preferences. We demand fairness for each side separately, giving rise\nto notions such as double envy-freeness up to one match (DEF1) and double\nmaximin share guarantee (DMMS). We show that (a slight strengthening of) DEF1\ncannot always be achieved, but in the special case where both sides have\nidentical preferences, the round-robin algorithm with a carefully designed\nagent ordering achieves it. In contrast, DMMS cannot be achieved even when both\nsides have identical preferences.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jul 2021 15:45:17 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Freeman", "Rupert", ""], ["Micha", "Evi", ""], ["Shah", "Nisarg", ""]]}, {"id": "2107.07420", "submitter": "Fang-Yi Yu", "authors": "Yiling Chen and Fang-Yi Yu", "title": "Optimal Scoring Rule Design", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG math.ST stat.TH", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper introduces an optimization problem for proper scoring rule design.\nConsider a principal who wants to collect an agent's prediction about an\nunknown state. The agent can either report his prior prediction or access a\ncostly signal and report the posterior prediction. Given a collection of\npossible distributions containing the agent's posterior prediction\ndistribution, the principal's objective is to design a bounded scoring rule to\nmaximize the agent's worst-case payoff increment between reporting his\nposterior prediction and reporting his prior prediction.\n  We study two settings of such optimization for proper scoring rules: static\nand asymptotic settings. In the static setting, where the agent can access one\nsignal, we propose an efficient algorithm to compute an optimal scoring rule\nwhen the collection of distributions is finite. The agent can adaptively and\nindefinitely refine his prediction in the asymptotic setting. We first consider\na sequence of collections of posterior distributions with vanishing covariance,\nwhich emulates general estimators with large samples, and show the optimality\nof the quadratic scoring rule. Then, when the agent's posterior distribution is\na Beta-Bernoulli process, we find that the log scoring rule is optimal. We also\nprove the optimality of the log scoring rule over a smaller set of functions\nfor categorical distributions with Dirichlet priors.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jul 2021 16:05:48 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Chen", "Yiling", ""], ["Yu", "Fang-Yi", ""]]}, {"id": "2107.07440", "submitter": "Felipe Garrido-Lucero", "authors": "Felipe Garrido-Lucero and Rida Laraki", "title": "EPTAS for stable allocations in matching games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gale-Shapley introduced a matching problem between two sets of agents where\neach agent on one side has a preference over the agents of the other side and\nproved algorithmically the existence of a pairwise stable matching (i.e. no\nuncoupled pair can be better off by matching). Shapley-Shubik, Demange-Gale,\nand many others extended the model by allowing monetary transfers. In this\npaper, we study an extension where matched couples obtain their payoffs as the\noutcome of a strategic game and more particularly a solution concept that\ncombines Gale-Shapley pairwise stability with a constrained Nash equilibrium\nnotion (no player can increase its payoff by playing a different strategy\nwithout violating the participation constraint of the partner). Whenever all\ncouples play zero-sum matrix games, strictly competitive bi-matrix games, or\ninfinitely repeated bi-matrix games, we can prove that a modification of some\nalgorithms in the literature converge to an $\\varepsilon$-stable allocation in\nat most $O(\\frac{1}{\\varepsilon})$ steps where each step is polynomial (linear\nwith respect to the number of players and polynomial of degree at most 5 with\nrespect to the number of pure actions per player).\n", "versions": [{"version": "v1", "created": "Thu, 15 Jul 2021 16:36:49 GMT"}, {"version": "v2", "created": "Tue, 20 Jul 2021 08:08:44 GMT"}], "update_date": "2021-07-21", "authors_parsed": [["Garrido-Lucero", "Felipe", ""], ["Laraki", "Rida", ""]]}, {"id": "2107.07458", "submitter": "L\\'eonard Brice", "authors": "L\\'eonard Brice, Marie van den Bogaard, and Jean-Fran\\c{c}ois Raskin", "title": "On the Complexity of SPEs in Parity Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study the complexity of problems related to subgame-perfect equilibria\n(SPEs) in infinite duration non zero-sum multiplayer games played on finite\ngraphs with parity objectives. We present new complexity results that close\ngaps in the literature. Our techniques are based on a recent characterization\nof SPEs in prefix-independent games that is grounded on the notions of\nrequirements and negotiation, and according to which the plays supported by\nSPEs are exactly the plays consistent with the requirement that is the least\nfixed point of the negotiation function. The new results are as follows. First,\nchecking that a given requirement is a fixed point of the negotiation function\nis an NP-complete problem. Second, we show that the SPE constrained existence\nproblem is NP-complete, this problem was previously known to be ExpTime-easy\nand NP-hard. Third, the SPE constrained existence problem is fixed-parameter\ntractable when the number of players and of colors are parameters. Fourth,\ndeciding whether some requirement is the least fixed point of the negotiation\nfunction is complete for the second level of the Boolean hierarchy. Finally,\nthe SPE-verification problem -- that is, the problem of deciding whether there\nexists a play supported by a SPE that satisfies some LTL formula -- is\nPSpace-complete, this problem was known to be ExpTime-easy and PSpace-hard.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jul 2021 17:02:02 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Brice", "Léonard", ""], ["Bogaard", "Marie van den", ""], ["Raskin", "Jean-François", ""]]}, {"id": "2107.07725", "submitter": "Jason Cheuk Nam Liang", "authors": "Negin Golrezaei, Patrick Jaillet, Jason Cheuk Nam Liang, Vahab\n  Mirrokni", "title": "Bidding and Pricing in Budget and ROI Constrained Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In online advertising markets, setting budget and return on investment (ROI)\nconstraints are two prevalent ways to help advertisers (i.e. buyers) utilize\nlimited monetary resources efficiently. In this work, we provide a holistic\nview of ROI and budget constrained markets. We first tackle the buyer's bidding\nproblem subject to both budget and ROI constraints in repeated second-price\nauctions. We show that the optimal buyer hindsight policy admits a\n\"threshold-based\" structure that suggests the buyer win all auctions during\nwhich her valuation-to-expenditure ratio is greater than some threshold. We\nfurther propose a threshold-based bidding framework that aims to mimic the\nhindsight bidding policy by learning its threshold. We show that when facing\nstochastic competition, our algorithm guarantees the satisfaction of both\nbudget and ROI constraints and achieves sublinear regret compared to the\noptimal hindsight policy. Next, we study the seller's pricing problem against\nan ROI and budget constrained buyer. We establish that the seller's revenue\nfunction admits a bell-shaped structure, and then further propose a pricing\nalgorithm that utilizes an episodic binary-search procedure to identify a\nrevenue-optimal selling price. During each binary search episode, our pricing\nalgorithm explores a particular price, allowing the buyer's learning algorithm\nto adapt and stabilize quickly. This, in turn, allows our seller algorithm to\nachieve sublinear regret against adaptive buyer algorithms that quickly react\nto price changes.\n", "versions": [{"version": "v1", "created": "Fri, 16 Jul 2021 06:50:52 GMT"}], "update_date": "2021-07-19", "authors_parsed": [["Golrezaei", "Negin", ""], ["Jaillet", "Patrick", ""], ["Liang", "Jason Cheuk Nam", ""], ["Mirrokni", "Vahab", ""]]}, {"id": "2107.08077", "submitter": "Victor Verdugo", "authors": "Alejandro Jofr\\'e, Angel Pardo, David Salas, Victor Verdugo, Jos\\'e\n  Verschae", "title": "The Convergence Rates of Blockchain Mining Games: A Markovian Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the strategic behavior of miners in a blockchain is of great\nimportance for its proper operation. A common model for mining games considers\nan infinite time horizon, with players optimizing asymptotic average\nobjectives. Implicitly, this assumes that the asymptotic behaviors are realized\nat human-scale times, otherwise invalidating current models. We study the\nmining game utilizing Markov Decision Processes. Our approach allows us to\ndescribe the asymptotic behavior of the game in terms of the stationary\ndistribution of the induced Markov chain. We focus on a model with two players\nunder immediate release, assuming two different objectives: the (asymptotic)\naverage reward per turn and the (asymptotic) percentage of obtained blocks.\n  Using tools from Markov chain analysis, we show the existence of a strategy\nachieving slow mixing times, exponential in the policy parameters. This result\nemphasizes the imperative need to understand convergence rates in mining games,\nvalidating the standard models. Towards this end, we provide upper bounds for\nthe mixing time of certain meaningful classes of strategies. This result yields\ncriteria for establishing that long-term averaged functions are coherent as\npayoff functions. Moreover, by studying hitting times, we provide a criterion\nto validate the common simplification of considering finite states models. For\nboth considered objectives functions, we provide explicit formulae depending on\nthe stationary distribution of the underlying Markov chain. In particular, this\nshows that both mentioned objectives are not equivalent. Finally, we perform a\nmarket share case study in a particular regime of the game. More precisely, we\nshow that an strategic player with a sufficiently large processing power can\nimpose negative revenue on honest players.\n", "versions": [{"version": "v1", "created": "Fri, 16 Jul 2021 18:44:35 GMT"}], "update_date": "2021-07-21", "authors_parsed": [["Jofré", "Alejandro", ""], ["Pardo", "Angel", ""], ["Salas", "David", ""], ["Verdugo", "Victor", ""], ["Verschae", "José", ""]]}, {"id": "2107.08153", "submitter": "Denizalp Goktas", "authors": "Denizalp Goktas, Enrique Areyan Viqueira, Amy Greenwald", "title": "T\\^atonnement Beyond Constant Elasticity of Substitution", "comments": "31 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we bring consumer theory to bear in the analysis of Fisher\nmarkets whose buyers have arbitrary continuous, concave, homogeneous (CCH)\nutility functions representing locally non-satiated preferences. The main tools\nwe use are the dual concepts of expenditure minimization and indirect utility\nmaximization. First, we use expenditure functions to construct a new convex\nprogram whose dual, like the dual of the Eisenberg-Gale program, characterizes\nthe equilibrium prices of CCH Fisher markets. We then prove that the\nsubdifferential of the dual of our convex program is equal to the negative\nexcess demand in the associated market, which makes generalized gradient\ndescent equivalent to computing equilibrium prices via t\\^atonnement. Finally,\nwe use our novel characterization of equilibrium prices via expenditure\nfunctions to show that a discrete t\\^atonnement process converges at a rate of\n$O\\left(\\frac{1}{t}\\right)$ in Fisher markets with continuous, strictly\nconcave, homogeneous (CSCH) utility functions -- a class of utility functions\nbeyond the class of CES utility functions, the largest class for which\nconvergence results were previously known. CSCH Fisher markets include nested\nand mixed CES Fisher markets, thus providing a meaningful expansion of the\nspace of Fisher markets that is solvable via t\\^atonnement.\n", "versions": [{"version": "v1", "created": "Sat, 17 Jul 2021 01:04:34 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Goktas", "Denizalp", ""], ["Viqueira", "Enrique Areyan", ""], ["Greenwald", "Amy", ""]]}, {"id": "2107.08207", "submitter": "Zhihuan Huang", "authors": "Zhihuan Huang, Yuqing Kong, Tracy Xiao Liu, Grant Schoenebeck,\n  Shengwei Xu", "title": "BONUS! Maximizing Surprise", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multi-round competitions often double or triple the points awarded in the\nfinal round, calling it a bonus, to maximize spectators' excitement. In a\ntwo-player competition with $n$ rounds, we aim to derive the optimal bonus size\nto maximize the audience's overall expected surprise (as defined in [7]). We\nmodel the audience's prior belief over the two players' ability levels as a\nbeta distribution. Using a novel analysis that clarifies and simplifies the\ncomputation, we find that the optimal bonus depends greatly upon the prior\nbelief and obtain solutions of various forms for both the case of a finite\nnumber of rounds and the asymptotic case. In an interesting special case, we\nshow that the optimal bonus approximately and asymptotically equals to the\n\"expected lead\", the number of points the weaker player will need to come back\nin expectation. Moreover, we observe that priors with a higher skewness lead to\na higher optimal bonus size, and in the symmetric case, priors with a higher\nuncertainty also lead to a higher optimal bonus size. This matches our\nintuition since a highly asymmetric prior leads to a high \"expected lead\", and\na highly uncertain symmetric prior often leads to a lopsided game, which again\nbenefits from a larger bonus.\n", "versions": [{"version": "v1", "created": "Sat, 17 Jul 2021 09:16:10 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Huang", "Zhihuan", ""], ["Kong", "Yuqing", ""], ["Liu", "Tracy Xiao", ""], ["Schoenebeck", "Grant", ""], ["Xu", "Shengwei", ""]]}, {"id": "2107.08271", "submitter": "Andrea Celli", "authors": "Andrea Celli, Riccardo Colini-Baldeschi, Stefano Leonardi", "title": "Learning Fair Equilibria in Sponsored Search Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we investigate the strategic learning implications of the\ndeployment of sponsored search auction mechanisms that obey to fairness\ncriteria. We introduce a new class of mechanisms composing a traditional\nGeneralized Second Price auction (GSP) with different fair division schemes to\nachieve some desired level of fairness between two groups of Bayesian strategic\nadvertisers. We propose two mechanisms, $\\beta$-Fair GSP and GSP-EFX, that\ncompose GSP with, respectively, an envy-free up to one item (EF1), and an\nenvy-free up to any item (EFX) fair division scheme. The payments of GSP are\nadjusted in order to compensate the advertisers that suffer a loss of\nefficiency due the fair division stage. We prove that, for both mechanisms, if\nbidders play so as to minimize their external regret they are guaranteed to\nreach an equilibrium with good social welfare. We also prove that the\nmechanisms are budget balanced, so that the payments charged by the traditional\nGSP mechanism are a good proxy of the total compensation offered to the\nadvertisers. Finally, we evaluate the quality of the allocations of the two\nmechanisms through experiments on real-world data.\n", "versions": [{"version": "v1", "created": "Sat, 17 Jul 2021 16:18:31 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Celli", "Andrea", ""], ["Colini-Baldeschi", "Riccardo", ""], ["Leonardi", "Stefano", ""]]}, {"id": "2107.08374", "submitter": "Mikhail Burov", "authors": "Mikhail Burov, Can Kizilkale, Alexander Kurzhanskiy, Murat Arcak", "title": "Detecting Braess Routes: an Algorithm Accounting for Queuing Delays With\n  an Extended Graph", "comments": "was accepted by IEEE ITSC 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Braess paradox is a counter-intuitive phenomenon whereby adding roads to\na network results in higher travel time at equilibrium. In this paper we\npresent an algorithm to detect the occurrence of this paradox in real-world\nnetworks with the help of an improved graph representation accounting for\nqueues. The addition of queues to the network representation enables a closer\nmatch with real data. Moreover, we search for routes causing this phenomenon\n(\"Braess routes\") rather than links, and advocate removing such routes\nvirtually from navigation systems so that the associated links can continue to\nserve other routes. Our algorithm relies on a convex optimization problem\nutilizing Beckmann potentials for road links as well as queues, and results in\na route reconfiguration with reduced delay. We assume the availability of\nhistorical data to build the optimization model. We also assume the existence\nof a centralized navigation system to manage the routing options and remove the\nBraess routes. The theoretical solution demonstrates up to 12% delay reduction\nin a network from Montgomery County, Maryland. We validate the improvement with\nsimulations.\n", "versions": [{"version": "v1", "created": "Sun, 18 Jul 2021 06:09:57 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Burov", "Mikhail", ""], ["Kizilkale", "Can", ""], ["Kurzhanskiy", "Alexander", ""], ["Arcak", "Murat", ""]]}, {"id": "2107.08630", "submitter": "Mohammad Rasouli", "authors": "Mohammad Rasouli, Michael I. Jordan", "title": "Data Sharing Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.AI cs.GT", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  With the growing use of distributed machine learning techniques, there is a\ngrowing need for data markets that allows agents to share data with each other.\nNevertheless data has unique features that separates it from other commodities\nincluding replicability, cost of sharing, and ability to distort. We study a\nsetup where each agent can be both buyer and seller of data. For this setup, we\nconsider two cases: bilateral data exchange (trading data with data) and\nunilateral data exchange (trading data with money). We model bilateral sharing\nas a network formation game and show the existence of strongly stable outcome\nunder the top agents property by allowing limited complementarity. We propose\nordered match algorithm which can find the stable outcome in O(N^2) (N is the\nnumber of agents). For the unilateral sharing, under the assumption of additive\ncost structure, we construct competitive prices that can implement any social\nwelfare maximizing outcome. Finally for this setup when agents have private\ninformation, we propose mixed-VCG mechanism which uses zero cost data\ndistortion of data sharing with its isolated impact to achieve budget balance\nwhile truthfully implementing socially optimal outcomes to the exact level of\nbudget imbalance of standard VCG mechanisms. Mixed-VCG uses data distortions as\ndata money for this purpose. We further relax zero cost data distortion\nassumption by proposing distorted-mixed-VCG. We also extend our model and\nresults to data sharing via incremental inquiries and differential privacy\ncosts.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2021 06:00:34 GMT"}, {"version": "v2", "created": "Tue, 20 Jul 2021 06:31:23 GMT"}], "update_date": "2021-07-21", "authors_parsed": [["Rasouli", "Mohammad", ""], ["Jordan", "Michael I.", ""]]}, {"id": "2107.08748", "submitter": "Nikolaj Ignatieff Schwartzbach", "authors": "Nikolaj I. Schwartzbach", "title": "Deposit schemes for incentivizing behavior in finite games of perfect\n  information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model for finite games with deposit schemes and study how they\ncan be instantiated to incentivize an intended behavior. Doing so is trivial if\nthe deposit scheme can observe all actions taken in the game, as this allows it\nto simply keep the deposit for a party who does not play the intended strategy.\nInstead, we consider an abstraction where the deposit scheme is only allowed to\nprobabilistically infer information about what happened during the execution of\nthe game. We consider deposit schemes that are allowed to punish parties by\nwithholding parts of their deposit, and compensate the other players with what\nis left over. We show that deposit schemes can be used to implement any set of\nutilities if and only if it is able to essentially infer all information about\nwhat happened in the game. We give a definition of game-theoretic security that\ngeneralizes subgame perfection for finite games of perfect information by\nquantifying how much utility a dishonest party loses by deviating from the\nequilibrium. We show how finding an optimal deposit scheme that ensures\ngame-theoretic security, or showing no such scheme exists, can be stated as a\nlinear program and solved using standard methods. The deposit schemes outputted\nare optimal in the sense that the size of the largest deposit is minimal. We\nstate some additional desirable properties of deposit scheme and discuss\nvarious tradeoffs when deploying such systems in practice. We prove a lower\nbound on the size of the deposits, showing that the largest deposit must be\nlinear in the security parameter.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2021 10:43:02 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Schwartzbach", "Nikolaj I.", ""]]}, {"id": "2107.08806", "submitter": "Ameer Amer", "authors": "Ameer Amer and Inbal Talgam-Cohen", "title": "Auctions with Interdependence and SOS: Improved Approximation", "comments": "26 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Interdependent values make basic auction design tasks -- in particular\nmaximizing welfare truthfully in single-item auctions -- quite challenging.\nEden et al. recently established that if the bidders valuation functions are\nsubmodular over their signals (a.k.a. SOS), a truthful 4-approximation to the\noptimal welfare exists. We show existence of a mechanism that is truthful and\nachieves a tight 2-approximation to the optimal welfare when signals are\nbinary. Our mechanism is randomized and assigns bidders only 0 or 0.5\nprobabilities of winning the item. Our results utilize properties of submodular\nset functions, and extend to matroid settings.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2021 12:34:16 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Amer", "Ameer", ""], ["Talgam-Cohen", "Inbal", ""]]}, {"id": "2107.08813", "submitter": "Marie-Charlotte Brandenburg", "authors": "Marie-Charlotte Brandenburg, Christian Haase and Ngoc Mai Tran", "title": "Competitive equilibrium always exists for combinatorial auctions with\n  graphical pricing schemes", "comments": "24 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.GT econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that a competitive equilibrium always exists in combinatorial\nauctions with anonymous graphical valuations and pricing, using discrete\ngeometry. This is an intuitive and easy-to-construct class of valuations that\ncan model both complementarity and substitutes, and to our knowledge, it is the\nfirst class besides gross substitutes that have guaranteed competitive\nequilibrium. We prove through counter-examples that our result is tight, and we\ngive explicit algorithms for constructive competitive pricing vectors. We also\ngive extensions to multi-unit combinatorial auctions (also known as product-mix\nauctions). Combined with theorems on graphical valuations and pricing\nequilibrium of Candogan, Ozdagar and Parillo, our results indicate that\nquadratic pricing is a highly practical method to run combinatorial auctions.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2021 12:49:03 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Brandenburg", "Marie-Charlotte", ""], ["Haase", "Christian", ""], ["Tran", "Ngoc Mai", ""]]}, {"id": "2107.08922", "submitter": "Zhi Liu", "authors": "Zhi Liu and Nikhil Garg", "title": "Test-optional Policies: Overcoming Strategic Behavior and Informational\n  Gaps", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to the Covid-19 pandemic, more than 500 US-based colleges and\nuniversities went \"test-optional\" for admissions and promised that they would\nnot penalize applicants for not submitting test scores, part of a longer trend\nto rethink the role of testing in college admissions. However, it remains\nunclear how (and whether) a college can simultaneously use test scores for\nthose who submit them, while not penalizing those who do not--and what that\npromise even means. We formalize these questions, and study how a college can\novercome two challenges with optional testing: $\\textit{strategic applicants}$\n(when those with low test scores can pretend to not have taken the test), and\n$\\textit{informational gaps}$ (it has more information on those who submit a\ntest score than those who do not). We find that colleges can indeed do so, if\nand only if they are able to use information on who has test access and are\nwilling to randomize admissions.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2021 14:36:53 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Liu", "Zhi", ""], ["Garg", "Nikhil", ""]]}, {"id": "2107.08965", "submitter": "Giovanna Varricchio", "authors": "Martin Hoefer, Marco Schmalhofer, Giovanna Varricchio", "title": "Approximating Nash Social Welfare in 2-Valued Instances", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider the problem of maximizing the Nash social welfare when allocating\na set $\\mathcal{G}$ of goods to a set $\\mathcal{N}$ of agents. We study\ninstances, in which all agents have 2-valued additive valuations. In such an\ninstance, the value of every agent $i \\in \\mathcal{N}$ for every item $j \\in\n\\mathcal{G}$ is $v_{ij} \\in \\{p,q\\}$, for $p \\le q \\in \\mathbb{N}$. We show\nthat an optimal allocation can be computed in polynomial time if $p$ divides\n$q$. When $p$ does not divide $q$, we show an approximation ratio of at most\n$1.033$. It strictly decreases with the denominator of the irreducible fraction\nthat equals $p/q$. Finally, we prove an APX-hardness result for the problem\nwith a lower bound on the ratio of $1.000015$.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2021 15:27:04 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Hoefer", "Martin", ""], ["Schmalhofer", "Marco", ""], ["Varricchio", "Giovanna", ""]]}, {"id": "2107.09119", "submitter": "Muhammad Najib", "authors": "Julian Gutierrez, Lewis Hammond, Anthony W. Lin, Muhammad Najib,\n  Michael Wooldridge", "title": "Rational Verification for Probabilistic Systems", "comments": "18th International Conference on Principles of Knowledge\n  Representation and Reasoning (KR 2021)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.GT cs.LO", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Rational verification is the problem of determining which temporal logic\nproperties will hold in a multi-agent system, under the assumption that agents\nin the system act rationally, by choosing strategies that collectively form a\ngame-theoretic equilibrium. Previous work in this area has largely focussed on\ndeterministic systems. In this paper, we develop the theory and algorithms for\nrational verification in probabilistic systems. We focus on concurrent\nstochastic games (CSGs), which can be used to model uncertainty and randomness\nin complex multi-agent environments. We study the rational verification problem\nfor both non-cooperative games and cooperative games in the qualitative\nprobabilistic setting. In the former case, we consider LTL properties satisfied\nby the Nash equilibria of the game and in the latter case LTL properties\nsatisfied by the core. In both cases, we show that the problem is\n2EXPTIME-complete, thus not harder than the much simpler verification problem\nof model checking LTL properties of systems modelled as Markov decision\nprocesses (MDPs).\n", "versions": [{"version": "v1", "created": "Mon, 19 Jul 2021 19:24:16 GMT"}, {"version": "v2", "created": "Mon, 26 Jul 2021 09:52:31 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Gutierrez", "Julian", ""], ["Hammond", "Lewis", ""], ["Lin", "Anthony W.", ""], ["Najib", "Muhammad", ""], ["Wooldridge", "Michael", ""]]}, {"id": "2107.09239", "submitter": "Xizhi Tan", "authors": "Eric Balkanski, Pranav Garimidi, Vasilis Gkatzelis, Daniel Schoepflin,\n  Xizhi Tan", "title": "Deterministic Budget-Feasible Clock Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We revisit the well-studied problem of budget-feasible procurement, where a\nbuyer with a strict budget constraint seeks to acquire services from a group of\nstrategic providers (the sellers). During the last decade, several\nstrategyproof budget-feasible procurement auctions have been proposed, aiming\nto maximize the value of the buyer, while eliciting each seller's true cost for\nproviding their service. These solutions predominantly take the form of\nrandomized sealed-bid auctions: they ask the sellers to report their private\ncosts and then use randomization to determine which subset of services will be\nprocured and how much each of the chosen providers will be paid, ensuring that\nthe total payment does not exceed budget. Our main result in this paper is a\nnovel method for designing budget-feasible auctions, leading to solutions that\noutperform the previously proposed auctions in multiple ways.\n  First, our solutions take the form of descending clock auctions, and thus\nsatisfy a list of properties, such as obvious strategyproofness, group\nstrategyproofness, transparency, and unconditional winner privacy; this makes\nthese auctions much more likely to be used in practice. Second, in contrast to\nprevious results that heavily depend on randomization, our auctions are\ndeterministic. As a result, we provide an affirmative answer to one of the main\nopen questions in this literature, asking whether a deterministic strategyproof\nauction can achieve a constant approximation when the buyer's valuation\nfunction is submodular over the set of services. In addition, we also provide\nthe first deterministic budget-feasible auction that matches the approximation\nbound of the best-known randomized auction for the class of subadditive\nvaluations. Finally, using our method, we improve the best-known approximation\nfactor for monotone submodular valuations, which has been the focus of most of\nthe prior work.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jul 2021 03:05:56 GMT"}, {"version": "v2", "created": "Wed, 21 Jul 2021 15:17:24 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Balkanski", "Eric", ""], ["Garimidi", "Pranav", ""], ["Gkatzelis", "Vasilis", ""], ["Schoepflin", "Daniel", ""], ["Tan", "Xizhi", ""]]}, {"id": "2107.09247", "submitter": "Rishi Patel", "authors": "Vasilis Gkatzelis, Rishi Patel, Emmanouil Pountourakis, Daniel\n  Schoepflin", "title": "Prior-Free Clock Auctions for Bidders with Interdependent Values", "comments": "To appear in the 14th International Symposium on Algorithmic Game\n  Theory (SAGT)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of selling a good to a group of bidders with\ninterdependent values in a prior-free setting. Each bidder has a signal that\ncan take one of $k$ different values, and her value for the good is a weakly\nincreasing function of all the bidders' signals. The bidders are partitioned\ninto $\\ell$ expertise-groups, based on how their signal can impact the values\nfor the good, and we prove upper and lower bounds regarding the approximability\nof social welfare and revenue for a variety of settings, parameterized by $k$\nand $\\ell$. Our lower bounds apply to all ex-post incentive compatible\nmechanisms and our upper bounds are all within a small constant of the lower\nbounds. Our main results take the appealing form of ascending clock auctions\nand provide strong incentives by admitting the desired outcomes as obvious\nex-post equilibria.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jul 2021 03:59:12 GMT"}], "update_date": "2021-07-21", "authors_parsed": [["Gkatzelis", "Vasilis", ""], ["Patel", "Rishi", ""], ["Pountourakis", "Emmanouil", ""], ["Schoepflin", "Daniel", ""]]}, {"id": "2107.09258", "submitter": "Hooman Alavizadeh", "authors": "Hooman Alavizadeh, Julian Jang-Jaccard, Tansu Alpcan, Seyit A. Camtepe", "title": "A Markov Game Model for AI-based Cyber Security Attack Mitigation", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The new generation of cyber threats leverages advanced AI-aided methods,\nwhich make them capable to launch multi-stage, dynamic, and effective attacks.\nCurrent cyber-defense systems encounter various challenges to defend against\nsuch new and emerging threats. Modeling AI-aided threats through game theory\nmodels can help the defender to select optimal strategies against the attacks\nand make wise decisions to mitigate the attack's impact. This paper first\nexplores the current state-of-the-art in the new generation of threats in which\nAI techniques such as deep neural network is used for the attacker and\ndiscusses further challenges. We propose a Markovian dynamic game that can\nevaluate the efficiency of defensive methods against the AI-aided attacker\nunder a cloud-based system in which the attacker utilizes an AI technique to\nlaunch an advanced attack by finding the shortest attack path. We use the CVSS\nmetrics to quantify the values of this zero-sum game model for decision-making.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jul 2021 04:35:25 GMT"}], "update_date": "2021-07-21", "authors_parsed": [["Alavizadeh", "Hooman", ""], ["Jang-Jaccard", "Julian", ""], ["Alpcan", "Tansu", ""], ["Camtepe", "Seyit A.", ""]]}, {"id": "2107.09707", "submitter": "David Lajeunesse", "authors": "David Lajeunesse and Hugo D. Scolnik", "title": "A Cooperative Optimal Mining Model for Bitcoin", "comments": "8 pages, 2 figures, Accepted to 2021 3rd Conference on Blockchain\n  Research & Applications for Innovative Networks and Services (BRAINS)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR cs.DC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze Bitcoin mining from the perspective of a game and propose an\noptimal mining model that maximizes profits of pools and miners. The model is a\ntwo-stage Stackelberg game in which each stage forms a sub-game. In stage I,\npools are the leaders who assign a computing power to be consumed by miners. In\nstage II, miners decide of their power consumption and distribution. They find\nthemselves in a social dilemma in which they must choose between mining in\nsolo, therefore prioritizing their individual preferences, and participating in\na pool for the collective interest. The model relies on a pool protocol based\non a simulated game in which the miners compete for the reward won by the pool.\nThe solutions for the stage I sub-game and the simulated protocol game are\nunique and stable Nash equilibriums while the stage II sub-game leads to a\nstable cooperative equilibrium only when miners choose their strategies\naccording to certain criteria. We conclude that the cooperative optimal mining\nmodel has the potential to favor Bitcoin decentralization and stability.\nMainly, the social dilemma faced by miners together with the balance of\nincentives ensure a certain distribution of the network computing power between\npools and solo miners, while equilibriums in the game solutions provide\nstability to the system.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jul 2021 18:20:20 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Lajeunesse", "David", ""], ["Scolnik", "Hugo D.", ""]]}, {"id": "2107.09782", "submitter": "Johannes Betz Dr.", "authors": "Jayanth Bhargav, Johannes Betz, Hongrui Zheng, Rahul Mangharam", "title": "Track based Offline Policy Learning for Overtaking Maneuvers with\n  Autonomous Racecars", "comments": "Presented at the 1st Workshop \"Opportunitites and Challenges for\n  Autonomous Racing\" at the 2021 International Conference on Robotics and\n  Automation (ICRA 2021)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The rising popularity of driver-less cars has led to the research and\ndevelopment in the field of autonomous racing, and overtaking in autonomous\nracing is a challenging task. Vehicles have to detect and operate at the limits\nof dynamic handling and decisions in the car have to be made at high speeds and\nhigh acceleration. One of the most crucial parts in autonomous racing is path\nplanning and decision making for an overtaking maneuver with a dynamic opponent\nvehicle. In this paper we present the evaluation of a track based offline\npolicy learning approach for autonomous racing. We define specific track\nportions and conduct offline experiments to evaluate the probability of an\novertaking maneuver based on speed and position of the ego vehicle. Based on\nthese experiments we can define overtaking probability distributions for each\nof the track portions. Further, we propose a switching MPCC controller setup\nfor incorporating the learnt policies to achieve a higher rate of overtaking\nmaneuvers. By exhaustive simulations, we show that our proposed algorithm is\nable to increase the number of overtakes at different track portions.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jul 2021 21:55:51 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Bhargav", "Jayanth", ""], ["Betz", "Johannes", ""], ["Zheng", "Hongrui", ""], ["Mangharam", "Rahul", ""]]}, {"id": "2107.09871", "submitter": "Pooja Kulkarni", "authors": "Jugal Garg, Pooja Kulkarni, Aniket Murhekar", "title": "On Fair and Efficient Allocations of Indivisible Public Goods", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study fair allocation of indivisible public goods subject to cardinality\n(budget) constraints. In this model, we have n agents and m available public\ngoods, and we want to select $k \\leq m$ goods in a fair and efficient manner.\nWe first establish fundamental connections between the models of private goods,\npublic goods, and public decision making by presenting polynomial-time\nreductions for the popular solution concepts of maximum Nash welfare (MNW) and\nleximin. These mechanisms are known to provide remarkable fairness and\nefficiency guarantees in private goods and public decision making settings. We\nshow that they retain these desirable properties even in the public goods case.\nWe prove that MNW allocations provide fairness guarantees of Proportionality up\nto one good (Prop1), $1/n$ approximation to Round Robin Share (RRS), and the\nefficiency guarantee of Pareto Optimality (PO). Further, we show that the\nproblems of finding MNW or leximin-optimal allocations are NP-hard, even in the\ncase of constantly many agents, or binary valuations. This is in sharp contrast\nto the private goods setting that admits polynomial-time algorithms under\nbinary valuations. We also design pseudo-polynomial time algorithms for\ncomputing an exact MNW or leximin-optimal allocation for the cases of (i)\nconstantly many agents, and (ii) constantly many goods with additive\nvaluations. We also present an O(n)-factor approximation algorithm for MNW\nwhich also satisfies RRS, Prop1, and 1/2-Prop.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 04:09:08 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Garg", "Jugal", ""], ["Kulkarni", "Pooja", ""], ["Murhekar", "Aniket", ""]]}, {"id": "2107.09888", "submitter": "Venkata Sriram Siddhardh Nadendla", "authors": "Qizi Zhang and Venkata Sriram Siddhardh Nadendla and S. N.\n  Balakrishnan and Jerome Busemeyer", "title": "Strategic Mitigation of Agent Inattention in Drivers with Open-Quantum\n  Cognition Models", "comments": "12 pages, 4 figures, submitted to IEEE Transactions on Human-Machine\n  Systems", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.AI cs.GT cs.MA cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  State-of-the-art driver-assist systems have failed to effectively mitigate\ndriver inattention and had minimal impacts on the ever-growing number of road\nmishaps (e.g. life loss, physical injuries due to accidents caused by various\nfactors that lead to driver inattention). This is because traditional\nhuman-machine interaction settings are modeled in classical and behavioral\ngame-theoretic domains which are technically appropriate to characterize\nstrategic interaction between either two utility maximizing agents, or human\ndecision makers. Therefore, in an attempt to improve the persuasive\neffectiveness of driver-assist systems, we develop a novel strategic and\npersonalized driver-assist system which adapts to the driver's mental state and\nchoice behavior. First, we propose a novel equilibrium notion in human-system\ninteraction games, where the system maximizes its expected utility and human\ndecisions can be characterized using any general decision model. Then we use\nthis novel equilibrium notion to investigate the strategic driver-vehicle\ninteraction game where the car presents a persuasive recommendation to steer\nthe driver towards safer driving decisions. We assume that the driver employs\nan open-quantum system cognition model, which captures complex aspects of human\ndecision making such as violations to classical law of total probability and\nincompatibility of certain mental representations of information. We present\nclosed-form expressions for players' final responses to each other's strategies\nso that we can numerically compute both pure and mixed equilibria. Numerical\nresults are presented to illustrate both kinds of equilibria.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 06:02:03 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Zhang", "Qizi", ""], ["Nadendla", "Venkata Sriram Siddhardh", ""], ["Balakrishnan", "S. N.", ""], ["Busemeyer", "Jerome", ""]]}, {"id": "2107.09901", "submitter": "Ryoga Mahara", "authors": "Ryoga Mahara", "title": "Extension of Additive Valuations to General Valuations on the Existence\n  of EFX", "comments": "25 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Envy-freeness is one of the most widely studied notions in fair division.\nSince envy-free allocations do not always exist when items are indivisible,\nseveral relaxations have been considered. Among them, possibly the most\ncompelling concept is envy-freeness up to any item (EFX). We study the\nexistence of EFX allocations for general valuations. The existence of EFX\nallocations is a major open problem. For general valuations, it is known that\nan EFX allocation always exists (i) when $n=2$ or (ii) when all agents have\nidentical valuations, where $n$ is the number of agents. it is also known that\nan EFX allocation always exists when one can leave at most $n-1$ items\nunallocated.\n  We develop new techniques and extend some results of additive valuations to\ngeneral valuations on the existence of EFX allocations. We show that an EFX\nallocation always exists (i) when all agents have one of two general valuations\nor (ii) when the number of items is at most $n+3$. We also show that an EFX\nallocation always exists when one can leave at most $n-2$ items unallocated. In\naddition to the positive results, we construct an instance with $n=3$ in which\nan existing approach does not work as it is.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 06:45:55 GMT"}, {"version": "v2", "created": "Mon, 26 Jul 2021 03:13:57 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Mahara", "Ryoga", ""]]}, {"id": "2107.09945", "submitter": "Nathan Thomasset", "authors": "Patricia Bouyer, St\\'ephane Le Roux, Nathan Thomasset", "title": "Finite-memory strategies in two-player infinite games", "comments": "15 pages (+ appendix), submitted to CSL 2022", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study infinite two-player win/lose games $(A,B,W)$ where $A,B$ are finite\nand $W \\subseteq (A \\times B)^\\omega$. At each round Player 1 and Player 2\nconcurrently choose one action in $A$ and $B$, respectively. Player 1 wins iff\nthe generated sequence is in $W$. Each history $h \\in (A \\times B)^*$ induces a\ngame $(A,B,W_h)$ with $W_h := \\{\\rho \\in (A \\times B)^\\omega \\mid h \\rho \\in\nW\\}$. We show the following: if $W$ is in $\\Delta^0_2$ (for the usual\ntopology), if the inclusion relation induces a well partial order on the\n$W_h$'s, and if Player 1 has a winning strategy, then she has a finite-memory\nwinning strategy. Our proof relies on inductive descriptions of set complexity,\nsuch as the Hausdorff difference hierarchy of the open sets.\n  Examples in $\\Sigma^0_2$ and $\\Pi^0_2$ show some tightness of our result. Our\nresult can be translated to games on finite graphs: e.g. finite-memory\ndeterminacy of multi-energy games is a direct corollary, whereas it does not\nfollow from recent general results on finite memory strategies.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 08:49:33 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Bouyer", "Patricia", ""], ["Roux", "Stéphane Le", ""], ["Thomasset", "Nathan", ""]]}, {"id": "2107.10093", "submitter": "Logan Stapleton", "authors": "Daniel Ngo, Logan Stapleton, Vasilis Syrgkanis, Zhiwei Steven Wu", "title": "Incentivizing Compliance with Algorithmic Instruments", "comments": "In Proceedings of the Thirty-eighth International Conference on\n  Machine Learning (ICML 2021), 17 pages of main text, 53 pages total, 3\n  figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Randomized experiments can be susceptible to selection bias due to potential\nnon-compliance by the participants. While much of the existing work has studied\ncompliance as a static behavior, we propose a game-theoretic model to study\ncompliance as dynamic behavior that may change over time. In rounds, a social\nplanner interacts with a sequence of heterogeneous agents who arrive with their\nunobserved private type that determines both their prior preferences across the\nactions (e.g., control and treatment) and their baseline rewards without taking\nany treatment. The planner provides each agent with a randomized recommendation\nthat may alter their beliefs and their action selection. We develop a novel\nrecommendation mechanism that views the planner's recommendation as a form of\ninstrumental variable (IV) that only affects an agents' action selection, but\nnot the observed rewards. We construct such IVs by carefully mapping the\nhistory -- the interactions between the planner and the previous agents -- to a\nrandom recommendation. Even though the initial agents may be completely\nnon-compliant, our mechanism can incentivize compliance over time, thereby\nenabling the estimation of the treatment effect of each treatment, and\nminimizing the cumulative regret of the planner whose goal is to identify the\noptimal treatment.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 14:10:08 GMT"}, {"version": "v2", "created": "Wed, 28 Jul 2021 04:04:31 GMT"}], "update_date": "2021-07-29", "authors_parsed": [["Ngo", "Daniel", ""], ["Stapleton", "Logan", ""], ["Syrgkanis", "Vasilis", ""], ["Wu", "Zhiwei Steven", ""]]}, {"id": "2107.10119", "submitter": "Sikai Ruan", "authors": "Qishen Han, Sikai Ruan, Yuqing Kong, Ao Liu, Farhad Mohsin, Lirong Xia", "title": "Truthful Information Elicitation from Hybrid Crowds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Suppose a decision maker wants to predict weather tomorrow by eliciting and\naggregating information from crowd. How can the decision maker incentivize the\ncrowds to report their information truthfully? Many truthful peer prediction\nmechanisms have been proposed for homogeneous agents, whose types are drawn\nfrom the same distribution. However, in many situations, the population is a\nhybrid crowd of different types of agents with different forms of information,\nand the decision maker has neither the identity of any individual nor the\nproportion of each types of agents in the crowd. Ignoring the heterogeneity\namong the agent may lead to inefficient of biased information, which would in\nturn lead to suboptimal decisions. In this paper, we propose the first\nframework for information elicitation from hybrid crowds, and two mechanisms to\nmotivate agents to report their information truthfully. The first mechanism\ncombines two mechanisms via linear transformations and the second is based on\nmutual information. With two mechanisms, the decision maker can collect high\nquality information from hybrid crowds, and learns the expertise of agents.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 14:44:38 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Han", "Qishen", ""], ["Ruan", "Sikai", ""], ["Kong", "Yuqing", ""], ["Liu", "Ao", ""], ["Mohsin", "Farhad", ""], ["Xia", "Lirong", ""]]}, {"id": "2107.10121", "submitter": "Stanislav Zhydkov", "authors": "Omer Lev, Nicholas Mattei, Paolo Turrini, Stanislav Zhydkov", "title": "Peer Selection with Noisy Assessments", "comments": "15 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the peer selection problem a group of agents must select a subset of\nthemselves as winners for, e.g., peer-reviewed grants or prizes. Here, we take\na Condorcet view of this aggregation problem, i.e., that there is a\nground-truth ordering over the agents and we wish to select the best set of\nagents, subject to the noisy assessments of the peers. Given this model, some\nagents may be unreliable, while others might be self-interested, attempting to\ninfluence the outcome in their favour. In this paper we extend PeerNomination,\nthe most accurate peer reviewing algorithm to date, into\nWeightedPeerNomination, which is able to handle noisy and inaccurate agents. To\ndo this, we explicitly formulate assessors' reliability weights in a way that\ndoes not violate strategyproofness, and use this information to reweight their\nscores. We show analytically that a weighting scheme can improve the overall\naccuracy of the selection significantly. Finally, we implement several\ninstances of reweighting methods and show empirically that our methods are\nrobust in the face of noisy assessments.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 14:47:11 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Lev", "Omer", ""], ["Mattei", "Nicholas", ""], ["Turrini", "Paolo", ""], ["Zhydkov", "Stanislav", ""]]}, {"id": "2107.10323", "submitter": "Andreas Haupt", "authors": "Dirk Bergemann, Alessandro Bonatti, Andreas Haupt and Alex Smolin", "title": "The Optimality of Upgrade Pricing", "comments": "27 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": "Cowles Foundation Discussion Paper 2290", "categories": "cs.GT econ.TH", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We consider a multiproduct monopoly pricing model. We provide sufficient\nconditions under which the optimal mechanism can be implemented via upgrade\npricing -- a menu of product bundles that are nested in the strong set order.\nOur approach exploits duality methods to identify conditions on the\ndistribution of consumer types under which (a) each product is purchased by the\nsame set of buyers as under separate monopoly pricing (though the transfers can\nbe different), and (b) these sets are nested.\n  We exhibit two distinct sets of sufficient conditions. The first set of\nconditions is given by a weak version of monotonicity of types and virtual\nvalues, while maintaining a regularity assumption, i.e., that the\nproduct-by-product revenue curves are single-peaked. The second set of\nconditions establishes the optimality of upgrade pricing for type spaces with\nmonotone marginal rates of substitution (MRS) -- the relative preference ratios\nfor any two products are monotone across types. The monotone MRS condition\nallows us to relax the earlier regularity assumption.\n  Under both sets of conditions, we fully characterize the product bundles and\nprices that form the optimal upgrade pricing menu. Finally, we show that, if\nthe consumer's types are monotone, the seller can equivalently post a vector of\nsingle-item prices: upgrade pricing and separate pricing are equivalent.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 19:32:03 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Bergemann", "Dirk", ""], ["Bonatti", "Alessandro", ""], ["Haupt", "Andreas", ""], ["Smolin", "Alex", ""]]}, {"id": "2107.10406", "submitter": "Dimitri Bertsekas", "authors": "Dimitri Bertsekas", "title": "Distributed Asynchronous Policy Iteration for Sequential Zero-Sum Games\n  and Minimax Control", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY math.OC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We introduce a contractive abstract dynamic programming framework and related\npolicy iteration algorithms, specifically designed for sequential zero-sum\ngames and minimax problems with a general structure. Aside from greater\ngenerality, the advantage of our algorithms over alternatives is that they\nresolve some long-standing convergence difficulties of the \"natural\" policy\niteration algorithm, which have been known since the Pollatschek and Avi-Itzhak\nmethod [PoA69] for finite-state Markov games. Mathematically, this \"natural\"\nalgorithm is a form of Newton's method for solving Bellman's equation, but\nNewton's method, contrary to the case of single-player DP problems, is not\nglobally convergent in the case of a minimax problem, because the Bellman\noperator may have components that are neither convex nor concave. Our\nalgorithms address this difficulty by introducing alternating player choices,\nand by using a policy-dependent mapping with a uniform sup-norm contraction\nproperty, similar to earlier works by Bertsekas and Yu [BeY10], [BeY12],\n[YuB13]. Moreover, our algorithms allow a convergent and highly parallelizable\nimplementation, which is based on state space partitioning, and distributed\nasynchronous policy evaluation and policy improvement operations within each\nset of the partition. Our framework is also suitable for the use of\nreinforcement learning methods based on aggregation, which may be useful for\nlarge-scale problem instances.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2021 00:31:48 GMT"}, {"version": "v2", "created": "Sat, 24 Jul 2021 22:29:19 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Bertsekas", "Dimitri", ""]]}, {"id": "2107.10458", "submitter": "Sascha Kurz", "authors": "Sascha Kurz", "title": "The Public Good index for games with several levels of approval in the\n  input and output", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Public Good index is a power index for simple games introduced by Holler\nand later axiomatized by Holler and Packel, so that some authors also speak of\nthe Holler--Packel index. A generalization to the class of games with\ntransferable utility was given by Holler and Li. Here we generalize the\nunderlying ideas to games with several levels of approval in the input and\noutput -- so-called $(j,k)$ simple games. Corresponding axiomatizations are\nalso provided.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2021 05:03:06 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Kurz", "Sascha", ""]]}, {"id": "2107.10510", "submitter": "Tongseok Lim", "authors": "Tongseok Lim", "title": "Hodge theoretic reward allocation for generalized cooperative games on\n  graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.GT econ.TH q-fin.MF", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We define cooperative games on general graphs and generalize Lloyd S.\nShapley's celebrated allocation formula for those games in terms of stochastic\npath integral driven by the associated Markov chain on each graph. We then show\nthat the value allocation operator, one for each player defined by the\nstochastic path integral, coincides with the player's component game which is\nthe solution to the least squares (or Poisson's) equation, in light of the\ncombinatorial Hodge decomposition on general weighted graphs. Several\nmotivational examples and applications are also presented.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2021 08:13:11 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Lim", "Tongseok", ""]]}, {"id": "2107.10612", "submitter": "Xiuzhen Zhang", "authors": "Xiuzhen Zhang, Yao Zhang, Dengji Zhao", "title": "Incentive Compatible Mechanism for Influential Agent Selection", "comments": "Accepted by SAGT2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Selecting the most influential agent in a network has huge practical value in\napplications. However, in many scenarios, the graph structure can only be known\nfrom agents' reports on their connections. In a self-interested setting, agents\nmay strategically hide some connections to make themselves seem to be more\nimportant. In this paper, we study the incentive compatible (IC) selection\nmechanism to prevent such manipulations. Specifically, we model the progeny of\nan agent as her influence power, i.e., the number of nodes in the subgraph\nrooted at her. We then propose the Geometric Mechanism, which selects an agent\nwith at least 1/2 of the optimal progeny in expectation under the properties of\nincentive compatibility and fairness. Fairness requires that two roots with the\nsame contribution in two graphs are assigned the same probability. Furthermore,\nwe prove an upper bound of 1/(1+\\ln 2) for any incentive compatible and fair\nselection mechanisms.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2021 12:29:52 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Zhang", "Xiuzhen", ""], ["Zhang", "Yao", ""], ["Zhao", "Dengji", ""]]}, {"id": "2107.10777", "submitter": "Vijay Vazirani", "authors": "Vijay V. Vazirani", "title": "Randomized Online Algorithms for Adwords", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DM cs.GT math.CO math.PR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The general adwords problem has remained largely unresolved. We define a\nsubcase called {\\em $k$-TYPICAL}, $k \\in \\Zplus$, as follows: the total budget\nof all the bidders is sufficient to buy $k$ bids for each bidder. This seems a\nreasonable assumption for a ``typical'' instance, at least for moderate values\nof $k$. We give a randomized online algorithm achieving a competitive ratio of\n$\\left(1 - {1 \\over e} - {1 \\over k} \\right) $ for this problem. We also give\nrandomized online algorithms for other special cases of adwords.\n  The key to these results is a simplification of the proof for RANKING, the\noptimal algorithm for online bipartite matching, given in \\cite{KVV}. Our\nalgorithms for adwords can be seen as natural extensions of RANKING.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2021 16:09:33 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Vazirani", "Vijay V.", ""]]}, {"id": "2107.10801", "submitter": "Peter Streufert", "authors": "Peter A. Streufert", "title": "Specifying a Game-Theoretic Extensive Form as an Abstract 5-ary Relation", "comments": "21 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT cs.LO math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper specifies an extensive form as a 5-ary relation (i.e. set of\nquintuples) which satisfies certain abstract axioms. Each quintuple is\nunderstood to list a player, a situation (e.g. information set), a decision\nnode, an action, and a successor node. Accordingly, the axioms are understood\nto specify abstract relationships between players, situations, nodes, and\nactions. Such an extensive form is called a \"5-form\", and a \"5-form game\" is\ndefined to be a 5-form together with utility functions. The paper's main result\nis to construct a bijection between (a) those 5-form games with information-set\nsituations and (b) $\\mathbf{Gm}$ games (Streufert arXiv:2105.11398). In this\nsense, 5-form games equivalently formulate almost all extensive-form games. An\napplication weakens the tree axiom in the presence of the other axioms, which\nleads to a convenient decomposition of 5-forms.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2021 16:56:07 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Streufert", "Peter A.", ""]]}, {"id": "2107.10923", "submitter": "Rachitesh Kumar", "authors": "Xi Chen, Christian Kroer, Rachitesh Kumar", "title": "Throttling Equilibria in Auction Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Throttling is a popular method of budget management for online ad auctions in\nwhich the platform modulates the participation probability of an advertiser in\norder to smoothly spend her budget across many auctions. In this work, we\ninvestigate the setting in which all of the advertisers simultaneously employ\nthrottling to manage their budgets, and we do so for both first-price and\nsecond-price auctions. We analyze the structural and computational properties\nof the resulting equilibria. For first-price auctions, we show that a unique\nequilibrium always exists, is well-behaved and can be computed efficiently via\ntatonnement-style decentralized dynamics. In contrast, for second-price\nauctions, we prove that even though an equilibrium always exists, the problem\nof finding an equilibrium is PPAD-complete, there can be multiple equilibria,\nand it is NP-hard to find the revenue maximizing one. Finally, we compare the\nequilibrium outcomes of throttling to those of multiplicative pacing, which is\nthe other most popular and well-studied method of budget management.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2021 20:55:41 GMT"}], "update_date": "2021-07-26", "authors_parsed": [["Chen", "Xi", ""], ["Kroer", "Christian", ""], ["Kumar", "Rachitesh", ""]]}, {"id": "2107.11648", "submitter": "Ruilong Zhang", "authors": "Bo Li, Minming Li, Ruilong Zhang", "title": "Fair Allocation with Interval Scheduling Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study a fair resource scheduling problem, where a set of interval jobs are\nto be allocated to heterogeneous machines controlled by agents. Each job is\nassociated with release time, deadline, and processing time such that it can be\nprocessed if its complete processing period is between its release time and\ndeadline. The machines gain possibly different utilities by processing\ndifferent jobs, and all jobs assigned to the same machine should be processed\nwithout overlap. We consider two widely studied solution concepts, namely,\nmaximin share fairness and envy-freeness. For both criteria, we discuss the\nextent to which fair allocations exist and present constant approximation\nalgorithms for various settings.\n", "versions": [{"version": "v1", "created": "Sat, 24 Jul 2021 16:31:16 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Li", "Bo", ""], ["Li", "Minming", ""], ["Zhang", "Ruilong", ""]]}, {"id": "2107.11728", "submitter": "Fengjiao Li", "authors": "Fengjiao Li, Jia Liu, and Bo Ji", "title": "Federated Learning with Fair Worker Selection: A Multi-Round Submodular\n  Maximization Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DC cs.LG cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the problem of fair worker selection in Federated\nLearning systems, where fairness serves as an incentive mechanism that\nencourages more workers to participate in the federation. Considering the\nachieved training accuracy of the global model as the utility of the selected\nworkers, which is typically a monotone submodular function, we formulate the\nworker selection problem as a new multi-round monotone submodular maximization\nproblem with cardinality and fairness constraints. The objective is to maximize\nthe time-average utility over multiple rounds subject to an additional fairness\nrequirement that each worker must be selected for a certain fraction of time.\nWhile the traditional submodular maximization with a cardinality constraint is\nalready a well-known NP-Hard problem, the fairness constraint in the\nmulti-round setting adds an extra layer of difficulty. To address this novel\nchallenge, we propose three algorithms: Fair Continuous Greedy (FairCG1 and\nFairCG2) and Fair Discrete Greedy (FairDG), all of which satisfy the fairness\nrequirement whenever feasible. Moreover, we prove nontrivial lower bounds on\nthe achieved time-average utility under FairCG1 and FairCG2. In addition, by\ngiving a higher priority to fairness, FairDG ensures a stronger short-term\nfairness guarantee, which holds in every round. Finally, we perform extensive\nsimulations to verify the effectiveness of the proposed algorithms in terms of\nthe time-average utility and fairness satisfaction.\n", "versions": [{"version": "v1", "created": "Sun, 25 Jul 2021 05:17:34 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Li", "Fengjiao", ""], ["Liu", "Jia", ""], ["Ji", "Bo", ""]]}, {"id": "2107.11868", "submitter": "Manon Revel", "authors": "Daniel Halpern, Joseph Y. Halpern, Ali Jadbabaie, Elchanan Mossel,\n  Ariel D. Procaccia, Manon Revel", "title": "In Defense of Fluid Democracy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fluid democracy is a voting paradigm that allows voters to choose between\ndirectly voting and transitively delegating their votes to other voters. While\nfluid democracy has been viewed as a system that can combine the best aspects\nof direct and representative democracy, it can also result in situations where\nfew voters amass a large amount of influence. To analyze the impact of this\nshortcoming, we consider what has been called an epistemic setting, where\nvoters decide on a binary issue for which there is a ground truth. Previous\nwork has shown that under certain assumptions on the delegation mechanism, the\nconcentration of power is so severe that fluid democracy is less likely to\nidentify the ground truth than direct voting. We examine different, arguably\nmore realistic, classes of mechanisms, and prove they behave well by ensuring\nthat (with high probability) there is a limit on concentration of power. Our\nproofs demonstrate that delegations can be treated as stochastic processes and\nthat they can be compared to well-known processes from the literature -- such\nas preferential attachment and multi-types branching process -- that are\nsufficiently bounded for our purposes. Our results suggest that the concerns\nraised about fluid democracy can be overcome, thereby bolstering the case for\nthis emerging paradigm.\n", "versions": [{"version": "v1", "created": "Sun, 25 Jul 2021 18:39:33 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Halpern", "Daniel", ""], ["Halpern", "Joseph Y.", ""], ["Jadbabaie", "Ali", ""], ["Mossel", "Elchanan", ""], ["Procaccia", "Ariel D.", ""], ["Revel", "Manon", ""]]}, {"id": "2107.11977", "submitter": "Dimitris Fotakis", "authors": "Dimitris Fotakis and Panagiotis Patsilinakos", "title": "Strategyproof Facility Location in Perturbation Stable Instances", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider $k$-Facility Location games, where $n$ strategic agents report\ntheir locations on the real line, and a mechanism maps them to $k\\ge 2$\nfacilities. Each agent seeks to minimize her distance to the nearest facility.\nWe are interested in (deterministic or randomized) strategyproof mechanisms\nwithout payments that achieve a reasonable approximation ratio to the optimal\nsocial cost of the agents. To circumvent the inapproximability of $k$-Facility\nLocation by deterministic strategyproof mechanisms, we restrict our attention\nto perturbation stable instances. An instance of $k$-Facility Location on the\nline is $\\gamma$-perturbation stable (or simply, $\\gamma$-stable), for some\n$\\gamma\\ge 1$, if the optimal agent clustering is not affected by moving any\nsubset of consecutive agent locations closer to each other by a factor at most\n$\\gamma$. We show that the optimal solution is strategyproof in\n$(2+\\sqrt{3})$-stable instances whose optimal solution does not include any\nsingleton clusters, and that allocating the facility to the agent next to the\nrightmost one in each optimal cluster (or to the unique agent, for singleton\nclusters) is strategyproof and $(n-2)/2$-approximate for $5$-stable instances\n(even if their optimal solution includes singleton clusters). On the negative\nside, we show that for any $k\\ge 3$ and any $\\delta > 0$, there is no\ndeterministic anonymous mechanism that achieves a bounded approximation ratio\nand is strategyproof in $(\\sqrt{2}-\\delta)$-stable instances. We also prove\nthat allocating the facility to a random agent of each optimal cluster is\nstrategyproof and $2$-approximate in $5$-stable instances. To the best of our\nknowledge, this is the first time that the existence of deterministic (resp.\nrandomized) strategyproof mechanisms with a bounded (resp. constant)\napproximation ratio is shown for a large and natural class of $k$-Facility\nLocation instances.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jul 2021 06:06:09 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Fotakis", "Dimitris", ""], ["Patsilinakos", "Panagiotis", ""]]}, {"id": "2107.12023", "submitter": "Ruty Mundel", "authors": "Moshe Babaioff, Ruty Mundel, Noam Nisan", "title": "Beyond Pigouvian Taxes: A Worst Case Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the early $20^{th}$ century, Pigou observed that imposing a marginal cost\ntax on the usage of a public good induces a socially efficient level of use as\nan equilibrium. Unfortunately, such a \"Pigouvian\" tax may also induce other,\nsocially inefficient, equilibria. We observe that this social inefficiency may\nbe unbounded, and study whether alternative tax structures may lead to milder\nlosses in the worst case, i.e. to a lower price of anarchy. We show that no tax\nstructure leads to bounded losses in the worst case. However, we do find a tax\nscheme that has a lower price of anarchy than the Pigouvian tax, obtaining\ntight lower and upper bounds in terms of a crucial parameter that we identify.\nWe generalize our results to various scenarios that each offers an alternative\nto the use of a public road by private cars, such as ride sharing, or using a\nbus or a train.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jul 2021 08:24:44 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Babaioff", "Moshe", ""], ["Mundel", "Ruty", ""], ["Nisan", "Noam", ""]]}, {"id": "2107.12648", "submitter": "Jan Zimmermann", "authors": "Tatiana Tatarenko, Jan Zimmermann, J\\\"urgen Adamy", "title": "Gradient Play in $n$-Cluster Games with Zero-Order Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study a distributed approach for seeking a Nash equilibrium in $n$-cluster\ngames with strictly monotone mappings. Each player within each cluster has\naccess to the current value of her own smooth local cost function estimated by\na zero-order oracle at some query point. We assume the agents to be able to\ncommunicate with their neighbors in the same cluster over some undirected\ngraph. The goal of the agents in the cluster is to minimize their collective\ncost. This cost depends, however, on actions of agents from other clusters.\nThus, a game between the clusters is to be solved. We present a distributed\ngradient play algorithm for determining a Nash equilibrium in this game. The\nalgorithm takes into account the communication settings and zero-order\ninformation under consideration. We prove almost sure convergence of this\nalgorithm to a Nash equilibrium given appropriate estimations of the local cost\nfunctions' gradients.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jul 2021 08:00:52 GMT"}], "update_date": "2021-07-28", "authors_parsed": [["Tatarenko", "Tatiana", ""], ["Zimmermann", "Jan", ""], ["Adamy", "Jürgen", ""]]}, {"id": "2107.13090", "submitter": "Renyuan Xu", "authors": "Ben Hambly, Renyuan Xu and Huining Yang", "title": "Policy Gradient Methods Find the Nash Equilibrium in N-player\n  General-sum Linear-quadratic Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a general-sum N-player linear-quadratic game with stochastic\ndynamics over a finite horizon and prove the global convergence of the natural\npolicy gradient method to the Nash equilibrium. In order to prove the\nconvergence of the method, we require a certain amount of noise in the system.\nWe give a condition, essentially a lower bound on the covariance of the noise\nin terms of the model parameters, in order to guarantee convergence. We\nillustrate our results with numerical experiments to show that even in\nsituations where the policy gradient method may not converge in the\ndeterministic setting, the addition of noise leads to convergence.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jul 2021 22:08:41 GMT"}], "update_date": "2021-07-29", "authors_parsed": [["Hambly", "Ben", ""], ["Xu", "Renyuan", ""], ["Yang", "Huining", ""]]}, {"id": "2107.13298", "submitter": "Julian Schwarz", "authors": "Tobias Harks and Julian Schwarz", "title": "Generalized Nash Equilibrium Problems with Mixed-Integer Variables", "comments": "28 pages, 4 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM cs.DS math.OC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider generalized Nash equilibrium problems (GNEPs) with non-convex\nstrategy spaces and non-convex cost functions. This general class of games\nincludes the important case of games with mixed-integer variables for which\nonly a few results are known in the literature. We present a new approach to\ncharacterize equilibria via a convexification technique using the Nikaido-Isoda\nfunction. To any given instance $I$ of the GNEP, we derive a convexified\ninstance $I^\\text{conv}$ and show that every feasible strategy profile for $I$\nis an equilibrium if and only if it is an equilibrium for $I^\\text{conv}$ and\nthe convexified cost functions coincide with the initial ones. Based on this\ngeneral result we identify important classes of GNEPs which allow us to\nreformulate the equilibrium problem via standard optimization problems.\n  $1.$ First, quasi-linear GNEPs are introduced where for fixed strategies of\nthe opponent players, the cost function of every player is linear and the\nconvex hull of the respective strategy space is polyhedral. For this game class\nwe reformulate the equilibrium problem for $I^\\text{conv}$ as a standard\n(non-linear) optimization problem.\n  $2.$ Secondly, we study GNEPs with joint constraint sets. We introduce the\nnew class of projective-closed GNEPs for which we show that $I^\\text{conv}$\nfalls into the class of jointly convex GNEPs. As an important application, we\nshow that general GNEPs with shared binary sets $\\{0,1\\}^k$ are\nprojective-closed.\n  $3.$ Thirdly, we discuss the class of quasi-separable GNEPs in which roughly\nspeaking the players' cost functions depend on their own strategy only. We show\nthat they admit a special structure leading to a characterization of equilibria\nvia solutions of a convex optimization problem.\n  $4.$ Finally, we present numerical results regarding the computation of\nequilibria for a class of quasi-linear and projective-closed GNEPs.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jul 2021 11:45:20 GMT"}], "update_date": "2021-07-29", "authors_parsed": [["Harks", "Tobias", ""], ["Schwarz", "Julian", ""]]}, {"id": "2107.13363", "submitter": "Yotam Gafni", "authors": "Xiaotie Deng, Yotam Gafni, Ron Lavi, Tao Lin, Hongyi Ling", "title": "From Monopoly to Competition: Optimal Contests Prevail", "comments": null, "journal-ref": null, "doi": "10.13140/RG.2.2.11070.20807", "report-no": null, "categories": "cs.GT econ.TH", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study competition among contests in a general model that allows for an\narbitrary and heterogeneous space of contest design, where the goal of the\ncontest designers is to maximize the contestants' sum of efforts. Our main\nresult shows that optimal contests in the monopolistic setting (i.e., those\nthat maximize the sum of efforts in a model with a single contest) form an\nequilibrium in the model with competition among contests. Under a very natural\nassumption these contests are in fact dominant, and the equilibria that they\nform are unique. Moreover, equilibria with the optimal contests are\nPareto-optimal even in cases where other equilibria emerge. In many natural\ncases, they also maximize the social welfare.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jul 2021 13:50:18 GMT"}], "update_date": "2021-07-29", "authors_parsed": [["Deng", "Xiaotie", ""], ["Gafni", "Yotam", ""], ["Lavi", "Ron", ""], ["Lin", "Tao", ""], ["Ling", "Hongyi", ""]]}, {"id": "2107.13632", "submitter": "Yunian Pan", "authors": "Yunian Pan and Quanyan Zhu", "title": "Efficient Episodic Learning of Nonstationary and Unknown Zero-Sum Games\n  Using Expert Game Ensembles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Game theory provides essential analysis in many applications of strategic\ninteractions. However, the question of how to construct a game model and what\nis its fidelity is seldom addressed. In this work, we consider learning in a\nclass of repeated zero-sum games with unknown, time-varying payoff matrix, and\nnoisy feedbacks, by making use of an ensemble of benchmark game models. These\nmodels can be pre-trained and collected dynamically during sequential plays.\nThey serve as prior side information and imperfectly underpin the unknown true\ngame model. We propose OFULinMat, an episodic learning algorithm that\nintegrates the adaptive estimation of game models and the learning of the\nstrategies. The proposed algorithm is shown to achieve a sublinear bound on the\nsaddle-point regret. We show that this algorithm is provably efficient through\nboth theoretical analysis and numerical examples. We use a dynamic honeypot\nallocation game as a case study to illustrate and corroborate our results. We\nalso discuss the relationship and highlight the difference between our\nframework and the classical adversarial multi-armed bandit framework.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jul 2021 20:35:12 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Pan", "Yunian", ""], ["Zhu", "Quanyan", ""]]}, {"id": "2107.14097", "submitter": "Noam Hazon", "authors": "Leora Schmerler, Noam Hazon", "title": "Strategic Voting in the Context of Negotiating Teams", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  A negotiating team is a group of two or more agents who join together as a\nsingle negotiating party because they share a common goal related to the\nnegotiation. Since a negotiating team is composed of several stakeholders,\nrepresented as a single negotiating party, there is need for a voting rule for\nthe team to reach decisions. In this paper, we investigate the problem of\nstrategic voting in the context of negotiating teams. Specifically, we present\na polynomial-time algorithm that finds a manipulation for a single voter when\nusing a positional scoring rule. We show that the problem is still tractable\nwhen there is a coalition of manipulators that uses a x-approval rule. The\ncoalitional manipulation problem becomes computationally hard when using Borda,\nbut we provide a polynomial-time algorithm with the following guarantee: given\na manipulable instance with k manipulators, the algorithm finds a successful\nmanipulation with at most one additional manipulator. Our results hold for both\nconstructive and destructive manipulations.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jul 2021 15:25:31 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Schmerler", "Leora", ""], ["Hazon", "Noam", ""]]}]