[{"id": "1107.0193", "submitter": "Bernat Corominas-Murtra BCM", "authors": "Jordi Fortuny and Bernat Corominas-Murtra", "title": "On the origin of ambiguity in efficient communication", "comments": "28 pages, 2 figures", "journal-ref": "Journal of Logic, Language and Information. 0925-8531, pp 1--19\n  (2013)", "doi": "10.1007/s10849-013-9179-3", "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article studies the emergence of ambiguity in communication through the\nconcept of logical irreversibility and within the framework of Shannon's\ninformation theory. This leads us to a precise and general expression of the\nintuition behind Zipf's vocabulary balance in terms of a symmetry equation\nbetween the complexities of the coding and the decoding processes that imposes\nan unavoidable amount of logical uncertainty in natural communication.\nAccordingly, the emergence of irreversible computations is required if the\ncomplexities of the coding and the decoding processes are balanced in a\nsymmetric scenario, which means that the emergence of ambiguous codes is a\nnecessary condition for natural communication to succeed.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jul 2011 11:01:52 GMT"}, {"version": "v2", "created": "Fri, 16 Dec 2011 18:24:40 GMT"}, {"version": "v3", "created": "Tue, 1 Oct 2013 12:45:36 GMT"}], "update_date": "2013-10-02", "authors_parsed": [["Fortuny", "Jordi", ""], ["Corominas-Murtra", "Bernat", ""]]}, {"id": "1107.1753", "submitter": "Yavor Parvanov", "authors": "Yavor Parvanov", "title": "Notes on Electronic Lexicography", "comments": "8 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  These notes are a continuation of topics covered by V. Selegej in his article\n\"Electronic Dictionaries and Computational lexicography\". How can an electronic\ndictionary have as its object the description of closely related languages?\nObviously, such a question allows multiple answers.\n", "versions": [{"version": "v1", "created": "Sat, 9 Jul 2011 00:40:06 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Parvanov", "Yavor", ""]]}, {"id": "1107.3119", "submitter": "Edward Grefenstette", "authors": "Edward Grefenstette and Mehrnoosh Sadrzadeh", "title": "Experimenting with Transitive Verbs in a DisCoCat", "comments": "5 pages, to be presented at GEMS 2011, as part of EMNLP'11 workshops", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Formal and distributional semantic models offer complementary benefits in\nmodeling meaning. The categorical compositional distributional (DisCoCat) model\nof meaning of Coecke et al. (arXiv:1003.4394v1 [cs.CL]) combines aspected of\nboth to provide a general framework in which meanings of words, obtained\ndistributionally, are composed using methods from the logical setting to form\nsentence meaning. Concrete consequences of this general abstract setting and\napplications to empirical data are under active study (Grefenstette et al.,\narxiv:1101.0309; Grefenstette and Sadrzadeh, arXiv:1106.4058v1 [cs.CL]). . In\nthis paper, we extend this study by examining transitive verbs, represented as\nmatrices in a DisCoCat. We discuss three ways of constructing such matrices,\nand evaluate each method in a disambiguation task developed by Grefenstette and\nSadrzadeh (arXiv:1106.4058v1 [cs.CL]).\n", "versions": [{"version": "v1", "created": "Fri, 15 Jul 2011 18:06:37 GMT"}, {"version": "v2", "created": "Sat, 23 Jul 2011 00:14:36 GMT"}], "update_date": "2011-07-26", "authors_parsed": [["Grefenstette", "Edward", ""], ["Sadrzadeh", "Mehrnoosh", ""]]}, {"id": "1107.3263", "submitter": "Adam Lipowski", "authors": "Dorota Lipowska and Adam Lipowski", "title": "Naming Game on Adaptive Weighted Networks", "comments": "22 pages, accepted in Artificial Life", "journal-ref": "Artificial Life vol. 18, 311-323 (2012)", "doi": "10.1162/artl_a_00067", "report-no": null, "categories": "cond-mat.stat-mech cs.CL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine a naming game on an adaptive weighted network. A weight of\nconnection for a given pair of agents depends on their communication success\nrate and determines the probability with which the agents communicate. In some\ncases, depending on the parameters of the model, the preference toward\nsuccessfully communicating agents is basically negligible and the model behaves\nsimilarly to the naming game on a complete graph. In particular, it quickly\nreaches a single-language state, albeit some details of the dynamics are\ndifferent from the complete-graph version. In some other cases, the preference\ntoward successfully communicating agents becomes much more relevant and the\nmodel gets trapped in a multi-language regime. In this case gradual coarsening\nand extinction of languages lead to the emergence of a dominant language,\nalbeit with some other languages still being present. A comparison of\ndistribution of languages in our model and in the human population is\ndiscussed.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jul 2011 22:58:41 GMT"}, {"version": "v2", "created": "Sun, 25 Mar 2012 22:46:01 GMT"}], "update_date": "2012-08-10", "authors_parsed": [["Lipowska", "Dorota", ""], ["Lipowski", "Adam", ""]]}, {"id": "1107.3707", "submitter": "Alexander Petersen", "authors": "Alexander M. Petersen, Joel Tenenbaum, Shlomo Havlin, H. Eugene\n  Stanley", "title": "Statistical Laws Governing Fluctuations in Word Use from Word Birth to\n  Word Death", "comments": "Version 1: 31 pages, 17 figures, 3 tables. Version 2 is streamlined,\n  eliminates substantial material and incorporates referee comments: 19 pages,\n  14 figures, 3 tables", "journal-ref": "Scientific Reports 2, 313 (2012)", "doi": "10.1038/srep00313", "report-no": null, "categories": "physics.soc-ph cs.CL cs.IR nlin.AO physics.pop-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the dynamic properties of 10^7 words recorded in English, Spanish\nand Hebrew over the period 1800--2008 in order to gain insight into the\ncoevolution of language and culture. We report language independent patterns\nuseful as benchmarks for theoretical models of language evolution. A\nsignificantly decreasing (increasing) trend in the birth (death) rate of words\nindicates a recent shift in the selection laws governing word use. For new\nwords, we observe a peak in the growth-rate fluctuations around 40 years after\nintroduction, consistent with the typical entry time into standard dictionaries\nand the human generational timescale. Pronounced changes in the dynamics of\nlanguage during periods of war shows that word correlations, occurring across\ntime and between words, are largely influenced by coevolutionary social,\ntechnological, and political factors. We quantify cultural memory by analyzing\nthe long-term correlations in the use of individual words using detrended\nfluctuation analysis.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jul 2011 13:02:42 GMT"}, {"version": "v2", "created": "Wed, 15 Feb 2012 19:34:02 GMT"}], "update_date": "2012-03-16", "authors_parsed": [["Petersen", "Alexander M.", ""], ["Tenenbaum", "Joel", ""], ["Havlin", "Shlomo", ""], ["Stanley", "H. Eugene", ""]]}, {"id": "1107.4218", "submitter": "Maurizio Serva", "authors": "Maurizio Serva", "title": "The settlement of Madagascar: what dialects and languages can tell", "comments": "We find out the area and the modalities of the settlement of\n  Madagascar by Indonesian colonizers around 650 CE. Results are obtained\n  comparing 23 Malagasy dialects with Malay and Maanyan languages", "journal-ref": null, "doi": "10.1371/journal.pone.0030666", "report-no": null, "categories": "cs.CL q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dialects of Madagascar belong to the Greater Barito East group of the\nAustronesian family and it is widely accepted that the Island was colonized by\nIndonesian sailors after a maritime trek which probably took place around 650\nCE. The language most closely related to Malagasy dialects is Maanyan but also\nMalay is strongly related especially for what concerns navigation terms. Since\nthe Maanyan Dayaks live along the Barito river in Kalimantan (Borneo) and they\ndo not possess the necessary skill for long maritime navigation, probably they\nwere brought as subordinates by Malay sailors.\n  In a recent paper we compared 23 different Malagasy dialects in order to\ndetermine the time and the landing area of the first colonization. In this\nresearch we use new data and new methods to confirm that the landing took place\non the south-east coast of the Island. Furthermore, we are able to state here\nthat it is unlikely that there were multiple settlements and, therefore,\ncolonization consisted in a single founding event.\n  To reach our goal we find out the internal kinship relations among all the 23\nMalagasy dialects and we also find out the different kinship degrees of the 23\ndialects versus Malay and Maanyan. The method used is an automated version of\nthe lexicostatistic approach. The data concerning Madagascar were collected by\nthe author at the beginning of 2010 and consist of Swadesh lists of 200 items\nfor 23 dialects covering all areas of the Island. The lists for Maanyan and\nMalay were obtained from published datasets integrated by author's interviews.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jul 2011 10:02:31 GMT"}], "update_date": "2015-05-28", "authors_parsed": [["Serva", "Maurizio", ""]]}, {"id": "1107.4557", "submitter": "Myle Ott", "authors": "Myle Ott, Yejin Choi, Claire Cardie, Jeffrey T. Hancock", "title": "Finding Deceptive Opinion Spam by Any Stretch of the Imagination", "comments": "11 pages, 5 tables, data available at:\n  http://www.cs.cornell.edu/~myleott", "journal-ref": "Proceedings of ACL 2011: HLT, pp. 309-319", "doi": null, "report-no": null, "categories": "cs.CL cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consumers increasingly rate, review and research products online.\nConsequently, websites containing consumer reviews are becoming targets of\nopinion spam. While recent work has focused primarily on manually identifiable\ninstances of opinion spam, in this work we study deceptive opinion\nspam---fictitious opinions that have been deliberately written to sound\nauthentic. Integrating work from psychology and computational linguistics, we\ndevelop and compare three approaches to detecting deceptive opinion spam, and\nultimately develop a classifier that is nearly 90% accurate on our\ngold-standard opinion spam dataset. Based on feature analysis of our learned\nmodels, we additionally make several theoretical contributions, including\nrevealing a relationship between deceptive opinions and imaginative writing.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2011 16:02:06 GMT"}], "update_date": "2011-07-25", "authors_parsed": [["Ott", "Myle", ""], ["Choi", "Yejin", ""], ["Cardie", "Claire", ""], ["Hancock", "Jeffrey T.", ""]]}, {"id": "1107.4573", "submitter": "Peter Turney", "authors": "Peter D. Turney (National Research Council of Canada)", "title": "Analogy perception applied to seven tests of word comprehension", "comments": "related work available at http://purl.org/peter.turney/", "journal-ref": "Journal of Experimental & Theoretical Artificial Intelligence\n  (JETAI), 2011, Volume 23, Issue 3, pages 343-362", "doi": null, "report-no": null, "categories": "cs.AI cs.CL cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has been argued that analogy is the core of cognition. In AI research,\nalgorithms for analogy are often limited by the need for hand-coded high-level\nrepresentations as input. An alternative approach is to use high-level\nperception, in which high-level representations are automatically generated\nfrom raw data. Analogy perception is the process of recognizing analogies using\nhigh-level perception. We present PairClass, an algorithm for analogy\nperception that recognizes lexical proportional analogies using representations\nthat are automatically generated from a large corpus of raw textual data. A\nproportional analogy is an analogy of the form A:B::C:D, meaning \"A is to B as\nC is to D\". A lexical proportional analogy is a proportional analogy with\nwords, such as carpenter:wood::mason:stone. PairClass represents the semantic\nrelations between two words using a high-dimensional feature vector, in which\nthe elements are based on frequencies of patterns in the corpus. PairClass\nrecognizes analogies by applying standard supervised machine learning\ntechniques to the feature vectors. We show how seven different tests of word\ncomprehension can be framed as problems of analogy perception and we then apply\nPairClass to the seven resulting sets of analogy perception problems. We\nachieve competitive results on all seven tests. This is the first time a\nuniform approach has handled such a range of tests of word comprehension.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2011 16:54:11 GMT"}], "update_date": "2011-07-25", "authors_parsed": [["Turney", "Peter D.", "", "National Research Council of Canada"]]}, {"id": "1107.4687", "submitter": "Luis Quesada", "authors": "Luis Quesada, Fernando Berzal, and Francisco J. Cortijo", "title": "Fence - An Efficient Parser with Ambiguity Support for Model-Driven\n  Language Specification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Model-based language specification has applications in the implementation of\nlanguage processors, the design of domain-specific languages, model-driven\nsoftware development, data integration, text mining, natural language\nprocessing, and corpus-based induction of models. Model-based language\nspecification decouples language design from language processing and, unlike\ntraditional grammar-driven approaches, which constrain language designers to\nspecific kinds of grammars, it needs general parser generators able to deal\nwith ambiguities. In this paper, we propose Fence, an efficient bottom-up\nparsing algorithm with lexical and syntactic ambiguity support that enables the\nuse of model-based language specification in practice.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jul 2011 12:56:02 GMT"}, {"version": "v2", "created": "Fri, 7 Oct 2011 09:50:12 GMT"}], "update_date": "2011-10-10", "authors_parsed": [["Quesada", "Luis", ""], ["Berzal", "Fernando", ""], ["Cortijo", "Francisco J.", ""]]}, {"id": "1107.4723", "submitter": "Yannis Haralambous", "authors": "Yannis Haralambous, Vitaly Klyuev", "title": "A Semantic Relatedness Measure Based on Combined Encyclopedic,\n  Ontological and Collocational Knowledge", "comments": "6 pages, 6 figures, accepted for publication at IJCNLP2011 Conference", "journal-ref": "Proceedings of the 5th International Joint Conference on Natural\n  Language Processing, Chiang-Mai, Thailand, November 8-13, 2011", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a new semantic relatedness measure combining the Wikipedia-based\nExplicit Semantic Analysis measure, the WordNet path measure and the mixed\ncollocation index. Our measure achieves the currently highest results on the\nWS-353 test: a Spearman rho coefficient of 0.79 (vs. 0.75 in (Gabrilovich and\nMarkovitch, 2007)) when applying the measure directly, and a value of 0.87 (vs.\n0.78 in (Agirre et al., 2009)) when using the prediction of a polynomial SVM\nclassifier trained on our measure.\n  In the appendix we discuss the adaptation of ESA to 2011 Wikipedia data, as\nwell as various unsuccessful attempts to enhance ESA by filtering at word,\nsentence, and section level.\n", "versions": [{"version": "v1", "created": "Sun, 24 Jul 2011 06:27:56 GMT"}, {"version": "v2", "created": "Fri, 19 Aug 2011 21:35:23 GMT"}], "update_date": "2011-08-23", "authors_parsed": [["Haralambous", "Yannis", ""], ["Klyuev", "Vitaly", ""]]}, {"id": "1107.4734", "submitter": "Hssini Mohamed Mr.", "authors": "Mohamed Hssini and Azzeddine Lazrek", "title": "Design of Arabic Diacritical Marks", "comments": "10 pages, 24 figures; ISSN (Online): 1694-0814 http://www.IJCSI.org", "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 8,\n  Issue 3, May 2011", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Diacritical marks play a crucial role in meeting the criteria of usability of\ntypographic text, such as: homogeneity, clarity and legibility. To change the\ndiacritic of a letter in a word could completely change its semantic. The\nsituation is very complicated with multilingual text. Indeed, the problem of\ndesign becomes more difficult by the presence of diacritics that come from\nvarious scripts; they are used for different purposes, and are controlled by\nvarious typographic rules. It is quite challenging to adapt rules from one\nscript to another. This paper aims to study the placement and sizing of\ndiacritical marks in Arabic script, with a comparison with the Latin's case.\nThe Arabic script is cursive and runs from right-to-left; its criteria and\nrules are quite distinct from those of the Latin script. In the beginning, we\ncompare the difficulty of processing diacritics in both scripts. After, we will\nstudy the limits of Latin resolution strategies when applied to Arabic. At the\nend, we propose an approach to resolve the problem for positioning and resizing\ndiacritics. This strategy includes creating an Arabic font, designed in\nOpenType format, along with suitable justification in TEX.\n", "versions": [{"version": "v1", "created": "Sun, 24 Jul 2011 08:35:12 GMT"}], "update_date": "2011-07-26", "authors_parsed": [["Hssini", "Mohamed", ""], ["Lazrek", "Azzeddine", ""]]}, {"id": "1107.4796", "submitter": "Ali Jowharpour", "authors": "Ali Jowharpour, Masha allah abbasi dezfuli, Mohammad hosein Yektaee", "title": "Use Pronunciation by Analogy for text to speech system in Persian\n  language", "comments": null, "journal-ref": "IJCSI Volume 8, Issue 3, May 2011", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The interest in text to speech synthesis increased in the world .text to\nspeech have been developed formany popular languages such as English, Spanish\nand French and many researches and developmentshave been applied to those\nlanguages. Persian on the other hand, has been given little attentioncompared\nto other languages of similar importance and the research in Persian is still\nin its infancy.Persian language possess many difficulty and exceptions that\nincrease complexity of text to speechsystems. For example: short vowels is\nabsent in written text or existence of homograph words. in thispaper we propose\na new method for persian text to phonetic that base on pronunciations by\nanalogy inwords, semantic relations and grammatical rules for finding proper\nphonetic. Keywords:PbA, text to speech, Persian language, FPbA\n", "versions": [{"version": "v1", "created": "Sun, 24 Jul 2011 20:37:57 GMT"}], "update_date": "2011-07-26", "authors_parsed": [["Jowharpour", "Ali", ""], ["dezfuli", "Masha allah abbasi", ""], ["Yektaee", "Mohammad hosein", ""]]}, {"id": "1107.5743", "submitter": "Siddhartha Jonnalagadda", "authors": "Siddhartha Jonnalagadda, Philip Topham", "title": "NEMO: Extraction and normalization of organization names from PubMed\n  affiliation strings", "comments": null, "journal-ref": "Siddhartha Jonnalagadda, Philip Topham. NEMO: Extraction and\n  normalization of organization names from PubMed affiliation strings. Journal\n  of Biomedical Discovery and Collaboration, 2010 Oct 4;5:50-75", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose NEMO, a system for extracting organization names in the\naffiliation and normalizing them to a canonical organization name. Our parsing\nprocess involves multi-layered rule matching with multiple dictionaries. The\nsystem achieves more than 98% f-score in extracting organization names. Our\nprocess of normalization that involves clustering based on local sequence\nalignment metrics and local learning based on finding connected components. A\nhigh precision was also observed in normalization. NEMO is the missing link in\nassociating each biomedical paper and its authors to an organization name in\nits canonical form and the Geopolitical location of the organization. This\nresearch could potentially help in analyzing large social networks of\norganizations for landscaping a particular topic, improving performance of\nauthor disambiguation, adding weak links in the co-author network of authors,\naugmenting NLM's MARS system for correcting errors in OCR output of affiliation\nfield, and automatically indexing the PubMed citations with the normalized\norganization name and country. Our system is available as a graphical user\ninterface available for download along with this paper.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2011 15:37:56 GMT"}], "update_date": "2011-07-29", "authors_parsed": [["Jonnalagadda", "Siddhartha", ""], ["Topham", "Philip", ""]]}, {"id": "1107.5744", "submitter": "Siddhartha Jonnalagadda", "authors": "Siddhartha Jonnalagadda, Graciela Gonzalez", "title": "BioSimplify: an open source sentence simplification engine to improve\n  recall in automatic biomedical information extraction", "comments": null, "journal-ref": "Siddhartha Jonnalagadda, Graciela Gonzalez. BioSimplify: an open\n  source sentence simplification engine to improve recall in automatic\n  biomedical information extraction. In Annual Proceedings of AMIA 2010", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  BioSimplify is an open source tool written in Java that introduces and\nfacilitates the use of a novel model for sentence simplification tuned for\nautomatic discourse analysis and information extraction (as opposed to sentence\nsimplification for improving human readability). The model is based on a\n\"shot-gun\" approach that produces many different (simpler) versions of the\noriginal sentence by combining variants of its constituent elements. This tool\nis optimized for processing biomedical scientific literature such as the\nabstracts indexed in PubMed. We tested our tool on its impact to the task of\nPPI extraction and it improved the f-score of the PPI tool by around 7%, with\nan improvement in recall of around 20%. The BioSimplify tool and test corpus\ncan be downloaded from https://biosimplify.sourceforge.net.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2011 15:40:31 GMT"}], "update_date": "2011-07-29", "authors_parsed": [["Jonnalagadda", "Siddhartha", ""], ["Gonzalez", "Graciela", ""]]}, {"id": "1107.5752", "submitter": "Siddhartha Jonnalagadda", "authors": "Siddhartha Jonnalagadda", "title": "An Effective Approach to Biomedical Information Extraction with Limited\n  Training Data", "comments": "This paper has been withdrawn", "journal-ref": "Jonnalagadda S. An effective approach to biomedical information\n  extraction with limited training data (PhD Dissertation, Arizona State\n  University). 2011;", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Overall, the two main contributions of this work include the application of\nsentence simplification to association extraction as described above, and the\nuse of distributional semantics for concept extraction. The proposed work on\nconcept extraction amalgamates for the first time two diverse research areas\n-distributional semantics and information extraction. This approach renders all\nthe advantages offered in other semi-supervised machine learning systems, and,\nunlike other proposed semi-supervised approaches, it can be used on top of\ndifferent basic frameworks and algorithms.\nhttp://gradworks.umi.com/34/49/3449837.html\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2011 15:59:21 GMT"}, {"version": "v2", "created": "Mon, 12 Sep 2011 19:29:29 GMT"}], "update_date": "2011-09-13", "authors_parsed": [["Jonnalagadda", "Siddhartha", ""]]}]