[{"id": "1306.1599", "submitter": "Eckhard Hitzer", "authors": "Eckhard Hitzer", "title": "New Views of Crystal Symmetry", "comments": "4 pages, 4 figures", "journal-ref": "in special issue of The Journal of the Int. Soc. For the\n  Interdisciplinary Study of Symmetry: J. Rebielak (ed.), Proc. of Symmetries\n  of Forms and Structures, Wroclaw and Cracow, Poland, 14-19 Sep. 2009, pp.\n  112-115 (2009)", "doi": null, "report-no": null, "categories": "cond-mat.mtrl-sci cs.GR math.RA physics.hist-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Already Hermann Grassmann's father Justus (1829, 1830) published two works on\nthe geometrical description of crystals, influenced by the earlier works of\nC.S. Weiss (1780-1856) on three main crystal forces governing crystal\nformation. In his 1840 essay on the derivation of crystal shapes from the\ngeneral law of crystal formation Hermann established the notion of a\nthree-dimensional vectorial system of forces with rational coefficients, that\nrepresent the interior crystal structure, regulate its formation, its shape and\nphysical behavior. In the Ausdehnungslehre 1844 (Paragraph 171) he finally\nwrites: I shall conclude this presentation by one of the most beautiful\napplications which can be made of the science treated, i.e. the application to\ncrystal figures (Scholz, 1996). The geometry of crystals thus certainly\ninfluenced the Ausdehnungslehre. In this paper we see how Grassmann's work\ninfluenced Clifford's creation of geometric algebras, which in turn leads to a\nnew geometric description of crystal symmetry suitable for modern computer\nalgebra graphics.\n", "versions": [{"version": "v1", "created": "Fri, 7 Jun 2013 03:25:01 GMT"}], "update_date": "2013-06-10", "authors_parsed": [["Hitzer", "Eckhard", ""]]}, {"id": "1306.1959", "submitter": "Xin Zhao", "authors": "Xin Zhao and Bo Li", "title": "Pattern Recognition and Revealing using Parallel Coordinates Plot", "comments": "8 pages and 6 figures. This paper has been withdrawn by the author\n  due to publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Parallel coordinates plot (PCP) is an excellent tool for multivariate\nvisualization and analysis, but it may fail to reveal inherent structures for\ndatasets with a large number of items. In this paper, we propose a suite of\nnovel clustering, dimension ordering and visualization techniques based on PCP,\nto reveal and highlight hidden structures. First, we propose a continuous\nspline based polycurves design to extract and classify different cluster\naspects of the data. Then, we provide an efficient and optimal correlation\nbased sorting technique to reorder coordinates, as a helpful visualization tool\nfor data analysis. Various results generated by our framework visually\nrepresent much structure, trend and correlation information to guide the user,\nand improve the efficacy of analysis, especially for complex and noisy\ndatasets.\n", "versions": [{"version": "v1", "created": "Sat, 8 Jun 2013 21:18:43 GMT"}, {"version": "v2", "created": "Sun, 3 Nov 2013 21:38:56 GMT"}], "update_date": "2013-11-05", "authors_parsed": [["Zhao", "Xin", ""], ["Li", "Bo", ""]]}, {"id": "1306.2081", "submitter": "Bo Li", "authors": "Bo Li and Henry Johan", "title": "3D model retrieval using global and local radial distances", "comments": "6", "journal-ref": "The International Workshop on Advanced Image Technology\n  (IWAIT2010), 2010", "doi": null, "report-no": null, "categories": "cs.GR cs.CV cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  3D model retrieval techniques can be classified as histogram-based,\nview-based and graph-based approaches. We propose a hybrid shape descriptor\nwhich combines the global and local radial distance features by utilizing the\nhistogram-based and view-based approaches respectively. We define an\narea-weighted global radial distance with respect to the center of the bounding\nsphere of the model and encode its distribution into a 2D histogram as the\nglobal radial distance shape descriptor. We then uniformly divide the bounding\ncube of a 3D model into a set of small cubes and define their centers as local\ncenters. Then, we compute the local radial distance of a point based on the\nnearest local center. By sparsely sampling a set of views and encoding the\nlocal radial distance feature on the rendered views by color coding, we extract\nthe local radial distance shape descriptor. Based on these two shape\ndescriptors, we develop a hybrid radial distance shape descriptor for 3D model\nretrieval. Experiment results show that our hybrid shape descriptor outperforms\nseveral typical histogram-based and view-based approaches.\n", "versions": [{"version": "v1", "created": "Mon, 10 Jun 2013 01:38:09 GMT"}], "update_date": "2013-06-11", "authors_parsed": [["Li", "Bo", ""], ["Johan", "Henry", ""]]}, {"id": "1306.2124", "submitter": "Eckhard Hitzer", "authors": "Eckhard Hitzer", "title": "New views of crystal symmetry guided by profound admiration of the\n  extraordinary works of Grassmann and Clifford", "comments": "11 pages, 8 figures, 2 tables. arXiv admin note: substantial text\n  overlap with arXiv:1306.1599", "journal-ref": "From Past to Future: Gra{\\ss}mann's Work in Context, Gra{\\ss}mann\n  Bicentennial Conference, September 2009, Springer, Basel, pp. 413 - 422\n  (2011)", "doi": "10.1007/978-3-0346-0405-5_36", "report-no": null, "categories": "cond-mat.mtrl-sci cs.GR math.RA math.RT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper shows how beginning with Justus Grassmann's work, Hermann\nGrassmann was influenced in his mathematical thinking by crystallography. H.\nGrassmann's Ausdehnungslehre in turn had a decisive influence on W.K. Clifford\nin the genesis of geometric algebras. Geometric algebras have been expanded to\nconformal geometric algebras, which provide an ideal framework for modern\ncomputer graphics. Within this framework a new visualization of\nthree-dimensional crystallographic space groups has been created. The complex\nbeauty of this new visualization is shown by a range of images of a diamond\ncell. Mathematical details are given in an appendix.\n", "versions": [{"version": "v1", "created": "Mon, 10 Jun 2013 07:45:02 GMT"}], "update_date": "2013-06-11", "authors_parsed": [["Hitzer", "Eckhard", ""]]}, {"id": "1306.2157", "submitter": "Eckhard Hitzer", "authors": "Eckhard Hitzer, Stephen J. Sangwine", "title": "The Orthogonal 2D Planes Split of Quaternions and Steerable Quaternion\n  Fourier Transformations", "comments": "25 pages, 5 figures", "journal-ref": "In E. Hitzer, S. Sangwine (eds.), \"Quaternion and Clifford Fourier\n  transforms and wavelets\", Trends in Mathematics 27, Birkhauser, Basel, 2013", "doi": null, "report-no": null, "categories": "math.RA cs.GR math.CA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The two-sided quaternionic Fourier transformation (QFT) was introduced in\n\\cite{Ell:1993} for the analysis of 2D linear time-invariant\npartial-differential systems. In further theoretical investigations\n\\cite{10.1007/s00006-007-0037-8, EH:DirUP_QFT} a special split of quaternions\nwas introduced, then called $\\pm$split. In the current \\change{chapter} we\nanalyze this split further, interpret it geometrically as \\change{an}\n\\emph{orthogonal 2D planes split} (OPS), and generalize it to a freely\nsteerable split of $\\H$ into two orthogonal 2D analysis planes. The new general\nform of the OPS split allows us to find new geometric interpretations for the\naction of the QFT on the signal. The second major result of this work is a\nvariety of \\emph{new steerable forms} of the QFT, their geometric\ninterpretation, and for each form\\change{,} OPS split theorems, which allow\nfast and efficient numerical implementation with standard FFT software.\n", "versions": [{"version": "v1", "created": "Mon, 10 Jun 2013 10:15:42 GMT"}], "update_date": "2013-06-11", "authors_parsed": [["Hitzer", "Eckhard", ""], ["Sangwine", "Stephen J.", ""]]}, {"id": "1306.3113", "submitter": "Christopher Batty", "authors": "Fang Da, Christopher Batty, Eitan Grinspun", "title": "Multimaterial Front Tracking", "comments": "The paper has been drastically revised and submitted to a journal\n  that requires author anonymity; while this cannot be achieved under arXiv.org\n  policy, we have nevertheless decided to withdraw the paper to reflect our\n  attempt to satisfy anonymity", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the first triangle mesh-based technique for tracking the evolution\nof general three-dimensional multimaterial interfaces undergoing complex\ntopology changes induced by deformations and collisions. Our core\nrepresentation is a non-manifold triangle surface mesh with material labels\nassigned to each half-face to distinguish volumetric regions. We advect the\nvertices of the mesh in a Lagrangian manner, and employ a complete set of\ncollision-safe mesh improvement and topological operations that track and\nupdate material labels. In particular, we develop a unified, collision-safe\nstrategy for handling complex topological operations acting on evolving triple-\nand higher-valence junctions, and a flexible method to merge colliding\nmultimaterial meshes. We demonstrate our approach with a number of challenging\ngeometric flows, including passive advection, normal flow, and mean curvature\nflow.\n", "versions": [{"version": "v1", "created": "Thu, 13 Jun 2013 14:11:28 GMT"}, {"version": "v2", "created": "Tue, 21 Jan 2014 04:02:59 GMT"}], "update_date": "2014-01-22", "authors_parsed": [["Da", "Fang", ""], ["Batty", "Christopher", ""], ["Grinspun", "Eitan", ""]]}, {"id": "1306.3481", "submitter": "Brian Kent", "authors": "Brian R. Kent", "title": "Visualizing Astronomical Data with Blender", "comments": "39 pages, 18 figures. Accepted for publication in the Publications of\n  the Astronomical Society of the Pacific (PASP). A high resolution copy and\n  figures are available at\n  http://www.cv.nrao.edu/~bkent/computing/kentPASP.html along with a companion\n  video, tutorials, and examples", "journal-ref": null, "doi": "10.1086/671412", "report-no": null, "categories": "astro-ph.IM cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Astronomical data take on a multitude of forms -- catalogs, data cubes,\nimages, and simulations. The availability of software for rendering\nhigh-quality three-dimensional graphics lends itself to the paradigm of\nexploring the incredible parameter space afforded by the astronomical sciences.\nThe software program Blender gives astronomers a useful tool for displaying\ndata in a manner used by three-dimensional (3D) graphics specialists and\nanimators. The interface to this popular software package is introduced with\nattention to features of interest in astronomy. An overview of the steps for\ngenerating models, textures, animations, camera work, and renders is outlined.\nAn introduction is presented on the methodology for producing animations and\ngraphics with a variety of astronomical data. Examples from sub-fields of\nastronomy with different kinds of data are shown with resources provided to\nmembers of the astronomical community. An example video showcasing the outlined\nprinciples and features is provided along with scripts and files for sample\nvisualizations.\n", "versions": [{"version": "v1", "created": "Fri, 14 Jun 2013 18:48:09 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Kent", "Brian R.", ""]]}, {"id": "1306.4478", "submitter": "Stefanie Wuhrer", "authors": "Stefanie Wuhrer, Jochen Lang, Motahareh Tekieh and Chang Shu", "title": "Finite Element Based Tracking of Deforming Surfaces", "comments": "additional experiments", "journal-ref": "Graphical Models, 77(1), pp. 1-17, 2015", "doi": "10.1016/j.gmod.2014.10.002", "report-no": null, "categories": "cs.CV cs.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an approach to robustly track the geometry of an object that\ndeforms over time from a set of input point clouds captured from a single\nviewpoint. The deformations we consider are caused by applying forces to known\nlocations on the object's surface. Our method combines the use of prior\ninformation on the geometry of the object modeled by a smooth template and the\nuse of a linear finite element method to predict the deformation. This allows\nthe accurate reconstruction of both the observed and the unobserved sides of\nthe object. We present tracking results for noisy low-quality point clouds\nacquired by either a stereo camera or a depth camera, and simulations with\npoint clouds corrupted by different error terms. We show that our method is\nalso applicable to large non-linear deformations.\n", "versions": [{"version": "v1", "created": "Wed, 19 Jun 2013 10:25:24 GMT"}, {"version": "v2", "created": "Tue, 18 Mar 2014 19:45:52 GMT"}, {"version": "v3", "created": "Tue, 28 Oct 2014 18:40:01 GMT"}], "update_date": "2015-03-31", "authors_parsed": [["Wuhrer", "Stefanie", ""], ["Lang", "Jochen", ""], ["Tekieh", "Motahareh", ""], ["Shu", "Chang", ""]]}]