[{"id": "2004.00557", "submitter": "Lev Reyzin", "authors": "Lev Reyzin", "title": "Statistical Queries and Statistical Algorithms: Foundations and\n  Applications", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a survey of the foundations of statistical queries and their many\napplications to other areas. We introduce the model, give the main definitions,\nand we explore the fundamental theory statistical queries and how how it\nconnects to various notions of learnability. We also give a detailed summary of\nsome of the applications of statistical queries to other areas, including to\noptimization, to evolvability, and to differential privacy.\n", "versions": [{"version": "v1", "created": "Wed, 1 Apr 2020 16:37:10 GMT"}, {"version": "v2", "created": "Thu, 14 May 2020 14:32:38 GMT"}], "update_date": "2020-05-15", "authors_parsed": [["Reyzin", "Lev", ""]]}, {"id": "2004.01348", "submitter": "Vijay Vazirani", "authors": "Vijay V. Vazirani and Mihalis Yannakakis", "title": "Computational Complexity of the Hylland-Zeckhauser Scheme for One-Sided\n  Matching Markets", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC econ.TH math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 1979, Hylland and Zeckhauser \\cite{hylland} gave a simple and general\nscheme for implementing a one-sided matching market using the power of a\npricing mechanism. Their method has nice properties -- it is incentive\ncompatible in the large and produces an allocation that is Pareto optimal --\nand hence it provides an attractive, off-the-shelf method for running an\napplication involving such a market. With matching markets becoming ever more\nprevalant and impactful, it is imperative to finally settle the computational\ncomplexity of this scheme.\n  We present the following partial resolution:\n  1. A combinatorial, strongly polynomial time algorithm for the special case\nof $0/1$ utilities.\n  2. An example that has only irrational equilibria, hence proving that this\nproblem is not in PPAD. Furthermore, its equilibria are disconnected, hence\nshowing that the problem does not admit a convex programming formulation.\n  3. A proof of membership of the problem in the class FIXP.\n  We leave open the (difficult) question of determining if the problem is\nFIXP-hard. Settling the status of the special case when utilities are in the\nset $\\{0, {\\frac 1 2}, 1 \\}$ appears to be even more difficult.\n", "versions": [{"version": "v1", "created": "Fri, 3 Apr 2020 02:53:09 GMT"}, {"version": "v2", "created": "Mon, 6 Apr 2020 18:50:01 GMT"}, {"version": "v3", "created": "Thu, 9 Apr 2020 17:57:41 GMT"}, {"version": "v4", "created": "Fri, 10 Apr 2020 12:17:59 GMT"}, {"version": "v5", "created": "Wed, 15 Apr 2020 04:08:40 GMT"}, {"version": "v6", "created": "Wed, 22 Apr 2020 23:07:41 GMT"}], "update_date": "2020-04-24", "authors_parsed": [["Vazirani", "Vijay V.", ""], ["Yannakakis", "Mihalis", ""]]}, {"id": "2004.01491", "submitter": "Arun U", "authors": "Arun U", "title": "The \"cardinality of extended solution set\" criterion for establishing\n  the intractability of NP problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The intractability of any problem and the randomness of its solutions have an\nobvious intuitive connection. However, the challenge till now has been that\nthere is no practical way to firmly establish if the solution to a problem is\nactually random (or whether it has some hidden undiscovered structure, which\nupon being detected would render it non-random). This has prevented the\nconclusive declaration of hard problems (such as NP) as being definitely\nintractable. For dealing with this, a concept called \"extensibility\" of a\nsequence is developed. Based on this, a criterion termed as \"cardinality of\nextended solution set\" is conceived to ascertain the (non)randomness of any\nsequence. Further, this can then be used to establish the (in)tractability of\nany problem depending on whether its solutions are random or non-random. This\ncriterion is applied to problems such as 2-SAT, 3-SAT and hardness of\napproximation to analyze their (in)tractability. Finally, a proof for the\nvalidity of the Unique Games Conjecture based on the same criterion is also\npresented.\n", "versions": [{"version": "v1", "created": "Thu, 2 Apr 2020 06:15:05 GMT"}], "update_date": "2020-04-06", "authors_parsed": [["U", "Arun", ""]]}, {"id": "2004.01492", "submitter": "Philipp Reichenbach", "authors": "Giorgio Ottaviani and Philipp Reichenbach", "title": "Tensor Rank and Complexity", "comments": "44 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AG cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  These lecture notes are intended as an introduction to several notions of\ntensor rank and their connections to the asymptotic complexity of matrix\nmultiplication. The latter is studied with the exponent of matrix\nmultiplication, which will be expressed in terms of tensor (border) rank,\n(border) symmetric rank and the asymptotic rank of certain tensors. We\nintroduce the multilinear rank of a tensor as well, deal with the concept of\ntensor equivalence and study prehomogeneous vector spaces with the Castling\ntransform. Moreover, we treat Apolarity Theory and use it to determine the\nsymmetric rank (Waring rank) of some symmetric tensors.\n", "versions": [{"version": "v1", "created": "Fri, 3 Apr 2020 12:11:56 GMT"}], "update_date": "2020-04-06", "authors_parsed": [["Ottaviani", "Giorgio", ""], ["Reichenbach", "Philipp", ""]]}, {"id": "2004.02129", "submitter": "Perrot K\\'evin", "authors": "Camille No\\^us and K\\'evin Perrot and Sylvain Sen\\'e and Lucas\n  Venturini", "title": "#P-completeness of counting update digraphs, cacti, and a\n  series-parallel decomposition method", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automata networks are a very general model of interacting entities, with\napplications to biological phenomena such as gene regulation. In many contexts,\nthe order in which entities update their state is unknown, and the dynamics may\nbe very sensitive to changes in this schedule of updates. Since the works of\nAracena et. al, it is known that update digraphs are pertinent objects to study\nnon-equivalent block-sequential update schedules. We prove that counting the\nnumber of equivalence classes, that is a tight upper bound on the synchronism\nsensitivity of a given network, is #P-complete. The problem is nevertheless\ncomputable in quasi-quadratic time for oriented cacti, and for oriented\nseries-parallel graphs thanks to a decomposition method.\n", "versions": [{"version": "v1", "created": "Sun, 5 Apr 2020 08:40:07 GMT"}], "update_date": "2020-04-07", "authors_parsed": [["Noûs", "Camille", ""], ["Perrot", "Kévin", ""], ["Sené", "Sylvain", ""], ["Venturini", "Lucas", ""]]}, {"id": "2004.02163", "submitter": "Aritra Dutta", "authors": "Atal Narayan Sahu and Aritra Dutta and Aashutosh Tiwari and Peter\n  Richt\\'arik", "title": "On the Convergence Analysis of Asynchronous SGD for Solving Consistent\n  Linear Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CC cs.DC cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the realm of big data and machine learning, data-parallel, distributed\nstochastic algorithms have drawn significant attention in the present\ndays.~While the synchronous versions of these algorithms are well understood in\nterms of their convergence, the convergence analyses of their asynchronous\ncounterparts are not widely studied. In this paper, we propose and analyze a\n{\\it distributed, asynchronous parallel} SGD in light of solving an arbitrary\nconsistent linear system by reformulating the system into a stochastic\noptimization problem as studied by Richt\\'{a}rik and Tak\\'{a}\\~{c} in [35]. We\ncompare the convergence rates of our asynchronous SGD algorithm with the\nsynchronous parallel algorithm proposed by Richt\\'{a}rik and Tak\\'{a}\\v{c} in\n[35] under different choices of the hyperparameters---the stepsize, the damping\nfactor, the number of processors, and the delay factor. We show that our\nasynchronous parallel SGD algorithm also enjoys a global linear convergence\nrate, similar to the {\\em basic} method and the synchronous parallel method in\n[35] for solving any arbitrary consistent linear system via stochastic\nreformulation. We also show that our asynchronous parallel SGD improves upon\nthe {\\em basic} method with a better convergence rate when the number of\nprocessors is larger than four. We further show that this asynchronous approach\nperforms asymptotically better than its synchronous counterpart for certain\nlinear systems. Moreover, for certain linear systems, we compute the minimum\nnumber of processors required for which our asynchronous parallel SGD is\nbetter, and find that this number can be as low as two for some ill-conditioned\nproblems.\n", "versions": [{"version": "v1", "created": "Sun, 5 Apr 2020 11:28:29 GMT"}], "update_date": "2020-04-07", "authors_parsed": [["Sahu", "Atal Narayan", ""], ["Dutta", "Aritra", ""], ["Tiwari", "Aashutosh", ""], ["Richtárik", "Peter", ""]]}, {"id": "2004.02338", "submitter": "Ferdinando Cicalese", "authors": "Ferdinando Cicalese and Nicol\\`o Pilati", "title": "The Tandem Duplication Distance Problem is hard over bounded alphabets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A tandem duplication denotes the process of inserting a copy of a segment of\nDNA adjacent to its original position. More formally, a tandem duplication can\nbe thought of as an operation that converts a string $S = AXB$ into a string $T\n= AXXB.$ As they appear to be involved in genetic disorders, tandem\nduplications are widely studied in computational biology. Also, tandem\nduplication mechanisms have been recently studied in different contexts, from\nformal languages, to information theory, to error-correcting codes for DNA\nstorage systems.\n  The problem of determining the complexity of computing the tandem duplication\ndistance between two given strings was proposed by [Leupold et al., 2004] and,\nvery recently, it was shown to be NP-hard for the case of unbounded alphabets\n[Lafond et al., STACS2020]. In this paper, we significantly improve this result\nand show that the tandem duplication distance problem is NP-hard already for\nthe case of strings over an alphabet of size $\\leq 5.$ We also study some\nspecial classes of strings were it is possible to give linear time solutions to\nthe existence problem: given strings $S$ and $T$ over the same alphabet, decide\nwhether there exists a sequence of duplications converting $S$ into $T$. A\npolynomial time algorithm that solves the existence problem was only known for\nthe case of the binary alphabet.\n", "versions": [{"version": "v1", "created": "Sun, 5 Apr 2020 22:30:50 GMT"}, {"version": "v2", "created": "Mon, 15 Mar 2021 10:00:30 GMT"}], "update_date": "2021-03-16", "authors_parsed": [["Cicalese", "Ferdinando", ""], ["Pilati", "Nicolò", ""]]}, {"id": "2004.02448", "submitter": "Jan Kraj\\'i\\v{c}ek", "authors": "Jan Kraj\\'i\\v{c}ek", "title": "A limitation on the KPT interpolation", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 16, Issue 3 (August\n  12, 2020) lmcs:6708", "doi": "10.23638/LMCS-16(3:9)2020", "report-no": null, "categories": "math.LO cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We prove a limitation on a variant of the KPT theorem proposed for\npropositional proof systems by Pich and Santhanam (2020), for all proof systems\nthat prove the disjointness of two NP sets that are hard to distinguish.\n", "versions": [{"version": "v1", "created": "Mon, 6 Apr 2020 07:46:06 GMT"}, {"version": "v2", "created": "Tue, 28 Jul 2020 07:23:07 GMT"}, {"version": "v3", "created": "Tue, 11 Aug 2020 12:16:44 GMT"}], "update_date": "2021-02-10", "authors_parsed": [["Krajíček", "Jan", ""]]}, {"id": "2004.03387", "submitter": "Andreas Tillmann", "authors": "Christian Puchert and Andreas M. Tillmann", "title": "Exact separation of forbidden-set cuts associated with redundant parity\n  checks of binary linear codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CC math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, several integer programming (IP) approaches were developed\nfor maximum-likelihood decoding and minimum distance computation for binary\nlinear codes. Two aspects in particular have been demonstrated to improve the\nperformance of IP solvers as well as adaptive linear programming decoders: the\ndynamic generation of forbidden-set (FS) inequalities, a family of valid\ncutting planes, and the utilization of so-called redundant parity-checks\n(RPCs). However, to date, it had remained unclear how to solve the exact RPC\nseparation problem (i.e., to determine whether or not there exists any violated\nFS inequality w.r.t. any known or unknown parity-check). In this note, we prove\nNP-hardness of this problem. Moreover, we formulate an IP model that combines\nthe search for most violated FS cuts with the generation of RPCs, and report on\ncomputational experiments. Empirically, for various instances of the minimum\ndistance problem, it turns out that while utilizing the exact separation IP\ndoes not appear to provide a computational advantage, it can apparently be\navoided altogether by combining heuristics to generate RPC-based cuts.\n", "versions": [{"version": "v1", "created": "Tue, 7 Apr 2020 13:48:52 GMT"}], "update_date": "2020-04-08", "authors_parsed": [["Puchert", "Christian", ""], ["Tillmann", "Andreas M.", ""]]}, {"id": "2004.03853", "submitter": "Georgina Hall", "authors": "Mihaela Curmei and Georgina Hall", "title": "Shape-Constrained Regression using Sum of Squares Polynomials", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CC math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of fitting a polynomial function to a set of data\npoints, each data point consisting of a feature vector and a response variable.\nIn contrast to standard polynomial regression, we require that the polynomial\nregressor satisfy shape constraints, such as monotonicity,\nLipschitz-continuity, or convexity. We show how to use semidefinite programming\nto obtain polynomial regressors that have these properties. We then prove that,\nunder some assumptions on the generation of the data points, the regressor\nobtained is a consistent estimator of the underlying shape-constrained\nfunction. We follow up with a thorough empirical comparison of our regressor to\nthe convex least squares estimator introduced in [Hildreth 1954, Holloway 1979]\nand show that our regressor can be very valuable in settings where the number\nof data points is large and where new predictions need to be made quickly and\noften. We also propose a method that relies on linear and second-order cone\nprograms to quickly update our regressor when a new batch of data points is\nprovided. We conclude with two novel applications. The first application aims\nto approximate the function that maps a conic program's data to its optimal\nvalue. This enables us to obtain quick estimations of the optimal value without\nsolving the conic program, which can be useful for real-time decision-making.\nWe illustrate this on an example in inventory management contract negotiation.\nIn the second application, we compute optimal transport maps using shape\nconstraints as regularizers following [Paty 2020], and show, via a color\ntransfer example, that this is a setting in which our regressor significantly\noutperforms other methods.\n", "versions": [{"version": "v1", "created": "Wed, 8 Apr 2020 07:39:57 GMT"}, {"version": "v2", "created": "Sat, 29 May 2021 08:32:01 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Curmei", "Mihaela", ""], ["Hall", "Georgina", ""]]}, {"id": "2004.05018", "submitter": "Daniel Paulusma", "authors": "Nick Brettell, Jake Horsfield, Andrea Munaro, Giacomo Paesani, Daniel\n  Paulusma", "title": "Bounding the Mim-Width of Hereditary Graph Classes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A large number of NP-hard graph problems become polynomial-time solvable on\ngraph classes where the mim-width is bounded and quickly computable. Hence,\nwhen solving such problems on special graph classes, it is helpful to know\nwhether the graph class under consideration has bounded mim-width. We first\nextend the toolkit for proving (un)boundedness of mim-width of graph classes.\nThis enables us to initiate a systematic study into bounding mim-width from the\nperspective of hereditary graph classes. For a given graph $H$, the class of\n$H$-free graphs has bounded mim-width if and only if it has bounded\nclique-width. We show that the same is not true for $(H_1,H_2)$-free graphs. We\nfind several general classes of $(H_1,H_2)$-free graphs having unbounded\nclique-width, but the mim-width is bounded and quickly computable. We also\nprove a number of new results showing that, for certain $H_1$ and $H_2$, the\nclass of $(H_1,H_2)$-free graphs has unbounded mim-width. Combining these with\nknown results, we present summary theorems of the current state of the art for\nthe boundedness of mim-width for $(H_1,H_2)$-free graphs.\n", "versions": [{"version": "v1", "created": "Fri, 10 Apr 2020 13:02:31 GMT"}, {"version": "v2", "created": "Mon, 4 May 2020 17:59:47 GMT"}, {"version": "v3", "created": "Wed, 18 Nov 2020 01:06:56 GMT"}], "update_date": "2020-11-19", "authors_parsed": [["Brettell", "Nick", ""], ["Horsfield", "Jake", ""], ["Munaro", "Andrea", ""], ["Paesani", "Giacomo", ""], ["Paulusma", "Daniel", ""]]}, {"id": "2004.05022", "submitter": "Daniel Paulusma", "authors": "Nick Brettell, Jake Horsfield, Daniel Paulusma", "title": "Colouring $(sP_1+P_5)$-Free Graphs: a Mim-Width Perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that the class of $(K_t,sP_1+P_5)$-free graphs has bounded mim-width\nfor every $s\\geq 0$ and $t\\geq 1$, and that there is a polynomial-time\nalgorithm that, given a graph in the class, computes a branch decomposition of\nconstant mim-width. A large number of \\NP-complete graph problems become\npolynomial-time solvable on graph classes with bounded mim-width and for which\na branch decomposition is quickly computable. The $k$-Colouring problem is an\nexample of such a problem. For this problem, we may assume that the input graph\nis $K_{k+1}$-free. Then, as a consequence of our result, we obtain a new proof\nfor the known result that for every fixed $k\\geq 1$ and $s\\geq 0$,\n$k$-Colouring is polynomial-time solvable for $(sP_1+P_5)$-free graphs. In\nfact, our findings show that the underlying reason for this polynomial-time\nalgorithm is that the class has bounded mim-width.\n", "versions": [{"version": "v1", "created": "Fri, 10 Apr 2020 13:12:32 GMT"}, {"version": "v2", "created": "Thu, 23 Apr 2020 19:11:48 GMT"}], "update_date": "2020-04-27", "authors_parsed": [["Brettell", "Nick", ""], ["Horsfield", "Jake", ""], ["Paulusma", "Daniel", ""]]}, {"id": "2004.05548", "submitter": "Ke Chen", "authors": "Ke Chen and Adrian Dumitrescu", "title": "Multiparty Selection", "comments": "12 pages, 2 figures, and new section for finding an approximate\n  median among $k$ players has been added", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Given a sequence $A$ of $n$ numbers and an integer (target) parameter $1\\leq\ni\\leq n$, the (exact) selection problem asks to find the $i$-th smallest\nelement in $A$. An element is said to be $(i,j)$-mediocre if it is neither\namong the top $i$ nor among the bottom $j$ elements of $S$. The approximate\nselection problem asks to find a $(i,j)$-mediocre element for some given $i,j$;\nas such, this variant allows the algorithm to return any element in a\nprescribed range. In the first part, we revisit the selection problem in the\ntwo-party model introduced by Andrew Yao (1979) and then extend our study of\nexact selection to the multiparty model. In the second part, we deduce some\ncommunication complexity benefits that arise in approximate selection. In\nparticular, we present a deterministic protocol for finding an approximate\nmedian among $k$ players.\n", "versions": [{"version": "v1", "created": "Sun, 12 Apr 2020 05:33:39 GMT"}, {"version": "v2", "created": "Tue, 21 Apr 2020 01:12:41 GMT"}], "update_date": "2020-04-22", "authors_parsed": [["Chen", "Ke", ""], ["Dumitrescu", "Adrian", ""]]}, {"id": "2004.05706", "submitter": "Shuai Shao", "authors": "Jin-Yi Cai, Zhiguo Fu and Shuai Shao", "title": "From Holant to Quantum Entanglement and Back", "comments": "46 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Holant problems are intimately connected with quantum theory as tensor\nnetworks. We first use techniques from Holant theory to derive new and improved\nresults for quantum entanglement theory. We discover two particular entangled\nstates $|{\\Psi_6}\\rangle$ of 6 qubits and $|{\\Psi_8}\\rangle$ of 8 qubits\nrespectively, that have extraordinary and unique closure properties in terms of\nthe Bell property. Then we use entanglement properties of constraint functions\nto derive a new complexity dichotomy for all real-valued Holant problems\ncontaining an odd-arity signature. The signatures need not be symmetric, and no\nauxiliary signatures are assumed.\n", "versions": [{"version": "v1", "created": "Sun, 12 Apr 2020 21:58:27 GMT"}], "update_date": "2020-04-14", "authors_parsed": [["Cai", "Jin-Yi", ""], ["Fu", "Zhiguo", ""], ["Shao", "Shuai", ""]]}, {"id": "2004.05875", "submitter": "Igor Potapov", "authors": "Argyrios Deligkas and Igor Potapov", "title": "Optimizing Reachability Sets in Temporal Graphs by Delaying", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A temporal graph is a dynamic graph where every edge is assigned a set of\ninteger time labels that indicate at which discrete time step the edge is\navailable. In this paper, we study how changes of the time labels,\ncorresponding to delays on the availability of the edges, affect the\nreachability sets from given sources. The questions about reachability sets are\nmotivated by numerous applications of temporal graphs in network epidemiology,\nwhich aim to minimise the spread of infection, and scheduling problems in\nsupply networks in manufacturing with the opposite objectives of maximising\ncoverage and productivity. We introduce control mechanisms for reachability\nsets that are based on two natural operations of delaying. The first operation,\ntermed merging, is global and batches together consecutive time labels into a\nsingle time label in the whole network simultaneously. This corresponds to\npostponing all events until a particular time. The second, imposes independent\ndelays on the time labels of every edge of the graph. We provide a thorough\ninvestigation of the computational complexity of different objectives related\nto reachability sets when these operations are used. For the merging operation,\ni.e. global lockdown effect, we prove NP-hardness results for several\nminimization and maximization reachability objectives, even for very simple\ngraph structures. For the second operation, independent delays, we prove that\nthe minimization problems are NP-hard when the number of allowed delays is\nbounded. We complement this with a polynomial-time algorithm for minimising the\nreachability set in case of unbounded delays.\n", "versions": [{"version": "v1", "created": "Mon, 13 Apr 2020 11:36:52 GMT"}, {"version": "v2", "created": "Thu, 12 Nov 2020 16:59:54 GMT"}], "update_date": "2020-11-13", "authors_parsed": [["Deligkas", "Argyrios", ""], ["Potapov", "Igor", ""]]}, {"id": "2004.05922", "submitter": "Nader Bshouty", "authors": "Nader H. Bshouty", "title": "Lecture Note on LCSSX's Lower Bounds for Non-Adaptive Distribution-free\n  Property Testing", "comments": "arXiv admin note: substantial text overlap with arXiv:1802.04859 by\n  other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this lecture note we give Liu-Chen-Servedio-Sheng-Xie's (LCSSX) lower\nbound for property testing in the non-adaptive distribution-free.\n", "versions": [{"version": "v1", "created": "Thu, 9 Apr 2020 11:07:20 GMT"}], "update_date": "2020-04-14", "authors_parsed": [["Bshouty", "Nader H.", ""]]}, {"id": "2004.06036", "submitter": "George Mertzios", "authors": "Argyrios Deligkas, George B. Mertzios, Paul G. Spirakis, and Viktor\n  Zamaraev", "title": "Exact and Approximate Algorithms for Computing a Second Hamiltonian\n  Cycle", "comments": "28 pages, 4 algorithms, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider the following total functional problem: Given a\ncubic Hamiltonian graph $G$ and a Hamiltonian cycle $C_0$ of $G$, how can we\ncompute a second Hamiltonian cycle $C_1 \\neq C_0$ of $G$? Cedric Smith proved\nin 1946, using a non-constructive parity argument, that such a second\nHamiltonian cycle always exists. Our main result is an algorithm which computes\nthe second Hamiltonian cycle in time $O(n \\cdot 2^{(0.3-\\varepsilon)n})$ time,\nfor some positive constant $\\varepsilon>0$, and in polynomial space, thus\nimproving the state of the art running time for solving this problem. Our\nalgorithm is based on a fundamental structural property of Thomason's lollipop\nalgorithm, which we prove here for the first time. In the direction of\napproximating the length of a second cycle in a Hamiltonian graph $G$ with a\ngiven Hamiltonian cycle $C_0$ (where we may not have guarantees on the\nexistence of a second Hamiltonian cycle), we provide a linear-time algorithm\ncomputing a second cycle with length at least $n - 4\\alpha\n(\\sqrt{n}+2\\alpha)+8$, where $\\alpha = \\frac{\\Delta-2}{\\delta-2}$ and\n$\\delta,\\Delta$ are the minimum and the maximum degree of the graph,\nrespectively. This approximation result also improves the state of the art.\n", "versions": [{"version": "v1", "created": "Mon, 13 Apr 2020 16:11:58 GMT"}, {"version": "v2", "created": "Sat, 8 Aug 2020 01:58:09 GMT"}], "update_date": "2020-08-11", "authors_parsed": [["Deligkas", "Argyrios", ""], ["Mertzios", "George B.", ""], ["Spirakis", "Paul G.", ""], ["Zamaraev", "Viktor", ""]]}, {"id": "2004.06439", "submitter": "Troy Lee", "authors": "Aleksandrs Belovs and Troy Lee", "title": "The quantum query complexity of composition with a relation", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The negative weight adversary method, $\\mathrm{ADV}^\\pm(g)$, is known to\ncharacterize the bounded-error quantum query complexity of any Boolean function\n$g$, and also obeys a perfect composition theorem $\\mathrm{ADV}^\\pm(f \\circ\ng^n) = \\mathrm{ADV}^\\pm(f) \\mathrm{ADV}^\\pm(g)$. Belovs gave a modified version\nof the negative weight adversary method, $\\mathrm{ADV}_{rel}^\\pm(f)$, that\ncharacterizes the bounded-error quantum query complexity of a relation $f\n\\subseteq \\{0,1\\}^n \\times [K]$, provided the relation is efficiently\nverifiable. A relation is efficiently verifiable if $\\mathrm{ADV}^\\pm(f_a) =\no(\\mathrm{ADV}_{rel}^\\pm(f))$ for every $a \\in [K]$, where $f_a$ is the Boolean\nfunction defined as $f_a(x) = 1$ if and only if $(x,a) \\in f$. In this note we\nshow a perfect composition theorem for the composition of a relation $f$ with a\nBoolean function $g$ \\[ \\mathrm{ADV}_{rel}^\\pm(f \\circ g^n) =\n\\mathrm{ADV}_{rel}^\\pm(f) \\mathrm{ADV}^\\pm(g) \\enspace . \\] For an efficiently\nverifiable relation $f$ this means $Q(f \\circ g^n) = \\Theta(\n\\mathrm{ADV}_{rel}^\\pm(f) \\mathrm{ADV}^\\pm(g) )$.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2020 12:07:20 GMT"}], "update_date": "2020-04-15", "authors_parsed": [["Belovs", "Aleksandrs", ""], ["Lee", "Troy", ""]]}, {"id": "2004.06455", "submitter": "Konstantinos Meichanetzidis", "authors": "Niel de Beaudrap, Aleks Kissinger, Konstantinos Meichanetzidis", "title": "Tensor Network Rewriting Strategies for Satisfiability and Counting", "comments": "12 pages, submitted to QPL 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC quant-ph", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We provide a graphical treatment of SAT and \\#SAT on equal footing. Instances\nof \\#SAT can be represented as tensor networks in a standard way. These tensor\nnetworks are interpreted by diagrams of the ZH-calculus: a system to reason\nabout tensors over $\\mathbb{C}$ in terms of diagrams built from simple\ngenerators, in which computation may be carried out by \\emph{transformations of\ndiagrams alone}. In general, nodes of ZH diagrams take parameters over\n$\\mathbb{C}$ which determine the tensor coefficients; for the standard\nrepresentation of \\#SAT instances, the coefficients take the value $0$ or $1$.\nThen, by choosing the coefficients of a diagram to range over $\\mathbb B$, we\nrepresent the corresponding instance of SAT. Thus, by interpreting a diagram\neither over the boolean semiring or the complex numbers, we instantiate either\nthe \\emph{decision} or \\emph{counting} version of the problem. We find that for\nclasses known to be in P, such as $2$SAT and \\#XORSAT, the existence of\nappropriate rewrite rules allows for efficient simplification of the diagram,\nproducing the solution in polynomial time. In contrast, for classes known to be\nNP-complete, such as $3$SAT, or \\#P-complete, such as \\#$2$SAT, the\ncorresponding rewrite rules introduce hyperedges to the diagrams, in numbers\nwhich are not easily bounded above by a polynomial. This diagrammatic approach\nunifies the diagnosis of the complexity of CSPs and \\#CSPs and shows promise in\naiding tensor network contraction-based algorithms.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2020 12:50:51 GMT"}], "update_date": "2020-04-15", "authors_parsed": [["de Beaudrap", "Niel", ""], ["Kissinger", "Aleks", ""], ["Meichanetzidis", "Konstantinos", ""]]}, {"id": "2004.06595", "submitter": "Marc Roth", "authors": "Marc Roth and Johannes Schmitt and Philip Wellnitz", "title": "Counting Small Induced Subgraphs Satisfying Monotone Properties", "comments": "33 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": "MPIM-Bonn-2020", "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a graph property $\\Phi$, the problem $\\#\\mathsf{IndSub}(\\Phi)$ asks, on\ninput a graph $G$ and a positive integer $k$, to compute the number of induced\nsubgraphs of size $k$ in $G$ that satisfy $\\Phi$. The search for explicit\ncriteria on $\\Phi$ ensuring that $\\#\\mathsf{IndSub}(\\Phi)$ is hard was\ninitiated by Jerrum and Meeks [J. Comput. Syst. Sci. 15] and is part of the\nmajor line of research on counting small patterns in graphs. However, apart\nfrom an implicit result due to Curticapean, Dell and Marx [STOC 17] proving\nthat a full classification into \"easy\" and \"hard\" properties is possible and\nsome partial results on edge-monotone properties due to Meeks [Discret. Appl.\nMath. 16] and D\\\"orfler et al. [MFCS 19], not much is known.\n  In this work, we fully answer and explicitly classify the case of monotone,\nthat is subgraph-closed, properties: We show that for any non-trivial monotone\nproperty $\\Phi$, the problem $\\#\\mathsf{IndSub}(\\Phi)$ cannot be solved in time\n$f(k)\\cdot |V(G)|^{o(k/ {\\log^{1/2}(k)})}$ for any function $f$, unless the\nExponential Time Hypothesis fails. By this, we establish that any significant\nimprovement over the brute-force approach is unlikely; in the language of\nparameterized complexity, we also obtain a $\\#\\mathsf{W}[1]$-completeness\nresult.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2020 15:26:03 GMT"}], "update_date": "2021-05-14", "authors_parsed": [["Roth", "Marc", ""], ["Schmitt", "Johannes", ""], ["Wellnitz", "Philip", ""]]}, {"id": "2004.06620", "submitter": "Artem Govorov", "authors": "Jin-Yi Cai and Artem Govorov", "title": "Dichotomy for Graph Homomorphisms with Complex Values on Bounded Degree\n  Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The complexity of graph homomorphisms has been a subject of intense study\n[11, 12, 4, 42, 21, 17, 6, 20]. The partition function $Z_{\\mathbf A}(\\cdot)$\nof graph homomorphism is defined by a symmetric matrix $\\mathbf A$ over\n$\\mathbb C$. We prove that the complexity dichotomy of [6] extends to bounded\ndegree graphs. More precisely, we prove that either $G \\mapsto Z_{\\mathbf\nA}(G)$ is computable in polynomial-time for every $G$, or for some $\\Delta > 0$\nit is #P-hard over (simple) graphs $G$ with maximum degree $\\Delta(G) \\le\n\\Delta$. The tractability criterion on $\\mathbf A$ for this dichotomy is\nexplicit, and can be decided in polynomial-time in the size of $\\mathbf A$. We\nalso show that the dichotomy is effective in that either a P-time algorithm\nfor, or a reduction from #SAT to, $Z_{\\mathbf A}(\\cdot)$ can be constructed\nfrom $\\mathbf A$, in the respective cases.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2020 16:07:32 GMT"}], "update_date": "2020-04-15", "authors_parsed": [["Cai", "Jin-Yi", ""], ["Govorov", "Artem", ""]]}, {"id": "2004.06898", "submitter": "Ankit Garg", "authors": "Ankit Garg, Neeraj Kayal, and Chandan Saha", "title": "Learning sums of powers of low-degree polynomials in the non-degenerate\n  case", "comments": "Fixed a minor bug in the statement and proof of Corollary 3.1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop algorithms for writing a polynomial as sums of powers of low\ndegree polynomials. Consider an $n$-variate degree-$d$ polynomial $f$ which can\nbe written as $$f = c_1Q_1^{m} + \\ldots + c_s Q_s^{m},$$ where each $c_i\\in\n\\mathbb{F}^{\\times}$, $Q_i$ is a homogeneous polynomial of degree $t$, and $t m\n= d$. In this paper, we give a $\\text{poly}((ns)^t)$-time learning algorithm\nfor finding the $Q_i$'s given (black-box access to) $f$, if the $Q_i's$ satisfy\ncertain non-degeneracy conditions and $n$ is larger than $d^2$. The set of\ndegenerate $Q_i$'s (i.e., inputs for which the algorithm does not work) form a\nnon-trivial variety and hence if the $Q_i$'s are chosen according to any\nreasonable (full-dimensional) distribution, then they are non-degenerate with\nhigh probability (if $s$ is not too large).\n  Our algorithm is based on a scheme for obtaining a learning algorithm for an\narithmetic circuit model from a lower bound for the same model, provided\ncertain non-degeneracy conditions hold. The scheme reduces the learning problem\nto the problem of decomposing two vector spaces under the action of a set of\nlinear operators, where the spaces and the operators are derived from the input\ncircuit and the complexity measure used in a typical lower bound proof. The\nnon-degeneracy conditions are certain restrictions on how the spaces decompose.\n", "versions": [{"version": "v1", "created": "Wed, 15 Apr 2020 06:18:41 GMT"}, {"version": "v2", "created": "Tue, 16 Jun 2020 08:57:22 GMT"}], "update_date": "2020-06-17", "authors_parsed": [["Garg", "Ankit", ""], ["Kayal", "Neeraj", ""], ["Saha", "Chandan", ""]]}, {"id": "2004.07319", "submitter": "Thomas Bl\\\"asius", "authors": "Thomas Bl\\\"asius, Tobias Friedrich, Andreas G\\\"obel, Jordi Levy, Ralf\n  Rothenberger", "title": "The Impact of Heterogeneity and Geometry on the Proof Complexity of\n  Random Satisfiability", "comments": "50 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.CG cs.DM cs.DS math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Satisfiability is considered the canonical NP-complete problem and is used as\na starting point for hardness reductions in theory, while in practice heuristic\nSAT solving algorithms can solve large-scale industrial SAT instances very\nefficiently. This disparity between theory and practice is believed to be a\nresult of inherent properties of industrial SAT instances that make them\ntractable. Two characteristic properties seem to be prevalent in the majority\nof real-world SAT instances, heterogeneous degree distribution and locality. To\nunderstand the impact of these two properties on SAT, we study the proof\ncomplexity of random k-SAT models that allow to control heterogeneity and\nlocality. Our findings show that heterogeneity alone does not make SAT easy as\nheterogeneous random k-SAT instances have superpolynomial resolution size. This\nimplies intractability of these instances for modern SAT-solvers. On the other\nhand, modeling locality with an underlying geometry leads to small\nunsatisfiable subformulas, which can be found within polynomial time.\n  A key ingredient for the result on geometric random k-SAT can be found in the\ncomplexity of higher-order Voronoi diagrams. As an additional technical\ncontribution, we show a linear upper bound on the number of non-empty Voronoi\nregions, that holds for points with random positions in a very general setting.\nIn particular, it covers arbitrary p-norms, higher dimensions, and weights\naffecting the area of influence of each point multiplicatively. This is in\nstark contrast to quadratic lower bounds for the worst case.\n", "versions": [{"version": "v1", "created": "Wed, 15 Apr 2020 20:10:48 GMT"}], "update_date": "2020-04-17", "authors_parsed": [["Bläsius", "Thomas", ""], ["Friedrich", "Tobias", ""], ["Göbel", "Andreas", ""], ["Levy", "Jordi", ""], ["Rothenberger", "Ralf", ""]]}, {"id": "2004.07492", "submitter": "Daniel Paulusma", "authors": "Hans Bodlaender, Nick Brettell, Matthew Johnson, Giacomo Paesani,\n  Daniel Paulusma, and Erik Jan van Leeuwen", "title": "Steiner Trees for Hereditary Graph Classes: a Treewidth Perspective", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the classical problems (Edge) Steiner Tree and Vertex Steiner\nTree after restricting the input to some class of graphs characterized by a\nsmall set of forbidden induced subgraphs. We show a dichotomy for the former\nproblem restricted to $(H_1,H_2)$-free graphs and a dichotomy for the latter\nproblem restricted to $H$-free graphs. We find that there exists an infinite\nfamily of graphs $H$ such that Vertex Steiner Tree is polynomial-time solvable\nfor $H$-free graphs, whereas there exist only two graphs $H$ for which this\nholds for Edge Steiner Tree. We also find that Edge Steiner Tree is\npolynomial-time solvable for $(H_1,H_2)$-free graphs if and only if the\ntreewidth of the class of $(H_1,H_2)$-free graphs is bounded (subject to P\n$\\neq$ NP). To obtain the latter result, we determine all pairs $(H_1,H_2)$ for\nwhich the class of $(H_1,H_2)$-free graphs has bounded treewidth.\n", "versions": [{"version": "v1", "created": "Thu, 16 Apr 2020 07:27:08 GMT"}, {"version": "v2", "created": "Tue, 15 Dec 2020 19:03:54 GMT"}], "update_date": "2020-12-17", "authors_parsed": [["Bodlaender", "Hans", ""], ["Brettell", "Nick", ""], ["Johnson", "Matthew", ""], ["Paesani", "Giacomo", ""], ["Paulusma", "Daniel", ""], ["van Leeuwen", "Erik Jan", ""]]}, {"id": "2004.07558", "submitter": "Tillmann Miltzow", "authors": "Mikkel Abrahamsen, Tillmann Miltzow, Nadja Seiferth", "title": "Framework for $\\exists \\mathbb{R}$-Completeness of Two-Dimensional\n  Packing Problems", "comments": "98 pages, 60 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.CC cs.DM cs.DS", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We show that many natural two-dimensional packing problems are\nalgorithmically equivalent to finding real roots of multivariate polynomials. A\ntwo-dimensional packing problem is defined by the type of pieces, containers,\nand motions that are allowed. The aim is to decide if a given set of pieces can\nbe placed inside a given container. The pieces must be placed so that they are\npairwise interior-disjoint, and only motions of the allowed type can be used to\nmove them there. We establish a framework which enables us to show that for\nmany combinations of allowed pieces, containers, and motions, the resulting\nproblem is $\\exists\\mathbb R$-complete. This means that the problem is\nequivalent (under polynomial time reductions) to deciding whether a given\nsystem of polynomial equations and inequalities with integer coefficients has a\nreal solution. We consider packing problems where only translations are allowed\nas the motions, and problems where arbitrary rigid motions are allowed, i.e.,\nboth translations and rotations. When rotations are allowed, we show that the\nfollowing combinations of allowed pieces and containers are $\\exists\\mathbb\nR$-complete:\n  $\\bullet$ simple polygons, each of which has at most 8 corners, into a\nsquare,\n  $\\bullet$ convex objects bounded by line segments and hyperbolic curves into\na square,\n  $\\bullet$ convex polygons into a container bounded by line segments and\nhyperbolic curves.\n  Restricted to translations, we show that the following combinations are\n$\\exists\\mathbb R$-complete:\n  $\\bullet$ objects bounded by segments and hyperbolic curves into a square,\n  $\\bullet$ convex polygons into a container bounded by segments and hyperbolic\ncurves.\n", "versions": [{"version": "v1", "created": "Thu, 16 Apr 2020 09:58:07 GMT"}], "update_date": "2020-04-17", "authors_parsed": [["Abrahamsen", "Mikkel", ""], ["Miltzow", "Tillmann", ""], ["Seiferth", "Nadja", ""]]}, {"id": "2004.07798", "submitter": "Neil Lutz", "authors": "Jack H. Lutz, Neil Lutz, Elvira Mayordomo", "title": "Extending the Reach of the Point-to-Set Principle", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC math.CA math.MG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The point-to-set principle of J. Lutz and N. Lutz (2018) has recently enabled\nthe theory of computing to be used to answer open questions about fractal\ngeometry in Euclidean spaces $\\mathbb{R}^n$. These are classical questions,\nmeaning that their statements do not involve computation or related aspects of\nlogic.\n  In this paper we extend the reach of the point-to-set principle from\nEuclidean spaces to arbitrary separable metric spaces $X$. We first extend two\nfractal dimensions--computability-theoretic versions of classical Hausdorff and\npacking dimensions that assign dimensions $\\dim(x)$ and $\\textrm{Dim}(x)$ to\nindividual points $x\\in X$--to arbitrary separable metric spaces and to\narbitrary gauge families. Our first two main results then extend the\npoint-to-set principle to arbitrary separable metric spaces and to a large\nclass of gauge families.\n  We demonstrate the power of our extended point-to-set principle by using it\nto prove new theorems about classical fractal dimensions in hyperspaces. (For a\nconcrete computational example, the stages $E_0, E_1, E_2, \\ldots$ used to\nconstruct a self-similar fractal $E$ in the plane are elements of the\nhyperspace of the plane, and they converge to $E$ in the hyperspace.) Our third\nmain result, proven via our extended point-to-set principle, states that, under\na wide variety of gauge families, the classical packing dimension agrees with\nthe classical upper Minkowski dimension on all hyperspaces of compact sets. We\nuse this theorem to give, for all sets $E$ that are analytic, i.e.,\n$\\mathbf{\\Sigma}^1_1$, a tight bound on the packing dimension of the hyperspace\nof $E$ in terms of the packing dimension of $E$ itself.\n", "versions": [{"version": "v1", "created": "Thu, 16 Apr 2020 17:43:37 GMT"}, {"version": "v2", "created": "Tue, 6 Oct 2020 19:28:01 GMT"}, {"version": "v3", "created": "Sat, 13 Feb 2021 22:53:18 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Lutz", "Jack H.", ""], ["Lutz", "Neil", ""], ["Mayordomo", "Elvira", ""]]}, {"id": "2004.08037", "submitter": "Sajin Koroth", "authors": "Mika G\\\"o\\\"os, Sajin Koroth, Ian Mertz, Toniann Pitassi", "title": "Automating Cutting Planes is NP-Hard}", "comments": "Full version of the conference version at STOC 2020 by the same title", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that Cutting Planes (CP) proofs are hard to find: Given an\nunsatisfiable formula $F$,\n  1) It is NP-hard to find a CP refutation of $F$ in time polynomial in the\nlength of the shortest such refutation; and\n  2)unless Gap-Hitting-Set admits a nontrivial algorithm, one cannot find a\ntree-like CP refutation of $F$ in time polynomial in the length of the shortest\nsuch refutation.\n  The first result extends the recent breakthrough of Atserias and M\\\"uller\n(FOCS 2019) that established an analogous result for Resolution. Our proofs\nrely on two new lifting theorems: (1) Dag-like lifting for gadgets with many\noutput bits. (2) Tree-like lifting that simulates an $r$-round protocol with\ngadgets of query complexity $O(\\log r)$ independent of input length.\n", "versions": [{"version": "v1", "created": "Fri, 17 Apr 2020 02:23:49 GMT"}], "update_date": "2020-04-20", "authors_parsed": [["Göös", "Mika", ""], ["Koroth", "Sajin", ""], ["Mertz", "Ian", ""], ["Pitassi", "Toniann", ""]]}, {"id": "2004.08324", "submitter": "Ignasi Sau", "authors": "Ignasi Sau, U\\'everton S. Souza", "title": "Hitting forbidden induced subgraphs on bounded treewidth graphs", "comments": "24 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a fixed graph $H$, the $H$-IS-Deletion problem asks, given a graph $G$,\nfor the minimum size of a set $S \\subseteq V(G)$ such that $G\\setminus S$ does\nnot contain $H$ as an induced subgraph. Motivated by previous work about\nhitting (topological) minors and subgraphs on bounded treewidth graphs, we are\ninterested in determining, for a fixed graph $H$, the smallest function\n$f_H(t)$ such that $H$-IS-Deletion can be solved in time $f_H(t) \\cdot\nn^{O(1)}$ assuming the Exponential Time Hypothesis (ETH), where $t$ and $n$\ndenote the treewidth and the number of vertices of the input graph,\nrespectively.\n  We show that $f_H(t) = 2^{O(t^{h-2})}$ for every graph $H$ on $h \\geq 3$\nvertices, and that $f_H(t) = 2^{O(t)}$ if $H$ is a clique or an independent\nset. We present a number of lower bounds by generalizing a reduction of Cygan\net al. [MFCS 2014] for the subgraph version. In particular, we show that when\n$H$ deviates slightly from a clique, the function $f_H(t)$ suffers a sharp\njump: if $H$ is obtained from a clique of size $h$ by removing one edge, then\n$f_H(t) = 2^{\\Theta(t^{h-2})}$. We also show that $f_H(t) = 2^{\\Omega(t^{h})}$\nwhen $H=K_{h,h}$, and this reduction answers an open question of Mi. Pilipczuk\n[MFCS 2011] about the function $f_{C_4}(t)$ for the subgraph version.\n  Motivated by Cygan et al. [MFCS 2014], we also consider the colorful variant\nof the problem, where each vertex of $G$ is colored with some color from $V(H)$\nand we require to hit only induced copies of $H$ with matching colors. In this\ncase, we determine, under the ETH, the function $f_H(t)$ for every connected\ngraph $H$ on $h$ vertices: if $h\\leq 2$ the problem can be solved in polynomial\ntime; if $h\\geq 3$, $f_H(t) = 2^{\\Theta(t)}$ if $H$ is a clique, and $f_H(t) =\n2^{\\Theta(t^{h-2})}$ otherwise.\n", "versions": [{"version": "v1", "created": "Fri, 17 Apr 2020 16:12:38 GMT"}], "update_date": "2020-04-20", "authors_parsed": [["Sau", "Ignasi", ""], ["Souza", "Uéverton S.", ""]]}, {"id": "2004.08374", "submitter": "Aleksa Stankovic", "authors": "Aleksa Stankovic", "title": "On Regularity of Max-CSPs and Min-CSPs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study approximability of regular constraint satisfaction problems, i.e.,\nCSPs where each variable in an instance has the same number of occurrences. In\nparticular, we show that for any CSP $\\Lambda$, existence of an $\\alpha$\napproximation algorithm for unweighted regular Max-CSP $\\Lambda$ implies\nexistence of an $\\alpha-o(1)$ approximation algorithm for weighted Max-CSP\n$\\Lambda$ in which regularity of the instances is not imposed. We also give an\nanalogous result for Min-CSPs, and therefore show that up to arbitrarily small\nerror it is sufficient to conduct the study of approximability of CSPs only on\nregular unweighted instances.\n", "versions": [{"version": "v1", "created": "Fri, 17 Apr 2020 17:52:16 GMT"}], "update_date": "2020-04-20", "authors_parsed": [["Stankovic", "Aleksa", ""]]}, {"id": "2004.08454", "submitter": "Alexander Wein", "authors": "Justin Holmgren, Alexander S. Wein", "title": "Counterexamples to the Low-Degree Conjecture", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A conjecture of Hopkins (2018) posits that for certain high-dimensional\nhypothesis testing problems, no polynomial-time algorithm can outperform\nso-called \"simple statistics\", which are low-degree polynomials in the data.\nThis conjecture formalizes the beliefs surrounding a line of recent work that\nseeks to understand statistical-versus-computational tradeoffs via the\nlow-degree likelihood ratio. In this work, we refute the conjecture of Hopkins.\nHowever, our counterexample crucially exploits the specifics of the noise\noperator used in the conjecture, and we point out a simple way to modify the\nconjecture to rule out our counterexample. We also give an example illustrating\nthat (even after the above modification), the symmetry assumption in the\nconjecture is necessary. These results do not undermine the low-degree\nframework for computational lower bounds, but rather aim to better understand\nwhat class of problems it is applicable to.\n", "versions": [{"version": "v1", "created": "Fri, 17 Apr 2020 21:08:11 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Holmgren", "Justin", ""], ["Wein", "Alexander S.", ""]]}, {"id": "2004.08716", "submitter": "Mark Huber", "authors": "Mark Huber", "title": "Fewer colors for perfect simulation of proper colorings", "comments": "The paper contained an error in Lemma 5. The weight of the recycled\n  state is $(k_v - 1) / k_v$, which depends on the neighboring colors in the\n  state. That prevents the output of the algorithm from being uniform", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a graph $G$ and color set $\\{1, \\ldots, k\\}$, a $\\textit{proper\ncoloring}$ is an assignment of a color to each vertex of $G$ such that no two\nvertices connected by an edge are given the same color. The problem of drawing\na proper coloring exactly uniformly from the set of proper colorings is\nwell-studied. Most recently, Bhandari and Chakraborty developed a polynomial\nexpected time randomized algorithm for obtaining such draws when $k > 3\\Delta$,\nwhere $\\Delta$ is the maximum degree of the graph. Their approach used a\nbounding chain together with the coupling from the past protocol. Here a new\nrandomized algorithm is presented based upon the randomness recycler protocol\nintroduced by the author and Fill at FOCS 2000. Given $n$ vertices, this method\ntakes $O(n \\ln (n))$ expected steps when $k > 2.27(\\Delta - 1)$ for all $\\Delta\n\\geq 2$.\n", "versions": [{"version": "v1", "created": "Sat, 18 Apr 2020 22:18:11 GMT"}, {"version": "v2", "created": "Mon, 8 Jun 2020 20:29:17 GMT"}], "update_date": "2020-06-11", "authors_parsed": [["Huber", "Mark", ""]]}, {"id": "2004.08783", "submitter": "Mahmoud Abo Khamis", "authors": "Mahmoud Abo Khamis, Phokion G. Kolaitis, Hung Q. Ngo, Dan Suciu", "title": "Decision Problems in Information Theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.CC math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Constraints on entropies are considered to be the laws of information theory.\nEven though the pursuit of their discovery has been a central theme of research\nin information theory, the algorithmic aspects of constraints on entropies\nremain largely unexplored. Here, we initiate an investigation of decision\nproblems about constraints on entropies by placing several different such\nproblems into levels of the arithmetical hierarchy. We establish the following\nresults on checking the validity over all almost-entropic functions: first,\nvalidity of a Boolean information constraint arising from a monotone Boolean\nformula is co-recursively enumerable; second, validity of \"tight\" conditional\ninformation constraints is in $\\Pi^0_3$. Furthermore, under some restrictions,\nvalidity of conditional information constraints \"with slack\" is in\n$\\Sigma^0_2$, and validity of information inequality constraints involving max\nis Turing equivalent to validity of information inequality constraints (with no\nmax involved). We also prove that the classical implication problem for\nconditional independence statements is co-recursively enumerable.\n", "versions": [{"version": "v1", "created": "Sun, 19 Apr 2020 07:07:20 GMT"}, {"version": "v2", "created": "Mon, 27 Apr 2020 11:05:55 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Khamis", "Mahmoud Abo", ""], ["Kolaitis", "Phokion G.", ""], ["Ngo", "Hung Q.", ""], ["Suciu", "Dan", ""]]}, {"id": "2004.08949", "submitter": "Andris Ambainis", "authors": "Andris Ambainis and Nikita Larka", "title": "Quantum algorithms for computational geometry problems", "comments": "10 pages", "journal-ref": "Proceedings of TQC'2020, LIPICS, vol. 158, article no. 9", "doi": null, "report-no": null, "categories": "cs.CG cs.CC cs.DS quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study quantum algorithms for problems in computational geometry, such as\nPOINT-ON-3-LINES problem. In this problem, we are given a set of lines and we\nare asked to find a point that lies on at least $3$ of these lines.\nPOINT-ON-3-LINES and many other computational geometry problems are known to be\n3SUM-HARD. That is, solving them classically requires time\n$\\Omega(n^{2-o(1)})$, unless there is faster algorithm for the well known 3SUM\nproblem (in which we are given a set $S$ of $n$ integers and have to determine\nif there are $a, b, c \\in S$ such that $a + b + c = 0$). Quantumly, 3SUM can be\nsolved in time $O(n \\log n)$ using Grover's quantum search algorithm. This\nleads to a question: can we solve POINT-ON-3-LINES and other 3SUM-HARD problems\nin $O(n^c)$ time quantumly, for $c<2$? We answer this question affirmatively,\nby constructing a quantum algorithm that solves POINT-ON-3-LINES in time\n$O(n^{1 + o(1)})$. The algorithm combines recursive use of amplitude\namplification with geometrical ideas. We show that the same ideas give $O(n^{1\n+ o(1)})$ time algorithm for many 3SUM-HARD geometrical problems.\n", "versions": [{"version": "v1", "created": "Sun, 19 Apr 2020 20:01:50 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Ambainis", "Andris", ""], ["Larka", "Nikita", ""]]}, {"id": "2004.09002", "submitter": "Edward Farhi", "authors": "Edward Farhi, David Gamarnik, Sam Gutmann", "title": "The Quantum Approximate Optimization Algorithm Needs to See the Whole\n  Graph: A Typical Case", "comments": "19 pages, no figures", "journal-ref": null, "doi": null, "report-no": "MIT-CTP/5198", "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Quantum Approximate Optimization Algorithm can naturally be applied to\ncombinatorial search problems on graphs. The quantum circuit has p applications\nof a unitary operator that respects the locality of the graph. On a graph with\nbounded degree, with p small enough, measurements of distant qubits in the\nstate output by the QAOA give uncorrelated results. We focus on finding big\nindependent sets in random graphs with dn/2 edges keeping d fixed and n large.\nUsing the Overlap Gap Property of almost optimal independent sets in random\ngraphs, and the locality of the QAOA, we are able to show that if p is less\nthan a d-dependent constant times log n, the QAOA cannot do better than finding\nan independent set of size .854 times the optimal for d large. Because the\nlogarithm is slowly growing, even at one million qubits we can only show that\nthe algorithm is blocked if p is in single digits. At higher p the algorithm\n\"sees\" the whole graph and we have no indication that performance is limited.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2020 00:48:02 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Farhi", "Edward", ""], ["Gamarnik", "David", ""], ["Gutmann", "Sam", ""]]}, {"id": "2004.09238", "submitter": "Andreas Galanis", "authors": "Andreas Galanis, Daniel Stefankovic, Eric Vigoda", "title": "The complexity of approximating averages on bounded-degree graphs", "comments": "Minor update to make \"field gadgets\" bipartite (Lemma 30)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that, unless P=NP, there is no polynomial-time algorithm to\napproximate within some multiplicative constant the average size of an\nindependent set in graphs of maximum degree 6. This is a special case of a more\ngeneral result for the hard-core model defined on independent sets weighted by\na parameter $\\lambda>0$. In the general setting, we prove that, unless P=NP,\nfor all $\\Delta\\geq 3$, all $\\lambda>\\lambda_c(\\Delta)$, there is no FPTAS\nwhich applies to all graphs of maximum degree $\\Delta$ for computing the\naverage size of the independent set in the Gibbs distribution, where\n$\\lambda_c(\\Delta)$ is the critical point for the uniqueness/non-uniqueness\nphase transition on the $\\Delta$-regular tree. Moreover, we prove that for\n$\\lambda$ in a dense set of this non-uniqueness region the problem is NP-hard\nto approximate within some constant factor. Our work extends to the\nantiferromagnetic Ising model and generalizes to all 2-spin antiferromagnetic\nmodels, establishing hardness of computing the average magnetization in the\ntree non-uniqueness region.\n  Previously, Schulman, Sinclair and Srivastava (2015) showed that it is\n#P-hard to compute the average magnetization exactly, but no hardness of\napproximation results were known. Hardness results of Sly (2010) and Sly and\nSun (2014) for approximating the partition function do not imply hardness of\ncomputing averages. The new ingredient in our reduction is an intricate\nconstruction of pairs of rooted trees whose marginal distributions at the root\nagree but their derivatives disagree. The main technical contribution is\ncontrolling what marginal distributions and derivatives are achievable and\nusing Cauchy's functional equation to argue existence of the gadgets.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2020 12:41:39 GMT"}, {"version": "v2", "created": "Mon, 14 Sep 2020 16:42:15 GMT"}, {"version": "v3", "created": "Mon, 19 Jul 2021 11:12:35 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Galanis", "Andreas", ""], ["Stefankovic", "Daniel", ""], ["Vigoda", "Eric", ""]]}, {"id": "2004.09312", "submitter": "Peter Hillmann", "authors": "Peter Hillmann, Tobias Uhlig, Gabi Dreo Rodosek, Oliver Rose", "title": "A Novel Multi-Agent System for Complex Scheduling Problems", "comments": null, "journal-ref": "Winter Simulation Conference 2014", "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.CC cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Complex scheduling problems require a large amount computation power and\ninnovative solution methods. The objective of this paper is the conception and\nimplementation of a multi-agent system that is applicable in various problem\ndomains. Independent specialized agents handle small tasks, to reach a\nsuperordinate target. Effective coordination is therefore required to achieve\nproductive cooperation. Role models and distributed artificial intelligence are\nemployed to tackle the resulting challenges. We simulate a NP-hard scheduling\nproblem to demonstrate the validity of our approach. In addition to the general\nagent based framework we propose new simulation-based optimization heuristics\nto given scheduling problems. Two of the described optimization algorithms are\nimplemented using agents. This paper highlights the advantages of the\nagent-based approach, like the reduction in layout complexity, improved control\nof complicated systems, and extendability.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2020 14:04:58 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Hillmann", "Peter", ""], ["Uhlig", "Tobias", ""], ["Rodosek", "Gabi Dreo", ""], ["Rose", "Oliver", ""]]}, {"id": "2004.09806", "submitter": "Guillaume Theyssier", "authors": "Florian Bridoux (LIF), Maximilien Gadouleau, Guillaume Theyssier (I2M)", "title": "Commutative automata networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automata networks are mappings of the form f : Q Z $\\rightarrow$ Q Z , where\nQ is a finite alphabet and Z is a set of entities; they generalise Cellular\nAutomata and Boolean networks. An update schedule dictates when each entity\nupdates its state according to its local function fi : Q Z $\\rightarrow$ Q. One\nmajor question is to study the behaviour of a given automata networks under\ndifferent update schedules. In this paper, we study automata networks that are\ninvariant under many different update schedules. This gives rise to two\ndefinitions, locally commutative and globally commu-tative networks. We\ninvestigate the relation between commutativity and different forms of locality\nof update functions; one main conclusion is that globally commutative networks\nhave strong dynamical properties, while locally commutative networks are much\nless constrained. We also give a complete classification of all globally\ncommutative Boolean networks.\n", "versions": [{"version": "v1", "created": "Tue, 21 Apr 2020 08:05:02 GMT"}], "update_date": "2020-04-22", "authors_parsed": [["Bridoux", "Florian", "", "LIF"], ["Gadouleau", "Maximilien", "", "I2M"], ["Theyssier", "Guillaume", "", "I2M"]]}, {"id": "2004.09938", "submitter": "Ryan Mann", "authors": "Ryan L. Mann, Luke Mathieson, Catherine Greenhill", "title": "On the Parameterised Complexity of Induced Multipartite Graph Parameters", "comments": "9 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DM cs.DS math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a family of graph parameters, called induced multipartite graph\nparameters, and study their computational complexity. First, we consider the\nfollowing decision problem: an instance is an induced multipartite graph\nparameter $p$ and a given graph $G$, and for natural numbers $k\\geq2$ and\n$\\ell$, we must decide whether the maximum value of $p$ over all induced\n$k$-partite subgraphs of $G$ is at most $\\ell$. We prove that this problem is\nW[1]-hard. Next, we consider a variant of this problem, where we must decide\nwhether the given graph $G$ contains a sufficiently large induced $k$-partite\nsubgraph $H$ such that $p(H)\\leq\\ell$. We show that for certain parameters this\nproblem is para-NP-hard, while for others it is fixed-parameter tractable.\n", "versions": [{"version": "v1", "created": "Tue, 21 Apr 2020 12:15:06 GMT"}], "update_date": "2020-04-22", "authors_parsed": [["Mann", "Ryan L.", ""], ["Mathieson", "Luke", ""], ["Greenhill", "Catherine", ""]]}, {"id": "2004.10747", "submitter": "Elena Farahbakhsh Touli", "authors": "Elena Farahbakhsh Touli", "title": "Frechet-Like Distances between Two Merge Trees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this paper is to extend the definition of Frechet distance\nwhich measures the distance between two curves to a distance (Frechet-Like\ndistance) which measures the similarity between two rooted trees. The\ndefinition of Frechet-Like distance is as follows: Tow men start from the roots\nof two trees. When they reach to a node with the degree of more than $2$, they\nconstruct $k-1$ men which $k$ is the outgoing degree of the node and each man\nmonitor a man in another tree (there is a rope between them). The distance is\nthe minimum length of the ropes between the men and the men whom are monitored\nand they all go forward (the geodesic distance between them to the root of the\ntree increases) and reach to the leaves of the trees. Here, I prove that the\nFrechet-Like distance between two trees is SNP-hard to compute.\n  I modify the definition of Frechet-Like distance to measure the distance\nbetween tow merge trees, and I prove the relation between the interleaving\ndistance and the modified Frechet-Like distance.\n", "versions": [{"version": "v1", "created": "Wed, 22 Apr 2020 17:56:56 GMT"}], "update_date": "2020-04-23", "authors_parsed": [["Touli", "Elena Farahbakhsh", ""]]}, {"id": "2004.10873", "submitter": "Guilherme De Castro Mendes Gomes", "authors": "Guilherme C. M. Gomes, S\\'ergio H. Nogueira, Vinicius F. dos Santos", "title": "Some results on Vertex Separator Reconfiguration", "comments": "21 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present the first results on the complexity of the reconfiguration of\nvertex separators under the three most popular rules: token addition/removal,\ntoken jumping, and token sliding. We show that, aside from some trivially\nnegative instances, the first two rules are equivalent to each other and that,\neven if only on a subclass of bipartite graphs, TJ is not equivalent to the\nother two unless $\\mathsf{NP} = \\mathsf{PSPACE}$; we do this by showing a\nrelationship between separators and independent sets in this subclass of\nbipartite graphs. In terms of polynomial time algorithms, we show that every\nclass with a polynomially bounded number of minimal vertex separators admits an\nefficient algorithm under token jumping, then turn our attention to two classes\nthat do not meet this condition: $\\{3P_1, diamond\\}$-free and series-parallel\ngraphs. For the first, we describe a novel characterization, which we use to\nshow that reconfiguring vertex separators under token jumping is always\npossible and that, under token sliding, it can be done in polynomial time; for\nseries-parallel graphs, we also prove that reconfiguration is always possible\nunder TJ and exhibit a polynomial time algorithm to construct the\nreconfiguration sequence.\n", "versions": [{"version": "v1", "created": "Wed, 22 Apr 2020 21:41:12 GMT"}], "update_date": "2020-04-24", "authors_parsed": [["Gomes", "Guilherme C. M.", ""], ["Nogueira", "Sérgio H.", ""], ["Santos", "Vinicius F. dos", ""]]}, {"id": "2004.11173", "submitter": "Ignasi Sau", "authors": "Victor A. Campos, Guilherme C. M. Gomes, Allen Ibiapina, Raul Lopes,\n  Ignasi Sau, Ana Silva", "title": "Coloring Problems on Bipartite Graphs of Small Diameter", "comments": "21 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate a number of coloring problems restricted to bipartite graphs\nwith bounded diameter. First, we investigate the $k$-List Coloring, List\n$k$-Coloring, and $k$-Precoloring Extension problems on bipartite graphs with\ndiameter at most $d$, proving NP-completeness in most cases, and leaving open\nonly the List $3$-Coloring and $3$-Precoloring Extension problems when $d=3$.\n  Some of these results are obtained through a proof that the Surjective\n$C_6$-Homomorphism problem is NP-complete on bipartite graphs with diameter at\nmost four. Although the latter result has been already proved [Vikas, 2017], we\npresent ours as an alternative simpler one. As a byproduct, we also get that\n$3$-Biclique Partition is NP-complete. An attempt to prove this result was\npresented in [Fleischner, Mujuni, Paulusma, and Szeider, 2009], but there was a\nflaw in their proof, which we identify and discuss here.\n  Finally, we prove that the $3$-Fall Coloring problem is NP-complete on\nbipartite graphs with diameter at most four, and prove that NP-completeness for\ndiameter three would also imply NP-completeness of $3$-Precoloring Extension on\ndiameter three, thus closing the previously mentioned open cases. This would\nalso answer a question posed in [Kratochv\\'il, Tuza, and Voigt, 2002].\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2020 14:08:40 GMT"}, {"version": "v2", "created": "Wed, 28 Apr 2021 22:10:54 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Campos", "Victor A.", ""], ["Gomes", "Guilherme C. M.", ""], ["Ibiapina", "Allen", ""], ["Lopes", "Raul", ""], ["Sau", "Ignasi", ""], ["Silva", "Ana", ""]]}, {"id": "2004.11568", "submitter": "Ryan Mann", "authors": "Ryan L. Mann, Tyler Helmuth", "title": "Efficient Algorithms for Approximating Quantum Partition Functions", "comments": "7 pages, 0 figures, published version", "journal-ref": "Journal of Mathematical Physics 62, 022201 (2021)", "doi": "10.1063/5.0013689", "report-no": null, "categories": "cs.DS cs.CC math.CO quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish a polynomial-time approximation algorithm for partition\nfunctions of quantum spin models at high temperature. Our algorithm is based on\nthe quantum cluster expansion of Neto\\v{c}n\\'y and Redig and the cluster\nexpansion approach to designing algorithms due to Helmuth, Perkins, and Regts.\nSimilar results have previously been obtained by related methods, and our main\ncontribution is a simple and slightly sharper analysis for the case of pairwise\ninteractions on bounded-degree graphs.\n", "versions": [{"version": "v1", "created": "Fri, 24 Apr 2020 07:21:43 GMT"}, {"version": "v2", "created": "Mon, 1 Feb 2021 13:59:44 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Mann", "Ryan L.", ""], ["Helmuth", "Tyler", ""]]}, {"id": "2004.11582", "submitter": "Jan Krajicek", "authors": "Jan Krajicek", "title": "Small circuits and dual weak PHP in the universal theory of p-time\n  algorithms", "comments": "Preprint April 2020, revision December 2020", "journal-ref": "ACM Transactions on Computational Logic, 22, 2, Article 11 (May\n  2021)", "doi": "10.1145/3446207", "report-no": null, "categories": "math.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove, under a computational complexity hypothesis, that it is consistent\nwith the true universal theory of p-time algorithms that a specific p-time\nfunction extending $n$ bits to $m \\geq n^2$ bits violates the dual weak\npigeonhole principle: every string $y$ of length $m$ equals the value of the\nfunction for some $x$ of length $n$. The function is the truth-table function\nassigning to a circuit the table of the function it computes and the hypothesis\nis that every language in P has circuits of a fixed polynomial size $n^d$.\n", "versions": [{"version": "v1", "created": "Fri, 24 Apr 2020 07:43:22 GMT"}, {"version": "v2", "created": "Wed, 23 Dec 2020 09:11:58 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Krajicek", "Jan", ""]]}, {"id": "2004.11642", "submitter": "Anindya De", "authors": "Anindya De, Elchanan Mossel and Joe Neeman", "title": "Robust testing of low-dimensional functions", "comments": "We significantly strengthen the results of the previous version. This\n  includes the first fully noise tolerant testers for linear juntas as well as\n  subclasses such as any function of constantly many halfspaces", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A natural problem in high-dimensional inference is to decide if a classifier\n$f:\\mathbb{R}^n \\rightarrow \\{-1,1\\}$ depends on a small number of linear\ndirections of its input data. Call a function $g: \\mathbb{R}^n \\rightarrow\n\\{-1,1\\}$, a linear $k$-junta if it is completely determined by some\n$k$-dimensional subspace of the input space. A recent work of the authors\nshowed that linear $k$-juntas are testable. Thus there exists an algorithm to\ndistinguish between: 1. $f: \\mathbb{R}^n \\rightarrow \\{-1,1\\}$ which is a\nlinear $k$-junta with surface area $s$, 2. $f$ is $\\epsilon$-far from any\nlinear $k$-junta with surface area $(1+\\epsilon)s$, where the query complexity\nof the algorithm is independent of the ambient dimension $n$.\n  Following the surge of interest in noise-tolerant property testing, in this\npaper we prove a noise-tolerant (or robust) version of this result. Namely, we\ngive an algorithm which given any $c>0$, $\\epsilon>0$, distinguishes between 1.\n$f: \\mathbb{R}^n \\rightarrow \\{-1,1\\}$ has correlation at least $c$ with some\nlinear $k$-junta with surface area $s$. 2. $f$ has correlation at most\n$c-\\epsilon$ with any linear $k$-junta with surface area at most $s$. The query\ncomplexity of our tester is $k^{\\mathsf{poly}(s/\\epsilon)}$.\n  Using our techniques, we also obtain a fully noise tolerant tester with the\nsame query complexity for any class $\\mathcal{C}$ of linear $k$-juntas with\nsurface area bounded by $s$. As a consequence, we obtain a fully noise tolerant\ntester with query complexity $k^{O(\\mathsf{poly}(\\log k/\\epsilon))}$ for the\nclass of intersection of $k$-halfspaces (for constant $k$) over the Gaussian\nspace. Our query complexity is independent of the ambient dimension $n$.\nPreviously, no non-trivial noise tolerant testers were known even for a single\nhalfspace.\n", "versions": [{"version": "v1", "created": "Fri, 24 Apr 2020 10:23:12 GMT"}, {"version": "v2", "created": "Tue, 12 Jan 2021 22:59:17 GMT"}], "update_date": "2021-01-14", "authors_parsed": [["De", "Anindya", ""], ["Mossel", "Elchanan", ""], ["Neeman", "Joe", ""]]}, {"id": "2004.11796", "submitter": "Chi-Ning Chou", "authors": "Chi-Ning Chou, Alexander Golovnev, Santhoshini Velusamy", "title": "Optimal Streaming Approximations for all Boolean Max-2CSPs and Max-kSAT", "comments": "Full version for the conference version appearing in FOCS 2020. Fix\n  an error in the algorithm for Max-kSAT", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove tight upper and lower bounds on approximation ratios of all Boolean\nMax-2CSP problems in the streaming model. Specifically, for every type of\nMax-2CSP problem, we give an explicit constant $\\alpha$, s.t. for any\n$\\epsilon>0$ (i) there is an $(\\alpha-\\epsilon)$-streaming approximation using\nspace $O(\\log{n})$; and (ii) any $(\\alpha+\\epsilon)$-streaming approximation\nrequires space $\\Omega(\\sqrt{n})$. This generalizes the celebrated work of\n[Kapralov, Khanna, Sudan SODA 2015; Kapralov, Krachun STOC 2019], who showed\nthat the optimal approximation ratio for Max-CUT was $1/2$.\n  Prior to this work, the problem of determining this ratio was open for all\nother Max-2CSPs. Our results are quite surprising for some specific Max-2CSPs.\nFor the Max-DCUT problem, there was a gap between an upper bound of $1/2$ and a\nlower bound of $2/5$ [Guruswami, Velingker, Velusamy APPROX 2017]. We show that\nneither of these bounds is tight, and the optimal ratio for Max-DCUT is $4/9$.\nWe also establish that the tight approximation for Max-2SAT is $\\sqrt{2}/2$,\nand for Exact Max-2SAT it is $3/4$. As a byproduct, our result gives a\nseparation between space-efficient approximations for Max-2SAT and Exact\nMax-2SAT. This is in sharp contrast to the setting of polynomial-time\nalgorithms with polynomial space, where the two problems are known to be\nequally hard to approximate. Finally, we prove that the tight streaming\napproximation for \\mksat{} is $\\sqrt{2}/2$ for every $k\\geq2$.\n", "versions": [{"version": "v1", "created": "Fri, 24 Apr 2020 15:27:51 GMT"}, {"version": "v2", "created": "Wed, 29 Apr 2020 14:37:14 GMT"}, {"version": "v3", "created": "Thu, 10 Sep 2020 22:41:46 GMT"}, {"version": "v4", "created": "Mon, 11 Jan 2021 21:35:36 GMT"}], "update_date": "2021-01-13", "authors_parsed": [["Chou", "Chi-Ning", ""], ["Golovnev", "Alexander", ""], ["Velusamy", "Santhoshini", ""]]}, {"id": "2004.12002", "submitter": "Jay Mardia", "authors": "Jay Mardia, Hilal Asi, Kabir Aladin Chandrasekher", "title": "Finding Planted Cliques in Sublinear Time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the planted clique problem in which a clique of size $k$ is planted\nin an Erd\\H{o}s-R\\'enyi graph of size $n$ and one wants to recover this planted\nclique. For $k=\\Omega(\\sqrt{n})$, polynomial time algorithms can find the\nplanted clique. The fastest such algorithms run in time linear $O(n^2)$ (or\nnearly linear) in the size of the input [FR10,DGGP14,DM15a]. In this work, we\ninitiate the development of sublinear time algorithms that find the planted\nclique when $k=\\omega(\\sqrt{n \\log \\log n})$. Our algorithms can recover the\nclique in time\n$\\widetilde{O}\\left(n+(\\frac{n}{k})^{3}\\right)=\\widetilde{O}\\left(n^{\\frac{3}{2}}\\right)$\nwhen $k=\\Omega(\\sqrt{n\\log n})$, and in time\n$\\widetilde{O}\\left(n^2/\\exp{\\left(\\frac{k^2}{24n}\\right)}\\right)$ for\n$\\omega(\\sqrt{n\\log \\log n})=k=o(\\sqrt{n\\log{n}})$. An ${\\Omega}(n)$ running\ntime lower bound for the planted clique recovery problem follows easily from\nthe results of [RS19] and therefore our recovery algorithms are optimal\nwhenever $k = \\Omega(n^{\\frac{2}{3}})$. As the lower bound of [RS19] builds on\npurely information theoretic arguments, it cannot provide a detection lower\nbound stronger than $\\widetilde{\\Omega}(\\frac{n^2}{k^2})$. Since our algorithms\nfor $k = \\Omega(\\sqrt{n \\log n})$ run in time\n$\\widetilde{O}\\left(\\frac{n^3}{k^3} + n\\right)$, we show stronger lower bounds\nbased on computational hardness assumptions. With a slightly different notion\nof the planted clique problem we show that the Planted Clique Conjecture\nimplies the following. A natural family of non-adaptive algorithms---which\nincludes our algorithms for clique detection---cannot reliably solve the\nplanted clique detection problem in time $O\\left(\n\\frac{n^{3-\\delta}}{k^3}\\right)$ for any constant $\\delta>0$. Thus we provide\nevidence that if detecting small cliques is hard, it is also likely that\ndetecting large cliques is not \\textit{too} easy.\n", "versions": [{"version": "v1", "created": "Fri, 24 Apr 2020 21:44:16 GMT"}, {"version": "v2", "created": "Thu, 27 Aug 2020 22:54:45 GMT"}], "update_date": "2020-08-31", "authors_parsed": [["Mardia", "Jay", ""], ["Asi", "Hilal", ""], ["Chandrasekher", "Kabir Aladin", ""]]}, {"id": "2004.12063", "submitter": "Alexander Wein", "authors": "David Gamarnik, Aukosh Jagannath, Alexander S. Wein", "title": "Low-Degree Hardness of Random Optimization Problems", "comments": "32 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS math-ph math.MP math.PR stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of finding nearly optimal solutions of optimization\nproblems with random objective functions. Such problems arise widely in the\ntheory of random graphs, theoretical computer science, and statistical physics.\nTwo concrete problems we consider are (a) optimizing the Hamiltonian of a\nspherical or Ising p-spin glass model, and (b) finding a large independent set\nin a sparse Erdos-Renyi graph. Two families of algorithms are considered: (a)\nlow-degree polynomials of the input---a general framework that captures methods\nsuch as approximate message passing and local algorithms on sparse graphs,\namong others; and (b) the Langevin dynamics algorithm, a canonical Monte Carlo\nanalogue of the gradient descent algorithm (applicable only for the spherical\np-spin glass Hamiltonian).\n  We show that neither family of algorithms can produce nearly optimal\nsolutions with high probability. Our proof uses the fact that both models are\nknown to exhibit a variant of the overlap gap property (OGP) of near-optimal\nsolutions. Specifically, for both models, every two solutions whose objectives\nare above a certain threshold are either close or far from each other. The crux\nof our proof is the stability of both algorithms: a small perturbation of the\ninput induces a small perturbation of the output. By an interpolation argument,\nsuch a stable algorithm cannot overcome the OGP barrier.\n  The stability of the Langevin dynamics is an immediate consequence of the\nwell-posedness of stochastic differential equations. The stability of\nlow-degree polynomials is established using concepts from Gaussian and Boolean\nFourier analysis, including noise sensitivity, hypercontractivity, and total\ninfluence.\n", "versions": [{"version": "v1", "created": "Sat, 25 Apr 2020 05:45:59 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Gamarnik", "David", ""], ["Jagannath", "Aukosh", ""], ["Wein", "Alexander S.", ""]]}, {"id": "2004.12166", "submitter": "\\'Edouard Bonnet", "authors": "\\'Edouard Bonnet, St\\'ephan Thomass\\'e, Xuan Thang Tran, R\\'emi\n  Watrigant", "title": "An algorithmic weakening of the Erd\\H{o}s-Hajnal conjecture", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the approximability of the Maximum Independent Set (MIS) problem in\n$H$-free graphs (that is, graphs which do not admit $H$ as an induced\nsubgraph). As one motivation we investigate the following conjecture: for every\nfixed graph $H$, there exists a constant $\\delta > 0$ such that MIS can be\n$n^{1 - \\delta}$-approximated in $H$-free graphs, where $n$ denotes the number\nof vertices of the input graph. We first prove that a constructive version of\nthe celebrated Erd\\H{o}s-Hajnal conjecture implies ours. We then prove that the\nset of graphs $H$ satisfying our conjecture is closed under the so-called graph\nsubstitution. This, together with the known polynomial-time algorithms for MIS\nin $H$-free graphs (e.g. $P_6$-free and fork-free graphs), implies that our\nconjecture holds for many graphs $H$ for which the Erd\\H{o}s-Hajnal conjecture\nis still open. We then focus on improving the constant $\\delta$ for some graph\nclasses: we prove that the classical Local Search algorithm provides an\n$OPT^{1-\\frac{1}{t}}$-approximation in $K_{t,t}$-free graphs (hence a\n$\\sqrt{OPT}$-approximation in $C_4$-free graphs), and, while there is a simple\n$\\sqrt{n}$-approximation in triangle-free graphs, it cannot be improved to\n$n^{\\frac{1}{4}-\\varepsilon}$ for any $\\varepsilon > 0$ unless $NP \\subseteq\nBPP$. More generally, we show that there is a constant $c$ such that MIS in\ngraphs of girth $\\gamma$ cannot be $n^{\\frac{c}{\\gamma}}$-approximated. Up to a\nconstant factor in the exponent, this matches the ratio of a known\napproximation algorithm by Monien and Speckenmeyer, and by Murphy. To the best\nof our knowledge, this is the first strong (i.e., $\\Omega(n^\\delta)$ for some\n$\\delta > 0$) inapproximability result for Maximum Independent Set in a proper\nhereditary class.\n", "versions": [{"version": "v1", "created": "Sat, 25 Apr 2020 15:11:59 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Bonnet", "Édouard", ""], ["Thomassé", "Stéphan", ""], ["Tran", "Xuan Thang", ""], ["Watrigant", "Rémi", ""]]}, {"id": "2004.12683", "submitter": "Astrid Pieterse", "authors": "Eva-Maria C. Hols, Stefan Kratsch, Astrid Pieterse", "title": "Approximate Turing Kernelization for Problems Parameterized by Treewidth", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We extend the notion of lossy kernelization, introduced by Lokshtanov et al.\n[STOC 2017], to approximate Turing kernelization. An $\\alpha$-approximate\nTuring kernel for a parameterized optimization problem is a polynomial-time\nalgorithm that, when given access to an oracle that outputs $c$-approximate\nsolutions in $O(1)$ time, obtains an $(\\alpha \\cdot c)$-approximate solution to\nthe considered problem, using calls to the oracle of size at most $f(k)$ for\nsome function $f$ that only depends on the parameter.\n  Using this definition, we show that Independent Set parameterized by\ntreewidth $\\ell$ has a $(1+\\varepsilon)$-approximate Turing kernel with\n$O(\\frac{\\ell^2}{\\varepsilon})$ vertices, answering an open question posed by\nLokshtanov et al. [STOC 2017]. Furthermore, we give\n$(1+\\varepsilon)$-approximate Turing kernels for the following graph problems\nparameterized by treewidth: Vertex Cover, Edge Clique Cover, Edge-Disjoint\nTriangle Packing and Connected Vertex Cover.\n  We generalize the result for Independent Set and Vertex Cover, by showing\nthat all graph problems that we will call \"friendly\" admit\n$(1+\\varepsilon)$-approximate Turing kernels of polynomial size when\nparameterized by treewidth. We use this to obtain approximate Turing kernels\nfor Vertex-Disjoint $H$-packing for connected graphs $H$, Clique Cover,\nFeedback Vertex Set and Edge Dominating Set.\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2020 10:00:50 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Hols", "Eva-Maria C.", ""], ["Kratsch", "Stefan", ""], ["Pieterse", "Astrid", ""]]}, {"id": "2004.12692", "submitter": "Dimitrios Thilikos", "authors": "Ignasi Sau, Giannos Stamoulis, Dimitrios M. Thilikos", "title": "k-apices of minor-closed graph classes. II. Parameterized algorithms", "comments": "37 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let ${\\cal G}$ be a minor-closed graph class. We say that a graph $G$ is a\n$k$-apex of ${\\cal G}$ if $G$ contains a set $S$ of at most $k$ vertices such\nthat $G\\setminus S$ belongs to ${\\cal G}$. We denote by ${\\cal A}_k ({\\cal G})$\nthe set of all graphs that are $k$-apices of ${\\cal G}.$ In the first paper of\nthis series we obtained upper bounds on the size of the graphs in the\nminor-obstruction set of ${\\cal A}_k ({\\cal G})$, i.e., the minor-minimal set\nof graphs not belonging to ${\\cal A}_k ({\\cal G}).$ In this article we provide\nan algorithm that, given a graph $G$ on $n$ vertices, runs in $2^{{\\sf\npoly}(k)}\\cdot n^3$-time and either returns a set $S$ certifying that $G \\in\n{\\cal A}_k ({\\cal G})$, or reports that $G \\notin {\\cal A}_k ({\\cal G})$. Here\n${\\sf poly}$ is a polynomial function whose degree depends on the maximum size\nof a minor-obstruction of ${\\cal G}.$ In the special case where ${\\cal G}$\nexcludes some apex graph as a minor, we give an alternative algorithm running\nin $2^{{\\sf poly}(k)}\\cdot n^2$-time.\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2020 10:26:00 GMT"}, {"version": "v2", "created": "Tue, 2 Mar 2021 10:26:19 GMT"}], "update_date": "2021-03-03", "authors_parsed": [["Sau", "Ignasi", ""], ["Stamoulis", "Giannos", ""], ["Thilikos", "Dimitrios M.", ""]]}, {"id": "2004.12739", "submitter": "Nils Vortmeier", "authors": "Samir Datta, Pankaj Kumar, Anish Mukherjee, Anuj Tawari, Nils\n  Vortmeier, Thomas Zeume", "title": "Dynamic complexity of Reachability: How many changes can we handle?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 2015, it was shown that reachability for arbitrary directed graphs can be\nupdated by first-order formulas after inserting or deleting single edges.\nLater, in 2018, this was extended for changes of size $\\frac{\\log n}{\\log \\log\nn}$, where $n$ is the size of the graph. Changes of polylogarithmic size can be\nhandled when also majority quantifiers may be used.\n  In this paper we extend these results by showing that, for changes of\npolylogarithmic size, first-order update formulas suffice for maintaining (1)\nundirected reachability, and (2) directed reachability under insertions. For\nclasses of directed graphs for which efficient parallel algorithms can compute\nnon-zero circulation weights, reachability can be maintained with update\nformulas that may use \"modulo 2\" quantifiers under changes of polylogarithmic\nsize. Examples for these classes include the class of planar graphs and graphs\nwith bounded treewidth. The latter is shown here.\n  As the logics we consider cannot maintain reachability under changes of\nlarger sizes, our results are optimal with respect to the size of the changes.\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2020 12:27:37 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Datta", "Samir", ""], ["Kumar", "Pankaj", ""], ["Mukherjee", "Anish", ""], ["Tawari", "Anuj", ""], ["Vortmeier", "Nils", ""], ["Zeume", "Thomas", ""]]}, {"id": "2004.12849", "submitter": "Hadyn Tang", "authors": "Hadyn Tang", "title": "On the NP-Completeness of Satisfying Certain Path and Loop Puzzles", "comments": "15 pages, 21 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  \"Eye-Witless\", \"Haisu\" and \"Oriental House\" are genres of logic puzzles\ninvented by William Hu, and \"Detour\" is a genre of logic puzzle invented by\nonline user Guowen Zhang. Each of these puzzles revolves around constructing a\npath or loop through the cells of a grid according to certain constraints given\nby clues in the grid. We prove that deciding whether a particular puzzle in\neach of these genres is solvable is NP-complete.\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2020 01:45:52 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Tang", "Hadyn", ""]]}, {"id": "2004.12865", "submitter": "Ignasi Sau", "authors": "Marin Bougeret, Bart M. P. Jansen, Ignasi Sau", "title": "Bridge-Depth Characterizes which Structural Parameterizations of Vertex\n  Cover Admit a Polynomial Kernel", "comments": "35 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CC math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the kernelization complexity of structural parameterizations of the\nVertex Cover problem. Here, the goal is to find a polynomial-time preprocessing\nalgorithm that can reduce any instance $(G,k)$ of the Vertex Cover problem to\nan equivalent one, whose size is polynomial in the size of a pre-determined\ncomplexity parameter of $G$. A long line of previous research deals with\nparameterizations based on the number of vertex deletions needed to reduce $G$\nto a member of a simple graph class $\\mathcal{F}$, such as forests, graphs of\nbounded tree-depth, and graphs of maximum degree two. We set out to find the\nmost general graph classes $\\mathcal{F}$ for which Vertex Cover parameterized\nby the vertex-deletion distance of the input graph to $\\mathcal{F}$, admits a\npolynomial kernelization. We give a complete characterization of the\nminor-closed graph families $\\mathcal{F}$ for which such a kernelization\nexists. We introduce a new graph parameter called bridge-depth, and prove that\na polynomial kernelization exists if and only if $\\mathcal{F}$ has bounded\nbridge-depth. The proof is based on an interesting connection between\nbridge-depth and the size of minimal blocking sets in graphs, which are vertex\nsets whose removal decreases the independence number.\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2020 15:19:29 GMT"}], "update_date": "2020-04-28", "authors_parsed": [["Bougeret", "Marin", ""], ["Jansen", "Bart M. P.", ""], ["Sau", "Ignasi", ""]]}, {"id": "2004.12942", "submitter": "Subhamoy Maitra", "authors": "Chandra Sekhar Mukherjee and Subhamoy Maitra", "title": "Classical-Quantum Separations in Certain Classes of Boolean Functions--\n  Analysis using the Parity Decision Trees", "comments": "Fixed Typographical error in Lemma-8", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study the separation between the deterministic (classical)\nquery complexity ($D$) and the exact quantum query complexity ($Q_E$) of\nseveral Boolean function classes using the parity decision tree method. We\nfirst define the Query Friendly (QF) functions on $n$ variables as the ones\nwith minimum deterministic query complexity $(D(f))$. We observe that for each\n$n$, there exists a non-separable class of QF functions such that\n$D(f)=Q_E(f)$. Further, we show that for some values of $n$, all the QF\nfunctions are non-separable. Then we present QF functions for certain other\nvalues of $n$ where separation can be demonstrated, in particular,\n$Q_E(f)=D(f)-1$. In a related effort, we also study the Maiorana McFarland\n(M-M) type Bent functions. We show that while for any M-M Bent function $f$ on\n$n$ variables $D(f) = n$, separation can be achieved as $\\frac{n}{2} \\leq\nQ_E(f) \\leq \\lceil \\frac{3n}{4} \\rceil$. Our results highlight how different\nclasses of Boolean functions can be analyzed for classical-quantum separation\nexploiting the parity decision tree method.\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2020 16:58:39 GMT"}, {"version": "v2", "created": "Wed, 12 Aug 2020 10:50:06 GMT"}, {"version": "v3", "created": "Fri, 4 Sep 2020 12:34:00 GMT"}], "update_date": "2020-09-07", "authors_parsed": [["Mukherjee", "Chandra Sekhar", ""], ["Maitra", "Subhamoy", ""]]}, {"id": "2004.13231", "submitter": "Robin Kothari", "authors": "Scott Aaronson, Shalev Ben-David, Robin Kothari, Avishay Tal", "title": "Quantum Implications of Huang's Sensitivity Theorem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on the recent breakthrough of Huang (2019), we show that for any total\nBoolean function $f$, the deterministic query complexity, $D(f)$, is at most\nquartic in the quantum query complexity, $Q(f)$: $D(f) = O(Q(f)^4)$. This\nmatches the known separation (up to log factors) due to Ambainis, Balodis,\nBelovs, Lee, Santha, and Smotrovs (2017). We also use the result to resolve the\nquantum analogue of the Aanderaa-Karp-Rosenberg conjecture. We show that if $f$\nis a nontrivial monotone graph property of an $n$-vertex graph specified by its\nadjacency matrix, then $Q(f) = \\Omega(n)$, which is also optimal.\n", "versions": [{"version": "v1", "created": "Tue, 28 Apr 2020 00:54:23 GMT"}], "update_date": "2020-04-29", "authors_parsed": [["Aaronson", "Scott", ""], ["Ben-David", "Shalev", ""], ["Kothari", "Robin", ""], ["Tal", "Avishay", ""]]}, {"id": "2004.13302", "submitter": "Benjamin Rossman", "authors": "Deepanshu Kush and Benjamin Rossman", "title": "Tree-depth and the Formula Complexity of Subgraph Isomorphism", "comments": "49 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a fixed \"pattern\" graph $G$, the $\\textit{colored $G$-subgraph\nisomorphism problem}$ (denoted $\\mathrm{SUB}(G)$) asks, given an $n$-vertex\ngraph $H$ and a coloring $V(H) \\to V(G)$, whether $H$ contains a properly\ncolored copy of $G$. The complexity of this problem is tied to parameterized\nversions of $\\mathit{P}$ ${=}?$ $\\mathit{NP}$ and $\\mathit{L}$ ${=}?$\n$\\mathit{NL}$, among other questions. An overarching goal is to understand the\ncomplexity of $\\mathrm{SUB}(G)$, under different computational models, in terms\nof natural invariants of the pattern graph $G$.\n  In this paper, we establish a close relationship between the $\\textit{formula\ncomplexity}$ of $\\mathrm{SUB}$ and an invariant known as $\\textit{tree-depth}$\n(denoted $\\mathrm{td}(G)$). $\\mathrm{SUB}(G)$ is known to be solvable by\nmonotone $\\mathit{AC^0}$ formulas of size $O(n^{\\mathrm{td}(G)})$. Our main\nresult is an $n^{\\tilde\\Omega(\\mathrm{td}(G)^{1/3})}$ lower bound for formulas\nthat are monotone $\\textit{or}$ have sub-logarithmic depth. This complements a\nlower bound of Li, Razborov and Rossman (SICOMP 2017) relating tree-width and\n$\\mathit{AC^0}$ circuit size. As a corollary, it implies a stronger\nhomomorphism preservation theorem for first-order logic on finite structures\n(Rossman, ITCS 2017).\n  The technical core of this result is an $n^{\\Omega(k)}$ lower bound in the\nspecial case where $G$ is a complete binary tree of height $k$, which we\nestablish using the $\\textit{pathset framework}$ introduced in (Rossman, SICOMP\n2018). (The lower bound for general patterns follows via a recent\nexcluded-minor characterization of tree-depth (Czerwi\\'nski et al,\narXiv:1904.13077).) Additional results of this paper extend the pathset\nframework and improve upon both, the best known upper and lower bounds on the\naverage-case formula size of $\\mathrm{SUB}(G)$ when $G$ is a path.\n", "versions": [{"version": "v1", "created": "Tue, 28 Apr 2020 05:10:12 GMT"}], "update_date": "2020-04-29", "authors_parsed": [["Kush", "Deepanshu", ""], ["Rossman", "Benjamin", ""]]}, {"id": "2004.13602", "submitter": "Olivier Spanjaard", "authors": "Bruno Escoffier, Olivier Spanjaard, Magdal\\'ena Tydrichov\\'a", "title": "Recognizing Single-Peaked Preferences on an Arbitrary Graph: Complexity\n  and Algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is devoted to a study of single-peakedness on arbitrary graphs.\nGiven a collection of preferences (rankings of a set of alternatives), we aim\nat determining a connected graph G on which the preferences are single-peaked,\nin the sense that all the preferences are traversals of G. Note that a\ncollection of preferences is always single-peaked on the complete graph. We\npropose an Integer Linear Programming formulation (ILP) of the problem of\nminimizing the number of edges in G or the maximum degree of a vertex in G. We\nprove that both problems are NP-hard in the general case. However, we show that\nif the optimal number of edges is m-1 (where m is the number of candidates)\nthen any optimal solution of the ILP is integer and thus the integrality\nconstraints can be relaxed. This provides an alternative proof of the\npolynomial-time complexity of recognizing single-peaked preferences on a tree.\nWe prove the same result for the case of a path (an axis), providing here also\nan alternative proof of polynomiality of the recognition problem. Furthermore,\nwe provide a polynomial-time procedure to recognize single-peaked preferences\non a pseudotree (a connected graph that contains at most one cycle). We also\ngive some experimental results, both on real and synthetic datasets.\n", "versions": [{"version": "v1", "created": "Sat, 11 Apr 2020 13:44:20 GMT"}], "update_date": "2020-04-29", "authors_parsed": [["Escoffier", "Bruno", ""], ["Spanjaard", "Olivier", ""], ["Tydrichová", "Magdaléna", ""]]}, {"id": "2004.13881", "submitter": "Aymen Hamrouni", "authors": "Aymen Hamrouni, Hakim Ghazzai, Turki Alelyani, and Yehia Massoud", "title": "A Stochastic Team Formation Approach for Collaborative Mobile\n  Crowdsourcing", "comments": "This paper is accepted for publication in 2019 31st International\n  Conference on Microelectronics (ICM)", "journal-ref": "2019 31st International Conference on Microelectronics (ICM),\n  Cairo, Egypt, 2019, pp. 66-69", "doi": "10.1109/ICM48031.2019.9021910", "report-no": null, "categories": "cs.CY cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile Crowdsourcing (MCS) is the generalized act of outsourcing sensing\ntasks, traditionally performed by employees or contractors, to a large group of\nsmart-phone users by means of an open call. With the increasing complexity of\nthe crowdsourcing applications, requesters find it essential to harness the\npower of collaboration among the workers by forming teams of skilled workers\nsatisfying their complex tasks' requirements. This type of MCS is called\nCollaborative MCS (CMCS). Previous CMCS approaches have mainly focused only on\nthe aspect of team skills maximization. Other team formation studies on social\nnetworks (SNs) have only focused on social relationship maximization. In this\npaper, we present a hybrid approach where requesters are able to hire a team\nthat, not only has the required expertise, but also is socially connected and\ncan accomplish tasks collaboratively. Because team formation in CMCS is proven\nto be NP-hard, we develop a stochastic algorithm that exploit workers knowledge\nabout their SN neighbors and asks a designated leader to recruit a suitable\nteam. The proposed algorithm is inspired from the optimal stopping strategies\nand uses the odds-algorithm to compute its output. Experimental results show\nthat, compared to the benchmark exponential optimal solution, the proposed\napproach reduces computation time and produces reasonable performance results.\n", "versions": [{"version": "v1", "created": "Tue, 28 Apr 2020 22:44:37 GMT"}], "update_date": "2020-04-30", "authors_parsed": [["Hamrouni", "Aymen", ""], ["Ghazzai", "Hakim", ""], ["Alelyani", "Turki", ""], ["Massoud", "Yehia", ""]]}, {"id": "2004.14147", "submitter": "Anamay Tengse", "authors": "Prerona Chatterjee, Mrinal Kumar, C. Ramya, Ramprasad Saptharishi,\n  Anamay Tengse", "title": "On the Existence of Algebraically Natural Proofs", "comments": "Major changes from previous version: * We now use the phrase\n  'equations for a class' instead of 'defining equations for a class'. * The\n  main theorem for VP now uses the result of Heintz and Schnorr (1980) for\n  existence of efficient hitting sets", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  For every constant c > 0, we show that there is a family {P_{N, c}} of\npolynomials whose degree and algebraic circuit complexity are polynomially\nbounded in the number of variables, that satisfies the following properties:\n  * For every family {f_n} of polynomials in VP, where f_n is an n variate\npolynomial of degree at most n^c with bounded integer coefficients and for N =\n\\binom{n^c + n}{n}, P_{N,c} \\emph{vanishes} on the coefficient vector of f_n.\n  * There exists a family {h_n} of polynomials where h_n is an n variate\npolynomial of degree at most n^c with bounded integer coefficients such that\nfor N = \\binom{n^c + n}{n}, P_{N,c} \\emph{does not vanish} on the coefficient\nvector of h_n.\n  In other words, there are efficiently computable equations for polynomials in\nVP that have small integer coefficients. In fact, we also prove an analogous\nstatement for the seemingly larger class VNP. Thus, in this setting of\npolynomials with small integer coefficients, this provides evidence\n\\emph{against} a natural proof like barrier for proving algebraic circuit lower\nbounds, a framework for which was proposed in the works of Forbes, Shpilka and\nVolk (2018), and Grochow, Kumar, Saks and Saraf (2017).\n  Our proofs are elementary and rely on the existence of (non-explicit) hitting\nsets for VP (and VNP) to show that there are efficiently constructible, low\ndegree equations for these classes. Our proofs also extend to finite fields of\nsmall size.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2020 12:50:29 GMT"}, {"version": "v2", "created": "Fri, 8 Jan 2021 07:35:57 GMT"}], "update_date": "2021-01-11", "authors_parsed": [["Chatterjee", "Prerona", ""], ["Kumar", "Mrinal", ""], ["Ramya", "C.", ""], ["Saptharishi", "Ramprasad", ""], ["Tengse", "Anamay", ""]]}, {"id": "2004.14318", "submitter": "Gal Beniamini", "authors": "Gal Beniamini", "title": "The Approximate Degree of Bipartite Perfect Matching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The approximate degree of a Boolean function is the least degree of a Real\nmultilinear polynomial approximating it in the $\\ell_\\infty$-norm over the\nBoolean hypercube. We consider the Bipartite Perfect Matching function, which\nis the indicator over all bipartite graphs having a perfect matching, and show\nthat its approximate degree is $\\widetilde{\\Theta}(n^{1.5})$.\n  The upper bound is obtained by fully characterizing the unique multilinear\npolynomial representing the Boolean dual of the perfect matching function, over\nthe Reals. In particular, we show that this polynomial has very small\n$\\ell_1$-norm -- only exponential in $\\Theta(n \\log n)$. The lower bound\nfollows by bounding the spectral sensitivity of the perfect matching function,\nwhich is the spectral radius of its cut-graph on the hypercube\n\\cite{aaronson2020degree, huang2019induced}. We show that the spectral\nsensitivity of perfect matching is exactly $\\Theta(n^{1.5})$.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2020 16:41:42 GMT"}, {"version": "v2", "created": "Thu, 20 May 2021 15:46:33 GMT"}], "update_date": "2021-05-21", "authors_parsed": [["Beniamini", "Gal", ""]]}, {"id": "2004.14931", "submitter": "Andreas Pavlogiannis", "authors": "Umang Mathur and Andreas Pavlogiannis and Mahesh Viswanathan", "title": "The Complexity of Dynamic Data Race Prediction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Writing concurrent programs is notoriously hard due to scheduling\nnon-determinism. The most common concurrency bugs are data races, which are\naccesses to a shared resource that can be executed concurrently. Dynamic\ndata-race prediction is the most standard technique for detecting data races:\ngiven an observed, data-race-free trace $t$, the task is to determine whether\n$t$ can be reordered to a trace $t^*$ that exposes a data-race. Although the\nproblem has received significant practical attention for over three decades,\nits complexity has remained elusive. In this work, we address this lacuna,\nidentifying sources of intractability and conditions under which the problem is\nefficiently solvable. Given a trace $t$ of size $n$ over $k$ threads, our main\nresults are as follows.\n  First, we establish a general $O(k\\cdot n^{2\\cdot (k-1)})$ upper-bound, as\nwell as an $O(n^k)$ upper-bound when certain parameters of $t$ are constant. In\naddition, we show that the problem is NP-hard and even W[1]-hard parameterized\nby $k$, and thus unlikely to be fixed-parameter tractable. Second, we study the\nproblem over acyclic communication topologies, such as server-clients\nhierarchies. We establish an $O(k^2\\cdot d\\cdot n^2\\cdot \\log n)$ upper-bound,\nwhere $d$ is the number of shared variables accessed in $t$. In addition, we\nshow that even for traces with $k=2$ threads, the problem has no\n$O(n^{2-\\epsilon})$ algorithm under Orthogonal Vectors. Since any trace with 2\nthreads defines an acyclic topology, our upper-bound for this case is optimal\nwrt polynomial improvements for up to moderate values of $k$ and $d$. Finally,\nwe study a distance-bounded version of the problem, where the task is to expose\na data race by a witness trace that is similar to $t$. We develop an algorithm\nthat works in $O(n)$ time when certain parameters of $t$ are constant.\n", "versions": [{"version": "v1", "created": "Thu, 30 Apr 2020 16:33:11 GMT"}, {"version": "v2", "created": "Sat, 2 May 2020 08:51:52 GMT"}], "update_date": "2020-05-05", "authors_parsed": [["Mathur", "Umang", ""], ["Pavlogiannis", "Andreas", ""], ["Viswanathan", "Mahesh", ""]]}, {"id": "2004.15009", "submitter": "Mehdi Soleimanifar", "authors": "Anurag Anshu, Aram W. Harrow, Mehdi Soleimanifar", "title": "From communication complexity to an entanglement spread area law in the\n  ground state of gapped local Hamiltonians", "comments": "29 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": "MIT-CTP/5287", "categories": "quant-ph cond-mat.str-el cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we make a connection between two seemingly different problems.\nThe first problem involves characterizing the properties of entanglement in the\nground state of gapped local Hamiltonians, which is a central topic in quantum\nmany-body physics. The second problem is on the quantum communication\ncomplexity of testing bipartite states with EPR assistance, a well-known\nquestion in quantum information theory. We construct a communication protocol\nfor testing (or measuring) the ground state and use its communication\ncomplexity to reveal a new structural property for the ground state\nentanglement. This property, known as the entanglement spread, roughly measures\nthe ratio between the largest and the smallest Schmidt coefficients across a\ncut in the ground state. Our main result shows that gapped ground states\npossess limited entanglement spread across any cut, exhibiting an \"area law\"\nbehavior. Our result quite generally applies to any interaction graph with an\nimproved bound for the special case of lattices. This entanglement spread area\nlaw includes interaction graphs constructed in [Aharonov et al., FOCS'14] that\nviolate a generalized area law for the entanglement entropy. Our construction\nalso provides evidence for a conjecture in physics by Li and Haldane on the\nentanglement spectrum of lattice Hamiltonians [Li and Haldane, PRL'08]. On the\ntechnical side, we use recent advances in Hamiltonian simulation algorithms\nalong with quantum phase estimation to give a new construction for an\napproximate ground space projector (AGSP) over arbitrary interaction graphs.\n", "versions": [{"version": "v1", "created": "Thu, 30 Apr 2020 17:54:22 GMT"}], "update_date": "2021-02-22", "authors_parsed": [["Anshu", "Anurag", ""], ["Harrow", "Aram W.", ""], ["Soleimanifar", "Mehdi", ""]]}]