[{"id": "1911.00039", "submitter": "Reza Malekian Ph.D.", "authors": "Arnav Thakur, Reza Malekian", "title": "Fog Computing for Detecting Vehicular Congestion, An Internet of\n  Vehicles based Approach: A review", "comments": null, "journal-ref": null, "doi": "10.1109/MITS.2019.2903551", "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicular congestion is directly impacting the efficiency of the transport\nsector. A wireless sensor network for vehicular clients is used in Internet of\nVehicles based solutions for traffic management applications. It was found that\nvehicular congestion detection by using Internet of Vehicles based connected\nvehicles technology are practically feasible for congestion handling. It was\nfound that by using Fog Computing based principles in the vehicular wireless\nsensor network, communication in the system can be improved to support larger\nnumber of nodes without impacting performance. In this paper, connected\nvehicles technology based vehicular congestion identification techniques are\nstudied. Computing paradigms that can be used for the vehicular network are\nstudied to develop a practically feasible vehicular congestion detection system\nthat performs accurately for a large coverage area and multiple scenarios. The\ndesigned system is expected to detect congestion to meet traffic management\ngoals that are of primary importance in intelligent transportation systems.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2019 18:15:58 GMT"}], "update_date": "2019-11-04", "authors_parsed": [["Thakur", "Arnav", ""], ["Malekian", "Reza", ""]]}, {"id": "1911.00222", "submitter": "Chuan Ma", "authors": "Kang Wei, Jun Li, Ming Ding, Chuan Ma, Howard H. Yang, Farokhi Farhad,\n  Shi Jin, Tony Q. S. Quek, H. Vincent Poor", "title": "Federated Learning with Differential Privacy: Algorithms and Performance\n  Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, to effectively prevent information leakage, we propose a novel\nframework based on the concept of differential privacy (DP), in which\nartificial noises are added to the parameters at the clients side before\naggregating, namely, noising before model aggregation FL (NbAFL). First, we\nprove that the NbAFL can satisfy DP under distinct protection levels by\nproperly adapting different variances of artificial noises. Then we develop a\ntheoretical convergence bound of the loss function of the trained FL model in\nthe NbAFL. Specifically, the theoretical bound reveals the following three key\nproperties: 1) There is a tradeoff between the convergence performance and\nprivacy protection levels, i.e., a better convergence performance leads to a\nlower protection level; 2) Given a fixed privacy protection level, increasing\nthe number $N$ of overall clients participating in FL can improve the\nconvergence performance; 3) There is an optimal number of maximum aggregation\ntimes (communication rounds) in terms of convergence performance for a given\nprotection level. Furthermore, we propose a $K$-random scheduling strategy,\nwhere $K$ ($1<K<N$) clients are randomly selected from the $N$ overall clients\nto participate in each aggregation. We also develop the corresponding\nconvergence bound of the loss function in this case and the $K$-random\nscheduling strategy can also retain the above three properties. Moreover, we\nfind that there is an optimal $K$ that achieves the best convergence\nperformance at a fixed privacy level. Evaluations demonstrate that our\ntheoretical results are consistent with simulations, thereby facilitating the\ndesigns on various privacy-preserving FL algorithms with different tradeoff\nrequirements on convergence performance and privacy levels.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 06:36:33 GMT"}, {"version": "v2", "created": "Fri, 8 Nov 2019 07:43:26 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Wei", "Kang", ""], ["Li", "Jun", ""], ["Ding", "Ming", ""], ["Ma", "Chuan", ""], ["Yang", "Howard H.", ""], ["Farhad", "Farokhi", ""], ["Jin", "Shi", ""], ["Quek", "Tony Q. S.", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1911.00253", "submitter": "Anat Bremler-Barr", "authors": "Yehuda Afek, Anat Bremler-Barr, David Hay, Ran Goldschmidt, Lior\n  Shafir, Gafnit Abraham, Avraham Shalev", "title": "NFV-based IoT Security for Home Networks using MUD", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new scalable ISP level system architecture to secure and protect all IoT\ndevices in a large number of homes is presented. The system is based on\nwhitelisting, as in the Manufacturer Usage Description (MUD) framework,\nimplemented as a VNF. Unlike common MUD suggestions that place the whitelist\napplication at the home/enterprise network, our approach is to place the\nenforcement upstream at the provider network, combining an NFV (Network\nFunction Virtualization) with router/switching filtering capabilities, e.g.,\nACLs. The VNF monitors many home networks simultaneously, and therefore, is a\nhighly-scalable managed service solution that provides both the end customers\nand the ISP with excellent visibility and security of the IoT devices at the\ncustomer premises.\n  The system includes a mechanism to distinguish between flows of different\ndevices at the ISP level despite the fact that most home networks (and their\nIoT devices) are behind a NAT and all the flows from the same home come out\nwith the same source IP address. Moreover, the NFV system needs to receive only\nthe first packet of each connection at the VNF, and rules space is proportional\nto the number of unique types of IoT devices rather than the number of IoT\ndevices. The monitoring part of the solution is off the critical path and can\nalso uniquely protect from incoming DDoS attacks.\n  To cope with internal traffic, that is not visible outside the customer\npremise and often consists of P2P communication, we suggest a hybrid approach,\nwhere we deploy a lightweight component at the CPE, whose sole purpose is to\nmonitor P2P communication. As current MUD solution does not provide a secure\nsolution to P2P communication, we also extend the MUD protocol to deal also\nwith peer-to-peer communicating devices. A PoC with a large national level ISP\nproves that our technology works as expected.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 08:27:04 GMT"}], "update_date": "2019-11-04", "authors_parsed": [["Afek", "Yehuda", ""], ["Bremler-Barr", "Anat", ""], ["Hay", "David", ""], ["Goldschmidt", "Ran", ""], ["Shafir", "Lior", ""], ["Abraham", "Gafnit", ""], ["Shalev", "Avraham", ""]]}, {"id": "1911.00285", "submitter": "Ahmed Al Amin", "authors": "Ahmed Al Amin and Soo Young Shin", "title": "Capacity improvement of non-orthogonal multiple access downlink\n  transmission by orbital angular momentum based mode division multiple access", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, non-orthogonal multiple access (NOMA) downlink transmission is\nintegrated with orbital angular momentum (OAM) based mode division multiple\naccess (MDMA), called NOMA-OAM-MDMA. Different OAM modes can generate different\nOAM waves for different superimposed signals. So, every OAM wave will be\ntransmitted a superimposed signal from the base station to the cell center user\n(CCU) and cell edge user (CEU). In this way, multiple OAM waves with multiple\nsuperimposed signals will transmit from BS to CCU and CEU simultaneously to\nenhance the capacity of NOMA downlink transmission. Finally, the effectiveness\nof the proposed schemes over the existing scheme and conventional orthogonal\nmultiple access based scheme are demonstrated through the result analysis.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 10:06:03 GMT"}], "update_date": "2019-11-04", "authors_parsed": [["Amin", "Ahmed Al", ""], ["Shin", "Soo Young", ""]]}, {"id": "1911.00500", "submitter": "Tugba Erpek", "authors": "Yalin E. Sagduyu, Yi Shi, Tugba Erpek", "title": "Adversarial Deep Learning for Over-the-Air Spectrum Poisoning Attacks", "comments": "Accepted to IEEE Transactions on Mobile Computing. arXiv admin note:\n  text overlap with arXiv:1901.09247", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An adversarial deep learning approach is presented to launch over-the-air\nspectrum poisoning attacks. A transmitter applies deep learning on its spectrum\nsensing results to predict idle time slots for data transmission. In the\nmeantime, an adversary learns the transmitter's behavior (exploratory attack)\nby building another deep neural network to predict when transmissions will\nsucceed. The adversary falsifies (poisons) the transmitter's spectrum sensing\ndata over the air by transmitting during the short spectrum sensing period of\nthe transmitter. Depending on whether the transmitter uses the sensing results\nas test data to make transmit decisions or as training data to retrain its deep\nneural network, either it is fooled into making incorrect decisions (evasion\nattack), or the transmitter's algorithm is retrained incorrectly for future\ndecisions (causative attack). Both attacks are energy efficient and hard to\ndetect (stealth) compared to jamming the long data transmission period, and\nsubstantially reduce the throughput. A dynamic defense is designed for the\ntransmitter that deliberately makes a small number of incorrect transmissions\n(selected by the confidence score on channel classification) to manipulate the\nadversary's training data. This defense effectively fools the adversary (if\nany) and helps the transmitter sustain its throughput with or without an\nadversary present.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 02:21:23 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Sagduyu", "Yalin E.", ""], ["Shi", "Yi", ""], ["Erpek", "Tugba", ""]]}, {"id": "1911.00516", "submitter": "Martin Barrere", "authors": "Mart\\'in Barr\\`ere, Chris Hankin, Nicolas Nicolau, Demetrios G.\n  Eliades, Thomas Parisini", "title": "MaxSAT Evaluation 2019 -- Benchmark: Identifying Security-Critical\n  Cyber-Physical Components in Weighted AND/OR Graphs", "comments": "arXiv admin note: substantial text overlap with arXiv:1905.04796", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a MaxSAT benchmark focused on identifying critical nodes\nin AND/OR graphs. We use AND/OR graphs to model Industrial Control Systems\n(ICS) as they are able to semantically grasp intricate logical\ninterdependencies among ICS components. However, identifying critical nodes in\nAND/OR graphs is an NP-complete problem. We address this problem by efficiently\ntransforming the input AND/OR graph-based model into a weighted logical formula\nthat is then used to build and solve a Weighted Partial MaxSAT problem. The\nbenchmark includes 80 cases with AND/OR graphs of different size and\ncomposition as well as the optimal cost and solution for each case.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 17:24:16 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Barrère", "Martín", ""], ["Hankin", "Chris", ""], ["Nicolau", "Nicolas", ""], ["Eliades", "Demetrios G.", ""], ["Parisini", "Thomas", ""]]}, {"id": "1911.00563", "submitter": "Nguyen Phong Hoang", "authors": "Nguyen Phong Hoang, Arian Akhavan Niaki, Nikita Borisov, Phillipa\n  Gill, Michalis Polychronakis", "title": "Assessing the Privacy Benefits of Domain Name Encryption", "comments": "In Proceedings of the 15th ACM Asia Conference on Computer and\n  Communications Security (ASIA CCS '20), October 5-9, 2020, Taipei, Taiwan", "journal-ref": null, "doi": "10.1145/3320269.3384728", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As Internet users have become more savvy about the potential for their\nInternet communication to be observed, the use of network traffic encryption\ntechnologies (e.g., HTTPS/TLS) is on the rise. However, even when encryption is\nenabled, users leak information about the domains they visit via DNS queries\nand via the Server Name Indication (SNI) extension of TLS. Two recent proposals\nto ameliorate this issue are DNS over HTTPS/TLS (DoH/DoT) and Encrypted SNI\n(ESNI). In this paper we aim to assess the privacy benefits of these proposals\nby considering the relationship between hostnames and IP addresses, the latter\nof which are still exposed. We perform DNS queries from nine vantage points\naround the globe to characterize this relationship. We quantify the privacy\ngain offered by ESNI for different hosting and CDN providers using two\ndifferent metrics, the k-anonymity degree due to co-hosting and the dynamics of\nIP address changes. We find that 20% of the domains studied will not gain any\nprivacy benefit since they have a one-to-one mapping between their hostname and\nIP address. On the other hand, 30% will gain a significant privacy benefit with\na k value greater than 100, since these domains are co-hosted with more than\n100 other domains. Domains whose visitors' privacy will meaningfully improve\nare far less popular, while for popular domains the benefit is not significant.\nAnalyzing the dynamics of IP addresses of long-lived domains, we find that only\n7.7% of them change their hosting IP addresses on a daily basis. We conclude by\ndiscussing potential approaches for website owners and hosting/CDN providers\nfor maximizing the privacy benefits of ESNI.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 19:33:37 GMT"}, {"version": "v2", "created": "Sat, 14 Mar 2020 00:48:18 GMT"}, {"version": "v3", "created": "Wed, 8 Jul 2020 16:37:44 GMT"}], "update_date": "2020-07-09", "authors_parsed": [["Hoang", "Nguyen Phong", ""], ["Niaki", "Arian Akhavan", ""], ["Borisov", "Nikita", ""], ["Gill", "Phillipa", ""], ["Polychronakis", "Michalis", ""]]}, {"id": "1911.00710", "submitter": "Bob Briscoe", "authors": "Bob Briscoe and Asad Sajjad Ahmed", "title": "TCP Prague Fall-back on Detection of a Classic ECN AQM", "comments": "46pp, 14 figs, 29 refs", "journal-ref": null, "doi": null, "report-no": "TR-BB-2019-002", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The IETF's Prague L4S Requirements [DSBE20] expect an L4S congestion control\nto somehow detect if there is a classic ECN [RFB01] AQM at the bottleneck and\nfall back to Reno-friendly behaviour (as it would on a loss). This paper\naddresses that requirement in depth. A solution has been implemented in Linux\nand extensively tested, which distinguishes L4S from Classic AQMs primarily by\ntheir delay variation. This paper describes version 2 of the design of that\nsolution, giving extensive rationale and pseudocode. It briefly summarizes a\ncomprehensive testbed evaluation of the solution, referring to the full details\nonline. The v2 algorithm very rarely falsely detects a Classic AQM as L4S. It\nalso rarely detects an L4S AQM as Classic in the majority of scenarios, but not\nat low link rates and large RTTs.\n  This report is a work in progress. It suggests ideas for improving on the\napproach. It also outlines new ideas that could solve the problem in\ncomplementary or alternative ways.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2019 13:10:37 GMT"}, {"version": "v2", "created": "Sat, 18 Apr 2020 12:23:21 GMT"}, {"version": "v3", "created": "Fri, 19 Feb 2021 20:24:43 GMT"}], "update_date": "2021-02-23", "authors_parsed": [["Briscoe", "Bob", ""], ["Ahmed", "Asad Sajjad", ""]]}, {"id": "1911.00759", "submitter": "Mohsin Ur Rahman", "authors": "Mohsin Ur Rahman", "title": "Leader Election in the Internet of Things: Challenges and Opportunities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The different functions of a leader node in Ad hoc networks, particularly in\nWireless Sensor Networks (WSNs) and Internet of Things (IoT) include generation\nof keys for encryption/decryption, finding a node with minimum energy or node\nlocated in an extreme side of the network. One essential application of IoT is\nto monitor any dangerous, sensitive or non-accessible site. Such type of\napplication requires the election of a leader located on the extreme left of\nthe network. Indeed, one can then use any leader election (LE) algorithm to\nfind this node, and then start the process of finding its boundary nodes.\nHowever, the chosen algorithm must be fault-tolerant and robust since the\ndetection of a node failure under such circumstances becomes impossible. This\npaper surveys the most significant work performed in this direction, highlights\nthe challenges and proposes possible extensions.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2019 18:02:40 GMT"}, {"version": "v2", "created": "Sun, 28 Jun 2020 00:43:13 GMT"}], "update_date": "2020-06-30", "authors_parsed": [["Rahman", "Mohsin Ur", ""]]}, {"id": "1911.00766", "submitter": "Kyoomars Alizadeh Noghani", "authors": "Kyoomars Alizadeh Noghani, Cristian Hernandez Benet, Andreas Kassler,\n  Antonio Marotta, Patrick Jestin, Vivek V. Srivastava", "title": "Automating Ethernet VPN Deployment in SDN-based Data Centers", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Layer 2 Virtual Private Network (L2VPN) is widely deployed in both service\nprovider networks and enterprises. However, legacy L2VPN solutions have\nscalability limitations in the context of Data Center (DC) interconnection and\nnetworking which require new approaches that address the requirements of\nservice providers for virtual private cloud services. Recently, Ethernet VPN\n(EVPN) has been proposed to address many of those concerns and vendors started\nto deploy EVPN based solutions in DC edge routers. However, manual\nconfiguration leads to a time-consuming, error-prone configuration and high\noperational costs. Automating the EVPN deployment from cloud platforms such as\nOpenStack enhances both the deployment and flexibility of EVPN Instances\n(EVIs). This paper proposes a Software Defined Network (SDN) based framework\nthat automates the EVPN deployment and management inside SDN-based DCs using\nOpenStack and OpenDaylight (ODL). We implemented and extended several modules\ninside ODL controller to manage and interact with EVIs and an interface to\nOpenStack that allows the deployment and configuration of EVIs. We conclude\nwith scalability analysis of our solution.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2019 18:57:00 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Noghani", "Kyoomars Alizadeh", ""], ["Benet", "Cristian Hernandez", ""], ["Kassler", "Andreas", ""], ["Marotta", "Antonio", ""], ["Jestin", "Patrick", ""], ["Srivastava", "Vivek V.", ""]]}, {"id": "1911.00779", "submitter": "Kyoomars Alizadeh Noghani", "authors": "Kyoomars Alizadeh Noghani, Andreas Kassler", "title": "SDN Enhanced Ethernet VPN for Data Center Interconnect", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ethernet Virtual Private Network (EVPN) is an emerging technology that\naddresses the networking challenges presented by geo-distributed Data Centers\n(DCs). One of the major advantages of EVPN over legacy layer 2 VPN solutions is\nproviding All-Active (A-A) mode of operation so that the traffic can truly be\nmulti-homed on Provider Edge (PE) routers. However, A-A mode of operation\nintroduces new challenges. In the case where the Customer Edge (CE) router is\nmulti-homed to one or more PE routers, it is necessary that only one of the PE\nrouters should forward Broadcast, Unknown unicast, and Multicast (BUM) traffic\ninto the DC. The PE router that assumes the primary role for forwarding BUM\ntraffic to the CE device is called the Designated Forwarder (DF). The proposed\nsolution to select the DF in the EVPN standard is based on a distributed\nalgorithm which has a number of drawbacks such as unfairness and intermittent\nbehavior. In this paper, we introduce a Software-Defined Networking (SDN) based\narchitecture for EVPN support, where the SDN controller interacts with EVPN\ncontrol plane. We demonstrate how our solution mitigates existing problems for\nDF selection which leads to improved EVPN performance.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2019 20:04:44 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Noghani", "Kyoomars Alizadeh", ""], ["Kassler", "Andreas", ""]]}, {"id": "1911.00856", "submitter": "Sheng Zhou", "authors": "Wenqi Shi, Sheng Zhou, Zhisheng Niu", "title": "Device Scheduling with Fast Convergence for Wireless Federated Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT cs.LG math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Owing to the increasing need for massive data analysis and model training at\nthe network edge, as well as the rising concerns about the data privacy, a new\ndistributed training framework called federated learning (FL) has emerged. In\neach iteration of FL (called round), the edge devices update local models based\non their own data and contribute to the global training by uploading the model\nupdates via wireless channels. Due to the limited spectrum resources, only a\nportion of the devices can be scheduled in each round. While most of the\nexisting work on scheduling focuses on the convergence of FL w.r.t. rounds, the\nconvergence performance under a total training time budget is not yet explored.\nIn this paper, a joint bandwidth allocation and scheduling problem is\nformulated to capture the long-term convergence performance of FL, and is\nsolved by being decoupled into two sub-problems. For the bandwidth allocation\nsub-problem, the derived optimal solution suggests to allocate more bandwidth\nto the devices with worse channel conditions or weaker computation\ncapabilities. For the device scheduling sub-problem, by revealing the trade-off\nbetween the number of rounds required to attain a certain model accuracy and\nthe latency per round, a greedy policy is inspired, that continuously selects\nthe device that consumes the least time in model updating until achieving a\ngood trade-off between the learning efficiency and latency per round. The\nexperiments show that the proposed policy outperforms other state-of-the-art\nscheduling policies, with the best achievable model accuracy under training\ntime budgets.\n", "versions": [{"version": "v1", "created": "Sun, 3 Nov 2019 09:37:37 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Shi", "Wenqi", ""], ["Zhou", "Sheng", ""], ["Niu", "Zhisheng", ""]]}, {"id": "1911.00902", "submitter": "Ping-Chun Hsieh", "authors": "Ping-Chun Hsieh, Xi Liu, I-Hong Hou", "title": "Fresher Content or Smoother Playback? A Brownian-Approximation Framework\n  for Scheduling Real-Time Wireless Video Streams", "comments": "MobiHoc 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a Brownian-approximation framework to optimize the\nquality of experience (QoE) for real-time video streaming in wireless networks.\nIn real-time video streaming, one major challenge is to tackle the natural\ntension between the two most critical QoE metrics: playback latency and video\ninterruption. To study this trade-off, we first propose an analytical model\nthat precisely captures all aspects of the playback process of a real-time\nvideo stream, including playback latency, video interruptions, and packet\ndropping. Built on this model, we show that the playback process of a real-time\nvideo can be approximated by a two-sided reflected Brownian motion. Through\nsuch Brownian approximation, we are able to study the fundamental limits of the\ntwo QoE metrics and characterize a necessary and sufficient condition for a set\nof QoE performance requirements to be feasible. We propose a scheduling policy\nthat satisfies any feasible set of QoE performance requirements and then obtain\nsimple rules on the trade-off between playback latency and the video interrupt\nrates, in both heavy-traffic and under-loaded regimes. Finally, simulation\nresults verify the accuracy of the proposed approximation and show that the\nproposed policy outperforms other popular baseline policies.\n", "versions": [{"version": "v1", "created": "Sun, 3 Nov 2019 14:40:02 GMT"}, {"version": "v2", "created": "Sat, 14 Dec 2019 06:54:05 GMT"}, {"version": "v3", "created": "Fri, 23 Oct 2020 14:50:53 GMT"}], "update_date": "2020-10-26", "authors_parsed": [["Hsieh", "Ping-Chun", ""], ["Liu", "Xi", ""], ["Hou", "I-Hong", ""]]}, {"id": "1911.00986", "submitter": "Ekram Hossain", "authors": "Xiao Lu, Ekram Hossain, Tania Shafique, Shaohan Feng, Hai Jiang, and\n  Dusit Niyato", "title": "Intelligent Reflecting Surface (IRS)-Enabled Covert Communications in\n  Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With growing security threats to the evolving wireless systems, protecting\nuser privacy becomes progressively challenging. Even if the transmitted\ninformation is encrypted and the potential wiretap channel is physically\nlimited (e.g. through information-theoretic security approaches), the raw data\nitself, such as transmitter position and transmission pattern, could expose\nconfidential information. In this context, covert communication that intends to\nhide the existence of transmission from an observant adversary by exploiting\nthe physical characteristics of the wireless medium has been actively\ninvestigated. However, existing covertness techniques ineluctably consume\nadditional resources such as bandwidth and energy, which burdens system\ndeployment. In view of this concern, we propose an intelligent reflecting\nsurface (IRS)-based approach to enhance communication covertness. The core idea\nis making use of a smartly controlled metasurface to reshape undesirable\npropagation conditions which could divulge secret messages. To facilitate the\nunderstanding of the proposed idea, we first provide an overview of the\nstate-of-the-art covert communication techniques. Then, we introduce the\nfundamentals of IRS and elaborate on how an IRS can be integrated to benefit\ncommunication covertness. We also demonstrate a case study of the joint\nconfiguration of the IRS and the legitimate transmitter, which is of pivotal\nimportance in designing an IRS-enhanced covert communication system. Finally,\nwe shed light on some open research directions.\n", "versions": [{"version": "v1", "created": "Sun, 3 Nov 2019 22:19:01 GMT"}, {"version": "v2", "created": "Thu, 2 Apr 2020 20:44:10 GMT"}], "update_date": "2020-04-06", "authors_parsed": [["Lu", "Xiao", ""], ["Hossain", "Ekram", ""], ["Shafique", "Tania", ""], ["Feng", "Shaohan", ""], ["Jiang", "Hai", ""], ["Niyato", "Dusit", ""]]}, {"id": "1911.01046", "submitter": "Shashi Raj Pandey", "authors": "Shashi Raj Pandey, Nguyen H. Tran, Mehdi Bennis, Yan Kyaw Tun, Aunas\n  Manzoor, and Choong Seon Hong", "title": "A Crowdsourcing Framework for On-Device Federated Learning", "comments": "Accepted in IEEE Transactions on Wireless Communications", "journal-ref": null, "doi": "10.1109/TWC.2020.2971981", "report-no": null, "categories": "cs.LG cs.GT cs.NI stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Federated learning (FL) rests on the notion of training a global model in a\ndecentralized manner. Under this setting, mobile devices perform computations\non their local data before uploading the required updates to improve the global\nmodel. However, when the participating clients implement an uncoordinated\ncomputation strategy, the difficulty is to handle the communication efficiency\n(i.e., the number of communications per iteration) while exchanging the model\nparameters during aggregation. Therefore, a key challenge in FL is how users\nparticipate to build a high-quality global model with communication efficiency.\nWe tackle this issue by formulating a utility maximization problem, and propose\na novel crowdsourcing framework to leverage FL that considers the communication\nefficiency during parameters exchange. First, we show an incentive-based\ninteraction between the crowdsourcing platform and the participating client's\nindependent strategies for training a global learning model, where each side\nmaximizes its own benefit. We formulate a two-stage Stackelberg game to analyze\nsuch scenario and find the game's equilibria. Second, we formalize an admission\ncontrol scheme for participating clients to ensure a level of local accuracy.\nSimulated results demonstrate the efficacy of our proposed solution with up to\n22% gain in the offered reward.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 06:41:37 GMT"}, {"version": "v2", "created": "Mon, 3 Feb 2020 04:06:40 GMT"}], "update_date": "2020-05-07", "authors_parsed": [["Pandey", "Shashi Raj", ""], ["Tran", "Nguyen H.", ""], ["Bennis", "Mehdi", ""], ["Tun", "Yan Kyaw", ""], ["Manzoor", "Aunas", ""], ["Hong", "Choong Seon", ""]]}, {"id": "1911.01064", "submitter": "Dileban Karunamoorthy", "authors": "Ermyas Abebe, Dushyant Behl, Chander Govindarajan, Yining Hu, Dileban\n  Karunamoorthy, Petr Novotny, Vinayaka Pandit, Venkatraman Ramakrishna,\n  Christian Vecchiola", "title": "Enabling Enterprise Blockchain Interoperability with Trusted Data\n  Transfer (industry track)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The adoption of permissioned blockchain networks in enterprise settings has\nseen an increase in growth over the past few years. While encouraging, this is\nleading to the emergence of new data, asset and process silos limiting the\npotential value these networks bring to the broader ecosystem. Mechanisms for\nenabling network interoperability help preserve the benefits of independent\nsovereign networks, while allowing for the transfer or sharing of data, assets\nand processes across network boundaries. However, a naive approach to\ninteroperability based on traditional point-to-point integration is\ninsufficient for preserving the underlying trust decentralized networks\nprovide. In this paper, we lay the foundation for an approach to\ninteroperability based on a communication protocol that derives trust from the\nunderlying network consensus protocol. We present an architecture and a set of\nbuilding blocks that can be adapted for use in a range of network\nimplementations and demonstrate a proof-of-concept for trusted data-sharing\nbetween two independent trade finance and supply-chain networks, each running\non Hyperledger Fabric. We show how existing blockchain deployments can be\nadapted for interoperation and discuss the security and extensibility of our\narchitecture and mechanisms.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 07:43:28 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Abebe", "Ermyas", ""], ["Behl", "Dushyant", ""], ["Govindarajan", "Chander", ""], ["Hu", "Yining", ""], ["Karunamoorthy", "Dileban", ""], ["Novotny", "Petr", ""], ["Pandit", "Vinayaka", ""], ["Ramakrishna", "Venkatraman", ""], ["Vecchiola", "Christian", ""]]}, {"id": "1911.01162", "submitter": "Hao Wu", "authors": "Hao Wu, Chenwu Zhang, Hancheng Lu, Qi Hu", "title": "Modeling and Performance Analysis in Cache-enabled Millimeter Wave\n  HetNets with Access and Backhaul Integration", "comments": "31 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, a mmWave-based access and backhaul integration HetNetsarchitecture\n(mABHetNets) has been envisioned to provide the high link capacity in both\naccess and backhaul links. In mABHetNets, the access link and the backhaul link\nwill share the same mm-wave spectral resources to serve cellular users as well\nas to maintain the backhaul capacity of the SBSs. However, a large spectrum\nbandwidth are occupied by the backhaul link to maintain the backhaul link\ncapacity. Up to 50\\% mmWave spectrum resource will be used in backhaul link to\nsatisfy the high speed data traffic. Such \"\\emph{spectrum occupation}\" of\nbackhaul link has restricted network performance to achieve a better possible\nimprovement. To overcome spectrum occupation problem in the existing\nmABHetNets, involving caches in the mABHetNets brings a opportunity. When the\nbackhaul traffic is offloaded by caching popular fils in the SBSs and the\ncorresponding mmWave spectrum can be transfered to the access link by the\nbandwidth partition. Then with more spectrum for access link, both the network\nthroughout and the coverage ability are increased significantly. However, the\ncaching power consumption will be increased and the EE will be decreased.\nTherefore, we analyze the througput and EE in mABHetNets by stochastic geometry\ntool. Extensive numerical and simulations results are carried out to validate\nour work.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 12:40:38 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Wu", "Hao", ""], ["Zhang", "Chenwu", ""], ["Lu", "Hancheng", ""], ["Hu", "Qi", ""]]}, {"id": "1911.01283", "submitter": "Mahdi Soleimani", "authors": "Mahdi Soleimani and Vahid Shah-Mansouri", "title": "Reactive Failure Mitigation through Seamless Migration in Telecom\n  Infrastructure Networks", "comments": "7 pages, 5 figures, submitted to IEEE ICC Conference 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Various methods are proposed in the literature to mitigate the failures in an\ninfrastructure network. Failure mitigation can be carried out in an active or\npassive manner. In active manner, live backups provide the required\nreliability. Due to the high cost of active backups, failures can be mitigated\nin a reactive manner where mitigation starts when a function fails. In this\npaper, network functions are divided into two classes of essential (i.e., core)\nfunctions and additive (i.e., service) functions. Core functions need active\nbackups and cannot tolerate any failure. However, additive functions do not\nrequire backups and their absence is tolerable in short periods. Maximum\ntolerable (function) absence time (TAT) is a measure used for their reliability\nlevel. In our model and within the mitigation process, first, the backup host\nto migrate the failed function is selected. Then, the state of the function is\nmigrated. The process should be carried out in less than TAT. An optimization\nproblem is formulated investigating cost-effective failure mitigation of\nadditive functions. The problem is of mixed integer non convex form. To tackle\nthe computational complexity, it is bisected into two back-to-back\nleader-follower parts. The leader selects the migration destinations and the\nfollower divides network resources among functions for migration. These\nproblems are both NP-hard. For the leader problem, a central heuristic based on\nthe Viterbi algorithm suggested. The follower problem is converted into two\nconvex sub-problems. The validity of the proposed algorithms is proved via\nextensive numerical results.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 15:21:22 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Soleimani", "Mahdi", ""], ["Shah-Mansouri", "Vahid", ""]]}, {"id": "1911.01286", "submitter": "Kunal Verma", "authors": "Kunal Verma and Vishal Paike", "title": "Smart City Intelligent System Traffic Congestion Optimization using\n  Internet Of Things", "comments": "5 Pages, 1 Figure, 1 Table", "journal-ref": "IEEE Explore, 2016", "doi": null, "report-no": null, "categories": "cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The raising level of traffic imposes a great demand in the growth of\nintelligent traffic systems. With increase in complexity of alleviation,\nfinding solutions to traffic congestion problem have become one of the\nchallenges. Various optimization techniques have been proposed in literature to\nmeet these challenges. This paper surveys different optimization techniques\nbased on heuristics for automated traffic congestion control. Moreover, an\napproach based on River Formation Dynamics scheme is introduced to analyze the\noptimization problem for traffic congestion control and a scheme to extract\nreal time information through Internet of Things is presented for superior\nefficiency and productivity.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 15:38:00 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Verma", "Kunal", ""], ["Paike", "Vishal", ""]]}, {"id": "1911.01296", "submitter": "Hossein Shafiei", "authors": "Hossein Shafiei, Ahmad Khonsari and Payam Mousavi", "title": "Serverless Computing: A Survey of Opportunities, Challenges and\n  Applications", "comments": "27 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The topic of serverless computing has proved to be a controversial subject\nboth within academic and industrial communities. Many have praised the approach\nto be a platform for a new era of computing and some have argued that it is in\nfact a step backward. Though, both sides agree that there exist challenges that\nmust be addressed in order to better utilize its potentials. This paper surveys\nexisting challenges toward vast adoption of serverless services and also\nexplores some of the challenges that have not been thoroughly discussed in the\nprevious studies. Each challenge is discussed thoroughly and a number of\npossible directions for future studies is proposed. Moreover, the paper reviews\nsome of the unique opportunities and potentials that the serverless computing\npresents.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 15:52:29 GMT"}, {"version": "v2", "created": "Sat, 14 Dec 2019 07:02:25 GMT"}, {"version": "v3", "created": "Mon, 23 Dec 2019 11:25:32 GMT"}, {"version": "v4", "created": "Fri, 4 Jun 2021 17:24:52 GMT"}], "update_date": "2021-06-07", "authors_parsed": [["Shafiei", "Hossein", ""], ["Khonsari", "Ahmad", ""], ["Mousavi", "Payam", ""]]}, {"id": "1911.01407", "submitter": "Omur Ozel", "authors": "Parisa Rafiee and Omur Ozel", "title": "Active Status Update Packet Drop Control in an Energy Harvesting Node", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers an energy harvesting sensor node with battery size\n$B_{max}$ that recharges its battery through an incremental energy harvesting\nprocess and receives updates from a single information source in slotted time.\nThe node actively decides to power down (OFF) or up (ON) the communication\ncircuitry for a portion of its operation time in order to maintain energy\nefficiency. Update packets arriving in ON (OFF) periods are received\n(discarded). A deterministic energy cost per time is paid during ON periods.\nThe power down decision can be in partial or full nature, yielding various\noptions for deciding ON-OFF intervals. We develop age-threshold based power\nON-OFF schemes to minimize age of information at the node subject to energy\nharvesting constraints with partial and full power down options for $B_{max}=1$\nand $B_{max}=\\infty$ cases.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 18:50:12 GMT"}, {"version": "v2", "created": "Wed, 6 Nov 2019 17:25:38 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["Rafiee", "Parisa", ""], ["Ozel", "Omur", ""]]}, {"id": "1911.01506", "submitter": "Nikita Tafintsev", "authors": "Nikita Tafintsev, Dmitri Moltchanov, Mikhail Gerasimenko, Margarita\n  Gapeyenko, Jing Zhu, Shu-ping Yeh, Nageen Himayat, Sergey Andreev, Yevgeni\n  Koucheryavy, and Mikko Valkama", "title": "Aerial Access and Backhaul in mmWave B5G Systems: Performance Dynamics\n  and Optimization", "comments": "7 pages, 5 figures. This work has been accepted to IEEE\n  Communications Magazine, 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of unmanned aerial vehicle (UAV)-based communication in\nmillimeter-wave (mmWave) frequencies to provide on-demand radio access is a\npromising approach to improve capacity and coverage in beyond-5G (B5G) systems.\nThere are several design aspects to be addressed when optimizing for the\ndeployment of such UAV base stations. As traffic demand of mobile users varies\nacross time and space, dynamic algorithms that correspondingly adjust the UAV\nlocations are essential to maximize performance. In addition to careful\ntracking of spatio-temporal user/traffic activity, such optimization needs to\naccount for realistic backhaul constraints. In this work, we first review the\nlatest 3GPP activities behind integrated access and backhaul system design,\nsupport for UAV base stations, and mmWave radio relaying functionality. We then\ncompare static and mobile UAV-based communication options under practical\nassumptions on the mmWave system layout, mobility and clusterization of users,\nantenna array geometry, and dynamic backhauling. We demonstrate that leveraging\nthe UAV mobility to serve moving users may improve the overall system\nperformance even in the presence of backhaul capacity limitations.\n", "versions": [{"version": "v1", "created": "Mon, 4 Nov 2019 22:06:50 GMT"}, {"version": "v2", "created": "Wed, 6 Nov 2019 08:34:07 GMT"}, {"version": "v3", "created": "Wed, 13 Nov 2019 08:16:22 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Tafintsev", "Nikita", ""], ["Moltchanov", "Dmitri", ""], ["Gerasimenko", "Mikhail", ""], ["Gapeyenko", "Margarita", ""], ["Zhu", "Jing", ""], ["Yeh", "Shu-ping", ""], ["Himayat", "Nageen", ""], ["Andreev", "Sergey", ""], ["Koucheryavy", "Yevgeni", ""], ["Valkama", "Mikko", ""]]}, {"id": "1911.01682", "submitter": "Yusuke Koda", "authors": "Yusuke Koda, Jihong Park, Mehdi Bennis, Koji Yamamoto, Takayuki\n  Nishio, Masahiro Morikura", "title": "One Pixel Image and RF Signal Based Split Learning for mmWave Received\n  Power Prediction", "comments": "3 pages, Accepted in ACM CoNEXT 2019 Poster Session", "journal-ref": null, "doi": "10.1145/3360468.3368176", "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Focusing on the received power prediction of millimeter-wave (mmWave)\nradio-frequency (RF) signals, we propose a multimodal split learning (SL)\nframework that integrates RF received signal powers and depth-images observed\nby physically separated entities. To improve its communication efficiency while\npreserving data privacy, we propose an SL neural network architecture that\ncompresses the communication payload, i.e., images. Compared to a baseline\nsolely utilizing RF signals, numerical results show that SL integrating only\none pixel image with RF signals achieves higher prediction accuracy while\nmaximizing both communication efficiency and privacy guarantees.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2019 09:33:06 GMT"}], "update_date": "2019-11-06", "authors_parsed": [["Koda", "Yusuke", ""], ["Park", "Jihong", ""], ["Bennis", "Mehdi", ""], ["Yamamoto", "Koji", ""], ["Nishio", "Takayuki", ""], ["Morikura", "Masahiro", ""]]}, {"id": "1911.01783", "submitter": "Halit Murat G\\\"ursu", "authors": "H. Murat G\\\"ursu, Hansini Vijayaraghavan, Wolfgang Kellerer", "title": "Boost Your CotS IEEE 802.15.4 Network with Inter-Slot Interference\n  Cancellation for Industrial IoT", "comments": "Accepted for publication in CCNC '20, Las Vegas, USA. This work is\n  one of the first to prototype interference cancellation for IoT in a cellular\n  setting. Take a look if you are interested in similar topics. Any comments or\n  call for collaborations on this topic should send out an e-mail to\n  murat.guersu@tum.de", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT cs.SY eess.SY math.IT", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The current cellular standardization for 5G is working towards wireless\nadvances to enable further productivity for industrial automation. However,\nthis development will take several years. Meanwhile, the capabilities of the\ncurrently available standards should be pushed to their limits. To this end, in\nthis work, we present results from the first inter-slot successive interference\ncancellation testbed using commercial off the shelf IEEE 802.15.4 sensors.\nThrough our implementation, we have measured a throughput of $0.72$ packets per\nslot which doubles the currently used contention-based access, Slotted ALOHA,\nwith a limit of $0.36$ packets per slot. The hardware effects of the boards,\nwhich degrade the successive interference cancellation performance from the\ntheoretical limit of $1$ packet per slot, are modeled and validated through\nmeasurements. We also propose a model that can be used to calculate the\nexpected successive interference cancellation throughput with the specific\nhardware available in a factory. Furthermore, our proposed model should replace\nthe perfect physical layer assumptions for researchers to design new MAC\nalgorithms taking practical limitations into account.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2019 14:10:04 GMT"}], "update_date": "2019-11-06", "authors_parsed": [["Gürsu", "H. Murat", ""], ["Vijayaraghavan", "Hansini", ""], ["Kellerer", "Wolfgang", ""]]}, {"id": "1911.01805", "submitter": "Timo H\\\"ackel", "authors": "Mehmet \\c{C}ak{\\i}r, Timo H\\\"ackel, Sandra Reider, Philipp Meyer,\n  Franz Korf and Thomas C. Schmidt", "title": "A QoS Aware Approach to Service-Oriented Communication in Future\n  Automotive Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Service-Oriented Architecture (SOA) is about to enter automotive networks\nbased on the SOME/IP middleware and an Ethernet high-bandwidth communication\nlayer. It promises to meet the growing demands on connectivity and flexibility\nfor software components in modern cars. Largely heterogeneous service\nrequirements and time-sensitive network functions make Quality-of-Service (QoS)\nagreements a vital building block within future automobiles. Existing\nmiddleware solutions, however, do not allow for a dynamic selection of QoS.\n  This paper presents a service-oriented middleware for QoS aware communication\nin future cars. We contribute a protocol for dynamic QoS negotiation along with\na multi-protocol stack, which supports the different communication classes as\nderived from a thorough requirements analysis. We validate the feasibility of\nour approach in a case study and evaluate its performance in a simulation model\nof a realistic in-car network. Our findings indicate that QoS aware\ncommunication can indeed meet the requirements, while the impact of the service\nnegotiations and setup times of the network remain acceptable provided the\ncross-traffic during negotiations stays below 70% of the available bandwidth.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2019 14:35:31 GMT"}], "update_date": "2019-11-06", "authors_parsed": [["Çakır", "Mehmet", ""], ["Häckel", "Timo", ""], ["Reider", "Sandra", ""], ["Meyer", "Philipp", ""], ["Korf", "Franz", ""], ["Schmidt", "Thomas C.", ""]]}, {"id": "1911.01812", "submitter": "Zaoxing Liu", "authors": "Zaoxing Liu, Tian Li, Virginia Smith, Vyas Sekar", "title": "Enhancing the Privacy of Federated Learning with Sketching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CR cs.NI stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In response to growing concerns about user privacy, federated learning has\nemerged as a promising tool to train statistical models over networks of\ndevices while keeping data localized. Federated learning methods run training\ntasks directly on user devices and do not share the raw user data with third\nparties. However, current methods still share model updates, which may contain\nprivate information (e.g., one's weight and height), during the training\nprocess. Existing efforts that aim to improve the privacy of federated learning\nmake compromises in one or more of the following key areas: performance\n(particularly communication cost), accuracy, or privacy. To better optimize\nthese trade-offs, we propose that \\textit{sketching algorithms} have a unique\nadvantage in that they can provide both privacy and performance benefits while\nmaintaining accuracy. We evaluate the feasibility of sketching-based federated\nlearning with a prototype on three representative learning models. Our initial\nfindings show that it is possible to provide strong privacy guarantees for\nfederated learning without sacrificing performance or accuracy. Our work\nhighlights that there exists a fundamental connection between privacy and\ncommunication in distributed settings, and suggests important open problems\nsurrounding the theoretical understanding, methodology, and system design of\npractical, private federated learning.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2019 14:38:18 GMT"}], "update_date": "2019-11-06", "authors_parsed": [["Liu", "Zaoxing", ""], ["Li", "Tian", ""], ["Smith", "Virginia", ""], ["Sekar", "Vyas", ""]]}, {"id": "1911.01904", "submitter": "Mojdeh Karbalaee", "authors": "Mojdeh Karbalaee Motalleb, Vahid Shah-Mansouri, Salar Nouri Naghadeh", "title": "Joint Power Allocation and Network Slicing in an Open RAN System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Open radio access network (ORAN) alliance which has been formed recently\nestablishes a flexible, open, and smart radio access network (RAN) by combing\nthe ideas from xRAN and cloud RAN (C-RAN). ORAN divides the functions of the\nRAN into three parts, namely remote unit (RU), distributed unit (DU), and\ncentral unit (CU). While RU contains lower PHY functions, DU contains higher\nPHY, MAC, and RLC and CU contains RRC, PDCP, and SDAP. CU and DU are\nimplemented as virtual network functions (VNFs) running on a cloud environment.\nInterface between RU, CU, and DU are open standard interfaces. Network slicing\nas a new concept in 5G systems is used to share the network resources between\nvarious services while the operation of one service does not affect another\nservice. In this paper, we study the problem of RAN network slicing in an ORAN\nsystem. We formulate the problem of wireless link scheduling, mapping the\nslices to the services, and mapping the physical data centers resource to\nslices. The objective is to jointly maximize the energy efficiency and minimize\npower consumption of RUs and the cost of physical resources in a downlink\nchannel. The problem is formulated as a mixed-integer optimization problem that\ncan be decomposed into two independent sub-problems. Heuristic algorithms are\nproposed for each of the sub-problems.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2019 16:06:29 GMT"}], "update_date": "2019-11-06", "authors_parsed": [["Motalleb", "Mojdeh Karbalaee", ""], ["Shah-Mansouri", "Vahid", ""], ["Naghadeh", "Salar Nouri", ""]]}, {"id": "1911.02063", "submitter": "Charith Perera", "authors": "Karan Juj, Charith Perera", "title": "Exploring the Suitability of BLE Beacons to Track Poacher Vehicles in\n  Harsh Jungle Terrains", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our overall aim is focused on exploring whether we could use Bluetooth Low\nEnergy (BLE) technology to track poacher vehicles in remote and rural areas\nsuch as Sabah, in Malaysia, especially deep inside the jungle terrain with\nlittle or no communication technologies exists. Tracking technologies are\ncurrently limited to relying on satellites or cellular towers, for environments\nthat do not permit access to these signals, very few viable alternatives exist.\nThis paper explores the use of BLE as a method to track vehicles. It works by\nmounting Bluetooth beacons beside a road and placing a receiver concealed\nsomewhere inside the vehicle. As the vehicle drives past the beacon, the\nreceiver and beacon are momentarily in range, the receiver then stores a unique\nID from the beacon and when the vehicle is then in an area with GSM signal, an\nSMS is sent containing the unique IDs of the beacons that have been detected.\nThis project is prototyped and tested in collaboration with the Danau Girang\nField Centre in Sabah, Malaysia. The results offer insights for how effective\nBLE beacons are in a tracking situation for where the beacon and receiver are\nin range for a short period of time as well as how different obstructions will\naffect the range and strength of the signal. It is important to note that our\nobjective is not to catch the poacher, instead to understand how they move\naround within jungle terrain, as we can use such information to develop a\ncomprehensive plan against poaching activities.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2019 20:01:23 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["Juj", "Karan", ""], ["Perera", "Charith", ""]]}, {"id": "1911.02128", "submitter": "Ali Kheradmand", "authors": "Santhosh Prabhu, Kuan-Yen Chou, Ali Kheradmand, P. Brighten Godfrey,\n  Matthew Caesar", "title": "Plankton: Scalable network configuration verification through model\n  checking", "comments": "NSDI'20", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network configuration verification enables operators to ensure that the\nnetwork will behave as intended, prior to deployment of their configurations.\nAlthough techniques ranging from graph algorithms to SMT solvers have been\nproposed, scalable configuration verification with sufficient protocol support\ncontinues to be a challenge. In this paper, we show that by combining\nequivalence partitioning with explicit-state model checking, network\nconfiguration verification can be scaled significantly better than the state of\nthe art, while still supporting a rich set of protocol features. We propose\nPlankton, which uses symbolic partitioning to manage large header spaces and\nefficient model checking to exhaustively explore protocol behavior. Thanks to a\nhighly effective suite of optimizations including state hashing, partial order\nreduction, and policy-based pruning, Plankton successfully verifies policies in\nindustrial-scale networks quickly and compactly, at times reaching a\n10000$\\times$ speedup compared to the state of the art.\n", "versions": [{"version": "v1", "created": "Tue, 5 Nov 2019 23:11:59 GMT"}], "update_date": "2019-11-07", "authors_parsed": [["Prabhu", "Santhosh", ""], ["Chou", "Kuan-Yen", ""], ["Kheradmand", "Ali", ""], ["Godfrey", "P. Brighten", ""], ["Caesar", "Matthew", ""]]}, {"id": "1911.02607", "submitter": "Mahdi Mousavi", "authors": "Mahdi Mousavi, Anja Klein", "title": "Energy and Social Cost Minimization for Data Dissemination in Wireless\n  Networks: Centralized and Decentralized Approaches", "comments": "14 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT cs.SI cs.SY eess.SY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We study multi-hop data-dissemination in a wireless network from one source\nto multiple nodes where some of the nodes of the network act as re-transmitting\nnodes and help the source in data dissemination. In this network, we study two\nscenarios; i) the transmitting nodes do not need an incentive for transmission\nand ii) they do need an incentive and are paid by their corresponding receiving\nnodes by virtual tokens. We investigate two problems; P1) network power\nminimization for the first scenario and P2) social cost minimization for the\nsecond scenario, defined as the total cost paid by the nodes of the network for\nreceiving data. In this paper, to address P1 and P2, we propose centralized and\ndecentralized approaches that determine which of the nodes of the network\nshould act as transmitting nodes, find their transmit powers and their\ncorresponding receiving nodes. For the sake of energy efficiency, in our model,\nwe employ maximal-ratio combining (MRC) at the receivers so that a receiver can\nbe served by multiple transmitters. The proposed decentralized approach is\nbased on a non-cooperative cost-sharing game (CSG). In our proposed game, every\nreceiving node chooses its respective transmitting nodes and consequently, a\ncost is assigned to it according to the power imposed on its chosen\ntransmitting nodes. We discuss how the network is formed in a decentralized\nway, find the action of the nodes in the game and show that, despite being\ndecentralized, the proposed game converges to a stable solution. To find the\ncentralized global optimum, which is a benchmark to our decentralized approach,\nwe use a mixed-integer-liner-program (MILP). Simulation results show that our\nproposed decentralized approach outperforms the conventional algorithms in\nterms of energy efficiency and social cost while it can address the need for an\nincentive for collaboration.\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2019 19:58:59 GMT"}, {"version": "v2", "created": "Sat, 21 Mar 2020 21:27:03 GMT"}], "update_date": "2020-03-24", "authors_parsed": [["Mousavi", "Mahdi", ""], ["Klein", "Anja", ""]]}, {"id": "1911.02621", "submitter": "Olakunle Ibitoye", "authors": "Olakunle Ibitoye, Rana Abou-Khamis, Ashraf Matrawy and M. Omair Shafiq", "title": "The Threat of Adversarial Attacks on Machine Learning in Network\n  Security -- A Survey", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.LG cs.NI", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Machine learning models have made many decision support systems to be faster,\nmore accurate and more efficient. However, applications of machine learning in\nnetwork security face more disproportionate threat of active adversarial\nattacks compared to other domains. This is because machine learning\napplications in network security such as malware detection, intrusion\ndetection, and spam filtering are by themselves adversarial in nature. In what\ncould be considered an arms race between attackers and defenders, adversaries\nconstantly probe machine learning systems with inputs which are explicitly\ndesigned to bypass the system and induce a wrong prediction. In this survey, we\nfirst provide a taxonomy of machine learning techniques, styles, and\nalgorithms. We then introduce a classification of machine learning in network\nsecurity applications. Next, we examine various adversarial attacks against\nmachine learning in network security and introduce two classification\napproaches for adversarial attacks in network security. First, we classify\nadversarial attacks in network security based on a taxonomy of network security\napplications. Secondly, we categorize adversarial attacks in network security\ninto a problem space vs. feature space dimensional classification model. We\nthen analyze the various defenses against adversarial attacks on machine\nlearning-based network security applications. We conclude by introducing an\nadversarial risk model and evaluate several existing adversarial attacks\nagainst machine learning in network security using the risk model. We also\nidentify where each attack classification resides within the adversarial risk\nmodel\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2019 20:29:56 GMT"}, {"version": "v2", "created": "Sun, 4 Oct 2020 10:29:05 GMT"}], "update_date": "2020-10-06", "authors_parsed": [["Ibitoye", "Olakunle", ""], ["Abou-Khamis", "Rana", ""], ["Matrawy", "Ashraf", ""], ["Shafiq", "M. Omair", ""]]}, {"id": "1911.02794", "submitter": "Guoming Tang", "authors": "Fang Liu, Guoming Tang, Youhuizi Li, Zhiping Cai, Xingzhou Zhang,\n  Tongqing Zhou", "title": "A Survey on Edge Computing Systems and Tools", "comments": "24 pages, 21 figures, 4 tables, 87 references", "journal-ref": "Proceedings of the IEEE, 2019", "doi": "10.1109/JPROC.2019.2920341", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Driven by the visions of Internet of Things and 5G communications, the edge\ncomputing systems integrate computing, storage and network resources at the\nedge of the network to provide computing infrastructure, enabling developers to\nquickly develop and deploy edge applications. Nowadays the edge computing\nsystems have received widespread attention in both industry and academia. To\nexplore new research opportunities and assist users in selecting suitable edge\ncomputing systems for specific applications, this survey paper provides a\ncomprehensive overview of the existing edge computing systems and introduces\nrepresentative projects. A comparison of open source tools is presented\naccording to their applicability. Finally, we highlight energy efficiency and\ndeep learning optimization of edge computing systems. Open issues for analyzing\nand designing an edge computing system are also studied in this survey.\n", "versions": [{"version": "v1", "created": "Thu, 7 Nov 2019 08:16:40 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Liu", "Fang", ""], ["Tang", "Guoming", ""], ["Li", "Youhuizi", ""], ["Cai", "Zhiping", ""], ["Zhang", "Xingzhou", ""], ["Zhou", "Tongqing", ""]]}, {"id": "1911.02877", "submitter": "Benjamin Finley", "authors": "Benjamin Finley and Alexandr Vesselkov", "title": "Cellular IoT Traffic Characterization and Evolution", "comments": "Copyright 2019 IEEE. Personal use of this material is permitted.\n  Permission from IEEE must be obtained for all other uses, in any current or\n  future media, including reprinting/republishing this material for advertising\n  or promotional purposes, creating new collective works, for resale or\n  redistribution to servers or lists, or reuse of any copyrighted component of\n  this work in other works", "journal-ref": "2019 IEEE 5th World Forum on Internet of Things (WF-IoT),\n  Limerick, Ireland, 2019, pp. 622-627", "doi": "10.1109/WF-IoT.2019.8767323", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The adoption of Internet of Things (IoT) technologies is increasing and thus\nIoT is seemingly shifting from hype to reality. However, the actual use of IoT\nover significant timescales has not been empirically analyzed. In other words\nthe reality remains unexplored. Furthermore, despite the variety of IoT\nverticals, the use of IoT across vertical industries has not been compared.\nThis paper uses a two-year IoT dataset from a major Finnish mobile network\noperator to investigate different aspects of cellular IoT traffic including\ntemporal evolution and the use of IoT devices across industries. We present a\nvariety of novel findings. For example, our results show that IoT traffic\nvolume per device increased three-fold over the last two years. Additionally,\nwe illustrate diversity in IoT usage among different industries with orders of\nmagnitude differences in traffic volume and device mobility. Though we also\nnote that the daily traffic patterns of all devices can be clustered into only\nthree patterns, differing mainly in the presence and timing of a peak hour.\nFinally, we illustrate that the share of LTE-enabled IoT devices has remained\nlow at around 2% and 30% of IoT devices are still 2G only.\n", "versions": [{"version": "v1", "created": "Thu, 7 Nov 2019 12:40:04 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Finley", "Benjamin", ""], ["Vesselkov", "Alexandr", ""]]}, {"id": "1911.02910", "submitter": "Valderi Leithardt", "authors": "Valderi R. Q. Leithardt, Douglas A. dos Santos, Luis A. Silva, Felipe\n  Viel, Cesar A. Zeferino and Jorge Sa Silva", "title": "A Solution for Controlling and Managing User Profiles based on Data\n  Privacy for IoT Applications", "comments": "in Portuguese", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  IoT is an emerging area in which we expect to have billions of devices\nconnected to the Internet by 2020. IoT applications can offer many benefits to\nenvironments, society and the economy through the interconnection and\ncooperation of smart objects. However, there are many privacy challenges, such\nas authentication, authorization, and confidentiality of personal data. With\nthis in mind, we have developed a solution for managing user profiles based on\nprivacy and evolution. For that, we define the criteria and characteristics for\neach environment. The contribution of the work also applies to the evolution of\nthe UbiPri Middleware, with a module implemented and tested according to the\nrules of environments so that they can modify the user's profile over time\naccording to their frequency in the environment. The modified profile can be\nraised, reduced and blocked. This implementation has been validated using\nscripts that perform probabilistic simulation and user authentication. From the\nrules assigned to the environments, it was possible to perceive the high\nadaptability of the implementation, and it can be easily adjusted to any IoT\nenvironment that wants to treat the authentication and privacy of environments\nand users. The results obtained were satisfactory and could be useful for both\nthe evolution of the UbiPri Middleware and other related works.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2019 10:35:09 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Leithardt", "Valderi R. Q.", ""], ["Santos", "Douglas A. dos", ""], ["Silva", "Luis A.", ""], ["Viel", "Felipe", ""], ["Zeferino", "Cesar A.", ""], ["Silva", "Jorge Sa", ""]]}, {"id": "1911.03051", "submitter": "Olasupo Ajayi", "authors": "Kun Ma, Antoine Bagula and Olasupo Ajayi", "title": "Quality of Service (QoS) Modelling in Federated Cloud Computing", "comments": "21 pages, 9 figures, 9 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Building around the idea of a large scale server infrastructure with a\npotentially large number of tailored resources, which are capable of\ninteracting to facilitate the deployment, adaptation, and support of services,\ncloud computing needs to frequently reschedule and manage various application\ntasks in order to accommodate the requests of a wide range and number of users.\nOne of the challenges of cloud computing is to support and manage\nQuality-of-Service (QoS) by designing efficient techniques for the allocation\nof tasks between users and the cloud virtual resources, as well as assigning\nvirtual resources to the cloud physical resources. The migration of virtual\nresources across physical resources is another challenge that requires\nconsiderable attention; especially in federated cloud computing environments\nwherein, providers might be willing to offer their unused resources as a\nservice to the federation (cooperative allocation) and pull back these\nresources for their own use when they are needed (competitive allocation). This\npaper revisits the issue of QoS in cloud computing by formulating and\npresenting i) a multi-QoS task allocation model for the assignment of tasks to\nvirtual machines and ii) a virtual machine migration model for a federated\ncloud computing environment by considering cases where resource providers are\noperating in cooperative or competitive mode. A new differential evolution (DE)\nbased binding policy for task allocation and a novel virtual machine model are\nproposed as solutions for the problem of QoS support in federated cloud\nenvironments. The experimental results show that the proposed solutions\nimproved the quality of service in the cloud computing environment and reveal\nthe relative advantages of operating a mixed cooperation and competition model\nin a federated cloud environment.\n", "versions": [{"version": "v1", "created": "Fri, 8 Nov 2019 05:07:14 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Ma", "Kun", ""], ["Bagula", "Antoine", ""], ["Ajayi", "Olasupo", ""]]}, {"id": "1911.03264", "submitter": "Ali Taleb Zadeh Kasgari", "authors": "Ali Taleb Zadeh Kasgari, Walid Saad, Mohammad Mozaffari, H. Vincent\n  Poor", "title": "Experienced Deep Reinforcement Learning with Generative Adversarial\n  Networks (GANs) for Model-Free Ultra Reliable Low Latency Communication", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.LG cs.NI math.IT stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel experienced deep reinforcement learning (deep-RL)\nframework is proposed to provide model-free resource allocation for ultra\nreliable low latency communication (URLLC). The proposed, experienced deep-RL\nframework can guarantee high end-to-end reliability and low end-to-end latency,\nunder explicit data rate constraints, for each wireless without any models of\nor assumptions on the users' traffic. In particular, in order to enable the\ndeep-RL framework to account for extreme network conditions and operate in\nhighly reliable systems, a new approach based on generative adversarial\nnetworks (GANs) is proposed. This GAN approach is used to pre-train the deep-RL\nframework using a mix of real and synthetic data, thus creating an experienced\ndeep-RL framework that has been exposed to a broad range of network conditions.\nFormally, the URLLC resource allocation problem is posed as a power\nminimization problem under reliability, latency, and rate constraints. To solve\nthis problem using experienced deep-RL, first, the rate of each user is\ndetermined. Then, these rates are mapped to the resource block and power\nallocation vectors of the studied wireless system. Finally, the end-to-end\nreliability and latency of each user are used as feedback to the deep-RL\nframework. It is then shown that at the fixed-point of the deep-RL algorithm,\nthe reliability and latency of the users are near-optimal. Moreover, for the\nproposed GAN approach, a theoretical limit for the generator output is\nanalytically derived. Simulation results show how the proposed approach can\nachieve near-optimal performance within the rate-reliability-latency region,\ndepending on the network and service requirements. The results also show that\nthe proposed experienced deep-RL framework is able to remove the transient\ntraining time that makes conventional deep-RL methods unsuitable for URLLC.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 16:50:48 GMT"}, {"version": "v2", "created": "Wed, 14 Oct 2020 01:23:10 GMT"}], "update_date": "2020-10-15", "authors_parsed": [["Kasgari", "Ali Taleb Zadeh", ""], ["Saad", "Walid", ""], ["Mozaffari", "Mohammad", ""], ["Poor", "H. Vincent", ""]]}, {"id": "1911.03298", "submitter": "Muhammad Baqer Mollah Mr.", "authors": "Muhammad Baqer Mollah, Jun Zhao, Dusit Niyato, Kwok-Yan Lam, Xin\n  Zhang, Amer M.Y.M. Ghias, Leong Hai Koh, Lei Yang", "title": "Blockchain for Future Smart Grid: A Comprehensive Survey", "comments": "26 pages, 13 figures, 5 tables", "journal-ref": "IEEE Internet of Things Journal, 2020", "doi": "10.1109/JIOT.2020.2993601", "report-no": null, "categories": "cs.CR cs.DC cs.NI cs.SI cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of smart grid has been introduced as a new vision of the\nconventional power grid to figure out an efficient way of integrating green and\nrenewable energy technologies. In this way, Internet-connected smart grid, also\ncalled energy Internet, is also emerging as an innovative approach to ensure\nthe energy from anywhere at any time. The ultimate goal of these developments\nis to build a sustainable society. However, integrating and coordinating a\nlarge number of growing connections can be a challenging issue for the\ntraditional centralized grid system. Consequently, the smart grid is undergoing\na transformation to the decentralized topology from its centralized form. On\nthe other hand, blockchain has some excellent features which make it a\npromising application for smart grid paradigm. In this paper, we aim to provide\na comprehensive survey on application of blockchain in smart grid. As such, we\nidentify the significant security challenges of smart grid scenarios that can\nbe addressed by blockchain. Then, we present a number of blockchain-based\nrecent research works presented in different literatures addressing security\nissues in the area of smart grid. We also summarize several related practical\nprojects, trials, and products that have been emerged recently. Finally, we\ndiscuss essential research challenges and future directions of applying\nblockchain to smart grid security issues.\n", "versions": [{"version": "v1", "created": "Fri, 8 Nov 2019 14:51:39 GMT"}, {"version": "v2", "created": "Wed, 13 May 2020 07:42:41 GMT"}], "update_date": "2020-05-14", "authors_parsed": [["Mollah", "Muhammad Baqer", ""], ["Zhao", "Jun", ""], ["Niyato", "Dusit", ""], ["Lam", "Kwok-Yan", ""], ["Zhang", "Xin", ""], ["Ghias", "Amer M. Y. M.", ""], ["Koh", "Leong Hai", ""], ["Yang", "Lei", ""]]}, {"id": "1911.03366", "submitter": "Ankita Tondwalkar", "authors": "Ankita Tondwalkar and Dr Andres Kwasinski", "title": "Deep Reinforcement Learning for Distributed Uncoordinated Cognitive\n  Radios Resource Allocation", "comments": "This paper has been submitted in the 21st IEEE International Workshop\n  On Signal Processing Advances In Wireless Communications (SPAWC 2020)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a novel deep reinforcement learning-based resource\nallocation technique for the multi-agent environment presented by a cognitive\nradio network that coexists through underlay dynamic spectrum access (DSA) with\na primary network. The resource allocation technique presented in this work is\ndistributed, not requiring coordination with other agents. The presented\nalgorithm is the first deep reinforcement learning technique for which\nconvergence to equilibrium policies can be shown in the non-stationary\nmulti-agent environment that results from the uncoordinated dynamic interaction\nbetween radios through the shared wireless environment. Moreover, simulation\nresults show that in a finite learning time the presented technique is able to\nfind policies that yield performance within 3 % of an exhaustive search\nsolution, finding the optimal policy in nearly 70 % of cases. Moreover, it is\nshown that standard single-agent deep reinforcement learning may not achieve\nconvergence when used in a non-coordinated, coupled multi-radio scenario.\n", "versions": [{"version": "v1", "created": "Tue, 29 Oct 2019 20:19:37 GMT"}, {"version": "v2", "created": "Fri, 6 Mar 2020 16:54:41 GMT"}], "update_date": "2020-03-09", "authors_parsed": [["Tondwalkar", "Ankita", ""], ["Kwasinski", "Dr Andres", ""]]}, {"id": "1911.03381", "submitter": "Qingzhi Liu", "authors": "Qingzhi Liu, Wieger IJntema, Anass Drif, Przemys{\\l}aw Pawe{\\l}czak,\n  Marco Zuniga", "title": "BEH: Indoor Batteryless BLE Beacons using RF Energy Harvesting for\n  Internet of Things", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Indoor beacon system is a cornerstone of internet of things. Until now, most\nof the research effort has focused on achieving various applications based on\nbeacon communication. However, the power consumption on beacon devices becomes\nthe bottleneck for the large-scale deployments of indoor networks. On one hand,\nthe size of beacon devices is required to be small enough for easy deployment,\nwhich further limits the size of battery. On the other hand, replacing the\nbatteries of the beacon devices could lead to high maintenance costs. It is\nimportant to provide them with full energy autonomy. To tackle this problem we\npropose BEH: an indoor beacon system aimed at operating perpetually without\nbatteries. Our contributions are twofold. Firstly, we propose four methods to\nincrease the utilization efficiency of harvested RF energy in the beacon\nsystem, by which the energy consumption level becomes low enough to fit within\nthe energy harvesting budget. Secondly, we implement BEH using Bluetooth Low\nEnergy (BLE) and Radio Frequency (RF) energy harvesting devices, and test BEH\nextensively in a laboratory environment. Our test results show that BEH can\nenable perpetual lifetime operation of mobile and static BLE beacon devices in\na (16 m$^{\\text{2}}$) room. The average value of packet reception rate achieves\nmore than 99% in the best case.\n", "versions": [{"version": "v1", "created": "Fri, 8 Nov 2019 17:04:45 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Liu", "Qingzhi", ""], ["IJntema", "Wieger", ""], ["Drif", "Anass", ""], ["Pawełczak", "Przemysław", ""], ["Zuniga", "Marco", ""]]}, {"id": "1911.03447", "submitter": "Janus Varmarken", "authors": "Janus Varmarken and Hieu Le and Anastasia Shuba and Zubair Shafiq and\n  Athina Markopoulou", "title": "The TV is Smart and Full of Trackers: Towards Understanding the Smart TV\n  Advertising and Tracking Ecosystem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the growing popularity of smart TVs, we present a large-scale\nmeasurement study of smart TVs by collecting and analyzing their network\ntraffic from two different vantage points. First, we analyze aggregate network\ntraffic of smart TVs in-the-wild, collected from residential gateways of tens\nof homes and several different smart TV platforms, including Apple, Samsung,\nRoku, and Chromecast. In addition to accessing video streaming and cloud\nservices, we find that smart TVs frequently connect to well-known as well as\nplatform-specific advertising and tracking services (ATS). Second, we\ninstrument Roku and Amazon Fire TV, two popular smart TV platforms, by setting\nup a controlled testbed to systematically exercise the top-1000 apps on each\nplatform, and analyze their network traffic at the granularity of the\nindividual apps. We again find that smart TV apps connect to a wide range of\nATS, and that the key players of the ATS ecosystems of the two platforms are\ndifferent from each other and from that of the mobile platform. Third, we\nevaluate the (in)effectiveness of state-of-the-art DNS-based blocklists in\nfiltering advertising and tracking traffic for smart TVs. We find that\npersonally identifiable information (PII) is exfiltrated to platform-related\nInternet endpoints and third parties, and that blocklists are generally better\nat preventing exposure of PII to third parties than to platform-related\nendpoints. Our work demonstrates the segmentation of the smart TV ATS ecosystem\nacross platforms and its differences from the mobile ATS ecosystem, thus\nmotivating the need for designing privacy-enhancing tools specifically for each\nsmart TV platform.\n", "versions": [{"version": "v1", "created": "Fri, 8 Nov 2019 18:56:05 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Varmarken", "Janus", ""], ["Le", "Hieu", ""], ["Shuba", "Anastasia", ""], ["Shafiq", "Zubair", ""], ["Markopoulou", "Athina", ""]]}, {"id": "1911.03632", "submitter": "Mehmet Karaca", "authors": "Mehmet Karaca, Tansu Alpcan, Ozgur Ercetin", "title": "Smart Scheduling and Feedback Allocation over Non-stationary Wireless\n  Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known that opportunistic scheduling algorithms are throughput\noptimal under dynamic channel and network conditions. However, these algorithms\nachieve a hypothetical rate region which does not take into account the\noverhead associated with channel probing and feedback required to obtain the\nfull channel state information at every slot. In this work, we design a joint\nscheduling and channel probing algorithm by considering the overhead of\nobtaining the channel state information. We adopt a correlated and\nnon-stationary channel model, which is more realistic than those used in the\nliterature. We use concepts from learning and information theory to accurately\ntrack channel variations to minimize the number of channels probed at every\nslot, while scheduling users to maximize the achievable rate region of the\nnetwork. More specifically, we employ Gaussian Process Regression that enable\nus to predict future channel state and also provide a way to measure\nuncertainty in the learning and prediction. Simulation results show that with\nthe proposed algorithm, the network can carry higher user traffic. The proposed\nsolution can be utilized in more complex and heterogeneous environments such as\n5G and beyond networks where the model free approach is needed.\n", "versions": [{"version": "v1", "created": "Sat, 9 Nov 2019 07:20:35 GMT"}], "update_date": "2019-11-12", "authors_parsed": [["Karaca", "Mehmet", ""], ["Alpcan", "Tansu", ""], ["Ercetin", "Ozgur", ""]]}, {"id": "1911.03654", "submitter": "Anis Elgabli", "authors": "Anis Elgabli, Jihong Park, Sabbir Ahmed, and Mehdi Bennis", "title": "L-FGADMM: Layer-Wise Federated Group ADMM for Communication Efficient\n  Decentralized Deep Learning", "comments": "6 pages; 4 figures; presented at IEEE WCNC'2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.DC cs.NI stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article proposes a communication-efficient decentralized deep learning\nalgorithm, coined layer-wise federated group ADMM (L-FGADMM). To minimize an\nempirical risk, every worker in L-FGADMM periodically communicates with two\nneighbors, in which the periods are separately adjusted for different layers of\nits deep neural network. A constrained optimization problem for this setting is\nformulated and solved using the stochastic version of GADMM proposed in our\nprior work. Numerical evaluations show that by less frequently exchanging the\nlargest layer, L-FGADMM can significantly reduce the communication cost,\nwithout compromising the convergence speed. Surprisingly, despite less\nexchanged information and decentralized operations, intermittently skipping the\nlargest layer consensus in L-FGADMM creates a regularizing effect, thereby\nachieving the test accuracy as high as federated learning (FL), a baseline\nmethod with the entire layer consensus by the aid of a central entity.\n", "versions": [{"version": "v1", "created": "Sat, 9 Nov 2019 10:03:21 GMT"}, {"version": "v2", "created": "Sun, 5 Jul 2020 09:33:25 GMT"}], "update_date": "2020-07-07", "authors_parsed": [["Elgabli", "Anis", ""], ["Park", "Jihong", ""], ["Ahmed", "Sabbir", ""], ["Bennis", "Mehdi", ""]]}, {"id": "1911.03746", "submitter": "Manuel Mazzara", "authors": "Ziyad Elbanna, Ilya Afanasyev, Luiz J.P. Araujo, Rasheed Hussain,\n  Mansur Khazeev, Joseph Lamptey, Manuel Mazzara, Swati Megha, Diksha\n  Moolchandani, Dragos Strugar", "title": "A Machine to Machine framework for the charging of Electric Autonomous\n  Vehicles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electric Autonomous Vehicles (EAVs) have gained increasing attention of\nindustry, governments and scientific communities concerned about issues related\nto classic transportation including accidents and casualties, gas emissions and\nair pollution, intensive traffic and city viability. One of the aspects,\nhowever, that prevent a broader adoption of this technology is the need for\nhuman interference to charge EAVs, which is still mostly manual and\ntime-consuming. This study approaches such a problem by introducing the\nInno-EAV, an open-source charging framework for EAVs that employs\nmachine-to-machine (M2M) distributed communication. The idea behind M2M is to\nhave networked devices that can interact, exchange information and perform\nactions without any manual assistance of humans. The advantages of the Inno-EAV\ninclude the automation of charging processes and the collection of relevant\ndata that can support better decision making in the spheres of energy\ndistribution. In this paper, we present the software design of the framework,\nthe development process, the emphasis on the distributed architecture and the\nnetworked communication, and we discuss the back-end database that is used to\nstore information about car owners, cars, and charging stations.\n", "versions": [{"version": "v1", "created": "Sat, 9 Nov 2019 18:09:32 GMT"}], "update_date": "2019-11-12", "authors_parsed": [["Elbanna", "Ziyad", ""], ["Afanasyev", "Ilya", ""], ["Araujo", "Luiz J. P.", ""], ["Hussain", "Rasheed", ""], ["Khazeev", "Mansur", ""], ["Lamptey", "Joseph", ""], ["Mazzara", "Manuel", ""], ["Megha", "Swati", ""], ["Moolchandani", "Diksha", ""], ["Strugar", "Dragos", ""]]}, {"id": "1911.03887", "submitter": "Liang Wang", "authors": "Liang Wang, Kezhi Wang, Cunhua Pan, Wei Xu, Nauman Aslam, Arumugam\n  Nallanathan", "title": "Deep Reinforcement Learning Based Dynamic Trajectory Control for\n  UAV-assisted Mobile Edge Computing", "comments": "Accepted by IEEE Transactions on Mobile Computing", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.LG cs.NI stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider a platform of flying mobile edge computing\n(F-MEC), where unmanned aerial vehicles (UAVs) serve as equipment providing\ncomputation resource, and they enable task offloading from user equipment (UE).\nWe aim to minimize energy consumption of all the UEs via optimizing the user\nassociation, resource allocation and the trajectory of UAVs. To this end, we\nfirst propose a Convex optimizAtion based Trajectory control algorithm (CAT),\nwhich solves the problem in an iterative way by using block coordinate descent\n(BCD) method. Then, to make the real-time decision while taking into account\nthe dynamics of the environment (i.e., UAV may take off from different\nlocations), we propose a deep Reinforcement leArning based Trajectory control\nalgorithm (RAT). In RAT, we apply the Prioritized Experience Replay (PER) to\nimprove the convergence of the training procedure. Different from the convex\noptimization based algorithm which may be susceptible to the initial points and\nrequires iterations, RAT can be adapted to any taking off points of the UAVs\nand can obtain the solution more rapidly than CAT once training process has\nbeen completed. Simulation results show that the proposed CAT and RAT achieve\nthe similar performance and both outperform traditional algorithms.\n", "versions": [{"version": "v1", "created": "Sun, 10 Nov 2019 10:24:04 GMT"}, {"version": "v2", "created": "Sat, 13 Feb 2021 15:42:03 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Wang", "Liang", ""], ["Wang", "Kezhi", ""], ["Pan", "Cunhua", ""], ["Xu", "Wei", ""], ["Aslam", "Nauman", ""], ["Nallanathan", "Arumugam", ""]]}, {"id": "1911.03916", "submitter": "Changsheng You", "authors": "Changsheng You, Beixiong Zheng, and Rui Zhang", "title": "Intelligent Reflecting Surface with Discrete Phase Shifts: Channel\n  Estimation and Passive Beamforming", "comments": "Submitted to IEEE conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider an intelligent reflecting surface (IRS)-aided\nsingle-user system where an IRS with discrete phase shifts is deployed to\nassist the uplink communication. A practical transmission protocol is proposed\nto execute channel estimation and passive beamforming successively. To minimize\nthe mean square error (MSE) of channel estimation, we first formulate an\noptimization problem for designing the IRS reflection pattern in the training\nphase under the constraints of unit-modulus, discrete phase, and full rank.\nThis problem, however, is NP-hard and thus difficult to solve in general. As\nsuch, we propose a low-complexity yet efficient method to solve it\nsub-optimally, by constructing a near-orthogonal reflection pattern based on\neither discrete Fourier transform (DFT)-matrix quantization or Hadamard-matrix\ntruncation. Based on the estimated channel, we then formulate an optimization\nproblem to maximize the achievable rate by designing the discrete-phase passive\nbeamforming at the IRS with the training overhead and channel estimation error\ntaken into account. To reduce the computational complexity of exhaustive\nsearch, we further propose a low-complexity successive refinement algorithm\nwith a properly-designed initialization to obtain a high-quality suboptimal\nsolution. Numerical results are presented to show the significant rate\nimprovement of our proposed IRS training reflection pattern and passive\nbeamforming designs as compared to other benchmark schemes.\n", "versions": [{"version": "v1", "created": "Sun, 10 Nov 2019 12:03:30 GMT"}, {"version": "v2", "created": "Mon, 18 Nov 2019 08:18:53 GMT"}, {"version": "v3", "created": "Mon, 23 Dec 2019 06:57:41 GMT"}], "update_date": "2019-12-24", "authors_parsed": [["You", "Changsheng", ""], ["Zheng", "Beixiong", ""], ["Zhang", "Rui", ""]]}, {"id": "1911.04072", "submitter": "Mehdi Rahmati", "authors": "Mehdi Rahmati, Archana Arjula, and Dario Pompili", "title": "Compressed Underwater Acoustic Communications for Dynamic Interaction\n  with Underwater Vehicles", "comments": null, "journal-ref": null, "doi": "10.1145/3366486.3366488", "report-no": null, "categories": "eess.SP cs.NI cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Underwater vehicles are utilized in various applications including underwater\ndata-collection missions. The tethered connection constrains the mission both\nin distance traveled and number of vehicles that can run in the same area,\nwhile the addition of acoustic communications onto the vehicles grants them\nseveral functionalities. However, due to the low bandwidth of the underwater\nacoustic channel-which leads to low data rates-and the time overhead imposed by\nboth the channel propagation delay and the processing delay by the acoustic\nmodems, efficient protocols are required. In this paper, an implicit\ndata-compression and transmission protocol is proposed to carry out\nenvironmental monitoring missions such as adaptive sampling of physical and\nchemical parameters in the water. In a semi-autonomous manner between the\nvehicle and the control center, both sides keep silent in data transmission as\nlong as they can estimate and predict the actions of the other side, unless\nenvironmental data and/or kinematic data are found to be unpredictable. Our\ndesign puts the human in the loop to send high-level control commands.\nExperiments were conducted using an autonomous vehicle with WHOI micro-modems\nin the Raritan River, Somerset, Carnegie Lake in Princeton, and in the Marine\nPark in Red Bank, all in New Jersey.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 04:38:12 GMT"}], "update_date": "2019-11-12", "authors_parsed": [["Rahmati", "Mehdi", ""], ["Arjula", "Archana", ""], ["Pompili", "Dario", ""]]}, {"id": "1911.04330", "submitter": "Tauseef Jamal Dr.", "authors": "Muhammad Asam, Tauseef Jamal, Aleena Ajaz, Zeeshan Haider and Shariq\n  Aziz Butt", "title": "Security Issues in WBANs", "comments": null, "journal-ref": null, "doi": null, "report-no": "PIEAS-11-2019", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Body Area Network (WBAN) refers to short-range, wireless\ncommunications near or inside a human body. WBAN is emerging solution to cater\nthe needs of local and remote health care related facility. Medical and\nnon-medical applications have been revolutionarily under consideration for\nproviding a healthy and gratify service to the humanity. Being very critical in\ncommunication from body it faces a lot of challenges which are to be tackled\nfor the safety of life and benefit of the user. There is variety of challenges\nfaced by WBANs. WBAN is favorite playground for attackers due to its usability\nin various applications. This article provides systematic overview of main\nchallenges in WBANs in security perspectives.\n", "versions": [{"version": "v1", "created": "Thu, 7 Nov 2019 07:05:18 GMT"}], "update_date": "2019-11-12", "authors_parsed": [["Asam", "Muhammad", ""], ["Jamal", "Tauseef", ""], ["Ajaz", "Aleena", ""], ["Haider", "Zeeshan", ""], ["Butt", "Shariq Aziz", ""]]}, {"id": "1911.04426", "submitter": "Shuchismita Biswas", "authors": "Shuchismita Biswas, Virgilio Centeno", "title": "A Routing and Link Scheduling Strategy for Smart Grid NAN Communications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As large scale deployment of smart devices in the power grid continues,\nresearch efforts need to increasingly focus on efficient communication of\ngenerated information. This paper describes a strategy for static routing and\nscheduling of messages in a multi-hop wireless Smart Grid Neighborhood Area\nNetwork (NAN) with multiple source nodes and a common set of destinations or\ngateways. The problem is formulated as a Mixed Integer Linear Program (MILP)\nand solved using commercial optimization solver CPLEX. Feasibility of the\nscheme is demonstrated using different network models, constraints, message\ninjection rates, and initial conditions. It is shown that the proposed approach\ncan be used to generate an optimal link schedule for collecting user-generated\nbids in a transactive energy market in the least possible time. It is also\nshown that the methodology is applicable to multiple destination nodes and that\ntheir location affects message delivery time.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 18:10:08 GMT"}], "update_date": "2019-11-12", "authors_parsed": [["Biswas", "Shuchismita", ""], ["Centeno", "Virgilio", ""]]}, {"id": "1911.04472", "submitter": "Hossein Yousefi", "authors": "Mohammad Rasoul Tanhatalab, Hossein Yousefi, Hesam Mohammad Hosseini,\n  Mostafa Mofarah Bonab, Vahid Fakharian, Hadis Abarghouei", "title": "Deep RAN: A Scalable Data-driven platform to Detect Anomalies in Live\n  Cellular Network Using Recurrent Convolutional Neural Network", "comments": "6 pages,", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a novel algorithm to detect anomaly in terms of Key\nParameter Indicators (KPI)s over live cellular networks based on the\ncombination of Recurrent Neural Networks (RNN), and Convolutional Neural\nNetworks (CNN), as Recurrent Convolutional Neural Networks (R-CNN). CNN models\nthe spatial correlations and information, whereas, RNN models the temporal\ncorrelations and information. In this paper, the studied cellular network\nconsists of 2G, 3G, 4G, and 4.5G technologies, and the KPIs include Voice and\ndata traffic of the cells. The data and voice traffic are extremely important\nfor the owner of wireless networks because it is directly related to the\nrevenue and quality of service that users experience. These traffic changes\nhappen due to a couple of reasons: the subscriber behavior changes due to\nspecial events, making neighbor sites on-air or down, or by shifting the\ntraffic to the other technologies, e.g. shifting the traffic from 3G to 4G.\nTraditionally, in order to keep the network stable, the traffic should be\nobserved layer by layer during each interval to detect major changes in KPIs,\nin large scale telecommunication networks it will be too time-consuming with\nthe low accuracy of anomaly detection. However, the proposed algorithm is\ncapable of detecting the abnormal KPIs for each element of the network in a\ntime-efficient and accurate manner. It observes the traffic layer trends and\nclassifies them into 8 traffic categories: Normal, Suddenly Increasing,\nGradually Increasing, Suddenly Decreasing, Gradually Decreasing, Faulty Site,\nNew Site, and Down Site. This classification task enables the vendors and\noperators to detect anomalies in their live networks in order to keep the KPIs\nin a normal trend. The algorithm is trained and tested on the real dataset over\na cellular network with more than 25000 cells.\n", "versions": [{"version": "v1", "created": "Sun, 10 Nov 2019 08:36:33 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Tanhatalab", "Mohammad Rasoul", ""], ["Yousefi", "Hossein", ""], ["Hosseini", "Hesam Mohammad", ""], ["Bonab", "Mostafa Mofarah", ""], ["Fakharian", "Vahid", ""], ["Abarghouei", "Hadis", ""]]}, {"id": "1911.04478", "submitter": "Chenwu Zhang", "authors": "Chenwu Zhang, Hao Wu, Hancheng Lu, Jinxue Liu", "title": "Throughput Analysis in Cache-enabled Millimeter Wave HetNets with Access\n  and Backhaul Integration", "comments": "7 pages,6 figures,conference. arXiv admin note: substantial text\n  overlap with arXiv:1911.01162", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, a mmWave-based access and backhaul integration heterogeneous\nnetworks (HetNets) architecture (mABHetNets) has been envisioned to provide\nhigh wireless capacity.Since the access link and the backhaul link share the\nsame mmwave spectral resource, a large spectrum bandwidth is occupied by the\nbackhaul link, which hinders the wireless access capacity improvement. To\novercome the backhaul spectrum occupation problem and improve the network\nthroughput in the existing mABHetNets, we introduce the cache at base stations\n(BSs). In detail, by caching popular files at small base stations\n(SBSs),mABHetNets can offload the backhaul link traffic and transfer the\nredundant backhaul spectrum to the access link to increase the network\nthroughout. However, introducing cache in SBSs will also incur additional power\nconsumption and reduce the transmission power, which can lower the network\nthroughput.In this paper, we investigate spectrum partition between the access\nlink and the backhaul link as well as cache allocation to improve the network\nthroughput in mABHetNets. With the stochastic geometry tool, we develop an\nanalytical framework to characterize cache-enabled mABHetNets and obtain the\nsignal-to-interference-plus-noise ratio (SINR) distributions in line-of-sight\n(LoS) and non-line-of-sight (NLoS) paths. Then we utilize the SINR distribution\nto derive the average potential throughput(APT). Extensive numerical results\nshow that introducing cache can bring up to 80% APT gain to the existing\nmABHetNets.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 09:32:49 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Zhang", "Chenwu", ""], ["Wu", "Hao", ""], ["Lu", "Hancheng", ""], ["Liu", "Jinxue", ""]]}, {"id": "1911.04542", "submitter": "Weisi Guo", "authors": "Weisi Guo", "title": "Explainable Artificial Intelligence (XAI) for 6G: Improving Trust\n  between Human and Machine", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the 5th Generation (5G) mobile networks are bringing about global societal\nbenefits, the design phase for the 6th Generation (6G) has started. 6G will\nneed to enable greater levels of autonomy, improve human machine interfacing,\nand achieve deep connectivity in more diverse environments. The need for\nincreased explainability to enable trust is critical for 6G as it manages a\nwide range of mission critical services (e.g. autonomous driving) to safety\ncritical tasks (e.g. remote surgery). As we migrate from traditional\nmodel-based optimisation to deep learning, the trust we have in our\noptimisation modules decrease. This loss of trust means we cannot understand\nthe impact of: 1) poor/bias/malicious data, and 2) neural network design on\ndecisions; nor can we explain to the engineer or the public the network's\nactions. In this review, we outline the core concepts of Explainable Artificial\nIntelligence (XAI) for 6G, including: public and legal motivations, definitions\nof explainability, performance vs. explainability trade-offs, methods to\nimprove explainability, and frameworks to incorporate XAI into future wireless\nsystems. Our review is grounded in cases studies for both PHY and MAC layer\noptimisation, and provide the community with an important research area to\nembark upon.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 19:49:11 GMT"}, {"version": "v2", "created": "Tue, 19 Nov 2019 21:37:33 GMT"}], "update_date": "2019-11-21", "authors_parsed": [["Guo", "Weisi", ""]]}, {"id": "1911.04801", "submitter": "Ruoyun Chen", "authors": "Ruoyun Chen, Hancheng Lu, Yujiao Lu, Jinxue Liu", "title": "MSDF: A Deep Reinforcement Learning Framework for Service Function Chain\n  Migration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.AI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Under dynamic traffic, service function chain (SFC) migration is considered\nas an effective way to improve resource utilization. However, the lack of\nfuture network information leads to non-optimal solutions, which motivates us\nto study reinforcement learning based SFC migration from a long-term\nperspective. In this paper, we formulate the SFC migration problem as a\nminimization problem with the objective of total network operation cost under\nconstraints of users' quality of service. We firstly design a deep Q-network\nbased algorithm to solve single SFC migration problem, which can adjust\nmigration strategy online without knowing future information. Further, a novel\nmulti-agent cooperative framework, called MSDF, is proposed to address the\nchallenge of considering multiple SFC migration on the basis of single SFC\nmigration. MSDF reduces the complexity thus accelerates the convergence speed,\nespecially in large scale networks. Experimental results demonstrate that MSDF\noutperforms typical heuristic algorithms under various scenarios.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 11:41:38 GMT"}, {"version": "v2", "created": "Wed, 13 Nov 2019 03:04:38 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Chen", "Ruoyun", ""], ["Lu", "Hancheng", ""], ["Lu", "Yujiao", ""], ["Liu", "Jinxue", ""]]}, {"id": "1911.04866", "submitter": "Alexandros Milolidakis", "authors": "Alexandros Milolidakis, Romain Fontugne, Xenofontas Dimitropoulos", "title": "Detecting Network Disruptions At Colocation Facilities", "comments": "10 pages, IEEE INFOCOM 2019-IEEE Conference on Computer\n  Communications", "journal-ref": "In IEEE INFOCOM 2019-IEEE Conference on Computer Communications\n  (pp. 2161-2169). IEEE (2019)", "doi": "10.1109/INFOCOM.2019.8737615", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Colocation facilities and Internet eXchange Points (IXPs) provide neutral\nplaces for concurrent networks to daily exchange terabytes of data traffic.\nAlthough very reliable, these facilities are not immune to failure and may\nexperience difficulties that can have significant impacts on exchanged traffic.\nIn this paper we devise a methodology to identify collocation facilities in\ntraceroute data and to monitor delay and routing patterns between facilities.\nWe also present an anomaly detection technique to report abnormal traffic\nchanges usually due to facilities outages. We evaluate this method with eight\nmonths of traceroute data from the RIPE Atlas measurement platform and manually\ninspect the most prominent events, that are: an IXP outage, a DDoS attack, and\na power failure in a facility. These case studies validate the benefits of the\nproposed system to detect real world outages from traceroute data. We also\ninvestigate the impact of anomalies at the metropolitan-level and identify\noutages that span across up to eight facilities.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 14:07:25 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Milolidakis", "Alexandros", ""], ["Fontugne", "Romain", ""], ["Dimitropoulos", "Xenofontas", ""]]}, {"id": "1911.04900", "submitter": "Daniele Pannone", "authors": "Danilo Avola, Marco Cascio, Luigi Cinque, Daniele Pannone", "title": "Wi-Fi Passive Person Re-Identification based on Channel State\n  Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the increasing need for wireless data transfer, Wi-Fi networks have\nrapidly grown in recent years providing high throughput and easy deployment.\nNowadays, Access Points (APs) can be found easily wherever we go, therefore\nWi-Fi sensing applications have caught a great deal of interest from the\nresearch community. Since human presence and movement influence the Wi-Fi\nsignals transmitted by APs, it is possible to exploit those signals for person\nRe-Identification (Re-ID) task. Traditional techniques for Wi-Fi sensing\napplications are usually based on the Received Signal Strength Indicator (RSSI)\nmeasurement. However, recently, due to the RSSI instability, the researchers in\nthis field propose Channel State Information (CSI) measurement based methods.\nIn this paper we explain how changes in Signal Noise Ratio (SNR), obtained from\nCSI measurements, combined with Neural Networks can be used for person Re-ID\nachieving remarkable preliminary results. Due to the lack of available public\ndata in the current state-of-the-art to test such type of task, we acquired a\ndataset that properly fits the aforementioned task.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 14:42:02 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Avola", "Danilo", ""], ["Cascio", "Marco", ""], ["Cinque", "Luigi", ""], ["Pannone", "Daniele", ""]]}, {"id": "1911.04924", "submitter": "George Nomikos", "authors": "George Nomikos, Vasileios Kotronis, Pavlos Sermpezis, Petros Gigis,\n  Lefteris Manassakis, Christoph Dietzel, Stavros Konstantaras, Xenofontas\n  Dimitropoulos, Vasileios Giotsas", "title": "O Peer, Where Art Thou? Uncovering Remote Peering Interconnections at\n  IXPs", "comments": null, "journal-ref": null, "doi": "10.1145/3278532.3278556", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet eXchange Points (IXPs) are Internet hubs that mainly provide the\nswitching infrastructure to interconnect networks and exchange traffic. While\nthe initial goal of IXPs was to bring together networks residing in the same\ncity or country, and thus keep local traffic local, this model is gradually\nshifting. Many networks connect to IXPs without having physical presence at\ntheir switching infrastructure. This practice, called Remote Peering, is\nchanging the Internet topology and economy, and has become the subject of a\ncontentious debate within the network operators' community. However, despite\nthe increasing attention it attracts, the understanding of the characteristics\nand impact of remote peering is limited. In this work, we introduce and\nvalidate a heuristic methodology for discovering remote peers at IXPs. We (i)\nidentify critical remote peering inference challenges, (ii) infer remote peers\nwith high accuracy (>95%) and coverage (93%) per IXP, and (iii) characterize\ndifferent aspects of the remote peering ecosystem by applying our methodology\nto 30 large IXPs. We observe that remote peering is a significantly common\npractice in all the studied IXPs; for the largest IXPs, remote peers account\nfor 40% of their member base. We also show that today, IXP growth is mainly\ndriven by remote peering, which contributes two times more than local peering.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 15:13:45 GMT"}], "update_date": "2019-11-13", "authors_parsed": [["Nomikos", "George", ""], ["Kotronis", "Vasileios", ""], ["Sermpezis", "Pavlos", ""], ["Gigis", "Petros", ""], ["Manassakis", "Lefteris", ""], ["Dietzel", "Christoph", ""], ["Konstantaras", "Stavros", ""], ["Dimitropoulos", "Xenofontas", ""], ["Giotsas", "Vasileios", ""]]}, {"id": "1911.05126", "submitter": "Mohammed Gharib Dr.", "authors": "Mohammed Gharib, Ali Owfi, Soudeh Ghorbani", "title": "KPsec: Secure End-to-End Communications for Multi-Hop Wireless Networks", "comments": "20 pages, 10 figures, 3 tables, testbed experiment, exhaustive\n  performance evaluation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The security of cyber-physical systems, from self-driving cars to medical\ndevices, depends on their underlying multi-hop wireless networks. Yet, the lack\nof trusted central infrastructures and limited nodes' resources make securing\nthese networks challenging. Recent works on key pre-distribution schemes, where\nnodes communicate over encrypted overlay paths, provide an appealing solution\nbecause of their distributed, computationally light-weight nature. Alas, these\nschemes share a glaring security vulnerability: the two ends of every overlay\nlink can decrypt---and potentially modify and alter---the message. Plus, the\nlonger overlay paths impose traffic overhead and increase latency.\n  We present a novel routing mechanism, KPsec, to address these issues. KPsec\ndeploys multiple disjoint paths and an initial key-exchange phase to secure\nend-to-end communications. After the initial key-exchange phase, traffic in\nKPsec follows the shortest paths and, in contrast to key pre-distribution\nschemes, intermediate nodes cannot decrypt it. We measure the security and\nperformance of KPsec as well as three state-of-the-art key pre-distribution\nschemes using a real 10-node testbed and large-scale simulations. Our\nexperiments show that, in addition to its security benefits, KPsec results in\n$5-15\\%$ improvement in network throughput, up to $75\\%$ reduction in latency,\nand an order of magnitude reduction in energy consumption.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 20:15:05 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Gharib", "Mohammed", ""], ["Owfi", "Ali", ""], ["Ghorbani", "Soudeh", ""]]}, {"id": "1911.05164", "submitter": "Matthias W\\\"ahlisch", "authors": "Jasper Eumann, Raphael Hiesgen, Thomas C. Schmidt, Matthias W\\\"ahlisch", "title": "A Reproducibility Study of \"IP Spoofing Detection in Inter-Domain\n  Traffic\"", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  IP spoofing enables reflection and amplification attacks, which cause major\nthreats to the current Internet infrastructure. IP packets with incorrect\nsource addresses would help to improve the situation. This is easy at the\nattacker's network, but very challenging at Internet eXchange Points (IXPs) or\nin transit networks. In this reproducibility study, we revisit the paper\n\\textit{Detection, Classification, and Analysis of Inter-Domain Traffic with\nSpoofed Source IP Addresses} published at ACM IMC 2017. Using data from a\ndifferent IXP and from a different time, we were not able to reproduce the\nresults. Unfortunately, our analysis shows that the current state of art does\nintroduce a methodology that does not comply with common real-world deployment.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 22:10:38 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Eumann", "Jasper", ""], ["Hiesgen", "Raphael", ""], ["Schmidt", "Thomas C.", ""], ["Wählisch", "Matthias", ""]]}, {"id": "1911.05203", "submitter": "Junaid Ahmed Khan", "authors": "Junaid Ahmed Khan and Cedric Westphal and J.J. Garcia-Luna-Aceves and\n  Yacine Ghamri-Doudane", "title": "Reversing The Meaning of Node Connectivity for Content Placement in\n  Networks of Caches", "comments": null, "journal-ref": "IEEE ICNC 2020", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is a widely accepted heuristic in content caching to place the most\npopular content at the nodes that are the best connected. The other common\nheuristic is somewhat contradictory, as it places the most popular content at\nthe edge, at the caching nodes nearest the users. We contend that neither\npolicy is best suited for caching content in a network and propose a simple\nalternative that places the most popular content at the least connected node.\nNamely, we populate content first at the nodes that have the lowest graph\ncentrality over the network topology. Here, we provide an analytical study of\nthis policy over some simple topologies that are tractable, namely regular\ngrids and trees. Our mathematical results demonstrate that placing popular\ncontent at the least connected nodes outperforms the aforementioned\nalternatives in typical conditions.\n", "versions": [{"version": "v1", "created": "Tue, 12 Nov 2019 23:33:37 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Khan", "Junaid Ahmed", ""], ["Westphal", "Cedric", ""], ["Garcia-Luna-Aceves", "J. J.", ""], ["Ghamri-Doudane", "Yacine", ""]]}, {"id": "1911.05294", "submitter": "Madyan Alsenwi", "authors": "Madyan Alsenwi, Kitae Kim, and Choong Seon Hong", "title": "Radio Resource Allocation in 5G New Radio: A Neural Networks Based\n  Approach)", "comments": null, "journal-ref": "Journal of KIISE, Vol. 46, No. 9, pp.961-967, 2019", "doi": "10.5626/JOK.2019.46.9.961", "report-no": null, "categories": "cs.NI cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The minimum frequency-time unit that can be allocated to User Equipments\n(UEs) in the fifth generation (5G) cellular networks is a Resource Block (RB).\nA RB is a channel composed of a set of OFDM subcarriers for a given time slot\nduration. 5G New Radio (NR) allows for a large number of block shapes ranging\nfrom 15 kHz to 480 kHz. In this paper, we address the problem of RBs allocation\nto UEs. The RBs are allocated at the beginning of each time slot based on the\nchannel state of each UE. The problem is formulated based on the Generalized\nProportional Fair (GPF) scheduling. Then, we model the problem as a 2-Dimension\nHopfield Neural Networks (2D-HNN). Finally, in an attempt to solve the problem,\nthe energy function of 2D-HNN is investigated. Simulation results show the\nefficiency of the proposed approach.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 05:01:52 GMT"}], "update_date": "2019-11-15", "authors_parsed": [["Alsenwi", "Madyan", ""], ["Kim", "Kitae", ""], ["Hong", "Choong Seon", ""]]}, {"id": "1911.05299", "submitter": "Francesco Malandrino", "authors": "Marco Malinverno and Giuseppe Avino and Claudio Casetti and Carla\n  Fabiana Chiasserini and Francesco Malandrino and Salvatore Scarpina", "title": "Edge-Based Collision Avoidance for Vehicles and Vulnerable Users: An\n  Architecture Based on MEC", "comments": null, "journal-ref": "IEEE Vehicular Technology Magazine, 2020", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Collision avoidance is one of the most promising applications for vehicular\nnetworks, dramatically improving the safety of the vehicles that support it. In\nthis paper, we investigate how it can be extended to benefit vulnerable users,\ne.g., pedestrians and bicycles, equipped with a smartphone. We argue that,\nowing to the reduced capabilities of smartphones compared to vehicular on-board\nunits, traditional distributed approaches are not viable, and that multi-access\nedge computing (MEC) support is needed. Thus, we propose a MEC-based collision\navoidance system, discussing its architecture and evaluating its performance.\nWe find that, thanks to MEC, we are able to extend the protection of collision\navoidance, traditionally thought for vehicles, to vulnerable users without\nimpacting its effectiveness or latency.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 05:25:25 GMT"}, {"version": "v2", "created": "Wed, 6 Jan 2021 12:49:13 GMT"}], "update_date": "2021-01-07", "authors_parsed": [["Malinverno", "Marco", ""], ["Avino", "Giuseppe", ""], ["Casetti", "Claudio", ""], ["Chiasserini", "Carla Fabiana", ""], ["Malandrino", "Francesco", ""], ["Scarpina", "Salvatore", ""]]}, {"id": "1911.05330", "submitter": "Rohit Singh Mr", "authors": "Rohit Singh, Douglas Sicker", "title": "Reliable THz Communications for Outdoor based Applications- Use Cases\n  and Methods", "comments": "To appear in IEEE CCNC 2020. The document has 4 pages, 13 figures,\n  and 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Future (beyond 5G) wireless networks will demand high throughput and low\nlatency and would benefit from greenfield, contiguous, and wider bandwidth, all\nof which THz spectrum can provide. Although THz has been envisioned to be\ndeployed in an indoor setting, with proper enforcement and planning, we can\ndraw a limited number of use cases for outdoor THz communication. THz can\nprovide high capacity and ultra-high throughput but at the cost of high path\nloss and sensitivity to device orientation/mobility.. We identify scenarios\nwhere the use of the THz spectrum for an outdoor setting is justified and their\ncritical operating parameters. We further categorize the applications based on\nthe relative mobility between the access point (AP) and user equipment (UE). We\npresent an approach for deploying THz on an outdoor framework by presenting\npreliminary technical parameter analysis for scenarios, like wireless backhaul,\nhigh-speed kiosks, and the aerial base station (ABS). Our preliminary analysis\nshows that the application for each of these scenarios is limited based on\nmultiple parameters, such as distance, device mobility, device orientation,\nuser geometry, antenna gain, and environment settings, which requires separate\nconsideration and optimization.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 07:18:14 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Singh", "Rohit", ""], ["Sicker", "Douglas", ""]]}, {"id": "1911.05404", "submitter": "Rui Campos Dr.", "authors": "Carlos Leocadio, Tiago Oliveira, Pedro Silva, Rui Campos, Jose Ruela", "title": "A Token-Based MAC Solution for WiLD Point-To-Multipoint Links", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The inefficiency of the fundamental access method of the IEEEE 802.11\nstandard is a well-known problem in scenarios where multiple long range and\nfaulty links compete for the shared medium. The alternatives found in the\nliterature are mostly focused on point-to-point and rarely on long range links.\nCurrently, there is no solution optimized for maritime scenarios, where the\npoint-to-multipoint links can reach several tens of kilometers, while suffering\nfrom degradation due to the harsh environment. This paper presents a novel MAC\nprotocol that uses explicit signalling messages to control access to the medium\nby a central node. In this solution, this role is played by an Access Point\nthat sends token messages addressed to each associated station, which is\ngranted exclusive access to the medium and assigned a number of credits; after\nsending its own packets (if any), a station must release control of the token.\nSimulation results show that this mechanism has superior performance in\npoint-to-multipoint, long range and faulty links, allowing a fairly and more\nefficient usage of the shared resources among all nodes.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 11:20:46 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Leocadio", "Carlos", ""], ["Oliveira", "Tiago", ""], ["Silva", "Pedro", ""], ["Campos", "Rui", ""], ["Ruela", "Jose", ""]]}, {"id": "1911.05534", "submitter": "Sandra Lagen", "authors": "Natale Patriciello, Sandra Lagen, Biljana Bojovic, Lorenza Giupponi", "title": "An E2E Simulator for 5G NR Networks", "comments": "accepted for publication in Elsevier SIMPAT", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the specification of the new 5G NR standard proceeds inside 3GPP, the\navailability of a versatile, full-stack, End-to-End (E2E), and open source\nsimulator becomes a necessity to extract insights from the recently approved\n3GPP specifications. This paper presents an extension to ns-3, a well-known\ndiscrete-event network simulator, to support the NR Radio Access Network. The\npresent work describes the design and implementation choices at the MAC and PHY\nlayers, and it discusses a technical solution for managing different bandwidth\nparts. Finally, we present calibration results, according to 3GPP procedures,\nand we show how to get E2E performance indicators in a realistic deployment\nscenario, with special emphasis on the E2E latency.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 15:13:45 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Patriciello", "Natale", ""], ["Lagen", "Sandra", ""], ["Bojovic", "Biljana", ""], ["Giupponi", "Lorenza", ""]]}, {"id": "1911.05589", "submitter": "Rohit Singh Mr", "authors": "Rohit Singh, Douglas Sicker, Kazi Mohammed Saidul Huq", "title": "MOTH- Mobility-induced Outages in THz: A Beyond 5G (B5G) application", "comments": "To appear in IEEE CCNC 2020. The document has 9 pages and 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  5G will enable the growing demand for Internet of Things (IoT),\nhigh-resolution video streaming, and low latency wireless services. Demand for\nsuch services is expected to growth rapid, which will require a search for\nBeyond 5G technological advancements in wireless communications. Part of these\nadvancements is the need for additional spectrum, namely moving toward the\nterahertz (THz) range. To compensate for the high path loss in THz, narrow\nbeamwidths are used to improve antenna gains. However, with narrow beamwidths,\neven minor fluctuations in device location (such as through body movement) can\ncause frequent link failures due to beam misalignment. In this paper, we\nprovide a solution to these small-scale indoor movement that result in\nmobility-induced outages. Like a moth randomly flutters about, Mobility-induced\nOutages in THz (MOTH) can be ephemeral in nature and hard to avoid. To deal\nwith MOTH we propose two methods to predict these outage scenarios: (i)\nAlign-After-Failure (AAF), which predicts based on fixed time margins, and (ii)\nAlign-Before-Failure (ABF), which learns the time margins through user mobility\npatterns. In this paper, two different online classifiers were used to train\nthe ABF model to predicate if a mobility-induced outage is going to occur;\nthereby, significantly reducing the time spent in outage scenarios. Simulation\nresults demonstrate a relationship between optimal beamwidth and human mobility\npatterns. Additionally, to cater to a future with dense deployment of Wireless\nPersonal Area Network (WPAN), it is necessary that we have efficient deployment\nof resources (e.g., THz-APs). One solution is to maximize the user coverage for\na single AP, which might be dependent on multiple parameters. We identify these\nparameters and observe their tradeoffs for improving user coverage through a\nsingle THz-AP.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 16:30:51 GMT"}, {"version": "v2", "created": "Tue, 19 Nov 2019 21:18:32 GMT"}], "update_date": "2019-11-21", "authors_parsed": [["Singh", "Rohit", ""], ["Sicker", "Douglas", ""], ["Huq", "Kazi Mohammed Saidul", ""]]}, {"id": "1911.05601", "submitter": "Rajat Talak", "authors": "Rajat Talak and Eytan Modiano", "title": "Age-Delay Tradeoffs in Queueing Systems", "comments": "arXiv admin note: text overlap with arXiv:1810.04371", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an M server system in which each server can service at most one\nupdate packet at a time. The system designer controls (1) scheduling - the\norder in which the packets get serviced, (2) routing - the server that an\narriving update packet joins for service, and (3) the service time distribution\nwith fixed service rate. Given a fixed update generation process, we prove a\nstrong age-delay and age-delay variance tradeoff, wherein, as the average AoI\napproaches its minimum, the packet delay and its variance approach infinity. In\norder to prove this result, we consider two special cases of the M server\nsystem, namely, a single server system with last come first server with\npreemptive service and an infinite server system. In both these cases, we\nderive sufficient conditions to show that three heavy tailed service time\ndistributions, namely Pareto, log-normal, and Weibull, asymptotically minimize\nthe average AoI as their tail gets heavier, and establish the age-delay\ntradeoff results. We provide an intuitive explanation as to why such a\nseemingly counter intuitive age-delay tradeoff is natural, and that it should\nexist in many systems.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 23:07:15 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Talak", "Rajat", ""], ["Modiano", "Eytan", ""]]}, {"id": "1911.05644", "submitter": "Alexander P. Kartun-Giles", "authors": "Alexander P. Kartun-Giles, Suhanya Jayaprakasam and Sunwoo Kim", "title": "Euclidean Matchings in Ultra-Dense Networks", "comments": "4 pages, 2 figures", "journal-ref": "IEEE Communications Letters 22(6), 2018", "doi": "10.1109/LCOMM.2018.2799207", "report-no": null, "categories": "cond-mat.dis-nn cs.NI math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to study the fundamental limits of network densification, we look at\nthe spatial spectral efficiency gain achieved when densely deployed\ncommunication devices embedded in the $d$-dimensional Euclidean space are\noptimally `matched' in near-neighbour pairs. In light of recent success in\nprobabilisitc modelling, we study devices distributed uniformly at random in\nthe unit cube which enter into one-on-one contracts with each another. This is\nknown in statistical physics as an Euclidean `matching'. Communication channels\neach have their own maximal data capacity given by Shannon's theorem. The\nlength of the shortest matching then corresponds to the maximum one-hop\ncapacity on those points. Interference is then added as a further constraint,\nwhich is modelled using shapes as guard regions, such as a disk, diametral\ndisk, or equilateral triangle, matched to points, in a similar light to\ncomputational geometry. The disk, for example, produces the Delaunay\ntriangulation, while the diametral disk produces a beta-skeleton. We also\ndiscuss deriving the scaling limit of both models using the replica method from\nthe physics of disordered systems.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 17:18:58 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Kartun-Giles", "Alexander P.", ""], ["Jayaprakasam", "Suhanya", ""], ["Kim", "Sunwoo", ""]]}, {"id": "1911.05771", "submitter": "Maede Zolanvari", "authors": "Maede Zolanvari, Marcio A. Teixeira, Lav Gupta, Khaled M. Khan, Raj\n  Jain", "title": "Machine Learning Based Network Vulnerability Analysis of Industrial\n  Internet of Things", "comments": null, "journal-ref": "in IEEE Internet of Things Journal, vol. 6, no. 4, pp. 6822-6834,\n  Aug. 2019", "doi": null, "report-no": null, "categories": "cs.CR cs.LG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is critical to secure the Industrial Internet of Things (IIoT) devices\nbecause of potentially devastating consequences in case of an attack. Machine\nlearning and big data analytics are the two powerful leverages for analyzing\nand securing the Internet of Things (IoT) technology. By extension, these\ntechniques can help improve the security of the IIoT systems as well. In this\npaper, we first present common IIoT protocols and their associated\nvulnerabilities. Then, we run a cyber-vulnerability assessment and discuss the\nutilization of machine learning in countering these susceptibilities. Following\nthat, a literature review of the available intrusion detection solutions using\nmachine learning models is presented. Finally, we discuss our case study, which\nincludes details of a real-world testbed that we have built to conduct\ncyber-attacks and to design an intrusion detection system (IDS). We deploy\nbackdoor, command injection, and Structured Query Language (SQL) injection\nattacks against the system and demonstrate how a machine learning based anomaly\ndetection system can perform well in detecting these attacks. We have evaluated\nthe performance through representative metrics to have a fair point of view on\nthe effectiveness of the methods.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 19:25:53 GMT"}], "update_date": "2019-11-15", "authors_parsed": [["Zolanvari", "Maede", ""], ["Teixeira", "Marcio A.", ""], ["Gupta", "Lav", ""], ["Khan", "Khaled M.", ""], ["Jain", "Raj", ""]]}, {"id": "1911.05918", "submitter": "Vaneet Aggarwal", "authors": "Ajay Badita and Parimal Parag and Vaneet Aggarwal", "title": "Optimal Server Selection for Straggler Mitigation", "comments": null, "journal-ref": "IEEE/ACM Transactions on Networking, vol. 28, no. 2, pp. 709--721,\n  April 2020", "doi": "10.1109/TNET.2020.2973224", "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The performance of large-scale distributed compute systems is adversely\nimpacted by stragglers when the execution time of a job is uncertain. To manage\nstragglers, we consider a multi-fork approach for job scheduling, where\nadditional parallel servers are added at forking instants. In terms of the\nforking instants and the number of additional servers, we compute the job\ncompletion time and the cost of server utilization when the task processing\ntimes are assumed to have a shifted exponential distribution. We use this study\nto provide insights into the scheduling design of the forking instants and the\nassociated number of additional servers to be started. Numerical results\ndemonstrate orders of magnitude improvement in cost in the regime of low\ncompletion times as compared to the prior works.\n", "versions": [{"version": "v1", "created": "Thu, 14 Nov 2019 03:18:20 GMT"}], "update_date": "2021-03-26", "authors_parsed": [["Badita", "Ajay", ""], ["Parag", "Parimal", ""], ["Aggarwal", "Vaneet", ""]]}, {"id": "1911.06463", "submitter": "Sheng Zhou", "authors": "Liumeng Wang, Sheng Zhou", "title": "Flexible Functional Split and Power Control for Energy Harvesting Cloud\n  Radio Access Networks", "comments": "Accepted by IEEE Trans. Wireless Commun", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Functional split is a promising technique to flexibly balance the processing\ncost at remote ends and the fronthaul rate in cloud radio access networks\n(C-RAN). By harvesting renewable energy, remote radio units (RRUs) can save\ngrid power and be flexibly deployed. However, the randomness of energy arrival\nposes a major design challenge. To maximize the throughput under the average\nfronthaul rate constraint in C-RAN with renewable powered RRUs, we first study\nthe offline problem of selecting the optimal functional split modes and the\ncorresponding durations, jointly with the transmission power. We find that\nbetween successive energy arrivals, at most two functional split modes should\nbe selected. Then the optimal online problem is formulated as an Markov\ndecision process (MDP). To deal with the curse of dimensionality of solving\nMDP, we further analyze the special case with one instance of energy arrival\nand two candidate functional split modes as inspired by the offline solution,\nand then a heuristic online policy is proposed. Numerical results show that\nwith flexible functional split, the throughput can be significantly improved\ncompared with fixed functional split. Also, the proposed heuristic online\npolicy has similar performance with the optimal online one, as validated by\nsimulations.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2019 03:48:02 GMT"}], "update_date": "2019-11-18", "authors_parsed": [["Wang", "Liumeng", ""], ["Zhou", "Sheng", ""]]}, {"id": "1911.06532", "submitter": "Vahid Shah-Mansouri Dr.", "authors": "Mohammad Karimzadeh Farshbafan, Vahid Shah-Mansouri, and Dusit Niyato", "title": "A Dynamic Reliability-Aware Service Placement for Network Function\n  Virtualization (NFV)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network softwarization is one of the major paradigm shifts in the next\ngeneration of networks. It enables programmable and flexible management and\ndeployment of the network. Network function virtualization (NFV) is referred to\nthe deployment of software functions running on commodity servers instead of\ntraditional hardware-based middle-boxes. It is an example of network\nsoftwarization. In NFV, a service is defined as a chain of software functions\nnamed service chain function (SFC). The process of allocating the resources of\nservers to the services, called service placement, is the most challenging\nmission in NFV. Dynamic nature of the service arrivals and departures as well\nas meeting the service level agreement make the service placement problem even\nmore challenging. In this paper, we propose a model for dynamic\nreliability-aware service placement based on the simultaneous allocation of the\nmain and backup servers. Then, we formulate the dynamic reliability-aware\nservice placement as an infinite horizon Markov decision process (MDP), which\naims to minimize the placement cost and maximize the number of admitted\nservices. In the proposed MDP, the number of active services in the network is\nconsidered to be the state of the system, and the state of the idle resources\nis estimated based on it. Also, the number of possible admitted services is\nconsidered as the action of the presented MDP. To evaluate each possible action\nin the proposed MDP, we use a sub-optimal method based on the Viterbi algorithm\nnamed Viterbi-based Reliable Static Service Placement (VRSSP) algorithm. We\ndetermine the optimal policy based on value iteration method using an algorithm\nnamed VRSSP-based Value Iteration (VVI) algorithm. Eventually, through the\nextensive simulations, the superiority of the proposed model for dynamic\nreliability-aware service placement compared to the static solutions is\ninferred.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2019 09:24:08 GMT"}], "update_date": "2019-11-18", "authors_parsed": [["Farshbafan", "Mohammad Karimzadeh", ""], ["Shah-Mansouri", "Vahid", ""], ["Niyato", "Dusit", ""]]}, {"id": "1911.06610", "submitter": "Mehmet Tekerek (PhD)", "authors": "Zeynep \\\"Ozdemir, Mehmet Tekerek, Ahmet Serdar Y{\\i}lmaz", "title": "Design of Internet of Things Based Controller for Direct Current Motors", "comments": "in Turkish language. International Symposium on Advanced Engineering\n  Technologies 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  It is known that internet have been widespread in many areas of life and\nenabled machines to communicate each other. The terms of Internet of Things\n(IoT) has emerged as a result of networks consist of machines and equipment\nthat work independent of operator and communicate each other. Sensors, embedded\nsystems, communication technologies and data storage systems like clouds create\nwide area networks that can communicate and share data. In this study, the\napplication of the IoT on a low speed mechanical benchmark driven by a direct\ncurrent motor has been designed. It is aimed to keep the motor speed fixed at\ndesired value according to the changings occurs depending on varying the\npressure acting on the actuators. In presented study, a speed control is\nperformed by establishing a modeling and simulation mechanism that will give\nthe closest results to the real system.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2019 18:41:27 GMT"}], "update_date": "2019-11-18", "authors_parsed": [["Özdemir", "Zeynep", ""], ["Tekerek", "Mehmet", ""], ["Yılmaz", "Ahmet Serdar", ""]]}, {"id": "1911.06951", "submitter": "Samson Zhou", "authors": "Zaoxing Liu, Samson Zhou, Ori Rottenstreich, Vladimir Braverman,\n  Jennifer Rexford", "title": "Memory-Efficient Performance Monitoring on Programmable Switches with\n  Lean Algorithms", "comments": "To appear at APoCS 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network performance problems are notoriously difficult to diagnose. Prior\nprofiling systems collect performance statistics by keeping information about\neach network flow, but maintaining per-flow state is not scalable on\nresource-constrained NIC and switch hardware. Instead, we propose sketch-based\nperformance monitoring using memory that is sublinear in the number of flows.\nExisting sketches estimate flow monitoring metrics based on flow sizes. In\ncontrast, performance monitoring typically requires combining information\nacross pairs of packets, such as matching a data packet with its acknowledgment\nto compute a round-trip time. We define a new class of \\emph{lean} algorithms\nthat use memory sublinear in both the size of input data and the number of\nflows. We then introduce lean algorithms for a set of important statistics,\nsuch as identifying flows with high latency, loss, out-of-order, or\nretransmitted packets. We implement prototypes of our lean algorithms on a\ncommodity programmable switch using the P4 language. Our experiments show that\nlean algorithms detect $\\sim$82\\% of top 100 problematic flows among real-world\npacket traces using just 40KB memory.\n", "versions": [{"version": "v1", "created": "Sat, 16 Nov 2019 04:01:37 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Liu", "Zaoxing", ""], ["Zhou", "Samson", ""], ["Rottenstreich", "Ori", ""], ["Braverman", "Vladimir", ""], ["Rexford", "Jennifer", ""]]}, {"id": "1911.07289", "submitter": "Spyridon Mastorakis", "authors": "Akshay Raman and Kimberly Chou and Spyridon Mastorakis", "title": "Experimenting with a Simulation Framework for Peer-to-Peer File Sharing\n  in Named Data Networking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer-to-peer file sharing envisions a data-centric dissemination model, where\nfiles consisting of multiple data pieces can be shared from any peer that can\noffer the data or from multiple peers simultaneously. This aim, implemented at\nthe application layer of the network architecture, matches with the objective\nof Named Data Networking (NDN), a proposed Internet architecture that features\na data-centric communication model at the network layer. To study the impact of\na data-centric network architecture on peer-to-peer file sharing, we proposed\nnTorrent, a peer-to-peer file sharing application on top of NDN. Since the\ninitial nTorrent proposal in 2017, we have implemented its design in ndnSIM,\nthe de facto NDN simulator. In this paper, we present the design of our\nnTorrent simulation framework, discussing various design decisions and\ntrade-offs. We also describe our experimentation and validation process to\nensure that our framework possesses the fundamental properties of nTorrent.\n", "versions": [{"version": "v1", "created": "Sun, 17 Nov 2019 17:13:09 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Raman", "Akshay", ""], ["Chou", "Kimberly", ""], ["Mastorakis", "Spyridon", ""]]}, {"id": "1911.07301", "submitter": "Zheng Chen", "authors": "Zheng Chen, Emil Bj\\\"ornson and Erik G. Larsson", "title": "Dynamic Resource Allocation in Co-Located and Cell-Free Massive MIMO", "comments": "12 pages, 12 figures, to appear in IEEE Transactions on Green\n  Communications and Networking (TGCN). arXiv admin note: substantial text\n  overlap with arXiv:1904.04617", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study joint power control and scheduling in uplink massive\nmultiple-input multiple-output (MIMO) systems with randomly arriving data\ntraffic. We consider both co-located and Cell-Free (CF) Massive MIMO, where the\ndifference lies in whether the antennas are co-located at the base station or\nspread over a wide network area. The data is generated at each user according\nto an individual stochastic process. Using Lyapunov optimization techniques, we\ndevelop a dynamic scheduling algorithm (DSA), which decides at each time slot\nthe amount of data to admit to the transmission queues and the transmission\nrates over the wireless channel. The proposed algorithm optimizes the long-term\nuser throughput under various fairness policies while keeping the transmission\nqueues stable. Simulation results show that the state-of-the-art power control\nschemes developed for Massive MIMO with infinite backlogs can fail to stabilize\nthe system even when the data arrival rates are within the network capacity\nregion. Our proposed DSA shows advantage in providing finite delay with\nperformance optimization whenever the network can be stabilized.\n", "versions": [{"version": "v1", "created": "Wed, 13 Nov 2019 10:40:49 GMT"}, {"version": "v2", "created": "Fri, 22 Nov 2019 21:40:22 GMT"}], "update_date": "2019-11-26", "authors_parsed": [["Chen", "Zheng", ""], ["Björnson", "Emil", ""], ["Larsson", "Erik G.", ""]]}, {"id": "1911.07351", "submitter": "Bishakh Chandra Ghosh", "authors": "Bishakh Chandra Ghosh, Sourav Kanti Addya, Nishant Baranwal Somy,\n  Shubha Brata Nath, Sandip Chakraborty, Soumya K Ghosh", "title": "Caching Techniques to Improve Latency in Serverless Architectures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Serverless computing has gained a significant traction in recent times\nbecause of its simplicity of development, deployment and fine-grained billing.\nHowever, while implementing complex services comprising databases, file stores,\nor more than one serverless function, the performance in terms of latency of\nserving requests often degrades severely. In this work, we analyze different\nserverless architectures with AWS Lambda services and compare their performance\nin terms of latency with a traditional virtual machine (VM) based approach. We\nobserve that database access latency in serverless architecture is almost 14\ntimes than that in VM based setup. Further, we introduce some caching\nstrategies which can improve the response time significantly, and compare their\nperformance.\n", "versions": [{"version": "v1", "created": "Sun, 17 Nov 2019 21:45:09 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Ghosh", "Bishakh Chandra", ""], ["Addya", "Sourav Kanti", ""], ["Somy", "Nishant Baranwal", ""], ["Nath", "Shubha Brata", ""], ["Chakraborty", "Sandip", ""], ["Ghosh", "Soumya K", ""]]}, {"id": "1911.07452", "submitter": "Chih-Wei Huang", "authors": "Chih-Wei Huang and Po-Chen Chen", "title": "Mobile Traffic Offloading with Forecasting using Deep Reinforcement\n  Learning", "comments": null, "journal-ref": "IEEE Access, vol. 8, pp. 66588-66597, 2020", "doi": "10.1109/ACCESS.2020.2985679", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the explosive growth in demand for mobile traffic, one of the promising\nsolutions is to offload cellular traffic to small base stations for better\nsystem efficiency. Due to increasing system complexity, network operators are\nfacing severe challenges and looking for machine learning-based solutions. In\nthis work, we propose an energy-aware mobile traffic offloading scheme in the\nheterogeneous network jointly apply deep Q network (DQN) decision making and\nadvanced traffic demand forecasting. The base station control model is trained\nand verified on an open dataset from a major telecom operator. The performance\nevaluation shows that DQN-based methods outperform others at all levels of\nmobile traffic demand. Also, the advantage of accurate traffic prediction is\nmore significant under higher traffic demand.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 06:55:16 GMT"}], "update_date": "2020-05-19", "authors_parsed": [["Huang", "Chih-Wei", ""], ["Chen", "Po-Chen", ""]]}, {"id": "1911.07608", "submitter": "Ali Asgher Mansoor Habiby", "authors": "Ali Asgher Mansoor Habiby and Ahamed Thoppu", "title": "Application of Reinforcement Learning for 5G Scheduling Parameter\n  Optimization", "comments": "7 pages, 11 figures. Complete experiment conducted on a Live 5G\n  Network and live 5G site", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  RF Network parametric optimization requires a wealth of experience and\nknowledge to achieve the optimal balance between coverage, capacity, system\nefficiency and customer experience from the telecom sites serving the users.\nWith 5G, the complications of Air interface scheduling have increased due to\nthe usage of massive MIMO, beamforming and introduction of higher modulation\nschemes with varying numerologies. In this work, we tune a machine learning\nmodel to \"learn\" the best combination of parameters for a given traffic profile\nusing Cross Entropy Method Reinforcement Learning and compare these with RF\nSubject Matter Expert \"SME\" recommendations. This work is aimed towards\nautomatic parameter tuning and feature optimization by acting as a Self\nOrganizing Network module\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2019 16:05:53 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Habiby", "Ali Asgher Mansoor", ""], ["Thoppu", "Ahamed", ""]]}, {"id": "1911.07614", "submitter": "Dawit Hadush Hailu", "authors": "Dawit Hadush Hailu, Gebrehiwet Gebrekrstos Lema, Gebremichael T.\n  Tesfamariam", "title": "Integrated Hybrid Optical Networking (IHON) /Fusion for 5G Access\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today, deployment of optical fiber has offered large transmission capacity\nwhich cannot be efficiently utilized by the electronic switches. Rather,\nIntegrated Hybrid Optical Network (IHON) is a promising approach which combines\nboth packet and circuit switching techniques. As a result, it achieves\nefficient utilization of the bulk capacity and guarantees absolute Quality of\nService (QoS) by optimizing the advantages of the two switching schemes while\ndiminishing their disadvantages. Transpacket has developed a Fusion node\nimplementing IHON principles in Ethernet for the data plane. Hence, this paper\ninvestigates and evaluates IHON network for 5G access networks. The simulated\nresults and numerical analysis confirm that the Packet Delay Variation (PDV),\nDelay and Packet Loss Ratio (PLR) of Guaranteed Service Transport. (GST)\ntraffic in IHON network met the requirements of 5G mobile fronthaul using CPRI.\nThe number of nodes in the network limits the maximum separation distance\nbetween Base Band Unit. (BBU) and Remote Radio Head (RRH), link length; for\nincreasing the number of nodes, the link length decreases. In addition to this,\nwe verified how the leftover capacity of fusion node can be used to carry the\nlow priority packets and how the GST traffic can have deterministic\ncharacteristics on a single wavelength by delaying it with Fixed Delay Line\n(FDL). For example, for LSM 1GE=0.3 the added Statistical Multiplexing (SM)\ntraffic increases the 10GE wavelength utilization up to 89% without any losses\nand with SM PLR=0.001 up to 92% utilization.\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2019 06:23:35 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Hailu", "Dawit Hadush", ""], ["Lema", "Gebrehiwet Gebrekrstos", ""], ["Tesfamariam", "Gebremichael T.", ""]]}, {"id": "1911.07615", "submitter": "Jun Li", "authors": "Jun Li, Xiaoman Shen, Lei Chen and Jiajia Chen", "title": "Bandwidth Slicing to Boost Federated Learning in Edge Computing", "comments": "Conference,3 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bandwidth slicing is introduced to support federated learning in edge\ncomputing to assure low communication delay for training traffic. Results\nreveal that bandwidth slicing significantly improves training efficiency while\nachieving good learning accuracy.\n", "versions": [{"version": "v1", "created": "Thu, 24 Oct 2019 07:49:22 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Li", "Jun", ""], ["Shen", "Xiaoman", ""], ["Chen", "Lei", ""], ["Chen", "Jiajia", ""]]}, {"id": "1911.07616", "submitter": "Geeth P Wijesiri N B A", "authors": "Geeth P. Wijesiri, Jussi Haapola and Tharaka Samarasinghe", "title": "A Discrete-Time Markov Chain Based Comparison of the MAC Layer\n  Performance of C-V2X Mode 4 and IEEE 802.11p", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicle-to-vehicle (V2V) communication plays a pivotal role in intelligent\ntransport systems (ITS) with cellular-vehicle to everything (C-V2X) and IEEE\n802.11p being the two competing enabling technologies. This paper presents\nmulti-dimensional discrete-time Markov chain (DTMC) based models to study the\nmedium access control (MAC) layer performance of the IEEE 802.11p standard and\nC-V2X Mode 4. These models are coupled with an appropriate DTMC based queuing\nmodel, and traffic generators for periodic cooperative awareness messages\n(CAMs) and event-driven decentralized environmental notification messages\n(DENMs). Closed-form solutions for the steady-state probabilities of the models\nare obtained, which are then utilized to derive expressions for several key\nperformance metrics. An application for a highway scenario is presented to\nprovide numerical results and to draw insights on the performance. In\nparticular, a performance comparison between IEEE 802.11p and C-V2X Mode 4 in\nterms of the average delay, the collision probability, and the channel\nutilization is presented. The results show that IEEE 802.11p is superior in\nterms of average delay, whereas C-V2X Mode 4 excels in collision resolution.\nThe paper also includes design insights on possible future MAC layer\nperformance enhancements of both standards.\n", "versions": [{"version": "v1", "created": "Thu, 24 Oct 2019 20:30:09 GMT"}, {"version": "v2", "created": "Tue, 3 Mar 2020 13:09:59 GMT"}, {"version": "v3", "created": "Mon, 17 Aug 2020 11:15:09 GMT"}], "update_date": "2020-08-18", "authors_parsed": [["Wijesiri", "Geeth P.", ""], ["Haapola", "Jussi", ""], ["Samarasinghe", "Tharaka", ""]]}, {"id": "1911.07617", "submitter": "Kai Li", "authors": "Kai Li, Wei Ni, Yousef Emami, Yiran Shen, Ricardo Severino, David\n  Pereira, Eduardo Tovar", "title": "Design and Implementation of Secret Key Agreement for Platoon-based\n  Vehicular Cyber-Physical Systems", "comments": "To be published in ACM Transactions on Cyber-Physical Systems (TCPS)", "journal-ref": null, "doi": "10.1145/3365996", "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In platoon-based vehicular cyber-physical system (PVCPS), a lead vehicle that\nis responsible for managing the platoon's moving directions and velocity\nperiodically disseminates control messages to the vehicles that follow.\nSecuring wireless transmissions of the messages between the vehicles is\ncritical for privacy and confidentiality of platoon's driving pattern. However,\ndue to the broadcast nature of radio channels, the transmissions are vulnerable\nto eavesdropping. In this paper, we propose a cooperative secret key agreement\n(CoopKey) scheme for encrypting/decrypting the control messages, where the\nvehicles in PVCPS generate a unified secret key based on the quantized fading\nchannel randomness. Channel quantization intervals are optimized by dynamic\nprogramming to minimize the mismatch of keys. A platooning testbed is built\nwith autonomous robotic vehicles, where a TelosB wireless node is used for\nonboard data processing and multi-hop dissemination. Extensive real-world\nexperiments demonstrate that CoopKey achieves significantly low secret bit\nmismatch rate in a variety of settings. Moreover, the standard NIST test suite\nis employed to verify randomness of the generated keys, where the p-values of\nour CoopKey pass all the randomness tests. We also evaluate CoopKey with an\nextended platoon size via simulations to investigate the effect of system\nscalability on performance.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2019 00:49:58 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Li", "Kai", ""], ["Ni", "Wei", ""], ["Emami", "Yousef", ""], ["Shen", "Yiran", ""], ["Severino", "Ricardo", ""], ["Pereira", "David", ""], ["Tovar", "Eduardo", ""]]}, {"id": "1911.07621", "submitter": "Ahmad Shawahna", "authors": "Dr. Uthman Baroudi, Ahmad Shawahna, and Md. Enamul Haque", "title": "Efficient Energy Harvesting in Wireless Sensor Networks of Smart Grid", "comments": "5 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Smart grids are becoming ubiquitous in recent time. With the progress of\nautomation in this arena, it needs to be diagnosed for better performance and\nless failures. There are several options for doing that but we have seen from\nthe past research that using Wireless Sensor Network (WSN) as the diagnosis\nframework would be the most promising option due to its diverse benefits.\nSeveral challenges such as effect of noise, lower speed, selective node\nreplacement, complexity of logistics, and limited battery lifetime arise while\nusing WSN as the framework. Limited battery lifetime has become one of the most\nsignificant issues to focus on to get rid of it. This article provides a model\nfor replenishing the battery charge of the sensor nodes of wireless sensor\nnetwork. We will use the model for sensor battery recharging in an efficient\nway so that no nodes become out of service after a while. We will be using\nmobile charger for this purpose. So, there may be some scope for improving the\nrecharge interval for the mobile charger as well. This will be satisfied using\noptimum path calculation for each time the charger travels to the nodes. Our\nmain objectives are to maximize the nodes battery utilization, distribute power\neffectively from the energy harvester, and minimize the distance between power\nsource and cluster head. The simulation results show that the proposed approach\nsuccessfully maximizes the utilization of the nodes battery while minimizes the\nwaiting time for the sensor nodes to get recharged from the energy harvester.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2019 19:10:23 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Baroudi", "Dr. Uthman", ""], ["Shawahna", "Ahmad", ""], ["Haque", "Md. Enamul", ""]]}, {"id": "1911.07622", "submitter": "Edoardo Longo Mr.", "authors": "Edoardo Longo and Alessandro Enrico Cesare Redondi and Matteo Cesana\n  and Andr\\`es Arcia-Moret and Pietro Manzoni", "title": "MQTT-ST: a Spanning Tree Protocol for Distributed MQTT Brokers", "comments": "Submitted to 2020 ICC conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  MQTT, one of the most popular protocols for the IoT, works according to a\npublish/subscribe pattern in which multiple clients connect to a single broker,\ngenerally hosted in the cloud. However, such a centralised approach does not\nscale well considering the massive numbers of IoT devices forecasted in the\nnext future, thus calling for distributed solutions in which multiple brokers\ncooperate together. Indeed, distributed brokers can be moved from traditional\ncloud-based infrastructure to the edge of the network (as it is envisioned by\nthe upcoming MEC technology of 5G cellular networks), with clear improvements\nin terms of latency, for example. This paper proposes MQTT-ST, a protocol able\nto create such a distributed architecture of brokers, organized through a\nspanning tree. The protocol uses in-band signalling (i.e., reuses MQTT\nprimitives for the control messages) and allows for full message replication\namong brokers, as well as robustness against failures. We tested MQTT-ST in\ndifferent experimental scenarios and we released it as open-source project to\nallow for reproducible research.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2019 10:34:48 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Longo", "Edoardo", ""], ["Redondi", "Alessandro Enrico Cesare", ""], ["Cesana", "Matteo", ""], ["Arcia-Moret", "Andrès", ""], ["Manzoni", "Pietro", ""]]}, {"id": "1911.07625", "submitter": "Ahmed Ben Said", "authors": "Ahmed Ben Said and Abdelkarim Erradi", "title": "Deep-Gap: A deep learning framework for forecasting crowdsourcing\n  supply-demand gap based on imaging time series and residual learning", "comments": "Accepted at CloudCom 2019 Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.HC cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile crowdsourcing has become easier thanks to the widespread of\nsmartphones capable of seamlessly collecting and pushing the desired data to\ncloud services. However, the success of mobile crowdsourcing relies on\nbalancing the supply and demand by first accurately forecasting spatially and\ntemporally the supply-demand gap, and then providing efficient incentives to\nencourage participant movements to maintain the desired balance. In this paper,\nwe propose Deep-Gap, a deep learning approach based on residual learning to\npredict the gap between mobile crowdsourced service supply and demand at a\ngiven time and space. The prediction can drive the incentive model to achieve a\ngeographically balanced service coverage in order to avoid the case where some\nareas are over-supplied while other areas are under-supplied. This allows\nanticipating the supply-demand gap and redirecting crowdsourced service\nproviders towards target areas. Deep-Gap relies on historical supply-demand\ntime series data as well as available external data such as weather conditions\nand day type (e.g., weekday, weekend, holiday). First, we roll and encode the\ntime series of supply-demand as images using the Gramian Angular Summation\nField (GASF), Gramian Angular Difference Field (GADF) and the Recurrence Plot\n(REC). These images are then used to train deep Convolutional Neural Networks\n(CNN) to extract the low and high-level features and forecast the crowdsourced\nservices gap. We conduct comprehensive comparative study by establishing two\nsupply-demand gap forecasting scenarios: with and without external data.\nCompared to state-of-art approaches, Deep-Gap achieves the lowest forecasting\nerrors in both scenarios.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2019 17:32:39 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Said", "Ahmed Ben", ""], ["Erradi", "Abdelkarim", ""]]}, {"id": "1911.07628", "submitter": "Shaohan Feng Mr", "authors": "Shaohan Feng, Dusit Niyato, Xiao Lu, Ping Wang, Dong In Kim", "title": "Dynamic Model for Network Selection in Next Generation HetNets with\n  Memory-affecting Rational Users", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, due to the staggering growth of wireless data traffic,\nheterogeneous networks have drawn tremendous attention due to the capabilities\nof enhancing the capacity/coverage and to save energy consumption for the next\ngeneration wireless networks. In this paper, we study a long-run user-centric\nnetwork selection problem in the 5G heterogeneous network, where the network\nselection strategies of the users can be investigated dynamically. Unlike the\nconventional studies on the long-run model, we incorporate the memory effect\nand consider the fact that the decision-making of the users is affected by\ntheir memory, i.e., their past service experience. Namely, the users select the\nnetwork based on not only their instantaneous achievable service experience but\nalso their past service experience within their memory. Specifically, we model\nand study the interaction among the users in the framework of fractional\nevolutionary game based on the classical evolutionary game theory and the\nconcept of the power-law memory. We analytically prove that the equilibrium of\nthe fractional evolutionary game exists, is unique and uniformly stable. We\nalso numerically demonstrate the stability of the fractional evolutionary\nequilibrium. Extensive numerical results have been conducted to evaluate the\nperformance of the fractional evolutionary game. The numerical results have\nrevealed some insightful findings. For example, the user in the fractional\nevolutionary game with positive memory effect can achieve a higher cumulative\nutility compared with the user in the fractional evolutionary game with\nnegative memory effect. Moreover, the fractional evolutionary game with\npositive memory effect can reduce the loss in the user's cumulative utility\ncaused by the small-scale fading.\n", "versions": [{"version": "v1", "created": "Mon, 11 Nov 2019 12:18:32 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Feng", "Shaohan", ""], ["Niyato", "Dusit", ""], ["Lu", "Xiao", ""], ["Wang", "Ping", ""], ["Kim", "Dong In", ""]]}, {"id": "1911.07631", "submitter": "Dong Ma", "authors": "Dong Ma, Ming Ding, Mahbub Hassan", "title": "Enhancing Cellular Communications for UAVs via Intelligent Reflective\n  Surface", "comments": "6 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intelligent reflective surfaces (IRSs) capable of reconfiguring their\nelectromagnetic absorption and reflection properties in real-time are offering\nunprecedented opportunities to enhance wireless communication experience in\nchallenging environments. In this paper, we analyze the potential of IRS in\nenhancing cellular communications for UAVs, which currently suffers from poor\nsignal strength due to the down-tilt of base station antennas optimized to\nserve ground users. We consider deployment of IRS on building walls, which can\nbe remotely configured by cellular base stations to coherently direct the\nreflected radio waves towards specific UAVs in order to increase their received\nsignal strengths. Using the recently released 3GPP ground-to-air channel\nmodels, we analyze the signal gains at UAVs due to the IRS deployments as a\nfunction of UAV height as well as various IRS parameters including size,\naltitude, and distance from base station. Our analysis suggests that even with\na small IRS, we can achieve significant signal gain for UAVs flying above the\ncellular base station. We also find that the maximum gain can be achieved by\noptimizing the location of IRS including its altitude and distance to BS.\n", "versions": [{"version": "v1", "created": "Thu, 7 Nov 2019 03:28:46 GMT"}, {"version": "v2", "created": "Fri, 31 Jan 2020 14:17:52 GMT"}], "update_date": "2020-02-03", "authors_parsed": [["Ma", "Dong", ""], ["Ding", "Ming", ""], ["Hassan", "Mahbub", ""]]}, {"id": "1911.07633", "submitter": "Tajul Rosli Razak Mr", "authors": "Iman Hazwam Abd Halim, Nur Muhammad Irfan Abu Hassan, Tajul Rosli\n  Razak, Muhammad Nabil Fikri Jamaluddin, Mohammad Hafiz Ismail", "title": "Reducing Honeypot Log Storage Capacity Consumption -- Cron Job with\n  Perl-Script Approach", "comments": null, "journal-ref": "Journal of Computing Research & Innovation (JCRINN) Vol 4, No 1\n  (2019)", "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Honeypot is a decoy computer system that is used to attract and monitor\nhackers' activities in the network. The honeypot aims to collect information\nfrom the hackers in order to create a more secure system. However, the log file\ngenerated by honeypot can grow very large when heavy traffic occurred in the\nsystem, such as Distributed Denial of Services' (DDoS) attack. The DDoS\npossesses difficulty when it is being processed and analyzed by the network\nadministrator as it required a lot of time and resources. Therefore, in this\npaper, we propose an approach to decrease the log size that is by using a Cron\njob that will run with a Perl-script. This approach parses the collected data\ninto the database periodically to decrease the log size. Three DDoS attack\ncases were conducted in this study to show the increasing of the log size by\nsending a different amount of packet per second for 8 hours in each case. The\nresults have shown that by utilizing the Cron job with Perl-script, the log\nsize has been significantly reduced, the disk space used in the system has also\ndecreased. Consequently, this approach capable of speeding up the process of\nparsing the log file into the database and thus, improving the overall system\nperformance. This study contributes to providing a pathway in reducing honeypot\nlog storage using the Cron job with Perl-Script.\n", "versions": [{"version": "v1", "created": "Wed, 6 Nov 2019 01:58:10 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Halim", "Iman Hazwam Abd", ""], ["Hassan", "Nur Muhammad Irfan Abu", ""], ["Razak", "Tajul Rosli", ""], ["Jamaluddin", "Muhammad Nabil Fikri", ""], ["Ismail", "Mohammad Hafiz", ""]]}, {"id": "1911.07635", "submitter": "Galini Tsoukaneri Mrs", "authors": "Mythri Hunukumbure, Galini Tsoukaneri", "title": "Cost Analysis for Drone based 5G eMBB Provision to Emergency Services", "comments": "5 pages, 6 figures, GlobeCom 2020", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is growing interest in investigating how the 5G capabilities can be\nextended to the critical communications vertical, in an expedited time scale.\nThis paper provides a comprehensive cost analysis of a drone-based 5G\ndeployment solution for emergency services. The proposed deployment uses\nexisting 4G and 5G ground small cells and the fronthaul, backhaul network. The\ncost analysis develops an analytical approach to minimize the Total Cost of\nOwnership (TCO), where the key parameters of drone unit cost, number of drones\nper link, and link capacity are jointly optimized. Our numerical analyses look\nat the TCO sensitivity to the above parameters to find sweet spots for\ndeployment in different parameter combinations. The 3GPP centralization options\nare also investigated in terms of the TCO, and it is observed that\ncentralization split points at higher layers benefit from lower TCO in this\ndeployment model.\n", "versions": [{"version": "v1", "created": "Thu, 7 Nov 2019 10:06:34 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Hunukumbure", "Mythri", ""], ["Tsoukaneri", "Galini", ""]]}, {"id": "1911.07653", "submitter": "Xianfu Chen", "authors": "Xianfu Chen and Tao Chen and Zhifeng Zhao and Honggang Zhang and Mehdi\n  Bennis and Yusheng Ji", "title": "Resource Awareness in Unmanned Aerial Vehicle-Assisted Mobile-Edge\n  Computing Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper investigates an unmanned aerial vehicle (UAV)-assisted mobile-edge\ncomputing (MEC) system, in which the UAV provides complementary computation\nresource to the terrestrial MEC system. The UAV processes the received\ncomputation tasks from the mobile users (MUs) by creating the corresponding\nvirtual machines. Due to finite shared I/O resource of the UAV in the MEC\nsystem, each MU competes to schedule local as well as remote task computations\nacross the decision epochs, aiming to maximize the expected long-term\ncomputation performance. The non-cooperative interactions among the MUs are\nmodeled as a stochastic game, in which the decision makings of a MU depend on\nthe global state statistics and the task scheduling policies of all MUs are\ncoupled. To approximate the Nash equilibrium solutions, we propose a proactive\nscheme based on the long short-term memory and deep reinforcement learning\n(DRL) techniques. A digital twin of the MEC system is established to train the\nproactive DRL scheme offline. Using the proposed scheme, each MU makes task\nscheduling decisions only with its own information. Numerical experiments show\na significant performance gain from the scheme in terms of average utility per\nMU across the decision epochs.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2019 08:54:00 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Chen", "Xianfu", ""], ["Chen", "Tao", ""], ["Zhao", "Zhifeng", ""], ["Zhang", "Honggang", ""], ["Bennis", "Mehdi", ""], ["Ji", "Yusheng", ""]]}, {"id": "1911.07723", "submitter": "Kav\\'e Salamatian", "authors": "Loqman Salamatian, Frederick Douzet, Kevin Limonier, Kav\\'e Salamatian", "title": "The geopolitics behind the routes data travels: a case study of Iran", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The global expansion of the Internet has brought many challenges to\ngeopolitics. Cyberspace is a space of strategic priority for many states.\nUnderstanding and representing its geography remains an ongoing challenge.\nNevertheless, we need to comprehend Cyberspace as a space organized by humans\nto analyse the strategies of the actors. This geography requires a\nmultidisciplinary dialogue associating geopolitics, computer science and\nmathematics. Cyberspace is represented as three superposed and interacting\nlayers: the physical, logical, and informational layers. This paper focuses on\nthe logical layer through an analysis of the structure of connectivity and the\nBorder Gateway Protocol (BGP). This protocol determines the routes taken by the\ndata. It has been leveraged by countries to control the flow of information,\nand to block the access to contents (going up to full disruption of the\ninternet) or for active strategic purposes such as hijacking traffic or\nattacking infrastructures. Several countries have opted for a BGP strategy. The\ngoal of this study is to characterize these strategies, to link them to current\narchitectures and to understand their resilience in times of crisis. Our\nhypothesis is that there are connections between the network architecture\nshaped through BGP, and strategy of stakeholders at a national level. We chose\nto focus on the case of Iran because, Iran presents an interesting BGP\narchitecture and holds a central position in the connectivity of the Middle\nEast. Moreover, Iran is at the center of several ongoing geopolitical rifts.\nOur observations make it possible to infer three ways in which Iran could have\nused BGP to achieve its strategic goals: the pursuit of a self-sustaining\nnational Internet with controlled borders; the will to set up an Iranian\nIntranet to facilitate censorship; and the leverage of connectivity as a tool\nof regional influence.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 15:47:52 GMT"}, {"version": "v2", "created": "Tue, 19 Nov 2019 08:26:51 GMT"}], "update_date": "2019-11-20", "authors_parsed": [["Salamatian", "Loqman", ""], ["Douzet", "Frederick", ""], ["Limonier", "Kevin", ""], ["Salamatian", "Kavé", ""]]}, {"id": "1911.07738", "submitter": "Steven Van Rossem", "authors": "Steven Van Rossem, Wouter Tavernier, Didier Colle, Mario Pickavet,\n  Piet Demeester", "title": "Profile-based Resource Allocation for Virtualized Network Functions", "comments": "accepted in IEEE TNSM journal", "journal-ref": "IEEE Transactions on Network and Service Management, 2019, Early\n  Access", "doi": "10.1109/TNSM.2019.2943779", "report-no": null, "categories": "cs.NI cs.LG cs.PF stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The virtualization of compute and network resources enables an unseen\nflexibility for deploying network services. A wide spectrum of emerging\ntechnologies allows an ever-growing range of orchestration possibilities in\ncloud-based environments. But in this context it remains challenging to rhyme\ndynamic cloud configurations with deterministic performance. The service\noperator must somehow map the performance specification in the Service Level\nAgreement (SLA) to an adequate resource allocation in the virtualized\ninfrastructure. We propose the use of a VNF profile to alleviate this process.\nThis is illustrated by profiling the performance of four example network\nfunctions (a virtual router, switch, firewall and cache server) under varying\nworkloads and resource configurations. We then compare several methods to\nderive a model from the profiled datasets. We select the most accurate method\nto further train a model which predicts the services' performance, in function\nof incoming workload and allocated resources. Our presented method can offer\nthe service operator a recommended resource allocation for the targeted\nservice, in function of the targeted performance and maximum workload specified\nin the SLA. This helps to deploy the softwarized service with an optimal amount\nof resources to meet the SLA requirements, thereby avoiding unnecessary scaling\nsteps.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 16:21:41 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Van Rossem", "Steven", ""], ["Tavernier", "Wouter", ""], ["Colle", "Didier", ""], ["Pickavet", "Mario", ""], ["Demeester", "Piet", ""]]}, {"id": "1911.07764", "submitter": "Tauseef Jamal Dr.", "authors": "Muhammad Asam, Zeeshan Haider, Tauseef Jamal, Kashif Ghuman and Aleena\n  Ajaz", "title": "Novel Relay Selection Protocol for Cooperative Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": "PIEAS-11-2019", "categories": "cs.NI", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Extensive research has been done to achieve better throughput and reliability\nin wireless networks, with focus on multiple-input multiple-output systems.\nRecently, cooperative networking techniques have been investigated to increase\nthe performance of low-cost wireless systems by using the diversity created by\ndifferent single antenna devices. However, cooperative networking requires a\nmedium access control layer able to handle source-relay-destination\ncommunications. Wireless cooperative relaying poses several challenges, being\nthe most important one related to the relay selection mechanism, especially in\nthe presence of mobile nodes. This position paper aims to describe our findings\ntowards development of an efficient relay selection algorithm.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2019 08:04:54 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Asam", "Muhammad", ""], ["Haider", "Zeeshan", ""], ["Jamal", "Tauseef", ""], ["Ghuman", "Kashif", ""], ["Ajaz", "Aleena", ""]]}, {"id": "1911.07814", "submitter": "Mahdieh Zabihimayvan", "authors": "Mahdieh Zabihimayvan and Derek Doran", "title": "A First Look at References from the Dark to Surface Web World", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tor is one of the most well-known networks that protects the identity of both\ncontent providers and their clients against any tracking or tracing on the\nInternet. So far, most research attention has been focused on investigating the\nsecurity and privacy concerns of Tor and characterizing the topic or hyperlink\nstructure of its hidden services. However, there is still lack of knowledge\nabout the information leakage attributed to the linking from Tor hidden\nservices to the surface Web. This work addresses this gap by presenting a broad\nevaluation of the network of referencing from Tor to surface Web and\ninvestigates to what extent Tor hidden services are vulnerable against this\ntype of information leakage. The analyses also consider how linking to surface\nwebsites can change the overall hyperlink structure of Tor hidden services.\nThey also provide reports regarding the type of information and services\nprovided by Tor domains. Results recover the dark-to-surface network as a\nsingle massive connected component where over 90% of Tor hidden services have\nat least one link to the surface world despite their interest in being isolated\nfrom surface Web tracking. We identify that Tor directories have closest\nproximity to all other Web resources and significantly contribute to both\ncommunication and information dissemination through the network which\nemphasizes on the main application of Tor as information provider to the\npublic. Our study is the product of crawling near 2 million pages from 23,145\nonion seed addresses, over a three-month period.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 18:24:59 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Zabihimayvan", "Mahdieh", ""], ["Doran", "Derek", ""]]}, {"id": "1911.07944", "submitter": "Zhengfang Duanmu", "authors": "Zhengfang Duanmu, Wentao Liu, Diqi Chen, Zhuoran Li, Zhou Wang, Yizhou\n  Wang, Wen Gao", "title": "A Knowledge-Driven Quality-of-Experience Model for Adaptive Streaming\n  Videos", "comments": "12 pages, 5 figures, Journal paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The fundamental conflict between the enormous space of adaptive streaming\nvideos and the limited capacity for subjective experiment casts significant\nchallenges to objective Quality-of-Experience (QoE) prediction. Existing\nobjective QoE models exhibit complex functional form, failing to generalize\nwell in diverse streaming environments. In this study, we propose an objective\nQoE model namely knowledge-driven streaming quality index (KSQI) to integrate\nprior knowledge on the human visual system and human annotated data in a\nprincipled way. By analyzing the subjective characteristics towards streaming\nvideos from a corpus of subjective studies, we show that a family of QoE\nfunctions lies in a convex set. Using a variant of projected gradient descent,\nwe optimize the objective QoE model over a database of training videos. The\nproposed KSQI demonstrates strong generalizability to diverse streaming\nenvironments, evident by state-of-the-art performance on four publicly\navailable benchmark datasets.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 20:45:42 GMT"}], "update_date": "2019-11-20", "authors_parsed": [["Duanmu", "Zhengfang", ""], ["Liu", "Wentao", ""], ["Chen", "Diqi", ""], ["Li", "Zhuoran", ""], ["Wang", "Zhou", ""], ["Wang", "Yizhou", ""], ["Gao", "Wen", ""]]}, {"id": "1911.08045", "submitter": "Yulun Xu", "authors": "Yulun Xu, Qi Bao, Zhongzhi Zhang", "title": "The k-Power Domination Number in Some Self-Similar Graphs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.DM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The $k$-power domination problem is a problem in graph theory, which has\napplications in many areas. However, it is hard to calculate the exact\n$k$-power domination number since determining k-power domination number of a\ngeneric graph is a NP-complete problem. We determine the exact $k$-power\ndomination number in two graphs which have the same number of vertices and\nedges: pseudofractal scale-free web and Sierpi\\'nski gasket. The $k$-power\ndomination number becomes 1 for $k\\ge2$ in the Sierpi\\'nski gasket, while the\n$k$-power domination number increases at an exponential rate with regard to the\nnumber of vertices in the pseudofractal scale-free web. The scale-free property\nmay account for the difference in the behavior of two graphs.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 02:06:45 GMT"}], "update_date": "2019-11-20", "authors_parsed": [["Xu", "Yulun", ""], ["Bao", "Qi", ""], ["Zhang", "Zhongzhi", ""]]}, {"id": "1911.08078", "submitter": "Yu-Pin Hsu", "authors": "Yu-Pin Hsu", "title": "Delay-Aware Wireless Network Coding in Adversarial Traffic", "comments": "39 pages (single column), technical report for the IEEE T-COM paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze a wireless line network employing wireless network coding. The two\nend nodes exchange their packets through relays. While a packet at a relay\nmight not find its coding pair upon arrival, a transmission cost can be reduced\nby waiting for coding with a packet from the other side. To strike a balance\nbetween the reduced transmission cost and the cost incurred by the delay, a\nscheduling algorithm determining either to transmit an uncoded packet or to\nwait for coding is needed. Because of highly uncertain traffic injections,\nscheduling with no assumption of the traffic is critical. This paper proposes a\nrandomized online scheduling algorithm for a relay in arbitrary traffic, which\ncan be non-stationary or adversarial. The expected total cost (including a\ntransmission cost and a delay cost) incurred by the proposed algorithm is at\nmost e/(e-1) ~ 1.58 times the minimum achievable total cost. In particular, the\nproposed algorithm is universal in the sense that the ratio is independent of\nthe traffic. With the universality, the proposed algorithm can be implemented\nat each relay distributedly (in a multi-relay network) with the same ratio.\nMoreover, the proposed algorithm turns out to generalize the classic ski-rental\nonline algorithm.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 03:33:31 GMT"}, {"version": "v2", "created": "Wed, 20 Nov 2019 06:57:31 GMT"}, {"version": "v3", "created": "Wed, 10 Jun 2020 03:23:11 GMT"}, {"version": "v4", "created": "Sun, 14 Jun 2020 06:52:07 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["Hsu", "Yu-Pin", ""]]}, {"id": "1911.08161", "submitter": "Mohamed Salah Abdalzaher", "authors": "Mohamed S. Abdalzaher and Osamu Muta", "title": "A Game-Theoretic Approach for Enhancing Security and Data\n  Trustworthiness in IoT Applications", "comments": "Manuscript is 18 pages. Number of figures is 11. Number of tables is\n  4. Number of references is 30", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SP cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless sensor networks (WSNs)-based internet of things (IoT) are among the\nfast booming technologies that drastically contribute to different systems\nmanagement and resilience data accessibility. Designing a robust IoT network\nimposes some challenges such as data trustworthiness (DT) and power management.\nThis paper presents a repeated game model to enhance clustered WSNs-based IoT\nsecurity and DT against the selective forwarding (SF) attack. Besides, the\nmodel is capable of detecting the hardware (HW) failure of the cluster members\n(CMs) and conserve the power consumption due to packet retransmission. The\nmodel relies on TDMA protocol to facilitate the detection process and to avoid\ncollision between the delivered packets at the cluster head (CH). The proposed\nmodel aims to keep packets transmitting, isotropic or non-isotropic\ntransmission, from the CMs to the CH for maximizing the DT and aims to\ndistinguish between the malicious CM and the one suffering from HW failure.\nAccordingly, it can manage the consequently lost power due to the malicious\nattack effect or HW malfunction. Simulation results indicate the proposed\nmechanism improved performance with TDMA over six different environments\nagainst the SF attack that achieves the Pareto optimal DT as compared to a\nnon-cooperative defense mechanism.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 08:56:13 GMT"}], "update_date": "2019-11-20", "authors_parsed": [["Abdalzaher", "Mohamed S.", ""], ["Muta", "Osamu", ""]]}, {"id": "1911.08255", "submitter": "Yiping Zuo", "authors": "Yiping Zuo, Shi Jin, Shengli Zhang", "title": "Computation Offloading in the Untrusted MEC-aided Mobile Blockchain IoT\n  System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deploying mobile edge computing (MEC) server in the mobile blockchain-enabled\nInternet of things (IoT) system is a promising approach to improve the system\nperformance, however, it imposes a significant challenge on the trust of MEC\nserver. To address this problem, we first propose an untrusted MEC proof of\nwork scheme in mobile blockchain network where plenty of nonce hash computing\ndemands can be offloaded to MEC server. Then, we design a nonce ordering\nalgorithm for this scheme to provide fairer computing resource allocation for\nall mobile IoT devices/users. Specifically, we formulate the user's nonce\nselection strategy as a non-cooperative game, where the utilities of individual\nuser are maximized in the untrusted MEC-aided mobile blockchain network. We\nalso prove the existence of Nash equilibrium and analyze that the cooperation\nbehavior is unsuitable for the blockchain-enabled IoT devices by using the\nrepeated game. Finally, we design the blockchain's difficulty adjustment\nmechanism to ensure stable block times during a long period of time.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 13:32:52 GMT"}], "update_date": "2019-11-20", "authors_parsed": [["Zuo", "Yiping", ""], ["Jin", "Shi", ""], ["Zhang", "Shengli", ""]]}, {"id": "1911.08449", "submitter": "Majid Khabbazian", "authors": "Majid Khabbazian and Afshin Arefi", "title": "Packet Loss Recovery in Broadcast for Real-Time Applications in Dense\n  Wireless Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Packet loss recovery in wireless broadcast is challenging, particularly for\nreal-time applications which have strict and short delivery deadline. To\nrecover the maximum number of lost packets within a short time, existing packet\nrecovery solutions often rely on instantly decodable network coding (IDNC).\nSome of these solutions can recover nearly the maximum number of lost packets\npossible at the cost of collecting feedback from all (or a large percentage of)\nusers. This is impractical in dense networks. In addition, their runtime grows\nwith the number of users, which is not desirable due to the urgent delivery\ndeadline of real-time applications. In this work, we introduce RIDNC, a random\nencoding approach to IDNC. We propose RACE, a light RIDNC encoder that can\nrecover nearly as many lost packets as the optimal RIDNC encoder. We compare\nRACE with the CrowdWiFi encoder, a high performing packet loss recovery\nsolution used in CrowdWiFi, a commercial system for broadcasting live video in\ndense networks. We show that RACE is up to two orders of magnitude faster than\nthe CrowdWiFi encoder, and recovers more lost packets in practice, where there\nis not enough time to collect feedback from many users.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 18:16:39 GMT"}], "update_date": "2019-11-20", "authors_parsed": [["Khabbazian", "Majid", ""], ["Arefi", "Afshin", ""]]}, {"id": "1911.08513", "submitter": "Jun Zhao", "authors": "Jun Zhao", "title": "Topological properties of secure wireless sensor networks under the\n  q-composite key predistribution scheme with unreliable links", "comments": "IEEE/ACM Transactions on Networking. arXiv admin note: text overlap\n  with arXiv:1408.5082", "journal-ref": null, "doi": "10.1109/TNET.2017.2653109", "report-no": null, "categories": "cs.NI cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security is an important issue in wireless sensor networks (WSNs), which are\noften deployed in hostile environments. The q-composite key predistribution\nscheme has been recognized as a suitable approach to secure WSNs. Although the\nq-composite scheme has received much attention in the literature, there is\nstill a lack of rigorous analysis for secure WSNs operating under the\nq-composite scheme in consideration of the unreliability of links. One main\ndifficulty lies in analyzing the network topology, whose links are not\nindependent. Wireless links can be unreliable in practice due to the presence\nof physical barriers between sensors or because of harsh environmental\nconditions severely impairing communications. In this paper, we resolve the\ndifficult challenge and investigate topological properties related to node\ndegree in WSNs operating under the q-composite scheme with unreliable\ncommunication links modeled as independent ON/OFF channels. Specifically, we\nderive the asymptotically exact probability for the property of minimum degree\nbeing at least k, present the asymptotic probability distribution for the\nminimum degree, and demonstrate that the number of nodes with a fixed degree is\nin distribution asymptotically equivalent to a Poisson random variable. We\nfurther use the theoretical results to provide useful design guidelines for\nsecure WSNs. Experimental results also confirm the validity of our analytical\nfindings.\n", "versions": [{"version": "v1", "created": "Sat, 2 Nov 2019 15:03:28 GMT"}], "update_date": "2019-11-21", "authors_parsed": [["Zhao", "Jun", ""]]}, {"id": "1911.08674", "submitter": "Oussama Abderrahmane Dambri Mr", "authors": "Oussama Abderrahmane Dambri and Soumaya Cherkaoui", "title": "Toward a Wired Ad Hoc Nanonetwork", "comments": "submitted to IEEE International Conference on Communications 2020\n  (ICC 2020)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nanomachines promise to enable new medical applications, including drug\ndelivery and real time chemical reactions' detection inside the human body.\nSuch complex tasks need cooperation between nanomachines using a communication\nnetwork. Wireless Ad hoc networks, using molecular or electromagnetic-based\ncommunication have been proposed in the literature to create flexible\nnanonetworks between nanomachines. In this paper, we propose a Wired Ad hoc\nNanoNETwork (WANNET) model design using actin-based nano-communication. In the\nproposed model, actin filaments self-assembly and disassembly is used to create\nflexible nanowires between nanomachines, and electrons are used as carriers of\ninformation. We give a general overview of the application layer, Medium Access\nControl (MAC) layer and a physical layer of the model. We also detail the\nanalytical model of the physical layer using actin nanowire equivalent\ncircuits, and we present an estimation of the circuit component's values.\nNumerical results of the derived model are provided in terms of attenuation,\nphase and delay as a function of the frequency and distances between\nnanomachines. The maximum throughput of the actin-based nanowire is also\nprovided, and a comparison between the maximum throughput of the proposed\nWANNET, vs other proposed approaches is presented. The obtained results prove\nthat the proposed wired ad hoc nanonetwork can give a very high achievable\nthroughput with a smaller delay compared to other proposed wireless molecular\ncommunication networks.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 02:58:55 GMT"}, {"version": "v2", "created": "Fri, 22 Nov 2019 19:30:52 GMT"}], "update_date": "2019-11-26", "authors_parsed": [["Dambri", "Oussama Abderrahmane", ""], ["Cherkaoui", "Soumaya", ""]]}, {"id": "1911.08802", "submitter": "Gangxiang Shen", "authors": "Shifeng Ding, Kevin X. Pan, Sanjay K. Bose, Qiong Zhang, and Gangxiang\n  Shen", "title": "Blockchain-Assisted Spectrum Trading between Elastic Virtual Optical\n  Networks", "comments": "7 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In communication networks, network virtualization can usually provide better\ncapacity utilization and quality of service (QoS) than what can be achieved\notherwise. However, conventional resource allocation for virtualized networks\nwould still follow a fixed pattern based on the predicted capacity needs of the\nusers, even though, in reality, the actual traffic demand of a user will always\ntend to fluctuate. The mismatch between the fixed capacity allocation and the\nactual fluctuating traffic would lead to degradation of provisioned network\nservices and inefficiency in the assigned network capacity. To overcome this,\nwe propose a new spectrum trading (ST) scheme between virtual optical networks\n(VONs) in the context of an elastic optical network (EON). The key idea here is\nto allow different VONs to trade their spectrum resources according to the\nactual capacity they need at different time instants. A VON with unused spectra\ncan then trade away its unused spectra to other VONs that are short of spectrum\nresources at that time. In exchange, it is rewarded with a certain amount of\ncredit for its contribution to the ST community, which it can then use later to\nget extra bandwidth, if needed. The trust-worthiness of the trading records\nbetween the VONs is ensured in a distributed fashion through a\nblockchain-assisted account book that is updated whenever a new trade occurs.\nFor this, we develop a software-defined control plane to enable spectrum\ntrading in an EON. The performance of the ST scheme is evaluated and compared\nwith a scenario without such trading. Our results show that the proposed ST\nscheme is effective in improving the QoS of each VON and significantly improves\nthe overall network capacity utilization.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 10:22:37 GMT"}], "update_date": "2019-11-21", "authors_parsed": [["Ding", "Shifeng", ""], ["Pan", "Kevin X.", ""], ["Bose", "Sanjay K.", ""], ["Zhang", "Qiong", ""], ["Shen", "Gangxiang", ""]]}, {"id": "1911.08864", "submitter": "Jaafar Elmirghani", "authors": "Hatem A. Alharbi, Taisir E.H. Elgorashi and Jaafar M.H. Elmirghani", "title": "Impact of the Net Neutrality Repeal on Communication Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Network neutrality (net neutrality) is the principle of treating equally all\nInternet traffic regardless of its source, destination, content, application or\nother related distinguishing metrics. Under net neutrality, ISPs are compelled\nto charge all content providers (CPs) the same per Gbps rate despite the\ngrowing profit achieved by CPs. In this paper, we study the impact of the\nrepeal of net neutrality on communication networks by developing a\ntechno-economic Mixed Integer Linear Programming (MILP) model to maximize the\npotential profit ISPs can achieve by offering their services to CPs. We focus\non video delivery as video traffic accounts for 78% of the cloud traffic. We\nconsider an ISP that offers CPs different classes of service representing\ntypical video content qualities including standard definition (SD), high\ndefinition (HD) and ultra-high definition (UHD) video. The MILP model maximizes\nthe ISP profit by optimizing the prices of the different classes according to\nthe users demand sensitivity to the change in price, referred to as Price\nElasticity of Demand (PED). We analyze how PED impacts the profit in different\nCP delivery scenarios in cloud-fog architectures. The results show that the\nrepeal of net neutrality can potentially increase ISPs profit by a factor of 8\nwith a pricing scheme that discriminates against data intensive content. Also,\nthe repeal of net neutrality positively impacts the network energy efficiency\nby reducing the core network power consumption by 55% as a result of\nsuppressing data intensive content compared to the net neutrality scenario.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 12:48:59 GMT"}], "update_date": "2019-11-21", "authors_parsed": [["Alharbi", "Hatem A.", ""], ["Elgorashi", "Taisir E. H.", ""], ["Elmirghani", "Jaafar M. H.", ""]]}, {"id": "1911.09034", "submitter": "Amirul Islam", "authors": "Amirul Islam, Leila Musavian, and Nikolaos Thomos", "title": "Rate Maximization in Vehicular uRLLC with Optical Camera Communications", "comments": "30 Pages, 13 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optical camera communication (OCC) has emerged as a key enabling technology\nfor the seamless operation of future autonomous vehicles. By leveraging the\nsupreme performance of OCC, we can meet the stringent requirements of\nultra-reliable and low-latency communication (uRLLC) in vehicular OCC. In this\npaper, we introduce a rate optimization approach in vehicular OCC through\noptimal power allocation while respecting uRLLC requirements. We first\nformulate a discrete-rate optimization problem as a mixed-integer programming\n(MIP) subject to average transmit power and uRLLC constraints for a given set\nof modulation schemes. To reduce the complexity in solving the MIP problem, we\nconvert the discrete-rate problem into a continuous-rate optimization scheme.\nThen, we present an algorithm based on Lagrangian relaxation and Bisection\nmethod to solve the optimization problem. Considering the proposed algorithm,\nwe drive the rate optimization and power allocation scheme for both\ndiscrete-rate and continuous-rate optimization schemes while satisfying uRLLC\nconstraints. We first analyze the performance of the proposed system model\nthrough simulations. We then investigate the impact of proposed power\nallocation and rate optimization schemes on average rate and latency for\ndifferent target bit error rates. The results show that increasing the transmit\npower allocation improves the average rate and latency performance.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 17:04:23 GMT"}, {"version": "v2", "created": "Tue, 22 Sep 2020 08:30:49 GMT"}], "update_date": "2020-09-23", "authors_parsed": [["Islam", "Amirul", ""], ["Musavian", "Leila", ""], ["Thomos", "Nikolaos", ""]]}, {"id": "1911.09292", "submitter": "Adam Dziedzic", "authors": "Vanlin Sathya, Adam Dziedzic, Monisha Ghosh, Sanjay Krishnan", "title": "Machine Learning based detection of multiple Wi-Fi BSSs for LTE-U CSAT", "comments": "Published at International Conference on Computing, Networking and\n  Communications (ICNC 2020)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  According to the LTE-U Forum specification, a LTE-U base-station (BS) reduces\nits duty cycle from 50% to 33% when it senses an increase in the number of\nco-channel Wi-Fi basic service sets (BSSs) from one to two. The detection of\nthe number of Wi-Fi BSSs that are operating on the channel in real-time,\nwithout decoding the Wi-Fi packets, still remains a challenge. In this paper,\nwe present a novel machine learning (ML) approach that solves the problem by\nusing energy values observed during LTE-U OFF duration. Observing the energy\nvalues (at LTE-U BS OFF time) is a much simpler operation than decoding the\nentire Wi-Fi packets. In this work, we implement and validate the proposed ML\nbased approach in real-time experiments, and demonstrate that there are two\ndistinct patterns between one and two Wi-Fi APs. This approach delivers an\naccuracy close to 100% compared to auto-correlation (AC) and energy detection\n(ED) approaches.\n", "versions": [{"version": "v1", "created": "Thu, 21 Nov 2019 05:14:05 GMT"}], "update_date": "2019-11-22", "authors_parsed": [["Sathya", "Vanlin", ""], ["Dziedzic", "Adam", ""], ["Ghosh", "Monisha", ""], ["Krishnan", "Sanjay", ""]]}, {"id": "1911.09404", "submitter": "Martin Barrere", "authors": "Mart\\'in Barr\\`ere, Chris Hankin, Demetrios G. Eliades, Nicolas\n  Nicolau, Thomas Parisini", "title": "Assessing Cyber-Physical Security in Industrial Control Systems", "comments": "10 pages, 10 figures. Keywords: security metrics, cyber-physical\n  security, AND-OR graphs, hypergraphs, MAX-SAT resolution, ICS, CPS", "journal-ref": "6th International Symposium for ICS & SCADA Cyber Security\n  Research 2019 (ICS-CSR), pp. 49-58 (2019)", "doi": "10.14236/ewic/icscsr19.7", "report-no": null, "categories": "cs.CR cs.NI cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the last years, Industrial Control Systems (ICS) have become\nincreasingly exposed to a wide range of cyber-physical threats. Efficient\nmodels and techniques able to capture their complex structure and identify\ncritical cyber-physical components are therefore essential. AND/OR graphs have\nproven very useful in this context as they are able to semantically grasp\nintricate logical interdependencies among ICS components. However, identifying\ncritical nodes in AND/OR graphs is an NP-complete problem. In addition, ICS\nsettings normally involve various cyber and physical security measures that\nsimultaneously protect multiple ICS components in overlapping manners, which\nmakes this problem even harder. In this paper, we present an extended security\nmetric based on AND/OR hypergraphs which efficiently identifies the set of\ncritical ICS components and security measures that should be compromised, with\nminimum cost (effort) for an attacker, in order to disrupt the operation of\nvital ICS assets. Our approach relies on MAX-SAT techniques, which we have\nincorporated in META4ICS, a Java-based security metric analyser for ICS. We\nalso provide a thorough performance evaluation that shows the feasibility of\nour method. Finally, we illustrate our methodology through a case study in\nwhich we analyse the security posture of a realistic Water Transport Network\n(WTN).\n", "versions": [{"version": "v1", "created": "Thu, 21 Nov 2019 11:02:48 GMT"}], "update_date": "2019-11-22", "authors_parsed": [["Barrère", "Martín", ""], ["Hankin", "Chris", ""], ["Eliades", "Demetrios G.", ""], ["Nicolau", "Nicolas", ""], ["Parisini", "Thomas", ""]]}, {"id": "1911.09518", "submitter": "Arjun Krishna Mr", "authors": "Arjun Krishna and A S Akil Arif Ibrahim", "title": "Video Segment Copy Detection Using Memory Constrained Hierarchical\n  Batch-Normalized LSTM Autoencoder", "comments": "Undergraduate Thesis", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CV cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this report, we introduce a video hashing method for scalable video\nsegment copy detection. The objective of video segment copy detection is to\nfind the video (s) present in a large database, one of whose segments (cropped\nin time) is a (transformed) copy of the given query video. This transformation\nmay be temporal (for example frame dropping, change in frame rate) or spatial\n(brightness and contrast change, addition of noise etc.) in nature although the\nprimary focus of this report is detecting temporal attacks. The video hashing\nmethod proposed by us uses a deep learning neural network to learn variable\nlength binary hash codes for the entire video considering both temporal and\nspatial features into account. This is in contrast to most existing video\nhashing methods, as they use conventional image hashing techniques to obtain\nhash codes for a video after extracting features for every frame or certain key\nframes, in which case the temporal information present in the video is not\nexploited. Our hashing method is specifically resilient to time cropping making\nit extremely useful in video segment copy detection. Experimental results\nobtained on the large augmented dataset consisting of around 25,000 videos with\nsegment copies demonstrate the efficacy of our proposed video hashing method.\n", "versions": [{"version": "v1", "created": "Wed, 20 Nov 2019 15:00:02 GMT"}], "update_date": "2019-11-22", "authors_parsed": [["Krishna", "Arjun", ""], ["Ibrahim", "A S Akil Arif", ""]]}, {"id": "1911.10007", "submitter": "Nurul Huda Mahmood", "authors": "Nurul Huda Mahmood and Hirley Alves", "title": "Dynamic Multi-Connectivity Activation for Ultra-Reliable and Low-Latency\n  Communication", "comments": "Published in Proceedings of ISWCS 2019", "journal-ref": "2019 16th International Symposium on Wireless Communication\n  Systems (ISWCS), Oulu, Finland, 2019, pp. 112-116", "doi": "10.1109/ISWCS.2019.8877325", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Multi-connectivity (MC) with packet duplication, where the same data packet\nis duplicated and transmitted from multiple transmitters, is proposed in 5G New\nRadio as a reliability enhancement feature. However, it is found to be resource\ninefficient, since radio resources from more than one transmitters are required\nto serve a single user. Improving the performance enhancement vs. resource\nutilization tradeoff with MC is therefore a key design challenge. This work\nproposes a heuristic resource efficient latency-aware dynamic MC algorithm\nwhich activates MC selectively such that its benefits are harnessed for\ncritical users, while minimizing the corresponding resource usage. Numerical\nresults indicate that the proposed algorithm can deliver the outage performance\ngains of legacy MC schemes while requiring up to 45% less resources.\n", "versions": [{"version": "v1", "created": "Fri, 22 Nov 2019 12:51:47 GMT"}], "update_date": "2019-11-25", "authors_parsed": [["Mahmood", "Nurul Huda", ""], ["Alves", "Hirley", ""]]}, {"id": "1911.10472", "submitter": "Xinming Wang", "authors": "Xinming Wang, Jiahao He, Zhijian Xie, Gansen Zhao, and Shing-Chi\n  Cheung", "title": "ContractGuard: Defend Ethereum Smart Contracts with Embedded Intrusion\n  Detection", "comments": "14 pages", "journal-ref": "IEEE transactions on service computing 2019", "doi": "10.1109/TSC.2019.2949561", "report-no": null, "categories": "cs.SE cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ethereum smart contracts are programs that can be collectively executed by a\nnetwork of mutually untrusted nodes. Smart contracts handle and transfer assets\nof values, offering strong incentives for malicious attacks. Intrusion attacks\nare a popular type of malicious attacks. In this paper, we propose\nContractGuard, the first intrusion detection system (IDS) to defend Ethereum\nsmart contracts against such attacks. Like IDSs for conventional programs,\nContractGuard detects intrusion attempts as abnormal control flow. However,\nexisting IDS techniques/tools are inapplicable to Ethereum smart contracts due\nto Ethereum's decentralized nature and its highly restrictive execution\nenvironment. To address these issues, we design ContractGuard by embedding it\nin the contracts to profile context-tagged acyclic paths, and optimizing it\nunder the Ethereum gas-oriented performance model. The main goal is to minimize\nthe overheads, to which the users will be extremely sensitive since the cost\nneeds to be paid upfront in digital concurrency. Empirical investigation using\nreal-life contracts deployed in the Ethereum mainnet shows that on average,\nContractGuard only adds to 36.14% of the deployment overhead and 28.27% of the\nruntime overhead. Furthermore, we conducted controlled experiments and show\nthat ContractGuard successfully guard against attacks on all real-world\nvulnerabilities and 83% of the seeded vulnerabilities.\n", "versions": [{"version": "v1", "created": "Sun, 24 Nov 2019 08:41:51 GMT"}], "update_date": "2019-11-28", "authors_parsed": [["Wang", "Xinming", ""], ["He", "Jiahao", ""], ["Xie", "Zhijian", ""], ["Zhao", "Gansen", ""], ["Cheung", "Shing-Chi", ""]]}, {"id": "1911.10522", "submitter": "Fabien Geyer", "authors": "Fabien Geyer and Steffen Bondorf", "title": "On the Robustness of Deep Learning-predicted Contention Models for\n  Network Calculus", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The network calculus (NC) analysis takes a simple model consisting of a\nnetwork of schedulers and data flows crossing them. A number of analysis\n\"building blocks\" can then be applied to capture the model without imposing\npessimistic assumptions like self-contention on tandems of servers. Yet, adding\npessimism cannot always be avoided. To compute the best bound on a single\nflow's end-to-end delay thus boils down to finding the least pessimistic\ncontention models for all tandems of schedulers in the network - and an\nexhaustive search can easily become a very resource intensive task. The\nliterature proposes a promising solution to this dilemma: a heuristic making\nuse of machine learning (ML) predictions inside the NC analysis.\n  While results of this work were promising in terms of delay bound quality and\ncomputational effort, there is little to no insight on when a prediction is\nmade or if the trained algorithm can achieve similarly striking results in\nnetworks vastly differing from its training data. In this paper, we address\nthese pending questions. We evaluate the influence of the training data and its\nfeatures on accuracy, impact and scalability. Additionally, we contribute an\nextension of the method by predicting the best $n$ contention model\nalternatives in order to achieve increased robustness for its application\noutside the training data. Our numerical evaluation shows that good accuracy\ncan still be achieved on large networks although we restrict the training to\nnetworks that are two orders of magnitude smaller.\n", "versions": [{"version": "v1", "created": "Sun, 24 Nov 2019 13:00:41 GMT"}, {"version": "v2", "created": "Fri, 17 Jul 2020 04:34:46 GMT"}], "update_date": "2020-07-20", "authors_parsed": [["Geyer", "Fabien", ""], ["Bondorf", "Steffen", ""]]}, {"id": "1911.10550", "submitter": "Thembelihle Dlamini", "authors": "Thembelihle Dlamini", "title": "MEC-enabled Energy Cooperation for Sustainable 5G Networks Exploiting\n  the Location Service API", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI eess.SP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The substantial growth in wireless data traffic, and the emergence of\ndelay-sensitive application/services requiring ultra-low latency, has resulted\ninto a new Mobile Network (MN) design paradigm called Multi-access Edge\nComputing (MEC). In this, the Base Stations (BSs) are empowered with computing\ncapabilities, and they are densely deployed in order to increase network\ncoverage and provide high throughput to mobile users. These developments\nrequire energy self-sustainability in order to minimize the carbon emission\ninto the atmosphere and the dependence on the power grid. As a solution to\nthis, we advocate for the integration of Energy Harvesting (EH) systems, e.g.,\nsolar panels or wind turbines (together with energy storage devices), into\nfuture BSs and edge computing systems (i.e., MEC servers). However, due to\ntraffic load and harvested energy variations within a coverage area, the stored\nenergy levels will also vary. To compensate for green energy imbalance within\nthe network, energy cooperation (transfer) can be enabled by an energy trading\napplication hosted in the MEC platform, and the energy packets traverse over\nthe Power Packet Grid (DC power lines and switches) from the source BS(s) to\nthe energy-deficient BS(s). In this paper, we jointly perform energy allocation\nand energy routing using an online algorithm based on Lyapunov\ndrift-and-penalty optimization theorem (named Lyapunov) for enabling energy\ncooperation, leveraging the MEC Location Service (LS) Application Programmable\nInterface (API). Our numerical results reveal that the Lyapunov algorithm is\nable to deliver sufficient amount of energy under normal solar irradiance\nwithout the effects of the control parameter\n", "versions": [{"version": "v1", "created": "Sun, 24 Nov 2019 15:20:32 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Dlamini", "Thembelihle", ""]]}, {"id": "1911.10671", "submitter": "Bogdan Groza", "authors": "Bogdan Groza, Lucian Popa, Pal-Stefan Murvay", "title": "CANTO -- Covert AutheNtication with Timing channels over Optimized\n  traffic flows for CAN", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Previous research works have endorsed the use of delays and clock skews for\ndetecting intrusions or fingerprinting ECUs on the CAN bus. Similar techniques\nhave been also proposed for establishing a time-covert cryptographic\nauthentication channel, in this way cleverly removing the need for\ncryptographic material inside the limited payload of CAN frames. The main\nshortcoming of such works is the limited security level that can be achieved\nunder normal CAN-bus traffic. In this work we endeavour to test the limits of\nthe achievable security level by relying on optimization algorithms for\nscheduling CAN frames. Under practical bus allocations that are based on\nreal-world scenarios, we are able to extract around 4--5 bits of authentication\ndata from each frame which leads to an efficient intrusion detection and\nauthentication mechanism. By accumulating covert channel data over several\nconsecutive frames, we can achieve higher security levels that are in line with\ncurrent security demands. To prove the correctness of our approach, we present\nexperiments on state-of-the-art automotive-grade controllers (Infineon Aurix)\nand bus measurements with the use of industry standard tools, i.e., CANoe.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 02:48:33 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Groza", "Bogdan", ""], ["Popa", "Lucian", ""], ["Murvay", "Pal-Stefan", ""]]}, {"id": "1911.10723", "submitter": "Xinyu Huang", "authors": "Xinyu Huang, Lijun He, Xin Chen, Fan Li, Guizhong Liu", "title": "A More Refined Mobile Edge Cache Replacement Scheme for Adaptive Video\n  Streaming with Mutual Cooperation in Multi-MEC Servers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.IV cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a more refined video segment based Mobile Edge\nComputing (MEC) enhanced cache update strategy, which takes into account the\nclient's playback status and transmission state, MEC cache capacity and the\npopularity of each segment, to improve the quality of experience (QoE) of\nclients and the use ratio of MEC cache. In each cache update period, the\nsegments which cannot bring significant QoE improvement will be deleted and\nmeanwhile more suitable representations of the segments will be cahed instead.\nFirst, we divide the MEC cache space into three parts based on segment\npopularity and segment importance level. In addition, the size of different\ncache parts can be transformed to each other to further exploit the MEC cache\nspace. For different parts, the corresponding deleted strategy and caching\nstrategy are formulated, where the deleted strategy combines the requested\ntimes of segment and transmission capability of clients, and the caching\nstrategy utilizes the playback state of clients to calculate the caching\npriority. Furthermore, we formulate the cache update problem to maximize the\nutility function of clients subject to the constraint of MEC cache size and\ntransmission capacity. The brand and branch method is emplyed to obatain the\noptimal solution. Simulation results show that our proposed algorithm can\nimprove system throughput and hit ratio of video segment, and at the same time\ndecrease playback frozen time and system backhaul traffic compared with other\nexisting algorithms.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 06:41:06 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Huang", "Xinyu", ""], ["He", "Lijun", ""], ["Chen", "Xin", ""], ["Li", "Fan", ""], ["Liu", "Guizhong", ""]]}, {"id": "1911.10753", "submitter": "Benjamin Sliwa", "authors": "Benjamin Sliwa and Christian Wietfeld", "title": "Data-driven Network Simulation for Performance Analysis of Anticipatory\n  Vehicular Communication Systems", "comments": null, "journal-ref": "IEEE Access (2019)", "doi": "10.1109/ACCESS.2019.2956211", "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The provision of reliable connectivity is envisioned as a key enabler for\nfuture autonomous driving. Anticipatory communication techniques have been\nproposed for proactively considering the properties of the highly dynamic radio\nchannel within the communication systems themselves. Since real world\nexperiments are highly time-consuming and lack a controllable environment,\nperformance evaluations and parameter studies for novel anticipatory vehicular\ncommunication systems are typically carried out based on network simulations.\nHowever, due to the required simplifications and the wide range of unknown\nparameters (e.g., Mobile Network Operator (MNO)-specific configurations of the\nnetwork infrastructure), the achieved results often differ significantly from\nthe behavior in real world evaluations. In this paper, we present Data-driven\nNetwork Simulation (DDNS) as a novel data-driven approach for analyzing and\noptimizing anticipatory vehicular communication systems. Different machine\nlearning models are combined for achieving a close to reality representation of\nthe analyzed system's behavior. In a proof of concept evaluation focusing on\nopportunistic vehicular data transfer, the proposed method is validated against\nfield measurements and system-level network simulation. In contrast to the\nlatter, DDNS does not only provide massively faster result generation, it also\nachieves a significantly better representation of the real world behavior due\nto implicit consideration of cross-layer dependencies by the machine learning\napproach.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 08:04:18 GMT"}, {"version": "v2", "created": "Thu, 28 Nov 2019 06:23:34 GMT"}], "update_date": "2019-12-03", "authors_parsed": [["Sliwa", "Benjamin", ""], ["Wietfeld", "Christian", ""]]}, {"id": "1911.11220", "submitter": "Luis Miguel Contreras Murillo", "authors": "L.M. Contreras, \\'O. Gonz\\'alez, V. L\\'opez, J.P.\n  Fern\\'andez-Palacios, J. Folgueira", "title": "iFUSION: Standards-based SDN Architecture for Carrier Transport Network", "comments": "IEEE Conference on Standards for Communications and Networking (CSCN)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network softwarization will permit the dynamic configuration of the transport\ninfrastructure, in order to facilitate the adaptation needed for future\nadvanced services. However, the promise of full flexibility can only be\nachieved through proper levels of abstraction and by means of normalized\ninterfaces and service and device models. This paper presents the SDN\narchitecture that is being defined by Telef\\'onica for the management and\ncontrol of its transport networks, including a variety of technologies such as\nIP, optics and microwave radio links, pursuing a standard-based approach for an\neffective and future-proof introduction of softwarized operations.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 20:34:47 GMT"}], "update_date": "2019-11-27", "authors_parsed": [["Contreras", "L. M.", ""], ["González", "Ó.", ""], ["López", "V.", ""], ["Fernández-Palacios", "J. P.", ""], ["Folgueira", "J.", ""]]}, {"id": "1911.11343", "submitter": "Alireza Shamsoshoara", "authors": "Alireza Shamsoshoara, Fatemeh Afghah, Abolfazl Razi, Sajad Mousavi,\n  Jonathan Ashdown, Kurt Turk", "title": "An Autonomous Spectrum Management Scheme for Unmanned Aerial Vehicle\n  Networks in Disaster Relief Operations", "comments": "14 pages, 14 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NI eess.SP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the problem of spectrum shortage in an unmanned aerial\nvehicle (UAV) network during critical missions such as wildfire monitoring,\nsearch and rescue, and disaster monitoring. Such applications involve a high\ndemand for high-throughput data transmissions such as real-time video-, image-,\nand voice- streaming where the assigned spectrum to the UAV network may not be\nadequate to provide the desired Quality of Service (QoS). In these scenarios,\nthe aerial network can borrow an additional spectrum from the available\nterrestrial networks in the trade of a relaying service for them. We propose a\nspectrum sharing model in which the UAVs are grouped into two classes of\nrelaying UAVs that service the spectrum owner and the sensing UAVs that perform\nthe disaster relief mission using the obtained spectrum. The operation of the\nUAV network is managed by a hierarchical mechanism in which a central\ncontroller assigns the tasks of the UAVs based on their resources and determine\ntheir operation region based on the level of priority of impacted areas and\nthen the UAVs autonomously fine-tune their position using a model-free\nreinforcement learning algorithm to maximize the individual throughput and\nprolong their lifetime. We analyze the performance and the convergence for the\nproposed method analytically and with extensive simulations in different\nscenarios.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 05:09:39 GMT"}], "update_date": "2019-11-27", "authors_parsed": [["Shamsoshoara", "Alireza", ""], ["Afghah", "Fatemeh", ""], ["Razi", "Abolfazl", ""], ["Mousavi", "Sajad", ""], ["Ashdown", "Jonathan", ""], ["Turk", "Kurt", ""]]}, {"id": "1911.11468", "submitter": "Ishfaq Hussain", "authors": "Ishfaq Hussain and Janibul Bashir", "title": "Dynamic MTU : Technique to reduce packet drops in IPv6 network resulted\n  due to smaller path mtu size", "comments": "28 pages, 11 figures. Journal of King Saud University Computer and\n  Information Sciences (2021)", "journal-ref": null, "doi": "10.1016/j.jksuci.2021.06.011", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  With an increase in the number of internet users and the need to secure\ninternet traffic, the unreliable IPv4 protocol has been replaced by a more\nsecure protocol, called IPv6 for Internet system. The IPv6 protocol does not\nallow intermediate routers to fragment the on-going IPv6 packet. Moreover, due\nto IP tunneling, some extra headers are added to the IPv6 packet, exceeding the\npacket size higher than the maximum transmission unit (MTU), resulting in\nincrease in packet drops. One probable solution is to find the MTU of every\nlink in advance using the Internet Control Message Protocol (ICMP) packets and\naccordingly fragment the packets at the source itself. However, most of the\nintermediate routers and the network firewalls do not allow ICMP packets to\ntraverse through their network, resulting in network black holes, where we\ncannot know the MTU of some links in advance. This method tries to handle the\npacket drops in IPv6 network by proposing a DMTU scheme where we dynamically\nadjust the MTU of each link depending upon the original size of the IPv6\npacket, thereby reducing the number of packet drops by a significant amount.\nUsing mathematical and graphical analysis, our scheme proves to be much more\nefficient than the state-of-the-art PMTUD scheme. In this paper the method,\nmathematical and graphical representations are focusing solely in IPv6 Internet\ncommunication.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 11:42:33 GMT"}, {"version": "v2", "created": "Tue, 4 Feb 2020 02:54:06 GMT"}, {"version": "v3", "created": "Tue, 1 Sep 2020 16:14:46 GMT"}, {"version": "v4", "created": "Mon, 16 Nov 2020 03:17:06 GMT"}], "update_date": "2021-07-07", "authors_parsed": [["Hussain", "Ishfaq", ""], ["Bashir", "Janibul", ""]]}, {"id": "1911.11490", "submitter": "Udo Schilcher", "authors": "Udo Schilcher and Siddhartha Borkotoky and Jorge F. Schmidt and\n  Christian Bettstetter", "title": "Outage Duration in Poisson Networks and its Application to Erasure Codes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive the probability distribution of the link outage duration at a\ntypical receiver in a wireless network with Poisson distributed interferers\nsending messages with slotted random access over a Rayleigh fading channel.\nThis result is used to analyze the performance of random linear network coding,\nshowing that there is an optimum code rate and that interference correlation\naffects the decoding probability and throughput.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 12:18:27 GMT"}], "update_date": "2019-11-27", "authors_parsed": [["Schilcher", "Udo", ""], ["Borkotoky", "Siddhartha", ""], ["Schmidt", "Jorge F.", ""], ["Bettstetter", "Christian", ""]]}, {"id": "1911.11552", "submitter": "Heeyoul Choi", "authors": "Hyeokmin Gwon, Chungjun Lee, Rakun Keum, Heeyoul Choi", "title": "Network Intrusion Detection based on LSTM and Feature Embedding", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NI stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Growing number of network devices and services have led to increasing demand\nfor protective measures as hackers launch attacks to paralyze or steal\ninformation from victim systems. Intrusion Detection System (IDS) is one of the\nessential elements of network perimeter security which detects the attacks by\ninspecting network traffic packets or operating system logs. While existing\nworks demonstrated effectiveness of various machine learning techniques, only\nfew of them utilized the time-series information of network traffic data. Also,\ncategorical information has not been included in neural network based\napproaches. In this paper, we propose network intrusion detection models based\non sequential information using long short-term memory (LSTM) network and\ncategorical information using the embedding technique. We have experimented the\nmodels with UNSW-NB15, which is a comprehensive network traffic dataset. The\nexperiment results confirm that the proposed method improve the performance,\nobserving binary classification accuracy of 99.72\\%.\n", "versions": [{"version": "v1", "created": "Tue, 26 Nov 2019 14:15:47 GMT"}], "update_date": "2019-11-27", "authors_parsed": [["Gwon", "Hyeokmin", ""], ["Lee", "Chungjun", ""], ["Keum", "Rakun", ""], ["Choi", "Heeyoul", ""]]}, {"id": "1911.11673", "submitter": "Aymen Hasan Rashid AlAwadi", "authors": "Aymen Hasan Alawadi, Maiass Zaher, and S\\'andor Moln\\'ar", "title": "Methods for Predicting Behavior of Elephant Flows in Data Center\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Several Traffic Engineering (TE) techniques based on SDN (Software-defined\nnetworking) proposed to resolve flow competitions for network resources.\nHowever, there is no comprehensive study on the probability distribution of\ntheir throughput. Moreover, there is no study on predicting the future of\nelephant flows. To address these issues, we propose a new stochastic\nperformance evaluation model to estimate the loss rate of two state-of-art flow\nscheduling algorithms including Equalcost multi-path routing (ECMP), Hedera\nbesides a flow congestion control algorithm which is Data Center TCP (DCTCP).\nAlthough these algorithms have theoretical and practical benefits, their\neffectiveness has not been statistically investigated and analyzed in\nconserving the elephant flows. Therefore, we conducted extensive experiments on\nthe fat-tree data center network to examine the efficiency of the algorithms\nunder different network circumstances based on Monte Carlo risk analysis. The\nresults show that Hedera is still risky to be used to handle the elephant flows\ndue to its unstable throughput achieved under stochastic network congestion. On\nthe other hand, DCTCP found suffering under high load scenarios. These outcomes\nmight apply to all data center applications, in particular, the applications\nthat demand high stability and productivity.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2019 13:00:51 GMT"}], "update_date": "2019-11-27", "authors_parsed": [["Alawadi", "Aymen Hasan", ""], ["Zaher", "Maiass", ""], ["Molnár", "Sándor", ""]]}, {"id": "1911.11966", "submitter": "Zhuo Li", "authors": "Zhuo Li, Xu Zhou, Yifang Qin", "title": "A Survey of Mobile Edge Computing in the Industrial Internet", "comments": "2019 The 7th International Conference on Information, Communication\n  and Networks", "journal-ref": null, "doi": "10.1109/ICICN.2019.8834959", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the advent of a new round of the Industrial Revolution, the Industrial\nInternet will carry the convergence of heterogeneous network and the dynamic\nreconfiguration of industrial equipment. In order to further provide higher\nperformance of network capabilities, the Industrial Internet has experienced\nunprecedented growth while facing enormous challenges from the actual needs of\nindustrial networks. The typical scenarios in industrial applications, combined\nwith the technical advantages of mobile edge computing, are described in view\nof the low latency, high bandwidth and high reliability demanded by the\nIndustrial Internet in the new era. The key technologies of mobile edge\ncomputing for the Industrial Internet have been outlined in this treatise,\nwhose feasibility and importance are demonstrated by typical industrial\napplications that have been deployed. As combined with the development trend of\nthe Industrial Internet, this paper summarizes the existing work and discusses\nthe future research direction of key technologies of mobile edge computing for\nthe Industrial Internet.\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 05:47:00 GMT"}], "update_date": "2019-11-28", "authors_parsed": [["Li", "Zhuo", ""], ["Zhou", "Xu", ""], ["Qin", "Yifang", ""]]}, {"id": "1911.12029", "submitter": "Tan Do Duy", "authors": "Tan Do-Duy and M. Angeles Vazquez-Castro", "title": "Finite-length performance comparison of network codes using random vs\n  Pascal matrices", "comments": "10 pages, 11 figures", "journal-ref": null, "doi": "10.1016/j.aeue.2019.153012", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this letter, we evaluate the finite-length performance of network coding\nwhen using either random or structured encoding matrices. First, we present our\nnovel construction of structured network codes over Fq (q = 2^m) using Pascal\nmatrices. We present their encoding, re-encoding and decoding in matrix\nnotation and derive their packet loss rate. Second, we propose a novel\nmethodology to compute the optimal finite-length coding rate for representative\nand realistic traffic applications. Finally, our method allows to compare the\nperformance of our codes with the performance of popular random codes. We show\nthat our constructions always have better throughput and minimal overhead,\nwhich is more significant for short code lengths. Further, their larger\ndecoding delay fulfils the delay constraints of realistic scenarios (e.g. 5G\nmultihop networks).\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 08:59:16 GMT"}], "update_date": "2019-11-28", "authors_parsed": [["Do-Duy", "Tan", ""], ["Vazquez-Castro", "M. Angeles", ""]]}, {"id": "1911.12079", "submitter": "Jeremy Van Den Eynde", "authors": "Jeremy Van den Eynde, Chris Blondia", "title": "Token Bucket-based Throughput Constraining in Cross-layer Schedulers", "comments": "11 pages, 10 figures. Presented at 6th International Conference on\n  Computer Science, Engineering and Information. Published in AIRCC\n  http://airccse.org/csit/V9N13.html", "journal-ref": "AIRCC Publishing Corporation, Computer Science, Engineering and\n  Information Technology (CSEIT-2019), Volume 9, Number 13, Year 2019, pp.\n  209-219. ISBN: 978-1-925953-09-1", "doi": "10.5121/csit.2019.91318", "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper we consider upper and lower constraining users' service rates\nin a slotted, cross-layer scheduler context. Such schedulers often cannot\nguarantee these bounds, despite the usefulness in adhering to Quality of\nService (QoS) requirements, aiding the admission control system or providing\ndifferent levels of service to users. We approach this problem with a\nlow-complexity algorithm that is easily integrated in any utility\nfunction-based cross-layer scheduler. The algorithm modifies the weights of the\nassociated Network Utility Maximization problem, rather than for example\napplying a token bucket to the scheduler's output or adding constraints in the\nphysical layer. We study the efficacy of the algorithm through simulations with\nvarious schedulers from literature and mixes of traffic. The metrics we\nconsider show that we can bound the average service rate within about five\nslots, for most schedulers. Schedulers whose weight is very volatile are more\ndifficult to constrain.\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 11:15:47 GMT"}], "update_date": "2019-11-28", "authors_parsed": [["Eynde", "Jeremy Van den", ""], ["Blondia", "Chris", ""]]}, {"id": "1911.12419", "submitter": "Christos Efrem", "authors": "Christos N. Efrem, Athanasios D. Panagopoulos", "title": "A Framework for Weighted-Sum Energy Efficiency Maximization in Wireless\n  Networks", "comments": "Accepted for publication in IEEE Wireless Communications Letters", "journal-ref": "IEEE Wireless Communications Letters, vol. 8, no. 1, pp. 153-156,\n  Feb. 2019", "doi": "10.1109/LWC.2018.2864644", "report-no": null, "categories": "cs.NI cs.IT eess.SP math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Weighted-sum energy efficiency (WSEE) is a key performance metric in\nheterogeneous networks, where the nodes may have different energy efficiency\n(EE) requirements. Nevertheless, WSEE maximization is a challenging problem due\nto its nonconvex sum-of-ratios form. Unlike previous work, this paper presents\na systematic approach to WSEE maximization under not only power constraints,\nbut also data rate constraints, using a general SINR expression. In particular,\nthe original problem is transformed into an equivalent form, and then a\nsequential convex optimization (SCO) algorithm is proposed. This algorithm is\ntheoretically guaranteed to converge for any initial feasible point, and, under\nsuitable constraint qualifications, achieves a Karush-Kuhn-Tucker (KKT)\nsolution. Furthermore, we provide remarkable extensions to the proposed\nmethodology, including systems with multiple resource blocks as well as a more\ngeneral power consumption model which is not necessarily a convex function of\nthe transmit powers. Finally, numerical analysis reveals that the proposed\nalgorithm exhibits fast convergence, low complexity, and robustness\n(insensitivity to initial points).\n", "versions": [{"version": "v1", "created": "Wed, 27 Nov 2019 20:50:53 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Efrem", "Christos N.", ""], ["Panagopoulos", "Athanasios D.", ""]]}, {"id": "1911.12537", "submitter": "Xintong Ling Dr.", "authors": "Xintong Ling, Yuwei Le, Jiaheng Wang, Zhi Ding, Xiqi Gao", "title": "Practical Modeling and Analysis of Blockchain Radio Access Network", "comments": "30 pages, 15 figures Submitted to IEEE Transactions on Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The continually rising demand for wireless services and applications in the\nera of Internet of things (IoT) and artificial intelligence (AI) presents a\nsignificant number of unprecedented challenges to existing network structures.\nTo meet the rapid growth need of mobile data services, blockchain radio access\nnetwork (B-RAN) has emerged as a decentralized, trustworthy radio access\nparadigm spurred by blockchain technologies. However, many characteristics of\nB-RAN remain unclear and hard to characterize. In this study, we develop an\nanalytical framework to model B-RAN and provide some basic fundamental\nanalysis. Starting from block generation, we establish a queuing model based on\na time-homogeneous Markov chain. From the queuing model, we evaluate the\nperformance of B-RAN with respect to latency and security considerations. By\nconnecting latency and security, we uncover a more comprehensive picture of the\nachievable performance of B-RAN. Further, we present experimental results via\nan innovative prototype and validate the proposed model.\n", "versions": [{"version": "v1", "created": "Thu, 28 Nov 2019 05:38:06 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Ling", "Xintong", ""], ["Le", "Yuwei", ""], ["Wang", "Jiaheng", ""], ["Ding", "Zhi", ""], ["Gao", "Xiqi", ""]]}, {"id": "1911.12697", "submitter": "Hina Tabassum Prof.", "authors": "Ata Khalili (Student Member, IEEE), Soroush Akhlaghi, Hina Tabassum\n  (Senior Member, IEEE), and Derrick Wing Kwan Ng, (Senior Member, IEEE)", "title": "Joint User Association and Resource Allocation in the Uplink of\n  Heterogeneous Networks", "comments": null, "journal-ref": null, "doi": "10.1109/LWC.2020.2970696", "report-no": null, "categories": "cs.NI eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This letter considers the problem of joint user association (UA), sub-channel\nassignment, antenna selection (AS), and power control in the uplink (UL) of a\nheterogeneous network such that the data rate of small cell users can be\nmaximized while the macro-cell users are protected by imposing a threshold on\nthe cross-tier interference. The considered problem is a non-convex mixed\ninteger non-linear programming (MINLP). To tackle the problem, we decompose the\noriginal problem into two sub-problems: (i) joint UA, sub-channel assignment,\nand AS, and (ii) power control. Then, we iteratively solve the subproblems by\napplying the tools from majorization-minimization (MM) theory and augmented\nLagrange method, respectively, and obtain locally optimal solutions for each\nsub-problem. Simulation results illustrate that our proposed scheme outperforms\nexisting schemes. Complexity analysis of the proposed algorithm is also\npresented.\n", "versions": [{"version": "v1", "created": "Thu, 28 Nov 2019 13:21:40 GMT"}], "update_date": "2020-02-04", "authors_parsed": [["Khalili", "Ata", "", "Student Member, IEEE"], ["Akhlaghi", "Soroush", "", "Senior Member, IEEE"], ["Tabassum", "Hina", "", "Senior Member, IEEE"], ["Ng", "Derrick Wing Kwan", ""]]}, {"id": "1911.13010", "submitter": "Minseok Choi Dr.", "authors": "Minseok Choi, Andreas F. Molisch and Joongheon Kim", "title": "Joint Distributed Link Scheduling and Power Allocation for Content\n  Delivery in Wireless Caching Networks", "comments": "30 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.NI cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In wireless caching networks, the design of the content delivery method must\nconsider random user requests, caching states, network topology, and\ninterference management. In this paper, we establish a general framework for\ncontent delivery in wireless caching networks without stringent assumptions\nthat restrict the network structure, delivery link, and interference model.\nBased on the framework, we propose a dynamic and distributed link scheduling\nand power allocation scheme for content delivery that is assisted by\nbelief-propagation (BP) algorithms. Considering content-requesting users and\npotential caching nodes, the scheme achieves three critical purposes of\nwireless caching networks: 1) limiting the delay of user request satisfactions,\n2) maintaining the power efficiency of caching nodes, and 3) managing\ninterference among users. In addition, we address the intrinsic problem of the\nBP algorithm in our network model, proposing a matching algorithm for\none-to-one link scheduling. Simulation results show that the proposed scheme\nprovides almost the same delay performance as the optimal scheme found through\nan exhaustive search at the expense of a little additional power consumption\nand does not require a clustering method and orthogonal resources in a\nlarge-scale D2D network.\n", "versions": [{"version": "v1", "created": "Fri, 29 Nov 2019 09:25:29 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Choi", "Minseok", ""], ["Molisch", "Andreas F.", ""], ["Kim", "Joongheon", ""]]}]