[{"id": "1410.3226", "submitter": "EPTCS", "authors": "Joaquin Garcia-Alfaro (Institut Mines-T\\'el\\'ecom, T\\'el\\'ecom\n  SudParis), G\\\"urkan G\\\"ur (Provus)", "title": "Proceedings 2014 International Workshop on Advanced Intrusion Detection\n  and Prevention", "comments": null, "journal-ref": "EPTCS 165, 2014", "doi": "10.4204/EPTCS.165", "report-no": null, "categories": "cs.CR cs.NI cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 2014 International Advanced\nIntrusion Detection and Prevention (AIDP'14) Workshop, held in Marrakesh,\nMorocco, on the 5th of June 2014, in conjunction with the 29th IFIP TC-11 SEC\n2014 International Conference. It includes a revised version of the papers\nselected for presentation at the work- shop.\n", "versions": [{"version": "v1", "created": "Mon, 13 Oct 2014 08:51:40 GMT"}], "update_date": "2014-10-14", "authors_parsed": [["Garcia-Alfaro", "Joaquin", "", "Institut Mines-Télécom, Télécom\n  SudParis"], ["Gür", "Gürkan", "", "Provus"]]}, {"id": "1410.3463", "submitter": "Lavanya Sita Tekumalla", "authors": "Lavanya Sita Tekumalla, Chiranjib Bhattacharyya", "title": "Mining Block I/O Traces for Cache Preloading with Sparse Temporal\n  Non-parametric Mixture of Multivariate Poisson", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OS cs.LG cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Existing caching strategies, in the storage domain, though well suited to\nexploit short range spatio-temporal patterns, are unable to leverage long-range\nmotifs for improving hitrates. Motivated by this, we investigate novel Bayesian\nnon-parametric modeling(BNP) techniques for count vectors, to capture long\nrange correlations for cache preloading, by mining Block I/O traces. Such\ntraces comprise of a sequence of memory accesses that can be aggregated into\nhigh-dimensional sparse correlated count vector sequences.\n  While there are several state of the art BNP algorithms for clustering and\ntheir temporal extensions for prediction, there has been no work on exploring\nthese for correlated count vectors. Our first contribution addresses this gap\nby proposing a DP based mixture model of Multivariate Poisson (DP-MMVP) and its\ntemporal extension(HMM-DP-MMVP) that captures the full covariance structure of\nmultivariate count data. However, modeling full covariance structure for count\nvectors is computationally expensive, particularly for high dimensional data.\nHence, we exploit sparsity in our count vectors, and as our main contribution,\nintroduce the Sparse DP mixture of multivariate Poisson(Sparse-DP-MMVP),\ngeneralizing our DP-MMVP mixture model, also leading to more efficient\ninference. We then discuss a temporal extension to our model for cache\npreloading.\n  We take the first step towards mining historical data, to capture long range\npatterns in storage traces for cache preloading. Experimentally, we show a\ndramatic improvement in hitrates on benchmark traces and lay the groundwork for\nfurther research in storage domain to reduce latencies using data mining\ntechniques to capture long range motifs.\n", "versions": [{"version": "v1", "created": "Mon, 13 Oct 2014 14:26:28 GMT"}], "update_date": "2014-10-15", "authors_parsed": [["Tekumalla", "Lavanya Sita", ""], ["Bhattacharyya", "Chiranjib", ""]]}, {"id": "1410.7747", "submitter": "Xinyang Ge", "authors": "Xinyang Ge, Hayawardh Vijayakumar, Trent Jaeger", "title": "Sprobes: Enforcing Kernel Code Integrity on the TrustZone Architecture", "comments": "In Proceedings of the Third Workshop on Mobile Security Technologies\n  (MoST) 2014 (http://arxiv.org/abs/1410.6674)", "journal-ref": null, "doi": null, "report-no": "MoST/2014/06", "categories": "cs.CR cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many smartphones now deploy conventional operating systems, so the rootkit\nattacks so prevalent on desktop and server systems are now a threat to\nsmartphones. While researchers have advocated using virtualization to detect\nand prevent attacks on operating systems (e.g., VM introspection and trusted\nvirtual domains), virtualization is not practical on smartphone systems due to\nthe lack of virtualization support and/or the expense of virtualization.\nCurrent smartphone processors do have hardware support for running a protected\nenvironment, such as the ARM TrustZone extensions, but such hardware does not\ncontrol the operating system operations sufficiently to enable VM\nintrospection. In particular, a conventional operating system running with\nTrustZone still retains full control of memory management, which a rootkit can\nuse to prevent traps on sensitive instructions or memory accesses necessary for\neffective introspection. In this paper, we present SPROBES, a novel primitive\nthat enables introspection of operating systems running on ARM TrustZone\nhardware. Using SPROBES, an introspection mechanism protected by TrustZone can\ninstrument individual operating system instructions of its choice, receiving an\nunforgeable trap whenever any SPROBE is executed. The key challenge in\ndesigning SPROBES is preventing the rootkit from removing them, but we identify\na set of five invariants whose enforcement is sufficient to restrict rootkits\nto execute only approved, SPROBE-injected kernel code. We implemented a\nproof-of-concept version of SPROBES for the ARM Fast Models emulator,\ndemonstrating that in Linux kernel 2.6.38, only 12 SPROBES are sufficient to\nenforce all five of these invariants. With SPROBES we show that it is possible\nto leverage the limited TrustZone extensions to limit conventional kernel\nexecution to approved code comprehensively.\n", "versions": [{"version": "v1", "created": "Tue, 28 Oct 2014 19:20:34 GMT"}], "update_date": "2014-10-29", "authors_parsed": [["Ge", "Xinyang", ""], ["Vijayakumar", "Hayawardh", ""], ["Jaeger", "Trent", ""]]}, {"id": "1410.7754", "submitter": "Daniel Defreez", "authors": "Daniel Defreez, Bhargava Shastry, Hao Chen, Jean-Pierre Seifert", "title": "A First Look at Firefox OS Security", "comments": "In Proceedings of the Third Workshop on Mobile Security Technologies\n  (MoST) 2014 (http://arxiv.org/abs/1410.6674)", "journal-ref": null, "doi": null, "report-no": "MoST/2014/10", "categories": "cs.CR cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With Firefox OS, Mozilla is making a serious push for an HTML5-based mobile\nplatform. In order to assuage security concerns over providing hardware access\nto web applications, Mozilla has introduced a number of mechanisms that make\nthe security landscape of Firefox OS distinct from both the desktop web and\nother mobile operating systems. From an application security perspective, the\ntwo most significant of these mechanisms are the the introduction of a default\nContent Security Policy and code review in the market. This paper describes how\nlightweight static analysis can augment these mechanisms to find\nvulnerabilities which have otherwise been missed. We provide examples of\nprivileged applications in the market that contain vulnerabilities that can be\nautomatically detected.\n  In addition to these findings, we show some of the challenges that occur when\ndesktop software is repurposed for a mobile operating system. In particular, we\nargue that the caching of certificate overrides across applications--a known\nproblem in Firefox OS--generates a counter-intuitive user experience that\ndetracts from the security of the system.\n", "versions": [{"version": "v1", "created": "Tue, 28 Oct 2014 19:23:26 GMT"}], "update_date": "2014-10-29", "authors_parsed": [["Defreez", "Daniel", ""], ["Shastry", "Bhargava", ""], ["Chen", "Hao", ""], ["Seifert", "Jean-Pierre", ""]]}]