[{"id": "1111.0242", "submitter": "Anita Sobe", "authors": "Anita Sobe, Wilfried Elmenreich and Laszlo B\\\"osz\\\"ormenyi", "title": "Storage Balancing in Self-organizing Multimedia Delivery Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": "TR/ITEC/01/2.13", "categories": "cs.MM cs.DC nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many of the current bio-inspired delivery networks set their focus on search,\ne.g., by using artificial ants. If the network size and, therefore, the search\nspace gets too large, the users experience high delays until the requested\ncontent can be consumed. In previous work, we proposed different replication\nstrategies to reduce the search space. In this report we further evaluate\nmeasures for storage load balancing, because peers are most likely limited in\nspace. We periodically apply clean-ups if a certain storage level is reached.\nFor our evaluations we combine the already introduced replication measures with\nleast recently used (LRU), least frequently used (LFU) and a hormone-based\nclean-up. The goal is to elaborate a combination that leads to low delays while\nthe replica utilization is high.\n", "versions": [{"version": "v1", "created": "Tue, 1 Nov 2011 16:52:10 GMT"}], "update_date": "2011-11-02", "authors_parsed": [["Sobe", "Anita", ""], ["Elmenreich", "Wilfried", ""], ["Böszörmenyi", "Laszlo", ""]]}, {"id": "1111.0948", "submitter": "Ashwin Rao", "authors": "Ashwin Rao (INRIA Sophia Antipolis / INRIA Grenoble Rh\\^one-Alpes),\n  Yeon-Sup Lim, Chadi Barakat (INRIA Sophia Antipolis / INRIA Grenoble\n  Rh\\^one-Alpes), Arnaud Legout (INRIA Sophia Antipolis / INRIA Grenoble\n  Rh\\^one-Alpes), Don Towsley, Walid Dabbous (INRIA Sophia Antipolis / INRIA\n  Grenoble Rh\\^one-Alpes)", "title": "Network Characteristics of Video Streaming Traffic", "comments": "This is the author version of the paper accepted as a full paper at\n  ACM CoNEXT 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Video streaming represents a large fraction of Internet traffic.\nSurprisingly, little is known about the network characteristics of this\ntraffic. In this paper, we study the network characteristics of the two most\npopular video streaming services, Netflix and YouTube. We show that the\nstreaming strategies vary with the type of the application (Web browser or\nnative mobile application), and the type of container (Silverlight, Flash, or\nHTML5) used for video streaming. In particular, we identify three different\nstreaming strategies that produce traffic patterns from non-ack clocked ON-OFF\ncycles to bulk TCP transfer. We then present an analytical model to study the\npotential impact of these streaming strategies on the aggregate traffic and\nmake recommendations accordingly.\n", "versions": [{"version": "v1", "created": "Thu, 3 Nov 2011 19:02:51 GMT"}], "update_date": "2011-11-04", "authors_parsed": [["Rao", "Ashwin", "", "INRIA Sophia Antipolis / INRIA Grenoble Rhône-Alpes"], ["Lim", "Yeon-Sup", "", "INRIA Sophia Antipolis / INRIA Grenoble\n  Rhône-Alpes"], ["Barakat", "Chadi", "", "INRIA Sophia Antipolis / INRIA Grenoble\n  Rhône-Alpes"], ["Legout", "Arnaud", "", "INRIA Sophia Antipolis / INRIA Grenoble\n  Rhône-Alpes"], ["Towsley", "Don", "", "INRIA Sophia Antipolis / INRIA\n  Grenoble Rhône-Alpes"], ["Dabbous", "Walid", "", "INRIA Sophia Antipolis / INRIA\n  Grenoble Rhône-Alpes"]]}, {"id": "1111.1250", "submitter": "Wojciech Mazurczyk", "authors": "Wojciech Mazurczyk, Pawel Szaga, Krzysztof Szczypiorski", "title": "Using Transcoding for Hidden Communication in IP Telephony", "comments": "17 pages, 16 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents a new steganographic method for IP telephony called\nTranSteg (Transcoding Steganography). Typically, in steganographic\ncommunication it is advised for covert data to be compressed in order to limit\nits size. In TranSteg it is the overt data that is compressed to make space for\nthe steganogram. The main innovation of TranSteg is to, for a chosen voice\nstream, find a codec that will result in a similar voice quality but smaller\nvoice payload size than the originally selected. Then, the voice stream is\ntranscoded. At this step the original voice payload size is intentionally\nunaltered and the change of the codec is not indicated. Instead, after placing\nthe transcoded voice payload, the remaining free space is filled with hidden\ndata. TranSteg proof of concept implementation was designed and developed. The\nobtained experimental results are enclosed in this paper. They prove that the\nproposed method is feasible and offers a high steganographic bandwidth.\nTranSteg detection is difficult to perform when performing inspection in a\nsingle network localisation.\n", "versions": [{"version": "v1", "created": "Fri, 4 Nov 2011 21:07:49 GMT"}], "update_date": "2011-11-08", "authors_parsed": [["Mazurczyk", "Wojciech", ""], ["Szaga", "Pawel", ""], ["Szczypiorski", "Krzysztof", ""]]}, {"id": "1111.1817", "submitter": "Svebor Karaman", "authors": "Svebor Karaman (LaBRI), Jenny Benois-Pineau (LaBRI), Vladislavs\n  Dovgalecs (IMS), R\\'emi M\\'egret (IMS), Julien Pinquier (IRIT), R\\'egine\n  Andr\\'e-Obrecht (IRIT), Yann Ga\\\"estel (ISPED), Jean-Fran\\c{c}ois Dartigues", "title": "Hierarchical Hidden Markov Model in Detecting Activities of Daily Living\n  in Wearable Videos for Studies of Dementia", "comments": null, "journal-ref": "Multimedia Tools and Applications, Volume 69, Issue 3, pp 743-771,\n  June 2012", "doi": "10.1007/s11042-012-1117-x", "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a method for indexing activities of daily living in\nvideos obtained from wearable cameras. In the context of dementia diagnosis by\ndoctors, the videos are recorded at patients' houses and later visualized by\nthe medical practitioners. The videos may last up to two hours, therefore a\ntool for an efficient navigation in terms of activities of interest is crucial\nfor the doctors. The specific recording mode provides video data which are\nreally difficult, being a single sequence shot where strong motion and sharp\nlighting changes often appear. Our work introduces an automatic motion based\nsegmentation of the video and a video structuring approach in terms of\nactivities by a hierarchical two-level Hidden Markov Model. We define our\ndescription space over motion and visual characteristics of video and audio\nchannels. Experiments on real data obtained from the recording at home of\nseveral patients show the difficulty of the task and the promising results of\nour approach.\n", "versions": [{"version": "v1", "created": "Tue, 8 Nov 2011 07:53:29 GMT"}, {"version": "v2", "created": "Wed, 14 May 2014 14:00:35 GMT"}], "update_date": "2014-05-15", "authors_parsed": [["Karaman", "Svebor", "", "LaBRI"], ["Benois-Pineau", "Jenny", "", "LaBRI"], ["Dovgalecs", "Vladislavs", "", "IMS"], ["Mégret", "Rémi", "", "IMS"], ["Pinquier", "Julien", "", "IRIT"], ["André-Obrecht", "Régine", "", "IRIT"], ["Gaëstel", "Yann", "", "ISPED"], ["Dartigues", "Jean-François", ""]]}, {"id": "1111.1930", "submitter": "Boudhir Anouar Abdelhakim", "authors": "A. A. Boudhir, M. Bouhorma, M. Ben Ahmed and Elbrak Said", "title": "The UWB Solution for Multimedia Traffic in Wireless Sensor Networks", "comments": "8 pages, 11 figures, IJWMN Journal", "journal-ref": "International Journal of Wireless & Mobile Networks October Issue\n  2011", "doi": "10.5121/ijwmn", "report-no": null, "categories": "cs.NI cs.MM cs.OS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several researches are focused on the QoS (Quality of Service) and Energy\nconsumption in wireless Multimedia Sensor Networks. Those research projects\ninvest in theory and practice in order to extend the spectrum of use of norms,\nstandards and technologies which are emerged in wireless communications. The\nperformance of these technologies is strongly related to domains of use and\nlimitations of their characteristics. In this paper, we give a comparison of\nZigBee technology, most widely used in sensor networks, and UWB (Ultra Wide\nBand) which presents itself as competitor that present in these work better\nresults for audiovisual applications with medium-range and high throughput.\n", "versions": [{"version": "v1", "created": "Tue, 8 Nov 2011 15:03:26 GMT"}], "update_date": "2011-11-09", "authors_parsed": [["Boudhir", "A. A.", ""], ["Bouhorma", "M.", ""], ["Ahmed", "M. Ben", ""], ["Said", "Elbrak", ""]]}, {"id": "1111.2993", "submitter": "Arash Habibi Lashkari", "authors": "Behrang Parhizkar, Ashraf Abbas M. Al-Modwahi, Arash Habibi Lashkari,\n  Mohammad Mehdi Bartaripou, Hossein Reza Babae", "title": "A Survey on Web-based AR Applications", "comments": "International Journal of Computer Science Issues (IJCSI), Vol. 8,\n  Issue 4, July 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Due to the increase of interest in Augmented Reality (AR), the potential uses\nof AR are increasing also. It can benefit the user in various fields such as\neducation, business, medicine, and other. Augmented Reality supports the real\nenvironment with synthetic environment to give more details and meaning to the\nobjects in the real word. AR refers to a situation in which the goal is to\nsupplement a user's perception of the real-world through the addition of\nvirtual objects. This paper is an attempt to make a survey of web-based\nAugmented Reality applications and make a comparison among them.\n", "versions": [{"version": "v1", "created": "Sun, 13 Nov 2011 07:13:23 GMT"}], "update_date": "2011-11-15", "authors_parsed": [["Parhizkar", "Behrang", ""], ["Al-Modwahi", "Ashraf Abbas M.", ""], ["Lashkari", "Arash Habibi", ""], ["Bartaripou", "Mohammad Mehdi", ""], ["Babae", "Hossein Reza", ""]]}, {"id": "1111.3376", "submitter": "Christopher Quinn", "authors": "Dustin G. Mixon, Christopher J. Quinn, Negar Kiyavash, and Matthew\n  Fickus", "title": "Fingerprinting with Equiangular Tight Frames", "comments": "10 pages, 6 figures, presented in part at ICASSP 2011 and SPIE 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.MM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Digital fingerprinting is a framework for marking media files, such as\nimages, music, or movies, with user-specific signatures to deter illegal\ndistribution. Multiple users can collude to produce a forgery that can\npotentially overcome a fingerprinting system. This paper proposes an\nequiangular tight frame fingerprint design which is robust to such collusion\nattacks. We motivate this design by considering digital fingerprinting in terms\nof compressed sensing. The attack is modeled as linear averaging of multiple\nmarked copies before adding a Gaussian noise vector. The content owner can then\ndetermine guilt by exploiting correlation between each user's fingerprint and\nthe forged copy. The worst-case error probability of this detection scheme is\nanalyzed and bounded. Simulation results demonstrate the average-case\nperformance is similar to the performance of orthogonal and simplex fingerprint\ndesigns, while accommodating several times as many users.\n", "versions": [{"version": "v1", "created": "Mon, 14 Nov 2011 21:44:55 GMT"}], "update_date": "2011-11-16", "authors_parsed": [["Mixon", "Dustin G.", ""], ["Quinn", "Christopher J.", ""], ["Kiyavash", "Negar", ""], ["Fickus", "Matthew", ""]]}, {"id": "1111.3711", "submitter": "Aytac Azgin", "authors": "Aytac Azgin and Yucel Altunbasak", "title": "Channel Reordering with Time-shifted Streams to Improve Channel Change\n  Latency in IPTV Networks", "comments": "Compared to the previous version, corrected a few typos and\n  simplified two figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In IPTV networks, channel change latency is considered as a major obstacle in\nachieving broadcast-level quality video delivery. Because of the bandwidth\nlimitations observed at the client side, users typically have access to a\nlimited number of channels. As a result, channel change requests oftentimes\nneed to go through the network, thereby leading to significant delays. In this\npaper, we address this problem by proposing a resource-efficient time-shifted\nchannel reordering mechanism to minimize the channel change latency. The\nproposed framework exploits the differing key-frame delivery times for the\nadjacent sessions to dynamically arrange the switching order during the surfing\nperiods. The simulation results show that, with the proposed framework, more\nthan 50% improvement can be achieved in channel change latency without\nintroducing any overhead in the network.\n", "versions": [{"version": "v1", "created": "Wed, 16 Nov 2011 03:39:19 GMT"}, {"version": "v2", "created": "Sat, 17 Dec 2011 04:06:47 GMT"}], "update_date": "2011-12-20", "authors_parsed": [["Azgin", "Aytac", ""], ["Altunbasak", "Yucel", ""]]}, {"id": "1111.4800", "submitter": "Soumen  Kanrar", "authors": "Aroop Mukherjee, Soumen Kanrar (Vehere Interactive, Calcutta - India)", "title": "Enhancement of Image Resolution by Binarization", "comments": "5 pages, 8 figures", "journal-ref": "International Journal of Computer Applications 10(10):15-19, 2010", "doi": "10.5120/1519-1942", "report-no": null, "categories": "cs.CV cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Image segmentation is one of the principal approaches of image processing.\nThe choice of the most appropriate Binarization algorithm for each case proved\nto be a very interesting procedure itself. In this paper, we have done the\ncomparison study between the various algorithms based on Binarization\nalgorithms and propose a methodologies for the validation of Binarization\nalgorithms. In this work we have developed two novel algorithms to determine\nthreshold values for the pixels value of the gray scale image. The performance\nestimation of the algorithm utilizes test images with, the evaluation metrics\nfor Binarization of textual and synthetic images. We have achieved better\nresolution of the image by using the Binarization method of optimum\nthresholding techniques.\n", "versions": [{"version": "v1", "created": "Mon, 21 Nov 2011 09:47:17 GMT"}], "update_date": "2011-11-22", "authors_parsed": [["Mukherjee", "Aroop", "", "Vehere Interactive, Calcutta - India"], ["Kanrar", "Soumen", "", "Vehere Interactive, Calcutta - India"]]}, {"id": "1111.5189", "submitter": "Evan Tan", "authors": "Evan Tan and Chun Tung Chou", "title": "A Frame Rate Optimization Framework For Improving Continuity In Video\n  Streaming", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper aims to reduce the prebuffering requirements, while maintaining\ncontinuity, for video streaming. Current approaches do this by making use of\nadaptive media playout (AMP) to reduce the playout rate. However, this\nintroduces playout distortion to the viewers and increases the viewing latency.\nWe approach this by proposing a frame rate optimization framework that adjusts\nboth the encoder frame generation rate and the decoder playout frame rate.\nFirstly, we model this problem as the joint adjustment of the encoder frame\ngeneration interval and the decoder playout frame interval. This model is used\nwith a discontinuity penalty virtual buffer to track the accumulated difference\nbetween the receiving frame interval and the playout frame interval. We then\napply Lyapunov optimization to the model to systematically derive a pair of\ndecoupled optimization policies. We show that the occupancy of the\ndiscontinuity penalty virtual buffer is correlated to the video discontinuity\nand that this framework produces a very low playout distortion in addition to a\nsignificant reduction in the prebuffering requirements compared to existing\napproaches. Secondly, we introduced a delay constraint into the framework by\nusing a delay accumulator virtual buffer. Simulation results show that the the\ndelay constrained framework provides a superior tradeoff between the video\nquality and the delay introduced compared to the existing approach. Finally, we\nanalyzed the impact of delayed feedback between the receiver and the sender on\nthe optimization policies. We show that the delayed feedbacks have a minimal\nimpact on the optimization policies.\n", "versions": [{"version": "v1", "created": "Tue, 22 Nov 2011 13:15:33 GMT"}], "update_date": "2011-11-23", "authors_parsed": [["Tan", "Evan", ""], ["Chou", "Chun Tung", ""]]}, {"id": "1111.5612", "submitter": "Vijayaraghavan Thirumalai", "authors": "Vijayaraghavan Thirumalai, and Pascal Frossard", "title": "Distributed Representation of Geometrically Correlated Images with\n  Compressed Linear Measurements", "comments": null, "journal-ref": null, "doi": "10.1109/TIP.2012.2188035", "report-no": null, "categories": "cs.CV cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the problem of distributed coding of images whose\ncorrelation is driven by the motion of objects or positioning of the vision\nsensors. It concentrates on the problem where images are encoded with\ncompressed linear measurements. We propose a geometry-based correlation model\nin order to describe the common information in pairs of images. We assume that\nthe constitutive components of natural images can be captured by visual\nfeatures that undergo local transformations (e.g., translation) in different\nimages. We first identify prominent visual features by computing a sparse\napproximation of a reference image with a dictionary of geometric basis\nfunctions. We then pose a regularized optimization problem to estimate the\ncorresponding features in correlated images given by quantized linear\nmeasurements. The estimated features have to comply with the compressed\ninformation and to represent consistent transformation between images. The\ncorrelation model is given by the relative geometric transformations between\ncorresponding features. We then propose an efficient joint decoding algorithm\nthat estimates the compressed images such that they stay consistent with both\nthe quantized measurements and the correlation model. Experimental results show\nthat the proposed algorithm effectively estimates the correlation between\nimages in multi-view datasets. In addition, the proposed algorithm provides\neffective decoding performance that compares advantageously to independent\ncoding solutions as well as state-of-the-art distributed coding schemes based\non disparity learning.\n", "versions": [{"version": "v1", "created": "Wed, 23 Nov 2011 15:54:23 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Thirumalai", "Vijayaraghavan", ""], ["Frossard", "Pascal", ""]]}, {"id": "1111.5653", "submitter": "Rishabh Iyer", "authors": "Rishabh Iyer, Rushikesh Borse, Ronak Shah and Subhasis Chaudhuri", "title": "Estimation of the Embedding Capacity in Pixel-pair based Watermarking\n  Schemes", "comments": "This manuscript is submitted to Transactions of Image Processing, on\n  september 5th 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Estimation of the Embedding capacity is an important problem specifically in\nreversible multi-pass watermarking and is required for analysis before any\nimage can be watermarked. In this paper, we propose an efficient method for\nestimating the embedding capacity of a given cover image under multi-pass\nembedding, without actually embedding the watermark. We demonstrate this for a\nclass of reversible watermarking schemes which operate on a disjoint group of\npixels, specifically for pixel pairs. The proposed algorithm iteratively\nupdates the co-occurrence matrix at every stage, to estimate the multi-pass\nembedding capacity, and is much more efficient vis-a-vis actual watermarking.\nWe also suggest an extremely efficient, pre-computable tree based\nimplementation which is conceptually similar to the co-occurrence based method,\nbut provides the estimates in a single iteration, requiring a complexity akin\nto that of single pass capacity estimation. We also provide bounds on the\nembedding capacity. We finally show how our method can be easily used on a\nnumber of watermarking algorithms and specifically evaluate the performance of\nour algorithms on the benchmark watermarking schemes of Tian [11] and Coltuc\n[6].\n", "versions": [{"version": "v1", "created": "Thu, 24 Nov 2011 00:04:50 GMT"}], "update_date": "2012-02-08", "authors_parsed": [["Iyer", "Rishabh", ""], ["Borse", "Rushikesh", ""], ["Shah", "Ronak", ""], ["Chaudhuri", "Subhasis", ""]]}, {"id": "1111.6265", "submitter": "Pascale Sebillot", "authors": "Julien Lawto, Jean-Luc Gauvain (LIMSI), Lori Lamel (LIMSI), Gregory\n  Grefenstete, Guillaume Gravier (INRIA - IRISA), Julien Despres, Camille\n  Guinaudeau (INRIA - IRISA), Pascale S\\'ebillot (INRIA - IRISA)", "title": "A Scalable Video Search Engine Based on Audio Content Indexing and Topic\n  Segmentation", "comments": "NEM Summit, Torino : Italy (2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One important class of online videos is that of news broadcasts. Most news\norganisations provide near-immediate access to topical news broadcasts over the\nInternet, through RSS streams or podcasts. Until lately, technology has not\nmade it possible for a user to automatically go to the smaller parts, within a\nlonger broadcast, that might interest them. Recent advances in both speech\nrecognition systems and natural language processing have led to a number of\nrobust tools that allow us to provide users with quicker, more focussed access\nto relevant segments of one or more news broadcast videos. Here we present our\nnew interface for browsing or searching news broadcasts (video/audio) that\nexploits these new language processing tools to (i) provide immediate access to\ntopical passages within news broadcasts, (ii) browse news broadcasts by events\nas well as by people, places and organisations, (iii) perform cross lingual\nsearch of news broadcasts, (iv) search for news through a map interface, (v)\nbrowse news by trending topics, and (vi) see automatically-generated textual\nclues for news segments, before listening. Our publicly searchable demonstrator\ncurrently indexes daily broadcast news content from 50 sources in English,\nFrench, Chinese, Arabic, Spanish, Dutch and Russian.\n", "versions": [{"version": "v1", "created": "Sun, 27 Nov 2011 15:08:36 GMT"}], "update_date": "2011-11-29", "authors_parsed": [["Lawto", "Julien", "", "LIMSI"], ["Gauvain", "Jean-Luc", "", "LIMSI"], ["Lamel", "Lori", "", "LIMSI"], ["Grefenstete", "Gregory", "", "INRIA - IRISA"], ["Gravier", "Guillaume", "", "INRIA - IRISA"], ["Despres", "Julien", "", "INRIA - IRISA"], ["Guinaudeau", "Camille", "", "INRIA - IRISA"], ["Sébillot", "Pascale", "", "INRIA - IRISA"]]}, {"id": "1111.6727", "submitter": "Abdullah Bamatraf", "authors": "Abdullah Bamatraf, Rosziati Ibrahim and Mohd. Najib Mohd. Salleh", "title": "A New Digital Watermarking Algorithm Using Combination of Least\n  Significant Bit (LSB) and Inverse Bit", "comments": "8 pages, 6 figures and 4 tables; Journal of Computing, Volume 3,\n  Issue 4, April 2011, ISSN 2151-9617", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper, we introduce a new digital watermarking algorithm using least\nsignificant bit (LSB). LSB is used because of its little effect on the image.\nThis new algorithm is using LSB by inversing the binary values of the watermark\ntext and shifting the watermark according to the odd or even number of pixel\ncoordinates of image before embedding the watermark. The proposed algorithm is\nflexible depending on the length of the watermark text. If the length of the\nwatermark text is more than ((MxN)/8)-2 the proposed algorithm will also embed\nthe extra of the watermark text in the second LSB. We compare our proposed\nalgorithm with the 1-LSB algorithm and Lee's algorithm using Peak\nsignal-to-noise ratio (PSNR). This new algorithm improved its quality of the\nwatermarked image. We also attack the watermarked image by using cropping and\nadding noise and we got good results as well.\n", "versions": [{"version": "v1", "created": "Tue, 29 Nov 2011 08:37:08 GMT"}], "update_date": "2011-11-30", "authors_parsed": [["Bamatraf", "Abdullah", ""], ["Ibrahim", "Rosziati", ""], ["Salleh", "Mohd. Najib Mohd.", ""]]}, {"id": "1111.6735", "submitter": "Hareesh K", "authors": "Hareesh.K and Manjaiah D.H", "title": "Peer-to-Peer Live Streaming and Video On Demand Design Issues and its\n  Challenges", "comments": "International Journal of Peer to Peer Networks (IJP2P), Vol.2, No.4,\n  October 2011", "journal-ref": null, "doi": "10.5121/ijp2p.2011.2401", "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer-to-Peer Live streaming and Video on Demand is the most popular media\napplications over the Internet in recent years. These systems reduce the load\non the server and provide a scalable content distribution. A new paradigm of\nP2P network collaborates to build large distributed video applications on\nexisting networks .But, the problem of designing the system are at par with the\nP2P media streaming, live and Video on demand systems. Hence a comprehensive\ndesign comparison is needed to build such kind of system architecture.\nTherefore, in this paper we elaborately studied the traditional approaches for\nP2P streaming architectures, and its critical design issues, as well as\npracticable challenges. Thus, our studies in this paper clearly point the\ntangible design issues and its challenges, and other intangible issues for\nproviding P2P VoD services.\n", "versions": [{"version": "v1", "created": "Tue, 29 Nov 2011 09:06:57 GMT"}], "update_date": "2011-11-30", "authors_parsed": [["K", "Hareesh.", ""], ["H", "Manjaiah D.", ""]]}]