[{"id": "0710.0244", "submitter": "Philip Baback Alipour", "authors": "Philip B. Alipour", "title": "Theoretical Engineering and Satellite Comlink of a PTVD-SHAM System", "comments": "50 pages, 10 figures (3 multi-figures), 2 tables. v.1: 1 postulate\n  entailing hypothetical ideas, design and model on future technological\n  advances of PTVD-SHAM. The results of the previous paper [arXiv:0707.1151v6],\n  are extended in order to prove some introductory conjectures in theoretical\n  engineering advanced to architectural analysis", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.AR", "license": null, "abstract": "  This paper focuses on super helical memory system's design, 'Engineering,\nArchitectural and Satellite Communications' as a theoretical approach of an\ninvention-model to 'store time-data'. The current release entails three\nconcepts: 1- an in-depth theoretical physics engineering of the chip including\nits, 2- architectural concept based on VLSI methods, and 3- the time-data\nversus data-time algorithm. The 'Parallel Time Varying & Data Super-helical\nAccess Memory' (PTVD-SHAM), possesses a waterfall effect in its architecture\ndealing with the process of voltage output-switch into diverse logic and\nquantum states described as 'Boolean logic & image-logic', respectively.\nQuantum dot computational methods are explained by utilizing coiled carbon\nnanotubes (CCNTs) and CNT field effect transistors (CNFETs) in the chip's\narchitecture. Quantum confinement, categorized quantum well substrate, and\nB-field flux involvements are discussed in theory. Multi-access of coherent\nsequences of 'qubit addressing' in any magnitude, gained as pre-defined, here\ne.g., the 'big O notation' asymptotically confined into singularity while\npossessing a magnitude of 'infinity' for the orientation of array displacement.\nGaussian curvature of k<0 versus k'>(k<0) is debated in aim of specifying the\n2D electron gas characteristics, data storage system for defining short and\nlong time cycles for different CCNT diameters where space-time continuum is\nfolded by chance for the particle. Precise pre/post data timing for, e.g.,\nseismic waves before earthquake mantle-reach event occurrence, including time\nvarying self-clocking devices in diverse geographic locations for radar systems\nis illustrated in the Subsections of the paper. The theoretical fabrication\nprocess, electromigration between chip's components is discussed as well.\n", "versions": [{"version": "v1", "created": "Mon, 1 Oct 2007 09:35:30 GMT"}], "update_date": "2009-12-05", "authors_parsed": [["Alipour", "Philip B.", ""]]}, {"id": "0710.0262", "submitter": "Sebastian Roch", "authors": "Elchanan Mossel and Sebastien Roch", "title": "Incomplete Lineage Sorting: Consistent Phylogeny Estimation From\n  Multiple Loci", "comments": "Added a section on more general distance-based methods", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CE cs.DS math.PR math.ST stat.TH", "license": null, "abstract": "  We introduce a simple algorithm for reconstructing phylogenies from multiple\ngene trees in the presence of incomplete lineage sorting, that is, when the\ntopology of the gene trees may differ from that of the species tree. We show\nthat our technique is statistically consistent under standard stochastic\nassumptions, that is, it returns the correct tree given sufficiently many\nunlinked loci. We also show that it can tolerate moderate estimation errors.\n", "versions": [{"version": "v1", "created": "Mon, 1 Oct 2007 11:11:43 GMT"}, {"version": "v2", "created": "Fri, 2 Nov 2007 03:41:04 GMT"}], "update_date": "2011-09-30", "authors_parsed": [["Mossel", "Elchanan", ""], ["Roch", "Sebastien", ""]]}, {"id": "0710.0410", "submitter": "Philip Baback Alipour", "authors": "Philip B. Alipour", "title": "The Theory of Unified Relativity for a Biovielectroluminescence\n  Phenomenon via Fly's Visual and Imaging System", "comments": "51 pages, 4 figures (2 multi-figures), 4 tables, 3 Appendices, 1\n  Animation clip. This is a personalized report, extension to project license\n  No. TXU001347562. A very concise report is to be published in other journals\n  encompassing the relevant categories on computing and physical sciences", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.CV", "license": null, "abstract": "  The elucidation upon fly's neuronal patterns as a link to computer graphics\nand memory cards I/O's, is investigated for the phenomenon by propounding a\nunified theory of Einstein's two known relativities. It is conclusive that\nflies could contribute a certain amount of neuromatrices indicating an imagery\nfunction of a visual-computational system into computer graphics and storage\nsystems. The visual system involves the time aspect, whereas flies possess\nfaster pulses compared to humans' visual ability due to the E-field state on an\nactive fly's eye surface. This behaviour can be tested on a dissected fly\nspecimen at its ommatidia. Electro-optical contacts and electrodes are wired\nthrough the flesh forming organic emitter layer to stimulate light emission,\nthereby to a computer circuit. The next step is applying a threshold voltage\nwith secondary voltages to the circuit denoting an array of essential\nelectrodes for bit switch. As a result, circuit's dormant pulses versus active\npulses at the specimen's area are recorded. The outcome matrix possesses a\nconstruction of RGB and time radicals expressing the time problem in\nconsumption, allocating time into computational algorithms, enhancing the\ntechnology far beyond. The obtained formulation generates consumed distance\ncons(x), denoting circuital travel between data source/sink for pixel data and\nbendable wavelengths. Once 'image logic' is in place, incorporating this point\nof graphical acceleration permits one to enhance graphics and optimize\nimmensely central processing, data transmissions between memory and computer\nvisual system. The phenomenon can be mainly used in 360-deg. display/viewing,\n3D scanning techniques, military and medicine, a robust and cheap substitution\nfor e.g. pre-motion pattern analysis, real-time rendering and LCDs.\n", "versions": [{"version": "v1", "created": "Mon, 1 Oct 2007 23:55:50 GMT"}], "update_date": "2009-12-05", "authors_parsed": [["Alipour", "Philip B.", ""]]}, {"id": "0710.3621", "submitter": "Withawat Withayachumnankul", "authors": "Withawat Withayachumnankul, Bernd M. Fischer, Samuel P. Mickan, Derek\n  Abbott", "title": "Numerical removal of water-vapor effects from THz-TDS measurements", "comments": null, "journal-ref": "Proceedings of the Royal Society A: Mathematical, Physical &\n  Engineering Sciences, vol. 464, no. 2097, pp 2435-2456, 2008", "doi": "10.1098/rspa.2007.0294", "report-no": null, "categories": "cs.CE physics.comp-ph", "license": null, "abstract": "  One source of disturbance in a pulsed T-ray signal is attributed to ambient\nwater vapor. Water molecules in the gas phase selectively absorb T-rays at\ndiscrete frequencies corresponding to their molecular rotational transitions.\nThis results in prominent resonances spread over the T-ray spectrum, and in the\ntime domain the T-ray signal is observed as fluctuations after the main pulse.\nThese effects are generally undesired, since they may mask critical\nspectroscopic data. So, ambient water vapor is commonly removed from the T-ray\npath by using a closed chamber during the measurement. Yet, in some\napplications a closed chamber is not applicable. This situation, therefore,\nmotivates the need for another method to reduce these unwanted artifacts. This\npaper presents a study on a computational means to address the problem.\nInitially, a complex frequency response of water vapor is modeled from a\nspectroscopic catalog. Using a deconvolution technique, together with fine\ntuning of the strength of each resonance, parts of the water-vapor response are\nremoved from a measured T-ray signal, with minimal signal distortion.\n", "versions": [{"version": "v1", "created": "Fri, 19 Oct 2007 02:17:35 GMT"}], "update_date": "2008-07-16", "authors_parsed": [["Withayachumnankul", "Withawat", ""], ["Fischer", "Bernd M.", ""], ["Mickan", "Samuel P.", ""], ["Abbott", "Derek", ""]]}, {"id": "0710.4486", "submitter": "Michel Fliess", "authors": "Michel Fliess (INRIA Futurs), C\\'edric Join (INRIA Futurs, CRAN),\n  Hebertt Sira-Ramirez", "title": "Non-linear estimation is easy", "comments": null, "journal-ref": "Int. J. Modelling Identification and Control 4, 1 (2008) 12-27", "doi": "10.1504/IJMIC.2008.020996", "report-no": null, "categories": "cs.CE cs.NA cs.PF math.AC math.NA math.OC", "license": null, "abstract": "  Non-linear state estimation and some related topics, like parametric\nestimation, fault diagnosis, and perturbation attenuation, are tackled here via\na new methodology in numerical differentiation. The corresponding basic system\ntheoretic definitions and properties are presented within the framework of\ndifferential algebra, which permits to handle system variables and their\nderivatives of any order. Several academic examples and their computer\nsimulations, with on-line estimations, are illustrating our viewpoint.\n", "versions": [{"version": "v1", "created": "Wed, 24 Oct 2007 14:48:39 GMT"}], "update_date": "2008-11-06", "authors_parsed": [["Fliess", "Michel", "", "INRIA Futurs"], ["Join", "Cédric", "", "INRIA Futurs, CRAN"], ["Sira-Ramirez", "Hebertt", ""]]}, {"id": "0710.5116", "submitter": "Taneli Mielik\\\"ainen", "authors": "Matti K\\\"a\\\"ari\\\"ainen, Niels Landwehr, Sampsa Lappalainen and Taneli\n  Mielik\\\"ainen", "title": "Combining haplotypers", "comments": null, "journal-ref": null, "doi": null, "report-no": "C-2007-57", "categories": "cs.LG cs.CE q-bio.QM", "license": null, "abstract": "  Statistically resolving the underlying haplotype pair for a genotype\nmeasurement is an important intermediate step in gene mapping studies, and has\nreceived much attention recently. Consequently, a variety of methods for this\nproblem have been developed. Different methods employ different statistical\nmodels, and thus implicitly encode different assumptions about the nature of\nthe underlying haplotype structure. Depending on the population sample in\nquestion, their relative performance can vary greatly, and it is unclear which\nmethod to choose for a particular sample. Instead of choosing a single method,\nwe explore combining predictions returned by different methods in a principled\nway, and thereby circumvent the problem of method selection.\n  We propose several techniques for combining haplotype reconstructions and\nanalyze their computational properties. In an experimental study on real-world\nhaplotype data we show that such techniques can provide more accurate and\nrobust reconstructions, and are useful for outlier detection. Typically, the\ncombined prediction is at least as accurate as or even more accurate than the\nbest individual method, effectively circumventing the method selection problem.\n", "versions": [{"version": "v1", "created": "Fri, 26 Oct 2007 15:13:21 GMT"}], "update_date": "2007-10-29", "authors_parsed": [["Kääriäinen", "Matti", ""], ["Landwehr", "Niels", ""], ["Lappalainen", "Sampsa", ""], ["Mielikäinen", "Taneli", ""]]}, {"id": "0710.5512", "submitter": "Santiago Moreno", "authors": "U. Horst, S. Moreno", "title": "Risk Minimization and Optimal Derivative Design in a Principal Agent\n  Game", "comments": "28 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": null, "abstract": "  We consider the problem of Adverse Selection and optimal derivative design\nwithin a Principal-Agent framework. The principal's income is exposed to\nnon-hedgeable risk factors arising, for instance, from weather or climate\nphenomena. She evaluates her risk using a coherent and law invariant risk\nmeasure and tries minimize her exposure by selling derivative securities on her\nincome to individual agents. The agents have mean-variance preferences with\nheterogeneous risk aversion coefficients. An agent's degree of risk aversion is\nprivate information and hidden to the principal who only knows the overall\ndistribution. We show that the principal's risk minimization problem has a\nsolution and illustrate the effects of risk transfer on her income by means of\ntwo specific examples. Our model extends earlier work of Barrieu and El Karoui\n(2005) and Carlier, Ekeland and Touzi (2007).\n", "versions": [{"version": "v1", "created": "Mon, 29 Oct 2007 20:00:15 GMT"}], "update_date": "2007-10-31", "authors_parsed": [["Horst", "U.", ""], ["Moreno", "S.", ""]]}]