[{"id": "1602.00165", "submitter": "Amulya Yadav", "authors": "Amulya Yadav, Hau Chan, Albert Jiang, Haifeng Xu, Eric Rice, Milind\n  Tambe", "title": "Using Social Networks to Aid Homeless Shelters: Dynamic Influence\n  Maximization under Uncertainty - An Extended Version", "comments": "This is an extended version of our AAMAS 2016 paper (with the same\n  name) with full proofs of all our theorems included", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents HEALER, a software agent that recommends sequential\nintervention plans for use by homeless shelters, who organize these\ninterventions to raise awareness about HIV among homeless youth. HEALER's\nsequential plans (built using knowledge of social networks of homeless youth)\nchoose intervention participants strategically to maximize influence spread,\nwhile reasoning about uncertainties in the network. While previous work\npresents influence maximizing techniques to choose intervention participants,\nthey do not address three real-world issues: (i) they completely fail to scale\nup to real-world sizes; (ii) they do not handle deviations in execution of\nintervention plans; (iii) constructing real-world social networks is an\nexpensive process. HEALER handles these issues via four major contributions:\n(i) HEALER casts this influence maximization problem as a POMDP and solves it\nusing a novel planner which scales up to previously unsolvable real-world\nsizes; (ii) HEALER allows shelter officials to modify its recommendations, and\nupdates its future plans in a deviation-tolerant manner; (iii) HEALER\nconstructs social networks of homeless youth at low cost, using a Facebook\napplication. Finally, (iv) we show hardness results for the problem that HEALER\nsolves. HEALER will be deployed in the real world in early Spring 2016 and is\ncurrently undergoing testing at a homeless shelter.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jan 2016 21:59:27 GMT"}], "update_date": "2016-02-02", "authors_parsed": [["Yadav", "Amulya", ""], ["Chan", "Hau", ""], ["Jiang", "Albert", ""], ["Xu", "Haifeng", ""], ["Rice", "Eric", ""], ["Tambe", "Milind", ""]]}, {"id": "1602.00193", "submitter": "Lin Chen", "authors": "Zhuqi Li, Lin Chen, Yichong Bai, Kaigui Bian, Pan Zhou", "title": "On Diffusion-restricted Social Network: A Measurement Study of WeChat\n  Moments", "comments": "Accepted by IEEE International Conference on Communications (IEEE ICC\n  2016)", "journal-ref": null, "doi": "10.1109/ICC.2016.7511394", "report-no": null, "categories": "cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  WeChat is a mobile messaging application that has 549 million active users as\nof Q1 2015, and \"WeChat Moments\" (WM) serves its social-networking function\nthat allows users to post/share links of web pages. WM differs from the other\nsocial networks as it imposes many restrictions on the information diffusion\nprocess to mitigate the information overload. In this paper, we conduct a\nmeasurement study on information diffusion in the WM network by crawling and\nanalyzing the spreading statistics of more than 160,000 pages that involve\napproximately 40 million users. Specifically, we identify the relationship of\nthe number of posted pages and the number of views, the diffusion path length,\nthe similarity and distribution of users' locations as well as their\nconnections with the GDP of the users' province. For each individual WM page,\nwe measure its temporal characteristics (e.g., the life time, the popularity\nwithin a time period); for each individual user, we evaluate how many of, or\nhow likely, one's friends will view his posted pages. Our results will help the\nbusiness to decide when and how to release the marketing pages over WM for\nbetter publicity.\n", "versions": [{"version": "v1", "created": "Sun, 31 Jan 2016 03:28:30 GMT"}, {"version": "v2", "created": "Fri, 18 Mar 2016 02:42:21 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Li", "Zhuqi", ""], ["Chen", "Lin", ""], ["Bai", "Yichong", ""], ["Bian", "Kaigui", ""], ["Zhou", "Pan", ""]]}, {"id": "1602.00572", "submitter": "Daniel Romero", "authors": "Daniel M. Romero, Brian Uzzi, and Jon Kleinberg", "title": "Social Networks Under Stress", "comments": "12 pages, 8 figures, Proceedings of the 25th ACM International World\n  Wide Web Conference (WWW) 2016", "journal-ref": null, "doi": "10.1145/2872427.2883063l", "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social network research has begun to take advantage of fine-grained\ncommunications regarding coordination, decision-making, and knowledge sharing.\nThese studies, however, have not generally analyzed how external events are\nassociated with a social network's structure and communicative properties.\nHere, we study how external events are associated with a network's change in\nstructure and communications. Analyzing a complete dataset of millions of\ninstant messages among the decision-makers in a large hedge fund and their\nnetwork of outside contacts, we investigate the link between price shocks,\nnetwork structure, and change in the affect and cognition of decision-makers\nembedded in the network. When price shocks occur the communication network\ntends not to display structural changes associated with adaptiveness. Rather,\nthe network \"turtles up\". It displays a propensity for higher clustering,\nstrong tie interaction, and an intensification of insider vs. outsider\ncommunication. Further, we find changes in network structure predict shifts in\ncognitive and affective processes, execution of new transactions, and local\noptimality of transactions better than prices, revealing the important\npredictive relationship between network structure and collective behavior\nwithin a social network.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2016 15:58:29 GMT"}], "update_date": "2016-02-02", "authors_parsed": [["Romero", "Daniel M.", ""], ["Uzzi", "Brian", ""], ["Kleinberg", "Jon", ""]]}, {"id": "1602.00795", "submitter": "Samuel Way", "authors": "Samuel F. Way, Daniel B. Larremore, Aaron Clauset", "title": "Gender, Productivity, and Prestige in Computer Science Faculty Hiring\n  Networks", "comments": "11 pages, 7 figures, 5 tables", "journal-ref": "Proc. 2016 World Wide Web Conference (WWW), 1169-1179 (2016)", "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Women are dramatically underrepresented in computer science at all levels in\nacademia and account for just 15% of tenure-track faculty. Understanding the\ncauses of this gender imbalance would inform both policies intended to rectify\nit and employment decisions by departments and individuals. Progress in this\ndirection, however, is complicated by the complexity and decentralized nature\nof faculty hiring and the non-independence of hires. Using comprehensive data\non both hiring outcomes and scholarly productivity for 2659 tenure-track\nfaculty across 205 Ph.D.-granting departments in North America, we investigate\nthe multi-dimensional nature of gender inequality in computer science faculty\nhiring through a network model of the hiring process. Overall, we find that\nhiring outcomes are most directly affected by (i) the relative prestige between\nhiring and placing institutions and (ii) the scholarly productivity of the\ncandidates. After including these, and other features, the addition of gender\ndid not significantly reduce modeling error. However, gender differences do\nexist, e.g., in scholarly productivity, postdoctoral training rates, and in\ncareer movements up the rankings of universities, suggesting that the effects\nof gender are indirectly incorporated into hiring decisions through gender's\ncovariates. Furthermore, we find evidence that more highly ranked departments\nrecruit female faculty at higher than expected rates, which appears to inhibit\nsimilar efforts by lower ranked departments. These findings illustrate the\nsubtle nature of gender inequality in faculty hiring networks and provide new\ninsights to the underrepresentation of women in computer science.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2016 05:40:17 GMT"}], "update_date": "2016-06-17", "authors_parsed": [["Way", "Samuel F.", ""], ["Larremore", "Daniel B.", ""], ["Clauset", "Aaron", ""]]}, {"id": "1602.00841", "submitter": "Dmitry Namiot", "authors": "Manfred Sneps-Sneppe, Dmitry Namiot", "title": "On Physical Web models", "comments": "a paper for Sibcon 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Physical Web is a generic term describes interconnection of physical\nobjects and web. The Physical Web lets present physical objects in a web. There\nare different ways to do that and we will discuss them in our paper. Usually,\nthe web presentation for a physical object could be implemented with the help\nof mobile devices. The basic idea behind the Physical Web is to navigate and\ncontrol physical objects in the world surrounding mobile devices with the help\nof web technologies. Of course, there are different ways to identify and\nenumerate physical objects. In this paper, we describe the existing models as\nwell as related challenges. In our analysis, we will target objects enumeration\nand navigation as well as data retrieving and programming for the Physical Web.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2016 09:17:37 GMT"}], "update_date": "2016-02-03", "authors_parsed": [["Sneps-Sneppe", "Manfred", ""], ["Namiot", "Dmitry", ""]]}, {"id": "1602.01547", "submitter": "Fraida Fund", "authors": "Fraida Fund, S. Amir Hosseini, Shivendra S. Panwar", "title": "Under a cloud of uncertainty: Legal questions affecting Internet storage\n  and transmission of copyright-protected video content", "comments": "Accepted in IEEE Network Special Issue on Smart Data Pricing", "journal-ref": "IEEE Network, vol. 30, no. 2, pp. 32-38, March-April 2016", "doi": "10.1109/MNET.2016.7437022", "report-no": null, "categories": "cs.NI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid growth of multimedia consumption has triggered technical, economic,\nand business innovations that improve the quality and accessibility of content.\nIt has also opened new markets, promising large revenues for industry players.\nHowever, new technologies also pose new questions regarding the legal aspects\nof content delivery, which are often resolved through litigation between\ncopyright owners and content distributors. The precedents set by these cases\nwill act as a game changer in the content delivery industry and will shape the\nexisting offerings in the market in terms of how new technologies can be\ndeployed and what kind of pricing strategies can be associated with them. In\nthis paper, we offer a tutorial on key copyright and communications laws and\ndecisions related to storage and transmission of video content over the\nInternet. We summarize legal limitations on the deployment of new technologies\nand pricing mechanisms, and explain the implications of recent lawsuits.\nUnderstanding these concerns is essential for engineers engaged in designing\nthe technical and economic aspects of video delivery systems.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2016 03:03:13 GMT"}], "update_date": "2016-05-16", "authors_parsed": [["Fund", "Fraida", ""], ["Hosseini", "S. Amir", ""], ["Panwar", "Shivendra S.", ""]]}, {"id": "1602.01652", "submitter": "Milena Tsvetkova", "authors": "Milena Tsvetkova, Ruth Garc\\'ia-Gavilanes, and Taha Yasseri", "title": "Dynamics of Disagreement: Large-Scale Temporal Network Analysis Reveals\n  Negative Interactions in Online Collaboration", "comments": "Forthcoming in Scientific Reports", "journal-ref": "Scientific Reports (2016) 6:36333", "doi": "10.1038/srep36333", "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Disagreement and conflict are a fact of social life and considerably affect\nour well-being and productivity. Such negative interactions are rarely\nexplicitly declared and recorded and this makes them hard for scientists to\nstudy. We overcome this challenge by investigating the patterns in the timing\nand configuration of contributions to a large online collaboration community.\nWe analyze sequences of reverts of contributions to Wikipedia, the largest\nonline encyclopedia, and investigate how often and how fast they occur compared\nto a null model that randomizes the order of actions to remove any systematic\nclustering. We find evidence that individuals systematically attack the same\nperson and attack back their attacker; both of these interactions occur at a\nfaster response rate than expected. We also establish that individuals come to\ndefend an attack victim but we do not find evidence that attack victims \"pay it\nforward\" or that attackers collude to attack the same individual. We further\nfind that high-status contributors are more likely to attack many others\nserially, status equals are more likely to revenge attacks back, while attacks\nby lower-status contributors trigger attacks forward; yet, it is the\nlower-status contributors who also come forward to defend third parties. The\nmethod we use can be applied to other large-scale temporal communication and\ncollaboration networks to identify the existence of negative social\ninteractions and other social processes.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2016 12:12:24 GMT"}, {"version": "v2", "created": "Wed, 26 Oct 2016 11:01:19 GMT"}], "update_date": "2016-11-04", "authors_parsed": [["Tsvetkova", "Milena", ""], ["García-Gavilanes", "Ruth", ""], ["Yasseri", "Taha", ""]]}, {"id": "1602.01804", "submitter": "Dominik Herrmann", "authors": "Dominik Herrmann and Jens Lindemann", "title": "Obtaining personal data and asking for erasure: Do app vendors and\n  website owners honour your privacy rights?", "comments": "This paper has been accepted for publication at Sicherheit 2016. The\n  preprint is a slightly extended version of the conference paper: The preprint\n  contains the list of the selected apps and websites. Differences in Version\n  v2: includes Acknowledgements, changed a typo in first paragraph of Sect. 3.1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  EU Directive 95/46/EC and the upcoming EU General Data Protection Regulation\ngrant Europeans the right of access to data pertaining to them. Consumers can\napproach their service providers to obtain all personal data stored and\nprocessed there. Furthermore, they can demand erasure (or correction) of their\ndata. We conducted an undercover field study to determine whether these rights\ncan be exerted in practice. We assessed the behaviour of the vendors of 150\nsmartphone apps and 120 websites that are popular in Germany. Our deletion\nrequests were fulfilled in 52 to 57% of the cases and less than half of the\ndata provision requests were answered satisfactorily. Further, we observed\ninstances of carelessness: About 20% of website owners would have disclosed our\npersonal data to impostors. The results indicate that exerting privacy rights\nthat have been introduced two decades ago is still a frustrating endeavour most\nof the time.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2016 19:43:25 GMT"}, {"version": "v2", "created": "Mon, 11 Apr 2016 14:03:24 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Herrmann", "Dominik", ""], ["Lindemann", "Jens", ""]]}, {"id": "1602.01937", "submitter": "Kambiz Ghazinour", "authors": "Kambiz Ghazinour, Stan Matwin, Marina Sokolova", "title": "YOURPRIVACYPROTECTOR, A recommender system for privacy settings in\n  social networks", "comments": "15 pages, International journal of security, privacy and trust\n  management. (IJSPTM) Volume 2, No 4, Aug. 2013", "journal-ref": "International journal of security, privacy and trust management.\n  (IJSPTM) Volume 2, No 4, Aug. 2013", "doi": "10.5121/ijsptm.2013.2402", "report-no": null, "categories": "cs.CR cs.CY cs.IR cs.SI", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Ensuring privacy of users of social networks is probably an unsolvable\nconundrum. At the same time, an informed use of the existing privacy options by\nthe social network participants may alleviate - or even prevent - some of the\nmore drastic privacy-averse incidents. Unfortunately, recent surveys show that\nan average user is either not aware of these options or does not use them,\nprobably due to their perceived complexity. It is therefore reasonable to\nbelieve that tools assisting users with two tasks: 1) understanding their\nsocial net behavior in terms of their privacy settings and broad privacy\ncategories, and 2)recommending reasonable privacy options, will be a valuable\ntool for everyday privacy practice in a social network context. This paper\npresents YourPrivacyProtector, a recommender system that shows how simple\nmachine learning techniques may provide useful assistance in these two tasks to\nFacebook users. We support our claim with empirical results of application of\nYourPrivacyProtector to two groups of Facebook users.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2016 07:29:55 GMT"}], "update_date": "2016-02-08", "authors_parsed": [["Ghazinour", "Kambiz", ""], ["Matwin", "Stan", ""], ["Sokolova", "Marina", ""]]}, {"id": "1602.02046", "submitter": "Javier Parra-Arnau", "authors": "Javier Parra-Arnau, Jagdish Prasad Achara, Claude Castelluccia", "title": "MyAdChoices: Bringing Transparency and Control to Online Advertising", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The intrusiveness and the increasing invasiveness of online advertising have,\nin the last few years, raised serious concerns regarding user privacy and Web\nusability. As a reaction to these concerns, we have witnessed the emergence of\na myriad of ad-blocking and anti-tracking tools, whose aim is to return control\nto users over advertising. The problem with these technologies, however, is\nthat they are extremely limited and radical in their approach: users can only\nchoose either to block or allow all ads. With around 200 million people\nregularly using these tools, the economic model of the Web ---in which users\nget content free in return for allowing advertisers to show them ads--- is at\nserious peril. In this paper, we propose a smart Web technology that aims at\nbringing transparency to online advertising, so that users can make an informed\nand equitable decision regarding ad blocking. The proposed technology is\nimplemented as a Web-browser extension and enables users to exert fine-grained\ncontrol over advertising, thus providing them with certain guarantees in terms\nof privacy and browsing experience, while preserving the Internet economic\nmodel. Experimental results in a real environment demonstrate the suitability\nand feasibility of our approach, and provide preliminary findings on behavioral\ntargeting from real user browsing profiles.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2016 14:50:26 GMT"}], "update_date": "2016-02-08", "authors_parsed": [["Parra-Arnau", "Javier", ""], ["Achara", "Jagdish Prasad", ""], ["Castelluccia", "Claude", ""]]}, {"id": "1602.02238", "submitter": "Daniele Quercia", "authors": "Giovanni Quattrone, Davide Proserpio, Daniele Quercia, Licia Capra,\n  Mirco Musolesi", "title": "Who Benefits from the \"Sharing\" Economy of Airbnb?", "comments": "In Proceedings of the 26th International ACM Conference on World Wide\n  Web (WWW), 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sharing economy platforms have become extremely popular in the last few\nyears, and they have changed the way in which we commute, travel, and borrow\namong many other activities. Despite their popularity among consumers, such\ncompanies are poorly regulated. For example, Airbnb, one of the most successful\nexamples of sharing economy platform, is often criticized by regulators and\npolicy makers. While, in theory, municipalities should regulate the emergence\nof Airbnb through evidence-based policy making, in practice, they engage in a\nfalse dichotomy: some municipalities allow the business without imposing any\nregulation, while others ban it altogether. That is because there is no\nevidence upon which to draft policies. Here we propose to gather evidence from\nthe Web. After crawling Airbnb data for the entire city of London, we find out\nwhere and when Airbnb listings are offered and, by matching such listing\ninformation with census and hotel data, we determine the socio-economic\nconditions of the areas that actually benefit from the hospitality platform.\nThe reality is more nuanced than one would expect, and it has changed over the\nyears. Airbnb demand and offering have changed over time, and traditional\nregulations have not been able to respond to those changes. That is why,\nfinally, we rely on our data analysis to envision regulations that are\nresponsive to real-time demands, contributing to the emerging idea of\n\"algorithmic regulation\".\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2016 11:19:51 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Quattrone", "Giovanni", ""], ["Proserpio", "Davide", ""], ["Quercia", "Daniele", ""], ["Capra", "Licia", ""], ["Musolesi", "Mirco", ""]]}, {"id": "1602.02509", "submitter": "Wouter Bokslag", "authors": "Wouter Bokslag, Manon de Vries", "title": "Evaluating e-voting: theory and practice", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  In the Netherlands as well as many other countries, the use of electronic\nvoting solutions is a recurrent topic of discussion. While electronic voting\ncertainly has advantages over paper voting, there are also important risks\ninvolved. This paper presents an analysis of benefits and risks of electronic\nvoting, and shows the relevance of these issues by means of three case studies\nof real-world implementations. Additionally, techniques that may be employed to\nimprove upon many of the current systems are presented. We conclude that the\nadvantages of E-voting do not outweigh the disadvantages, as the resulting\nreduced verifiability and transparency seem hard to overcome.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2016 09:47:04 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Bokslag", "Wouter", ""], ["de Vries", "Manon", ""]]}, {"id": "1602.02574", "submitter": "Lo Lo", "authors": "Lo\\\"ic Sevrin, Norbert Noury, Nacer Abouchi, Fabrice Jumel, Bertrand\n  Massot, Jacques Saraydaryan", "title": "Characterization of a Multi-User Indoor Positioning System Based on Low\n  Cost Depth Vision (Kinect) for Monitoring Human Activity in a Smart Home", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An increasing number of systems use indoor positioning for many scenarios\nsuch as asset tracking, health care, games, manufacturing, logistics, shopping,\nand security. Many technologies are available and the use of depth cameras is\nbecoming more and more attractive as this kind of device becomes affordable and\neasy to handle. This paper contributes to the effort of creating an indoor\npositioning system based on low cost depth cameras (Kinect). A method is\nproposed to optimize the calibration of the depth cameras, to describe the\nmulti-camera data fusion and to specify a global positioning projection to\nmaintain the compatibility with outdoor positioning systems.\n  The monitoring of the people trajectories at home is intended for the early\ndetection of a shift in daily activities which highlights disabilities and loss\nof autonomy. This system is meant to improve homecare health management at home\nfor a better end of life at a sustainable cost for the community.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2016 14:14:49 GMT"}], "update_date": "2016-02-10", "authors_parsed": [["Sevrin", "Loïc", ""], ["Noury", "Norbert", ""], ["Abouchi", "Nacer", ""], ["Jumel", "Fabrice", ""], ["Massot", "Bertrand", ""], ["Saraydaryan", "Jacques", ""]]}, {"id": "1602.02692", "submitter": "Joachim Allgaier", "authors": "Joachim Allgaier", "title": "Science on YouTube: What users find when they search for climate science\n  and climate manipulation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online video-sharing sites such as YouTube are very popular and also used by\na lot of people to obtain knowledge and information, also on science, health\nand technology. Technically they could be valuable tools for the public\ncommunication of science and technology, but the users of YouTube are also\nconfronted with conspiracy theories and erroneous and misleading information\nthat deviates from scientific consensus views. This contribution details the\nresults of a study that investigates what kind of information users find when\nthey are searching for climate science and climate manipulation topics on\nYouTube and whether this information corresponds with or challenges scientific\nconsensus views. An innovative methodological approach using the anonymization\nnetwork Tor is introduced for drawing randomized samples of YouTube videos.\nThis approach was used to select and examine a sample of 140 YouTube videos on\nclimate topics.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2016 18:43:30 GMT"}, {"version": "v2", "created": "Mon, 18 Apr 2016 12:42:27 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Allgaier", "Joachim", ""]]}, {"id": "1602.03337", "submitter": "Godphrey Kyambille Mr", "authors": "Godphrey G Kyambille and Khamisi Kalegele", "title": "Enhancing Patient Appointments Scheduling that Uses Mobile Technology", "comments": "7 pages", "journal-ref": "International Journal of Computer Science and Information\n  Security, 13(11), 21 (2015)", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Appointment scheduling systems are utilized mainly by specialty care clinics\nto manage access to service providers as well as by hospitals to schedule\npatient appointments. When attending hospitals in Tanzania, patients experience\nchallenges to see an appropriate specialist doctor because of service interval\ninconsistency. Timely availability of doctors is critical whenever a patient\nneeds to see a specialist doctor for treatment and a serious bottleneck lies in\nthe application of appropriate technology techniques to enhance appointment\nscheduling. In this paper, we present a mobile based application scheduling\nsystem for managing patient appointments. Furthermore, forthcoming\nopportunities for the innovative use of the mobile based application scheduling\nsystem are identified.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2016 11:56:48 GMT"}], "update_date": "2016-02-11", "authors_parsed": [["Kyambille", "Godphrey G", ""], ["Kalegele", "Khamisi", ""]]}, {"id": "1602.03926", "submitter": "Igor Barahona Dr", "authors": "Igor Barahona, Judith Cavazos, and Jian-Bo Yang", "title": "Modelling the level of adoption of analytical tools; An implementation\n  of multi-criteria evidential reasoning", "comments": "Keywords: MCDA methods; evidential reasoning; analytical tools;\n  multiple source data", "journal-ref": "International Journal of Supply and Operations Management. (2014)\n  Vol.1, Issue 2, pp 129-151", "doi": null, "report-no": null, "categories": "stat.AP cs.CY stat.OT", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  In the future, competitive advantages will be given to organisations that can\nextract valuable information from massive data and make better decisions. In\nmost cases, this data comes from multiple sources. Therefore, the challenge is\nto aggregate them into a common framework in order to make them meaningful and\nuseful. This paper will first review the most important multi-criteria decision\nanalysis methods (MCDA) existing in current literature. We will offer a novel,\npractical and consistent methodology based on a type of MCDA, to aggregate data\nfrom two different sources into a common framework. Two datasets that are\ndifferent in nature but related to the same topic are aggregated to a common\nscale by implementing a set of transformation rules. This allows us to generate\nappropriate evidence for assessing and finally prioritising the level of\nadoption of analytical tools in four types of companies. A numerical example is\nprovided to clarify the form for implementing this methodology. A six-step\nprocess is offered as a guideline to assist engineers, researchers or\npractitioners interested in replicating this methodology in any situation where\nthere is a need to aggregate and transform multiple source data.\n", "versions": [{"version": "v1", "created": "Thu, 11 Feb 2016 23:02:10 GMT"}], "update_date": "2016-05-11", "authors_parsed": [["Barahona", "Igor", ""], ["Cavazos", "Judith", ""], ["Yang", "Jian-Bo", ""]]}, {"id": "1602.03929", "submitter": "Nalin Asanka Gamagedara Arachchilage", "authors": "Nalin Asanka Gamagedara Arachchilage and Melissa Cole", "title": "Designing a Mobile Game for Home Computer Users to Protect Against\n  Phishing Attacks", "comments": "8 in International Journal for e-Learning Security (IJeLS), Volume 1,\n  Issue 1/2, March/June 2011. arXiv admin note: substantial text overlap with\n  arXiv:1511.07093", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This research aims to design an educational mobile game for home computer\nusers to prevent from phishing attacks. Phishing is an online identity theft\nwhich aims to steal sensitive information such as username, password and online\nbanking details from victims. To prevent this, phishing education needs to be\nconsidered. Mobile games could facilitate to embed learning in a natural\nenvironment. The paper introduces a mobile game design based on a story which\nis simplifying and exaggerating real life. We use a theoretical model derived\nfrom Technology Threat Avoidance Theory (TTAT) to address the game design\nissues and game design principles were used as a set of guidelines for\nstructuring and presenting information. The overall mobile game design was\naimed to enhance avoidance behaviour through motivation of home computer users\nto protect against phishing threats. The prototype game design is presented on\nGoogle App Inventor Emulator. We believe by training home computer users to\nprotect against phishing attacks, would be an aid to enable the cyberspace as a\nsecure environment.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2016 00:01:14 GMT"}], "update_date": "2016-02-15", "authors_parsed": [["Arachchilage", "Nalin Asanka Gamagedara", ""], ["Cole", "Melissa", ""]]}, {"id": "1602.03956", "submitter": "Daniel Filipe Farinha", "authors": "Daniel Filipe G. Farinha", "title": "Grokya: a Privacy-Friendly Framework for Ubiquitous Computing", "comments": "Master thesis", "journal-ref": null, "doi": "10.13140/RG.2.1.2452.3281", "report-no": null, "categories": "cs.CY cs.HC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In a world where for-profit enterprises are increasingly looking to maximize\nprofits by engaging in privacy invading consumer-profiling techniques, the rise\nof ubiquitous computing and the Internet of Things (IoT) poses a major problem.\nIf not acted upon quickly, the combination of Big Data with IoT will explode\ninto a dystopian world that even George Orwell could not have predicted. The\nproposed project aims to fill a gap that no other solution is addressing, which\nis to reach a win-win scenario that works for both the enterprises and the\nconsumers. It aims to do this by creating the building blocks for a consumer\nowned infrastructure that can provide both privacy for the user, and still\nenable the enterprises to achieve their high-level goals.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2016 03:18:47 GMT"}, {"version": "v2", "created": "Wed, 29 Jun 2016 07:19:01 GMT"}], "update_date": "2016-06-30", "authors_parsed": [["Farinha", "Daniel Filipe G.", ""]]}, {"id": "1602.04101", "submitter": "Tai Wang", "authors": "Tai Wang, Xiangen Hu, Keith Shubeck, Zhiqiang Cai, Jie Tang", "title": "An Empirical Study on Academic Commentary and Its Implications on\n  Reading and Writing", "comments": "22 pages, 5 figures, 6 tables. An extension of an oral presentation\n  \"a simple model for social media\" in 45th Annual Mathematical Psychology\n  Meeting,2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The relationship between reading and writing (RRW) is one of the major themes\nin learning science. One of its obstacles is that it is difficult to define or\nmeasure the latent background knowledge of the individual. However, in an\nacademic research setting, scholars are required to explicitly list their\nbackground knowledge in the citation sections of their manuscripts. This unique\nopportunity was taken advantage of to observe RRW, especially in the published\nacademic commentary scenario. RRW was visualized under a proposed topic process\nmodel by using a state of the art version of latent Dirichlet allocation (LDA).\nThe empirical study showed that the academic commentary is modulated both by\nits target paper and the author's background knowledge. Although this\nconclusion was obtained in a unique environment, we suggest its implications\ncan also shed light on other similar interesting areas, such as dialog and\nconversation, group discussion, and social media.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2016 16:18:00 GMT"}], "update_date": "2016-02-15", "authors_parsed": [["Wang", "Tai", ""], ["Hu", "Xiangen", ""], ["Shubeck", "Keith", ""], ["Cai", "Zhiqiang", ""], ["Tang", "Jie", ""]]}, {"id": "1602.04257", "submitter": "Bhuvan M S", "authors": "Malladihalli S Bhuvan, Ankit Kumar, Adil Zafar, Vinith Kishore", "title": "Identifying Diabetic Patients with High Risk of Readmission", "comments": "10 pages, 5 figures, 7 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hospital readmissions are expensive and reflect the inadequacies in\nhealthcare system. In the United States alone, treatment of readmitted diabetic\npatients exceeds 250 million dollars per year. Early identification of patients\nfacing a high risk of readmission can enable healthcare providers to to conduct\nadditional investigations and possibly prevent future readmissions. This not\nonly improves the quality of care but also reduces the medical expenses on\nreadmission. Machine learning methods have been leveraged on public health data\nto build a system for identifying diabetic patients facing a high risk of\nfuture readmission. Number of inpatient visits, discharge disposition and\nadmission type were identified as strong predictors of readmission. Further, it\nwas found that the number of laboratory tests and discharge disposition\ntogether predict whether the patient will be readmitted shortly after being\ndischarged from the hospital (i.e. <30 days) or after a longer period of time\n(i.e. >30 days). These insights can help healthcare providers to improve\ninpatient diabetic care. Finally, the cost analysis suggests that \\$252.76\nmillion can be saved across 98,053 diabetic patient encounters by incorporating\nthe proposed cost sensitive analysis model.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2016 22:51:11 GMT"}], "update_date": "2016-02-16", "authors_parsed": [["Bhuvan", "Malladihalli S", ""], ["Kumar", "Ankit", ""], ["Zafar", "Adil", ""], ["Kishore", "Vinith", ""]]}, {"id": "1602.04281", "submitter": "Nicholas Bolten", "authors": "Nicholas Bolten, Amirhossein Amini, Yun Hao, Vaishnavi Ravichandran,\n  Andre Stephens, Anat Caspi", "title": "Urban sidewalks: visualization and routing for individuals with limited\n  mobility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  People with limited mobility in the U.S. (defined as having difficulty or\ninability to walk a quarter of a mile without help and without the use of\nspecial equipment) face a growing informational gap: while pedestrian routing\nalgorithms are getting faster and more informative, planning a route with a\nwheeled device in urban centers is very difficult due to lack of integrated\npertinent information regarding accessibility along the route. Moreover,\nreducing access to street-spaces translates to reduced access to other public\ninformation and services that are increasingly made available to the public\nalong urban streets. To adequately plan a commute, a traveler with limited or\nwheeled mobility must know whether her path may be blocked by construction,\nwhether the sidewalk would be too steep or rendered unusable due to poor\nconditions, whether the street can be crossed or a highway is blocking the way,\nor whether there is a sidewalk at all. These details populate different\ndatasets in many modern municipalities, but they are not immediately available\nin a convenient, integrated format to be useful to people with limited\nmobility. Our project, AccessMap, in its first phase (v.1) overlayed the\ninformation that is most relevant to people with limited mobility on a map,\nenabling self-planning of routes. Here, we describe the next phase of the\nproject: synthesizing commonly available open data (including streets,\nsidewalks, curb ramps, elevation data, and construction permit information) to\ngenerate a graph of paths to enable variable cost-function accessible routing.\n", "versions": [{"version": "v1", "created": "Sat, 13 Feb 2016 03:42:17 GMT"}], "update_date": "2016-02-16", "authors_parsed": [["Bolten", "Nicholas", ""], ["Amini", "Amirhossein", ""], ["Hao", "Yun", ""], ["Ravichandran", "Vaishnavi", ""], ["Stephens", "Andre", ""], ["Caspi", "Anat", ""]]}, {"id": "1602.04529", "submitter": "Jonathan Vitale", "authors": "Jonathan Vitale, Mary-Anne Williams, Benjamin Johnston", "title": "Socially Impaired Robots: Human Social Disorders and Robots'\n  Socio-Emotional Intelligence", "comments": "International Conference on Social Robotics 2014", "journal-ref": null, "doi": "10.1007/978-3-319-11973-1_36", "report-no": null, "categories": "cs.RO cs.CY cs.HC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Social robots need intelligence in order to safely coexist and interact with\nhumans. Robots without functional abilities in understanding others and unable\nto empathise might be a societal risk and they may lead to a society of\nsocially impaired robots. In this work we provide a survey of three relevant\nhuman social disorders, namely autism, psychopathy and schizophrenia, as a\nmeans to gain a better understanding of social robots' future capability\nrequirements. We provide evidence supporting the idea that social robots will\nrequire a combination of emotional intelligence and social intelligence, namely\nsocio-emotional intelligence. We argue that a robot with a simple\nsocio-emotional process requires a simulation-driven model of intelligence.\nFinally, we provide some critical guidelines for designing future\nsocio-emotional robots.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2016 00:06:34 GMT"}], "update_date": "2016-05-04", "authors_parsed": [["Vitale", "Jonathan", ""], ["Williams", "Mary-Anne", ""], ["Johnston", "Benjamin", ""]]}, {"id": "1602.04620", "submitter": "Benson Makori Onywoki Mr", "authors": "Benson M. Onywoki and Elisha T. Opiyo", "title": "A Framework for the Adoption of Biometric ATM Authentication in the\n  Kenyan Banks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The use of ATMs has become fundamental in the banking industry owing to the\nvalues transacted using these systems and their 24/7 usage. Although several\nresearchers have studied the role of biometrics in security applications for\nfinancial institutions, no systematic empirical research has been applied to\nstudying the role of organizational characteristics and contextual factors in\nthe Kenyan financial sector. This study sought to develop a framework for the\nadoption of biometric ATMs in the Kenyan banking sector, apply the developed\nframework to study factors influencing adoption of biometric ATM authentication\nand validate the developed conceptual framework. A survey was used to collect\nquantitative data from the ATM users which was then analysed using factor\nanalysis and multiple regression analysis. The study established that\nperformance expectancy, effort expectancy, social influence and user privacy\nwere key determinants for biometric ATMs acceptance, adoption and usage. The\nstudy further demonstrated that age, gender and experience were moderating\nfactors on effort expectancy with experience further moderating performance\nexpectancy, effort expectancy, social influence and user privacy. Key words:\nKey words: framework, adoption, authentication, financial institutions\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2016 10:50:35 GMT"}], "update_date": "2016-02-16", "authors_parsed": [["Onywoki", "Benson M.", ""], ["Opiyo", "Elisha T.", ""]]}, {"id": "1602.04713", "submitter": "Subarna Basnet", "authors": "Subarna Basnet and Christopher L. Magee", "title": "Modeling of technological performance trends using design theory", "comments": "43 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Functional technical performance usually follows an exponential dependence on\ntime but the rate of change (the exponent) varies greatly among technological\ndomains. This paper presents a simple model that provides an explanatory\nfoundation for these phenomena based upon the inventive design process.\n  The model assumes that invention - novel and useful design- arises through\nprobabilistic analogical transfers that combine existing knowledge by combining\nexisting individual operational ideas to arrive at new individual operating\nideas. The continuing production of individual operating ideas relies upon\ninjection of new basic individual operating ideas that occurs through coupling\nof science and technology simulations.\n  The individual operational ideas that result from this process are then\nmodeled as being assimilated in components of artifacts characteristic of a\ntechnological domain. According to the model, two effects (differences in\ninteractions among components for different domains and differences in scaling\nlaws for different domains) account for the differences found in improvement\nrates among domains whereas the analogical transfer process is the source of\nthe exponential behavior. The model is supported by a number of known empirical\nfacts: further empirical research is suggested to independently assess further\npredictions made by the model.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2016 01:44:54 GMT"}], "update_date": "2016-02-16", "authors_parsed": [["Basnet", "Subarna", ""], ["Magee", "Christopher L.", ""]]}, {"id": "1602.04878", "submitter": "Clayton Davis", "authors": "Clayton A Davis, Julia Heiman, Erick Janssen, Stephanie Sanders,\n  Justin Garcia, Filippo Menczer", "title": "Kinsey Reporter: Citizen Science for Sex Research", "comments": "Let's Talk About Sex (Apps) Workshop at CSCW 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Kinsey Reporter is a global mobile app to share, explore, and visualize\nanonymous data about sex. Reports are submitted via smartphone, then visualized\non a website or downloaded for offline analysis. In this paper we present the\nmajor features of the Kinsey Reporter citizen science platform designed to\npreserve the anonymity of its contributors, and preliminary data analyses that\nsuggest questions for future research.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 01:07:32 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Davis", "Clayton A", ""], ["Heiman", "Julia", ""], ["Janssen", "Erick", ""], ["Sanders", "Stephanie", ""], ["Garcia", "Justin", ""], ["Menczer", "Filippo", ""]]}, {"id": "1602.05067", "submitter": "Miran Baban", "authors": "Mahdi Mohammed Younis, Miran Hikmat Mohammed Baban", "title": "Skill Evaluation for Newly Graduated Students Via Online Test", "comments": "Article Published in International Journal of Advanced Computer\n  Science and Applications(IJACSA), Volume 6 Issue 9, 2015", "journal-ref": null, "doi": "10.14569/IJACSA.2015.060937", "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Every year in each university many students are graduated holding a first\nuniversity degree. For example Bachelor degree in Computer Science. Most of\nthose students have a motivation to continue with further studies to get higher\neducation level degree in universities. However, some other students may have\nenthusiasm towards working based on their skills that they got during their\nlife of studies in university. In both cases, it is required that applicant\nmust pass a test that comprise the entire subject that they learned before. For\nthis reasons, this research is proposing a new technique to evaluate graduate\nstudents skills.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 16:03:01 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Younis", "Mahdi Mohammed", ""], ["Baban", "Miran Hikmat Mohammed", ""]]}, {"id": "1602.05109", "submitter": "Chakib Tadj", "authors": "Somia Belaidouni, Moeiz Miraoui, Chakib Tadj", "title": "Towards an Efficient Smart Space Architecture", "comments": null, "journal-ref": "International Journal of Advanced Studies in Computer Science and\n  Engineering, IJASCSE, Volume 5, Issue 1, 2016", "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A smart space offers entirely new opportunities for end users by adapting\nservices accordingly to make life easy. A number of architectural designs have\nbeen proposed to design context awareness systems and adaptation behavior.\nHowever, the quality of the system depends on the degree of satisfaction of the\ninitials needs. In this paper, we discuss three main indicators of quality\ndesign for smart spaces that are strongly related to the context modules and\nreasoning process: functionality, reusability and changeability. A general\nlayered architecture system is presented to define the principal components\nthat should constitute any context aware adaptive system.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2016 16:45:10 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Belaidouni", "Somia", ""], ["Miraoui", "Moeiz", ""], ["Tadj", "Chakib", ""]]}, {"id": "1602.05142", "submitter": "Lawrence Wai Lawrence Wai", "authors": "Larry Wai", "title": "Data Science at Udemy: Agile Experimentation with Algorithms", "comments": "6 pages, submitted to KDD 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we describe the data science framework at Udemy, which\ncurrently supports the recommender and search system. We explain the\nmotivations behind the framework and review the approach, which allows multiple\nindividual data scientists to all become 'full stack', taking control of their\nown destinies from the exploration and research phase, through algorithm\ndevelopment, experiment setup, and deep experiment analytics. We describe\nalgorithms tested and deployed in 2015, as well as some key insights obtained\nfrom experiments leading to the launch of the new recommender system at Udemy.\nFinally, we outline the current areas of research, which include search,\npersonalization, and algorithmic topic generation.\n", "versions": [{"version": "v1", "created": "Sat, 13 Feb 2016 15:43:19 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Wai", "Larry", ""]]}, {"id": "1602.05163", "submitter": "K. Eric Harper", "authors": "K. Eric Harper, Thijmen de Gooijer, Karen Smiley", "title": "Composable Industrial Internet Applications for Tiered Architectures", "comments": "10 pages, 10 figures, 30 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A single vendor cannot provide complete IIoT end-to-end solutions because\ncooperation is required from multiple parties. Interoperability is a key\narchitectural quality. Composability of capabilities, information and\nconfiguration is the prerequisite for interoperability, supported by a data\nstorage infrastructure and defined set of interfaces to build applications.\nSecure collection, transport and storage of data and algorithms are\nexpectations for collaborative participation in any IIoT solution. Participants\nrequire control of their data ownership and confidentiality. We propose an\nInternet of Things, Services and People (IoTSP) application development and\nmanagement framework which includes components for data storage, algorithm\ndesign and packaging, and computation execution. Applications use clusters of\nplatform services, organized in tiers, and local access to data to reduce\ncomplexity and enhance reliable data exchange. Since communication is less\nreliable across tiers, data is synchronized between storage replicas when\ncommunication is available. The platform services provide a common ecosystem to\nexchange data uniting data storage, applications, and components that process\nthe data. Configuration and orchestration of the tiers are managed using shared\ntools and facilities. The platform promotes the data storage components to be\npeers of the applications where each data owner is in control of when and how\nmuch information is shared with a service provider. The service components and\napplications are securely integrated using local event and data exchange\ncommunication channels. This tiered architecture reduces the cyber attack\nsurface and enables individual tiers to operate autonomously, while addressing\ninteroperability concerns. We present our framework using predictive\nmaintenance as an example, and evaluate compatibility of our vision with an\nemerging set of standards.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 20:16:17 GMT"}], "update_date": "2016-02-22", "authors_parsed": [["Harper", "K. Eric", ""], ["de Gooijer", "Thijmen", ""], ["Smiley", "Karen", ""]]}, {"id": "1602.05170", "submitter": "Maria Spichkova", "authors": "Maria Spichkova", "title": "Applied Logic in Engineering", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Logic not only helps to solve complicated and safety-critical problems, but\nalso disciplines the mind and helps to develop abstract thinking, which is very\nimportant for any area of Engineering. In this technical report, we present an\noverview of common challenges in teaching of formal methods and discuss our\nexperiences from the course Applied Logic in Engineering. This course was\ntaught at TU Munich, Germany, in Winter Semester 2012/2013.\n", "versions": [{"version": "v1", "created": "Tue, 9 Feb 2016 11:47:33 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Spichkova", "Maria", ""]]}, {"id": "1602.05559", "submitter": "Omar  Alzubi", "authors": "Hassan Hamdoun, Jafar A. Alzubi, Omar A. Alzubi and Solomon Mangeni", "title": "Key Economic and Environmental Perspectives on Sustainability in the ICT\n  Sector", "comments": "5 pages, 4 figures, Journal paper", "journal-ref": "Middle-East Journal of Scientific Research 21 (8): 1341-1345, 2014", "doi": "10.5829/idosi.mejsr.2014.21.08.21709", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Telecommunication networks have become as critical to the 21st century\ndevelopment as were railways, roads and canals, to the 19th Century\ndevelopments and is now seen as enabler to a more sustained business,\nenvironment and society as a whole. Still fascinating has been and is the\nexponential rate of growth in this industry. This is one sector where the next\nrevolution is always just around the corner whether known or unknown. The\ntelecoms industry is categorized by high rates of innovation in a rapidly\nchanging technological environment. This in turn is associated with an immense\nrange of sustainability concerns and challenges for the Telecoms service\nproviders, the service users and the whole industry and its far reaching\ninfluence on other industries. This paper discusses three key aspects of such\nchallenges namely; the question of sustainable power/energy supply for the\nindustry when the change is resulting in increasing energy and operational\ncost, the exploitation of technologies advancement for sustainability and their\nbusiness and environmental benefits.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2016 20:14:20 GMT"}], "update_date": "2016-02-18", "authors_parsed": [["Hamdoun", "Hassan", ""], ["Alzubi", "Jafar A.", ""], ["Alzubi", "Omar A.", ""], ["Mangeni", "Solomon", ""]]}, {"id": "1602.06091", "submitter": "Mark Burgess", "authors": "Mark Burgess", "title": "On the scaling of functional spaces, from smart cities to cloud\n  computing", "comments": "Physics and Society (physics.soc-ph)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The study of spacetime, and its role in understanding functional systems has\nreceived little attention in information science. Recent work, on the origin of\nuniversal scaling in cities and biological systems, provides an intriguing\ninsight into the functional use of space, and its measurable effects. Cities\nare large information systems, with many similarities to other technological\ninfrastructures, so the results shed new light indirectly on the scaling the\nexpected behaviour of smart pervasive infrastructures and the communities that\nmake use of them.\n  Using promise theory, I derive and extend the scaling laws for cities to\nexpose what may be extrapolated to technological systems. From the promise\nmodel, I propose an explanation for some anomalous exponents in the original\nwork, and discuss what changes may be expected due to technological\nadvancement.\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2016 09:51:48 GMT"}], "update_date": "2016-02-22", "authors_parsed": [["Burgess", "Mark", ""]]}, {"id": "1602.06510", "submitter": "Rajasekar Ramalingam", "authors": "Rajasekar Ramalingam, Shimaz Khan, Shameer Mohammed", "title": "The need for effective information security awareness practices in Oman\n  higher educational institutions", "comments": "1st Symposium on Communication, Information Technology and\n  Biotechnology: Current Trends and Future Scope, Sur College of Applied\n  Sciences, Ministry of Higher education, Sultanate of Oman, 12th and 13th May,\n  2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  The revolution of internet technology and its usage have led a significant\nincrease in the number of online transactions and electronic data transfer,\nparallely increased the number of cybercrime incidents around the world. Steady\neconomic growth in the Sultanate of Oman accelerated the volume of online\nutilization for e-commerce, banking, communication, education and so forth.\nNormally attackers target the users who ignore security practices due to the\nlack of information security awareness. Unawareness of information security\npractices, user negligence, lack of awareness programs and trainings are the\nroot cause for information security threats. Earlier studies reveal there is a\nconsiderable and continuous cybercrime incident in Oman which compromises the\nsecurity policy of the organizations, affecting the business continuity and the\neconomic growth. In this study, a survey was performed among the educational\ninstitutions in Oman to investigate the level of information security awareness\nand based on the study, a security awareness model is proposed to enable\ninformation security practices in the educational institutions.\n", "versions": [{"version": "v1", "created": "Sun, 21 Feb 2016 08:02:30 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Ramalingam", "Rajasekar", ""], ["Khan", "Shimaz", ""], ["Mohammed", "Shameer", ""]]}, {"id": "1602.06700", "submitter": "Maurits Kaptein", "authors": "Jules Kruijswijk, Robin van Emden, Petri Parvinen, Maurits Kaptein", "title": "StreamingBandit; Experimenting with Bandit Policies", "comments": "47 pages, 15 figures, accepted for publication in Journal of\n  Statistical Software (JSS)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A large number of statistical decision problems in the social sciences and\nbeyond can be framed as a (contextual) multi-armed bandit problem. However, it\nis notoriously hard to develop and evaluate policies that tackle these types of\nproblem, and to use such policies in applied studies. To address this issue,\nthis paper introduces StreamingBandit, a Python web application for developing\nand testing bandit policies in field studies. StreamingBandit can sequentially\nselect treatments using (online) policies in real time. Once StreamingBandit is\nimplemented in an applied context, different policies can be tested, altered,\nnested, and compared. StreamingBandit makes it easy to apply a multitude of\nbandit policies for sequential allocation in field experiments, and allows for\nthe quick development and re-use of novel policies. In this article, we detail\nthe implementation logic of StreamingBandit and provide several examples of its\nuse.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2016 09:37:24 GMT"}, {"version": "v2", "created": "Tue, 4 Sep 2018 09:54:07 GMT"}], "update_date": "2018-09-05", "authors_parsed": [["Kruijswijk", "Jules", ""], ["van Emden", "Robin", ""], ["Parvinen", "Petri", ""], ["Kaptein", "Maurits", ""]]}, {"id": "1602.06703", "submitter": "Alexis Jacq David", "authors": "Alexis Jacq, Wafa Johal, Pierre Dillenbourg, Ana Paiva", "title": "Cognitive Architecture for Mutual Modelling", "comments": "Presented at \"2nd Workshop on Cognitive Architectures for Social\n  Human-Robot Interaction 2016 (arXiv:1602.01868)", "journal-ref": null, "doi": null, "report-no": "CogArch4sHRI/2016/07", "categories": "cs.RO cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In social robotics, robots needs to be able to be understood by humans.\nEspecially in collaborative tasks where they have to share mutual knowledge.\nFor instance, in an educative scenario, learners share their knowledge and they\nmust adapt their behaviour in order to make sure they are understood by others.\nLearners display behaviours in order to show their understanding and teachers\nadapt in order to make sure that the learners' knowledge is the required one.\nThis ability requires a model of their own mental states perceived by others:\n\\textit{\"has the human understood that I(robot) need this object for the task\nor should I explain it once again ?\"} In this paper, we discuss the importance\nof a cognitive architecture enabling second-order Mutual Modelling for\nHuman-Robot Interaction in educative contexts.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2016 09:47:04 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Jacq", "Alexis", ""], ["Johal", "Wafa", ""], ["Dillenbourg", "Pierre", ""], ["Paiva", "Ana", ""]]}, {"id": "1602.06871", "submitter": "Leon Abdillah", "authors": "Intan Okta Sari, Leon Andretti Abdillah, Kiky Rizky Nova Wardhani", "title": "Application Location Based Service (LBS) Location Search Palembang\n  Nature-Based Android", "comments": "The 5th International Conference on Information Technology and\n  Engineering Application (ICIBA2016), Paper presented at the The 5th\n  ICIBA2016, Bina Darma University, Palembang", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the development of information systems to make the operating system more\ndiverse mobile devices, the emergence of the Android operating system that is\nopen allows users to search for and acquire various information easily and\nquickly. Application Search Nature Places is an application that can help bring\ninformation on nearby Places Nature is all around. Can be used in the Android\nOperating System and Global Positioning System (GPS). To be able to use this\napplication, users must be connected to the Internet because it requires data\ntaken from Google Maps. The main facilities contained in this application is a\nfeature that makes it Map and Route users in finding the intended location.\nWith the LBS application is expected to provide information that is accurate,\nclear and precise to determine location points Nature Palembang, and can\nfacilitate local and foreign tourists and the public, especially the city of\nPalembang.\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2016 08:30:18 GMT"}], "update_date": "2016-02-23", "authors_parsed": [["Sari", "Intan Okta", ""], ["Abdillah", "Leon Andretti", ""], ["Wardhani", "Kiky Rizky Nova", ""]]}, {"id": "1602.06963", "submitter": "Pratim Sengupta", "authors": "Amy Voss Farris, Amanda Catherine Dickes, Pratim Sengupta", "title": "Development of Disciplined Interpretation Using Computational Modeling\n  in the Elementary Science Classroom", "comments": "in Proceedings of the 12th International Conference of the Learning\n  Sciences (ICLS 2016)", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.ed-ph cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Studies of scientists building models show that the development of scientific\nmodels involves a great deal of subjectivity. However, science as experienced\nin school settings typically emphasizes an overly objective and rationalistic\nview. In this paper, we argue for focusing on the development of disciplined\ninterpretation as an epistemic and representational practice that progressively\ndeepens students' computational modeling in science by valuing, rather than\ndeemphasizing, the subjective nature of the experience of modeling. We report\nresults from a study in which fourth grade children engaged in computational\nmodeling throughout the academic year. We present three salient themes that\ncharacterize the development of students' disciplined interpretations in terms\nof their development of computational modeling as a way of seeing and doing\nscience.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2016 21:07:35 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Farris", "Amy Voss", ""], ["Dickes", "Amanda Catherine", ""], ["Sengupta", "Pratim", ""]]}, {"id": "1602.07029", "submitter": "Siddharth Reddy", "authors": "Siddharth Reddy, Igor Labutov, Thorsten Joachims", "title": "Latent Skill Embedding for Personalized Lesson Sequence Recommendation", "comments": "Under review by the ACM SIGKDD Conference on Knowledge Discovery and\n  Data Mining", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Students in online courses generate large amounts of data that can be used to\npersonalize the learning process and improve quality of education. In this\npaper, we present the Latent Skill Embedding (LSE), a probabilistic model of\nstudents and educational content that can be used to recommend personalized\nsequences of lessons with the goal of helping students prepare for specific\nassessments. Akin to collaborative filtering for recommender systems, the\nalgorithm does not require students or content to be described by features, but\nit learns a representation using access traces. We formulate this problem as a\nregularized maximum-likelihood embedding of students, lessons, and assessments\nfrom historical student-content interactions. An empirical evaluation on\nlarge-scale data from Knewton, an adaptive learning technology company, shows\nthat this approach predicts assessment results competitively with benchmark\nmodels and is able to discriminate between lesson sequences that lead to\nmastery and failure.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2016 04:20:40 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Reddy", "Siddharth", ""], ["Labutov", "Igor", ""], ["Joachims", "Thorsten", ""]]}, {"id": "1602.07032", "submitter": "Siddharth Reddy", "authors": "Siddharth Reddy, Igor Labutov, Siddhartha Banerjee, Thorsten Joachims", "title": "Unbounded Human Learning: Optimal Scheduling for Spaced Repetition", "comments": "Accepted to the ACM SIGKDD Conference on Knowledge Discovery and Data\n  Mining 2016", "journal-ref": null, "doi": "10.1145/2939672.2939850", "report-no": null, "categories": "cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the study of human learning, there is broad evidence that our ability to\nretain information improves with repeated exposure and decays with delay since\nlast exposure. This plays a crucial role in the design of educational software,\nleading to a trade-off between teaching new material and reviewing what has\nalready been taught. A common way to balance this trade-off is spaced\nrepetition, which uses periodic review of content to improve long-term\nretention. Though spaced repetition is widely used in practice, e.g., in\nelectronic flashcard software, there is little formal understanding of the\ndesign of these systems. Our paper addresses this gap in three ways. First, we\nmine log data from spaced repetition software to establish the functional\ndependence of retention on reinforcement and delay. Second, we use this memory\nmodel to develop a stochastic model for spaced repetition systems. We propose a\nqueueing network model of the Leitner system for reviewing flashcards, along\nwith a heuristic approximation that admits a tractable optimization problem for\nreview scheduling. Finally, we empirically evaluate our queueing model through\na Mechanical Turk experiment, verifying a key qualitative prediction of our\nmodel: the existence of a sharp phase transition in learning outcomes upon\nincreasing the rate of new item introductions.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2016 04:33:05 GMT"}, {"version": "v2", "created": "Wed, 8 Jun 2016 02:22:16 GMT"}], "update_date": "2016-06-09", "authors_parsed": [["Reddy", "Siddharth", ""], ["Labutov", "Igor", ""], ["Banerjee", "Siddhartha", ""], ["Joachims", "Thorsten", ""]]}, {"id": "1602.07057", "submitter": "Bowen Zhou", "authors": "Bowen Zhou, Shahriar Shariat", "title": "Finding Needle in a Million Metrics: Anomaly Detection in a Large-scale\n  Computational Advertising Platform", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online media offers opportunities to marketers to deliver brand messages to a\nlarge audience. Advertising technology platforms enables the advertisers to\nfind the proper group of audiences and deliver ad impressions to them in real\ntime. The recent growth of the real time bidding has posed a significant\nchallenge on monitoring such a complicated system. With so many components we\nneed a reliable system that detects the possible changes in the system and\nalerts the engineering team. In this paper we describe the mechanism that we\ninvented for recovering the representative metrics and detecting the change in\ntheir behavior. We show that this mechanism is able to detect the possible\nproblems in time by describing some incident cases.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2016 07:07:26 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Zhou", "Bowen", ""], ["Shariat", "Shahriar", ""]]}, {"id": "1602.07185", "submitter": "Ingmar Weber", "authors": "Ingmar Weber and Yelena Mejova", "title": "Crowdsourcing Health Labels: Inferring Body Weight from Profile Pictures", "comments": "This is a preprint of an article appearing at ACM DigitalHealth 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To use social media for health-related analysis, one key step is the\ndetection of health-related labels for users. But unlike transient conditions\nlike flu, social media users are less vocal about chronic conditions such as\nobesity, as users might not tweet \"I'm still overweight\". As, however,\nobesity-related conditions such as diabetes, heart disease, osteoarthritis, and\neven cancer are on the rise, this obese-or-not label could be one of the most\nuseful for studies in public health.\n  In this paper we investigate the feasibility of using profile pictures to\ninfer if a user is overweight or not. We show that this is indeed possible and\nfurther show that the fraction of labeled-as-overweight users is higher in U.S.\ncounties with higher obesity rates. Going from public to individual health\nanalysis, we then find differences both in behavior and social networks, for\nexample finding users labeled as overweight to have fewer followers.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2016 15:07:02 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Weber", "Ingmar", ""], ["Mejova", "Yelena", ""]]}, {"id": "1602.07199", "submitter": "Taha Yasseri", "authors": "Aslak Wegner Eide, J. Brian Pickering, Taha Yasseri, George Bravos,\n  Asbj{\\o}rn F{\\o}lstad, Vegard Engen, Milena Tsvetkova, Eric T. Meyer, Paul\n  Walland, Marika L\\\"uders", "title": "Human-Machine Networks: Towards a Typology and Profiling Framework", "comments": "Pre-print; To be presented at the 18th International Conference on\n  Human-Computer Interaction International, Toronto, Canada, 17 - 22 July 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we outline an initial typology and framework for the purpose of\nprofiling human-machine networks, that is, collective structures where humans\nand machines interact to produce synergistic effects. Profiling a human-machine\nnetwork along the dimensions of the typology is intended to facilitate access\nto relevant design knowledge and experience. In this way the profiling of an\nenvisioned or existing human-machine network will both facilitate relevant\ndesign discussions and, more importantly, serve to identify the network type.\nWe present experiences and results from two case trials: a crisis management\nsystem and a peer-to-peer reselling network. Based on the lessons learnt from\nthe case trials we suggest potential benefits and challenges, and point out\nneeded future work.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2016 15:34:59 GMT"}, {"version": "v2", "created": "Tue, 1 Mar 2016 16:48:20 GMT"}], "update_date": "2016-03-02", "authors_parsed": [["Eide", "Aslak Wegner", ""], ["Pickering", "J. Brian", ""], ["Yasseri", "Taha", ""], ["Bravos", "George", ""], ["Følstad", "Asbjørn", ""], ["Engen", "Vegard", ""], ["Tsvetkova", "Milena", ""], ["Meyer", "Eric T.", ""], ["Walland", "Paul", ""], ["Lüders", "Marika", ""]]}, {"id": "1602.07388", "submitter": "Keith Burghardt", "authors": "Keith Burghardt, Emanuel F. Alsina, Michelle Girvan, William Rand, and\n  Kristina Lerman", "title": "The Myopia of Crowds: A Study of Collective Evaluation on Stack Exchange", "comments": "10 pages, 9 figures", "journal-ref": "PLoS ONE 12(3): e0173610", "doi": "10.1371/journal.pone.0173610", "report-no": null, "categories": "cs.HC cs.CY cs.LG physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Crowds can often make better decisions than individuals or small groups of\nexperts by leveraging their ability to aggregate diverse information. Question\nanswering sites, such as Stack Exchange, rely on the \"wisdom of crowds\" effect\nto identify the best answers to questions asked by users. We analyze data from\n250 communities on the Stack Exchange network to pinpoint factors affecting\nwhich answers are chosen as the best answers. Our results suggest that, rather\nthan evaluate all available answers to a question, users rely on simple\ncognitive heuristics to choose an answer to vote for or accept. These cognitive\nheuristics are linked to an answer's salience, such as the order in which it is\nlisted and how much screen space it occupies. While askers appear to depend\nmore on heuristics, compared to voting users, when choosing an answer to accept\nas the most helpful one, voters use acceptance itself as a heuristic: they are\nmore likely to choose the answer after it is accepted than before that very\nsame answer was accepted. These heuristics become more important in explaining\nand predicting behavior as the number of available answers increases. Our\nfindings suggest that crowd judgments may become less reliable as the number of\nanswers grow.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2016 03:55:15 GMT"}], "update_date": "2017-04-04", "authors_parsed": [["Burghardt", "Keith", ""], ["Alsina", "Emanuel F.", ""], ["Girvan", "Michelle", ""], ["Rand", "William", ""], ["Lerman", "Kristina", ""]]}, {"id": "1602.07662", "submitter": "Mikhail L. Kaluzhsky", "authors": "Mikhail Kaluzhsky", "title": "Features of formation of a distributive infrastructure of e-commerce in\n  Russia", "comments": "18 pages, in Russian. ISSN 2075-1826", "journal-ref": "Management and Business Administration. 2014. N 2. pp. 38-55", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Article about objective laws of formation of a distributive infrastructure of\ne-commerce. The distributive infrastructure of e-commerce, according to the\nauthor, plays an important role in formation of network economy. The author\nopens strategic value of institutional regulation of distributive logistics for\nthe decision problems of modernization of Russian economy.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jul 2015 18:40:17 GMT"}], "update_date": "2016-02-25", "authors_parsed": [["Kaluzhsky", "Mikhail", ""]]}, {"id": "1602.07810", "submitter": "Junaid Qadir", "authors": "Anwaar Ali, Junaid Qadir, Raihan ur Rasool, Arjuna Sathiaseelan,\n  Andrej Zwitter", "title": "Big Data For Development: Applications and Techniques", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the explosion of social media sites and proliferation of digital\ncomputing devices and Internet access, massive amounts of public data is being\ngenerated on a daily basis. Efficient techniques/ algorithms to analyze this\nmassive amount of data can provide near real-time information about emerging\ntrends and provide early warning in case of an imminent emergency (such as the\noutbreak of a viral disease). In addition, careful mining of these data can\nreveal many useful indicators of socioeconomic and political events, which can\nhelp in establishing effective public policies. The focus of this study is to\nreview the application of big data analytics for the purpose of human\ndevelopment. The emerging ability to use big data techniques for development\n(BD4D) promises to revolutionalize healthcare, education, and agriculture;\nfacilitate the alleviation of poverty; and help to deal with humanitarian\ncrises and violent conflicts. Besides all the benefits, the large-scale\ndeployment of BD4D is beset with several challenges due to the massive size,\nfast-changing and diverse nature of big data. The most pressing concerns relate\nto efficient data acquisition and sharing, establishing of context (e.g.,\ngeolocation and time) and veracity of a dataset, and ensuring appropriate\nprivacy. In this study, we provide a review of existing BD4D work to study the\nimpact of big data on the development of society. In addition to reviewing the\nimportant works, we also highlight important challenges and open issues.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2016 06:02:33 GMT"}], "update_date": "2016-02-26", "authors_parsed": [["Ali", "Anwaar", ""], ["Qadir", "Junaid", ""], ["Rasool", "Raihan ur", ""], ["Sathiaseelan", "Arjuna", ""], ["Zwitter", "Andrej", ""]]}, {"id": "1602.07813", "submitter": "Junaid Qadir", "authors": "Junaid Qadir, Anwaar Ali, Raihan ur Rasool, Andrej Zwitter, Arjuna\n  Sathiaseelan, Jon Crowcroft", "title": "Crisis Analytics: Big Data Driven Crisis Response", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Disasters have long been a scourge for humanity. With the advances in\ntechnology (in terms of computing, communications, and the ability to process\nand analyze big data), our ability to respond to disasters is at an inflection\npoint. There is great optimism that big data tools can be leveraged to process\nthe large amounts of crisis-related data (in the form of user generated data in\naddition to the traditional humanitarian data) to provide an insight into the\nfast-changing situation and help drive an effective disaster response. This\narticle introduces the history and the future of big crisis data analytics,\nalong with a discussion on its promise, challenges, and pitfalls.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2016 06:07:53 GMT"}], "update_date": "2016-02-26", "authors_parsed": [["Qadir", "Junaid", ""], ["Ali", "Anwaar", ""], ["Rasool", "Raihan ur", ""], ["Zwitter", "Andrej", ""], ["Sathiaseelan", "Arjuna", ""], ["Crowcroft", "Jon", ""]]}, {"id": "1602.08237", "submitter": "Vegard Engen", "authors": "Vegard Engen, J. Brian Pickering and Paul Walland", "title": "Machine Agency in Human-Machine Networks; Impacts and Trust Implications", "comments": "Pre-print; To be presented at the 18th International Conference on\n  Human-Computer Interaction International, Toronto, Canada, 17 - 22 July 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We live in an emerging hyper-connected era in which people are in contact and\ninteracting with an increasing number of other people and devices.\nIncreasingly, modern IT systems form networks of humans and machines that\ninteract with one another. As machines take a more active role in such\nnetworks, they exert an in-creasing level of influence on other participants.\nWe review the existing literature on agency and propose a definition of agency\nthat is practical for describing the capabilities and impact human and machine\nactors may have in a human-machine network. On this basis, we discuss and\ndemonstrate the impact and trust implica-tions for machine actors in\nhuman-machine networks for emergency decision support, healthcare and future\nsmart homes. We maintain that machine agency not only facilitates human to\nmachine trust, but also interpersonal trust; and that trust must develop to be\nable to seize the full potential of future technology.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2016 08:43:28 GMT"}], "update_date": "2016-02-29", "authors_parsed": [["Engen", "Vegard", ""], ["Pickering", "J. Brian", ""], ["Walland", "Paul", ""]]}, {"id": "1602.08388", "submitter": "Viktoras Veitas Mr.", "authors": "Viktoras Veitas and David Weinbaum (Weaver)", "title": "Living Cognitive Society: a `digital' World of Views", "comments": "Preprint: 29 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The current social reality is characterized by all-encompassing change, which\ndisrupts existing social structures at all levels. Yet the prevailing view of\nsociety is based on the ontological primacy of stable hierarchical structures,\nwhich is no longer adequate.\n  We propose a conceptual framework for thinking about a dynamically changing\nsocial system: the Living Cognitive Society. Importantly, we show how it\nfollows from a much broader philosophical framework, guided by the theory of\nindividuation, which emphasizes the importance of relationships and interactive\nprocesses in the evolution of a system.\n  The framework addresses society as a living cognitive system -- an ecology of\ninteracting social subsystems -- each of which is also a living cognitive\nsystem. We argue that this approach can help us to conceive sustainable social\nsystems that will thrive in the circumstances of accelerating change. The\nLiving Cognitive Society is explained in terms of its fluid structure, dynamics\nand the mechanisms at work. We then discuss the disruptive effects of\nInformation and Communication Technologies on the mechanisms at work.\n  We conclude by delineating a major topic for future research -- distributed\nsocial governance -- which focuses on processes of coordination rather than on\nstable structures within global society.\n", "versions": [{"version": "v1", "created": "Mon, 26 Oct 2015 23:47:12 GMT"}], "update_date": "2016-02-29", "authors_parsed": [["Veitas", "Viktoras", "", "Weaver"], ["Weinbaum", "David", "", "Weaver"]]}, {"id": "1602.08399", "submitter": "Mayla Alimam", "authors": "Mayla Alimam (UPMC, RS2M), Emmanuel Bertin, Noel Crespi (RS2M,\n  SAMOVAR)", "title": "Social and Collaborative Services for Organizations: Back to\n  Requirements", "comments": "The Spring Servitization Conference, May 2015, Birmingham, United\n  Kingdom", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social and collaborative services have widely spread within the enterprises\nas they play a part in improving productivity and business outcomes. However,\nthe deployment of these services fluctuates between success and failure. This\npaper intends to assess their deployment and how they can contribute to value\ncreation in different industries. We investigate the relationship between the\nservices' functionalities and the organizational requirement of these services\nrepresented by the coordination. We also consider the organizational\ntransformation driven by servitization and emphasize its impact on the act of\ncoordination. We highlight the tight correlation between the functionalities\nand the requirement in organic forms which suggests a successful deployment in\nsuch enterprises. We nonetheless find that, when the servitization is a\nstrategic intent in organizations with mechanistic characteristics, deploying\nsocial and collaborative services can contribute to achieving this aim.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jul 2015 06:54:00 GMT"}], "update_date": "2016-02-29", "authors_parsed": [["Alimam", "Mayla", "", "UPMC, RS2M"], ["Bertin", "Emmanuel", "", "RS2M,\n  SAMOVAR"], ["Crespi", "Noel", "", "RS2M,\n  SAMOVAR"]]}, {"id": "1602.08423", "submitter": "Muhammad Imran", "authors": "Muhammad Imran, Patrick Meier, Carlos Castillo, Andre Lesa, Manuel\n  Garcia Herranz", "title": "Enabling Digital Health by Automatic Classification of Short Messages", "comments": "Accepted at the ACM Digital Health Conference, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In response to the growing HIV/AIDS and other health-related issues, UNICEF\nthrough their U-Report platform receives thousands of messages (SMS) every day\nto provide prevention strategies, health case advice, and counsel- ing support\nto vulnerable population. Due to a rapid increase in U-Report usage (up to 300%\nin last 3 years), plus approximately 1,000 new registrations each day, the\nvolume of messages has thus continued to increase, which made it impossible for\nthe team at UNICEF to process them in a timely manner. In this paper, we\npresent a platform designed to perform automatic classification of short\nmessages (SMS) in real-time to help UNICEF categorize and prioritize\nhealth-related messages as they arrive. We employ a hybrid approach, which\ncombines human and machine intelligence that seeks to resolve the information\noverload issue by introducing processing of large-scale data at high-speed\nwhile maintaining a high classification accuracy. The system has recently been\ntested in conjunction with UNICEF in Zambia to classify short messages received\nvia the U-Report platform on various health related issues. The system is\ndesigned to enable UNICEF make sense of a large volume of short messages in a\ntimely manner. In terms of evaluation, we report design choices, challenges,\nand performance of the system observed during the deployment to validate its\neffectiveness.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2016 18:25:39 GMT"}], "update_date": "2016-02-29", "authors_parsed": [["Imran", "Muhammad", ""], ["Meier", "Patrick", ""], ["Castillo", "Carlos", ""], ["Lesa", "Andre", ""], ["Herranz", "Manuel Garcia", ""]]}, {"id": "1602.08777", "submitter": "Martin Strohmeier", "authors": "Martin Strohmeier, Matthias Sch\\\"afer, Rui Pinheiro, Vincent Lenders,\n  Ivan Martinovic", "title": "On Perception and Reality in Wireless Air Traffic Communications\n  Security", "comments": "20 pages, 5 figures, 7 tables", "journal-ref": null, "doi": "10.1109/TITS.2016.2612584", "report-no": null, "categories": "cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  More than a dozen wireless technologies are used by air traffic communication\nsystems during different flight phases. From a conceptual perspective, all of\nthem are insecure as security was never part of their design. Recent\ncontributions from academic and hacking communities have exploited this\ninherent vulnerability to demonstrate attacks on some of these technologies.\nHowever, not all of these contributions have resonated widely within aviation\ncircles. At the same time, the security community lacks certain aviation domain\nknowledge, preventing aviation authorities from giving credence to their\nfindings.\n  In this paper, we aim to reconcile the view of the security community and the\nperspective of aviation professionals concerning the safety of air traffic\ncommunication technologies. To achieve this, we first provide a systematization\nof the applications of wireless technologies upon which civil aviation relies.\nBased on these applications, we comprehensively analyze vulnerabilities,\nattacks, and countermeasures. We categorize the existing research on\ncountermeasures into approaches that are applicable in the short term and\nresearch of secure new technologies deployable in the long term.\n  Since not all of the required aviation knowledge is codified in academic\npublications, we additionally examine existing aviation standards and survey\n242 international aviation experts. Besides their domain knowledge, we also\nanalyze the awareness of members of the aviation community concerning the\nsecurity of wireless systems and collect their expert opinions on the potential\nimpact of concrete attack scenarios using these technologies.\n", "versions": [{"version": "v1", "created": "Sun, 28 Feb 2016 22:25:20 GMT"}, {"version": "v2", "created": "Tue, 1 Mar 2016 15:26:03 GMT"}, {"version": "v3", "created": "Mon, 24 Oct 2016 17:00:40 GMT"}], "update_date": "2016-11-21", "authors_parsed": [["Strohmeier", "Martin", ""], ["Schäfer", "Matthias", ""], ["Pinheiro", "Rui", ""], ["Lenders", "Vincent", ""], ["Martinovic", "Ivan", ""]]}, {"id": "1602.08979", "submitter": "R K Bisht", "authors": "Raj Kishor Bisht", "title": "A fuzzy based conceptual framework for career counselling", "comments": null, "journal-ref": "Advance Computational Intelligence: An international\n  Journal,(2015), Vol 2, No. 4, 27-35", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Career guidance for students, particularly in rural areas is a challenging\nissue in India. In the present era of digitalization, there is a need of an\nautomated system that can analyze a student for his/her capabilities, suggest a\ncareer and provide related information. Keeping in mind the requirement, the\npresent paper is an effort in this direction. In this paper, a fuzzy based\nconceptual framework has been suggested. It has two parts; in the first part a\nstudents will be analyzed for his/her capabilities and in the second part the\navailable courses, job aspects related to their capabilities will be suggested.\nTo analyze a student, marks in various subject in 10+2 standards and vocational\ninterest in different fields have been considered and fuzzy sets have been\nformed. On example basis, fuzzy inference rules have been framed for analyzing\nthe abilities in engineering, medical and hospitality fields only. In second\npart, concept of composition of relations has been used to suggest the related\ncourses and jobs.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2015 09:14:50 GMT"}], "update_date": "2016-03-01", "authors_parsed": [["Bisht", "Raj Kishor", ""]]}, {"id": "1602.09067", "submitter": "Michael Madaio", "authors": "Michael Madaio, Shang-Tse Chen, Oliver L. Haimson, Wenwen Zhang, Xiang\n  Cheng, Matthew Hinds-Aldrich, Duen Horng Chau, Bistra Dilkina", "title": "Firebird: Predicting Fire Risk and Prioritizing Fire Inspections in\n  Atlanta", "comments": "10 pages, 4 figures, submitted to KDD 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Atlanta Fire Rescue Department (AFRD), like many municipal fire\ndepartments, actively works to reduce fire risk by inspecting commercial\nproperties for potential hazards and fire code violations. However, AFRD's fire\ninspection practices relied on tradition and intuition, with no existing\ndata-driven process for prioritizing fire inspections or identifying new\nproperties requiring inspection. In collaboration with AFRD, we developed the\nFirebird framework to help municipal fire departments identify and prioritize\ncommercial property fire inspections, using machine learning, geocoding, and\ninformation visualization. Firebird computes fire risk scores for over 5,000\nbuildings in the city, with true positive rates of up to 71% in predicting\nfires. It has identified 6,096 new potential commercial properties to inspect,\nbased on AFRD's criteria for inspection. Furthermore, through an interactive\nmap, Firebird integrates and visualizes fire incidents, property information\nand risk scores to help AFRD make informed decisions about fire inspections.\nFirebird has already begun to make positive impact at both local and national\nlevels. It is improving AFRD's inspection processes and Atlanta residents'\nsafety, and was highlighted by National Fire Protection Association (NFPA) as a\nbest practice for using data to inform fire inspections.\n", "versions": [{"version": "v1", "created": "Mon, 29 Feb 2016 17:48:41 GMT"}], "update_date": "2016-03-01", "authors_parsed": [["Madaio", "Michael", ""], ["Chen", "Shang-Tse", ""], ["Haimson", "Oliver L.", ""], ["Zhang", "Wenwen", ""], ["Cheng", "Xiang", ""], ["Hinds-Aldrich", "Matthew", ""], ["Chau", "Duen Horng", ""], ["Dilkina", "Bistra", ""]]}]