[{"id": "0912.0071", "submitter": "Anand Sarwate", "authors": "Kamalika Chaudhuri, Claire Monteleoni, Anand D. Sarwate", "title": "Differentially Private Empirical Risk Minimization", "comments": "40 pages, 7 figures, accepted to the Journal of Machine Learning\n  Research", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.CR cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Privacy-preserving machine learning algorithms are crucial for the\nincreasingly common setting in which personal data, such as medical or\nfinancial records, are analyzed. We provide general techniques to produce\nprivacy-preserving approximations of classifiers learned via (regularized)\nempirical risk minimization (ERM). These algorithms are private under the\n$\\epsilon$-differential privacy definition due to Dwork et al. (2006). First we\napply the output perturbation ideas of Dwork et al. (2006), to ERM\nclassification. Then we propose a new method, objective perturbation, for\nprivacy-preserving machine learning algorithm design. This method entails\nperturbing the objective function before optimizing over classifiers. If the\nloss and regularizer satisfy certain convexity and differentiability criteria,\nwe prove theoretical results showing that our algorithms preserve privacy, and\nprovide generalization bounds for linear and nonlinear kernels. We further\npresent a privacy-preserving technique for tuning the parameters in general\nmachine learning algorithms, thereby providing end-to-end privacy guarantees\nfor the training process. We apply these results to produce privacy-preserving\nanalogues of regularized logistic regression and support vector machines. We\nobtain encouraging results from evaluating their performance on real\ndemographic and benchmark data sets. Our results show that both theoretically\nand empirically, objective perturbation is superior to the previous\nstate-of-the-art, output perturbation, in managing the inherent tradeoff\nbetween privacy and learning performance.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2009 04:35:44 GMT"}, {"version": "v2", "created": "Mon, 22 Feb 2010 19:33:44 GMT"}, {"version": "v3", "created": "Tue, 23 Feb 2010 05:26:22 GMT"}, {"version": "v4", "created": "Wed, 2 Jun 2010 23:16:36 GMT"}, {"version": "v5", "created": "Wed, 16 Feb 2011 22:35:55 GMT"}], "update_date": "2011-02-18", "authors_parsed": [["Chaudhuri", "Kamalika", ""], ["Monteleoni", "Claire", ""], ["Sarwate", "Anand D.", ""]]}, {"id": "0912.0453", "submitter": "Matthieu Finiasz", "authors": "Matthieu Finiasz", "title": "NP-completeness of Certain Sub-classes of the Syndrome Decoding Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of Syndrome Decoding was proven to be NP-complete in 1978 and,\nsince then, quite a few cryptographic applications have had their security rely\non the (provable) difficulty of solving some instances of it. However, in most\ncases, the instances to be solved follow some specific constraint: the target\nweight is a function of the dimension and length of the code. In these cases,\nis the Syndrome Decoding problem still NP-complete? This is the question that\nthis article intends to answer.\n", "versions": [{"version": "v1", "created": "Wed, 2 Dec 2009 16:07:32 GMT"}], "update_date": "2009-12-03", "authors_parsed": [["Finiasz", "Matthieu", ""]]}, {"id": "0912.0578", "submitter": "Rdv Ijcsis", "authors": "Li Fang, Maylor K.H. Leung, Cheng Shao Chian", "title": "Making Palm Print Matching Mobile", "comments": "9 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 001-009, November 2009, USA", "doi": null, "report-no": "ISSN 19475500", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the growing importance of personal identification and authentication in\ntodays highly advanced world where most business and personal tasks are being\nreplaced by electronic means, the need for a technology that is able to\nuniquely identify an individual and has high fraud resistance see the rise of\nbiometric technologies. Making biometric based solution mobile is a promising\ntrend. A new RST invariant square based palm print ROI extraction method was\nsuccessfully implemented and integrated into the current application suite. A\nnew set of palm print image database captured using embedded cameras in mobile\nphone was created to test its robustness. Comparing to those extraction methods\nthat are based on boundary tracking of the overall hand shape that has\nlimitation of being unable to process palm print images that has one or more\nfingers closed, the system can now effectively handle the segmentation of palm\nprint images with varying finger positioning. The high flexibility makes palm\nprint matching mobile possible.\n", "versions": [{"version": "v1", "created": "Thu, 3 Dec 2009 05:23:13 GMT"}], "update_date": "2009-12-04", "authors_parsed": [["Fang", "Li", ""], ["Leung", "Maylor K. H.", ""], ["Chian", "Cheng Shao", ""]]}, {"id": "0912.0580", "submitter": "Rdv Ijcsis", "authors": "Yunho Lee, Soojin Lee", "title": "A New Efficient Key Management Protocol for Wireless Sensor and Actor\n  Networks", "comments": "8 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 015-022, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Research on sensor networks has become much more active and is currently\nbeing applied to many different fields. However since sensor networks are\nlimited to only collecting and reporting information regarding a certain event,\nand requires human intervention with that given information, it is often\ndifficult to react to an event or situation immediately and proactively. To\novercome this kind of limitation, Wireless Sensor and Actor Networks (WSANs)\nwith immediate-response actor nodes have been proposed which adds greater\nmobility and activity to the existing sensor networks. Although WSANs share\nmany common grounds with sensor networks, it is difficult to apply existing\nsecurity technologies due to the fact that WSANs contain actor nodes that are\nresource-independent and mobile. Therefore, this research seeks to demonstrate\nways to provide security, integrity, and authentication services for WSANs\nsecure operation, by separating networks into hierarchical structure by each\nnode's abilities and provides different encryption key based secure protocols\nfor each level of hierarchy, Pairwise key, node key, and region key for sensor\nlevels, and public key for actor\n", "versions": [{"version": "v1", "created": "Thu, 3 Dec 2009 05:39:22 GMT"}], "update_date": "2009-12-04", "authors_parsed": [["Lee", "Yunho", ""], ["Lee", "Soojin", ""]]}, {"id": "0912.0597", "submitter": "Michael Huber", "authors": "Michael Huber", "title": "Constructing Optimal Authentication Codes with Perfect Multi-fold\n  Secrecy", "comments": "4 pages (double-column); to appear in Proc. 2010 International Zurich\n  Seminar on Communications (IZS 2010, Zurich)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish a construction of optimal authentication codes achieving perfect\nmulti-fold secrecy by means of combinatorial designs. This continues the\nauthor's work (ISIT 2009) and answers an open question posed therein. As an\napplication, we present the first infinite class of optimal codes that provide\ntwo-fold security against spoofing attacks and at the same time perfect two-\nfold secrecy.\n", "versions": [{"version": "v1", "created": "Thu, 3 Dec 2009 08:40:51 GMT"}], "update_date": "2009-12-04", "authors_parsed": [["Huber", "Michael", ""]]}, {"id": "0912.0607", "submitter": "Rdv Ijcsis", "authors": "P. Meenakshi Devi, M.Venkatesan, K.Duraiswamy", "title": "Reversible Image Authentication with Tamper Localization Based on\n  Integer Wavelet Transform", "comments": "8 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 067-074, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a new reversible image authentication technique with tamper\nlocalization based on watermarking in integer wavelet transform is proposed. If\nthe image authenticity is verified, then the distortion due to embedding the\nwatermark can be completely removed from the watermarked image. If the image is\ntampered, then the tampering positions can also be localized. Two layers of\nwatermarking are used. The first layer embedded in spatial domain verifies\nauthenticity and the second layer embedded in transform domain provides\nreversibility. This technique utilizes selective LSB embedding and histogram\ncharacteristics of the difference images of the wavelet coefficients and\nmodifies pixel values slightly to embed the watermark. Experimental results\ndemonstrate that the proposed scheme can detect any modifications of the\nwatermarked image.\n", "versions": [{"version": "v1", "created": "Thu, 3 Dec 2009 09:11:19 GMT"}], "update_date": "2009-12-04", "authors_parsed": [["Devi", "P. Meenakshi", ""], ["Venkatesan", "M.", ""], ["Duraiswamy", "K.", ""]]}, {"id": "0912.0759", "submitter": "EPTCS", "authors": "Filippo Bonchi (CWI, Netherland), Davide Grohmann (University of\n  Udine, Italy), Paola Spoletini (University of Insubria - Como, Italy), Emilio\n  Tuosto (University of Leicester, UK)", "title": "Proceedings 2nd Interaction and Concurrency Experience: Structured\n  Interactions", "comments": null, "journal-ref": "EPTCS 12, 2009", "doi": "10.4204/EPTCS.12", "report-no": null, "categories": "cs.LO cs.CR cs.DC cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 2nd Workshop on Interaction and\nConcurrency Experience (ICE'09). The workshop was held in Bologna, Italy on\n31th of August 2009, as a satellite workshop of CONCUR'09. The previous edition\nof ICE has been organized in Reykjavik (2008).\n  The ICE workshop is intended as a series of international scientific meetings\noriented to researchers in various fields of theoretical computer science and,\neach year, the workshop focuses on a specific topic: ICE 2009 focused on\nstructured interactions meant as the class of synchronisations that go beyond\nthe \"simple\" point-to-point synchronisations (e.g., multicast or broadcast\nsynchronisations, even-notification based interactions, time dependent\ninteractions, distributed transactions,...).\n", "versions": [{"version": "v1", "created": "Thu, 3 Dec 2009 23:55:44 GMT"}], "update_date": "2009-12-07", "authors_parsed": [["Bonchi", "Filippo", "", "CWI, Netherland"], ["Grohmann", "Davide", "", "University of\n  Udine, Italy"], ["Spoletini", "Paola", "", "University of Insubria - Como, Italy"], ["Tuosto", "Emilio", "", "University of Leicester, UK"]]}, {"id": "0912.0942", "submitter": "Rdv Ijcsis", "authors": "Farnaz Towhidi, Maslin Masrom", "title": "A Survey on Recognition Based Graphical User Authentication Algorithms", "comments": "9 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 119-127, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, user authentication is one of the important topics in information\nsecurity. Strong textbased password schemes could provide with certain degree\nof security. However, the fact that strong passwords are difficult to memorize\noften leads their owners to write them down on papers or even save them in a\ncomputer file. Graphical authentication has been proposed as a possible\nalternative solution to textbased authentication, motivated particularly by the\nfact that humans can remember images better than text. In recent years, many\nnetworks, computer systems and Internet based environments try used graphical\nauthentication technique for their users authentication. All of graphical\npasswords have two different aspects which are usability and security.\nUnfortunately none of these algorithms were being able to cover both of these\naspects at the same time. In this paper, we described eight recognition based\nauthentication algorithms in terms of their drawbacks and attacks. In the next\nsection, the usability standards from ISO and the related attributes for\ngraphical user authentication usability are discussed. The related attack\npatterns for graphical user authentication security part are also discussed.\nFinally, a comparison table of all recognition based algorithms is presented\nbased on ISO and attack patterns standards.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2009 21:02:26 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Towhidi", "Farnaz", ""], ["Masrom", "Maslin", ""]]}, {"id": "0912.0947", "submitter": "Rdv Ijcsis", "authors": "Samir B. Patel, Shrikant N. Pradhan, Saumitra U. Ambegaokar", "title": "A novel approach for implementing Steganography with computing power\n  obtained by combining Cuda and Matlab", "comments": "5 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 133-137, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the current development of multiprocessor systems, strive for computing\ndata on such processor have also increased exponentially. If the multi core\nprocessors are not fully utilized, then even though we have the computing power\nthe speed is not available to the end users for their respective applications.\nIn accordance to this, the users or application designers also have to design\nnewer applications taking care of the computing infrastructure available\nwithin. Our approach is to use the CUDA (Compute Unified Device Architecture)\nas backend and MATLAB as the front end to design an application for\nimplementing steganography. Steganography is the term used for hiding\ninformation in the cover object like Image, Audio or Video data. As the\ncomputing required for multimedia data is much more than the text information,\nwe have been successful in implementing image Steganography with the help of\ntechnology for the next generation.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2009 21:12:22 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Patel", "Samir B.", ""], ["Pradhan", "Shrikant N.", ""], ["Ambegaokar", "Saumitra U.", ""]]}, {"id": "0912.0950", "submitter": "Rdv Ijcsis", "authors": "B N Lavanya, K B Raja and K R Venugopal", "title": "Fingerprint Verification based on Gabor Filter Enhancement", "comments": "7 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 138-144, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Human fingerprints are reliable characteristics for personnel identification\nas it is unique and persistence. A fingerprint pattern consists of ridges,\nvalleys and minutiae. In this paper we propose Fingerprint Verification based\non Gabor Filter Enhancement (FVGFE) algorithm for minutiae feature extraction\nand post processing based on 9 pixel neighborhood. A global feature extraction\nand fingerprints enhancement are based on Hong enhancement method which is\nsimultaneously able to extract local ridge orientation and ridge frequency. It\nis observed that the Sensitivity and Specificity values are better compared to\nthe existing algorithms.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2009 21:17:20 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Lavanya", "B N", ""], ["Raja", "K B", ""], ["Venugopal", "K R", ""]]}, {"id": "0912.0951", "submitter": "Rdv Ijcsis", "authors": "Arash Habibi Lashkari, Samaneh Farmand, Dr. Omar Bin Zakaria, Dr.\n  Rosli Saleh", "title": "Shoulder Surfing attack in graphical password authentication", "comments": "10 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 145-154, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information and computer security is supported largely by passwords which are\nthe principle part of the authentication process. The most common computer\nauthentication method is to use alphanumerical username and password which has\nsignificant drawbacks. To overcome the vulnerabilities of traditional methods,\nvisual or graphical password schemes have been developed as possible\nalternative solutions to text based scheme. A potential drawback of graphical\npassword schemes is that they are more vulnerable to shoulder surfing than\nconventional alphanumeric text passwords. When users input their passwords in a\npublic place, they may be at risk of attackers stealing their password. An\nattacker can capture a password by direct observation or by recording the\nindividuals authentication session. This is referred to as shouldersurfing and\nis a known risk, of special concern when authenticating in public places. In\nthis paper we will present a survey on graphical password schemes from 2005\ntill 2009 which are proposed to be resistant against shoulder surfing attacks.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2009 21:24:18 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Lashkari", "Arash Habibi", ""], ["Farmand", "Samaneh", ""], ["Zakaria", "Dr. Omar Bin", ""], ["Saleh", "Dr. Rosli", ""]]}, {"id": "0912.0954", "submitter": "Rdv Ijcsis", "authors": "Samir B. Patel and Shrikant N. Pradhan", "title": "An approach to secure highly confidential documents of any size in the\n  corporate or institutes having unsecured networks", "comments": "9 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 155-163, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the tremendous amount of computing because of the wide usage of internet\nit is observed that some user(s) are not able to manage their desktop with\nantivirus software properly installed. It is happening few times, that we allow\nour friends, students and colleagues to sit on our networked PC. Sometimes the\nuser is unaware of the situation that there workstations are unsecured and so\nsome one else could also be monitoring your flow of information and your most\nimportant data could go haywire, resulting into leakage of most confidential\ndata to unwanted or malicious user(s). Example of some such documents could be\nquestion papers designed by the faculty member by various universities. Now a\nday most of the universities are having the biggest threat about the question\npapers and many other confidential documents designed by their faculty members.\nWe in this paper present the solution to over come such a situation using the\nconcept of Steganography. Steganography is a technique through which one can\nhide information into some cover object. This technique, if used, in positive\ndirection could be of great help to solve such a problem and even other.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2009 21:46:32 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Patel", "Samir B.", ""], ["Pradhan", "Shrikant N.", ""]]}, {"id": "0912.0955", "submitter": "Rdv Ijcsis", "authors": "Nazmeen Bibi Boodoo, and R. K. Subramanian", "title": "Robust Multi biometric Recognition Using Face and Ear Images", "comments": "6 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 164-169, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study investigates the use of ear as a biometric for authentication and\nshows experimental results obtained on a newly created dataset of 420 images.\nImages are passed to a quality module in order to reduce False Rejection Rate.\nThe Principal Component Analysis (eigen ear) approach was used, obtaining 90.7\npercent recognition rate. Improvement in recognition results is obtained when\near biometric is fused with face biometric. The fusion is done at decision\nlevel, achieving a recognition rate of 96 percent.\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2009 21:51:03 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Boodoo", "Nazmeen Bibi", ""], ["Subramanian", "R. K.", ""]]}, {"id": "0912.0956", "submitter": "Rdv Ijcsis", "authors": "Rashid Sheikh, and Beerendra Kumar, Durgesh Kumar Mishra", "title": "Privacy Preserving k Secure Sum Protocol", "comments": "5 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 184-188, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Secure Multiparty Computation (SMC) allows parties to know the result of\ncooperative computation while preserving privacy of individual data. Secure sum\ncomputation is an important application of SMC. In our proposed protocols\nparties are allowed to compute the sum while keeping their individual data\nsecret with increased computation complexity for hacking individual data. In\nthis paper the data of individual party is broken into a fixed number of\nsegments. For increasing the complexity we have used the randomization\ntechnique with segmentation\n", "versions": [{"version": "v1", "created": "Fri, 4 Dec 2009 21:54:51 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Sheikh", "Rashid", ""], ["Kumar", "Beerendra", ""], ["Mishra", "Durgesh Kumar", ""]]}, {"id": "0912.1014", "submitter": "Rdv Ijcsis", "authors": "Shailendra Singh, Sanjay Silakari", "title": "An ensemble approach for feature selection of Cyber Attack Dataset", "comments": "6 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 297-302, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Feature selection is an indispensable preprocessing step when mining huge\ndatasets that can significantly improve the overall system performance.\nTherefore in this paper we focus on a hybrid approach of feature selection.\nThis method falls into two phases. The filter phase select the features with\nhighest information gain and guides the initialization of search process for\nwrapper phase whose output the final feature subset. The final feature subsets\nare passed through the Knearest neighbor classifier for classification of\nattacks. The effectiveness of this algorithm is demonstrated on DARPA KDDCUP99\ncyber attack dataset.\n", "versions": [{"version": "v1", "created": "Sat, 5 Dec 2009 13:15:08 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Singh", "Shailendra", ""], ["Silakari", "Sanjay", ""]]}, {"id": "0912.1017", "submitter": "Rdv Ijcsis", "authors": "Ismail A. Ismail, Nabawia A. ElRamly, Mohammed A. Abd-ElWahid, Passent\n  M. ElKafrawy and Mohammed M. Nasef", "title": "Genetic Programming Framework for Fingerprint Matching", "comments": "6 pages IEEE format, International Journal of Computer Science and\n  Information Security, IJCSIS November 2009, ISSN 1947 5500,\n  http://sites.google.com/site/ijcsis/", "journal-ref": "International Journal of Computer Science and Information\n  Security, IJCSIS, Vol. 6, No. 2, pp. 316-321, November 2009, USA", "doi": null, "report-no": "ISSN 1947 5500", "categories": "cs.CR cs.CV cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A fingerprint matching is a very difficult problem. Minutiae based matching\nis the most popular and widely used technique for fingerprint matching. The\nminutiae points considered in automatic identification systems are based\nnormally on termination and bifurcation points. In this paper we propose a new\ntechnique for fingerprint matching using minutiae points and genetic\nprogramming. The goal of this paper is extracting the mathematical formula that\ndefines the minutiae points.\n", "versions": [{"version": "v1", "created": "Sat, 5 Dec 2009 13:27:10 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Ismail", "Ismail A.", ""], ["ElRamly", "Nabawia A.", ""], ["Abd-ElWahid", "Mohammed A.", ""], ["ElKafrawy", "Passent M.", ""], ["Nasef", "Mohammed M.", ""]]}, {"id": "0912.1092", "submitter": "Amin Daneshmand Malayeri", "authors": "Amin Daneshmand Malayeri, Jalal Abdollahi", "title": "Modern Symmetric Cryptography methodologies and its applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, using cryptographic systems play an effective role in security and\nsafety technologies. One of the most applied kind of cryptography is Symmetric\nCryptography and its applications. New aspects of symmetric Cryptography\nmethodologies and applications has been presented by this paper. Security-based\nnetworks and some complex technologies such as RFID and parallel security\nsettings has been intro-duced by using Symmetric Cryptography is the main base\nof discussion in this paper. Designing an unique protocol for Symmetric\nCryptography in security networks elements is our focus. Reviewing benefits of\nusing these methodologies has been pre-sented and discussed in this paper.\n", "versions": [{"version": "v1", "created": "Sun, 6 Dec 2009 11:07:40 GMT"}], "update_date": "2009-12-08", "authors_parsed": [["Malayeri", "Amin Daneshmand", ""], ["Abdollahi", "Jalal", ""]]}, {"id": "0912.1155", "submitter": "Benjamin Rubinstein", "authors": "Adam Barth, Benjamin I. P. Rubinstein, Mukund Sundararajan, John C.\n  Mitchell, Dawn Song, Peter L. Bartlett", "title": "A Learning-Based Approach to Reactive Security", "comments": "22 pages, 4 figures; full version of paper to be published in\n  Financial Cryptography and Data Security 2010 (FC'10)", "journal-ref": null, "doi": "10.1007/978-3-642-14577-3_16", "report-no": null, "categories": "cs.CR cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the conventional wisdom that proactive security is superior to\nreactive security, we show that reactive security can be competitive with\nproactive security as long as the reactive defender learns from past attacks\ninstead of myopically overreacting to the last attack. Our game-theoretic model\nfollows common practice in the security literature by making worst-case\nassumptions about the attacker: we grant the attacker complete knowledge of the\ndefender's strategy and do not require the attacker to act rationally. In this\nmodel, we bound the competitive ratio between a reactive defense algorithm\n(which is inspired by online learning theory) and the best fixed proactive\ndefense. Additionally, we show that, unlike proactive defenses, this reactive\nstrategy is robust to a lack of information about the attacker's incentives and\nknowledge.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2009 01:45:32 GMT"}, {"version": "v2", "created": "Tue, 22 Dec 2009 04:36:44 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Barth", "Adam", ""], ["Rubinstein", "Benjamin I. P.", ""], ["Sundararajan", "Mukund", ""], ["Mitchell", "John C.", ""], ["Song", "Dawn", ""], ["Bartlett", "Peter L.", ""]]}, {"id": "0912.1585", "submitter": "Francesco Sica", "authors": "Francesco Sica", "title": "Factoring with Hints", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NT cs.CR math.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new deterministic factoring algorithm, which could be\ndescribed in the cryptographically fashionable term of \"factoring with hints\":\nwe show that, given the knowledge of the factorisations of\n$O(N^{1/3+\\epsilon})$ terms surrounding $N=pq$ product of two large primes, we\ncan recover deterministically $p$ and $q$ in $O(N^{1/3+\\epsilon})$ bit\noperations. Although this is slower than the current best factoring algorithms,\nthis method shows that the factorisations of close integers are related and\nthat consequently one can expect more results along this line of thought.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2009 20:58:03 GMT"}, {"version": "v2", "created": "Tue, 1 Nov 2011 19:29:01 GMT"}, {"version": "v3", "created": "Mon, 14 Nov 2011 11:01:56 GMT"}, {"version": "v4", "created": "Thu, 1 Mar 2012 02:27:55 GMT"}, {"version": "v5", "created": "Tue, 20 Sep 2016 13:09:07 GMT"}, {"version": "v6", "created": "Tue, 8 Aug 2017 05:47:51 GMT"}], "update_date": "2017-08-09", "authors_parsed": [["Sica", "Francesco", ""]]}, {"id": "0912.1815", "submitter": "Vishal Goyal", "authors": "Samaneh Rastegari, M. Iqbal Saripan and Mohd Fadlee A. Rasid", "title": "Detection of Denial of Service Attacks against Domain Name System Using\n  Neural Networks", "comments": "International Journal of Computer Science Issues, IJCSI Volume 6,\n  Issue 1, pp23-27, November 2009", "journal-ref": "S. Rastegari, M. I. Saripan and M. F. A. Rasid, \"Detection of\n  Denial of Service Attacks against Domain Name System Using Neural Networks\",\n  IJCSI, Volume 6, Issue 1, pp23-27, November 2009", "doi": null, "report-no": null, "categories": "cs.CR cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce an intrusion detection system for Denial of\nService (DoS) attacks against Domain Name System (DNS). Our system architecture\nconsists of two most important parts: a statistical preprocessor and a neural\nnetwork classifier. The preprocessor extracts required statistical features in\na shorttime frame from traffic received by the target name server. We compared\nthree different neural networks for detecting and classifying different types\nof DoS attacks. The proposed system is evaluated in a simulated network and\nshowed that the best performed neural network is a feed-forward backpropagation\nwith an accuracy of 99%.\n", "versions": [{"version": "v1", "created": "Wed, 9 Dec 2009 17:47:49 GMT"}], "update_date": "2009-12-10", "authors_parsed": [["Rastegari", "Samaneh", ""], ["Saripan", "M. Iqbal", ""], ["Rasid", "Mohd Fadlee A.", ""]]}, {"id": "0912.1918", "submitter": "Chengqing Li", "authors": "Chengqing Li, Kwok-Tung Lo", "title": "Optimal quantitative cryptanalysis of permutation-only multimedia\n  ciphers against plaintext attacks", "comments": "11 pages, 6 figures", "journal-ref": "Signal Processing, 2011", "doi": "10.1016/j.sigpro.2010.09.014", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, an image scrambling encryption algorithm of pixel bit based on\nchaos map was proposed. Considering the algorithm as a typical binary image\nscrambling/permutation algorithm exerting on plaintext of size $M\\times (8N)$,\nthis paper proposes a novel optimal method to break it with some\nknown/chosen-plaintexts. The spatial complexity and computational complexity of\nthe attack are only $O(32\\cdot MN)$ and $O(16\\cdot n_0\\cdot MN)$ respectively,\nwhere $n_0$ is the number of known/chosen-plaintexts used. The method can be\neasily extended to break any permutation-only encryption scheme exerting on\nplaintext of size $M\\times N$ and with $L$ different levels of values. The\ncorresponding spatial complexity and computational complexity are only $O(MN)$\nand $O(\\lceil\\log_L(MN)\\rceil \\cdot MN)$ respectively. In addition, some\nspecific remarks on the performance of the image scrambling encryption\nalgorithm are presented.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2009 06:05:57 GMT"}, {"version": "v2", "created": "Fri, 11 Dec 2009 15:02:45 GMT"}, {"version": "v3", "created": "Wed, 21 Sep 2016 15:12:52 GMT"}], "update_date": "2016-09-22", "authors_parsed": [["Li", "Chengqing", ""], ["Lo", "Kwok-Tung", ""]]}, {"id": "0912.1927", "submitter": "Jean-Francois Biasse", "authors": "Jean-Fran\\c{c}ois Biasse (LIX, INRIA Bordeaux - Sud-Ouest)", "title": "An L(1/3) algorithm for ideal class group and regulator computation in\n  certain number fields", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyse the complexity of the computation of the class group structure,\nregulator, and a system of fundamental units of a certain class of number\nfields. Our approach differs from Buchmann's, who proved a complexity bound of\nL(1/2,O(1)) when the discriminant tends to infinity with fixed degree. We\nachieve a subexponential complexity in O(L(1/3,O(1))) when both the\ndiscriminant and the degree of the extension tend to infinity by using\ntechniques due to Enge and Gaudry in the context of algebraic curves over\nfinite fields.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2009 07:33:15 GMT"}], "update_date": "2009-12-11", "authors_parsed": [["Biasse", "Jean-François", "", "LIX, INRIA Bordeaux - Sud-Ouest"]]}, {"id": "0912.2199", "submitter": "Andrea Gabrielli", "authors": "Mauro Conti, Roberto Di Pietro, Andrea Gabrielli, Luigi V. Mancini,\n  and Alessandro Mei", "title": "The Smallville Effect: Social Ties Make Mobile Networks More Secure\n  Against the Node Capture Attack", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile Ad Hoc networks, due to the unattended nature of the network itself\nand the dispersed location of nodes, are subject to several unique security\nissues. One of the most vexed security threat is node capture. A few solutions\nhave already been proposed to address this problem; however, those solutions\nare either centralized or focused on theoretical mobility models alone. In the\nformer case the solution does not fit well the distributed nature of the\nnetwork while, in the latter case, the quality of the solutions obtained for\nrealistic mobility models severely differs from the results obtained for\ntheoretical models. The rationale of this paper is inspired by the observation\nthat re-encounters of mobile nodes do elicit a form of social ties. Leveraging\nthese ties, it is possible to design efficient and distributed algorithms that,\nwith a moderated degree of node cooperation, enforce the emergent property of\nnode capture detection. In particular, in this paper we provide a proof of\nconcept proposing a set of algorithms that leverage, to different extent, node\nmobility and node cooperation--that is, identifying social ties--to thwart node\ncapture attack. In particular, we test these algorithms on a realistic mobility\nscenario. Extensive simulations show the quality of the proposed solutions and,\nmore important, the viability of the proposed approach.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 11:05:57 GMT"}], "update_date": "2016-09-08", "authors_parsed": [["Conti", "Mauro", ""], ["Di Pietro", "Roberto", ""], ["Gabrielli", "Andrea", ""], ["Mancini", "Luigi V.", ""], ["Mei", "Alessandro", ""]]}, {"id": "0912.2289", "submitter": "Kadirvelu SivaKumar", "authors": "Dand Tran Tri, Tran Khanh Dang", "title": "Security Visualization for peer-to-peer resource sharing applications", "comments": null, "journal-ref": "IJCSE Volume 1 Issue 2 2009 47-55", "doi": null, "report-no": null, "categories": "cs.NI cs.CR cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security of an information system is only as strong as its weakest element.\nPopular elements of such system include hardware, software, network and people.\nCurrent approaches to computer security problems usually exclude people in\ntheir studies even though it is an integral part of these systems. To fill that\ngap, this paper discusses crucial people-related problems in computer security\nand proposes a method of improving security in such systems by integrating\npeople tightly into the whole system. The integration is implemented via\nvisualization to provide visual feedbacks and capture people's awareness of\ntheir actions and consequent results. By doing it, we can improve system\nusability, shorten user's learning curve, and hence enable user uses computer\nsystems more securely.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 17:23:21 GMT"}], "update_date": "2009-12-14", "authors_parsed": [["Tri", "Dand Tran", ""], ["Dang", "Tran Khanh", ""]]}, {"id": "0912.2293", "submitter": "Kadirvelu SivaKumar", "authors": "Shishir Kumar, Durgesh Pant", "title": "Detection and Prevention of New and Unknown Malware using Honeypots", "comments": null, "journal-ref": "IJCSE Volume 1 Issue 2 2009 56-61", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security has become ubiquitous in every domain today as newly emerging\nmalware pose an ever-increasing perilous threat to systems. Consequently,\nhoneypots are fast emerging as an indispensible forensic tool for the analysis\nof malicious network traffic. Honeypots can be considered to be traps for\nhackers and intruders and are generally deployed complimentary to Intrusion\nDetection Systems (IDS) and Intrusion Prevention Systems (IPS) in a network.\nThey help system administrators perform a rigorous analysis of external and\ninternal attacks on their networks. They are also used by security firms and\nresearch labs to capture the latest variants of malware. However, honeypots\nwould serve a slightly different purpose in our proposed system. We intend to\nuse honeypots for generating and broadcasting instant cures for new and unknown\nmalware in a network. The cures which will be in the form of on-the-fly\nanti-malware signatures would spread in a fashion that is similar to the way\nmalware spreads across networks. The most striking advantage of implementing\nthis technology is that an effective initial control can be exercised on\nmalware. Proposed system would be capable of providing cures for new fatal\nviruses which have not yet been discovered by prime security firms of the\nworld.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 17:41:30 GMT"}], "update_date": "2009-12-14", "authors_parsed": [["Kumar", "Shishir", ""], ["Pant", "Durgesh", ""]]}, {"id": "0912.2306", "submitter": "Kadirvelu SivaKumar", "authors": "Nasir Mahmood Malik, Tehmina Khalil, Samina Khalid, Faisal Munir Malik", "title": "PKI Implementation Issues: A Comparative Study of Pakistan with some\n  Asian Countries", "comments": null, "journal-ref": "IJCSE Volume 1 Issue 2 2009 105-110", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper includes Public Key Infrastructure (PKI), its need and requirements\nand introduction of some renowned PKI products. However, the major thrust of\nthis work is that how PKI can enhance security of various systems. The paper is\nintended to serve as a guide on how to adequately prepare for some of the\nchallenges that may be encountered especially in developing countries like\nPakistan. The detail of PKI implementation issues is also included in the paper\nalong with future challenges regarding implementation of PKI. Furthermore,\npaper includes technical issues hindering the implementation of PKI through\ncomparison of PKI issues in Pakistan and some of Asian countries mainly Taiwan,\nJapan and Singapore. The paper also highlights the PKI issues and learnt\nlessons regarding PKI implementation and can act as a comprehensive guide for\nsuccessful future PKI deployments.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 18:20:22 GMT"}], "update_date": "2009-12-14", "authors_parsed": [["Malik", "Nasir Mahmood", ""], ["Khalil", "Tehmina", ""], ["Khalid", "Samina", ""], ["Malik", "Faisal Munir", ""]]}, {"id": "0912.2319", "submitter": "Kadirvelu SivaKumar", "authors": "Shashikala Channalli and Ajay Jadhav", "title": "Steganography An Art of Hiding Data", "comments": null, "journal-ref": "IJCSE Volume 1 Issue 3 2009 137-141", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In today's world the art of sending & displaying the hidden information\nespecially in public places, has received more attention and faced many\nchallenges. Therefore, different methods have been proposed so far for hiding\ninformation in different cover media. In this paper a method for hiding of\ninformation on the billboard display is presented. It is well known that\nencryption provides secure channels for communicating entities. However, due to\nlack of covertness on these channels, an eavesdropper can identify encrypted\nstreams through statistical tests and capture them for further cryptanalysis.\nIn this paper we propose a new form of steganography, on-line hiding of\ninformation on the output screens of the instrument. This method can be used\nfor announcing a secret message in public place. It can be extended to other\nmeans such as electronic advertising board around sports stadium, railway\nstation or airport. This method of steganography is very similar to image\nsteganography and video steganography. Private marking system using symmetric\nkey steganography technique and LSB technique is used here for hiding the\nsecret information.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 18:58:29 GMT"}], "update_date": "2009-12-14", "authors_parsed": [["Channalli", "Shashikala", ""], ["Jadhav", "Ajay", ""]]}, {"id": "0912.2548", "submitter": "Grigorios Loukides", "authors": "Grigorios Loukides, Aris Gkoulalas-Divanis and Bradley Malin", "title": "Towards Utility-driven Anonymization of Transactions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Publishing person-specific transactions in an anonymous form is increasingly\nrequired by organizations. Recent approaches ensure that potentially\nidentifying information (e.g., a set of diagnosis codes) cannot be used to link\npublished transactions to persons' identities, but all are limited in\napplication because they incorporate coarse privacy requirements (e.g.,\nprotecting a certain set of m diagnosis codes requires protecting all m-sized\nsets), do not integrate utility requirements, and tend to explore a small\nportion of the solution space. In this paper, we propose a more general\nframework for anonymizing transactional data under specific privacy and utility\nrequirements. We model such requirements as constraints, investigate how these\nconstraints can be specified, and propose COAT (COnstraint-based Anonymization\nof Transactions), an algorithm that anonymizes transactions using a flexible\nhierarchy-free generalization scheme to meet the specified constraints.\nExperiments with benchmark datasets verify that COAT significantly outperforms\nthe current state-of-the-art algorithm in terms of data utility, while being\ncomparable in terms of efficiency. The effectiveness of our approach is also\ndemonstrated in a real-world scenario, which requires disseminating a private,\npatient-specific transactional dataset in a way that preserves both privacy and\nutility in intended studies.\n", "versions": [{"version": "v1", "created": "Sun, 13 Dec 2009 23:30:24 GMT"}, {"version": "v2", "created": "Tue, 26 Jan 2010 05:26:00 GMT"}], "update_date": "2010-01-26", "authors_parsed": [["Loukides", "Grigorios", ""], ["Gkoulalas-Divanis", "Aris", ""], ["Malin", "Bradley", ""]]}, {"id": "0912.2843", "submitter": "Nallusamy R", "authors": "R.Nallusamy, K.Jayarajan, K.Duraiswamy", "title": "Intrusion Detection In Mobile Ad Hoc Networks Using GA Based Feature\n  Selection", "comments": "This paper has been withdrawn by the authors. To improve the quality\n  of the paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.CR cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile ad hoc networking (MANET) has become an exciting and important\ntechnology in recent years because of the rapid proliferation of wireless\ndevices. MANETs are highly vulnerable to attacks due to the open medium,\ndynamically changing network topology and lack of centralized monitoring point.\nIt is important to search new architecture and mechanisms to protect the\nwireless networks and mobile computing application. IDS analyze the network\nactivities by means of audit data and use patterns of well-known attacks or\nnormal profile to detect potential attacks. There are two methods to analyze:\nmisuse detection and anomaly detection. Misuse detection is not effective\nagainst unknown attacks and therefore, anomaly detection method is used. In\nthis approach, the audit data is collected from each mobile node after\nsimulating the attack and compared with the normal behavior of the system. If\nthere is any deviation from normal behavior then the event is considered as an\nattack. Some of the features of collected audit data may be redundant or\ncontribute little to the detection process. So it is essential to select the\nimportant features to increase the detection rate. This paper focuses on\nimplementing two feature selection methods namely, markov blanket discovery and\ngenetic algorithm. In genetic algorithm, bayesian network is constructed over\nthe collected features and fitness function is calculated. Based on the fitness\nvalue the features are selected. Markov blanket discovery also uses bayesian\nnetwork and the features are selected depending on the minimum description\nlength. During the evaluation phase, the performances of both approaches are\ncompared based on detection rate and false alarm rate.\n", "versions": [{"version": "v1", "created": "Tue, 15 Dec 2009 10:57:58 GMT"}, {"version": "v2", "created": "Sun, 30 May 2010 09:00:50 GMT"}], "update_date": "2010-06-01", "authors_parsed": [["Nallusamy", "R.", ""], ["Jayarajan", "K.", ""], ["Duraiswamy", "K.", ""]]}, {"id": "0912.2952", "submitter": "Josef Svenningsson", "authors": "Josef Svenningsson and David Sands", "title": "Specification and Verification of Side Channel Declassification", "comments": null, "journal-ref": null, "doi": null, "report-no": "2009-13", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Side channel attacks have emerged as a serious threat to the security of both\nnetworked and embedded systems -- in particular through the implementations of\ncryptographic operations. Side channels can be difficult to model formally, but\nwith careful coding and program transformation techniques it may be possible to\nverify security in the presence of specific side-channel attacks. But what if a\nprogram intentionally makes a tradeoff between security and efficiency and\nleaks some information through a side channel? In this paper we study such\ntradeoffs using ideas from recent research on declassification. We present a\nsemantic model of security for programs which allow for declassification\nthrough side channels, and show how side-channel declassification can be\nverified using off-the-shelf software model checking tools. Finally, to make it\nsimpler for verifiers to check that a program conforms to a particular\nside-channel declassification policy we introduce a further tradeoff between\nefficiency and verifiability: by writing programs in a particular \"manifest\nform\" security becomes considerably easier to verify.\n", "versions": [{"version": "v1", "created": "Tue, 15 Dec 2009 17:55:42 GMT"}], "update_date": "2009-12-16", "authors_parsed": [["Svenningsson", "Josef", ""], ["Sands", "David", ""]]}, {"id": "0912.3050", "submitter": "Chengqing Li", "authors": "Chengqing Li, Shujun Li, and Kwok-Tung Lo", "title": "Breaking a modified substitution-diffusion image cipher based on chaotic\n  standard and logistic maps", "comments": "9 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, an image encryption scheme based on chaotic standard and logistic\nmaps was proposed by Patidar et al. It was later reported by Rhouma et al. that\nan equivalent secret key can be reconstructed with only one\nknown/chosen-plaintext and the corresponding ciphertext. Patidar et al. soon\nmodified the original scheme and claimed that the modified scheme is secure\nagainst Rhouma et al.'s attack. In this paper, we point out that the modified\nscheme is still insecure against the same known/chosen-plaintext attack. In\naddition, some other security defects existing in both the original and the\nmodified schemes are also reported.\n", "versions": [{"version": "v1", "created": "Wed, 16 Dec 2009 03:52:35 GMT"}, {"version": "v2", "created": "Mon, 21 Dec 2009 14:07:38 GMT"}], "update_date": "2009-12-21", "authors_parsed": [["Li", "Chengqing", ""], ["Li", "Shujun", ""], ["Lo", "Kwok-Tung", ""]]}, {"id": "0912.3921", "submitter": "William Jackson", "authors": "Awodele Oludele, Ogunnusi Ayodele, Omole Oladele, Seton Olurotimi", "title": "Design of an Automated Intrusion Detection System incorporating an Alarm", "comments": null, "journal-ref": "Journal of Computing, Volume 1, Issue 1, pp 149-157, December 2009", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security and safety are two intertwined terms. It is a common belief that\nwhen a place or system is secure, it is safe. This paper shows a means of\nintegrating three devices for physical intrusion detection. This paper thus\nsuggests a means of increasing the level of security in an enclosed area with\nthe use three of the four security layers necessary for optimum security. This\npaper intends to show that a system with more than one security device in place\ntends to prevent unauthorized access. This paper would be illustrating the\nimplementation of this in an enclosed area whose security level must be kept on\nthe high at all times.\n", "versions": [{"version": "v1", "created": "Sat, 19 Dec 2009 18:37:30 GMT"}], "update_date": "2009-12-22", "authors_parsed": [["Oludele", "Awodele", ""], ["Ayodele", "Ogunnusi", ""], ["Oladele", "Omole", ""], ["Olurotimi", "Seton", ""]]}, {"id": "0912.3970", "submitter": "William Jackson", "authors": "Nitin A. Naik, Gajanan D. Kurundkar, Santosh D. Khamitkar, Namdeo V.\n  Kalyankar", "title": "Penetration Testing: A Roadmap to Network Security", "comments": null, "journal-ref": "Journal of Computing, Volume 1, Issue 1, pp 187-190, December 2009", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network penetration testing identifies the exploits and vulnerabilities those\nexist within computer network infrastructure and help to confirm the security\nmeasures. The objective of this paper is to explain methodology and methods\nbehind penetration testing and illustrate remedies over it, which will provide\nsubstantial value for network security Penetration testing should model real\nworld attacks as closely as possible. An authorized and scheduled penetration\ntesting will probably detected by IDS (Intrusion Detection System). Network\npenetration testing is done by either or manual automated tools. Penetration\ntest can gather evidence of vulnerability in the network. Successful testing\nprovides indisputable evidence of the problem as well as starting point for\nprioritizing remediation. Penetration testing focuses on high severity\nvulnerabilities and there are no false positive.\n", "versions": [{"version": "v1", "created": "Sun, 20 Dec 2009 03:39:53 GMT"}, {"version": "v2", "created": "Sat, 26 Dec 2009 15:10:20 GMT"}], "update_date": "2009-12-26", "authors_parsed": [["Naik", "Nitin A.", ""], ["Kurundkar", "Gajanan D.", ""], ["Khamitkar", "Santosh D.", ""], ["Kalyankar", "Namdeo V.", ""]]}, {"id": "0912.3980", "submitter": "William Jackson", "authors": "Jamal A. Hussein, Mumtaz A. AlMukhtar", "title": "Fair Exchange of Digital Signatures using RSA-based CEMBS and Offline\n  STTP", "comments": null, "journal-ref": "Journal of Computing, Volume 1, Issue 1, pp 87-91, December 2009", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the essential security services needed to safeguard online\ntransactions is fair exchange. In fair exchange protocols two parties can\nexchange their signatures in a fair manner, so that either each party gain the\nother's signature or no one obtain anything useful. This paper examines\nsecurity solutions for achieving fair exchange. It proposes new security\nprotocols based on the \"Certified Encrypted Message Being Signature\" (CEMBS) by\nusing RSA signature scheme. This protocol relies on the help of an \"off-line\nSemi-Trusted Third Party\" (STTP) to achieve fairness. They provide with\nconfidential protection from the STTP for the exchanged items by limiting the\nrole and power of the STTP. Three different protocols have been proposed. In\nthe first protocol, the two main parties exchange their signatures on a common\nmessage. In the second protocol, the signatures are exchanged on two different\nmessages. While in the third one, the exchange is between confidential data and\nsignature.\n", "versions": [{"version": "v1", "created": "Sun, 20 Dec 2009 05:15:22 GMT"}], "update_date": "2009-12-22", "authors_parsed": [["Hussein", "Jamal A.", ""], ["AlMukhtar", "Mumtaz A.", ""]]}, {"id": "0912.3986", "submitter": "William Jackson", "authors": "Hamid.A.Jalab, A.A Zaidan, B.B Zaidan", "title": "Frame Selected Approach for Hiding Data within MPEG Video Using Bit\n  Plane Complexity Segmentation", "comments": null, "journal-ref": "Journal of Computing, Volume 1, Issue 1, pp 108-113, December 2009", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bit Plane Complexity Segmentation (BPCS) digital picture steganography is a\ntechnique to hide data inside an image file. BPCS achieves high embedding rates\nwith low distortion based on the theory that noise-like regions in an image's\nbit-planes can be replaced with noise-like secret data without significant loss\nin image quality. . In this framework we will propose a collaborate approach\nfor select frame for Hiding Data within MPEG Video Using Bit Plane Complexity\nSegmentation. This approach will invent high secure data hidden using select\nframe form MPEG Video and furthermore we will assign the well-built of the\napproach; during this review the author will answer the question why they used\nselect frame steganography. In additional to the security issues we will use\nthe digital video as a cover to the data hidden. The reason behind opt the\nvideo cover in this approach is the huge amount of single frames image per sec\nwhich in turn overcome the problem of the data hiding quantity, as the\nexperiment result shows the success of the hidden data within select frame,\nextract data from the frames sequence. These function without affecting the\nquality of the video.\n", "versions": [{"version": "v1", "created": "Sun, 20 Dec 2009 05:33:01 GMT"}], "update_date": "2009-12-22", "authors_parsed": [["Jalab", "Hamid. A.", ""], ["Zaidan", "A. A", ""], ["Zaidan", "B. B", ""]]}, {"id": "0912.4080", "submitter": "Givon Zirkind", "authors": "Givon Zirkind", "title": "Windtalking Computers: Frequency Normalization, Binary Coding Systems\n  and Encryption", "comments": "33 pages; 5 Flowcharts; 12 Tables; Glossary Replaced to correct title\n  Replaced to add original date written", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses the application of known techniques, knowledge and\ntechnology in a novel way for encryption. Two distinct and separate methods are\npresented.\n  Method 1: Alter the symbol set of the language by adding additional redundant\nsymbols for frequent symbols. This will reduce the high frequency of more\ncommonly used symbols. Hence, frequency analysis upon ciphertext will not be\npossible. Hence, decryption will be possible.\n  Method 2: Computers use binary base 2. Most encryption systems use ciphering\nto convert data to ciphertext. The author presents the theory and several\npossible implementations of a method for computers analogous to speaking\nanother language. This is done by using a binary base other than base 2. Ex.\nFibonacci, Phi or Prime.\n  In addition, steganography may be used for creating alternate binary bases.\n  This kind of encryption significantly increases the complexity of decryption.\nFirst the binary base must be known. Only then, can decryption begin.\n  This kind of encryption also breaks the transitivity of\nplaintext-codebook-binary; the correlation of letters-ASCII-base2. With this\ntransitivity broken, decryption is logically impossible. Coupled with\nencrypting the plaintext, binary encryption makes decryption uncrackable. It\nmay produce false positives--information theoretic secure, and requires much\nmore computing power to resolve than is currently used in brute force\ndecryption. Hence, the assertion that these combination of methods are\ncomputationally secure--impervious to brute force.\n  The proposed system has a drawback. It is not as compressed as a base2.\n(Similar to adding random padding to the encryption.) However, this is\nacceptable, since the goal is very strong encryption:\n  Both methods are not decryptable by method uncrackable - by conventional,\nstatistical means.\n", "versions": [{"version": "v1", "created": "Mon, 21 Dec 2009 04:56:03 GMT"}, {"version": "v2", "created": "Wed, 23 Dec 2009 01:32:45 GMT"}, {"version": "v3", "created": "Wed, 4 Jul 2012 01:08:26 GMT"}], "update_date": "2012-07-05", "authors_parsed": [["Zirkind", "Givon", ""]]}, {"id": "0912.4694", "submitter": "Charles Sauerbier", "authors": "Charles Sauerbier", "title": "Discovery of Elliptic Curve Cryptographic Private Key in O(n)", "comments": "2 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An algorithm is presented that in context of public key use of Elliptic Curve\nCryptography allows discovery of the private key in worst case O(n).\n", "versions": [{"version": "v1", "created": "Wed, 23 Dec 2009 17:50:29 GMT"}], "update_date": "2009-12-24", "authors_parsed": [["Sauerbier", "Charles", ""]]}, {"id": "0912.4742", "submitter": "Chao Li", "authors": "Chao Li, Michael Hay, Vibhor Rastogi, Gerome Miklau, Andrew McGregor", "title": "Optimizing Histogram Queries under Differential Privacy", "comments": "22 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Differential privacy is a robust privacy standard that has been successfully\napplied to a range of data analysis tasks. Despite much recent work, optimal\nstrategies for answering a collection of correlated queries are not known.\n  We study the problem of devising a set of strategy queries, to be submitted\nand answered privately, that will support the answers to a given workload of\nqueries. We propose a general framework in which query strategies are formed\nfrom linear combinations of counting queries, and we describe an optimal method\nfor deriving new query answers from the answers to the strategy queries. Using\nthis framework we characterize the error of strategies geometrically, and we\npropose solutions to the problem of finding optimal strategies.\n", "versions": [{"version": "v1", "created": "Wed, 23 Dec 2009 21:22:50 GMT"}, {"version": "v2", "created": "Mon, 6 Sep 2010 13:24:19 GMT"}], "update_date": "2010-09-07", "authors_parsed": [["Li", "Chao", ""], ["Hay", "Michael", ""], ["Rastogi", "Vibhor", ""], ["Miklau", "Gerome", ""], ["McGregor", "Andrew", ""]]}, {"id": "0912.5101", "submitter": "Asaf Shabtai", "authors": "A. Shabtai (1 and 3), Y. Fledel (1 and 3), U. Kanonov (1 and 3), Y.\n  Elovici (1 and 3), S. Dolev (2 and 3) ((1) Department of Information Systems\n  Engineering Ben-Gurion University Israel, (2) Department of Computer Science\n  Ben-Gurion University Israel, (3) Deutsche Telekom Laboratories at Ben-Gurion\n  University Israel)", "title": "Google Android: A State-of-the-Art Review of Security Mechanisms", "comments": "42 pages, 1 figure, 5 tables", "journal-ref": null, "doi": null, "report-no": "DTBGU-TR200912-01", "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Google's Android is a comprehensive software framework for mobile\ncommunication devices (i.e., smartphones, PDAs). The Android framework includes\nan operating system, middleware and a set of key applications. The\nincorporation of integrated access services to the Internet on such mobile\ndevices, however, increases their exposure to damages inflicted by various\ntypes of malware. This paper provides a comprehensive security assessment of\nthe Android framework and the security mechanisms incorporated into it. A\nmethodological qualitative risk analysis that we conducted identifies the\nhigh-risk threats to the framework and any potential danger to information or\nto the system resulting from vulnerabilities that have been uncovered and\nexploited. Our review of current academic and commercial solutions in the area\nof smartphone security yields a list of applied and recommended defense\nmechanisms for hardening mobile devices in general and the Android in\nparticular. Lastly, we present five major (high-risk) threats to the Android\nframework and propose security solutions to mitigate them. We conclude by\nproposing a set of security mechanisms that should be explored and introduced\ninto Android-powered devices.\n", "versions": [{"version": "v1", "created": "Sun, 27 Dec 2009 19:18:17 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Shabtai", "A.", "", "1 and 3"], ["Fledel", "Y.", "", "1 and 3"], ["Kanonov", "U.", "", "1 and 3"], ["Elovici", "Y.", "", "1 and 3"], ["Dolev", "S.", "", "2 and 3"]]}, {"id": "0912.5166", "submitter": "Reinert Korsnes rko", "authors": "Reinert Korsnes and Knut Ovsthus", "title": "Inspiration from genetics to promote recognition and protection within\n  ad hoc sensor networks", "comments": "14 pages, 5 figures, research article", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR q-bio.CB q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work illustrates potentials for recognition within {\\em ad hoc} sensor\nnetworks if their nodes possess individual inter-related biologically inspired\ngenetic codes. The work takes ideas from natural immune systems protecting\norganisms from infection. Nodes in the present proposal have individual gene\nsets fitting into a self organised phylogenetic tree. Members of this\npopulation are genetically ''relatives''. Outsiders cannot easily copy or\nintroduce a new node in the network without going through a process of\nconception between two nodes in the population. Related nodes can locally\ndecide to check each other for their genetic relation without directly\nrevealing their gene sets. A copy/clone of a gene sequence or a random gene set\nwill appear as alien. Nodes go through a cycle of introduction (conception or\n''birth'') with parents in the network and later exit from it (''death'').\nHence the phylogenetic tree is dynamic or possesses a genetic drift. Typical\nlifetimes of gene sets and number of offspring from different parents affect\nthis genetic drift and the level of correlation between gene sets. The\nfrequency of mutations similarly affects the gene pool. Correlation between\ngenes of the nodes implies a common secret for cryptographic material for\ncommunication and consistency check facilitating intrusion detection and\ntracing of events. A node can by itself (non-specifically) recognise an\nadversary if it does not respond properly according to its genes. Nodes can\nalso collaborate to recognise adversaries by communicating response from\nintruders to check for consistency with the whole gene pool (phylogenetic\ntree).\n", "versions": [{"version": "v1", "created": "Mon, 28 Dec 2009 12:59:00 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Korsnes", "Reinert", ""], ["Ovsthus", "Knut", ""]]}, {"id": "0912.5237", "submitter": "Panos Papadimitratos", "authors": "P. Papadimitratos", "title": "\"On the Road\" - Reflections on the Security of Vehicular Communication\n  Systems", "comments": null, "journal-ref": "EEE ICVES, Columbus, OH, USA, September 2008", "doi": null, "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicular communication (VC) systems have recently drawn the attention of\nindustry, authorities, and academia. A consensus on the need to secure VC\nsystems and protect the privacy of their users led to concerted efforts to\ndesign security architectures. Interestingly, the results different project\ncontributed thus far bear extensive similarities in terms of objectives and\nmechanisms. As a result, this appears to be an auspicious time for setting the\ncorner-stone of trustworthy VC systems. Nonetheless, there is a considerable\ndistance to cover till their deployment. This paper ponders on the road ahead.\nFirst, it presents a distillation of the state of the art, covering the\nperceived threat model, security requirements, and basic secure VC system\ncomponents. Then, it dissects predominant assumptions and design choices and\nconsiders alternatives. Under the prism of what is necessary to render secure\nVC systems practical, and given possible non-technical influences, the paper\nattempts to chart the landscape towards the deployment of secure VC systems.\n", "versions": [{"version": "v1", "created": "Wed, 30 Dec 2009 18:38:47 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Papadimitratos", "P.", ""]]}, {"id": "0912.5334", "submitter": "Riaz Shaikh", "authors": "Riaz Ahmed Shaikh, Hassan Jameel, Brian J. d Auriol, Heejo Lee,\n  Sungyoung Lee and Young-Jae Song", "title": "Intrusion-aware Alert Validation Algorithm for Cooperative Distributed\n  Intrusion Detection Schemes of Wireless Sensor Networks", "comments": "19 pages, 7 figures", "journal-ref": "Sensors 2009, vol. 9(8), pp. 5989-6007", "doi": "10.3390/s90805989", "report-no": null, "categories": "cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Existing anomaly and intrusion detection schemes of wireless sensor networks\nhave mainly focused on the detection of intrusions. Once the intrusion is\ndetected, an alerts or claims will be generated. However, any unidentified\nmalicious nodes in the network could send faulty anomaly and intrusion claims\nabout the legitimate nodes to the other nodes. Verifying the validity of such\nclaims is a critical and challenging issue that is not considered in the\nexisting cooperative-based distributed anomaly and intrusion detection schemes\nof wireless sensor networks. In this paper, we propose a validation algorithm\nthat addresses this problem. This algorithm utilizes the concept of\nintrusion-aware reliability that helps to provide adequate reliability at a\nmodest communication cost. In this paper, we also provide a security resiliency\nanalysis of the proposed intrusion-aware alert validation algorithm.\n", "versions": [{"version": "v1", "created": "Tue, 29 Dec 2009 16:52:09 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Shaikh", "Riaz Ahmed", ""], ["Jameel", "Hassan", ""], ["Auriol", "Brian J. d", ""], ["Lee", "Heejo", ""], ["Lee", "Sungyoung", ""], ["Song", "Young-Jae", ""]]}, {"id": "0912.5391", "submitter": "Panos Papadimitratos", "authors": "P. Papadimitratos, L. Buttyan, T. Holczer, E. Schoch, J. Freudiger, M.\n  Raya, Z. Ma, F. Kargl, A. Kung, and J.-P. Hubaux", "title": "Secure Vehicular Communication Systems: Design and Architecture", "comments": null, "journal-ref": "IEEE Communcations Magazine, vol. 46, no. 11, pp. 100--109,\n  November 2008", "doi": "10.1109/MCOM.2008.4689252", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Significant developments have taken place over the past few years in the area\nof vehicular communication (VC) systems. Now, it is well understood in the\ncommunity that security and protection of private user information are a\nprerequisite for the deployment of the technology. This is so, precisely\nbecause the benefits of VC systems, with the mission to enhance transportation\nsafety and efficiency, are at stake. Without the integration of strong and\npractical security and privacy enhancing mechanisms, VC systems could be\ndisrupted or disabled, even by relatively unsophisticated attackers. We address\nthis problem within the SeVeCom project, having developed a security\narchitecture that provides a comprehensive and practical solution. We present\nour results in a set of two papers in this issue. In this first one, we analyze\nthreats and types of adversaries, we identify security and privacy\nrequirements, and we present a spectrum of mechanisms to secure VC systems. We\nprovide a solution that can be quickly adopted and deployed. In the second\npaper, we present our progress towards the implementation of our architecture\nand results on the performance of the secure VC system, along with a discussion\nof upcoming research challenges and our related current results.\n", "versions": [{"version": "v1", "created": "Wed, 30 Dec 2009 16:29:38 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Papadimitratos", "P.", ""], ["Buttyan", "L.", ""], ["Holczer", "T.", ""], ["Schoch", "E.", ""], ["Freudiger", "J.", ""], ["Raya", "M.", ""], ["Ma", "Z.", ""], ["Kargl", "F.", ""], ["Kung", "A.", ""], ["Hubaux", "J. -P.", ""]]}, {"id": "0912.5393", "submitter": "Panos Papadimitratos", "authors": "F. Kargl, P. Papadimitratos, L. Buttyan, M. Muter, B. Wiedersheim, E.\n  Schoch, T.-V. Thong, G. Calandriello, A. Held, A. Kung, and J.-P. Hubaux", "title": "Secure Vehicular Communication Systems: Implementation, Performance, and\n  Research Challenges", "comments": null, "journal-ref": "IEEE Communications Magazine, vol. 46, no. 11, pp. 110--118,\n  November 2008", "doi": "10.1109/MCOM.2008.4689253", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicular Communication (VC) systems are on the verge of practical\ndeployment. Nonetheless, their security and privacy protection is one of the\nproblems that have been addressed only recently. In order to show the\nfeasibility of secure VC, certain implementations are required. In [1] we\ndiscuss the design of a VC security system that has emerged as a result of the\nEuropean SeVeCom project. In this second paper, we discuss various issues\nrelated to the implementation and deployment aspects of secure VC systems.\nMoreover, we provide an outlook on open security research issues that will\narise as VC systems develop from today's simple prototypes to full-fledged\nsystems.\n", "versions": [{"version": "v1", "created": "Wed, 30 Dec 2009 16:43:37 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Kargl", "F.", ""], ["Papadimitratos", "P.", ""], ["Buttyan", "L.", ""], ["Muter", "M.", ""], ["Wiedersheim", "B.", ""], ["Schoch", "E.", ""], ["Thong", "T. -V.", ""], ["Calandriello", "G.", ""], ["Held", "A.", ""], ["Kung", "A.", ""], ["Hubaux", "J. -P.", ""]]}, {"id": "0912.5497", "submitter": "Panos Papadimitratos", "authors": "P. Papadimitratos, Z.J. Haas, and J.-P. Hubaux", "title": "How to Specify and How to Prove Correctness of Secure Routing Protocols\n  for MANET", "comments": null, "journal-ref": "IEEE-CS BroadNets 2006, San Jose, CA, USA, October 2006", "doi": "10.1109/BROADNETS.2006.4374344", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Secure routing protocols for mobile ad hoc networks have been developed\nrecently, yet, it has been unclear what are the properties they achieve, as a\nformal analysis of these protocols is mostly lacking. In this paper, we are\nconcerned with this problem, how to specify and how to prove the correctness of\na secure routing protocol. We provide a definition of what a protocol is\nexpected to achieve independently of its functionality, as well as\ncommunication and adversary models. This way, we enable formal reasoning on the\ncorrectness of secure routing protocols. We demonstrate this by analyzing two\nprotocols from the literature.\n", "versions": [{"version": "v1", "created": "Wed, 30 Dec 2009 19:10:21 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Papadimitratos", "P.", ""], ["Haas", "Z. J.", ""], ["Hubaux", "J. -P.", ""]]}, {"id": "0912.5514", "submitter": "Christopher Portmann", "authors": "Anindya De, Christopher Portmann, Thomas Vidick, Renato Renner", "title": "Trevisan's extractor in the presence of quantum side information", "comments": "20+10 pages; v2: extract more min-entropy, use weakly random seed;\n  v3: extended introduction, matches published version with sections somewhat\n  reordered", "journal-ref": "SIAM Journal on Computing, 41(4):915-940, 2012", "doi": "10.1137/100813683", "report-no": null, "categories": "quant-ph cs.CC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Randomness extraction involves the processing of purely classical information\nand is therefore usually studied in the framework of classical probability\ntheory. However, such a classical treatment is generally too restrictive for\napplications, where side information about the values taken by classical random\nvariables may be represented by the state of a quantum system. This is\nparticularly relevant in the context of cryptography, where an adversary may\nmake use of quantum devices. Here, we show that the well known construction\nparadigm for extractors proposed by Trevisan is sound in the presence of\nquantum side information.\n  We exploit the modularity of this paradigm to give several concrete extractor\nconstructions, which, e.g, extract all the conditional (smooth) min-entropy of\nthe source using a seed of length poly-logarithmic in the input, or only\nrequire the seed to be weakly random.\n", "versions": [{"version": "v1", "created": "Wed, 30 Dec 2009 20:56:19 GMT"}, {"version": "v2", "created": "Thu, 4 Nov 2010 09:14:42 GMT"}, {"version": "v3", "created": "Mon, 18 Jun 2012 18:05:19 GMT"}], "update_date": "2012-08-24", "authors_parsed": [["De", "Anindya", ""], ["Portmann", "Christopher", ""], ["Vidick", "Thomas", ""], ["Renner", "Renato", ""]]}]