[{"id": "1112.0168", "submitter": "Achraf Othman", "authors": "Achraf Othman, and Mohamed Jemni", "title": "Statistical Sign Language Machine Translation: from English written text\n  to American Sign Language Gloss", "comments": "9 pages", "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 8,\n  Issue 5, No 3, 2011, 65-73", "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This works aims to design a statistical machine translation from English text\nto American Sign Language (ASL). The system is based on Moses tool with some\nmodifications and the results are synthesized through a 3D avatar for\ninterpretation. First, we translate the input text to gloss, a written form of\nASL. Second, we pass the output to the WebSign Plug-in to play the sign.\nContributions of this work are the use of a new couple of language English/ASL\nand an improvement of statistical machine translation based on string matching\nthanks to Jaro-distance.\n", "versions": [{"version": "v1", "created": "Thu, 1 Dec 2011 12:52:22 GMT"}], "update_date": "2011-12-02", "authors_parsed": [["Othman", "Achraf", ""], ["Jemni", "Mohamed", ""]]}, {"id": "1112.0396", "submitter": "Win Win  Thant", "authors": "Win Win Thant, Tin Myat Htwe and Ni Lar Thein", "title": "Grammatical Relations of Myanmar Sentences Augmented by\n  Transformation-Based Learning of Function Tagging", "comments": "10 pages, 15 figures, 11 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we describe function tagging using Transformation Based\nLearning (TBL) for Myanmar that is a method of extensions to the previous\nstatistics-based function tagger. Contextual and lexical rules (developed using\nTBL) were critical in achieving good results. First, we describe a method for\nexpressing lexical relations in function tagging that statistical function\ntagging are currently unable to express. Function tagging is the preprocessing\nstep to show grammatical relations of the sentences. Then we use the context\nfree grammar technique to clarify the grammatical relations in Myanmar\nsentences or to output the parse trees. The grammatical relations are the\nfunctional structure of a language. They rely very much on the function tag of\nthe tokens. We augment the grammatical relations of Myanmar sentences with\ntransformation-based learning of function tagging.\n", "versions": [{"version": "v1", "created": "Fri, 2 Dec 2011 07:15:49 GMT"}], "update_date": "2011-12-05", "authors_parsed": [["Thant", "Win Win", ""], ["Htwe", "Tin Myat", ""], ["Thein", "Ni Lar", ""]]}, {"id": "1112.2468", "submitter": "Tao Chen", "authors": "Tao Chen and Min-Yen Kan", "title": "Creating a Live, Public Short Message Service Corpus: The NUS SMS Corpus", "comments": "It contains 31 pages, 6 figures, and 10 tables. It has been submitted\n  to Language Resource and Evaluation Journal", "journal-ref": "Language Resources and Evaluation, Aug 2012", "doi": "10.1007/s10579-012-9197-9", "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Short Message Service (SMS) messages are largely sent directly from one\nperson to another from their mobile phones. They represent a means of personal\ncommunication that is an important communicative artifact in our current\ndigital era. As most existing studies have used private access to SMS corpora,\ncomparative studies using the same raw SMS data has not been possible up to\nnow. We describe our efforts to collect a public SMS corpus to address this\nproblem. We use a battery of methodologies to collect the corpus, paying\nparticular attention to privacy issues to address contributors' concerns. Our\nlive project collects new SMS message submissions, checks their quality and\nadds the valid messages, releasing the resultant corpus as XML and as SQL\ndumps, along with corpus statistics, every month. We opportunistically collect\nas much metadata about the messages and their sender as possible, so as to\nenable different types of analyses. To date, we have collected about 60,000\nmessages, focusing on English and Mandarin Chinese.\n", "versions": [{"version": "v1", "created": "Mon, 12 Dec 2011 08:07:49 GMT"}], "update_date": "2012-09-04", "authors_parsed": [["Chen", "Tao", ""], ["Kan", "Min-Yen", ""]]}, {"id": "1112.3670", "submitter": "Lillian Lee", "authors": "Cristian Danescu-Niculescu-Mizil, Lillian Lee, Bo Pang, Jon Kleinberg", "title": "Echoes of power: Language effects and power differences in social\n  interaction", "comments": "v3 is the camera-ready for the Proceedings of WWW 2012. Changes from\n  v2 include additional technical analysis. See\n  http://www.cs.cornell.edu/~cristian/www2012 for data and more info", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding social interaction within groups is key to analyzing online\ncommunities. Most current work focuses on structural properties: who talks to\nwhom, and how such interactions form larger network structures. The\ninteractions themselves, however, generally take place in the form of natural\nlanguage --- either spoken or written --- and one could reasonably suppose that\nsignals manifested in language might also provide information about roles,\nstatus, and other aspects of the group's dynamics. To date, however, finding\nsuch domain-independent language-based signals has been a challenge.\n  Here, we show that in group discussions power differentials between\nparticipants are subtly revealed by how much one individual immediately echoes\nthe linguistic style of the person they are responding to. Starting from this\nobservation, we propose an analysis framework based on linguistic coordination\nthat can be used to shed light on power relationships and that works\nconsistently across multiple types of power --- including a more \"static\" form\nof power based on status differences, and a more \"situational\" form of power in\nwhich one individual experiences a type of dependence on another. Using this\nframework, we study how conversational behavior can reveal power relationships\nin two very different settings: discussions among Wikipedians and arguments\nbefore the U.S. Supreme Court.\n", "versions": [{"version": "v1", "created": "Thu, 15 Dec 2011 21:15:27 GMT"}, {"version": "v2", "created": "Fri, 27 Jan 2012 15:03:36 GMT"}, {"version": "v3", "created": "Fri, 13 Apr 2012 03:49:54 GMT"}], "update_date": "2012-04-16", "authors_parsed": [["Danescu-Niculescu-Mizil", "Cristian", ""], ["Lee", "Lillian", ""], ["Pang", "Bo", ""], ["Kleinberg", "Jon", ""]]}, {"id": "1112.5947", "submitter": "Sergey Verlan", "authors": "Sergiu Ivanov, Sergey Verlan", "title": "Random Context and Semi-Conditional Insertion-Deletion Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.CC cs.CL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we introduce the operations of insertion and deletion working\nin a random-context and semi-conditional manner. We show that the conditional\nuse of rules strictly increase the computational power. In the case of\nsemi-conditional insertion-deletion systems context-free insertion and deletion\nrules of one symbol are sufficient to get the computational completeness. In\nthe random context case our results expose an asymmetry between the\ncomputational power of insertion and deletion rules: systems of size $(2,0,0;\n1,1,0)$ are computationally complete, while systems of size $(1,1,0;2,0,0)$\n(and more generally of size $(1,1,0;p,1,1)$) are not. This is particularly\ninteresting because other control mechanisms like graph-control or matrix\ncontrol used together with insertion-deletion systems do not present such\nasymmetry.\n", "versions": [{"version": "v1", "created": "Tue, 27 Dec 2011 10:16:35 GMT"}], "update_date": "2011-12-30", "authors_parsed": [["Ivanov", "Sergiu", ""], ["Verlan", "Sergey", ""]]}, {"id": "1112.6045", "submitter": "Diego  Amancio Raphael", "authors": "Diego R. Amancio, Eduardo G. Altmann, Osvaldo N. Oliveira Jr., Luciano\n  da F. Costa", "title": "Comparing intermittency and network measurements of words and their\n  dependency on authorship", "comments": null, "journal-ref": "New J. Phys. (2011) 13 123024", "doi": "10.1088/1367-2630/13/12/123024", "report-no": null, "categories": "physics.soc-ph cs.CL cs.SI physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many features from texts and languages can now be inferred from statistical\nanalyses using concepts from complex networks and dynamical systems. In this\npaper we quantify how topological properties of word co-occurrence networks and\nintermittency (or burstiness) in word distribution depend on the style of\nauthors. Our database contains 40 books from 8 authors who lived in the 19th\nand 20th centuries, for which the following network measurements were obtained:\nclustering coefficient, average shortest path lengths, and betweenness. We\nfound that the two factors with stronger dependency on the authors were the\nskewness in the distribution of word intermittency and the average shortest\npaths. Other factors such as the betweeness and the Zipf's law exponent show\nonly weak dependency on authorship. Also assessed was the contribution from\neach measurement to authorship recognition using three machine learning\nmethods. The best performance was a ca. 65 % accuracy upon combining complex\nnetwork and intermittency features with the nearest neighbor algorithm. From a\ndetailed analysis of the interdependence of the various metrics it is concluded\nthat the methods used here are complementary for providing short- and\nlong-scale perspectives of texts, which are useful for applications such as\nidentification of topical words and information retrieval.\n", "versions": [{"version": "v1", "created": "Wed, 28 Dec 2011 02:20:48 GMT"}], "update_date": "2013-02-20", "authors_parsed": [["Amancio", "Diego R.", ""], ["Altmann", "Eduardo G.", ""], ["Oliveira", "Osvaldo N.", "Jr."], ["Costa", "Luciano da F.", ""]]}, {"id": "1112.6286", "submitter": "Loet Leydesdorff", "authors": "Esther Vlieger and Loet Leydesdorff", "title": "Visualization and Analysis of Frames in Collections of Messages: Content\n  Analysis and the Measurement of Meaning", "comments": "Forthcoming in: Manuel Mora, Ovsei Gelman, Annette Steenkamp, and\n  Maresh S. Raisinghani (Eds.), Research Methodologies, Innovations and\n  Philosophies in Systems Engineering and Information Systems, Hershey PA:\n  Information Science Reference, 2012, pp. 322-340, doi:\n  10.4018/978-1-4666-0179-6.ch16", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A step-to-step introduction is provided on how to generate a semantic map\nfrom a collection of messages (full texts, paragraphs or statements) using\nfreely available software and/or SPSS for the relevant statistics and the\nvisualization. The techniques are discussed in the various theoretical contexts\nof (i) linguistics (e.g., Latent Semantic Analysis), (ii) sociocybernetics and\nsocial systems theory (e.g., the communication of meaning), and (iii)\ncommunication studies (e.g., framing and agenda-setting). We distinguish\nbetween the communication of information in the network space (social network\nanalysis) and the communication of meaning in the vector space. The vector\nspace can be considered a generated as an architecture by the network of\nrelations in the network space; words are then not only related, but also\npositioned. These positions are expected rather than observed and therefore one\ncan communicate meaning. Knowledge can be generated when these meanings can\nrecursively be communicated and therefore also further codified.\n", "versions": [{"version": "v1", "created": "Thu, 29 Dec 2011 11:47:05 GMT"}], "update_date": "2012-01-03", "authors_parsed": [["Vlieger", "Esther", ""], ["Leydesdorff", "Loet", ""]]}, {"id": "1112.6384", "submitter": "Michael Moortgat", "authors": "Michael Moortgat and Richard Moot", "title": "Proof nets for the Lambek-Grishin calculus", "comments": "Revised version to appear as a chapter in E. Grefenstette, C. Heunen,\n  and M. Sadrzadeh (eds.) 'Compositional Methods in Physics and Linguistics',\n  Oxford University Press", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Grishin's generalization of Lambek's Syntactic Calculus combines a\nnon-commutative multiplicative conjunction and its residuals (product, left and\nright division) with a dual family: multiplicative disjunction, right and left\ndifference. Interaction between these two families takes the form of linear\ndistributivity principles. We study proof nets for the Lambek-Grishin calculus\nand the correspondence between these nets and unfocused and focused versions of\nits sequent calculus.\n", "versions": [{"version": "v1", "created": "Thu, 29 Dec 2011 19:16:20 GMT"}], "update_date": "2011-12-30", "authors_parsed": [["Moortgat", "Michael", ""], ["Moot", "Richard", ""]]}]