[{"id": "0802.0116", "submitter": "Lutz Schr\\\"oder", "authors": "Lutz Schr\\\"oder and Dirk Patinson", "title": "Shallow Models for Non-Iterative Modal Logics", "comments": null, "journal-ref": null, "doi": null, "report-no": "Imperial College TR Computing 2008/3", "categories": "cs.LO cs.AI cs.CC cs.MA", "license": null, "abstract": "  The methods used to establish PSPACE-bounds for modal logics can roughly be\ngrouped into two classes: syntax driven methods establish that exhaustive proof\nsearch can be performed in polynomial space whereas semantic approaches\ndirectly construct shallow models. In this paper, we follow the latter approach\nand establish generic PSPACE-bounds for a large and heterogeneous class of\nmodal logics in a coalgebraic framework. In particular, no complete\naxiomatisation of the logic under scrutiny is needed. This does not only\ncomplement our earlier, syntactic, approach conceptually, but also covers a\nwide variety of new examples which are difficult to harness by purely syntactic\nmeans. Apart from re-proving known complexity bounds for a large variety of\nstructurally different logics, we apply our method to obtain previously unknown\nPSPACE-bounds for Elgesem's logic of agency and for graded modal logic over\nreflexive frames.\n", "versions": [{"version": "v1", "created": "Fri, 1 Feb 2008 13:11:09 GMT"}, {"version": "v2", "created": "Thu, 20 Mar 2008 20:48:05 GMT"}, {"version": "v3", "created": "Thu, 3 Apr 2008 09:34:18 GMT"}], "update_date": "2008-04-03", "authors_parsed": [["Schröder", "Lutz", ""], ["Patinson", "Dirk", ""]]}, {"id": "0802.1393", "submitter": "Clement Jonquet", "authors": "Cl\\'ement Jonquet (LIRMM), Stefano A. Cerri (LIRMM)", "title": "Les Agents comme des interpr\\'eteurs Scheme : Sp\\'ecification dynamique\n  par la communication", "comments": null, "journal-ref": "Dans 14\\`eme Congr\\`es Francophone AFRIF-AFIA de Reconnaissance\n  des Formes et Intelligence Artificielle - RFIA'04, Toulouse : France (2004)", "doi": null, "report-no": null, "categories": "cs.MA cs.AI", "license": null, "abstract": "  We proposed in previous papers an extension and an implementation of the\nSTROBE model, which regards the Agents as Scheme interpreters. These Agents are\nable to interpret messages in a dedicated environment including an interpreter\nthat learns from the current conversation therefore representing evolving\nmeta-level Agent's knowledge. When the Agent's interpreter is a\nnondeterministic one, the dialogues may consist of subsequent refinements of\nspecifications in the form of constraint sets. The paper presents a worked out\nexample of dynamic service generation - such as necessary on Grids - by\nexploiting STROBE Agents equipped with a nondeterministic interpreter. It shows\nhow enabling dynamic specification of a problem. Then it illustrates how these\nprinciples could be effective for other applications. Details of the\nimplementation are not provided here, but are available.\n", "versions": [{"version": "v1", "created": "Mon, 11 Feb 2008 08:55:46 GMT"}], "update_date": "2008-02-12", "authors_parsed": [["Jonquet", "Clément", "", "LIRMM"], ["Cerri", "Stefano A.", "", "LIRMM"]]}, {"id": "0802.1604", "submitter": "Constantinos Daskalakis", "authors": "Constantinos Daskalakis, Grant Schoenebeck, Gregory Valiant, Paul\n  Valiant", "title": "On the Complexity of Nash Equilibria of Action-Graph Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of computing Nash Equilibria of action-graph games\n(AGGs). AGGs, introduced by Bhat and Leyton-Brown, is a succinct representation\nof games that encapsulates both \"local\" dependencies as in graphical games, and\npartial indifference to other agents' identities as in anonymous games, which\noccur in many natural settings. This is achieved by specifying a graph on the\nset of actions, so that the payoff of an agent for selecting a strategy depends\nonly on the number of agents playing each of the neighboring strategies in the\naction graph. We present a Polynomial Time Approximation Scheme for computing\nmixed Nash equilibria of AGGs with constant treewidth and a constant number of\nagent types (and an arbitrary number of strategies), together with hardness\nresults for the cases when either the treewidth or the number of agent types is\nunconstrained. In particular, we show that even if the action graph is a tree,\nbut the number of agent-types is unconstrained, it is NP-complete to decide the\nexistence of a pure-strategy Nash equilibrium and PPAD-complete to compute a\nmixed Nash equilibrium (even an approximate one); similarly for symmetric AGGs\n(all agents belong to a single type), if we allow arbitrary treewidth. These\nhardness results suggest that, in some sense, our PTAS is as strong of a\npositive result as one can expect.\n", "versions": [{"version": "v1", "created": "Tue, 12 Feb 2008 09:45:36 GMT"}], "update_date": "2008-02-13", "authors_parsed": [["Daskalakis", "Constantinos", ""], ["Schoenebeck", "Grant", ""], ["Valiant", "Gregory", ""], ["Valiant", "Paul", ""]]}, {"id": "0802.3414", "submitter": "Scott Kominers", "authors": "Zachary Abel, Scott D. Kominers", "title": "Universal Reconfiguration of (Hyper-)cubic Robots", "comments": "5 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.MA cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a simple reconfigurable robot model which has not been previously\nexamined: cubic robots comprised of three-dimensional cubic modules which can\nslide across each other and rotate about each others' edges. We demonstrate\nthat the cubic robot model is universal, i.e., that an n-module cubic robot can\nreconfigure itself into any specified n-module configuration. Additionally, we\nprovide an algorithm that efficiently plans and executes cubic robot motion.\nOur results directly extend to a d-dimensional model.\n", "versions": [{"version": "v1", "created": "Sat, 23 Feb 2008 00:54:13 GMT"}, {"version": "v2", "created": "Fri, 27 Jun 2008 08:21:02 GMT"}, {"version": "v3", "created": "Fri, 30 Dec 2011 17:52:30 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Abel", "Zachary", ""], ["Kominers", "Scott D.", ""]]}, {"id": "0802.4450", "submitter": "Tamas Keviczky", "authors": "Tamas Keviczky, Karl Henrik Johansson", "title": "A Study On Distributed Model Predictive Consensus", "comments": "20 pages, 4 figures, longer version of paper presented at 17th IFAC\n  World Congress", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate convergence properties of a proposed distributed model\npredictive control (DMPC) scheme, where agents negotiate to compute an optimal\nconsensus point using an incremental subgradient method based on primal\ndecomposition as described in Johansson et al. [2006, 2007]. The objective of\nthe distributed control strategy is to agree upon and achieve an optimal common\noutput value for a group of agents in the presence of constraints on the agent\ndynamics using local predictive controllers. Stability analysis using a\nreceding horizon implementation of the distributed optimal consensus scheme is\nperformed. Conditions are given under which convergence can be obtained even if\nthe negotiations do not reach full consensus.\n", "versions": [{"version": "v1", "created": "Fri, 29 Feb 2008 19:05:31 GMT"}], "update_date": "2008-03-03", "authors_parsed": [["Keviczky", "Tamas", ""], ["Johansson", "Karl Henrik", ""]]}]