[{"id": "0707.0385", "submitter": "Fabrizio Lillo", "authors": "Fabrizio Lillo, Esteban Moro, Gabriella Vaglica, Rosario N. Mantegna", "title": "Specialization of strategies and herding behavior of trading firms in a\n  financial market", "comments": "8 pages, 5 figures", "journal-ref": null, "doi": "10.1088/1367-2630/10/4/043019", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": null, "abstract": "  The understanding of complex social or economic systems is an important\nscientific challenge. Here we present a comprehensive study of the Spanish\nStock Exchange showing that most financial firms trading in that market are\ncharacterized by a resulting strategy and can be classified in groups of firms\nwith different specialization. Few large firms overally act as trending firms\nwhereas many heterogeneous firm act as reversing firms. The herding properties\nof these two groups are markedly different and consistently observed over a\nfour-year period of trading.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2007 10:30:51 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Lillo", "Fabrizio", ""], ["Moro", "Esteban", ""], ["Vaglica", "Gabriella", ""], ["Mantegna", "Rosario N.", ""]]}, {"id": "0707.2284", "submitter": "Wei-Xing Zhou", "authors": "Xi-Yuan Qian, Fu-Tie Song, Wei-Xing Zhou (ECUST)", "title": "Nonlinear behavior of the Chinese SSEC index with a unit root: Evidence\n  from threshold unit root tests", "comments": "10 Elsart pages + 5 tables + 1 eps figure", "journal-ref": "Physica A 387 (2-3), 503-510 (2008)", "doi": "10.1016/j.physa.2007.09.029", "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph", "license": null, "abstract": "  We investigate the behavior of the Shanghai Stock Exchange Composite (SSEC)\nindex for the period from 1990:12 to 2007:06 using an unconstrained two-regime\nthreshold autoregressive (TAR) model with an unit root developed by Caner and\nHansen. The method allows us to simultaneously consider non-stationarity and\nnonlinearity in financial time series. Our finding indicates that the Shanghai\nstock market exhibits nonlinear behavior with two regimes and has unit roots in\nboth regimes. The important implications of the threshold effect in stock\nmarkets are also discussed.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jul 2007 09:08:13 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Qian", "Xi-Yuan", "", "ECUST"], ["Song", "Fu-Tie", "", "ECUST"], ["Zhou", "Wei-Xing", "", "ECUST"]]}, {"id": "0707.3321", "submitter": "Marco Bartolozzi Dr", "authors": "M. Bartolozzi, C. Mellen, T. Di Matteo and T. Aste", "title": "Multi-scale correlations in different futures markets", "comments": "14 pages and 25 figures", "journal-ref": "Eur. Phys. J. B vol. 58 (2007) p.207-220", "doi": "10.1140/epjb/e2007-00216-2", "report-no": null, "categories": "q-fin.ST physics.comp-ph physics.data-an physics.soc-ph", "license": null, "abstract": "  In the present work we investigate the multiscale nature of the correlations\nfor high frequency data (1 minute) in different futures markets over a period\nof two years, starting on the 1st of January 2003 and ending on the 31st of\nDecember 2004. In particular, by using the concept of \"local\" Hurst exponent,\nwe point out how the behaviour of this parameter, usually considered as a\nbenchmark for persistency/antipersistency recognition in time series, is\nlargely time-scale dependent in the market context. These findings are a direct\nconsequence of the intrinsic complexity of a system where trading strategies\nare scale-adaptive. Moreover, our analysis points out different regimes in the\ndynamical behaviour of the market indices under consideration.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jul 2007 06:51:27 GMT"}, {"version": "v2", "created": "Mon, 13 Aug 2007 00:12:12 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Bartolozzi", "M.", ""], ["Mellen", "C.", ""], ["Di Matteo", "T.", ""], ["Aste", "T.", ""]]}, {"id": "0707.3478", "submitter": "Rudi Schaefer", "authors": "Rudi Sch\\\"afer, Markus Sj\\\"olin, Andreas Sundin, Michal Wolanski and\n  Thomas Guhr", "title": "Credit risk - A structural model with jumps and correlations", "comments": "24 pages", "journal-ref": "Physica A 383, 533 (2007)", "doi": "10.1016/j.physa.2007.04.053", "report-no": null, "categories": "q-fin.RM cond-mat.stat-mech physics.soc-ph q-fin.ST", "license": null, "abstract": "  We set up a structural model to study credit risk for a portfolio containing\nseveral or many credit contracts. The model is based on a jump--diffusion\nprocess for the risk factors, i.e. for the company assets. We also include\ncorrelations between the companies. We discuss that models of this type have\nmuch in common with other problems in statistical physics and in the theory of\ncomplex systems. We study a simplified version of our model analytically.\nFurthermore, we perform extensive numerical simulations for the full model. The\nobservables are the loss distribution of the credit portfolio, its moments and\nother quantities derived thereof. We compile detailed information about the\nparameter dependence of these observables. In the course of setting up and\nanalyzing our model, we also give a review of credit risk modeling for a\nphysics audience.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2007 14:10:57 GMT"}, {"version": "v2", "created": "Fri, 27 Jul 2007 13:30:40 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Schäfer", "Rudi", ""], ["Sjölin", "Markus", ""], ["Sundin", "Andreas", ""], ["Wolanski", "Michal", ""], ["Guhr", "Thomas", ""]]}, {"id": "0707.3482", "submitter": "Kenton K. Yee", "authors": "Kenton K. Yee", "title": "A Bayesian Framework for Combining Valuation Estimates", "comments": "Citations at\n  http://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=240309 Review of\n  Quantitative Finance and Accounting, 30.3 (2008) forthcoming", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.CE nlin.AO nlin.CD nlin.SI physics.pop-ph physics.soc-ph stat.AP", "license": null, "abstract": "  Obtaining more accurate equity value estimates is the starting point for\nstock selection, value-based indexing in a noisy market, and beating benchmark\nindices through tactical style rotation. Unfortunately, discounted cash flow,\nmethod of comparables, and fundamental analysis typically yield discrepant\nvaluation estimates. Moreover, the valuation estimates typically disagree with\nmarket price. Can one form a superior valuation estimate by averaging over the\nindividual estimates, including market price? This article suggests a Bayesian\nframework for combining two or more estimates into a superior valuation\nestimate. The framework justifies the common practice of averaging over several\nestimates to arrive at a final point estimate.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2007 05:04:53 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Yee", "Kenton K.", ""]]}, {"id": "0707.4638", "submitter": "Fengzhong Wang", "authors": "Fengzhong Wang, Kazuko Yamasaki, Shlomo Havlin and H. Eugene Stanley", "title": "Indication of multiscaling in the volatility return intervals of stock\n  markets", "comments": "19 pages, 6 figures", "journal-ref": "Phys. Rev. E 77, 016109 (2008)", "doi": "10.1103/PhysRevE.77.016109", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": null, "abstract": "  The distribution of the return intervals $\\tau$ between volatilities above a\nthreshold $q$ for financial records has been approximated by a scaling\nbehavior. To explore how accurate is the scaling and therefore understand the\nunderlined non-linear mechanism, we investigate intraday datasets of 500 stocks\nwhich consist of the Standard & Poor's 500 index. We show that the cumulative\ndistribution of return intervals has systematic deviations from scaling. We\nsupport this finding by studying the m-th moment $\\mu_m \\equiv\n<(\\tau/<\\tau>)^m>^{1/m}$, which show a certain trend with the mean interval\n$<\\tau>$. We generate surrogate records using the Schreiber method, and find\nthat their cumulative distributions almost collapse to a single curve and\nmoments are almost constant for most range of $<\\tau>$. Those substantial\ndifferences suggest that non-linear correlations in the original volatility\nsequence account for the deviations from a single scaling law. We also find\nthat the original and surrogate records exhibit slight tendencies for short and\nlong $<\\tau>$, due to the discreteness and finite size effects of the records\nrespectively. To avoid as possible those effects for testing the multiscaling\nbehavior, we investigate the moments in the range $10<<\\tau>\\leq100$, and find\nthe exponent $\\alpha$ from the power law fitting $\\mu_m\\sim<\\tau>^\\alpha$ has a\nnarrow distribution around $\\alpha\\neq0$ which depend on m for the 500 stocks.\nThe distribution of $\\alpha$ for the surrogate records are very narrow and\ncentered around $\\alpha=0$. This suggests that the return interval distribution\nexhibit multiscaling behavior due to the non-linear correlations in the\noriginal volatility.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jul 2007 15:14:47 GMT"}], "update_date": "2009-06-02", "authors_parsed": [["Wang", "Fengzhong", ""], ["Yamasaki", "Kazuko", ""], ["Havlin", "Shlomo", ""], ["Stanley", "H. Eugene", ""]]}]