[{"id": "0803.0057", "submitter": "Rafal Rak", "authors": "R.Rak, J.Kwapien, S.Drozdz, P.Oswiecimka", "title": "Cross-correlations in Warsaw Stock Exchange", "comments": "presented by R.Rak at FENS2007 conference, 9 pages, 4 Figs", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the inter-stock correlations for the largest companies listed on\nWarsaw Stock Exchange and included in the WIG20 index. Our results from the\ncorrelation matrix analysis indicate that the Polish stock market can be well\ndescribed by a one factor model. We also show that the stock-stock correlations\ntend to increase with the time scale of returns and they approach a saturation\nlevel for the time scales of at least 200 min, i.e. an order of magnitude\nlonger than in the case of some developed markets. We also show that the\nstrength of correlations among the stocks crucially depends on their\ncapitalization. These results combined with our earlier findings together\nsuggest that now the Polish stock market situates itself somewhere between an\nemerging market phase and a mature market phase.\n", "versions": [{"version": "v1", "created": "Sat, 1 Mar 2008 10:23:18 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Rak", "R.", ""], ["Kwapien", "J.", ""], ["Drozdz", "S.", ""], ["Oswiecimka", "P.", ""]]}, {"id": "0803.0436", "submitter": "Sudhir Jain", "authors": "S. Jain and T. Yamano", "title": "Double Power Law Decay of the Persistence in Financial Markets", "comments": "9 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The persistence phenomenon is studied in the Japanese financial market by\nusing a novel mapping of the time evolution of the values of shares quoted on\nthe Nikkei Index onto Ising spins. The method is applied to historical end of\nday data from the Japanese stock market during 2002. By studying the time\ndependence of the spins, we find clear evidence for a double-power law decay of\nthe proportion of shares that remain either above or below ` starting\\rq\\\nvalues chosen at random. The results are consistent with a recent analysis of\nthe data from the London FTSE100 market. The slopes of the power-laws are also\nin agreement. We estimate a long time persistence exponent for the underlying\nJapanese financial market to be 0.5.\n", "versions": [{"version": "v1", "created": "Tue, 4 Mar 2008 13:38:36 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Jain", "S.", ""], ["Yamano", "T.", ""]]}, {"id": "0803.1374", "submitter": "Pawel Oswiecimka", "authors": "P. Oswiecimka, J. Kwapien, S. Drozdz, A. Z. Gorski, R. Rak", "title": "Different fractal properties of positive and negative returns", "comments": "presented at FENS2007 conference, 8 pages, 4 Figs", "journal-ref": "Acta Physica Polonica A Vol. 114 No 3. page 547 (2008)", "doi": null, "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We perform an analysis of fractal properties of the positive and the negative\nchanges of the German DAX30 index separately using Multifractal Detrended\nFluctuation Analysis (MFDFA). By calculating the singularity spectra\n$f(\\alpha)$ we show that returns of both signs reveal multiscaling. Curiously,\nthese spectra display a significant difference in the scaling properties of\nreturns with opposite sign. The negative price changes are ruled by stronger\ntemporal correlations than the positive ones, what is manifested by larger\nvalues of the corresponding H\\\"{o}lder exponents. As regards the properties of\ndominant trends, a bear market is more persistent than the bull market\nirrespective of the sign of fluctuations.\n", "versions": [{"version": "v1", "created": "Mon, 10 Mar 2008 09:58:05 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Oswiecimka", "P.", ""], ["Kwapien", "J.", ""], ["Drozdz", "S.", ""], ["Gorski", "A. Z.", ""], ["Rak", "R.", ""]]}, {"id": "0803.1706", "submitter": "M.S. Santhanam", "authors": "M. S. Santhanam and Holger Kantz", "title": "Return interval distribution of extreme events and long term memory", "comments": "8 pages, 6 figures", "journal-ref": "Phys. Rev. E 78, 051113 (2008)", "doi": "10.1103/PhysRevE.78.051113", "report-no": null, "categories": "q-fin.ST physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The distribution of recurrence times or return intervals between extreme\nevents is important to characterize and understand the behavior of physical\nsystems and phenomena in many disciplines. It is well known that many physical\nprocesses in nature and society display long range correlations. Hence, in the\nlast few years, considerable research effort has been directed towards studying\nthe distribution of return intervals for long range correlated time series.\nBased on numerical simulations, it was shown that the return interval\ndistributions are of stretched exponential type. In this paper, we obtain an\nanalytical expression for the distribution of return intervals in long range\ncorrelated time series which holds good when the average return intervals are\nlarge. We show that the distribution is actually a product of power law and a\nstretched exponential form. We also discuss the regimes of validity and perform\ndetailed studies on how the return interval distribution depends on the\nthreshold used to define extreme events.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2008 05:31:44 GMT"}], "update_date": "2008-12-29", "authors_parsed": [["Santhanam", "M. S.", ""], ["Kantz", "Holger", ""]]}, {"id": "0803.1769", "submitter": "Bouchaud Jean-Philippe", "authors": "Armand Joulin, Augustin Lefevre, Daniel Grunberg, Jean-Philippe\n  Bouchaud (CFM)", "title": "Stock price jumps: news and volume play a minor role", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to understand the origin of stock price jumps, we cross-correlate\nhigh-frequency time series of stock returns with different news feeds. We find\nthat neither idiosyncratic news nor market wide news can explain the frequency\nand amplitude of price jumps. We find that the volatility patterns around jumps\nand around news are quite different: jumps are followed by increased\nvolatility, whereas news tend on average to be followed by lower volatility\nlevels. The shape of the volatility relaxation is also markedly different in\nthe two cases. Finally, we provide direct evidence that large transaction\nvolumes are_not_ responsible for large price jumps. We conjecture that most\nprice jumps are induced by order flow fluctuations close to the point of\nvanishing liquidity.\n", "versions": [{"version": "v1", "created": "Wed, 12 Mar 2008 13:32:42 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Joulin", "Armand", "", "CFM"], ["Lefevre", "Augustin", "", "CFM"], ["Grunberg", "Daniel", "", "CFM"], ["Bouchaud", "Jean-Philippe", "", "CFM"]]}, {"id": "0803.2773", "submitter": "Wei-Xing Zhou", "authors": "Wei-Xing Zhou (ECUST)", "title": "Multifractal detrended cross-correlation analysis for two nonstationary\n  signals", "comments": "4 RevTex pages including 6 eps figures", "journal-ref": "Physical Review E 77 (6), 066211 (2008).", "doi": "10.1103/PhysRevE.77.066211", "report-no": "RCE Working Paper No. 2008-04", "categories": "physics.data-an physics.soc-ph q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is ubiquitous in natural and social sciences that two variables, recorded\ntemporally or spatially in a complex system, are cross-correlated and possess\nmultifractal features. We propose a new method called multifractal detrended\ncross-correlation analysis (MF-DXA) to investigate the multifractal behaviors\nin the power-law cross-correlations between two records in one or higher\ndimensions. The method is validated with cross-correlated 1D and 2D binomial\nmeasures and multifractal random walks. Application to two financial time\nseries is also illustrated.\n", "versions": [{"version": "v1", "created": "Wed, 19 Mar 2008 10:20:37 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Zhou", "Wei-Xing", "", "ECUST"]]}, {"id": "0803.3733", "submitter": "Eva Racz", "authors": "\\'Eva R\\'acz, Zolt\\'an Eisler, J\\'anos Kert\\'esz", "title": "Comment on ``Tests of scaling and universality of the distributions of\n  trade size and share volume: Evidence from three distinct markets\" by Plerou\n  and Stanley, Phys. Rev. E 76, 046109 (2007)", "comments": "1 page, 1 figure", "journal-ref": null, "doi": "10.1103/PhysRevE.79.068101", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Comment on ``Tests of scaling and universality of the distributions of trade\nsize and share volume: Evidence from three distinct markets\" by Plerou and\nStanley, Phys. Rev. E 76, 046109 (2007)\n", "versions": [{"version": "v1", "created": "Wed, 26 Mar 2008 17:26:48 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Rácz", "Éva", ""], ["Eisler", "Zoltán", ""], ["Kertész", "János", ""]]}, {"id": "0803.3884", "submitter": "Pawe{\\l} Sieczka", "authors": "Pawe{\\l} Sieczka, Janusz A. Ho{\\l}yst", "title": "Correlations in commodity markets", "comments": null, "journal-ref": "Physica A 388 (2009) 1621-1630", "doi": "10.1016/j.physa.2009.01.004", "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we analyzed dependencies in commodity markets investigating\ncorrelations of future contracts for commodities over the period 1998.09.01 -\n2007.12.14. We constructed a minimal spanning tree based on the correlation\nmatrix. The tree provides evidence for sector clusterization of investigated\ncontracts. We also studied dynamical properties of commodity dependencies. It\nturned out that the market was constantly getting more correlated within the\ninvestigated period, although the increase of correlation was distributed\nnonuniformly among all contracts, and depended on contracts branches.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2008 11:59:24 GMT"}, {"version": "v2", "created": "Mon, 5 Jan 2009 17:27:55 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Sieczka", "Paweł", ""], ["Hołyst", "Janusz A.", ""]]}, {"id": "0803.3959", "submitter": "Joseph McCauley", "authors": "Joseph L. McCauley, Kevin E. Bassler, and Gemunu H. Gunaratne", "title": "Integration I(d) of Nonstationary Time Series: Stationary and\n  nonstationary increments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph physics.data-an q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The method of cointegration in regression analysis is based on an assumption\nof stationary increments. Stationary increments with fixed time lag are called\nintegration I(d). A class of regression models where cointegration works was\nidentified by Granger and yields the ergodic behavior required for equilibrium\nexpectations in standard economics. Detrended finance market returns are\nmartingales, and martingales do not satisfy regression equations. We extend the\nstandard discussion to discover the class of detrended processes beyond\nstandard regression models that satisfy integration I(d). In the language of\neconometrics, the models of interest are unit root models, meaning martingales.\nTypical martingales do not have stationary increments, and those that do\ngenerally do not admit ergodicity. Our analysis leads us to comment on the lack\nof equilibrium observed earlier between FX rates and relative price levels.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2008 15:28:12 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["McCauley", "Joseph L.", ""], ["Bassler", "Kevin E.", ""], ["Gunaratne", "Gemunu H.", ""]]}, {"id": "0803.4480", "submitter": "Joseph McCauley", "authors": "Joseph L. McCauley", "title": "ARCH and GARCH Models vs. Martingale Volatility of Finance Market\n  Returns", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  ARCH and GARCH models assume either i.i.d. or (what economists lable as)\nwhite noise as is usual in regression analysis while assuming memory in a\nconditional mean square fluctuation with stationary increments. We will show\nthat ARCH/GARCH is inconsistent with uncorrelated increments, violating the\ni.i.d. and white assumptions and finance data and the efficient market\nhypothesis as well.\n", "versions": [{"version": "v1", "created": "Mon, 31 Mar 2008 15:36:42 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["McCauley", "Joseph L.", ""]]}]