[{"id": "0808.0372", "submitter": "Naoya Sazuka", "authors": "Naoya Sazuka, Jun-ichi Inoue, Enrico Scalas", "title": "The distribution of first-passage times and durations in FOREX and\n  future markets", "comments": "26pages, 15figures, using elsart.cls", "journal-ref": null, "doi": "10.1016/j.physa.2009.03.027", "report-no": null, "categories": "q-fin.TR physics.data-an physics.soc-ph q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Possible distributions are discussed for intertrade durations and\nfirst-passage processes in financial markets. The view-point of renewal theory\nis assumed. In order to represent market data with relatively long durations,\ntwo types of distributions are used, namely, a distribution derived from the\nso-called Mittag-Leffler survival function and the Weibull distribution. For\nMittag-Leffler type distribution, the average waiting time (residual life time)\nis strongly dependent on the choice of a cut-off parameter t_ max, whereas the\nresults based on the Weibull distribution do not depend on such a cut-off.\nTherefore, a Weibull distribution is more convenient than a Mittag-Leffler type\none if one wishes to evaluate relevant statistics such as average waiting time\nin financial markets with long durations. On the other side, we find that the\nGini index is rather independent of the cut-off parameter. Based on the above\nconsiderations, we propose a good candidate for describing the distribution of\nfirst-passage time in a market: The Weibull distribution with a power-law tail.\nThis distribution compensates the gap between theoretical and empirical results\nmuch more efficiently than a simple Weibull distribution. We also give a useful\nformula to determine an optimal crossover point minimizing the difference\nbetween the empirical average waiting time and the one predicted from renewal\ntheory. Moreover, we discuss the limitation of our distributions by applying\nour distribution to the analysis of the BTP future and calculating the average\nwaiting time. We find that our distribution is applicable as long as durations\nfollow a Weibull-law for short times and do not have too heavy a tail.\n", "versions": [{"version": "v1", "created": "Mon, 4 Aug 2008 02:48:58 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Sazuka", "Naoya", ""], ["Inoue", "Jun-ichi", ""], ["Scalas", "Enrico", ""]]}, {"id": "0808.1090", "submitter": "Shane Jensen", "authors": "Shane T. Jensen and Stephen H. Shore", "title": "Changes in the Distribution of Income Volatility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent research has documented a significant rise in the volatility (e.g.,\nexpected squared change) of individual incomes in the U.S. since the 1970s.\nExisting measures of this trend abstract from individual heterogeneity,\neffectively estimating an increase in average volatility. We decompose this\nincrease in average volatility and find that it is far from representative of\nthe experience of most people: there has been no systematic rise in volatility\nfor the vast majority of individuals. The rise in average volatility has been\ndriven almost entirely by a sharp rise in the income volatility of those\nexpected to have the most volatile incomes, identified ex-ante by large income\nchanges in the past. We document that the self-employed and those who\nself-identify as risk-tolerant are much more likely to have such volatile\nincomes; these groups have experienced much larger increases in income\nvolatility than the population at large. These results color the policy\nimplications one might draw from the rise in average volatility. While the\nbasic results are apparent from PSID summary statistics, providing a complete\ncharacterization of the dynamics of the volatility distribution is a\nmethodological challenge. We resolve these difficulties with a Markovian\nhierarchical Dirichlet process that builds on work from the non-parametric\nBayesian statistics literature.\n", "versions": [{"version": "v1", "created": "Thu, 7 Aug 2008 19:13:19 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Jensen", "Shane T.", ""], ["Shore", "Stephen H.", ""]]}, {"id": "0808.1538", "submitter": "Yannick Malevergne", "authors": "Jerome Coulon, Yannick Malevergne", "title": "Heterogeneous expectations and long range correlation of the volatility\n  of asset returns", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inspired by the recent literature on aggregation theory, we aim at relating\nthe long range correlation of the stocks return volatility to the heterogeneity\nof the investors' expectations about the level of the future volatility. Based\non a semi-parametric model of investors' anticipations, we make the connection\nbetween the distributional properties of the heterogeneity parameters and the\nauto-covariance/auto-correlation functions of the realized volatility. We\nreport different behaviors, or change of convention, whose observation depends\non the market phase under consideration. In particular, we report and justify\nthe fact that the volatility exhibits significantly longer memory during the\nphases of speculative bubble than during the phase of recovery following the\ncollapse of a speculative bubble.\n", "versions": [{"version": "v1", "created": "Mon, 11 Aug 2008 16:51:29 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Coulon", "Jerome", ""], ["Malevergne", "Yannick", ""]]}, {"id": "0808.1710", "submitter": "Kostas Triantafyllopoulos", "authors": "Kostas Triantafyllopoulos and Giovanni Montana", "title": "Dynamic modeling of mean-reverting spreads for statistical arbitrage", "comments": "34 pages, 6 figures. Submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.PM stat.AP stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Statistical arbitrage strategies, such as pairs trading and its\ngeneralizations, rely on the construction of mean-reverting spreads enjoying a\ncertain degree of predictability. Gaussian linear state-space processes have\nrecently been proposed as a model for such spreads under the assumption that\nthe observed process is a noisy realization of some hidden states. Real-time\nestimation of the unobserved spread process can reveal temporary market\ninefficiencies which can then be exploited to generate excess returns. Building\non previous work, we embrace the state-space framework for modeling spread\nprocesses and extend this methodology along three different directions. First,\nwe introduce time-dependency in the model parameters, which allows for quick\nadaptation to changes in the data generating process. Second, we provide an\non-line estimation algorithm that can be constantly run in real-time. Being\ncomputationally fast, the algorithm is particularly suitable for building\naggressive trading strategies based on high-frequency data and may be used as a\nmonitoring device for mean-reversion. Finally, our framework naturally provides\ninformative uncertainty measures of all the estimated parameters. Experimental\nresults based on Monte Carlo simulations and historical equity data are\ndiscussed, including a co-integration relationship involving two\nexchange-traded funds.\n", "versions": [{"version": "v1", "created": "Tue, 12 Aug 2008 18:57:42 GMT"}, {"version": "v2", "created": "Sun, 8 Feb 2009 17:47:22 GMT"}, {"version": "v3", "created": "Tue, 19 May 2009 09:32:26 GMT"}], "update_date": "2009-05-19", "authors_parsed": [["Triantafyllopoulos", "Kostas", ""], ["Montana", "Giovanni", ""]]}, {"id": "0808.3200", "submitter": "Fengzhong Wang", "authors": "Fengzhong Wang, Kazuko Yamasaki, Shlomo Havlin and H. Eugene Stanley", "title": "Multifactor Analysis of Multiscaling in Volatility Return Intervals", "comments": "16 pages, 6 figures", "journal-ref": "Phys. Rev. E 79, 016103 (2009)", "doi": "10.1103/PhysRevE.79.016103", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the volatility time series of 1137 most traded stocks in the US\nstock markets for the two-year period 2001-02 and analyze their return\nintervals $\\tau$, which are time intervals between volatilities above a given\nthreshold $q$. We explore the probability density function of $\\tau$,\n$P_q(\\tau)$, assuming a stretched exponential function, $P_q(\\tau) \\sim\ne^{-\\tau^\\gamma}$. We find that the exponent $\\gamma$ depends on the threshold\nin the range between $q=1$ and 6 standard deviations of the volatility. This\nfinding supports the multiscaling nature of the return interval distribution.\nTo better understand the multiscaling origin, we study how $\\gamma$ depends on\nfour essential factors, capitalization, risk, number of trades and return. We\nshow that $\\gamma$ depends on the capitalization, risk and return but almost\ndoes not depend on the number of trades. This suggests that $\\gamma$ relates to\nthe portfolio selection but not on the market activity. To further characterize\nthe multiscaling of individual stocks, we fit the moments of $\\tau$, $\\mu_m\n\\equiv <(\\tau/<\\tau>)^m>^{1/m}$, in the range of $10 < <\\tau> \\le 100$ by a\npower-law, $\\mu_m \\sim <\\tau>^\\delta$. The exponent $\\delta$ is found also to\ndepend on the capitalization, risk and return but not on the number of trades,\nand its tendency is opposite to that of $\\gamma$. Moreover, we show that\n$\\delta$ decreases with $\\gamma$ approximately by a linear relation. The return\nintervals demonstrate the temporal structure of volatilities and our findings\nsuggest that their multiscaling features may be helpful for portfolio\noptimization.\n", "versions": [{"version": "v1", "created": "Sat, 23 Aug 2008 16:14:10 GMT"}], "update_date": "2009-03-05", "authors_parsed": [["Wang", "Fengzhong", ""], ["Yamasaki", "Kazuko", ""], ["Havlin", "Shlomo", ""], ["Stanley", "H. Eugene", ""]]}, {"id": "0808.3269", "submitter": "Alexander S. Balankin", "authors": "Alexander S. Balankin", "title": "Dynamic scaling approach to study time series fluctuations", "comments": "25 pages, 7 figures, 1 table", "journal-ref": "PHYSICAL REVIEW E 76, 056120 (2007)", "doi": "10.1103/PhysRevE.76.056120", "report-no": null, "categories": "physics.data-an q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new approach for properly analyzing stochastic time series by\nmapping the dynamics of time series fluctuations onto a suitable nonequilibrium\nsurface-growth problem. In this framework, the fluctuation sampling time\ninterval plays the role of time variable, whereas the physical time is treated\nas the analog of spatial variable. In this way we found that the fluctuations\nof many real-world time series satisfy the analog of the Family-Viscek dynamic\nscaling ansatz. This finding permits to use the powerful tools of kinetic\nroughening theory to classify, model, and forecast the fluctuations of\nreal-world time series.\n", "versions": [{"version": "v1", "created": "Sun, 24 Aug 2008 20:37:49 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Balankin", "Alexander S.", ""]]}, {"id": "0808.3339", "submitter": "Kota Watanabe", "authors": "Kota Watanabe, Hideki Takayasu and Misako Takayasu", "title": "Random walker in a temporally deforming higher-order potential forces\n  observed in financial crisis", "comments": "5 pages, 13 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.80.056110", "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Basic peculiarities of market price fluctuations are known to be well\ndescribed by a recently developed random walk model in a temporally deforming\nquadric potential force whose center is given by a moving average of past price\ntraces [Physica A 370, pp91-97, 2006]. By analyzing high-frequency financial\ntime series of exceptional events such as bubbles and crashes, we confirm the\nappearance of nonlinear potential force in the markets. We show statistical\nsignificance of its existence by applying the information criterion. This new\ntime series analysis is expected to be applied widely for detecting a\nnon-stationary symptom in random phenomena.\n", "versions": [{"version": "v1", "created": "Mon, 25 Aug 2008 11:48:26 GMT"}, {"version": "v2", "created": "Thu, 27 Nov 2008 06:38:39 GMT"}], "update_date": "2013-05-29", "authors_parsed": [["Watanabe", "Kota", ""], ["Takayasu", "Hideki", ""], ["Takayasu", "Misako", ""]]}, {"id": "0808.3360", "submitter": "Jaroslaw Kwapien", "authors": "Stanislaw Drozdz, Jaroslaw Kwapien, Pawel Oswiecimka", "title": "Criticality Characteristics of Current Oil Price Dynamics", "comments": "to appear in Acta Physica Polonica A", "journal-ref": "Acta Physica Polonica A 114, 699-702 (2008)", "doi": null, "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Methodology that recently lead us to predict to an amazing accuracy the date\n(July 11, 2008) of reverse of the oil price up trend is briefly summarized and\nsome further aspects of the related oil price dynamics elaborated. This\nmethodology is based on the concept of discrete scale invariance whose\nfinance-prediction-oriented variant involves such elements as log-periodic\nself-similarity, the universal preferred scaling factor lambda=2, and allows a\nphenomenon of the \"super-bubble\". From this perspective the present (as of\nAugust 22, 2008) violent - but still log-periodically decelerating - decrease\nof the oil prices is associated with the decay of such a \"super- bubble\" that\nhas started developing about one year ago on top of the longer-term oil price\nincreasing phase (normal bubble) whose ultimate termination is evaluated to\noccur in around mid 2010.\n", "versions": [{"version": "v1", "created": "Mon, 25 Aug 2008 13:57:13 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Drozdz", "Stanislaw", ""], ["Kwapien", "Jaroslaw", ""], ["Oswiecimka", "Pawel", ""]]}]