[{"id": "0904.0900", "submitter": "Zolt\\'an Eisler", "authors": "Zoltan Eisler, Jean-Philippe Bouchaud, Julien Kockelkoren", "title": "The price impact of order book events: market orders, limit orders and\n  cancellations", "comments": "31 pages, 30 figures, accepted to Quantitative Finance; slightly\n  modified text, a changed figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While the long-ranged correlation of market orders and their impact on prices\nhas been relatively well studied in the literature, the corresponding studies\nof limit orders and cancellations are scarce. We provide here an empirical\nstudy of the cross-correlation between all these different events, and their\nrespective impact on future price changes. We define and extract from the data\nthe \"bare\" impact these events would have, if they were to happen in isolation.\nFor large tick stocks, we show that a model where the bare impact of all events\nis permanent and non-fluctuating is in good agreement with the data. For small\ntick stocks, however, bare impacts must contain a history dependent part,\nreflecting the internal fluctuations of the order book. We show that this\neffect can be accurately described by an autoregressive model on the past order\nflow. This framework allows us to decompose the impact of an event into three\nparts: an instantaneous jump component, the modification of the future rates of\nthe different events, and the modification of the future gaps behind the best\nquotes. We compare in detail the present formalism with the temporary impact\nmodel that was proposed earlier to describe the impact of market orders when\nother types of events are not observed. Finally, we extend the model to\ndescribe the dynamics of the bid-ask spread.\n", "versions": [{"version": "v1", "created": "Mon, 6 Apr 2009 10:23:55 GMT"}, {"version": "v2", "created": "Tue, 23 Mar 2010 09:31:08 GMT"}, {"version": "v3", "created": "Fri, 17 Sep 2010 08:37:15 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Eisler", "Zoltan", ""], ["Bouchaud", "Jean-Philippe", ""], ["Kockelkoren", "Julien", ""]]}, {"id": "0904.1042", "submitter": "Guohua Mu", "authors": "Guo-Hua Mu, Wei Chen, J\\'anos Kert\\'esz, Wei-Xing Zhou", "title": "Long-term correlations and multifractal analysis of trading volumes for\n  Chinese stocks", "comments": "12 pages, 6 figures, 1 table", "journal-ref": "Physics Procedia,Volume 3, Issue 5, August 2010, Pages 1631-1640", "doi": "10.1016/j.phpro.2010.07.003", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the temporal correlations and multifractal nature of trading\nvolume of 22 liquid stocks traded on the Shenzhen Stock Exchange in 2003. We\nfind that the trading volume exhibit size-dependent non-universal long memory\nand multifractal nature. No crossover in the power-law dependence of the\ndetrended fluctuation functions is observed. Our results show that the intraday\npattern in the trading volume has negligible impact on the long memory and\nmultifractality.\n", "versions": [{"version": "v1", "created": "Tue, 7 Apr 2009 08:43:10 GMT"}], "update_date": "2010-08-18", "authors_parsed": [["Mu", "Guo-Hua", ""], ["Chen", "Wei", ""], ["Kertész", "János", ""], ["Zhou", "Wei-Xing", ""]]}, {"id": "0904.1107", "submitter": "Fei Ren", "authors": "Fei Ren, Gao-Feng Gu, and Wei-Xing Zhou", "title": "Scaling and memory in the return intervals of realized volatility", "comments": "12 pages, 6 figures, 2 tables", "journal-ref": "Physica A 388 (2009) 4787-4796", "doi": "10.1016/j.physa.2009.08.009", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We perform return interval analysis of 1-min {\\em{realized volatility}}\ndefined by the sum of absolute high-frequency intraday returns for the Shanghai\nStock Exchange Composite Index (SSEC) and 22 constituent stocks of SSEC. The\nscaling behavior and memory effect of the return intervals between successive\nrealized volatilities above a certain threshold $q$ are carefully investigated.\nIn comparison with the volatility defined by the closest tick prices to the\nminute marks, the return interval distribution for the realized volatility\nshows a better scaling behavior since 20 stocks (out of 22 stocks) and the SSEC\npass the Kolmogorov-Smirnov (KS) test and exhibit scaling behaviors, among\nwhich the scaling function for 8 stocks could be approximated well by a\nstretched exponential distribution revealed by the KS goodness-of-fit test\nunder the significance level of 5%. The improved scaling behavior is further\nconfirmed by the relation between the fitted exponent $\\gamma$ and the\nthreshold $q$. In addition, the similarity of the return interval distributions\nfor different stocks is also observed for the realized volatility. The\ninvestigation of the conditional probability distribution and the detrended\nfluctuation analysis (DFA) show that both short-term and long-term memory\nexists in the return intervals of realized volatility.\n", "versions": [{"version": "v1", "created": "Tue, 7 Apr 2009 10:41:11 GMT"}, {"version": "v2", "created": "Wed, 19 Aug 2009 07:57:28 GMT"}], "update_date": "2009-09-11", "authors_parsed": [["Ren", "Fei", ""], ["Gu", "Gao-Feng", ""], ["Zhou", "Wei-Xing", ""]]}, {"id": "0904.1361", "submitter": "Pavel Shevchenko V", "authors": "Dominik D. Lambrigger, Pavel V. Shevchenko and Mario V. W\\\"uthrich", "title": "The Quantification of Operational Risk using Internal Data, Relevant\n  External Data and Expert Opinions", "comments": null, "journal-ref": "The Journal of Operational Risk 2(3), pp.3-27, 2007.\n  www.journalofoperationalrisk.com", "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To quantify an operational risk capital charge under Basel II, many banks\nadopt a Loss Distribution Approach. Under this approach, quantification of the\nfrequency and severity distributions of operational risk involves the bank's\ninternal data, expert opinions and relevant external data. In this paper we\nsuggest a new approach, based on a Bayesian inference method, that allows for a\ncombination of these three sources of information to estimate the parameters of\nthe risk frequency and severity distributions.\n", "versions": [{"version": "v1", "created": "Wed, 8 Apr 2009 15:14:42 GMT"}], "update_date": "2009-04-09", "authors_parsed": [["Lambrigger", "Dominik D.", ""], ["Shevchenko", "Pavel V.", ""], ["Wüthrich", "Mario V.", ""]]}, {"id": "0904.1404", "submitter": "Linda Ponta", "authors": "Massimo Riccaboni, Fabio Pammolli, Sergey V. Buldyrev, Linda Ponta and\n  H. Eugene Stanley", "title": "The Size Variance Relationship of Business Firm Growth Rates", "comments": null, "journal-ref": "Proc. Natl. Acad. Sci. USA 105, 19595-19600 (2008)", "doi": "10.1073/pnas.0810478105", "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The relationship between the size and the variance of firm growth rates is\nknown to follow an approximate power-law behavior $\\sigma(S) \\sim\nS^{-\\beta(S)}$ where $S$ is the firm size and $\\beta(S)\\approx 0.2$ is an\nexponent weakly dependent on $S$. Here we show how a model of proportional\ngrowth which treats firms as classes composed of various number of units of\nvariable size, can explain this size-variance dependence. In general, the model\npredicts that $\\beta(S)$ must exhibit a crossover from $\\beta(0)=0$ to\n$\\beta(\\infty)=1/2$. For a realistic set of parameters, $\\beta(S)$ is\napproximately constant and can vary in the range from 0.14 to 0.2 depending on\nthe average number of units in the firm. We test the model with a unique\nindustry specific database in which firm sales are given in terms of the sum of\nthe sales of all their products. We find that the model is consistent with the\nempirically observed size-variance relationship.\n", "versions": [{"version": "v1", "created": "Wed, 8 Apr 2009 18:42:07 GMT"}, {"version": "v2", "created": "Thu, 9 Apr 2009 15:01:24 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Riccaboni", "Massimo", ""], ["Pammolli", "Fabio", ""], ["Buldyrev", "Sergey V.", ""], ["Ponta", "Linda", ""], ["Stanley", "H. Eugene", ""]]}, {"id": "0904.1500", "submitter": "Sovan Mitra", "authors": "Sovan Mitra", "title": "Regime Switching Volatility Calibration by the Baum-Welch Method", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regime switching volatility models provide a tractable method of modelling\nstochastic volatility. Currently the most popular method of regime switching\ncalibration is the Hamilton filter. We propose using the Baum-Welch algorithm,\nan established technique from Engineering, to calibrate regime switching models\ninstead. We demonstrate the Baum-Welch algorithm and discuss the significant\nadvantages that it provides compared to the Hamilton filter. We provide\ncomputational results of calibrating the Baum-Welch filter to S&P 500 data and\nvalidate its performance in and out of sample.\n", "versions": [{"version": "v1", "created": "Thu, 9 Apr 2009 10:56:27 GMT"}], "update_date": "2009-04-10", "authors_parsed": [["Mitra", "Sovan", ""]]}, {"id": "0904.3004", "submitter": "Siew-Ann Cheong", "authors": "Wong Jian Cheng, Lian Heng, and Cheong Siew Ann", "title": "Macroeconomic Phase Transitions Detected from the Dow Jones Industrial\n  Average Time Series", "comments": "elsarticle, 18 pages, 3 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we perform statistical segmentation and clustering analysis of\nthe Dow Jones Industrial Average time series between January 1997 and August\n2008. Modeling the index movements and log-index movements as stationary\nGaussian processes, we find a total of 116 and 119 statistically stationary\nsegments respectively. These can then be grouped into between five to seven\nclusters, each representing a different macroeconomic phase. The macroeconomic\nphases are distinguished primarily by their volatilities. We find the US\neconomy, as measured by the DJI, spends most of its time in a low-volatility\nphase and a high-volatility phase. The former can be roughly associated with\neconomic expansion, while the latter contains the economic contraction phase in\nthe standard economic cycle. Both phases are interrupted by a\nmoderate-volatility market, but extremely-high-volatility market crashes are\nfound mostly within the high-volatility phase. From the temporal distribution\nof various phases, we see a high-volatility phase from mid-1998 to mid-2003,\nand another starting mid-2007 (the current global financial crisis).\nTransitions from the low-volatility phase to the high-volatility phase are\npreceded by a series of precursor shocks, whereas the transition from the\nhigh-volatility phase to the low-volatility phase is preceded by a series of\ninverted shocks. The time scale for both types of transitions is about a year.\nWe also identify the July 1997 Asian Financial Crisis to be the trigger for the\nmid-1998 transition, and an unnamed May 2006 market event related to\ncorrections in the Chinese markets to be the trigger for the mid-2007\ntransition.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2009 11:28:48 GMT"}], "update_date": "2009-04-21", "authors_parsed": [["Cheng", "Wong Jian", ""], ["Heng", "Lian", ""], ["Ann", "Cheong Siew", ""]]}, {"id": "0904.4131", "submitter": "Alexander Weiss", "authors": "Alexander Weiss", "title": "Executing large orders in a microscopic market model", "comments": "32 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper, Alfonsi, Fruth and Schied (AFS) propose a simple order\nbook based model for the impact of large orders on stock prices. They use this\nmodel to derive optimal strategies for the execution of large orders. We apply\nthese strategies to an agent-based stochastic order book model that was\nrecently proposed by Bovier, \\v{C}ern\\'{y} and Hryniv, but already the\ncalibration fails. In particular, from our simulations the recovery speed of\nthe market after a large order is clearly dependent on the order size, whereas\nthe AFS model assumes a constant speed. For this reason, we propose a\ngeneralization of the AFS model, the GAFS model, that incorporates this\ndependency, and prove the optimal investment strategies. As a corollary, we\nfind that we can derive the ``correct'' constant resilience speed for the AFS\nmodel from the GAFS model such that the optimal strategies of the AFS and the\nGAFS model coincide. Finally, we show that the costs of applying the optimal\nstrategies of the GAFS model to the artificial market environment still differ\nsignificantly from the model predictions, indicating that even the improved\nmodel does not capture all of the relevant details of a real market.\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2009 11:27:53 GMT"}, {"version": "v2", "created": "Mon, 11 Jan 2010 08:03:16 GMT"}], "update_date": "2010-01-11", "authors_parsed": [["Weiss", "Alexander", ""]]}]