[{"id": "1011.1796", "submitter": "Fabio Sigrist", "authors": "Fabio Sigrist and Werner A. Stahel", "title": "Using The Censored Gamma Distribution for Modeling Fractional Response\n  Variables with an Application to Loss Given Default", "comments": null, "journal-ref": null, "doi": "10.2143/AST.41.2.2136992", "report-no": null, "categories": "stat.AP q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regression models for limited continuous dependent variables having a\nnon-negligible probability of attaining exactly their limits are presented. The\nmodels differ in the number of parameters and in their flexibility. Fractional\ndata being a special case of limited dependent data, the models also apply to\nvariables that are a fraction or a proportion. It is shown how to fit these\nmodels and they are applied to a Loss Given Default dataset from insurance to\nwhich they provide a good fit.\n", "versions": [{"version": "v1", "created": "Mon, 8 Nov 2010 13:21:05 GMT"}, {"version": "v2", "created": "Wed, 17 Nov 2010 08:30:02 GMT"}, {"version": "v3", "created": "Fri, 19 Aug 2011 13:35:55 GMT"}, {"version": "v4", "created": "Sat, 24 Dec 2011 01:31:51 GMT"}, {"version": "v5", "created": "Wed, 30 May 2012 07:14:00 GMT"}], "update_date": "2012-05-31", "authors_parsed": [["Sigrist", "Fabio", ""], ["Stahel", "Werner A.", ""]]}, {"id": "1011.2385", "submitter": "Jaroslaw Kwapien", "authors": "Stanislaw Drozdz, Jaroslaw Kwapien, Pawel Oswiecimka, Rafal Rak", "title": "The foreign exchange market: return distributions, multifractality,\n  anomalous multifractality and Epps effect", "comments": null, "journal-ref": "New J. Phys. 12, 105003 (2010)", "doi": "10.1088/1367-2630/12/10/105003", "report-no": null, "categories": "q-fin.ST physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a systematic study of various statistical characteristics of\nhigh-frequency returns from the foreign exchange market. This study is based on\nsix exchange rates forming two triangles: EUR-GBP-USD and GBP-CHF-JPY. It is\nshown that the exchange rate return fluctuations for all the pairs considered\nare well described by the nonextensive statistics in terms of q-Gaussians.\nThere exist some small quantitative variations in the nonextensivity\nq-parameter values for different exchange rates and this can be related to the\nimportance of a given exchange rate in the world's currency trade. Temporal\ncorrelations organize the series of returns such that they develop the\nmultifractal characteristics for all the exchange rates with a varying degree\nof symmetry of the singularity spectrum f(alpha) however. The most symmetric\nspectrum is identified for the GBP/USD. We also form time series of triangular\nresidual returns and find that the distributions of their fluctuations develop\ndisproportionately heavier tails as compared to small fluctuations which\nexcludes description in terms of q-Gaussians. The multifractal characteristics\nfor these residual returns reveal such anomalous properties like negative\nsingularity exponents and even negative singularity spectra. Such anomalous\nmultifractal measures have so far been considered in the literature in\nconnection with the diffusion limited aggregation and with turbulence. We find\nthat market inefficiency on short time scales leads to the occurrence of the\nEpps effect on much longer time scales. Although the currency market is much\nmore liquid than the stock markets and it has much larger transaction\nfrequency, the building-up of correlations takes up to several hours - time\nthat does not differ much from what is observed in the stock markets. This may\nsuggest that non-synchronicity of transactions is not the unique source of the\nobserved effect.\n", "versions": [{"version": "v1", "created": "Tue, 26 Oct 2010 12:48:08 GMT"}], "update_date": "2011-05-24", "authors_parsed": [["Drozdz", "Stanislaw", ""], ["Kwapien", "Jaroslaw", ""], ["Oswiecimka", "Pawel", ""], ["Rak", "Rafal", ""]]}, {"id": "1011.2674", "submitter": "Davor Horvatic", "authors": "Boris Podobnik, Davor Horvatic, Alexander M. Petersen, H. Eugene\n  Stanley", "title": "Cross-correlations between volume change and price change", "comments": "7 pages, 5 figures", "journal-ref": "PNAS December 29, 2009 vol. 106 no. 52 22079-22084", "doi": "10.1073/pnas.0911983106", "report-no": null, "categories": "q-fin.ST physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In finance, one usually deals not with prices but with growth rates $R$,\ndefined as the difference in logarithm between two consecutive prices. Here we\nconsider not the trading volume, but rather the volume growth rate $\\tilde R$,\nthe difference in logarithm between two consecutive values of trading volume.\nTo this end, we use several methods to analyze the properties of volume changes\n$|\\tilde R|$, and their relationship to price changes $|R|$. We analyze\n$14,981$ daily recordings of the S\\&P 500 index over the 59-year period\n1950--2009, and find power-law {\\it cross-correlations\\/} between $|R|$ and\n$|\\tilde R|$ using detrended cross-correlation analysis (DCCA). We introduce a\njoint stochastic process that models these cross-correlations. Motivated by the\nrelationship between $| R|$ and $|\\tilde R|$, we estimate the tail exponent\n${\\tilde\\alpha}$ of the probability density function $P(|\\tilde R|) \\sim\n|\\tilde R|^{-1 -\\tilde\\alpha}$ for both the S\\&P 500 index as well as the\ncollection of 1819 constituents of the New York Stock Exchange Composite index\non 17 July 2009. As a new method to estimate $\\tilde\\alpha$, we calculate the\ntime intervals $\\tau_q$ between events where $\\tilde R>q$. We demonstrate that\n$\\bar\\tau_q$, the average of $\\tau_q$, obeys $\\bar \\tau_q \\sim\nq^{\\tilde\\alpha}$. We find $\\tilde \\alpha \\approx 3$. Furthermore, by\naggregating all $\\tau_q$ values of 28 global financial indices, we also observe\nan approximate inverse cubic law.\n", "versions": [{"version": "v1", "created": "Thu, 11 Nov 2010 15:00:46 GMT"}], "update_date": "2010-11-12", "authors_parsed": [["Podobnik", "Boris", ""], ["Horvatic", "Davor", ""], ["Petersen", "Alexander M.", ""], ["Stanley", "H. Eugene", ""]]}, {"id": "1011.2882", "submitter": "Ryan Woodard", "authors": "Ryan Woodard, Didier Sornette, Maxim Fedorovsky", "title": "The Financial Bubble Experiment: Advanced Diagnostics and Forecasts of\n  Bubble Terminations, Volume III", "comments": "27 assets and final analysis posted; see complete report at\n  http://www.er.ethz.ch/fco/index", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is the third installment of the Financial Bubble Experiment. Here we\nprovide the digital fingerprint of an electronic document in which we identify\n27 bubbles in 27 different global assets; for 25 of these assets, we present\nwindows of dates of the most likely ending time of each bubble. We will provide\nthat document of the original analysis on 2 May 2011.\n", "versions": [{"version": "v1", "created": "Fri, 12 Nov 2010 11:25:27 GMT"}, {"version": "v2", "created": "Tue, 3 May 2011 15:40:03 GMT"}], "update_date": "2011-05-04", "authors_parsed": [["Woodard", "Ryan", ""], ["Sornette", "Didier", ""], ["Fedorovsky", "Maxim", ""]]}, {"id": "1011.3225", "submitter": "Daniel Fenn", "authors": "Daniel J. Fenn, Mason A. Porter, Stacy Williams, Mark McDonald, Neil\n  F. Johnson, and Nick S. Jones", "title": "Temporal Evolution of Financial Market Correlations", "comments": "15 pages, 10 figures, 1 table. Accepted for publication in Phys. Rev.\n  E. v2 includes additional sections", "journal-ref": "Physical Review E, Vol. 84, No. 2: 026109 (2011)", "doi": "10.1103/PhysRevE.84.026109", "report-no": null, "categories": "q-fin.ST physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate financial market correlations using random matrix theory and\nprincipal component analysis. We use random matrix theory to demonstrate that\ncorrelation matrices of asset price changes contain structure that is\nincompatible with uncorrelated random price changes. We then identify the\nprincipal components of these correlation matrices and demonstrate that a small\nnumber of components accounts for a large proportion of the variability of the\nmarkets that we consider. We then characterize the time-evolving relationships\nbetween the different assets by investigating the correlations between the\nasset price time series and principal components. Using this approach, we\nuncover notable changes that occurred in financial markets and identify the\nassets that were significantly affected by these changes. We show in particular\nthat there was an increase in the strength of the relationships between several\ndifferent markets following the 2007--2008 credit and liquidity crisis.\n", "versions": [{"version": "v1", "created": "Sun, 14 Nov 2010 13:02:42 GMT"}, {"version": "v2", "created": "Mon, 23 May 2011 12:25:10 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Fenn", "Daniel J.", ""], ["Porter", "Mason A.", ""], ["Williams", "Stacy", ""], ["McDonald", "Mark", ""], ["Johnson", "Neil F.", ""], ["Jones", "Nick S.", ""]]}, {"id": "1011.3246", "submitter": "Teemu Pennanen", "authors": "Matti Koivu and Teemu Pennanen", "title": "Reduced form models of bond portfolios", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive simple return models for several classes of bond portfolios. With\nonly one or two risk factors our models are able to explain most of the return\nvariations in portfolios of fixed rate government bonds, inflation linked\ngovernment bonds and investment grade corporate bonds. The underlying risk\nfactors have natural interpretations which make the models well suited for risk\nmanagement and portfolio design.\n", "versions": [{"version": "v1", "created": "Sun, 14 Nov 2010 18:43:59 GMT"}], "update_date": "2010-11-16", "authors_parsed": [["Koivu", "Matti", ""], ["Pennanen", "Teemu", ""]]}, {"id": "1011.3707", "submitter": "Yaneer Bar-Yam", "authors": "Dion Harmon, Blake Stacey, Yavni Bar-Yam and Yaneer Bar-Yam", "title": "Networks of Economic Market Interdependence and Systemic Risk", "comments": "9 pages, 2 compound figures", "journal-ref": null, "doi": null, "report-no": "NECSI Report 2009-03-01", "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamic network of relationships among corporations underlies cascading\neconomic failures including the current economic crisis, and can be inferred\nfrom correlations in market value fluctuations. We analyze the time dependence\nof the network of correlations to reveal the changing relationships among the\nfinancial, technology, and basic materials sectors with rising and falling\nmarkets and resource constraints. The financial sector links otherwise weakly\ncoupled economic sectors, particularly during economic declines. Such links\nincrease economic risk and the extent of cascading failures. Our results\nsuggest that firewalls between financial services for different sectors would\nreduce systemic risk without hampering economic growth.\n", "versions": [{"version": "v1", "created": "Tue, 16 Nov 2010 14:41:50 GMT"}, {"version": "v2", "created": "Wed, 17 Nov 2010 01:57:38 GMT"}], "update_date": "2010-11-18", "authors_parsed": [["Harmon", "Dion", ""], ["Stacey", "Blake", ""], ["Bar-Yam", "Yavni", ""], ["Bar-Yam", "Yaneer", ""]]}, {"id": "1011.4336", "submitter": "Kyu-Min Lee", "authors": "Kyu-Min Lee, Jae-Suk Yang, Gunn Kim, Jaesung Lee, Kwang-Il Goh, and\n  In-mook Kim", "title": "Impact of the topology of global macroeconomic network on the spreading\n  of economic crises", "comments": "25 pages, 11 figures, Supplementary Information available upon\n  request", "journal-ref": "PLoS ONE 6(3): e18443 (2011)", "doi": "10.1371/journal.pone.0018443", "report-no": null, "categories": "q-fin.ST cond-mat.stat-mech physics.data-an physics.soc-ph q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Throughout economic history, the global economy has experienced recurring\ncrises. The persistent recurrence of such economic crises calls for an\nunderstanding of their generic features rather than treating them as singular\nevents. The global economic system is a highly complex system and can best be\nviewed in terms of a network of interacting macroeconomic agents. In this\nregard, from the perspective of collective network dynamics, here we explore\nhow the topology of global macroeconomic network affects the patterns of\nspreading of economic crises. Using a simple toy model of crisis spreading, we\ndemonstrate that an individual country's role in crisis spreading is not only\ndependent on its gross macroeconomic capacities, but also on its local and\nglobal connectivity profile in the context of the world economic network. We\nfind that on one hand clustering of weak links at the regional scale can\nsignificantly aggravate the spread of crises, but on the other hand the current\nnetwork structure at the global scale harbors a higher tolerance of extreme\ncrises compared to more \"globalized\" random networks. These results suggest\nthat there can be a potential hidden cost in the ongoing globalization movement\ntowards establishing less-constrained, trans-regional economic links between\ncountries, by increasing the vulnerability of global economic system to extreme\ncrises.\n", "versions": [{"version": "v1", "created": "Fri, 19 Nov 2010 03:00:15 GMT"}, {"version": "v2", "created": "Wed, 13 Apr 2011 00:13:15 GMT"}], "update_date": "2011-04-14", "authors_parsed": [["Lee", "Kyu-Min", ""], ["Yang", "Jae-Suk", ""], ["Kim", "Gunn", ""], ["Lee", "Jaesung", ""], ["Goh", "Kwang-Il", ""], ["Kim", "In-mook", ""]]}, {"id": "1011.5020", "submitter": "Anouar Ben Mabrouk", "authors": "Ines Kahloul, Anouar Ben Mabrouk and Slah-Eddine Hallara", "title": "Wavelet-Based Prediction for Governance, Diversification and Value\n  Creation Variables", "comments": "22 pages", "journal-ref": "International Research Journal of Finance and Economics, 60\n  (2010), pp. 15-28", "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the possibility of completing data bases of a sample of governance,\ndiversification and value creation variables by providing a well adapted method\nto reconstruct the missing parts in order to obtain a complete sample to be\napplied for testing the ownership-structure/diversification relationship. It\nconsists of a dynamic procedure based on wavelets. A comparison with Neural\nNetworks, the most used method, is provided to prove the efficiency of the\nhere-developed one. The empirical tests are conducted on a set of French firms.\n", "versions": [{"version": "v1", "created": "Tue, 23 Nov 2010 07:34:59 GMT"}], "update_date": "2012-12-27", "authors_parsed": [["Kahloul", "Ines", ""], ["Mabrouk", "Anouar Ben", ""], ["Hallara", "Slah-Eddine", ""]]}, {"id": "1011.5187", "submitter": "Ricardo Lopez-Ruiz", "authors": "Carmen Pellicer-Lostao and Ricardo Lopez-Ruiz", "title": "Transition from Exponential to Power Law Distributions in a Chaotic\n  Market", "comments": "12 pages, 4 figures", "journal-ref": null, "doi": "10.1142/S0129183111016038", "report-no": null, "categories": "q-fin.TR nlin.CD q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Economy is demanding new models, able to understand and predict the evolution\nof markets. To this respect, Econophysics offers models of markets as complex\nsystems, that try to comprehend macro-, system-wide states of the economy from\nthe interaction of many agents at micro-level. One of these models is the\ngas-like model for trading markets. This tries to predict money distributions\nin closed economies and quite simply, obtains the ones observed in real\neconomies. However, it reveals technical hitches to explain the power law\ndistribution, observed in individuals with high incomes. In this work, non\nlinear dynamics is introduced in the gas-like model in way that an effort to\novercome these flaws. A particular chaotic dynamics is used to break the\npairing symmetry of agents $(i,j)\\Leftrightarrow(j,i)$. The results demonstrate\nthat a \"chaotic gas-like model\" can reproduce the Exponential and Power law\ndistributions observed in real economies. Moreover, it controls the transition\nbetween them. This may give some insight of the micro-level causes that\noriginate unfair distributions of money in a global society. Ultimately, the\nchaotic model makes obvious the inherent instability of asymmetric scenarios,\nwhere sinks of wealth appear and doom the market to extreme inequality.\n", "versions": [{"version": "v1", "created": "Tue, 23 Nov 2010 18:15:18 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Pellicer-Lostao", "Carmen", ""], ["Lopez-Ruiz", "Ricardo", ""]]}, {"id": "1011.5810", "submitter": "Romain Allez", "authors": "Pierre-Alain Reigneron, Romain Allez and Jean-Philippe Bouchaud", "title": "Principal Regression Analysis and the index leverage effect", "comments": "10 pages, 7 figures", "journal-ref": "Physica A: Statistical Mechanics and its Applications, 390 (2011)", "doi": "10.1016/j.physa.2011.04.007", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We revisit the index leverage effect, that can be decomposed into a\nvolatility effect and a correlation effect. We investigate the latter using a\nmatrix regression analysis, that we call `Principal Regression Analysis' (PRA)\nand for which we provide some analytical (using Random Matrix Theory) and\nnumerical benchmarks. We find that downward index trends increase the average\ncorrelation between stocks (as measured by the most negative eigenvalue of the\nconditional correlation matrix), and makes the market mode more uniform. Upward\ntrends, on the other hand, also increase the average correlation between stocks\nbut rotates the corresponding market mode {\\it away} from uniformity. There are\ntwo time scales associated to these effects, a short one on the order of a\nmonth (20 trading days), and a longer time scale on the order of a year. We\nalso find indications of a leverage effect for sectorial correlations as well,\nwhich reveals itself in the second and third mode of the PRA.\n", "versions": [{"version": "v1", "created": "Fri, 26 Nov 2010 14:52:09 GMT"}, {"version": "v2", "created": "Thu, 17 Feb 2011 16:01:42 GMT"}], "update_date": "2013-01-29", "authors_parsed": [["Reigneron", "Pierre-Alain", ""], ["Allez", "Romain", ""], ["Bouchaud", "Jean-Philippe", ""]]}, {"id": "1011.5983", "submitter": "Giacomo Bormetti", "authors": "Danilo Delpini, Giacomo Bormetti", "title": "Minimal model of financial stylized facts", "comments": "9 pages, 5 figures and 3 tables", "journal-ref": null, "doi": "10.1103/PhysRevE.83.041111", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we afford the statistical characterization of a linear\nStochastic Volatility Model featuring Inverse Gamma stationary distribution for\nthe instantaneous volatility. We detail the derivation of the moments of the\nreturn distribution, revealing the role of the Inverse Gamma law in the\nemergence of fat tails, and of the relevant correlation functions. We also\npropose a systematic methodology for estimating the parameters, and we describe\nthe empirical analysis of the Standard & Poor 500 index daily returns,\nconfirming the ability of the model to capture many of the established stylized\nfact as well as the scaling properties of empirical distributions over\ndifferent time horizons.\n", "versions": [{"version": "v1", "created": "Sat, 27 Nov 2010 16:52:33 GMT"}, {"version": "v2", "created": "Wed, 9 Mar 2011 15:33:14 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Delpini", "Danilo", ""], ["Bormetti", "Giacomo", ""]]}, {"id": "1011.6097", "submitter": "Tristan Fletcher", "authors": "Tristan Fletcher, Zakria Hussain and John Shawe-Taylor", "title": "Currency Forecasting using Multiple Kernel Learning with Financially\n  Motivated Features", "comments": "To be presented at NIPS 2010 workshop: New Directions in Multiple\n  Kernel Learning", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple Kernel Learning (MKL) is used to replicate the signal combination\nprocess that trading rules embody when they aggregate multiple sources of\nfinancial information when predicting an asset's price movements. A set of\nfinancially motivated kernels is constructed for the EURUSD currency pair and\nis used to predict the direction of price movement for the currency over\nmultiple time horizons. MKL is shown to outperform each of the kernels\nindividually in terms of predictive accuracy. Furthermore, the kernel\nweightings selected by MKL highlights which of the financial features\nrepresented by the kernels are the most informative for predictive tasks.\n", "versions": [{"version": "v1", "created": "Sun, 28 Nov 2010 22:23:18 GMT"}], "update_date": "2010-11-30", "authors_parsed": [["Fletcher", "Tristan", ""], ["Hussain", "Zakria", ""], ["Shawe-Taylor", "John", ""]]}, {"id": "1011.6402", "submitter": "Arseniy Kukanov", "authors": "Rama Cont and Arseniy Kukanov and Sasha Stoikov", "title": "The Price Impact of Order Book Events", "comments": null, "journal-ref": "JOURNAL OF FINANCIAL ECONOMETRICS (Winter 2014) 12 (1): 47-88", "doi": "10.1093/jjfinec/nbt003", "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the price impact of order book events - limit orders, market orders\nand cancelations - using the NYSE TAQ data for 50 U.S. stocks. We show that,\nover short time intervals, price changes are mainly driven by the order flow\nimbalance, defined as the imbalance between supply and demand at the best bid\nand ask prices. Our study reveals a linear relation between order flow\nimbalance and price changes, with a slope inversely proportional to the market\ndepth. These results are shown to be robust to seasonality effects, and stable\nacross time scales and across stocks. We argue that this linear price impact\nmodel, together with a scaling argument, implies the empirically observed\n\"square-root\" relation between price changes and trading volume. However, the\nrelation between price changes and trade volume is found to be noisy and less\nrobust than the one based on order flow imbalance.\n", "versions": [{"version": "v1", "created": "Mon, 29 Nov 2010 22:05:46 GMT"}, {"version": "v2", "created": "Thu, 2 Dec 2010 23:31:48 GMT"}, {"version": "v3", "created": "Wed, 13 Apr 2011 03:59:17 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Cont", "Rama", ""], ["Kukanov", "Arseniy", ""], ["Stoikov", "Sasha", ""]]}]