[{"id": "1104.3328", "submitter": "Bercu Bernard", "authors": "Bernard Bercu, Frederic Proia", "title": "A sharp analysis on the asymptotic behavior of the Durbin-Watson\n  statistic for the first-order autoregressive process", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.PR q-fin.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this paper is to provide a sharp analysis on the asymptotic\nbehavior of the Durbin-Watson statistic. We focus our attention on the\nfirst-order autoregressive process where the driven noise is also given by a\nfirst-order autoregressive process. We establish the almost sure convergence\nand the asymptotic normality for both the least squares estimator of the\nunknown parameter of the autoregressive process as well as for the serial\ncorrelation estimator associated to the driven noise. In addition, the almost\nsure rates of convergence of our estimates are also provided. It allows us to\nestablish the almost sure convergence and the asymptotic normality for the\nDurbin-Watson statistic. Finally, we propose a new bilateral statistical test\nfor residual autocorrelation.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2011 17:53:11 GMT"}], "update_date": "2011-04-19", "authors_parsed": [["Bercu", "Bernard", ""], ["Proia", "Frederic", ""]]}, {"id": "1104.3616", "submitter": "Wei-Xing Zhou", "authors": "Wei-Xing Zhou (ECUST), Guo-Hua Mu (ECUST), Wei Chen (SZSE), Didier\n  Sornette (ETH Zurich)", "title": "Strategies used as spectroscopy of financial markets reveal new stylized\n  facts", "comments": "13 pages including 5 figures and 1 table", "journal-ref": "PLoS ONE 6 (9), e24391 (2011)", "doi": "10.1371/journal.pone.0024391", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new set of stylized facts quantifying the structure of financial\nmarkets. The key idea is to study the combined structure of both investment\nstrategies and prices in order to open a qualitatively new level of\nunderstanding of financial and economic markets. We study the detailed order\nflow on the Shenzhen Stock Exchange of China for the whole year of 2003. This\nenormous dataset allows us to compare (i) a closed national market (A-shares)\nwith an international market (B-shares), (ii) individuals and institutions and\n(iii) real investors to random strategies with respect to timing that share\notherwise all other characteristics. We find that more trading results in\nsmaller net return due to trading frictions. We unveiled quantitative power\nlaws with non-trivial exponents, that quantify the deterioration of performance\nwith frequency and with holding period of the strategies used by investors.\nRandom strategies are found to perform much better than real ones, both for\nwinners and losers. Surprising large arbitrage opportunities exist, especially\nwhen using zero-intelligence strategies. This is a diagnostic of possible\ninefficiencies of these financial markets.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2011 00:56:41 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Zhou", "Wei-Xing", "", "ECUST"], ["Mu", "Guo-Hua", "", "ECUST"], ["Chen", "Wei", "", "SZSE"], ["Sornette", "Didier", "", "ETH Zurich"]]}, {"id": "1104.4234", "submitter": "Enrico Scalas", "authors": "Mauro Politi, Taisei Kaizoji, Enrico Scalas", "title": "Full characterization of the fractional Poisson process", "comments": "4 figures, paper submitted to PRL", "journal-ref": null, "doi": "10.1209/0295-5075/96/20004", "report-no": null, "categories": "math.PR physics.data-an q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The fractional Poisson process (FPP) is a counting process with independent\nand identically distributed inter-event times following the Mittag-Leffler\ndistribution. This process is very useful in several fields of applied and\ntheoretical physics including models for anomalous diffusion. Contrary to the\nwell-known Poisson process, the fractional Poisson process does not have\nstationary and independent increments. It is not a L\\'evy process and it is not\na Markov process. In this letter, we present formulae for its\nfinite-dimensional distribution functions, fully characterizing the process.\nThese exact analytical results are compared to Monte Carlo simulations.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2011 11:32:27 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Politi", "Mauro", ""], ["Kaizoji", "Taisei", ""], ["Scalas", "Enrico", ""]]}, {"id": "1104.4596", "submitter": "Rama  Cont", "authors": "Rama Cont, Adrien De Larrard", "title": "Price dynamics in a Markovian limit order market", "comments": "18 pages, 5 figures", "journal-ref": "SIAM Journal on Financial Mathematics, Vol 4, No 1, 1-25 (2013)", "doi": "10.1137/110856605", "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose and study a simple stochastic model for the dynamics of a limit\norder book, in which arrivals of market order, limit orders and order\ncancellations are described in terms of a Markovian queueing system. Through\nits analytical tractability, the model allows to obtain analytical expressions\nfor various quantities of interest such as the distribution of the duration\nbetween price changes, the distribution and autocorrelation of price changes,\nand the probability of an upward move in the price, {\\it conditional} on the\nstate of the order book. We study the diffusion limit of the price process and\nexpress the volatility of price changes in terms of parameters describing the\narrival rates of buy and sell orders and cancelations. These analytical results\nprovide some insight into the relation between order flow and price dynamics in\norder-driven markets.\n", "versions": [{"version": "v1", "created": "Sun, 24 Apr 2011 00:16:56 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Cont", "Rama", ""], ["De Larrard", "Adrien", ""]]}, {"id": "1104.4716", "submitter": "Richard Pincak", "authors": "D. Horvath, R. Pincak", "title": "From the currency rate quotations onto strings and brane world scenarios", "comments": "SORS Research a.s, 040 01 Kosice, Slovak Republic, 28 pages, 10\n  figures", "journal-ref": "Physica A 391 (2012) 5172-5188", "doi": "10.1016/j.physa.2012.06.006", "report-no": null, "categories": "q-fin.ST q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the paper, we study numerically the projections of the real exchange rate\ndynamics onto the string-like topology. Our approach is inspired by the\ncontemporary movements in the string theory. The string map of data is defined\nhere by the boundary conditions, characteristic length, real valued and the\nmethod of redistribution of information. As a practical matter, this map\nrepresents the detrending and data standardization procedure. We introduced\nmaps onto 1-end-point and 2-end-point open strings that satisfy the Dirichlet\nand Neumann boundary conditions. The questions of the choice of\nextra-dimensions, symmetries, duality and ways to the partial compactification\nare discussed. Subsequently, we pass to higher dimensional and more complex\nobjects. The 2D-Brane was suggested which incorporated bid-ask spreads.\nPolarization by the spread was considered which admitted analyzing arbitrage\nopportunities on the market where transaction costs are taken into account. The\nmodel of the rotating string which naturally yields calculation of angular\nmomentum is suitable for tracking of several currency pairs. The systematic way\nwhich allows one suggest more structured maps suitable for a simultaneous study\nof several currency pairs was analyzed by means of the G\\^{a}teaux generalized\ndifferential calculus. The effect of the string and brane maps on test data was\nstudied by comparing their mean statistical characteristics. The study revealed\nnotable differences between topologies. We review the dependence on the\ncharacteristic string length, mean fluctuations and properties of the\nintra-string statistics. The study explores the coupling of the string\namplitude and volatility.\n", "versions": [{"version": "v1", "created": "Fri, 22 Apr 2011 17:42:06 GMT"}], "update_date": "2015-05-28", "authors_parsed": [["Horvath", "D.", ""], ["Pincak", "R.", ""]]}, {"id": "1104.5326", "submitter": "Paul Schneider", "authors": "Damir Filipovi\\'c and Eberhard Mayerhofer and Paul Schneider", "title": "Density Approximations for Multivariate Affine Jump-Diffusion Processes", "comments": null, "journal-ref": "Journal of Econometrics,Volume 176, Issue 2, October 2013, Pages\n  93-111", "doi": null, "report-no": null, "categories": "math.ST q-fin.CP q-fin.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce closed-form transition density expansions for multivariate\naffine jump-diffusion processes. The expansions rely on a general approximation\ntheory which we develop in weighted Hilbert spaces for random variables which\npossess all polynomial moments. We establish parametric conditions which\nguarantee existence and differentiability of transition densities of affine\nmodels and show how they naturally fit into the approximation framework.\nEmpirical applications in credit risk, likelihood inference, and option pricing\nhighlight the usefulness of our expansions. The approximations are extremely\nfast to evaluate, and they perform very accurately and numerically stable.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2011 08:58:49 GMT"}, {"version": "v2", "created": "Mon, 24 Oct 2011 11:11:49 GMT"}], "update_date": "2016-01-07", "authors_parsed": [["Filipović", "Damir", ""], ["Mayerhofer", "Eberhard", ""], ["Schneider", "Paul", ""]]}]