[{"id": "1107.0480", "submitter": "Andrey Korotayev", "authors": "Askar Akaev, Alexei Fomin, and Andrey Korotayev", "title": "The Second Wave of the Global Crisis? A Log-Periodic Oscillation\n  Analysis of Commodity Price Series", "comments": "12 pages, 9 figures. This research has been supported by the\n  Presidium of the Russian Academy of Sciences (Project \"Complex System\n  Analysis and Mathematical Modeling of the World Dynamics\")", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article continues our analysis of the gold price dynamics that was\npublished in December 2010 (abs/1012.4118) and forecasted the possibility of\nthe \"burst of the gold bubble\" in April - June 2011. Our recent analysis\nsuggests the possibility of one more substantial fluctuation before the final\ncollapse in July 2011. On the other hand, in early 2011 we detected a number of\nother commodity bubbles and forecasted the start of their collapse in May -\nJune 2011. We demonstrate that this collapse has actually begun, which in\nconjunction with the forthcoming burst of the gold bubble suggests that the\nWorld System is entering a bifurcation zone bearing rather high risks of the\nsecond wave of the global financial-economic crisis. Indeed, on the one hand,\nit is obvious that such a collapse may lead to huge losses or even bankruptcies\nof many of the major participants of exchange games and their dependent firms\nand banks. Therefore, the immediate market reaction is likely to be entirely\nnegative. Negative impact on the market could well be amplified by numerous\npublications in the media and business press, drawing analogies with the events\nof the early 1980s and earlier similar events, as well as by losses of\nshareholders of bankrupt companies. On the other hand, investments in gold also\nlead to the diversion of funds from stock market investments and to the\nreduction in the production of goods and services. If at the time of the\ncollapse some promising areas of investment appear in the developed and / or\ndeveloping countries, the investment can move to those markets, which, on the\ncontrary, could contribute to the production of new goods and services and\naccelerate the way out of the crisis. It is also obvious that the decline of\nthe oil (and other energy/mineral resources) prices may contribute to\nacceleration of world economic growth rates and world economic recovery.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jul 2011 17:56:58 GMT"}], "update_date": "2011-07-05", "authors_parsed": [["Akaev", "Askar", ""], ["Fomin", "Alexei", ""], ["Korotayev", "Andrey", ""]]}, {"id": "1107.1174", "submitter": "Josep Perello", "authors": "Josep Perell\\'o, Mario Guti\\'errez-Roig, Jaume Masoliver", "title": "Scaling properties and universality of first-passage time probabilities\n  in financial markets", "comments": "7 pages, 5 figures", "journal-ref": "Phys. Rev. E 84, 066110 (2011)", "doi": "10.1103/PhysRevE.84.066110", "report-no": null, "categories": "q-fin.ST math-ph math.MP physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial markets provide an ideal frame for the study of crossing or\nfirst-passage time events of non-Gaussian correlated dynamics mainly because\nlarge data sets are available. Tick-by-tick data of six futures markets are\nherein considered resulting in fat tailed first-passage time probabilities. The\nscaling of the return with the standard deviation collapses the probabilities\nof all markets examined, and also for different time horizons, into single\ncurves, suggesting that first-passage statistics is market independent (at\nleast for high-frequency data). On the other hand, a very closely related\nquantity, the survival probability, shows, away from the center and tails of\nthe distribution, a hyperbolic $t^{-1/2}$ decay typical of a Markovian dynamics\nalbeit the existence of memory in markets. Modifications of the Weibull and\nStudent distributions are good candidates for the phenomenological description\nof first-passage time properties under certain regimes. The scaling strategies\nshown may be useful for risk control and algorithmic trading.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2011 16:05:58 GMT"}, {"version": "v2", "created": "Thu, 29 Sep 2011 16:06:13 GMT"}], "update_date": "2011-12-23", "authors_parsed": [["Perelló", "Josep", ""], ["Gutiérrez-Roig", "Mario", ""], ["Masoliver", "Jaume", ""]]}, {"id": "1107.2346", "submitter": "Miquel Montero", "authors": "Miquel Montero", "title": "Parrondo-like behavior in continuous-time random walks with memory", "comments": "8 pages, 3 figures, revtex; enlarged and revised version", "journal-ref": "Phys. Rev. E 84, 051139 (2011)", "doi": "10.1103/PhysRevE.84.051139", "report-no": null, "categories": "math-ph cond-mat.stat-mech math.MP q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Continuous-Time Random Walk (CTRW) formalism can be adapted to encompass\nstochastic processes with memory. In this article we will show how the random\ncombination of two different unbiased CTRWs can give raise to a process with\nclear drift, if one of them is a CTRW with memory. If one identifies the other\none as noise, the effect can be thought as a kind of stochastic resonance. The\nultimate origin of this phenomenon is the same of the Parrondo's paradox in\ngame theory\n", "versions": [{"version": "v1", "created": "Tue, 12 Jul 2011 16:51:19 GMT"}, {"version": "v2", "created": "Tue, 27 Sep 2011 13:08:08 GMT"}, {"version": "v3", "created": "Fri, 11 Nov 2011 15:47:59 GMT"}], "update_date": "2011-11-30", "authors_parsed": [["Montero", "Miquel", ""]]}, {"id": "1107.3364", "submitter": "Zolt\\'an Eisler", "authors": "Zoltan Eisler, Jean-Philippe Bouchaud, Julien Kockelkoren", "title": "Models for the impact of all order book events", "comments": "12 pages, 5 figures, to appear in the proceedings of Market\n  Microstructure - Confronting Many Viewpoints", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a general framework to describe the impact of different events in\nthe order book, that generalizes previous work on the impact of market orders.\nTwo different modeling routes can be considered, which are equivalent when only\nmarket orders are taken into account. One model posits that each event type has\na temporary impact (TIM). The \"history dependent impact\" model (HDIM), on the\nother hand, assumes that only price-changing events have a direct impact,\nitself modulated by the past history of all events through an \"influence\nmatrix\" that measures how much, on average, an event of a given type affects\nthe immediate impact of a price-changing event of the same sign in the future.\nWe find in particular that aggressive market orders tend to reduce the impact\nof further aggressive market orders of the same sign (and increase the impact\nof aggressive market orders of opposite sign). We discuss the relative merits\nof TIM and HDIM, in particular concerning their ability to reproduce accurately\nthe price diffusion pattern. We find that in spite of theoretical\ninconsistencies, TIM appears to fare better than HDIM when compared to\nempirical data. We ascribe this paradox to an uncontrolled approximation used\nto calibrate HDIMs, calling for further work on this issue.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2011 06:47:26 GMT"}], "update_date": "2011-07-19", "authors_parsed": [["Eisler", "Zoltan", ""], ["Bouchaud", "Jean-Philippe", ""], ["Kockelkoren", "Julien", ""]]}, {"id": "1107.3456", "submitter": "Tomaso Aste", "authors": "Tomaso Aste, Ruggero Gramatica and T. Di Matteo", "title": "Exploring complex networks via topological embedding on surfaces", "comments": "18 pages, 7 figures", "journal-ref": "Physical Review E 86, 036109 (2012)", "doi": "10.1103/PhysRevE.86.036109", "report-no": null, "categories": "cond-mat.other math-ph math.MP physics.soc-ph q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate that graphs embedded on surfaces are a powerful and practical\ntool to generate, characterize and simulate networks with a broad range of\nproperties. Remarkably, the study of topologically embedded graphs is\nnon-restrictive because any network can be embedded on a surface with\nsufficiently high genus. The local properties of the network are affected by\nthe surface genus which, for example, produces significant changes in the\ndegree distribution and in the clustering coefficient. The global properties of\nthe graph are also strongly affected by the surface genus which is constraining\nthe degree of interwoveness, changing the scaling properties from\nlarge-world-kind (small genus) to small- and ultra-small-world-kind (large\ngenus). Two elementary moves allow the exploration of all networks embeddable\non a given surface and naturally introduce a tool to develop a statistical\nmechanics description. Within such a framework, we study the properties of\ntopologically-embedded graphs at high and low `temperatures' observing the\nformation of increasingly regular structures by cooling the system. We show\nthat the cooling dynamics is strongly affected by the surface genus with the\nmanifestation of a glassy-like freezing transitions occurring when the amount\nof topological disorder is low.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2011 14:47:49 GMT"}, {"version": "v2", "created": "Fri, 24 Aug 2012 22:59:14 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Aste", "Tomaso", ""], ["Gramatica", "Ruggero", ""], ["Di Matteo", "T.", ""]]}, {"id": "1107.4146", "submitter": "Leonidas Sandoval", "authors": "Leonidas Sandoval Junior", "title": "A Map of the Brazilian Stock Market", "comments": null, "journal-ref": "Advances in Complex Systems 2, Vol. 15, No. 4 (2012) 1250042", "doi": "10.1142/S0219525912500427", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use the correlation matrix of stocks returns in order to create maps of\nthe S\\~ao Paulo Stock Exchange (BM&F-Bovespa), Brazil's main stock exchange.\nThe data reffer to the year 2010, and the correlations between stock returns\nlead to the construction of a minimum spanning tree and of asset graphs with a\nvariety of threshold values. The results are analised using techniques of\nnetwork theory.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jul 2011 01:32:20 GMT"}, {"version": "v2", "created": "Thu, 28 Mar 2013 18:26:37 GMT"}], "update_date": "2014-08-11", "authors_parsed": [["Junior", "Leonidas Sandoval", ""]]}, {"id": "1107.4476", "submitter": "Gabriele La Spada", "authors": "Gabriele La Spada, Fabrizio Lillo", "title": "The effect of round-off error on long memory processes", "comments": "44 pages, 4 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study how the round-off (or discretization) error changes the statistical\nproperties of a Gaussian long memory process. We show that the autocovariance\nand the spectral density of the discretized process are asymptotically rescaled\nby a factor smaller than one, and we compute exactly this scaling factor.\nConsequently, we find that the discretized process is also long memory with the\nsame Hurst exponent as the original process. We consider the properties of two\nestimators of the Hurst exponent, namely the local Whittle (LW) estimator and\nthe Detrended Fluctuation Analysis (DFA). By using analytical considerations\nand numerical simulations we show that, in presence of round-off error, both\nestimators are severely negatively biased in finite samples. Under regularity\nconditions we prove that the LW estimator applied to discretized processes is\nconsistent and asymptotically normal. Moreover, we compute the asymptotic\nproperties of the DFA for a generic (i.e. non Gaussian) long memory process and\nwe apply the result to discretized processes.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2011 10:52:47 GMT"}, {"version": "v2", "created": "Thu, 24 Nov 2011 23:36:45 GMT"}, {"version": "v3", "created": "Thu, 14 Mar 2013 21:11:48 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["La Spada", "Gabriele", ""], ["Lillo", "Fabrizio", ""]]}]