[{"id": "1203.0643", "submitter": "Santanu Dey", "authors": "Santanu Dey and Sandeep Juneja", "title": "Incorporating fat tails in financial models using entropic divergence\n  measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.GN q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the existing financial literature, entropy based ideas have been proposed\nin portfolio optimization, in model calibration for options pricing as well as\nin ascertaining a pricing measure in incomplete markets. The abstracted problem\ncorresponds to finding a probability measure that minimizes the relative\nentropy (also called $I$-divergence) with respect to a known measure while it\nsatisfies certain moment constraints on functions of underlying assets. In this\npaper, we show that under $I$-divergence, the optimal solution may not exist\nwhen the underlying assets have fat tailed distributions, ubiquitous in\nfinancial practice. We note that this drawback may be corrected if\n`polynomial-divergence' is used. This divergence can be seen to be equivalent\nto the well known (relative) Tsallis or (relative) Renyi entropy. We discuss\nexistence and uniqueness issues related to this new optimization problem as\nwell as the nature of the optimal solution under different objectives. We also\nidentify the optimal solution structure under $I$-divergence as well as\npolynomial-divergence when the associated constraints include those on marginal\ndistribution of functions of underlying assets. These results are applied to a\nsimple problem of model calibration to options prices as well as to portfolio\nmodeling in Markowitz framework, where we note that a reasonable view that a\nparticular portfolio of assets has heavy tailed losses may lead to fatter and\nmore reasonable tail distributions of all assets.\n", "versions": [{"version": "v1", "created": "Sat, 3 Mar 2012 11:22:13 GMT"}], "update_date": "2012-03-06", "authors_parsed": [["Dey", "Santanu", ""], ["Juneja", "Sandeep", ""]]}, {"id": "1203.1313", "submitter": "Marco  Lagi", "authors": "Marco Lagi, Yavni Bar-Yam, Karla Z. Bertrand and Yaneer Bar-Yam", "title": "UPDATE February 2012 - The Food Crises: Predictive validation of a\n  quantitative model of food prices including speculators and ethanol\n  conversion", "comments": "5 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": "New England Complex Systems Institute (NECSI) Report 2012-03-01", "categories": "physics.soc-ph q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Increases in global food prices have led to widespread hunger and social\nunrest---and an imperative to understand their causes. In a previous paper\npublished in September 2011, we constructed for the first time a dynamic model\nthat quantitatively agreed with food prices. Specifically, the model fit the\nFAO Food Price Index time series from January 2004 to March 2011, inclusive.\nThe results showed that the dominant causes of price increases during this\nperiod were investor speculation and ethanol conversion. The model included\ninvestor trend following as well as shifting between commodities, equities and\nbonds to take advantage of increased expected returns. Here, we extend the food\nprices model to January 2012, without modifying the model but simply continuing\nits dynamics. The agreement is still precise, validating both the descriptive\nand predictive abilities of the analysis. Policy actions are needed to avoid a\nthird speculative bubble that would cause prices to rise above recent peaks by\nthe end of 2012.\n", "versions": [{"version": "v1", "created": "Tue, 6 Mar 2012 20:46:52 GMT"}, {"version": "v2", "created": "Fri, 30 Mar 2012 21:47:43 GMT"}], "update_date": "2012-04-03", "authors_parsed": [["Lagi", "Marco", ""], ["Bar-Yam", "Yavni", ""], ["Bertrand", "Karla Z.", ""], ["Bar-Yam", "Yaneer", ""]]}, {"id": "1203.1880", "submitter": "Zoltan Neda", "authors": "N. Derzsy, Z. Neda, M.A. Santos", "title": "Income distribution patterns from a complete social security database", "comments": "10 pages, 7 Figures", "journal-ref": null, "doi": "10.1016/j.physa.2012.06.027", "report-no": null, "categories": "physics.soc-ph q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the income distribution of employees for 9 consecutive years\n(2001-2009) using a complete social security database for an economically\nimportant district of Romania. The database contains detailed information on\nmore than half million taxpayers, including their monthly salaries from all\nemployers where they worked. Besides studying the characteristic distribution\nfunctions in the high and low/medium income limits, the database allows us a\ndetailed dynamical study by following the time-evolution of the taxpayers\nincome. To our knowledge, this is the first extensive study of this kind (a\nprevious japanese taxpayers survey was limited to two years). In the high\nincome limit we prove once again the validity of Pareto's law, obtaining a\nperfect scaling on four orders of magnitude in the rank for all the studied\nyears. The obtained Pareto exponents are quite stable with values around\n$\\alpha \\approx 2.5$, in spite of the fact that during this period the economy\ndeveloped rapidly and also a financial-economic crisis hit Romania in\n2007-2008. For the low and medium income category we confirmed the\nexponential-type income distribution. Following the income of employees in\ntime, we have found that the top limit of the income distribution is a highly\ndynamical region with strong fluctuations in the rank. In this region, the\nobserved dynamics is consistent with a multiplicative random growth hypothesis.\nContrarily with previous results obtained for the japanese employees, we find\nthat the logarithmic growth-rate is not independent of the income.\n", "versions": [{"version": "v1", "created": "Thu, 8 Mar 2012 18:38:24 GMT"}], "update_date": "2015-06-04", "authors_parsed": [["Derzsy", "N.", ""], ["Neda", "Z.", ""], ["Santos", "M. A.", ""]]}, {"id": "1203.2017", "submitter": "Josef Teichmann", "authors": "Josef Teichmann and Mario V. W\\\"uthrich", "title": "Consistent Long-Term Yield Curve Prediction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an arbitrage-free non-parametric yield curve prediction model\nwhich takes the full (discretized) yield curve as state variable. We believe\nthat absence of arbitrage is an important model feature in case of highly\ncorrelated data, as it is the case for interest rates. Furthermore, the model\nstructure allows to separate clearly the tasks of estimating the volatility\nstructure and of calibrating market prices of risk. The empirical part includes\ntests on modeling assumptions, back testing and a comparison with the\nVasi\\v{c}ek short rate model.\n", "versions": [{"version": "v1", "created": "Fri, 9 Mar 2012 08:39:18 GMT"}], "update_date": "2012-03-12", "authors_parsed": [["Teichmann", "Josef", ""], ["Wüthrich", "Mario V.", ""]]}, {"id": "1203.2250", "submitter": "Valeriy Zakamulin I", "authors": "Valeriy Zakamulin", "title": "Low-Frequency Waves and the Medium to Long-Term US Stock Market Outlook", "comments": "There is an updated version of the paper on the http://www.ssrn.com", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we provide compelling evidence of cyclical mean reversion and\nmultiperiod stock return predictability over horizons of about 30 years with a\nhalf-life of about 15 years. This implies that the US stock market follows a\nlong-term rhythm where a period of above average returns tends to be followed\nby a period of below average returns. We demonstrate that this long-term stock\nmarket rhythm moves in lockstep with corresponding long-term economic, social,\nand political rhythms in the US. Assuming that the past relationship between\nthese rhythms will hold unaltered in the future, we provide the medium to\nlong-term stock market outlook.\n", "versions": [{"version": "v1", "created": "Sat, 10 Mar 2012 14:02:14 GMT"}, {"version": "v2", "created": "Thu, 31 Jan 2013 14:48:26 GMT"}], "update_date": "2013-02-01", "authors_parsed": [["Zakamulin", "Valeriy", ""]]}, {"id": "1203.2564", "submitter": "Lorenzo Hern\\'andez", "authors": "Lorenzo Hern\\'andez, Jorge Tejero, Alberto Su\\'arez and Santiago\n  Carrillo-Men\\'endez", "title": "Percentiles of sums of heavy-tailed random variables: Beyond the\n  single-loss approximation", "comments": "18 pages, 20 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A perturbative approach is used to derive approximations of arbitrary order\nto estimate high percentiles of sums of positive independent random variables\nthat exhibit heavy tails. Closed-form expressions for the successive\napproximations are obtained both when the number of terms in the sum is\ndeterministic and when it is random. The zeroth order approximation is the\npercentile of the maximum term in the sum. Higher orders in the perturbative\nseries involve the right-truncated moments of the individual random variables\nthat appear in the sum. These censored moments are always finite. As a result,\nand in contrast to previous approximations proposed in the literature, the\nperturbative series has the same form regardless of whether these random\nvariables have a finite mean or not. The accuracy of the approximations is\nillustrated for a variety of distributions and a wide range of parameters. The\nquality of the estimate improves as more terms are included in the perturbative\nseries, specially for higher percentiles and heavier tails.\n", "versions": [{"version": "v1", "created": "Mon, 12 Mar 2012 17:31:50 GMT"}, {"version": "v2", "created": "Wed, 31 Oct 2012 08:16:35 GMT"}, {"version": "v3", "created": "Tue, 18 Dec 2012 14:23:33 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Hernández", "Lorenzo", ""], ["Tejero", "Jorge", ""], ["Suárez", "Alberto", ""], ["Carrillo-Menéndez", "Santiago", ""]]}, {"id": "1203.4979", "submitter": "Ladislav Kri\\v{s}toufek", "authors": "Ladislav Kristoufek", "title": "Fractal Markets Hypothesis and the Global Financial Crisis: Scaling,\n  Investment Horizons and Liquidity", "comments": "11 pages, 3 figures", "journal-ref": "Advances in Complex Systems 2012, Vol. 15(6), art. 1250065", "doi": "10.1142/S0219525912500658", "report-no": null, "categories": "q-fin.ST q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate whether fractal markets hypothesis and its focus on liquidity\nand invest- ment horizons give reasonable predictions about dynamics of the\nfinancial markets during the turbulences such as the Global Financial Crisis of\nlate 2000s. Compared to the mainstream efficient markets hypothesis, fractal\nmarkets hypothesis considers financial markets as com- plex systems consisting\nof many heterogenous agents, which are distinguishable mainly with respect to\ntheir investment horizon. In the paper, several novel measures of trading\nactivity at different investment horizons are introduced through scaling of\nvariance of the underlying processes. On the three most liquid US indices -\nDJI, NASDAQ and S&P500 - we show that predictions of fractal markets hypothesis\nactually fit the observed behavior quite well.\n", "versions": [{"version": "v1", "created": "Thu, 22 Mar 2012 13:19:13 GMT"}], "update_date": "2012-07-13", "authors_parsed": [["Kristoufek", "Ladislav", ""]]}, {"id": "1203.5176", "submitter": "Akihiko Noda", "authors": "Mikio Ito and Akihiko Noda and Tatsuma Wada", "title": "International Stock Market Efficiency: A Non-Bayesian Time-Varying Model\n  Approach", "comments": "21 pages, 2 tables, 6 figures", "journal-ref": "Applied Economics 46 (2014) 2744-2754", "doi": "10.1080/00036846.2014.909579", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops a non-Bayesian methodology to analyze the time-varying\nstructure of international linkages and market efficiency in G7 countries. We\nconsider a non-Bayesian time-varying vector autoregressive (TV-VAR) model, and\napply it to estimate the joint degree of market efficiency in the sense of Fama\n(1970, 1991). Our empirical results provide a new perspective that the\ninternational linkages and market efficiency change over time and that their\nbehaviors correspond well to historical events of the international financial\nsystem.\n", "versions": [{"version": "v1", "created": "Fri, 23 Mar 2012 05:30:15 GMT"}, {"version": "v10", "created": "Sun, 22 Sep 2013 05:14:47 GMT"}, {"version": "v11", "created": "Mon, 30 Sep 2013 15:11:58 GMT"}, {"version": "v12", "created": "Fri, 4 Apr 2014 05:59:23 GMT"}, {"version": "v13", "created": "Thu, 10 Apr 2014 08:51:35 GMT"}, {"version": "v14", "created": "Sun, 4 May 2014 05:58:43 GMT"}, {"version": "v2", "created": "Sat, 7 Apr 2012 08:04:49 GMT"}, {"version": "v3", "created": "Sat, 11 Aug 2012 12:17:06 GMT"}, {"version": "v4", "created": "Thu, 16 Aug 2012 08:48:02 GMT"}, {"version": "v5", "created": "Mon, 27 Aug 2012 03:15:44 GMT"}, {"version": "v6", "created": "Tue, 28 Aug 2012 07:53:00 GMT"}, {"version": "v7", "created": "Thu, 30 Aug 2012 07:50:55 GMT"}, {"version": "v8", "created": "Sun, 4 Nov 2012 08:41:07 GMT"}, {"version": "v9", "created": "Sat, 17 Aug 2013 08:50:22 GMT"}], "update_date": "2015-08-24", "authors_parsed": [["Ito", "Mikio", ""], ["Noda", "Akihiko", ""], ["Wada", "Tatsuma", ""]]}, {"id": "1203.5581", "submitter": "Jongwook  Kim", "authors": "Jongwook Kim and Teppei Okumura", "title": "Heavy-Tail Distribution from Correlation of Discrete Stochastic Process", "comments": "4 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST q-fin.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a stochastic process driven by the memory effect with novel\ndistributions which include both exponential and leptokurtic heavy-tailed\ndistributions. A class of the distributions is analytically derived from the\ncontinuum limit of the discrete binary process with the renormalized\nauto-correlation. The moment generating function with a closed form is\nobtained, thus the cumulants are calculated and shown to be convergent. The\nother class of the distributions is numerically investigated. The combination\nof the two stochastic processes of memory with different signs under regime\nswitching mechanism does result in behaviors of power-law decay. Therefore we\nclaim that memory is the alternative origin of heavy-tail.\n", "versions": [{"version": "v1", "created": "Mon, 26 Mar 2012 05:30:21 GMT"}], "update_date": "2012-03-27", "authors_parsed": [["Kim", "Jongwook", ""], ["Okumura", "Teppei", ""]]}, {"id": "1203.5703", "submitter": "Jean-Philippe Bouchaud", "authors": "L. De Leo, V. Vargas, S. Ciliberti, J.-P. Bouchaud", "title": "We've walked a million miles for one of these smiles", "comments": "Submitted to \"Risk Magazine\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive a new, exact and transparent expansion for option smiles, which\nlends itself both to analytical approximation and, perhaps more importantly, to\ncongenial numerical treatments. We show that the skew and the curvature of the\nsmile can be computed as exotic options, for which the Hedged Monte Carlo\nmethod is particularly well suited. When applied to options on the S&P index,\nwe find that the skew and the curvature of the smile are very poorly reproduced\nby the standard Edgeworth (cumulant) expansion. Most notably, the relation\nbetween the skew and the skewness is inverted at small and large vols, a\nfeature that none of the model studied so far is able to reproduce.\nFurthermore, the around-the-money curvature of the smile is found to be very\nsmall, in stark contrast with the highly kurtic nature of the returns.\n", "versions": [{"version": "v1", "created": "Mon, 26 Mar 2012 15:47:18 GMT"}, {"version": "v2", "created": "Tue, 24 Apr 2012 15:43:24 GMT"}], "update_date": "2012-04-25", "authors_parsed": [["De Leo", "L.", ""], ["Vargas", "V.", ""], ["Ciliberti", "S.", ""], ["Bouchaud", "J. -P.", ""]]}, {"id": "1203.5893", "submitter": "Fulvio Baldovin", "authors": "Fulvio Baldovin, Francesco Camana, Michele Caraglio, Attilio L.\n  Stella, Marco Zamparo", "title": "Aftershock prediction for high-frequency financial markets' dynamics", "comments": "Contribution to the proceedings of the Econophysics Kolkata VI\n  International Workshop, 12 pages, 4 figures. Added references and minor\n  corrections", "journal-ref": null, "doi": "10.1007/978-88-470-2553-0_4", "report-no": null, "categories": "q-fin.ST cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The occurrence of aftershocks following a major financial crash manifests the\ncritical dynamical response of financial markets. Aftershocks put additional\nstress on markets, with conceivable dramatic consequences. Such a phenomenon\nhas been shown to be common to most financial assets, both at high and low\nfrequency. Its present-day description relies on an empirical characterization\nproposed by Omori at the end of 1800 for seismic earthquakes. We point out the\nlimited predictive power in this phenomenological approach and present a\nstochastic model, based on the scaling symmetry of financial assets, which is\npotentially capable to predict aftershocks occurrence, given the main shock\nmagnitude. Comparisons with S&P high-frequency data confirm this predictive\npotential.\n", "versions": [{"version": "v1", "created": "Tue, 27 Mar 2012 08:26:50 GMT"}, {"version": "v2", "created": "Fri, 13 Jul 2012 17:14:48 GMT"}], "update_date": "2012-09-21", "authors_parsed": [["Baldovin", "Fulvio", ""], ["Camana", "Francesco", ""], ["Caraglio", "Michele", ""], ["Stella", "Attilio L.", ""], ["Zamparo", "Marco", ""]]}, {"id": "1203.6228", "submitter": "Romain Allez", "authors": "Romain Allez and Jean-Philippe Bouchaud", "title": "Eigenvector dynamics: general theory and some applications", "comments": "40 pages; 12 figures", "journal-ref": "Phys. Rev. E 86, 046202 (2012)", "doi": "10.1103/PhysRevE.86.046202", "report-no": null, "categories": "cond-mat.stat-mech math.PR q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a general framework to study the stability of the subspace spanned\nby $P$ consecutive eigenvectors of a generic symmetric matrix ${\\bf H}_0$, when\na small perturbation is added. This problem is relevant in various contexts,\nincluding quantum dissipation (${\\bf H}_0$ is then the Hamiltonian) and\nfinancial risk control (in which case ${\\bf H}_0$ is the assets return\ncovariance matrix). We argue that the problem can be formulated in terms of the\nsingular values of an overlap matrix, that allows one to define a \"fidelity\"\ndistance. We specialize our results for the case of a Gaussian Orthogonal ${\\bf\nH}_0$, for which the full spectrum of singular values can be explicitly\ncomputed. We also consider the case when ${\\bf H}_0$ is a covariance matrix and\nillustrate the usefulness of our results using financial data. The special case\nwhere the top eigenvalue is much larger than all the other ones can be\ninvestigated in full detail. In particular, the dynamics of the angle made by\nthe top eigenvector and its true direction defines an interesting new class of\nrandom processes.\n", "versions": [{"version": "v1", "created": "Wed, 28 Mar 2012 11:06:53 GMT"}, {"version": "v2", "created": "Mon, 16 Jul 2012 14:57:59 GMT"}], "update_date": "2013-01-29", "authors_parsed": [["Allez", "Romain", ""], ["Bouchaud", "Jean-Philippe", ""]]}]