[{"id": "1307.0114", "submitter": "Ola Mahmoud", "authors": "Lisa R. Goldberg, Ola Mahmoud", "title": "Risk Without Return", "comments": null, "journal-ref": "Journal of Investment Strategies (2)2: 111-120, 2013", "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Risk-only investment strategies have been growing in popularity as\ntraditional in- vestment strategies have fallen short of return targets over\nthe last decade. However, risk-based investors should be aware of four things.\nFirst, theoretical considerations and empirical studies show that apparently\ndictinct risk-based investment strategies are manifestations of a single\neffect. Second, turnover and associated transaction costs can be a substantial\ndrag on return. Third, capital diversification benefits may be reduced. Fourth,\nthere is an apparent connection between performance and risk diversification.\nTo analyze risk diversification benefits in a consistent way, we introduce the\nRisk Diversification Index (RDI) which measures risk concentrations and\ncomplements the Herfindahl-Herschman Index (HHI) for capital concentrations.\n", "versions": [{"version": "v1", "created": "Sat, 29 Jun 2013 15:21:56 GMT"}, {"version": "v2", "created": "Mon, 2 Sep 2013 16:44:55 GMT"}], "update_date": "2013-09-03", "authors_parsed": [["Goldberg", "Lisa R.", ""], ["Mahmoud", "Ola", ""]]}, {"id": "1307.2014", "submitter": "Dariusz Grech", "authors": "Dariusz Grech and Grzegorz Pamu{\\l}a", "title": "On the multifractal effects generated by monofractal signals", "comments": "36 pages, 41 figures", "journal-ref": null, "doi": "10.1016/j.physa.2013.07.045", "report-no": null, "categories": "physics.data-an q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study quantitatively the level of false multifractal signal one may\nencounter while analyzing multifractal phenomena in time series within\nmultifractal detrended fluctuation analysis (MF-DFA). The investigated effect\nappears as a result of finite length of used data series and is additionally\namplified by the long-term memory the data eventually may contain. We provide\nthe detailed quantitative description of such apparent multifractal background\nsignal as a threshold in spread of generalized Hurst exponent values $\\Delta h$\nor a threshold in the width of multifractal spectrum $\\Delta \\alpha$ below\nwhich multifractal properties of the system are only apparent, i.e. do not\nexist, despite $\\Delta\\alpha\\neq0$ or $\\Delta h\\neq 0$. We find this effect\nquite important for shorter or persistent series and we argue it is linear with\nrespect to autocorrelation exponent $\\gamma$. Its strength decays according to\npower law with respect to the length of time series. The influence of basic\nlinear and nonlinear transformations applied to initial data in finite time\nseries with various level of long memory is also investigated. This provides\nadditional set of semi-analytical results. The obtained formulas are\nsignificant in any interdisciplinary application of multifractality, including\nphysics, financial data analysis or physiology, because they allow to separate\nthe 'true' multifractal phenomena from the apparent (artificial) multifractal\neffects. They should be a helpful tool of the first choice to decide whether we\ndo in particular case with the signal with real multiscaling properties or not.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jul 2013 10:10:19 GMT"}, {"version": "v2", "created": "Sat, 24 Aug 2013 11:49:08 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Grech", "Dariusz", ""], ["Pamuła", "Grzegorz", ""]]}, {"id": "1307.2048", "submitter": "Gregor Wergen", "authors": "Gregor Wergen", "title": "Modeling record-breaking stock prices", "comments": "20 pages, 28 figures", "journal-ref": null, "doi": "10.1016/j.physa.2013.11.001", "report-no": null, "categories": "q-fin.ST physics.data-an stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the statistics of record-breaking events in daily stock prices of\n366 stocks from the Standard and Poors 500 stock index. Both the record events\nin the daily stock prices themselves and the records in the daily returns are\ndiscussed. In both cases we try to describe the record statistics of the stock\ndata with simple theoretical models. The daily returns are compared to i.i.d.\nRV's and the stock prices are modeled using a biased random walk, for which the\nrecord statistics are known. These models agree partly with the behavior of the\nstock data, but we also identify several interesting deviations. Most\nimportantly, the number of records in the stocks appears to be systematically\ndecreased in comparison with the random walk model. Considering the\nautoregressive AR(1) process, we can predict the record statistics of the daily\nstock prices more accurately. We also compare the stock data with simulations\nof the record statistics of the more complicated GARCH(1,1) model, which, in\ncombination with the AR(1) model, gives the best agreement with the\nobservational data. To better understand our findings, we discuss the survival\nand first-passage times of stock prices on certain intervals and analyze the\ncorrelations between the individual record events. After recapitulating some\nrecent results for the record statistics of ensembles of N stocks, we also\npresent some new observations for the weekly distributions of record events.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jul 2013 11:45:49 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Wergen", "Gregor", ""]]}, {"id": "1307.3060", "submitter": "Ladislav Kristoufek", "authors": "Ladislav Kristoufek and Miloslav Vosvrda", "title": "Measuring capital market efficiency: Long-term memory, fractal dimension\n  and approximate entropy", "comments": "12 pages, 1 figure, 4 tables", "journal-ref": null, "doi": "10.1140/epjb/e2014-50113-6", "report-no": null, "categories": "q-fin.ST", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  We utilize long-term memory, fractal dimension and approximate entropy as\ninput variables for the Efficiency Index [Kristoufek & Vosvrda (2013), Physica\nA 392]. This way, we are able to comment on stock market efficiency after\ncontrolling for different types of inefficiencies. Applying the methodology on\n38 stock market indices across the world, we find that the most efficient\nmarkets are situated in the Eurozone (the Netherlands, France and Germany) and\nthe least efficient ones in the Latin America (Venezuela and Chile).\n", "versions": [{"version": "v1", "created": "Thu, 11 Jul 2013 11:27:17 GMT"}, {"version": "v2", "created": "Tue, 18 Feb 2014 09:14:31 GMT"}, {"version": "v3", "created": "Sat, 17 May 2014 09:04:02 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Kristoufek", "Ladislav", ""], ["Vosvrda", "Miloslav", ""]]}, {"id": "1307.4643", "submitter": "Damien Challet", "authors": "Damien Challet, Ahmed Bel Hadj Ayed", "title": "Predicting financial markets with Google Trends and not so random\n  keywords", "comments": "8 pages, 4 figures. First names and last names swapped", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We check the claims that data from Google Trends contain enough data to\npredict future financial index returns. We first discuss the many subtle (and\nless subtle) biases that may affect the backtest of a trading strategy,\nparticularly when based on such data. Expectedly, the choice of keywords is\ncrucial: by using an industry-grade backtesting system, we verify that random\nfinance-related keywords do not to contain more exploitable predictive\ninformation than random keywords related to illnesses, classic cars and arcade\ngames. We however show that other keywords applied on suitable assets yield\nrobustly profitable strategies, thereby confirming the intuition of Preis et\nal. (2013)\n", "versions": [{"version": "v1", "created": "Wed, 17 Jul 2013 14:18:32 GMT"}, {"version": "v2", "created": "Wed, 14 Aug 2013 12:57:13 GMT"}, {"version": "v3", "created": "Tue, 18 Mar 2014 19:16:42 GMT"}], "update_date": "2014-03-19", "authors_parsed": [["Challet", "Damien", ""], ["Ayed", "Ahmed Bel Hadj", ""]]}, {"id": "1307.4727", "submitter": "Ladislav Kri\\v{s}toufek", "authors": "Ladislav Kristoufek", "title": "Testing power-law cross-correlations: Rescaled covariance test", "comments": "15 pages, 4 figures", "journal-ref": "European Physical Journal B 86:418, 2013", "doi": "10.1140/epjb/e2013-40705-y", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new test for detection of power-law cross-correlations among a\npair of time series - the rescaled covariance test. The test is based on a\npower-law divergence of the covariance of the partial sums of the long-range\ncross-correlated processes. Utilizing a heteroskedasticity and auto-correlation\nrobust estimator of the long-term covariance, we develop a test with desirable\nstatistical properties which is well able to distinguish between short- and\nlong-range cross-correlations. Such test should be used as a starting point in\nthe analysis of long-range cross-correlations prior to an estimation of\nbivariate long-term memory parameters. As an application, we show that the\nrelationship between volatility and traded volume, and volatility and returns\nin the financial markets can be labeled as the one with power-law\ncross-correlations.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jul 2013 18:57:34 GMT"}, {"version": "v2", "created": "Thu, 29 Aug 2013 08:58:04 GMT"}], "update_date": "2013-10-10", "authors_parsed": [["Kristoufek", "Ladislav", ""]]}, {"id": "1307.4821", "submitter": "Takashi Ichinomiya", "authors": "Takashi Ichinomiya", "title": "Power-law exponent of the Bouchaud-M\\'ezard model on regular random\n  network", "comments": "To be pubished in Phys. Rev. E", "journal-ref": "Phys. Rev. E 88, 012819 (2013)", "doi": "10.1103/PhysRevE.88.012819", "report-no": null, "categories": "nlin.AO q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the Bouchaud-M\\'ezard model on a regular random network. By assuming\nadiabaticity and independency, and utilizing the generalized central limit\ntheorem and the Tauberian theorem, we derive an equation that determines the\nexponent of the probability distribution function of the wealth as\n$x\\rightarrow \\infty$. The analysis shows that the exponent can be smaller than\n2, while a mean-field analysis always gives the exponent as being larger than\n2. The results of our analysis are shown to be good agreement with those of the\nnumerical simulations.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jul 2013 03:24:56 GMT"}], "update_date": "2013-08-01", "authors_parsed": [["Ichinomiya", "Takashi", ""]]}, {"id": "1307.5440", "submitter": "Mehdi Lallouache", "authors": "Mehdi Lallouache, Fr\\'ed\\'eric Abergel", "title": "Tick Size Reduction and Price Clustering in a FX Order Book", "comments": "17 pages, Minor revisions", "journal-ref": "Physica A, Volume 416, 15 December 2014, Pages 488-498", "doi": "10.1016/j.physa.2014.09.016", "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the statistical properties of the EBS order book for the\nEUR/USD and USD/JPY currency pairs and the impact of a ten-fold tick size\nreduction on its dynamics. A large fraction of limit orders are still placed\nright at or halfway between the old allowed prices. This generates price\nbarriers where the best quotes lie for much of the time, which causes the\nemergence of distinct peaks in the average shape of the book at round\ndistances. Furthermore, we argue that this clustering is mainly due to manual\ntraders who remained set to the old price resolution. Automatic traders easily\ntake price priority by submitting limit orders one tick ahead of clusters, as\nshown by the prominence of buy (sell) limit orders posted with rightmost digit\none (nine).\n", "versions": [{"version": "v1", "created": "Sat, 20 Jul 2013 17:09:06 GMT"}, {"version": "v2", "created": "Wed, 7 May 2014 11:57:01 GMT"}, {"version": "v3", "created": "Mon, 29 Sep 2014 08:34:20 GMT"}], "update_date": "2014-09-30", "authors_parsed": [["Lallouache", "Mehdi", ""], ["Abergel", "Frédéric", ""]]}, {"id": "1307.5981", "submitter": "Jozef Barunik", "authors": "Krenar Avdulaj, Jozef Barunik", "title": "Are benefits from oil - stocks diversification gone? New evidence from a\n  dynamic copula and high frequency data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Oil is perceived as a good diversification tool for stock markets. To fully\nunderstand this potential, we propose a new empirical methodology that combines\ngeneralized autoregressive score copula functions with high frequency data and\nallows us to capture and forecast the conditional time-varying joint\ndistribution of the oil -- stocks pair accurately. Our realized GARCH with\ntime-varying copula yields statistically better forecasts of the dependence and\nquantiles of the distribution relative to competing models. Employing a\nrecently proposed conditional diversification benefits measure that considers\nhigher-order moments and nonlinear dependence from tail events, we document\ndecreasing benefits from diversification over the past ten years. The\ndiversification benefits implied by our empirical model are, moreover, strongly\nvaried over time. These findings have important implications for asset\nallocation, as the benefits of including oil in stock portfolios may not be as\nlarge as perceived.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jul 2013 09:02:11 GMT"}, {"version": "v2", "created": "Tue, 10 Feb 2015 20:54:01 GMT"}], "update_date": "2015-02-11", "authors_parsed": [["Avdulaj", "Krenar", ""], ["Barunik", "Jozef", ""]]}, {"id": "1307.6046", "submitter": "Ladislav Kri\\v{s}toufek", "authors": "Ladislav Kristoufek", "title": "Mixed-correlated ARFIMA processes for power-law cross-correlations", "comments": "12 pages, 7 figures", "journal-ref": "Physica A: Statistical Mechanics and its Applications 392(24), pp.\n  6484-6493, 2013", "doi": "10.1016/j.physa.2013.08.041", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a general framework of the Mixed-correlated ARFIMA (MC-ARFIMA)\nprocesses which allows for various specifications of univariate and bivariate\nlong-term memory. Apart from a standard case when $H_{xy}={1}{2}(H_x+H_y)$,\nMC-ARFIMA also allows for processes with $H_{xy}<{1}{2}(H_x+H_y)$ but also for\nlong-range correlated processes which are either short-range cross-correlated\nor simply correlated. The major contribution of MC-ARFIMA lays in the fact that\nthe processes have well-defined asymptotic properties for $H_x$, $H_y$ and\n$H_{xy}$, which are derived in the paper, so that the processes can be used in\nsimulation studies comparing various estimators of the bivariate Hurst exponent\n$H_{xy}$. Moreover, the framework allows for modeling of processes which are\nfound to have $H_{xy}<{1}{2}(H_x+H_y)$.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jul 2013 12:43:13 GMT"}, {"version": "v2", "created": "Thu, 29 Aug 2013 08:58:29 GMT"}], "update_date": "2013-10-04", "authors_parsed": [["Kristoufek", "Ladislav", ""]]}, {"id": "1307.6322", "submitter": "Michele Caraglio", "authors": "Fulvio Baldovin, Massimiliano Caporin, Michele Caraglio, Attilio\n  Stella and Marco Zamparo", "title": "Option pricing with non-Gaussian scaling and infinite-state switching\n  volatility", "comments": "Revised version. 31 pages, 4 figures", "journal-ref": "Journal of Econometrics 187 (2015) 486-497", "doi": "10.1016/j.jeconom.2015.02.033", "report-no": null, "categories": "q-fin.PR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Volatility clustering, long-range dependence, and non-Gaussian scaling are\nstylized facts of financial assets dynamics. They are ignored in the Black &\nScholes framework, but have a relevant impact on the pricing of options written\non financial assets. Using a recent model for market dynamics which adequately\ncaptures the above stylized facts, we derive closed form equations for option\npricing, obtaining the Black & Scholes as a special case. By applying our\npricing equations to a major equity index option dataset, we show that\ninclusion of stylized features in financial modeling moves derivative prices\nabout 30% closer to the market values without the need of calibrating models\nparameters on available derivative prices.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jul 2013 08:24:07 GMT"}, {"version": "v2", "created": "Tue, 20 May 2014 15:23:14 GMT"}], "update_date": "2020-02-12", "authors_parsed": [["Baldovin", "Fulvio", ""], ["Caporin", "Massimiliano", ""], ["Caraglio", "Michele", ""], ["Stella", "Attilio", ""], ["Zamparo", "Marco", ""]]}, {"id": "1307.7244", "submitter": "Lajos Gergely Gyurk\\'o", "authors": "Lajos Gergely Gyurk\\'o, Terry Lyons, Mark Kontkowski, Jonathan Field", "title": "Extracting information from the signature of a financial data stream", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Market events such as order placement and order cancellation are examples of\nthe complex and substantial flow of data that surrounds a modern financial\nengineer. New mathematical techniques, developed to describe the interactions\nof complex oscillatory systems (known as the theory of rough paths) provides\nnew tools for analysing and describing these data streams and extracting the\nvital information. In this paper we illustrate how a very small number of\ncoefficients obtained from the signature of financial data can be sufficient to\nclassify this data for subtle underlying features and make useful predictions.\n  This paper presents financial examples in which we learn from data and then\nproceed to classify fresh streams. The classification is based on features of\nstreams that are specified through the coordinates of the signature of the\npath. At a mathematical level the signature is a faithful transform of a\nmultidimensional time series. (Ben Hambly and Terry Lyons \\cite{uniqueSig}),\nHao Ni and Terry Lyons \\cite{NiLyons} introduced the possibility of its use to\nunderstand financial data and pointed to the potential this approach has for\nmachine learning and prediction.\n  We evaluate and refine these theoretical suggestions against practical\nexamples of interest and present a few motivating experiments which demonstrate\ninformation the signature can easily capture in a non-parametric way avoiding\ntraditional statistical modelling of the data. In the first experiment we\nidentify atypical market behaviour across standard 30-minute time buckets\nsampled from the WTI crude oil future market (NYMEX). The second and third\nexperiments aim to characterise the market \"impact\" of and distinguish between\nparent orders generated by two different trade execution algorithms on the FTSE\n100 Index futures market listed on NYSE Liffe.\n", "versions": [{"version": "v1", "created": "Sat, 27 Jul 2013 10:13:04 GMT"}, {"version": "v2", "created": "Tue, 15 Jul 2014 09:44:41 GMT"}], "update_date": "2014-07-16", "authors_parsed": [["Gyurkó", "Lajos Gergely", ""], ["Lyons", "Terry", ""], ["Kontkowski", "Mark", ""], ["Field", "Jonathan", ""]]}, {"id": "1307.8308", "submitter": "Yanshan Shi", "authors": "Y. Shi, A. N. Gorban, T. Y. Yang", "title": "Is it possible to predict long-term success with k-NN? Case Study of\n  four market indices (FTSE100, DAX, HANGSENG, NASDAQ)", "comments": "21 pages, 14 figures", "journal-ref": null, "doi": "10.1088/1742-6596/490/1/012082", "report-no": null, "categories": "q-fin.ST stat.AP", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This case study tests the possibility of prediction for \"success\" (or\n\"winner\") components of four stock & shares market indices in a time period of\nthree years from 02-Jul-2009 to 29-Jun-2012.We compare their performance ain\ntwo time frames: initial frame three months at the beginning\n(02/06/2009-30/09/2009) and the final three month frame\n(02/04/2012-29/06/2012). To label the components, average price ratio between\ntwo time frames in descending order is computed. The average price ratio is\ndefined as the ratio between the mean prices of the beginning and final time\nperiod. The \"winner\" components are referred to the top one third of total\ncomponents in the same order as average price ratio it means the mean price of\nfinal time period is relatively higher than the beginning time period. The\n\"loser\" components are referred to the last one third of total components in\nthe same order as they have higher mean prices of beginning time period. We\nanalyse, is there any information about the winner-looser separation in the\ninitial fragments of the daily closing prices log-returns time series. The\nLeave-One-Out Cross-Validation with k-NN algorithm is applied on the daily\nlog-return of components using a distance and proximity in the experiment. By\nlooking at the error analysis, it shows that for HANGSENG and DAX index, there\nare clear signs of possibility to evaluate the probability of long-term\nsuccess. The correlation distance matrix histograms and 2-D/3-D elastic maps\ngenerated from ViDaExpert show that the winner components are closer to each\nother and winner/loser components are separable on elastic maps for HANGSENG\nand DAX index while for the negative possibility indices, there is no sign of\nseparation.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jul 2013 12:56:35 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Shi", "Y.", ""], ["Gorban", "A. N.", ""], ["Yang", "T. Y.", ""]]}]