[{"id": "1402.1046", "submitter": "Xiongfei Jiang", "authors": "F. Y. Ouyang, B. Zheng, X.F. Jiang", "title": "Spatial and temporal structures of four financial markets in Greater\n  China", "comments": "7 figures. Accepted by Physica A", "journal-ref": "Physica A: Statistical Mechanics and its Applications Volume 402,\n  2014, Pages 236", "doi": "10.1016/j.physa.2014.02.006", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We investigate the spatial and temporal structures of four financial markets\nin Greater China. In particular, we uncover different characteristics of the\nfour markets by analyzing the sector and subsector structures which are\ndetected through the random matrix theory. Meanwhile, we observe that the\nTaiwan and Hongkong stock markets show a negative return-volatility\ncorrelation, i.e., the so-called leverage effect. The Shanghai and Shenzhen\nstock markets are more complicated. Before the year 2000, the two markets\nexhibit a strong positive return-volatility correlation, which is called the\nanti-leverage effect. After 2000, however, it gradually changes to the leverage\neffect. We also find that the recurrence interval distributions of both the\ntrading volume volatilities and price volatilities follow a power law behavior,\nwhile the exponents vary among different markets.\n", "versions": [{"version": "v1", "created": "Wed, 5 Feb 2014 14:17:12 GMT"}], "update_date": "2014-04-24", "authors_parsed": [["Ouyang", "F. Y.", ""], ["Zheng", "B.", ""], ["Jiang", "X. F.", ""]]}, {"id": "1402.1281", "submitter": "Ovidiu Racorean Mr", "authors": "Ovidiu Racorean", "title": "Crossing Stocks and the Positive Grassmannian I: The Geometry behind\n  Stock Market", "comments": "21 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It seems to be very unlikely that all relevant information in the stock\nmarket could be fully encoded in a geometrical shape. Still,the present paper\nwill reveal the geometry behind the stock market transactions. The prices of\nmarket index (DJIA) stock components are arranged in ascending order from the\nsmallest one in the left to the highest in the right. In such arrangement, as\nstock prices changes due to daily market quotations, it could be noticed that\nthe price of a certain stock get over /under the price of a neighbor stock.\nThese stocks are crossing. Arranged this way, the diagram of successive stock\ncrossings is nothing else than a permutation diagram. From this point on the\nfinancial and combinatorial concepts are netted together to build a bridge\nconnecting the stock market to a beautiful geometrical object that will be\ncalled stock market polytope. The stock market polytope is associated with the\nremarkable structure of positive Grassmannian . This procedure makes all the\nrelevant information about the stock market encoded in the geometrical shape of\nthe stock market polytope more readable.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2014 09:03:43 GMT"}, {"version": "v2", "created": "Sun, 9 Feb 2014 13:57:57 GMT"}], "update_date": "2014-02-13", "authors_parsed": [["Racorean", "Ovidiu", ""]]}, {"id": "1402.1405", "submitter": "Dror Kenett", "authors": "Dror Y. Kenett, Xuqing Huang, Irena Vodenska, Shlomo Havlin, and H.\n  Eugene Stanley", "title": "Partial correlation analysis: Applications for financial markets", "comments": "16 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The presence of significant cross-correlations between the synchronous time\nevolution of a pair of equity returns is a well-known empirical fact. The\nPearson correlation is commonly used to indicate the level of similarity in the\nprice changes for a given pair of stocks, but it does not measure whether other\nstocks influence the relationship between them. To explore the influence of a\nthird stock on the relationship between two stocks, we use a partial\ncorrelation measurement to determine the underlying relationships between\nfinancial assets. Building on previous work, we present a statistically robust\napproach to extract the underlying relationships between stocks from four\ndifferent financial markets: the United States, the United Kingdom, Japan, and\nIndia. This methodology provides new insights into financial market dynamics\nand uncovers implicit influences in play between stocks. To demonstrate the\ncapabilities of this methodology, we (i) quantify the influence of different\ncompanies and, by studying market similarity across time, present new insights\ninto market structure and market stability, and (ii) we present a practical\napplication, which provides information on the how a company is influenced by\ndifferent economic sectors, and how the sectors interact with each other. These\nexamples demonstrate the effectiveness of this methodology in uncovering\ninformation valuable for a range of individuals, including not only investors\nand traders but also regulators and policy makers.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2014 16:47:55 GMT"}], "update_date": "2014-02-07", "authors_parsed": [["Kenett", "Dror Y.", ""], ["Huang", "Xuqing", ""], ["Vodenska", "Irena", ""], ["Havlin", "Shlomo", ""], ["Stanley", "H. Eugene", ""]]}, {"id": "1402.1440", "submitter": "Enrico Onali Dr", "authors": "Enrico Onali, John Goddard", "title": "Are European equity markets efficient? New evidence from fractal\n  analysis", "comments": null, "journal-ref": "International Review of Financial Analysis(2011), Vol 20, pp 59 67", "doi": "10.1016/j.irfa.2011.02.004", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fractal analysis is carried out on the stock market indices of seven European\ncountries and the US. We find evidence of long range dependence in the log\nreturn series of the Mibtel (Italy) and the PX Glob (Czech Republic). Long\nrange dependence implies that predictable patterns in the log returns do not\ndissipate quickly, and may therefore produce potential arbitrage opportunities.\nTherefore, these results are in contravention of the Efficient Market\nHypothesis. We show that correcting for short range dependence, or\nprefiltering, may dispose of genuine long range dependence, suggesting that the\nmarket is efficient in cases when it is not. Prefiltering does not reduce\nsignificantly the power of the tests only for cases for which the Hurst\nexponent (a measure of the long range dependence) lies well outside the\nboundaries of no long range dependence. For borderline cases, the prefiltering\nprocedure reduces the power of the test. On the other hand, the absence of\nprefiltering does not result in a test that is significantly oversized.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2014 18:01:20 GMT"}], "update_date": "2014-02-07", "authors_parsed": [["Onali", "Enrico", ""], ["Goddard", "John", ""]]}, {"id": "1402.1552", "submitter": "Jae Woo Lee", "authors": "Ashadun Nobi, Sungmin Lee, Doo Hwan Kim, and Jae Woo Lee", "title": "Correlation and Network Topologies in Global and Local Stock Indices", "comments": "11 pages,4 figures", "journal-ref": null, "doi": "10.1016/j.physleta.2014.07.009", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study examined how the correlation and network structure of 30 global\nindices and 145 local Korean indices belonging to the KOSPI 200 have changed\nduring the 13-year period, 2000-2012. The correlations among the indices were\ncalculated. The results showed that although the average correlations of the\nglobal indices increased with time, the local indices showed a decreasing trend\nexcept for drastic changes during crises. The average correlation of the local\nindices exceeded the global indices during the crises from 2000-2002, implying\na strong correlation structure among the local indices during this period due\nto the detrimental effect of the dot-com bubble. The threshold networks (TN)\nwere constructed in the observation time window by assigning a threshold value\nand determining the network topologies. A significant change in the network\ntopologies was observed due to the financial crises in both markets. The\nJaccard similarities were also determined using the common links of TNs. The\nTNs of the financial network were not consistent with the evolution of the\ntime, and the successive TNs of the global indices were more similar than those\nof the successive local indices. Finally, the Jaccard similarities identified\nthe change in the market state due to a crisis in both markets.\n", "versions": [{"version": "v1", "created": "Fri, 7 Feb 2014 05:19:01 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Nobi", "Ashadun", ""], ["Lee", "Sungmin", ""], ["Kim", "Doo Hwan", ""], ["Lee", "Jae Woo", ""]]}, {"id": "1402.1624", "submitter": "Dietmar Janetzko", "authors": "Dietmar Janetzko", "title": "Using Twitter to Model the EUR/USD Exchange Rate", "comments": "35 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fast, global, and sensitively reacting to political, economic and social\nevents of any kind, these are attributes that social media like Twitter share\nwith foreign exchange markets. The leading assumption of this paper is that\ninformation which can be distilled from public debates on Twitter has\npredictive content for exchange rate movements. This assumption prompted a\nTwitter-based exchange rate model that harnesses regARIMA analyses for\nshort-term out-of-sample ex post forecasts of the daily closing prices of\nEUR/USD spot exchange rates. The analyses used Tweet counts collected from\nJanuary 1, 2012 - September 27, 2013. To identify concepts mentioned on Twitter\nwith a predictive potential the analysis followed a 2-step selection. Firstly,\na heuristic qualitative analysis assembled a long list of 594 concepts, e.g.,\nMerkel, Greece, Cyprus, crisis, chaos, growth, unemployment expected to covary\nwith the ups and downs of the EUR/USD exchange rate. Secondly, cross-validation\nusing window averaging with a fixed-sized rolling origin was deployed to select\nconcepts and corresponding univariate time series that had error scores below\nchance level as defined by the random walk model. With regard to a short list\nof 17 concepts (covariates), in particular SP (Standard & Poor's) and risk, the\nout-of-sample predictive accuracy of the Twitter-based regARIMA model was found\nto be repeatedly better than that obtained from both the random walk model and\na random noise covariate in 1-step ahead forecasts of the EUR/USD exchange\nrate. This advantage was evident on the level of forecast error metrics (MSFE,\nMAE) when a majority vote over different estimation windows was conducted. The\nresults challenge the semi-strong form of the efficient market hypothesis\n(Fama, 1970, 1991) which when applied to the FX market maintains that all\npublicly available information is already integrated into exchange rates.\n", "versions": [{"version": "v1", "created": "Fri, 7 Feb 2014 12:55:53 GMT"}], "update_date": "2014-02-10", "authors_parsed": [["Janetzko", "Dietmar", ""]]}, {"id": "1402.2198", "submitter": "Anton Golub", "authors": "Anton Golub, Gregor Chliamovitch, Alexandre Dupuis and Bastien Chopard", "title": "Multi-scale Representation of High Frequency Market Liquidity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an event based framework of directional changes and overshoots\nto map continuous financial data into the so-called Intrinsic Network - a state\nbased discretisation of intrinsically dissected time series. Defining a method\nfor state contraction of Intrinsic Network, we show that it has a consistent\nhierarchical structure that allows for multi-scale analysis of financial data.\nWe define an information theoretic measurement termed Liquidity that\ncharacterises the unlikeliness of price trajectories and argue that the new\nmetric has the ability to detect and predict stress in financial markets. We\nshow empirical examples within the Foreign Exchange market where the new\nmeasure not only quantifies liquidity but also acts as an early warning signal.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2014 16:26:06 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Golub", "Anton", ""], ["Chliamovitch", "Gregor", ""], ["Dupuis", "Alexandre", ""], ["Chopard", "Bastien", ""]]}, {"id": "1402.3030", "submitter": "A. Christian Silva", "authors": "Fernando F. Ferreira, A. Christian Silva, Ju-Yi Yen", "title": "Information ratio analysis of momentum strategies", "comments": "23 pages, 8 figures;v2:revised text", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the past 20 years, momentum or trend following strategies have become an\nestablished part of the investor toolbox. We introduce a new way of analyzing\nmomentum strategies by looking at the information ratio (IR, average return\ndivided by standard deviation). We calculate the theoretical IR of a momentum\nstrategy, and show that if momentum is mainly due to the positive\nautocorrelation in returns, IR as a function of the portfolio formation period\n(look-back) is very different from momentum due to the drift (average return).\nThe IR shows that for look-back periods of a few months, the investor is more\nlikely to tap into autocorrelation. However, for look-back periods closer to 1\nyear, the investor is more likely to tap into the drift. We compare the\nhistorical data to the theoretical IR by constructing stationary periods. The\nempirical study finds that there are periods/regimes where the autocorrelation\nis more important than the drift in explaining the IR (particularly pre-1975)\nand others where the drift is more important (mostly after 1975). We conclude\nour study by applying our momentum strategy to 100 plus years of the Dow-Jones\nIndustrial Average. We report damped oscillations on the IR for look-back\nperiods of several years and model such oscilations as a reversal to the mean\ngrowth rate.\n", "versions": [{"version": "v1", "created": "Thu, 13 Feb 2014 04:37:25 GMT"}, {"version": "v2", "created": "Mon, 7 Jul 2014 23:13:45 GMT"}], "update_date": "2014-07-09", "authors_parsed": [["Ferreira", "Fernando F.", ""], ["Silva", "A. Christian", ""], ["Yen", "Ju-Yi", ""]]}, {"id": "1402.3483", "submitter": "Matija Pi\\v{s}korec", "authors": "Matija Pi\\v{s}korec, Nino Antulov-Fantulin, Petra Kralj Novak, Igor\n  Mozeti\\v{c}, Miha Gr\\v{c}ar, Irena Vodenska, Tomislav \\v{S}muc", "title": "News Cohesiveness: an Indicator of Systemic Risk in Financial Markets", "comments": null, "journal-ref": "Scientific Reports 4: 5038 (2014)", "doi": "10.1038/srep05038", "report-no": null, "categories": "cs.SI physics.soc-ph q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by recent financial crises significant research efforts have been\nput into studying contagion effects and herding behaviour in financial markets.\nMuch less has been said about influence of financial news on financial markets.\nWe propose a novel measure of collective behaviour in financial news on the\nWeb, News Cohesiveness Index (NCI), and show that it can be used as a systemic\nrisk indicator. We evaluate the NCI on financial documents from large Web news\nsources on a daily basis from October 2011 to July 2013 and analyse the\ninterplay between financial markets and financially related news. We\nhypothesized that strong cohesion in financial news reflects movements in the\nfinancial markets. Cohesiveness is more general and robust measure of systemic\nrisk expressed in news, than measures based on simple occurrences of specific\nterms. Our results indicate that cohesiveness in the financial news is highly\ncorrelated with and driven by volatility on the financial markets.\n", "versions": [{"version": "v1", "created": "Fri, 14 Feb 2014 14:54:48 GMT"}], "update_date": "2015-09-30", "authors_parsed": [["Piškorec", "Matija", ""], ["Antulov-Fantulin", "Nino", ""], ["Novak", "Petra Kralj", ""], ["Mozetič", "Igor", ""], ["Grčar", "Miha", ""], ["Vodenska", "Irena", ""], ["Šmuc", "Tomislav", ""]]}, {"id": "1402.3820", "submitter": "Pawe{\\l} Fiedor", "authors": "Pawe{\\l} Fiedor", "title": "Information-theoretic approach to lead-lag effect on financial markets", "comments": "9 pages, 19 figures", "journal-ref": null, "doi": "10.1140/epjb/e2014-50108-3", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently the interest of researchers has shifted from the analysis of\nsynchronous relationships of financial instruments to the analysis of more\nmeaningful asynchronous relationships. Both of those analyses are concentrated\nonly on Pearson's correlation coefficient and thus intraday lead-lag\nrelationships associated with such. Under Efficient Market Hypothesis such\nrelationships are not possible as all information is embedded in the prices. In\nthis paper we analyse lead-lag relationships of financial instruments and\nextend known methodology by using mutual information instead of Pearson's\ncorrelation coefficient, which not only is a more general measure, sensitive to\nnon-linear dependencies, but also can lead to a simpler procedure of\nstatistical validation of links between financial instruments. We analyse\nlagged relationships using NYSE 100 data not only on intraday level but also\nfor daily stock returns, which has usually been ignored.\n", "versions": [{"version": "v1", "created": "Sun, 16 Feb 2014 17:47:48 GMT"}], "update_date": "2014-06-18", "authors_parsed": [["Fiedor", "Paweł", ""]]}, {"id": "1402.4047", "submitter": "Tomasz Gubiec", "authors": "M. Koz{\\l}owska, T. Gubiec, T. R. Werner, M. Denys, A. Sienkiewicz, R.\n  Kutner, Z. Struzik", "title": "Empirical symptoms of catastrophic bifurcation transitions on financial\n  markets: A phenomenological approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The principal aim of this work is the evidence on empirical way that\ncatastrophic bifurcation breakdowns or transitions, proceeded by flickering\nphenomenon, are present on notoriously significant and unpredictable financial\nmarkets. Overall, in this work we developed various metrics associated with\ncatastrophic bifurcation transitions, in particular, the catastrophic slowing\ndown (analogous to the critical slowing down). All these things were considered\non a well-defined example of financial markets of small and middle to large\ncapitalization. The catastrophic bifurcation transition seems to be connected\nwith the question of whether the early-warning signals are present in financial\nmarkets. This question continues to fascinate both the research community and\nthe general public. Interestingly, such early-warning signals have recently\nbeen identified and explained to be a consequence of a catastrophic bifurcation\ntransition phenomenon observed in multiple physical systems, e.g. in\necosystems, climate dynamics and in medicine (epileptic seizure and asthma\nattack). In the present work we provide an analogical, positive identification\nof such phenomenon by examining its several different indicators in the context\nof a well-defined daily bubble; this bubble was induced by the recent worldwide\nfinancial crisis on typical financial markets of small and middle to large\ncapitalization.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2014 16:23:09 GMT"}], "update_date": "2014-02-18", "authors_parsed": [["Kozłowska", "M.", ""], ["Gubiec", "T.", ""], ["Werner", "T. R.", ""], ["Denys", "M.", ""], ["Sienkiewicz", "A.", ""], ["Kutner", "R.", ""], ["Struzik", "Z.", ""]]}, {"id": "1402.7027", "submitter": "Rick Steinert", "authors": "Florian Ziel, Rick Steinert and Sven Husmann", "title": "Efficient Modeling and Forecasting of the Electricity Spot Price", "comments": null, "journal-ref": "Energy Economics, 47 (2015) 98-111", "doi": "10.1016/j.eneco.2014.10.012", "report-no": null, "categories": "stat.AP econ.EM q-fin.ST q-fin.TR stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing importance of renewable energy, especially solar and wind\npower, has led to new forces in the formation of electricity prices. Hence,\nthis paper introduces an econometric model for the hourly time series of\nelectricity prices of the European Power Exchange (EPEX) which incorporates\nspecific features like renewable energy. The model consists of several\nsophisticated and established approaches and can be regarded as a periodic\nVAR-TARCH with wind power, solar power, and load as influences on the time\nseries. It is able to map the distinct and well-known features of electricity\nprices in Germany. An efficient iteratively reweighted lasso approach is used\nfor the estimation. Moreover, it is shown that several existing models are\noutperformed by the procedure developed in this paper.\n", "versions": [{"version": "v1", "created": "Thu, 27 Feb 2014 19:18:21 GMT"}, {"version": "v2", "created": "Tue, 26 Aug 2014 11:45:13 GMT"}, {"version": "v3", "created": "Mon, 8 Sep 2014 10:33:59 GMT"}, {"version": "v4", "created": "Mon, 13 Oct 2014 09:46:09 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Ziel", "Florian", ""], ["Steinert", "Rick", ""], ["Husmann", "Sven", ""]]}]