[{"id": "1412.1293", "submitter": "Ahmet Celikoglu", "authors": "Ahmet Celikoglu and Ugur Tirnakli", "title": "Skewness and kurtosis analysis for non-Gaussian distributions", "comments": "15 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.stat-mech physics.data-an q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper [\\textit{M. Cristelli, A. Zaccaria and L. Pietronero, Phys.\nRev. E 85, 066108 (2012)}], Cristelli \\textit{et al.} analysed relation between\nskewness and kurtosis for complex dynamical systems and identified two\npower-law regimes of non-Gaussianity, one of which scales with an exponent of 2\nand the other is with $4/3$. Finally the authors concluded that the observed\nrelation is a universal fact in complex dynamical systems. Here, we test the\nproposed universal relation between skewness and kurtosis with large number of\nsynthetic data and show that in fact it is not universal and originates only\ndue to the small number of data points in the data sets considered. The\nproposed relation is tested using two different non-Gaussian distributions,\nnamely $q$-Gaussian and Levy distributions. We clearly show that this relation\ndisappears for sufficiently large data sets provided that the second moment of\nthe distribution is finite. We find that, contrary to the claims of Cristelli\n\\textit{et al.} regarding a power-law scaling regime, kurtosis saturates to a\nsingle value, which is of course different from the Gaussian case ($K=3$), as\nthe number of data is increased. On the other hand, if the second moment of the\ndistribution is infinite, then the kurtosis seems to never converge to a single\nvalue. The converged kurtosis value for the finite second moment distributions\nand the number of data points needed to reach this value depend on the\ndeviation of the original distribution from the Gaussian case. We also argue\nthat the use of kurtosis to compare distributions to decide which one deviates\nfrom the Gaussian more can lead to incorrect results even for finite second\nmoment distributions for small data sets, whereas it is totally misleading for\ninfinite second moment distributions where the difference depends on $N$ for\nall finite $N$.\n", "versions": [{"version": "v1", "created": "Wed, 3 Dec 2014 12:20:21 GMT"}], "update_date": "2014-12-04", "authors_parsed": [["Celikoglu", "Ahmet", ""], ["Tirnakli", "Ugur", ""]]}, {"id": "1412.2124", "submitter": "Robert G\\k{e}barowski", "authors": "Robert G\\k{e}barowski (1), Stanis{\\l}aw Dro\\.zd\\.z (1 and 2), Andrzej\n  Z. G\\'orski (2), Pawe{\\l} O\\'swi\\k{e}cimka (2) ((1) Wydzia{\\l} Fizyki,\n  Matematyki i Informatyki, Politechnika Krakowska im. Tadeusza Ko\\'sciuszki,\n  Krak\\'ow, Poland, (2) Instytut Fizyki J\\k{a}drowej PAN, Krak\\'ow, Poland)", "title": "Competition of Commodities for the Status of Money in an Agent-based\n  Model", "comments": "10 pages, 4 figures", "journal-ref": "Acta Physica Polonica A vol. 127, No. 3-A, pp A-51 - A-54 (2015)", "doi": "10.12693/APhysPolA.127.A-51", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this model study of the commodity market, we present some evidence of\ncompetition of commodities for the status of money in the regime of parameters,\nwhere emergence of money is possible. The competition reveals itself as a\nrivalry of a few (typically two) dominant commodities, which take the status of\nmoney in turn.\n", "versions": [{"version": "v1", "created": "Fri, 5 Dec 2014 20:15:38 GMT"}], "update_date": "2015-06-09", "authors_parsed": [["Gębarowski", "Robert", "", "1 and 2"], ["Drożdż", "Stanisław", "", "1 and 2"], ["Górski", "Andrzej Z.", ""], ["Oświęcimka", "Paweł", ""]]}, {"id": "1412.3126", "submitter": "Omar Rojas", "authors": "Omar Rojas and Carlos Trejo-Pech", "title": "Financial Time Series: Stylized Facts for the Mexican Stock Exchange\n  Index Compared to Developed Markets", "comments": "Chapter of book Nonlinear Time Series and Finance, Semei\n  Coronado-Ram\\'irez et al. (eds.), Universidad de Guadalajara, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present some stylized facts exhibited by the time series of returns of the\nMexican Stock Exchange Index (IPC) and compare them to a sample of both\ndeveloped (USA, UK and Japan) and emerging markets (Brazil and India). The\nperiod of study is 1997-2011. The stylized facts are related mostly to the\nprobability distribution func- tion and the autocorrelation function (e.g. fat\ntails, non-normality, volatility cluster- ing, among others). We find that\npositive skewness for returns in Mexico and Brazil, but not in the rest,\nsuggest investment opportunities. Evidence of nonlinearity is also documented.\n", "versions": [{"version": "v1", "created": "Tue, 9 Dec 2014 21:36:53 GMT"}], "update_date": "2014-12-11", "authors_parsed": [["Rojas", "Omar", ""], ["Trejo-Pech", "Carlos", ""]]}, {"id": "1412.3230", "submitter": "Anna Kiriliouk", "authors": "Michel Denuit and Anna Kiriliouk and Johan Segers", "title": "Max-factor individual risk models with application to credit portfolios", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Individual risk models need to capture possible correlations as failing to do\nso typically results in an underestimation of extreme quantiles of the\naggregate loss. Such dependence modelling is particularly important for\nmanaging credit risk, for instance, where joint defaults are a major cause of\nconcern. Often, the dependence between the individual loss occurrence\nindicators is driven by a small number of unobservable factors. Conditional\nloss probabilities are then expressed as monotone functions of linear\ncombinations of these hidden factors. However, combining the factors in a\nlinear way allows for some compensation between them. Such diversification\neffects are not always desirable and this is why the present work proposes a\nnew model replacing linear combinations with maxima. These max-factor models\ngive more insight into which of the factors is dominant.\n", "versions": [{"version": "v1", "created": "Wed, 10 Dec 2014 09:04:42 GMT"}], "update_date": "2014-12-11", "authors_parsed": [["Denuit", "Michel", ""], ["Kiriliouk", "Anna", ""], ["Segers", "Johan", ""]]}, {"id": "1412.3948", "submitter": "Giacomo Bormetti", "authors": "Gabriele Ranco, Ilaria Bordino, Giacomo Bormetti, Guido Caldarelli,\n  Fabrizio Lillo, Michele Treccani", "title": "Coupling news sentiment with web browsing data improves prediction of\n  intra-day price dynamics", "comments": "24 pages, 4 figures, 5 tables. Figure 2 replaced. Few typos corrected", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The new digital revolution of big data is deeply changing our capability of\nunderstanding society and forecasting the outcome of many social and economic\nsystems. Unfortunately, information can be very heterogeneous in the\nimportance, relevance, and surprise it conveys, affecting severely the\npredictive power of semantic and statistical methods. Here we show that the\naggregation of web users' behavior can be elicited to overcome this problem in\na hard to predict complex system, namely the financial market. Specifically,\nour in-sample analysis shows that the combined use of sentiment analysis of\nnews and browsing activity of users of Yahoo! Finance greatly helps forecasting\nintra-day and daily price changes of a set of 100 highly capitalized US stocks\ntraded in the period 2012-2013. Sentiment analysis or browsing activity when\ntaken alone have very small or no predictive power. Conversely, when\nconsidering a \"news signal\" where in a given time interval we compute the\naverage sentiment of the clicked news, weighted by the number of clicks, we\nshow that for nearly 50% of the companies such signal Granger-causes hourly\nprice returns. Our result indicates a \"wisdom-of-the-crowd\" effect that allows\nto exploit users' activity to identify and weigh properly the relevant and\nsurprising news, enhancing considerably the forecasting power of the news\nsentiment.\n", "versions": [{"version": "v1", "created": "Fri, 12 Dec 2014 11:06:49 GMT"}, {"version": "v2", "created": "Wed, 31 Dec 2014 10:29:48 GMT"}, {"version": "v3", "created": "Fri, 4 Dec 2015 15:37:18 GMT"}, {"version": "v4", "created": "Tue, 15 Dec 2015 16:55:39 GMT"}], "update_date": "2015-12-16", "authors_parsed": [["Ranco", "Gabriele", ""], ["Bordino", "Ilaria", ""], ["Bormetti", "Giacomo", ""], ["Caldarelli", "Guido", ""], ["Lillo", "Fabrizio", ""], ["Treccani", "Michele", ""]]}, {"id": "1412.6244", "submitter": "Aleksejus Kononovicius", "authors": "Aleksejus Kononovicius, Julius Ruseckas", "title": "Nonlinear GARCH model and 1/f noise", "comments": "12 pages, 4 figures", "journal-ref": "Physica A 427, 2015, pp. 74-81", "doi": "10.1016/j.physa.2015.02.040", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Auto-regressive conditionally heteroskedastic (ARCH) family models are still\nused, by practitioners in business and economic policy making, as a conditional\nvolatility forecasting models. Furthermore ARCH models still are attracting an\ninterest of the researchers. In this contribution we consider the well known\nGARCH(1,1) process and its nonlinear modifications, reminiscent of NGARCH\nmodel. We investigate the possibility to reproduce power law statistics,\nprobability density function and power spectral density, using ARCH family\nmodels. For this purpose we derive stochastic differential equations from the\nGARCH processes in consideration. We find the obtained equations to be similar\nto a general class of stochastic differential equations known to reproduce\npower law statistics. We show that linear GARCH(1,1) process has power law\ndistribution, but its power spectral density is Brownian noise-like. However,\nthe nonlinear modifications exhibit both power law distribution and power\nspectral density of the power law form, including 1/f noise.\n", "versions": [{"version": "v1", "created": "Fri, 19 Dec 2014 08:04:57 GMT"}, {"version": "v2", "created": "Fri, 13 Feb 2015 09:13:01 GMT"}], "update_date": "2015-02-24", "authors_parsed": [["Kononovicius", "Aleksejus", ""], ["Ruseckas", "Julius", ""]]}, {"id": "1412.7096", "submitter": "Emmanuel Bacry", "authors": "Emmanuel Bacry and Thibault Jaisson and Jean-Francois Muzy", "title": "Estimation of slowly decreasing Hawkes kernels: Application to high\n  frequency order book modelling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a modified version of the non parametric Hawkes kernel estimation\nprocedure studied in arXiv:1401.0903 that is adapted to slowly decreasing\nkernels. We show on numerical simulations involving a reasonable number of\nevents that this method allows us to estimate faithfully a power-law decreasing\nkernel over at least 6 decades. We then propose a 8-dimensional Hawkes model\nfor all events associated with the first level of some asset order book.\nApplying our estimation procedure to this model, allows us to uncover the main\nproperties of the coupled dynamics of trade, limit and cancel orders in\nrelationship with the mid-price variations.\n", "versions": [{"version": "v1", "created": "Mon, 22 Dec 2014 18:58:03 GMT"}], "update_date": "2014-12-30", "authors_parsed": [["Bacry", "Emmanuel", ""], ["Jaisson", "Thibault", ""], ["Muzy", "Jean-Francois", ""]]}, {"id": "1412.8017", "submitter": "Omar Rojas", "authors": "Semei Coronado-Ram\\'irez, Pedro Celso-Arellano and Omar Rojas", "title": "Adaptive Market Efficiency of Agricultural Commodity Futures Contracts", "comments": "11 pages", "journal-ref": "Contaduria y Administacion, 2015, 60(2), 372-382", "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper we investigate the adaptive market efficiency of the\nagricultural commodity futures market, using a sample of eight futures\ncontracts. Using a battery of nonlinear tests, we uncover the nonlinear serial\ndependence in the returns series. We run the Hinich portmanteau bicorrelation\ntest to uncover the moments in which the nonlinear serial dependence, and\ntherefore adaptive market efficiency, occurs for our sample.\n", "versions": [{"version": "v1", "created": "Sat, 27 Dec 2014 05:27:32 GMT"}, {"version": "v2", "created": "Tue, 24 Mar 2015 06:43:09 GMT"}, {"version": "v3", "created": "Tue, 31 Mar 2015 23:55:28 GMT"}], "update_date": "2015-04-02", "authors_parsed": [["Coronado-Ramírez", "Semei", ""], ["Celso-Arellano", "Pedro", ""], ["Rojas", "Omar", ""]]}]