[{"id": "1505.00003", "submitter": "Dimitris Kugiumtzis", "authors": "G. Papadopoulos and D. Kugiumtzis", "title": "Estimation of connectivity measures in gappy time series", "comments": "20 pages, 10 figures, submitted to Physica A", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME math.ST physics.data-an q-fin.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new method is proposed to compute connectivity measures on multivariate\ntime series with gaps. Rather than removing or filling the gaps, the rows of\nthe joint data matrix containing empty entries are removed and the calculations\nare done on the remainder matrix. The method, called measure adapted gap\nremoval (MAGR), can be applied to any connectivity measure that uses a joint\ndata matrix, such as cross correlation, cross mutual information and transfer\nentropy. MAGR is favorably compared using these three measures to a number of\nknown gap-filling techniques, as well as the gap closure. The superiority of\nMAGR is illustrated on time series from synthetic systems and financial time\nseries.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2015 22:35:10 GMT"}], "update_date": "2015-05-04", "authors_parsed": [["Papadopoulos", "G.", ""], ["Kugiumtzis", "D.", ""]]}, {"id": "1505.00328", "submitter": "Wei-Xing Zhou", "authors": "Huai-Long Shi, Zhi-Qiang Jiang, Wei-Xing Zhou (ECUST)", "title": "Profitability of contrarian strategies in the Chinese stock market", "comments": "24 pages (including 4 figures and 9 tables) + 5 supplementary figures\n  + 10 supplementary tables", "journal-ref": "PLoS ONE 10(9), e0137892 (2015)", "doi": "10.1371/journal.pone.0137892", "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper reexamines the profitability of loser, winner and contrarian\nportfolios in the Chinese stock market using monthly data of all stocks traded\non the Shanghai Stock Exchange and Shenzhen Stock Exchange covering the period\nfrom January 1997 to December 2012. We find evidence of short-term and\nlong-term contrarian profitability in the whole sample period when the\nestimation and holding horizons are 1 month or longer than 12 months and the\nannualized returns of contrarian portfolios increases with the estimation and\nholding horizons. We perform subperiod analysis and find that the long-term\ncontrarian effect is significant in both bullish and bearish states while the\nshort-term contrarian effect disappears in bullish states. We compare the\nperformance of contrarian portfolios based on different grouping manners in the\nestimation period and unveil that decile grouping outperforms quintile grouping\nand tertile grouping, which is more evident and robust in the long run.\nGenerally, loser portfolios and winner portfolios have positive returns and\nloser portfolios perform much better than winner portfolios. Both loser and\nwinner portfolios in bullish states perform better than those in the whole\nsample period. In contrast, loser and winner portfolios have smaller returns in\nbearish states in which loser portfolio returns are significant only in the\nlong term and winner portfolio returns become insignificant. These results are\nrobust to the one-month skipping between the estimation and holding periods and\nfor the two stock exchanges. Our findings show that the Chinese stock market is\nnot efficient in the weak form. These findings also have obvious practical\nimplications for financial practitioners.\n", "versions": [{"version": "v1", "created": "Sat, 2 May 2015 09:19:31 GMT"}], "update_date": "2015-09-17", "authors_parsed": [["Shi", "Huai-Long", "", "ECUST"], ["Jiang", "Zhi-Qiang", "", "ECUST"], ["Zhou", "Wei-Xing", "", "ECUST"]]}, {"id": "1505.00704", "submitter": "Lucio Maria Calcagnile", "authors": "Lucio Maria Calcagnile, Giacomo Bormetti, Michele Treccani, Stefano\n  Marmi, Fabrizio Lillo", "title": "Collective synchronization and high frequency systemic instabilities in\n  financial markets", "comments": "28 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent years have seen an unprecedented rise of the role that technology\nplays in all aspects of human activities. Unavoidably, technology has heavily\nentered the Capital Markets trading space, to the extent that all major\nexchanges are now trading exclusively using electronic platforms. The ultra\nfast speed of information processing, order placement, and cancelling generates\nnew dynamics which is still not completely deciphered. Analyzing a large\ndataset of stocks traded on the US markets, our study evidences that since 2001\nthe level of synchronization of large price movements across assets has\nsignificantly increased. Even though the total number of over-threshold events\nhas diminished in recent years, when an event occurs, the average number of\nassets swinging together has increased. Quite unexpectedly, only a minor\nfraction of these events -- regularly less than 40% along all years -- can be\nconnected with the release of pre-announced macroeconomic news. We also\ndocument that the larger is the level of sistemicity of an event, the larger is\nthe probability -- and degree of sistemicity -- that a new event will occur in\nthe near future. This opens the way to the intriguing idea that systemic events\nemerge as an effect of a purely endogenous mechanism. Consistently, we present\na high-dimensional, yet parsimonious, model based on a class of self- and\ncross-exciting processes, termed Hawkes processes, which reconciles the\nmodeling effort with the empirical evidence.\n", "versions": [{"version": "v1", "created": "Mon, 4 May 2015 16:50:06 GMT"}], "update_date": "2015-05-05", "authors_parsed": [["Calcagnile", "Lucio Maria", ""], ["Bormetti", "Giacomo", ""], ["Treccani", "Michele", ""], ["Marmi", "Stefano", ""], ["Lillo", "Fabrizio", ""]]}, {"id": "1505.00829", "submitter": "Steven Pav", "authors": "Steven E. Pav", "title": "Inference on the Sharpe ratio via the upsilon distribution", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The upsilon distribution, the sum of independent chi random variates and a\nnormal, is introduced. As a special case, the upsilon distribution includes\nLecoutre's lambda-prime distribution. The upsilon distribution finds\napplication in Frequentist inference on the Sharpe ratio, including hypothesis\ntests on independent samples, confidence intervals, and prediction intervals,\nas well as their Bayesian counterparts. These tests are extended to the case of\nfactor models of returns.\n", "versions": [{"version": "v1", "created": "Mon, 4 May 2015 22:14:34 GMT"}, {"version": "v2", "created": "Mon, 22 Jun 2015 20:39:15 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Pav", "Steven E.", ""]]}, {"id": "1505.01333", "submitter": "Damien Challet", "authors": "Damien Challet", "title": "Sharper asset ranking from total drawdown durations", "comments": "21 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.soc-ph stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The total duration of drawdowns is shown to provide a moment-free, unbiased,\nefficient and robust estimator of Sharpe ratios both for Gaussian and\nheavy-tailed price returns. We then use this quantity to infer an analytic\nexpression of the bias of moment-based Sharpe ratio estimators as a function of\nthe return distribution tail exponent. The heterogeneity of tail exponents at\nany given time among assets implies that our new method yields significantly\ndifferent asset rankings than those of moment-based methods, especially in\nperiods large volatility. This is fully confirmed by using 20 years of\nhistorical data on 3449 liquid US equities.\n", "versions": [{"version": "v1", "created": "Wed, 6 May 2015 12:11:37 GMT"}, {"version": "v2", "created": "Fri, 2 Oct 2015 12:51:27 GMT"}, {"version": "v3", "created": "Tue, 6 Oct 2015 12:10:25 GMT"}, {"version": "v4", "created": "Mon, 26 Oct 2015 17:15:23 GMT"}, {"version": "v5", "created": "Wed, 28 Sep 2016 07:04:45 GMT"}, {"version": "v6", "created": "Wed, 8 Feb 2017 16:03:56 GMT"}], "update_date": "2017-02-09", "authors_parsed": [["Challet", "Damien", ""]]}, {"id": "1505.01550", "submitter": "Gordon J Ross", "authors": "Gordon J. Ross", "title": "Dynamic Multi-Factor Clustering of Financial Networks", "comments": "9 pages", "journal-ref": "Physical Review E (2014), 89: 022809", "doi": "10.1103/PhysRevE.89.022809", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the tendency for financial instruments to form clusters when\nthere are multiple factors influencing the correlation structure. Specifically,\nwe consider a stock portfolio which contains companies from different\nindustrial sectors, located in several different countries. Both sector\nmembership and geography combine to create a complex clustering structure where\ncompanies seem to first be divided based on sector, with geographical\nsubclusters emerging within each industrial sector. We argue that standard\ntechniques for detecting overlapping clusters and communities are not able to\ncapture this type of structure, and show how robust regression techniques can\ninstead be used to remove the influence of both sector and geography from the\ncorrelation matrix separately. Our analysis reveals that prior to the 2008\nfinancial crisis, companies did not tend to form clusters based on geography.\nThis changed immediately following the crisis, with geography becoming a more\nimportant determinant of clustering.\n", "versions": [{"version": "v1", "created": "Thu, 7 May 2015 00:40:07 GMT"}], "update_date": "2015-05-08", "authors_parsed": [["Ross", "Gordon J.", ""]]}, {"id": "1505.02750", "submitter": "Wei-Xing Zhou", "authors": "Ying-Hui Shao, Gao-Feng Gu, Zhi-Qiang Jiang, Wei-Xing Zhou (ECUST)", "title": "Effects of polynomial trends on detrending moving average analysis", "comments": "13 Latex pages including 3 figures", "journal-ref": "Fractals 23 (3), 1550034 (2015)", "doi": "10.1142/S0218348X15500346", "report-no": null, "categories": "physics.data-an physics.soc-ph q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The detrending moving average (DMA) algorithm is one of the best performing\nmethods to quantify the long-term correlations in nonstationary time series.\nMany long-term correlated time series in real systems contain various trends.\nWe investigate the effects of polynomial trends on the scaling behaviors and\nthe performances of three widely used DMA methods including backward algorithm\n(BDMA), centered algorithm (CDMA) and forward algorithm (FDMA). We derive a\ngeneral framework for polynomial trends and obtain analytical results for\nconstant shifts and linear trends. We find that the behavior of the CDMA method\nis not influenced by constant shifts. In contrast, linear trends cause a\ncrossover in the CDMA fluctuation functions. We also find that constant shifts\nand linear trends cause crossovers in the fluctuation functions obtained from\nthe BDMA and FDMA methods. When a crossover exists, the scaling behavior at\nsmall scales comes from the intrinsic time series while that at large scales is\ndominated by the constant shifts or linear trends. We also derive analytically\nthe expressions of crossover scales and show that the crossover scale depends\non the strength of the polynomial trend, the Hurst index, and in some cases\n(linear trends for BDMA and FDMA) the length of the time series. In all cases,\nthe BDMA and the FDMA behave almost the same under the influence of constant\nshifts or linear trends. Extensive numerical experiments confirm excellently\nthe analytical derivations. We conclude that the CDMA method outperforms the\nBDMA and FDMA methods in the presence of polynomial trends.\n", "versions": [{"version": "v1", "created": "Tue, 28 Apr 2015 02:42:19 GMT"}], "update_date": "2015-08-04", "authors_parsed": [["Shao", "Ying-Hui", "", "ECUST"], ["Gu", "Gao-Feng", "", "ECUST"], ["Jiang", "Zhi-Qiang", "", "ECUST"], ["Zhou", "Wei-Xing", "", "ECUST"]]}, {"id": "1505.04936", "submitter": "Mathieu Rosenbaum", "authors": "Weibing Huang and Mathieu Rosenbaum", "title": "Ergodicity and diffusivity of Markovian order book models: a general\n  framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a general Markovian framework for order book modeling. Through our\napproach, we aim at providing a tool enabling to get a better understanding of\nthe price formation process and of the link between microscopic and macroscopic\nfeatures of financial assets. To do so, we propose a new method of order book\nrepresentation, and decompose the problem of order book modeling into two\nsub-problems: dynamics of a continuous-time double auction system with a fixed\nreference price; interactions between the double auction system and the\nreference price movements. State dependency is included in our framework by\nallowing the order flow intensities to depend on the order book state.\nFurthermore, contrary to most existing models, the impact of the order book\nupdates on the reference price dynamics is not assumed to be instantaneous. We\nfirst prove that under general assumptions, our system is ergodic. Then we\ndeduce the convergence towards a Brownian motion of the rescaled price process.\n", "versions": [{"version": "v1", "created": "Tue, 19 May 2015 09:58:41 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Huang", "Weibing", ""], ["Rosenbaum", "Mathieu", ""]]}, {"id": "1505.05089", "submitter": "Yi Gu", "authors": "Ruonan Lin and Yi Gu", "title": "CEI: a new indicator measuring City Commercial Credit Risk initiated in\n  China", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Aiming at quantifying and evaluating the regional commercial environment\nalong with the level of economic development among cities in mainland China,\nthe concept of China City Commercial Environment Credit Index(CEI) was first\nintroduced and established in 2010. In this manuscript, a historical review and\ndetailed introduction of CEI is included, followed by statistical studies. In\nparticular, an independent statistical cross-check for the existing CEI-2012 is\nperformed and significant factors that play the most in influential roles are\ndiscussed.\n", "versions": [{"version": "v1", "created": "Sun, 17 May 2015 22:03:23 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Lin", "Ruonan", ""], ["Gu", "Yi", ""]]}, {"id": "1505.05491", "submitter": "Aizhan Issagali", "authors": "Aizhan Issagali, Damira Alshimbayeva and Aidana Zhalgas", "title": "Portfolio Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper Portfolio Optimization techniques were used to determine the\nmost favorable investment portfolio. In particular, stock indices of three\ncompanies, namely Microsoft Corporation, Christian Dior Fashion House and\nShevron Corporation were evaluated. Using this data the amounts invested in\neach asset when a portfolio is chosen on the efficient frontier were\ncalculated. In addition, the Portfolio with minimum variance, tangency\nportfolio and optimal Markowitz portfolio are presented.\n", "versions": [{"version": "v1", "created": "Tue, 19 May 2015 12:38:05 GMT"}], "update_date": "2015-05-21", "authors_parsed": [["Issagali", "Aizhan", ""], ["Alshimbayeva", "Damira", ""], ["Zhalgas", "Aidana", ""]]}, {"id": "1505.06053", "submitter": "Schehr Gregory", "authors": "Claude Godreche, Satya N. Majumdar, Gregory Schehr", "title": "Record statistics for random walk bridges", "comments": "40 pages, 11 figures, contribution to the JSTAT Special Issue based\n  on the Galileo Galilei Institute Workshop \"Advances in Nonequilibrium\n  Statistical Mechanics\". Published version", "journal-ref": "J. Stat. Mech. P07026 (2015)", "doi": "10.1088/1742-5468/2015/07/P07026", "report-no": null, "categories": "cond-mat.stat-mech q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the statistics of records in a random sequence\n$\\{x_B(0)=0,x_B(1),\\cdots, x_B(n)=x_B(0)=0\\}$ of $n$ time steps. The sequence\n$x_B(k)$'s represents the position at step $k$ of a random walk `bridge' of $n$\nsteps that starts and ends at the origin. At each step, the increment of the\nposition is a random jump drawn from a specified symmetric distribution. We\nstudy the statistics of records and record ages for such a bridge sequence, for\ndifferent jump distributions. In absence of the bridge condition, i.e., for a\nfree random walk sequence, the statistics of the number and ages of records\nexhibits a `strong' universality for all $n$, i.e., they are completely\nindependent of the jump distribution as long as the distribution is continuous.\nWe show that the presence of the bridge constraint destroys this strong `all\n$n$' universality. Nevertheless a `weaker' universality still remains for large\n$n$, where we show that the record statistics depends on the jump distributions\nonly through a single parameter $0<\\mu\\le 2$, known as the L\\'evy index of the\nwalk, but are insensitive to the other details of the jump distribution. We\nderive the most general results (for arbitrary jump distributions) wherever\npossible and also present two exactly solvable cases. We present numerical\nsimulations that verify our analytical results.\n", "versions": [{"version": "v1", "created": "Fri, 22 May 2015 12:55:36 GMT"}, {"version": "v2", "created": "Thu, 7 Jan 2016 15:50:30 GMT"}], "update_date": "2016-01-08", "authors_parsed": [["Godreche", "Claude", ""], ["Majumdar", "Satya N.", ""], ["Schehr", "Gregory", ""]]}, {"id": "1505.08117", "submitter": "Vadim Uritsky", "authors": "Olga Y. Uritskaya and Vadim M. Uritsky", "title": "Predictability of price movements in deregulated electricity markets", "comments": "15 pages, 7 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we investigate predictability of electricity prices in the\nCanadian provinces of Alberta and Ontario, as well as in the US Mid-C market.\nUsing scale-dependent detrended fluctuation analysis, spectral analysis, and\nthe probability distribution analysis we show that the studied markets exhibit\nstrongly anti-persistent properties suggesting that their dynamics can be\npredicted based on historic price records across the range of time scales from\none hour to one month. For both Canadian markets, the price movements reveal\nthree types of correlated behavior which can be used for forecasting. The\ndiscovered scenarios remain the same on different time scales up to one month\nas well as for on- and off- peak electricity data. These scenarios represent\nsharp increases of prices and are not present in the Mid-C market due to its\nlower volatility. We argue that extreme price movements in this market should\nfollow the same tendency as the more volatile Canadian markets. The estimated\nvalues of the Pareto indices suggest that the prediction of these events can be\nstatistically stable. The results obtained provide new relevant information for\nmanaging financial risks associated with the dynamics of electricity\nderivatives over time frame exceeding one day.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jan 2015 00:52:10 GMT"}], "update_date": "2015-06-01", "authors_parsed": [["Uritskaya", "Olga Y.", ""], ["Uritsky", "Vadim M.", ""]]}, {"id": "1505.08136", "submitter": "Provash  Mali", "authors": "Provash Mali, Amitabha Mukhopadhyay", "title": "Long-range memory and multifractality in gold markets", "comments": "21 pages, 10 figures, 2 tables", "journal-ref": "Phys. Scr. 90 (2015) 035209", "doi": "10.1088/0031-8949/90/3/035209", "report-no": null, "categories": "q-fin.ST physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Long-range correlation and fluctuation in the gold market time series of\nworld's two leading gold consuming countries, namely China and India, are\nstudied. For both the market series during the period 1985-2013 we observe a\nlong-range persistence of memory in the sequences of maxima (minima) of returns\nin successive time windows of fixed length, but the series as a whole are found\nto be uncorrelated. Multifractal analysis for these series as well as for the\nsequences of maxima (minima) is carried out in terms of the multifractal\ndetrended fluctuation analysis (MF-DFA) method. We observe a weak multifractal\nstructure for the original series that is mainly originated from the fat-tailed\nprobability distribution function of the values, and the multifractal nature of\nthe original time series is enriched into their sequences of maximal (minimal)\nreturns. A quantitative measure of multifractality is provided by using a set\nof \"complexity parameters\".\n", "versions": [{"version": "v1", "created": "Sun, 17 May 2015 11:14:09 GMT"}], "update_date": "2015-06-01", "authors_parsed": [["Mali", "Provash", ""], ["Mukhopadhyay", "Amitabha", ""]]}]