[{"id": "1506.00088", "submitter": "Adam D. Bull", "authors": "Adam D. Bull", "title": "Semimartingale detection and goodness-of-fit tests", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST q-fin.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In quantitative finance, we often fit a parametric semimartingale model to\nasset prices. To ensure our model is correct, we must then perform\ngoodness-of-fit tests. In this paper, we give a new goodness-of-fit test for\nvolatility-like processes, which is easily applied to a variety of\nsemimartingale models. In each case, we reduce the problem to the detection of\na semimartingale observed under noise. In this setting, we then describe a\nwavelet-thresholding test, which obtains adaptive and near-optimal detection\nrates.\n", "versions": [{"version": "v1", "created": "Sat, 30 May 2015 07:45:06 GMT"}, {"version": "v2", "created": "Tue, 29 Sep 2015 11:37:56 GMT"}, {"version": "v3", "created": "Sun, 28 Feb 2016 15:25:53 GMT"}, {"version": "v4", "created": "Mon, 6 Jun 2016 18:12:46 GMT"}], "update_date": "2016-06-07", "authors_parsed": [["Bull", "Adam D.", ""]]}, {"id": "1506.01660", "submitter": "Christian Beck", "authors": "Dan Xu and Christian Beck", "title": "Transition from lognormal to chi-square superstatistics for financial\n  time series", "comments": "8 pages, 15 figures, 1 table. Replaced by final version published in\n  Physica A", "journal-ref": "Physica A 453, 173 (2016)", "doi": "10.1016/j.physa.2016.02.057", "report-no": null, "categories": "q-fin.ST cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Share price returns on different time scales can be well modelled by a\nsuperstatistical dynamics. Here we provide an investigation which type of\nsuperstatistics is most suitable to properly describe share price dynamics on\nvarious time scales. It is shown that while chi-square superstatistics works\nwell on a time scale of days, on a much smaller time scale of minutes the price\nchanges are better described by lognormal superstatistics. The system dynamics\nthus exhibits a transition from lognormal to chi-square superstatistics as a\nfunction of time scale. We discuss a more general model interpolating between\nboth statistics which fits the observed data very well. We also present results\non correlation functions of the extracted superstatistical volatility\nparameter, which exhibits exponential decay for returns on large time scales,\nwhereas for returns on small time scales there are long-range correlations and\npower-law decay.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2015 17:27:56 GMT"}, {"version": "v2", "created": "Wed, 9 Mar 2016 16:26:26 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Xu", "Dan", ""], ["Beck", "Christian", ""]]}, {"id": "1506.01984", "submitter": "Luca Di Persio", "authors": "Luca Di Persio, Chiara Segala", "title": "Autoregressive approaches to import--export time series II: a concrete\n  case study", "comments": "Published at http://dx.doi.org/10.15559/15-VMSTA25 in the Modern\n  Stochastics: Theory and Applications (https://www.i-journals.org/vtxpp/VMSTA)\n  by VTeX (http://www.vtex.lt/)", "journal-ref": "Modern Stochastics: Theory and Applications 2015, Vol. 2, No. 1,\n  67-93", "doi": "10.15559/15-VMSTA25", "report-no": "VTeX-VMSTA-VMSTA25", "categories": "q-fin.ST math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present work constitutes the second part of a two-paper project that, in\nparticular, deals with an in-depth study of effective techniques used in\neconometrics in order to make accurate forecasts in the concrete framework of\none of the major economies of the most productive Italian area, namely the\nprovince of Verona. It is worth mentioning that this region is indubitably\nrecognized as the core of the commercial engine of the whole Italian country.\nThis is why our analysis has a concrete impact; it is based on real data, and\nthis is also the reason why particular attention has been taken in treating the\nrelevant economical data and in choosing the right methods to manage them to\nobtain good forecasts. In particular, we develop an approach mainly based on\nvector autoregression where lagged values of two or more variables are\nconsidered, Granger causality, and the stochastic trend approach useful to work\nwith the cointegration phenomenon.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2015 08:44:02 GMT"}], "update_date": "2015-06-08", "authors_parsed": [["Di Persio", "Luca", ""], ["Segala", "Chiara", ""]]}, {"id": "1506.02940", "submitter": "Luca Di Persio", "authors": "Luca Di Persio", "title": "Autoregressive approaches to import-export time series I: basic\n  techniques", "comments": "Published at http://dx.doi.org/10.15559/15-VMSTA22 in the Modern\n  Stochastics: Theory and Applications (https://www.i-journals.org/vtxpp/VMSTA)\n  by VTeX (http://www.vtex.lt/)", "journal-ref": "Modern Stochastics: Theory and Applications 2015, Vol. 2, No. 1,\n  51-65", "doi": "10.15559/15-VMSTA22", "report-no": "VTeX-VMSTA-VMSTA22", "categories": "stat.AP math.PR q-fin.ST stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work is the first part of a project dealing with an in-depth study of\neffective techniques used in econometrics in order to make accurate forecasts\nin the concrete framework of one of the major economies of the most productive\nItalian area, namely the province of Verona. In particular, we develop an\napproach mainly based on vector autoregressions, where lagged values of two or\nmore variables are considered, Granger causality, and the stochastic trend\napproach useful to work with the cointegration phenomenon. Latter techniques\nconstitute the core of the present paper, whereas in the second part of the\nproject, we present how these approaches can be applied to economic data at our\ndisposal in order to obtain concrete analysis of import--export behavior for\nthe considered productive area of Verona.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2015 07:23:44 GMT"}], "update_date": "2015-06-10", "authors_parsed": [["Di Persio", "Luca", ""]]}, {"id": "1506.04227", "submitter": "Steven Pav", "authors": "Steven E. Pav", "title": "Safety Third: Roy's Criterion and Higher Order Moments", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Roy's `Safety First' criterion for selecting one risky asset from many is\nadapted to the case of non-normal returns, via Cornish Fisher expansion. The\nresulting investment objective is consistent with first order stochastic\ndominance, and is equal to the Sharpe ratio for the case of normal returns. An\ninvestor selecting assets via this objective is not universally attracted to\npositive skew, rather the preference for skew depends on term, the expected\nreturn and the disastrous rate of return.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jun 2015 05:45:51 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Pav", "Steven E.", ""]]}, {"id": "1506.08054", "submitter": "Rudi Sch\\\"afer", "authors": "Marcel Wollschl\\\"ager and Rudi Sch\\\"afer", "title": "Impact of non-stationarity on estimating and modeling empirical copulas\n  of daily stock returns", "comments": "20 pages", "journal-ref": null, "doi": "10.21314/JOR.2016.342", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  All too often measuring statistical dependencies between financial time\nseries is reduced to a linear correlation coefficient. However this may not\ncapture all facets of reality. We study empirical dependencies of daily stock\nreturns by their pairwise copulas. Here we investigate particularly to which\nextent the non-stationarity of financial time series affects both the\nestimation and the modeling of empirical copulas. We estimate empirical copulas\nfrom the non-stationary, original return time series and stationary, locally\nnormalized ones. Thereby we are able to explore the empirical dependence\nstructure on two different scales: a global and a local one. Additionally the\nasymmetry of the empirical copulas is emphasized as a fundamental\ncharacteristic. We compare our empirical findings with a single Gaussian\ncopula, with a correlation-weighted average of Gaussian copulas, with the\nK-copula directly addressing the non-stationarity of dependencies as a model\nparameter, and with the skewed Student's t-copula. The K-copula covers the\nempirical dependence structure on the local scale most adequately, whereas the\nskewed Student's t-copula best captures the asymmetry of the empirical copula\non the global scale.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jun 2015 13:19:42 GMT"}], "update_date": "2017-09-01", "authors_parsed": [["Wollschläger", "Marcel", ""], ["Schäfer", "Rudi", ""]]}, {"id": "1506.08692", "submitter": "Jaroslaw Kwapien", "authors": "Jaroslaw Kwapien, Pawel Oswiecimka, Stanislaw Drozdz", "title": "Detrended fluctuation analysis made flexible to detect range of\n  cross-correlated fluctuations", "comments": null, "journal-ref": "Phys. Rev. E 92, 052815 (2015)", "doi": "10.1103/PhysRevE.92.052815", "report-no": null, "categories": "physics.data-an q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The detrended cross-correlation coefficient $\\rho_{\\rm DCCA}$ has recently\nbeen proposed to quantify the strength of cross-correlations on different\ntemporal scales in bivariate, non-stationary time series. It is based on the\ndetrended cross-correlation and detrended fluctuation analyses (DCCA and DFA,\nrespectively) and can be viewed as an analogue of the Pearson coefficient in\nthe case of the fluctuation analysis. The coefficient $\\rho_{\\rm DCCA}$ works\nwell in many practical situations but by construction its applicability is\nlimited to detection of whether two signals are generally cross-correlated,\nwithout possibility to obtain information on the amplitude of fluctuations that\nare responsible for those cross-correlations. In order to introduce some\nrelated flexibility, here we propose an extension of $\\rho_{\\rm DCCA}$ that\nexploits the multifractal versions of DFA and DCCA: MFDFA and MFCCA,\nrespectively. The resulting new coefficient $\\rho_q$ not only is able to\nquantify the strength of correlations, but also it allows one to identify the\nrange of detrended fluctuation amplitudes that are correlated in two signals\nunder study. We show how the coefficient $\\rho_q$ works in practical situations\nby applying it to stochastic time series representing processes with long\nmemory: autoregressive and multiplicative ones. Such processes are often used\nto model signals recorded from complex systems and complex physical phenomena\nlike turbulence, so we are convinced that this new measure can successfully be\napplied in time series analysis. In particular, we present an example of such\napplication to highly complex empirical data from financial markets. The\npresent formulation can straightforwardly be extended to multivariate data in\nterms of the $q$-dependent counterpart of the correlation matrices and then to\nthe network representation.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2015 15:44:44 GMT"}, {"version": "v2", "created": "Tue, 10 Nov 2015 15:43:43 GMT"}], "update_date": "2015-12-09", "authors_parsed": [["Kwapien", "Jaroslaw", ""], ["Oswiecimka", "Pawel", ""], ["Drozdz", "Stanislaw", ""]]}, {"id": "1506.08847", "submitter": "Provash  Mali", "authors": "Provash Mali and Amitabha Mukhopadhyay", "title": "Multifractal characterization of gold market: a multifractal detrended\n  fluctuation analysis", "comments": "20 pages, 7 figures, 1 table", "journal-ref": "Physica A 413,2014,361-372", "doi": "10.1016/j.physa.2014.06.076", "report-no": null, "categories": "q-fin.ST physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The multifractal detrended fluctuation analysis technique is employed to\nanalyze the time series of gold consumer price index (CPI) and the market trend\nof three world's highest gold consuming countries, namely China, India and\nTurkey for the period: 1993-July 2013. Various multifractal variables, such as\nthe generalized Hurst exponent, the multifractal exponent and the singularity\nspectrum, are calculated and the results are fitted to the generalized binomial\nmultifractal (GBM) series that consists of only two parameters. Special\nemphasis is given to identify the possible source(s) of multifractality in\nthese series. Our analysis shows that the CPI series and all three market\nseries are of multifractal nature. The origin of multifractality for the CPI\ntime series and Indian market series is found due to a long-range time\ncorrelation, whereas it is mostly due to the fat-tailed probability\ndistributions of the values for the Chinese and Turkey markets. The GBM model\nseries more or less describes all the time series analyzed here.\n", "versions": [{"version": "v1", "created": "Sun, 17 May 2015 07:27:26 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Mali", "Provash", ""], ["Mukhopadhyay", "Amitabha", ""]]}]