[{"id": "1508.00310", "submitter": "Mike Ludkovski", "authors": "James Risk and Michael Ludkovski", "title": "Statistical Emulators for Pricing and Hedging Longevity Risk Products", "comments": "29 pages and 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose the use of statistical emulators for the purpose of valuing\nmortality-linked contracts in stochastic mortality models. Such models\ntypically require (nested) evaluation of expected values of nonlinear\nfunctionals of multi-dimensional stochastic processes. Except in the simplest\ncases, no closed-form expressions are available, necessitating numerical\napproximation. Rather than building ad hoc analytic approximations, we advocate\nthe use of modern statistical tools from machine learning to generate a\nflexible, non-parametric surrogate for the true mappings. This method allows\nperformance guarantees regarding approximation accuracy and removes the need\nfor nested simulation. We illustrate our approach with case studies involving\n(i) a Lee-Carter model with mortality shocks, (ii) index-based static hedging\nwith longevity basis risk; (iii) a Cairns-Blake-Dowd stochastic survival\nprobability model.\n", "versions": [{"version": "v1", "created": "Mon, 3 Aug 2015 04:00:58 GMT"}, {"version": "v2", "created": "Mon, 14 Sep 2015 17:55:53 GMT"}], "update_date": "2015-09-15", "authors_parsed": [["Risk", "James", ""], ["Ludkovski", "Michael", ""]]}, {"id": "1508.01661", "submitter": "Leopold S\\\"ogner", "authors": "Jaroslava Hlouskova and Leopold S\\\"ogner", "title": "GMM Estimation of Affine Term Structure Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article investigates parameter estimation of affine term structure\nmodels by means of the generalized method of moments. Exact moments of the\naffine latent process as well as of the yields are obtained by using results\nderived for p-polynomial processes. Then the generalized method of moments,\ncombined with Quasi-Bayesian methods, is used to get reliable parameter\nestimates and to perform inference. After a simulation study, the estimation\nprocedure is applied to empirical interest rate data.\n", "versions": [{"version": "v1", "created": "Fri, 7 Aug 2015 11:29:53 GMT"}], "update_date": "2015-08-10", "authors_parsed": [["Hlouskova", "Jaroslava", ""], ["Sögner", "Leopold", ""]]}, {"id": "1508.02203", "submitter": "Sabiou Inoua", "authors": "Sabiou Inoua", "title": "The Intrinsic Instability of Financial Markets", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we explain the wild fluctuations of financial prices from the\nintrinsic amplifying feedback of speculative supply and demand. Formally, we\nshow that an asset return follows a multiplicative random growth with exogenous\ninput, which is well-known to be a generic power-law generating process, and\nwhich could thus easily explain the well-established power-law distribution of\nreturns, and other related variables. Moreover, the theory we develop here is a\ngeneral framework where competing ideas can be discussed in a unified way. The\ndominant random walk model, for instance, is easily derived in this framework\nif we superimpose market clearing (central to neoclassical economics). It\ncorresponds to the case where the feedback in price dynamics is ignored in\nfavor of the external input, namely the random inflow of news from the real\neconomy.\n", "versions": [{"version": "v1", "created": "Mon, 10 Aug 2015 11:17:58 GMT"}], "update_date": "2015-08-11", "authors_parsed": [["Inoua", "Sabiou", ""]]}, {"id": "1508.04348", "submitter": "Efstathios Panayi", "authors": "Efstathios Panayi, Gareth W. Peters, Jon Danielsson, Jean-Pierre\n  Zigrand", "title": "Designating market maker behaviour in Limit Order Book markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial exchanges provide incentives for limit order book (LOB) liquidity\nprovision to certain market participants, termed designated market makers or\ndesignated sponsors. While quoting requirements typically enforce the activity\nof these participants for a certain portion of the day, we argue that liquidity\ndemand throughout the trading day is far from uniformly distributed, and thus\nthis liquidity provision may not be calibrated to the demand. We propose that\nquoting obligations also include requirements about the speed of liquidity\nreplenishment, and we recommend use of the Threshold Exceedance Duration (TED)\nfor this purpose. We present a comprehensive regression modelling approach\nusing GLM and GAMLSS models to relate the TED to the state of the LOB and\nidentify the regression structures that are best suited to modelling the TED.\nSuch an approach can be used by exchanges to set target levels of liquidity\nreplenishment for designated market makers.\n", "versions": [{"version": "v1", "created": "Tue, 18 Aug 2015 15:23:52 GMT"}], "update_date": "2015-08-19", "authors_parsed": [["Panayi", "Efstathios", ""], ["Peters", "Gareth W.", ""], ["Danielsson", "Jon", ""], ["Zigrand", "Jean-Pierre", ""]]}, {"id": "1508.04512", "submitter": "Aurelio Fernandez Bariviera", "authors": "Aurelio F. Bariviera, M.T. Martin, A. Plastino, V. Vampa", "title": "LIBOR troubles: anomalous movements detection based on Maximum Entropy", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2016.01.005", "report-no": null, "categories": "q-fin.ST q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  According to the definition of the London Interbank Offered Rate (LIBOR),\ncontributing banks should give fair estimates of their own borrowing costs in\nthe interbank market. Between 2007 and 2009, several banks made inappropriate\nsubmissions of LIBOR, sometimes motivated by profit-seeking from their trading\npositions. In 2012, several newspapers' articles began to cast doubt on LIBOR\nintegrity, leading surveillance authorities to conduct investigations on banks'\nbehavior. Such procedures resulted in severe fines imposed to involved banks,\nwho recognized their financial inappropriate conduct. In this paper, we uncover\nsuch unfair behavior by using a forecasting method based on the Maximum Entropy\nprinciple. Our results are robust against changes in parameter settings and\ncould be of great help for market surveillance.\n", "versions": [{"version": "v1", "created": "Wed, 19 Aug 2015 03:17:36 GMT"}], "update_date": "2016-03-23", "authors_parsed": [["Bariviera", "Aurelio F.", ""], ["Martin", "M. T.", ""], ["Plastino", "A.", ""], ["Vampa", "V.", ""]]}, {"id": "1508.04748", "submitter": "Aurelio Fernandez Bariviera", "authors": "Aurelio F. Bariviera, M. Bel\\'en Guercio, Lisana B. Martinez, Osvaldo\n  A. Rosso", "title": "The (in)visible hand in the Libor market: an Information Theory approach", "comments": "PACS 89.65.Gh Econophysics; 74.40.De noise and chaos", "journal-ref": "The European Physical Journal B (2015) 88(8):208", "doi": "10.1140/epjb/e2015-60410-1", "report-no": null, "categories": "q-fin.ST q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyzes several interest rates time series from the United\nKingdom during the period 1999 to 2014. The analysis is carried out using a\npioneering statistical tool in the financial literature: the complexity-entropy\ncausality plane. This representation is able to classify different stochastic\nand chaotic regimes in time series. We use sliding temporal windows to assess\nchanges in the intrinsic stochastic dynamics of the time series. Anomalous\nbehavior in the Libor is detected, especially around the time of the last\nfinancial crisis, that could be consistent with data manipulation.\n", "versions": [{"version": "v1", "created": "Wed, 19 Aug 2015 19:27:39 GMT"}], "update_date": "2015-08-20", "authors_parsed": [["Bariviera", "Aurelio F.", ""], ["Guercio", "M. Belén", ""], ["Martinez", "Lisana B.", ""], ["Rosso", "Osvaldo A.", ""]]}, {"id": "1508.04754", "submitter": "Sandro Lera", "authors": "Sandro Claudio Lera and Didier Sornette", "title": "Currency target zone modeling: An interplay between physics and\n  economics", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevE.92.062828", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the performance of the euro/Swiss franc exchange rate in the\nextraordinary period from September 6, 2011 and January 15, 2015 when the Swiss\nNational Bank enforced a minimum exchange rate of 1.20 Swiss francs per euro.\nBased on the analogy between Brownian motion in finance and physics, the\nfirst-order effect of such a steric constraint would enter a priori in the form\nof a repulsive entropic force associated with the paths crossing the barrier\nthat are forbidden. Non-parametric empirical estimates of drift and volatility\nshow that the predicted first-order analogy between economics and physics are\nincorrect. The clue is to realise that the random walk nature of financial\nprices results from the continuous anticipations of traders about future\nopportunities, whose aggregate actions translate into an approximate efficient\nmarket with almost no arbitrage opportunities. With the Swiss National Bank\nstated commitment to enforce the barrier, traders's anticipation of this action\nleads to a vanishing drift together with a volatility of the exchange rate that\ndepends on the distance to the barrier. We give direct quantitative empirical\nevidence that this effect is well described by Krugman's target zone model\n[P.R. Krugman. The Quarterly Journal of Economics, 106(3):669-682, 1991].\nMotivated by the insights from this economical model, we revise the initial\neconomics-physics analogy and show that, within the context of hindered\ndiffusion, the two systems can be described with the same mathematics after\nall. Using a recently proposed extended analogy in terms of a colloidal\nBrownian particle embedded in a fluid of molecules associated with the\nunderlying order book, we derive that, close to the restricting boundary, the\ndynamics of both systems is described by a stochastic differential equation\nwith a very small constant drift and a linear diffusion coefficient.\n", "versions": [{"version": "v1", "created": "Tue, 18 Aug 2015 08:18:48 GMT"}, {"version": "v2", "created": "Fri, 23 Oct 2015 09:25:35 GMT"}], "update_date": "2016-01-20", "authors_parsed": [["Lera", "Sandro Claudio", ""], ["Sornette", "Didier", ""]]}, {"id": "1508.07428", "submitter": "Noemi Nava", "authors": "Noemi Nava, Tiziana Di Matteo and Tomaso Aste", "title": "Time-dependent scaling patterns in high frequency financial data", "comments": "28 pages, 10 figures", "journal-ref": null, "doi": "10.1140/epjst/e2015-50328-y", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We measure the influence of different time-scales on the dynamics of\nfinancial market data. This is obtained by decomposing financial time series\ninto simple oscillations associated with distinct time-scales. We propose two\nnew time-varying measures: 1) an amplitude scaling exponent and 2) an\nentropy-like measure. We apply these measures to intraday, 30-second sampled\nprices of various stock indices. Our results reveal intraday trends where\ndifferent time-horizons contribute with variable relative amplitudes over the\ncourse of the trading day. Our findings indicate that the time series we\nanalysed have a non-stationary multifractal nature with predominantly\npersistent behaviour at the middle of the trading session and anti-persistent\nbehaviour at the open and close. We demonstrate that these deviations are\nstatistically significant and robust.\n", "versions": [{"version": "v1", "created": "Sat, 29 Aug 2015 10:16:51 GMT"}, {"version": "v2", "created": "Wed, 16 Dec 2015 15:08:17 GMT"}], "update_date": "2016-11-23", "authors_parsed": [["Nava", "Noemi", ""], ["Di Matteo", "Tiziana", ""], ["Aste", "Tomaso", ""]]}, {"id": "1508.07505", "submitter": "Zhi-Qiang Jiang", "authors": "Zhi-Qiang Jiang (ECUST, BU), Askery A. Canabarro (UFAL, BU), Boris\n  Podobnik (UR), H. Eugene Stanley (BU), and Wei-Xing Zhou (ECUST)", "title": "Early warning of large volatilities based on recurrence interval\n  analysis in Chinese stock markets", "comments": "13 pages and 7 figures", "journal-ref": "Quantitative Finance 16 (11), 1713-1724 (2016)", "doi": "10.1080/14697688.2016.1175656", "report-no": null, "categories": "q-fin.ST q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Being able to forcast extreme volatility is a central issue in financial risk\nmanagement. We present a large volatility predicting method based on the\ndistribution of recurrence intervals between volatilities exceeding a certain\nthreshold $Q$ for a fixed expected recurrence time $\\tau_Q$. We find that the\nrecurrence intervals are well approximated by the $q$-exponential distribution\nfor all stocks and all $\\tau_Q$ values. Thus a analytical formula for\ndetermining the hazard probability $W(\\Delta t |t)$ that a volatility above $Q$\nwill occur within a short interval $\\Delta t$ if the last volatility exceeding\n$Q$ happened $t$ periods ago can be directly derived from the $q$-exponential\ndistribution, which is found to be in good agreement with the empirical hazard\nprobability from real stock data. Using these results, we adopt a\ndecision-making algorithm for triggering the alarm of the occurrence of the\nnext volatility above $Q$ based on the hazard probability. Using a \"receiver\noperator characteristic\" (ROC) analysis, we find that this predicting method\nefficiently forecasts the occurrance of large volatility events in real stock\ndata. Our analysis may help us better understand reoccurring large volatilities\nand more accurately quantify financial risks in stock markets.\n", "versions": [{"version": "v1", "created": "Sat, 29 Aug 2015 21:16:53 GMT"}], "update_date": "2016-10-05", "authors_parsed": [["Jiang", "Zhi-Qiang", "", "ECUST, BU"], ["Canabarro", "Askery A.", "", "UFAL, BU"], ["Podobnik", "Boris", "", "UR"], ["Stanley", "H. Eugene", "", "BU"], ["Zhou", "Wei-Xing", "", "ECUST"]]}, {"id": "1508.07534", "submitter": "Daniya Tlegenova", "authors": "Daniya Tlegenova", "title": "Forecasting Exchange Rates Using Time Series Analysis: The sample of the\n  currency of Kazakhstan", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper models yearly exchange rates between USD/KZT, EUR/KZT and SGD/KZT,\nand compares the actual data with developed forecasts using time series\nanalysis over the period from 2006 to 2014. The official yearly data of\nNational Bank of the Republic of Kazakhstan is used for present study. The main\ngoal of this paper is to apply the ARIMA model for forecasting of yearly\nexchange rates of USD/KZT, EUR/KZT and SGD/KZT. The accuracy of the forecast is\ncompared with Mean Absolute Error (MAE), Mean Absolute Percentage Error (MAPE)\nand Root Mean Squared Error (RMSE).\n", "versions": [{"version": "v1", "created": "Sun, 30 Aug 2015 06:30:07 GMT"}], "update_date": "2015-09-01", "authors_parsed": [["Tlegenova", "Daniya", ""]]}, {"id": "1508.07891", "submitter": "Tzu-Wei Yang", "authors": "Tzu-Wei Yang and Lingjiong Zhu", "title": "A reduced-form model for level-1 limit order books", "comments": null, "journal-ref": "Market Microstructure and Liquidity, Volume 02, Issue 02,\n  September 2016", "doi": "10.1142/S2382626616500088", "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One popular approach to model the limit order books dynamics of the best bid\nand ask at level-1 is to use the reduced-form diffusion approximations. It is\nwell known that the biggest contributing factor to the price movement is the\nimbalance of the best bid and ask. We investigate the data of the level-1 limit\norder books of a basket of stocks and study the numerical evidence of drift,\ncorrelation, volatility and their dependence on the imbalance. Based on the\nnumerical discoveries, we develop a nonparametric discrete model for the\ndynamics of the best bid and ask, which can be approximated by a reduced-form\nmodel with analytical tractability that can fit the empirical data of\ncorrelation, volatilities and probability of price movement simultaneously.\n", "versions": [{"version": "v1", "created": "Mon, 31 Aug 2015 16:16:23 GMT"}, {"version": "v2", "created": "Tue, 1 Sep 2015 02:24:23 GMT"}, {"version": "v3", "created": "Mon, 19 Oct 2015 19:37:21 GMT"}, {"version": "v4", "created": "Mon, 14 Nov 2016 18:48:36 GMT"}], "update_date": "2016-12-13", "authors_parsed": [["Yang", "Tzu-Wei", ""], ["Zhu", "Lingjiong", ""]]}]