[{"id": "1701.01185", "submitter": "Simon Clinet", "authors": "Simon Clinet and Yoann Potiron", "title": "Efficient asymptotic variance reduction when estimating volatility in\n  high frequency data", "comments": "60 pages, 8 tables, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper shows how to carry out efficient asymptotic variance reduction\nwhen estimating volatility in the presence of stochastic volatility and\nmicrostructure noise with the realized kernels (RK) from [Barndorff-Nielsen et\nal., 2008] and the quasi-maximum likelihood estimator (QMLE) studied in [Xiu,\n2010]. To obtain such a reduction, we chop the data into B blocks, compute the\nRK (or QMLE) on each block, and aggregate the block estimates. The ratio of\nasymptotic variance over the bound of asymptotic efficiency converges as B\nincreases to the ratio in the parametric version of the problem, i.e. 1.0025 in\nthe case of the fastest RK Tukey-Hanning 16 and 1 for the QMLE. The impact of\nstochastic sampling times and jump in the price process is examined carefully.\nThe finite sample performance of both estimators is investigated in\nsimulations, while empirical work illustrates the gain in practice.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2017 00:13:36 GMT"}, {"version": "v2", "created": "Fri, 7 Jul 2017 06:16:29 GMT"}, {"version": "v3", "created": "Wed, 27 Jun 2018 01:57:31 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Clinet", "Simon", ""], ["Potiron", "Yoann", ""]]}, {"id": "1701.01255", "submitter": "Aleksejus Kononovicius", "authors": "V. Gontis and A. Kononovicius", "title": "Burst and inter-burst duration statistics as empirical test of\n  long-range memory in the financial markets", "comments": "10 pages, 7 figures", "journal-ref": null, "doi": "10.1016/j.physa.2017.04.163", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the problem of long-range memory in the financial markets. There\nare two conceptually different ways to reproduce power-law decay of\nauto-correlation function: using fractional Brownian motion as well as\nnon-linear stochastic differential equations. In this contribution we address\nthis problem by analyzing empirical return and trading activity time series\nfrom the Forex. From the empirical time series we obtain probability density\nfunctions of burst and inter-burst duration. Our analysis reveals that the\npower-law exponents of the obtained probability density functions are close to\n$3/2$, which is a characteristic feature of the one-dimensional stochastic\nprocesses. This is in a good agreement with earlier proposed model of absolute\nreturn based on the non-linear stochastic differential equations derived from\nthe agent-based herding model.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jan 2017 09:19:33 GMT"}], "update_date": "2017-05-24", "authors_parsed": [["Gontis", "V.", ""], ["Kononovicius", "A.", ""]]}, {"id": "1701.05016", "submitter": "Ziping Zhao", "authors": "Ziping Zhao and Daniel P. Palomar", "title": "Mean-Reverting Portfolio Design with Budget Constraint", "comments": "Paper submitted to IEEE Transactions on Signal Processing. Part of\n  this work will appear in the Proceedings of the 50th annual Asilomar\n  conference on signals, systems, and computers, Nov. 6-9, 2016, CA, USA", "journal-ref": null, "doi": "10.1109/TSP.2018.2799193", "report-no": null, "categories": "q-fin.PM q-fin.CP q-fin.MF q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the mean-reverting portfolio design problem arising from\nstatistical arbitrage in the financial markets. We first propose a general\nproblem formulation aimed at finding a portfolio of underlying component assets\nby optimizing a mean-reversion criterion characterizing the mean-reversion\nstrength, taking into consideration the variance of the portfolio and an\ninvestment budget constraint. Then several specific problems are considered\nbased on the general formulation, and efficient algorithms are proposed.\nNumerical results on both synthetic and market data show that our proposed\nmean-reverting portfolio design methods can generate consistent profits and\noutperform the traditional design methods and the benchmark methods in the\nliterature.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2017 11:33:51 GMT"}], "update_date": "2018-05-09", "authors_parsed": [["Zhao", "Ziping", ""], ["Palomar", "Daniel P.", ""]]}, {"id": "1701.05091", "submitter": "Olivier Wintenberger", "authors": "Rasmus Pedersen, Olivier Wintenberger (LSTA, University of Copenhagen)", "title": "On the tail behavior of a class of multivariate conditionally\n  heteroskedastic processes", "comments": "Extremes, Springer Verlag (Germany), A Para\\^itre", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST math.PR q-fin.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Conditions for geometric ergodicity of multivariate autoregressive\nconditional heteroskedasticity (ARCH) processes, with the so-called BEKK (Baba,\nEngle, Kraft, and Kroner) parametrization, are considered. We show for a class\nof BEKK-ARCH processes that the invariant distribution is regularly varying. In\norder to account for the possibility of different tail indices of the\nmarginals, we consider the notion of vector scaling regular variation, in the\nspirit of Perfekt (1997, Advances in Applied Probability, 29, pp. 138-164). The\ncharacterization of the tail behavior of the processes is used for deriving the\nasymptotic properties of the sample covariance matrices.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2017 15:15:21 GMT"}, {"version": "v2", "created": "Fri, 3 Feb 2017 07:27:42 GMT"}, {"version": "v3", "created": "Tue, 5 Dec 2017 16:29:38 GMT"}], "update_date": "2017-12-06", "authors_parsed": [["Pedersen", "Rasmus", "", "LSTA, University of Copenhagen"], ["Wintenberger", "Olivier", "", "LSTA, University of Copenhagen"]]}, {"id": "1701.05176", "submitter": "Oisin Connolly", "authors": "Oisin Connolly", "title": "Dynamic Prize Linked Savings: Maximizing Savings and Managing Risk", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Prize linked savings accounts provide a return in the form of randomly chosen\naccounts receiving large cash prizes, in lieu of a guaranteed and uniform\ninterest rate. This model became legal for American national banks upon\nbipartisan passage of the American Savings Promotion Act in December 2014, and\nmany states have deregulated this option for state chartered banks and credit\nunions in recent years. Prize linked savings programs have unique appeal and\nproven societal benefits, but the product is still not available to the vast\nmajority of Americans. There is demonstrated interest in these products, but\nthe supply side may be the bottleneck, because the prevailing consensus is that\nprize linked savings primarily appeal to low income consumers. This paper\nexamines a less common, dynamic prize, model of prize linked savings and shows\nwhy it might result in a larger average account size. The paper proposes three\nmethods of managing risk under this model, and tests two of them using a Monte\nCarlo simulation. We conclude that both tested methods are effective at\nmitigating the most severe risks.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2017 18:34:04 GMT"}], "update_date": "2017-01-19", "authors_parsed": [["Connolly", "Oisin", ""]]}, {"id": "1701.07152", "submitter": "Worapree Ole Maneesoonthorn", "authors": "Rub\\'en Loaiza-Maya, Michael S. Smith and Worapree Maneesoonthorn", "title": "Time Series Copulas for Heteroskedastic Data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose parametric copulas that capture serial dependence in stationary\nheteroskedastic time series. We develop our copula for first order Markov\nseries, and extend it to higher orders and multivariate series. We derive the\ncopula of a volatility proxy, based on which we propose new measures of\nvolatility dependence, including co-movement and spillover in multivariate\nseries. In general, these depend upon the marginal distributions of the series.\nUsing exchange rate returns, we show that the resulting copula models can\ncapture their marginal distributions more accurately than univariate and\nmultivariate GARCH models, and produce more accurate value at risk forecasts.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jan 2017 04:01:35 GMT"}], "update_date": "2017-01-26", "authors_parsed": [["Loaiza-Maya", "Rubén", ""], ["Smith", "Michael S.", ""], ["Maneesoonthorn", "Worapree", ""]]}, {"id": "1701.07175", "submitter": "Swarn Chatterjee", "authors": "Swarn Chatterjee", "title": "Day of the Week Effect in biotechnology stocks: An Application of the\n  GARCH processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study examines the presence of the day-of-the-week effect on daily\nreturns of biotechnology stocks over a 16-year period from January 2002 to\nDecember 2015. Using daily returns from the NASDAQ Biotechnology Index (NBI),\nwe find that the stock returns were the lowest on Mondays, and compared to the\nMondays the stock returns were significantly higher on Wednesdays, Thursdays,\nand Fridays. Moreover, the results from using the asymmetric GARCH processes\nreveal that momentum and small-firm effect were positively associated with the\nmarket risk-adjusted returns of the biotechnology stocks during this period.\nThe findings of our study suggest that active portfolio managers need to\nconsider the day of the week, momentum, and small-firm effect when making\ntrading decisions for biotechnology stocks.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jan 2017 06:11:35 GMT"}], "update_date": "2017-01-26", "authors_parsed": [["Chatterjee", "Swarn", ""]]}]