[{"id": "1706.00467", "submitter": "Hynek Lavicka", "authors": "Hynek Lavicka, Jiri Kracik", "title": "Fluctuation analysis of electric power loads in Europe: Correlation\n  multifractality vs. Distribution function multifractality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the time series of the power loads of the 35 separated countries\npublicly sharing hourly data through ENTSO-E platform for more than 5 years. We\napply the Multifractal Detrended Fluctuation Analysis for the demonstration of\nthe multifractal nature, autocorrelation and the distribution function\nfundamentals. Additionally, we improved the basic method described by\nKanterhardt, et al using uniform shuffling and surrogate the datasets to prove\nthe robustness of the results with respect to the non-linear effects of the\nprocesses. All the datasets exhibit multifractality in the distribution\nfunction as well as in the autocorrelation function. The basic differences\nbetween individual states are manifested in the width of the multifractal\nspectra and in the location of the maximum. We present the hypothesis about the\nproduction portfolio and the export/import dependences.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jun 2017 19:25:22 GMT"}], "update_date": "2017-06-05", "authors_parsed": [["Lavicka", "Hynek", ""], ["Kracik", "Jiri", ""]]}, {"id": "1706.00948", "submitter": "Xinyao Qian", "authors": "Xin-Yao Qian", "title": "Financial Series Prediction: Comparison Between Precision of Time Series\n  Models and Machine Learning Methods", "comments": "The successful result can be greatly attributed to overfitting. After\n  careful consideration, I think the conclusion is not that convincible and\n  valuable", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Precise financial series predicting has long been a difficult problem because\nof unstableness and many noises within the series. Although Traditional time\nseries models like ARIMA and GARCH have been researched and proved to be\neffective in predicting, their performances are still far from satisfying.\nMachine Learning, as an emerging research field in recent years, has brought\nabout many incredible improvements in tasks such as regressing and classifying,\nand it's also promising to exploit the methodology in financial time series\npredicting. In this paper, the predicting precision of financial time series\nbetween traditional time series models and mainstream machine learning models\nincluding some state-of-the-art ones of deep learning are compared through\nexperiment using real stock index data from history. The result shows that\nmachine learning as a modern method far surpasses traditional models in\nprecision.\n", "versions": [{"version": "v1", "created": "Sat, 3 Jun 2017 13:11:01 GMT"}, {"version": "v2", "created": "Thu, 23 Nov 2017 14:23:01 GMT"}, {"version": "v3", "created": "Thu, 30 Nov 2017 06:06:30 GMT"}, {"version": "v4", "created": "Mon, 25 Dec 2017 15:23:51 GMT"}, {"version": "v5", "created": "Sat, 8 Dec 2018 02:42:06 GMT"}], "update_date": "2018-12-11", "authors_parsed": [["Qian", "Xin-Yao", ""]]}, {"id": "1706.03246", "submitter": "Sumiyoshi Abe", "authors": "Vasilya Usmanova, Yury V. Lysogorskiy and Sumiyoshi Abe", "title": "Aftershocks following crash of currency exchange rate: The case of\n  RUB/USD in 2014", "comments": "17 pages, 6 figures. The title changed. Published version", "journal-ref": "EPL 121, 48001 (2018)", "doi": "10.1209/0295-5075/121/48001", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamical behavior of the currency exchange rate after its large-scale\ncatastrophe is discussed through a case study of the rate of Russian rubles to\nUS dollars after its crash in 2014. It is shown that, similarly to the case of\nthe stock market crash, the relaxation is characterized by a power law, which\nis in analogy with the Omori-Utsu law for earthquake aftershocks. The\nwaiting-time distribution is found to also obey a power law. Furthermore, the\nevent-event correlation is discussed, and the aging phenomenon and scaling\nproperty are observed. Comments are made on (non-)Markovianity of the\naftershock process and on a possible relevance of glassy dynamics to the market\nsystem after the crash.\n", "versions": [{"version": "v1", "created": "Sat, 10 Jun 2017 15:45:00 GMT"}, {"version": "v2", "created": "Fri, 13 Apr 2018 08:44:55 GMT"}], "update_date": "2018-04-16", "authors_parsed": [["Usmanova", "Vasilya", ""], ["Lysogorskiy", "Yury V.", ""], ["Abe", "Sumiyoshi", ""]]}, {"id": "1706.05543", "submitter": "Jan Korbel", "authors": "Jan Korbel, Xiongfei Jiang and Bo Zheng", "title": "Transfer entropy between communities in complex networks", "comments": null, "journal-ref": "Entropy 2019, 21(11), 1124", "doi": "10.3390/e21111124", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the help of transfer entropy, we analyze information flows between\ncommunities of complex networks. We show that the transfer entropy provides a\ncoherent description of interactions between communities, including non-linear\ninteractions. To put some flesh on the bare bones, we analyze transfer\nentropies between communities of five largest financial markets, represented as\nnetworks of interacting stocks. Additionally, we discuss information transfer\nof rare events, which is analyzed by R\\'enyi transfer entropy.\n", "versions": [{"version": "v1", "created": "Sat, 17 Jun 2017 14:13:18 GMT"}], "update_date": "2019-11-18", "authors_parsed": [["Korbel", "Jan", ""], ["Jiang", "Xiongfei", ""], ["Zheng", "Bo", ""]]}, {"id": "1706.05812", "submitter": "Thomas Forss Mr.", "authors": "Thomas Forss and Peter Sarlin", "title": "News-sentiment networks as a risk indicator", "comments": "28 pages, 4 figures, 2 tables, 4 pages appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To understand the relationship between news sentiment and company stock price\nmovements, and to better understand connectivity among companies, we define an\nalgorithm for measuring sentiment-based network risk. The algorithm ranks\ncompanies in networks of co-occurrences, and measures sentiment-based risk, by\ncalculating both individual risks and aggregated network risks. We extract\nrelative sentiment for companies to get a measure of individual company risk,\nand input it into our risk model together with co-occurrences of companies\nextracted from news on a quarterly basis. We can show that the highest\nquarterly risk value outputted by our risk model, is correlated to a higher\nchance of stock price decline, up to 70 days after a risk measurement. Our\nresults show that the highest difference in the probability of stock price\ndecline, compared to the benchmark containing all risk values for the same\nperiod, is during the interval from 21 to 30 days after a quarterly\nmeasurement. The highest average probability of company stock price decline, is\nfound at a delay of 28 days, after a company has reached its maximum risk\nvalue. The highest probability differences for a daily decline were calculated\nto be 13 percentage points.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jun 2017 07:46:51 GMT"}, {"version": "v2", "created": "Tue, 15 May 2018 17:00:45 GMT"}], "update_date": "2018-05-16", "authors_parsed": [["Forss", "Thomas", ""], ["Sarlin", "Peter", ""]]}, {"id": "1706.06007", "submitter": "Christian Beck", "authors": "Dan Xu and Christian Beck", "title": "Symbolic dynamics techniques for complex systems: Application to share\n  price dynamics", "comments": "7 pages, 11 figures. Invited perspective for EPL", "journal-ref": null, "doi": "10.1209/0295-5075/118/30001", "report-no": null, "categories": "nlin.CD q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The symbolic dynamics technique is well-known for low-dimensional dynamical\nsystems and chaotic maps, and lies at the roots of the thermodynamic formalism\nof dynamical systems. Here we show that this technique can also be successfully\napplied to time series generated by complex systems of much higher\ndimensionality. Our main example is the investigation of share price returns in\na coarse-grained way. A nontrivial spectrum of Renyi entropies is found. We\nstudy how the spectrum depends on the time scale of returns, the sector of\nstocks considered, as well as the number of symbols used for the symbolic\ndescription. Overall our analysis confirms that in the symbol space transition\nprobabilities of observed share price returns depend on the entire history of\nprevious symbols, thus emphasizing the need for a modelling based on\nnon-Markovian stochastic processes. Our method allows for quantitative\ncomparisons of entirely different complex systems, for example the statistics\nof symbol sequences generated by share price returns using 4 symbols can be\ncompared with that of genomic sequences.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jun 2017 15:19:27 GMT"}], "update_date": "2017-08-02", "authors_parsed": [["Xu", "Dan", ""], ["Beck", "Christian", ""]]}, {"id": "1706.06355", "submitter": "Mateusz Wilinski", "authors": "Mateusz Wilinski, Yuichi Ikeda and Hideaki Aoyama", "title": "Complex Correlation Approach for High Frequency Financial Data", "comments": null, "journal-ref": null, "doi": "10.1088/1742-5468/aaa8eb", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a novel approach that allows to calculate Hilbert transform based\ncomplex correlation for unevenly spaced data. This method is especially\nsuitable for high frequency trading data, which are of a particular interest in\nfinance. Its most important feature is the ability to take into account\nlead-lag relations on different scales, without knowing them in advance. We\nalso present results obtained with this approach while working on Tokyo Stock\nExchange intraday quotations. We show that individual sectors and subsectors\ntend to form important market components which may follow each other with small\nbut significant delays. These components may be recognized by analysing\neigenvectors of complex correlation matrix for Nikkei 225 stocks.\nInterestingly, sectorial components are also found in eigenvectors\ncorresponding to the bulk eigenvalues, traditionally treated as noise.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jun 2017 10:19:43 GMT"}, {"version": "v2", "created": "Wed, 22 Nov 2017 17:47:09 GMT"}], "update_date": "2018-03-14", "authors_parsed": [["Wilinski", "Mateusz", ""], ["Ikeda", "Yuichi", ""], ["Aoyama", "Hideaki", ""]]}, {"id": "1706.07466", "submitter": "Maha Bakoben", "authors": "Maha Bakoben, Tony Bellotti and Niall Adams", "title": "Identification of Credit Risk Based on Cluster Analysis of Account\n  Behaviours", "comments": "9 pages", "journal-ref": null, "doi": "10.1080/01605682.2019.1582586", "report-no": null, "categories": "q-fin.ST stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assessment of risk levels for existing credit accounts is important to the\nimplementation of bank policies and offering financial products. This paper\nuses cluster analysis of behaviour of credit card accounts to help assess\ncredit risk level. Account behaviour is modelled parametrically and we then\nimplement the behavioural cluster analysis using a recently proposed\ndissimilarity measure of statistical model parameters. The advantage of this\nnew measure is the explicit exploitation of uncertainty associated with\nparameters estimated from statistical models. Interesting clusters of real\ncredit card behaviours data are obtained, in addition to superior prediction\nand forecasting of account default based on the clustering outcomes.\n", "versions": [{"version": "v1", "created": "Wed, 31 May 2017 09:45:41 GMT"}], "update_date": "2019-02-13", "authors_parsed": [["Bakoben", "Maha", ""], ["Bellotti", "Tony", ""], ["Adams", "Niall", ""]]}, {"id": "1706.07821", "submitter": "Jaydip Sen", "authors": "Jaydip Sen and Tamal Datta Chaudhuri", "title": "An Investigation of the Structural Characteristics of the Indian IT\n  Sector and the Capital Goods Sector: An Application of the R Programming in\n  Time Series Decomposition and Forecasting", "comments": "64 pages, 34 figures, 33 tables", "journal-ref": "Journal of Insurance and Financial Management, Vol 1, Issue 4\n  (2016), pp. 68 - 131", "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Time series analysis and forecasting of stock market prices has been a very\nactive area of research over the last two decades. Availability of extremely\nfast and parallel architecture of computing and sophisticated algorithms has\nmade it possible to extract, store, process and analyze high volume stock\nmarket time series data very efficiently. In this paper, we have used time\nseries data of the two sectors of the Indian economy: Information Technology\nand Capital Goods for the period January 2009 till April 2016 and have studied\nthe relationships of these two time series with the time series of DJIA index,\nNIFTY index and the US Dollar to Indian Rupee exchange rate. We establish by\ngraphical and statistical tests that while the IT sector of India has a strong\nassociation with DJIA index and the Dollar to Rupee exchange rate, the Indian\nCG sector exhibits a strong association with the NIFTY index. We contend that\nthese observations corroborate our hypotheses that the Indian IT sector is\nstrongly coupled with the world economy whereas the CG sector of India reflects\ninternal economic growth of India. We also present several models of regression\nbetween the time series which exhibit strong association among them. The\neffectiveness of these models have been demonstrated by very low values of\ntheir forecasting errors.\n", "versions": [{"version": "v1", "created": "Sun, 14 May 2017 12:27:41 GMT"}], "update_date": "2017-06-27", "authors_parsed": [["Sen", "Jaydip", ""], ["Chaudhuri", "Tamal Datta", ""]]}, {"id": "1706.08361", "submitter": "Jaydip Sen", "authors": "Jaydip Sen and Tamal Datta Chaudhuri", "title": "Decomposition of Time Series Data to Check Consistency between Fund\n  Style and Actual Fund Composition of Mutual Funds", "comments": "15 pages, 2 figures, 9 tables. The paper was published in the\n  Proceedings of 4th International Conference on Business Analytics and\n  Intelligence (ICBAI 2016), December 19 - 21, 2016, Indian Institute of\n  Science (IISc), Bangalore, INDIA", "journal-ref": null, "doi": "10.13140/RG.2.2.33048.19206", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a novel approach for analysis of the composition of an equity\nmutual fund based on the time series decomposition of the price movements of\nthe individual stocks of the fund. The proposed scheme can be applied to check\nwhether the style proclaimed for a mutual fund actually matches with the fund\ncomposition. We have applied our proposed framework on eight well known mutual\nfunds of varying styles in the Indian financial market to check the consistency\nbetween their fund style and actual fund composition, and have obtained\nextensive results from our experiments. A detailed analysis of the results has\nshown that while in majority of the cases the actual allocations of funds are\nconsistent with the corresponding fund styles, there have been some notable\ndeviations too.\n", "versions": [{"version": "v1", "created": "Sun, 14 May 2017 12:50:15 GMT"}], "update_date": "2017-06-27", "authors_parsed": [["Sen", "Jaydip", ""], ["Chaudhuri", "Tamal Datta", ""]]}, {"id": "1706.09240", "submitter": "Shanshan Wang", "authors": "Shanshan Wang and Thomas Guhr", "title": "Local fluctuations of the signed traded volumes and the dependencies of\n  demands: a copula analysis", "comments": "This is the Accepted Manuscript version of an article accepted for\n  publication in Journal of Statistical Mechanics: Theory and Experiment.\n  Neither SISSA Medialab Srl nor IOP Publishing Ltd is responsible for any\n  errors or omissions in this version of the manuscript or any version derived\n  from it. The Version of Record is available online at\n  https://doi.org/10.1088/1742-5468/aab01c", "journal-ref": "J. Stat. Mech. (2018) 033407", "doi": "10.1088/1742-5468/aab01c", "report-no": null, "categories": "q-fin.TR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate how the local fluctuations of the signed traded volumes affect\nthe dependence of demands between stocks. We analyze the empirical dependence\nof demands using copulas and show that they are well described by a bivariate\n$\\mathcal{K}$ copula density function. We find that large local fluctuations\nstrongly increase the positive dependence but lower slightly the negative one\nin the copula density. This interesting feature is due to cross-correlations of\nvolume imbalances between stocks. Also, we explore the asymmetries of tail\ndependencies of the copula density, which are moderate for the negative\ndependencies but strong for the positive ones. For the latter, we reveal that\nlarge local fluctuations of the signed traded volumes trigger stronger\ndependencies of demands than of supplies, probably indicating a bull market\nwith persistent raising of prices.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jun 2017 12:18:35 GMT"}, {"version": "v2", "created": "Mon, 10 Jul 2017 16:07:22 GMT"}, {"version": "v3", "created": "Tue, 3 Apr 2018 04:36:12 GMT"}], "update_date": "2018-04-04", "authors_parsed": [["Wang", "Shanshan", ""], ["Guhr", "Thomas", ""]]}]