[{"id": "1808.01926", "submitter": "Aurelio Fernandez Bariviera", "authors": "Aurelio F. Bariviera, Luciano Zunino, Osvaldo A. Rosso", "title": "An analysis of high-frequency cryptocurrencies prices dynamics using\n  permutation-information-theory quantifiers", "comments": "17 pages, 5 figures. arXiv admin note: text overlap with\n  arXiv:1508.04748", "journal-ref": "Chaos 28, 075511 (2018)", "doi": "10.1063/1.5027153", "report-no": null, "categories": "q-fin.ST nlin.CD q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses the dynamics of intraday prices of twelve\ncryptocurrencies during last months' boom and bust. The importance of this\nstudy lies on the extended coverage of the cryptoworld, accounting for more\nthan 90\\% of the total daily turnover. By using the complexity-entropy\ncausality plane, we could discriminate three different dynamics in the data\nset. Whereas most of the cryptocurrencies follow a similar pattern, there are\ntwo currencies (ETC and ETH) that exhibit a more persistent stochastic\ndynamics, and two other currencies (DASH and XEM) whose behavior is closer to a\nrandom walk. Consequently, similar financial assets, using blockchain\ntechnology, are differentiated by market participants.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jul 2018 21:00:48 GMT"}], "update_date": "2018-08-07", "authors_parsed": [["Bariviera", "Aurelio F.", ""], ["Zunino", "Luciano", ""], ["Rosso", "Osvaldo A.", ""]]}, {"id": "1808.02953", "submitter": "Arnab Chakrabarti", "authors": "Arnab Chakrabarti, Rituparna Sen", "title": "Some Statistical Problems with High Dimensional Financial data", "comments": "22 pages, 5 figures", "journal-ref": "Forthcoming in New Perspectives and Challenges in Econophysics,\n  New Economics Windows Series, Springer (2018)", "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For high dimensional data, some of the standard statistical techniques do not\nwork well. So modification or further development of statistical methods are\nnecessary. In this paper, we explore these modifications. We start with the\nimportant problem of estimating high dimensional covariance matrix. Then we\nexplore some of the important statistical techniques such as high dimensional\nregression, principal component analysis, multiple testing problems and\nclassification. We describe some of the fast algorithms that can be readily\napplied in practice.\n", "versions": [{"version": "v1", "created": "Wed, 8 Aug 2018 22:08:54 GMT"}], "update_date": "2018-08-10", "authors_parsed": [["Chakrabarti", "Arnab", ""], ["Sen", "Rituparna", ""]]}, {"id": "1808.03607", "submitter": "Igor Halperin", "authors": "Igor Halperin and Matthew Dixon", "title": "\"Quantum Equilibrium-Disequilibrium\": Asset Price Dynamics, Symmetry\n  Breaking, and Defaults as Dissipative Instantons", "comments": "Improved presentation, typos fixed. 51 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a simple non-equilibrium model of a financial market as an open\nsystem with a possible exchange of money with an outside world and market\nfrictions (trade impacts) incorporated into asset price dynamics via a feedback\nmechanism. Using a linear market impact model, this produces a non-linear\ntwo-parametric extension of the classical Geometric Brownian Motion (GBM)\nmodel, that we call the \"Quantum Equilibrium-Disequilibrium\" (QED) model. The\nQED model gives rise to non-linear mean-reverting dynamics, broken scale\ninvariance, and corporate defaults. In the simplest one-stock (1D) formulation,\nour parsimonious model has only one degree of freedom, yet calibrates to both\nequity returns and credit default swap spreads. Defaults and market crashes are\nassociated with dissipative tunneling events, and correspond to instanton\n(saddle-point) solutions of the model. When market frictions and\ninflows/outflows of money are neglected altogether, \"classical\" GBM\nscale-invariant dynamics with an exponential asset growth and without defaults\nare formally recovered from the QED dynamics. However, we argue that this is\nonly a formal mathematical limit, and in reality the GBM limit is non-analytic\ndue to non-linear effects that produce both defaults and divergence of\nperturbation theory in a small market friction parameter.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jul 2018 16:52:08 GMT"}, {"version": "v2", "created": "Tue, 28 May 2019 00:47:18 GMT"}], "update_date": "2019-05-29", "authors_parsed": [["Halperin", "Igor", ""], ["Dixon", "Matthew", ""]]}, {"id": "1808.04231", "submitter": "Richard Pincak", "authors": "Richard Pincak, Kabin Kanjamapornkul", "title": "GARCH(1,1) model of the financial market with the Minkowski metric", "comments": "18 pages", "journal-ref": "Zeitschrift f\\\"ur Naturforschung A 73 (2018) 669", "doi": "10.1515/zna-2018-0199", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We solved a stylized fact on a long memory process of volatility cluster\nphenomena by using Minkowski metric for GARCH(1,1) under assumption that price\nand time can not be separated. We provide a Yang-Mills equation in financial\nmarket and anomaly on superspace of time series data as a consequence of the\nproof from the general relativity theory. We used an original idea in Minkowski\nspacetime embedded in Kolmogorov space in time series data with behavior of\ntraders.The result of this work is equivalent to the dark volatility or the\nhidden risk fear field induced by the interaction of the behavior of the trader\nin the financial market panic when the market crashed.\n", "versions": [{"version": "v1", "created": "Wed, 1 Aug 2018 07:54:10 GMT"}], "update_date": "2018-08-14", "authors_parsed": [["Pincak", "Richard", ""], ["Kanjamapornkul", "Kabin", ""]]}, {"id": "1808.04233", "submitter": "Eric Benhamou", "authors": "Eric Benhamou", "title": "Connecting Sharpe ratio and Student t-statistic, and beyond", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sharpe ratio is widely used in asset management to compare and benchmark\nfunds and asset managers. It computes the ratio of the excess return over the\nstrategy standard deviation. However, the elements to compute the Sharpe ratio,\nnamely, the expected returns and the volatilities are unknown numbers and need\nto be estimated statistically. This means that the Sharpe ratio used by funds\nis subject to be error prone because of statistical estimation error. Lo\n(2002), Mertens (2002) derive explicit expressions for the statistical\ndistribution of the Sharpe ratio using standard asymptotic theory under several\nsets of assumptions (independent normally distributed - and identically\ndistributed returns). In this paper, we provide the exact distribution of the\nSharpe ratio for independent normally distributed return. In this case, the\nSharpe ratio statistic is up to a rescaling factor a non centered Student\ndistribution whose characteristics have been widely studied by statisticians.\nThe asymptotic behavior of our distribution provide the result of Lo (2002). We\nalso illustrate the fact that the empirical Sharpe ratio is asymptotically\noptimal in the sense that it achieves the Cramer Rao bound. We then study the\nempirical SR under AR(1) assumptions and investigate the effect of compounding\nperiod on the Sharpe (computing the annual Sharpe with monthly data for\ninstance). We finally provide general formula in this case of\nheteroscedasticity and autocorrelation.\n", "versions": [{"version": "v1", "created": "Thu, 2 Aug 2018 16:47:03 GMT"}, {"version": "v2", "created": "Wed, 26 Dec 2018 12:53:35 GMT"}, {"version": "v3", "created": "Thu, 9 May 2019 07:36:03 GMT"}, {"version": "v4", "created": "Tue, 14 May 2019 08:16:09 GMT"}], "update_date": "2019-05-15", "authors_parsed": [["Benhamou", "Eric", ""]]}, {"id": "1808.05527", "submitter": "Vadim Sokolov", "authors": "Michael Polson and Vadim Sokolov", "title": "Deep Learning for Energy Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.LG q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deep Learning is applied to energy markets to predict extreme loads observed\nin energy grids. Forecasting energy loads and prices is challenging due to\nsharp peaks and troughs that arise due to supply and demand fluctuations from\nintraday system constraints. We propose deep spatio-temporal models and extreme\nvalue theory (EVT) to capture theses effects and in particular the tail\nbehavior of load spikes. Deep LSTM architectures with ReLU and $\\tanh$\nactivation functions can model trends and temporal dependencies while EVT\ncaptures highly volatile load spikes above a pre-specified threshold. To\nillustrate our methodology, we use hourly price and demand data from 4719 nodes\nof the PJM interconnection, and we construct a deep predictor. We show that\nDL-EVT outperforms traditional Fourier time series methods, both in-and\nout-of-sample, by capturing the observed nonlinearities in prices. Finally, we\nconclude with directions for future research.\n", "versions": [{"version": "v1", "created": "Thu, 16 Aug 2018 15:01:01 GMT"}, {"version": "v2", "created": "Wed, 22 Aug 2018 12:50:41 GMT"}, {"version": "v3", "created": "Wed, 10 Apr 2019 14:50:14 GMT"}], "update_date": "2019-04-11", "authors_parsed": [["Polson", "Michael", ""], ["Sokolov", "Vadim", ""]]}, {"id": "1808.05893", "submitter": "Marcel Ausloos", "authors": "Marcel Ausloos, Francesca Bartolacci, Nicola G. Castellano, and Roy\n  Cerqueti", "title": "Exploring how innovation strategies at time of crisis influence\n  performance: a cluster analysis perspective", "comments": "22 pages, 4 Tables & 1 Figure=Table, 45 references; as prepared for\n  Technology Analysis & Strategic Management", "journal-ref": "Technology Analysis & Strategic Management 30(4), 484-497 (2018)", "doi": "10.1080/09537325.2017.1337889", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyzes the connection between innovation activities of companies\n-- implemented before crisis -- and their performance -- measured at time of\ncrisis. The companies listed in the STAR Market Segment of the Italian Stock\nExchange are analyzed. Innovation is measured through the level of investments\nin total tangible and intangible fixed assets in 2006-2007, while performance\nis captured through growth -- expressed by variations of sales, total assets\nand employees -- profitability -- through ROI or ROS -- and productivity --\nthrough asset turnover or sales per employee in the period 2008-2010. The\nvariables of interest are analyzed and compared through statistical techniques\nand by adopting cluster analysis. In particular, a Voronoi tessellation is also\nimplemented in a varying centroids framework. In accord with a large part of\nthe literature, we find that the behavior of the performance of the companies\nis not univocal when they innovate.\n", "versions": [{"version": "v1", "created": "Fri, 17 Aug 2018 15:05:51 GMT"}], "update_date": "2019-08-17", "authors_parsed": [["Ausloos", "Marcel", ""], ["Bartolacci", "Francesca", ""], ["Castellano", "Nicola G.", ""], ["Cerqueti", "Roy", ""]]}, {"id": "1808.08585", "submitter": "Linjing Li", "authors": "Jiaqi Liang, Linjing Li, Daniel Zeng", "title": "Evolutionary dynamics of cryptocurrency transaction networks: An\n  empirical study", "comments": null, "journal-ref": "PLoS ONE 13(8): e0202202 (2018)", "doi": "10.1371/journal.pone.0202202", "report-no": null, "categories": "q-fin.ST cs.CR cs.DC econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Cryptocurrency is a well-developed blockchain technology application that is\ncurrently a heated topic throughout the world. The public availability of\ntransaction histories offers an opportunity to analyze and compare different\ncryptocurrencies. In this paper, we present a dynamic network analysis of three\nrepresentative blockchain-based cryptocurrencies: Bitcoin, Ethereum, and\nNamecoin. By analyzing the accumulated network growth, we find that, unlike\nmost other networks, these cryptocurrency networks do not always densify over\ntime, and they are changing all the time with relatively low node and edge\nrepetition ratios. Therefore, we then construct separate networks on a monthly\nbasis, trace the changes of typical network characteristics (including degree\ndistribution, degree assortativity, clustering coefficient, and the largest\nconnected component) over time, and compare the three. We find that the degree\ndistribution of these monthly transaction networks cannot be well fitted by the\nfamous power-law distribution, at the same time, different currency still has\ndifferent network properties, e.g., both Bitcoin and Ethereum networks are\nheavy-tailed with disassortative mixing, however, only the former can be\ntreated as a small world. These network properties reflect the evolutionary\ncharacteristics and competitive power of these three cryptocurrencies and\nprovide a foundation for future research.\n", "versions": [{"version": "v1", "created": "Sun, 26 Aug 2018 16:27:21 GMT"}], "update_date": "2018-08-28", "authors_parsed": [["Liang", "Jiaqi", ""], ["Li", "Linjing", ""], ["Zeng", "Daniel", ""]]}, {"id": "1808.09382", "submitter": "Knut Solna", "authors": "Josselin Garnier and Knut Solna", "title": "Emergence of Turbulent Epochs in Oil Prices", "comments": null, "journal-ref": null, "doi": "10.1016/j.chaos.2019.03.016", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Oil price data have a complicated multi-scale structure that may vary with\ntime. We use time-frequency analysis to identify the main features of these\nvariations and, in particular, the regime shifts. The analysis is based on a\nwavelet-based decomposition and analysis of the associated scale spectrum. The\njoint estimation of the local Hurst exponent and volatility is the key to\ndetect and identify regime shifting and switching of the oil price. The\nframework involves in particular modeling in terms of a process of\n`multi-fractional' type so that both the roughness and the volatility of the\nprice process may vary with time. Special epochs then emerge as a result of\nthese degrees of freedom, moreover, as a result of the special type of spectral\nestimator used. These special epochs are discussed and related to historical\nevents. Some of them are not detected by standard analysis based on maximum\nlikelihood estimation. The paper presents a novel algorithm for robust\ndetection of such special epochs and multi-fractional behavior in financial or\nother types of data. In the financial context insight about such behavior of\nthe asset price is important to evaluate financial contracts involving the\nasset.\n", "versions": [{"version": "v1", "created": "Tue, 28 Aug 2018 16:12:02 GMT"}, {"version": "v2", "created": "Thu, 4 Apr 2019 02:29:44 GMT"}], "update_date": "2019-05-01", "authors_parsed": [["Garnier", "Josselin", ""], ["Solna", "Knut", ""]]}, {"id": "1808.09666", "submitter": "Carol Alexander Prof.", "authors": "Carol Alexander, Emese Lazar, Silvia Stanescu", "title": "Analytic Moments for GARCH Processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a GJR-GARCH specification with a generic innovation distribution we\nderive analytic expressions for the first four conditional moments of the\nforward and aggregated returns and variances. Moment for the most commonly used\nGARCH models are stated as special cases. We also the limits of these moments\nas the time horizon increases, establishing regularity conditions for the\nmoments of aggregated returns to converge to normal moments. Our empirical\nstudy yields excellent approximate predictive distributions from these analytic\nmoments, thus precluding the need for time-consuming simulations.\n", "versions": [{"version": "v1", "created": "Wed, 29 Aug 2018 07:48:17 GMT"}, {"version": "v2", "created": "Thu, 6 Sep 2018 16:09:52 GMT"}], "update_date": "2018-09-07", "authors_parsed": [["Alexander", "Carol", ""], ["Lazar", "Emese", ""], ["Stanescu", "Silvia", ""]]}]