[{"id": "1809.00306", "submitter": "Xi Zhang", "authors": "Xi Zhang and Yixuan Li and Senzhang Wang and Binxing Fang and Philip\n  S. Yu", "title": "Enhancing Stock Market Prediction with Extended Coupled Hidden Markov\n  Model over Multi-Sourced Data", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional stock market prediction methods commonly only utilize the\nhistorical trading data, ignoring the fact that stock market fluctuations can\nbe impacted by various other information sources such as stock related events.\nAlthough some recent works propose event-driven prediction approaches by\nconsidering the event data, how to leverage the joint impacts of multiple data\nsources still remains an open research problem. In this work, we study how to\nexplore multiple data sources to improve the performance of the stock\nprediction. We introduce an Extended Coupled Hidden Markov Model incorporating\nthe news events with the historical trading data. To address the data sparsity\nissue of news events for each single stock, we further study the fluctuation\ncorrelations between the stocks and incorporate the correlations into the model\nto facilitate the prediction task. Evaluations on China A-share market data in\n2016 show the superior performance of our model against previous methods.\n", "versions": [{"version": "v1", "created": "Sun, 2 Sep 2018 07:48:24 GMT"}], "update_date": "2018-10-16", "authors_parsed": [["Zhang", "Xi", ""], ["Li", "Yixuan", ""], ["Wang", "Senzhang", ""], ["Fang", "Binxing", ""], ["Yu", "Philip S.", ""]]}, {"id": "1809.00820", "submitter": "Jun-Ichi Maskawa", "authors": "Jun-ichi Maskawa, Koji Kuroda and Joshin Murai", "title": "Multiplicative random cascades with additional stochastic process in\n  financial markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiplicative random cascade model naturally reproduces the intermittency or\nmultifractality, which is frequently shown among hierarchical complex systems\nsuch as turbulence and financial markets. As described herein, we investigate\nthe validity of a multiplicative hierarchical random cascade model through an\nempirical study using financial data. Although the intermittency and\nmultifractality of the time series are verified, random multiplicative factors\nlinking successive hierarchical layers show strongly negative correlation. We\nextend the multiplicative model to incorporate an additional stochastic term.\nResults show that the proposed model is consistent with all the empirical\nresults presented here.\n", "versions": [{"version": "v1", "created": "Tue, 4 Sep 2018 07:48:24 GMT"}], "update_date": "2018-09-05", "authors_parsed": [["Maskawa", "Jun-ichi", ""], ["Kuroda", "Koji", ""], ["Murai", "Joshin", ""]]}, {"id": "1809.00885", "submitter": "Anirban Chakraborti", "authors": "Hirdesh K. Pharasi, Kiran Sharma, Rakesh Chatterjee, Anirban\n  Chakraborti, Francois Leyvraz and Thomas H. Seligman", "title": "Identifying long-term precursors of financial market crashes using\n  correlation patterns", "comments": "30 pages, 10 figures, including supplementary figures and information", "journal-ref": null, "doi": "10.1088/1367-2630/aae7e0", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The study of the critical dynamics in complex systems is always interesting\nyet challenging. Here, we choose financial market as an example of a complex\nsystem, and do a comparative analyses of two stock markets - the S&P 500 (USA)\nand Nikkei 225 (JPN). Our analyses are based on the evolution of\ncrosscorrelation structure patterns of short time-epochs for a 32-year period\n(1985-2016). We identify \"market states\" as clusters of similar correlation\nstructures, which occur more frequently than by pure chance (randomness). The\ndynamical transitions between the correlation structures reflect the evolution\nof the market states. Power mapping method from the random matrix theory is\nused to suppress the noise on correlation patterns, and an adaptation of the\nintra-cluster distance method is used to obtain the \"optimum\" number of market\nstates. We find that the USA is characterized by four market states and JPN by\nfive. We further analyze the co-occurrence of paired market states; the\nprobability of remaining in the same state is much higher than the transition\nto a different state. The transitions to other states mainly occur among the\nimmediately adjacent states, with a few rare intermittent transitions to the\nremote states. The state adjacent to the critical state (market crash) may\nserve as an indicator or a \"precursor\" for the critical state and this novel\nmethod of identifying the long-term precursors may be very helpful for\nconstructing the early warning system in financial markets, as well as in other\ncomplex systems.\n", "versions": [{"version": "v1", "created": "Tue, 4 Sep 2018 10:50:10 GMT"}, {"version": "v2", "created": "Fri, 7 Sep 2018 09:57:16 GMT"}], "update_date": "2018-11-14", "authors_parsed": [["Pharasi", "Hirdesh K.", ""], ["Sharma", "Kiran", ""], ["Chatterjee", "Rakesh", ""], ["Chakraborti", "Anirban", ""], ["Leyvraz", "Francois", ""], ["Seligman", "Thomas H.", ""]]}, {"id": "1809.01489", "submitter": "Thiago dos Santos Rezende", "authors": "T. R. Santos", "title": "A Bayesian GED-Gamma stochastic volatility model for return data: a\n  marginal likelihood approach", "comments": "26 pages, 5 figures and 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several studies explore inferences based on stochastic volatility (SV)\nmodels, taking into account the stylized facts of return data. The common\nproblem is that the latent parameters of many volatility models are\nhigh-dimensional and analytically intractable, which means inferences require\napproximations using, for example, the Markov Chain Monte Carlo or Laplace\nmethods. Some SV models are expressed as a linear Gaussian state-space model\nthat leads to a marginal likelihood, reducing the dimensionality of the\nproblem. Others are not linearized, and the latent parameters are integrated\nout. However, these present a quite restrictive evolution equation. Thus, we\npropose a Bayesian GED-Gamma SV model with a direct marginal likelihood that is\na product of the generalized Student's t-distributions in which the latent\nstates are related across time through a stationary Gaussian evolution\nequation. Then, an approximation is made for the prior distribution of\nlog-precision/volatility, without the need for model linearization. This also\nallows for the computation of the marginal likelihood function, where the\nhigh-dimensional latent states are integrated out and easily sampled in blocks\nusing a smoothing procedure. In addition, extensions of our GED-Gamma model are\neasily made to incorporate skew heavy-tailed distributions. We use the Bayesian\nestimator for the inference of static parameters, and perform a simulation\nstudy on several properties of the estimator. Our results show that the\nproposed model can be reasonably estimated. Furthermore, we provide case\nstudies of a Brazilian asset and the pound/dollar exchange rate to show the\nperformance of our approach in terms of fit and prediction.\n  Keywords: SV model, New sequential and smoothing procedures, Generalized\nStudent's t-distribution, Non-Gaussian errors, Heavy tails, Skewness\n", "versions": [{"version": "v1", "created": "Thu, 23 Aug 2018 16:59:09 GMT"}], "update_date": "2018-09-06", "authors_parsed": [["Santos", "T. R.", ""]]}, {"id": "1809.01501", "submitter": "Arthur Tarso Rego", "authors": "Arthur T. Rego and Thiago R. dos Santos", "title": "Non-Gaussian Stochastic Volatility Model with Jumps via Gibbs Sampler", "comments": "27 pages, 12 figures, 5 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we propose a model for estimating volatility from financial\ntime series, extending the non-Gaussian family of space-state models with exact\nmarginal likelihood proposed by Gamerman, Santos and Franco (2013). On the\nliterature there are models focused on estimating financial assets risk,\nhowever, most of them rely on MCMC methods based on Metropolis algorithms,\nsince full conditional posterior distributions are not known. We present an\nalternative model capable of estimating the volatility, in an automatic way,\nsince all full conditional posterior distributions are known, and it is\npossible to obtain an exact sample of parameters via Gibbs Sampler. The\nincorporation of jumps in returns allows the model to capture speculative\nmovements of the data, so that their influence does not propagate to\nvolatility. We evaluate the performance of the algorithm using synthetic and\nreal data time series.\n  Keywords: Financial time series, Stochastic volatility, Gibbs Sampler,\nDynamic linear models.\n", "versions": [{"version": "v1", "created": "Fri, 31 Aug 2018 14:53:28 GMT"}, {"version": "v2", "created": "Mon, 1 Oct 2018 21:39:23 GMT"}], "update_date": "2018-10-03", "authors_parsed": [["Rego", "Arthur T.", ""], ["Santos", "Thiago R. dos", ""]]}, {"id": "1809.02098", "submitter": "Mathieu Rosenbaum", "authors": "Omar El Euch, Jim Gatheral, Rado\\v{s} Radoi\\v{c}i\\'c, Mathieu\n  Rosenbaum", "title": "The Zumbach effect under rough Heston", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Previous literature has identified an effect, dubbed the Zumbach effect, that\nis nonzero empirically but conjectured to be zero in any conventional\nstochastic volatility model. Essentially this effect corresponds to the\nproperty that past squared returns forecast future volatilities better than\npast volatilities forecast future squared returns. We provide explicit\ncomputations of the Zumbach effect under rough Heston and show that they are\nconsistent with empirical estimates. In agreement with previous conjectures\nhowever, the Zumbach effect is found to be negligible in the classical Heston\nmodel.\n", "versions": [{"version": "v1", "created": "Thu, 6 Sep 2018 17:15:50 GMT"}], "update_date": "2018-09-07", "authors_parsed": [["Euch", "Omar El", ""], ["Gatheral", "Jim", ""], ["Radoičić", "Radoš", ""], ["Rosenbaum", "Mathieu", ""]]}, {"id": "1809.02674", "submitter": "Jaros{\\l}aw Klamut", "authors": "Jaros{\\l}aw Klamut, Ryszard Kutner, Tomasz Gubiec, Zbigniew R. Struzik", "title": "The new face of multifractality: Multi-branchedness and the phase\n  transitions in time series of mean inter-event times", "comments": "24 pages, 13 figures", "journal-ref": "Phys. Rev. E 101, 063303 (2020)", "doi": "10.1103/PhysRevE.101.063303", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Empirical time series of inter-event or waiting times are investigated using\na modified Multifractal Detrended Fluctuation Analysis operating on\nfluctuations of mean detrended dynamics. The core of the extended multifractal\nanalysis is the non-monotonic behavior of the generalized Hurst exponent $h(q)$\n-- the fundamental exponent in the study of multifractals. The consequence of\nthis behavior is the non-monotonic behavior of the coarse H\\\"older exponent\n$\\alpha (q)$ leading to multi-branchedness of the spectrum of dimensions. The\nLegendre-Fenchel transform is used instead of the routinely used canonical\nLegendre (single-branched) contact transform. Thermodynamic consequences of the\nmulti-branched multifractality are revealed. These are directly expressed in\nthe language of phase transitions between thermally stable, metastable, and\nunstable phases. These phase transitions are of the first and second orders\naccording to Mandelbrot's modified Ehrenfest classification. The discovery of\nmulti-branchedness is tantamount in significance to extending multifractal\nanalysis.\n", "versions": [{"version": "v1", "created": "Fri, 7 Sep 2018 21:08:57 GMT"}, {"version": "v2", "created": "Thu, 11 Oct 2018 09:10:57 GMT"}, {"version": "v3", "created": "Sat, 13 Jul 2019 08:30:43 GMT"}, {"version": "v4", "created": "Sat, 25 Apr 2020 18:05:27 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Klamut", "Jarosław", ""], ["Kutner", "Ryszard", ""], ["Gubiec", "Tomasz", ""], ["Struzik", "Zbigniew R.", ""]]}, {"id": "1809.02772", "submitter": "Aleksejus Kononovicius dr.", "authors": "Aleksejus Kononovicius, Julius Ruseckas", "title": "Order book model with herd behavior exhibiting long-range memory", "comments": "27 pages, 20 figures, 3 tables", "journal-ref": "Physica A 525: 171-191 (2019)", "doi": "10.1016/j.physa.2019.03.059", "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we propose an order book model with herd behavior. The proposed\nmodel is built upon two distinct approaches: a recent empirical study of the\ndetailed order book records by Kanazawa et al. [Phys. Rev. Lett. 120, 138301]\nand financial herd behavior model. Combining these approaches allows us to\npropose a model that replicates the long-range memory of absolute returns and\ntrading activity. We compare the statistical properties of the model against\nthe empirical statistical properties of the Bitcoin exchange rates and New York\nstock exchange tickers. We also show that the fracture in the spectral density\nof the high-frequency absolute return time series might be related to the\nmechanism of convergence towards the equilibrium price.\n", "versions": [{"version": "v1", "created": "Sat, 8 Sep 2018 07:26:04 GMT"}, {"version": "v2", "created": "Tue, 15 Jan 2019 09:24:38 GMT"}, {"version": "v3", "created": "Mon, 8 Apr 2019 09:36:05 GMT"}], "update_date": "2019-04-09", "authors_parsed": [["Kononovicius", "Aleksejus", ""], ["Ruseckas", "Julius", ""]]}, {"id": "1809.04775", "submitter": "Yusuke Uchiyama", "authors": "Yusuke Uchiyama and Takanori Kadoya", "title": "Superstatistics with cut-off tails for financial time series", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2019.04.166", "report-no": null, "categories": "q-fin.ST math.ST physics.data-an stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial time series have been investigated to follow fat-tailed\ndistributions. Further, an empirical probability distribution sometimes shows\ncut-off shapes on its tails. To describe this stylized fact, we incorporate the\ncut-off effect in superstatistics. Then we confirm that the presented\nstochastic model is capable of describing the statistical properties of real\nfinancial time series. In addition, we present an option pricing formula with\nrespect to superstatistics.\n", "versions": [{"version": "v1", "created": "Thu, 13 Sep 2018 04:57:42 GMT"}], "update_date": "2019-06-26", "authors_parsed": [["Uchiyama", "Yusuke", ""], ["Kadoya", "Takanori", ""]]}, {"id": "1809.04925", "submitter": "Jeonggyu Huh", "authors": "Jeonggyu Huh", "title": "Measuring Systematic Risk with Neural Network Factor Model", "comments": "16 pages, 5 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we measure systematic risk with a new nonparametric factor\nmodel, the neural network factor model. The suitable factors for systematic\nrisk can be naturally found by inserting daily returns on a wide range of\nassets into the bottleneck network. The network-based model does not stick to a\nprobabilistic structure unlike parametric factor models, and it does not need\nfeature engineering because it selects notable features by itself. In addition,\nwe compare performance between our model and the existing models using 20-year\ndata of S&P 100 components. Although the new model can not outperform the best\nones among the parametric factor models due to limitations of the variational\ninference, the estimation method used for this study, it is still noteworthy in\nthat it achieves the performance as best the comparable models could without\nany prior knowledge.\n", "versions": [{"version": "v1", "created": "Thu, 13 Sep 2018 12:57:10 GMT"}], "update_date": "2018-09-14", "authors_parsed": [["Huh", "Jeonggyu", ""]]}, {"id": "1809.06077", "submitter": "Sourish Das", "authors": "Sourish Das", "title": "Modeling Nelson-Siegel Yield Curve using Bayesian Approach", "comments": "Book chapter; 14 pages, 5 tables, 7 figures", "journal-ref": "New Perspectives and Challenges in Econophysics and Sociophysics,\n  (2018) Edited by. F. Abergel, B.K. Chakrabarti, A. Chakraborti, N. Deo and K.\n  Sharma (Springer New Economic Windows)", "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Yield curve modeling is an essential problem in finance. In this work, we\nexplore the use of Bayesian statistical methods in conjunction with\nNelson-Siegel model. We present the hierarchical Bayesian model for the\nparameters of the Nelson-Siegel yield function. We implement the MAP estimates\nvia BFGS algorithm in rstan. The Bayesian analysis relies on the Monte Carlo\nsimulation method. We perform the Hamiltonian Monte Carlo (HMC), using the\nrstan package. As a by-product of the HMC, we can simulate the Monte Carlo\nprice of a Bond, and it helps us to identify if the bond is over-valued or\nunder-valued. We demonstrate the process with an experiment and US Treasury's\nyield curve data. One of the interesting observation of the experiment is that\nthere is a strong negative correlation between the price and long-term effect\nof yield. However, the relationship between the short-term interest rate effect\nand the value of the bond is weakly positive. This is because posterior\nanalysis shows that the short-term effect and the long-term effect are\nnegatively correlated.\n", "versions": [{"version": "v1", "created": "Mon, 17 Sep 2018 08:48:16 GMT"}, {"version": "v2", "created": "Wed, 3 Oct 2018 17:58:41 GMT"}], "update_date": "2018-10-04", "authors_parsed": [["Das", "Sourish", ""]]}, {"id": "1809.06728", "submitter": "Pawe{\\l} O\\'swi\\k{e}cimka", "authors": "Stanis{\\l}aw Dro\\.zd\\.z, Rafa{\\l} Kowalski, Pawe{\\l} O\\'swi\\c{e}cimka,\n  Rafa{\\l} Rak, Robert G\\c{e}barowski", "title": "Dynamical variety of shapes in financial multifractality", "comments": "26 pages, 10 figures", "journal-ref": "Complexity, vol. 2018, Article ID 7015721 (2018)", "doi": "10.1155/2018/7015721", "report-no": null, "categories": "q-fin.ST nlin.CD physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of multifractality offers a powerful formal tool to filter out\nmultitude of the most relevant characteristics of complex time series. The\nrelated studies thus far presented in the scientific literature typically limit\nthemselves to evaluation of whether or not a time series is multifractal and\nwidth of the resulting singularity spectrum is considered a measure of the\ndegree of complexity involved. However, the character of the complexity of time\nseries generated by the natural processes usually appears much more intricate\nthan such a bare statement can reflect. As an example, based on the long-term\nrecords of S&P500 and NASDAQ - the two world leading stock market indices - the\npresent study shows that they indeed develop the multifractal features, but\nthese features evolve through a variety of shapes, most often strongly\nasymmetric, whose changes typically are correlated with the historically most\nsignificant events experienced by the world economy. Relating at the same time\nthe index multifractal singularity spectra to those of the component stocks\nthat form this index reflects the varying degree of correlations involved among\nthe stocks.\n", "versions": [{"version": "v1", "created": "Tue, 18 Sep 2018 13:46:51 GMT"}], "update_date": "2018-09-25", "authors_parsed": [["Drożdż", "Stanisław", ""], ["Kowalski", "Rafał", ""], ["Oświȩcimka", "Paweł", ""], ["Rak", "Rafał", ""], ["Gȩbarowski", "Robert", ""]]}, {"id": "1809.07100", "submitter": "Anirban Chakraborti", "authors": "Hirdesh K. Pharasi, Kiran Sharma, Anirban Chakraborti and Thomas H.\n  Seligman", "title": "Complex market dynamics in the light of random matrix theory", "comments": "22 pages, 12 figures. To appear in the Proceedings of Econophys-2017\n  and APEC-2017, New Delhi", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a brief overview of random matrix theory (RMT) with the objectives\nof highlighting the computational results and applications in financial markets\nas complex systems. An oft-encountered problem in computational finance is the\nchoice of an appropriate epoch over which the empirical cross-correlation\nreturn matrix is computed. A long epoch would smoothen the fluctuations in the\nreturn time series and suffers from non-stationarity, whereas a short epoch\nresults in noisy fluctuations in the return time series and the correlation\nmatrices turn out to be highly singular. An effective method to tackle this\nissue is the use of the power mapping, where a non-linear distortion is applied\nto a short epoch correlation matrix. The value of distortion parameter controls\nthe noise-suppression. The distortion also removes the degeneracy of zero\neigenvalues. Depending on the correlation structures, interesting properties of\nthe eigenvalue spectra are found. We simulate different correlated Wishart\nmatrices to compare the results with empirical return matrices computed using\nthe S&P 500 (USA) market data for the period 1985-2016. We also briefly review\ntwo recent applications of RMT in financial stock markets: (i) Identification\nof \"market states\" and long-term precursor to a critical state; (ii)\nCharacterization of catastrophic instabilities (market crashes).\n", "versions": [{"version": "v1", "created": "Wed, 19 Sep 2018 09:46:48 GMT"}, {"version": "v2", "created": "Mon, 24 Sep 2018 14:36:33 GMT"}], "update_date": "2018-09-27", "authors_parsed": [["Pharasi", "Hirdesh K.", ""], ["Sharma", "Kiran", ""], ["Chakraborti", "Anirban", ""], ["Seligman", "Thomas H.", ""]]}, {"id": "1809.07203", "submitter": "Junyan Liu", "authors": "Junyan Liu, Sandeep Kumar, and Daniel P. Palomar", "title": "Parameter Estimation of Heavy-Tailed AR Model with Missing Data via\n  Stochastic EM", "comments": "This is a companion document to a paper that is accepted to IEEE\n  Transaction on Signal Processing 2019, complemented with the supplementary\n  material", "journal-ref": null, "doi": "10.1109/TSP.2019.2899816", "report-no": null, "categories": "stat.AP eess.SP math.OC q-fin.ST", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The autoregressive (AR) model is a widely used model to understand time\nseries data. Traditionally, the innovation noise of the AR is modeled as\nGaussian. However, many time series applications, for example, financial time\nseries data, are non-Gaussian, therefore, the AR model with more general\nheavy-tailed innovations is preferred. Another issue that frequently occurs in\ntime series is missing values, due to system data record failure or unexpected\ndata loss. Although there are numerous works about Gaussian AR time series with\nmissing values, as far as we know, there does not exist any work addressing the\nissue of missing data for the heavy-tailed AR model. In this paper, we consider\nthis issue for the first time, and propose an efficient framework for parameter\nestimation from incomplete heavy-tailed time series based on a stochastic\napproximation expectation maximization (SAEM) coupled with a Markov Chain Monte\nCarlo (MCMC) procedure. The proposed algorithm is computationally cheap and\neasy to implement. The convergence of the proposed algorithm to a stationary\npoint of the observed data likelihood is rigorously proved. Extensive\nsimulations and real datasets analyses demonstrate the efficacy of the proposed\nframework.\n", "versions": [{"version": "v1", "created": "Wed, 19 Sep 2018 14:09:52 GMT"}, {"version": "v2", "created": "Sat, 9 Feb 2019 08:58:22 GMT"}], "update_date": "2019-03-27", "authors_parsed": [["Liu", "Junyan", ""], ["Kumar", "Sandeep", ""], ["Palomar", "Daniel P.", ""]]}, {"id": "1809.07856", "submitter": "Nino Antulov-Fantulin", "authors": "Nino Antulov-Fantulin and Dijana Tolic and Matija Piskorec and Zhang\n  Ce and Irena Vodenska", "title": "Inferring short-term volatility indicators from Bitcoin blockchain", "comments": null, "journal-ref": "7th International Conference on Complex Networks and their\n  Applications 2018", "doi": "10.1007/978-3-030-05414-4_41", "report-no": null, "categories": "q-fin.ST cs.CE cs.SI physics.soc-ph stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the possibility of inferring early warning indicators\n(EWIs) for periods of extreme bitcoin price volatility using features obtained\nfrom Bitcoin daily transaction graphs. We infer the low-dimensional\nrepresentations of transaction graphs in the time period from 2012 to 2017\nusing Bitcoin blockchain, and demonstrate how these representations can be used\nto predict extreme price volatility events. Our EWI, which is obtained with a\nnon-negative decomposition, contains more predictive information than those\nobtained with singular value decomposition or scalar value of the total Bitcoin\ntransaction volume.\n", "versions": [{"version": "v1", "created": "Wed, 19 Sep 2018 14:19:09 GMT"}], "update_date": "2019-02-08", "authors_parsed": [["Antulov-Fantulin", "Nino", ""], ["Tolic", "Dijana", ""], ["Piskorec", "Matija", ""], ["Ce", "Zhang", ""], ["Vodenska", "Irena", ""]]}, {"id": "1809.08060", "submitter": "Mikko Pakkanen", "authors": "Maxime Morariu-Patrichi and Mikko S. Pakkanen", "title": "State-dependent Hawkes processes and their application to limit order\n  book modelling", "comments": "30 pages, 13 figures, v2: minor improvements and corrections", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study statistical aspects of state-dependent Hawkes processes, which are\nan extension of Hawkes processes where a self- and cross-exciting counting\nprocess and a state process are fully coupled, interacting with each other. The\nexcitation kernel of the counting process depends on the state process that,\nreciprocally, switches state when there is an event in the counting process. We\nfirst establish the existence and uniqueness of state-dependent Hawkes\nprocesses and explain how they can be simulated. Then we develop maximum\nlikelihood estimation methodology for parametric specifications of the process.\nWe apply state-dependent Hawkes processes to high-frequency limit order book\ndata, allowing us to build a novel model that captures the feedback loop\nbetween the order flow and the shape of the limit order book. We estimate two\nspecifications of the model, using the bid-ask spread and the queue imbalance\nas state variables, and find that excitation effects in the order flow are\nstrongly state-dependent. Additionally, we find that the endogeneity of the\norder flow, measured by the magnitude of excitation, is also state-dependent,\nbeing more pronounced in disequilibrium states of the limit order book.\n", "versions": [{"version": "v1", "created": "Fri, 21 Sep 2018 12:29:38 GMT"}, {"version": "v2", "created": "Mon, 15 Oct 2018 18:42:42 GMT"}], "update_date": "2018-10-17", "authors_parsed": [["Morariu-Patrichi", "Maxime", ""], ["Pakkanen", "Mikko S.", ""]]}, {"id": "1809.08403", "submitter": "Knut Solna", "authors": "Josselin Garnier, Knut Solna", "title": "Chaos and Order in the Bitcoin Market", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2019.04.164", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The bitcoin price has surged in recent years and it has also exhibited phases\nof rapid decay. In this paper we address the question to what extent this novel\ncryptocurrency market can be viewed as a classic or semi-efficient market.\nNovel and robust tools for estimation of multi-fractal properties are used to\nshow that the bitcoin price exhibits a very interesting multi-scale correlation\nstructure. This structure can be described by a power-law behavior of the\nvariances of the returns as functions of time increments and it can be\ncharacterized by two parameters, the volatility and the Hurst exponent. These\npower-law parameters, however, vary in time. A new notion of generalized Hurst\nexponent is introduced which allows us to check if the multi-fractal character\nof the underlying signal is well captured. It is moreover shown how the\nmonitoring of the power-law parameters can be used to identify regime shifts\nfor the bitcoin price. A novel technique for identifying the regimes switches\nbased on a goodness of fit of the local power-law parameters is presented. It\nautomatically detects dates associated with some known events in the bitcoin\nmarket place. A very surprising result is moreover that, despite the wild ride\nof the bitcoin price in recent years and its multi-fractal and non-stationary\ncharacter, this price has both local power-law behaviors and a very orderly\ncorrelation structure when it is observed on its entire period of existence.\n", "versions": [{"version": "v1", "created": "Sat, 22 Sep 2018 08:16:08 GMT"}, {"version": "v2", "created": "Thu, 4 Apr 2019 00:42:51 GMT"}], "update_date": "2019-06-26", "authors_parsed": [["Garnier", "Josselin", ""], ["Solna", "Knut", ""]]}, {"id": "1809.08416", "submitter": "Henrik Rasmussen Dr", "authors": "Henrik O. Rasmussen and Paul Wilmott", "title": "Tail probabilities for short-term returns on stocks", "comments": "Minor fixes", "journal-ref": null, "doi": "10.13140/RG.2.2.18816.28165", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the tail probabilities of stock returns for a general class of\nstochastic volatility models. In these models, the stochastic differential\nequation for volatility is autonomous, time-homogeneous and dependent on only a\nfinite number of dimensional parameters. Three bounds on the high-volatility\nlimits of the drift and diffusion coefficients of volatility ensure that\nvolatility is mean-reverting, has long memory and is as volatile as the stock\nprice. Dimensional analysis then provides leading-order approximations to the\ndrift and diffusion coefficients of volatility for the high-volatility limit.\nThereby, using the Kolmogorov forward equation for the transition probability\nof volatility, we find that the tail probability for short-term returns falls\noff like an inverse cubic. Our analysis then provides a possible explanation\nfor the inverse cubic fall off that Gopikrishnan et al. (1998) report for\nreturns over 5-120 minutes intervals. We find, moreover, that the tail\nprobability scales like the length of the interval, over which the return is\nmeasured, to the power 3/2. There do not seem to be any empirical results in\nthe literature with which to compare this last prediction.\n", "versions": [{"version": "v1", "created": "Sat, 22 Sep 2018 09:31:33 GMT"}, {"version": "v2", "created": "Wed, 20 Mar 2019 06:19:36 GMT"}], "update_date": "2019-03-21", "authors_parsed": [["Rasmussen", "Henrik O.", ""], ["Wilmott", "Paul", ""]]}, {"id": "1809.08681", "submitter": "Yuri Biondi", "authors": "Yuri Biondi and Stefano Olla", "title": "Financial accumulation implies ever-increasing wealth inequality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN econ.GN physics.soc-ph q-fin.EC q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wealth inequality is an important matter for economic theory and policy.\nOngoing debates have been discussing recent rise in wealth inequality in\nconnection with recent development of active financial markets around the\nworld. Existing literature on wealth distribution connects the origins of\nwealth inequality with a variety of drivers. Our approach develops a minimalist\nmodelling strategy that combines three featuring mechanisms: active financial\nmarkets; individual wealth accumulation; and compound interest structure. We\nprovide mathematical proof that accumulated financial investment returns\ninvolve ever-increasing wealth concentration and inequality across individual\ninvestors through time. This cumulative effect through space and time depends\non the financial accumulation process and holds also under efficient financial\nmarkets, which generate some fair investment game that individual investors do\nrepeatedly play through time.\n", "versions": [{"version": "v1", "created": "Sun, 23 Sep 2018 21:24:18 GMT"}, {"version": "v2", "created": "Fri, 18 Jan 2019 07:46:00 GMT"}, {"version": "v3", "created": "Tue, 26 Nov 2019 12:32:15 GMT"}], "update_date": "2019-11-27", "authors_parsed": [["Biondi", "Yuri", ""], ["Olla", "Stefano", ""]]}, {"id": "1809.09889", "submitter": "Gon\\c{c}alo dos Reis Dr.", "authors": "Marius Pfeuffer, Goncalo dos Reis, Greig smith", "title": "Capturing Model Risk and Rating Momentum in the Estimation of\n  Probabilities of Default and Credit Rating Migrations", "comments": "22 pages, 5 Figures, 4 Tables. To Appear in Quantitative Finance", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present two methodologies on the estimation of rating transition\nprobabilities within Markov and non-Markov frameworks. We first estimate a\ncontinuous-time Markov chain using discrete (missing) data and derive a simpler\nexpression for the Fisher information matrix, reducing the computational time\nneeded for the Wald confidence interval by a factor of a half. We provide an\nefficient procedure for transferring such uncertainties from the generator\nmatrix of the Markov chain to the corresponding rating migration probabilities\nand, crucially, default probabilities.\n  For our second contribution, we assume access to the full (continuous) data\nset and propose a tractable and parsimonious self-exciting marked point\nprocesses model able to capture the non-Markovian effect of rating momentum.\nCompared to the Markov model, the non-Markov model yields higher probabilities\nof default in the investment grades, but also lower default probabilities in\nsome speculative grades. Both findings agree with empirical observations and\nhave clear practical implications.\n  We illustrate all methods using data from Moody's proprietary corporate\ncredit ratings data set. Implementations are available in the R package ctmcd.\n", "versions": [{"version": "v1", "created": "Wed, 26 Sep 2018 10:22:19 GMT"}, {"version": "v2", "created": "Mon, 3 Feb 2020 13:09:10 GMT"}], "update_date": "2020-02-04", "authors_parsed": [["Pfeuffer", "Marius", ""], ["Reis", "Goncalo dos", ""], ["smith", "Greig", ""]]}, {"id": "1809.11052", "submitter": "Aleksejus Kononovicius dr.", "authors": "Mark Levene, Aleksejus Kononovicius", "title": "Empirical Survival Jensen-Shannon Divergence as a Goodness-of-Fit\n  Measure for Maximum Likelihood Estimation and Curve Fitting", "comments": "20 pages, 1 figure, 13 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME physics.data-an q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The coefficient of determination, known as $R^2$, is commonly used as a\ngoodness-of-fit criterion for fitting linear models. $R^2$ is somewhat\ncontroversial when fitting nonlinear models, although it may be generalised on\na case-by-case basis to deal with specific models such as the logistic model.\nAssume we are fitting a parametric distribution to a data set using, say, the\nmaximum likelihood estimation method. A general approach to measure the\ngoodness-of-fit of the fitted parameters, which is advocated herein, is to use\na nonparametric measure for comparison between the empirical distribution,\ncomprising the raw data, and the fitted model. In particular, for this purpose\nwe put forward the Survival Jensen-Shannon divergence ($SJS$) and its empirical\ncounterpart (${\\cal E}SJS$) as a metric which is bounded, and is a natural\ngeneralisation of the Jensen-Shannon divergence. We demonstrate, via a\nstraightforward procedure making use of the ${\\cal E}SJS$, that it can be used\nas part of maximum likelihood estimation or curve fitting as a measure of\ngoodness-of-fit, including the construction of a confidence interval for the\nfitted parametric distribution. Furthermore, we show the validity of the\nproposed method with simulated data, and three empirical data sets.\n", "versions": [{"version": "v1", "created": "Fri, 28 Sep 2018 14:19:07 GMT"}, {"version": "v2", "created": "Fri, 5 Oct 2018 16:29:40 GMT"}, {"version": "v3", "created": "Tue, 9 Oct 2018 13:57:14 GMT"}, {"version": "v4", "created": "Wed, 5 Dec 2018 11:01:21 GMT"}, {"version": "v5", "created": "Tue, 4 Jun 2019 08:56:43 GMT"}], "update_date": "2019-06-05", "authors_parsed": [["Levene", "Mark", ""], ["Kononovicius", "Aleksejus", ""]]}]