[{"id": "1907.00212", "submitter": "A. Christian Silva", "authors": "Fernando F. Ferreira, A. Christian Silva, Ju-Yi Yen", "title": "Detailed study of a moving average trading rule", "comments": "32 pages, 14 figures, accepted for publication in Quantitative\n  Finance on 12/2017. Result of research initiated in 2013 which generated\n  several conference presentations and working papers. This effort is\n  substantially extended, edited and updated. arXiv admin note: substantial\n  text overlap with arXiv:1402.3030", "journal-ref": "Quantitative Finance, 18:9, 1599-1617 (2018)", "doi": "10.1080/14697688.2017.1417621", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a detailed study of the performance of a trading rule that uses\nmoving average of past returns to predict future returns on stock indexes. Our\nmain goal is to link performance and the stochastic process of the traded\nasset. Our study reports short, medium and long term effects by looking at the\nSharpe ratio (SR). We calculate the Sharpe ratio of our trading rule as a\nfunction of the probability distribution function of the underlying traded\nasset and compare it with data. We show that if the performance is mainly due\nto presence of autocorrelation in the returns of the traded assets, the SR as a\nfunction of the portfolio formation period (look-back) is very different from\nperformance due to the drift (average return). The SR shows that for look-back\nperiods of a few months the investor is more likely to tap into\nautocorrelation. However, for look-back larger than few months, the drift of\nthe asset becomes progressively more important. Finally, our empirical work\nreports a new long-term effect, namely oscillation of the SR and propose a\nnon-stationary model to account for such oscillations.\n", "versions": [{"version": "v1", "created": "Sat, 29 Jun 2019 14:42:18 GMT"}], "update_date": "2019-07-03", "authors_parsed": [["Ferreira", "Fernando F.", ""], ["Silva", "A. Christian", ""], ["Yen", "Ju-Yi", ""]]}, {"id": "1907.00293", "submitter": "Tim Leung", "authors": "Tim Leung, Brian Ward", "title": "Tracking VIX with VIX Futures: Portfolio Construction and Performance", "comments": "22 pages, book chapter", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.PM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a series of static and dynamic portfolios of VIX futures and their\neffectiveness to track the VIX index. We derive each portfolio using\noptimization methods, and evaluate its tracking performance from both empirical\nand theoretical perspectives. Among our results, we show that static portfolios\nof different VIX futures fail to track VIX closely. VIX futures simply do not\nreact quickly enough to movements in the spot VIX. In a discrete-time model, we\ndesign and implement a dynamic trading strategy that adjusts daily to optimally\ntrack VIX. The model is calibrated to historical data and a simulation study is\nperformed to understand the properties exhibited by the strategy. In addition,\ncomparing to the volatility ETN, VXX, we find that our dynamic strategy has a\nsuperior tracking performance.\n", "versions": [{"version": "v1", "created": "Sat, 29 Jun 2019 23:11:24 GMT"}], "update_date": "2019-07-02", "authors_parsed": [["Leung", "Tim", ""], ["Ward", "Brian", ""]]}, {"id": "1907.00558", "submitter": "Maria Glenski", "authors": "Maria Glenski, Tim Weninger, and Svitlana Volkova", "title": "Improved Forecasting of Cryptocurrency Price using Social Signals", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.LG cs.SI stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Social media signals have been successfully used to develop large-scale\npredictive and anticipatory analytics. For example, forecasting stock market\nprices and influenza outbreaks. Recently, social data has been explored to\nforecast price fluctuations of cryptocurrencies, which are a novel disruptive\ntechnology with significant political and economic implications. In this paper\nwe leverage and contrast the predictive power of social signals, specifically\nuser behavior and communication patterns, from multiple social platforms GitHub\nand Reddit to forecast prices for three cyptocurrencies with high developer and\ncommunity interest - Bitcoin, Ethereum, and Monero. We evaluate the performance\nof neural network models that rely on long short-term memory units (LSTMs)\ntrained on historical price data and social data against price only LSTMs and\nbaseline autoregressive integrated moving average (ARIMA) models, commonly used\nto predict stock prices. Our results not only demonstrate that social signals\nreduce error when forecasting daily coin price, but also show that the language\nused in comments within the official communities on Reddit (r/Bitcoin,\nr/Ethereum, and r/Monero) are the best predictors overall. We observe that\nmodels are more accurate in forecasting price one day ahead for Bitcoin (4%\nroot mean squared percent error) compared to Ethereum (7%) and Monero (8%).\n", "versions": [{"version": "v1", "created": "Mon, 1 Jul 2019 05:51:05 GMT"}], "update_date": "2019-07-02", "authors_parsed": [["Glenski", "Maria", ""], ["Weninger", "Tim", ""], ["Volkova", "Svitlana", ""]]}, {"id": "1907.01119", "submitter": "Zhi-Qiang Jiang", "authors": "Peng Wang (ECUST), Jun-Chao Ma (ECUST), Zhi-Qiang Jiang (ECUST),\n  Wei-Xing Zhou (ECUST), and Didier Sornette (ETH Zurich)", "title": "Comparative analysis of layered structures in empirical investor\n  networks and cellphone communication networks", "comments": "9 pages, 9 figues, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Empirical investor networks (EIN) proposed by\n\\cite{Ozsoylev-Walden-Yavuz-Bildik-2014-RFS} are assumed to capture the\ninformation spreading path among investors. Here, we perform a comparative\nanalysis between the EIN and the cellphone communication networks (CN) to test\nwhether EIN is an information exchanging network from the perspective of the\nlayer structures of ego networks. We employ two clustering algorithms\n($k$-means algorithm and $H/T$ break algorithm) to detect the layer structures\nfor each node in both networks. We find that the nodes in both networks can be\nclustered into two groups, one that has a layer structure similar to the\ntheoretical Dunbar Circle corresponding to that the alters in ego networks\nexhibit a four-layer hierarchical structure with the cumulative number of 5,\n15, 50 and 150 from the inner layer to the outer layer, and the other one\nhaving an additional inner layer with about 2 alters compared with the Dunbar\nCircle. We also find that the scale ratios, which are estimated based on the\nunique parameters in the theoretical model of layer structures\n\\citep{Tamarit-Cuesta-Dunbar-Sanchez-2018-PNAS}, conform to a log-normal\ndistribution for both networks. Our results not only deepen our understanding\non the topological structures of EIN, but also provide empirical evidence of\nthe channels of information diffusion among investors.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jul 2019 01:20:31 GMT"}], "update_date": "2019-07-03", "authors_parsed": [["Wang", "Peng", "", "ECUST"], ["Ma", "Jun-Chao", "", "ECUST"], ["Jiang", "Zhi-Qiang", "", "ECUST"], ["Zhou", "Wei-Xing", "", "ECUST"], ["Sornette", "Didier", "", "ETH Zurich"]]}, {"id": "1907.01306", "submitter": "Tobias Fissler", "authors": "Tobias Fissler, Jana Hlavinov\\'a, Birgit Rudloff", "title": "Elicitability and Identifiability of Systemic Risk Measures", "comments": "42 pages, 3 figures + supplementary material (6 pages, 2 figures)", "journal-ref": "Finance and Stochastics (2021), Volume 25, No. 1, 133-165", "doi": "10.1007/s00780-020-00446-z", "report-no": null, "categories": "math.ST q-fin.MF q-fin.RM q-fin.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Identification and scoring functions are statistical tools to assess the\ncalibration and the relative performance of risk measure estimates, e.g., in\nbacktesting. A risk measures is called identifiable (elicitable) it it admits a\nstrict identification function (strictly consistent scoring function). We\nconsider measures of systemic risk introduced in Feinstein, Rudloff and Weber\n(2017). Since these are set-valued, we work within the theoretical framework of\nFissler, Hlavinov\\'a and Rudloff (2019) for forecast evaluation of set-valued\nfunctionals. We construct oriented selective identification functions, which\ninduce a mixture representation of (strictly) consistent scoring functions.\nTheir applicability is demonstrated with a comprehensive simulation study.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jul 2019 11:52:15 GMT"}, {"version": "v2", "created": "Thu, 17 Oct 2019 12:33:43 GMT"}], "update_date": "2021-01-01", "authors_parsed": [["Fissler", "Tobias", ""], ["Hlavinová", "Jana", ""], ["Rudloff", "Birgit", ""]]}, {"id": "1907.01503", "submitter": "Yinchuan Li", "authors": "Xinyi Li, Yinchuan Li, Yuancheng Zhan, Xiao-Yang Liu", "title": "Optimistic Bull or Pessimistic Bear: Adaptive Deep Reinforcement\n  Learning for Stock Portfolio Allocation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Portfolio allocation is crucial for investment companies. However, getting\nthe best strategy in a complex and dynamic stock market is challenging. In this\npaper, we propose a novel Adaptive Deep Deterministic Reinforcement Learning\nscheme (Adaptive DDPG) for the portfolio allocation task, which incorporates\noptimistic or pessimistic deep reinforcement learning that is reflected in the\ninfluence from prediction errors. Dow Jones 30 component stocks are selected as\nour trading stocks and their daily prices are used as the training and testing\ndata. We train the Adaptive DDPG agent and obtain a trading strategy. The\nAdaptive DDPG's performance is compared with the vanilla DDPG, Dow Jones\nIndustrial Average index and the traditional min-variance and mean-variance\nportfolio allocation strategies. Adaptive DDPG outperforms the baselines in\nterms of the investment return and the Sharpe ratio.\n", "versions": [{"version": "v1", "created": "Fri, 21 Jun 2019 02:29:25 GMT"}], "update_date": "2019-07-03", "authors_parsed": [["Li", "Xinyi", ""], ["Li", "Yinchuan", ""], ["Zhan", "Yuancheng", ""], ["Liu", "Xiao-Yang", ""]]}, {"id": "1907.02666", "submitter": "Huiling Yuan", "authors": "Huiling Yuan, Yong Zhou, Zhiyuan Zhang, Xiangyu Cui", "title": "Forecasting security's volatility using low-frequency historical data,\n  high-frequency historical data and option-implied volatility", "comments": "37 pages,9 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Low-frequency historical data, high-frequency historical data and option data\nare three major sources, which can be used to forecast the underlying\nsecurity's volatility. In this paper, we propose two econometric models, which\nintegrate three information sources. In GARCH-It\\^{o}-OI model, we assume that\nthe option-implied volatility can influence the security's future volatility,\nand the option-implied volatility is treated as an observable exogenous\nvariable. In GARCH-It\\^{o}-IV model, we assume that the option-implied\nvolatility can not influence the security's volatility directly, and the\nrelationship between the option-implied volatility and the security's\nvolatility is constructed to extract useful information of the underlying\nsecurity. After providing the quasi-maximum likelihood estimators for the\nparameters and establishing their asymptotic properties, we also conduct a\nseries of simulation analysis and empirical analysis to compare the proposed\nmodels with other popular models in the literature. We find that when the\nsampling interval of the high-frequency data is 5 minutes, the GARCH-It\\^{o}-OI\nmodel and GARCH-It\\^{o}-IV model has better forecasting performance than other\nmodels.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jul 2019 03:44:36 GMT"}], "update_date": "2019-07-08", "authors_parsed": [["Yuan", "Huiling", ""], ["Zhou", "Yong", ""], ["Zhang", "Zhiyuan", ""], ["Cui", "Xiangyu", ""]]}, {"id": "1907.03009", "submitter": "Md Nurujjaman Ph D", "authors": "Ajit Mahata, Debi Prasad Bal and Md Nurujjaman", "title": "Identification of short-term and long-term time scales in stock markets\n  and effect of structural break", "comments": null, "journal-ref": "Physica A: Statistical Mechanics and its Applications, Volume 545,\n  1 May 2020, 123612", "doi": "10.1016/j.physa.2019.123612", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents the comparative study of the nature of stock markets in\nshort-term and long-term time scales with and without structural break in the\nstock data. Structural break point has been identified by applying Zivot and\nAndrews structural trend break model to break the original time series (TSO)\ninto time series before structural break (TSB) and time series after structural\nbreak (TSA). The empirical mode decomposition based Hurst exponent and variance\ntechniques have been applied to the TSO, TSB and TSA to identify the time\nscales in short-term and long-term from the decomposed intrinsic mode\nfunctions. We found that for TSO, TSB and TSA the short-term time scales and\nlong-term time scales are within the range of few days to 3 months and greater\nthan 5 months respectively, which indicates that the short-term and long-term\ntime scales are present in the stock market. The Hurst exponent is $\\sim 0.5$\nand $\\geq 0.75$ for TSO, TSB and TSA in short-term and long-term respectively,\nwhich indicates that the market is random in short-term and strongly correlated\nin long-term. The identification of time scales at short-term and long-term\ninvestment horizon will be useful for investors to design investment and\ntrading strategies.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jul 2019 08:37:02 GMT"}], "update_date": "2021-03-10", "authors_parsed": [["Mahata", "Ajit", ""], ["Bal", "Debi Prasad", ""], ["Nurujjaman", "Md", ""]]}, {"id": "1907.03010", "submitter": "Fabrice Daniel", "authors": "Fabrice Daniel", "title": "Financial Time Series Data Processing for Machine Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article studies the financial time series data processing for machine\nlearning. It introduces the most frequent scaling methods, then compares the\nresulting stationarity and preservation of useful information for trend\nforecasting. It proposes an empirical test based on the capability to learn\nsimple data relationship with simple models. It also speaks about the data\nsplit method specific to time series, avoiding unwanted overfitting and\nproposes various labelling for classification and regression.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jul 2019 15:10:23 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Daniel", "Fabrice", ""]]}, {"id": "1907.03370", "submitter": "Eric Ghysels", "authors": "Catherine D'Hondt, Rudy De Winne, Eric Ghysels, Steve Raymond", "title": "Artificial Intelligence Alter Egos: Who benefits from Robo-investing?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM econ.EM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Artificial intelligence, or AI, enhancements are increasingly shaping our\ndaily lives. Financial decision-making is no exception to this. We introduce\nthe notion of AI Alter Egos, which are shadow robo-investors, and use a unique\ndata set covering brokerage accounts for a large cross-section of investors\nover a sample from January 2003 to March 2012, which includes the 2008\nfinancial crisis, to assess the benefits of robo-investing. We have detailed\ninvestor characteristics and records of all trades. Our data set consists of\ninvestors typically targeted for robo-advising. We explore robo-investing\nstrategies commonly used in the industry, including some involving advanced\nmachine learning methods. The man versus machine comparison allows us to shed\nlight on potential benefits the emerging robo-advising industry may provide to\ncertain segments of the population, such as low income and/or high risk averse\ninvestors.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jul 2019 00:10:09 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["D'Hondt", "Catherine", ""], ["De Winne", "Rudy", ""], ["Ghysels", "Eric", ""], ["Raymond", "Steve", ""]]}, {"id": "1907.04422", "submitter": "Mark DeSantis", "authors": "Gunduz Caginalp and Mark DeSantis", "title": "Nonlinear price dynamics of S&P 100 stocks", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2019.122067", "report-no": null, "categories": "q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The methodology presented provides a quantitative way to characterize\ninvestor behavior and price dynamics within a particular asset class and time\nperiod. The methodology is applied to a data set consisting of over 250,000\ndata points of the S&P 100 stocks during 2004-2018. Using a two-way\nfixed-effects model, we uncover trader motivations including evidence of both\nunder- and overreaction within a unified setting. A nonlinear relationship is\nfound between return and trend suggesting a small, positive trend increases the\nreturn, while a larger one tends to decrease it. The shape parameters of the\nnonlinearity quantify trader motivation to buy into trends or wait for\nbargains. The methodology allows the testing of any behavioral finance bias or\ntechnical analysis concept.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jul 2019 21:33:49 GMT"}], "update_date": "2020-04-22", "authors_parsed": [["Caginalp", "Gunduz", ""], ["DeSantis", "Mark", ""]]}, {"id": "1907.04925", "submitter": "Giacomo Livan", "authors": "Riccardo Marcaccioli, Giacomo Livan", "title": "Maximum Entropy approach to multivariate time series randomization", "comments": "20 pages, 6 figures, 5 tables", "journal-ref": "Scientific Reports volume 10, Article number: 10656 (2020)", "doi": "10.1038/s41598-020-67536-y", "report-no": null, "categories": "q-fin.ST cond-mat.stat-mech physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Natural and social multivariate systems are commonly studied through sets of\nsimultaneous and time-spaced measurements of the observables that drive their\ndynamics, i.e., through sets of time series. Typically, this is done via\nhypothesis testing: the statistical properties of the empirical time series are\ntested against those expected under a suitable null hypothesis. This is a very\nchallenging task in complex interacting systems, where statistical stability is\noften poor due to lack of stationarity and ergodicity. Here, we describe an\nunsupervised, data-driven framework to perform hypothesis testing in such\nsituations. This consists of a statistical mechanical approach - analogous to\nthe configuration model for networked systems - for ensembles of time series\ndesigned to preserve, on average, some of the statistical properties observed\non an empirical set of time series. We showcase its possible applications with\na case study on financial portfolio selection.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jul 2019 13:26:56 GMT"}, {"version": "v2", "created": "Thu, 23 Jan 2020 11:35:19 GMT"}, {"version": "v3", "created": "Wed, 25 Mar 2020 17:25:41 GMT"}, {"version": "v4", "created": "Tue, 30 Jun 2020 14:06:33 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Marcaccioli", "Riccardo", ""], ["Livan", "Giacomo", ""]]}, {"id": "1907.05348", "submitter": "Rostislav Serota", "authors": "M. Dashti Moghaddam, Zhiyuan Liu and R. A. Serota", "title": "Distributions of Historic Market Data -- Relaxation and Correlations", "comments": "17 pages, 8 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate relaxation and correlations in a class of mean-reverting\nmodels for stochastic variances. We derive closed-form expressions for the\ncorrelation functions and leverage for a general form of the stochastic term.\nWe also discuss correlation functions and leverage for three specific models --\nmultiplicative, Heston (Cox-Ingersoll-Ross) and combined multiplicative-Heston\n-- whose steady-state probability density functions are Gamma, Inverse Gamma\nand Beta Prime respectively, the latter two exhibiting \"fat\" tails. For the\nHeston model, we apply the eigenvalue analysis of the Fokker-Planck equation to\nderive the correlation function -- in agreement with the general analysis --\nand to identify a series of time scales, which are observable in relaxation of\ncumulants on approach to the steady state. We test our findings on a very large\nset of historic financial markets data.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jul 2019 16:14:38 GMT"}, {"version": "v2", "created": "Mon, 24 Feb 2020 18:35:02 GMT"}], "update_date": "2020-02-26", "authors_parsed": [["Moghaddam", "M. Dashti", ""], ["Liu", "Zhiyuan", ""], ["Serota", "R. A.", ""]]}, {"id": "1907.05697", "submitter": "Enrique A. S\\'anchez-P\\'erez", "authors": "J.M. Calabuig, H. Falciani and E.A. S\\'anchez-P\\'erez", "title": "Dreaming machine learning: Lipschitz extensions for reinforcement\n  learning on financial markets", "comments": "20 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.LG math.FA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a quasi-metric topological structure for the construction of a\nnew reinforcement learning model in the framework of financial markets. It is\nbased on a Lipschitz type extension of reward functions defined in metric\nspaces. Specifically, the McShane and Whitney extensions are considered for a\nreward function which is defined by the total evaluation of the benefits\nproduced by the investment decision at a given time. We define the metric as a\nlinear combination of a Euclidean distance and an angular metric component. All\ninformation about the evolution of the system from the beginning of the time\ninterval is used to support the extension of the reward function, but in\naddition this data set is enriched by adding some artificially produced states.\nThus, the main novelty of our method is the way we produce more states -- which\nwe call \"dreams\" -- to enrich learning. Using some known states of the\ndynamical system that represents the evolution of the financial market, we use\nour technique to simulate new states by interpolating real states and\nintroducing some random variables. These new states are used to feed a learning\nalgorithm designed to improve the investment strategy by following a typical\nreinforcement learning scheme.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jul 2019 12:33:01 GMT"}, {"version": "v2", "created": "Sat, 28 Mar 2020 13:01:42 GMT"}], "update_date": "2020-03-31", "authors_parsed": [["Calabuig", "J. M.", ""], ["Falciani", "H.", ""], ["Sánchez-Pérez", "E. A.", ""]]}, {"id": "1907.06151", "submitter": "Mathieu Rosenbaum", "authors": "Aditi Dandapani, Paul Jusselin, Mathieu Rosenbaum", "title": "From quadratic Hawkes processes to super-Heston rough volatility models\n  with Zumbach effect", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using microscopic price models based on Hawkes processes, it has been shown\nthat under some no-arbitrage condition, the high degree of endogeneity of\nmarkets together with the phenomenon of metaorders splitting generate rough\nHeston-type volatility at the macroscopic scale. One additional important\nfeature of financial dynamics, at the heart of several influential works in\neconophysics, is the so-called feedback or Zumbach effect. This essentially\nmeans that past trends in returns convey significant information on future\nvolatility. A natural way to reproduce this property in microstructure modeling\nis to use quadratic versions of Hawkes processes. We show that after suitable\nrescaling, the long term limits of these processes are refined versions of\nrough Heston models where the volatility coefficient is enhanced compared to\nthe square root characterizing Heston-type dynamics. Furthermore the Zumbach\neffect remains explicit in these limiting rough volatility models.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jul 2019 00:48:25 GMT"}, {"version": "v2", "created": "Tue, 19 Jan 2021 15:20:04 GMT"}], "update_date": "2021-01-20", "authors_parsed": [["Dandapani", "Aditi", ""], ["Jusselin", "Paul", ""], ["Rosenbaum", "Mathieu", ""]]}, {"id": "1907.06230", "submitter": "Martin Gould", "authors": "Ke Xu and Martin D. Gould and Sam D. Howison", "title": "Multi-Level Order-Flow Imbalance in a Limit Order Book", "comments": "32 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the multi-level order-flow imbalance (MLOFI), which is a vector\nquantity that measures the net flow of buy and sell orders at different price\nlevels in a limit order book (LOB). Using a recent, high-quality data set for 6\nliquid stocks on Nasdaq, we fit a simple, linear relationship between MLOFI and\nthe contemporaneous change in mid-price. For all 6 stocks that we study, we\nfind that the out-of-sample goodness-of-fit of the relationship improves with\neach additional price level that we include in the MLOFI vector. Our results\nunderline how order-flow activity deep into the LOB can influence the\nprice-formation process.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jul 2019 15:00:54 GMT"}, {"version": "v2", "created": "Sat, 26 Oct 2019 13:46:38 GMT"}], "update_date": "2019-10-29", "authors_parsed": [["Xu", "Ke", ""], ["Gould", "Martin D.", ""], ["Howison", "Sam D.", ""]]}, {"id": "1907.07514", "submitter": "Peter Cotton", "authors": "Peter Cotton", "title": "Self Organizing Supply Chains for Micro-Prediction: Present and Future\n  uses of the ROAR Protocol", "comments": "Thirty-sixth International Conference on Machine Learning Workshop on\n  AI in Finance: Applications and Infrastructure for Multi-Agent Learning", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.CY q-fin.ST stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A multi-agent system is trialed as a means of crowd-sourcing inexpensive but\nhigh quality streams of predictions. Each agent is a microservice embodying\nstatistical models and endowed with economic self-interest. The ability to fork\nand modify simple agents is granted to a large number of employees in a firm\nand empirical lessons are reported. We suggest that one plausible trajectory\nfor this project is the creation of a Prediction Web.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jul 2019 13:40:15 GMT"}], "update_date": "2019-07-18", "authors_parsed": [["Cotton", "Peter", ""]]}, {"id": "1907.08911", "submitter": "Andrey Sarantsev Mr", "authors": "Andrey Sarantsev, Blessing Ofori-Atta, Brandon Flores", "title": "A Stock Market Model Based on CAPM and Market Size", "comments": "16 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We introduce a new system of stochastic differential equations which models\ndependence of market beta and unsystematic risk upon size, measured by market\ncapitalization. We fit our model using size deciles data from Kenneth French's\ndata library. This model is somewhat similar to generalized\nvolatility-stabilized models in (Pal, 2011; Pickova, 2013). The novelty of our\nwork is twofold. First, we take into account the difference between price and\ntotal returns (in other words, between market size and wealth processes).\nSecond, we work with actual market data. We study the long-term properties of\nthis system of equations, and reproduce observed linearity of the capital\ndistribution curve. Our model has two modifications: for price returns and for\nequity premium. Somewhat surprisingly, they exhibit the same fit, with very\nsimilar coefficients. In the Appendix, we analyze size-based real-world index\nfunds.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jul 2019 04:36:03 GMT"}, {"version": "v2", "created": "Wed, 24 Jul 2019 04:12:11 GMT"}, {"version": "v3", "created": "Thu, 25 Jul 2019 01:51:38 GMT"}, {"version": "v4", "created": "Mon, 23 Sep 2019 16:36:17 GMT"}, {"version": "v5", "created": "Thu, 9 Apr 2020 05:51:25 GMT"}, {"version": "v6", "created": "Thu, 24 Sep 2020 00:34:23 GMT"}, {"version": "v7", "created": "Thu, 25 Feb 2021 23:37:46 GMT"}, {"version": "v8", "created": "Tue, 27 Apr 2021 00:12:44 GMT"}], "update_date": "2021-04-28", "authors_parsed": [["Sarantsev", "Andrey", ""], ["Ofori-Atta", "Blessing", ""], ["Flores", "Brandon", ""]]}, {"id": "1907.09218", "submitter": "Thorsten Schmidt", "authors": "Christian Rein, Ludger R\\\"uschendorf, Thorsten Schmidt", "title": "Generalized statistical arbitrage concepts and related gain strategies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Generalized statistical arbitrage concepts are introduced corresponding to\ntrading strategies which yield positive gains on average in a class of\nscenarios rather than almost surely. The relevant scenarios or market states\nare specified via an information system given by a $\\sigma$-algebra and so this\nnotion contains classical arbitrage as a special case. It also covers the\nnotion of statistical arbitrage introduced in Bondarenko (2003).\n  Relaxing these notions further we introduce generalized profitable strategies\nwhich include also static or semi-static strategies. Under standard\nno-arbitrage there may exist generalized gain strategies yielding positive\ngains on average under the specified scenarios.\n  In the first part of the paper we characterize these generalized statistical\nno-arbitrage notions. In the second part of the paper we construct several\nprofitable generalized strategies with respect to various choices of the\ninformation system. In particular, we consider several forms of embedded\nbinomial strategies and follow-the-trend strategies as well as partition-type\nstrategies. We study and compare their behaviour on simulated data.\nAdditionally, we find good performance on market data of these simple\nstrategies which makes them profitable candidates for real applications.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jul 2019 10:17:37 GMT"}, {"version": "v2", "created": "Thu, 25 Jul 2019 08:40:45 GMT"}], "update_date": "2019-07-26", "authors_parsed": [["Rein", "Christian", ""], ["Rüschendorf", "Ludger", ""], ["Schmidt", "Thorsten", ""]]}, {"id": "1907.09452", "submitter": "Adamantios Ntakaris Mr", "authors": "Adamantios Ntakaris, Juho Kanniainen, Moncef Gabbouj, Alexandros\n  Iosifidis", "title": "Mid-price Prediction Based on Machine Learning Methods with Technical\n  and Quantitative Indicators", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0234107", "report-no": null, "categories": "q-fin.ST cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stock price prediction is a challenging task, but machine learning methods\nhave recently been used successfully for this purpose. In this paper, we\nextract over 270 hand-crafted features (factors) inspired by technical and\nquantitative analysis and tested their validity on short-term mid-price\nmovement prediction. We focus on a wrapper feature selection method using\nentropy, least-mean squares, and linear discriminant analysis. We also build a\nnew quantitative feature based on adaptive logistic regression for online\nlearning, which is constantly selected first among the majority of the proposed\nfeature selection methods. This study examines the best combination of features\nusing high frequency limit order book data from Nasdaq Nordic. Our results\nsuggest that sorting methods and classifiers can be used in such a way that one\ncan reach the best performance with a combination of only very few advanced\nhand-crafted features.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jul 2019 13:26:47 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Ntakaris", "Adamantios", ""], ["Kanniainen", "Juho", ""], ["Gabbouj", "Moncef", ""], ["Iosifidis", "Alexandros", ""]]}, {"id": "1907.10306", "submitter": "Petr Koldanov Alexander", "authors": "Petr Koldanov", "title": "Testing new property of elliptical model for stock returns distribution", "comments": "15 pages, 2 figures, 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wide class of elliptically contoured distributions is a popular model of\nstock returns distribution. However the important question of adequacy of the\nmodel is open. There are some results which reject and approve such model. Such\nresults are obtained by testing some properties of elliptical model for each\npair of stocks from some markets. New property of equality of $\\tau$ Kendall\ncorrelation coefficient and probability of sign coincidence for any pair of\nrandom variables with elliptically contoured distribution is proved in the\npaper. Distribution free statistical tests for testing this property for any\npair of stocks are constructed. Holm multiple hypotheses testing procedure\nbased on the individual tests is constructed and applied for stock markets data\nfor the concrete year. New procedure of testing the elliptical model for stock\nreturns distribution for all years of observation for some period is proposed.\nThe procedure is applied for the stock markets data of China, USA, Great\nBritain and Germany for the period from 2003 to 2014. It is shown that for USA,\nGreat Britain and Germany stock markets the hypothesis of elliptical model of\nstock returns distribution could be accepted but for Chinese stock market is\nrejected for some cases.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jul 2019 08:53:45 GMT"}], "update_date": "2019-07-25", "authors_parsed": [["Koldanov", "Petr", ""]]}, {"id": "1907.10407", "submitter": "Joseph Attia", "authors": "Joseph Attia", "title": "Evaluating the Effectiveness of Common Technical Trading Models", "comments": "43 pages. arXiv admin note: text overlap with arXiv:1902.00786", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  How effective are the most common trading models? The answer may help\ninvestors realize upsides to using each model, act as a segue for investors\ninto more complex financial analysis and machine learning, and to increase\nfinancial literacy amongst students. Creating original versions of popular\nmodels, like linear regression, K-Nearest Neighbor, and moving average\ncrossovers, we can test how each model performs on the most popular stocks and\nlargest indexes. With the results for each, we can compare the models, and\nunderstand which model reliably increases performance. The trials showed that\nwhile all three models reduced losses on stocks with strong overall downward\ntrends, the two machine learning models did not work as well to increase\nprofits. Moving averages crossovers outperformed a continuous investment every\ntime, although did result in a more volatile investment as well. Furthermore,\nonce finished creating the program that implements moving average crossover,\nwhat are the optimal periods to use? A massive test consisting of 169,880\ntrials, showed the best periods to use to increase investment performance\n(5,10) and to decrease volatility (33,44). In addition, the data showed\nnumerous trends such as a smaller short SMA period is accompanied by higher\nperformance. Plotting volatility against performance shows that the high risk,\nhigh reward saying holds true and shows that for investments, as the volatility\nincreases so does its performance.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jul 2019 03:21:16 GMT"}], "update_date": "2019-08-01", "authors_parsed": [["Attia", "Joseph", ""]]}, {"id": "1907.11984", "submitter": "Tarik A. Rashid", "authors": "Naser Rostamni and Tarik A. Rashid", "title": "Investigating the effect of competitiveness power in estimating the\n  average weighted price in electricity market", "comments": "11 pages", "journal-ref": "The Electricity Journal, 2019", "doi": "10.1016/j.tej.2019.106628", "report-no": null, "categories": "q-fin.ST cs.LG", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  This paper evaluates the impact of the power extent on price in the\nelectricity market. The competitiveness extent of the electricity market during\nspecific times in a day is considered to achieve this. Then, the effect of\ncompetitiveness extent on the forecasting precision of the daily power price is\nassessed. A price forecasting model based on multi-layer perception via back\npropagation with the Levenberg-Marquardt mechanism is used. The Residual Supply\nIndex (RSI) and other variables that affect prices are used as inputs to the\nmodel to evaluate the market competitiveness. The results show that using\nmarket power indices as inputs helps to increase forecasting accuracy. Thus,\nthe competitiveness extent of the market power in different daily time periods\nis a notable variable in price formation. Moreover, market players cannot\nignore the explanatory power of market power in price forecasting. In this\nresearch, the real data of the electricity market from 2013 is used and the\nmain source of data is the Grid Management Company in Iran.\n", "versions": [{"version": "v1", "created": "Sat, 27 Jul 2019 22:13:38 GMT"}], "update_date": "2019-07-30", "authors_parsed": [["Rostamni", "Naser", ""], ["Rashid", "Tarik A.", ""]]}, {"id": "1907.12025", "submitter": "Kyungsub Lee", "authors": "Kyungsub Lee, Byoung Ki Seo", "title": "Marked Hawkes process modeling of price dynamics and volatility\n  estimation", "comments": null, "journal-ref": "40, pp.174-220, Journal of Empirical Finance, 2017", "doi": "10.1016/j.jempfin.2016.08.004", "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A simple Hawkes model have been developed for the price tick structure\ndynamics incorporating market microstructure noise and trade clustering. In\nthis paper, the model is extended with random mark to deal with more realistic\nprice tick structures of equities. We examine the impact of jump in price\ndynamics to the future movements and dependency between the jump sizes and\nground intensities. We also derive the volatility formula based on stochastic\nand statistical methods and compare with realized volatility in simulation and\nempirical studies. The marked Hawkes model is useful to estimate the intraday\nvolatility similarly in the case of simple Hawkes model.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jul 2019 06:33:18 GMT"}], "update_date": "2019-07-30", "authors_parsed": [["Lee", "Kyungsub", ""], ["Seo", "Byoung Ki", ""]]}]