[{"id": "2011.00552", "submitter": "Vincenzo Candila", "authors": "Vincenzo Candila, Giampiero M. Gallo, Lea Petrella", "title": "Using mixed-frequency and realized measures in quantile regression", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantile regression is an efficient tool when it comes to estimate popular\nmeasures of tail risk such as the conditional quantile Value at Risk. In this\npaper we exploit the availability of data at mixed frequency to build a\nvolatility model for daily returns with low-- (for macro--variables) and\nhigh--frequency (which may include an \\virg{--X} term related to realized\nvolatility measures) components. The quality of the suggested quantile\nregression model, labeled MF--Q--ARCH--X, is assessed in a number of\ndirections: we derive weak stationarity properties, we investigate its finite\nsample properties by means of a Monte Carlo exercise and we apply it on\nfinancial real data. VaR forecast performances are evaluated by backtesting and\nModel Confidence Set inclusion among competitors, showing that the\nMF--Q--ARCH--X has a consistently accurate forecasting capability.\n", "versions": [{"version": "v1", "created": "Sun, 1 Nov 2020 16:39:51 GMT"}], "update_date": "2020-11-03", "authors_parsed": [["Candila", "Vincenzo", ""], ["Gallo", "Giampiero M.", ""], ["Petrella", "Lea", ""]]}, {"id": "2011.01961", "submitter": "Alexander Wong", "authors": "Alexander Wong, Andrew Hryniowski, and Xiao Yu Wang", "title": "Insights into Fairness through Trust: Multi-scale Trust Quantification\n  for Financial Deep Learning", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The success of deep learning in recent years have led to a significant\nincrease in interest and prevalence for its adoption to tackle financial\nservices tasks. One particular question that often arises as a barrier to\nadopting deep learning for financial services is whether the developed\nfinancial deep learning models are fair in their predictions, particularly in\nlight of strong governance and regulatory compliance requirements in the\nfinancial services industry. A fundamental aspect of fairness that has not been\nexplored in financial deep learning is the concept of trust, whose variations\nmay point to an egocentric view of fairness and thus provide insights into the\nfairness of models. In this study we explore the feasibility and utility of a\nmulti-scale trust quantification strategy to gain insights into the fairness of\na financial deep learning model, particularly under different scenarios at\ndifferent scales. More specifically, we conduct multi-scale trust\nquantification on a deep neural network for the purpose of credit card default\nprediction to study: 1) the overall trustworthiness of the model 2) the trust\nlevel under all possible prediction-truth relationships, 3) the trust level\nacross the spectrum of possible predictions, 4) the trust level across\ndifferent demographic groups (e.g., age, gender, and education), and 5)\ndistribution of overall trust for an individual prediction scenario. The\ninsights for this proof-of-concept study demonstrate that such a multi-scale\ntrust quantification strategy may be helpful for data scientists and regulators\nin financial services as part of the verification and certification of\nfinancial deep learning solutions to gain insights into fairness and trust of\nthese solutions.\n", "versions": [{"version": "v1", "created": "Tue, 3 Nov 2020 19:05:07 GMT"}], "update_date": "2020-11-05", "authors_parsed": [["Wong", "Alexander", ""], ["Hryniowski", "Andrew", ""], ["Wang", "Xiao Yu", ""]]}, {"id": "2011.02026", "submitter": "Hanie Vahabi", "authors": "Hanie.Vahabi and Ali Namaki and Reza Raei", "title": "Comparing the collective behavior of banking industry", "comments": "e.g=14pages,9figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph q-fin.ST", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  One of the most important features of capital markets as an adaptive complex\nnetworks is their collective behavior. In this paper, we have analyzed the\nbanking sectors of 4 world stock markets,which composed of emerging and matures\nones. By applying one the important complexity notions, Random matrix\ntheory(RMT), it is founded that mature markets have a higher degree of\ncollective behavior,Even though we used RMT tools: participation ratio(PR),\nnode participation ratio(NPR)and relative participation ratio(RPR) , which NPR\nillustrated independent banks than whole market and RPR compared collective\nbehavior of markets by a normal range. By applying local and global\nperturbations, we concluded that mature markets are more vulnerable to\nperturbations due to the high level of collective behavior. Finally, by drawing\nthe dendrograms and heat maps of the correlation matrices,\n", "versions": [{"version": "v1", "created": "Mon, 2 Nov 2020 15:49:07 GMT"}], "update_date": "2020-11-05", "authors_parsed": [["Vahabi", "Hanie.", ""], ["Namaki", "Ali", ""], ["Raei", "Reza", ""]]}, {"id": "2011.02870", "submitter": "Renyuan Xu", "authors": "Anna Ananova, Rama Cont and Renyuan Xu", "title": "Excursion Risk", "comments": "36 pages; 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The risk and return profiles of a broad class of dynamic trading strategies,\nincluding pairs trading and other statistical arbitrage strategies, may be\ncharacterized in terms of excursions of the market price of a portfolio away\nfrom a reference level. We propose a mathematical framework for the risk\nanalysis of such strategies, based on a description in terms of price\nexcursions, first in a pathwise setting, without probabilistic assumptions,\nthen in a Markovian setting.\n  We introduce the notion of delta-excursion, defined as a path which deviates\nby delta from a reference level before returning to this level. We show that\nevery continuous path has a unique decomposition into delta-excursions, which\nis useful for the scenario analysis of dynamic trading strategies, leading to\nsimple expressions for the number of trades, realized profit, maximum loss and\ndrawdown. As delta is decreased to zero, properties of this decomposition\nrelate to the local time of the path.\n  When the underlying asset follows a Markov process, we combine these results\nwith Ito's excursion theory to obtain a tractable decomposition of the process\nas a concatenation of independent delta-excursions, whose distribution is\ndescribed in terms of Ito's excursion measure. We provide analytical results\nfor linear diffusions and give new examples of stochastic processes for\nflexible and tractable modeling of excursions. Finally, we describe a\nnon-parametric scenario simulation method for generating paths whose excursion\nproperties match those observed in empirical data.\n", "versions": [{"version": "v1", "created": "Thu, 5 Nov 2020 14:45:58 GMT"}], "update_date": "2020-11-06", "authors_parsed": [["Ananova", "Anna", ""], ["Cont", "Rama", ""], ["Xu", "Renyuan", ""]]}, {"id": "2011.04171", "submitter": "Liao Zhu", "authors": "Liao Zhu, Robert A. Jarrow, Martin T. Wells", "title": "Time-Invariance Coefficients Tests with the Adaptive Multi-Factor Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this paper is to test the time-invariance of the beta\ncoefficients estimated by the Adaptive Multi-Factor (AMF) model. The AMF model\nis implied by the generalized arbitrage pricing theory (GAPT), which implies\nconstant beta coefficients. The AMF model utilizes a Groupwise Interpretable\nBasis Selection (GIBS) algorithm to identify the relevant factors from among\nall traded ETFs. We compare the AMF model with the Fama-French 5-factor (FF5)\nmodel. We show that for nearly all time periods with length less than 6 years,\nthe beta coefficients are time-invariant for the AMF model, but not for the FF5\nmodel. This implies that the AMF model with a rolling window (such as 5 years)\nis more consistent with realized asset returns than is the FF5 model.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2020 03:41:02 GMT"}, {"version": "v2", "created": "Mon, 26 Apr 2021 00:53:33 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Zhu", "Liao", ""], ["Jarrow", "Robert A.", ""], ["Wells", "Martin T.", ""]]}, {"id": "2011.04367", "submitter": "Ivan Jericevich", "authors": "Ivan Jericevich, Patrick Chang, Tim Gebbie", "title": "Comparing the market microstructure between two South African exchanges", "comments": "25 pages, 16 figures, 9 tables. Link to supporting Julia code:\n  https://github.com/CHNPAT005/PCIJAPTG-A2XvsJSE", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider shared listings on two South African equity exchanges: the\nJohannesburg Stock Exchange (JSE) and the A2X Exchange. A2X is an alternative\nexchange that provides for both shared listings and new listings within the\nfinancial market ecosystem of South Africa. From a science perspective it\nprovides the opportunity to compare markets trading similar shares, in a\nsimilar regulatory and economic environment, but with vastly different\nliquidity, costs and business models. A2X currently has competitive settlement\nand transaction pricing when compared to the JSE, but the JSE has deeper\nliquidity. In pursuit of an empirical understanding of how these differences\nrelate to their respective price response dynamics, we compare the\ndistributions and auto-correlations of returns on different time scales; we\ncompare price impact and master curves; and we compare the cost of trading on\neach exchange. This allows us to empirically compare the two markets. We find\nthat various stylised facts become similar as the measurement or sampling time\nscale increase. However, the same securities can have vastly different price\nresponses irrespective of time scales. This is not surprising given the\ndifferent liquidity and order-book resilience. Here we demonstrate that direct\ncosts dominate the cost of trading, and the importance of competitively\npositioning cost ceilings. Universality is crucial for being able to\nmeaningfully compare cross-exchange price responses, but in the case of A2X, it\nhas yet to emerge in a meaningful way due to the infancy of the exchange --\nmaking meaningful comparisons difficult.\n", "versions": [{"version": "v1", "created": "Mon, 9 Nov 2020 12:03:06 GMT"}], "update_date": "2020-11-10", "authors_parsed": [["Jericevich", "Ivan", ""], ["Chang", "Patrick", ""], ["Gebbie", "Tim", ""]]}, {"id": "2011.04545", "submitter": "Elizabeth Fons", "authors": "Elizabeth Fons, Paula Dawson, Xiao-jun Zeng, John Keane, Alexandros\n  Iosifidis", "title": "Augmenting transferred representations for stock classification", "comments": "Draws heavily from arXiv:2010.15111", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stock classification is a challenging task due to high levels of noise and\nvolatility of stocks returns. In this paper we show that using transfer\nlearning can help with this task, by pre-training a model to extract universal\nfeatures on the full universe of stocks of the S$\\&$P500 index and then\ntransferring it to another model to directly learn a trading rule. Transferred\nmodels present more than double the risk-adjusted returns than their\ncounterparts trained from zero. In addition, we propose the use of data\naugmentation on the feature space defined as the output of a pre-trained model\n(i.e. augmenting the aggregated time-series representation). We compare this\naugmentation approach with the standard one, i.e. augmenting the time-series in\nthe input space. We show that augmentation methods on the feature space leads\nto $20\\%$ increase in risk-adjusted return compared to a model trained with\ntransfer learning but without augmentation.\n", "versions": [{"version": "v1", "created": "Wed, 28 Oct 2020 18:56:34 GMT"}], "update_date": "2020-11-10", "authors_parsed": [["Fons", "Elizabeth", ""], ["Dawson", "Paula", ""], ["Zeng", "Xiao-jun", ""], ["Keane", "John", ""], ["Iosifidis", "Alexandros", ""]]}, {"id": "2011.04939", "submitter": "Ao Kong", "authors": "Ao Kong, Robert Azencott, Hongliang Zhu, Xindan Li", "title": "Pattern recognition in micro-trading behaviors before stock price jumps:\n  A framework based on multivariate time series analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Studying the micro-trading behaviors before stock price jumps is an important\nproblem for financial regulations and investment decisions. In this study, we\nprovide a new framework to study pre-jump trading behaviors based on\nmultivariate time series analysis. Different from the existing literature, our\nmethodology takes into account the temporal information embedded in the\ntrading-related attributes and can better evaluate and compare the abnormality\nlevels of different attributes. Moreover, it can explore the joint\ninformativeness of the attributes as well as select a subset of highly\ninformative but minimally redundant attributes to analyze the homogeneous and\nidiosyncratic patterns in the pre-jump trades of individual stocks. In\naddition, our analysis involves a set of technical indicators to describe\nmicro-trading behaviors. To illustrate the viability of the proposed\nmethodology, an application case is conducted based on the level-2 data of 189\nconstituent stocks of the China Security Index 300. The individual and joint\ninformativeness levels of the attributes in predicting price jumps are\nevaluated and compared. To this end, our experiment provides a set of jump\nindicators that can represent the pre-jump trading behaviors in the Chinese\nstock market and have detected some stocks with extremely abnormal pre-jump\ntrades.\n", "versions": [{"version": "v1", "created": "Tue, 10 Nov 2020 06:52:41 GMT"}, {"version": "v2", "created": "Fri, 26 Feb 2021 00:42:37 GMT"}], "update_date": "2021-03-01", "authors_parsed": [["Kong", "Ao", ""], ["Azencott", "Robert", ""], ["Zhu", "Hongliang", ""], ["Li", "Xindan", ""]]}, {"id": "2011.05067", "submitter": "Manuele Leonelli", "authors": "Miguel de Carvalho, Manuele Leonelli, Alex Rossi", "title": "Tracking change-points in multivariate extremes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-fin.ST", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper we devise a statistical method for tracking and modeling\nchange-points on the dependence structure of multivariate extremes. The methods\nare motivated by and illustrated on a case study on crypto-assets.\n", "versions": [{"version": "v1", "created": "Tue, 10 Nov 2020 12:17:38 GMT"}], "update_date": "2020-11-11", "authors_parsed": [["de Carvalho", "Miguel", ""], ["Leonelli", "Manuele", ""], ["Rossi", "Alex", ""]]}, {"id": "2011.05984", "submitter": "Hirdesh Pharasi", "authors": "Hirdesh K. Pharasi, Eduard Seligman, Suchetana Sadhukhan, and Thomas\n  H.Seligman", "title": "Dynamics of market states and risk assessment", "comments": "22 pages and 27 figures. arXiv admin note: text overlap with\n  arXiv:2003.07058", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on previous developments of the concept of market states using\ncorrelation matrices, in the present paper we address the dynamical evolution\nof correlation matrices in time. This will imply minor modifications to the\nmarket states themselves, due to increased attention to the transition matrix\nbetween the states. We will introduce trajectories of the correlation matrices\nby considering one day shifts for the epoch used to calculate the correlation\nmatrices and will visualize both the states and the trajectories after\ndimensional scaling. This approach using dynamics improves the options of risk\nassessment and opens the door to dynamical treatments of markets and shows\nnoise suppression in a new light.\n", "versions": [{"version": "v1", "created": "Tue, 10 Nov 2020 15:48:07 GMT"}], "update_date": "2020-11-12", "authors_parsed": [["Pharasi", "Hirdesh K.", ""], ["Seligman", "Eduard", ""], ["Sadhukhan", "Suchetana", ""], ["Seligman", "Thomas H.", ""]]}, {"id": "2011.08011", "submitter": "Jaydip Sen", "authors": "Sidra Mehtab, Jaydip Sen and Subhasis Dasgupta", "title": "Robust Analysis of Stock Price Time Series Using CNN and LSTM-Based Deep\n  Learning Models", "comments": "The paper is the accepted version of our work in the 4th IEEE\n  International Conference on Electronics, Communication, and Aerospace\n  Technology (ICECA'20), November 5 - 7, 2020, Coimbatore, INDIA, The paper\n  consists of 10 pages. It contains 12 figures and 8 tables", "journal-ref": null, "doi": "10.1109/ICECA49313.2020.9297652", "report-no": null, "categories": "q-fin.ST cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Prediction of stock price and stock price movement patterns has always been a\ncritical area of research. While the well-known efficient market hypothesis\nrules out any possibility of accurate prediction of stock prices, there are\nformal propositions in the literature demonstrating accurate modeling of the\npredictive systems that can enable us to predict stock prices with a very high\nlevel of accuracy. In this paper, we present a suite of deep learning-based\nregression models that yields a very high level of accuracy in stock price\nprediction. To build our predictive models, we use the historical stock price\ndata of a well-known company listed in the National Stock Exchange (NSE) of\nIndia during the period December 31, 2012 to January 9, 2015. The stock prices\nare recorded at five minutes intervals of time during each working day in a\nweek. Using these extremely granular stock price data, we build four\nconvolutional neural network (CNN) and five long- and short-term memory\n(LSTM)-based deep learning models for accurate forecasting of the future stock\nprices. We provide detailed results on the forecasting accuracies of all our\nproposed models based on their execution time and their root mean square error\n(RMSE) values.\n", "versions": [{"version": "v1", "created": "Sat, 7 Nov 2020 16:07:10 GMT"}, {"version": "v2", "created": "Sat, 2 Jan 2021 08:04:43 GMT"}], "update_date": "2021-01-05", "authors_parsed": [["Mehtab", "Sidra", ""], ["Sen", "Jaydip", ""], ["Dasgupta", "Subhasis", ""]]}, {"id": "2011.08128", "submitter": "Marcos Vin\\'icius Dos Santos Ara\\'ujo", "authors": "Marcos Vin\\'icius dos Santos Ara\\'ujo", "title": "Aplica\\c{c}\\~ao do Movimento Browniano Geom\\'etrico para Simula\\c{c}\\~ao\n  de Pre\\c{c}os de A\\c{c}\\~oes do \\'Indice Brasileiro de Small Caps", "comments": "in Portuguese", "journal-ref": null, "doi": "10.13140/RG.2.2.21731.99365", "report-no": null, "categories": "q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work addressed the use of the geometric Brownian motion to simulate the\nprices of shares listed in the Small Caps index of the Brazilian stock exchange\nB3 (Brazil, Bolsa, Balc\\~ao). The data used refer to the price history from\nJanuary 2016 to December 2018. The price history of 2019 was used to be\ncompared with the simulated prices. The data was imported from the Yahoo\nFinance database using the Python programming language, and the simulations\nwere performed for each stock individually, and for portfolios formed based on\nexpected returns, risk and the Sharpe Index. The results were better for\nportfolios with higher returns, lower risks and higher Sharpe Indexes.\n", "versions": [{"version": "v1", "created": "Thu, 12 Nov 2020 20:37:14 GMT"}], "update_date": "2020-11-17", "authors_parsed": [["Araújo", "Marcos Vinícius dos Santos", ""]]}, {"id": "2011.08717", "submitter": "Maksym Obrizan", "authors": "Rahul Goel, Lucas Javier Ford, Maksym Obrizan and Rajesh Sharma", "title": "COVID-19 and the stock market: evidence from Twitter", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  COVID-19 has had a much larger impact on the financial markets compared to\nprevious epidemics because the news information is transferred over the social\nnetworks at a speed of light. Using Twitter's API, we compiled a unique dataset\nwith more than 26 million COVID-19 related Tweets collected from February 2nd\nuntil May 1st, 2020. We find that more frequent use of the word \"stock\" in\ndaily Tweets is associated with a substantial decline in log returns of three\nkey US indices - Dow Jones Industrial Average, S&P500, and NASDAQ. The results\nremain virtually unchanged in multiple robustness checks.\n", "versions": [{"version": "v1", "created": "Fri, 13 Nov 2020 19:59:50 GMT"}], "update_date": "2020-11-18", "authors_parsed": [["Goel", "Rahul", ""], ["Ford", "Lucas Javier", ""], ["Obrizan", "Maksym", ""], ["Sharma", "Rajesh", ""]]}, {"id": "2011.09109", "submitter": "Atul Deshpande", "authors": "Atul Deshpande, John A Gubner and B. Ross Barmish", "title": "On Simultaneous Long-Short Stock Trading Controllers with Cross-Coupling", "comments": "Presented at IFAC World Congress, 2020. Will appear in\n  IFAC-PapersOnline", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.MF", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Simultaneous Long-Short(SLS) controller for trading a single stock is\nknown to guarantee positive expected value of the resulting gain-loss function\nwith respect to a large class of stock price dynamics. In the literature, this\nis known as the Robust Positive Expectation(RPE)property. An obvious way to\nextend this theory to the trading of two stocks is to trade each one of them\nusing its own independent SLS controller. Motivated by the fact that such a\nscheme does not exploit any correlation between the two stocks, we study the\ncase when the relative sign between the drifts of the two stocks is known. The\nmain contributions of this paper are three-fold: First, we put forward a novel\narchitecture in which we cross-couple two SLS controllers for the two-stock\ncase. Second, we derive a closed-form expression for the expected value of the\ngain-loss function. Third, we use this closed-form expression to prove that the\nRPE property is guaranteed with respect to a large class of stock-price\ndynamics. When more information over and above the relative sign is assumed,\nadditional benefits of the new architecture are seen. For example, when bounds\nor precise values for the means and covariances of the stock returns are\nincluded in the model, numerical simulations suggest that our new controller\ncan achieve lower trading risk than a pair of decoupled SLS controllers for the\nsame level of expected trading gain.\n", "versions": [{"version": "v1", "created": "Wed, 18 Nov 2020 06:21:58 GMT"}], "update_date": "2020-11-19", "authors_parsed": [["Deshpande", "Atul", ""], ["Gubner", "John A", ""], ["Barmish", "B. Ross", ""]]}, {"id": "2011.09137", "submitter": "Shenghuan Yang", "authors": "Shenghuan Yang, lonut Florescu, Md Tariqul Islam", "title": "Principal Component Analysis and Factor Analysis for Feature Selection\n  in Credit Rating", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The credit rating is an evaluation of a company's credit risk that values the\nability to pay back the debt and predict the likelihood of the debtor\ndefaulting. There are various features influencing credit rating. Therefore, it\nis essential to select substantive features to explore the main reason for\ncredit rating change. To address this issue, this paper exploited Principal\nComponent Analysis and Factor Analysis as feature selection algorithms to\nselect important features, summarized the similar features together, and\nobtained a minimum set of features for four sectors, Financial Sector, Energy\nSector, Health Care Sector, Consumer Discretionary Sector. This paper used two\ndata sets, Financial Ratio and Balance Sheet, with two mappings, Detailed\nMapping, and Coarse Mapping, converting the target variable(credit rating) into\ncategorical variable. To test the accuracy of credit rating prediction, Random\nForest Classifier was used to test and train feature sets. The results showed\nthat the accuracy of Financial Ratio feature sets was higher than that of\nBalance Sheet feature sets. In addition, Factor Analysis can reduce the number\nof features significantly to obtain almost the same accuracy that can decrease\ndramatically the time spent on analyzing data; we also summarized seven\ndominant factors and ten dominant factors affecting credit rating change in\nFinancial Ratio and Balance Sheet by utilizing Factor Analysis, respectively,\nwhich can explain the reason of credit rating change better.\n", "versions": [{"version": "v1", "created": "Wed, 18 Nov 2020 07:25:08 GMT"}, {"version": "v2", "created": "Mon, 21 Dec 2020 00:57:00 GMT"}], "update_date": "2020-12-22", "authors_parsed": [["Yang", "Shenghuan", ""], ["Florescu", "lonut", ""], ["Islam", "Md Tariqul", ""]]}, {"id": "2011.10300", "submitter": "Renyuan Xu", "authors": "Ben Hambly, Renyuan Xu and Huining Yang", "title": "Policy Gradient Methods for the Noisy Linear Quadratic Regulator over a\n  Finite Horizon", "comments": "49 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore reinforcement learning methods for finding the optimal policy in\nthe linear quadratic regulator (LQR) problem. In particular, we consider the\nconvergence of policy gradient methods in the setting of known and unknown\nparameters. We are able to produce a global linear convergence guarantee for\nthis approach in the setting of finite time horizon and stochastic state\ndynamics under weak assumptions. The convergence of a projected policy gradient\nmethod is also established in order to handle problems with constraints. We\nillustrate the performance of the algorithm with two examples. The first\nexample is the optimal liquidation of a holding in an asset. We show results\nfor the case where we assume a model for the underlying dynamics and where we\napply the method to the data directly. The empirical evidence suggests that the\npolicy gradient method can learn the global optimal solution for a larger class\nof stochastic systems containing the LQR framework and that it is more robust\nwith respect to model mis-specification when compared to a model-based\napproach. The second example is an LQR system in a higher dimensional setting\nwith synthetic data.\n", "versions": [{"version": "v1", "created": "Fri, 20 Nov 2020 09:51:49 GMT"}, {"version": "v2", "created": "Wed, 23 Jun 2021 18:46:28 GMT"}], "update_date": "2021-06-25", "authors_parsed": [["Hambly", "Ben", ""], ["Xu", "Renyuan", ""], ["Yang", "Huining", ""]]}, {"id": "2011.11281", "submitter": "Patrick Chang", "authors": "Patrick Chang, Etienne Pienaar, Tim Gebbie", "title": "The Epps effect under alternative sampling schemes", "comments": "13 pages, 12 figures. Link to our supporting Julia code:\n  https://github.com/CHNPAT005/PCRBTG-VT", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Time and the choice of measurement time scales is fundamental to how we\nchoose to represent information and data in finance. This choice implies both\nthe units and the aggregation scales for the resulting statistical measurables\nused to describe a financial system. It also defines how we measure the\nrelationship between different traded instruments. As we move from\nhigh-frequency time scales, when individual trade and quote events occur, to\nthe mesoscales when correlations emerge in ways that can conform to various\nlatent models; it remains unclear what choice of time and sampling rates are\nappropriate to faithfully capture system dynamics and asset correlations for\ndecision making. The Epps effect is the key phenomenology that couples the\nemergence of correlations to the choice of sampling time scales. Here we\nconsider and compare the Epps effect under different sampling schemes in order\nto contrast three choices of time: calendar time, volume time and trade time.\nUsing a toy model based on a Hawkes process, we are able to achieve simulation\nresults that conform well with empirical dynamics. Concretely, we find that the\nEpps effect is present under all three definitions of time and that\ncorrelations emerge faster under trade time compared to calendar time, whereas\ncorrelations emerge linearly under volume time.\n", "versions": [{"version": "v1", "created": "Mon, 23 Nov 2020 08:53:58 GMT"}], "update_date": "2020-11-24", "authors_parsed": [["Chang", "Patrick", ""], ["Pienaar", "Etienne", ""], ["Gebbie", "Tim", ""]]}, {"id": "2011.12291", "submitter": "Matthew Tomlinson", "authors": "Matthew F. Tomlinson, David Greenwood, Marcin Mucha-Kruczynski", "title": "Asymmetric excitation of left- and right-tail extreme events probed\n  using a Hawkes model: application to financial returns", "comments": "11 pages. 7 figures and 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct a two-tailed peak-over-threshold Hawkes model that captures\nasymmetric self- and cross-excitation in and between left- and right-tail\nextreme values within a time series. We demonstrate its applicability by\ninvestigating extreme gains and losses within the daily log-returns of the S&P\n500 equity index. We find that the arrivals of extreme losses and gains are\ndescribed by a common conditional intensity to which losses contribute twice as\nmuch as gains. However, the contribution of the former decays almost five times\nmore quickly than that of the latter. We attribute these asymmetries to the\ndifferent reactions of market traders to extreme upward and downward movements\nof asset prices: an example of negativity bias, wherein trauma is more salient\nthan euphoria.\n", "versions": [{"version": "v1", "created": "Tue, 24 Nov 2020 18:11:45 GMT"}], "update_date": "2020-11-30", "authors_parsed": [["Tomlinson", "Matthew F.", ""], ["Greenwood", "David", ""], ["Mucha-Kruczynski", "Marcin", ""]]}, {"id": "2011.13113", "submitter": "David Romain Djoumbissie", "authors": "Djoumbissie David Romain", "title": "Predicting S&P500 Index direction with Transfer Learning and a Causal\n  Graph as main Input", "comments": "Revised description in section II", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.AI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a unified multi-tasking framework to represent the complex and\nuncertain causal process of financial market dynamics, and then to predict the\nmovement of any type of index with an application on the monthly direction of\nthe S&P500 index. our solution is based on three main pillars: (i) the use of\ntransfer learning to share knowledge and feature (representation, learning)\nbetween all financial markets, increase the size of the training sample and\npreserve the stability between training, validation and test sample. (ii) The\ncombination of multidisciplinary knowledge (Financial economics, behavioral\nfinance, market microstructure and portfolio construction theories) to\nrepresent a global top-down dynamics of any financial market, through a graph.\n(iii) The integration of forward looking unstructured data, different types of\ncontexts (long, medium and short term) through latent variables/nodes and then,\nuse a unique VAE network (parameter sharing) to learn simultaneously their\ndistributional representation. We obtain Accuracy, F1-score, and Matthew\nCorrelation of 74.3 %, 67 % and 0.42 above the industry and other benchmark on\n12 years test period which include three unstable and difficult sub-period to\npredict.\n", "versions": [{"version": "v1", "created": "Thu, 26 Nov 2020 03:45:51 GMT"}, {"version": "v2", "created": "Wed, 6 Jan 2021 23:44:32 GMT"}], "update_date": "2021-01-08", "authors_parsed": [["Romain", "Djoumbissie David", ""]]}, {"id": "2011.14809", "submitter": "Haroldo Ribeiro", "authors": "Luiz G. A. Alves, Higor Y. D. Sigaki, Matjaz Perc, Haroldo V. Ribeiro", "title": "Collective dynamics of stock market efficiency", "comments": "11 pages, 4 figures, supplementary information; accepted for\n  publication in Scientific Reports", "journal-ref": "Sci. Rep. 10, 21992 (2020)", "doi": "10.1038/s41598-020-78707-2", "report-no": null, "categories": "physics.soc-ph q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Summarized by the efficient market hypothesis, the idea that stock prices\nfully reflect all available information is always confronted with the behavior\nof real-world markets. While there is plenty of evidence indicating and\nquantifying the efficiency of stock markets, most studies assume this\nefficiency to be constant over time so that its dynamical and collective\naspects remain poorly understood. Here we define the time-varying efficiency of\nstock markets by calculating the permutation entropy within sliding\ntime-windows of log-returns of stock market indices. We show that major world\nstock markets can be hierarchically classified into several groups that display\nsimilar long-term efficiency profiles. However, we also show that efficiency\nranks and clusters of markets with similar trends are only stable for a few\nmonths at a time. We thus propose a network representation of stock markets\nthat aggregates their short-term efficiency patterns into a global and coherent\npicture. We find this financial network to be strongly entangled while also\nhaving a modular structure that consists of two distinct groups of stock\nmarkets. Our results suggest that stock market efficiency is a collective\nphenomenon that can drive its operation at a high level of informational\nefficiency, but also places the entire system under risk of failure.\n", "versions": [{"version": "v1", "created": "Mon, 30 Nov 2020 14:06:09 GMT"}], "update_date": "2020-12-16", "authors_parsed": [["Alves", "Luiz G. A.", ""], ["Sigaki", "Higor Y. D.", ""], ["Perc", "Matjaz", ""], ["Ribeiro", "Haroldo V.", ""]]}, {"id": "2011.14817", "submitter": "Christophe Ley", "authors": "Sla{\\dj}ana Babi\\'c and Christophe Ley and Lorenzo Ricci and David\n  Veredas", "title": "TailCoR", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST stat.AP stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Economic and financial crises are characterised by unusually large events.\nThese tail events co-move because of linear and/or nonlinear dependencies. We\nintroduce TailCoR, a metric that combines (and disentangles) these linear and\nnon-linear dependencies. TailCoR between two variables is based on the tail\ninter quantile range of a simple projection. It is dimension-free, it performs\nwell in small samples, and no optimisations are needed.\n", "versions": [{"version": "v1", "created": "Thu, 26 Nov 2020 20:58:58 GMT"}], "update_date": "2020-12-01", "authors_parsed": [["Babić", "Slađana", ""], ["Ley", "Christophe", ""], ["Ricci", "Lorenzo", ""], ["Veredas", "David", ""]]}]