[{"id": "1108.0187", "submitter": "Yuedong Xu", "authors": "Yuedong Xu, Eitan Altman, Rachid El-Azouzi, Majed Haddad, Salaheddine\n  Elayoubi, Tania Jimenez", "title": "Analysis of Buffer Starvation with Application to Objective QoE\n  Optimization of Streaming Services", "comments": "9 pages, 7 figures; IEEE Infocom 2012", "journal-ref": null, "doi": "10.1109/TMM.2014.2300041", "report-no": null, "categories": "cs.PF cs.MM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our purpose in this paper is to characterize buffer starvations for streaming\nservices. The buffer is modeled as an M/M/1 queue, plus the consideration of\nbursty arrivals. When the buffer is empty, the service restarts after a certain\namount of packets are \\emph{prefetched}. With this goal, we propose two\napproaches to obtain the \\emph{exact distribution} of the number of buffer\nstarvations, one of which is based on \\emph{Ballot theorem}, and the other uses\nrecursive equations. The Ballot theorem approach gives an explicit result. We\nextend this approach to the scenario with a constant playback rate using\nT\\`{a}kacs Ballot theorem. The recursive approach, though not offering an\nexplicit result, can obtain the distribution of starvations with\nnon-independent and identically distributed (i.i.d.) arrival process in which\nan ON/OFF bursty arrival process is considered in this work. We further compute\nthe starvation probability as a function of the amount of prefetched packets\nfor a large number of files via a fluid analysis. Among many potential\napplications of starvation analysis, we show how to apply it to optimize the\nobjective quality of experience (QoE) of media streaming, by exploiting the\ntradeoff between startup/rebuffering delay and starvations.\n", "versions": [{"version": "v1", "created": "Sun, 31 Jul 2011 16:10:57 GMT"}, {"version": "v2", "created": "Sun, 15 Jan 2012 21:21:15 GMT"}, {"version": "v3", "created": "Mon, 17 Dec 2012 11:01:57 GMT"}, {"version": "v4", "created": "Tue, 6 Aug 2013 14:19:54 GMT"}, {"version": "v5", "created": "Fri, 29 Nov 2013 10:50:10 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Xu", "Yuedong", ""], ["Altman", "Eitan", ""], ["El-Azouzi", "Rachid", ""], ["Haddad", "Majed", ""], ["Elayoubi", "Salaheddine", ""], ["Jimenez", "Tania", ""]]}, {"id": "1108.1378", "submitter": "Anis Ismail", "authors": "Anis Ismail, Mohamed Quafafou, Nicolas Durand and Mohammad Hajjar", "title": "An Efficient Architecture for Information Retrieval in P2P Context Using\n  Hypergraph", "comments": "2o pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer-to-peer (P2P) Data-sharing systems now generate a significant portion of\nInternet traffic. P2P systems have emerged as an accepted way to share enormous\nvolumes of data. Needs for widely distributed information systems supporting\nvirtual organizations have given rise to a new category of P2P systems called\nschema-based. In such systems each peer is a database management system in\nitself, ex-posing its own schema. In such a setting, the main objective is the\nefficient search across peer databases by processing each incoming query\nwithout overly consuming bandwidth. The usability of these systems depends on\nsuccessful techniques to find and retrieve data; however, efficient and\neffective routing of content-based queries is an emerging problem in P2P\nnetworks. This work was attended as an attempt to motivate the use of mining\nalgorithms in the P2P context may improve the significantly the efficiency of\nsuch methods. Our proposed method based respectively on combination of\nclustering with hypergraphs. We use ECCLAT to build approximate clustering and\ndiscovering meaningful clusters with slight overlapping. We use an algorithm\nMTMINER to extract all minimal transversals of a hypergraph (clusters) for\nquery routing. The set of clusters improves the robustness in queries routing\nmechanism and scalability in P2P Network. We compare the performance of our\nmethod with the baseline one considering the queries routing problem. Our\nexperimental results prove that our proposed methods generate impressive levels\nof performance and scalability with with respect to important criteria such as\nresponse time, precision and recall.\n", "versions": [{"version": "v1", "created": "Fri, 5 Aug 2011 18:26:33 GMT"}], "update_date": "2011-08-08", "authors_parsed": [["Ismail", "Anis", ""], ["Quafafou", "Mohamed", ""], ["Durand", "Nicolas", ""], ["Hajjar", "Mohammad", ""]]}, {"id": "1108.1554", "submitter": "Kui Wu", "authors": "Kui Wu, Yuming Jiang, Dimitri Marinakis", "title": "A Stochastic Calculus for Network Systems with Renewable Energy Sources", "comments": "10 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": "DCS342-IR", "categories": "cs.PF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the performance modeling and evaluation of network systems\npowered with renewable energy sources such as solar and wind energy. Such\nenergy sources largely depend on environmental conditions, which are hard to\npredict accurately. As such, it may only make sense to require the network\nsystems to support a soft quality of service (QoS) guarantee, i.e., to\nguarantee a service requirement with a certain high probability. In this paper,\nwe intend to build a solid mathematical foundation to help better understand\nthe stochastic energy constraint and the inherent correlation between QoS and\nthe uncertain energy supply. We utilize a calculus approach to model the\ncumulative amount of charged energy and the cumulative amount of consumed\nenergy. We derive upper and lower bounds on the remaining energy level based on\na stochastic energy charging rate and a stochastic energy discharging rate. By\nbuilding the bridge between energy consumption and task execution (i.e.,\nservice), we study the QoS guarantee under the constraint of uncertain energy\nsources. We further show how performance bounds can be improved if some strong\nassumptions can be made.\n", "versions": [{"version": "v1", "created": "Sun, 7 Aug 2011 16:52:18 GMT"}], "update_date": "2011-08-09", "authors_parsed": [["Wu", "Kui", ""], ["Jiang", "Yuming", ""], ["Marinakis", "Dimitri", ""]]}, {"id": "1108.4466", "submitter": "EPTCS", "authors": "Flavio Corradini (University of Camerino), Maria Rita Di Berardini\n  (University of Camerino), Walter Vogler (University of Augsburg)", "title": "Read Operators and their Expressiveness in Process Algebras", "comments": "In Proceedings EXPRESS 2011, arXiv:1108.4077", "journal-ref": "EPTCS 64, 2011, pp. 31-43", "doi": "10.4204/EPTCS.64.3", "report-no": null, "categories": "cs.LO cs.DC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study two different ways to enhance PAFAS, a process algebra for modelling\nasynchronous timed concurrent systems, with non-blocking reading actions. We\nfirst add reading in the form of a read-action prefix operator. This operator\nis very flexible, but its somewhat complex semantics requires two types of\ntransition relations. We also present a read-set prefix operator with a simpler\nsemantics, but with syntactic restrictions. We discuss the expressiveness of\nread prefixes; in particular, we compare them to read-arcs in Petri nets and\njustify the simple semantics of the second variant by showing that its\nprocesses can be translated into processes of the first with timed-bisimilar\nbehaviour. It is still an open problem whether the first algebra is more\nexpressive than the second; we give a number of laws that are interesting in\ntheir own right, and can help to find a backward translation.\n", "versions": [{"version": "v1", "created": "Tue, 23 Aug 2011 01:23:16 GMT"}], "update_date": "2011-08-24", "authors_parsed": [["Corradini", "Flavio", "", "University of Camerino"], ["Di Berardini", "Maria Rita", "", "University of Camerino"], ["Vogler", "Walter", "", "University of Augsburg"]]}, {"id": "1108.5356", "submitter": "Nicholas Pippenger", "authors": "Patrick Eschenfeldt, Ben Gross and Nicholas Pippenger", "title": "Analysis of an M/M/1 Queue Using Fixed Order of Search for Arrivals and\n  Service", "comments": "i+9 pp", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze an M/M/1 queue with a service discipline in which customers, upon\narriving when the server is busy, search a sequence of stations for a vacant\nstation at which to wait, and in which the server, upon becoming free when one\nor more customers are waiting, searches the stations in the same order for a\nstation occupied by a customer to serve. We show how to find complete\nasymptotic expansions for all the moments of the waiting time in the heavy\ntraffic limit. We show in particular that the variance of the waiting time for\nthis discipline is more similar to that of last-come-first-served (which has a\npole of order three as the arrival rate approaches the service rate) than that\nof first-come-first-served (which has pole of order two).\n", "versions": [{"version": "v1", "created": "Fri, 26 Aug 2011 17:24:38 GMT"}], "update_date": "2011-08-29", "authors_parsed": [["Eschenfeldt", "Patrick", ""], ["Gross", "Ben", ""], ["Pippenger", "Nicholas", ""]]}]