[{"id": "1109.0601", "submitter": "Serge Kernbach", "authors": "S. Kornienko, O. Kornienko, P. Levi", "title": "Application of distributed constraint satisfaction problem to the\n  agent-based planning in manufacturing systems", "comments": null, "journal-ref": "Proceedings of the International Scientific Congress \"Intelligent\n  Systems (IEEE AIS'03)\" and \"Intelligent CAD's (CAD-2003)\", p.124-140,\n  Divnomorsk, Russia, 2003", "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, a globalization of national markets requires developing flexible\nand demand-driven production systems. Agent-based technology, being\ndistributed, flexible and autonomous is expected to provide a short-time\nreaction to disturbances and sudden changes of environment and allows\nsatisfying the mentioned requirements. The distributed constraint satisfaction\napproach underlying the suggested method is described by a modified Petri\nnetwork providing both the conceptual notions and main details of\nimplementation.\n", "versions": [{"version": "v1", "created": "Sat, 3 Sep 2011 07:43:09 GMT"}], "update_date": "2011-09-06", "authors_parsed": [["Kornienko", "S.", ""], ["Kornienko", "O.", ""], ["Levi", "P.", ""]]}, {"id": "1109.1093", "submitter": "Martin Aruldoss Mr", "authors": "A. Martin, T. Miranda Lakshmi, J. Madhusudanan", "title": "Multi Agent Communication System for Online Auction with Decision\n  Support System by JADE and TRACE", "comments": "Multi-Agents, Agents communication, intelligent auction agents,\n  Decision support system, JADE, TRACE", "journal-ref": "Journal of Convergence Information Technology Volume 4, Number 2,\n  June 2009, 154-163", "doi": "10.4156/jcit.vol4.issue2.martin", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The success of online auctions has given buyers access to greater product\ndiversity with potentially lower prices. It has provided sellers with access to\nlarge numbers of potential buyers and reduced transaction costs by enabling\nauctions to take place without regard to time or place. However it is difficult\nto spend more time period with system and closely monitor the auction until\nauction participant wins the bid or closing of the auction. Determining which\nitems to bid on or what may be the recommended bid and when to bid it are\ndifficult questions to answer for online auction participants. The multi agent\nauction advisor system JADE and TRACE, which is connected with decision support\nsystem, gives the recommended bid to buyers for online auctions. The auction\nadvisor system relies on intelligent agents both for the retrieval of relevant\nauction data and for the processing of that data to enable meaningful\nrecommendations, statistical reports and market prediction report to be made to\nauction participants.\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2011 07:22:18 GMT"}], "update_date": "2011-09-07", "authors_parsed": [["Martin", "A.", ""], ["Lakshmi", "T. Miranda", ""], ["Madhusudanan", "J.", ""]]}, {"id": "1109.1214", "submitter": "Minh {\\Dj}\\u{a}ng Do\\~an", "authors": "Minh Dang Doan, Tam\\'as Keviczky, and Bart De Schutter", "title": "A distributed optimization-based approach for hierarchical model\n  predictive control of large-scale systems with coupled dynamics and\n  constraints", "comments": "This is the extended version of our paper at the 50th IEEE Conference\n  on Decision and Control and European Control Conference, Orlando, Florida,\n  Dec. 2011. In this version the proofs are provided", "journal-ref": null, "doi": null, "report-no": "Tech. rep. 11-039, Delft Center for Systems and Control, Delft\n  University of Technology, Delft, The Netherlands", "categories": "math.OC cs.MA cs.SY", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  We present a hierarchical model predictive control approach for large-scale\nsystems based on dual decomposition. The proposed scheme allows coupling in\nboth dynamics and constraints between the subsystems and generates a primal\nfeasible solution within a finite number of iterations, using primal averaging\nand a constraint tightening approach. The primal update is performed in a\ndistributed way and does not require exact solutions, while the dual problem\nuses an approximate subgradient method. Stability of the scheme is established\nusing bounded suboptimality.\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2011 15:42:16 GMT"}, {"version": "v2", "created": "Wed, 7 Sep 2011 13:13:04 GMT"}], "update_date": "2011-11-10", "authors_parsed": [["Doan", "Minh Dang", ""], ["Keviczky", "Tamás", ""], ["De Schutter", "Bart", ""]]}, {"id": "1109.1409", "submitter": "Marc Pons Mr.", "authors": "M. Pons-Pons, P.A. Johnson, M. Rosas-Casals, B. Sureda, E. Jover", "title": "A georeferenced Agent-Based Model to analyze the climate change impacts\n  on the Andorra winter tourism", "comments": "24 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study presents a georeferenced agent-based model to analyze the climate\nchange impacts on the ski industry in Andorra and the effect of snowmaking as\nfuture adaptation strategy. The present study is the first attempt to analyze\nthe ski industry in the Pyrenees region and will contribute to a better\nunderstanding of the vulnerability of Andorran ski resorts and the suitability\nof snowmaking as potential adaptation strategy to climate change. The resulting\nmodel can be used as a planning support tool to help local stakeholders\nunderstand the vulnerability and potential impacts of climate change. This\nmodel can be used in the decision-making process of designing and developing\nappropriate sustainable adaptation strategies to future climate variability.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 10:17:58 GMT"}, {"version": "v2", "created": "Fri, 27 Apr 2012 12:39:26 GMT"}], "update_date": "2012-04-30", "authors_parsed": [["Pons-Pons", "M.", ""], ["Johnson", "P. A.", ""], ["Rosas-Casals", "M.", ""], ["Sureda", "B.", ""], ["Jover", "E.", ""]]}, {"id": "1109.1528", "submitter": "Ardeshir Kianercy", "authors": "Ardeshir Kianercy, Aram Galstyan", "title": "Dynamics of Boltzmann Q-Learning in Two-Player Two-Action Games", "comments": "10 pages, 12 figures. Version 2: added more extensive discussion of\n  asymmetric equilibria; clarified conditions for continuous/discontinuous\n  bifurcations in coordination/anti-coordination games", "journal-ref": "Physical Review E, vol.85, 4, 041145, 2012", "doi": "10.1103/PhysRevE.85.041145", "report-no": null, "categories": "cs.GT cs.LG cs.MA nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the dynamics of Q-learning in two-player two-action games with a\nBoltzmann exploration mechanism. For any non-zero exploration rate the dynamics\nis dissipative, which guarantees that agent strategies converge to rest points\nthat are generally different from the game's Nash Equlibria (NE). We provide a\ncomprehensive characterization of the rest point structure for different games,\nand examine the sensitivity of this structure with respect to the noise due to\nexploration. Our results indicate that for a class of games with multiple NE\nthe asymptotic behavior of learning dynamics can undergo drastic changes at\ncritical exploration rates. Furthermore, we demonstrate that for certain games\nwith a single NE, it is possible to have additional rest points (not\ncorresponding to any NE) that persist for a finite range of the exploration\nrates and disappear when the exploration rates of both players tend to zero.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 18:21:39 GMT"}, {"version": "v2", "created": "Thu, 8 Sep 2011 02:11:08 GMT"}, {"version": "v3", "created": "Thu, 1 Mar 2012 22:51:48 GMT"}], "update_date": "2013-07-18", "authors_parsed": [["Kianercy", "Ardeshir", ""], ["Galstyan", "Aram", ""]]}, {"id": "1109.1879", "submitter": "Muhammad Yasir Malik", "authors": "Tae Qinghui, Muhammad Yasir Malik, Youngjee Hong, Jinwoo Park", "title": "A Real-time Localization System Using RFID for Visually Impaired", "comments": "9 pages, 5 figures, Presented at IEOM 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gadgets helping the disabled, especially blind that are in least\naccessibility of information, use acoustic methods that can cause stress to ear\nand infringe user's privacy. Even if some project uses embedded Radio Frequency\nIdentification (RFID) into the sidewalk for blind's free walking, the tag\nmemory design is not specified for buildings and road conditions. This paper\nsuggested allocation scheme of RFID tag referring to EPCglobal SGLN, tactile\nmethod for conveying information, and use of lithium battery as power source\nwith solar cells as an alternative. Results have shown independent mobility,\naccidents prevention, stress relief and satisfied factors in terms of cost and\nhuman usability.\n", "versions": [{"version": "v1", "created": "Fri, 9 Sep 2011 02:39:43 GMT"}], "update_date": "2011-09-12", "authors_parsed": [["Qinghui", "Tae", ""], ["Malik", "Muhammad Yasir", ""], ["Hong", "Youngjee", ""], ["Park", "Jinwoo", ""]]}, {"id": "1109.2129", "submitter": "P. E. Dunne", "authors": "P. E. Dunne", "title": "Extremal Behaviour in Multiagent Contract Negotiation", "comments": null, "journal-ref": "Journal Of Artificial Intelligence Research, Volume 23, pages\n  41-78, 2005", "doi": "10.1613/jair.1526", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine properties of a model of resource allocation in which several\nagents exchange resources in order to optimise their individual holdings. The\nschemes discussed relate to well-known negotiation protocols proposed in\nearlier work and we consider a number of alternative notions of rationality\ncovering both quantitative measures, e.g. cooperative and individual\nrationality and more qualitative forms, e.g. Pigou-Dalton transfers. While it\nis known that imposing particular rationality and structural restrictions may\nresult in some reallocations of the resource set becoming unrealisable, in this\npaper we address the issue of the number of restricted rational deals that may\nbe required to implement a particular reallocation when it is possible to do\nso. We construct examples showing that this number may be exponential (in the\nnumber of resources m), even when all of the agent utility functions are\nmonotonic. We further show that k agents may achieve in a single deal a\nreallocation requiring exponentially many rational deals if at most k-1 agents\ncan participate, this same reallocation being unrealisable by any sequences of\nrational deals in which at most k-2 agents are involved.\n", "versions": [{"version": "v1", "created": "Fri, 9 Sep 2011 20:21:45 GMT"}], "update_date": "2011-09-13", "authors_parsed": [["Dunne", "P. E.", ""]]}, {"id": "1109.2132", "submitter": "R. Nair", "authors": "R. Nair, M. Tambe", "title": "Hybrid BDI-POMDP Framework for Multiagent Teaming", "comments": null, "journal-ref": "Journal Of Artificial Intelligence Research, Volume 23, pages\n  367-420, 2005", "doi": "10.1613/jair.1549", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many current large-scale multiagent team implementations can be characterized\nas following the belief-desire-intention (BDI) paradigm, with explicit\nrepresentation of team plans. Despite their promise, current BDI team\napproaches lack tools for quantitative performance analysis under uncertainty.\nDistributed partially observable Markov decision problems (POMDPs) are well\nsuited for such analysis, but the complexity of finding optimal policies in\nsuch models is highly intractable. The key contribution of this article is a\nhybrid BDI-POMDP approach, where BDI team plans are exploited to improve POMDP\ntractability and POMDP analysis improves BDI team plan performance. Concretely,\nwe focus on role allocation, a fundamental problem in BDI teams: which agents\nto allocate to the different roles in the team. The article provides three key\ncontributions. First, we describe a role allocation technique that takes into\naccount future uncertainties in the domain; prior work in multiagent role\nallocation has failed to address such uncertainties. To that end, we introduce\nRMTDP (Role-based Markov Team Decision Problem), a new distributed POMDP model\nfor analysis of role allocations. Our technique gains in tractability by\nsignificantly curtailing RMTDP policy search; in particular, BDI team plans\nprovide incomplete RMTDP policies, and the RMTDP policy search fills the gaps\nin such incomplete policies by searching for the best role allocation. Our\nsecond key contribution is a novel decomposition technique to further improve\nRMTDP policy search efficiency. Even though limited to searching role\nallocations, there are still combinatorially many role allocations, and\nevaluating each in RMTDP to identify the best is extremely difficult. Our\ndecomposition technique exploits the structure in the BDI team plans to\nsignificantly prune the search space of role allocations. Our third key\ncontribution is a significantly faster policy evaluation algorithm suited for\nour BDI-POMDP hybrid approach. Finally, we also present experimental results\nfrom two domains: mission rehearsal simulation and RoboCupRescue disaster\nrescue simulation.\n", "versions": [{"version": "v1", "created": "Fri, 9 Sep 2011 20:23:28 GMT"}], "update_date": "2011-09-13", "authors_parsed": [["Nair", "R.", ""], ["Tambe", "M.", ""]]}, {"id": "1109.2135", "submitter": "P. Doshi", "authors": "P. Doshi, P. J. Gmytrasiewicz", "title": "A Framework for Sequential Planning in Multi-Agent Settings", "comments": null, "journal-ref": "Journal Of Artificial Intelligence Research, Volume 24, pages\n  49-79, 2005", "doi": "10.1613/jair.1579", "report-no": null, "categories": "cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper extends the framework of partially observable Markov decision\nprocesses (POMDPs) to multi-agent settings by incorporating the notion of agent\nmodels into the state space. Agents maintain beliefs over physical states of\nthe environment and over models of other agents, and they use Bayesian updates\nto maintain their beliefs over time. The solutions map belief states to\nactions. Models of other agents may include their belief states and are related\nto agent types considered in games of incomplete information. We express the\nagents autonomy by postulating that their models are not directly manipulable\nor observable by other agents. We show that important properties of POMDPs,\nsuch as convergence of value iteration, the rate of convergence, and piece-wise\nlinearity and convexity of the value functions carry over to our framework. Our\napproach complements a more traditional approach to interactive settings which\nuses Nash equilibria as a solution paradigm. We seek to avoid some of the\ndrawbacks of equilibria which may be non-unique and do not capture\noff-equilibrium behaviors. We do so at the cost of having to represent, process\nand continuously revise models of other agents. Since the agents beliefs may be\narbitrarily nested, the optimal solutions to decision making problems are only\nasymptotically computable. However, approximate belief updates and\napproximately optimal plans are computable. We illustrate our framework using a\nsimple application domain, and we show examples of belief updates and value\nfunctions.\n", "versions": [{"version": "v1", "created": "Fri, 9 Sep 2011 20:24:38 GMT"}], "update_date": "2011-09-13", "authors_parsed": [["Doshi", "P.", ""], ["Gmytrasiewicz", "P. J.", ""]]}, {"id": "1109.3702", "submitter": "Frank Schweitzer", "authors": "Mirko Birbaumer, Frank Schweitzer", "title": "Agent-Based Modeling of Intracellular Transport", "comments": null, "journal-ref": "European Physical Journal B vol. 82, no. 3-4 (2011) pp. 245-255", "doi": "10.1140/epjb/e2011-20283-x", "report-no": null, "categories": "q-bio.SC cs.MA nlin.PS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an agent-based model of the motion and pattern formation of\nvesicles. These intracellular particles can be found in four different modes of\n(undirected and directed) motion and can fuse with other vesicles. While the\nsize of vesicles follows a log-normal distribution that changes over time due\nto fusion processes, their spatial distribution gives rise to distinct\npatterns. Their occurrence depends on the concentration of proteins which are\nsynthesized based on the transcriptional activities of some genes. Hence,\ndifferences in these spatio-temporal vesicle patterns allow indirect\nconclusions about the (unknown) impact of these genes.\n  By means of agent-based computer simulations we are able to reproduce such\npatterns on real temporal and spatial scales. Our modeling approach is based on\nBrownian agents with an internal degree of freedom, $\\theta$, that represents\nthe different modes of motion. Conditions inside the cell are modeled by an\neffective potential that differs for agents dependent on their value $\\theta$.\nAgent's motion in this effective potential is modeled by an overdampted\nLangevin equation, changes of $\\theta$ are modeled as stochastic transitions\nwith values obtained from experiments, and fusion events are modeled as\nspace-dependent stochastic transitions. Our results for the spatio-temporal\nvesicle patterns can be used for a statistical comparison with experiments. We\nalso derive hypotheses of how the silencing of some genes may affect the\nintracellular transport, and point to generalizations of the model.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2011 19:43:09 GMT"}], "update_date": "2011-09-19", "authors_parsed": [["Birbaumer", "Mirko", ""], ["Schweitzer", "Frank", ""]]}, {"id": "1109.3948", "submitter": "Pavel Chebotarev", "authors": "R. P. Agaev and P. Yu. Chebotarev", "title": "The Projection Method for Reaching Consensus and the Regularized Power\n  Limit of a Stochastic Matrix", "comments": "19 pages, 2 figures", "journal-ref": "Automation and Remote Control, 2011, vol.72, No.12, P.2458-2476", "doi": "10.1134/S0005117911120034", "report-no": null, "categories": "cs.MA cs.NI cs.SY math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the coordination/consensus problem for multi-agent systems, a well-known\ncondition of achieving consensus is the presence of a spanning arborescence in\nthe communication digraph. The paper deals with the discrete consensus problem\nin the case where this condition is not satisfied. A characterization of the\nsubspace $T_P$ of initial opinions (where $P$ is the influence matrix) that\n\\emph{ensure} consensus in the DeGroot model is given. We propose a method of\ncoordination that consists of: (1) the transformation of the vector of initial\nopinions into a vector belonging to $T_P$ by orthogonal projection and (2)\nsubsequent iterations of the transformation $P.$ The properties of this method\nare studied. It is shown that for any non-periodic stochastic matrix $P,$ the\nresulting matrix of the orthogonal projection method can be treated as a\nregularized power limit of $P.$\n", "versions": [{"version": "v1", "created": "Mon, 19 Sep 2011 06:27:35 GMT"}, {"version": "v2", "created": "Mon, 6 Feb 2012 09:21:16 GMT"}], "update_date": "2012-02-07", "authors_parsed": [["Agaev", "R. P.", ""], ["Chebotarev", "P. Yu.", ""]]}, {"id": "1109.5712", "submitter": "P. S. Dutta", "authors": "P. S. Dutta, N. R. Jennings, L. Moreau", "title": "Cooperative Information Sharing to Improve Distributed Learning in\n  Multi-Agent Systems", "comments": null, "journal-ref": "Journal Of Artificial Intelligence Research, Volume 24, pages\n  407-463, 2005", "doi": "10.1613/jair.1735", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Effective coordination of agents actions in partially-observable domains is a\nmajor challenge of multi-agent systems research. To address this, many\nresearchers have developed techniques that allow the agents to make decisions\nbased on estimates of the states and actions of other agents that are typically\nlearnt using some form of machine learning algorithm. Nevertheless, many of\nthese approaches fail to provide an actual means by which the necessary\ninformation is made available so that the estimates can be learnt. To this end,\nwe argue that cooperative communication of state information between agents is\none such mechanism. However, in a dynamically changing environment, the\naccuracy and timeliness of this communicated information determine the fidelity\nof the learned estimates and the usefulness of the actions taken based on\nthese. Given this, we propose a novel information-sharing protocol,\npost-task-completion sharing, for the distribution of state information. We\nthen show, through a formal analysis, the improvement in the quality of\nestimates produced using our strategy over the widely used protocol of sharing\ninformation between nearest neighbours. Moreover, communication heuristics\ndesigned around our information-sharing principle are subjected to empirical\nevaluation along with other benchmark strategies (including Littmans Q-routing\nand Stones TPOT-RL) in a simulated call-routing application. These studies,\nconducted across a range of environmental settings, show that, compared to the\ndifferent benchmarks used, our strategy generates an improvement of up to 60%\nin the call connection rate; of more than 1000% in the ability to connect\nlong-distance calls; and incurs as low as 0.25 of the message overhead.\n", "versions": [{"version": "v1", "created": "Mon, 26 Sep 2011 20:21:57 GMT"}], "update_date": "2011-09-28", "authors_parsed": [["Dutta", "P. S.", ""], ["Jennings", "N. R.", ""], ["Moreau", "L.", ""]]}, {"id": "1109.6340", "submitter": "U. Endriss", "authors": "U. Endriss, N. Maudet, F. Sadri, F. Toni", "title": "Negotiating Socially Optimal Allocations of Resources", "comments": null, "journal-ref": "Journal Of Artificial Intelligence Research, Volume 25, pages\n  315-348, 2006", "doi": "10.1613/jair.1870", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A multiagent system may be thought of as an artificial society of autonomous\nsoftware agents and we can apply concepts borrowed from welfare economics and\nsocial choice theory to assess the social welfare of such an agent society. In\nthis paper, we study an abstract negotiation framework where agents can agree\non multilateral deals to exchange bundles of indivisible resources. We then\nanalyse how these deals affect social welfare for different instances of the\nbasic framework and different interpretations of the concept of social welfare\nitself. In particular, we show how certain classes of deals are both sufficient\nand necessary to guarantee that a socially optimal allocation of resources will\nbe reached eventually.\n", "versions": [{"version": "v1", "created": "Wed, 28 Sep 2011 20:15:30 GMT"}], "update_date": "2011-09-30", "authors_parsed": [["Endriss", "U.", ""], ["Maudet", "N.", ""], ["Sadri", "F.", ""], ["Toni", "F.", ""]]}, {"id": "1109.6838", "submitter": "Sarvesh Nikumbh", "authors": "Sarvesh Nikumbh, Joeprakash Nathaman and Rahul Vartak", "title": "Distributed Air Traffic Control : A Human Safety Perspective", "comments": "Extended Abstract, 3 pages, Accepted at IBM Collaborative Academia\n  Research Exchange (I-CARE)-2011, uses ACM-Proceeding style file", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The issues in air traffic control have so far been addressed with the intent\nto improve resource utilization and achieve an optimized solution with respect\nto fuel comsumption of aircrafts, efficient usage of the available airspace\nwith minimal congestion related losses under various dynamic constraints. So\nthe focus has almost always been more on smarter management of traffic to\nincrease profits while human safety, though achieved in the process, we\nbelieve, has remained less seriously attended. This has become all the more\nimportant given that we have overburdened and overstressed air traffic\ncontrollers managing hundreds of airports and thousands of aircrafts per day.\n  We propose a multiagent system based distributed approach to handle air\ntraffic ensuring complete human (passenger) safety without removing any humans\n(ground controllers) from the loop thereby also retaining the earlier\nadvantages in the new solution. The detailed design of the agent system, which\nwill be easily interfacable with the existing environment, is described. Based\non our initial findings from simulations, we strongly believe the system to be\ncapable of handling the nuances involved, to be extendable and customizable at\nany later point in time.\n", "versions": [{"version": "v1", "created": "Fri, 30 Sep 2011 14:42:14 GMT"}], "update_date": "2011-10-03", "authors_parsed": [["Nikumbh", "Sarvesh", ""], ["Nathaman", "Joeprakash", ""], ["Vartak", "Rahul", ""]]}]