[{"id": "1812.00080", "submitter": "Ionut-Gabriel Farcas", "authors": "Ionut-Gabriel Farcas, Tobias G\\\"orler, Hans-Joachim Bungartz, Frank\n  Jenko and Tobias Neckel", "title": "Sensitivity-driven adaptive sparse stochastic approximations in plasma\n  microinstability analysis", "comments": "34 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.comp-ph cs.CE cs.NA math.NA stat.AP stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantifying uncertainty in predictive simulations for real-world problems is\nof paramount importance - and far from trivial, mainly due to the large number\nof stochastic parameters and significant computational requirements. Adaptive\nsparse grid approximations are an established approach to overcome these\nchallenges. However, standard adaptivity is based on global information, thus\nproperties such as lower intrinsic stochastic dimensionality or anisotropic\ncoupling of the input directions, which are common in practical applications,\nare not fully exploited. We propose a novel structure-exploiting\ndimension-adaptive sparse grid approximation methodology using Sobol'\ndecompositions in each subspace to introduce a sensitivity scoring system to\ndrive the adaptive process. By employing local sensitivity information, we\nexplore and exploit the anisotropic coupling of the stochastic inputs as well\nas the lower intrinsic stochastic dimensionality. The proposed approach is\ngeneric, i.e., it can be formulated in terms of arbitrary approximation\noperators and point sets. In particular, we consider sparse grid interpolation\nand pseudo-spectral projection constructed on (L)-Leja sequences. The power and\nusefulness of the proposed method is demonstrated by applying it to the\nanalysis of gyrokinetic microinstabilities in fusion plasmas, one of the key\nscientific problems in plasma physics and fusion research. In this context, it\nis shown that a 12D parameter space can be scanned very efficiently, gaining\nmore than an order of magnitude in computational cost over the standard\nadaptive approach. Moreover, it allows for the uncertainty propagation and\nsensitivity analysis in higher-dimensional plasma microturbulence problems,\nwhich would be almost impossible to tackle with standard screening approaches.\n", "versions": [{"version": "v1", "created": "Fri, 30 Nov 2018 22:41:34 GMT"}, {"version": "v2", "created": "Thu, 21 Nov 2019 17:28:09 GMT"}], "update_date": "2019-11-25", "authors_parsed": [["Farcas", "Ionut-Gabriel", ""], ["Görler", "Tobias", ""], ["Bungartz", "Hans-Joachim", ""], ["Jenko", "Frank", ""], ["Neckel", "Tobias", ""]]}, {"id": "1812.02587", "submitter": "Martin Pfaller", "authors": "Julia M. Hoermann, Martin R. Pfaller, Linda Avena, Crist\\'obal\n  Bertoglio, Wolfgang A. Wall", "title": "Automatic Mapping of Atrial Fiber Orientations for Patient-Specific\n  Modeling of Cardiac Electromechanics using Image-Registration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.med-ph cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Knowledge of appropriate local fiber architecture is necessary to simulate\npatient-specific electromechanics in the human heart. However, it is not yet\npossible to reliably measure in-vivo fiber directions, especially in human\natria. Thus, we present a method which defines the fiber architecture in\narbitrarily shaped atria using image registration and reorientation methods\nbased on atlas atria with fibers predefined from detailed histological\nobservations. Thereby, it is possible to generate detailed fiber families in\nevery new patient-specific geometry in an automated, time-efficient process. We\ndemonstrate the good performance of the image registration and fiber definition\non ten differently shaped human atria. Additionally, we show that\ncharacteristics of the electrophysiological activation pattern which appear in\nthe atlas atria also appear in the patients' atria. We arrive at analogous\nconclusions for coupled electro-mechano-hemodynamical computations.\n", "versions": [{"version": "v1", "created": "Wed, 5 Dec 2018 14:02:52 GMT"}], "update_date": "2018-12-07", "authors_parsed": [["Hoermann", "Julia M.", ""], ["Pfaller", "Martin R.", ""], ["Avena", "Linda", ""], ["Bertoglio", "Cristóbal", ""], ["Wall", "Wolfgang A.", ""]]}, {"id": "1812.02809", "submitter": "Mathias Berger", "authors": "Mathias Berger, David Radu, Raphael Fonteneau, Robin Henry, Mevludin\n  Glavic, Xavier Fettweis, Marc Le Du, Patrick Panciatici, Lucian Balea, Damien\n  Ernst", "title": "Critical Time Windows for Renewable Resource Complementarity Assessment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a systematic framework to assess the complementarity of\nrenewable resources over arbitrary geographical scopes and temporal scales\nwhich is particularly well-suited to exploit very large data sets of\nclimatological data. The concept of critical time windows is introduced, and a\nspatio-temporal criticality indicator is proposed, consisting in a parametrised\nfamily of scalar indicators quantifying the complementarity between renewable\nresources in both space and time. The criticality indicator is leveraged to\ndevise a family of optimisation problems identifying sets of locations with\nmaximum complementarity under arbitrary geographical deployment constraints.\nThe applicability of the framework is shown in a case study investigating the\ncomplementarity between the wind regimes in continental western Europe and\nsouthern Greenland, and its usefulness in a power system planning context is\ndemonstrated. Besides showing that the occurrence of low wind power production\nevents can be significantly reduced on a regional scale by exploiting diversity\nin local wind patterns, results highlight the fact that aggregating wind power\nproduction sites located on different continents may result in a lower\noccurrence of system-wide low wind power production events and indicate\npotential benefits of intercontinental electrical interconnections.\n", "versions": [{"version": "v1", "created": "Wed, 5 Dec 2018 17:16:59 GMT"}], "update_date": "2018-12-10", "authors_parsed": [["Berger", "Mathias", ""], ["Radu", "David", ""], ["Fonteneau", "Raphael", ""], ["Henry", "Robin", ""], ["Glavic", "Mevludin", ""], ["Fettweis", "Xavier", ""], ["Du", "Marc Le", ""], ["Panciatici", "Patrick", ""], ["Balea", "Lucian", ""], ["Ernst", "Damien", ""]]}, {"id": "1812.02827", "submitter": "David Radu", "authors": "David Radu, Mathias Berger, Rapha\\\"el Fonteneau, Simon Hardy, Xavier\n  Fettweis, Marc Le Du, Patrick Panciatici, Lucian Balea, Damien Ernst", "title": "Complementarity Assessment of South Greenland Katabatic Flows and West\n  Europe Wind Regimes", "comments": "Published in Elsevier Energy", "journal-ref": null, "doi": "10.1016/j.energy.2019.03.048", "report-no": null, "categories": "physics.ao-ph cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current global environmental challenges require vigorous and diverse actions\nin the energy sector. One solution that has recently attracted interest\nconsists in harnessing high-quality variable renewable energy resources in\nremote locations, while using transmission links to transport the power to end\nusers. In this context, a comparison of western European and Greenland wind\nregimes is proposed. By leveraging a regional atmospheric model specifically\ndesigned to accurately capture polar phenomena, local climatic features of\nsouthern Greenland are identified to be particularly conducive to extensive\nrenewable electricity generation from wind. A methodology to assess how\nconnecting remote locations to major demand centres would benefit the latter\nfrom a resource availability standpoint is introduced and applied to the\naforementioned Europe-Greenland case study, showing superior and complementary\nwind generation potential in the considered region of Greenland with respect to\nselected European sites.\n", "versions": [{"version": "v1", "created": "Wed, 5 Dec 2018 17:14:24 GMT"}, {"version": "v2", "created": "Tue, 2 Apr 2019 16:36:20 GMT"}], "update_date": "2019-04-03", "authors_parsed": [["Radu", "David", ""], ["Berger", "Mathias", ""], ["Fonteneau", "Raphaël", ""], ["Hardy", "Simon", ""], ["Fettweis", "Xavier", ""], ["Du", "Marc Le", ""], ["Panciatici", "Patrick", ""], ["Balea", "Lucian", ""], ["Ernst", "Damien", ""]]}, {"id": "1812.02987", "submitter": "Kwangho Kim", "authors": "Kwangho Kim, Jisu Kim, Alessandro Rinaldo", "title": "Time Series Featurization via Topological Data Analysis", "comments": "28 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.CE cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a novel algorithm for feature extraction in time series data by\nleveraging tools from topological data analysis. Our algorithm provides a\nsimple, efficient way to successfully harness topological features of the\nattractor of the underlying dynamical system for an observed time series. The\nproposed methodology relies on the persistent landscapes and silhouette of the\nRips complex obtained after a de-noising step based on principal components\napplied to a time-delayed embedding of a noisy, discrete time series sample. We\nanalyze the stability properties of the proposed approach and show that the\nresulting TDA-based features are robust to sampling noise. Experiments on\nsynthetic and real-world data demonstrate the effectiveness of our approach. We\nexpect our method to provide new insights on feature extraction from granular,\nnoisy time series data.\n", "versions": [{"version": "v1", "created": "Fri, 7 Dec 2018 11:49:00 GMT"}, {"version": "v2", "created": "Tue, 4 Jun 2019 02:26:42 GMT"}], "update_date": "2019-06-05", "authors_parsed": [["Kim", "Kwangho", ""], ["Kim", "Jisu", ""], ["Rinaldo", "Alessandro", ""]]}, {"id": "1812.03424", "submitter": "Kalyana Babu Nakshatrala", "authors": "A. Rezaei, K. B. Nakshatrala, F. Siddiqui, B. Dindoruk and M. Soliman", "title": "A global sensitivity analysis and reduced order models for\n  hydraulically-fractured horizontal wells", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a systematic global sensitivity analysis using the Sobol method\nwhich can be utilized to rank the variables that affect two quantity of\ninterests -- pore pressure depletion and stress change -- around a\nhydraulically-fractured horizontal well based on their degree of importance.\nThese variables include rock properties and stimulation design variables. A\nfully-coupled poroelastic hydraulic fracture model is used to account for pore\npressure and stress changes due to production. To ease the computational cost\nof a simulator, we also provide reduced order models (ROMs), which can be used\nto replace the complex numerical model with a rather simple analytical model,\nfor calculating the pore pressure and stresses at different locations around\nhydraulic fractures. The main findings of this research are: (i) mobility,\nproduction pressure, and fracture half-length are the main contributors to the\nchanges in the quantities of interest. The percentage of the contribution of\neach parameter depends on the location with respect to pre-existing hydraulic\nfractures and the quantity of interest. (ii) As the time progresses, the effect\nof mobility decreases and the effect of production pressure increases. (iii)\nThese two variables are also dominant for horizontal stresses at large\ndistances from hydraulic fractures. (iv) At zones close to hydraulic fracture\ntips or inside the spacing area, other parameters such as fracture spacing and\nhalf-length are the dominant factors that affect the minimum horizontal stress.\nThe results of this study will provide useful guidelines for the stimulation\ndesign of legacy wells and secondary operations such as refracturing and infill\ndrilling.\n", "versions": [{"version": "v1", "created": "Sun, 9 Dec 2018 04:24:57 GMT"}], "update_date": "2018-12-11", "authors_parsed": [["Rezaei", "A.", ""], ["Nakshatrala", "K. B.", ""], ["Siddiqui", "F.", ""], ["Dindoruk", "B.", ""], ["Soliman", "M.", ""]]}, {"id": "1812.03952", "submitter": "Hui Liu Mr", "authors": "Hui Liu, Zhangxin Chen", "title": "A Scalable Thermal Reservoir Simulator for Giant Models on Parallel\n  Computers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces the model, numerical methods, algorithms and parallel\nimplementation of a thermal reservoir simulator that designed for numerical\nsimulations of thermal reservoir with multiple components in three dimensional\ndomain using distributed-memory parallel computers. Its full mathematical model\nis introduced with correlations for important properties and well modeling.\nVarious well constraints, such as fixed bottom hole pressure, fixed oil, water,\ngas and liquid rates, constant heat transfer model, convective heat transfer\nmodel, heater model (temperature control, rate control, dual rate/temperature\ncontrol), and subcool (steam trap), are introduced in details, including their\nmathematical models and methods. Efficient numerical methods and parallel\ncomputing technologies are presented. The simulator is designed for giant\nmodels with billions or even trillions of grid blocks using hundreds of\nthousands of CPUs. Numerical experiments show that our results match commercial\nsimulators, which confirms the correctness of our methods and implementations.\nSAGD simulation with 15106 well pairs is also presented to study the\neffectiveness of our numerical methods. Scalability testings demonstrate that\nour simulator can handle giant models with over 200 billion grid blocks using\n100,800 CPU cores and the simulator has good scalability.\n", "versions": [{"version": "v1", "created": "Mon, 10 Dec 2018 18:08:14 GMT"}, {"version": "v10", "created": "Sun, 22 Sep 2019 14:27:55 GMT"}, {"version": "v11", "created": "Wed, 9 Oct 2019 18:42:11 GMT"}, {"version": "v2", "created": "Wed, 12 Dec 2018 05:34:30 GMT"}, {"version": "v3", "created": "Sat, 29 Dec 2018 02:42:15 GMT"}, {"version": "v4", "created": "Fri, 25 Jan 2019 16:47:48 GMT"}, {"version": "v5", "created": "Tue, 29 Jan 2019 17:17:04 GMT"}, {"version": "v6", "created": "Thu, 14 Feb 2019 05:41:35 GMT"}, {"version": "v7", "created": "Fri, 15 Mar 2019 17:31:01 GMT"}, {"version": "v8", "created": "Fri, 29 Mar 2019 17:49:23 GMT"}, {"version": "v9", "created": "Sat, 10 Aug 2019 23:52:31 GMT"}], "update_date": "2019-10-11", "authors_parsed": [["Liu", "Hui", ""], ["Chen", "Zhangxin", ""]]}, {"id": "1812.04789", "submitter": "Matteo Franciolini", "authors": "Matteo Franciolini and Krzysztof Fidkowski and Andrea Crivellini", "title": "Efficient discontinuous Galerkin implementations and preconditioners for\n  implicit unsteady compressible flow simulations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.comp-ph cs.CE cs.NA physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work presents and compares efficient implementations of high-order\ndiscontinuous Galerkin methods: a modal matrix-free discontinuous Galerkin (DG)\nmethod, a hybridizable discontinuous Galerkin (HDG) method, and a primal\nformulation of HDG, applied to the implicit solution of unsteady compressible\nflows. The matrix-free implementation allows for a reduction of the memory\nfootprint of the solver when dealing with implicit time-accurate\ndiscretizations. HDG reduces the number of globally-coupled degrees of freedom\nrelative to DG, at high order, by statically condensing element-interior\ndegrees of freedom from the system in favor of face unknowns. The primal\nformulation further reduces the element-interior degrees of freedom by\neliminating the gradient as a separate unknown. This paper introduces a\n$p$-multigrid preconditioner implementation for these discretizations and\npresents results for various flow problems. Benefits of the $p$-multigrid\nstrategy relative to simpler, less expensive, preconditioners are observed for\nstiff systems, such as those arising from low-Mach number flows at high-order\napproximation. The $p$-multigrid preconditioner also shows excellent\nscalability for parallel computations. Additional savings in both speed and\nmemory occur with a matrix-free/reduced version of the preconditioner.\n", "versions": [{"version": "v1", "created": "Wed, 12 Dec 2018 03:05:01 GMT"}], "update_date": "2018-12-14", "authors_parsed": [["Franciolini", "Matteo", ""], ["Fidkowski", "Krzysztof", ""], ["Crivellini", "Andrea", ""]]}, {"id": "1812.05087", "submitter": "Ali Rezaei", "authors": "Ali Rezaei, Fahd Siddiqui, Giorgio Bornia, Mohamed Y. Soliman", "title": "Application of the Fast Multipole Fully Coupled Poroelastic Displacement\n  Discontinuity Method to Hydraulic Fracturing Problems", "comments": null, "journal-ref": null, "doi": "10.1016/j.jcp.2019.108955", "report-no": null, "categories": "cs.NA cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study, a fast multipole method (FMM) is used to decrease the\ncomputational time of a fully-coupled poroelastic hydraulic fracture model with\na controllable effect on its accuracy. The hydraulic fracture model is based on\nthe poroelastic formulation of the displacement discontinuity method (DDM)\nwhich is a special formulation of the boundary element method (BEM). DDM is a\npowerful and efficient method for problems involving fractures. However, this\nmethod becomes slow as the number of temporal, or spatial elements increases,\nor necessary details such as poroelasticity, that makes the solution\nhistory-dependent, are added to the model. FMM is a technique to expedite\nmatrix-vector multiplications within a controllable error without forming the\nmatrix explicitly. Fully-coupled poroelastic formulation of DDM involves the\nmultiplication of a dense matrix with a vector in several places. A crucial\nmodification to DDM is suggested in two places in the algorithm to leverage the\nspeed efficiency of FMM for carrying out these multiplications. The first\nmodification is in the time-marching scheme, which accounts for the solution of\nprevious time steps to compute the current time step. The second modification\nis in the generalized minimal residual method (GMRES) to iteratively solve for\nthe problem unknowns. Several examples are provided to show the efficiency of\nthe proposed approach in problems with large degrees of freedom (in time and\nspace). Examples include hydraulic fracturing of a horizontal well and randomly\ndistributed pressurized fractures at different orientations with respect to\nhorizontal stresses. The results are compared to the conventional DDM in terms\nof computational processing time and accuracy. Accordingly, the proposed\nalgorithm may be used for fracture propagation studies while substantially\nreducing the processing time with a controllable error.\n", "versions": [{"version": "v1", "created": "Wed, 12 Dec 2018 18:51:23 GMT"}, {"version": "v2", "created": "Tue, 19 Mar 2019 18:24:14 GMT"}], "update_date": "2019-10-23", "authors_parsed": [["Rezaei", "Ali", ""], ["Siddiqui", "Fahd", ""], ["Bornia", "Giorgio", ""], ["Soliman", "Mohamed Y.", ""]]}, {"id": "1812.05223", "submitter": "Stella Brach", "authors": "Stella Brach and Erwan Tann\\'e and Blaise Bourdin and Kaushik\n  Bhattacharya", "title": "Phase-field study of crack nucleation and propagation in elastic -\n  perfectly plastic bodies", "comments": null, "journal-ref": null, "doi": "10.1016/j.cma.2019.04.027", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Crack initiation and propagation in elastic - perfectly plastic bodies is\nstudied in a phase-field or variational gradient damage formulation. A\nrate-independent formulation that naturally couples elasticity, perfect\nplasticity and fracture is presented, and used to study crack initiation in\nnotched specimens and crack propagation using a surfing boundary condition.\nBoth plane strain and plane stress are addressed. It is shown that in plane\nstrain, a plastic zone blunts the notch or crack tip which in turn inhibits\ncrack nucleation and propagation. Sufficient load causes the crack to nucleate\nor unpin, but the crack does so with a finite jump. Therefore the propagation\nis intermittent or jerky leaving behind a rough surface. In plane stress,\nfailure proceeds with an intense shear zone ahead of the notch or crack tip and\nthe fracture process is not complete.\n", "versions": [{"version": "v1", "created": "Thu, 13 Dec 2018 01:56:52 GMT"}], "update_date": "2019-06-26", "authors_parsed": [["Brach", "Stella", ""], ["Tanné", "Erwan", ""], ["Bourdin", "Blaise", ""], ["Bhattacharya", "Kaushik", ""]]}, {"id": "1812.05529", "submitter": "Matthew Parno", "authors": "Matthew Parno, Devin O'Connor, Matthew Smith", "title": "High dimensional inference for the structural health monitoring of lock\n  gates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Locks and dams are critical pieces of inland waterways. However, many\ncomponents of existing locks have been in operation past their designed\nlifetime. To ensure safe and cost effective operations, it is therefore\nimportant to monitor the structural health of locks. To support lock gate\nmonitoring, this work considers a high dimensional Bayesian inference problem\nthat combines noisy real time strain observations with a detailed finite\nelement model. To solve this problem, we develop a new technique that combines\nKarhunen-Lo\\`eve decompositions, stochastic differential equation\nrepresentations of Gaussian processes, and Kalman smoothing that scales\nlinearly with the number of observations and could be used for near real-time\nmonitoring. We use quasi-periodic Gaussian processes to model thermal\ninfluences on the strain and infer spatially distributed boundary conditions in\nthe model, which are also characterized with Gaussian process prior\ndistributions. The power of this approach is demonstrated on a small synthetic\nexample and then with real observations of Mississippi River Lock 27, which is\nlocated near St. Louis, MO USA. The results show that our approach is able to\nprobabilistically characterize the posterior distribution over nearly 1.4\nmillion parameters in under an hour on a standard desktop computer.\n", "versions": [{"version": "v1", "created": "Thu, 13 Dec 2018 17:23:38 GMT"}], "update_date": "2018-12-14", "authors_parsed": [["Parno", "Matthew", ""], ["O'Connor", "Devin", ""], ["Smith", "Matthew", ""]]}, {"id": "1812.05596", "submitter": "Daniel Sch\\\"ollhammer", "authors": "D. Sch\\\"ollhammer, T.P. Fries", "title": "Reissner-Mindlin shell theory based on tangential differential calculus", "comments": "Submitted to Computer Methods in Applied Mechanics and Engineering\n  V1: Initial submission. V2: Revised version. arXiv admin note: text overlap\n  with arXiv:1805.11978", "journal-ref": null, "doi": "10.1016/j.cma.2019.04.018", "report-no": null, "categories": "cs.NA cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The linear Reissner-Mindlin shell theory is reformulated in the frame of the\ntangential differential calculus (TDC) using a global Cartesian coordinate\nsystem. The rotation of the normal vector is modelled with a difference vector\napproach. The resulting equations are applicable to both explicitly and\nimplicitly defined shells, because the employed surface operators do not\nnecessarily rely on a parametrization. Hence, shell analysis on surfaces\nimplied by level-set functions is enabled, but also the classical case of\nparametrized surfaces is captured. As a consequence, the proposed TDC-based\nformulation is more general and may also be used in recent finite element\napproaches such as the TraceFEM and CutFEM where a parametrization of the\nmiddle surface is not required. Herein, the numerical results are obtained by\nisogeometric analysis using NURBS as trial and test functions for classical and\nnew benchmark tests. In the residual errors, optimal higher-order convergence\nrates are confirmed when the involved physical fields are sufficiently smooth.\n", "versions": [{"version": "v1", "created": "Tue, 11 Dec 2018 20:32:03 GMT"}, {"version": "v2", "created": "Fri, 12 Apr 2019 09:16:59 GMT"}], "update_date": "2019-05-22", "authors_parsed": [["Schöllhammer", "D.", ""], ["Fries", "T. P.", ""]]}, {"id": "1812.06867", "submitter": "Thorben Casper", "authors": "Alexander Krimm, Thorben Casper, Sebastian Sch\\\"ops, Herbert De\n  Gersem, Ludovic Chamoin", "title": "Proper Generalized Decomposition of Parameterized Electrothermal\n  Problems Discretized by the Finite Integration Technique", "comments": "submitted to IEEE Transactions on Magnetics - Conferences, to appear", "journal-ref": null, "doi": "10.1109/TMAG.2019.2907223", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The proper generalized decomposition is applied to a static electrothermal\nmodel subject to uncertainties. A reduced model that circumvents the curse of\ndimensionality is obtained. The quadratic electrothermal coupling term is\nnon-standard and requires the introduction of a trilinear form. An existing\nfinite integration technique based solver is used to demonstrate the\nopportunities and difficulties in integrating the proper generalized\ndecomposition in existing codes.\n", "versions": [{"version": "v1", "created": "Mon, 17 Dec 2018 16:08:59 GMT"}, {"version": "v2", "created": "Thu, 21 Mar 2019 20:15:05 GMT"}], "update_date": "2019-03-25", "authors_parsed": [["Krimm", "Alexander", ""], ["Casper", "Thorben", ""], ["Schöps", "Sebastian", ""], ["De Gersem", "Herbert", ""], ["Chamoin", "Ludovic", ""]]}, {"id": "1812.08117", "submitter": "Daniel Ruprecht", "authors": "Krasymyr Tretiak and Daniel Ruprecht", "title": "An arbitrary order time-stepping algorithm for tracking particles in\n  inhomogeneous magnetic fields", "comments": null, "journal-ref": "Journal of Computational Physics: X 4, pp. 100036, 2019", "doi": "10.1016/j.jcpx.2019.100036", "report-no": null, "categories": "math.NA cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Lorentz equations describe the motion of electrically charged particles\nin electric and magnetic fields and are used widely in plasma physics. The most\npopular numerical algorithm for solving them is the Boris method, a variant of\nthe St\\\"ormer-Verlet algorithm. Boris' method is phase space volume conserving\nand simulated particles typically remain near the correct trajectory. However,\nit is only second order accurate. Therefore, in scenarios where it is not\nenough to know that a particle stays on the right trajectory but one needs to\nknow where on the trajectory the particle is at a given time, Boris method\nrequires very small time steps to deliver accurate phase information, making it\ncomputationally expensive. We derive an improved version of the high-order\nBoris spectral deferred correction algorithm (Boris-SDC) by adopting a\nconvergence acceleration strategy for second order problems based on the\nGeneralised Minimum Residual (GMRES) method. Our new algorithm is easy to\nimplement as it still relies on the standard Boris method. Like Boris-SDC it\ncan deliver arbitrary order of accuracy through simple changes of runtime\nparameter but possesses better long-term energy stability. We demonstrate for\ntwo examples, a magnetic mirror trap and the Solev'ev equilibrium, that the new\nmethod can deliver better accuracy at lower computational cost compared to the\nstandard Boris method. While our examples are motivated by tracking ions in the\nmagnetic field of a nuclear fusion reactor, the introduced algorithm can\npotentially deliver similar improvements in efficiency for other applications.\n", "versions": [{"version": "v1", "created": "Wed, 19 Dec 2018 17:51:23 GMT"}, {"version": "v2", "created": "Fri, 2 Aug 2019 08:29:03 GMT"}], "update_date": "2019-09-17", "authors_parsed": [["Tretiak", "Krasymyr", ""], ["Ruprecht", "Daniel", ""]]}, {"id": "1812.08357", "submitter": "Sebastian Roch", "authors": "Sebastien Roch", "title": "On the variance of internode distance under the multispecies coalescent", "comments": null, "journal-ref": "RECOMB-CG 2018", "doi": null, "report-no": null, "categories": "q-bio.PE cs.CE math.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of estimating species trees from unrooted gene tree\ntopologies in the presence of incomplete lineage sorting, a common phenomenon\nthat creates gene tree heterogeneity in multilocus datasets. One popular class\nof reconstruction methods in this setting is based on internode distances, i.e.\nthe average graph distance between pairs of species across gene trees. While\nstatistical consistency in the limit of large numbers of loci has been\nestablished in some cases, little is known about the sample complexity of such\nmethods. Here we make progress on this question by deriving a lower bound on\nthe worst-case variance of internode distance which depends linearly on the\ncorresponding graph distance in the species tree. We also discuss some\nalgorithmic implications.\n", "versions": [{"version": "v1", "created": "Thu, 20 Dec 2018 04:48:19 GMT"}], "update_date": "2018-12-21", "authors_parsed": [["Roch", "Sebastien", ""]]}, {"id": "1812.08548", "submitter": "Marcin W\\k{a}torek", "authors": "Marcin W\\k{a}torek, Stanis{\\l}aw Dro\\.zd\\.z, Pawe{\\l}\n  O\\'swi\\c{e}cimka, Marek Stanuszek", "title": "Multifractal cross-correlations between the World Oil and other\n  Financial Markets in 2012-2017", "comments": null, "journal-ref": "Energy Economics 81, 874-885 (2019)", "doi": "10.1016/j.eneco.2019.05.015", "report-no": null, "categories": "q-fin.ST cs.CE econ.EM physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Statistical and multiscaling characteristics of WTI Crude Oil prices\nexpressed in US dollar in relation to the most traded currencies as well as to\ngold futures and to the E-mini S$\\&$P500 futures prices on 5 min intra-day\nrecordings in the period January 2012 - December 2017 are studied. It is shown\nthat in most of the cases the tails of return distributions of the considered\nfinancial instruments follow the inverse cubic power law. The only exception is\nthe Russian ruble for which the distribution tail is heavier and scales with\nthe exponent close to 2. From the perspective of multiscaling the analysed time\nseries reveal the multifractal organization with the left-sided asymmetry of\nthe corresponding singularity spectra. Even more, all the considered financial\ninstruments appear to be multifractally cross-correlated with oil, especially\non the level of medium-size fluctuations, as the multifractal cross-correlation\nanalysis carried out by means of the multifractal cross-correlation analysis\n(MFCCA) and detrended cross-correlation coefficient $\\rho_q$ show. The degree\nof such cross-correlations is however varying among the financial instruments.\nThe strongest ties to the oil characterize currencies of the oil extracting\ncountries. Strength of this multifractal coupling appears to depend also on the\noil market trend. In the analysed time period the level of cross-correlations\nsystematically increases during the bear phase on the oil market and it\nsaturates after the trend reversal in 1st half of 2016. The same methodology is\nalso applied to identify possible causal relations between considered\nobservables. Searching for some related asymmetry in the information flow\nmediating cross-correlations indicates that it was the oil price that led the\nRussian ruble over the time period here considered rather than vice versa.\n", "versions": [{"version": "v1", "created": "Thu, 20 Dec 2018 13:20:55 GMT"}, {"version": "v2", "created": "Fri, 21 Jun 2019 09:17:48 GMT"}], "update_date": "2019-06-24", "authors_parsed": [["Wątorek", "Marcin", ""], ["Drożdż", "Stanisław", ""], ["Oświȩcimka", "Paweł", ""], ["Stanuszek", "Marek", ""]]}, {"id": "1812.09849", "submitter": "Sabber Ahamed", "authors": "Sabber Ahamed and Eunseo Choi", "title": "Incorporating Deformation Energetics in Long-Term Tectonic Modeling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.geo-ph cs.CE cs.DC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The deformation-related energy budget is usually considered in the simplest\nform or even completely omitted from the energy balance equation. We derive a\nfull energy balance equation that accounts not only for heat energy but also\nfor mechanical (elastic, plastic and viscous) work. The derived equation is\nimplemented in DES3D, an unstructured finite element solver for long-term\ntectonic deformation. We verify the implementation by comparing numerical\nsolutions to the corresponding semi-analytic solutions in three benchmarks\nextended from the classical oedometer test. Two of the benchmarks are designed\nto evaluate the temperature change in a Mohr-Coulomb elasto-plastic square\ngoverned by a simplified equation involving plastic power only and by the full\ntemperature evolution equation, respectively. The third benchmark differs in\nthat it computes thermal stresses associated with a prescribed uniform\ntemperature increase. All the solutions from DES3D show relative error less\nthan 0.1%. We also investigate the long-term effects of deformation energetics\non the evolution of large offset normal faults. We find that the models\nconsidering the full energy balance equation tend to produce more secondary\nfaults and an elongated core complex. Our results for the normal fault system\nconfirm that persistent inelastic deformation has a significant impact on the\nlong-term evolution of faults, motivating further exploration of the role of\nthe full energy balance equation in other geodynamic systems.\n", "versions": [{"version": "v1", "created": "Mon, 24 Dec 2018 07:25:00 GMT"}], "update_date": "2018-12-27", "authors_parsed": [["Ahamed", "Sabber", ""], ["Choi", "Eunseo", ""]]}, {"id": "1812.11405", "submitter": "Andreea Beica", "authors": "Andreea Beica, J\\'er\\^ome Feret, Tatjana Petrov", "title": "Tropical Abstraction of Biochemical Reaction Networks with Guarantees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biochemical molecules interact through modification and binding reactions,\ngiving raise to a combinatorial number of possible biochemical species. The\ntime-dependent evolution of concentrations of the species is commonly described\nby a system of coupled ordinary differential equations (ODEs). However, the\nanalysis of such high-dimensional, non-linear system of equations is often\ncomputationally expensive and even prohibitive in practice. The major challenge\ntowards reducing such models is providing the guarantees as to how the solution\nof the reduced model relates to that of the original model, while avoiding to\nsolve the original model. In this paper, we have designed and tested an\napproximation method for ODE models of biochemical reaction systems, in which\nthe guarantees are our major requirement. Borrowing from tropical analysis\ntechniques, dominance relations among terms of each species' ODE are exploited\nto simplify the original model, by neglecting the dominated terms. As the\ndominant subsystems can change during the system's dynamics, depending on which\nspecies dominate the others, several possible modes exist. Thus, simpler models\nconsisting of only the dominant subsystems can be assembled into hybrid,\npiecewise smooth models, which approximate the behavior of the initial system.\nBy combining the detection of dominated terms with symbolic bounds propagation,\nwe show how to approximate the original model by an assembly of simpler models,\nconsisting in ordinary differential equations that provide time-dependent lower\nand upper bounds for the concentrations of the initial models species. Our\nmethod provides sound interval bounds for the concentrations of the chemical\nspecies, and hence can serve to evaluate the faithfulness of\ntropicalization-based reduction heuristics for ODE models of biochemical\nreduction systems. The method is tested on several case studies.\n", "versions": [{"version": "v1", "created": "Sat, 29 Dec 2018 17:30:35 GMT"}, {"version": "v2", "created": "Thu, 21 Mar 2019 09:56:13 GMT"}], "update_date": "2019-03-22", "authors_parsed": [["Beica", "Andreea", ""], ["Feret", "Jérôme", ""], ["Petrov", "Tatjana", ""]]}]