[{"id": "1504.00353", "submitter": "Pascal Giard", "authors": "Pascal Giard, Gabi Sarkis, Camille Leroux, Claude Thibeault, and\n  Warren J. Gross", "title": "Low-Latency Software Polar Decoders", "comments": "13 pages, 9 figures, to appear in Springer's Journal of Signal\n  Processing Systems", "journal-ref": null, "doi": "10.1007/s11265-016-1157-y", "report-no": null, "categories": "cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Polar codes are a new class of capacity-achieving error-correcting codes with\nlow encoding and decoding complexity. Their low-complexity decoding algorithms\nrendering them attractive for use in software-defined radio applications where\ncomputational resources are limited. In this work, we present low-latency\nsoftware polar decoders that exploit modern processor capabilities. We show how\nadapting the algorithm at various levels can lead to significant improvements\nin latency and throughput, yielding polar decoders that are suitable for\nhigh-performance software-defined radio applications on modern desktop\nprocessors and embedded-platform processors. These proposed decoders have an\norder of magnitude lower latency and memory footprint compared to\nstate-of-the-art decoders, while maintaining comparable throughput. In\naddition, we present strategies and results for implementing polar decoders on\ngraphical processing units. Finally, we show that the energy efficiency of the\nproposed decoders is comparable to state-of-the-art software polar decoders.\n", "versions": [{"version": "v1", "created": "Wed, 1 Apr 2015 19:55:06 GMT"}, {"version": "v2", "created": "Mon, 11 Jul 2016 07:54:29 GMT"}], "update_date": "2016-07-12", "authors_parsed": [["Giard", "Pascal", ""], ["Sarkis", "Gabi", ""], ["Leroux", "Camille", ""], ["Thibeault", "Claude", ""], ["Gross", "Warren J.", ""]]}, {"id": "1504.00591", "submitter": "Jonathan Beard", "authors": "Jonathan C. Beard and Roger D. Chamberlain", "title": "Run Time Approximation of Non-blocking Service Rates for Streaming\n  Systems", "comments": "technical report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stream processing is a compute paradigm that promises safe and efficient\nparallelism. Modern big-data problems are often well suited for stream\nprocessing's throughput-oriented nature. Realization of efficient stream\nprocessing requires monitoring and optimization of multiple communications\nlinks. Most techniques to optimize these links use queueing network models or\nnetwork flow models, which require some idea of the actual execution rate of\neach independent compute kernel within the system. What we want to know is how\nfast can each kernel process data independent of other communicating kernels.\nThis is known as the \"service rate\" of the kernel within the queueing\nliterature. Current approaches to divining service rates are static. Modern\nworkloads, however, are often dynamic. Shared cloud systems also present\napplications with highly dynamic execution environments (multiple users,\nhardware migration, etc.). It is therefore desirable to continuously re-tune an\napplication during run time (online) in response to changing conditions. Our\napproach enables online service rate monitoring under most conditions,\nobviating the need for reliance on steady state predictions for what are\nprobably non-steady state phenomena. First, some of the difficulties associated\nwith online service rate determination are examined. Second, the algorithm to\napproximate the online non-blocking service rate is described. Lastly, the\nalgorithm is implemented within the open source RaftLib framework for\nvalidation using a simple microbenchmark as well as two full streaming\napplications.\n", "versions": [{"version": "v1", "created": "Thu, 2 Apr 2015 15:47:19 GMT"}, {"version": "v2", "created": "Mon, 13 Apr 2015 00:08:31 GMT"}], "update_date": "2015-04-14", "authors_parsed": [["Beard", "Jonathan C.", ""], ["Chamberlain", "Roger D.", ""]]}, {"id": "1504.00825", "submitter": "Lev Mukhanov", "authors": "Lev Mukhanov, Dimitrios S. Nikolopoulos, Bronis R. de Supinski", "title": "ALEA: Fine-grain Energy Profiling with Basic Block Sampling", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Energy efficiency is an essential requirement for all contemporary computing\nsystems. We thus need tools to measure the energy consumption of computing\nsystems and to understand how workloads affect it. Significant recent research\neffort has targeted direct power measurements on production computing systems\nusing on-board sensors or external instruments. These direct methods have in\nturn guided studies of software techniques to reduce energy consumption via\nworkload allocation and scaling. Unfortunately, direct energy measurements are\nhampered by the low power sampling frequency of power sensors. The coarse\ngranularity of power sensing limits our understanding of how power is allocated\nin systems and our ability to optimize energy efficiency via workload\nallocation.\n  We present ALEA, a tool to measure power and energy consumption at the\ngranularity of basic blocks, using a probabilistic approach. ALEA provides\nfine-grained energy profiling via statistical sampling, which overcomes the\nlimitations of power sensing instruments. Compared to state-of-the-art energy\nmeasurement tools, ALEA provides finer granularity without sacrificing\naccuracy. ALEA achieves low overhead energy measurements with mean error rates\nbetween 1.4% and 3.5% in 14 sequential and parallel benchmarks tested on both\nIntel and ARM platforms. The sampling method caps execution time overhead at\napproximately 1%. ALEA is thus suitable for online energy monitoring and\noptimization. Finally, ALEA is a user-space tool with a portable,\nmachine-independent sampling method. We demonstrate two use cases of ALEA,\nwhere we reduce the energy consumption of a k-means computational kernel by 37%\nand an ocean modelling code by 33%, compared to high-performance execution\nbaselines, by varying the power optimization strategy between basic blocks.\n", "versions": [{"version": "v1", "created": "Fri, 3 Apr 2015 11:57:11 GMT"}, {"version": "v2", "created": "Mon, 14 Nov 2016 22:01:00 GMT"}], "update_date": "2016-11-16", "authors_parsed": [["Mukhanov", "Lev", ""], ["Nikolopoulos", "Dimitrios S.", ""], ["de Supinski", "Bronis R.", ""]]}, {"id": "1504.01191", "submitter": "Wu Jinbiao", "authors": "Jinbiao Wu, Yi Peng, Zaiming Liu", "title": "On the BMAP_1, BMAP_2/PH/g, c retrial queueing system", "comments": "28 pages with 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.PF", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this paper, we analyze a retrial queueing system with Batch Markovian\nArrival Processes and two types of customers. The rate of individual repeated\nattempts from the orbit is modulated according to a Markov Modulated Poisson\nProcess. Using the theory of multi-dimensional asymptotically quasi-Toeplitz\nMarkov chain, we obtain the stability condition and the algorithm for\ncalculating the stationary state distribution of the system. Main performance\nmeasures are presented. Furthermore, we investigate some optimization problems.\nThe algorithm for determining the optimal number of guard servers and total\nservers is elaborated. Finally, this queueing system is applied to the cellular\nwireless network. Numerical results to illustrate the optimization problems and\nthe impact of retrial on performance measures are provided. We find that the\nperformance measures are mainly affected by the two types of customers'\narrivals and service patterns, but the retrial rate plays a less crucial role.\n", "versions": [{"version": "v1", "created": "Mon, 6 Apr 2015 02:48:16 GMT"}], "update_date": "2015-04-07", "authors_parsed": [["Wu", "Jinbiao", ""], ["Peng", "Yi", ""], ["Liu", "Zaiming", ""]]}, {"id": "1504.02324", "submitter": "Dmitry Kulyabov PhD", "authors": "T. R. Velieva and A. V. Korolkova and D. S. Kulyabov", "title": "Designing Installations for Verification of the Model of Active Queue\n  Management Discipline RED in the GNS3", "comments": "in Russian; in English", "journal-ref": "6th ICUMT, IEEE, 2014, pp. 570--577", "doi": "10.1109/ICUMT.2014.7002164", "report-no": null, "categories": "cs.NI cs.PF", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The problem of RED-module mathematical model results verification, based on\nGNS3 experimental stand, is discussed in this article. The experimental stand\nconsists of virtual Cisco router, traffic generator D-ITG and traffic receiver.\nThe process of construction of such stand is presented. Also, the interaction\nbetween experimental stand and a computer of investigation in order to obtain\nand analyze data from stand is revised. A stochastic model of the traffic\nmanagement RED type module was built. Verification of the model was carried out\non the NS-2 basis. However, we would like to conduct verification on a real\nrouter. As a result was the task of designing an experimental stand. It was\ndecided to verify the clean RED algorithm based on Cisco router. For the\nconstruction of the stand software package GNS3 (Graphical Network Simulator)\nwas chosen. Thus, the purpose of the study is to build on the GNS3 basis a\nvirtual stand consisting of a Cisco router, a traffic generator and a receiver.\nA traffic generator D-ITG (Distributed Internet Traffic Generator) is used as.\n", "versions": [{"version": "v1", "created": "Thu, 9 Apr 2015 14:26:12 GMT"}], "update_date": "2015-04-10", "authors_parsed": [["Velieva", "T. R.", ""], ["Korolkova", "A. V.", ""], ["Kulyabov", "D. S.", ""]]}, {"id": "1504.03875", "submitter": "Kevin Roussel", "authors": "K\\'evin Roussel (INRIA Nancy - Grand Est / LORIA), Ye-Qiong Song\n  (INRIA Nancy - Grand Est / LORIA), Olivier Zendra (INRIA Nancy - Grand Est /\n  LORIA)", "title": "RIOT OS Paves the Way for Implementation of High-Performance MAC\n  Protocols", "comments": "SCITEPRESS. SENSORNETS 2015, Feb 2015, Angers, France.\n  http://www.scitepress.org", "journal-ref": null, "doi": "10.5220/0005237600050014", "report-no": null, "categories": "cs.NI cs.OS cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Implementing new, high-performance MAC protocols requires real-time features,\nto be able to synchronize correctly between different unrelated devices. Such\nfeatures are highly desirable for operating wireless sensor networks (WSN) that\nare designed to be part of the Internet of Things (IoT). Unfortunately, the\noperating systems commonly used in this domain cannot provide such features. On\nthe other hand, \"bare-metal\" development sacrifices portability, as well as the\nmul-titasking abilities needed to develop the rich applications that are useful\nin the domain of the Internet of Things. We describe in this paper how we\nhelped solving these issues by contributing to the development of a port of\nRIOT OS on the MSP430 microcontroller, an architecture widely used in\nIoT-enabled motes. RIOT OS offers rich and advanced real-time features,\nespecially the simultaneous use of as many hardware timers as the underlying\nplatform (microcontroller) can offer. We then demonstrate the effectiveness of\nthese features by presenting a new implementation, on RIOT OS, of S-CoSenS, an\nefficient MAC protocol that uses very low processing power and energy.\n", "versions": [{"version": "v1", "created": "Wed, 15 Apr 2015 12:05:59 GMT"}], "update_date": "2015-04-16", "authors_parsed": [["Roussel", "Kévin", "", "INRIA Nancy - Grand Est / LORIA"], ["Song", "Ye-Qiong", "", "INRIA Nancy - Grand Est / LORIA"], ["Zendra", "Olivier", "", "INRIA Nancy - Grand Est /\n  LORIA"]]}, {"id": "1504.04074", "submitter": "Xiaohan Wei", "authors": "Xiaohan Wei and Michael J. Neely", "title": "Power Aware Wireless File Downloading: A Lyapunov Indexing Approach to A\n  Constrained Restless Bandit Problem", "comments": "Extended version submitted to IEEE Trans. Network. arXiv admin note:\n  substantial text overlap with arXiv:1401.3824", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper treats power-aware throughput maxi-mization in a multi-user file\ndownloading system. Each user can receive a new file only after its previous\nfile is finished. The file state processes for each user act as coupled Markov\nchains that form a generalized restless bandit system. First, an optimal\nalgorithm is derived for the case of one user. The algorithm maximizes\nthroughput subject to an average power constraint. Next, the one-user algorithm\nis extended to a low complexity heuristic for the multi-user problem. The\nheuristic uses a simple online index policy. In a special case with no\npower-constraint, the multi-user heuristic is shown to be throughput optimal.\nSimulations are used to demonstrate effectiveness of the heuristic in the\ngeneral case. For simple cases where the optimal solution can be computed\noffline, the heuristic is shown to be near-optimal for a wide range of\nparameters.\n", "versions": [{"version": "v1", "created": "Thu, 16 Apr 2015 00:43:27 GMT"}], "update_date": "2015-04-17", "authors_parsed": [["Wei", "Xiaohan", ""], ["Neely", "Michael J.", ""]]}, {"id": "1504.04974", "submitter": "Zhen Jia", "authors": "Zhen Jia, Lei Wang, Jianfeng Zhan, Lixin Zhang, Chunjie Luo, Ninghui\n  Sun", "title": "Understanding Big Data Analytic Workloads on Modern Processors", "comments": "arXiv admin note: substantial text overlap with arXiv:1307.8013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Big data analytics applications play a significant role in data centers, and\nhence it has become increasingly important to understand their behaviors in\norder to further improve the performance of data center computer systems, in\nwhich characterizing representative workloads is a key practical problem. In\nthis paper, after investigating three most impor- tant application domains in\nterms of page views and daily visitors, we chose 11 repre- sentative data\nanalytics workloads and characterized their micro-architectural behaviors by\nusing hardware performance counters, so as to understand the impacts and\nimplications of data analytics workloads on the systems equipped with modern\nsuperscalar out-of-order processors. Our study reveals that big data analytics\napplications themselves share many inherent characteristics, which place them\nin a different class from traditional workloads and scale-out services. To\nfurther understand the characteristics of big data analytics work- loads we\nperformed a correlation analysis of CPI (cycles per instruction) with other\nmicro- architecture level characteristics and an investigation of the big data\nsoftware stack impacts on application behaviors. Our correlation analysis\nshowed that even though big data ana- lytics workloads own notable pipeline\nfront end stalls, the main factors affecting the CPI performance are long\nlatency data accesses rather than the front end stalls. Our software stack\ninvestigation found that the typical big data software stack significantly\ncontributes to the front end stalls and incurs bigger working set. Finally we\ngave several recommen- dations for architects, programmers and big data system\ndesigners with the knowledge acquired from this paper.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2015 08:55:06 GMT"}], "update_date": "2015-04-21", "authors_parsed": [["Jia", "Zhen", ""], ["Wang", "Lei", ""], ["Zhan", "Jianfeng", ""], ["Zhang", "Lixin", ""], ["Luo", "Chunjie", ""], ["Sun", "Ninghui", ""]]}, {"id": "1504.05103", "submitter": "Longbo Huang", "authors": "Longbo Huang and Eytan Modiano", "title": "Optimizing Age-of-Information in a Multi-class Queueing System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the age-of-information in a multi-class $M/G/1$ queueing system,\nwhere each class generates packets containing status information. Age of\ninformation is a relatively new metric that measures the amount of time that\nelapsed between status updates, thus accounting for both the queueing delay and\nthe delay between packet generation. This gives rise to a tradeoff between\nfrequency of status updates, and queueing delay. In this paper, we study this\ntradeoff in a system with heterogenous users modeled as a multi-class $M/G/1$\nqueue. To this end, we derive the exact peak age-of-Information (PAoI) profile\nof the system, which measures the \"freshness\" of the status information. We\nthen seek to optimize the age of information, by formulating the problem using\nquasiconvex optimization, and obtain structural properties of the optimal\nsolution.\n", "versions": [{"version": "v1", "created": "Mon, 20 Apr 2015 16:13:58 GMT"}], "update_date": "2015-04-21", "authors_parsed": [["Huang", "Longbo", ""], ["Modiano", "Eytan", ""]]}, {"id": "1504.07908", "submitter": "Maciej Burak Mr.", "authors": "Maciej Rafal Burak", "title": "Inhomogeneous CTMC Model of a Call Center with Balking and Abandonment", "comments": "submitted to Studia Informatica (http://studiainformatica.polsl.pl/).\n  arXiv admin note: substantial text overlap with arXiv:1410.0804", "journal-ref": "Studia Informatica, Vol 36, No 2 (2015):23-34, jun 2015", "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers a nonstationary multiserver queuing model with\nabandonment and balking for inbound call centers. We present a continuous time\nMarkov chain (CTMC) model which captures the important characteristics of an\ninbound call center and obtain a numerical solution for its transient state\nprobabilities using uniformization method with steady-state detection.\nKeywords: call center, transient, Markov processes, numerical methods,\nuniformization, abandonment, balking\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2015 16:03:40 GMT"}], "update_date": "2015-06-26", "authors_parsed": [["Burak", "Maciej Rafal", ""]]}, {"id": "1504.07967", "submitter": "Shoaib Ehsan", "authors": "Shoaib Ehsan, Nadia Kanwal, Adrian F. Clark and Klaus D.\n  McDonald-Maier", "title": "Improved repeatability measures for evaluating performance of feature\n  detectors", "comments": null, "journal-ref": "Electronics Letters 8th July 2010 Vol. 46 No. 14", "doi": null, "report-no": null, "categories": "cs.CV cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The most frequently employed measure for performance characterisation of\nlocal feature detectors is repeatability, but it has been observed that this\ndoes not necessarily mirror actual performance. Presented are improved\nrepeatability formulations which correlate much better with the true\nperformance of feature detectors. Comparative results for several\nstate-of-the-art feature detectors are presented using these measures; it is\nfound that Hessian-based detectors are generally superior at identifying\nfeatures when images are subject to various geometric and photometric\ntransformations.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2015 19:01:30 GMT"}], "update_date": "2015-04-30", "authors_parsed": [["Ehsan", "Shoaib", ""], ["Kanwal", "Nadia", ""], ["Clark", "Adrian F.", ""], ["McDonald-Maier", "Klaus D.", ""]]}, {"id": "1504.08035", "submitter": "Elmar Peise", "authors": "Elmar Peise (1), Paolo Bientinesi (1) ((1) AICES, RWTH Aachen)", "title": "The ELAPS Framework: Experimental Linear Algebra Performance Studies", "comments": "Submitted to SC15", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF cs.MS cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimal use of computing resources requires extensive coding, tuning and\nbenchmarking. To boost developer productivity in these time consuming tasks, we\nintroduce the Experimental Linear Algebra Performance Studies framework\n(ELAPS), a multi-platform open source environment for fast yet powerful\nperformance experimentation with dense linear algebra kernels, algorithms, and\nlibraries. ELAPS allows users to construct experiments to investigate how\nperformance and efficiency vary depending on factors such as caching,\nalgorithmic parameters, problem size, and parallelism. Experiments are designed\neither through Python scripts or a specialized GUI, and run on the whole\nspectrum of architectures, ranging from laptops to clusters, accelerators, and\nsupercomputers. The resulting experiment reports provide various metrics and\nstatistics that can be analyzed both numerically and visually. We demonstrate\nthe use of ELAPS in four concrete application scenarios and in as many\ncomputing environments, illustrating its practical value in supporting critical\nperformance decisions.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2015 21:58:50 GMT"}], "update_date": "2015-05-01", "authors_parsed": [["Peise", "Elmar", "", "AICES, RWTH Aachen"], ["Bientinesi", "Paolo", "", "AICES, RWTH Aachen"]]}, {"id": "1504.08150", "submitter": "Quan-Lin Li", "authors": "Quan-Lin Li, Feifei Yang, Na Li", "title": "Reward Processes and Performance Simulation in Supermarket Models with\n  Different Servers", "comments": "35 pages, 4 figures in International Journal of Simulation and\n  Process Modelling; 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Supermarket models with different servers become a key in modeling resource\nmanagement of stochastic networks, such as, computer networks, manufacturing\nsystems and transportation networks. While these different servers always make\nanalysis of such a supermarket model more interesting, difficult and\nchallenging. This paper provides a new novel method for analyzing the\nsupermarket model with different servers through a multi-dimensional\ncontinuous-time Markov reward processes. Firstly, the utility functions are\nconstructed for expressing a routine selection mechanism that depends on queue\nlengths, on service rates, and on some probabilities of individual preference.\nThen applying the continuous-time Markov reward processes, some segmented\nstochastic integrals of the random reward function are established by means of\nan event-driven technique. Based on this, the mean of the random reward\nfunction in a finite time period is effectively computed by means of the state\njump points of the Markov reward process, and also the mean of the discounted\nrandom reward function in an infinite time period can be calculated through the\nsame event-driven technique. Finally, some simulation experiments are given to\nindicate how the expected queue length of each server depends on the main\nparameters of this supermarket model.\n", "versions": [{"version": "v1", "created": "Thu, 30 Apr 2015 10:01:34 GMT"}, {"version": "v2", "created": "Tue, 5 Apr 2016 05:44:42 GMT"}], "update_date": "2016-04-06", "authors_parsed": [["Li", "Quan-Lin", ""], ["Yang", "Feifei", ""], ["Li", "Na", ""]]}]