[{"id": "1111.0594", "submitter": "Andrey Nikolaev", "authors": "Andrey Nikolaev", "title": "Exploring Oracle RDBMS latches using Solaris DTrace", "comments": "14 pages, 6 figures, 6 tables. MEDIAS 2011 Conference. Limassol,\n  Cyprus", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.DC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rise of hundreds cores technologies bring again to the first plan the problem\nof interprocess synchronization in database engines. Spinlocks are widely used\nin contemporary DBMS to synchronize processes at microsecond timescale. Latches\nare Oracle RDBMS specific spinlocks. The latch contention is common to observe\nin contemporary high concurrency OLTP environments.\n  In contrast to system spinlocks used in operating systems kernels, latches\nwork in user context. Such user level spinlocks are influenced by context\npreemption and multitasking. Until recently there were no direct methods to\nmeasure effectiveness of user spinlocks. This became possible with the\nemergence of Solaris 10 Dynamic Tracing framework. DTrace allows tracing and\nprofiling both OS and user applications.\n  This work investigates the possibilities to diagnose and tune Oracle latches.\nIt explores the contemporary latch realization and spinning-blocking\nstrategies, analyses corresponding statistic counters.\n  A mathematical model developed to estimate analytically the effect of tuning\n_SPIN_COUNT value.\n", "versions": [{"version": "v1", "created": "Wed, 2 Nov 2011 18:20:36 GMT"}], "update_date": "2011-11-03", "authors_parsed": [["Nikolaev", "Andrey", ""]]}, {"id": "1111.1628", "submitter": "Alaa Al howaide zaid", "authors": "Ala'a Z. Al-Howaide, Mohammed I. Khaleel, Ayad M. Salhieh", "title": "Updatable Queue Protocol Based On TCP For Virtual Reality Environment", "comments": "11 pages, 13 fugures, 13 reference", "journal-ref": "International Journal of Computer Science, Engineering and\n  Applications (IJCSEA) Vol.1, No.5, October 2011, Pages 35-46", "doi": "10.5121/ijcsea.2011.1504", "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The variance in number and types of tasks required to be implemented within\nDistributed Virtual Environments (DVE) highlights the needs for communication\nprotocols can achieve consistency. In addition, these applications have to\nhandle an increasing number of participants and deal with the difficult problem\nof scalability. Moreover, the real-time requirements of these applications make\nthe scalability problem more difficult to solve. In this paper, we have\nimplemented Updatable Queue Abstraction protocol (UQA) on TCP (TCP-UQA) and\ncompared it with original TCP, UDP, and Updatable Queue Abstraction based on\nUDP (UDP-UQA) protocols. Results showed that TCP-UQA was the best in queue\nmanagement.\n", "versions": [{"version": "v1", "created": "Mon, 7 Nov 2011 16:12:31 GMT"}], "update_date": "2011-11-15", "authors_parsed": [["Al-Howaide", "Ala'a Z.", ""], ["Khaleel", "Mohammed I.", ""], ["Salhieh", "Ayad M.", ""]]}, {"id": "1111.1926", "submitter": "Hossein Shokri Ghadikolaei", "authors": "Hossein Shokri-Ghadikolaei, Mohammad Mozaffari, Masoumeh Nasiri-Kenari", "title": "Performance Analysis of Sequential Method for Handover in Cognitive\n  Radio Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Powerful spectrum handover schemes enable cognitive radios (CRs) to use\ntransmission opportunities in primary users' channels appropriately. In this\npaper, we consider the cognitive access of primary channels by a secondary\nuser. We evaluate the average detection time and the maximum achievable average\nthroughput of the secondary user when the sequential method for hand-over\n(SMHO) is used. We assume that a prior knowledge of the primary users' presence\nand absence probabilities are available. When investigating the maximum\nachievable throughput of the secondary user, we end into an optimization\nproblem, in which the optimum value of sensing time must be selected. In our\noptimization problem, we take into account the spectrum hand over due to false\ndetection of the primary user. We also propose a weighted based hand-over\n(WBHO) scheme in which the impacts of channels conditions and primary users'\npresence probability are considered. This Spectrum handover scheme provides\nhigher average throughput for the SU than the SMHO method. The tradeoff between\nthe maximum achievable throughput and consumed energy is discussed, and finally\nan energy efficient optimization formulation for finding a proper sensing time\nis provided.\n", "versions": [{"version": "v1", "created": "Tue, 8 Nov 2011 14:54:57 GMT"}, {"version": "v2", "created": "Mon, 2 Jan 2012 08:56:16 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Shokri-Ghadikolaei", "Hossein", ""], ["Mozaffari", "Mohammad", ""], ["Nasiri-Kenari", "Masoumeh", ""]]}, {"id": "1111.2996", "submitter": "Alaa Al howaide zaid", "authors": "Ala'a Z. Al-Howaide, Ahmad S. Doulat, Yaser M. Khamayseh", "title": "Performance Evaluation of Different Scheduling Algorithms in WiMAX", "comments": "12 pages, 15 figures", "journal-ref": "International Journal of Computer Science, Engineering and\n  Applications (IJCSEA) Vol.1, No.5, October 2011, Pages 103-115", "doi": "10.5121/ijcsea.2011.1509", "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Worldwide Interoperability for Microwave Access (WiMAX) networks were\nexpected to be the main Broadband Wireless Access (BWA) technology that\nprovided several services such as data, voice, and video services including\ndifferent classes of Quality of Services (QoS), which in turn were defined by\nIEEE 802.16 standard. Scheduling in WiMAX became one of the most challenging\nissues, since it was responsible for distributing available resources of the\nnetwork among all users; this leaded to the demand of constructing and\ndesigning high efficient scheduling algorithms in order to improve the network\nutilization, to increase the network throughput, and to minimize the end-to-end\ndelay. In this study, we presenedt a simulation study to measure the\nperformance of several scheduling algorithms in WiMAX, which were Strict\nPriority algorithm, Round-Robin (RR), Weighted Round Robin (WRR), Weighted Fair\nQueuing (WFQ), Self-Clocked Fair (SCF), and Diff-Serv Algorithm.\n", "versions": [{"version": "v1", "created": "Sun, 13 Nov 2011 08:18:14 GMT"}], "update_date": "2011-11-15", "authors_parsed": [["Al-Howaide", "Ala'a Z.", ""], ["Doulat", "Ahmad S.", ""], ["Khamayseh", "Yaser M.", ""]]}, {"id": "1111.3110", "submitter": "EPTCS", "authors": "Christian Krause (Hasso Plattner Institute (HPI), Potsdam, Germany),\n  Holger Giese (Hasso Plattner Institute (HPI), Potsdam, Germany)", "title": "Model Checking Probabilistic Real-Time Properties for Service-Oriented\n  Systems with Service Level Agreements", "comments": "In Proceedings INFINITY 2011, arXiv:1111.2678", "journal-ref": "EPTCS 73, 2011, pp. 64-78", "doi": "10.4204/EPTCS.73.8", "report-no": null, "categories": "cs.SE cs.LO cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The assurance of quality of service properties is an important aspect of\nservice-oriented software engineering. Notations for so-called service level\nagreements (SLAs), such as the Web Service Level Agreement (WSLA) language,\nprovide a formal syntax to specify such assurances in terms of (legally\nbinding) contracts between a service provider and a customer. On the other\nhand, formal methods for verification of probabilistic real-time behavior have\nreached a level of expressiveness and efficiency which allows to apply them in\nreal-world scenarios. In this paper, we suggest to employ the recently\nintroduced model of Interval Probabilistic Timed Automata (IPTA) for formal\nverification of QoS properties of service-oriented systems. Specifically, we\nshow that IPTA in contrast to Probabilistic Timed Automata (PTA) are able to\ncapture the guarantees specified in SLAs directly. A particular challenge in\nthe analysis of IPTA is the fact that their naive semantics usually yields an\ninfinite set of states and infinitely-branching transitions. However, using\nsymbolic representations, IPTA can be analyzed rather efficiently. We have\ndeveloped the first implementation of an IPTA model checker by extending the\nPRISM tool and show that model checking IPTA is only slightly more expensive\nthan model checking comparable PTA.\n", "versions": [{"version": "v1", "created": "Mon, 14 Nov 2011 06:35:42 GMT"}], "update_date": "2011-11-15", "authors_parsed": [["Krause", "Christian", "", "Hasso Plattner Institute"], ["Giese", "Holger", "", "Hasso Plattner Institute"]]}, {"id": "1111.4287", "submitter": "Dmitry Zinoviev", "authors": "Dmitry Zinoviev", "title": "Parametric Estimation of the Ultimate Size of Hypercomputers", "comments": "6 pages, 2 figures, published in Proc. 6th World Multiconference on\n  Systemics, Cybernetics and Informatics, 2002", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The performance of the emerging petaflops-scale supercomputers of the nearest\nfuture (hypercomputers) will be governed not only by the clock frequency of the\nprocessing nodes or by the width of the system bus, but also by such factors as\nthe overall power consumption and the geometric size. In this paper, we study\nthe influence of such parameters on one of the most important characteristics\nof a general purpose computer - on the degree of multithreading that must be\npresent in an application to make the use of the hypercomputer justifiable. Our\nmajor finding is that for the class of applications with purely random memory\naccess patterns \"super-fast computing\" and \"high-performance computing\" are\nessentially synonyms for \"massively-parallel computing.\"\n", "versions": [{"version": "v1", "created": "Fri, 18 Nov 2011 05:29:44 GMT"}], "update_date": "2011-11-21", "authors_parsed": [["Zinoviev", "Dmitry", ""]]}, {"id": "1111.4511", "submitter": "Antonio Fern\\'andez Anta", "authors": "Kshitiz Verma and Gianluca Rizzo and Antonio Fern\\'andez Anta and\n  Rub\\'en Cuevas Rum\\'in and Arturo Azcorra", "title": "Greening File Distribution: Centralized or Distributed?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite file-distribution applications are responsible for a major portion of\nthe current Internet traffic, so far little effort has been dedicated to study\nfile distribution from the point of view of energy efficiency. In this paper,\nwe present a first approach at the problem of energy efficiency for file\ndistribution. Specifically, we first demonstrate that the general problem of\nminimizing energy consumption in file distribution in heterogeneous settings is\nNP-hard. For homogeneous settings, we derive tight lower bounds on energy\nconsumption, and we design a family of algorithms that achieve these bounds.\nOur results prove that collaborative p2p schemes achieve up to 50% energy\nsavings with respect to the best available centralized file distribution\nscheme. Through simulation, we demonstrate that in more realistic cases (e.g.,\nconsidering network congestion, and link variability across hosts) we validate\nthis observation, since our collaborative algorithms always achieve significant\nenergy savings with respect to the power consumption of centralized file\ndistribution systems.\n", "versions": [{"version": "v1", "created": "Fri, 18 Nov 2011 22:48:05 GMT"}], "update_date": "2011-11-22", "authors_parsed": [["Verma", "Kshitiz", ""], ["Rizzo", "Gianluca", ""], ["Anta", "Antonio Fernández", ""], ["Rumín", "Rubén Cuevas", ""], ["Azcorra", "Arturo", ""]]}, {"id": "1111.4624", "submitter": "Hossein Shokri Ghadikolaei", "authors": "Hossein Shokri-Ghadikolaei, Masoumeh Nasiri-Kenari", "title": "Sensing Matrix Setting Schemes for Cognitive Networks and Their\n  Performance Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Powerful spectrum decision schemes enable cognitive radios (CRs) to find\ntransmission opportunities in spectral resources allocated exclusively to the\nprimary users. One of the key effecting factor on the CR network throughput is\nthe spectrum sensing sequence used by each secondary user. In this paper,\nsecondary users' throughput maximization through finding an appropriate sensing\nmatrix (SM) is investigated. To this end, first the average throughput of the\nCR network is evaluated for a given SM. Then, an optimization problem based on\nthe maximization of the network throughput is formulated in order to find the\noptimal SM. As the optimum solution is very complicated, to avoid its major\nchallenges, three novel sub optimum solutions for finding an appropriate SM are\nproposed for various cases including perfect and non-perfect sensing. Despite\nof having less computational complexities as well as lower consumed energies,\nthe proposed solutions perform quite well compared to the optimum solution (the\noptimum SM). The structure and performance of the proposed SM setting schemes\nare discussed in detail and a set of illustrative simulation results is\npresented to validate their efficiencies.\n", "versions": [{"version": "v1", "created": "Sun, 20 Nov 2011 11:26:29 GMT"}, {"version": "v2", "created": "Thu, 29 Dec 2011 07:45:48 GMT"}, {"version": "v3", "created": "Mon, 2 Jan 2012 09:09:27 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Shokri-Ghadikolaei", "Hossein", ""], ["Nasiri-Kenari", "Masoumeh", ""]]}, {"id": "1111.5710", "submitter": "Jean-Yves Le Boudec", "authors": "Michel Benaim, Jean-Yves Le Boudec", "title": "On Mean Field Convergence and Stationary Regime", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS cs.PF cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assume that a family of stochastic processes on some Polish space $E$\nconverges to a deterministic process; the convergence is in distribution (hence\nin probability) at every fixed point in time. This assumption holds for a large\nfamily of processes, among which many mean field interaction models and is\nweaker than previously assumed. We show that any limit point of an invariant\nprobability of the stochastic process is an invariant probability of the\ndeterministic process. The results are valid in discrete and in continuous\ntime.\n", "versions": [{"version": "v1", "created": "Thu, 24 Nov 2011 10:13:13 GMT"}], "update_date": "2012-07-13", "authors_parsed": [["Benaim", "Michel", ""], ["Boudec", "Jean-Yves Le", ""]]}, {"id": "1111.6374", "submitter": "Edoardo Di Napoli", "authors": "Jos\\'e I. Aliaga (1), Paolo Bientinesi (2), Davor Davidovi\\'c (3),\n  Edoardo Di Napoli (4), Francisco D. Igual (1), and Enrique S. Quintana-Ort\\'i\n  (1) ((1) Depto. de Ingenier\\'ia y Ciencia de Computadores, Universidad Jaume\n  I, (2) RWTH-Aachen University, (3) Institut Ruder Boskov\\'ic, Centarza\n  Informatiku i Racunarstvo, (4) JSC, Forschungszentrum J\\\"ulich)", "title": "Solving Dense Generalized Eigenproblems on Multi-threaded Architectures", "comments": "5 tables and 4 figures. In press by Applied Mathematics and\n  Computation. Accepted version", "journal-ref": null, "doi": "10.1016/j.amc.2012.05.020", "report-no": null, "categories": "cs.PF cond-mat.mtrl-sci cs.DC cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We compare two approaches to compute a portion of the spectrum of dense\nsymmetric definite generalized eigenproblems: one is based on the reduction to\ntridiagonal form, and the other on the Krylov-subspace iteration. Two\nlarge-scale applications, arising in molecular dynamics and material science,\nare employed to investigate the contributions of the application, architecture,\nand parallelism of the method to the performance of the solvers. The\nexperimental results on a state-of-the-art 8-core platform, equipped with a\ngraphics processing unit (GPU), reveal that in real applications, iterative\nKrylov-subspace methods can be a competitive approach also for the solution of\ndense problems.\n", "versions": [{"version": "v1", "created": "Mon, 28 Nov 2011 08:52:04 GMT"}, {"version": "v2", "created": "Sun, 17 Jun 2012 17:42:58 GMT"}], "update_date": "2012-06-19", "authors_parsed": [["Aliaga", "José I.", ""], ["Bientinesi", "Paolo", ""], ["Davidović", "Davor", ""], ["Di Napoli", "Edoardo", ""], ["Igual", "Francisco D.", ""], ["Quintana-Ortí", "Enrique S.", ""]]}, {"id": "1111.6756", "submitter": "Riyadh Baghdadi", "authors": "Riyadh Baghdadi, Albert Cohen, Cedric Bastoul, Louis-Noel Pouchet and\n  Lawrence Rauchwerger", "title": "The Potential of Synergistic Static, Dynamic and Speculative Loop Nest\n  Optimizations for Automatic Parallelization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.PF cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Research in automatic parallelization of loop-centric programs started with\nstatic analysis, then broadened its arsenal to include dynamic\ninspection-execution and speculative execution, the best results involving\nhybrid static-dynamic schemes. Beyond the detection of parallelism in a\nsequential program, scalable parallelization on many-core processors involves\nhard and interesting parallelism adaptation and mapping challenges. These\nchallenges include tailoring data locality to the memory hierarchy, structuring\nindependent tasks hierarchically to exploit multiple levels of parallelism,\ntuning the synchronization grain, balancing the execution load, decoupling the\nexecution into thread-level pipelines, and leveraging heterogeneous hardware\nwith specialized accelerators. The polyhedral framework allows to model,\nconstruct and apply very complex loop nest transformations addressing most of\nthe parallelism adaptation and mapping challenges. But apart from\nhardware-specific, back-end oriented transformations (if-conversion, trace\nscheduling, value prediction), loop nest optimization has essentially ignored\ndynamic and speculative techniques. Research in polyhedral compilation recently\nreached a significant milestone towards the support of dynamic, data-dependent\ncontrol flow. This opens a large avenue for blending dynamic analyses and\nspeculative techniques with advanced loop nest optimizations. Selecting\nreal-world examples from SPEC benchmarks and numerical kernels, we make a case\nfor the design of synergistic static, dynamic and speculative loop\ntransformation techniques. We also sketch the embedding of dynamic information,\nincluding speculative assumptions, in the heart of affine transformation search\nspaces.\n", "versions": [{"version": "v1", "created": "Tue, 29 Nov 2011 10:40:44 GMT"}], "update_date": "2011-11-30", "authors_parsed": [["Baghdadi", "Riyadh", ""], ["Cohen", "Albert", ""], ["Bastoul", "Cedric", ""], ["Pouchet", "Louis-Noel", ""], ["Rauchwerger", "Lawrence", ""]]}]