[{"id": "2103.04826", "submitter": "Jamal Toutouh", "authors": "Diego Gabriel Rossit, Jamal Toutouh, and Sergio Nesmachnow", "title": "Exact and heuristic approaches for multi-objective garbage accumulation\n  points location in real scenarios", "comments": "This article has been accepted for publication in the Waste\n  Management journal", "journal-ref": "Waste Management. 105:467-481 (2020)", "doi": "10.1016/j.wasman.2020.02.016", "report-no": null, "categories": "cs.OH cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Municipal solid waste management is a major challenge for nowadays urban\nsocieties, because it accounts for a large proportion of public budget and,\nwhen mishandled, it can lead to environmental and social problems. This work\nfocuses on the problem of locating waste bins in an urban area, which is\nconsidered to have a strong influence in the overall efficiency of the reverse\nlogistic chain. This article contributes with an exact multiobjective approach\nto solve the waste bin location in which the optimization criteria that are\nconsidered are: the accessibility to the system (as quality of service\nmeasure), the investment cost, and the required frequency of waste removal from\nthe bins (as a proxy of the posterior routing costs). In this approach,\ndifferent methods to obtain the objectives ideal and nadir values over the\nPareto front are proposed and compared. Then, a family of heuristic methods\nbased on the PageRank algorithm is proposed which aims to optimize the\naccessibility to the system, the amount of collected waste and the installation\ncost. The experimental evaluation was performed on real-world scenarios of the\ncities of Montevideo, Uruguay, and Bah\\'ia Blanca, Argentina. The obtained\nresults show the competitiveness of the proposed approaches for constructing a\nset of candidate solutions that considers the different trade-offs between the\noptimization criteria.\n", "versions": [{"version": "v1", "created": "Fri, 5 Mar 2021 13:47:21 GMT"}, {"version": "v2", "created": "Thu, 11 Mar 2021 18:05:15 GMT"}], "update_date": "2021-03-12", "authors_parsed": [["Rossit", "Diego Gabriel", ""], ["Toutouh", "Jamal", ""], ["Nesmachnow", "Sergio", ""]]}, {"id": "2103.08783", "submitter": "Devlin Gualtieri Ph.D.", "authors": "Devlin Gualtieri", "title": "One-Time Pads from the Digits of Pi", "comments": "12 page PDF file (5 page article with 7 pages of computer source\n  code). Comments are welcome", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  I present a method for generating one-time pads from the digits of pi.\nComputer code is given to generate such pads from passphrases in a method\nhaving an extremely low probability (<10^-53) of a successful discovery of the\none-time pads by a brute-force attack. The advantages and disadvantages of this\nmethod are discussed.\n", "versions": [{"version": "v1", "created": "Tue, 16 Mar 2021 00:34:44 GMT"}], "update_date": "2021-03-17", "authors_parsed": [["Gualtieri", "Devlin", ""]]}]