[{"id": "1207.0847", "submitter": "Ahmed Bahgat Mr.", "authors": "A.T. Bahgat and K.N. Salama", "title": "Memristor-based mono-stable oscillator", "comments": "This paper was submitted to Electronics Letters on the 28th of March\n  2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this letter, a reactance-less mono-stable oscillator is introduced for the\nfirst time using memristors. By replacing bulky inductors and capacitors with\nmemristors, the novel mono-stable oscillator can be an area-efficient solution\nfor on-chip fully integrated systems. The proposed circuit is described,\nmathematically analysed and verified by circuit simulations.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2012 22:17:53 GMT"}], "update_date": "2012-07-05", "authors_parsed": [["Bahgat", "A. T.", ""], ["Salama", "K. N.", ""]]}, {"id": "1207.1161", "submitter": "Manish Gupta", "authors": "Abhishek Chhajer and Manish K. Gupta and Sandeep Vasani and Jaley\n  Dholakiya", "title": "Modular Arithmetic Expressions and Primality Testing via DNA\n  Self-Assembly", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.DS cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Self-assembly is a fundamental process by which supramolecular species form\nspontaneously from their components. This process is ubiquitous throughout the\nlife chemistry and is central to biological information processing. Algorithms\nfor solving many mathematical and computational problems via tile self assembly\nhave been proposed by many researchers in the last decade. In particular tile\nset for doing basic arithmetic of two inputs have been given. In this work we\ngive tile set for doing basic arithmetic (addition, subtraction,\nmultiplication) of n inputs and subsequently computing its modulo. We also\npresent a tile set for primality testing. Finally we present a software\n'xtilemod' for doing modular arithmetic. This simplifies the task of creating\nthe input files to xgrow simulator for doing basic (addition, subtraction,\nmultiplication and division) as well as modular arithmetic of n inputs. Similar\nsoftware for creating tile set for primality testing is also given.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2012 04:55:03 GMT"}], "update_date": "2012-07-06", "authors_parsed": [["Chhajer", "Abhishek", ""], ["Gupta", "Manish K.", ""], ["Vasani", "Sandeep", ""], ["Dholakiya", "Jaley", ""]]}, {"id": "1207.1619", "submitter": "Anteo Smerieri", "authors": "Fran\\c{c}ois Duport, Bendix Schneider, Anteo Smerieri, Marc Haelterman\n  and Serge Massar", "title": "All-optical Reservoir Computing", "comments": null, "journal-ref": "Optics Express, Vol. 20 Issue 20, pp.22783-22795 (2012)", "doi": "10.1364/OE.20.022783", "report-no": null, "categories": "physics.optics cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reservoir Computing is a novel computing paradigm which uses a nonlinear\nrecurrent dynamical system to carry out information processing. Recent\nelectronic and optoelectronic Reservoir Computers based on an architecture with\na single nonlinear node and a delay loop have shown performance on standardized\ntasks comparable to state-of-the-art digital implementations. Here we report an\nall-optical implementation of a Reservoir Computer, made of off-the-shelf\ncomponents for optical telecommunications. It uses the saturation of a\nsemiconductor optical amplifier as nonlinearity. The present work shows that,\nwithin the Reservoir Computing paradigm, all-optical computing with\nstate-of-the-art performance is possible.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2012 13:29:58 GMT"}, {"version": "v2", "created": "Mon, 1 Oct 2012 13:07:07 GMT"}], "update_date": "2013-11-07", "authors_parsed": [["Duport", "François", ""], ["Schneider", "Bendix", ""], ["Smerieri", "Anteo", ""], ["Haelterman", "Marc", ""], ["Massar", "Serge", ""]]}, {"id": "1207.2597", "submitter": "Saket Warade Mr.", "authors": "Saket Warade, Jagannath Aghav, Petitpierre Claude, Sandeep Udayagiri", "title": "Automated Training and Maintenance through Kinect", "comments": "14 pages, 5 figures, 1 Algorithm", "journal-ref": "Warades, S; Aghav, J; Claude, P; Udayagiri, S;,\"Automated Training\n  and Maintenance through Kinect,\"International Journal of Computer Science,\n  Engineering and Applications (IJCSEA) Vol.2, No.3, June 2012", "doi": "10.5121/ijcsea.2012.2315", "report-no": null, "categories": "cs.CV cs.ET cs.GR cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we have worked on reducing burden on mechanic involving\ncomplex automobile maintenance activities that are performed in centralised\nworkshops. We have presented a system prototype that combines Augmented Reality\nwith Kinect. With the use of Kinect, very high quality sensors are available at\nconsiderably low costs, thus reducing overall expenditure for system design.\nThe system can be operated either in Speech mode or in Gesture mode. The system\ncan be controlled by various audio commands if user opts for Speech mode. The\nsame controlling can also be done by using a set of Gestures in Gesture mode.\n  Gesture recognition is the task performed by Kinect system. This system,\nbundled with RGB and Depth camera, processes the skeletal data by keeping track\nof 20 different body joints. Recognizing Gestures is done by verifying user\nmovements and checking them against predefined condition. Augmented Reality\nmodule captures real-time image data streams from high resolution camera. This\nmodule then generates 3D model that is superimposed on real time data.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2012 11:17:28 GMT"}], "update_date": "2012-07-12", "authors_parsed": [["Warade", "Saket", ""], ["Aghav", "Jagannath", ""], ["Claude", "Petitpierre", ""], ["Udayagiri", "Sandeep", ""]]}, {"id": "1207.6655", "submitter": "Paul Pham", "authors": "Paul Pham and Krysta M. Svore", "title": "A 2D Nearest-Neighbor Quantum Architecture for Factoring in\n  Polylogarithmic Depth", "comments": "29 pages, 14 figures, 3 tables, presented at Reversible Computation\n  Workshop 2012 in Copenhagen. Updated with numerical circuit resource upper\n  bounds and constant-depth quantum unfanout", "journal-ref": "Quantum Information & Computation 13(11 & 12): 937-962(2013)", "doi": null, "report-no": null, "categories": "quant-ph cs.DS cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We contribute a 2D nearest-neighbor quantum architecture for Shor's algorithm\nto factor an $n$-bit number in $O(\\log^2(n))$ depth. Our implementation uses\nparallel phase estimation, constant-depth fanout and teleportation, and\nconstant-depth carry-save modular addition. We derive upper bounds on the\ncircuit resources of our architecture under a new 2D nearest-neighbor model\nwhich allows a classical controller and parallel, communicating modules. We\nalso contribute a novel constant-depth circuit for unbounded quantum unfanout\nin our new model. Finally, we provide a comparison to all previous\nnearest-neighbor factoring implementations. Our circuit results in an\nexponential improvement in nearest-neighbor circuit depth at the cost of a\npolynomial increase in circuit size and width.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jul 2012 21:12:11 GMT"}, {"version": "v2", "created": "Mon, 22 Apr 2013 05:26:32 GMT"}], "update_date": "2013-04-23", "authors_parsed": [["Pham", "Paul", ""], ["Svore", "Krysta M.", ""]]}, {"id": "1207.6819", "submitter": "Sasikanth Manipatruni", "authors": "Sasikanth Manipatruni, Michal Lipson, Ian A. Young", "title": "Device Considerations for Nanophotonic CMOS Global Interconnects", "comments": "Accepted to IEEE Journal of Special Topics in Quantum Electronics", "journal-ref": null, "doi": "10.1109/JSTQE.2013.2239262", "report-no": null, "categories": "physics.optics cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce an analytical framework to understand the path for scaling\nnanophotonic interconnects to meet the energy and footprint requirements of\nCMOS global interconnects. We derive the device requirements for sub 100\nfJ/cm/bit interconnects including tuning power, serialization-deserialization\nenergy, optical insertion losses, extinction ratio and bit error rates. Using\nCMOS with integrated nanophotonics as an example platform, we derive the\nenergy/bit, linear and areal bandwidth density of optical interconnects. We\nalso derive the targets for device performance which indicate the need for\ncontinued improvements in insertion losses (<8dB), laser efficiency,\noperational speeds (>40 Gb/s), tuning power (<100 {\\mu}W/nm),\nserialization-deserialization (< 10 fJ/bit/Operation) and necessity for\nspectrally selective devices with wavelength multiplexing (> 6 channels).\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2012 01:36:12 GMT"}, {"version": "v2", "created": "Thu, 13 Dec 2012 22:23:45 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Manipatruni", "Sasikanth", ""], ["Lipson", "Michal", ""], ["Young", "Ian A.", ""]]}, {"id": "1207.6821", "submitter": "EPTCS", "authors": "Elham Kashefi (University of Edinburgh, UK), Jean Krivine (University\n  Paris Diderot, France), Femke van Raamsdonk (VU University Amsterdam, The\n  Netherlands)", "title": "Proceedings 7th International Workshop on Developments of Computational\n  Methods", "comments": "EPTCS 88, 2012", "journal-ref": null, "doi": "10.4204/EPTCS.88", "report-no": null, "categories": "cs.CE cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the 7th International Workshop on\nDevelopments in Computational Models (DCM 2011) which was held on Sunday July\n3, 2011, in Zurich, Switzerland, as a satelite workshop of ICALP 2011.\n  Recently several new models of computation have emerged, for instance for\nbio-computing and quantum-computing, and in addition traditional models of\ncomputation have been adapted to accommodate new demands or capabilities of\ncomputer systems. The aim of DCM is to bring together researchers who are\ncurrently developing new computational models or new features for traditional\ncomputational models, in order to foster their interaction, to provide a forum\nfor presenting new ideas and work in progress, and to enable newcomers to learn\nabout current activities in this area.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2012 02:01:37 GMT"}], "update_date": "2012-07-31", "authors_parsed": [["Kashefi", "Elham", "", "University of Edinburgh, UK"], ["Krivine", "Jean", "", "University\n  Paris Diderot, France"], ["van Raamsdonk", "Femke", "", "VU University Amsterdam, The\n  Netherlands"]]}, {"id": "1207.6928", "submitter": "Ella Gale", "authors": "Ella Gale, Ben de Lacy Costello and Andrew Adamatzky", "title": "Filamentary Extension of the Mem-Con theory of Memristance and its\n  Application to Titanium Dioxide Sol-Gel Memristors", "comments": "6 pages, 4 figures, submitted for a conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.mtrl-sci cs.ET physics.chem-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Titanium dioxide sol-gel memristors have two different modes of operation,\nbelieved to be dependent on whether there is bulk memristance, i.e. memristance\nthroughout the whole volume or filamentary memristance, i.e. memristance caused\nby the connection of conducting filaments. The mem-con theory of memristance is\nbased on the drift of oxygen vacancies rather than that of conducting electrons\nand has been previously used to describe bulk memristance in several devices.\nHere, the mem-con theory is extended to model memristance caused by small\nfilaments of low resistance titanium dioxide and it compares favorably to\nexperimental results for filamentary memristance in sol-gel devices.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2012 13:06:14 GMT"}], "update_date": "2012-07-31", "authors_parsed": [["Gale", "Ella", ""], ["Costello", "Ben de Lacy", ""], ["Adamatzky", "Andrew", ""]]}, {"id": "1207.6933", "submitter": "Ella Gale", "authors": "Ella Gale, Ben de Lacy Costello and Andrew Adamatzky", "title": "The Effect of Electrode Size on Memristor Properties: An Experimental\n  and Theoretical Study", "comments": "6 pages, 9 figures, submitted for a conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.mtrl-sci cs.ET physics.chem-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The width of the electrodes is not included in the current phenomenological\nmodels of memristance, but is included in the memory-conservation (mem-con)\ntheory of memristance. An experimental study of the effect of changing the top\nelectrode width was performed on titanium dioxide sol-gel memristors. It was\ndemonstrated that both the on resistance, Ron, and the off resistance, Roff,\ndecreased with increasing electrode size. The memory function part of the\nmem-con model could fit the relationship between Ron and electrode size.\nSimilarly, the conservation function fits the change in Roff. The\nexperimentally measured hysteresis did not fit the phenomenological model's\npredictions. Instead the size of the hysteresis increased with increasing\nelectrode size, and correlated well to decreasing Ron.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jul 2012 13:16:04 GMT"}], "update_date": "2012-07-31", "authors_parsed": [["Gale", "Ella", ""], ["Costello", "Ben de Lacy", ""], ["Adamatzky", "Andrew", ""]]}]