[{"id": "2107.00565", "submitter": "Jonas Cremerius", "authors": "Jonas Cremerius, Mathias Weske", "title": "Data-Enhanced Process Models in Process Mining", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Understanding and improving business processes have become important success\nfactors for organizations. Process mining has proven very successful with a\nvariety of methods and techniques, including discovering process models based\non event logs. Process mining has traditionally focussed on control flow and\ntiming aspects. However, getting insights about a process is not only based on\nactivities and their orderings, but also on the data generated and manipulated\nduring process executions. Today, almost every process activity generates data;\nthese data do not play the role in process mining that it deserves. This paper\nintroduces a visualization technique for enhancing discovered process models\nwith domain data, thereby allowing data-based exploration of processes.\nData-enhanced process models aim at supporting domain experts to explore the\nprocess, where they can select attributes of interest and observe their\ninfluence on the process. The visualization technique is illustrated by the\nMIMIC-IV real-world data set on hospitalizations in the US.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2021 08:47:06 GMT"}], "update_date": "2021-07-02", "authors_parsed": [["Cremerius", "Jonas", ""], ["Weske", "Mathias", ""]]}, {"id": "2107.03282", "submitter": "Matteo B\\\"ohm", "authors": "Matteo B\\\"ohm, Mirco Nanni, Luca Pappalardo", "title": "Improving vehicles' emissions reduction policies by targeting gross\n  polluters", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicles' emissions produce a significant share of cities' air pollution,\nwith a substantial impact on the environment and human health. Traditional\nemission estimation methods use remote sensing stations, missing vehicles' full\ndriving cycle, or focus on a few vehicles. This study uses GPS traces and a\nmicroscopic model to analyse the emissions of four air pollutants from\nthousands of vehicles in three European cities. We discover the existence of\ngross polluters, vehicles responsible for the greatest quantity of emissions,\nand grossly polluted roads, which suffer the greatest amount of emissions. Our\nsimulations show that emissions reduction policies targeting gross polluters\nare way more effective than those limiting circulation based on a non-informed\nchoice of vehicles. Our study applies to any city and may contribute to shaping\nthe discussion on how to measure emissions with digital data.\n", "versions": [{"version": "v1", "created": "Wed, 21 Apr 2021 09:46:16 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["Böhm", "Matteo", ""], ["Nanni", "Mirco", ""], ["Pappalardo", "Luca", ""]]}, {"id": "2107.03327", "submitter": "Saman Sarraf", "authors": "Saman Sarraf and Milton Kabia", "title": "Design an IT Policy Implementation Plan", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Information technology (IT) companies implement multi-dimensional policy\nplans that include procedures, sub-plans, and instructions to outline their\nbusiness scopes, targets, and communications. This work outlined the IT policy\nimplementation plan designed by an imaginary company with a random name called\nNorthcentral Cloud Consulting Firm (NCCF), containing proposed IT policies,\nmilestones and roadmaps, control framework, stakeholder responsibilities,\nknowledge transfer plan, and leadership roles. As NCCF's major customers seek\ndata-driven solutions in cloud computing, the NCCF IT policy plan provides\nvarious data policies, including security and proper usage of machine learning\nservices. The plan offers a detailed roadmap of its financial, geographical,\nand reputational expansion within three years. The IT policy plan also\ncompromises an IT risk management, contingency, and emergency communication\nplan, mainly for protecting data and business continuity. Stakeholder\nresponsibilities are incorporated into the IT policy plan, as NCCF considers\nany engagement with its customers as a collaborative effort in which both\nparties have and share several responsibilities.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2021 07:34:08 GMT"}], "update_date": "2021-07-08", "authors_parsed": [["Sarraf", "Saman", ""], ["Kabia", "Milton", ""]]}, {"id": "2107.03694", "submitter": "Adriano Fazzone", "authors": "Luca Becchetti, Adriano Fazzone and Leonardo Martini", "title": "Network and Sequence-Based Prediction of Protein-Protein Interactions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Typically, proteins perform key biological functions by\ninteracting with each other. As a consequence, predicting which protein pairs\ninteract is a fundamental problem. Experimental methods are slow, expensive,\nand may be error prone. Many computational methods have been proposed to\nidentify candidate interacting pairs. When accurate, they can serve as an\ninexpensive, preliminary filtering stage, to be followed by downstream\nexperimental validation. Among such methods, sequence-based ones are very\npromising.\n  Results: We present MPS(T&B) (Maximum Protein Similarity Topological and\nBiological), a new algorithm that leverages both topological and biological\ninformation to predict protein-protein interactions. We comprehensively compare\nMPS(T) and MPS(T&B) with state-of-the-art approaches on reliable PPIs datasets,\nshowing that they have competitive or higher accuracy on biologically validated\ntest sets.\n  Conclusion: MPS(T) and MPS(T&B) are topological only and topological plus\nsequence-based computational methods that can effectively predict the entire\nhuman interactome.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jul 2021 09:16:46 GMT"}], "update_date": "2021-07-09", "authors_parsed": [["Becchetti", "Luca", ""], ["Fazzone", "Adriano", ""], ["Martini", "Leonardo", ""]]}, {"id": "2107.06067", "submitter": "Eduardo Mizraji", "authors": "Eduardo Mizraji", "title": "Generalized \"Square roots of Not\" matrices, their application to the\n  unveiling of hidden logical operators and to the definition of fully matrix\n  circular Euler functions", "comments": "25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.ET quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The square root of Not is a logical operator of importance in quantum\ncomputing theory and of interest as a mathematical object in its own right. In\nphysics, it is a square complex matrix of dimension 2. In the present work it\nis a complex square matrix of arbitrary dimension. The introduction of linear\nalgebra into logical theory has been enhanced in recent decades by the\nresearches in the field of neural networks and quantum computing. Here we will\nmake a brief description of the representation of logical operations through\nmatrices and we show how general expressions for the two square roots of the\nNot operator are obtained. Then, we explore two topics. First, we study an\nextension to a non-quantum domain of a short form of Deutsch's algorithm. Then,\nwe assume that a root of Not is a matrix extension of the imaginary unit i, and\nunder this idea we obtain fully matrix versions for the Euler expansions and\nfor the representations of circular functions by complex exponentials.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jun 2021 03:43:53 GMT"}, {"version": "v2", "created": "Wed, 14 Jul 2021 11:03:28 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["Mizraji", "Eduardo", ""]]}, {"id": "2107.06664", "submitter": "Davi Guimar\\~aes", "authors": "Davi Guimar\\~aes da Silva, Marla Teresinha Barbosa Geller, Dalton\n  Felipe Silva Var\\~ao, Jo\\~ao Bentes, Mauro S\\'ergio dos Santos Moura, Yasmin\n  Braga Teixeira, Clayton Andr\\'e Maia dos Santos, Anderson Alvarenga de Moura\n  Meneses", "title": "EnergySaver Software Manual", "comments": "8 pages, in Portuguese, 21 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.SE", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Energy efficiency is a topic that has attracted the attention of researchers\nin recent years, in order to seek sustainability solutions for energy\nproduction and reduction of its costs, aiming to provide a balance between\ndevelopment and protection of natural resources. Thus, we proposed the\nEnergySaver software that has as its objective the monitoring of electric\nenergy consumption, from data capture to consumption forecast for the following\nmonth. To create Energy Saver, we used Open Source technologies applied to the\nInternet of Things (IoT), embedded systems, and Long Short-Term Memory Neural\nNetworks (LSTM). However, in order to have harmony between the current\nresearchers and those who may manipulate this software in the future, it is\nessential to create a Software Manual, where all the details of its\nimplementation are described in detail. Therefore, this article describes all\nthe steps for the implementation of the system, from the methodological scheme\nof the system, its modeling with UML, to the modules that compose it, becoming\na Manual for its use.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jul 2021 13:25:20 GMT"}], "update_date": "2021-07-15", "authors_parsed": [["da Silva", "Davi Guimarães", ""], ["Geller", "Marla Teresinha Barbosa", ""], ["Varão", "Dalton Felipe Silva", ""], ["Bentes", "João", ""], ["Moura", "Mauro Sérgio dos Santos", ""], ["Teixeira", "Yasmin Braga", ""], ["Santos", "Clayton André Maia dos", ""], ["Meneses", "Anderson Alvarenga de Moura", ""]]}, {"id": "2107.06814", "submitter": "J\\\"urgen Maier", "authors": "J\\\"urgen Maier", "title": "Gain and Pain of a Reliable Delay Model", "comments": "9 pages, 11 figures, 2 tables, extension of conference submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.AR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  State-of-the-art digital circuit design tools almost exclusively rely on pure\nand inertial delay for timing simulations. While these provide reasonable\nestimations at very low execution time in the average case, their ability to\ncover complex signal traces is limited. Research has provided the dynamic\nInvolution Delay Model (IDM) as a promising alternative, which was shown (i) to\ndepict reality more closely and recently (ii) to be compatible with modern\nsimulation suites. In this paper we complement these encouraging results by\nexperimentally exploring the behavioral coverage for more advanced circuits. In\ndetail we apply the IDM to three simple circuits (a combinatorial loop, an SR\nlatch and an adder), interpret the delivered results and evaluate the overhead\nin realistic settings. Comparisons to digital (inertial delay) and analog\n(SPICE) simulations reveal, that the IDM delivers very fine-grained results,\nwhich match analog simulations very closely. Moreover, severe shortcomings of\ninertial delay become apparent in our simulations, as it fails to depict a\nrange of malicious behaviors. Overall the Involution Delay Model hence\nrepresents a viable upgrade to the available delay models in modern digital\ntiming simulation tools.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2021 11:32:44 GMT"}, {"version": "v2", "created": "Mon, 19 Jul 2021 06:50:22 GMT"}], "update_date": "2021-07-20", "authors_parsed": [["Maier", "Jürgen", ""]]}, {"id": "2107.07745", "submitter": "Igor Ivkic", "authors": "Patrizia Sailer, Igor Ivkic, Markus Tauber, Andreas Mauthe, Antonios\n  Gouglidis", "title": "Analysing Design Approaches for the Power Consumption in Cyber-Physical\n  Systems", "comments": "IEEE Link: https://ieeexplore.ieee.org/document/9464065", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The importance of Cyber Physical Systems (CPS) and Internet of Things (IoT)\napplications is constantly increasing, especially in the context of Industry\n4.0. Architectural decisions are crucial not just for performance, security and\nresilience reasons but also regarding costs and resource usage. In this paper\nwe analyse two of the fundamental approaches to design control loops (i.e.\ntime-driven and event-driven), show how they can be realised and evaluate their\npower requirements. Through this the design criteria can be extended also\nconsidering the optimization of energy related aspects.\n", "versions": [{"version": "v1", "created": "Fri, 16 Jul 2021 07:46:06 GMT"}], "update_date": "2021-07-19", "authors_parsed": [["Sailer", "Patrizia", ""], ["Ivkic", "Igor", ""], ["Tauber", "Markus", ""], ["Mauthe", "Andreas", ""], ["Gouglidis", "Antonios", ""]]}, {"id": "2107.08321", "submitter": "Omer Aydin", "authors": "Omer Aydin, Ibrahim Ismail Erhan", "title": "Video or Image Transmission Security for ESP-EYE IoT device used in\n  Business Processes", "comments": null, "journal-ref": "Ayd{\\i}n, \\\"O , Erhan, \\.I . (2021). Video or Image Transmission\n  Security for ESP-EYE IoT device used in Business Processes . Y\\\"onetim\n  Bili\\c{s}im Sistemleri Dergisi , 7 (1) , 1-9 . Retrieved from\n  https://dergipark.org.tr/tr/pub/ybs/issue/63606/857203", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Internet of Things is the name of a communication network that is formed by\nphysical objects such as RFID tags, sensors and some lightweight development\nplatforms that have the ability to connect to the internet. While the devices\ncan communicate among themselves in this network, they can also be part of a\nlarge network. The data produced by those physical objects which are the member\nof IoT network are processed by different methods and the outputs obtained are\nused in processes such as decision making and learning. With this aspect of the\nInternet of Things, it affects all areas of human life and its number is\nincreasing day by day. These devices appear to have security gaps due to their\nlimited resources, their wide range of usage area and incomplete security\nstandards. These devices, which are located in people's living areas,\nmanufacturing and business processes also cause difficulties in protecting\nprivacy. In this study, a solution has been developed for the communication\nsecurity of the internet of things called ESP-Eye which includes a camera,\nwireless communication module and face recognition software. The proposed\nsolution was implemented on the ESP-Eye.\n", "versions": [{"version": "v1", "created": "Sat, 17 Jul 2021 23:17:14 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Aydin", "Omer", ""], ["Erhan", "Ibrahim Ismail", ""]]}, {"id": "2107.09668", "submitter": "Pegdwende Minoungou", "authors": "Pegdwende Minoungou, Vincent Mousseau, Wassila Ouerdane, Paolo Scotton", "title": "Learning MR-Sort Models from Non-Monotone Data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Majority Rule Sorting (MR-Sort) method assigns alternatives evaluated on\nmultiple criteria to one of the predefined ordered categories. The Inverse\nMR-Sort problem (Inv-MR-Sort) computes MR-Sort parameters that match a dataset.\nExisting learning algorithms for Inv-MR-Sort consider monotone preferences on\ncriteria. We extend this problem to the case where the preferences on criteria\nare not necessarily monotone, but possibly single-peaked (or single-valley). We\npropose a mixed-integer programming based algorithm that learns the preferences\non criteria together with the other MR-Sort parameters from the training data.\nWe investigate the performance of the algorithm using numerical experiments and\nwe illustrate its use on a real-world case study.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jul 2021 13:51:16 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Minoungou", "Pegdwende", ""], ["Mousseau", "Vincent", ""], ["Ouerdane", "Wassila", ""], ["Scotton", "Paolo", ""]]}, {"id": "2107.14029", "submitter": "Carsten Vogel", "authors": "Carsten Vogel and Johannes Schobel and Winfried Schlee and Milena\n  Engelke and R\\\"udiger Pryss", "title": "UNITI Mobile -- EMI-Apps for a Large-Scale European Study on Tinnitus", "comments": "Accepted for presentation at the 43rd Annual International Conference\n  of the IEEE Engineering in Medicine and Biology Society October 31 November\n  4, 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  More and more observational studies exploit the achievements of mobile\ntechnology to ease the overall implementation procedure. Many strategies like\ndigital phenotyping, ecological momentary assessments or mobile crowdsensing\nare used in this context. Recently, an increasing number of intervention\nstudies makes use of mobile technology as well. For the chronic disorder\ntinnitus, only few long-running intervention studies exist, which use mobile\ntechnology in a larger setting. Tinnitus is characterized by its heterogeneous\npatient's symptom profiles, which complicates the development of general\ntreatments. In the UNITI project, researchers from different European countries\ntry to unify existing treatments and interventions to cope with this\nheterogeneity. One study arm (UNITI Mobile) exploits mobile technology to\ninvestigate newly implemented interventions types, especially within the\npan-European setting. The goals are to learn more about the validity and\nusefulness of mobile technology in this context. Furthermore, differences among\nthe countries shall be investigated. Practically, two native intervention apps\nhave been developed for UNITI and the mobile study arm, which pose features not\npresented so far in other apps of the authors. Along the implementation\nprocedure, it is discussed whether these features might leverage similar types\nof studies in future. Since instruments like the mHealth evidence reporting and\nassessment checklist (mERA), developed by the WHO mHealth technical evidence\nreview group, indicate that aspects shown for UNITI Mobile are important in the\ncontext of health interventions using mobile phones, our findings may be of a\nmore general interest and are therefore being discussed in the work at hand.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jul 2021 20:31:00 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Vogel", "Carsten", ""], ["Schobel", "Johannes", ""], ["Schlee", "Winfried", ""], ["Engelke", "Milena", ""], ["Pryss", "Rüdiger", ""]]}, {"id": "2107.14109", "submitter": "Omer Aydin", "authors": "Suleyman Yukcu, Omer Aydin", "title": "Digital Twin As A Cost Reduction Method", "comments": "Digital Twin, Cost Accounting, Cyber Physical Systems, Artificial\n  Intelligence, Internet of Things, Sensor", "journal-ref": "Muhasebe Bilim Dunyas{\\i} Dergisi , 22 (3) , 563-579", "doi": "10.31460/mbdd.694571", "report-no": null, "categories": "cs.OH econ.GN q-fin.EC q-fin.GN", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Many fields have been affected by the introduction of concepts such as\nsensors, industry 4.0, internet of things, machine learning and artificial\nintelligence in recent years. As a result of the interaction of cyber physical\nsystems with these concepts, digital twin model has emerged. The concept of\ndigital twin has been used in many areas with its emergence. The use of this\nmodel has made significant gains, especially in decision making processes. The\ngains in decision making processes contribute to every field and cause changes\nin terms of cost. In this study, the historical development of the concept of\ndigital twin has been mentioned and general information about the usage areas\nof digital twin has been given. In the light of this information, the cost\neffect of the digital twin model, therefore its appearance from the cost\naccounting window and its use as a cost reduction method were evaluated. This\nstudy was carried out in order to shed light on the studies with the\ninsufficient resources in the Turkish literature and the cost accounting\nperspective.\n", "versions": [{"version": "v1", "created": "Sat, 10 Jul 2021 22:01:34 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Yukcu", "Suleyman", ""], ["Aydin", "Omer", ""]]}]