[{"id": "1104.1717", "submitter": "Olivier Pironneau Pr", "authors": "Frederic Alauzet and Olivier Pironneau", "title": "Continuous and Discrete Adjoints to the Euler Equations for Fluids", "comments": "30 pages 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE math.NA physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adjoints are used in optimization to speed-up computations, simplify\noptimality conditions or compute sensitivities. Because time is reversed in\nadjoint equations with first order time derivatives, boundary conditions and\ntransmission conditions through shocks can be difficult to understand. In this\narticle we analyze the adjoint equations that arise in the context of\ncompressible flows governed by the Euler equations of fluid dynamics. We show\nthat the continuous adjoints and the discrete adjoints computed by automatic\ndifferentiation agree numerically; in particular the adjoint is found to be\ncontinuous at the shocks and usually discontinuous at contact discontinuities\nby both.\n", "versions": [{"version": "v1", "created": "Sat, 9 Apr 2011 16:05:32 GMT"}], "update_date": "2011-04-12", "authors_parsed": [["Alauzet", "Frederic", ""], ["Pironneau", "Olivier", ""]]}, {"id": "1104.2124", "submitter": "Michel Fliess", "authors": "Michel Fliess (LIX), C\\'edric Join (CRAN, INRIA Saclay - Ile de\n  France), Fr\\'ed\\'eric Hatt", "title": "Is a probabilistic modeling really useful in financial engineering? -\n  A-t-on vraiment besoin d'un mod\\`ele probabiliste en ing\\'enierie\n  financi\\`ere ?", "comments": "Conf\\'erence M\\'editerran\\'eenne sur l'Ing\\'enierie S\\^ure des\n  Syst\\`emes Complexes, MISC 2011, Agadir : Maroc (2011)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.CE q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new standpoint on financial time series, without the use of any\nmathematical model and of probabilistic tools, yields not only a rigorous\napproach of trends and volatility, but also efficient calculations which were\nalready successfully applied in automatic control and in signal processing. It\nis based on a theorem due to P. Cartier and Y. Perrin, which was published in\n1995. The above results are employed for sketching a dynamical portfolio and\nstrategy management, without any global optimization technique. Numerous\ncomputer simulations are presented.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2011 07:16:17 GMT"}, {"version": "v2", "created": "Mon, 9 May 2011 08:01:48 GMT"}], "update_date": "2011-05-11", "authors_parsed": [["Fliess", "Michel", "", "LIX"], ["Join", "Cédric", "", "CRAN, INRIA Saclay - Ile de\n  France"], ["Hatt", "Frédéric", ""]]}, {"id": "1104.3513", "submitter": "Kodge B. G.", "authors": "B. G. Kodge, P. S. Hiremath", "title": "An Effect of Spatial Filtering in Visualization of Coronary Arteries\n  Imaging", "comments": "06 Pages, 18 figures", "journal-ref": "International Journal of Computer Science & Information Technology\n  (IJCSIT), Vol. 2, No. 1, 2009, PP: 35-40", "doi": null, "report-no": null, "categories": "cs.CV cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  At present, coronary angiography is the well known standard for the diagnosis\nof coronary artery disease. Conventional coronary angiography is an invasive\nprocedure with a small, yet inherent risk of myocardial infarction, stroke,\npotential arrhythmias, and death. Other noninvasive diagnostic tools, such as\nelectrocardiography, echocardiography, and nuclear imaging are now widely\navailable but are limited by their inability to directly visualize and quantify\ncoronary artery stenoses and predict the stability of plaques. Coronary\nmagnetic resonance angiography (MRA) is a technique that allows visualization\nof the coronary arteries by noninvasive means; however, it has not yet reached\na stage where it can be used in routine clinical practice. Although coronary\nMRA is a potentially useful diagnostic tool, it has limitations. Further\nresearch should focus on improving the diagnostic resolution and accuracy of\ncoronary MRA. This paper will helps to cardiologists to take the clear look of\nspatial filtered imaging of coronary arteries.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2011 12:35:47 GMT"}], "update_date": "2011-04-19", "authors_parsed": [["Kodge", "B. G.", ""], ["Hiremath", "P. S.", ""]]}, {"id": "1104.3571", "submitter": "Kodge B. G.", "authors": "B. G. Kodge, P. S. Hiremath", "title": "Visualization techniques for data mining of Latur district satellite\n  imagery", "comments": "This paper has been withdrawn by the author", "journal-ref": "Advances in Computational Research, Volume 2, Issue 1, 2010,\n  pp-21-24", "doi": null, "report-no": null, "categories": "cs.CE cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study presents a new visualization tool for classification of satellite\nimagery. Visualization of feature space allows exploration of patterns in the\nimage data and insight into the classification process and related uncertainty.\nVisual Data Mining provides added value to image classifications as the user\ncan be involved in the classification process providing increased confidence in\nand understanding of the results. In this study, we present a prototype\nvisualization tool for visual data mining (VDM) of satellite imagery. The\nvisualization tool is showcased in a classification study of highresolution\nimageries of Latur district in Maharashtra state of India.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2011 12:35:11 GMT"}, {"version": "v2", "created": "Fri, 11 May 2012 05:42:42 GMT"}], "update_date": "2012-05-14", "authors_parsed": [["Kodge", "B. G.", ""], ["Hiremath", "P. S.", ""]]}, {"id": "1104.3801", "submitter": "Masaaki Miki", "authors": "Masaaki Miki", "title": "Extended force density method and its expressions", "comments": "Revised version of already published paper for J. IASS, submitted for\n  Elsevier Engineering Structures but rejected", "journal-ref": "M. Miki, K. Kawaguchi, Extended Force Density Method for\n  Form-Finding of Tension Structures, J. of IASS. 51 (2010) 291-303", "doi": null, "report-no": null, "categories": "cs.CE math-ph math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective of this work can be divided into two parts. The first one is to\npropose an extension of the force density method (FDM)(H.J. Schek, 1974), a\nform-finding method for prestressed cable-net structures. The second one is to\npresent a review of various form-finding methods for tension structures, in the\nrelation with the extended FDM. In the first part, it is pointed out that the\noriginal FDM become useless when it is applied to the prestressed structures\nthat consist of combinations of both tension and compression members, while the\nFDM is usually advantageous in form-finding analysis of cable-nets. To\neliminate the limitation, a functional whose stationary problem simply\nrepresents the FDM is firstly proposed. Additionally, the existence of a\nvariational principle in the FDM is also indicated. Then, the FDM is\nextensively redefined by generalizing the formulation of the functional. As the\nresult, the generalized functionals enable us to find the forms of tension\nstructures that consist of combinations of both tension and compression\nmembers, such as tensegrities and suspended membranes with compression struts.\nIn the second part, it is indicated the important role of three expressions\nused by the description of the extended FDM, such as stationary problems of\nfunctionals, the principle of virtual work and stationary conditions using\nNabla symbol. They can be commonly found in general problems of statics,\nwhereas the original FDM only provides a particular form of equilibrium\nequation. Then, to demonstrate the advantage of such expressions, various\nform-finding methods are reviewed and compared. As the result, the common\nfeatures and the differences over various form-finding methods are examined.\nFinally, to give an overview of the reviewed methods, the corresponding\nexpressions are shown in the form of three tables.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2011 16:45:04 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Miki", "Masaaki", ""]]}, {"id": "1104.4668", "submitter": "Massimiliano Vasile Massimiliano Vasile", "authors": "Matteo Ceriotti and Massimiliano Vasile", "title": "MGA trajectory planning with an ACO-inspired algorithm", "comments": null, "journal-ref": "Acta Astronautica, 67 (9-10). pp. 1202-1217, ISSN 0094-5765, 2010", "doi": null, "report-no": null, "categories": "cs.CE cs.NE cs.SY math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a set of celestial bodies, the problem of finding an optimal sequence\nof swing-bys, deep space manoeuvres (DSM) and transfer arcs connecting the\nelements of the set is combinatorial in nature. The number of possible paths\ngrows exponentially with the number of celestial bodies. Therefore, the design\nof an optimal multiple gravity assist (MGA) trajectory is a NP-hard mixed\ncombinatorial-continuous problem. Its automated solution would greatly improve\nthe design of future space missions, allowing the assessment of a large number\nof alternative mission options in a short time. This work proposes to formulate\nthe complete automated design of a multiple gravity assist trajectory as an\nautonomous planning and scheduling problem. The resulting scheduled plan will\nprovide the optimal planetary sequence and a good estimation of the set of\nassociated optimal trajectories. The trajectory model consists of a sequence of\ncelestial bodies connected by twodimensional transfer arcs containing one DSM.\nFor each transfer arc, the position of the planet and the spacecraft, at the\ntime of arrival, are matched by varying the pericentre of the preceding\nswing-by, or the magnitude of the launch excess velocity, for the first arc.\nFor each departure date, this model generates a full tree of possible transfers\nfrom the departure to the destination planet. Each leaf of the tree represents\na planetary encounter and a possible way to reach that planet. An algorithm\ninspired by Ant Colony Optimization (ACO) is devised to explore the space of\npossible plans. The ants explore the tree from departure to destination adding\none node at the time: every time an ant is at a node, a probability function is\nused to select a feasible direction. This approach to automatic trajectory\nplanning is applied to the design of optimal transfers to Saturn and among the\nGalilean moons of Jupiter.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2011 00:58:35 GMT"}], "update_date": "2011-04-26", "authors_parsed": [["Ceriotti", "Matteo", ""], ["Vasile", "Massimiliano", ""]]}, {"id": "1104.4720", "submitter": "Hadi Poormohammadi", "authors": "Ruzbeh Tusserkani and Changiz Eslahchi and Hadi Poormohammadi and Azin\n  Azadi", "title": "TripNet: A Method for Constructing Phylogenetic Networks from Triplets", "comments": "12 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.PE q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We present TripNet, a method for constructing phylogenetic networks from\ntriplets. We will present the motivations behind our approach and its\ntheoretical and empirical justification. To demonstrate the accuracy and\nefficiency of TripNet, we performed two simulations and also applied the method\nto five published data sets: Kreitman's data, a set of triplets from real yeast\ndata obtained from the Fungal Biodiversity Center in Utrecht, a collection of\n110 highly recombinant Salmonella multi-locus sequence typing sequences, and\nnrDNA ITS and cpDNA JSA sequence data of New Zealand alpine buttercups of\nRanunculus sect. Pseudadonis. Finally, we compare our results with those\nalready obtained by other authors using alternative methods. TripNet, data\nsets, and supplementary files are freely available for download at\n(www.bioinf.cs.ipm.ir/softwares/tripnet).\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2011 13:44:25 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Tusserkani", "Ruzbeh", ""], ["Eslahchi", "Changiz", ""], ["Poormohammadi", "Hadi", ""], ["Azadi", "Azin", ""]]}, {"id": "1104.4731", "submitter": "Massimiliano Vasile", "authors": "Massimiliano Vasile, Edmondo Minisci, Marco Locatelli", "title": "An inflationary differential evolution algorithm for space trajectory\n  optimization", "comments": "IEEE Transactions on Evolutionary Computation 2011. ISSN 1089-778X", "journal-ref": null, "doi": "10.1109/TEVC.2010.2087026", "report-no": null, "categories": "cs.CE cs.NA cs.NE cs.SY math.OC nlin.CD", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we define a discrete dynamical system that governs the\nevolution of a population of agents. From the dynamical system, a variant of\nDifferential Evolution is derived. It is then demonstrated that, under some\nassumptions on the differential mutation strategy and on the local structure of\nthe objective function, the proposed dynamical system has fixed points towards\nwhich it converges with probability one for an infinite number of generations.\nThis property is used to derive an algorithm that performs better than standard\nDifferential Evolution on some space trajectory optimization problems. The\nnovel algorithm is then extended with a guided restart procedure that further\nincreases the performance, reducing the probability of stagnation in deceptive\nlocal minima.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2011 15:05:04 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Vasile", "Massimiliano", ""], ["Minisci", "Edmondo", ""], ["Locatelli", "Marco", ""]]}, {"id": "1104.5510", "submitter": "Fahad Saeed", "authors": "Fahad Saeed, Trairak Pisitkun, Mark A. Knepper and Jason D. Hoffert", "title": "Mining Temporal Patterns from iTRAQ Mass Spectrometry(LC-MS/MS) Data", "comments": "12 pages, 10 figures, The Proceedings of the ISCA 3rd International\n  Conference on Bioinformatics and Computational Biology (BiCoB), pp 152-159\n  New Orleans, Louisiana, USA, March 23-25, 2011 (ISBN: 978-1-880843-81-9)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CE cs.DB cs.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large-scale proteomic analysis is emerging as a powerful technique in biology\nand relies heavily on data acquired by state-of-the-art mass spectrometers. As\nwith any other field in Systems Biology, computational tools are required to\ndeal with this ocean of data. iTRAQ (isobaric Tags for Relative and Absolute\nquantification) is a technique that allows simultaneous quantification of\nproteins from multiple samples. Although iTRAQ data gives useful insights to\nthe biologist, it is more complex to perform analysis and draw biological\nconclusions because of its multi-plexed design. One such problem is to find\nproteins that behave in a similar way (i.e. change in abundance) among various\ntime points since the temporal variations in the proteomics data reveal\nimportant biological information. Distance based methods such as Euclidian\ndistance or Pearson coefficient, and clustering techniques such as k-mean etc,\nare not able to take into account the temporal information of the series. In\nthis paper, we present an linear-time algorithm for clustering similar patterns\namong various iTRAQ time course data irrespective of their absolute values. The\nalgorithm, referred to as Temporal Pattern Mining(TPM), maps the data from a\nCartesian plane to a discrete binary plane. After the mapping a dynamic\nprogramming technique allows mining of similar data elements that are\ntemporally closer to each other. The proposed algorithm accurately clusters\niTRAQ data that are temporally closer to each other with more than 99%\naccuracy. Experimental results for different problem sizes are analyzed in\nterms of quality of clusters, execution time and scalability for large data\nsets. An example from our proteomics data is provided at the end to demonstrate\nthe performance of the algorithm and its ability to cluster temporal series\nirrespective of their distance from each other.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2011 20:41:43 GMT"}], "update_date": "2011-05-02", "authors_parsed": [["Saeed", "Fahad", ""], ["Pisitkun", "Trairak", ""], ["Knepper", "Mark A.", ""], ["Hoffert", "Jason D.", ""]]}]