[{"id": "1005.0503", "submitter": "Richard Brent", "authors": "Adam W. Bojanczyk, Richard P. Brent and Frank R. de Hoog", "title": "A weakly stable algorithm for general Toeplitz systems", "comments": "17 pages. An old Technical Report with postscript added. For further\n  details, see http://wwwmaths.anu.edu.au/~brent/pub/pub143.html", "journal-ref": "Stability analysis of a general Toeplitz system solver, Numerical\n  Algorithms 10 (1995), 225-244.", "doi": "10.1007/BF02140770", "report-no": "Technical Report TR-CS-93-15, Computer Sciences Laboratory,\n  Australian National University, August 1993 (revised June 1994).", "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that a fast algorithm for the QR factorization of a Toeplitz or\nHankel matrix A is weakly stable in the sense that R^T.R is close to A^T.A.\nThus, when the algorithm is used to solve the semi-normal equations R^T.Rx =\nA^Tb, we obtain a weakly stable method for the solution of a nonsingular\nToeplitz or Hankel linear system Ax = b. The algorithm also applies to the\nsolution of the full-rank Toeplitz or Hankel least squares problem.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2010 12:27:15 GMT"}], "update_date": "2015-05-18", "authors_parsed": [["Bojanczyk", "Adam W.", ""], ["Brent", "Richard P.", ""], ["de Hoog", "Frank R.", ""]]}, {"id": "1005.0667", "submitter": "Richard Brent", "authors": "Douglas R. Sweet and Richard P. Brent", "title": "Error analysis of a partial pivoting method for structured matrices", "comments": "18 pages. An old Technical Report, submitted for archival purposes.\n  For further details see http://wwwmaths.anu.edu.au/~brent/pub/pub157.html", "journal-ref": "Proceedings SPIE, Volume 2563, Advanced Signal Processing\n  Algorithms, 1995, 266-280", "doi": "10.1117/12.211404", "report-no": "Technical Report TR-CS-95-03, Computer Sciences Laboratory,\n  Australian National University, June 1995", "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many matrices that arise in the solution of signal processing problems have a\nspecial displacement structure. For example, adaptive filtering and\ndirection-of-arrival estimation yield matrices of Toeplitz type. A recent\nmethod of Gohberg, Kailath and Olshevsky (GKO) allows fast Gaussian elimination\nwith partial pivoting for such structured matrices. In this paper, a rounding\nerror analysis is performed on the Cauchy and Toeplitz variants of the GKO\nmethod. It is shown the error growth depends on the growth in certain auxiliary\nvectors, the generators, which are computed by the GKO algorithms. It is also\nshown that in certain circumstances, the growth in the generators can be large,\nand so the error growth is much larger than would be encountered with normal\nGaussian elimination with partial pivoting. A modification of the algorithm to\nperform a type of row-column pivoting is proposed; it may ameliorate this\nproblem.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 04:28:52 GMT"}], "update_date": "2021-07-05", "authors_parsed": [["Sweet", "Douglas R.", ""], ["Brent", "Richard P.", ""]]}, {"id": "1005.0671", "submitter": "Richard Brent", "authors": "Richard P. Brent", "title": "Stability of fast algorithms for structured linear systems", "comments": "13 pages. An old Technical Report (CSL, ANU, September 1997, 13\n  pages), submitted for archival purposes. For further details see\n  http://wwwmaths.anu.edu.au/~brent/pub/pub177.html", "journal-ref": "Fast reliable algorithms for matrices with structure, SIAM, 1999,\n  103-116", "doi": "10.1137/1.9781611971354.ch4", "report-no": "TR-CS-97-18", "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We survey the numerical stability of some fast algorithms for solving systems\nof linear equations and linear least squares problems with a low\ndisplacement-rank structure. For example, the matrices involved may be Toeplitz\nor Hankel. We consider algorithms which incorporate pivoting without destroying\nthe structure, and describe some recent results on the stability of these\nalgorithms. We also compare these results with the corresponding stability\nresults for the well known algorithms of Schur/Bareiss and Levinson, and for\nalgorithms based on the semi-normal equations.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 04:59:19 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Brent", "Richard P.", ""]]}, {"id": "1005.0747", "submitter": "Verena Wolf", "authors": "Thomas A. Henzinger, Maria Mateescu, Linar Mikeev, Verena Wolf", "title": "Hybrid Numerical Solution of the Chemical Master Equation", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a numerical approximation technique for the analysis of\ncontinuous-time Markov chains that describe networks of biochemical reactions\nand play an important role in the stochastic modeling of biological systems.\nOur approach is based on the construction of a stochastic hybrid model in which\ncertain discrete random variables of the original Markov chain are approximated\nby continuous deterministic variables. We compute the solution of the\nstochastic hybrid model using a numerical algorithm that discretizes time and\nin each step performs a mutual update of the transient probability distribution\nof the discrete stochastic variables and the values of the continuous\ndeterministic variables. We implemented the algorithm and we demonstrate its\nusefulness and efficiency on several case studies from systems biology.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 13:19:13 GMT"}], "update_date": "2010-05-06", "authors_parsed": [["Henzinger", "Thomas A.", ""], ["Mateescu", "Maria", ""], ["Mikeev", "Linar", ""], ["Wolf", "Verena", ""]]}, {"id": "1005.0762", "submitter": "Richard Brent", "authors": "Richard P. Brent", "title": "Note on Computing Ratings from Eigenvectors", "comments": "10 pages. Dedicated to Gene Golub 1932-2007.", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of computing ratings using the results of games\nplayed between a set of n players, and show how this problem can be reduced to\ncomputing the positive eigenvectors corresponding to the dominant eigenvalues\nof certain n by n matrices. There is a close connection with the stationary\nprobability distributions of certain Markov chains. In practice, if n is large,\nthen the matrices involved will be sparse, and the power method may be used to\nsolve the eigenvalue problems efficiently. We give an algorithm based on the\npower method, and also derive the same algorithm by an independent method.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2010 14:23:45 GMT"}], "update_date": "2010-05-06", "authors_parsed": [["Brent", "Richard P.", ""]]}, {"id": "1005.0909", "submitter": "Richard Brent", "authors": "Richard P. Brent", "title": "George Forsythe's last paper", "comments": "10 pages. Text of an invited talk presented at the Stanford 50\n  Conference celebrating the 50th anniversary of George Forsythe's arrival at\n  Stanford and the 75th birthday of Gene Golub. For further details see\n  http://wwwmaths.anu.edu.au/~brent/pub/pub238.html", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA math.NA stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe von Neumann's elegant idea for sampling from the exponential\ndistribution, Forsythe's generalization for sampling from a probability\ndistribution whose density has the form exp(-G(x)), where G(x) is easy to\ncompute (e.g. a polynomial), and my refinement of these ideas to give an\nefficient algorithm for generating pseudo-random numbers with a normal\ndistribution. Later developments are also mentioned.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2010 07:27:48 GMT"}, {"version": "v2", "created": "Fri, 7 May 2010 03:01:58 GMT"}], "update_date": "2010-05-10", "authors_parsed": [["Brent", "Richard P.", ""]]}, {"id": "1005.1320", "submitter": "Richard Brent", "authors": "Richard P. Brent", "title": "The myth of equidistribution for high-dimensional simulation", "comments": "8 pages. Based on material presented at a Workshop on High\n  Dimensional Approximation held at the Australian National University,\n  Canberra, 19 February 2007. For further details, see\n  http://wwwmaths.anu.edu.au/~brent/pub/pub240.html", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.DS cs.NA math.NA math.NT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A pseudo-random number generator (RNG) might be used to generate w-bit random\nsamples in d dimensions if the number of state bits is at least dw. Some RNGs\nperform better than others and the concept of equidistribution has been\nintroduced in the literature in order to rank different RNGs. We define what it\nmeans for a RNG to be (d,w)-equidistributed, and then argue that\n(d,w)-equidistribution is not necessarily a desirable property.\n", "versions": [{"version": "v1", "created": "Sat, 8 May 2010 05:14:00 GMT"}], "update_date": "2010-05-11", "authors_parsed": [["Brent", "Richard P.", ""]]}, {"id": "1005.1417", "submitter": "Youssef Elfoutayeni", "authors": "Youssef Elfoutayeni (LMDP), Mohamed Khaladi (LMDP)", "title": "Using vector divisions in solving linear complementarity problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The linear complementarity problem is to find vector $z$ in $\\mathrm{IR}^{n}$\nsatisfying $z^{T}(Mz+q)=0$, $Mz+q\\geqslant0,$ $z\\geqslant0$, where $M$ as a\nmatrix and $q$ as a vector, are given data; this problem becomes in present the\nsubject of much important research because it arises in many areas and it\nincludes important fields, we cite for example the linear and nonlinear\nprogramming, the convex quadratic programming and the variational inequalities\nproblems, ... It is known that the linear complementarity problem is completely\nequivalent to solving nonlinear equation $F(x)=0$ with $F$ is a function from\n$\\mathrm{IR}^{n}$ into itself defined by $F(x)=(M+I)x+(M-I)|x|+q$. In this\npaper we propose a globally convergent hybrid algorithm for solving this\nequation; this method is based on an algorithm given by Shi \\cite{Y. Shi}, he\nuses vector divisions with the secant method; but for using this method we must\nhave a function continuous with partial derivatives on an open set of\n$\\mathrm{IR}^{n}$; so we built a sequence of functions $\\tilde{F}(p,x)\\in\nC^{\\infty}$ which converges uniformly to the function $F(x)$; and we show that\nfinding the zero of the function $F$ is completely equivalent to finding the\nzero of the sequence of the functions $\\tilde{F}(p,x)$. We close our paper with\nsome numerical simulation examples to illustrate our theoretical results.\n", "versions": [{"version": "v1", "created": "Sun, 9 May 2010 18:38:02 GMT"}], "update_date": "2010-05-31", "authors_parsed": [["Elfoutayeni", "Youssef", "", "LMDP"], ["Khaladi", "Mohamed", "", "LMDP"]]}, {"id": "1005.1497", "submitter": "Shekhar Chandra", "authors": "Shekhar S. Chandra", "title": "Fast Digital Convolutions using Bit-Shifts", "comments": "4 pages, 2 figures, submitted to IEEE Signal Processing Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An exact, one-to-one transform is presented that not only allows digital\ncircular convolutions, but is free from multiplications and quantisation errors\nfor transform lengths of arbitrary powers of two. The transform is analogous to\nthe Discrete Fourier Transform, with the canonical harmonics replaced by a set\nof cyclic integers computed using only bit-shifts and additions modulo a prime\nnumber. The prime number may be selected to occupy contemporary word sizes or\nto be very large for cryptographic or data hiding applications. The transform\nis an extension of the Rader Transforms via Carmichael's Theorem. These\nproperties allow for exact convolutions that are impervious to numerical\noverflow and to utilise Fast Fourier Transform algorithms.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2010 11:28:50 GMT"}], "update_date": "2010-05-11", "authors_parsed": [["Chandra", "Shekhar S.", ""]]}, {"id": "1005.1588", "submitter": "Blaise Faugeras", "authors": "Blaise Faugeras (JAD), Amel Ben Abda (LAMSIN), Jacques Blum (JAD),\n  Cedric Boulbe (JAD)", "title": "Minimization of an energy error functional to solve a Cauchy problem\n  arising in plasma physics: the reconstruction of the magnetic flux in the\n  vacuum surrounding the plasma in a Tokamak", "comments": null, "journal-ref": "ARIMA 15 (2012) 37-60", "doi": null, "report-no": null, "categories": "math.NA cs.NA math.AP math.OC physics.plasm-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A numerical method for the computation of the magnetic flux in the vacuum\nsurrounding the plasma in a Tokamak is investigated. It is based on the\nformulation of a Cauchy problem which is solved through the minimization of an\nenergy error functional. Several numerical experiments are conducted which show\nthe efficiency of the method.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2010 15:25:21 GMT"}, {"version": "v2", "created": "Thu, 16 Dec 2010 14:16:35 GMT"}, {"version": "v3", "created": "Sun, 17 Nov 2013 17:30:10 GMT"}], "update_date": "2013-11-19", "authors_parsed": [["Faugeras", "Blaise", "", "JAD"], ["Abda", "Amel Ben", "", "LAMSIN"], ["Blum", "Jacques", "", "JAD"], ["Boulbe", "Cedric", "", "JAD"]]}, {"id": "1005.1894", "submitter": "Christino Tamon", "authors": "Carmeliza Navasca, Michael Opperman, Timothy Penderghest, Christino\n  Tamon", "title": "Tensors as module homomorphisms over group rings", "comments": "11 pages, 4 figures.", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA math.RA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Braman [B08] described a construction where third-order tensors are exactly\nthe set of linear transformations acting on the set of matrices with vectors as\nscalars. This extends the familiar notion that matrices form the set of all\nlinear transformations over vectors with real-valued scalars. This result is\nbased upon a circulant-based tensor multiplication due to Kilmer et al.\n[KMP08]. In this work, we generalize these observations further by viewing this\nconstruction in its natural framework of group rings.The circulant-based\nproducts arise as convolutions in these algebraic structures. Our\ngeneralization allows for any abelian group to replace the cyclic group, any\ncommutative ring with identity to replace the field of real numbers, and an\narbitrary order tensor to replace third-order tensors, provided the underlying\nring is commutative.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2010 17:46:28 GMT"}], "update_date": "2010-05-12", "authors_parsed": [["Navasca", "Carmeliza", ""], ["Opperman", "Michael", ""], ["Penderghest", "Timothy", ""], ["Tamon", "Christino", ""]]}, {"id": "1005.2086", "submitter": "Petr Vabishchevich N.", "authors": "Petr N. Vabishchevich", "title": "On a new class of additive (splitting) operator-difference schemes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many applied time-dependent problems are characterized by an additive\nrepresentation of the problem operator. Additive schemes are constructed using\nsuch a splitting and associated with the transition to a new time level on the\nbasis of the solution of more simple problems for the individual operators in\nthe additive decomposition. We consider a new class of additive schemes for\nproblems with additive representation of the operator at the time derivative.\nIn this paper we construct and study the vector operator-difference schemes,\nwhich are characterized by a transition from one initial the evolution equation\nto a system of such equations.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2010 13:23:06 GMT"}], "update_date": "2010-05-13", "authors_parsed": [["Vabishchevich", "Petr N.", ""]]}, {"id": "1005.2146", "submitter": "Ankan Saha", "authors": "Ankan Saha and Ambuj Tewari", "title": "On the Finite Time Convergence of Cyclic Coordinate Descent Methods", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyclic coordinate descent is a classic optimization method that has witnessed\na resurgence of interest in machine learning. Reasons for this include its\nsimplicity, speed and stability, as well as its competitive performance on\n$\\ell_1$ regularized smooth optimization problems. Surprisingly, very little is\nknown about its finite time convergence behavior on these problems. Most\nexisting results either just prove convergence or provide asymptotic rates. We\nfill this gap in the literature by proving $O(1/k)$ convergence rates (where\n$k$ is the iteration counter) for two variants of cyclic coordinate descent\nunder an isotonicity assumption. Our analysis proceeds by comparing the\nobjective values attained by the two variants with each other, as well as with\nthe gradient descent algorithm. We show that the iterates generated by the\ncyclic coordinate descent methods remain better than those of gradient descent\nuniformly over time.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2010 16:25:46 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Saha", "Ankan", ""], ["Tewari", "Ambuj", ""]]}, {"id": "1005.2197", "submitter": "Tamara Kolda", "authors": "Evrim Acar and Tamara G. Kolda and Daniel M. Dunlavy and Morten Morup", "title": "Scalable Tensor Factorizations for Incomplete Data", "comments": null, "journal-ref": "Chemometrics and Intelligent Laboratory Systems 106(1):41-56, Mar.\n  2011", "doi": "10.1016/j.chemolab.2010.08.004", "report-no": null, "categories": "math.NA cs.NA physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of incomplete data - i.e., data with missing or unknown values -\nin multi-way arrays is ubiquitous in biomedical signal processing, network\ntraffic analysis, bibliometrics, social network analysis, chemometrics,\ncomputer vision, communication networks, etc. We consider the problem of how to\nfactorize data sets with missing values with the goal of capturing the\nunderlying latent structure of the data and possibly reconstructing missing\nvalues (i.e., tensor completion). We focus on one of the most well-known tensor\nfactorizations that captures multi-linear structure, CANDECOMP/PARAFAC (CP). In\nthe presence of missing data, CP can be formulated as a weighted least squares\nproblem that models only the known entries. We develop an algorithm called\nCP-WOPT (CP Weighted OPTimization) that uses a first-order optimization\napproach to solve the weighted least squares problem. Based on extensive\nnumerical experiments, our algorithm is shown to successfully factorize tensors\nwith noise and up to 99% missing data. A unique aspect of our approach is that\nit scales to sparse large-scale data, e.g., 1000 x 1000 x 1000 with five\nmillion known entries (0.5% dense). We further demonstrate the usefulness of\nCP-WOPT on two real-world applications: a novel EEG (electroencephalogram)\napplication where missing data is frequently encountered due to disconnections\nof electrodes and the problem of modeling computer network traffic where data\nmay be absent due to the expense of the data collection process.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2010 20:11:43 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Acar", "Evrim", ""], ["Kolda", "Tamara G.", ""], ["Dunlavy", "Daniel M.", ""], ["Morup", "Morten", ""]]}, {"id": "1005.2228", "submitter": "Don McLeish", "authors": "Don McLeish", "title": "A general method for debiasing a Monte Carlo estimator", "comments": "11 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.NA stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a process, stochastic or deterministic, obtained by using a\nnumerical integration scheme, or from Monte-Carlo methods involving an\napproximation to an integral, or a Newton-Raphson iteration to approximate the\nroot of an equation. We will assume that we can sample from the distribution of\nthe process from time 0 to finite time n. We propose a scheme for unbiased\nestimation of the limiting value of the process, together with estimates of\nstandard error and apply this to examples including numerical integrals,\nroot-finding and option pricing in a Heston Stochastic Volatility model. This\nresults in unbiased estimators in place of biased ones i nmany potential\napplications.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2010 23:33:47 GMT"}, {"version": "v2", "created": "Wed, 16 Jun 2010 12:41:56 GMT"}], "update_date": "2010-06-17", "authors_parsed": [["McLeish", "Don", ""]]}, {"id": "1005.3097", "submitter": "Michael Mahoney", "authors": "Petros Drineas and Michael W. Mahoney", "title": "Effective Resistances, Statistical Leverage, and Applications to Linear\n  Equation Solving", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent work in theoretical computer science and scientific computing has\nfocused on nearly-linear-time algorithms for solving systems of linear\nequations. While introducing several novel theoretical perspectives, this work\nhas yet to lead to practical algorithms. In an effort to bridge this gap, we\ndescribe in this paper two related results. Our first and main result is a\nsimple algorithm to approximate the solution to a set of linear equations\ndefined by a Laplacian (for a graph $G$ with $n$ nodes and $m \\le n^2$ edges)\nconstraint matrix. The algorithm is a non-recursive algorithm; even though it\nruns in $O(n^2 \\cdot \\polylog(n))$ time rather than $O(m \\cdot polylog(n))$\ntime (given an oracle for the so-called statistical leverage scores), it is\nextremely simple; and it can be used to compute an approximate solution with a\ndirect solver. In light of this result, our second result is a straightforward\nconnection between the concept of graph resistance (which has proven useful in\nrecent algorithms for linear equation solvers) and the concept of statistical\nleverage (which has proven useful in numerically-implementable randomized\nalgorithms for large matrix problems and which has a natural data-analytic\ninterpretation).\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2010 04:24:36 GMT"}], "update_date": "2010-05-19", "authors_parsed": [["Drineas", "Petros", ""], ["Mahoney", "Michael W.", ""]]}, {"id": "1005.4006", "submitter": "Daniel Dunlavy", "authors": "Daniel M. Dunlavy, Tamara G. Kolda and Evrim Acar", "title": "Temporal Link Prediction using Matrix and Tensor Factorizations", "comments": null, "journal-ref": "ACM Transactions on Knowledge Discovery from Data 5(2):10 (27\n  pages), February 2011", "doi": "10.1145/1921632.1921636", "report-no": null, "categories": "math.NA cs.NA physics.data-an stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The data in many disciplines such as social networks, web analysis, etc. is\nlink-based, and the link structure can be exploited for many different data\nmining tasks. In this paper, we consider the problem of temporal link\nprediction: Given link data for times 1 through T, can we predict the links at\ntime T+1? If our data has underlying periodic structure, can we predict out\neven further in time, i.e., links at time T+2, T+3, etc.? In this paper, we\nconsider bipartite graphs that evolve over time and consider matrix- and\ntensor-based methods for predicting future links. We present a weight-based\nmethod for collapsing multi-year data into a single matrix. We show how the\nwell-known Katz method for link prediction can be extended to bipartite graphs\nand, moreover, approximated in a scalable way using a truncated singular value\ndecomposition. Using a CANDECOMP/PARAFAC tensor decomposition of the data, we\nillustrate the usefulness of exploiting the natural three-dimensional structure\nof temporal link data. Through several numerical experiments, we demonstrate\nthat both matrix- and tensor-based techniques are effective for temporal link\nprediction despite the inherent difficulty of the problem. Additionally, we\nshow that tensor-based techniques are particularly effective for temporal data\nwith varying periodic patterns.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2010 17:07:35 GMT"}, {"version": "v2", "created": "Sat, 19 Jun 2010 04:53:56 GMT"}], "update_date": "2013-09-16", "authors_parsed": [["Dunlavy", "Daniel M.", ""], ["Kolda", "Tamara G.", ""], ["Acar", "Evrim", ""]]}, {"id": "1005.4117", "submitter": "Helmut Katzgraber", "authors": "Helmut G. Katzgraber", "title": "Random Numbers in Scientific Computing: An Introduction", "comments": "lecture at the second international summer school \"Modern Computation\n  Science\", 9 - 20 August 2010, Oldenburg (Germany), see\n  http://www.mcs.uni-oldenburg.de/", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.comp-ph cs.MS cs.NA physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Random numbers play a crucial role in science and industry. Many numerical\nmethods require the use of random numbers, in particular the Monte Carlo\nmethod. Therefore it is of paramount importance to have efficient random number\ngenerators. The differences, advantages and disadvantages of true and pseudo\nrandom number generators are discussed with an emphasis on the intrinsic\ndetails of modern and fast pseudo random number generators. Furthermore,\nstandard tests to verify the quality of the random numbers produced by a given\ngenerator are outlined. Finally, standard scientific libraries with built-in\ngenerators are presented, as well as different approaches to generate\nnonuniform random numbers. Potential problems that one might encounter when\nusing large parallel machines are discussed.\n", "versions": [{"version": "v1", "created": "Sat, 22 May 2010 10:10:33 GMT"}], "update_date": "2010-05-25", "authors_parsed": [["Katzgraber", "Helmut G.", ""]]}, {"id": "1005.4732", "submitter": "Nam Nguyen Hoai", "authors": "Nam H. Nguyen, Petros Drineas, Trac D. Tran", "title": "Tensor sparsification via a bound on the spectral norm of random tensors", "comments": "33 pages; Information and Inference (A journal of the IMA), 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given an order-$d$ tensor $\\tensor A \\in \\R^{n \\times n \\times...\\times n}$,\nwe present a simple, element-wise sparsification algorithm that zeroes out all\nsufficiently small elements of $\\tensor A$, keeps all sufficiently large\nelements of $\\tensor A$, and retains some of the remaining elements with\nprobabilities proportional to the square of their magnitudes. We analyze the\napproximation accuracy of the proposed algorithm using a powerful inequality\nthat we derive. This inequality bounds the spectral norm of a random tensor and\nis of independent interest. As a result, we obtain novel bounds for the tensor\nsparsification problem.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2010 04:17:48 GMT"}, {"version": "v2", "created": "Wed, 4 Feb 2015 01:16:59 GMT"}], "update_date": "2015-02-05", "authors_parsed": [["Nguyen", "Nam H.", ""], ["Drineas", "Petros", ""], ["Tran", "Trac D.", ""]]}, {"id": "1005.5375", "submitter": "Denitsa Staicova", "authors": "Plamen P. Fiziev and Denitsa R. Staicova", "title": "Two-dimensional generalization of the Muller root-finding algorithm and\n  its applications", "comments": "21 pages, 3 figures, 4 tables; Amendments. Typos corrected. New\n  sections and figures added. New comments on the application of the method in\n  systems featuring confluent Heun functions, including the QNM of the Kerr\n  black hole. Expanded numerical testing of the algorithm on simple systems;\n  Internal Report, Sofia University, 2011", "journal-ref": null, "doi": null, "report-no": "SU-TH/1-05-2010", "categories": "cs.NA astro-ph.IM gr-qc hep-th", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new algorithm for solving a system of two nonlinear\ntranscendental equations with two complex variables based on the Muller\nalgorithm. The two-dimensional Muller algorithm is tested on systems of\ndifferent type and is found to work comparably to Newton's method and Broyden's\nmethod in many cases. The new algorithm is particularly useful in systems\nfeaturing the Heun functions whose complexity may make the already known\nalgorithms not efficient enough or not working at all. In those specific cases,\nthe new algorithm gives distinctly better results than the other two methods.\nAs an example for its application in physics, the new algorithm was used to\nfind the quasi-normal modes (QNM) of Schwarzschild black hole described by the\nRegge-Wheeler equation. The numerical results obtained by our method are\ncompared with the already published QNM frequencies and are found to coincide\nto a great extent with them. Also discussed are the QNM of the Kerr black hole,\ndescribed by the Teukolsky Master equation.\n", "versions": [{"version": "v1", "created": "Fri, 28 May 2010 19:38:37 GMT"}, {"version": "v2", "created": "Mon, 20 Jun 2011 15:58:01 GMT"}], "update_date": "2012-02-02", "authors_parsed": [["Fiziev", "Plamen P.", ""], ["Staicova", "Denitsa R.", ""]]}, {"id": "1005.5631", "submitter": "Marc Schoenauer", "authors": "Anne Auger (INRIA Saclay - Ile de France), Nikolaus Hansen, Jorge M.\n  Perez Zerpa (INRIA Saclay - Ile de France), Raymond Ros (INRIA Saclay - Ile\n  de France), Marc Schoenauer (INRIA Saclay - Ile de France)", "title": "Experimental Comparisons of Derivative Free Optimization Algorithms", "comments": "8th International Symposium on Experimental Algorithms, Dortmund :\n  Germany (2009)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the performances of the quasi-Newton BFGS algorithm, the\nNEWUOA derivative free optimizer, the Covariance Matrix Adaptation Evolution\nStrategy (CMA-ES), the Differential Evolution (DE) algorithm and Particle Swarm\nOptimizers (PSO) are compared experimentally on benchmark functions reflecting\nimportant challenges encountered in real-world optimization problems.\nDependence of the performances in the conditioning of the problem and\nrotational invariance of the algorithms are in particular investigated.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2010 09:10:30 GMT"}], "update_date": "2010-06-01", "authors_parsed": [["Auger", "Anne", "", "INRIA Saclay - Ile de France"], ["Hansen", "Nikolaus", "", "INRIA Saclay - Ile de France"], ["Zerpa", "Jorge M. Perez", "", "INRIA Saclay - Ile de France"], ["Ros", "Raymond", "", "INRIA Saclay - Ile\n  de France"], ["Schoenauer", "Marc", "", "INRIA Saclay - Ile de France"]]}, {"id": "1005.5712", "submitter": "Petr Vabishchevich N.", "authors": "Petr N. Vabishchevich", "title": "SM stability for time-dependent problems", "comments": "12 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Various classes of stable finite difference schemes can be constructed to\nobtain a numerical solution. It is important to select among all stable schemes\nsuch a scheme that is optimal in terms of certain additional criteria. In this\nstudy, we use a simple boundary value problem for a one-dimensional parabolic\nequation to discuss the selection of an approximation with respect to time. We\nconsider the pure diffusion equation, the pure convective transport equation\nand combined convection-diffusion phenomena. Requirements for the\nunconditionally stable finite difference schemes are formulated that are\nrelated to retaining the main features of the differential problem. The concept\nof SM stable finite difference scheme is introduced. The starting point are\ndifference schemes constructed on the basis of the various Pad$\\acute{e}$\napproximations.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2010 17:55:44 GMT"}], "update_date": "2010-06-01", "authors_parsed": [["Vabishchevich", "Petr N.", ""]]}]