[{"id": "1504.01438", "submitter": "Seyed Rasoul Etesami", "authors": "Tamer Basar, Seyed Rasoul Etesami, Alex Olshevsky", "title": "Convergence Time of Quantized Metropolis Consensus Over Time-Varying\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.DC cs.MA math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the quantized consensus problem on undirected time-varying\nconnected graphs with n nodes, and devise a protocol with fast convergence time\nto the set of consensus points. Specifically, we show that when the edges of\neach network in a sequence of connected time-varying networks are activated\nbased on Poisson processes with Metropolis rates, the expected convergence time\nto the set of consensus points is at most O(n^2 log^2 n), where each node\nperforms a constant number of updates per unit time.\n", "versions": [{"version": "v1", "created": "Mon, 6 Apr 2015 23:28:08 GMT"}, {"version": "v2", "created": "Tue, 2 Feb 2016 22:27:32 GMT"}], "update_date": "2016-02-04", "authors_parsed": [["Basar", "Tamer", ""], ["Etesami", "Seyed Rasoul", ""], ["Olshevsky", "Alex", ""]]}, {"id": "1504.02442", "submitter": "EPTCS", "authors": "Paul C. Jorgensen (Grand Valley State University)", "title": "A Visual Formalism for Interacting Systems", "comments": "In Proceedings MBT 2015, arXiv:1504.01928", "journal-ref": "EPTCS 180, 2015, pp. 41-55", "doi": "10.4204/EPTCS.180.3", "report-no": null, "categories": "cs.SE cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interacting systems are increasingly common. Many examples pervade our\neveryday lives: automobiles, aircraft, defense systems, telephone switching\nsystems, financial systems, national governments, and so on. Closer to computer\nscience, embedded systems and Systems of Systems are further examples of\ninteracting systems. Common to all of these is that some \"whole\" is made up of\nconstituent parts, and these parts interact with each other. By design, these\ninteractions are intentional, but it is the unintended interactions that are\nproblematic. The Systems of Systems literature uses the terms \"constituent\nsystems\" and \"constituents\" to refer to systems that interact with each other.\nThat practice is followed here. This paper presents a visual formalism, Swim\nLane Event-Driven Petri Nets, that is proposed as a basis for Model-Based\nTesting (MBT) of interacting systems. In the absence of available tools, this\nmodel can only support the offline form of Model-Based Testing.\n", "versions": [{"version": "v1", "created": "Thu, 9 Apr 2015 19:30:37 GMT"}], "update_date": "2015-04-10", "authors_parsed": [["Jorgensen", "Paul C.", "", "Grand Valley State University"]]}, {"id": "1504.03809", "submitter": "George Barmpalias Dr", "authors": "George Barmpalias, Richard Elwes, Andy Lewis-Pye", "title": "Unperturbed Schelling segregation in two or three dimensions", "comments": "24 pages and 7 figures", "journal-ref": null, "doi": "10.1007/s10955-016-1589-6", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Schelling's model of segregation, first described in 1969, has become one of\nthe best known models of self-organising behaviour. While Schelling's explicit\nconcern was to understand the mechanisms underlying racial segregation in large\ncities from a game theoretic perspective, the model should be seen as one of a\nfamily, arising in fields as diverse as statistical mechanics, neural networks\nand the social sciences, and which are concerned with interacting populations\nsituated on network structures. Despite extensive study, however, the\n(unperturbed) Schelling model has largely resisted rigorous analysis, prior\nresults in the literature generally pertaining to variants of the model in\nwhich noise is introduced into the dynamics of the system, the resulting model\nthen being amenable to standard techniques from statistical mechanics or\nstochastic evolutionary game theory. A series of recent papers (one by Brandt,\nImmorlica, Kamath, and Kleinberg, and two by the authors), has seen the first\nrigorous analysis of the one dimensional version of the unperturbed model. Here\nwe provide the first rigorous analysis of the two and three dimensional\nunperturbed models, establishing most of the phase diagram, and answering a\nchallenge from a recent paper by Brandt, Immorlica, Kamath, and Kleinberg.\n", "versions": [{"version": "v1", "created": "Wed, 15 Apr 2015 07:54:35 GMT"}, {"version": "v2", "created": "Sat, 22 Aug 2015 20:46:09 GMT"}, {"version": "v3", "created": "Thu, 14 Jul 2016 01:57:57 GMT"}, {"version": "v4", "created": "Fri, 9 Sep 2016 01:34:09 GMT"}], "update_date": "2016-09-12", "authors_parsed": [["Barmpalias", "George", ""], ["Elwes", "Richard", ""], ["Lewis-Pye", "Andy", ""]]}, {"id": "1504.04235", "submitter": "Pedro Henrique Juliano Nardelli", "authors": "Florian K\\\"uhnlenz and Pedro H. J. Nardelli", "title": "Dynamics of Complex Systems Built as Coupled Physical, Communication and\n  Decision Layers", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0145135", "report-no": null, "categories": "cs.MA cs.SI cs.SY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a simple model to capture the complexity of multi-layer\nsystems where their constituent layers affect, are affected by, each other. The\nphysical layer is a circuit composed by a power source and resistors in\nparallel. Individual agents can add, remove or keep the resistors they have,\nand their decisions aiming at maximising the delivered power - a non-linear\nfunction dependent on the others' behaviour - based on their internal state,\ntheir global state perception, the information received from their neighbours\nin the communication network, and a randomised selfishness. We develop an\nagent-based simulation to analyse the effects of number of agents (size of the\nsystem), communication network topology, communication errors and the minimum\npower gain that triggers a behavioural change. Our results show that a\nwave-like behaviour at macro-level (caused by individual changes in the\ndecision layer) can only emerge for a specific system size, the ratio between\ncooperators and defectors depends on minimum gain assumed - lower minimal gains\nlead to less cooperation and vice-versa, different communication network\ntopologies lead to different levels of power utilisation and fairness at the\nphysical layer, and a certain level of error in the communication layer leads\nto more cooperation.\n", "versions": [{"version": "v1", "created": "Thu, 16 Apr 2015 14:01:45 GMT"}, {"version": "v2", "created": "Fri, 17 Apr 2015 05:11:23 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Kühnlenz", "Florian", ""], ["Nardelli", "Pedro H. J.", ""]]}, {"id": "1504.04811", "submitter": "Sergey Tarasenko", "authors": "Sergey Tarasenko", "title": "Socializing Autonomous Units with the Reflexive Game Theory and\n  Resonate-and-Fire neurons", "comments": "10 pages, 15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study the concept of reflexia is applied to modeling behavior of\nautonomous units. The relationship between reflexia, on the one hand, and\nmirror neuron system and perception of emotions, on the other hand, is\nintroduced. The main method of using reflexia in a group of autonomous units is\nReflexive Game Theory (RGT). To embody RGT in a group of autonomous agents a\ncommunication system is employed. This communication system uses frequency\ndomain multiplexing by means of Izhikevich's resonate-and-fire neural models.\nThe result of socialization of autonomous units by means of RGT and\ncommunication system is illustrated in several examples.\n", "versions": [{"version": "v1", "created": "Sun, 19 Apr 2015 08:37:40 GMT"}], "update_date": "2015-04-21", "authors_parsed": [["Tarasenko", "Sergey", ""]]}, {"id": "1504.05750", "submitter": "Riccardo Fusaroli", "authors": "Riccardo Fusaroli, Johanne S. Bj{\\o}rndahl, Andreas Roepstorff and\n  Kristian Tyl\\'en", "title": "A Heart for Interaction: Shared Physiological Dynamics and Behavioral\n  Coordination in a Collective, Creative Construction Task", "comments": "34 pages, 6 figures, 7 tables. Minor revisions due to peer review", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.MA nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interpersonally shared physiological dynamics are increasingly argued to\nunderlie rapport, empathy and even team performance. Inspired by the model of\ninterpersonal synergy, we critically investigate the presence, temporal\ndevelopment, possible mechanisms and impact of shared interpersonal heart rate\ndynamics during individual and collective creative LEGO construction tasks. In\nStudy 1 we show how shared HR dynamics are driven by a plurality of sources\nincluding task constraints and behavioral coordination. Generally, shared HR\ndynamics are more prevalent in individual trials (involving participants doing\nthe same things) than in collective ones (involving participants taking turns\nand performing complementary actions). However, when contrasted against virtual\npairs, collective trials display more stable shared HR dynamics suggesting that\nonline social interaction plays an important role. Furthermore, in contrast to\nindividual trials, shared HR dynamics are found to increase across collective\ntrials. Study 2 investigates which aspects of social interaction might drive\nthese effects. We show that shared HR dynamics are statistically predicted by\ninterpersonal speech and building coordination. In Study 3, we explore the\nrelation between HR dynamics, behavioral coordination, and self-reported\nmeasures of rapport and group competence. While behavioral coordination\npredicts rapport and group competence, shared HR dynamics do not. Although\nshared physiological dynamics were reliably observed in our study, our results\nwarrant not to consider HR dynamics a general driving mechanism of social\ncoordination. Behavioral coordination - on the other hand - seems to be more\ninformative of both shared physiological dynamics and collective experience.\n", "versions": [{"version": "v1", "created": "Wed, 22 Apr 2015 12:06:37 GMT"}, {"version": "v2", "created": "Wed, 14 Oct 2015 09:16:46 GMT"}, {"version": "v3", "created": "Sun, 6 Dec 2015 12:06:21 GMT"}], "update_date": "2015-12-08", "authors_parsed": [["Fusaroli", "Riccardo", ""], ["Bjørndahl", "Johanne S.", ""], ["Roepstorff", "Andreas", ""], ["Tylén", "Kristian", ""]]}, {"id": "1504.06075", "submitter": "Ivo Herman", "authors": "Ivo Herman, Dan Martinec, J. J. P. Veerman", "title": "Transients of platoons with asymmetric and different Laplacians", "comments": null, "journal-ref": "Systems and Control Letters, Volume 91, 2016", "doi": "10.1016/j.sysconle.2016.02.013", "report-no": null, "categories": "cs.SY cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an asymmetric control of platoons of identical vehicles with\nnearest-neighbor interaction. Recent results show that if the vehicle uses\ndifferent asymmetries for position and velocity errors, the platoon has a short\ntransient and low overshoots. In this paper we investigate the properties of\nvehicles with friction. To achieve consensus, an integral part is added to the\ncontroller, making the vehicle a third-order system. We show that the\nparameters can be chosen so that the platoon behaves as a wave equation with\ndifferent wave velocities. Simulations suggest that our system has a better\nperformance than other nearest-neighbor scenarios. Moreover, an\noptimization-based procedure is used to find the controller properties.\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2015 08:16:44 GMT"}, {"version": "v2", "created": "Tue, 22 Sep 2015 13:43:50 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Herman", "Ivo", ""], ["Martinec", "Dan", ""], ["Veerman", "J. J. P.", ""]]}, {"id": "1504.06766", "submitter": "Hang Nga Nguyen", "authors": "Natasha Alechina, Brian Logan, Hoang Nga Nguyen, Franco Raimondi", "title": "Technical Report: Model-Checking for Resource-Bounded ATL with\n  Production and Consumption of Resources", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several logics for expressing coalitional ability under resource bounds have\nbeen proposed and studied in the literature. Previous work has shown that if\nonly consumption of resources is considered or the total amount of resources\nproduced or consumed on any path in the system is bounded, then the\nmodel-checking problem for several standard logics, such as Resource-Bounded\nCoalition Logic (RB-CL) and Resource-Bounded Alternating-Time Temporal Logic\n(RB-ATL) is decidable. However, for coalition logics with unbounded resource\nproduction and consumption, only some undecidability results are known. In this\npaper, we show that the model-checking problem for RB-ATL with unbounded\nproduction and con- sumption of resources is decidable but EXPSPACE-hard. We\nalso investigate some tractable cases and provide a detailed comparison to a\nvariant of the resource logic RAL, together with new complexity results.\n", "versions": [{"version": "v1", "created": "Sat, 25 Apr 2015 22:28:58 GMT"}], "update_date": "2015-04-28", "authors_parsed": [["Alechina", "Natasha", ""], ["Logan", "Brian", ""], ["Nguyen", "Hoang Nga", ""], ["Raimondi", "Franco", ""]]}, {"id": "1504.08167", "submitter": "Orly Avner", "authors": "Orly Avner and Shie Mannor", "title": "Multi-user lax communications: a multi-armed bandit approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inspired by cognitive radio networks, we consider a setting where multiple\nusers share several channels modeled as a multi-user multi-armed bandit (MAB)\nproblem. The characteristics of each channel are unknown and are different for\neach user. Each user can choose between the channels, but her success depends\non the particular channel chosen as well as on the selections of other users:\nif two users select the same channel their messages collide and none of them\nmanages to send any data. Our setting is fully distributed, so there is no\ncentral control. As in many communication systems, the users cannot set up a\ndirect communication protocol, so information exchange must be limited to a\nminimum. We develop an algorithm for learning a stable configuration for the\nmulti-user MAB problem. We further offer both convergence guarantees and\nexperiments inspired by real communication networks, including comparison to\nstate-of-the-art algorithms.\n", "versions": [{"version": "v1", "created": "Thu, 30 Apr 2015 11:11:54 GMT"}, {"version": "v2", "created": "Wed, 2 Dec 2015 08:50:37 GMT"}], "update_date": "2015-12-03", "authors_parsed": [["Avner", "Orly", ""], ["Mannor", "Shie", ""]]}, {"id": "1504.08248", "submitter": "Palash Dey", "authors": "Palash Dey, Neeldhara Misra, and Y. Narahari", "title": "Frugal Bribery in Voting", "comments": "Full version has been accepted in Theoretical Computer Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bribery in elections is an important problem in computational social choice\ntheory. However, bribery with money is often illegal in elections. Motivated by\nthis, we introduce the notion of frugal bribery and formulate two new pertinent\ncomputational problems which we call Frugal-bribery and Frugal- $bribery to\ncapture bribery without money in elections. In the proposed model, the briber\nis frugal in nature and this is captured by her inability to bribe votes of a\ncertain kind, namely, non-vulnerable votes. In the Frugal-bribery problem, the\ngoal is to make a certain candidate win the election by changing only\nvulnerable votes. In the Frugal-{dollar}bribery problem, the vulnerable votes\nhave prices and the goal is to make a certain candidate win the election by\nchanging only vulnerable votes, subject to a budget constraint of the briber.\nWe further formulate two natural variants of the Frugal-{dollar}bribery problem\nnamely Uniform-frugal-{dollar}bribery and Nonuniform-frugal-{dollar}bribery\nwhere the prices of the vulnerable votes are, respectively, all the same or\ndifferent.\n  We study the computational complexity of the above problems for unweighted\nand weighted elections for several commonly used voting rules. We observe that,\neven if we have only a small number of candidates, the problems are intractable\nfor all voting rules studied here for weighted elections, with the sole\nexception of the Frugal-bribery problem for the plurality voting rule. In\ncontrast, we have polynomial time algorithms for the Frugal-bribery problem for\nplurality, veto, k-approval, k-veto, and plurality with runoff voting rules for\nunweighted elections. However, the Frugal-{dollar}bribery problem is\nintractable for all the voting rules studied here barring the plurality and the\nveto voting rules for unweighted elections.\n", "versions": [{"version": "v1", "created": "Thu, 30 Apr 2015 14:42:34 GMT"}, {"version": "v2", "created": "Thu, 24 Nov 2016 16:39:10 GMT"}, {"version": "v3", "created": "Tue, 28 Feb 2017 16:51:02 GMT"}], "update_date": "2017-03-01", "authors_parsed": [["Dey", "Palash", ""], ["Misra", "Neeldhara", ""], ["Narahari", "Y.", ""]]}, {"id": "1504.08256", "submitter": "Palash Dey", "authors": "Palash Dey, Neeldhara Misra, and Y. Narahari", "title": "Manipulation is Harder with Incomplete Votes", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Coalitional Manipulation (CM) problem has been studied extensively in the\nliterature for many voting rules. The CM problem, however, has been studied\nonly in the complete information setting, that is, when the manipulators know\nthe votes of the non-manipulators. A more realistic scenario is an incomplete\ninformation setting where the manipulators do not know the exact votes of the\nnon- manipulators but may have some partial knowledge of the votes. In this\npaper, we study a setting where the manipulators know a partial order for each\nvoter that is consistent with the vote of that voter. In this setting, we\nintroduce and study two natural computational problems - (1) Weak Manipulation\n(WM) problem where the manipulators wish to vote in a way that makes their\npreferred candidate win in at least one extension of the partial votes of the\nnon-manipulators; (2) Strong Manipulation (SM) problem where the manipulators\nwish to vote in a way that makes their preferred candidate win in all possible\nextensions of the partial votes of the non-manipulators. We study the\ncomputational complexity of the WM and the SM problems for commonly used voting\nrules such as plurality, veto, k-approval, k-veto, maximin, Copeland, and\nBucklin. Our key finding is that, barring a few exceptions, manipulation\nbecomes a significantly harder problem in the setting of incomplete votes.\n", "versions": [{"version": "v1", "created": "Thu, 30 Apr 2015 14:51:57 GMT"}], "update_date": "2015-05-01", "authors_parsed": [["Dey", "Palash", ""], ["Misra", "Neeldhara", ""], ["Narahari", "Y.", ""]]}]