[{"id": "1002.0864", "submitter": "Ljudmila A. Bordag", "authors": "Ljudmila A. Bordag", "title": "Pricing options in illiquid markets: optimal systems, symmetry\n  reductions and exact solutions", "comments": "14 pages", "journal-ref": "Lobachevskii Journal of Mathematics , 2010,vol. 31,no 2, pp.90-99;\n  ISSN 1995-0802", "doi": "10.1134/S1995080210020022", "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a class of nonlinear pricing models which involves the feedback\neffect from the dynamic hedging strategies on the price of asset introduced by\nSircar and Papanicolaou. We are first to study the case of a nonlinear demand\nfunction involved in the model. Using a Lie group analysis we investigate the\nsymmetry properties of these nonlinear diffusion equations. We provide the\noptimal systems of subalgebras and the complete set of non-equivalent\nreductions of studied PDEs to ODEs. In most cases we obtain families of exact\nsolutions or derive particular solutions to the equations.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2010 22:07:50 GMT"}], "update_date": "2010-04-08", "authors_parsed": [["Bordag", "Ljudmila A.", ""]]}, {"id": "1002.0979", "submitter": "Daniel Sevcovic", "authors": "Martin Lauko, Daniel Sevcovic", "title": "Comparison of numerical and analytical approximations of the early\n  exercise boundary of the American put option", "comments": null, "journal-ref": "The ANZIAM Journal (2010), 51: 430-448", "doi": "10.1017/S1446181110000854", "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present qualitative and quantitative comparison of various\nanalytical and numerical approximation methods for calculating a position of\nthe early exercise boundary of the American put option paying zero dividends.\nFirst we analyze their asymptotic behavior close to expiration. In the second\npart of the paper, we introduce a new numerical scheme for computing the entire\nearly exercise boundary. The local iterative numerical scheme is based on a\nsolution to a nonlinear integral equation. We compare numerical results\nobtained by the new method to those of the projected successive over relaxation\nmethod and the analytical approximation formula recently derived by Zhu.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2010 12:18:28 GMT"}, {"version": "v2", "created": "Fri, 27 Aug 2010 17:25:12 GMT"}], "update_date": "2011-03-28", "authors_parsed": [["Lauko", "Martin", ""], ["Sevcovic", "Daniel", ""]]}, {"id": "1002.1995", "submitter": "Andrey Itkin", "authors": "Andrey Itkin, Peter Carr", "title": "Using pseudo-parabolic and fractional equations for option pricing in\n  jump diffusion models", "comments": "37 pages, 16 figures. submitted to Applied Mathematical Finance.\n  submitted to Applied Mathematical Finance", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In mathematical finance a popular approach for pricing options under some\nLevy model is to consider underlying that follows a Poisson jump diffusion\nprocess. As it is well known this results in a partial integro-differential\nequation (PIDE) that usually does not allow an analytical solution while\nnumerical solution brings some problems. In this paper we elaborate a new\napproach on how to transform the PIDE to some class of so-called\npseudo-parabolic equations which are known in mathematics but are relatively\nnew for mathematical finance. As an example we discuss several jump-diffusion\nmodels which Levy measure allows such a transformation.\n", "versions": [{"version": "v1", "created": "Tue, 9 Feb 2010 22:43:36 GMT"}], "update_date": "2010-02-11", "authors_parsed": [["Itkin", "Andrey", ""], ["Carr", "Peter", ""]]}, {"id": "1002.2487", "submitter": "Serguei Pergamenchtchikov", "authors": "Claudia Kluppelberg, Serguei Pergamenchtchikov (LMRS)", "title": "Optimal consumption and investment with bounded downside risk for power\n  utility functions", "comments": "36 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate optimal consumption and investment problems for a\nBlack-Scholes market under uniform restrictions on Value-at-Risk and Expected\nShortfall. We formulate various utility maximization problems, which can be\nsolved explicitly. We compare the optimal solutions in form of optimal value,\noptimal control and optimal wealth to analogous problems under additional\nuniform risk bounds. Our proofs are partly based on solutions to\nHamilton-Jacobi-Bellman equations, and we prove a corresponding verification\ntheorem. This work was supported by the European Science Foundation through the\nAMaMeF programme.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2010 07:28:52 GMT"}], "update_date": "2010-02-15", "authors_parsed": [["Kluppelberg", "Claudia", "", "LMRS"], ["Pergamenchtchikov", "Serguei", "", "LMRS"]]}, {"id": "1002.2573", "submitter": "Alex Langnau", "authors": "Alex Langnau", "title": "A model-insensitive determination of First-hitting-time densities with\n  Application to Equity default-swaps", "comments": "keywords: Equity default swaps, hitting probability, stopping time\n  density, barrier options, forward volatility,forward volatility skew,\n  american digital put", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Equity default-swaps pay the holder a fixed amount of money when the\nunderlying spot level touches a (far-down) barrier during the life of the\ninstrument. While most pricing models give reasonable results when the barrier\nlies within the range of liquidly traded strikes of plain-vanilla option\nprices, the situation is more involved for extremely out-of-the money barriers.\nIn this paper we discuss a model-insensitive approach for the determination of\nfirst hitting times that does not rely on the full a priori knowledge of the\nstochastic process for the price dynamics. Hence more robust pricing and\nhedging results are expected as a result of this analysis. In contrast to\nstochastic volatility-models our approach is well suited for the conservative\npricing of equity default-swaps.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2010 15:05:12 GMT"}, {"version": "v2", "created": "Tue, 23 Feb 2010 10:29:31 GMT"}, {"version": "v3", "created": "Mon, 29 Mar 2010 11:41:59 GMT"}], "update_date": "2010-03-30", "authors_parsed": [["Langnau", "Alex", ""]]}, {"id": "1002.3256", "submitter": "Ying Jiao", "authors": "Caroline Hillairet (CMAP), Ying Jiao (PMA)", "title": "Information Asymmetry in Pricing of Credit Derivatives", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the pricing of credit derivatives with asymmetric information. The\nmanagers have complete information on the value process of the firm and on the\ndefault threshold, while the investors on the market have only partial\nobservations, especially about the default threshold. Different information\nstructures are distinguished using the framework of enlargement of filtrations.\nWe specify risk neutral probabilities and we evaluate default sensitive\ncontingent claims in these cases.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2010 13:07:02 GMT"}], "update_date": "2010-02-18", "authors_parsed": [["Hillairet", "Caroline", "", "CMAP"], ["Jiao", "Ying", "", "PMA"]]}, {"id": "1002.3633", "submitter": "Antoine Jacquier Mr.", "authors": "Jim Gatheral, Antoine Jacquier", "title": "Convergence of Heston to SVI", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this short note, we prove by an appropriate change of variables that the\nSVI implied volatility parameterization presented in Gatheral's book and the\nlarge-time asymptotic of the Heston implied volatility agree algebraically,\nthus confirming a conjecture from Gatheral as well as providing a simpler\nexpression for the asymptotic implied volatility in the Heston model. We show\nhow this result can help in interpreting SVI parameters.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2010 22:33:02 GMT"}], "update_date": "2010-02-22", "authors_parsed": [["Gatheral", "Jim", ""], ["Jacquier", "Antoine", ""]]}, {"id": "1002.5041", "submitter": "Peter Tankov", "authors": "Rudra P. Jena, Peter Tankov", "title": "Arbitrage Opportunities in Misspecified Stochastic volatility Models", "comments": "Several typos in section 5 have been corrected in this new version\n  (with thanks to Amy Y. Zhou from MIT)", "journal-ref": "SIAM J. Finan. Math. 2, pp. 317-341 (2011)", "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is vast empirical evidence that given a set of assumptions on the\nreal-world dynamics of an asset, the European options on this asset are not\nefficiently priced in options markets, giving rise to arbitrage opportunities.\nWe study these opportunities in a generic stochastic volatility model and\nexhibit the strategies which maximize the arbitrage profit. In the case when\nthe misspecified dynamics is a classical Black-Scholes one, we give a new\ninterpretation of the classical butterfly and risk reversal contracts in terms\nof their (near) optimality for arbitrage strategies. Our results are\nillustrated by a numerical example including transaction costs.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2010 19:02:57 GMT"}, {"version": "v2", "created": "Thu, 30 Sep 2010 12:55:39 GMT"}, {"version": "v3", "created": "Fri, 30 Sep 2011 10:35:44 GMT"}], "update_date": "2011-10-03", "authors_parsed": [["Jena", "Rudra P.", ""], ["Tankov", "Peter", ""]]}]