[{"id": "1103.1006", "submitter": "Alexander Alvarez", "authors": "Alexander Alvarez, Sebastian Ferrando and Pablo Olivares (Ryerson\n  University, Toronto)", "title": "Arbitrage and Hedging in a non probabilistic framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper studies the concepts of hedging and arbitrage in a non\nprobabilistic framework. It provides conditions for non probabilistic arbitrage\nbased on the topological structure of the trajectory space and makes\nconnections with the usual notion of arbitrage. Several examples illustrate the\nnon probabilistic arbitrage as well perfect replication of options under\ncontinuous and discontinuous trajectories, the results can then be applied in\nprobabilistic models path by path. The approach is related to recent financial\nmodels that go beyond semimartingales, we remark on some of these connections\nand provide applications of our results to some of these models.\n", "versions": [{"version": "v1", "created": "Sat, 5 Mar 2011 05:18:19 GMT"}], "update_date": "2011-03-08", "authors_parsed": [["Alvarez", "Alexander", "", "Ryerson\n  University, Toronto"], ["Ferrando", "Sebastian", "", "Ryerson\n  University, Toronto"], ["Olivares", "Pablo", "", "Ryerson\n  University, Toronto"]]}, {"id": "1103.2013", "submitter": "Masaaki Fukasawa", "authors": "Masaaki Fukasawa", "title": "Conservative delta hedging under transaction costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Explicit robust hedging strategies for convex or concave payoffs under a\ncontinuous semimartingale model with uncertainty and small transaction costs\nare constructed. In an asymptotic sense, the upper and lower bounds of the\ncumulative volatility enable us to super-hedge convex and concave payoffs\nrespectively. The idea is a combination of Mykland's conservative delta hedging\nand Leland's enlarging volatility. We use a specific sequence of stopping times\nas rebalancing dates, which can be superior to equidistant one even when there\nis no model uncertainty. A central limit theorem for the super-hedging error as\nthe coefficient of linear transaction costs tends to zero is proved. The mean\nsquared error is also studied.\n", "versions": [{"version": "v1", "created": "Thu, 10 Mar 2011 12:35:53 GMT"}, {"version": "v2", "created": "Thu, 12 Jan 2012 06:45:20 GMT"}], "update_date": "2012-01-13", "authors_parsed": [["Fukasawa", "Masaaki", ""]]}, {"id": "1103.2310", "submitter": "Martin Keller-Ressel", "authors": "Martin Keller-Ressel and Claus Griessler", "title": "Convex order of discrete, continuous and predictable quadratic variation\n  & applications to options on variance", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a square-integrable semimartingale and investigate the convex\norder relations between its discrete, continuous and predictable quadratic\nvariation. As the main results, we show that if the semimartingale has\nconditionally independent increments and symmetric jump measure, then its\ndiscrete realized variance dominates its quadratic variation in increasing\nconvex order. The results have immediate applications to the pricing of options\non realized variance. For a class of models including time-changed Levy models\nand Sato processes with symmetric jumps our results show that options on\nvariance are typically underpriced, if quadratic variation is substituted for\nthe discretely sampled realized variance.\n", "versions": [{"version": "v1", "created": "Fri, 11 Mar 2011 16:30:13 GMT"}, {"version": "v2", "created": "Tue, 2 Oct 2012 15:33:43 GMT"}], "update_date": "2012-10-03", "authors_parsed": [["Keller-Ressel", "Martin", ""], ["Griessler", "Claus", ""]]}, {"id": "1103.2567", "submitter": "Marco Bianchetti", "authors": "Marco Bianchetti and Mattia Carlicchi", "title": "Interest Rates After The Credit Crunch: Multiple-Curve Vanilla\n  Derivatives and SABR", "comments": "26 pages, 13 color figures, 6 tables; revised typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a quantitative study of the markets and models evolution across\nthe credit crunch crisis. In particular, we focus on the fixed income market\nand we analyze the most relevant empirical evidences regarding the divergences\nbetween Libor and OIS rates, the explosion of Basis Swaps spreads, and the\ndiffusion of collateral agreements and CSA-discounting, in terms of credit and\nliquidity effects. We also review the new modern pricing approach prevailing\namong practitioners, based on multiple yield curves reflecting the different\ncredit and liquidity risk of Libor rates with different tenors and the\novernight discounting of cash flows originated by derivative transactions under\ncollateral with daily margination. We report the classical and modern\nno-arbitrage pricing formulas for plain vanilla interest rate derivatives, and\nthe multiple-curve generalization of the market standard SABR model with\nstochastic volatility. We then report the results of an empirical analysis on\nrecent market data comparing pre- and post-credit crunch pricing methodologies\nand showing the transition of the market practice from the classical to the\nmodern framework. In particular, we prove that the market of Interest Rate\nSwaps has abandoned since March 2010 the classical Single-Curve pricing\napproach, typical of the pre-credit crunch interest rate world, and has adopted\nthe modern Multiple-Curve CSA approach, thus incorporating credit and liquidity\neffects into market prices. The same analysis is applied to European\nCaps/Floors, finding that the full transition to the modern Multiple-Curve CSA\napproach has retarded up to August 2010. Finally, we show the robustness of the\nSABR model to calibrate the market volatility smile coherently with the new\nmarket evidences.\n", "versions": [{"version": "v1", "created": "Sun, 13 Mar 2011 23:51:37 GMT"}, {"version": "v2", "created": "Mon, 2 Apr 2012 18:15:25 GMT"}], "update_date": "2012-04-03", "authors_parsed": [["Bianchetti", "Marco", ""], ["Carlicchi", "Mattia", ""]]}, {"id": "1103.3639", "submitter": "Luca Moriconi", "authors": "V. T. X. de Almeida and L. Moriconi", "title": "Option Pricing from Wavelet-Filtered Financial Series", "comments": "4 pages, 1 figure", "journal-ref": null, "doi": "10.1016/j.physa.2012.05.030", "report-no": null, "categories": "q-fin.ST physics.data-an q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We perform wavelet decomposition of high frequency financial time series into\nlarge and small time scale components. Taking the FTSE100 index as a case\nstudy, and working with the Haar basis, it turns out that the small scale\ncomponent defined by most ($\\simeq$ 99.6%) of the wavelet coefficients can be\nneglected for the purpose of option premium evaluation. The relevance of the\nhugely compressed information provided by low-pass wavelet-filtering is related\nto the fact that the non-gaussian statistical structure of the original\nfinancial time series is essentially preserved for expiration times which are\nlarger than just one trading day.\n", "versions": [{"version": "v1", "created": "Fri, 18 Mar 2011 14:54:19 GMT"}, {"version": "v2", "created": "Mon, 17 Dec 2012 10:46:33 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["de Almeida", "V. T. X.", ""], ["Moriconi", "L.", ""]]}, {"id": "1103.4483", "submitter": "S\\\"oren Christensen", "authors": "S\\\"oren Christensen", "title": "A method for pricing American options using semi-infinite linear\n  programming", "comments": null, "journal-ref": null, "doi": "10.1111/j.1467-9965.2012.00523.x", "report-no": null, "categories": "q-fin.CP math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new approach for the numerical pricing of American options.\nThe main idea is to choose a finite number of suitable excessive functions\n(randomly) and to find the smallest majorant of the gain function in the span\nof these functions. The resulting problem is a linear semi-infinite programming\nproblem, that can be solved using standard algorithms. This leads to good upper\nbounds for the original problem. For our algorithms no discretization of space\nand time and no simulation is necessary. Furthermore it is applicable even for\nhigh-dimensional problems. The algorithm provides an approximation of the value\nnot only for one starting point, but for the complete value function on the\ncontinuation set, so that the optimal exercise region and e.g. the Greeks can\nbe calculated. We apply the algorithm to (one- and) multidimensional diffusions\nand to L\\'evy processes, and show it to be fast and accurate.\n", "versions": [{"version": "v1", "created": "Wed, 23 Mar 2011 10:33:30 GMT"}, {"version": "v2", "created": "Thu, 9 Jun 2011 14:02:35 GMT"}], "update_date": "2013-10-17", "authors_parsed": [["Christensen", "Sören", ""]]}, {"id": "1103.4947", "submitter": "Christoph Reisinger", "authors": "Nick Bush and Ben M. Hambly and Helen Haworth and Lei Jin and\n  Christoph Reisinger", "title": "Stochastic evolution equations in portfolio credit modelling with\n  applications to exotic credit products", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a structural credit model for a large portfolio of credit risky\nassets where the correlation is due to a market factor. By considering the\nlarge portfolio limit of this system we show the existence of a density process\nfor the asset values. This density evolves according to a stochastic partial\ndifferential equation and we establish existence and uniqueness for the\nsolution taking values in a suitable function space. The loss function of the\nportfolio is then a function of the evolution of this density at the default\nboundary. We develop numerical methods for pricing and calibration of the model\nto credit indices and consider its performance pre and post credit crunch.\nFinally, we give further examples illustrating the valuation of exotic credit\nproducts, specifically forward starting CDOs.\n", "versions": [{"version": "v1", "created": "Fri, 25 Mar 2011 11:14:56 GMT"}, {"version": "v2", "created": "Mon, 4 Apr 2011 09:13:26 GMT"}], "update_date": "2011-04-05", "authors_parsed": [["Bush", "Nick", ""], ["Hambly", "Ben M.", ""], ["Haworth", "Helen", ""], ["Jin", "Lei", ""], ["Reisinger", "Christoph", ""]]}, {"id": "1103.4965", "submitter": "Aleksandar Mijatovic", "authors": "Aleksandar Mijatovi\\'c and Mikhail Urusov", "title": "A Note on Delta Hedging in Markets with Jumps", "comments": "16 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modelling stock prices via jump processes is common in financial markets. In\npractice, to hedge a contingent claim one typically uses the so-called\ndelta-hedging strategy. This strategy stems from the Black--Merton--Scholes\nmodel where it perfectly replicates contingent claims. From the theoretical\nviewpoint, there is no reason for this to hold in models with jumps. However in\npractice the delta-hedging strategy is widely used and its potential\nshortcoming in models with jumps is disregarded since such models are typically\nincomplete and hence most contingent claims are non-attainable. In this note we\ninvestigate a complete model with jumps where the delta-hedging strategy is\nwell-defined for regular payoff functions and is uniquely determined via the\nrisk-neutral measure. In this setting we give examples of (admissible)\ndelta-hedging strategies with bounded discounted value processes, which\nnevertheless fail to replicate the respective bounded contingent claims. This\ndemonstrates that the deficiency of the delta-hedging strategy in the presence\nof jumps is not due to the incompleteness of the model but is inherent in the\ndiscontinuity of the trajectories.\n", "versions": [{"version": "v1", "created": "Fri, 25 Mar 2011 13:36:13 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Mijatović", "Aleksandar", ""], ["Urusov", "Mikhail", ""]]}, {"id": "1103.5345", "submitter": "Stefan Bornholdt", "authors": "Sebastian M. Krause, Stefan Bornholdt", "title": "Spin models as microfoundation of macroscopic financial market models", "comments": "4 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR cond-mat.stat-mech physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Macroscopic price evolution models are commonly used for investment\nstrategies. There are first promising achievements in defining microscopic\nagent based models for the same purpose. Microscopic models allow a deeper\nunderstanding of mechanisms in the market than the purely phenomenological\nmacroscopic models, and thus bear the chance for better models for market\nregulation. We exemplify this strategy in a case study, deducing a macroscopic\nLangevin equation from a microscopic spin market model closely related to the\nIsing model. The interplay of the microscopic and the macroscopic view allows\nfor a better understanding of the microscopic model, as well, and may guide the\nconstruction of agent based market models as basis of macroscopic price models.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2011 13:21:31 GMT"}], "update_date": "2011-03-29", "authors_parsed": [["Krause", "Sebastian M.", ""], ["Bornholdt", "Stefan", ""]]}, {"id": "1103.5575", "submitter": "Johannes Temme", "authors": "Johannes Temme", "title": "Power Utility Maximization in Discrete-Time and Continuous-Time\n  Exponential Levy Models", "comments": "18 pages, to appear in Mathematical Methods of Operations Research.\n  The final publication is available at springerlink.com", "journal-ref": null, "doi": "10.1007/s00186-012-0388-3", "report-no": null, "categories": "q-fin.PM q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider power utility maximization of terminal wealth in a 1-dimensional\ncontinuous-time exponential Levy model with finite time horizon. We discretize\nthe model by restricting portfolio adjustments to an equidistant discrete time\ngrid. Under minimal assumptions we prove convergence of the optimal\ndiscrete-time strategies to the continuous-time counterpart. In addition, we\nprovide and compare qualitative properties of the discrete-time and\ncontinuous-time optimizers.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2011 08:59:15 GMT"}, {"version": "v2", "created": "Thu, 9 Jun 2011 10:42:50 GMT"}, {"version": "v3", "created": "Thu, 26 Apr 2012 12:39:36 GMT"}], "update_date": "2012-04-27", "authors_parsed": [["Temme", "Johannes", ""]]}, {"id": "1103.5971", "submitter": "John Cotter", "authors": "Karl Case, John Cotter and Stuart Gabriel", "title": "Housing risk and return: Evidence from a housing asset-pricing model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.PR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the risk-return relationship in determination of\nhousing asset pricing. In so doing, the paper evaluates behavioral hypotheses\nadvanced by Case and Shiller (1988, 2002, 2009) in studies of boom and\npost-boom housing markets. The paper specifies and tests a multi-factor housing\nasset pricing model. In that model, we evaluate whether the market factor as\nwell as other measures of risk, including idiosyncratic risk, momentum, and MSA\nsize effects, have explanatory power for metropolitan-specific housing returns.\nFurther, we test the robustness of the asset pricing results to inclusion of\ncontrols for socioeconomic variables commonly represented in the house price\nliterature, including changes in employment, affordability, and foreclosure\nincidence. We find a sizable and statistically significant influence of the\nmarket factor on MSA house price returns. Moreover we show that market betas\nhave varied substantially over time. Also, results are largely robust to the\ninclusion of other explanatory variables, including standard measures of risk\nand other housing market fundamentals. Additional tests of model validity using\nthe Fama-MacBeth framework offer further strong support of a positive risk and\nreturn relationship in housing. Our findings are supportive of the application\nof a housing investment risk-return framework in explanation of variation in\nmetro-area cross-section and time-series US house price returns. Further,\nresults strongly corroborate Case-Shiller survey research indicating the\nimportance of speculative forces in the determination of U.S. housing returns.\n", "versions": [{"version": "v1", "created": "Wed, 30 Mar 2011 15:55:56 GMT"}], "update_date": "2011-03-31", "authors_parsed": [["Case", "Karl", ""], ["Cotter", "John", ""], ["Gabriel", "Stuart", ""]]}, {"id": "1103.5972", "submitter": "John Cotter", "authors": "John Cotter and Richard Roll", "title": "A Comparative Anatomy of REITs and Residential Real Estate Indexes:\n  Returns, Risks and Distributional Characteristics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.PR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Real Estate Investment Trusts (REITs) are the only truly liquid assets\nrelated to real estate investments. We study the behavior of U.S. REITs over\nthe past three decades and document their return characteristics. REITs have\nsomewhat less market risk than equity; their betas against a broad market index\naverage about .65. Decomposing their covariances into principal components\nreveals several strong factors. REIT characteristics differ to some extent from\nthose of the S&P/Case-Shiller (SCS) residential real estate indexes. This is\npartly attributable to methods of index construction. Our examination of REITs\nsuggests that investment in real estate is far more risky than what might be\ninferred from the widely-followed SCS series. REITs, unlike SCS series are\nforward looking, and this helps them in the prediction of SCS returns. REIT\nforecasts of SCS returns are reasonably precise over a number of periods.\n", "versions": [{"version": "v1", "created": "Wed, 30 Mar 2011 15:58:00 GMT"}], "update_date": "2011-03-31", "authors_parsed": [["Cotter", "John", ""], ["Roll", "Richard", ""]]}]