[{"id": "1112.1521", "submitter": "Andrea Pallavicini Mr", "authors": "Andrea Pallavicini, Daniele Perini and Damiano Brigo", "title": "Funding Valuation Adjustment: a consistent framework including CVA, DVA,\n  collateral,netting rules and re-hypothecation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we describe how to include funding and margining costs into a\nrisk-neutral pricing framework for counterparty credit risk. We consider\nrealistic settings and we include in our models the common market practices\nsuggested by the ISDA documentation without assuming restrictive constraints on\nmargining procedures and close-out netting rules. In particular, we allow for\nasymmetric collateral and funding rates, and exogenous liquidity policies and\nhedging strategies. Re-hypothecation liquidity risk and close-out amount\nevaluation issues are also covered. We define a comprehensive pricing framework\nwhich allows us to derive earlier results on funding or counterparty risk. Some\nrelevant examples illustrate the non trivial settings needed to derive known\nfacts about discounting curves by starting from a general framework and without\nresorting to ad hoc hypotheses. Our main result is a bilateral collateralized\ncounterparty valuation adjusted pricing equation, which allows to price a deal\nwhile taking into account credit and debt valuation adjustments along with\nmargining and funding costs in a coherent way. We find that the equation has a\nrecursive form, making the introduction of an additive funding valuation\nadjustment difficult. Yet, we can cast the pricing equation into a set of\niterative relationships which can be solved by means of standard least-square\nMonte Carlo techniques.\n", "versions": [{"version": "v1", "created": "Wed, 7 Dec 2011 10:56:11 GMT"}, {"version": "v2", "created": "Thu, 8 Dec 2011 22:17:18 GMT"}], "update_date": "2011-12-12", "authors_parsed": [["Pallavicini", "Andrea", ""], ["Perini", "Daniele", ""], ["Brigo", "Damiano", ""]]}, {"id": "1112.1652", "submitter": "Cyril Grunspan", "authors": "Cyril Grunspan", "title": "Asymptotic Expansions of the Lognormal Implied Volatility : A Model Free\n  Approach", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We invert the Black-Scholes formula. We consider the cases low strike, large\nstrike, short maturity and large maturity. We give explicitly the first 5 terms\nof the expansions. A method to compute all the terms by induction is also\ngiven. At the money, we have a closed form formula for implied lognormal\nvolatility in terms of a power series in call price.\n", "versions": [{"version": "v1", "created": "Wed, 7 Dec 2011 18:12:36 GMT"}], "update_date": "2016-11-25", "authors_parsed": [["Grunspan", "Cyril", ""]]}, {"id": "1112.1763", "submitter": "Masaaki Fujii", "authors": "Masaaki Fujii, Akihiko Takahashi", "title": "Clean Valuation Framework for the USD Silo", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the forthcoming ISDA Standard Credit Support Annex (SCSA), the trades\ndenominated in non-G5 currencies as well as those include multiple currencies\nare expected to be allocated to the USD silo, where the contracts are\ncollateralized by USD cash, or a different currency with an appropriate\ninterest rate overlay to achieve the same economic effects. In this paper, we\nhave presented a simple generic valuation framework for the clean price under\nthe USD silo with the the detailed procedures for the initial term structure\nconstruction. We have also shown that Cross Currency Swap (CCS) basis spread\ncan be expressed as a difference between two swap rates.\n", "versions": [{"version": "v1", "created": "Thu, 8 Dec 2011 04:32:59 GMT"}], "update_date": "2011-12-09", "authors_parsed": [["Fujii", "Masaaki", ""], ["Takahashi", "Akihiko", ""]]}, {"id": "1112.1782", "submitter": "Cyril Grunspan", "authors": "Cyril Grunspan", "title": "A Note on the Equivalence between the Normal and the Lognormal Implied\n  Volatility : A Model Free Approach", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  First, we show that implied normal volatility is intimately linked with the\nincomplete Gamma function. Then, we deduce an expansion on implied normal\nvolatility in terms of the time-value of a European call option. Then, we\nformulate an equivalence between the implied normal volatility and the\nlognormal implied volatility with any strike and any model. This generalizes a\nknown result for the SABR model. Finally, we adress the issue of the \"breakeven\nmove\" of a delta-hedged portfolio.\n", "versions": [{"version": "v1", "created": "Thu, 8 Dec 2011 08:57:24 GMT"}], "update_date": "2011-12-09", "authors_parsed": [["Grunspan", "Cyril", ""]]}, {"id": "1112.2638", "submitter": "Jianing Zhang", "authors": "Christian Bender, John Schoenmakers, Jianing Zhang", "title": "Dual representations for general multiple stopping problems", "comments": "This is an updated version of WIAS preprint 1665, 23 November 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the dual representation for generalized multiple\nstopping problems, hence the pricing problem of general multiple exercise\noptions. We derive a dual representation which allows for cashflows which are\nsubject to volume constraints modeled by integer valued adapted processes and\nrefraction periods modeled by stopping times. As such, this extends the works\nby Schoenmakers (2010), Bender (2011a), Bender (2011b), Aleksandrov and Hambly\n(2010), and Meinshausen and Hambly (2004) on multiple exercise options, which\neither take into consideration a refraction period or volume constraints, but\nnot both simultaneously. We also allow more flexible cashflow structures than\nthe additive structure in the above references. For example some exponential\nutility problems are covered by our setting. We supplement the theoretical\nresults with an explicit Monte Carlo algorithm for constructing confidence\nintervals for the price of multiple exercise options and exemplify it by a\nnumerical study on the pricing of a swing option in an electricity market.\n", "versions": [{"version": "v1", "created": "Mon, 12 Dec 2011 18:00:56 GMT"}], "update_date": "2011-12-13", "authors_parsed": [["Bender", "Christian", ""], ["Schoenmakers", "John", ""], ["Zhang", "Jianing", ""]]}, {"id": "1112.2952", "submitter": "Ying Jiao", "authors": "Lijun Bo, Ying Jiao (LPMA), Xuewei Yang", "title": "Credit derivatives pricing with default density term structure modelled\n  by L\\'evy random fields", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We model the term structure of the forward default intensity and the default\ndensity by using L\\'evy random fields, which allow us to consider the credit\nderivatives with an after-default recovery payment. As applications, we study\nthe pricing of a defaultable bond and represent the pricing kernel as the\nunique solution of a parabolic integro-differential equation. Finally, we\nillustrate by numerical examples the impact of the contagious jump risks on the\ndefaultable bond price in our model.\n", "versions": [{"version": "v1", "created": "Tue, 13 Dec 2011 16:46:16 GMT"}], "update_date": "2011-12-14", "authors_parsed": [["Bo", "Lijun", "", "LPMA"], ["Jiao", "Ying", "", "LPMA"], ["Yang", "Xuewei", ""]]}, {"id": "1112.3012", "submitter": "Maxim Bichuch", "authors": "Maxim Bichuch", "title": "Pricing a Contingent Claim Liability with Transaction Costs Using\n  Asymptotic Analysis for Optimal Investment", "comments": "24 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We price a contingent claim liability using the utility indifference\nargument. We consider an agent with exponential utility, who invests in a stock\nand a money market account with the goal of maximizing the utility of his\ninvestment at the final time T in the presence of positive proportional\ntransaction cost in two cases with and without a contingent claim liability.\nUsing the computations from the heuristic argument in Whalley & Wilmott we\nprovide a rigorous derivation of the asymptotic expansion of the value function\nin powers of the transaction cost parameter around the known value function for\nthe case of zero transaction cost in both cases with and without a contingent\nclaim liability. Additionally, using utility indifference method we derive an\nasymptotic expansion of the price of the contingent claim liability. In both\ncases, we also obtain a \"nearly optimal\" strategy, whose expected utility\nasymptotically matches the leading terms of the value function.\n", "versions": [{"version": "v1", "created": "Tue, 13 Dec 2011 20:08:01 GMT"}], "update_date": "2011-12-14", "authors_parsed": [["Bichuch", "Maxim", ""]]}, {"id": "1112.4534", "submitter": "Cristin Buescu", "authors": "Cristin Buescu, Michael Taksar and Fatoumata J. Kon\\'e", "title": "An application of the method of moments to volatility estimation using\n  daily high, low, opening and closing prices", "comments": "19 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST math.PR q-fin.PR stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use the expectation of the range of an arithmetic Brownian motion and the\nmethod of moments on the daily high, low, opening and closing prices to\nestimate the volatility of the stock price. The daily price jump at the opening\nis considered to be the result of the unobserved evolution of an after-hours\nvirtual trading day.The annualized volatility is used to calculate\nBlack-Scholes prices for European options, and a trading strategy is devised to\nprofit when these prices differ flagrantly from the market prices.\n", "versions": [{"version": "v1", "created": "Tue, 20 Dec 2011 00:04:36 GMT"}], "update_date": "2011-12-21", "authors_parsed": [["Buescu", "Cristin", ""], ["Taksar", "Michael", ""], ["Koné", "Fatoumata J.", ""]]}, {"id": "1112.4740", "submitter": "Adrien Nguyen Huu", "authors": "Adrien Nguyen Huu (CEREMADE, FiME)", "title": "A note on super-hedging for investor-producers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.OC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the situation of an agent who can trade on a financial market and\ncan also transform some assets into others by means of a production system, in\norder to price and hedge derivatives on produced goods. This framework is\nmotivated by the case of an electricity producer who wants to hedge a position\non the electricity spot price and can trade commodities which are inputs for\nhis system. This extends the essential results of Bouchard & Nguyen Huu (2011)\nto continuous time markets. We introduce the generic concept of conditional\nsure profit along the idea of the no sure profit condition of R\\`asonyi (2009).\nThe condition allows one to provide a closedness property for the set of\nsuper-hedgeable claims in a very general financial setting. Using standard\nseparation arguments, we then deduce a dual characterization of the latter and\nprovide an application to power futures pricing.\n", "versions": [{"version": "v1", "created": "Tue, 20 Dec 2011 15:46:25 GMT"}, {"version": "v2", "created": "Tue, 27 Dec 2011 18:02:15 GMT"}, {"version": "v3", "created": "Thu, 1 Mar 2012 07:40:56 GMT"}], "update_date": "2012-03-02", "authors_parsed": [["Huu", "Adrien Nguyen", "", "CEREMADE, FiME"]]}, {"id": "1112.4824", "submitter": "Paul M. N. Feehan", "authors": "Paul M. N. Feehan and Camelia Pop", "title": "A Schauder approach to degenerate-parabolic partial differential\n  equations with unbounded coefficients", "comments": "42 pages; corresponds to Part 1 of our previous article\n  [arxiv.org:1112.4824v1]. Incorporates final galley proof corrections\n  corresponding to published version", "journal-ref": "Journal of Differential Equations 254 (2013), 4401-4445", "doi": "10.1016/j.jde.2013.03.006", "report-no": null, "categories": "math.AP math.PR q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by applications to probability and mathematical finance, we\nconsider a parabolic partial differential equation on a half-space whose\ncoefficients are suitably Holder continuous and allowed to grow linearly in the\nspatial variable and which become degenerate along the boundary of the\nhalf-space. We establish existence and uniqueness of solutions in weighted\nHolder spaces which incorporate both the degeneracy at the boundary and the\nunboundedness of the coefficients. In our companion article [arXiv:1211.4636],\nwe apply the main result of this article to show that the martingale problem\nassociated with a degenerate-elliptic partial differential operator is\nwell-posed in the sense of Stroock and Varadhan.\n", "versions": [{"version": "v1", "created": "Tue, 20 Dec 2011 20:34:24 GMT"}, {"version": "v2", "created": "Wed, 21 Nov 2012 04:16:56 GMT"}, {"version": "v3", "created": "Mon, 25 Feb 2013 21:39:05 GMT"}, {"version": "v4", "created": "Mon, 25 Mar 2013 21:39:24 GMT"}, {"version": "v5", "created": "Thu, 8 Aug 2013 13:40:50 GMT"}], "update_date": "2016-04-08", "authors_parsed": [["Feehan", "Paul M. N.", ""], ["Pop", "Camelia", ""]]}, {"id": "1112.5340", "submitter": "Winslow Strong", "authors": "Winslow Strong", "title": "Fundamental theorems of asset pricing for piecewise semimartingales of\n  stochastic dimension", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this paper is two-fold. First is to extend the notions of an\nn-dimensional semimartingale and its stochastic integral to a piecewise\nsemimartingale of stochastic dimension. The properties of the former carry over\nlargely intact to the latter, avoiding some of the pitfalls of\ninfinite-dimensional stochastic integration. Second is to extend two\nfundamental theorems of asset pricing (FTAPs): the equivalence of no free lunch\nwith vanishing risk to the existence of an equivalent sigma-martingale measure\nfor the price process, and the equivalence of no arbitrage of the first kind to\nthe existence of an equivalent local martingale deflator for the set of\nnonnegative wealth processes.\n", "versions": [{"version": "v1", "created": "Thu, 22 Dec 2011 14:59:09 GMT"}], "update_date": "2011-12-23", "authors_parsed": [["Strong", "Winslow", ""]]}]