[{"id": "1206.0482", "submitter": "Martin Klimmek", "authors": "Martin Klimmek", "title": "The Wronskian parameterizes the class of diffusions with a given\n  distribution at a random time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a complete characterization of the class of one-dimensional\ntime-homogeneous diffusions consistent with a given law at an exponentially\ndistributed time using classical results in diffusion theory. To illustrate we\ncharacterize the class of diffusions with the same distribution as Brownian\nmotion at an exponentially distributed time.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jun 2012 19:34:53 GMT"}, {"version": "v2", "created": "Wed, 6 Jun 2012 15:53:49 GMT"}, {"version": "v3", "created": "Wed, 27 Jun 2012 16:15:17 GMT"}], "update_date": "2012-06-28", "authors_parsed": [["Klimmek", "Martin", ""]]}, {"id": "1206.0831", "submitter": "Paul M. N. Feehan", "authors": "Panagiota Daskalopoulos and Paul M. N. Feehan", "title": "C^{1,1} regularity for degenerate elliptic obstacle problems", "comments": "31 pages, 8 figures. To appear in the Journal of Differential\n  Equations", "journal-ref": "Journal of Differential Equations 260 (2016), 5043-5074", "doi": "10.1016/j.jde.2015.11.037", "report-no": null, "categories": "math.AP math.PR q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Heston stochastic volatility process is a degenerate diffusion process\nwhere the degeneracy in the diffusion coefficient is proportional to the square\nroot of the distance to the boundary of the half-plane. The generator of this\nprocess with killing, called the elliptic Heston operator, is a second-order,\ndegenerate-elliptic partial differential operator, where the degeneracy in the\noperator symbol is proportional to the distance to the boundary of the\nhalf-plane. In mathematical finance, solutions to the obstacle problem for the\nelliptic Heston operator correspond to value functions for perpetual\nAmerican-style options on the underlying asset. With the aid of weighted\nSobolev spaces and weighted Holder spaces, we establish the optimal $C^{1,1}$\nregularity (up to the boundary of the half-plane) for solutions to obstacle\nproblems for the elliptic Heston operator when the obstacle functions are\nsufficiently smooth.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2012 07:34:59 GMT"}, {"version": "v2", "created": "Wed, 10 Sep 2014 11:19:48 GMT"}, {"version": "v3", "created": "Mon, 20 Oct 2014 02:10:42 GMT"}, {"version": "v4", "created": "Mon, 30 Nov 2015 19:38:36 GMT"}, {"version": "v5", "created": "Tue, 5 Jan 2016 20:39:43 GMT"}], "update_date": "2016-04-08", "authors_parsed": [["Daskalopoulos", "Panagiota", ""], ["Feehan", "Paul M. N.", ""]]}, {"id": "1206.1400", "submitter": "Ognyan Kounchev", "authors": "K. Milanov, O. Kounchev", "title": "Binomial Tree Model for Convertible Bond Pricing within Equity to Credit\n  Risk Framework", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present paper we fill an essential gap in the Convertible Bonds\npricing world by deriving a Binary Tree based model for valuation subject to\ncredit risk. This model belongs to the framework known as Equity to Credit\nRisk. We show that this model converges in continuous time to the model\ndeveloped by Ayache, Forsyth and Vetzal [2003]. To this end, both forms of\ncredit risk modeling, the so-called reduced (constant intensity of default\nmodel for the underlying) and the so-called synthesis (variable intensity of\ndefault model for the underlying) are considered. We highlight and quantify\ncertain issues that arise, as transition probability analysis and threshold\nvalues of model inputs (tree step, underlying stock price, etc.). This study\nmay be considered as an alternative way to develop the price dynamics model of\nAyache et al. [2003] for convertible bonds in credit risk environment.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2012 05:04:40 GMT"}], "update_date": "2012-06-08", "authors_parsed": [["Milanov", "K.", ""], ["Kounchev", "O.", ""]]}, {"id": "1206.1504", "submitter": "Michel Fliess", "authors": "Michel Fliess (LIX), C\\'edric Join (INRIA Saclay - Ile de France,\n  CRAN)", "title": "Preliminary remarks on option pricing and dynamic hedging", "comments": "1st International Conference on Systems and Computer Science,\n  Villeneuve d'Ascq : France (2012)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.LO q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An elementary arbitrage principle and the existence of trends in financial\ntime series, which is based on a theorem published in 1995 by P. Cartier and Y.\nPerrin, lead to a new understanding of option pricing and dynamic hedging.\nIntricate problems related to violent behaviors of the underlying, like the\nexistence of jumps, become then quite straightforward by incorporating them\ninto the trends. Several convincing computer experiments are reported.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2012 14:19:04 GMT"}], "update_date": "2012-06-11", "authors_parsed": [["Fliess", "Michel", "", "LIX"], ["Join", "Cédric", "", "INRIA Saclay - Ile de France,\n  CRAN"]]}, {"id": "1206.2112", "submitter": "Lorenzo Torricelli Mr.", "authors": "Lorenzo Torricelli", "title": "Pricing joint claims on an asset and its realized variance under\n  stochastic volatility models", "comments": "13 pages, 5 Tables. Part of the material was presented at Santander\n  monthly seminar in quantitative finance, London, January 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a stochastic volatility framework, we find a general pricing equation for\nthe class of payoffs depending on the terminal value of a market asset and its\nfinal quadratic variation. This allows a pricing tool for European-style claims\npaying off at maturity a joint function of the underlying and its realised\nvolatility/variance. We study the solution under different stochastic\nvolatility models, give a formula for the computation of the Delta and Gamma of\nthese claims, and introduce some new interesting payoffs that can be priced\nthrough this equation. Numerical results are given and compared to those from\nplain vanilla derivatives.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jun 2012 07:00:18 GMT"}], "update_date": "2012-06-12", "authors_parsed": [["Torricelli", "Lorenzo", ""]]}, {"id": "1206.2934", "submitter": "Yuri Imamura", "authors": "Yuri Imamura, Yuta Ishigaki, Takuya Kawagoe and Toshiki Okumura", "title": "A Numerical Scheme Based on Semi-Static Hedging Strategy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present paper, we introduce a numerical scheme for the price of a\nbarrier option when the price of the underlying follows a diffusion process.\nThe numerical scheme is based on an extension of a static hedging formula of\nbarrier options. For getting the static hedging formula, the underlying process\nneeds to have a symmetry. We introduce a way to \"symmetrize\" a given diffusion\nprocess. Then the pricing of a barrier option is reduced to that of plain\noptions under the symmetrized process. To show how our symmetrization scheme\nworks, we will present some numerical results applying (path-independent)\nEuler-Maruyama approximation to our scheme, comparing them with the\npath-dependent Euler-Maruyama scheme when the model is of the Black-Scholes,\nCEV, Heston, and $ (\\lambda) $-SABR, respectively. The results show the\neffectiveness of our scheme.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2012 20:12:59 GMT"}, {"version": "v2", "created": "Sat, 18 Aug 2012 08:57:57 GMT"}], "update_date": "2012-08-21", "authors_parsed": [["Imamura", "Yuri", ""], ["Ishigaki", "Yuta", ""], ["Kawagoe", "Takuya", ""], ["Okumura", "Toshiki", ""]]}, {"id": "1206.3104", "submitter": "Alexander Lipton", "authors": "Alexander Lipton and Ioana Savescu", "title": "A structural approach to pricing credit default swaps with credit and\n  debt value adjustments", "comments": "17 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A multi-dimensional extension of the structural default model with firms'\nvalues driven by diffusion processes with Marshall-Olkin-inspired correlation\nstructure is presented. Semi-analytical methods for solving the forward\ncalibration problem and backward pricing problem in three dimensions are\ndeveloped. The model is used to analyze bilateral counterparty risk for credit\ndefault swaps and evaluate the corresponding credit and debt value adjustments.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2012 13:39:03 GMT"}], "update_date": "2012-06-15", "authors_parsed": [["Lipton", "Alexander", ""], ["Savescu", "Ioana", ""]]}, {"id": "1206.3220", "submitter": "Constantinos Kardaras", "authors": "Constantinos Kardaras", "title": "Valuation and parities for exchange options", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Valuation and parity formulas for both European-style and American-style\nexchange options are presented in a general financial model allowing for jumps,\npossibility of default and \"bubbles\" in asset prices. The formulas are given\nvia expectations of auxiliary probabilities using the change-of-numeraire\ntechnique. Extensive discussion is provided regarding the way that folklore\nresults such as Merton's no-early-exercise theorem and traditional parity\nrelations have to be altered in this more versatile framework.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2012 19:36:14 GMT"}, {"version": "v2", "created": "Sat, 29 Nov 2014 13:18:39 GMT"}], "update_date": "2014-12-02", "authors_parsed": [["Kardaras", "Constantinos", ""]]}, {"id": "1206.4766", "submitter": "Xiaotong Shen", "authors": "Takeaki Kariya", "title": "A CB (corporate bond) pricing probabilities and recovery rates model for\n  deriving default probabilities and recovery rates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we formulate a corporate bond (CB) pricing model for deriving\nthe term structure of default probabilities (TSDP) and the recovery rate (RR)\nfor each pair of industry factor and credit rating grade, and these derived\nTSDP and RR are regarded as what investors imply in forming CB prices in the\nmarket at each time. A unique feature of this formulation is that the model\nallows each firm to run several business lines corresponding to some industry\ncategories, which is typical in reality. In fact, treating all the\ncross-sectional CB prices simultaneously under a credit correlation structure\nat each time makes it possible to sort out the overlapping business lines of\nthe firms which issued CBs and to extract the TSDPs for each pair of individual\nindustry factor and rating grade together with the RRs. The result is applied\nto a valuation of CDS (credit default swap) and a loan portfolio management in\nbanking business.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2012 03:06:55 GMT"}, {"version": "v2", "created": "Wed, 4 Jul 2012 21:40:36 GMT"}], "update_date": "2012-07-06", "authors_parsed": [["Kariya", "Takeaki", ""]]}, {"id": "1206.4804", "submitter": "David German", "authors": "David German and Henry Schellhorn", "title": "A No-Arbitrage Model of Liquidity in Financial Markets involving\n  Brownian Sheets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a dynamic market model where buyers and sellers submit limit\norders. If at a given moment in time, the buyer is unable to complete his\nentire order due to the shortage of sell orders at the required limit price,\nthe unmatched part of the order is recorded in the order book. Subsequently\nthese buy unmatched orders may be matched with new incoming sell orders. The\nresulting demand curve constitutes the sole input to our model. The clearing\nprice is then mechanically calculated using the market clearing condition. We\nuse a Brownian sheet to model the demand curve, and provide some theoretical\nassumptions under which such a model is justified.\n  Our main result is the proof that if there exists a unique equivalent\nmartingale measure for the clearing price, then under some mild assumptions\nthere is no arbitrage. We use the Ito- Wentzell formula to obtain that result,\nand also to characterize the dynamics of the demand curve and of the clearing\nprice in the equivalent measure. We find that the volatility of the clearing\nprice is (up to a stochastic factor) inversely proportional to the sum of buy\nand sell order flow density (evaluated at the clearing price), which confirms\nthe intuition that volatility is inversely proportional to volume. We also\ndemonstrate that our approach is implementable. We use real order book data and\nsimulate option prices under a particularly simple parameterization of our\nmodel.\n  The no-arbitrage conditions we obtain are applicable to a wide class of\nmodels, in the same way that the Heath-Jarrow-Morton conditions apply to a wide\nclass of interest rate models.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2012 08:14:54 GMT"}], "update_date": "2012-06-22", "authors_parsed": [["German", "David", ""], ["Schellhorn", "Henry", ""]]}, {"id": "1206.4917", "submitter": "Tom Fischer Prof. Dr.", "authors": "Tom Fischer", "title": "A shorter proof of Lemma A.6 (arXiv:1005.0768)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the convenience of readers of the article {\\em No-arbitrage pricing under\nsystemic risk: accounting for cross-ownership} (Fischer, 2012,\narXiv:1005.0768), a full proof of Lemma A.5 and a shorter proof of Lemma A.6 of\nthat paper are provided.\n", "versions": [{"version": "v1", "created": "Thu, 21 Jun 2012 15:37:20 GMT"}], "update_date": "2012-06-22", "authors_parsed": [["Fischer", "Tom", ""]]}, {"id": "1206.5046", "submitter": "Dongjae Lim", "authors": "Dongjae Lim, Lingfei Li, Vadim Linetsky", "title": "Evaluating Callable and Putable Bonds: An Eigenfunction Expansion\n  Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an efficient method to evaluate callable and putable bonds under a\nwide class of interest rate models, including the popular short rate diffusion\nmodels, as well as their time changed versions with jumps. The method is based\non the eigenfunction expansion of the pricing operator. Given the set of call\nand put dates, the callable and putable bond pricing function is the value\nfunction of a stochastic game with stopping times. Under some technical\nconditions, it is shown to have an eigenfunction expansion in eigenfunctions of\nthe pricing operator with the expansion coefficients determined through a\nbackward recursion. For popular short rate diffusion models, such as CIR,\nVasicek, 3/2, the method is orders of magnitude faster than the alternative\napproaches in the literature. In contrast to the alternative approaches in the\nliterature that have so far been limited to diffusions, the method is equally\napplicable to short rate jump-diffusion and pure jump models constructed from\ndiffusion models by Bochner's subordination with a L\\'{e}vy subordinator.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2012 03:25:30 GMT"}], "update_date": "2012-06-25", "authors_parsed": [["Lim", "Dongjae", ""], ["Li", "Lingfei", ""], ["Linetsky", "Vadim", ""]]}, {"id": "1206.5393", "submitter": "Carmine De Franco", "authors": "Carmine De Franco, Peter Tankov and Xavier Warin", "title": "Numerical methods for the quadratic hedging problem in Markov models\n  with jumps", "comments": "37 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop algorithms for the numerical computation of the quadratic hedging\nstrategy in incomplete markets modeled by pure jump Markov process. Using the\nHamilton-Jacobi-Bellman approach, the value function of the quadratic hedging\nproblem can be related to a triangular system of parabolic partial\nintegro-differential equations (PIDE), which can be shown to possess unique\nsmooth solutions in our setting. The first equation is non-linear, but does not\ndepend on the pay-off of the option to hedge (the pure investment problem),\nwhile the other two equations are linear. We propose convergent finite\ndifference schemes for the numerical solution of these PIDEs and illustrate our\nresults with an application to electricity markets, where time-inhomogeneous\npure jump Markov processes appear in a natural manner.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jun 2012 13:52:41 GMT"}, {"version": "v2", "created": "Sat, 25 May 2013 15:49:56 GMT"}, {"version": "v3", "created": "Wed, 11 Dec 2013 09:53:41 GMT"}], "update_date": "2013-12-12", "authors_parsed": [["De Franco", "Carmine", ""], ["Tankov", "Peter", ""], ["Warin", "Xavier", ""]]}, {"id": "1206.6325", "submitter": "Bruno Bouchard", "authors": "Bruno Bouchard, Ludovic Moreau, Marcel Nutz", "title": "Stochastic target games with controlled loss", "comments": "Published in at http://dx.doi.org/10.1214/13-AAP938 the Annals of\n  Applied Probability (http://www.imstat.org/aap/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Probability 2014, Vol. 24, No. 3, 899-934", "doi": "10.1214/13-AAP938", "report-no": "IMS-AAP-AAP938", "categories": "math.OC math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a stochastic game where one player tries to find a strategy such\nthat the state process reaches a target of controlled-loss-type, no matter\nwhich action is chosen by the other player. We provide, in a general setup, a\nrelaxed geometric dynamic programming principle for this problem and derive,\nfor the case of a controlled SDE, the corresponding dynamic programming\nequation in the sense of viscosity solutions. As an example, we consider a\nproblem of partial hedging under Knightian uncertainty.\n", "versions": [{"version": "v1", "created": "Wed, 27 Jun 2012 16:12:18 GMT"}, {"version": "v2", "created": "Tue, 14 May 2013 21:27:39 GMT"}, {"version": "v3", "created": "Mon, 28 Apr 2014 09:00:45 GMT"}], "update_date": "2014-04-29", "authors_parsed": [["Bouchard", "Bruno", ""], ["Moreau", "Ludovic", ""], ["Nutz", "Marcel", ""]]}, {"id": "1206.6787", "submitter": "Alexander Lipton", "authors": "Leif Andersen and Alexander Lipton", "title": "Asymptotics for Exponential Levy Processes and their Volatility Smile:\n  Survey and New Results", "comments": "92 pages, 15 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exponential L\\'evy processes can be used to model the evolution of various\nfinancial variables such as FX rates, stock prices, etc. Considerable efforts\nhave been devoted to pricing derivatives written on underliers governed by such\nprocesses, and the corresponding implied volatility surfaces have been analyzed\nin some detail. In the non-asymptotic regimes, option prices are described by\nthe Lewis-Lipton formula which allows one to represent them as Fourier\nintegrals; the prices can be trivially expressed in terms of their implied\nvolatility. Recently, attempts at calculating the asymptotic limits of the\nimplied volatility have yielded several expressions for the short-time,\nlong-time, and wing asymptotics. In order to study the volatility surface in\nrequired detail, in this paper we use the FX conventions and describe the\nimplied volatility as a function of the Black-Scholes delta. Surprisingly, this\nconvention is closely related to the resolution of singularities frequently\nused in algebraic geometry. In this framework, we survey the literature,\nreformulate some known facts regarding the asymptotic behavior of the implied\nvolatility, and present several new results. We emphasize the role of\nfractional differentiation in studying the tempered stable exponential Levy\nprocesses and derive novel numerical methods based on judicial\nfinite-difference approximations for fractional derivatives. We also briefly\ndemonstrate how to extend our results in order to study important cases of\nlocal and stochastic volatility models, whose close relation to the L\\'evy\nprocess based models is particularly clear when the Lewis-Lipton formula is\nused. Our main conclusion is that studying asymptotic properties of the implied\nvolatility, while theoretically exciting, is not always practically useful\nbecause the domain of validity of many asymptotic expressions is small.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2012 18:22:36 GMT"}], "update_date": "2012-06-29", "authors_parsed": [["Andersen", "Leif", ""], ["Lipton", "Alexander", ""]]}]