[{"id": "1207.0233", "submitter": "Matthew Lorig", "authors": "Antoine Jacquier and Matthew Lorig", "title": "From characteristic functions to implied volatility expansions", "comments": "21 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For any strictly positive martingale $S = \\exp(X)$ for which $X$ has a\ncharacteristic function, we provide an expansion for the implied volatility.\nThis expansion is explicit in the sense that it involves no integrals, but only\npolynomials in the log strike. We illustrate the versatility of our expansion\nby computing the approximate implied volatility smile in three well-known\nmartingale models: one finite activity exponential L\\'evy model (Merton), one\ninfinite activity exponential L\\'evy model (Variance Gamma), and one stochastic\nvolatility model (Heston). Finally, we illustrate how our expansion can be used\nto perform a model-free calibration of the empirically observed implied\nvolatility surface.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jul 2012 18:24:52 GMT"}, {"version": "v2", "created": "Thu, 12 Jul 2012 13:53:45 GMT"}, {"version": "v3", "created": "Fri, 13 Jul 2012 17:57:56 GMT"}, {"version": "v4", "created": "Tue, 9 Jul 2013 16:31:19 GMT"}, {"version": "v5", "created": "Wed, 25 Jun 2014 16:04:11 GMT"}], "update_date": "2014-06-26", "authors_parsed": [["Jacquier", "Antoine", ""], ["Lorig", "Matthew", ""]]}, {"id": "1207.0750", "submitter": "Matthew Lorig", "authors": "Matthew Lorig", "title": "The Exact Smile of some Local Volatility Models", "comments": "14 pages, 3 figures. arXiv admin note: text overlap with\n  arXiv:1207.1630", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new class of local volatility models. Within this framework,\nwe obtain expressions for both (i) the price of any European option and (ii)\nthe induced implied volatility smile. As an illustration of our framework, we\nperform specific pricing and implied volatility computations for a CEV-like\nexample. Numerical examples are provided.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2012 17:02:57 GMT"}, {"version": "v2", "created": "Fri, 13 Jul 2012 18:00:07 GMT"}, {"version": "v3", "created": "Tue, 31 Jul 2012 01:31:14 GMT"}, {"version": "v4", "created": "Fri, 9 Nov 2012 15:16:25 GMT"}], "update_date": "2012-11-12", "authors_parsed": [["Lorig", "Matthew", ""]]}, {"id": "1207.0843", "submitter": "Peter Tankov", "authors": "Aleksandar Mijatovi\\'c and Peter Tankov", "title": "A new look at short-term implied volatility in asset price models with\n  jumps", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyse the behaviour of the implied volatility smile for options close to\nexpiry in the exponential L\\'evy class of asset price models with jumps. We\nintroduce a new renormalisation of the strike variable with the property that\nthe implied volatility converges to a non-constant limiting shape, which is a\nfunction of both the diffusion component of the process and the jump activity\n(Blumenthal-Getoor) index of the jump component. Our limiting implied\nvolatility formula relates the jump activity of the underlying asset price\nprocess to the short end of the implied volatility surface and sheds new light\non the difference between finite and infinite variation jumps from the\nviewpoint of option prices: in the latter, the wings of the limiting smile are\ndetermined by the jump activity indices of the positive and negative jumps,\nwhereas in the former, the wings have a constant model-independent slope. This\nresult gives a theoretical justification for the preference of the infinite\nvariation L\\'evy models over the finite variation ones in the calibration based\non short-maturity option prices.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2012 22:09:30 GMT"}, {"version": "v2", "created": "Mon, 16 Jul 2012 07:39:06 GMT"}], "update_date": "2012-07-17", "authors_parsed": [["Mijatović", "Aleksandar", ""], ["Tankov", "Peter", ""]]}, {"id": "1207.1630", "submitter": "Matthew Lorig", "authors": "Antoine Jacquier, Matthew Lorig", "title": "The Smile of certain L\\'evy-type Models", "comments": "31 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a class of assets whose risk-neutral pricing dynamics are\ndescribed by an exponential L\\'evy-type process subject to default. The class\nof processes we consider features locally-dependent drift, diffusion and\ndefault-intensity as well as a locally-dependent L\\'evy measure. Using\ntechniques from regular perturbation theory and Fourier analysis, we derive a\nseries expansion for the price of a European-style option. We also provide\nprecise conditions under which this series expansion converges to the exact\nprice. Additionally, for a certain subclass of assets in our modeling\nframework, we derive an expansion for the implied volatility induced by our\noption pricing formula. The implied volatility expansion is exact within its\nradius of convergence. As an example of our framework, we propose a class of\nCEV-like L\\'evy-type models. Within this class, approximate option prices can\nbe computed by a single Fourier integral and approximate implied volatilities\nare explicit (i.e., no integration is required). Furthermore, the class of\nCEV-like L\\'evy-type models is shown to provide a tight fit to the implied\nvolatility surface of S{&}P500 index options.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2012 14:03:49 GMT"}, {"version": "v2", "created": "Thu, 12 Jul 2012 18:09:32 GMT"}, {"version": "v3", "created": "Fri, 13 Jul 2012 18:02:00 GMT"}, {"version": "v4", "created": "Tue, 31 Jul 2012 01:35:00 GMT"}, {"version": "v5", "created": "Thu, 18 Apr 2013 15:09:50 GMT"}], "update_date": "2013-04-19", "authors_parsed": [["Jacquier", "Antoine", ""], ["Lorig", "Matthew", ""]]}, {"id": "1207.2316", "submitter": "Cristin Buescu", "authors": "Damiano Brigo, Cristin Buescu, Andrea Pallavicini, Qing Liu", "title": "Illustrating a problem in the self-financing condition in two 2010-2011\n  papers on funding, collateral and discounting", "comments": "added references, a footnote and updated abstract", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We illustrate a problem in the self-financing condition used in the papers\n\"Funding beyond discounting: collateral agreements and derivatives pricing\"\n(Risk Magazine, February 2010) and \"Partial Differential Equation\nRepresentations of Derivatives with Counterparty Risk and Funding Costs\" (The\nJournal of Credit Risk, 2011). These papers state an erroneous self-financing\ncondition. In the first paper, this is equivalent to assuming that the equity\nposition is self-financing on its own and without including the cash position.\nIn the second paper, this is equivalent to assuming that a subportfolio is\nself-financing on its own, rather than the whole portfolio. The error in the\nfirst paper is avoided when clearly distinguishing between price processes,\ndividend processes and gain processes. We present an outline of the derivation\nthat yields the correct statement of the self-financing condition, clarifying\nthe structure of the relevant funding accounts, and show that the final result\nin \"Funding beyond discounting\" is correct, even if the self-financing\ncondition stated is not.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2012 11:49:03 GMT"}, {"version": "v2", "created": "Mon, 16 Jul 2012 19:40:25 GMT"}], "update_date": "2012-07-17", "authors_parsed": [["Brigo", "Damiano", ""], ["Buescu", "Cristin", ""], ["Pallavicini", "Andrea", ""], ["Liu", "Qing", ""]]}, {"id": "1207.4608", "submitter": "Stefan Gerhold", "authors": "S\\\"uhan Altay, Stefan Gerhold, Karin Hirhager", "title": "Digital double barrier options: Several barrier periods and structure\n  floors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We determine the price of digital double barrier options with an arbitrary\nnumber of barrier periods in the Black-Scholes model. This means that the\nbarriers are active during some time intervals, but are switched off in\nbetween. As an application, we calculate the value of a structure floor for\nstructured notes whose individual coupons are digital double barrier options.\nThis value can also be approximated by the price of a corridor put.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2012 10:36:38 GMT"}, {"version": "v2", "created": "Tue, 24 Jul 2012 13:05:07 GMT"}], "update_date": "2012-07-25", "authors_parsed": [["Altay", "Sühan", ""], ["Gerhold", "Stefan", ""], ["Hirhager", "Karin", ""]]}, {"id": "1207.6049", "submitter": "Alexander Lipton", "authors": "Alexander Lipton and Ioana Savescu", "title": "Pricing credit default swaps with bilateral value adjustments", "comments": "49 pages, 31 figures. arXiv admin note: substantial text overlap with\n  arXiv:1206.3104", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A three-dimensional extension of the structural default model with firms'\nvalues driven by correlated diffusion processes is presented. Green's function\nbased semi-analytical methods for solving the forward calibration problem and\nbackward pricing problem are developed. These methods are used to analyze\nbilateral counterparty risk for credit default swaps and evaluate the\ncorresponding credit and debt value adjustments. It is shown that in many\nrealistic cases these value adjustments can be surprisingly large.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jul 2012 16:43:20 GMT"}], "update_date": "2012-07-26", "authors_parsed": [["Lipton", "Alexander", ""], ["Savescu", "Ioana", ""]]}, {"id": "1207.6205", "submitter": "Lauri Viitasaari", "authors": "Lauri Viitasaari", "title": "Option prices with call prices", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There exist several methods how more general options can be priced with call\nprices. In this article, we extend these results to cover a wider class of\noptions and market models. In particular, we introduce a new pricing formula\nwhich can be used to price more general options if prices for call options and\ndigital options are known for every strike price. Moreover, we derive similar\nresults for barrier type options. As a consequence, we obtain a static hedging\nfor general options in the general class of models. Our result can be utilised\nin several significant applications. As a simple example, we derive an upper\nbound for the value of a general American option with convex payoff and\ncharacterise conditions under which the value of this option equals to the\nvalue of the corresponding European option.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jul 2012 08:53:08 GMT"}, {"version": "v2", "created": "Mon, 6 Aug 2012 12:24:14 GMT"}, {"version": "v3", "created": "Wed, 8 Aug 2012 12:47:04 GMT"}], "update_date": "2012-08-09", "authors_parsed": [["Viitasaari", "Lauri", ""]]}, {"id": "1207.6281", "submitter": "Ariel Neufeld", "authors": "Kai Du, Ariel David Neufeld", "title": "A note on asymptotic exponential arbitrage with exponentially decaying\n  failure probability", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of this paper is to prove a result conjectured in F\\\"ollmer and\nSchachermayer [FS07], even in slightly more general form. Suppose that S is a\ncontinuous semimartingale and satisfies a large deviations estimate; this is a\nparticular growth condition on the mean-variance tradeoff process of S. We show\nthat S then allows asymptotic exponential arbitrage with exponentially decaying\nfailure probability, which is a strong and quantitative form of long-term\narbitrage. In contrast to F\\\"ollmer and Schachermayer [FS07], our result does\nnot assume that S is a diffusion, nor does it need any ergodicity assumption.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jul 2012 13:54:48 GMT"}], "update_date": "2012-07-27", "authors_parsed": [["Du", "Kai", ""], ["Neufeld", "Ariel David", ""]]}]