[{"id": "1310.0032", "submitter": "Thorsten Schmidt", "authors": "Irene Klein, Thorsten Schmidt, Josef Teichmann", "title": "When roll-overs do not qualify as num\\'eraire: bond markets beyond short\n  rate paradigms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate default-free bond markets where the standard relationship\nbetween a possibly existing bank account process and the term structure of bond\nprices is broken, i.e. the bank account process is not a valid num\\'eraire. We\nargue that this feature is not the exception but rather the rule in bond\nmarkets when starting with, e.g., terminal bonds as num\\'eraires.\n  Our setting are general c\\`adl\\`ag processes as bond prices, where we employ\ndirectly methods from large financial markets. Moreover, we do not restrict\nprice process to be semimartingales, which allows for example to consider\nmarkets driven by fractional Brownian motion. In the core of the article we\nrelate the appropriate no arbitrage assumptions (NAFL), i.e. no asymptotic free\nlunch, to the existence of an equivalent local martingale measure with respect\nto the terminal bond as num\\'eraire, and no arbitrage opportunities of the\nfirst kind (NAA1) to the existence of a supermartingale deflator, respectively.\nIn all settings we obtain existence of a generalized bank account as a limit of\nconvex combinations of roll-over bonds.\n  Additionally we provide an alternative definition of the concept of a\nnum\\'eraire, leading to a possibly interesting connection to bubbles. If we can\nconstruct a bank account process through roll-overs, we can relate the\nimpossibility of taking the bank account as num\\'eraire to liquidity effects.\nHere we enter endogenously the arena of multiple yield curves.\n  The theory is illustrated by several examples.\n", "versions": [{"version": "v1", "created": "Mon, 30 Sep 2013 20:04:58 GMT"}], "update_date": "2013-10-02", "authors_parsed": [["Klein", "Irene", ""], ["Schmidt", "Thorsten", ""], ["Teichmann", "Josef", ""]]}, {"id": "1310.0092", "submitter": "Carole Bernard", "authors": "Carole Bernard, Zhenyu Cui, Don McLeish", "title": "On the martingale property in stochastic volatility models based on\n  time-homogeneous diffusions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Lions and Musiela (2007) give sufficient conditions to verify when a\nstochastic exponential of a continuous local martingale is a martingale or a\nuniformly integrable martingale. Blei and Engelbert (2009) and Mijatovi\\'c and\nUrusov (2012c) give necessary and sufficient conditions in the case of perfect\ncorrelation (\\rho=1). For financial applications, such as checking the\nmartingale property of the stock price process in correlated stochastic\nvolatility models, we extend their work to the arbitrary correlation case\n(-1<=\\rho<=1). We give a complete classification of the convergence properties\nof integral functionals of time-homogeneous diffusions and generalize results\nin Mijatovi\\'c and Urusov (2012b) (2012c) with alternate proofs avoiding the\nuse of separating times (concept introduced by Cherny and Urusov (2004) and\nextensively used in the proofs of Mijatovi\\'c and Urusov (2012c)).\n", "versions": [{"version": "v1", "created": "Mon, 30 Sep 2013 23:29:17 GMT"}, {"version": "v2", "created": "Tue, 17 Jun 2014 02:05:52 GMT"}, {"version": "v3", "created": "Wed, 9 Jul 2014 18:13:03 GMT"}], "update_date": "2014-07-10", "authors_parsed": [["Bernard", "Carole", ""], ["Cui", "Zhenyu", ""], ["McLeish", "Don", ""]]}, {"id": "1310.0099", "submitter": "Zhenyu Cui", "authors": "Carole Bernard, Zhenyu Cui, Don McLeish", "title": "Convergence of the discrete variance swap in time-homogeneous diffusion\n  models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In stochastic volatility models based on time-homogeneous diffusions, we\nprovide a simple necessary and sufficient condition for the discretely sampled\nfair strike of a variance swap to converge to the continuously sampled fair\nstrike. It extends Theorem 3.8 of Jarrow, Kchia, Larsson and Protter (2013) and\ngives an affirmative answer to a problem posed in this paper in the case of 3/2\nstochastic volatility model. We also give precise conditions (not based on\nasymptotics) when the discrete fair strike of the variance swap is higher than\nthe continuous one and discuss the convex order conjecture proposed by\nKeller-Ressel and Griessler (2012) in this context.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2013 00:02:28 GMT"}], "update_date": "2016-11-26", "authors_parsed": [["Bernard", "Carole", ""], ["Cui", "Zhenyu", ""], ["McLeish", "Don", ""]]}, {"id": "1310.1020", "submitter": "Stefano De Marco", "authors": "Stefano De Marco, Caroline Hillairet, Antoine Jacquier", "title": "Shapes of implied volatility with positive mass at zero", "comments": "24 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the shapes of the implied volatility when the underlying\ndistribution has an atom at zero and analyse the impact of a mass at zero on\nat-the-money implied volatility and the overall level of the smile. We further\nshow that the behaviour at small strikes is uniquely determined by the mass of\nthe atom up to high asymptotic order, under mild assumptions on the remaining\ndistribution on the positive real line. We investigate the structural\ndifference with the no-mass-at-zero case, showing how one\ncan--theoretically--distinguish between mass at the origin and a\nheavy-left-tailed distribution. We numerically test our model-free results in\nstochastic models with absorption at the boundary, such as the CEV process, and\nin jump-to-default models. Note that while Lee's moment formula tells that\nimplied variance is at most asymptotically linear in log-strike, other\ncelebrated results for exact smile asymptotics such as Benaim and Friz (09) or\nGulisashvili (10) do not apply in this setting--essentially due to the\nbreakdown of Put-Call duality.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2013 16:09:27 GMT"}, {"version": "v2", "created": "Sat, 6 Sep 2014 21:23:50 GMT"}, {"version": "v3", "created": "Tue, 30 Aug 2016 16:58:44 GMT"}, {"version": "v4", "created": "Wed, 3 May 2017 12:25:02 GMT"}], "update_date": "2017-05-04", "authors_parsed": [["De Marco", "Stefano", ""], ["Hillairet", "Caroline", ""], ["Jacquier", "Antoine", ""]]}, {"id": "1310.1102", "submitter": "Louis Paulot", "authors": "Louis Paulot", "title": "Arbitrage-Free Pricing Before and Beyond Probabilities", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  \"Fundamental theorem of asset pricing\" roughly states that absence of\narbitrage opportunity in a market is equivalent to the existence of a\nrisk-neutral probability. We give a simple counterexample to this\noversimplified statement. Prices are given by linear forms which do not always\ncorrespond to probabilities. We give examples of such cases. We also show that\narbitrage freedom is equivalent to the continuity of the pricing linear form in\nthe relevant topology. Finally we analyze the possible loss of martingality of\nasset prices with lognormal stochastic volatility. For positive correlation\nmartingality is lost when the financial process is modelled through standard\nprobability theory. We show how to recover martingality using the appropriate\nmathematical tools.\n", "versions": [{"version": "v1", "created": "Thu, 3 Oct 2013 20:09:14 GMT"}], "update_date": "2013-10-07", "authors_parsed": [["Paulot", "Louis", ""]]}, {"id": "1310.1142", "submitter": "Jun Deng", "authors": "Anna Aksamit, Tahir Choulli, Jun Deng, and Monique Jeanblanc", "title": "Non-Arbitrage up to Random Horizon for Semimartingale Models", "comments": "40 pages. This version develops in details the ideas and the results\n  of the previous version and fixes a glitch in the quasi-left-continuous case", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the question of how an arbitrage-free semimartingale\nmodel is affected when stopped at a random horizon. We focus on\nNo-Unbounded-Profit-with-Bounded-Risk (called NUPBR hereafter) concept, which\nis also known in the literature as the first kind of non-arbitrage. For this\nnon-arbitrage notion, we obtain two principal results. The first result lies in\ndescribing the pairs of market model and random time for which the resulting\nstopped model fulfills NUPBR condition. The second main result characterises\nthe random time models that preserve the NUPBR property after stopping for any\nmarket model. These results are elaborated in a very general market model, and\nwe also pay attention to some particular and practical models. The analysis\nthat drives these results is based on new stochastic developments in\nsemimartingale theory with progressive enlargement. Furthermore, we construct\nexplicit martingale densities (deflators) for some classes of local martingales\nwhen stopped at random time.\n", "versions": [{"version": "v1", "created": "Fri, 4 Oct 2013 01:01:23 GMT"}, {"version": "v2", "created": "Wed, 19 Feb 2014 21:22:47 GMT"}], "update_date": "2014-02-21", "authors_parsed": [["Aksamit", "Anna", ""], ["Choulli", "Tahir", ""], ["Deng", "Jun", ""], ["Jeanblanc", "Monique", ""]]}, {"id": "1310.1882", "submitter": "Erindi Allaj", "authors": "Erindi Allaj", "title": "Implicit transaction costs and the fundamental theorems of asset pricing", "comments": "International Journal of Theoretical and Applied Finance, 20(04) 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies arbitrage pricing theory in financial markets with\nimplicit transaction costs. We extend the existing theory to include the more\nrealistic possibility that the price at which the investors trade is dependent\non the traded volume. The investors in the market always buy at the ask and\nsell at the bid price. Implicit transaction costs are composed of two terms,\none is able to capture the bid-ask spread, and the second the price impact.\nMoreover, a new definition of a self-financing portfolio is obtained. The\nself-financing condition suggests that continuous trading is possible, but is\nrestricted to predictable trading strategies having c\\'adl\\'ag\n(right-continuous with left limits) and c\\'agl\\'ad (left-continuous with right\nlimits) paths of bounded quadratic variation and of finitely many jumps. That\nis, c\\'adl\\'ag and c\\'agl\\'ad predictable trading strategies of infinite\nvariation, with finitely many jumps and of finite quadratic variation are\nallowed in our setting. Restricting ourselves to c\\'agl\\'ad predictable trading\nstrategies, we show that the existence of an equivalent probability measure is\nequivalent to the absence of arbitrage opportunities, so that the first\nfundamental theorem of asset pricing (FFTAP) holds. It is also shown that the\nuse of continuous and bounded variation trading strategies can improve the\nefficiency of hedging in a market with implicit transaction costs. To better\nunderstand how to apply the theory proposed we provide an example of an\nimplicit transaction cost economy that is linear and non-linear in the order\nsize.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2013 18:37:22 GMT"}, {"version": "v10", "created": "Sun, 7 Feb 2016 14:21:06 GMT"}, {"version": "v11", "created": "Wed, 29 Mar 2017 10:13:37 GMT"}, {"version": "v12", "created": "Sat, 22 Jul 2017 12:50:28 GMT"}, {"version": "v2", "created": "Sun, 13 Oct 2013 08:45:40 GMT"}, {"version": "v3", "created": "Fri, 18 Apr 2014 09:28:46 GMT"}, {"version": "v4", "created": "Mon, 26 May 2014 08:23:25 GMT"}, {"version": "v5", "created": "Mon, 8 Dec 2014 16:25:29 GMT"}, {"version": "v6", "created": "Thu, 28 May 2015 10:34:29 GMT"}, {"version": "v7", "created": "Thu, 18 Jun 2015 20:51:12 GMT"}, {"version": "v8", "created": "Sun, 8 Nov 2015 15:38:49 GMT"}, {"version": "v9", "created": "Thu, 4 Feb 2016 19:48:51 GMT"}], "update_date": "2017-07-25", "authors_parsed": [["Allaj", "Erindi", ""]]}, {"id": "1310.2973", "submitter": "Kasper Larsen", "authors": "Jin Hyuk Choi and Kasper Larsen", "title": "Taylor approximation of incomplete Radner equilibrium models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the setting of exponential investors and uncertainty governed by Brownian\nmotions we first prove the existence of an incomplete equilibrium for a general\nclass of models. We then introduce a tractable class of exponential-quadratic\nmodels and prove that the corresponding incomplete equilibrium is characterized\nby a coupled set of Riccati equations. Finally, we prove that these\nexponential-quadratic models can be used to approximate the incomplete models\nwe studied in the first part.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2013 22:19:49 GMT"}, {"version": "v2", "created": "Mon, 29 Sep 2014 15:08:28 GMT"}], "update_date": "2014-09-30", "authors_parsed": [["Choi", "Jin Hyuk", ""], ["Larsen", "Kasper", ""]]}, {"id": "1310.3052", "submitter": "Jevgenijs Ivanovs", "authors": "Hansjoerg Albrecher and Jevgenijs Ivanovs", "title": "Power identities for L\\'evy risk models under taxation and capital\n  injections", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study a spectrally negative L\\'evy process which is\nrefracted at its running maximum and at the same time reflected from below at a\ncertain level. Such a process can for instance be used to model an insurance\nsurplus process subject to tax payments according to a loss-carry-forward\nscheme together with the flow of minimal capital injections required to keep\nthe surplus process non-negative. We characterize the first passage time over\nan arbitrary level and the cumulative amount of injected capital up to this\ntime by their joint Laplace transform, and show that it satisfies a simple\npower relation to the case without refraction. It turns out that this identity\ncan also be extended to a certain type of refraction from below. The net\npresent value of tax collected before the cumulative injected capital exceeds a\ncertain amount is determined, and a numerical illustration is provided.\n", "versions": [{"version": "v1", "created": "Fri, 11 Oct 2013 08:34:50 GMT"}, {"version": "v2", "created": "Thu, 6 Mar 2014 08:55:18 GMT"}], "update_date": "2014-03-07", "authors_parsed": [["Albrecher", "Hansjoerg", ""], ["Ivanovs", "Jevgenijs", ""]]}, {"id": "1310.3061", "submitter": "Stefan Gerhold", "authors": "Stefan Gerhold, I. Cetin G\\\"ul\\\"um, Arpad Pinter", "title": "Small-maturity asymptotics for the at-the-money implied volatility slope\n  in L\\'evy models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the at-the-money strike derivative of implied volatility as the\nmaturity tends to zero. Our main results quantify the behavior of the slope for\ninfinite activity exponential L\\'evy models including a Brownian component. As\nauxiliary results, we obtain asymptotic expansions of short maturity\nat-the-money digital call options, using Mellin transform asymptotics. Finally,\nwe discuss when the at-the-money slope is consistent with the steepness of the\nsmile wings, as given by Lee's moment formula.\n", "versions": [{"version": "v1", "created": "Fri, 11 Oct 2013 09:19:20 GMT"}, {"version": "v2", "created": "Mon, 25 Aug 2014 11:15:11 GMT"}, {"version": "v3", "created": "Mon, 30 May 2016 13:34:17 GMT"}], "update_date": "2016-05-31", "authors_parsed": [["Gerhold", "Stefan", ""], ["Gülüm", "I. Cetin", ""], ["Pinter", "Arpad", ""]]}, {"id": "1310.3113", "submitter": "Peter Bank", "authors": "Peter Bank and Selim G\\\"okay", "title": "Superreplication when trading at market indifference prices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study superreplication of European contingent claims in discrete time in a\nlarge trader model with market indifference prices recently proposed by Bank\nand Kramkov. We introduce a suitable notion of efficient friction in this\nframework, adopting a terminology introduced by Kabanov, Rasonyi, and Stricker\nin the context of models with proportional transaction costs. In our framework,\nefficient friction ensures that large positions of the investor may lead to\nlarge losses, a fact from which we derive the existence of superreplicating\nstrategies. We illustrate that without this condition there may be no\nsuperreplicating strategy with minimal costs. In our main result, we establish\nefficient friction under a tail condition on the conditional distributions of\nthe traded securities and under an asymptotic criterion on risk aversions of\nthe market makers. Another result asserts that strict monotonicity of the\nconditional essential infima and suprema of the security prices is sufficient\nfor efficient friction. We give examples that satisfy the assumptions in our\nconditions, which include non-degenerate finite sample space models as well as\nLevy processes and an affine stochastic volatility model of\nBarndorff-Nielsen-Shepard type.\n", "versions": [{"version": "v1", "created": "Fri, 11 Oct 2013 13:10:41 GMT"}], "update_date": "2013-10-14", "authors_parsed": [["Bank", "Peter", ""], ["Gökay", "Selim", ""]]}, {"id": "1310.3386", "submitter": "Chris Kenyon", "authors": "Chris Kenyon and Andrew Green", "title": "Regulatory-Optimal Funding", "comments": "20 pages; 8 figures; 2 tables, Risk, April 2014", "journal-ref": "Risk, 2014, 27(4), 64-69", "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Funding is a cost to trading desks that they see as an input. Current\nFVA-related literature reflects this by also taking funding costs as an input,\nusually constant, and always risk-neutral. However, this funding curve is the\noutput from a Treasury point of view. Treasury must consider\nRegulatory-required liquidity buffers, and both risk-neutral (Q) and physical\nmeasures (P). We describe the Treasury funding problem and optimize against\nboth measures, using the Regulatory requirement as a constraint. We develop\ntheoretically optimal strategies for Q and P, then demonstrate a combined\napproach in four markets (USD, JPY, EUR, GBP). Since we deal with physical\nmeasures we develop appropriate statistical tests, and demonstrate highly\nsignificant (p<0.00001), out-of-sample, improvements on hedged funding with a\ncombined approach achieving 44% to 71% of a perfect information criterion. Thus\nregulatory liquidity requirements change both the funding problem and funding\ncosts.\n", "versions": [{"version": "v1", "created": "Sat, 12 Oct 2013 15:07:32 GMT"}, {"version": "v2", "created": "Tue, 12 Aug 2014 19:55:34 GMT"}], "update_date": "2014-08-26", "authors_parsed": [["Kenyon", "Chris", ""], ["Green", "Andrew", ""]]}, {"id": "1310.3694", "submitter": "Nikolaus Schweizer", "authors": "Christian Bender, Nikolaus Schweizer, Jia Zhuo", "title": "A primal-dual algorithm for BSDEs", "comments": null, "journal-ref": "Mathematical Finance, Vol. 27, 866-901, 2017", "doi": "10.1111/mafi.12100", "report-no": null, "categories": "q-fin.CP math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We generalize the primal-dual methodology, which is popular in the pricing of\nearly-exercise options, to a backward dynamic programming equation associated\nwith time discretization schemes of (reflected) backward stochastic\ndifferential equations (BSDEs). Taking as an input some approximate solution of\nthe backward dynamic program, which was pre-computed, e.g., by least-squares\nMonte Carlo, our methodology allows to construct a confidence interval for the\nunknown true solution of the time discretized (reflected) BSDE at time 0. We\nnumerically demonstrate the practical applicability of our method in two\nfive-dimensional nonlinear pricing problems where tight price bounds were\npreviously unavailable.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2013 14:30:52 GMT"}, {"version": "v2", "created": "Fri, 26 Sep 2014 14:54:53 GMT"}], "update_date": "2021-05-31", "authors_parsed": [["Bender", "Christian", ""], ["Schweizer", "Nikolaus", ""], ["Zhuo", "Jia", ""]]}, {"id": "1310.3860", "submitter": "Hongzhong Zhang", "authors": "Hongzhong Zhang, Tim Leung, Olympia Hadjiliadis", "title": "Stochastic Modeling and Fair Valuation of Drawdown Insurance", "comments": "25 pages, 6 figures. Insurance: Mathematics and Economics,\n  Forthcoming 2013", "journal-ref": null, "doi": "10.1016/j.insmatheco.2013.10.006", "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the stochastic modeling of market drawdown events and the\nfair valuation of insurance contracts based on drawdowns. We model the asset\ndrawdown process as the current relative distance from the historical maximum\nof the asset value. We first consider a vanilla insurance contract whereby the\nprotection buyer pays a constant premium over time to insure against a drawdown\nof a pre-specified level. This leads to the analysis of the conditional Laplace\ntransform of the drawdown time, which will serve as the building block for\ndrawdown insurance with early cancellation or drawup contingency. For the\ncancellable drawdown insurance, we derive the investor's optimal cancellation\ntiming in terms of a two-sided first passage time of the underlying drawdown\nprocess. Our model can also be applied to insure against a drawdown by a\ndefaultable stock. We provide analytic formulas for the fair premium and\nillustrate the impact of default risk.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2013 21:27:58 GMT"}], "update_date": "2016-03-11", "authors_parsed": [["Zhang", "Hongzhong", ""], ["Leung", "Tim", ""], ["Hadjiliadis", "Olympia", ""]]}, {"id": "1310.4067", "submitter": "Diane Wilcox PhD", "authors": "D.L. Wilcox and T.J.Gebbie", "title": "On pricing kernels, information and risk", "comments": "20 pages, 3 figures, 1 table", "journal-ref": "Investment Analysts Journal, 2015, Vol 44, No 1, 1-19", "doi": "10.1080/10293523.2014.994437", "report-no": null, "categories": "q-fin.PR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss the finding that cross-sectional characteristic based models have\nyielded portfolios with higher excess monthly returns but lower risk than their\narbitrage pricing theory counterparts in an analysis of equity returns of\nstocks listed on the JSE. Under the assumption of general no-arbitrage\nconditions, we argue that evidence in favour of characteristic based pricing\nimplies that information is more likely assimilated by means of nonlinear\npricing kernels for the markets considered.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2013 14:18:29 GMT"}, {"version": "v2", "created": "Wed, 16 Oct 2013 09:41:10 GMT"}], "update_date": "2016-02-18", "authors_parsed": [["Wilcox", "D. L.", ""], ["Gebbie", "T. J.", ""]]}, {"id": "1310.6819", "submitter": "Yiran Sheng", "authors": "Yiran Sheng", "title": "Valuing FtD Contract under Copula Approach via Monte-Carlo Stimulation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article aims to discuss some basics in field of credit modeling,\nspecifically the pricing issue of FtD contract. We demonstrate how the popular\ncopula approach is used in pricing FtD contract, and give a stimulation example\nof such practice based on SAS 9.1.\n", "versions": [{"version": "v1", "created": "Fri, 25 Oct 2013 04:58:20 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Sheng", "Yiran", ""]]}, {"id": "1310.7857", "submitter": "Mikko Pakkanen", "authors": "Christian Bender, Mikko S. Pakkanen, Hasanjan Sayit", "title": "Sticky continuous processes have consistent price systems", "comments": "10 pages, v3: incorporates minor corrections and the proof of the\n  main result has been clarified, to appear in Journal of Applied Probability", "journal-ref": "Journal of Applied Probability 2015, Vol. 52, No. 2, 586-594", "doi": "10.1239/jap/1437658617", "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Under proportional transaction costs, a price process is said to have a\nconsistent price system, if there is a semimartingale with an equivalent\nmartingale measure that evolves within the bid-ask spread. We show that a\ncontinuous, multi-asset price process has a consistent price system, under\narbitrarily small proportional transaction costs, if it satisfies a natural\nmulti-dimensional generalization of the stickiness condition introduced by\nGuasoni [Math. Finance 16(3), 569-582 (2006)].\n", "versions": [{"version": "v1", "created": "Tue, 29 Oct 2013 16:09:35 GMT"}, {"version": "v2", "created": "Sat, 9 Nov 2013 14:08:15 GMT"}, {"version": "v3", "created": "Wed, 6 Aug 2014 12:09:13 GMT"}], "update_date": "2015-09-16", "authors_parsed": [["Bender", "Christian", ""], ["Pakkanen", "Mikko S.", ""], ["Sayit", "Hasanjan", ""]]}, {"id": "1310.8296", "submitter": "Hyong-Chol O", "authors": "Hyong-chol O, Yong-hwa Ro and Ning Wan", "title": "The Use of Numeraires in Multi-dimensional Black-Scholes Partial\n  Differential Equations", "comments": "22 pages, This is English translation of the paper\n  \"KISU-MATH-2008-Cn-R-005\" with same title written in Chinese\n  (http://ssrn.com/abstract=731544) and version 2 revised references", "journal-ref": null, "doi": "10.2139/ssrn.2348594", "report-no": "KISU-MATH-2013-E-R-029", "categories": "q-fin.PR math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The change of numeraire gives very important computational simplification in\noption pricing. This technique reduces the number of sources of risks that need\nto be accounted for and so it is useful in pricing complicated derivatives that\nhave several sources of risks. In this article, we considered the underlying\nmathematical theory of numeraire technique in the viewpoint of PED theory and\nillustrated it with five concrete pricing problems. In the viewpoint of PED\ntheory, the numeraire technique is a method of reducing the dimension of status\nspaces where PDE is defined.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2013 16:09:59 GMT"}, {"version": "v2", "created": "Thu, 14 Nov 2013 14:13:27 GMT"}, {"version": "v3", "created": "Mon, 21 Jul 2014 02:58:26 GMT"}], "update_date": "2014-07-22", "authors_parsed": [["O", "Hyong-chol", ""], ["Ro", "Yong-hwa", ""], ["Wan", "Ning", ""]]}]