[{"id": "1509.01144", "submitter": "Nicola Cufaro Petroni", "authors": "Nicola Cufaro Petroni and Piergiacomo Sabino", "title": "Cointegrating Jumps: an Application to Energy Facilities", "comments": "25 pages, 4 figures; Revised Section 5 with new and better data", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on the concept of self-decomposable random variables we discuss the\napplication of a model for a pair of dependent Poisson processes to energy\nfacilities. Due to the resulting structure of the jump events we can see the\nself-decomposability as a form of cointegration among jumps. In the context of\nenergy facilities, the application of our approach to model power or gas\ndynamics and to evaluate transportation assets seen as spread options is\nstraightforward. We study the applicability of our methodology first assuming a\nMerton market model with two underlying assets; in a second step we consider\nprice dynamics driven by an exponential mean-reverting Geometric\nOrnstein-Uhlenbeck plus compound Poisson that are commonly used in the energy\nfield. In this specific case we propose a price spot dynamics for each\nunderlying that has the advantage of being treatable to find non-arbitrage\nconditions. In particular we can find close-form formulas for vanilla options\nso that the price and the Greeks of spread options can be calculated in close\nform using the Margrabe formula (if the strike is zero) or some other well\nknown approximation.\n", "versions": [{"version": "v1", "created": "Thu, 3 Sep 2015 16:05:48 GMT"}, {"version": "v2", "created": "Thu, 28 Jul 2016 09:10:22 GMT"}], "update_date": "2016-07-29", "authors_parsed": [["Petroni", "Nicola Cufaro", ""], ["Sabino", "Piergiacomo", ""]]}, {"id": "1509.01218", "submitter": "Suren Harutyunyan", "authors": "Suren Harutyunyan", "title": "Tax Bond Creation Using a Structural Model and its Extensions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article describes and explores taxes and debt in finance. Here a\nsituation is thought about, where tax payments would qualify to be considered\nas debt. Using this principle we can infer that it is possible to create and\nprice a type of bond (Tax Normalization Guarantee) for companies, which would\nallow them to enter in temporary tax breaks to allow them to free capital.\nFinally it is explored a way to structure these bonds in financial products and\nvaluate them.\n", "versions": [{"version": "v1", "created": "Thu, 14 May 2015 16:14:12 GMT"}], "update_date": "2015-09-04", "authors_parsed": [["Harutyunyan", "Suren", ""]]}, {"id": "1509.02686", "submitter": "Andrea Molent", "authors": "Ludovic Goudenege, Andrea Molent, Antonino Zanette", "title": "Pricing and Hedging GLWB in the Heston and in the Black-Scholes with\n  Stochastic Interest Rate Models", "comments": null, "journal-ref": "Insurance: Mathematics and Economics. Volume 70, September 2016,\n  Pages 38-57", "doi": "10.1016/j.insmatheco.2016.05.018", "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Valuing Guaranteed Lifelong Withdrawal Benefit (GLWB) has attracted\nsignificant attention from both the academic field and real world financial\nmarkets. As remarked by Forsyth and Vetzal the Black and Scholes framework\nseems to be inappropriate for such long maturity products. They propose to use\na regime switching model. Alternatively, we propose here to use a stochastic\nvolatility model (Heston model) and a Black Scholes model with stochastic\ninterest rate (Hull White model). For this purpose we present four numerical\nmethods for pricing GLWB variables annuities: a hybrid tree-finite difference\nmethod and a hybrid Monte Carlo method, an ADI finite difference scheme, and a\nstandard Monte Carlo method. These methods are used to determine the\nno-arbitrage fee for the most popular versions of the GLWB contract, and to\ncalculate the Greeks used in hedging. Both constant withdrawal and optimal\nwithdrawal (including lapsation) strategies are considered. Numerical results\nare presented which demonstrate the sensitivity of the no-arbitrage fee to\neconomic, contractual and longevity assumptions.\n", "versions": [{"version": "v1", "created": "Wed, 9 Sep 2015 09:13:33 GMT"}], "update_date": "2019-10-21", "authors_parsed": [["Goudenege", "Ludovic", ""], ["Molent", "Andrea", ""], ["Zanette", "Antonino", ""]]}]