[{"id": "1607.01110", "submitter": "Michaela Sz\\\"olgyenyi", "authors": "Andreas Eichler, Gunther Leobacher, Michaela Sz\\\"olgyenyi", "title": "Utility Indifference Pricing of Insurance Catastrophe Derivatives", "comments": null, "journal-ref": "European Actuarial Journal, 7:515-534, 2017", "doi": "10.1007/s13385-017-0154-2", "report-no": null, "categories": "q-fin.PR math.OC math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model for an insurance loss index and the claims process of a\nsingle insurance company holding a fraction of the total number of contracts\nthat captures both ordinary losses and losses due to catastrophes. In this\nmodel we price a catastrophe derivative by the method of utility indifference\npricing. The associated stochastic optimization problem is treated by\ntechniques for piecewise deterministic Markov processes. A numerical study\nillustrates our results.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2016 04:36:30 GMT"}, {"version": "v2", "created": "Mon, 8 May 2017 09:16:11 GMT"}], "update_date": "2018-05-17", "authors_parsed": [["Eichler", "Andreas", ""], ["Leobacher", "Gunther", ""], ["Szölgyenyi", "Michaela", ""]]}, {"id": "1607.01207", "submitter": "Nemat Safarov", "authors": "Nemat Safarov and Colin Atkinson", "title": "Natural gas-fired power plants valuation and optimisation under Levy\n  copulas and regime-switching", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we analyse a stochastic control problem for the valuation of a\nnatural gas power station while taking into account operating characteristics.\nBoth electricity and gas spot price processes exhibit mean-reverting spikes and\nMarkov regime-switches. The Levy regime-switching model incorporates the\neffects of demand-supply fluctuations in energy markets and abrupt economic\ndisruptions or business cycles. We make use of skewed Levy copulas to model the\ndependence risk of electricity and gas jumps.\n  The corresponding HJB equation is the non-linear PIDE which is solved by an\nexplicit finite difference method. The numerical approach gives us both the\nvalue of the plant and its optimal operating strategy depending on the gas and\nelectricity prices, current temperature of the boiler and time. The surfaces of\ncontrol strategies and contract values are obtained by implementing the\nnumerical method for a particular example.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jul 2016 11:58:24 GMT"}, {"version": "v2", "created": "Sat, 30 Jul 2016 00:49:17 GMT"}], "update_date": "2016-08-02", "authors_parsed": [["Safarov", "Nemat", ""], ["Atkinson", "Colin", ""]]}, {"id": "1607.01519", "submitter": "Fabio Gobbi", "authors": "Umberto Cherubini, Fabio Gobbi, Sabrina Mulinacci and Silvia Romagnoli", "title": "Granger Independent Martingale Processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new class of processes for the evaluation of multivariate\nequity derivatives. The proposed setting is well suited for the application of\nthe standard copula function theory to processes, rather than variables, and\neasily enables to enforce the martingale pricing requirement. The martingale\ncondition is imposed in a general multidimensional Markov setting to which we\nonly add the restriction of no-Granger-causality of the increments\n(Granger-independent increments). We call this class of processes GIMP (Granger\nIndependent Martingale Processes). The approach can also be extended to the\napplication of time change, under which the martingale restriction continues to\nhold. Moreover, we show that the class of GIMP processes is closed under time\nchanging: if a Granger independent process is used as a multivariate stochastic\nclock for the change of time of a GIMP process, the new process is also GIMP.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2016 08:26:08 GMT"}], "update_date": "2016-07-07", "authors_parsed": [["Cherubini", "Umberto", ""], ["Gobbi", "Fabio", ""], ["Mulinacci", "Sabrina", ""], ["Romagnoli", "Silvia", ""]]}, {"id": "1607.01619", "submitter": "Viatcheslav Belyaev", "authors": "V.M. Belyaev", "title": "Swaption Prices in HJM model. Nonparametric fit", "comments": "8 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Closed form formulas for swaption prices in HJM model are derived. These\nformulas are used for nonparametric fit of deterministic forward volatility. It\nis demonstrated that this formula and non-parametric fit works very well and\ncan be used to identify arbitrage opportunities\n", "versions": [{"version": "v1", "created": "Wed, 6 Jul 2016 13:52:38 GMT"}, {"version": "v2", "created": "Mon, 1 Aug 2016 17:15:51 GMT"}, {"version": "v3", "created": "Mon, 10 Apr 2017 14:02:19 GMT"}], "update_date": "2017-04-11", "authors_parsed": [["Belyaev", "V. M.", ""]]}, {"id": "1607.02067", "submitter": "Yerkin Kitapbayev", "authors": "Damir Filipovic and Yerkin Kitapbayev", "title": "On the American swaption in the linear-rational framework", "comments": "forthcoming in Quantitative Finance, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study American swaptions in the linear-rational (LR) term structure model\nintroduced in [5]. The American swaption pricing problem boils down to an\noptimal stopping problem that is analytically tractable. It reduces to a\nfree-boundary problem that we tackle by the local time-space calculus of [7].\nWe characterize the optimal stopping boundary as the unique solution to a\nnonlinear integral equation that can be readily solved numerically. We obtain\nthe arbitrage-free price of the American swaption and the optimal exercise\nstrategies in terms of swap rates for both fixed-rate payer and receiver swaps.\nFinally, we show that Bermudan swaptions can be efficiently priced as well.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jul 2016 16:12:05 GMT"}, {"version": "v2", "created": "Wed, 3 May 2017 18:44:58 GMT"}, {"version": "v3", "created": "Sat, 24 Feb 2018 16:14:29 GMT"}], "update_date": "2018-02-27", "authors_parsed": [["Filipovic", "Damir", ""], ["Kitapbayev", "Yerkin", ""]]}, {"id": "1607.02743", "submitter": "Idris Kharroubi", "authors": "Ying Jiao (SAF), Idris Kharroubi (CREST, CEREMADE)", "title": "Information uncertainty related to marked random times and optimal\n  investment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study an optimal investment problem under default risk where related\ninformation such as loss or recovery at default is considered as an exogenous\nrandom mark added at default time. Two types of agents who have different\nlevels of information are considered. We first make precise the insider's\ninformation flow by using the theory of enlargement of filtrations and then\nobtain explicit logarithmic utility maximization results to compare optimal\nwealth for the insider and the ordinary agent. MSC: 60G20, 91G40, 93E20\n", "versions": [{"version": "v1", "created": "Sun, 10 Jul 2016 13:00:55 GMT"}, {"version": "v2", "created": "Wed, 1 Mar 2017 13:18:56 GMT"}], "update_date": "2017-03-02", "authors_parsed": [["Jiao", "Ying", "", "SAF"], ["Kharroubi", "Idris", "", "CREST, CEREMADE"]]}, {"id": "1607.03205", "submitter": "Taisei Kaizoji", "authors": "Taisei Kaizoji and Michiko Miyano", "title": "Stock Market Market Crash of 2008: an empirical study of the deviation\n  of share prices from company fundamentals", "comments": "11 pages, 7 figures", "journal-ref": null, "doi": "10.1080/13504851.2018.1486004", "report-no": null, "categories": "q-fin.GN q-fin.PR q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aim of this study is to investigate quantitatively whether share prices\ndeviated from company fundamentals in the stock market crash of 2008. For this\npurpose, we use a large database containing the balance sheets and share prices\nof 7,796 worldwide companies for the period 2004 through 2013. We develop a\npanel regression model using three financial indicators--dividends per share,\ncash flow per share, and book value per share--as explanatory variables for\nshare price. We then estimate individual company fundamentals for each year by\nremoving the time fixed effects from the two-way fixed effects model, which we\nidentified as the best of the panel regression models. One merit of our model\nis that we are able to extract unobservable factors of company fundamentals by\nusing the individual fixed effects.\n  Based on these results, we analyze the market anomaly quantitatively using\nthe divergence rate--the rate of the deviation of share price from a company's\nfundamentals. We find that share prices on average were overvalued in the\nperiod from 2005 to 2007, and were undervalued significantly in 2008, when the\nglobal financial crisis occurred. Share prices were equivalent to the\nfundamentals on average in the subsequent period. Our empirical results clearly\ndemonstrate that the worldwide stock market fluctuated excessively in the time\nperiod before and just after the global financial crisis of 2008.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jul 2016 00:18:15 GMT"}], "update_date": "2018-08-07", "authors_parsed": [["Kaizoji", "Taisei", ""], ["Miyano", "Michiko", ""]]}, {"id": "1607.03522", "submitter": "Antonis Papapantoleon", "authors": "Antonis Papapantoleon, Robert Wardenga", "title": "Continuous tenor extension of affine LIBOR models with multiple curves\n  and applications to XVA", "comments": "25 pages, 6 figures, revised version", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the class of affine LIBOR models with multiple curves, which is\nan analytically tractable class of discrete tenor models that easily\naccommodates positive or negative interest rates and positive spreads. By\nintroducing an interpolating function, we extend the affine LIBOR models to a\ncontinuous tenor and derive expressions for the instantaneous forward rate and\nthe short rate. We show that the continuous tenor model is arbitrage-free, that\nthe analytical tractability is retained under the spot martingale measure, and\nthat under mild conditions an interpolating function can be found such that the\nextended model fits any initial forward curve. This allows us to compute value\nadjustments (i.e. XVAs) consistently, by solving the corresponding\n`pre-default' BSDE. As an application, we compute the price and value\nadjustments for a basis swap, and study the model risk associated to different\ninterpolating functions.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jul 2016 21:30:22 GMT"}, {"version": "v2", "created": "Thu, 9 Feb 2017 08:50:50 GMT"}], "update_date": "2017-02-10", "authors_parsed": [["Papapantoleon", "Antonis", ""], ["Wardenga", "Robert", ""]]}, {"id": "1607.07108", "submitter": "Raj Bahl", "authors": "Raj Kumari Bahl and Sotirios Sabanis", "title": "Model-Independent Price Bounds for Catastrophic Mortality Bonds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we are concerned with the valuation of Catastrophic Mortality\nBonds and, in particular, we examine the case of the Swiss Re Mortality Bond\n2003 as a primary example of this class of assets. This bond was the first\nCatastrophic Mortality Bond to be launched in the market and encapsulates the\nbehaviour of a well-defined mortality index to generate payoffs for\nbondholders. Pricing these type of bonds is a challenging task and no closed\nform solution exists in the literature. In our approach, we express the payoff\nof such a bond in terms of the payoff of an Asian put option and present a new\napproach to derive model-independent bounds exploiting comonotonic theory as\nillustrated in \\cite{prime1}, \\cite{2} and \\cite{Simon} for the pricing of\nAsian options. We carry out Monte Carlo simulations to estimate the bond price\nand illustrate the quality of the bounds.\n", "versions": [{"version": "v1", "created": "Sun, 24 Jul 2016 22:53:55 GMT"}, {"version": "v2", "created": "Tue, 8 Dec 2020 14:56:52 GMT"}], "update_date": "2020-12-09", "authors_parsed": [["Bahl", "Raj Kumari", ""], ["Sabanis", "Sotirios", ""]]}]