[{"id": "1709.00468", "submitter": "Flavia Sancier", "authors": "Flavia Sancier and Salah Mohammed", "title": "An Option Pricing Model with Memory", "comments": null, "journal-ref": null, "doi": "10.1002/ijop.12622", "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We obtain option pricing formulas for stock price models in which the drift\nand volatility terms are functionals of a continuous history of the stock\nprices. That is, the stock dynamics follows a nonlinear stochastic functional\ndifferential equation. A model with full memory is obtained via approximation\nthrough a stock price model in which the continuous path dependence does not go\nup to the present: there is a memory gap. A strong solution is obtained by\nclosing the gap. Fair option prices are obtained through an equivalent (local)\nmartingale measure via Girsanov's Theorem and therefore are given in terms of a\nconditional expectation. The models maintain the completeness of the market and\nhave no arbitrage opportunities.\n", "versions": [{"version": "v1", "created": "Fri, 1 Sep 2017 20:21:55 GMT"}], "update_date": "2020-11-17", "authors_parsed": [["Sancier", "Flavia", ""], ["Mohammed", "Salah", ""]]}, {"id": "1709.06517", "submitter": "Hyong-Chol O", "authors": "Hyong-Chol O., Jong-Chol Kim and Il-Gwang Jon", "title": "Numerical analysis for a unified 2 factor model of structural and\n  reduced form types for corporate bonds with fixed discrete coupon", "comments": "15 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.NA q-fin.CP", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Conditions of Stability for explicit finite difference scheme and some\nresults of numerical analysis for a unified 2 factor model of structural and\nreduced form types for corporate bonds with fixed discrete coupon are provided.\nIt seems to be difficult to get solution formula for PDE model which\ngeneralizes Agliardi's structural model [1] for discrete coupon bonds into a\nunified 2 factor model of structural and reduced form types and we study a\nnumerical analysis for it by explicit finite difference scheme. These equations\nare parabolic equations with 3 variables and they include mixed derivatives, so\nthe explicit finite difference scheme is not stable in general. We find\nconditions for the explicit finite difference scheme to be stable, in the case\nthat it is stable, numerically compute the price of the bond and analyze its\ncredit spread and duration.\n", "versions": [{"version": "v1", "created": "Fri, 11 Aug 2017 08:26:36 GMT"}, {"version": "v2", "created": "Mon, 27 Aug 2018 02:49:11 GMT"}], "update_date": "2018-08-28", "authors_parsed": [["O.", "Hyong-Chol", ""], ["Kim", "Jong-Chol", ""], ["Jon", "Il-Gwang", ""]]}, {"id": "1709.08188", "submitter": "Johannes Rauch", "authors": "Carol Alexander and Johannes Rauch", "title": "The Aggregation Property and its Applications to Realised Higher Moments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a general multivariate aggregation property which encompasses the\ndistinct versions of the property that were introduced by Neuberger [2012] and\nBondarenko [2014] independently. This way, we classify new types of model-free\nrealised characteristics for which risk premia may be estimated without bias.\nWe focus on the aggregation property for multivariate martingales and log\nmartingales, and then define realised third and fourth moments which allow\nlong-term higher-moment risk premia to be measured, efficiently and without\nbias, using high-frequency returns.\n", "versions": [{"version": "v1", "created": "Sun, 24 Sep 2017 11:54:54 GMT"}], "update_date": "2017-09-26", "authors_parsed": [["Alexander", "Carol", ""], ["Rauch", "Johannes", ""]]}]