[{"id": "1907.04230", "submitter": "Christian Furrer", "authors": "Kristian Buchardt and Christian Furrer and Thomas M{\\o}ller", "title": "Tax- and expense-modified risk-minimization for insurance payment\n  processes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of determining risk-minimizing investment strategies for\ninsurance payment processes in the presence of taxes and expenses. We consider\nthe situation where taxes and expenses are paid continuously and symmetrically\nand introduce the concept of tax- and expense-modified risk-minimization.\nRisk-minimizing strategies in the presence of taxes and expenses are derived\nand linked to Galtchouk-Kunita-Watanabe decompositions associated with modified\nversions of the original payment processes. Furthermore, we show equivalence to\nan alternative approach involving an artificial market consisting of after-tax\nand after-expense assets, and we establish a type of consistency with classic\nrisk-minimization. Finally, a case study involving classic multi-state life\ninsurance payments in combination with a bond market exemplifies the results.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jul 2019 15:11:04 GMT"}, {"version": "v2", "created": "Sat, 7 Mar 2020 10:10:50 GMT"}], "update_date": "2020-03-10", "authors_parsed": [["Buchardt", "Kristian", ""], ["Furrer", "Christian", ""], ["Møller", "Thomas", ""]]}, {"id": "1907.05157", "submitter": "Stefan Tappe", "authors": "Stefan Tappe and Stefan Weber", "title": "Stochastic mortality models: An infinite dimensional approach", "comments": "28 pages", "journal-ref": "Finance and Stochastics 18(1):209-248, 2014", "doi": null, "report-no": null, "categories": "math.PR q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Demographic projections of future mortality rates involve a high level of\nuncertainty and require stochastic mortality models. The current paper\ninvestigates forward mortality models driven by a (possibly infinite\ndimensional) Wiener process and a compensated Poisson random measure. A major\ninnovation of the paper is the introduction of a family of processes called\nforward mortality improvements which provide a flexible tool for a simple\nconstruction of stochastic forward mortality models. In practice, the notion of\nmortality improvements are a convenient device for the quantification of\nchanges in mortality rates over time that enables, for example, the detection\nof cohort effects.\n  We show that the forward mortality rates satisfy Heath-Jarrow-Morton-type\nconsistency conditions which translate to the forward mortality improvements.\nWhile the consistency conditions of the forward mortality rates are analogous\nto the classical conditions in the context of bond markets, the conditions of\nthe forward mortality improvements possess a different structure: forward\nmortality models include a cohort parameter besides the time horizon; these two\ndimensions are coupled in the dynamics of consistent models of forwards\nmortality improvements. In order to obtain a unified framework, we transform\nthe systems of It\\^o-processes which describe the forward mortality rates and\nimprovements: in contrast to term-structure models, the corresponding\nstochastic partial differential equations (SPDEs) describe the random dynamics\nof two-dimensional surfaces rather than curves.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jul 2019 12:45:07 GMT"}], "update_date": "2019-07-12", "authors_parsed": [["Tappe", "Stefan", ""], ["Weber", "Stefan", ""]]}, {"id": "1907.07305", "submitter": "Andrey Itkin", "authors": "Peter Carr, Andrey Itkin and Sasha Stoikov", "title": "A model-free backward and forward nonlinear PDEs for implied volatility", "comments": "31 pages, 9 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive a backward and forward nonlinear PDEs that govern the implied\nvolatility of a contingent claim whenever the latter is well-defined. This\nwould include at least any contingent claim written on a positive stock price\nwhose payoff at a possibly random time is convex. We also discuss suitable\ninitial and boundary conditions for those PDEs. Finally, we demonstrate how to\nsolve them numerically by using an iterative finite-difference approach.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jul 2019 02:13:46 GMT"}], "update_date": "2019-07-18", "authors_parsed": [["Carr", "Peter", ""], ["Itkin", "Andrey", ""], ["Stoikov", "Sasha", ""]]}, {"id": "1907.10578", "submitter": "Jian Liang", "authors": "Jian Liang and Zhe Xu and Peter Li", "title": "Deep Learning-Based Least Square Forward-Backward Stochastic\n  Differential Equation Solver for High-Dimensional Derivative Pricing", "comments": "22 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new forward-backward stochastic differential equation solver for\nhigh-dimensional derivatives pricing problems by combining deep learning solver\nwith least square regression technique widely used in the least square Monte\nCarlo method for the valuation of American options. Our numerical experiments\ndemonstrate the efficiency and accuracy of our least square backward deep\nneural network solver and its capability to provide accurate prices for complex\nearly exercise derivatives such as callable yield notes. Our method can serve\nas a generic numerical solver for pricing derivatives across various asset\ngroups, in particular, as an efficient means for pricing high-dimensional\nderivatives with early exercises features.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jul 2019 17:28:50 GMT"}, {"version": "v2", "created": "Mon, 12 Oct 2020 20:39:38 GMT"}], "update_date": "2020-10-14", "authors_parsed": [["Liang", "Jian", ""], ["Xu", "Zhe", ""], ["Li", "Peter", ""]]}, {"id": "1907.12806", "submitter": "Claudio Nordio", "authors": "Ilaria Nava, Davide Cuccio, Lorenzo Giada and Claudio Nordio", "title": "A Simple Factoring Pricing Model", "comments": "11 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a simplified setting, we show how to price invoice non-recourse factoring\ntaking into account not only the credit worthiness of the debtor but also the\nassignor's one, together with the default correlation between the two. Indeed,\nthe possible default of the assignor might impact the payoff by means of the\nbankruptcy revocatory, especially in case of undisclosed factoring.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jul 2019 09:39:48 GMT"}], "update_date": "2019-07-31", "authors_parsed": [["Nava", "Ilaria", ""], ["Cuccio", "Davide", ""], ["Giada", "Lorenzo", ""], ["Nordio", "Claudio", ""]]}, {"id": "1907.12922", "submitter": "Alessandro Ramponi", "authors": "Elisa Alos, Fabio Antonelli, Alessandro Ramponi, Sergio Scarlatti", "title": "CVA and vulnerable options in stochastic volatility models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we want to provide a general principle to evaluate the CVA\n(Credit Value Adjustment) for a vulnerable option, that is an option subject to\nsome default event, concerning the solvability of the issuer. CVA is needed to\nevaluate correctly the contract and it is particularly important in presence of\nWWR (Wrong Way Risk), when a credit deterioration determines an increase of the\nclaim's price. In particular, we are interested in evaluating the CVA in\nstochastic volatility models for the underlying's price (which often fit quite\nwell the market's prices) when admitting correlation with the default event. By\ncunningly using Ito's calculus, we provide a general representation formula\napplicable to some popular models such as SABR, Hull \\& White and Heston, which\nexplicitly shows the correction in CVA due to the processes correlation. Later,\nwe specialize this formula and construct its approximation for the three\nselected models. Lastly, we run a numerical study to test the formula's\naccuracy, comparing our results with Monte Carlo simulations.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jul 2019 13:45:18 GMT"}], "update_date": "2019-07-31", "authors_parsed": [["Alos", "Elisa", ""], ["Antonelli", "Fabio", ""], ["Ramponi", "Alessandro", ""], ["Scarlatti", "Sergio", ""]]}]