[{"id": "2005.02633", "submitter": "Alessandro Gnoatto", "authors": "Alessandro Gnoatto, Athena Picarelli, Christoph Reisinger", "title": "Deep xVA solver -- A neural network based counterparty credit risk\n  management framework", "comments": "25 pages. Error bounds added", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.CP q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a novel computational framework for portfolio-wide\nrisk management problems, where the presence of a potentially large number of\nrisk factors makes traditional numerical techniques ineffective. The new method\nutilises a coupled system of BSDEs for the valuation adjustments (xVA) and\nsolves these by a recursive application of a neural network based BSDE solver.\nThis not only makes the computation of xVA for high-dimensional problems\nfeasible, but also produces hedge ratios and dynamic risk measures for xVA, and\nallows simulations of the collateral account.\n", "versions": [{"version": "v1", "created": "Wed, 6 May 2020 07:36:31 GMT"}, {"version": "v2", "created": "Tue, 25 Aug 2020 05:40:25 GMT"}], "update_date": "2020-08-26", "authors_parsed": [["Gnoatto", "Alessandro", ""], ["Picarelli", "Athena", ""], ["Reisinger", "Christoph", ""]]}, {"id": "2005.03554", "submitter": "Yerkin Kitapbayev", "authors": "Yerkin Kitapbayev, Scott Robertson", "title": "Mortgage Contracts and Underwater Default", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze recently proposed mortgage contracts that aim to eliminate\nselective borrower default when the loan balance exceeds the house price (the\n``underwater'' effect). We show contracts that automatically reduce the\noutstanding balance in the event of house price decline remove the default\nincentive, but may induce prepayment in low price states. However, low state\nprepayments vanish if the benefit from home ownership is sufficiently high. We\nalso show that capital gain sharing features, such as prepayment penalties in\nhigh house price states, are ineffective as they virtually eliminate\nprepayment. For observed foreclosure costs, we find that contracts with\nautomatic balance adjustments become preferable to the traditional fixed-rate\ncontracts at mortgage rate spreads between 50-100 basis points. We obtain these\nresults for perpetual versions of the contracts using American options pricing\nmethodology, in a continuous-time model with diffusive home prices. The\ncontracts' values and optimal decision rules are associated with free boundary\nproblems, which admit semi-explicit solutions.\n", "versions": [{"version": "v1", "created": "Thu, 7 May 2020 15:40:57 GMT"}, {"version": "v2", "created": "Thu, 14 Jan 2021 20:43:01 GMT"}, {"version": "v3", "created": "Sun, 30 May 2021 16:56:14 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Kitapbayev", "Yerkin", ""], ["Robertson", "Scott", ""]]}, {"id": "2005.04297", "submitter": "Yuri F. Saporito", "authors": "Yuri F. Saporito", "title": "Pricing Path-Dependent Derivatives under Multiscale Stochastic\n  Volatility Models: a Malliavin Representation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we derive a efficient Monte Carlo approximation for the price\nof path-dependent derivatives under the multiscale stochastic volatility models\nof Fouque \\textit{et al}. Using the formulation of this pricing problem under\nthe functional It\\^o calculus framework and making use of Greek formulas from\nMalliavin calculus, we derive a representation for the first-order\napproximation of the price of path-dependent derivatives in the form\n$\\mathbb{E}[\\mbox{payoff} \\times \\mbox{weight}]$. The weight is known in closed\nform and depends only on the group market parameters arising from the\ncalibration of the multiscale stochastic volatility to the market's implied\nvolatility. Moreover, only simulations of the Black-Scholes model is required.\nWe exemplify the method for a couple path-dependent derivatives.\n", "versions": [{"version": "v1", "created": "Fri, 8 May 2020 21:51:07 GMT"}], "update_date": "2020-05-12", "authors_parsed": [["Saporito", "Yuri F.", ""]]}, {"id": "2005.05310", "submitter": "Abootaleb Shirvani", "authors": "Jiexin Dai, Abootaleb Shirvani, and Frank J. Fabozzi", "title": "Rational Finance Approach to Behavioral Option Pricing", "comments": "arXiv admin note: text overlap with arXiv:1710.03205", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When pricing options, there may be different views on the instantaneous mean\nreturn of the underlying price process. According to Black (1972), where there\nexist heterogeneous views on the instantaneous mean return, this will result in\narbitrage opportunities. Behavioral finance proponents argue that such\nheterogenous views are likely to occur and this will not impact option pricing\nmodels proposed by rational dynamic asset pricing theory and will not give rise\nto volatility smiles. To rectify this, a leading advocate of behavioral finance\nhas proposed a behavioral option pricing model. As there may be unexplored\nlinks between the behavioral and rational approaches to option pricing, in this\npaper we revisit Shefrin (2008) option pricing model as an example and suggest\none approach to modify this behavioral finance option pricing formula to be\nconsistent with rational dynamic asset pricing theory by introducing arbitrage\ntransaction costs which offset the gains from arbitrage trades.\n", "versions": [{"version": "v1", "created": "Sun, 10 May 2020 07:44:19 GMT"}], "update_date": "2020-05-13", "authors_parsed": [["Dai", "Jiexin", ""], ["Shirvani", "Abootaleb", ""], ["Fabozzi", "Frank J.", ""]]}, {"id": "2005.05459", "submitter": "Andrey Itkin", "authors": "Peter Carr, Andrey Itkin and Dmitry Muravey", "title": "Semi-closed form prices of barrier options in the time-dependent CEV and\n  CIR models", "comments": "32 pages, 4 figures, 4 tabkes", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We continue a series of papers where prices of the barrier options written on\nthe underlying, which dynamics follows some one factor stochastic model with\ntime-dependent coefficients and the barrier, are obtained in semi-closed form,\nsee (Carr and Itkin, 2020, Itkin and Muravey, 2020). This paper extends this\nmethodology to the CIR model for zero-coupon bonds, and to the CEV model for\nstocks which are used as the corresponding underlying for the barrier options.\nWe describe two approaches. One is generalization of the method of heat\npotentials for the heat equation to the Bessel process, so we call it the\nmethod of Bessel potentials. We also propose a general scheme how to construct\nthe potential method for any linear differential operator with time-independent\ncoefficients. The second one is the method of generalized integral transform,\nwhich is also extended to the Bessel process. In all cases, a semi-closed\nsolution means that first, we need to solve numerically a linear Volterra\nequation of the second kind, and then the option price is represented as a\none-dimensional integral. We demonstrate that computationally our method is\nmore efficient than both the backward and forward finite difference methods\nwhile providing better accuracy and stability. Also, it is shown that both\nmethod don't duplicate but rather compliment each other, as one provides very\naccurate results at small maturities, and the other one - at high maturities.\n", "versions": [{"version": "v1", "created": "Mon, 11 May 2020 21:56:55 GMT"}], "update_date": "2020-05-13", "authors_parsed": [["Carr", "Peter", ""], ["Itkin", "Andrey", ""], ["Muravey", "Dmitry", ""]]}, {"id": "2005.06015", "submitter": "Bin Zou", "authors": "Jun Deng and Bin Zou", "title": "Quadratic Hedging for Sequential Claims with Random Weights in Discrete\n  Time", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PM q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a quadratic hedging problem for a sequence of contingent claims with\nrandom weights in discrete time. We obtain the optimal hedging strategy\nexplicitly in a recursive representation, without imposing the non-degeneracy\n(ND) condition on the model and square integrability on hedging strategies. We\nrelate the general results to hedging under random horizon and fair pricing in\nthe quadratic sense. We illustrate the significance of our results in an\nexample in which the ND condition fails.\n", "versions": [{"version": "v1", "created": "Tue, 12 May 2020 19:12:13 GMT"}, {"version": "v2", "created": "Fri, 4 Dec 2020 15:59:12 GMT"}], "update_date": "2020-12-07", "authors_parsed": [["Deng", "Jun", ""], ["Zou", "Bin", ""]]}, {"id": "2005.10966", "submitter": "Bernhard Hientzsch", "authors": "Narayan Ganesan, Yajie Yu, Bernhard Hientzsch", "title": "Pricing Barrier Options with DeepBSDEs", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a novel and direct approach to price boundary and\nfinal-value problems, corresponding to barrier options, using forward deep\nlearning to solve forward-backward stochastic differential equations (FBSDEs).\nBarrier instruments are instruments that expire or transform into another\ninstrument if a barrier condition is satisfied before maturity; otherwise they\nperform like the instrument without the barrier condition. In the PDE\nformulation, this corresponds to adding boundary conditions to the final value\nproblem. The deep BSDE methods developed so far have not addressed\nbarrier/boundary conditions directly. We extend the forward deep BSDE to the\nbarrier condition case by adding nodes to the computational graph to explicitly\nmonitor the barrier conditions for each realization of the dynamics as well as\nnodes that preserve the time, state variables, and trading strategy value at\nbarrier breach or at maturity otherwise. Given these additional nodes in the\ncomputational graph, the forward loss function quantifies the replication of\nthe barrier or final payoff according to a chosen risk measure such as squared\nsum of differences. The proposed method can handle any barrier condition in the\nFBSDE set-up and any Dirichlet boundary conditions in the PDE set-up, both in\nlow and high dimensions.\n", "versions": [{"version": "v1", "created": "Fri, 22 May 2020 02:00:00 GMT"}], "update_date": "2020-05-25", "authors_parsed": [["Ganesan", "Narayan", ""], ["Yu", "Yajie", ""], ["Hientzsch", "Bernhard", ""]]}, {"id": "2005.13252", "submitter": "Fabien Le Floc'h", "authors": "Fabien Le Floc'h", "title": "Notes on the SWIFT method based on Shannon Wavelets for Option Pricing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This note shows that the cosine expansion based on the Vieta formula is\nequivalent to a discretization of the Parseval identity. We then evaluate the\nuse of simple direct algorithms to compute the Shannon coefficients for the\npayoff. Finally, we explore the efficiency of a Filon quadrature instead of the\nVieta formula for the coefficients related to the probability density function.\n", "versions": [{"version": "v1", "created": "Wed, 27 May 2020 09:35:07 GMT"}], "update_date": "2020-05-28", "authors_parsed": [["Floc'h", "Fabien Le", ""]]}, {"id": "2005.13890", "submitter": "Jherek Healy", "authors": "Jherek Healy", "title": "Equivalence between forward rate interpolations and discount factor\n  interpolations for the yield curve construction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The traditional way of building a yield curve is to choose an interpolation\non discount factors, implied by the market tradable instruments. Since then,\nconstructions based on specific interpolations of the forward rates have become\nthe trend. We show here that some popular interpolation methods on the forward\nrates correspond exactly to classical interpolation methods on discount\nfactors. This paper also aims at clarifying the differences between\ninterpolations in terms of discount factors, instantaneous forward rates,\ndiscrete forward rates, and constant period forward rates.\n", "versions": [{"version": "v1", "created": "Thu, 28 May 2020 10:29:53 GMT"}], "update_date": "2020-05-29", "authors_parsed": [["Healy", "Jherek", ""]]}, {"id": "2005.14350", "submitter": "Pablo Olivares", "authors": "Pablo Olivares", "title": "Pricing Temperature Derivatives under a Time-Changed Levy Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective of the paper is to price weather contracts using temperature as\nthe underlying process when the later follows a mean-reverting dynamics driven\nby a time-changed Brownian motion coupled to a Gamma Levy subordinator and\ntime-dependent deterministic volatility. This type of model captures the\ncomplexity of the temperature dynamic providing a more accurate valuation of\ntheir associate weather contracts. An approximated price is obtained by a\nFourier expansion of its characteristic function combined with a selection of\nthe equivalent martingale measure following the Esscher transform proposed in\nGerber and Shiu (1994).\n", "versions": [{"version": "v1", "created": "Fri, 29 May 2020 00:23:45 GMT"}], "update_date": "2020-06-01", "authors_parsed": [["Olivares", "Pablo", ""]]}, {"id": "2005.14361", "submitter": "Pablo Olivares", "authors": "Konrad Gajewski and Sebastian Ferrando and Pablo Olivares", "title": "Pricing Energy Contracts under Regime Switching Time-Changed models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The shortcomings of the popular Black-Scholes-Merton (BSM) model have led to\nmodels which could more accurately model the behavior of the underlying assets\nin energy markets, particularly in electricity and future oil prices. In this\npaper we consider a class of regime switching time-changed Levy processes,\nwhich builds upon the BSM model by incorporating jumps through a random clock,\nas well as randomly varying parameters according to a two-state continuous-time\nMarkov chain. We implement pricing methods based on expansions of the\ncharacteristic function as in \\cite{Fourier}. Finally, we estimate the\nparameters of the model by incorporating historic energy data and option quotes\nusing a variety of methods.\n", "versions": [{"version": "v1", "created": "Fri, 29 May 2020 01:18:26 GMT"}], "update_date": "2020-06-01", "authors_parsed": [["Gajewski", "Konrad", ""], ["Ferrando", "Sebastian", ""], ["Olivares", "Pablo", ""]]}]