[{"id": "2007.00705", "submitter": "Grzegorz Krzy\\.zanowski", "authors": "Grzegorz Krzy\\.zanowski, Andr\\'es Sosa", "title": "Performance analysis of Zero Black-Derman-Toy interest rate model in\n  catastrophic events: COVID-19 case study", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we continue the research of our recent interest rate tree model\ncalled Zero Black-Derman-Toy (ZBDT) model, which includes the possibility of a\njump at each step to a practically zero interest rate. This approach allows to\nbetter match to risk of financial slowdown caused by catastrophic events. We\npresent how to valuate a wide range of financial derivatives for such a model.\nThe classical Black-Derman-Toy (BDT) model and novel ZBDT model are described\nand analogies in their calibration methodology are established. Finally two\ncases of applications of the novel ZBDT model are introduced. The first of them\nis the hypothetical case of an S-shape term structure and decreasing volatility\nof yields. The second case is an application of the ZBDT model in the structure\nof United States sovereign bonds in the current $2020$ economic slowdown caused\nby the Coronavirus pandemic. The objective of this study is to understand the\ndifferences presented by the valuation in both models for different\nderivatives.\n", "versions": [{"version": "v1", "created": "Wed, 1 Jul 2020 19:13:13 GMT"}, {"version": "v2", "created": "Tue, 14 Jul 2020 11:47:38 GMT"}], "update_date": "2020-07-15", "authors_parsed": [["Krzyżanowski", "Grzegorz", ""], ["Sosa", "Andrés", ""]]}, {"id": "2007.01467", "submitter": "Koichi Miyamoto", "authors": "Kazuya Kaneko, Koichi Miyamoto, Naoyuki Takeda, Kazuyoshi Yoshino", "title": "Quantum Pricing with a Smile: Implementation of Local Volatility Model\n  on Quantum Computer", "comments": "29 pages, 13 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Applications of the quantum algorithm for Monte Carlo simulation to pricing\nof financial derivatives have been discussed in previous papers. However, up to\nnow, the pricing model discussed in such papers is Black-Scholes model, which\nis important but simple. Therefore, it is motivating to consider how to\nimplement more complex models used in practice in financial institutions. In\nthis paper, we then consider the local volatility (LV) model, in which the\nvolatility of the underlying asset price depends on the price and time. We\npresent two types of implementation. One is the register-per-RN way, which is\nadopted in most of previous papers. In this way, each of random numbers (RNs)\nrequired to generate a path of the asset price is generated on a separated\nregister, so the required qubit number increases in proportion to the number of\nRNs. The other is the PRN-on-a-register way, which is proposed in the author's\nprevious work. In this way, a sequence of pseudo-random numbers (PRNs)\ngenerated on a register is used to generate paths of the asset price, so the\nrequired qubit number is reduced with a trade-off against circuit depth. We\npresent circuit diagrams for these two implementations in detail and estimate\nrequired resources: qubit number and T-count.\n", "versions": [{"version": "v1", "created": "Fri, 3 Jul 2020 02:54:25 GMT"}], "update_date": "2020-07-06", "authors_parsed": [["Kaneko", "Kazuya", ""], ["Miyamoto", "Koichi", ""], ["Takeda", "Naoyuki", ""], ["Yoshino", "Kazuyoshi", ""]]}, {"id": "2007.01511", "submitter": "Hyong-Chol O", "authors": "Hyong Chol O, Tae Song Kim", "title": "Analysis on the Pricing model for a Discrete Coupon Bond with Early\n  redemption provision by the Structural Approach", "comments": "30 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, using the structural approach is derived a mathematical model\nof the discrete coupon bond with the provision that allow the holder to demand\nearly redemption at any coupon dates prior to the maturity and based on this\nmodel is provided some analysis including min-max and gradient estimates of the\nbond price. Using these estimates the existence and uniqueness of the default\nboundaries and some relationships between the design parameters of the discrete\ncoupon bond with early redemption provision are described. Then under some\nassumptions the existence and uniqueness of the early redemption boundaries is\nproved and the analytic formula of the bond price is provided using higher\nbinary options. Finally for our bond is provided the analysis on the duration\nand credit spread, which are used widely in financial reality. Our works\nprovide a design guide of the discrete coupon bond with the early redemption\nprovision\n", "versions": [{"version": "v1", "created": "Fri, 3 Jul 2020 06:33:28 GMT"}], "update_date": "2020-07-06", "authors_parsed": [["O", "Hyong Chol", ""], ["Kim", "Tae Song", ""]]}, {"id": "2007.03585", "submitter": "Stefano De Marco", "authors": "Stefano De Marco", "title": "On the harmonic mean representation of the implied volatility", "comments": "20 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well know that, in the short maturity limit, the implied volatility\napproaches the integral harmonic mean of the local volatility with respect to\nlog-strike, see [Berestycki et al., Asymptotics and calibration of local\nvolatility models, Quantitative Finance, 2, 2002]. This paper is dedicated to a\ncomplementary model-free result: an arbitrage-free implied volatility in fact\nis the harmonic mean of a positive function for any fixed maturity. We\ninvestigate the latter function, which is tightly linked to Fukasawa's\ninvertible map $f_{1/2}$ [Fukasawa, The normalizing transformation of the\nimplied volatility smile, Mathematical Finance, 22, 2012], and its relation\nwith the local volatility surface. It turns out that the log-strike\ntransformation $z = f_{1/2}(k)$ defines a new coordinate system in which the\nshort-dated implied volatility approaches the arithmetic (as opposed to\nharmonic) mean of the local volatility. As an illustration, we consider the\ncase of the SSVI parameterization: in this setting, we obtain an explicit\nformula for the volatility swap from options on realized variance.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jul 2020 16:08:37 GMT"}], "update_date": "2020-07-08", "authors_parsed": [["De Marco", "Stefano", ""]]}, {"id": "2007.04408", "submitter": "Chinonso Nwankwo", "authors": "Chinonso Nwankwo and Weizhong Dai", "title": "An Adaptive and Explicit Fourth Order Runge-Kutta-Fehlberg Method\n  Coupled with Compact Finite Differencing for Pricing American Put Options", "comments": "This is a preprint of an article published in Japan Journal of\n  Industrial and Applied Mathematics (JJIAM). The final authenticated version\n  is available online at: https://doi.org/10.1007/s13160-021-00470-2", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an adaptive and explicit fourth-order Runge-Kutta-Fehlberg method\ncoupled with a fourth-order compact scheme to solve the American put options\nproblem. First, the free boundary problem is converted into a system of partial\ndifferential equations with a fixed domain by using logarithm transformation\nand taking additional derivatives. With the addition of an intermediate\nfunction with a fixed free boundary, a quadratic formula is derived to compute\nthe velocity of the optimal exercise boundary analytically. Furthermore, we\nimplement an extrapolation method to ensure that at least, a third-order\naccuracy in space is maintained at the boundary point when computing the\noptimal exercise boundary from its derivative. As such, it enables us to employ\nfourth-order spatial and temporal discretization with Dirichlet boundary\nconditions for obtaining the numerical solution of the asset option, option\nGreeks, and the optimal exercise boundary. The advantage of the\nRunge-Kutta-Fehlberg method is based on error control and the adjustment of the\ntime step to maintain the error at a certain threshold. By comparing with some\nexisting methods in the numerical experiment, it shows that the present method\nhas a better performance in terms of computational speed and provides a more\naccurate solution.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jul 2020 20:20:35 GMT"}, {"version": "v2", "created": "Wed, 15 Jul 2020 12:07:46 GMT"}, {"version": "v3", "created": "Mon, 31 Aug 2020 12:56:53 GMT"}, {"version": "v4", "created": "Sun, 27 Sep 2020 12:59:53 GMT"}, {"version": "v5", "created": "Sun, 25 Jul 2021 22:04:11 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Nwankwo", "Chinonso", ""], ["Dai", "Weizhong", ""]]}, {"id": "2007.05933", "submitter": "Mirco Rubin", "authors": "Mirco Rubin, Dario Ruzzi", "title": "Equity Tail Risk in the Treasury Bond Market", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper quantifies the effects of equity tail risk on the US government\nbond market. We estimate equity tail risk with option-implied stock market\nvolatility that stems from large negative price jumps, and we assess its value\nin reduced-form predictive regressions for Treasury returns and a term\nstructure model for interest rates. We find that the left tail volatility of\nthe stock market significantly predicts one-month excess returns on Treasuries\nboth in- and out-of-sample. The incremental value of employing equity tail risk\nas a return forecasting factor can be of economic importance for a\nmean-variance investor trading bonds. The estimated term structure model shows\nthat equity tail risk is priced in the US government bond market and,\nconsistent with the theory of flight-to-safety, Treasury prices increase when\nthe perception of tail risk is higher. Our results concerning the predictive\npower and pricing of equity tail risk extend to major government bond markets\nin Europe.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jul 2020 07:59:16 GMT"}], "update_date": "2020-07-14", "authors_parsed": [["Rubin", "Mirco", ""], ["Ruzzi", "Dario", ""]]}, {"id": "2007.06465", "submitter": "Christian Fries", "authors": "Christian P. Fries", "title": "Discounting Damage: Non-Linear Discounting and Default Compensation.\n  Valuation of Non-Replicable Value and Damage", "comments": "34 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this short note we develop a model for discounting.\n  A focus of the model is the discounting, when discount factors cannot be\nderived from market products. That is, a risk-neutralizing trading strategy\ncannot be performed. This is the case, when one is in need of a risk-free\n(default-free) discounting, but default protection on funding providers is not\ntraded. For this case, we introduce a default compensation factor\n($\\exp(+\\tilde{\\lambda} T)$) that describes the present value of a strategy to\ncompensate for default (like buying default protection would do).\n  In a second part, we introduce a model, where the survival probability\ndepends on the required notional. This model is different from the classical\nmodelling of a time-dependent survival probability ($\\exp(-\\lambda T)$). The\nmodel especially allows that large liquidity requirements are instantly more\nlikely do default than small ones.\n  Combined the two approaches build a framework in which discounting\n(valuation) is non-linear.\n  The non-linear discounting presented here has several effects, which are\nrelevant in various applications:\n  * If we consider the question of default-free valuation, i.e., factoring in\nthe cost of default protection, the framework can will lead to\nover-proportional higher values (or cost) for large projects (or damages). The\nframework can lead to the effect that discount-factors for very large liquidity\nrequirements or projects are an increasing function of time. It may even lead\nto discount factors larger than one. This may have relevance in the assessment\nof event like climate change.\n  * For the valuation of defaultable products, e.g., like a defaultable swap,\nthe framework leads to the generation of a continuum of (defaultable) par rate\ncurves (interest rate curve) and the valuation of a payer and a receiver swap\ndiffers by more than just a sign.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jul 2020 15:57:24 GMT"}, {"version": "v2", "created": "Mon, 3 Aug 2020 09:21:31 GMT"}], "update_date": "2020-08-04", "authors_parsed": [["Fries", "Christian P.", ""]]}, {"id": "2007.07701", "submitter": "Alessandro Ramponi", "authors": "Fabio Antonelli, Alessandro Ramponi, Sergio Scarlatti", "title": "Approximate XVA for European claims", "comments": "24 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of computing the Value Adjustment of European\ncontingent claims when default of either party is considered, possibly\nincluding also funding and collateralization requirements. As shown in Brigo et\nal. (\\cite{BLPS}, \\cite{BFP}), this leads to a more articulate variety of Value\nAdjustments ({XVA}) that introduce some nonlinear features. When exploiting a\nreduced-form approach for the default times, the adjusted price can be\ncharacterized as the solution to a possibly nonlinear Backward Stochastic\nDifferential Equation (BSDE). The expectation representing the solution of the\nBSDE is usually quite hard to compute even in a Markovian setting, and one\nmight resort either to the discretization of the Partial Differential Equation\ncharacterizing it or to Monte Carlo Simulations. Both choices are\ncomputationally very expensive and in this paper we suggest an approximation\nmethod based on an appropriate change of numeraire and on a Taylor's polynomial\nexpansion when intensities are represented by means of affine processes\ncorrelated with the asset's price. The numerical discussion at the end of this\nwork shows that, at least in the case of the CIR intensity model, even the\nsimple first-order approximation has a remarkable computational efficiency.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jul 2020 14:19:25 GMT"}], "update_date": "2020-07-16", "authors_parsed": [["Antonelli", "Fabio", ""], ["Ramponi", "Alessandro", ""], ["Scarlatti", "Sergio", ""]]}, {"id": "2007.08804", "submitter": "Karim Barigou", "authors": "Karim Barigou (SAF), Lukasz Delong", "title": "Pricing equity-linked life insurance contracts with multiple risk\n  factors by neural networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the pricing of equity-linked life insurance contracts\nwith death and survival benefits in a general model with multiple stochastic\nrisk factors: interest rate, equity, volatility, unsystematic and systematic\nmortality. We price the equity-linked contracts by assuming that the insurer\nhedges the risks to reduce the local variance of the net asset value process\nand requires a compensation for the non-hedgeable part of the liability in the\nform of an instantaneous standard deviation risk margin. The price can then be\nexpressed as the solution of a system of non-linear partial differential\nequations. We reformulate the problem as a backward stochastic differential\nequation with jumps and solve it numerically by the use of efficient neural\nnetworks. Sensitivity analysis is performed with respect to initial parameters\nand an analysis of the accuracy of the approximation of the true price with our\nneural networks is provided.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jul 2020 07:59:32 GMT"}], "update_date": "2020-07-20", "authors_parsed": [["Barigou", "Karim", "", "SAF"], ["Delong", "Lukasz", ""]]}, {"id": "2007.12228", "submitter": "Foad Shokrollahi", "authors": "Foad Shokrollahi and Marcin Marcin Magdziarz", "title": "Equity warrant pricing under subdiffusive fractional Brownian motion of\n  the short rate", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose an extension of the Merton model. We apply the\nsubdiffusive mechanism to analyze equity warrant in a fractional Brownian\nmotion environment, when the short rate follows the subdiffusive fractional\nBlack-Scholes model. We obtain the pricing formula for zero-coupon bond in the\nintroduced model and derive the partial differential equation with appropriate\nboundary conditions for the valuation of equity warrant. Finally, the pricing\nformula for equity warrant is provided under subdiffusive fractional Brownian\nmotion model of the short rate.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2020 19:46:29 GMT"}, {"version": "v2", "created": "Sat, 10 Oct 2020 21:10:36 GMT"}, {"version": "v3", "created": "Wed, 14 Oct 2020 18:52:57 GMT"}, {"version": "v4", "created": "Mon, 2 Nov 2020 06:59:15 GMT"}], "update_date": "2020-11-03", "authors_parsed": [["Shokrollahi", "Foad", ""], ["Magdziarz", "Marcin Marcin", ""]]}, {"id": "2007.14328", "submitter": "Marc Lagunas", "authors": "Marc Lagunas-Merino, Salvador Ortiz-Latorre", "title": "A decomposition formula for fractional Heston jump diffusion models", "comments": "30 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an option pricing formula for European options in a stochastic\nvolatility model. In particular, the volatility process is defined using a\nfractional integral of a diffusion process and both the stock price and the\nvolatility processes have jumps in order to capture the market effect known as\nleverage effect. We show how to compute a martingale representation for the\nvolatility process. Finally, using It\\^o calculus for processes with\ndiscontinuous trajectories, we develop a first order approximation formula for\noption prices. There are two main advantages in the usage of such approximating\nformulas to traditional pricing methods. First, to improve computational\neffciency, and second, to have a deeper understanding of the option price\nchanges in terms of changes in the model parameters.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jul 2020 15:54:13 GMT"}], "update_date": "2020-07-29", "authors_parsed": [["Lagunas-Merino", "Marc", ""], ["Ortiz-Latorre", "Salvador", ""]]}]