[{"id": "2008.00462", "submitter": "Anindya Goswami Mr.", "authors": "Anindya Goswami and Sharan Rajani and Atharva Tanksale", "title": "Data-Driven Option Pricing using Single and Multi-Asset Supervised\n  Learning", "comments": "18 figures, 11 tables, 25 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose three different data-driven approaches for pricing European-style\ncall options using supervised machine-learning algorithms. These approaches\nyield models that give a range of fair prices instead of a single price point.\nThe performance of the models are tested on two stock market indices: NIFTY$50$\nand BANKNIFTY from the Indian equity market. Although neither historical nor\nimplied volatility is used as an input, the results show that the trained\nmodels have been able to capture the option pricing mechanism better than or\nsimilar to the Black-Scholes formula for all the experiments. Our choice of\nscale free I/O allows us to train models using combined data of multiple\ndifferent assets from a financial market. This not only allows the models to\nachieve far better generalization and predictive capability, but also solves\nthe problem of paucity of data, the primary limitation of using machine\nlearning techniques. We also illustrate the performance of the trained models\nin the period leading up to the 2020 Stock Market Crash (Jan 2019 to April\n2020).\n", "versions": [{"version": "v1", "created": "Sun, 2 Aug 2020 11:14:43 GMT"}, {"version": "v2", "created": "Sat, 5 Dec 2020 14:26:37 GMT"}], "update_date": "2020-12-08", "authors_parsed": [["Goswami", "Anindya", ""], ["Rajani", "Sharan", ""], ["Tanksale", "Atharva", ""]]}, {"id": "2008.00860", "submitter": "Akihiko Noda", "authors": "Kenichi Hirayama, Akihiko Noda", "title": "Evaluating the Financial Market Function in Prewar Japan using a\n  Time-Varying Parameter Model", "comments": "25 pages, 4 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST econ.GN q-fin.EC q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper explores when the financial market lost the price formation\nfunction in prewar Japan in the sense of Fama's (1970) semi-strong form market\nefficiency using a new dataset. We particularly focus on the relationship\nbetween the prewar Japanese financial market and several government policy\ninterventions to explore whether the semi-strong form market efficiency evolves\nover time. To capture the long-run impact of government policy interventions\nagainst the markets, we measure the time-varying joint degree of market\nefficiency and the time-varying impulse responses based on Ito et al.'s (2014;\n2017) generalized least squares-based time-varying vector autoregressive model.\nThe empirical results reveal that (1) the joint degree of market efficiency in\nthe prewar Japanese financial market fluctuated over time because of external\nevents such as policy changes and wars, (2) the semi-strong form EMH is almost\nsupported in the prewar Japanese financial market, (3) Lo's (2004) adaptive\nmarket hypothesis is supported in the prewar Japanese financial market even if\nwe consider that the public information affects the financial markets, and (4)\nthe prewar Japanese financial markets lost the price formation function in 1932\nand that was a turning point in the market.\n", "versions": [{"version": "v1", "created": "Mon, 3 Aug 2020 13:28:50 GMT"}, {"version": "v2", "created": "Thu, 3 Jun 2021 01:21:11 GMT"}], "update_date": "2021-06-04", "authors_parsed": [["Hirayama", "Kenichi", ""], ["Noda", "Akihiko", ""]]}, {"id": "2008.00925", "submitter": "Chinonso Nwankwo", "authors": "Chinonso Nwankwo and Weizhong Dai", "title": "Multigrid Iterative Algorithms based on Compact Finite Difference\n  Schemes and Hermite interpolation for Solving Regime Switching American\n  Options", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present multigrid iterative algorithms for solving a system of coupled\nfree boundary problems for pricing American put options with regime-switching.\nThe algorithms are based on our recent developed compact finite difference\nscheme coupled with Hermite interpolation for solving the m coupled partial\ndifferential equations consisting of the asset, delta, gamma, and speed\noptions. In the algorithms, we first use the Gauss-Seidel as a smoother, and\nthen implement V-cycle and modified multigrid strategies for solving our\ndiscretized equations. Hermite interpolation with Newton interpolatory divided\ndifference (as the basis) is used in estimating the coupled asset, delta,\ngamma, and speed options in the set of equations. A numerical experiment is\nperformed with the two-regimes example and compared with other existing methods\nto validate the optimal strategy. Results show that these algorithms provide\nfast and efficient tools for pricing American put options with\nregime-switching.\n", "versions": [{"version": "v1", "created": "Mon, 3 Aug 2020 15:02:02 GMT"}, {"version": "v2", "created": "Wed, 12 Aug 2020 14:49:16 GMT"}, {"version": "v3", "created": "Sun, 6 Sep 2020 16:56:43 GMT"}], "update_date": "2020-09-08", "authors_parsed": [["Nwankwo", "Chinonso", ""], ["Dai", "Weizhong", ""]]}, {"id": "2008.01463", "submitter": "Udomsak Rakwongwan", "authors": "Teemu Pennanen and Udomsak Rakwongwan", "title": "Optimal semi-static hedging in illiquid markets", "comments": "25 pages, 21 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study indifference pricing of exotic derivatives by using hedging\nstrategies that take static positions in quoted derivatives but trade the\nunderlying and cash dynamically over time. We use real quotes that come with\nbid-ask spreads and finite quantities. Galerkin method and integration\nquadratures are used to approximate the hedging problem by a finite dimensional\nconvex optimization problem which is solved by an interior point method. The\ntechniques are extended also to situations where the underlying is subject to\nbid-ask spreads. As an illustration, we compute indifference prices of\npath-dependent options written on S&P500 index. Semi-static hedging improves\nconsiderably on the purely static options strategy as well as dynamic trading\nwithout options. The indifference prices make good economic sense even in the\npresence of arbitrage opportunities that are found when the underlying is\nassumed perfectly liquid. When transaction costs are introduced, the arbitrage\nopportunities vanish but the indifference prices remain almost unchanged.\n", "versions": [{"version": "v1", "created": "Tue, 4 Aug 2020 11:16:54 GMT"}], "update_date": "2020-08-05", "authors_parsed": [["Pennanen", "Teemu", ""], ["Rakwongwan", "Udomsak", ""]]}, {"id": "2008.06377", "submitter": "Ibrahim Ekren", "authors": "Shreya Bose and Ibrahim Ekren", "title": "Kyle-Back Models with risk aversion and non-Gaussian Beliefs", "comments": "Some typos in Introduction and Subsection 5.1 were corrected", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.AP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the problem of existence of equilibrium in Kyle's continuous\ntime insider trading model ([31]) can be tackled by considering a system of\nquasilinear parabolic equation and a Fokker-Planck equation coupled via a\ntransport type constraint. By obtaining a stochastic representation for the\nsolution of such a system, we show the well-posedness of solutions and study\nthe properties of the equilibrium obtained for small enough risk aversion\nparameter. In our model, the insider has exponential type utility and the\nbelief of the market on the distribution of the price at final time can be\nnon-Gaussian.\n", "versions": [{"version": "v1", "created": "Fri, 14 Aug 2020 14:00:14 GMT"}, {"version": "v2", "created": "Sat, 31 Oct 2020 00:56:15 GMT"}], "update_date": "2020-11-03", "authors_parsed": [["Bose", "Shreya", ""], ["Ekren", "Ibrahim", ""]]}, {"id": "2008.07907", "submitter": "Victor Olkhov", "authors": "Victor Olkhov", "title": "Volatility Depend on Market Trades and Macro Theory", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST q-fin.PM q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents probability distributions for price and returns random\nprocesses for averaging time interval {\\Delta}. These probabilities determine\nproperties of price and returns volatility. We define statistical moments for\nprice and returns random processes as functions of the costs and the volumes of\nmarket trades aggregated during interval {\\Delta}. These sets of statistical\nmoments determine characteristic functionals for price and returns probability\ndistributions. Volatilities are described by first two statistical moments.\nSecond statistical moments are described by functions of second degree of the\ncost and the volumes of market trades aggregated during interval {\\Delta}. We\npresent price and returns volatilities as functions of number of trades and\nsecond degree costs and volumes of market trades aggregated during interval\n{\\Delta}. These expressions support numerous results on correlations between\nreturns volatility, number of trades and the volume of market transactions.\nForecasting the price and returns volatilities depend on modeling the second\ndegree of the costs and the volumes of market trades aggregated during interval\n{\\Delta}. Second degree market trades impact second degree of macro variables\nand expectations. Description of the second degree market trades, macro\nvariables and expectations doubles the complexity of the current macroeconomic\nand financial theory.\n", "versions": [{"version": "v1", "created": "Sat, 15 Aug 2020 12:32:48 GMT"}], "update_date": "2020-08-19", "authors_parsed": [["Olkhov", "Victor", ""]]}, {"id": "2008.08576", "submitter": "Anke Wiese", "authors": "Simon J.A. Malham, Jiaqi Shen, Anke Wiese", "title": "Series expansions and direct inversion for the Heston model", "comments": "87 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Efficient sampling for the conditional time integrated variance process in\nthe Heston stochastic volatility model is key to the simulation of the stock\nprice based on its exact distribution. We construct a new series expansion for\nthis integral in terms of double infinite weighted sums of particular\nindependent random variables through a change of measure and the decomposition\nof squared Bessel bridges. When approximated by series truncations, this\nrepresentation has exponentially decaying truncation errors. We propose\nfeasible strategies to largely reduce the implementation of the new series to\nsimulations of simple random variables that are independent of any model\nparameters. We further develop direct inversion algorithms to generate samples\nfor such random variables based on Chebyshev polynomial approximations for\ntheir inverse distribution functions. These approximations can be used under\nany market conditions. Thus, we establish a strong, efficient and almost exact\nsampling scheme for the Heston model.\n", "versions": [{"version": "v1", "created": "Tue, 11 Aug 2020 16:48:15 GMT"}, {"version": "v2", "created": "Thu, 7 Jan 2021 16:38:08 GMT"}], "update_date": "2021-01-08", "authors_parsed": [["Malham", "Simon J. A.", ""], ["Shen", "Jiaqi", ""], ["Wiese", "Anke", ""]]}, {"id": "2008.09108", "submitter": "Konstantin E. Feldman", "authors": "K.E. Feldman", "title": "Analytic Calibration in Andreasen-Huge SABR Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP math.PR q-fin.MF q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We derive analytic formulae which link $\\alpha$, $\\nu$ and $\\rho$ parameters\nin Andreasen-Huge style SABR model to the ATM price and option prices at four\nstrikes close to ATM. Based on these formulae we give a characterisation for\nthe SABR parameters in terms of derivatives of the swap rate forward\nprobability density function. We test the analytic result in the application to\nthe interest rate futures option market.\n", "versions": [{"version": "v1", "created": "Thu, 20 Aug 2020 17:51:47 GMT"}, {"version": "v2", "created": "Mon, 1 Feb 2021 07:03:34 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Feldman", "K. E.", ""]]}, {"id": "2008.09454", "submitter": "Sheng (Victor) Wang", "authors": "Samuel N. Cohen, Christoph Reisinger and Sheng Wang", "title": "Detecting and repairing arbitrage in traded option prices", "comments": "Our implementation of this algorithm in Python is available in the\n  repository https://github.com/vicaws/arbitragerepair", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Option price data are used as inputs for model calibration, risk-neutral\ndensity estimation and many other financial applications. The presence of\narbitrage in option price data can lead to poor performance or even failure of\nthese tasks, making pre-processing of the data to eliminate arbitrage\nnecessary. Most attention in the relevant literature has been devoted to\narbitrage-free smoothing and filtering (i.e. removing) of data. In contrast to\nsmoothing, which typically changes nearly all data, or filtering, which\ntruncates data, we propose to repair data by only necessary and minimal\nchanges. We formulate the data repair as a linear programming (LP) problem,\nwhere the no-arbitrage relations are constraints, and the objective is to\nminimise prices' changes within their bid and ask price bounds. Through\nempirical studies, we show that the proposed arbitrage repair method gives\nsparse perturbations on data, and is fast when applied to real world\nlarge-scale problems due to the LP formulation. In addition, we show that\nremoving arbitrage from prices data by our repair method can improve model\ncalibration with enhanced robustness and reduced calibration error.\n", "versions": [{"version": "v1", "created": "Fri, 21 Aug 2020 12:49:33 GMT"}], "update_date": "2020-08-24", "authors_parsed": [["Cohen", "Samuel N.", ""], ["Reisinger", "Christoph", ""], ["Wang", "Sheng", ""]]}, {"id": "2008.10184", "submitter": "Weixuan Xia", "authors": "Weixuan Xia", "title": "Power-type derivatives for rough volatility with jumps", "comments": "Added references", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose an efficient pricing-hedging framework for\nvolatility derivatives which simultaneously takes into account path roughness\nand jumps. Instead of dealing with log-volatility, we directly model the\ninstantaneous variance of a risky asset in terms of a fractional\nOrnstein-Uhlenbeck process driven by an infinite-activity L\\'{e}vy\nsubordinator, which is shown to exhibit roughness under suitable conditions and\nalso eludes the need for an independent Brownian component. This structure\nrenders the characteristic function of forward variance obtainable at least in\nsemi-closed form, subject to a generic integrable kernel. To analyze financial\nderivatives, primarily swaps and European-style options, on average forward\nvolatility, we introduce a general class of power-type derivatives on the\naverage forward variance, which also provide a way of adjusting the option\ninvestor's risk exposure. Pricing formulae are based on numerical inverse\nFourier transform and, as illustrated by an empirical study on VIX options,\npermit stable and efficient model calibration once specified.\n", "versions": [{"version": "v1", "created": "Mon, 24 Aug 2020 04:10:17 GMT"}, {"version": "v2", "created": "Wed, 2 Sep 2020 18:48:16 GMT"}], "update_date": "2020-09-04", "authors_parsed": [["Xia", "Weixuan", ""]]}, {"id": "2008.12275", "submitter": "Alexey Bakshaev", "authors": "Alexey Bakshaev", "title": "Market-making with reinforcement-learning (SAC)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper explores the application of a continuous action space soft\nactor-critic (SAC) reinforcement learning model to the area of automated\nmarket-making. The reinforcement learning agent receives a simulated flow of\nclient trades, thus accruing a position in an asset, and learns to offset this\nrisk by either hedging at simulated \"exchange\" spreads or by attracting an\noffsetting client flow by changing offered client spreads (skewing the offered\nprices). The question of learning minimum spreads that compensate for the risk\nof taking the position is being investigated. Finally, the agent is posed with\na problem of learning to hedge a blended client trade flow resulting from\nindependent price processes (a \"portfolio\" position). The position penalty\nmethod is introduced to improve the convergence. An Open-AI gym-compatible\nhedge environment is introduced and the Open AI SAC baseline RL engine is being\nused as a learning baseline.\n", "versions": [{"version": "v1", "created": "Thu, 27 Aug 2020 17:25:18 GMT"}], "update_date": "2020-08-28", "authors_parsed": [["Bakshaev", "Alexey", ""]]}, {"id": "2008.13198", "submitter": "Thierry Roncalli", "authors": "Th\\'eo Roncalli, Th\\'eo Le Guenedal, Fr\\'ed\\'eric Lepetit, Thierry\n  Roncalli, Takaya Sekine", "title": "Measuring and Managing Carbon Risk in Investment Portfolios", "comments": "58 pages, 32 figures, 11 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article studies the impact of carbon risk on stock pricing. To address\nthis, we consider the seminal approach of G\\\"orgen \\textsl{et al.} (2019), who\nproposed estimating the carbon financial risk of equities by their carbon beta.\nTo achieve this, the primary task is to develop a brown-minus-green (or BMG)\nrisk factor, similar to Fama and French (1992). Secondly, we must estimate the\ncarbon beta using a multi-factor model. While G\\\"orgen \\textsl{et al.} (2019)\nconsidered that the carbon beta is constant, we propose a time-varying\nestimation model to assess the dynamics of the carbon risk. Moreover, we test\nseveral specifications of the BMG factor to understand which climate\nchange-related dimensions are priced in by the stock market. In the second part\nof the article, we focus on the carbon risk management of investment\nportfolios. First, we analyze how carbon risk impacts the construction of a\nminimum variance portfolio. As the goal of this portfolio is to reduce\nunrewarded financial risks of an investment, incorporating the carbon risk into\nthis approach fulfils this objective. Second, we propose a new framework for\nbuilding enhanced index portfolios with a lower exposure to carbon risk than\ncapitalization-weighted stock indices. Finally, we explore how carbon\nsensitivities can improve the robustness of factor investing portfolios.\n", "versions": [{"version": "v1", "created": "Sun, 30 Aug 2020 15:41:02 GMT"}], "update_date": "2020-09-01", "authors_parsed": [["Roncalli", "Théo", ""], ["Guenedal", "Théo Le", ""], ["Lepetit", "Frédéric", ""], ["Roncalli", "Thierry", ""], ["Sekine", "Takaya", ""]]}]