[{"id": "2107.01611", "submitter": "Jianfei Zhang", "authors": "Mathieu Rosenbaum and Jianfei Zhang", "title": "Deep calibration of the quadratic rough Heston model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.MF q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The quadratic rough Heston model provides a natural way to encode Zumbach\neffect in the rough volatility paradigm. We apply multi-factor approximation\nand use deep learning methods to build an efficient calibration procedure for\nthis model. We show that the model is able to reproduce very well both SPX and\nVIX implied volatilities. We typically obtain VIX option prices within the\nbid-ask spread and an excellent fit of the SPX at-the-money skew. Moreover, we\nalso explain how to use the trained neural networks for hedging with\ninstantaneous computation of hedging quantities.\n", "versions": [{"version": "v1", "created": "Sun, 4 Jul 2021 12:52:19 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Rosenbaum", "Mathieu", ""], ["Zhang", "Jianfei", ""]]}, {"id": "2107.10225", "submitter": "Wen Su", "authors": "Wen Su", "title": "Pricing Exchange Option Based on Copulas by MCMC Algorithm", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.PR", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  This paper focus on pricing exchange option based on copulas by MCMC\nalgorithm. Initially, we introduce the methodologies concerned about\nrisk-netural pricing, copulas and MCMC algorithm. After the basic knowledge, we\ncompare the option prices given by different models, the results show except\nGumbel copula, the other model provide similar estimation.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 17:23:37 GMT"}], "update_date": "2021-07-22", "authors_parsed": [["Su", "Wen", ""]]}, {"id": "2107.10377", "submitter": "Marco Bianchetti", "authors": "Lorenzo Silotto, Marco Scaringi, Marco Bianchetti", "title": "Everything You Always Wanted to Know About XVA Model Risk but Were\n  Afraid to Ask", "comments": "59 pages, 15 figures, 16 tables, 43 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.RM", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Valuation adjustments, collectively named XVA, play an important role in\nmodern derivatives pricing. XVA are an exotic pricing component since they\nrequire the forward simulation of multiple risk factors in order to compute the\nportfolio exposure including collateral, leading to a significant model risk\nand computational effort, even in case of plain vanilla trades. This work\nanalyses the most critical model risk factors, meant as those to which XVA are\nmost sensitive, finding an acceptable compromise between accuracy and\nperformance. This task has been conducted in a complete context including a\nmarket standard multi-curve G2++ model calibrated on real market data, both\nVariation Margin and ISDA-SIMM dynamic Initial Margin, different\ncollateralization schemes, and the most common linear and non-linear interest\nrates derivatives. Moreover, we considered an alternative analytical approach\nfor XVA in case of uncollateralized Swaps. We show that a crucial element is\nthe construction of a parsimonious time grid capable of capturing all\nperiodical spikes arising in collateralized exposure during the Margin Period\nof Risk. To this end, we propose a workaround to efficiently capture all\nspikes. Moreover, we show that there exists a parameterization which allows to\nobtain accurate results in a reasonable time, which is a very important feature\nfor practical applications. In order to address the valuation uncertainty\nlinked to the existence of a range of different parameterizations, we calculate\nthe Model Risk AVA (Additional Valuation Adjustment) for XVA according to the\nprovisions of the EU Prudent Valuation regulation. Finally, this work can serve\nas an handbook containing step-by-step instructions for the implementation of a\ncomplete, realistic and robust modelling framework of collateralized exposure\nand XVA.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jul 2021 22:24:32 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Silotto", "Lorenzo", ""], ["Scaringi", "Marco", ""], ["Bianchetti", "Marco", ""]]}, {"id": "2107.11340", "submitter": "Alexandre Carbonneau", "authors": "Alexandre Carbonneau and Fr\\'ed\\'eric Godin", "title": "Deep equal risk pricing of financial derivatives with non-translation\n  invariant risk measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of non-translation invariant risk measures within the equal risk\npricing (ERP) methodology for the valuation of financial derivatives is\ninvestigated. The ability to move beyond the class of convex risk measures\nconsidered in several prior studies provides more flexibility within the\npricing scheme. In particular, suitable choices for the risk measure embedded\nin the ERP framework such as the semi-mean-square-error (SMSE) are shown herein\nto alleviate the price inflation phenomenon observed under Tail Value-at-Risk\nbased ERP as documented for instance in Carbonneau and Godin (2021b). The\nnumerical implementation of non-translation invariant ERP is performed through\ndeep reinforcement learning, where a slight modification is applied to the\nconventional deep hedging training algorithm (see Buehler et al., 2019) so as\nto enable obtaining a price through a single training run for the two neural\nnetworks associated with the respective long and short hedging strategies. The\naccuracy of the neural network training procedure is shown in simulation\nexperiments not to be materially impacted by such modification of the training\nalgorithm.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jul 2021 16:36:46 GMT"}], "update_date": "2021-07-26", "authors_parsed": [["Carbonneau", "Alexandre", ""], ["Godin", "Frédéric", ""]]}, {"id": "2107.12041", "submitter": "Carol Alexander Prof.", "authors": "Carol Alexander and Arben Imeraj", "title": "Inverse Options in a Black-Scholes World", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF q-fin.PM q-fin.TR", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Most trading in cryptocurrency options is on inverse products, so called\nbecause the contract size is denominated in US dollars and they are margined\nand settled in crypto, typically bitcoin or ether. Their popularity stems from\nallowing professional traders in bitcoin or ether options to avoid transferring\nfiat currency to and from the exchanges. We derive new analytic pricing and\nhedging formulae for inverse options under the assumption that the underlying\nfollows a geometric Brownian motion. The boundary conditions and hedge ratios\nexhibit relatively complex but very important new features which warrant\nfurther analysis and explanation. We also illustrate some inconsistencies,\nexhibited in time series of Deribit bitcoin option implied volatilities, which\nindicate that traders may be applying direct option hedging and valuation\nmethods erroneously. This could be because they are unaware of the correct,\ninverse option characteristics which are derived in this paper.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jul 2021 08:57:56 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Alexander", "Carol", ""], ["Imeraj", "Arben", ""]]}, {"id": "2107.12447", "submitter": "Alet Roux", "authors": "Alvaro Guinea and Alet Roux", "title": "Bitcoin option pricing: A market attention approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A model is proposed that models Bitcoin prices by taking into account market\nattention. Assuming that market attention follows a mean-reverting\nCox-Ingersoll-Ross process and allowing it to influence Bitcoin returns (after\nsome delay) leads to a tractable affine model with semi-closed formulae for\nEuropean put and call prices. A maximum likelihood estimation procedure is\nproposed for this model. The accuracy of its call and put prices outperforms a\nnumber of standard models when tested on real data.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jul 2021 19:25:44 GMT"}], "update_date": "2021-07-28", "authors_parsed": [["Guinea", "Alvaro", ""], ["Roux", "Alet", ""]]}, {"id": "2107.12462", "submitter": "Jan Posp\\'i\\v{s}il", "authors": "Jan Matas and Jan Posp\\'i\\v{s}il", "title": "Robustness and sensitivity analyses for rough Volterra stochastic\n  volatility models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we perform robustness and sensitivity analysis of several\ncontinuous-time rough Volterra stochastic volatility models with respect to the\nprocess of market calibration. Robustness is understood in the sense of\nsensitivity to changes in the option data structure. The latter analyses then\nshould validate the hypothesis on importance of the roughness in the volatility\nprocess dynamics. Empirical study is performed on a data set of Apple Inc.\nequity options traded in four different days in April and May 2015. In\nparticular, the results for RFSV, rBergomi and aRFSV models are provided.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jul 2021 20:29:10 GMT"}], "update_date": "2021-07-28", "authors_parsed": [["Matas", "Jan", ""], ["Pospíšil", "Jan", ""]]}]