[{"id": "1006.0308", "submitter": "Rajkumar Buyya", "authors": "Rajkumar Buyya, Anton Beloglazov, and Jemal Abawajy,", "title": "Energy-Efficient Management of Data Center Resources for Cloud\n  Computing: A Vision, Architectural Elements, and Open Challenges", "comments": "12 pages, 5 figures,Proceedings of the 2010 International Conference\n  on Parallel and Distributed Processing Techniques and Applications (PDPTA\n  2010), Las Vegas, USA, July 12-15, 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud computing is offering utility-oriented IT services to users worldwide.\nBased on a pay-as-you-go model, it enables hosting of pervasive applications\nfrom consumer, scientific, and business domains. However, data centers hosting\nCloud applications consume huge amounts of energy, contributing to high\noperational costs and carbon footprints to the environment. Therefore, we need\nGreen Cloud computing solutions that can not only save energy for the\nenvironment but also reduce operational costs. This paper presents vision,\nchallenges, and architectural elements for energy-efficient management of Cloud\ncomputing environments. We focus on the development of dynamic resource\nprovisioning and allocation algorithms that consider the synergy between\nvarious data center infrastructures (i.e., the hardware, power units, cooling\nand software), and holistically work to boost data center energy efficiency and\nperformance. In particular, this paper proposes (a) architectural principles\nfor energy-efficient management of Clouds; (b) energy-efficient resource\nallocation policies and scheduling algorithms considering quality-of-service\nexpectations, and devices power usage characteristics; and (c) a novel software\ntechnology for energy-efficient management of Clouds. We have validated our\napproach by conducting a set of rigorous performance evaluation study using the\nCloudSim toolkit. The results demonstrate that Cloud computing model has\nimmense potential as it offers significant performance gains as regards to\nresponse time and cost saving under dynamic workload scenarios.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jun 2010 06:45:07 GMT"}], "update_date": "2010-06-03", "authors_parsed": [["Buyya", "Rajkumar", ""], ["Beloglazov", "Anton", ""], ["Abawajy", "Jemal", ""]]}, {"id": "1006.1074", "submitter": "Mathias Monnerville", "authors": "M. Monnerville and G. S\\'emah", "title": "Youpi, a Web-based Astronomical Image Processing Pipeline", "comments": "4 pages, 2 figures, to appear in the proceedings of ADASS XIX, Oct\n  4-8 2009, Sapporo, Japan (ASP Conf. Series)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Youpi stands for \"YOUpi is your processing PIpeline\". It is a portable, easy\nto use web application providing high level functionalities to perform data\nreduction on scientific FITS images. It is built on top of open source\nprocessing tools that are released to the community by Terapix, in order to\norganize your data on a computer cluster, to manage your processing jobs in\nreal time and to facilitate teamwork by allowing fine-grain sharing of results\nand data. On the server side, Youpi is written in the Python programming\nlanguage and uses the Django web framework. On the client side, Ajax techniques\nare used along with the Prototype and script.aculo.us Javascript librairies.\n", "versions": [{"version": "v1", "created": "Sat, 5 Jun 2010 22:27:14 GMT"}], "update_date": "2010-06-08", "authors_parsed": [["Monnerville", "M.", ""], ["Sémah", "G.", ""]]}, {"id": "1006.1177", "submitter": "Secretary Aircc Journal", "authors": "Srirangam V Addepallil, Per Andersen, George L Barnes", "title": "Efficient Resource Matching in Heterogeneous Grid Using Resource Vector", "comments": "10 pages", "journal-ref": "International Journal of Computer Science and Information\n  Technology 2.3 (2010) 1-10", "doi": "10.5121/ijcsit.2010.2301", "report-no": null, "categories": "cs.DC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this paper, a method for efficient scheduling to obtain optimum job\nthroughput in a distributed campus grid environment is presented; Traditional\njob schedulers determine job scheduling using user and job resource attributes.\nUser attributes are related to current usage, historical usage, user priority\nand project access. Job resource attributes mainly comprise of soft\nrequirements (compilers, libraries) and hard requirements like memory, storage\nand interconnect. A job scheduler dispatches jobs to a resource if a job's hard\nand soft requirements are met by a resource. In current scenario during\nexecution of a job, if a resource becomes unavailable, schedulers are presented\nwith limited options, namely re-queuing job or migrating job to a different\nresource. Both options are expensive in terms of data and compute time. These\nsituations can be avoided, if the often ignored factor, availability time of a\nresource in a grid environment is considered. We propose resource rank\napproach, in which jobs are dispatched to a resource which has the highest rank\namong all resources that match the job's requirement. The results show that our\napproach can increase throughput of many serial / monolithic jobs.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jun 2010 06:22:05 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Addepallil", "Srirangam V", ""], ["Andersen", "Per", ""], ["Barnes", "George L", ""]]}, {"id": "1006.1191", "submitter": "Secretary Aircc Journal", "authors": "Yaser Miaji Osman Gazali and Suhaidi Hassan", "title": "Survey on the Event Orderings Semantics Used for Distributed System", "comments": "9 pages", "journal-ref": "International Journal of Computer Science and Information\n  Technology 2.3 (2010) 150-158", "doi": "10.5121/ijcsit.2010.2311", "report-no": null, "categories": "cs.DC", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Event ordering in distributed system (DS) is disputable and proactive subject\nin DS particularly with the emergence of multimedia synchronization. According\nto the literature, different type of event ordering is used for different DS\nmode such as asynchronous or synchronous. Recently, there are several novel\nimplementation of these types introduced to fulfill the demand for establishing\na certain order according to a specific criterion in DS with lighter\ncomplexity.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jun 2010 07:26:00 GMT"}], "update_date": "2010-07-15", "authors_parsed": [["Gazali", "Yaser Miaji Osman", ""], ["Hassan", "Suhaidi", ""]]}, {"id": "1006.1222", "submitter": "S\\'andor Laki", "authors": "B\\'ela Hull\\'ar, S\\'andor Laki, J\\'ozsef St\\'eger, Istv\\'an Csabai,\n  G\\'abor Vattay", "title": "SONoMA: A Service Oriented Network Measurement Architecture", "comments": "Technical Report", "journal-ref": null, "doi": null, "report-no": "TR-ELTE-CNL-2010/1", "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To characterize the structure, dynamics and operational state of the Internet\nit requires distributed measurements. Although in the last decades several\nsystems capable to do this have been created, the easy access of these\ninfrastructures and orchestration of complex measurements is not solved. We\npropose a system architecture that combines the flexibility of mature network\nmeasurement infrastructures such as PlanetLab or ETOMIC with the general\naccessibility and popularity of public services like Web based bandwidth\nmeasurement or traceroute servers. To realize these requirements we developed a\nmulti-layer architecture based on Web Services and the basic principles of SOA,\nwhich is a very popular paradigm in distributed business application\ndevelopment. Our approach opens the door to perform complex network\nmeasurements, handles heterogeneous measurement devices, automatically stores\nthe results in a public database and protects against malicious users as well.\nTo demonstrate our concept we developed a public prototype system, called\nSONoMA.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jun 2010 10:12:19 GMT"}], "update_date": "2010-06-08", "authors_parsed": [["Hullár", "Béla", ""], ["Laki", "Sándor", ""], ["Stéger", "József", ""], ["Csabai", "István", ""], ["Vattay", "Gábor", ""]]}, {"id": "1006.1401", "submitter": "Jianfeng Zhan", "authors": "Jianfeng Zhan, Lei Wang, Weisong Shi, Shimin Gong, Xiutao Zang", "title": "PhoenixCloud: Provisioning Resources for Heterogeneous Workloads in\n  Cloud Computing", "comments": "18 pages. This is an extended version of our CCA 08 paper(The First\n  Workshop of Cloud Computing and its Application, CCA08, Chicago, 2008): J.\n  Zhan L. Wang, B. Tu, Y. Li, P. Wang, W. Zhou, D. Meng. 2008. Phoenix Cloud:\n  Consolidating Different Computing Loads on Shared Cluster System for Large\n  Organization. The modified version can be found on\n  http://arxiv.org/abs/0906.1346", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As more and more service providers choose Cloud platforms, which is provided\nby third party resource providers, resource providers needs to provision\nresources for heterogeneous workloads in different Cloud scenarios. Taking into\naccount the dramatic differences of heterogeneous workloads, can we\ncoordinately provision resources for heterogeneous workloads in Cloud\ncomputing? In this paper we focus on this important issue, which is\ninvestigated by few previous work. Our contributions are threefold: (1) we\nrespectively propose a coordinated resource provisioning solution for\nheterogeneous workloads in two typical Cloud scenarios: first, a large\norganization operates a private Cloud for two heterogeneous workloads; second,\na large organization or two service providers running heterogeneous workloads\nrevert to a public Cloud; (2) we build an agile system PhoenixCloud that\nenables a resource provider to create coordinated runtime environments on\ndemand for heterogeneous workloads when they are consolidated on a Cloud site;\nand (3) A comprehensive evaluation has been performed in experiments. For two\ntypical heterogeneous workload traces: parallel batch jobs and Web services,\nour experiments show that: a) in a private Cloud scenario, when the throughput\nis almost same like that of a dedicated cluster system, our solution decreases\nthe configuration size of a cluster by about 40%; b) in a public Cloud\nscenario, our solution decreases not only the total resource consumption, but\nalso the peak resource consumption maximally to 31% with respect to that of EC2\n+RightScale solution.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jun 2010 00:42:20 GMT"}, {"version": "v2", "created": "Tue, 20 Jul 2010 23:58:31 GMT"}], "update_date": "2010-07-22", "authors_parsed": [["Zhan", "Jianfeng", ""], ["Wang", "Lei", ""], ["Shi", "Weisong", ""], ["Gong", "Shimin", ""], ["Zang", "Xiutao", ""]]}, {"id": "1006.1424", "submitter": "EPTCS", "authors": "Damian Markham, Janet Anders, Michal Hajdu\\v{s}ek, Vlatko Vedral", "title": "Measurement Based Quantum Computation on Fractal Lattices", "comments": null, "journal-ref": "EPTCS 26, 2010, pp. 109-115", "doi": "10.4204/EPTCS.26.10", "report-no": null, "categories": "quant-ph cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we extend on work which establishes an analology between\none-way quantum computation and thermodynamics to see how the former can be\nperformed on fractal lattices. We find fractals lattices of arbitrary dimension\ngreater than one which do all act as good resources for one-way quantum\ncomputation, and sets of fractal lattices with dimension greater than one all\nof which do not. The difference is put down to other topological factors such\nas ramification and connectivity. This work adds confidence to the analogy and\nhighlights new features to what we require for universal resources for one-way\nquantum computation.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jun 2010 01:11:50 GMT"}], "update_date": "2010-06-09", "authors_parsed": [["Markham", "Damian", ""], ["Anders", "Janet", ""], ["Hajdušek", "Michal", ""], ["Vedral", "Vlatko", ""]]}, {"id": "1006.1443", "submitter": "Tobias Friedrich", "authors": "Tobias Friedrich, Thomas Sauerwald, Dan Vilenchik", "title": "Smoothed Analysis of Balancing Networks", "comments": "26 pages, to appear in Random Structures and Algorithms", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a balancing network each processor has an initial collection of unit-size\njobs (tokens) and in each round, pairs of processors connected by balancers\nsplit their load as evenly as possible. An excess token (if any) is placed\naccording to some predefined rule. As it turns out, this rule crucially affects\nthe performance of the network. In this work we propose a model that studies\nthis effect. We suggest a model bridging the uniformly-random assignment rule,\nand the arbitrary one (in the spirit of smoothed-analysis). We start with an\narbitrary assignment of balancer directions and then flip each assignment with\nprobability $\\alpha$ independently. For a large class of balancing networks our\nresult implies that after $\\Oh(\\log n)$ rounds the discrepancy is $\\Oh(\n(1/2-\\alpha) \\log n + \\log \\log n)$ with high probability. This matches and\ngeneralizes known upper bounds for $\\alpha=0$ and $\\alpha=1/2$. We also show\nthat a natural network matches the upper bound for any $\\alpha$.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jun 2010 03:16:18 GMT"}], "update_date": "2010-06-09", "authors_parsed": [["Friedrich", "Tobias", ""], ["Sauerwald", "Thomas", ""], ["Vilenchik", "Dan", ""]]}, {"id": "1006.1449", "submitter": "EPTCS", "authors": "Petteri Kaskenpalo (AUT University)", "title": "On Secure Workflow Decentralisation on the Internet", "comments": null, "journal-ref": "EPTCS 27, 2010, pp. 2-16", "doi": "10.4204/EPTCS.27.2", "report-no": null, "categories": "cs.CR cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Decentralised workflow management systems are a new research area, where most\nwork to-date has focused on the system's overall architecture. As little\nattention has been given to the security aspects in such systems, we follow a\nsecurity driven approach, and consider, from the perspective of available\nsecurity building blocks, how security can be implemented and what new\nopportunities are presented when empowering the decentralised environment with\nmodern distributed security protocols. Our research is motivated by a more\ngeneral question of how to combine the positive enablers that email exchange\nenjoys, with the general benefits of workflow systems, and more specifically\nwith the benefits that can be introduced in a decentralised environment. This\naims to equip email users with a set of tools to manage the semantics of a\nmessage exchange, contents, participants and their roles in the exchange in an\nenvironment that provides inherent assurances of security and privacy. This\nwork is based on a survey of contemporary distributed security protocols, and\nconsiders how these protocols could be used in implementing a distributed\nworkflow management system with decentralised control . We review a set of\nthese protocols, focusing on the required message sequences in reviewing the\nprotocols, and discuss how these security protocols provide the foundations for\nimplementing core control-flow, data, and resource patterns in a distributed\nworkflow environment.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jun 2010 04:16:38 GMT"}], "update_date": "2010-06-09", "authors_parsed": [["Kaskenpalo", "Petteri", "", "AUT University"]]}, {"id": "1006.1689", "submitter": "EPTCS", "authors": "Tom Van Cutsem (Vrije Universiteit Brussel), Mark Miller (Google)", "title": "Proceedings First International Workshop on Decentralized Coordination\n  of Distributed Processes", "comments": null, "journal-ref": "EPTCS 27, 2010", "doi": "10.4204/EPTCS.27", "report-no": null, "categories": "cs.DC cs.CR cs.NI cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the papers presented at the 1st International Workshop\non \"Decentralized Coordination of Distributed Processes\", DCDP 2010, held in\nAmsterdam, The Netherlands on June 10th, 2010 in conjunction with the 5th\nInternational Federated Conferences on Distributed Computing Techniques,\nDisCoTec 2010. The central theme of the workshop is the decentralized\ncoordination of distributed processes. Decentralized: there is no single\nauthority in the network that everything is vulnerable to. Coordinated:\nprocesses need to cooperate to achieve meaningful results, potentially in the\nface of mutual suspicion. Distributed: processes are separated by a potentially\nunreliable network.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 02:39:07 GMT"}], "update_date": "2010-06-10", "authors_parsed": [["Van Cutsem", "Tom", "", "Vrije Universiteit Brussel"], ["Miller", "Mark", "", "Google"]]}, {"id": "1006.1923", "submitter": "Kanat Tangwongsan", "authors": "Guy E. Blelloch and Kanat Tangwongsan", "title": "Parallel Approximation Algorithms for Facility-Location Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the design and analysis of parallel approximation\nalgorithms for facility-location problems, including $\\NC$ and $\\RNC$\nalgorithms for (metric) facility location, $k$-center, $k$-median, and\n$k$-means. These problems have received considerable attention during the past\ndecades from the approximation algorithms community, concentrating primarily on\nimproving the approximation guarantees. In this paper, we ask, is it possible\nto parallelize some of the beautiful results from the sequential setting?\n  Our starting point is a small, but diverse, subset of results in\napproximation algorithms for facility-location problems, with a primary goal of\ndeveloping techniques for devising their efficient parallel counterparts. We\nfocus on giving algorithms with low depth, near work efficiency (compared to\nthe sequential versions), and low cache complexity. Common in algorithms we\npresent is the idea that instead of picking only the most cost-effective\nelement, we make room for parallelism by allowing a small slack (e.g., a\n$(1+\\vareps)$ factor) in what can be selected---then, we use a clean-up step to\nensure that the behavior does not deviate too much from the sequential steps.\nAll the algorithms we developed are ``cache efficient'' in that the cache\ncomplexity is bounded by $O(w/B)$, where $w$ is the work in the EREW model and\n$B$ is the block size.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 22:54:18 GMT"}], "update_date": "2010-06-11", "authors_parsed": [["Blelloch", "Guy E.", ""], ["Tangwongsan", "Kanat", ""]]}, {"id": "1006.1926", "submitter": "Daniel Kunkle", "authors": "Daniel Kunkle", "title": "Roomy: A System for Space Limited Computations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are numerous examples of problems in symbolic algebra in which the\nrequired storage grows far beyond the limitations even of the distributed RAM\nof a cluster. Often this limitation determines how large a problem one can\nsolve in practice. Roomy provides a minimally invasive system to modify the\ncode for such a computation, in order to use the local disks of a cluster or a\nSAN as a transparent extension of RAM.\n  Roomy is implemented as a C/C++ library. It provides some simple data\nstructures (arrays, unordered lists, and hash tables). Some typical programming\nconstructs that one might employ in Roomy are: map, reduce, duplicate\nelimination, chain reduction, pair reduction, and breadth-first search. All\naspects of parallelism and remote I/O are hidden within the Roomy library.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 23:12:33 GMT"}], "update_date": "2010-06-11", "authors_parsed": [["Kunkle", "Daniel", ""]]}, {"id": "1006.2183", "submitter": "Aydin Buluc", "authors": "Ayd{\\i}n Bulu\\c{c} and John R. Gilbert", "title": "Highly Parallel Sparse Matrix-Matrix Multiplication", "comments": null, "journal-ref": null, "doi": null, "report-no": "UCSB technical report CS-2010-10", "categories": "cs.DC cs.MS cs.NA cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Generalized sparse matrix-matrix multiplication is a key primitive for many\nhigh performance graph algorithms as well as some linear solvers such as\nmultigrid. We present the first parallel algorithms that achieve increasing\nspeedups for an unbounded number of processors. Our algorithms are based on\ntwo-dimensional block distribution of sparse matrices where serial sections use\na novel hypersparse kernel for scalability. We give a state-of-the-art MPI\nimplementation of one of our algorithms. Our experiments show scaling up to\nthousands of processors on a variety of test scenarios.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jun 2010 02:10:58 GMT"}], "update_date": "2016-08-09", "authors_parsed": [["Buluç", "Aydın", ""], ["Gilbert", "John R.", ""]]}, {"id": "1006.2422", "submitter": "Guanfeng Liang", "authors": "Guanfeng Liang and Nitin Vaidya", "title": "Complexity of Multi-Value Byzantine Agreement", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the problem of maximizing the throughput of\nByzantine agreement, given that the sum capacity of all links in between nodes\nin the system is finite. We have proposed a highly efficient Byzantine\nagreement algorithm on values of length l>1 bits. This algorithm uses error\ndetecting network codes to ensure that fault-free nodes will never disagree,\nand routing scheme that is adaptive to the result of error detection. Our\nalgorithm has a bit complexity of n(n-1)l/(n-t), which leads to a linear cost\n(O(n)) per bit agreed upon, and overcomes the quadratic lower bound\n(Omega(n^2)) in the literature. Such linear per bit complexity has only been\nachieved in the literature by allowing a positive probability of error. Our\nalgorithm achieves the linear per bit complexity while guaranteeing agreement\nis achieved correctly even in the worst case. We also conjecture that our\nalgorithm can be used to achieve agreement throughput arbitrarily close to the\nagreement capacity of a network, when the sum capacity is given.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jun 2010 00:01:47 GMT"}], "update_date": "2010-06-15", "authors_parsed": [["Liang", "Guanfeng", ""], ["Vaidya", "Nitin", ""]]}, {"id": "1006.2433", "submitter": "Anwitaman Datta", "authors": "Anwitaman Datta", "title": "Anonymous Gossiping", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a novel gossiping primitive to support privacy\npreserving data analytics (PPDA). In contrast to existing computational PPDA\nprimitives such as secure multiparty computation and data randomization based\napproaches, the proposed primitive `anonymous gossiping' is a communication\nprimitive for privacy preserving personalized information aggregation\ncomplementing such traditional computational analytics. We realize this novel\nprimitive by composing existing gossiping mechanisms for peer sampling &\ninformation aggregation and onion routing technique for establishing anonymous\ncommunication. This is more an `ideas' paper, rather than providing concrete\nand quantified results.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jun 2010 05:57:27 GMT"}], "update_date": "2010-06-15", "authors_parsed": [["Datta", "Anwitaman", ""]]}, {"id": "1006.2566", "submitter": "Giorgio Parisi", "authors": "M. Bernaschi, G. Parisi, L. Parisi", "title": "The Heisenberg spin glass model on GPU: myths and actual facts", "comments": "13 pages, 2 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.dis-nn cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe different implementations of the 3D Heisenberg spin glass model\nfor Graphics Processing Units (GPU). The results show that the {\\em fast}\nshared memory gives better performance with respect to the {\\em slow} global\nmemory only if a multi-hit technique is used.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jun 2010 21:18:54 GMT"}], "update_date": "2010-06-15", "authors_parsed": [["Bernaschi", "M.", ""], ["Parisi", "G.", ""], ["Parisi", "L.", ""]]}, {"id": "1006.2650", "submitter": "Ajanta De Sarkar", "authors": "Ajanta De Sarkar and Nandini Mukherjee", "title": "A Study on Performance Analysis Tools for Applications Running on Large\n  Distributed Systems", "comments": null, "journal-ref": "International Journal of Information and Computing Science (IJICS)\n  in Volume 9, Number 2, pp: 52-67, December 2006", "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evolution of distributed architectures and programming paradigms for\nperformance-oriented program development, challenge the state-of-the-art\ntechnology for performance tools. The area of high performance computing is\nrapidly expanding from single parallel systems to clusters and grids of\nheterogeneous sequential and parallel systems. Performance analysis and tuning\napplications is becoming crucial because it is hardly possible to otherwise\nachieve the optimum performance of any application. The objective of this paper\nis to study the state-of-the-art technology of the existing performance tools\nfor distributed systems. The paper surveys some representative tools from\ndifferent aspects in order to highlight the approaches and technologies used by\nthem.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jun 2010 09:39:45 GMT"}], "update_date": "2010-06-15", "authors_parsed": [["De Sarkar", "Ajanta", ""], ["Mukherjee", "Nandini", ""]]}, {"id": "1006.3009", "submitter": "Stephane Rovedakis", "authors": "L\\'elia Blin (IBISC), Maria Potop-Butucaru (LIP6, INRIA Rocquencourt),\n  Stephane Rovedakis (IBISC), S\\'ebastien Tixeuil (LIP6)", "title": "Universal Loop-Free Super-Stabilization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an univesal scheme to design loop-free and super-stabilizing\nprotocols for constructing spanning trees optimizing any tree metrics (not only\nthose that are isomorphic to a shortest path tree). Our scheme combines a novel\nsuper-stabilizing loop-free BFS with an existing self-stabilizing spanning tree\nthat optimizes a given metric. The composition result preserves the best\nproperties of both worlds: super-stabilization, loop-freedom, and optimization\nof the original metric without any stabilization time penalty. As case study we\napply our composition mechanism to two well known metric-dependent spanning\ntrees: the maximum-flow tree and the minimum degree spanning tree.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jun 2010 15:17:23 GMT"}], "update_date": "2010-07-28", "authors_parsed": [["Blin", "Lélia", "", "IBISC"], ["Potop-Butucaru", "Maria", "", "LIP6, INRIA Rocquencourt"], ["Rovedakis", "Stephane", "", "IBISC"], ["Tixeuil", "Sébastien", "", "LIP6"]]}, {"id": "1006.3141", "submitter": "Stephane Rovedakis", "authors": "L\\'elia Blin (IBISC), Shlomi Dolev, Maria Potop-Butucaru (LIP6, INRIA\n  Rocquencourt), Stephane Rovedakis (IBISC)", "title": "Fast Self-Stabilizing Minimum Spanning Tree Construction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a novel self-stabilizing algorithm for minimum spanning tree (MST)\nconstruction. The space complexity of our solution is $O(\\log^2n)$ bits and it\nconverges in $O(n^2)$ rounds. Thus, this algorithm improves the convergence\ntime of all previously known self-stabilizing asynchronous MST algorithms by a\nmultiplicative factor $\\Theta(n)$, to the price of increasing the best known\nspace complexity by a factor $O(\\log n)$. The main ingredient used in our\nalgorithm is the design, for the first time in self-stabilizing settings, of a\nlabeling scheme for computing the nearest common ancestor with only\n$O(\\log^2n)$ bits.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jun 2010 06:59:36 GMT"}, {"version": "v2", "created": "Wed, 21 Jul 2010 08:33:40 GMT"}], "update_date": "2010-07-26", "authors_parsed": [["Blin", "Lélia", "", "IBISC"], ["Dolev", "Shlomi", "", "LIP6, INRIA\n  Rocquencourt"], ["Potop-Butucaru", "Maria", "", "LIP6, INRIA\n  Rocquencourt"], ["Rovedakis", "Stephane", "", "IBISC"]]}, {"id": "1006.3148", "submitter": "Georg Hager", "authors": "Markus Wittmann, Georg Hager, Jan Treibig, Gerhard Wellein", "title": "Leveraging shared caches for parallel temporal blocking of stencil codes\n  on multicore processors and clusters", "comments": "16 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bandwidth-starved multicore chips have become ubiquitous. It is well known\nthat the performance of stencil codes can be improved by temporal blocking,\nlessening the pressure on the memory interface. We introduce a new pipelined\napproach that makes explicit use of shared caches in multicore environments and\nminimizes synchronization and boundary overhead. Benchmark results are\npresented for three current x86-based microprocessors, showing clearly that our\noptimization works best on designs with high-speed shared caches and low memory\nbandwidth per core. We furthermore demonstrate that simple bandwidth-based\nperformance models are inaccurate for this kind of algorithm and employ a more\nelaborate, synthetic modeling procedure. Finally we show that temporal blocking\ncan be employed successfully in a hybrid shared/distributed-memory environment,\nalbeit with limited benefit at strong scaling.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jun 2010 07:35:38 GMT"}], "update_date": "2010-06-17", "authors_parsed": [["Wittmann", "Markus", ""], ["Hager", "Georg", ""], ["Treibig", "Jan", ""], ["Wellein", "Gerhard", ""]]}, {"id": "1006.3180", "submitter": "Graham Kirby", "authors": "Angus Macdonald, Alan Dearle, Graham Kirby", "title": "H2O: An Autonomic, Resource-Aware Distributed Database System", "comments": "Presented at SICSA PhD Conference 2010 (http://www.sicsaconf.org/)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the design of an autonomic, resource-aware distributed\ndatabase which enables data to be backed up and shared without complex manual\nadministration. The database, H2O, is designed to make use of unused resources\non workstation machines. Creating and maintaining highly-available, replicated\ndatabase systems can be difficult for untrained users, and costly for IT\ndepartments. H2O reduces the need for manual administration by autonomically\nreplicating data and load-balancing across machines in an enterprise.\nProvisioning hardware to run a database system can be unnecessarily costly as\nmost organizations already possess large quantities of idle resources in\nworkstation machines. H2O is designed to utilize this unused capacity by using\nresource availability information to place data and plan queries over\nworkstation machines that are already being used for other tasks. This paper\ndiscusses the requirements for such a system and presents the design and\nimplementation of H2O.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jun 2010 10:46:04 GMT"}], "update_date": "2010-06-17", "authors_parsed": [["Macdonald", "Angus", ""], ["Dearle", "Alan", ""], ["Kirby", "Graham", ""]]}, {"id": "1006.3302", "submitter": "Tobias Friedrich", "authors": "Tobias Friedrich and Martin Gairing and Thomas Sauerwald", "title": "Quasirandom Load Balancing", "comments": "25 pages", "journal-ref": "SIAM Journal on Computing, Vol. 41, No. 4, pp. 747-771, 2012", "doi": "10.1137/100799216", "report-no": null, "categories": "cs.DS cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a simple distributed algorithm for balancing indivisible tokens on\ngraphs. The algorithm is completely deterministic, though it tries to imitate\n(and enhance) a random algorithm by keeping the accumulated rounding errors as\nsmall as possible.\n  Our new algorithm surprisingly closely approximates the idealized process\n(where the tokens are divisible) on important network topologies. On\nd-dimensional torus graphs with n nodes it deviates from the idealized process\nonly by an additive constant. In contrast to that, the randomized rounding\napproach of Friedrich and Sauerwald (2009) can deviate up to Omega(polylog(n))\nand the deterministic algorithm of Rabani, Sinclair and Wanka (1998) has a\ndeviation of Omega(n^{1/d}). This makes our quasirandom algorithm the first\nknown algorithm for this setting which is optimal both in time and achieved\nsmoothness. We further show that also on the hypercube our algorithm has a\nsmaller deviation from the idealized process than the previous algorithms.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jun 2010 19:41:17 GMT"}, {"version": "v2", "created": "Fri, 19 Apr 2013 15:04:12 GMT"}], "update_date": "2013-04-22", "authors_parsed": [["Friedrich", "Tobias", ""], ["Gairing", "Martin", ""], ["Sauerwald", "Thomas", ""]]}, {"id": "1006.3394", "submitter": "Soumya Banerjee", "authors": "Soumya Banerjee and Melanie Moses", "title": "Modular RADAR: An Immune System Inspired Search and Response Strategy\n  for Distributed Systems", "comments": "14 pages, 3 figures, scale invariant detection and response,\n  distributed systems, scale invariant response, scale invariant detection,\n  immune system scaling, modular search, modular architecture, sub-modular\n  architecture, peer-to-peer systems, artificial immune systems, immune system\n  modelling, intrusion detection systems, malware detection systems, mobile\n  ad-hoc networks", "journal-ref": "The 9th International Conference on Artificial Immune Systems\n  (ICARIS) 2010", "doi": null, "report-no": null, "categories": "cs.DC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Natural Immune System (NIS) is a distributed system that solves\nchallenging search and response problems while operating under constraints\nimposed by physical space and resource availability. Remarkably, NIS search and\nresponse times do not scale appreciably with the physical size of the animal in\nwhich its search is conducted. Many distributed systems are engineered to solve\nanalogous problems, and the NIS demonstrates how such engineered systems can\nachieve desirable scalability. We hypothesize that the architecture of the NIS,\ncomposed of a hierarchical decentralized detection network of lymph nodes (LN)\nfacilitates efficient search and response. A sub-modular architecture in which\nLN numbers and size both scale with organism size is shown to efficiently\nbalance tradeoffs between local antigen detection and global antibody\nproduction, leading to nearly scale-invariant detection and response. We\ncharacterize the tradeoffs as balancing local and global communication and show\nthat similar tradeoffs exist in distributed systems like LN inspired artificial\nimmune system (AIS) applications and peer-to-peer (P2P) systems. Taking\ninspiration from the architecture of the NIS, we propose a modular RADAR\n(Robust Adaptive Decentralized search with Automated Response) strategy for\ndistributed systems. We demonstrate how two existing distributed systems (a LN\ninspired multi-robot control application and a P2P system) can be improved by a\nmodular RADAR strategy. Such a sub-modular architecture is shown to balance the\ntradeoffs between local communication (within artificial LNs and P2P clusters)\nand global communication (between artificial LNs and P2P clusters), leading to\nefficient search and response.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2010 07:58:01 GMT"}], "update_date": "2010-06-18", "authors_parsed": [["Banerjee", "Soumya", ""], ["Moses", "Melanie", ""]]}, {"id": "1006.3424", "submitter": "Marco Aldinucci", "authors": "Marco aldinucci, Salvatore Ruggieri, Massimo Torquati", "title": "Porting Decision Tree Algorithms to Multicore using FastFlow", "comments": "18 pages + cover", "journal-ref": "In J. L. Balc\\'azar, F. Bonchi, A. Gionis, and M. Sebag, editors,\n  Proc. of European Conference in Machine Learning and Knowledge Discovery in\n  Databases (ECML PKDD), volume 6321 of LNCS, pages 7-23, Barcelona, Spain,\n  Sept. 2010. Springer", "doi": "10.1007/978-3-642-15880-3_7", "report-no": "TR-10-11", "categories": "cs.DC cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The whole computer hardware industry embraced multicores. For these machines,\nthe extreme optimisation of sequential algorithms is no longer sufficient to\nsqueeze the real machine power, which can be only exploited via thread-level\nparallelism. Decision tree algorithms exhibit natural concurrency that makes\nthem suitable to be parallelised. This paper presents an approach for\neasy-yet-efficient porting of an implementation of the C4.5 algorithm on\nmulticores. The parallel porting requires minimal changes to the original\nsequential code, and it is able to exploit up to 7X speedup on an Intel\ndual-quad core machine.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2010 10:37:43 GMT"}, {"version": "v2", "created": "Sun, 19 Sep 2010 13:51:56 GMT"}], "update_date": "2010-09-21", "authors_parsed": [["aldinucci", "Marco", ""], ["Ruggieri", "Salvatore", ""], ["Torquati", "Massimo", ""]]}, {"id": "1006.3432", "submitter": "Anissa Lamani", "authors": "Anissa Lamani (MIS), Alain Cournier (MIS), Swan Dubois (LIP6, INRIA\n  Rocquencourt), Franck Petit (LIP6), Vincent Villain (MIS)", "title": "Snap-Stabilizing Linear Message Forwarding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present the first snap-stabilizing message forwarding\nprotocol that uses a number of buffers per node being inde- pendent of any\nglobal parameter, that is 4 buffers per link. The protocol works on a linear\nchain of nodes, that is possibly an overlay on a large- scale and dynamic\nsystem, e.g., Peer-to-Peer systems, Grids. . . Provided that the topology\nremains a linear chain and that nodes join and leave \"neatly\", the protocol\ntolerates topology changes. We expect that this protocol will be the base to\nget similar results on more general topologies.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2010 11:22:27 GMT"}], "update_date": "2010-06-18", "authors_parsed": [["Lamani", "Anissa", "", "MIS"], ["Cournier", "Alain", "", "MIS"], ["Dubois", "Swan", "", "LIP6, INRIA\n  Rocquencourt"], ["Petit", "Franck", "", "LIP6"], ["Villain", "Vincent", "", "MIS"]]}, {"id": "1006.3452", "submitter": "Graham Kirby", "authors": "Graham Kirby, Alan Dearle, Stuart Norcross", "title": "Generating a Family of Byzantine Tolerant Protocol Implementations Using\n  a Meta-Model Architecture", "comments": "DSN 2007 Workshop on Architecting Dependable Systems, Edinburgh,\n  Scotland. pp. 178-183", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe an approach to modelling a Byzantine tolerant distributed\nalgorithm as a family of related finite state machines, generated from a single\nmeta-model. Various artefacts are generated from each state machine, including\ndiagrams and source-level protocol implementations. The approach allows a state\nmachine formulation to be applied to problems for which it would not otherwise\nbe suitable, increasing confidence in correctness.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2010 12:46:19 GMT"}], "update_date": "2010-06-18", "authors_parsed": [["Kirby", "Graham", ""], ["Dearle", "Alan", ""], ["Norcross", "Stuart", ""]]}, {"id": "1006.3463", "submitter": "Graham Kirby", "authors": "Andrew McCarthy, Alan Dearle, Graham Kirby", "title": "Applying Constraint Solving to the Management of Distributed\n  Applications", "comments": "Submitted to DOA08", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/08/1", "categories": "cs.DC cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present our approach for deploying and managing distributed\ncomponent-based applications. A Desired State Description (DSD), written in a\nhigh-level declarative language, specifies requirements for a distributed\napplication. Our infrastructure accepts a DSD as input, and from it\nautomatically configures and deploys the distributed application. Subsequent\nviolations of the original requirements are detected and, where possible,\nautomatically rectified by reconfiguration and redeployment of the necessary\napplication components. A constraint solving tool is used to plan deployments\nthat meet the application requirements.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2010 13:35:53 GMT"}], "update_date": "2010-06-18", "authors_parsed": [["McCarthy", "Andrew", ""], ["Dearle", "Alan", ""], ["Kirby", "Graham", ""]]}, {"id": "1006.3465", "submitter": "Graham Kirby", "authors": "Alan Dearle, Graham Kirby, Stuart Norcross", "title": "Hosting Byzantine Fault Tolerant Services on a Chord Ring", "comments": "Submitted to DSN 2007 Workshop on Architecting Dependable Systems", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/07/1", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we demonstrate how stateful Byzantine Fault Tolerant services\nmay be hosted on a Chord ring. The strategy presented is fourfold: firstly a\nreplication scheme that dissociates the maintenance of replicated service state\nfrom ring recovery is developed. Secondly, clients of the ring based services\nare made replication aware. Thirdly, a consensus protocol is introduced that\nsupports the serialization of updates. Finally Byzantine fault tolerant\nreplication protocols are developed that ensure the integrity of service data\nhosted on the ring.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2010 13:40:59 GMT"}], "update_date": "2010-06-18", "authors_parsed": [["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["Norcross", "Stuart", ""]]}, {"id": "1006.3537", "submitter": "Saber Jafarizadeh", "authors": "Saber Jafarizadeh", "title": "Fastest Distributed Consensus Averaging Problem on Chain of Rhombus\n  Networks", "comments": "18 pages, 3 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DC cs.DM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed consensus has appeared as one of the most important and primary\nproblems in the context of distributed computation and it has received renewed\ninterest in the field of sensor networks (due to recent advances in wireless\ncommunications), where solving fastest distributed consensus averaging problem\nover networks with different topologies is one of the primary problems in this\nissue. Here in this work analytical solution for the problem of fastest\ndistributed consensus averaging algorithm over Chain of Rhombus networks is\nprovided, where the solution procedure consists of stratification of associated\nconnectivity graph of the network and semidefinite programming, particularly\nsolving the slackness conditions, where the optimal weights are obtained by\ninductive comparing of the characteristic polynomials initiated by slackness\nconditions. Also characteristic polynomial together with its roots\ncorresponding to eigenvalues of weight matrix including SLEM of network is\ndetermined inductively. Moreover to see the importance of rhombus graphs it is\nindicated that convergence rate of path network increases by replacing a single\nnode by a rhombus sub graph within the path network.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jun 2010 18:20:06 GMT"}], "update_date": "2010-06-18", "authors_parsed": [["Jafarizadeh", "Saber", ""]]}, {"id": "1006.3724", "submitter": "Graham Kirby", "authors": "Alan Dearle, Graham Kirby, Stuart Norcross, Andrew McCarthy", "title": "A Peer-to-Peer Middleware Framework for Resilient Persistent Programming", "comments": "Submitted to EuroSys 2006", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/06/1", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The persistent programming systems of the 1980s offered a programming model\nthat integrated computation and long-term storage. In these systems, reliable\napplications could be engineered without requiring the programmer to write\ntranslation code to manage the transfer of data to and from non-volatile\nstorage. More importantly, it simplified the programmer's conceptual model of\nan application, and avoided the many coherency problems that result from\nmultiple cached copies of the same information. Although technically\ninnovative, persistent languages were not widely adopted, perhaps due in part\nto their closed-world model. Each persistent store was located on a single\nhost, and there were no flexible mechanisms for communication or transfer of\ndata between separate stores. Here we re-open the work on persistence and\ncombine it with modern peer-to-peer techniques in order to provide support for\northogonal persistence in resilient and potentially long-running distributed\napplications. Our vision is of an infrastructure within which an application\ncan be developed and distributed with minimal modification, whereupon the\napplication becomes resilient to certain failure modes. If a node, or the\nconnection to it, fails during execution of the application, the objects are\nre-instantiated from distributed replicas, without their reference holders\nbeing aware of the failure. Furthermore, we believe that this can be achieved\nwithin a spectrum of application programmer intervention, ranging from minimal\nto totally prescriptive, as desired. The same mechanisms encompass an\northogonally persistent programming model. We outline our approach to\nimplementing this vision, and describe current progress.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2010 15:35:50 GMT"}], "update_date": "2010-06-21", "authors_parsed": [["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["Norcross", "Stuart", ""], ["McCarthy", "Andrew", ""]]}, {"id": "1006.3728", "submitter": "Graham Kirby", "authors": "Scott Walker, Alan Dearle, Stuart Norcross, Graham Kirby, Andrew\n  McCarthy", "title": "RAFDA: A Policy-Aware Middleware Supporting the Flexible Separation of\n  Application Logic from Distribution", "comments": "Submitted to EuroSys 2006", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/06/2", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Middleware technologies often limit the way in which object classes may be\nused in distributed applications due to the fixed distribution policies that\nthey impose. These policies permeate applications developed using existing\nmiddleware systems and force an unnatural encoding of application level\nsemantics. For example, the application programmer has no direct control over\ninter-address-space parameter passing semantics. Semantics are fixed by the\ndistribution topology of the application, which is dictated early in the design\ncycle. This creates applications that are brittle with respect to changes in\ndistribution. This paper explores technology that provides control over the\nextent to which inter-address-space communication is exposed to programmers, in\norder to aid the creation, maintenance and evolution of distributed\napplications. The described system permits arbitrary objects in an application\nto be dynamically exposed for remote access, allowing applications to be\nwritten without concern for distribution. Programmers can conceal or expose the\ndistributed nature of applications as required, permitting object placement and\ndistribution boundaries to be decided late in the design cycle and even\ndynamically. Inter-address-space parameter passing semantics may also be\ndecided independently of object implementation and at varying times in the\ndesign cycle, again possibly as late as run-time. Furthermore, transmission\npolicy may be defined on a per-class, per-method or per-parameter basis,\nmaximizing plasticity. This flexibility is of utility in the development of new\ndistributed applications, and the creation of management and monitoring\ninfrastructures for existing applications.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2010 15:39:22 GMT"}], "update_date": "2010-06-21", "authors_parsed": [["Walker", "Scott", ""], ["Dearle", "Alan", ""], ["Norcross", "Stuart", ""], ["Kirby", "Graham", ""], ["McCarthy", "Andrew", ""]]}, {"id": "1006.3732", "submitter": "Graham Kirby", "authors": "Alan Dearle, Graham Kirby, Stuart Norcross, Angus Macdonald, Greg\n  Bigwood", "title": "Towards Adaptable and Adaptive Policy-Free Middleware", "comments": "Submitted to Dependable and Adaptive Distributed Systems Track, ACM\n  SAC 2007", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/06/3", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We believe that to fully support adaptive distributed applications,\nmiddleware must itself be adaptable, adaptive and policy-free. In this paper we\npresent a new language-independent adaptable and adaptive policy framework\nsuitable for integration in a wide variety of middleware systems. This\nframework facilitates the construction of adaptive distributed applications.\nThe framework addresses adaptability through its ability to represent a wide\nrange of specific middleware policies. Adaptiveness is supported by a rich\ncontextual model, through which an application programmer may control precisely\nhow policies should be selected for any particular interaction with the\nmiddleware. A contextual pattern mechanism facilitates the succinct expression\nof both coarse- and fine-grain policy contexts. Policies may be specified and\naltered dynamically, and may themselves take account of dynamic conditions. The\nframework contains no hard-wired policies; instead, all policies can be\nconfigured.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2010 15:47:35 GMT"}], "update_date": "2010-06-21", "authors_parsed": [["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["Norcross", "Stuart", ""], ["Macdonald", "Angus", ""], ["Bigwood", "Greg", ""]]}, {"id": "1006.3739", "submitter": "Graham Kirby", "authors": "Scott Walker, Alan Dearle, Graham Kirby, Stuart Norcross", "title": "Promoting Component Reuse by Separating Transmission Policy from\n  Implementation", "comments": "Submitted to ICDCS 2005", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/05/1", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a methodology and set of tools which assist the\nconstruction of applications from components, by separating the issues of\ntransmission policy from component definition and implementation. This promotes\na greater degree of software reuse than is possible using traditional\nmiddleware environments. Whilst component technologies are usually presented as\na mechanism for promoting reuse, reuse is often limited due to design choices\nthat permeate component implementation. The programmer has no direct control\nover inter-address-space parameter passing semantics: it is fixed by the\ndistributed application's structure, based on the remote accessibility of the\ncomponents. Using traditional middleware tools and environments, the\napplication designer may be forced to use an unnatural encoding of application\nlevel semantics since application parameter passing semantics are tightly\ncoupled with the component deployment topology. This paper describes how\ninter-address-space parameter passing semantics may be decided independently of\ncomponent implementation. Transmission policy may be dynamically defined on a\nper-class, per-method or per-parameter basis.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2010 16:12:58 GMT"}], "update_date": "2010-06-21", "authors_parsed": [["Walker", "Scott", ""], ["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["Norcross", "Stuart", ""]]}, {"id": "1006.3742", "submitter": "Graham Kirby", "authors": "Alan Dearle, Scott Walker, Stuart Norcross, Graham Kirby, Andrew\n  McCarthy", "title": "RAFDA: Middleware Supporting the Separation of Application Logic from\n  Distribution Policy", "comments": "Submitted to Middleware 2005", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/05/3", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Middleware technologies often limit the way in which object classes may be\nused in distributed applications due to the fixed distribution policies imposed\nby the Middleware system. These policies permeate the applications developed\nusing them and force an unnatural encoding of application level semantics. For\nexample, the application programmer has no direct control over\ninter-address-space parameter passing semantics since it is fixed by the\napplication's distribution topology which is dictated early in the design cycle\nby the Middleware. This creates applications that are brittle with respect to\nchanges in the way in which the applications are distributed. This paper\nexplores technology permitting arbitrary objects in an application to be\ndynamically exposed for remote access. Using this, the application can be\nwritten without concern for its distribution with object placement and\ndistribution boundaries decided late in the design cycle and even dynamically.\nInter-address-space parameter passing semantics may also be decided\nindependently of object implementation and at varying times in the design\ncycle, again, possibly as late as run-time. Furthermore, transmission policy\nmay be defined on a per-class, per-method or per-parameter basis maximizing\nplasticity. This flexibility is of utility in the development of new\ndistributed applications and the creation of management and monitoring\ninfrastructures for existing applications.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2010 16:22:10 GMT"}], "update_date": "2010-06-21", "authors_parsed": [["Dearle", "Alan", ""], ["Walker", "Scott", ""], ["Norcross", "Stuart", ""], ["Kirby", "Graham", ""], ["McCarthy", "Andrew", ""]]}, {"id": "1006.3909", "submitter": "Ruo-Wei Hung", "authors": "Ruo-Wei Hung", "title": "Constructing Two Edge-Disjoint Hamiltonian Cycles and Two Equal\n  Node-Disjoint Cycles in Twisted Cubes", "comments": "9 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The hypercube is one of the most popular interconnection networks since it\nhas simple structure and is easy to implement. The $n$-dimensional twisted\ncube, denoted by $TQ_n$, an important variation of the hypercube, possesses\nsome properties superior to the hypercube. Recently, some interesting\nproperties of $TQ_n$ were investigated. In this paper, we construct two\nedge-disjoint Hamiltonian cycles in $TQ_n$ for any odd integer $n\\geqslant 5$.\nThe presence of two edge-disjoint Hamiltonian cycles provides an advantage when\nimplementing two algorithms that require a ring structure by allowing message\ntraffic to be spread evenly across the twisted cube. Furthermore, we construct\ntwo equal node-disjoint cycles in $TQ_n$ for any odd integer $n\\geqslant 3$, in\nwhich these two cycles contain the same number of nodes and every node appears\nin one cycle exactly once. In other words, we decompose a twisted cube into two\ncomponents with the same size such that each component contains a Hamiltonian\ncycle.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jun 2010 05:37:07 GMT"}, {"version": "v2", "created": "Tue, 29 Jun 2010 09:20:23 GMT"}], "update_date": "2010-06-30", "authors_parsed": [["Hung", "Ruo-Wei", ""]]}, {"id": "1006.3919", "submitter": "Ying Cui", "authors": "Ying Cui, Vincent K.N.Lau", "title": "Convergence-Optimal Quantizer Design of Distributed Contraction-based\n  Iterative Algorithms with Quantized Message Passing", "comments": "17 pages, 9 figures, Transaction on Signal Processing, accepted", "journal-ref": null, "doi": "10.1109/TSP.2010.2055861", "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the convergence behavior of distributed iterative\nalgorithms with quantized message passing. We first introduce general iterative\nfunction evaluation algorithms for solving fixed point problems distributively.\nWe then analyze the convergence of the distributed algorithms, e.g. Jacobi\nscheme and Gauss-Seidel scheme, under the quantized message passing. Based on\nthe closed-form convergence performance derived, we propose two quantizer\ndesigns, namely the time invariant convergence-optimal quantizer (TICOQ) and\nthe time varying convergence-optimal quantizer (TVCOQ), to minimize the effect\nof the quantization error on the convergence. We also study the tradeoff\nbetween the convergence error and message passing overhead for both TICOQ and\nTVCOQ. As an example, we apply the TICOQ and TVCOQ designs to the iterative\nwaterfilling algorithm of MIMO interference game.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jun 2010 08:32:16 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Cui", "Ying", ""], ["Lau", "Vincent K. N.", ""]]}, {"id": "1006.4342", "submitter": "Dusko Pavlovic", "authors": "Dusko Pavlovic and Peter Pepper and Douglas R. Smith", "title": "Formal Derivation of Concurrent Garbage Collectors", "comments": "38 pages, 21 figures. The short version of this paper appeared in the\n  Proceedings of MPC 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Concurrent garbage collectors are notoriously difficult to implement\ncorrectly. Previous approaches to the issue of producing correct collectors\nhave mainly been based on posit-and-prove verification or on the application of\ndomain-specific templates and transformations. We show how to derive the upper\nreaches of a family of concurrent garbage collectors by refinement from a\nformal specification, emphasizing the application of domain-independent design\ntheories and transformations. A key contribution is an extension to the\nclassical lattice-theoretic fixpoint theorems to account for the dynamics of\nconcurrent mutation and collection.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jun 2010 18:08:19 GMT"}], "update_date": "2010-06-23", "authors_parsed": [["Pavlovic", "Dusko", ""], ["Pepper", "Peter", ""], ["Smith", "Douglas R.", ""]]}, {"id": "1006.4504", "submitter": "Graham Kirby", "authors": "Scott Walker, Alan Dearle, Graham Kirby, Stuart Norcross", "title": "Exposing Application Components as Web Services", "comments": "Submitted to SAC05", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/04/3", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper explores technology permitting arbitrary application components to\nbe exposed for remote access from other software. Using this, the application\nand its constituent components can be written without concern for its\ndistribution. Software running in different address spaces, on different\nmachines, can perform operations on the remotely accessible components. This is\nof utility in the creation of distributed applications and in permitting tools\nsuch as debuggers, component browsers, observers or remote probes access to\napplication components. Current middleware systems do not allow arbitrary\nexposure of application components: instead, the programmer is forced to decide\nstatically which classes of component will support remote accessibility. In the\nwork described here, arbitrary components of any class can be dynamically\nexposed via Web Services. Traditional Web Services are extended with a remote\nreference scheme. This extension permits application components to be invoked\nusing either the traditional pass-by-value semantics supported by Web Services\nor pass-by-reference semantics. The latter permits the preservation of local\ncall semantics across address space boundaries.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 12:59:19 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Walker", "Scott", ""], ["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["Norcross", "Stuart", ""]]}, {"id": "1006.4549", "submitter": "Graham Kirby", "authors": "Alan Dearle, Graham Kirby, Andrew McCarthy, Juan-Carlos Diaz y\n  Carballo", "title": "A Flexible and Secure Deployment Framework for Distributed Applications", "comments": "2nd International Working Conference on Component Deployment (CD\n  2004), Edinburgh, Scotland", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes an implemented system which is designed to support the\ndeployment of applications offering distributed services, comprising a number\nof distributed components. This is achieved by creating high level placement\nand topology descriptions which drive tools that deploy applications consisting\nof components running on multiple hosts. The system addresses issues of\nheterogeneity by providing abstractions over host-specific attributes yielding\na homogeneous run-time environment into which components may be deployed. The\nrun-time environments provide secure binding mechanisms that permit deployed\ncomponents to bind to stored data and services on the hosts on which they are\nrunning.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 15:07:26 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["McCarthy", "Andrew", ""], ["Carballo", "Juan-Carlos Diaz y", ""]]}, {"id": "1006.4572", "submitter": "Graham Kirby", "authors": "Alan Dearle, Graham Kirby, Andrew McCarthy", "title": "A Framework for Constraint-Based Deployment and Autonomic Management of\n  Distributed Applications", "comments": "Submitted to ICAC-04", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/04/1", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a framework for deployment and subsequent autonomic management of\ncomponent-based distributed applications. An initial deployment goal is\nspecified using a declarative constraint language, expressing constraints over\naspects such as component-host mappings and component interconnection topology.\nA constraint solver is used to find a configuration that satisfies the goal,\nand the configuration is deployed automatically. The deployed application is\ninstrumented to allow subsequent autonomic management. If, during execution,\nthe manager detects that the original goal is no longer being met, the\nsatisfy/deploy process can be repeated automatically in order to generate a\nrevised deployment that does meet the goal.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 15:28:42 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["McCarthy", "Andrew", ""]]}, {"id": "1006.4708", "submitter": "Siamak Sarmady", "authors": "Siamak Sarmady", "title": "A Survey on Peer-to-Peer and DHT", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed systems with different levels of dependence to central services\nhave been designed and used during recent years. Pure peer-to-peer systems\namong distributed systems have no dependence on a central resource. DHT is one\nof the main techniques behind these systems resulting into failure tolerant\nsystems which are also able to isolate continuous changes to the network to a\nsmall section of it and therefore making it possible to scale up such networks\nto millions of nodes. This survey takes a look at P2P in general and DHT\nalgorithms and implementations in more detail.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2010 07:56:26 GMT"}], "update_date": "2010-06-25", "authors_parsed": [["Sarmady", "Siamak", ""]]}, {"id": "1006.4730", "submitter": "Graham Kirby", "authors": "Alan Dearle, Graham Kirby, Andrew McCarthy", "title": "A Framework for Constraint-Based Deployment and Autonomic Management of\n  Distributed Applications (Extended Abstract)", "comments": "1st International Conference on Autonomic Computing (ICAC'04)\n  pp.300-301, IEEE Computer Society, 2004", "journal-ref": null, "doi": "10.1109/ICAC.2004.3", "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a framework for the deployment and subsequent autonomic management\nof component-based distributed applications. An initial deployment goal is\nspecified using a declarative constraint language, expressing constraints over\naspects such as component-host mappings and component interconnection topology.\nA constraint solver is used to find a configuration that satisfies the goal,\nand the configuration is deployed automatically. The deployed application is\ninstrumented to allow subsequent autonomic management. If, during execution,\nthe manager detects that the original goal is no longer being met, the\nsatisfy/deploy process can be repeated automatically in order to generate a\nrevised deployment that does meet the goal.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2010 09:44:38 GMT"}], "update_date": "2010-06-25", "authors_parsed": [["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["McCarthy", "Andrew", ""]]}, {"id": "1006.4733", "submitter": "Graham Kirby", "authors": "Alan Dearle, Graham Kirby, Andrew McCarthy", "title": "A Middleware Framework for Constraint-Based Deployment and Autonomic\n  Management of Distributed Applications", "comments": "Submitted to Middleware 04", "journal-ref": null, "doi": null, "report-no": "University of St Andrews CS/04/2", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a middleware framework for deployment and subsequent autonomic\nmanagement of component-based distributed applications. An initial deployment\ngoal is specified using a declarative constraint language, expressing\nconstraints over aspects such as component-host mappings and component\ninterconnection topology. A constraint solver is used to find a configuration\nthat satisfies the goal, and the configuration is deployed automatically. The\ndeployed application is instrumented to allow subsequent autonomic management.\nIf, during execution, the manager detects that the original goal is no longer\nbeing met, the satisfy/deploy process can be repeated automatically in order to\ngenerate a revised deployment that does meet the goal.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2010 09:53:35 GMT"}], "update_date": "2010-06-25", "authors_parsed": [["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["McCarthy", "Andrew", ""]]}, {"id": "1006.4746", "submitter": "Graham Kirby", "authors": "Graham Kirby, Alan Dearle, Ron Morrison, Mark Dunlop, Richard Connor,\n  Paddy Nixon", "title": "Active Architecture for Pervasive Contextual Services", "comments": "International Workshop on Middleware for Pervasive and Ad-hoc\n  Computing (MPAC 2003), ACM/IFIP/USENIX International Middleware Conference\n  (Middleware 2003), Rio de Janeiro, Brazil", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pervasive services may be defined as services that are available \"to any\nclient (anytime, anywhere)\". Here we focus on the software and network\ninfrastructure required to support pervasive contextual services operating over\na wide area. One of the key requirements is a matching service capable of\nas-similating and filtering information from various sources and determining\nmatches relevant to those services. We consider some of the challenges in\nengineering a globally distributed matching service that is scalable,\nmanageable, and able to evolve incrementally as usage patterns, data formats,\nservices, network topologies and deployment technologies change. We outline an\napproach based on the use of a peer-to-peer architecture to distribute user\nevents and data, and to support the deployment and evolution of the\ninfrastructure itself.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2010 11:03:00 GMT"}], "update_date": "2010-06-25", "authors_parsed": [["Kirby", "Graham", ""], ["Dearle", "Alan", ""], ["Morrison", "Ron", ""], ["Dunlop", "Mark", ""], ["Connor", "Richard", ""], ["Nixon", "Paddy", ""]]}, {"id": "1006.4827", "submitter": "Graham Kirby", "authors": "Alan Dearle, Graham Kirby, Ron Morrison, Andrew McCarthy, Kevin\n  Mullen, Yanyan Yang, Richard Connor, Paula Welen, Andy Wilson", "title": "Architectural Support for Global Smart Spaces", "comments": "4th International Conference on Mobile Data Management (MDM 2003)", "journal-ref": null, "doi": "10.1007/3-540-36389-0_11", "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A GLObal Smart Space (GLOSS) provides support for interaction amongst people,\nartefacts and places while taking account of both context and movement on a\nglobal scale. Crucial to the definition of a GLOSS is the provision of a set of\nlocation-aware services that detect, convey, store and exploit location\ninformation. We use one of these services, hearsay, to illustrate the\nimplementation dimensions of a GLOSS. The focus of the paper is on both local\nand global software architecture to support the implementation of such\nservices. The local architecture is based on XML pipe-lines and is used to\nconstruct location-aware components. The global architecture is based on a\nhybrid peer-to-peer routing scheme and provides the local architectures with\nthe means to communicate in the global context.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2010 16:27:03 GMT"}], "update_date": "2010-06-25", "authors_parsed": [["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["Morrison", "Ron", ""], ["McCarthy", "Andrew", ""], ["Mullen", "Kevin", ""], ["Yang", "Yanyan", ""], ["Connor", "Richard", ""], ["Welen", "Paula", ""], ["Wilson", "Andy", ""]]}, {"id": "1006.4860", "submitter": "Bruce Berriman", "authors": "G. Bruce Berriman, Ewa Deelman, Paul Groth, and Gideon Juve", "title": "The Application of Cloud Computing to the Creation of Image Mosaics and\n  Management of Their Provenance", "comments": "15 pages, 3 figure", "journal-ref": "SPIE Conference 7740: Software and Cyberinfrastructure for\n  Astronomy (2010)", "doi": "10.1117/12.856486", "report-no": null, "categories": "astro-ph.IM cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have used the Montage image mosaic engine to investigate the cost and\nperformance of processing images on the Amazon EC2 cloud, and to inform the\nrequirements that higher-level products impose on provenance management\ntechnologies. We will present a detailed comparison of the performance of\nMontage on the cloud and on the Abe high performance cluster at the National\nCenter for Supercomputing Applications (NCSA). Because Montage generates many\nintermediate products, we have used it to understand the science requirements\nthat higher-level products impose on provenance management technologies. We\ndescribe experiments with provenance management technologies such as the\n\"Provenance Aware Service Oriented Architecture\" (PASOA).\n", "versions": [{"version": "v1", "created": "Thu, 24 Jun 2010 18:40:24 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Berriman", "G. Bruce", ""], ["Deelman", "Ewa", ""], ["Groth", "Paul", ""], ["Juve", "Gideon", ""]]}, {"id": "1006.4900", "submitter": "James Fix", "authors": "R. Seth Terashima and James D. Fix", "title": "Optimal Degree Distributions for Uniform Small World Rings", "comments": "9 pages, 10 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by Kleinberg's (2000) and subsequent work, we consider the\nperformance of greedy routing on a directed ring of $n$ nodes augmented with\nlong-range contacts. In this model, each node $u$ is given an additional $D_u$\nedges, a degree chosen from a specified probability distribution. Each such\nedge from $u$ is linked to a random node at distance $r$ ahead in the ring with\nprobability proportional to $1/r$, a \"harmonic\" distance distribution of\ncontacts. Aspnes et al. (2002) have shown an $O(\\log^2 n / \\ell)$ bound on the\nexpected length of greedy routes in the case when each node is assigned exactly\n$\\ell$ contacts and, as a consequence of recent work by Dietzfelbinger and\nWoelfel (2009), this bound is known to be tight. In this paper, we generalize\nAspnes' upper bound to show that any degree distribution with mean $\\ell$ and\nmaximum value $O(\\log n)$ has greedy routes of expected length $O(\\log^2n /\n\\ell)$, implying that any harmonic ring in this family is asymptotically\noptimal. Furthermore, for a more general family of rings, we show that a fixed\ndegree distribution is optimal. More precisely, if each random contact is\nchosen at distance $r$ with a probability that decreases with $r$, then among\ndegree distributions with mean $\\ell$, greedy routing time is smallest when\nevery node is assigned $\\floor{\\ell}$ or $\\ceiling{\\ell}$ contacts.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2010 02:14:57 GMT"}, {"version": "v2", "created": "Tue, 3 Aug 2010 22:09:41 GMT"}], "update_date": "2010-08-05", "authors_parsed": [["Terashima", "R. Seth", ""], ["Fix", "James D.", ""]]}, {"id": "1006.4943", "submitter": "Adrien Pi\\'erard", "authors": "Adrien Pi\\'erard and Eijiro Sumii", "title": "Sound Bisimulations for Higher-Order Distributed Process Calculus", "comments": "15 pages, uses mathpartir and tikz, appendix at\n  [http://www.kb.ecei.tohoku.ac.jp/~adrien/pubs/SoundAppendix.pdf], the final\n  publication is available at\n  [http://www.springerlink.com/content/071k46u248061x72/]", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.DC cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While distributed systems with transfer of processes have become pervasive,\nmethods for reasoning about their behaviour are underdeveloped. In this paper\nwe propose a bisimulation technique for proving behavioural equivalence of such\nsystems modelled in the \\emph{higher-order $\\pi$-calculus with passivation}\n(and restriction). Previous research for this calculus is limited to context\nbisimulations and normal bisimulations which are either impractical or unsound.\nIn contrast, we provide a sound and useful definition of \\emph{environmental\nbisimulations}, with several non-trivial examples. Technically, a central point\nin our bisimulations is the clause for parallel composition, which must account\nfor passivation of the spawned processes in the middle of their execution.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2010 09:32:27 GMT"}, {"version": "v2", "created": "Fri, 6 May 2011 10:37:23 GMT"}], "update_date": "2011-05-09", "authors_parsed": [["Piérard", "Adrien", ""], ["Sumii", "Eijiro", ""]]}, {"id": "1006.4990", "submitter": "Danny Bickson", "authors": "Yucheng Low and Joseph Gonzalez and Aapo Kyrola and Danny Bickson and\n  Carlos Guestrin and Joseph M. Hellerstein", "title": "GraphLab: A New Framework for Parallel Machine Learning", "comments": null, "journal-ref": "The 26th Conference on Uncertainty in Artificial Intelligence (UAI\n  2010), Catalina Island, California, July 8-11, 2010", "doi": null, "report-no": null, "categories": "cs.LG cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing and implementing efficient, provably correct parallel machine\nlearning (ML) algorithms is challenging. Existing high-level parallel\nabstractions like MapReduce are insufficiently expressive while low-level tools\nlike MPI and Pthreads leave ML experts repeatedly solving the same design\nchallenges. By targeting common patterns in ML, we developed GraphLab, which\nimproves upon abstractions like MapReduce by compactly expressing asynchronous\niterative algorithms with sparse computational dependencies while ensuring data\nconsistency and achieving a high degree of parallel performance. We demonstrate\nthe expressiveness of the GraphLab framework by designing and implementing\nparallel versions of belief propagation, Gibbs sampling, Co-EM, Lasso and\nCompressed Sensing. We show that using GraphLab we can achieve excellent\nparallel performance on large scale real-world problems.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2010 13:23:48 GMT"}], "update_date": "2010-06-28", "authors_parsed": [["Low", "Yucheng", ""], ["Gonzalez", "Joseph", ""], ["Kyrola", "Aapo", ""], ["Bickson", "Danny", ""], ["Guestrin", "Carlos", ""], ["Hellerstein", "Joseph M.", ""]]}, {"id": "1006.5038", "submitter": "Mugurel Ionut Andreica", "authors": "Mugurel Ionut Andreica, Nicolae Tapus", "title": "Algorithmic Solutions for Several Offline Constrained Resource\n  Processing and Data Transfer Multicriteria Optimization Problems", "comments": null, "journal-ref": "Scalable Computing: Practice and Experience, vol. 11, no. 1, pp.\n  1-17, 2010. (ISSN: 1895-1767)", "doi": null, "report-no": null, "categories": "cs.DS cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present novel algorithmic solutions for several resource\nprocessing and data transfer multicriteria optimization problems. The results\nof most of the presented techniques are strategies which solve the considered\nproblems (almost) optimally. Thus, the developed algorithms construct\nintelligent strategies which can be implemented by agents in specific\nsituations. All the described solutions make use of the properties of the\nconsidered problems and, thus, they are not applicable to a very general class\nof problems. However, by considering the specific details of each problem, we\nwere able to obtain very efficient results.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jun 2010 18:44:59 GMT"}], "update_date": "2010-06-28", "authors_parsed": [["Andreica", "Mugurel Ionut", ""], ["Tapus", "Nicolae", ""]]}, {"id": "1006.5097", "submitter": "EPTCS", "authors": "Alessandro Bianco (University of Naples, Italy), Marco Faella\n  (University of Naples, Italy), Fabio Mogavero (University of Naples, Italy),\n  Aniello Murano (University of Naples, Italy)", "title": "Quantitative Fairness Games", "comments": null, "journal-ref": "EPTCS 28, 2010, pp. 48-63", "doi": "10.4204/EPTCS.28.4", "report-no": null, "categories": "cs.GT cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider two-player games played on finite colored graphs where the goal\nis the construction of an infinite path with one of the following\nfrequency-related properties: (i) all colors occur with the same asymptotic\nfrequency, (ii) there is a constant that bounds the difference between the\noccurrences of any two colors for all prefixes of the path, or (iii) all colors\noccur with a fixed asymptotic frequency.\n  These properties can be viewed as quantitative refinements of the classical\nnotion of fair path in a concurrent system, whose simplest form checks whether\nall colors occur infinitely often. In particular, the first two properties\nenforce equal treatment of all the jobs involved in the system, while the third\none represents a way to assign a given priority to each job. For all the above\ngoals, we show that the problem of checking whether there exists a winning\nstrategy is CoNP-complete.\n", "versions": [{"version": "v1", "created": "Sat, 26 Jun 2010 03:03:15 GMT"}], "update_date": "2010-06-29", "authors_parsed": [["Bianco", "Alessandro", "", "University of Naples, Italy"], ["Faella", "Marco", "", "University of Naples, Italy"], ["Mogavero", "Fabio", "", "University of Naples, Italy"], ["Murano", "Aniello", "", "University of Naples, Italy"]]}, {"id": "1006.5104", "submitter": "EPTCS", "authors": "Anton Stefanek (Imperial College London), Richard Hayden (Imperial\n  College London), Jeremy Bradley (Imperial College London)", "title": "A new tool for the performance analysis of massively parallel computer\n  systems", "comments": null, "journal-ref": "EPTCS 28, 2010, pp. 159-181", "doi": "10.4204/EPTCS.28.11", "report-no": null, "categories": "cs.PF cs.DC cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new tool, GPA, that can generate key performance measures for\nvery large systems. Based on solving systems of ordinary differential equations\n(ODEs), this method of performance analysis is far more scalable than\nstochastic simulation. The GPA tool is the first to produce higher moment\nanalysis from differential equation approximation, which is essential, in many\ncases, to obtain an accurate performance prediction. We identify so-called\nswitch points as the source of error in the ODE approximation. We investigate\nthe switch point behaviour in several large models and observe that as the\nscale of the model is increased, in general the ODE performance prediction\nimproves in accuracy. In the case of the variance measure, we are able to\njustify theoretically that in the limit of model scale, the ODE approximation\ncan be expected to tend to the actual variance of the model.\n", "versions": [{"version": "v1", "created": "Sat, 26 Jun 2010 03:03:55 GMT"}], "update_date": "2010-06-29", "authors_parsed": [["Stefanek", "Anton", "", "Imperial College London"], ["Hayden", "Richard", "", "Imperial\n  College London"], ["Bradley", "Jeremy", "", "Imperial College London"]]}, {"id": "1006.5309", "submitter": "Toralf Kirsten", "authors": "Toralf Kirsten, Lars Kolb, Michael Hartung, Anika Gro{\\ss}, Hanna\n  K\\\"opcke, Erhard Rahm", "title": "Data Partitioning for Parallel Entity Matching", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Entity matching is an important and difficult step for integrating web data.\nTo reduce the typically high execution time for matching we investigate how we\ncan perform entity matching in parallel on a distributed infrastructure. We\npropose different strategies to partition the input data and generate multiple\nmatch tasks that can be independently executed. One of our strategies supports\nboth, blocking to reduce the search space for matching and parallel matching to\nimprove efficiency. Special attention is given to the number and size of data\npartitions as they impact the overall communication overhead and memory\nrequirements of individual match tasks. We have developed a service-based\ndistributed infrastructure for the parallel execution of match workflows. We\nevaluate our approach in detail for different match strategies for matching\nreal-world product data of different web shops. We also consider caching of\nin-put entities and affinity-based scheduling of match tasks.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jun 2010 10:25:53 GMT"}], "update_date": "2010-06-29", "authors_parsed": [["Kirsten", "Toralf", ""], ["Kolb", "Lars", ""], ["Hartung", "Michael", ""], ["Groß", "Anika", ""], ["Köpcke", "Hanna", ""], ["Rahm", "Erhard", ""]]}, {"id": "1006.5376", "submitter": "Mark Stillwell", "authors": "Mark Stillwell and David Schanzenbach and Fr\\'ed\\'eric Vivien and\n  Henri Casanova", "title": "Resource Allocation using Virtual Clusters", "comments": "University of Hawai'i at M{\\=a}noa Department of Information and\n  Computer Sciences Technical Report", "journal-ref": null, "doi": null, "report-no": "ICS2008-09-01", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this report we demonstrate the potential utility of resource allocation\nmanagement systems that use virtual machine technology for sharing parallel\ncomputing resources among competing jobs. We formalize the resource allocation\nproblem with a number of underlying assumptions, determine its complexity,\npropose several heuristic algorithms to find near-optimal solutions, and\nevaluate these algorithms in simulation. We find that among our algorithms one\nis very efficient and also leads to the best resource allocations. We then\ndescribe how our approach can be made more general by removing several of the\nunderlying assumptions.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jun 2010 15:28:43 GMT"}], "update_date": "2010-06-29", "authors_parsed": [["Stillwell", "Mark", ""], ["Schanzenbach", "David", ""], ["Vivien", "Frédéric", ""], ["Casanova", "Henri", ""]]}, {"id": "1006.5572", "submitter": "Hiroaki Inoue", "authors": "Hiroaki Inoue", "title": "A Multi-Core Processor Platform for Open Embedded Systems", "comments": "A dissertation presented to the graduate school of science and\n  technology of Keio University in candidacy for the degree of Doctor of\n  Philosophy in Engineering, September 2009", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent proliferation of embedded systems has generated a bold new paradigm,\nknown as open embedded systems. While traditional embedded systems provide only\nclosed base applications (natively-installed software) to users, open embedded\nsystems allow the users to freely execute open applications\n(additionally-installed software) in order to meet various user requirements,\nsuch as user personalization and device coordination. Key to the success of\nplatforms required for open embedded systems is the achievement of both the\nscalable extension of base applications and the secure execution of open\napplications. Most existing platforms, however, have focused on either scalable\nor secure execution, limiting their applicability. This dissertation presents a\nnew secure platform using multi-core processors, which achieves both\nscalability and security. Four techniques feature the new platform: (1)\nseamless communication, by which legacy applications designed for a single\nprocessor make it possible to be executed on multiple processors without any\nsoftware modifications; (2) secure processor partitioning with hardware\nsupport, by which Operating Systems (OSs) required for base and open\napplications are securely executed on separate processors; (3) asymmetric\nvirtualization, by which many OSs over the number of processors are securely\nexecuted under secure processor partitioning; and (4) secure dynamic\npartitioning, by which the number of processors allocated to individual OSs\nmakes it possible to be dynamically changed under secure processor\npartitioning.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2010 11:35:55 GMT"}], "update_date": "2010-06-30", "authors_parsed": [["Inoue", "Hiroaki", ""]]}, {"id": "1006.5643", "submitter": "Graham Kirby", "authors": "\\'Alvaro Reb\\'on Portillo, Scott Walker, Graham Kirby, Alan Dearle", "title": "A Reflective Approach to Providing Flexibility in Application\n  Distribution", "comments": "2nd International Workshop on Reflective and Adaptive Middleware,\n  ACM/IFIP/USENIX International Middleware Conference (Middleware 2003), Rio de\n  Janeiro, Brazil, pp.95-99", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current middleware systems suffer from drawbacks. Often one is forced to make\ndecisions early in the design process about which classes may participate in\ninter-machine communication. Further, application level and middleware specific\nsemantics cannot be separated forcing an unnatural design. The RAFDA project\nproposes to adress these deficiencies by creating an adaptive, reflective\nframework that enables the transformation of non-distributed applications into\nisomorphic applications whose distribution architecture is flexible. This paper\ndescribes the code transformation techniques that have been developed as part\nof the project. The system enables the distribution of a program according to a\nflexible configuration without user intervention. Proxy objects can then be\nsubstituted, permitting cross-address space communication. The distributed\nprogram can adapt to its environment by dynamically altering its distribution\nboundaries.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2010 14:57:44 GMT"}], "update_date": "2010-06-30", "authors_parsed": [["Portillo", "Álvaro Rebón", ""], ["Walker", "Scott", ""], ["Kirby", "Graham", ""], ["Dearle", "Alan", ""]]}, {"id": "1006.5661", "submitter": "Graham Kirby", "authors": "Joelle Coutaz, Alan Dearle, Sophie Dupuy-Chessa, Graham Kirby,\n  Christophe Lachenal, Ron Morrison, Gaetan Rey, Evangelos Zirintsis", "title": "Working Document on Gloss Ontology", "comments": null, "journal-ref": null, "doi": null, "report-no": "Global Smart Spaces Project IST-2000-26070 Report D9.2", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This document describes the Gloss Ontology. The ontology and associated class\nmodel are organised into several packages. Section 2 describes each package in\ndetail, while Section 3 contains a summary of the whole ontology.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2010 15:59:22 GMT"}], "update_date": "2010-06-30", "authors_parsed": [["Coutaz", "Joelle", ""], ["Dearle", "Alan", ""], ["Dupuy-Chessa", "Sophie", ""], ["Kirby", "Graham", ""], ["Lachenal", "Christophe", ""], ["Morrison", "Ron", ""], ["Rey", "Gaetan", ""], ["Zirintsis", "Evangelos", ""]]}, {"id": "1006.5877", "submitter": "Zohir Bouzid", "authors": "Zohir Bouzid (LIP6), Shlomi Dolev, Maria Potop-Butucaru (LIP6, INRIA\n  Rocquencourt), S\\'ebastien Tixeuil (LIP6)", "title": "RoboCast: Asynchronous Communication in Robot Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces the \\emph{RoboCast} communication abstraction. The\nRoboCast allows a swarm of non oblivious, anonymous robots that are only\nendowed with visibility sensors and do not share a common coordinate system, to\nasynchronously exchange information. We propose a generic framework that covers\na large class of asynchronous communication algorithms and show how our\nframework can be used to implement fundamental building blocks in robot\nnetworks such as gathering or stigmergy. In more details, we propose a RoboCast\nalgorithm that allows robots to broadcast their local coordinate systems to\neach others. Our algorithm is further refined with a local collision avoidance\nscheme. Then, using the RoboCast primitive, we propose algorithms for\ndeterministic asynchronous gathering and binary information exchange.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jun 2010 15:07:28 GMT"}, {"version": "v2", "created": "Thu, 23 Sep 2010 09:59:58 GMT"}], "update_date": "2010-09-24", "authors_parsed": [["Bouzid", "Zohir", "", "LIP6"], ["Dolev", "Shlomi", "", "LIP6, INRIA\n  Rocquencourt"], ["Potop-Butucaru", "Maria", "", "LIP6, INRIA\n  Rocquencourt"], ["Tixeuil", "Sébastien", "", "LIP6"]]}, {"id": "1006.5940", "submitter": "Graham Kirby", "authors": "Alan Dearle, Graham Kirby, Andrew McCarthy, Juan-Carlos Diaz y\n  Carballo", "title": "An Information Flow Architecture for Global Smart Spaces", "comments": null, "journal-ref": null, "doi": null, "report-no": "Global Smart Spaces Project IST-2000-26070 Report D15", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we describe an architecture which: Permits the deployment and\nexecution of components in appropriate geographical locations. Provides\nsecurity mechanisms that prevent misuse of the architecture. Supports a\nprogramming model that is familiar to application programmers. Permits\ninstalled components to share data. Permits the deployed components to\ncommunicate via communication channels. Provides evolution mechanisms\npermitting the dynamic rearrangement of inter-connection topologies the\ncomponents that they connect. Supports the specification and deployment of\ndistributed component deployments.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2010 14:32:01 GMT"}], "update_date": "2010-07-01", "authors_parsed": [["Dearle", "Alan", ""], ["Kirby", "Graham", ""], ["McCarthy", "Andrew", ""], ["Carballo", "Juan-Carlos Diaz y", ""]]}, {"id": "1006.5941", "submitter": "Graham Kirby", "authors": "Evangelos Zirintsis, Graham Kirby, Alan Dearle, Ben Allen, Rob\n  MacInnis, Andrew McCarthy, Ron Morrison, Paddy Nixon, Andrew Jamieson, Chris\n  Nicholson, Steven Harris", "title": "Second Set of Spaces", "comments": null, "journal-ref": null, "doi": null, "report-no": "Global Smart Spaces Project IST-2000-26070 Report D11", "categories": "cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This document describes the Gloss infrastructure supporting implementation of\nlocation-aware services. The document is in two parts. The first part describes\nsoftware architecture for the smart space. As described in D8, a local\narchitecture provides a framework for constructing Gloss applications, termed\nassemblies, that run on individual physical nodes, whereas a global\narchitecture defines an overlay network for linking individual assemblies. The\nsecond part outlines the hardware installation for local sensing. This\ndescribes the first phase of the installation in Strathclyde University.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jun 2010 15:53:53 GMT"}], "update_date": "2010-07-01", "authors_parsed": [["Zirintsis", "Evangelos", ""], ["Kirby", "Graham", ""], ["Dearle", "Alan", ""], ["Allen", "Ben", ""], ["MacInnis", "Rob", ""], ["McCarthy", "Andrew", ""], ["Morrison", "Ron", ""], ["Nixon", "Paddy", ""], ["Jamieson", "Andrew", ""], ["Nicholson", "Chris", ""], ["Harris", "Steven", ""]]}]