[{"id": "1301.1261", "submitter": "Purushothaman S", "authors": "M. Suresh, Maheswar Dutta, and S. Purushothaman", "title": "Application of polynomial vector (pv) processing to improve the\n  estimation performance of bio diesel in variable compression ratio diesel\n  engine", "comments": "8 pages, 15 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper presents the implementation of polynomial vector back propagation\nalgorithm (PVBPA) for estimating the power, torque, specific fuel consumption\nand presence of carbon monoxide, hydrocarbons in the emission of a direct\ninjection diesel engine. Experimental readings were obtained using the\nbiodiesel prepared form the waste low quality cooking oil collected from the\ncanteen of Sri Sairam Engineering College, India.. This waste cooking oil was\ndue to the preparation of varieties of food (vegetables fried and non\nvegetarian). Over more than a week, trans esterification was done in chemical\nlab and the biodiesel was obtained. The biodiesel was mixed in proportions of\n10%, 20%, 30%, 40%, 50% with remaining combinations of the diesel supplied by\nthe Indian government. Variable compression ratio (VCR) diesel engine with\nsingle cylinder, four stroke diesel type was used. The outputs of the engine as\npower, torque and specific fuel consumption were obtained from the\ncomputational facility attached to the engine. The data collected for different\ninput conditions of the engine was further used to train (PVBPA). The trained\nPVBPA network was further used to predict the power, torque and brake specific\nfuel consumption (SFC) for different speed, biodiesel and diesel combinations\nand full load condition. The estimation performance of the PVBPA network is\ndiscussed.\n", "versions": [{"version": "v1", "created": "Mon, 17 Dec 2012 02:53:01 GMT"}], "update_date": "2013-01-08", "authors_parsed": [["Suresh", "M.", ""], ["Dutta", "Maheswar", ""], ["Purushothaman", "S.", ""]]}, {"id": "1301.2780", "submitter": "Joydeep Basu", "authors": "Joydeep Basu and Tarun Kanti Bhattacharyya", "title": "Microelectromechanical Resonators for Radio Frequency Communication\n  Applications", "comments": null, "journal-ref": "Microsystem Technologies, Oct 2011, vol. 17(10-11), pp. 1557-1580", "doi": "10.1007/s00542-011-1332-9", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the past few years, microelectromechanical system (MEMS) based on-chip\nresonators have shown significant potential for sensing and high frequency\nsignal processing applications. This is due to their excellent features like\nsmall size, large frequency-quality factor product, low power consumption, low\ncost batch fabrication, and integrability with CMOS IC technology. Radio\nfrequency communication circuits like reference oscillators, filters, and\nmixers based on such MEMS resonators can be utilized for meeting the increasing\ncount of RF components likely to be demanded by the next generation\nmulti-band/multi-mode wireless devices. MEMS resonators can provide a feasible\nalternative to the present day well established quartz crystal technology that\nis riddled with major drawbacks like relatively large size, high cost, and low\ncompatibility with IC chips. This article presents a survey of the developments\nin this field of resonant MEMS structures with detailed enumeration on the\nvarious micromechanical resonator types, modes of vibration, equivalent\nmechanical and electrical models, materials and technologies used for\nfabrication, and the application of the resonators for implementing oscillators\nand filters. These are followed by a discussion on the challenges for RF MEMS\ntechnology in comparison to quartz crystal technology; like high precision,\nstability, reliability, need for hermetic packaging etc. which remain to be\naddressed for enabling the inclusion of micromechanical resonators into\ntomorrow's highly integrated communication systems.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jan 2013 14:38:35 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Basu", "Joydeep", ""], ["Bhattacharyya", "Tarun Kanti", ""]]}, {"id": "1301.2858", "submitter": "Abhishek Jain", "authors": "Abhishek Jain, Giuseppe Bonanno, Hima Gupta and Ajay Goyal", "title": "Generic System Verilog Universal Verification Methodology based Reusable\n  Verification Environment for Efficient Verification of Image Signal\n  Processing IPs/SoCs", "comments": "International journal of VLSI design & Communication Systems (VLSICS)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper,we present Generic System Verilog Universal Verification\nMethodology based Reusable Verification Environment for efficient verification\nof Image Signal Processing IP's/SoC's. With the tight schedules on all projects\nit is important to have a strong verification methodology which contributes to\nFirst Silicon Success. Deploy methodologies which enforce full functional\ncoverage and verification of corner cases through pseudo random test scenarios\nis required. Also, standardization of verification flow is needed. Previously,\ninside imaging group of ST, Specman (e)/Verilog based Verification Environment\nfor IP/Subsystem level verification and C/C++/Verilog based Directed\nVerification Environment for SoC Level Verification was used for Functional\nVerification. Different Verification Environments were used at IP level and SoC\nlevel. Different Verification/Validation Methodologies were used for SoC\nVerification across multiple sites. Verification teams were also looking for\nthe ways how to catch bugs early in the design cycle? Thus, Generic System\nVerilog Universal Verification Methodology (UVM) based Reusable Verification\nEnvironment is required to avoid the problem of having so many methodologies\nand provides a standard unified solution which compiles on all tools. The main\naim of development of this Generic and automatic verification environment is to\ndevelop an efficient and unified verification environment (at IP/Subsystem/SoC\nLevel) which reuses the already developed Verification components and also\nsequences written at IP/Subsystem level can be reused at SoC Level both with\nHost BFM and actual Core using Incisive Software Extension (ISX) and Virtual\nRegister Interface (VRI)/Verification Abstraction Layer (VAL) approaches.\nIP-XACT based tools are used for automatically configuring the environment for\nvarious imaging IPs/SoCs.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jan 2013 04:18:02 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Jain", "Abhishek", ""], ["Bonanno", "Giuseppe", ""], ["Gupta", "Hima", ""], ["Goyal", "Ajay", ""]]}, {"id": "1301.6319", "submitter": "Leon Abdillah", "authors": "Muhamd Sobri and Leon Andretti Abdillah", "title": "Aplikasi belajar membaca iqro' berbasis mobile", "comments": "Seminar Nasional Teknologi Informasi & Multimedia (Semnasteknomedia),\n  STMIK AMIKOM Yogyakarta, 2013. 5 pages. 11 figures", "journal-ref": "M. Sobri and L. A. Abdillah, \"Aplikasi belajar membaca iqro'\n  berbasis mobile,\" in Seminar Nasional Teknologi Informasi & Multimedia\n  (Semnasteknomedia), STMIK AMIKOM Yogyakarta, 2013", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  IPTEK and IMTAQ should be followed by knowledge of the ability in reading the\nhijaiyah letters as Al Qur-an base. Current people are so busy with their\nactivities thats way authors develop this mobile application using pocket pc.\nThe development of this research using waterfall model. Authors use the\nprogramming language of Microsoft Visual BASIC.Net. Authors also use Photoshop\nto prepare the image of every letter. In Indonesia, there six level in reading\nAl Qur-an, but for the purpose of thi research authors only use Iqro-1 until\nIqro-4. This mobile application also enriched with the voice for every letter\nimage.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jan 2013 05:30:43 GMT"}], "update_date": "2013-01-29", "authors_parsed": [["Sobri", "Muhamd", ""], ["Abdillah", "Leon Andretti", ""]]}, {"id": "1301.6946", "submitter": "Mehdi Taassori", "authors": "Mehdi Taassori (Member, IEEE), Meysam Taassori, and Sener Uysal\n  (Member, IEEE)", "title": "MFLP: Most Frequent Least Power Encoding", "comments": "This paper has been withdrawn by the authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper has been withdrawn by the authors. In this paper, we propose a new\nlow power coding technique by decreasing the number of switching activities on\nthe buses which use transition signaling to transmit data. This approach\ndedicates the symbols with less ones to high probability data. MFLP unlike the\nmost low power encoding does not rely on spatial redundancy. Due to this\nsuperiority, MFLP is unique in power decreasing in the Network on Chip (NoC).\nNot only does this algorithm reduce the power consumption, but also it can\ncompress the data. It offers a tradeoff to designers to choose between\ncompression and power; that is, the more power consumption decrease we need,\nthe less compression we earn. This coding uses tree based infrastructure in\norder to decrease the number of ones to reduce the switching activities, and\nthe power consumption consequently. The proposed algorithm constructs the tree\nwith this contribution that code words with less ones are allocated to more\nfrequent data. The experimental results for the outside and inside of the NoC\nindicate that the proposed coding algorithm reduces the switching activity up\nto 30 and 45%, the link power consumption up to 35 and 46% and the total power\ndissipation up to 34.9 and 16% for the outside and inside of the NoC,\nrespectively.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jan 2013 15:24:10 GMT"}, {"version": "v2", "created": "Mon, 11 Feb 2013 07:56:22 GMT"}], "update_date": "2013-02-12", "authors_parsed": [["Taassori", "Mehdi", "", "Member, IEEE"], ["Taassori", "Meysam", "", "Member, IEEE"], ["Uysal", "Sener", "", "Member, IEEE"]]}, {"id": "1301.7231", "submitter": "Lamling Venus Shum", "authors": "Lamling Venus Shum, Manik Gupta, Pachamuthu Rajalakshmi", "title": "Data Analysis on the High-Frequency Pollution Data Collected in India", "comments": "7 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fine grained 1Hz Carbon Monoxide pollution data were collected on a busy road\nin Hyderabad, India. In this paper we report the findings from analysing the\nexperimental data, in which it was found that the data were log-normally\ndistributed and nonlinear. The dominant frequencies at peak hours were caused\nby the pattern of traffic flow.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2013 14:09:24 GMT"}], "update_date": "2013-01-31", "authors_parsed": [["Shum", "Lamling Venus", ""], ["Gupta", "Manik", ""], ["Rajalakshmi", "Pachamuthu", ""]]}]