[{"id": "1210.0962", "submitter": "Adam Kapelner", "authors": "Dana Chandler and Adam Kapelner", "title": "Breaking Monotony with Meaning: Motivation in Crowdsourcing Markets", "comments": "26 pages, 15 figures, 4 tables", "journal-ref": "Journal of Economic Behavior & Organization, 90, 2013, pp 123-133", "doi": "10.1016/j.jebo.2013.03.003", "report-no": null, "categories": "stat.OT cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We conduct the first natural field experiment to explore the relationship\nbetween the \"meaningfulness\" of a task and worker effort. We employed about\n2,500 workers from Amazon's Mechanical Turk (MTurk), an online labor market, to\nlabel medical images. Although given an identical task, we experimentally\nmanipulated how the task was framed. Subjects in the meaningful treatment were\ntold that they were labeling tumor cells in order to assist medical\nresearchers, subjects in the zero-context condition (the control group) were\nnot told the purpose of the task, and, in stark contrast, subjects in the\nshredded treatment were not given context and were additionally told that their\nwork would be discarded. We found that when a task was framed more\nmeaningfully, workers were more likely to participate. We also found that the\nmeaningful treatment increased the quantity of output (with an insignificant\nchange in quality) while the shredded treatment decreased the quality of output\n(with no change in quantity). We believe these results will generalize to other\nshort-term labor markets. Our study also discusses MTurk as an exciting\nplatform for running natural field experiments in economics.\n", "versions": [{"version": "v1", "created": "Wed, 3 Oct 2012 02:28:34 GMT"}], "update_date": "2013-05-23", "authors_parsed": [["Chandler", "Dana", ""], ["Kapelner", "Adam", ""]]}, {"id": "1210.2942", "submitter": "Tomasz Rutkowski", "authors": "Hiromu Mori, Yoshihiro Matsumito, Shoji Makino, Victor Kryssanov, and\n  Tomasz M. Rutkowski", "title": "Vibrotactile Stimulus Frequency Optimization for the Haptic BCI\n  Prototype", "comments": "The 6th International Conference on Soft Computing and Intelligent\n  Systems and The 13th International Symposium on Advanced Intelligent Systems,\n  2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents results from a psychophysical study conducted to optimize\nvibrotactile stimuli delivered to subject finger tips in order to evoke the\nsomatosensory responses to be utilized next in a haptic brain computer\ninterface (hBCI) paradigm. We also present the preliminary EEG evoked responses\nfor the chosen stimulating frequency. The obtained results confirm our\nhypothesis that the hBCI paradigm concept is valid and it will allow for rapid\nstimuli presentation in order to improve information-transfer-rate (ITR) of the\nBCI.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2012 14:57:01 GMT"}, {"version": "v2", "created": "Thu, 11 Oct 2012 02:44:10 GMT"}], "update_date": "2012-10-12", "authors_parsed": [["Mori", "Hiromu", ""], ["Matsumito", "Yoshihiro", ""], ["Makino", "Shoji", ""], ["Kryssanov", "Victor", ""], ["Rutkowski", "Tomasz M.", ""]]}, {"id": "1210.2943", "submitter": "Tomasz Rutkowski", "authors": "Yoshihiro Matsumoto, Nozomu Nishikawa, Takeshi Yamada, Shoji Makino,\n  and Tomasz M. Rutkowski", "title": "Auditory Steady-State Response Stimuli based BCI Application - The\n  Optimization of the Stimuli Types and Lengths", "comments": "APSIPA ASC 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a method for an improvement of auditory BCI (aBCI) paradigm based\non a combination of ASSR stimuli optimization by choosing the subjects' best\nresponses to AM-, flutter-, AM/FM and click-envelope modulated sounds. As the\nASSR response features we propose pairwise phase-locking-values calculated from\nthe EEG and next classified using binary classifier to detect attended and\nignored stimuli. We also report on a possibility to use the stimuli as short as\nhalf a second, which is a step forward in ASSR based aBCI. The presented\nresults are helpful for optimization of the aBCI stimuli for each subject.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2012 14:58:37 GMT"}], "update_date": "2012-10-11", "authors_parsed": [["Matsumoto", "Yoshihiro", ""], ["Nishikawa", "Nozomu", ""], ["Yamada", "Takeshi", ""], ["Makino", "Shoji", ""], ["Rutkowski", "Tomasz M.", ""]]}, {"id": "1210.2945", "submitter": "Tomasz Rutkowski", "authors": "Nozomu Nishikawa, Yoshihiro Matsumoto, Shoji Makino, and Tomasz M.\n  Rutkowski", "title": "The Spatial Real and Virtual Sound Stimuli Optimization for the Auditory\n  BCI", "comments": "APSIPA ASC 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.SD q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents results from a project aiming to create horizontally\ndistributed surround sound sources and virtual sound images as auditory BCI\n(aBCI) stimuli. The purpose is to create evoked brain wave response patterns\ndepending on attended or ignored sound directions. We propose to use a modified\nversion of the vector based amplitude panning (VBAP) approach to achieve the\ngoal. The so created spatial sound stimulus system for the novel oddball aBCI\nparadigm allows us to create a multi-command experimental environment with very\nencouraging results reported in this paper. We also present results showing\nthat a modulation of the sound image depth changes also the subject responses.\nFinally, we also compare the proposed virtual sound approach with the\ntraditional one based on real sound sources generated from the real loudspeaker\ndirections. The so obtained results confirm the hypothesis of the possibility\nto modulate independently the brain responses to spatial types and depths of\nsound sources which allows for the development of the novel multi-command aBCI.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2012 15:00:00 GMT"}], "update_date": "2012-10-11", "authors_parsed": [["Nishikawa", "Nozomu", ""], ["Matsumoto", "Yoshihiro", ""], ["Makino", "Shoji", ""], ["Rutkowski", "Tomasz M.", ""]]}, {"id": "1210.2959", "submitter": "Tomasz Rutkowski", "authors": "Moonjeong Chang, Nozomu Nishikawa, Zhenyu Cai, Shoji Makino, and\n  Tomasz M. Rutkowski", "title": "Psychophysical Responses Comparison in Spatial Visual, Audiovisual, and\n  Auditory BCI-Spelling Paradigms", "comments": "The 6th International Conference on Soft Computing and Intelligent\n  Systems and The 13th International Symposium on Advanced Intelligent Systems,\n  2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents a pilot study conducted with spatial visual, audiovisual\nand auditory brain-computer-interface (BCI) based speller paradigms. The\npsychophysical experiments are conducted with healthy subjects in order to\nevaluate a difficulty and a possible response accuracy variability. We also\npresent preliminary EEG results in offline BCI mode. The obtained results\nvalidate a thesis, that spatial auditory only paradigm performs as good as the\ntraditional visual and audiovisual speller BCI tasks.\n", "versions": [{"version": "v1", "created": "Wed, 10 Oct 2012 15:42:23 GMT"}], "update_date": "2012-10-11", "authors_parsed": [["Chang", "Moonjeong", ""], ["Nishikawa", "Nozomu", ""], ["Cai", "Zhenyu", ""], ["Makino", "Shoji", ""], ["Rutkowski", "Tomasz M.", ""]]}, {"id": "1210.3448", "submitter": "Antonio Torralba", "authors": "Adela Barriuso and Antonio Torralba", "title": "Notes on image annotation", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are under the illusion that seeing is effortless, but frequently the\nvisual system is lazy and makes us believe that we understand something when in\nfact we don't. Labeling a picture forces us to become aware of the difficulties\nunderlying scene understanding. Suddenly, the act of seeing is not effortless\nanymore. We have to make an effort in order to understand parts of the picture\nthat we neglected at first glance.\n  In this report, an expert image annotator relates her experience on\nsegmenting and labeling tens of thousands of images. During this process, the\nnotes she took try to highlight the difficulties encountered, the solutions\nadopted, and the decisions made in order to get a consistent set of\nannotations. Those annotations constitute the SUN database.\n", "versions": [{"version": "v1", "created": "Fri, 12 Oct 2012 07:52:38 GMT"}], "update_date": "2012-10-15", "authors_parsed": [["Barriuso", "Adela", ""], ["Torralba", "Antonio", ""]]}, {"id": "1210.4981", "submitter": "Ivan Ruchkin", "authors": "David Garlan, Vishal Dwivedi, Ivan Ruchkin, Bradley Schmerl", "title": "Foundations and Tools for End-User Architecting", "comments": null, "journal-ref": "Large-Scale Complex IT Systems. Development, Operation and\n  Management. Lecture Notes in Computer Science, 2012, Volume 7539/2012,\n  157-182", "doi": "10.1007/978-3-642-34059-8_9", "report-no": null, "categories": "cs.SE cs.HC cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Within an increasing number of domains an important emerging need is the\nability for technically naive users to compose computational elements into\nnovel configurations. Examples include astronomers who create new analysis\npipelines to process telescopic data, intelligence analysts who must process\ndiverse sources of unstructured text to discover socio-technical trends, and\nmedical researchers who have to process brain image data in new ways to\nunderstand disease pathways. Creating such compositions today typically\nrequires low-level technical expertise, limiting the use of computational\nmethods and increasing the cost of using them. In this paper we describe an\napproach - which we term end-user architecting - that exploits the similarity\nbetween such compositional activities and those of software architects. Drawing\non the rich heritage of software architecture languages, methods, and tools, we\nshow how those techniques can be adapted to support end users in composing rich\ncomputational systems through domain-specific compositional paradigms and\ncomponent repositories, without requiring that they have knowledge of the\nlow-level implementation details of the components or the compositional\ninfrastructure. Further, we outline a set of open research challenges that the\narea of end-user architecting raises.\n", "versions": [{"version": "v1", "created": "Wed, 17 Oct 2012 22:44:07 GMT"}], "update_date": "2012-10-19", "authors_parsed": [["Garlan", "David", ""], ["Dwivedi", "Vishal", ""], ["Ruchkin", "Ivan", ""], ["Schmerl", "Bradley", ""]]}]