[{"id": "1209.0359", "submitter": "Gr", "authors": "Alexander Heussner (LaBRI, Universit\\'e de Bordeaux, CNRS, France),\n  J\\'er\\^ome Leroux (LaBRI, Universit\\'e de Bordeaux, CNRS, France), Anca\n  Muscholl (LaBRI, Universit\\'e de Bordeaux, CNRS, France), Gr\\'egoire Sutre\n  (LaBRI, Universit\\'e de Bordeaux, CNRS, France)", "title": "Reachability Analysis of Communicating Pushdown Systems", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 8, Issue 3 (September\n  27, 2012) lmcs:921", "doi": "10.2168/LMCS-8(3:23)2012", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The reachability analysis of recursive programs that communicate\nasynchronously over reliable FIFO channels calls for restrictions to ensure\ndecidability. Our first result characterizes communication topologies with a\ndecidable reachability problem restricted to eager runs (i.e., runs where\nmessages are either received immediately after being sent, or never received).\nThe problem is EXPTIME-complete in the decidable case. The second result is a\ndoubly exponential time algorithm for bounded context analysis in this setting,\ntogether with a matching lower bound. Both results extend and improve previous\nwork from La Torre et al.\n", "versions": [{"version": "v1", "created": "Mon, 3 Sep 2012 13:58:57 GMT"}, {"version": "v2", "created": "Tue, 25 Sep 2012 20:04:17 GMT"}, {"version": "v3", "created": "Fri, 28 Sep 2012 09:53:40 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Heussner", "Alexander", "", "LaBRI, Université de Bordeaux, CNRS, France"], ["Leroux", "Jérôme", "", "LaBRI, Université de Bordeaux, CNRS, France"], ["Muscholl", "Anca", "", "LaBRI, Université de Bordeaux, CNRS, France"], ["Sutre", "Grégoire", "", "LaBRI, Université de Bordeaux, CNRS, France"]]}, {"id": "1209.0680", "submitter": "Radu Grigore", "authors": "Radu Grigore (University of Oxford), Nikos Tzevelekos (Queen Mary\n  University of London)", "title": "History-Register Automata", "comments": "LMCS (improved version of FoSSaCS)", "journal-ref": "Logical Methods in Computer Science, Volume 12, Issue 1 (March 29,\n  2016) lmcs:1630", "doi": "10.2168/LMCS-12(1:7)2016", "report-no": null, "categories": "cs.PL cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Programs with dynamic allocation are able to create and use an unbounded\nnumber of fresh resources, such as references, objects, files, etc. We propose\nHistory-Register Automata (HRA), a new automata-theoretic formalism for\nmodelling such programs. HRAs extend the expressiveness of previous approaches\nand bring us to the limits of decidability for reachability checks. The\ndistinctive feature of our machines is their use of unbounded memory sets\n(histories) where input symbols can be selectively stored and compared with\nsymbols to follow. In addition, stored symbols can be consumed or deleted by\nreset. We show that the combination of consumption and reset capabilities\nrenders the automata powerful enough to imitate counter machines, and yields\nclosure under all regular operations apart from complementation. We moreover\nexamine weaker notions of HRAs which strike different balances between\nexpressiveness and effectiveness.\n", "versions": [{"version": "v1", "created": "Tue, 4 Sep 2012 15:54:29 GMT"}, {"version": "v2", "created": "Thu, 18 Feb 2016 06:02:57 GMT"}, {"version": "v3", "created": "Wed, 16 Mar 2016 14:13:40 GMT"}, {"version": "v4", "created": "Tue, 29 Mar 2016 20:35:31 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Grigore", "Radu", "", "University of Oxford"], ["Tzevelekos", "Nikos", "", "Queen Mary\n  University of London"]]}, {"id": "1209.0800", "submitter": "Michael Holtmann", "authors": "Michael Holtmann (RWTH Aachen, Lehrstuhl f\\\"ur Informatik 7, Germany),\n  Lukasz Kaiser (RWTH Aachen, Mathematische Grundlagen der Informatik,\n  Germany), Wolfgang Thomas (RWTH Aachen, Lehrstuhl f\\\"ur Informatik 7,\n  Germany)", "title": "Degrees of Lookahead in Regular Infinite Games", "comments": "LMCS submission", "journal-ref": "Logical Methods in Computer Science, Volume 8, Issue 3 (September\n  27, 2012) lmcs:922", "doi": "10.2168/LMCS-8(3:24)2012", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study variants of regular infinite games where the strict alternation of\nmoves between the two players is subject to modifications. The second player\nmay postpone a move for a finite number of steps, or, in other words, exploit\nin his strategy some lookahead on the moves of the opponent. This captures\nsituations in distributed systems, e.g. when buffers are present in\ncommunication or when signal transmission between components is deferred. We\ndistinguish strategies with different degrees of lookahead, among them being\nthe continuous and the bounded lookahead strategies. In the first case the\nlookahead is of finite possibly unbounded size, whereas in the second case it\nis of bounded size. We show that for regular infinite games the solvability by\ncontinuous strategies is decidable, and that a continuous strategy can always\nbe reduced to one of bounded lookahead. Moreover, this lookahead is at most\ndoubly exponential in the size of a given parity automaton recognizing the\nwinning condition. We also show that the result fails for non-regular\ngamesxwhere the winning condition is given by a context-free omega-language.\n", "versions": [{"version": "v1", "created": "Tue, 4 Sep 2012 20:59:16 GMT"}, {"version": "v2", "created": "Sun, 23 Sep 2012 20:41:21 GMT"}, {"version": "v3", "created": "Tue, 25 Sep 2012 21:56:01 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Holtmann", "Michael", "", "RWTH Aachen, Lehrstuhl für Informatik 7, Germany"], ["Kaiser", "Lukasz", "", "RWTH Aachen, Mathematische Grundlagen der Informatik,\n  Germany"], ["Thomas", "Wolfgang", "", "RWTH Aachen, Lehrstuhl für Informatik 7,\n  Germany"]]}, {"id": "1209.1916", "submitter": "Mohamed Faouzi Atig", "authors": "Mohamed Faouzi Atig (Uppsala University)", "title": "Model-Checking of Ordered Multi-Pushdown Automata", "comments": "31 pages", "journal-ref": "Logical Methods in Computer Science, Volume 8, Issue 3 (September\n  20, 2012) lmcs:871", "doi": "10.2168/LMCS-8(3:20)2012", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the verification problem of ordered multi-pushdown automata: A\nmulti-stack extension of pushdown automata that comes with a constraint on\nstack transitions such that a pop can only be performed on the first non-empty\nstack. First, we show that the emptiness problem for ordered multi-pushdown\nautomata is in 2ETIME. Then, we prove that, for an ordered multi-pushdown\nautomata, the set of all predecessors of a regular set of configurations is an\neffectively constructible regular set. We exploit this result to solve the\nglobal model-checking which consists in computing the set of all configurations\nof an ordered multi-pushdown automaton that satisfy a given w-regular property\n(expressible in linear-time temporal logics or the linear-time \\mu-calculus).\nAs an immediate consequence, we obtain an 2ETIME upper bound for the\nmodel-checking problem of w-regular properties for ordered multi-pushdown\nautomata (matching its lower-bound).\n", "versions": [{"version": "v1", "created": "Mon, 10 Sep 2012 09:33:02 GMT"}, {"version": "v2", "created": "Wed, 19 Sep 2012 09:04:37 GMT"}], "update_date": "2015-07-01", "authors_parsed": [["Atig", "Mohamed Faouzi", "", "Uppsala University"]]}, {"id": "1209.2035", "submitter": "Dominique Perrin", "authors": "Dominique Perrin", "title": "Completely reducible sets", "comments": "Corrected version", "journal-ref": "International Journal of Algebra and Computation, 23 (4), 915-942\n  (2013)", "doi": null, "report-no": null, "categories": "cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the family of rational sets of words, called completely reducible\nand which are such that the syntactic representation of their characteristic\nseries is completely reducible. This family contains, by a result of\nReutenauer, the submonoids generated by bifix codes and, by a result of Berstel\nand Reutenauer, the cyclic sets. We study the closure properties of this\nfamily. We prove a result on linear representations of monoids which gives a\ngeneralization of the result concerning the complete reducibility of the\nsubmonoid generated by a bifix code to sets called birecurrent. We also give a\nnew proof of the result concerning cyclic sets.\n", "versions": [{"version": "v1", "created": "Mon, 10 Sep 2012 15:35:50 GMT"}, {"version": "v2", "created": "Sun, 4 Nov 2012 07:48:29 GMT"}, {"version": "v3", "created": "Thu, 10 Jan 2013 16:14:51 GMT"}, {"version": "v4", "created": "Sat, 19 Nov 2016 10:27:00 GMT"}], "update_date": "2016-11-22", "authors_parsed": [["Perrin", "Dominique", ""]]}, {"id": "1209.2237", "submitter": "EPTCS", "authors": "Gregorio D\\'iaz (Universidad de Castilla-La Mancha), Luis Llana\n  (Universidad Complutense de Madrid), Valent\\'in Valero (Universidad de\n  Castilla-La Mancha), Jose Antonio Mateo (Universidad de Castilla-La Mancha)", "title": "Conformance Verification of Normative Specifications using C-O Diagrams", "comments": "In Proceedings FLACOS 2012, arXiv:1209.1699", "journal-ref": "EPTCS 94, 2012, pp. 1-10", "doi": "10.4204/EPTCS.94.1", "report-no": null, "categories": "cs.FL cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  C-O Diagrams have been introduced as a means to have a visual representation\nof normative texts and electronic contracts, where it is possible to represent\nthe obligations, permissions and prohibitions of the different signatories, as\nwell as what are the penalties in case of not fulfillment of their obligations\nand prohibitions. In such diagrams we are also able to represent absolute and\nrelative timing constrains.\n  In this paper we consider a formal semantics for C-O Diagrams based on a\nnetwork of timed automata and we present several relations to check the\nconsistency of a contract in terms of realizability, to analyze whether an\nimplementation satisfies the requirements defined on its contract, and to\ncompare several implementations using the executed permissions as criteria.\n", "versions": [{"version": "v1", "created": "Tue, 11 Sep 2012 06:30:26 GMT"}], "update_date": "2012-09-12", "authors_parsed": [["Díaz", "Gregorio", "", "Universidad de Castilla-La Mancha"], ["Llana", "Luis", "", "Universidad Complutense de Madrid"], ["Valero", "Valentín", "", "Universidad de\n  Castilla-La Mancha"], ["Mateo", "Jose Antonio", "", "Universidad de Castilla-La Mancha"]]}, {"id": "1209.4061", "submitter": "\\v{S}t\\v{e}p\\'an Holub", "authors": "\\v{S}t\\v{e}p\\'an Holub", "title": "Binary equality sets are generated by two words", "comments": "Thoroughly revised version of a journal publication", "journal-ref": "Journal of Algebra 259 (2003), 1-42", "doi": "10.1016/S0021-8693(02)00534-3", "report-no": null, "categories": "cs.FL math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the equality language of two non-periodic binary morphisms is\ngenerated by at most two words. If its rank is two, then the generators start\n(and end) with different letters.\n  This in particular implies that any binary language has a test set of\ncardinality at most two.\n", "versions": [{"version": "v1", "created": "Tue, 18 Sep 2012 19:00:07 GMT"}], "update_date": "2012-09-19", "authors_parsed": [["Holub", "Štěpán", ""]]}, {"id": "1209.5238", "submitter": "Katie Barr", "authors": "Katie Barr, Viv Kendon", "title": "Formal languages analysed by quantum walks", "comments": "9 Pages, 5 figures. Accepted to QPL 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Discrete time quantum walks are known to be universal for quantum\ncomputation. This has been proven by showing that they can simulate a universal\ngate set. In this paper we examine computation in terms of language acceptance\nand present two ways in which discrete time quantum walks can accept some\nlanguages with certainty. These walks can take quantum as well as classical\ninputs, and we show that when the input is quantum, the walks can be\ninterpreted as performing state discrimination.\n", "versions": [{"version": "v1", "created": "Mon, 24 Sep 2012 12:06:10 GMT"}], "update_date": "2012-09-25", "authors_parsed": [["Barr", "Katie", ""], ["Kendon", "Viv", ""]]}, {"id": "1209.5325", "submitter": "Radu Grigore", "authors": "Radu Grigore, Dino Distefano, Rasmus Lerchedahl Petersen, Nikos\n  Tzevelekos", "title": "Runtime Verification Based on Register Automata", "comments": "TACAS 2013 (plus proofs)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose TOPL automata as a new method for runtime verification of systems\nwith unbounded resource generation. Paradigmatic such systems are\nobject-oriented programs which can dynamically generate an unbounded number of\nfresh object identities during their execution. Our formalism is based on\nregister automata, a particularly successful approach in automata over infinite\nalphabets which administers a finite-state machine with boundedly many\ninput-storing registers. We show that TOPL automata are equally expressive to\nregister automata and yet suitable to express properties of programs. Compared\nto other runtime verification methods, our technique can handle a class of\nproperties beyond the reach of current tools. We show in particular that\nproperties which require value updates are not expressible with current\ntechniques yet are naturally captured by TOPL machines. On the practical side,\nwe present a tool for runtime verification of Java programs via TOPL\nproperties, where the trade-off between the coverage and the overhead of the\nmonitoring system is tunable by means of a number of parameters. We validate\nour technique by checking properties involving multiple objects and chaining of\nvalues on large open source projects.\n", "versions": [{"version": "v1", "created": "Mon, 24 Sep 2012 16:33:13 GMT"}, {"version": "v2", "created": "Mon, 25 Feb 2013 09:08:17 GMT"}, {"version": "v3", "created": "Tue, 20 Jan 2015 07:57:18 GMT"}], "update_date": "2015-01-21", "authors_parsed": [["Grigore", "Radu", ""], ["Distefano", "Dino", ""], ["Petersen", "Rasmus Lerchedahl", ""], ["Tzevelekos", "Nikos", ""]]}, {"id": "1209.5407", "submitter": "Alexei Lisitsa", "authors": "Alexei Lisitsa and Andrei P. Nemytykh", "title": "A Note on Program Specialization. What Can Syntactical Properties of\n  Residual Programs Reveal?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PL cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents two examples of non-traditional using of program\nspecialization by Turchin's supercompilation method. In both cases we are\ninterested in syntactical properties of residual programs produced by\nsupercompilation. In the first example we apply supercompilation to a program\nencoding a word equation and as a result we obtain a program representing a\ngraph describing the solution set of the word equation. The idea of the second\nexample belongs to Alexandr V. Korlyukov. He considered an interpreter\nsimulating the dynamic of the well known missionaries-cannibals puzzle.\nSupercompilation of the interpreter allows us to solve the puzzle. The\ninterpreter may also be seen as an encoding of a non-deterministic protocol.\n", "versions": [{"version": "v1", "created": "Mon, 24 Sep 2012 20:14:27 GMT"}], "update_date": "2012-09-26", "authors_parsed": [["Lisitsa", "Alexei", ""], ["Nemytykh", "Andrei P.", ""]]}, {"id": "1209.5773", "submitter": "Nuno Macedo", "authors": "Nuno Macedo and Alcino Cunha", "title": "Automatic Unbounded Verification of Alloy Specifications with Prover9", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Alloy is an increasingly popular lightweight specification language based on\nrelational logic. Alloy models can be automatically verified within a bounded\nscope using off-the-shelf SAT solvers. Since false assertions can usually be\ndisproved using small counter-examples, this approach suffices for most\napplications. Unfortunately, it can sometimes lead to a false sense of\nsecurity, and in critical applications a more traditional unbounded proof may\nbe required. The automatic theorem prover Prover9 has been shown to be\nparticularly effective for proving theorems of relation algebras [7], a\nquantifier-free (or point-free) axiomatization of a fragment of relational\nlogic. In this paper we propose a translation from Alloy specifications to fork\nalgebras (an extension of relation algebras with the same expressive power as\nrelational logic) which enables their unbounded verification in Prover9. This\ntranslation covers not only logic assertions, but also the structural aspects\n(namely type declarations), and was successfully implemented and applied to\nseveral examples.\n", "versions": [{"version": "v1", "created": "Tue, 25 Sep 2012 21:18:54 GMT"}], "update_date": "2012-09-27", "authors_parsed": [["Macedo", "Nuno", ""], ["Cunha", "Alcino", ""]]}, {"id": "1209.5903", "submitter": "Vincenzo Ciancia", "authors": "Vincenzo Ciancia", "title": "Interaction and observation: categorical semantics of reactive systems\n  trough dialgebras", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use dialgebras, generalising both algebras and coalgebras, as a complement\nof the standard coalgebraic framework, aimed at describing the semantics of an\ninteractive system by the means of reaction rules. In this model, interaction\nis built-in, and semantic equivalence arises from it, instead of being\ndetermined by a (possibly difficult) understanding of the side effects of a\ncomponent in isolation. Behavioural equivalence in dialgebras is determined by\nhow a given process interacts with the others, and the obtained observations.\nWe develop a technique to inter-define categories of dialgebras of different\nfunctors, that in particular permits us to compare a standard coalgebraic\nsemantics and its dialgebraic counterpart. We exemplify the framework using the\nCCS and the pi-calculus. Remarkably, the dialgebra giving semantics to the\npi-calculus does not require the use of presheaf categories.\n", "versions": [{"version": "v1", "created": "Wed, 26 Sep 2012 11:37:30 GMT"}, {"version": "v2", "created": "Wed, 13 Mar 2013 07:46:26 GMT"}, {"version": "v3", "created": "Mon, 3 Jun 2013 21:04:09 GMT"}], "update_date": "2013-06-05", "authors_parsed": [["Ciancia", "Vincenzo", ""]]}, {"id": "1209.6008", "submitter": "Eric Rowland", "authors": "Eric Rowland and Reem Yassawi", "title": "A characterization of $p$-automatic sequences as columns of linear\n  cellular automata", "comments": "19 pages, 6 figures; final version", "journal-ref": "Advances in Applied Mathematics 63 (2015) 68-89", "doi": "10.1016/j.aam.2014.10.002", "report-no": null, "categories": "math.DS cs.FL nlin.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that a sequence over a finite field $\\mathbb F_q$ of characteristic\n$p$ is $p$-automatic if and only if it occurs as a column of the spacetime\ndiagram, with eventually periodic initial conditions, of a linear cellular\nautomaton with memory over $\\mathbb F_q$. As a consequence, the subshift\ngenerated by a length-$p$ substitution can be realized as a topological factor\nof a linear cellular automaton.\n", "versions": [{"version": "v1", "created": "Wed, 26 Sep 2012 17:10:53 GMT"}, {"version": "v2", "created": "Thu, 27 Nov 2014 12:02:45 GMT"}], "update_date": "2014-12-01", "authors_parsed": [["Rowland", "Eric", ""], ["Yassawi", "Reem", ""]]}, {"id": "1209.6013", "submitter": "Gabriele Fici", "authors": "Gabriele Fici, Alessio Langiu, Thierry Lecroq, Arnaud Lefebvre,\n  Filippo Mignosi, and \\'Elise Prieur-Gaston", "title": "Abelian Repetitions in Sturmian Words", "comments": "Accepted to DLT 2013", "journal-ref": "LNCS 7907, pp. 227-238, 2013", "doi": null, "report-no": null, "categories": "cs.FL cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate abelian repetitions in Sturmian words. We exploit a bijection\nbetween factors of Sturmian words and subintervals of the unitary segment that\nallows us to study the periods of abelian repetitions by using classical\nresults of elementary Number Theory. We prove that in any Sturmian word the\nsuperior limit of the ratio between the maximal exponent of an abelian\nrepetition of period $m$ and $m$ is a number $\\geq\\sqrt{5}$, and the equality\nholds for the Fibonacci infinite word. We further prove that the longest prefix\nof the Fibonacci infinite word that is an abelian repetition of period $F_j$,\n$j>1$, has length $F_j(F_{j+1}+F_{j-1} +1)-2$ if $j$ is even or\n$F_j(F_{j+1}+F_{j-1})-2$ if $j$ is odd. This allows us to give an exact formula\nfor the smallest abelian periods of the Fibonacci finite words. More precisely,\nwe prove that for $j\\geq 3$, the Fibonacci word $f_j$ has abelian period equal\nto $F_n$, where $n = \\lfloor{j/2}\\rfloor$ if $j = 0, 1, 2\\mod{4}$, or $n = 1 +\n\\lfloor{j/2}\\rfloor$ if $ j = 3\\mod{4}$.\n", "versions": [{"version": "v1", "created": "Wed, 26 Sep 2012 17:28:57 GMT"}, {"version": "v2", "created": "Wed, 23 Jan 2013 09:14:55 GMT"}, {"version": "v3", "created": "Thu, 9 May 2013 08:55:56 GMT"}], "update_date": "2013-05-10", "authors_parsed": [["Fici", "Gabriele", ""], ["Langiu", "Alessio", ""], ["Lecroq", "Thierry", ""], ["Lefebvre", "Arnaud", ""], ["Mignosi", "Filippo", ""], ["Prieur-Gaston", "Élise", ""]]}, {"id": "1209.6578", "submitter": "Ender Y\\\"uksel", "authors": "Bo Friis Nielsen and Flemming Nielson and Henrik Pilegaard and Michael\n  James Andrew Smith and Ender Y\u007f\\\"uksel and Kebin Zeng and Lijun Zhang", "title": "Roadmap Document on Stochastic Analysis", "comments": "This work has been supported by MT-LAB, a VKR Centre of Excellence\n  for the Modelling of Information Technology", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This document was prepared as part of the MT-LAB research centre. The\nresearch centre studies the Modelling of Information Technology and is a VKR\nCentre of Excellence funded for five years by the VILLUM Foundation. You can\nread more about MT-LAB at its webpage www.MT-LAB.dk.\n  The goal of the document is to serve as an introduction to new PhD students\naddressing the research goals of MT-LAB. As such it aims to provide an overview\nof a number of selected approaches to the modelling of stochastic systems. It\nshould be readable not only by computers scientists with a background in formal\nmethods but also by PhD students in stochastics that are interested in\nunderstanding the computer science approach to stochastic model checking.\n  We have no intention of being encyclopedic in our treatment of the approaches\nor the literature. Rather we have made the selection of material based on the\ncompetences of the groups involved in or closely affiliated to MT-LAB, so as to\nease the task of the PhD students in navigating an otherwise vast amount of\nliterature.\n  We have decided to publish the document in case other young researchers may\nfind it helpful. The list of authors reflect those that have at times played a\nsignificant role in the production of the document.\n", "versions": [{"version": "v1", "created": "Thu, 27 Sep 2012 12:38:56 GMT"}], "update_date": "2012-10-01", "authors_parsed": [["Nielsen", "Bo Friis", ""], ["Nielson", "Flemming", ""], ["Pilegaard", "Henrik", ""], ["Smith", "Michael James Andrew", ""], ["Y\u007füksel", "Ender", ""], ["Zeng", "Kebin", ""], ["Zhang", "Lijun", ""]]}]