[{"id": "1602.00458", "submitter": "Elena Pagani", "authors": "Francesco Alberti and Silvio Ghilardi and Elena Pagani", "title": "Counting Constraints in Flat Array Fragments", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We identify a fragment of Presburger arithmetic enriched with free function\nsymbols and cardinality constraints for interpreted sets, which is amenable to\nautomated analysis. We establish decidability and complexity results for such a\nfragment and we implement our algorithms. The experiments run in discharging\nproof obligations coming from invariant checking and bounded model-checking\nbenchmarks show the practical feasibility of our decision procedure.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2016 10:14:34 GMT"}], "update_date": "2016-02-02", "authors_parsed": [["Alberti", "Francesco", ""], ["Ghilardi", "Silvio", ""], ["Pagani", "Elena", ""]]}, {"id": "1602.00476", "submitter": "Patrick Totzke", "authors": "Piotr Hofman (Cachan), Slawomir Lasota (Warsaw), Richard Mayr\n  (Edinburgh), Patrick Totzke (Warwick)", "title": "Simulation Problems Over One-Counter Nets", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 12, Issue 1 (March 14,\n  2016) lmcs:1629", "doi": "10.2168/LMCS-12(1:6)2016", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One-counter nets (OCN) are finite automata equipped with a counter that can\nstore non-negative integer values, and that cannot be tested for zero.\nEquivalently, these are exactly 1-dimensional vector addition systems with\nstates. We show that both strong and weak simulation preorder on OCN are\nPSPACE-complete.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2016 11:10:47 GMT"}, {"version": "v2", "created": "Thu, 10 Mar 2016 22:09:40 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Hofman", "Piotr", "", "Cachan"], ["Lasota", "Slawomir", "", "Warsaw"], ["Mayr", "Richard", "", "Edinburgh"], ["Totzke", "Patrick", "", "Warwick"]]}, {"id": "1602.00477", "submitter": "Patrick Totzke", "authors": "Matthias Englert, Ranko Lazi\\'c, Patrick Totzke", "title": "Reachability in Two-Dimensional Unary Vector Addition Systems with\n  States is NL-Complete", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blondin et al. showed at LICS 2015 that two-dimensional vector addition\nsystems with states have reachability witnesses of length exponential in the\nnumber of states and polynomial in the norm of vectors. The resulting\nguess-and-verify algorithm is optimal (PSPACE), but only if the input vectors\nare given in binary. We answer positively the main question left open by their\nwork, namely establish that reachability witnesses of pseudo-polynomial length\nalways exist. Hence, when the input vectors are given in unary, the improved\nguess-and-verify algorithm requires only logarithmic space.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2016 11:19:29 GMT"}, {"version": "v2", "created": "Fri, 6 May 2016 17:59:56 GMT"}], "update_date": "2016-05-09", "authors_parsed": [["Englert", "Matthias", ""], ["Lazić", "Ranko", ""], ["Totzke", "Patrick", ""]]}, {"id": "1602.00481", "submitter": "Maximilien Colange", "authors": "Patricia Bouyer and Maximilien Colange and Nicolas Markey", "title": "Symbolic Optimal Reachability in Weighted Timed Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Weighted timed automata have been defined in the early 2000's for modelling\nresource-consumption or -allocation problems in real-time systems. Optimal\nreachability is decidable in weighted timed automata, and a symbolic forward\nalgorithm has been developed to solve that problem. This algorithm uses\nso-called priced zones, an extension of standard zones with cost functions. In\norder to ensure termination, the algorithm requires clocks to be bounded. For\nunpriced timed automata, much work has been done to develop sound abstractions\nadapted to the forward exploration of timed automata, ensuring termination of\nthe model-checking algorithm without bounding the clocks. In this paper, we\ntake advantage of recent developments on abstractions for timed automata, and\npropose an algorithm allowing for symbolic analysis of all weighted timed\nautomata, without requiring bounded clocks.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2016 11:34:54 GMT"}], "update_date": "2016-02-02", "authors_parsed": [["Bouyer", "Patricia", ""], ["Colange", "Maximilien", ""], ["Markey", "Nicolas", ""]]}, {"id": "1602.00786", "submitter": "EPTCS", "authors": "Pavol \\v{C}ern\\'y (University of Colorado Boulder), Viktor Kuncak\n  (EPFL), Madhusudan Parthasarathy (University of Illinois Urbana-Champaign)", "title": "Proceedings Fourth Workshop on Synthesis", "comments": null, "journal-ref": "EPTCS 202, 2016", "doi": "10.4204/EPTCS.202", "report-no": null, "categories": "cs.PL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The SYNT workshop aims to bring together researchers interested in the broad\narea of synthesis of computing systems. The goal is to foster the development\nof frontier techniques in automating the development of computing system.\nContributions of interest include algorithms, complexity and decidability\nanalysis, as well as reproducible heuristics, implemented tools, and\nexperimental evaluation. Application domains include software, hardware,\nembedded, and cyberphysical systems. Computation models include functional,\nreactive, hybrid and timed systems. Identifying, formalizing, and evaluating\nsynthesis in particular application domains is encouraged.\n  The fourth iteration of the workshop took place in San Francisco, CA, USA. It\nwas co-located with the 27th International Conference on Computer Aided\nVerification. The workshop included five contributed talks and two invited\ntalks. In addition, it featured a special session about the Syntax-Guided\nSynthesis Competition (SyGuS) and the SyntComp Synthesis competition.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2016 04:25:10 GMT"}], "update_date": "2016-02-03", "authors_parsed": [["Černý", "Pavol", "", "University of Colorado Boulder"], ["Kuncak", "Viktor", "", "EPFL"], ["Parthasarathy", "Madhusudan", "", "University of Illinois Urbana-Champaign"]]}, {"id": "1602.00912", "submitter": "M Fareed Arif", "authors": "M. Fareed Arif", "title": "From $\\mu$-Calculus to Alternating Tree Automata using Parity Games", "comments": "17 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  $\\mu$-Calculus and automata on infinite trees are complementary ways of\ndescribing infinite tree languages. The correspondence between $\\mu$-Calculus\nand alternating tree automaton is used to solve the satisfiability and model\nchecking problems by compiling the modal $\\mu$-Calculus formula into an\nalternating tree automata. Thus advocating an automaton model specially\ntailored for working with modal $\\mu$-Calculus. The advantage of the automaton\nmodel is its ability to deal with arbitrary branching in a much simpler way as\ncompare to the one proposed by Janin and Walukiewicz. Both problems (i.e.,\nmodel checking and satisfiability) are solved by reduction to the corresponding\nproblems of alternating tree automata, namely to the acceptance and the\nnon-emptiness problems, respectively. These problems, in turn, are solved using\nparity games where semantics of alternating tree automata is translated to a\nwinning strategy in an appropriate parity game.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2016 13:06:58 GMT"}], "update_date": "2016-02-03", "authors_parsed": [["Arif", "M. Fareed", ""]]}, {"id": "1602.01171", "submitter": "EPTCS", "authors": "Swen Jacobs (Saarland University, Saarbr\\\"ucken, Germany), Roderick\n  Bloem (Graz University of Technology, Austria), Romain Brenguier\n  (Universit\\'e Libre de Bruxelles, Brussels, Belgium), Robert K\\\"onighofer\n  (Graz University of Technology, Austria), Guillermo A. P\\'erez (Universit\\'e\n  Libre de Bruxelles, Brussels, Belgium), Jean-Fran\\c{c}ois Raskin\n  (Universit\\'e Libre de Bruxelles, Brussels, Belgium), Leonid Ryzhyk (NICTA,\n  Sydney, Australia and Carnegie Mellon University, Pittsburgh, USA), Ocan\n  Sankur (Universit\\'e Libre de Bruxelles, Brussels, Belgium), Martina Seidl\n  (Johannes-Kepler-University, Linz, Austria), Leander Tentrup (Saarland\n  University, Saarbr\\\"ucken, Germany), Adam Walker (NICTA, Sydney, Australia)", "title": "The Second Reactive Synthesis Competition (SYNTCOMP 2015)", "comments": "In Proceedings SYNT 2015, arXiv:1602.00786", "journal-ref": "EPTCS 202, 2016, pp. 27-57", "doi": "10.4204/EPTCS.202.4", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report on the design and results of the second reactive synthesis\ncompetition (SYNTCOMP 2015). We describe our extended benchmark library, with 6\ncompletely new sets of benchmarks, and additional challenging instances for 4\nof the benchmark sets that were already used in SYNTCOMP 2014. To enhance the\nanalysis of experimental results, we introduce an extension of our benchmark\nformat with meta-information, including a difficulty rating and a reference\nsize for solutions. Tools are evaluated on a set of 250 benchmarks, selected to\nprovide a good coverage of benchmarks from all classes and difficulties. We\nreport on changes of the evaluation scheme and the experimental setup. Finally,\nwe describe the entrants into SYNTCOMP 2015, as well as the results of our\nexperimental evaluation. In our analysis, we emphasize progress over the tools\nthat participated last year.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2016 02:49:55 GMT"}], "update_date": "2016-02-04", "authors_parsed": [["Jacobs", "Swen", "", "Saarland University, Saarbrücken, Germany"], ["Bloem", "Roderick", "", "Graz University of Technology, Austria"], ["Brenguier", "Romain", "", "Université Libre de Bruxelles, Brussels, Belgium"], ["Könighofer", "Robert", "", "Graz University of Technology, Austria"], ["Pérez", "Guillermo A.", "", "Université\n  Libre de Bruxelles, Brussels, Belgium"], ["Raskin", "Jean-François", "", "Université Libre de Bruxelles, Brussels, Belgium"], ["Ryzhyk", "Leonid", "", "NICTA,\n  Sydney, Australia and Carnegie Mellon University, Pittsburgh, USA"], ["Sankur", "Ocan", "", "Université Libre de Bruxelles, Brussels, Belgium"], ["Seidl", "Martina", "", "Johannes-Kepler-University, Linz, Austria"], ["Tentrup", "Leander", "", "Saarland\n  University, Saarbrücken, Germany"], ["Walker", "Adam", "", "NICTA, Sydney, Australia"]]}, {"id": "1602.01173", "submitter": "EPTCS", "authors": "Ioannis Filippidis, Richard M. Murray, Gerard J. Holzmann", "title": "A multi-paradigm language for reactive synthesis", "comments": "In Proceedings SYNT 2015, arXiv:1602.00786", "journal-ref": "EPTCS 202, 2016, pp. 73-97", "doi": "10.4204/EPTCS.202.6", "report-no": null, "categories": "cs.LO cs.PL cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a language for describing reactive synthesis problems\nthat integrates imperative and declarative elements. The semantics is defined\nin terms of two-player turn-based infinite games with full information.\nCurrently, synthesis tools accept linear temporal logic (LTL) as input, but\nthis description is less structured and does not facilitate the expression of\nsequential constraints. This motivates the use of a structured programming\nlanguage to specify synthesis problems. Transition systems and guarded commands\nserve as imperative constructs, expressed in a syntax based on that of the\nmodeling language Promela. The syntax allows defining which player controls\ndata and control flow, and separating a program into assumptions and\nguarantees. These notions are necessary for input to game solvers. The\nintegration of imperative and declarative paradigms allows using the paradigm\nthat is most appropriate for expressing each requirement. The declarative part\nis expressed in the LTL fragment of generalized reactivity(1), which admits\nefficient synthesis algorithms, extended with past LTL. The implementation\ntranslates Promela to input for the Slugs synthesizer and is written in Python.\nThe AMBA AHB bus case study is revisited and synthesized efficiently,\nidentifying the need to reorder binary decision diagrams during strategy\nconstruction, in order to prevent the exponential blowup observed in previous\nwork.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2016 02:50:18 GMT"}], "update_date": "2016-02-04", "authors_parsed": [["Filippidis", "Ioannis", ""], ["Murray", "Richard M.", ""], ["Holzmann", "Gerard J.", ""]]}, {"id": "1602.01174", "submitter": "EPTCS", "authors": "Romain Brenguier (Universit\\'e Libre de Bruxelles), Guillermo A.\n  P\\'erez (Universit\\'e Libre de Bruxelles), Jean-Fran\\c{c}ois Raskin\n  (Universit\\'e Libre de Bruxelles), Ocan Sankur (Universit\\'e Libre de\n  Bruxelles)", "title": "Compositional Algorithms for Succinct Safety Games", "comments": "In Proceedings SYNT 2015, arXiv:1602.00786", "journal-ref": "EPTCS 202, 2016, pp. 98-111", "doi": "10.4204/EPTCS.202.7", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the synthesis of circuits for succinct safety specifications given\nin the AIG format. We show how AIG safety specifications can be decomposed\nautomatically into sub specifications. Then we propose symbolic compositional\nalgorithms to solve the synthesis problem compositionally starting for the\nsub-specifications. We have evaluated the compositional algorithms on a set of\nbenchmarks including those proposed for the first synthesis competition\norganised in 2014 by the Synthesis Workshop affiliated to the CAV conference.\nWe show that a large number of benchmarks can be decomposed automatically and\nsolved more efficiently with the compositional algorithms that we propose in\nthis paper.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2016 02:50:28 GMT"}], "update_date": "2016-02-04", "authors_parsed": [["Brenguier", "Romain", "", "Université Libre de Bruxelles"], ["Pérez", "Guillermo A.", "", "Université Libre de Bruxelles"], ["Raskin", "Jean-François", "", "Université Libre de Bruxelles"], ["Sankur", "Ocan", "", "Université Libre de\n  Bruxelles"]]}, {"id": "1602.01175", "submitter": "EPTCS", "authors": "Ayrat Khalimov (Graz University of Technology, Austria)", "title": "Specification Format for Reactive Synthesis Problems", "comments": "In Proceedings SYNT 2015, arXiv:1602.00786", "journal-ref": "EPTCS 202, 2016, pp. 112-119", "doi": "10.4204/EPTCS.202.8", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automatic synthesis from a given specification automatically constructs\ncorrect implementation. This frees the user from the mundane implementation\nwork, but still requires the specification. But is specifying easier than\nimplementing? In this paper, we propose a user-friendly format to ease the\nspecification work, in particularly, that of specifying partial\nimplementations. Also, we provide scripts to convert specifications in the new\nformat into the SYNTCOMP format, thus benefiting from state of the art\nsynthesizers.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2016 02:50:37 GMT"}], "update_date": "2016-02-04", "authors_parsed": [["Khalimov", "Ayrat", "", "Graz University of Technology, Austria"]]}, {"id": "1602.01176", "submitter": "EPTCS", "authors": "Xiaowei Huang (UNSW Australia), Ron van der Meyden (UNSW Australia)", "title": "The complexity of approximations for epistemic synthesis (extended\n  abstract)", "comments": "In Proceedings SYNT 2015, arXiv:1602.00786", "journal-ref": "EPTCS 202, 2016, pp. 120-137", "doi": "10.4204/EPTCS.202.9", "report-no": null, "categories": "cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Epistemic protocol specifications allow programs, for settings in which\nmultiple agents act with incomplete information, to be described in terms of\nhow actions are related to what the agents know. They are a variant of the\nknowledge-based programs of Fagin et al [Distributed Computing, 1997],\nmotivated by the complexity of synthesizing implementations in that framework.\nThe paper proposes an approach to the synthesis of implementations of epistemic\nprotocol specifications, that reduces the problem of finding an implementation\nto a sequence of model checking problems in approximations of the ultimate\nsystem being synthesized. A number of ways to construct such approximations is\nconsidered, and these are studied for the complexity of the associated model\nchecking problems. The outcome of the study is the identification of the best\napproximations with the property of being PTIME implementable.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2016 02:50:46 GMT"}], "update_date": "2016-02-04", "authors_parsed": [["Huang", "Xiaowei", "", "UNSW Australia"], ["van der Meyden", "Ron", "", "UNSW Australia"]]}, {"id": "1602.01365", "submitter": "G. A. Kavvos", "authors": "G. A. Kavvos", "title": "On the Semantics of Intensionality", "comments": null, "journal-ref": "In: Esparza J., Murawski A. (eds) Foundations of Software Science\n  and Computation Structures. FoSSaCS 2017. Lecture Notes in Computer Science,\n  vol 10203. Springer, Berlin, Heidelberg", "doi": "10.1007/978-3-662-54458-7_32", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a categorical theory of intensionality. We first\nrevisit the notion of intensionality, and discuss we its relevance to logic and\ncomputer science. It turns out that 1-category theory is not the most\nappropriate vehicle for studying the interplay of extension and intension. We\nare thus led to consider the P-categories of \\v{C}ubri\\'{c}, Dybjer and Scott,\nwhich are categories only up to a partial equivalence relation (PER). In this\nsetting, we introduce a new P-categorical construct, that of exposures.\nExposures are very nearly functors, except that they do not preserve the PERs\nof the P-category. Inspired by the categorical semantics of modal logic, we\nbegin to develop their theory. Our leading examples demonstrate that an\nexposure is an abstraction of well-behaved intensional devices, such as G\\\"odel\nnumberings. The outcome is a unifying framework in which classic results of\nKleene, G\\\"odel, Tarski and Rice find concise, clear formulations, and where\neach logical device or assumption involved in their proofs can be expressed in\nthe same algebraic manner.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2016 16:56:30 GMT"}, {"version": "v2", "created": "Sat, 19 Mar 2016 04:04:22 GMT"}, {"version": "v3", "created": "Fri, 15 Apr 2016 11:32:37 GMT"}, {"version": "v4", "created": "Mon, 7 Nov 2016 20:50:43 GMT"}, {"version": "v5", "created": "Fri, 9 Dec 2016 23:30:56 GMT"}, {"version": "v6", "created": "Wed, 26 Apr 2017 00:31:42 GMT"}], "update_date": "2017-04-27", "authors_parsed": [["Kavvos", "G. A.", ""]]}, {"id": "1602.01366", "submitter": "Andreas Pieris", "authors": "Pablo Barcelo and Georg Gottlob and Andreas Pieris", "title": "Semantic Acyclicity Under Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DB cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A conjunctive query (CQ) is semantically acyclic if it is equivalent to an\nacyclic one. Semantic acyclicity has been studied in the constraint-free case,\nand deciding whether a query enjoys this property is NP-complete. However, in\ncase the database is subject to constraints such as tuple-generating\ndependencies (tgds) that can express, e.g., inclusion dependencies, or\nequality-generating dependencies (egds) that capture, e.g., functional\ndependencies, a CQ may turn out to be semantically acyclic under the\nconstraints while not semantically acyclic in general. This opens avenues to\nnew query optimization techniques. In this paper we initiate and develop the\ntheory of semantic acyclicity under constraints. More precisely, we study the\nfollowing natural problem: Given a CQ and a set of constraints, is the query\nsemantically acyclic under the constraints, or, in other words, is the query\nequivalent to an acyclic one over all those databases that satisfy the set of\nconstraints? We show that, contrary to what one might expect, decidability of\nCQ containment is a necessary but not sufficient condition for the decidability\nof semantic acyclicity. In particular, we show that semantic acyclicity is\nundecidable in the presence of full tgds (i.e., Datalog rules). In view of this\nfact, we focus on the main classes of tgds for which CQ containment is\ndecidable, and do not capture the class of full tgds, namely guarded,\nnon-recursive and sticky tgds. For these classes we show that semantic\nacyclicity is decidable, and its complexity coincides with the complexity of CQ\ncontainment. In the case of egds, we show that for keys over unary and binary\npredicates semantic acyclicity is decidable (NP-complete). We finally consider\nthe problem of evaluating a semantically acyclic query over a database that\nsatisfies a set of constraints; for guarded tgds and functional dependencies\nthis problem is tractable.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2016 17:01:36 GMT"}, {"version": "v2", "created": "Fri, 3 Jun 2016 16:39:28 GMT"}], "update_date": "2016-06-06", "authors_parsed": [["Barcelo", "Pablo", ""], ["Gottlob", "Georg", ""], ["Pieris", "Andreas", ""]]}, {"id": "1602.01883", "submitter": "Dorsa Sadigh", "authors": "Shromona Ghosh, Dorsa Sadigh, Pierluigi Nuzzo, Vasumathi Raman,\n  Alexandre Donze, Alberto Sangiovanni-Vincentelli, S. Shankar Sastry, Sanjit\n  A. Seshia", "title": "Diagnosis and Repair for Synthesis from Signal Temporal Logic\n  Specifications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We address the problem of diagnosing and repairing specifications for hybrid\nsystems formalized in signal temporal logic (STL). Our focus is on the setting\nof automatic synthesis of controllers in a model predictive control (MPC)\nframework. We build on recent approaches that reduce the controller synthesis\nproblem to solving one or more mixed integer linear programs (MILPs), where\ninfeasibility of a MILP usually indicates unrealizability of the controller\nsynthesis problem. Given an infeasible STL synthesis problem, we present\nalgorithms that provide feedback on the reasons for unrealizability, and\nsuggestions for making it realizable. Our algorithms are sound and complete,\ni.e., they provide a correct diagnosis, and always terminate with a non-trivial\nspecification that is feasible using the chosen synthesis method, when such a\nsolution exists. We demonstrate the effectiveness of our approach on the\nsynthesis of controllers for various cyber-physical systems, including an\nautonomous driving application and an aircraft electric power system.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2016 23:29:46 GMT"}], "update_date": "2016-02-08", "authors_parsed": [["Ghosh", "Shromona", ""], ["Sadigh", "Dorsa", ""], ["Nuzzo", "Pierluigi", ""], ["Raman", "Vasumathi", ""], ["Donze", "Alexandre", ""], ["Sangiovanni-Vincentelli", "Alberto", ""], ["Sastry", "S. Shankar", ""], ["Seshia", "Sanjit A.", ""]]}, {"id": "1602.01963", "submitter": "Steen Vester", "authors": "Steen Vester", "title": "Winning Cores in Parity Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the novel notion of winning cores in parity games and develop a\ndeterministic polynomial-time under-approximation algorithm for solving parity\ngames based on winning core approximation. Underlying this algorithm are a\nnumber properties about winning cores which are interesting in their own right.\nIn particular, we show that the winning core and the winning region for a\nplayer in a parity game are equivalently empty. Moreover, the winning core\ncontains all fatal attractors but is not necessarily a dominion itself.\nExperimental results are very positive both with respect to quality of\napproximation and running time. It outperforms existing state-of-the-art\nalgorithms significantly on most benchmarks.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2016 09:38:34 GMT"}], "update_date": "2016-02-08", "authors_parsed": [["Vester", "Steen", ""]]}, {"id": "1602.02211", "submitter": "Mohamed El Halaby", "authors": "Mohamed El Halaby, Areeg Abdalla", "title": "Fuzzy Maximum Satisfiability", "comments": "10 pages", "journal-ref": null, "doi": "10.1145/2908446.2908476", "report-no": null, "categories": "cs.LO cs.AI cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we extend the Maximum Satisfiability (MaxSAT) problem to\n{\\L}ukasiewicz logic. The MaxSAT problem for a set of formulae {\\Phi} is the\nproblem of finding an assignment to the variables in {\\Phi} that satisfies the\nmaximum number of formulae. Three possible solutions (encodings) are proposed\nto the new problem: (1) Disjunctive Linear Relations (DLRs), (2) Mixed Integer\nLinear Programming (MILP) and (3) Weighted Constraint Satisfaction Problem\n(WCSP). Like its Boolean counterpart, the extended fuzzy MaxSAT will have\nnumerous applications in optimization problems that involve vagueness.\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2016 03:57:57 GMT"}], "update_date": "2018-06-12", "authors_parsed": [["Halaby", "Mohamed El", ""], ["Abdalla", "Areeg", ""]]}, {"id": "1602.02387", "submitter": "Daisuke Ishii", "authors": "Daisuke Ishii, Naoki Yonezaki, Alexandre Goldsztejn", "title": "Monitoring Temporal Properties using Interval Analysis", "comments": "arXiv admin note: text overlap with arXiv:1506.01762", "journal-ref": "IEICE Trans. Fundamentals, vol. E99-A, no. 2, pp. 442-453, Feb.\n  2016", "doi": "10.1587/transfun.E99.A.442", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Verification of temporal logic properties plays a crucial role in proving the\ndesired behaviors of continuous systems. In this paper, we propose an interval\nmethod that verifies the properties described by a bounded signal temporal\nlogic. We relax the problem so that if the verification process cannot succeed\nat the prescribed precision, it outputs an inconclusive result. The problem is\nsolved by an efficient and rigorous monitoring algorithm. This algorithm\nperforms a forward simulation of a continuous-time dynamical system, detects a\nset of time intervals in which the atomic propositions hold, and validates the\nproperty by propagating the time intervals. In each step, the continuous state\nat a certain time is enclosed by an interval vector that is proven to contain a\nunique solution. We experimentally demonstrate the utility of the proposed\nmethod in formal analysis of nonlinear and complex continuous systems.\n", "versions": [{"version": "v1", "created": "Sun, 7 Feb 2016 16:36:31 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Ishii", "Daisuke", ""], ["Yonezaki", "Naoki", ""], ["Goldsztejn", "Alexandre", ""]]}, {"id": "1602.02504", "submitter": "Eero Siivola", "authors": "Eero Siivola, Seppo Sierla, Hannu Niemist\\\"o, Tommi Karhela and\n  Valeriy Vyatkin", "title": "Requirement verification in simulation-based automation testing", "comments": "4 pages, 2 figures. Added IEEE copyright notice", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The emergence of the Industrial Internet results in an increasing number of\ncomplicated temporal interdependencies between automation systems and the\nprocesses to be controlled. There is a need for verification methods that scale\nbetter than formal verification methods and which are more exact than testing.\nSimulation-based runtime verification is proposed as such a method, and an\napplication of Metric temporal logic is presented as a contribution. The\npractical scalability of the proposed approach is validated against a\nproduction process designed by an industrial partner, resulting in the\ndiscovery of requirement violations.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2016 09:30:22 GMT"}, {"version": "v2", "created": "Tue, 7 Jun 2016 07:02:43 GMT"}, {"version": "v3", "created": "Tue, 25 Apr 2017 12:31:11 GMT"}], "update_date": "2017-04-26", "authors_parsed": [["Siivola", "Eero", ""], ["Sierla", "Seppo", ""], ["Niemistö", "Hannu", ""], ["Karhela", "Tommi", ""], ["Vyatkin", "Valeriy", ""]]}, {"id": "1602.02670", "submitter": "Wolfgang Dvo\\v{r}\\'ak", "authors": "Krishnendu Chatterjee and Wolfgang Dvo\\v{r}\\'ak and Monika Henzinger\n  and Veronika Loitzenbauer", "title": "Model and Objective Separation with Conditional Lower Bounds:\n  Disjunction is Harder than Conjunction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a model of a system and an objective, the model-checking question asks\nwhether the model satisfies the objective. We study polynomial-time problems in\ntwo classical models, graphs and Markov Decision Processes (MDPs), with respect\nto several fundamental $\\omega$-regular objectives, e.g., Rabin and Streett\nobjectives. For many of these problems the best-known upper bounds are\nquadratic or cubic, yet no super-linear lower bounds are known. In this work\nour contributions are two-fold: First, we present several improved algorithms,\nand second, we present the first conditional super-linear lower bounds based on\nwidely believed assumptions about the complexity of CNF-SAT and combinatorial\nBoolean matrix multiplication. A separation result for two models with respect\nto an objective means a conditional lower bound for one model that is strictly\nhigher than the existing upper bound for the other model, and similarly for two\nobjectives with respect to a model. Our results establish the following\nseparation results: (1) A separation of models (graphs and MDPs) for\ndisjunctive queries of reachability and B\\\"uchi objectives. (2) Two kinds of\nseparations of objectives, both for graphs and MDPs, namely, (2a) the\nseparation of dual objectives such as reachability/safety (for disjunctive\nquestions) and Streett/Rabin objectives, and (2b) the separation of conjunction\nand disjunction of multiple objectives of the same type such as safety,\nB\\\"uchi, and coB\\\"uchi. In summary, our results establish the first model and\nobjective separation results for graphs and MDPs for various classical\n$\\omega$-regular objectives. Quite strikingly, we establish conditional lower\nbounds for the disjunction of objectives that are strictly higher than the\nexisting upper bounds for the conjunction of the same objectives.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2016 17:51:52 GMT"}], "update_date": "2016-02-09", "authors_parsed": [["Chatterjee", "Krishnendu", ""], ["Dvořák", "Wolfgang", ""], ["Henzinger", "Monika", ""], ["Loitzenbauer", "Veronika", ""]]}, {"id": "1602.02743", "submitter": "Michael Brand", "authors": "Michael Brand and David L. Dowe", "title": "The IMP game: Learnability, approximability and adversarial learning\n  beyond $\\Sigma^0_1$", "comments": "23 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.AI cs.CC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a problem set-up we call the Iterated Matching Pennies (IMP)\ngame and show that it is a powerful framework for the study of three problems:\nadversarial learnability, conventional (i.e., non-adversarial) learnability and\napproximability. Using it, we are able to derive the following theorems. (1) It\nis possible to learn by example all of $\\Sigma^0_1 \\cup \\Pi^0_1$ as well as\nsome supersets; (2) in adversarial learning (which we describe as a\npursuit-evasion game), the pursuer has a winning strategy (in other words,\n$\\Sigma^0_1$ can be learned adversarially, but $\\Pi^0_1$ not); (3) some\nlanguages in $\\Pi^0_1$ cannot be approximated by any language in $\\Sigma^0_1$.\n  We show corresponding results also for $\\Sigma^0_i$ and $\\Pi^0_i$ for\narbitrary $i$.\n", "versions": [{"version": "v1", "created": "Sun, 7 Feb 2016 04:17:17 GMT"}], "update_date": "2016-02-10", "authors_parsed": [["Brand", "Michael", ""], ["Dowe", "David L.", ""]]}, {"id": "1602.03208", "submitter": "George Barmpalias Dr", "authors": "George Barmpalias and Nan Fang and Andrew Lewis-Pye", "title": "Optimal asymptotic bounds on the oracle use in computations from\n  Chaitin's Omega", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.CC cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chaitin's number Omega is the halting probability of a universal prefix-free\nmachine, and although it depends on the underlying enumeration of prefix-free\nmachines, it is always Turing-complete. It can be observed, in fact, that for\nevery computably enumerable (c.e.) real, there exists a Turing functional via\nwhich Omega computes it, and such that the number of bits of omega that are\nneeded for the computation of the first n bits of the given number (i.e. the\nuse on argument n) is bounded above by a computable function h(n) = n+o(n). We\ncharacterise the asymptotic upper bounds on the use of Chaitin's omega in\noracle computations of halting probabilities (i.e. c.e. reals). We show that\nthe following two conditions are equivalent for any computable function h such\nthat h(n)-n is non-decreasing: (1) h(n)-n is an information content measure,\n(2) for every c.e. real there exists a Turing functional via which omega\ncomputes the real with use bounded by h. We also give a similar\ncharacterisation with respect to computations of c.e. sets from Omega, by\nshowing that the following are equivalent for any computable non-decreasing\nfunction g: (1) g is an information-content measure, (2) for every c.e. set A,\nOmega computes A with use bounded by g. Further results and some connections\nwith Solovay functions are given.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2016 08:59:56 GMT"}, {"version": "v2", "created": "Tue, 3 May 2016 08:29:04 GMT"}], "update_date": "2016-05-04", "authors_parsed": [["Barmpalias", "George", ""], ["Fang", "Nan", ""], ["Lewis-Pye", "Andrew", ""]]}, {"id": "1602.03419", "submitter": "Dmitry Chistikov", "authors": "Mohamed Faouzi Atig, Dmitry Chistikov, Piotr Hofman, K Narayan Kumar,\n  Prakash Saivasan, Georg Zetzsche", "title": "Complexity of regular abstractions of one-counter languages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the computational and descriptional complexity of the following\ntransformation: Given a one-counter automaton (OCA) A, construct a\nnondeterministic finite automaton (NFA) B that recognizes an abstraction of the\nlanguage L(A): its (1) downward closure, (2) upward closure, or (3) Parikh\nimage.\n  For the Parikh image over a fixed alphabet and for the upward and downward\nclosures, we find polynomial-time algorithms that compute such an NFA. For the\nParikh image with the alphabet as part of the input, we find a quasi-polynomial\ntime algorithm and prove a completeness result: we construct a sequence of OCA\nthat admits a polynomial-time algorithm iff there is one for all OCA.\n  For all three abstractions, it was previously unknown if appropriate NFA of\nsub-exponential size exist.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2016 15:51:18 GMT"}], "update_date": "2016-02-11", "authors_parsed": [["Atig", "Mohamed Faouzi", ""], ["Chistikov", "Dmitry", ""], ["Hofman", "Piotr", ""], ["Kumar", "K Narayan", ""], ["Saivasan", "Prakash", ""], ["Zetzsche", "Georg", ""]]}, {"id": "1602.03592", "submitter": "EPTCS", "authors": "Hans H\\\"uttel (Department of Computer Science, Aalborg University),\n  Nuno Pratas (Department of Electronic Systems, Aalborg University)", "title": "Broadcast and aggregation in BBC", "comments": "In Proceedings PLACES 2015, arXiv:1602.03254", "journal-ref": "EPTCS 203, 2016, pp. 15-28", "doi": "10.4204/EPTCS.203.2", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In distributed systems, where multi-party communication is essential, two\ncommunication paradigms are ever present: (1) one-to-many, commonly denoted as\nbroadcast; and (2) many-to-one denoted as aggregation or collection.\n  In this paper we present the BBC process calculus, which inherently models\nthe broadcast and aggregation communication modes. We then apply this process\ncalculus to reason on hierarchical network structure and provide examples on\nits expressive power.\n", "versions": [{"version": "v1", "created": "Thu, 11 Feb 2016 01:20:01 GMT"}], "update_date": "2016-02-12", "authors_parsed": [["Hüttel", "Hans", "", "Department of Computer Science, Aalborg University"], ["Pratas", "Nuno", "", "Department of Electronic Systems, Aalborg University"]]}, {"id": "1602.03593", "submitter": "EPTCS", "authors": "Mariangiola Dezani-Ciancaglini (Universit\\`a di Torino, Italy), Silvia\n  Ghilezan (Univerzitet u Novom Sadu, Serbia), Svetlana Jak\\v{s}i\\'c\n  (Univerzitet u Novom Sadu, Serbia), Jovanka Pantovi\\'c (Univerzitet u Novom\n  Sadu, Serbia), Nobuko Yoshida (Imperial College London, UK)", "title": "Precise subtyping for synchronous multiparty sessions", "comments": "In Proceedings PLACES 2015, arXiv:1602.03254", "journal-ref": "EPTCS 203, 2016, pp. 29-43", "doi": "10.4204/EPTCS.203.3", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The notion of subtyping has gained an important role both in theoretical and\napplicative domains: in lambda and concurrent calculi as well as in programming\nlanguages. The soundness and the completeness, together referred to as the\npreciseness of subtyping, can be considered from two different points of view:\noperational and denotational. The former preciseness has been recently\ndeveloped with respect to type safety, i.e. the safe replacement of a term of a\nsmaller type when a term of a bigger type is expected. The latter preciseness\nis based on the denotation of a type which is a mathematical object that\ndescribes the meaning of the type in accordance with the denotations of other\nexpressions from the language. The result of this paper is the operational and\ndenotational preciseness of the subtyping for a synchronous multiparty session\ncalculus. The novelty of this paper is the introduction of characteristic\nglobal types to prove the operational completeness.\n", "versions": [{"version": "v1", "created": "Thu, 11 Feb 2016 01:20:10 GMT"}], "update_date": "2016-02-12", "authors_parsed": [["Dezani-Ciancaglini", "Mariangiola", "", "Università di Torino, Italy"], ["Ghilezan", "Silvia", "", "Univerzitet u Novom Sadu, Serbia"], ["Jakšić", "Svetlana", "", "Univerzitet u Novom Sadu, Serbia"], ["Pantović", "Jovanka", "", "Univerzitet u Novom\n  Sadu, Serbia"], ["Yoshida", "Nobuko", "", "Imperial College London, UK"]]}, {"id": "1602.03595", "submitter": "EPTCS", "authors": "Franco Barbanera (Dipartimento di Matematica e Informatica, University\n  of Catania), Mariangiola Dezani-Ciancaglini (Dipartimento di Informatica,\n  University of Torino), Ivan Lanese (Dipartimento di Informatica - Scienza e\n  Ingegneria, University of Bologna/INRIA), Ugo de'Liguoro (Dipartimento di\n  Informatica, University of Torino)", "title": "Retractable Contracts", "comments": "In Proceedings PLACES 2015, arXiv:1602.03254", "journal-ref": "EPTCS 203, 2016, pp. 61-72", "doi": "10.4204/EPTCS.203.5", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In calculi for modelling communication protocols, internal and external\nchoices play dual roles. Two external choices can be viewed naturally as dual\ntoo, as they represent an agreement between the communicating parties. If the\ninteraction fails, the past agreements are good candidates as points where to\nroll back, in order to take a different agreement. We propose a variant of\ncontracts with synchronous rollbacks to agreement points in case of deadlock.\nThe new calculus is equipped with a compliance relation which is shown to be\ndecidable.\n", "versions": [{"version": "v1", "created": "Thu, 11 Feb 2016 01:20:29 GMT"}], "update_date": "2016-02-12", "authors_parsed": [["Barbanera", "Franco", "", "Dipartimento di Matematica e Informatica, University\n  of Catania"], ["Dezani-Ciancaglini", "Mariangiola", "", "Dipartimento di Informatica,\n  University of Torino"], ["Lanese", "Ivan", "", "Dipartimento di Informatica - Scienza e\n  Ingegneria, University of Bologna/INRIA"], ["de'Liguoro", "Ugo", "", "Dipartimento di\n  Informatica, University of Torino"]]}, {"id": "1602.03596", "submitter": "EPTCS", "authors": "Silvia Ghilezan (University of Novi Sad, Serbia), Svetlana\n  Jak\\v{s}i\\'c (University of Novi Sad, Serbia), Jovanka Pantovi\\'c (University\n  of Novi Sad, Serbia), Jorge A. P\\'erez (University of Groningen, The\n  Netherlands), Hugo Torres Vieira (IMT Institute for Advanced Studies Lucca,\n  Italy)", "title": "A Typed Model for Dynamic Authorizations", "comments": "In Proceedings PLACES 2015, arXiv:1602.03254", "journal-ref": "EPTCS 203, 2016, pp. 73-84", "doi": "10.4204/EPTCS.203.6", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security requirements in distributed software systems are inherently dynamic.\nIn the case of authorization policies, resources are meant to be accessed only\nby authorized parties, but the authorization to access a resource may be\ndynamically granted/yielded. We describe ongoing work on a model for specifying\ncommunication and dynamic authorization handling. We build upon the pi-calculus\nso as to enrich communication-based systems with authorization specification\nand delegation; here authorizations regard channel usage and delegation refers\nto the act of yielding an authorization to another party. Our model includes:\n(i) a novel scoping construct for authorization, which allows to specify\nauthorization boundaries, and (ii) communication primitives for authorizations,\nwhich allow to pass around authorizations to act on a given channel. An\nauthorization error may consist in, e.g., performing an action along a name\nwhich is not under an appropriate authorization scope. We introduce a typing\ndiscipline that ensures that processes never reduce to authorization errors,\neven when authorizations are dynamically delegated.\n", "versions": [{"version": "v1", "created": "Thu, 11 Feb 2016 01:20:38 GMT"}], "update_date": "2016-02-12", "authors_parsed": [["Ghilezan", "Silvia", "", "University of Novi Sad, Serbia"], ["Jakšić", "Svetlana", "", "University of Novi Sad, Serbia"], ["Pantović", "Jovanka", "", "University\n  of Novi Sad, Serbia"], ["Pérez", "Jorge A.", "", "University of Groningen, The\n  Netherlands"], ["Vieira", "Hugo Torres", "", "IMT Institute for Advanced Studies Lucca,\n  Italy"]]}, {"id": "1602.03597", "submitter": "EPTCS", "authors": "Ignacio Vissani (Department of computing, School of Science,\n  Universidad de Buenos Aires), Carlos Gustavo Lopez Pombo (Department of\n  computing, School of Science, Universidad de Buenos Aires and Consejo\n  Nacional de Investigaciones Cient\\'ificas y Tecnol\\'ogicas), Emilio Tuosto\n  (Department of Computer Science, University of Leicester)", "title": "Communicating machines as a dynamic binding mechanism of services", "comments": "In Proceedings PLACES 2015, arXiv:1602.03254", "journal-ref": "EPTCS 203, 2016, pp. 85-98", "doi": "10.4204/EPTCS.203.7", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed software is becoming more and more dynamic to support\napplications able to respond and adapt to the changes of their execution\nenvironment. For instance, service-oriented computing (SOC) envisages\napplications as services running over globally available computational\nresources where discovery and binding between them is transparently performed\nby a middleware. Asynchronous Relational Networks (ARNs) is a well-known formal\norchestration model, based on hypergraphs, for the description of\nservice-oriented software artefacts. Choreography and orchestration are the two\nmain design principles for the development of distributed software. In this\nwork, we propose Communicating Relational Networks (CRNs), which is a variant\nof ARNs, but relies on choreographies for the characterisation of the\ncommunicational aspects of a software artefact, and for making their automated\nanalysis more efficient.\n", "versions": [{"version": "v1", "created": "Thu, 11 Feb 2016 01:20:48 GMT"}], "update_date": "2016-02-12", "authors_parsed": [["Vissani", "Ignacio", "", "Department of computing, School of Science,\n  Universidad de Buenos Aires"], ["Pombo", "Carlos Gustavo Lopez", "", "Department of\n  computing, School of Science, Universidad de Buenos Aires and Consejo\n  Nacional de Investigaciones Científicas y Tecnológicas"], ["Tuosto", "Emilio", "", "Department of Computer Science, University of Leicester"]]}, {"id": "1602.04123", "submitter": "Norihiro Yamada", "authors": "Norihiro Yamada", "title": "Game-theoretic Interpretation of Type Theory Part II: Uniqueness of\n  Identity Proofs and Univalence", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO math.CO math.CT math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present paper, based on the previous work (Part I), we present a game\nsemantics for the intensional variant of intuitionistic type theory that\nrefutes the principle of uniqueness of identity proofs and validates the\nunivalence axiom, though we do not interpret non-trivial higher propositional\nequalities. Specifically, following the historic groupoid interpretation by\nHofmann and Streicher, we equip predicative games in Part I with a groupoid\nstructure, which gives rise to the notion of (predicative) gamoids. Roughly,\ngamoids are \"games with (computational) equalities specified\", which interpret\nsubtleties in Id-types. We then formulate a category with families of\npredicative gamoids, equipped with dependent product, dependent sum, and\nId-types as well as universes, which forms a concrete instance of the groupoid\nmodel. We believe that this work is an important stepping-stone towards a\ncomplete interpretation of homotopy type theory.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2016 17:04:37 GMT"}, {"version": "v2", "created": "Tue, 5 Apr 2016 13:49:30 GMT"}], "update_date": "2016-04-06", "authors_parsed": [["Yamada", "Norihiro", ""]]}, {"id": "1602.04184", "submitter": "Andrew Critch PhD", "authors": "Andrew Critch", "title": "Parametric Bounded L\\\"ob's Theorem and Robust Cooperation of Bounded\n  Agents", "comments": "Corrected typos, added grant acknowledgement, updated citation style\n  to author-year", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  L\\\"ob's theorem and G\\\"odel's theorems make predictions about the behavior of\nsystems capable of self-reference with unbounded computational resources with\nwhich to write and evaluate proofs. However, in the real world, systems capable\nof self-reference will have limited memory and processing speed, so in this\npaper we introduce an effective version of L\\\"ob's theorem which is applicable\ngiven such bounded resources. These results have powerful implications for the\ngame theory of bounded agents who are able to write proofs about themselves and\none another, including the capacity to out-perform classical Nash equilibria\nand correlated equilibria, attaining mutually cooperative program equilibrium\nin the Prisoner's Dilemma. Previous cooperative program equilibria studied by\nTennenholtz (2004) and Fortnow (2009) have depended on tests for program\nequality, a fragile condition, whereas \"L\\\"obian\" cooperation is much more\nrobust and agnostic of the opponent's implementation.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2016 19:51:54 GMT"}, {"version": "v2", "created": "Fri, 19 Feb 2016 06:23:45 GMT"}, {"version": "v3", "created": "Thu, 31 Mar 2016 21:55:25 GMT"}, {"version": "v4", "created": "Mon, 4 Apr 2016 19:59:04 GMT"}, {"version": "v5", "created": "Wed, 24 Aug 2016 05:22:57 GMT"}], "update_date": "2016-08-25", "authors_parsed": [["Critch", "Andrew", ""]]}, {"id": "1602.04268", "submitter": "Robert Kent", "authors": "Robert E. Kent", "title": "The ERA of FOLE: Superstructure", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses the representation of ontologies in the first-order\nlogical environment FOLE (Kent 2013). An ontology defines the primitives with\nwhich to model the knowledge resources for a community of discourse (Gruber\n2009). These primitives, consisting of classes, relationships and properties,\nare represented by the ERA (entity-relationship-attribute) data model (Chen\n1976). An ontology uses formal axioms to constrain the interpretation of these\nprimitives. In short, an ontology specifies a logical theory. This paper is the\nsecond in a series of three papers that provide a rigorous mathematical\nrepresentation for the ERA data model in particular, and ontologies in general,\nwithin the first-order logical environment FOLE. The first two papers show how\nFOLE represents the formalism and semantics of (many-sorted) first-order logic\nin a classification form corresponding to ideas discussed in the Information\nFlow Framework (IFF). In particular, the first paper (Kent 2015) provided a\n\"foundation\" that connected elements of the ERA data model with components of\nthe first-order logical environment FOLE, and this second paper provides a\n\"superstructure\" that extends FOLE to the formalisms of first-order logic. The\nthird paper will define an \"interpretation\" of FOLE in terms of the\ntransformational passage, first described in (Kent 2013), from the\nclassification form of first-order logic to an equivalent interpretation form,\nthereby defining the formalism and semantics of first-order logical/relational\ndatabase systems (Kent 2011). The FOLE representation follows a conceptual\nstructures approach, that is completely compatible with Formal Concept Analysis\n(Ganter and Wille 1999) and Information Flow (Barwise and Seligman 1997).\n", "versions": [{"version": "v1", "created": "Sat, 13 Feb 2016 00:03:39 GMT"}], "update_date": "2016-02-16", "authors_parsed": [["Kent", "Robert E.", ""]]}, {"id": "1602.04294", "submitter": "Cristian-Ioan Vasile", "authors": "Cristian-Ioan Vasile, Derya Aksaray, Calin Belta", "title": "Time Window Temporal Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces time window temporal logic (TWTL), a rich expressivity\nlanguage for describing various time bounded specifications. In particular, the\nsyntax and semantics of TWTL enable the compact representation of serial tasks,\nwhich are typically seen in robotics and control applications. This paper also\ndiscusses the relaxation of TWTL formulae with respect to deadlines of tasks.\nEfficient automata-based frameworks to solve synthesis, verification and\nlearning problems are also presented. The key ingredient to the presented\nsolution is an algorithm to translate a TWTL formula to an annotated finite\nstate automaton that encodes all possible temporal relaxations of the\nspecification. Case studies illustrating the expressivity of the logic and the\nproposed algorithms are included.\n", "versions": [{"version": "v1", "created": "Sat, 13 Feb 2016 07:10:59 GMT"}], "update_date": "2016-02-16", "authors_parsed": [["Vasile", "Cristian-Ioan", ""], ["Aksaray", "Derya", ""], ["Belta", "Calin", ""]]}, {"id": "1602.04339", "submitter": "Alexander Maletzky", "authors": "Alexander Maletzky", "title": "Mathematical Theory Exploration in Theorema: Reduction Rings", "comments": "submitted to CICM 2015 (Conference on Intelligent Computer\n  Mathematics)", "journal-ref": null, "doi": "10.1007/978-3-319-42547-4_1", "report-no": null, "categories": "cs.SC cs.LO math.AC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present the first-ever computer formalization of the theory\nof Gr\\\"obner bases in reduction rings, which is an important theory in\ncomputational commutative algebra, in Theorema. Not only the formalization, but\nalso the formal verification of all results has already been fully completed by\nnow; this, in particular, includes the generic implementation and correctness\nproof of Buchberger's algorithm in reduction rings. Thanks to the seamless\nintegration of proving and computing in Theorema, this implementation can now\nbe used to compute Gr\\\"obner bases in various different domains directly within\nthe system. Moreover, a substantial part of our formalization is made up solely\nby \"elementary theories\" such as sets, numbers and tuples that are themselves\nindependent of reduction rings and may therefore be used as the foundations of\nfuture theory explorations in Theorema.\n  In addition, we also report on two general-purpose Theorema tools we\ndeveloped for an efficient and convenient exploration of mathematical theories:\nan interactive proving strategy and a \"theory analyzer\" that already proved\nextremely useful when creating large structured knowledge bases.\n", "versions": [{"version": "v1", "created": "Sat, 13 Feb 2016 14:32:18 GMT"}], "update_date": "2016-07-22", "authors_parsed": [["Maletzky", "Alexander", ""]]}, {"id": "1602.04353", "submitter": "Michael Pinsker", "authors": "Libor Barto, Michael Pinsker", "title": "The algebraic dichotomy conjecture for infinite domain Constraint\n  Satisfaction Problems", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that an $\\omega$-categorical core structure primitively positively\ninterprets all finite structures with parameters if and only if some stabilizer\nof its polymorphism clone has a homomorphism to the clone of projections, and\nthat this happens if and only if its polymorphism clone does not contain\noperations $\\alpha$, $\\beta$, $s$ satisfying the identity $\\alpha\ns(x,y,x,z,y,z) \\approx \\beta s(y,x,z,x,z,y)$.\n  This establishes an algebraic criterion equivalent to the conjectured\nborderline between P and NP-complete CSPs over reducts of finitely bounded\nhomogenous structures, and accomplishes one of the steps of a proposed strategy\nfor reducing the infinite domain CSP dichotomy conjecture to the finite case.\n  Our theorem is also of independent mathematical interest, characterizing a\ntopological property of any $\\omega$-categorical core structure (the existence\nof a continuous homomorphism of a stabilizer of its polymorphism clone to the\nprojections) in purely algebraic terms (the failure of an identity as above).\n", "versions": [{"version": "v1", "created": "Sat, 13 Feb 2016 16:38:37 GMT"}], "update_date": "2016-02-16", "authors_parsed": [["Barto", "Libor", ""], ["Pinsker", "Michael", ""]]}, {"id": "1602.04382", "submitter": "Ralph Matthes", "authors": "Jos\\'e Esp\\'irito Santo, Ralph Matthes, Lu\\'is Pinto", "title": "A Coinductive Approach to Proof Search through Typed Lambda-Calculi", "comments": "43 pages; comparison with v3: precise discussion of how to understand\n  coinductive syntax mathematically, presentation of the typing system as a\n  logic of coinductive proofs, and rephrasing of results of the paper in terms\n  of soundness and completeness", "journal-ref": null, "doi": "10.1016/j.apal.2021.103026", "report-no": null, "categories": "cs.LO math.LO", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In reductive proof search, proofs are naturally generalized by solutions,\ncomprising all possibly infinite structures generated by locally correct,\nbottom-up application of inference rules. We propose an extension of the\nCurry-Howard paradigm of representation, from proofs to solutions: to represent\nsolutions by possibly infinite terms of a dedicated lambda-calculus. This new,\ncomprehensive approach to proof search is exemplified with the sequent calculus\nLJT for intuitionistic implication logic. A finitary representation is\nproposed, comprising lambda-terms extended with a formal greatest fixed point,\nand a type system that can be seen as a logic of coinductive proofs. In the\nfinitary system, fixed-point variables enjoy a relaxed form of binding that\nallows the detection of cycles through the type system. Formal sums are used to\nexpress alternatives in the search process. Moreover, formal sums are used in\nthe coinductive syntax to define \"decontraction\" (contraction bottom-up) - an\noperation whose theory we initiate in this paper. As a semantics, we assign a\ncoinductive lambda-term to each finitary term. The main result is the existence\nof an equivalent finitary representation for any full solution space expressed\ncoinductively. This result is the main ingredient in the proof that our logic\nof coinductive proofs is sound and complete with respect to the coinductive\nsemantics. These results are the foundation for an original approach to proof\nsearch, where the search builds the finitary representation of the full\nsolution space, and the a posteriori analysis typically consisting in applying\na syntax-directed procedure or function. The paper illustrates this for proof\nsearch and inhabitation problems in the simply-typed lambda-calculus, reviewing\nresults detailed elsewhere, and including new results that obtain extensive\ngeneralizations of the so-called monatomic theorem.\n", "versions": [{"version": "v1", "created": "Sat, 13 Feb 2016 21:22:03 GMT"}, {"version": "v2", "created": "Thu, 28 Jul 2016 21:58:38 GMT"}, {"version": "v3", "created": "Tue, 4 Aug 2020 17:15:08 GMT"}, {"version": "v4", "created": "Thu, 29 Jul 2021 12:51:56 GMT"}], "update_date": "2021-07-30", "authors_parsed": [["Santo", "José Espírito", ""], ["Matthes", "Ralph", ""], ["Pinto", "Luís", ""]]}, {"id": "1602.04530", "submitter": "Thorsten Wissmann", "authors": "Thierry Coquand and Bassel Mannaa", "title": "The Independence of Markov's Principle in Type Theory", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 13, Issue 3 (August\n  15, 2017) lmcs:3859", "doi": "10.23638/LMCS-13(3:10)2017", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we show that Markov's principle is not derivable in dependent\ntype theory with natural numbers and one universe. One way to prove this would\nbe to remark that Markov's principle does not hold in a sheaf model of type\ntheory over Cantor space, since Markov's principle does not hold for the\ngeneric point of this model. Instead we design an extension of type theory,\nwhich intuitively extends type theory by the addition of a generic point of\nCantor space. We then show the consistency of this extension by a normalization\nargument. Markov's principle does not hold in this extension, and it follows\nthat it cannot be proved in type theory.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2016 00:11:27 GMT"}, {"version": "v2", "created": "Wed, 17 Feb 2016 22:31:47 GMT"}, {"version": "v3", "created": "Sun, 1 May 2016 08:27:38 GMT"}, {"version": "v4", "created": "Tue, 29 Nov 2016 08:30:38 GMT"}, {"version": "v5", "created": "Mon, 22 May 2017 09:02:04 GMT"}, {"version": "v6", "created": "Mon, 14 Aug 2017 09:53:38 GMT"}], "update_date": "2017-08-16", "authors_parsed": [["Coquand", "Thierry", ""], ["Mannaa", "Bassel", ""]]}, {"id": "1602.04568", "submitter": "Bruno Woltzenlogel Paleo", "authors": "John Slaney, Bruno Woltzenlogel Paleo", "title": "Conflict Resolution: a First-Order Resolution Calculus with Decision\n  Literals and Conflict-Driven Clause Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper defines the (first-order) conflict resolution calculus: an\nextension of the resolution calculus inspired by techniques used in modern\nSAT-solvers. The resolution inference is restricted to (first-order)\nunit-propagation and the calculus is extended with a mechanism for assuming\ndecision literals and a new inference rule for clause learning, which is a\nfirst-order generalization of the propositional conflict-driven clause learning\n(CDCL) procedure. The calculus is sound (because it can be simulated by natural\ndeduction) and refutationally complete (because it can simulate resolution),\nand these facts are proven in detail here.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2016 06:28:53 GMT"}], "update_date": "2016-02-16", "authors_parsed": [["Slaney", "John", ""], ["Paleo", "Bruno Woltzenlogel", ""]]}, {"id": "1602.04744", "submitter": "EPTCS", "authors": "Miriam Backens, Simon Perdrix, Quanlong Wang", "title": "A Simplified Stabilizer ZX-calculus", "comments": "In Proceedings QPL 2016, arXiv:1701.00242", "journal-ref": "EPTCS 236, 2017, pp. 1-20", "doi": "10.4204/EPTCS.236.1", "report-no": null, "categories": "quant-ph cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The stabilizer ZX-calculus is a rigorous graphical language for reasoning\nabout quantum mechanics.The language is sound and complete: a stabilizer\nZX-diagram can be transformed into another one if and only if these two\ndiagrams represent the same quantum evolution or quantum state. We show that\nthe stabilizer ZX-calculus can be simplified, removing unnecessary equations\nwhile keeping only the essential axioms which potentially capture fundamental\nstructures of quantum mechanics. We thus give a significantly smaller set of\naxioms and prove that meta-rules like 'colour symmetry' and 'upside-down\nsymmetry', which were considered as axioms in previous versions of the\nlanguage, can in fact be derived. In particular, we show that the additional\nsymbol and one of the rules which had been recently introduced to keep track of\nscalars (diagrams with no inputs or outputs) are not necessary.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2016 17:37:19 GMT"}, {"version": "v2", "created": "Tue, 3 Jan 2017 11:13:33 GMT"}], "update_date": "2017-01-04", "authors_parsed": [["Backens", "Miriam", ""], ["Perdrix", "Simon", ""], ["Wang", "Quanlong", ""]]}, {"id": "1602.04860", "submitter": "Thorsten Wissmann", "authors": "G. A. Kavvos", "title": "Dual-Context Calculi for Modal Logic", "comments": "Full version of article previously presented at LICS 2017 (see\n  arXiv:1602.04860v4 or doi: 10.1109/LICS.2017.8005089)", "journal-ref": "Logical Methods in Computer Science, Volume 16, Issue 3 (August\n  19, 2020) lmcs:6722", "doi": "10.23638/LMCS-16(3:10)2020", "report-no": null, "categories": "cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We present natural deduction systems and associated modal lambda calculi for\nthe necessity fragments of the normal modal logics K, T, K4, GL and S4. These\nsystems are in the dual-context style: they feature two distinct zones of\nassumptions, one of which can be thought as modal, and the other as\nintuitionistic. We show that these calculi have their roots in in sequent\ncalculi. We then investigate their metatheory, equip them with a confluent and\nstrongly normalizing notion of reduction, and show that they coincide with the\nusual Hilbert systems up to provability. Finally, we investigate a categorical\nsemantics which interprets the modality as a product-preserving functor.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2016 23:03:24 GMT"}, {"version": "v2", "created": "Sat, 7 Jan 2017 13:03:59 GMT"}, {"version": "v3", "created": "Fri, 3 Mar 2017 16:21:21 GMT"}, {"version": "v4", "created": "Wed, 16 Aug 2017 00:04:52 GMT"}, {"version": "v5", "created": "Sun, 5 Aug 2018 00:13:05 GMT"}, {"version": "v6", "created": "Mon, 30 Mar 2020 15:55:37 GMT"}, {"version": "v7", "created": "Sun, 2 Aug 2020 14:14:00 GMT"}, {"version": "v8", "created": "Tue, 18 Aug 2020 13:43:05 GMT"}], "update_date": "2021-02-10", "authors_parsed": [["Kavvos", "G. A.", ""]]}, {"id": "1602.04934", "submitter": "Arne Meier", "authors": "Arne Meier and Sebastian Ordyniak and M. S. Ramanujan and Irena\n  Schindler", "title": "Strong Backdoors for Linear Temporal Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present paper we introduce the notion of strong backdoors into the\nfield of temporal logic for the CNF-fragment of linear temporal logic\nintroduced by Fisher. We study the parameterised complexity of the\nsatisfiability problem parameterised by the size of the backdoor. We\ndistinguish between backdoor detection and evaluation of backdoors into the\nfragments of horn and krom formulas. Here we classify the operator fragments of\nglobally-operators for past or future, and the combination of both. Detection\nis shown to be in FPT whereas the complexity of evaluation behaves different.\nWe show that for krom formulas the problem is paraNP-complete. For horn\nformulas the complexity is shown to be either fixed parameter tractable or\nparaNP-complete depending on the considered operator fragment.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 08:03:41 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Meier", "Arne", ""], ["Ordyniak", "Sebastian", ""], ["Ramanujan", "M. S.", ""], ["Schindler", "Irena", ""]]}, {"id": "1602.05010", "submitter": "Baltasar Tranc\\'on y Widemann", "authors": "Baltasar Tranc\\'on y Widemann", "title": "Higher-Order Recursion Abstraction: How to Make Ackermann, Knuth and\n  Conway Look Like a Bunch of Primitives, Figuratively Speaking", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  The Ackermann function is a famous total recursive binary function on the\nnatural numbers. It is the archetypal example of such a function that is not\nprimitive recursive, in the sense of classical recursion theory. However, and\nin seeming contradiction, there are generalized notions of total recursion, for\nwhich the Ackermann function is in fact primitive recursive, and often featured\nas a witness for the additional power gained by the generalization. Here, we\ninvestigate techniques for finding and analyzing the primitive form of\ncomplicated recursive functions, namely also Knuth's and Conway's arrow\nnotations, in particular by recursion abstraction, in a framework of functional\nprogram transformation.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 13:25:15 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Widemann", "Baltasar Trancón y", ""]]}, {"id": "1602.05028", "submitter": "Ilya Zakirzyanov", "authors": "Vladimir Ulyantsev, Ilya Zakirzyanov and Anatoly Shalyto", "title": "Symmetry Breaking Predicates for SAT-based DFA Identification", "comments": "14 pages, 9 figures, 5 tables, submitted to Journal of Computer and\n  System Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.AI cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It was shown before that the NP-hard problem of deterministic finite automata\n(DFA) identification can be effectively translated to Boolean satisfiability\n(SAT). Modern SAT-solvers can tackle hard DFA identification instances\nefficiently. We present a technique to reduce the problem search space by\nenforcing an enumeration of DFA states in depth-first search (DFS) or\nbreadth-first search (BFS) order. We propose symmetry breaking predicates,\nwhich can be added to Boolean formulae representing various DFA identification\nproblems. We show how to apply this technique to DFA identification from both\nnoiseless and noisy data. Also we propose a method to identify all automata of\nthe desired size. The proposed approach outperforms the current\nstate-of-the-art DFASAT method for DFA identification from noiseless data. A\nbig advantage of the proposed approach is that it allows to determine exactly\nthe existence or non-existence of a solution of the noisy DFA identification\nproblem unlike metaheuristic approaches such as genetic algorithms.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 14:26:24 GMT"}, {"version": "v2", "created": "Wed, 17 Feb 2016 12:10:21 GMT"}], "update_date": "2016-02-22", "authors_parsed": [["Ulyantsev", "Vladimir", ""], ["Zakirzyanov", "Ilya", ""], ["Shalyto", "Anatoly", ""]]}, {"id": "1602.05040", "submitter": "Martin L\\\"uck", "authors": "Martin L\\\"uck", "title": "Axiomatizations of Team Logics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a modular approach, we lift Hilbert-style proof systems for propositional,\nmodal and first-order logic to generalized systems for their respective\nteam-based extensions. We obtain sound and complete axiomatizations for the\ndependence-free fragment FO(~) of V\\\"a\\\"an\\\"anen's first-order team logic TL,\nfor propositional team logic PTL, quantified propositional team logic QPTL,\nmodal team logic MTL, and for the corresponding logics of dependence,\nindependence, inclusion and exclusion.\n  As a crucial step in the completeness proof, we show that the above logics\nadmit, in a particular sense, a semantics-preserving elimination of modalities\nand quantifiers from formulas.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 14:59:43 GMT"}, {"version": "v2", "created": "Mon, 26 Mar 2018 11:58:54 GMT"}], "update_date": "2018-03-28", "authors_parsed": [["Lück", "Martin", ""]]}, {"id": "1602.05045", "submitter": "Felix Klein", "authors": "Felix Klein and Martin Zimmermann", "title": "Prompt Delay", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Delay games are two-player games of infinite duration in which one player may\ndelay her moves to obtain a lookahead on her opponent's moves. Recently, such\ngames with quantitative winning conditions in weak MSO with the unbounding\nquantifier were studied, but their properties turned out to be unsatisfactory.\nIn particular, unbounded lookahead is in general necessary. Here, we study\ndelay games with winning conditions given by Prompt-LTL, Linear Temporal Logic\nequipped with a parameterized eventually operator whose scope is bounded. Our\nmain result shows that solving Prompt-LTL delay games is complete for\ntriply-exponential time. Furthermore, we give tight triply-exponential bounds\non the necessary lookahead and on the scope of the parameterized eventually\noperator. Thus, we identify Prompt-LTL as the first known class of well-behaved\nquantitative winning conditions for delay games. Finally, we show that applying\nour techniques to delay games with \\omega-regular winning conditions answers\nopen questions in the cases where the winning conditions are given by\nnon-deterministic, universal, or alternating automata.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 15:07:23 GMT"}, {"version": "v2", "created": "Mon, 10 Oct 2016 06:15:54 GMT"}], "update_date": "2016-10-11", "authors_parsed": [["Klein", "Felix", ""], ["Zimmermann", "Martin", ""]]}, {"id": "1602.05113", "submitter": "Nils Jansen", "authors": "Tim Quatmann, Christian Dehnert, Nils Jansen, Sebastian Junges,\n  Joost-Pieter Katoen", "title": "Parameter Synthesis for Markov Models: Faster Than Ever", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a simple technique for verifying probabilistic models whose\ntransition probabilities are parametric. The key is to replace parametric\ntransitions by nondeterministic choices of extremal values. Analysing the\nresulting parameter-free model using off-the-shelf means yields (refinable)\nlower and upper bounds on probabilities of regions in the parameter space. The\ntechnique outperforms the existing analysis of parametric Markov chains by\nseveral orders of magnitude regarding both run-time and scalability. Its beauty\nis its applicability to various probabilistic models. It in particular provides\nthe first sound and feasible method for performing parameter synthesis of\nMarkov decision processes.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 17:55:37 GMT"}, {"version": "v2", "created": "Thu, 26 May 2016 18:38:29 GMT"}], "update_date": "2016-05-27", "authors_parsed": [["Quatmann", "Tim", ""], ["Dehnert", "Christian", ""], ["Jansen", "Nils", ""], ["Junges", "Sebastian", ""], ["Katoen", "Joost-Pieter", ""]]}, {"id": "1602.05151", "submitter": "J\\\"urgen Koslowski", "authors": "Petr Jancar", "title": "Branching Bisimilarity of Normed BPA Processes as a Rational Monoid", "comments": "The version accepted to LMCS", "journal-ref": "Logical Methods in Computer Science, Volume 13, Issue 4 (November\n  28, 2017) lmcs:4097", "doi": "10.23638/LMCS-13(4:17)2017", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents an elaborated and simplified version of the structural\nresult for branching bisimilarity on normed BPA (Basic Process Algebra)\nprocesses that was the crux of a conference paper by Czerwinski and Jancar\n(arxiv 7/2014 and LiCS 2015). That paper focused on the computational\ncomplexity, and a NEXPTIME-upper bound has been derived; the authors built on\nthe ideas by Fu (ICALP 2013), and strengthened his decidability result. Later\nHe and Huang announced the EXPTIME-completeness of this problem (arxiv 1/2015,\nand LiCS 2015), giving a technical proof for the EXPTIME membership. He and\nHuang indirectly acknowledge the decomposition ideas by Czerwinski and Jancar\non which they also built, but it is difficult to separate their starting point\nfrom their new ideas. One aim here is to present the previous decomposition\nresult of Czerwinski and Jancar in a technically new framework, noting that\nbranching bisimulation equivalence on normed BPA processes corresponds to a\nrational monoid (in the sense of [Sakarovitch, 1987]); in particular it is\nshown that the mentioned equivalence can be decided by normal-form computing\ndeterministic finite transducers. Another aim is to provide a complete\ndescription, including an informal overview, that should also make clear how\nFu's ideas were used, and to give all proofs in a form that should be readable\nand easily verifiable.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 19:47:51 GMT"}, {"version": "v2", "created": "Tue, 27 Jun 2017 13:41:55 GMT"}, {"version": "v3", "created": "Mon, 27 Nov 2017 01:14:45 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Jancar", "Petr", ""]]}, {"id": "1602.05400", "submitter": "Ekaterina Komendantskaya Dr", "authors": "Ekaterina Komendantskaya and John Power", "title": "Category theoretic semantics for theorem proving in logic programming:\n  embracing the laxness", "comments": "20 pages, CMCS 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A propositional logic program $P$ may be identified with a $P_fP_f$-coalgebra\non the set of atomic propositions in the program. The corresponding\n$C(P_fP_f)$-coalgebra, where $C(P_fP_f)$ is the cofree comonad on $P_fP_f$,\ndescribes derivations by resolution. Using lax semantics, that correspondence\nmay be extended to a class of first-order logic programs without existential\nvariables. The resulting extension captures the proofs by term-matching\nresolution in logic programming. Refining the lax approach, we further extend\nit to arbitrary logic programs. We also exhibit a refinement of Bonchi and\nZanasi's saturation semantics for logic programming that complements lax\nsemantics.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2016 13:18:32 GMT"}], "update_date": "2016-02-18", "authors_parsed": [["Komendantskaya", "Ekaterina", ""], ["Power", "John", ""]]}, {"id": "1602.05409", "submitter": "Pengming Wang", "authors": "Anuj Dawar, Pengming Wang", "title": "Lasserre Lower Bounds and Definability of Semidefinite Programming", "comments": "Substantial update and edits on 25th September 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  For a large class of optimization problems, namely those that can be\nexpressed as finite-valued constraint satisfaction problems (VCSPs), we\nestablish a dichotomy on the number of levels of the Lasserre hierarchy of\nsemi-definite programs (SDPs) that are required to solve the problem exactly.\nIn particular, we show that if a finite-valued constraint problem is not solved\nexactly by its basic linear programming relaxation, it is also not solved\nexactly by any sub-linear number of levels of the Lasserre hierarchy. The lower\nbounds are established through logical undefinability results. We show that the\nlinear programming relaxation of the problem, as well as the SDP corresponding\nto any fixed level of the Lasserre hierarchy is interpretable in a VCSP\ninstance by means of formulas of fixed-point logic with counting. We also show\nthat the solution of an SDP can be expressed in this logic. Together, these\nresults give a way of translating lower bounds on the number of variables\nrequired in counting logic to express a VCSP into lower bounds on the number of\nlevels required in the Lasserre hierarchy to eliminate the integrality gap. As\na special case, we obtain the same dichotomy for the class of MAXCSP problems,\ngeneralizing some earlier Lasserre lower bound results of Schoenebeck.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2016 13:45:38 GMT"}, {"version": "v2", "created": "Sun, 25 Sep 2016 17:31:17 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Dawar", "Anuj", ""], ["Wang", "Pengming", ""]]}, {"id": "1602.05547", "submitter": "Patrick Totzke", "authors": "Stefan G\\\"oller, Christoph Haase, Ranko Lazi\\'c and Patrick Totzke", "title": "A Polynomial-Time Algorithm for Reachability in Branching VASS in\n  Dimension One", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Branching VASS (BVASS) generalise vector addition systems with states by\nallowing for special branching transitions that can non-deterministically\ndistribute a counter value between two control states. A run of a BVASS\nconsequently becomes a tree, and reachability is to decide whether a given\nconfiguration is the root of a reachability tree. This paper shows\nP-completeness of reachability in BVASS in dimension one, the first\ndecidability result for reachability in a subclass of BVASS known so far.\nMoreover, we show that coverability and boundedness in BVASS in dimension one\nare P-complete as well.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2016 19:43:04 GMT"}, {"version": "v2", "created": "Fri, 6 May 2016 18:30:54 GMT"}], "update_date": "2016-05-09", "authors_parsed": [["Göller", "Stefan", ""], ["Haase", "Christoph", ""], ["Lazić", "Ranko", ""], ["Totzke", "Patrick", ""]]}, {"id": "1602.05635", "submitter": "Yehia Abd Alrahman", "authors": "Yehia Abd Alrahman, Rocco De Nicola, Michele Loreti", "title": "On the Power of Attribute-based Communication", "comments": "Extended Technical Report, All proofs are included in the appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In open systems, i.e. systems operating in an environment that they cannot\ncontrol and with components that may join or leave, behaviors can arise as side\neffects of intensive components interaction. Finding ways to understand and\ndesign these systems and, most of all, to model the interactions of their\ncomponents, is a difficult but important endeavor. To tackle these issues, we\npresent AbC, a calculus for attribute-based communication. An AbC system\nconsists of a set of parallel agents each of which is equipped with a set of\nattributes. Communication takes place in an implicit multicast fashion, and\ninteractions among agents are dynamically established by taking into account\n\"connections\" as determined by predicates over the attributes of agents. First,\nthe syntax and the semantics of the calculus are presented, then expressiveness\nand effectiveness of AbC are demonstrated both in terms of modeling scenarios\nfeaturing collaboration, reconfiguration, and adaptation and of the possibility\nof encoding channel-based interactions and other interaction patterns.\nBehavioral equivalences for AbC are introduced for establishing formal\nrelationships between different descriptions of the same system.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2016 00:39:35 GMT"}], "update_date": "2016-02-19", "authors_parsed": [["Alrahman", "Yehia Abd", ""], ["De Nicola", "Rocco", ""], ["Loreti", "Michele", ""]]}, {"id": "1602.05681", "submitter": "Justin Hsu", "authors": "Gilles Barthe, Marco Gaboardi, Benjamin Gr\\'egoire, Justin Hsu,\n  Pierre-Yves Strub", "title": "A program logic for union bounds", "comments": null, "journal-ref": null, "doi": "10.4230/LIPIcs.ICALP.2016.107", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a probabilistic Hoare logic aHL based on the union bound, a tool\nfrom basic probability theory. While the union bound is simple, it is an\nextremely common tool for analyzing randomized algorithms. In formal\nverification terms, the union bound allows flexible and compositional reasoning\nover possible ways an algorithm may go wrong. It also enables a clean\nseparation between reasoning about probabilities and reasoning about events,\nwhich are expressed as standard first-order formulas in our logic. Notably,\nassertions in our logic are non-probabilistic, even though we can conclude\nprobabilistic facts from the judgments.\n  Our logic can also prove accuracy properties for interactive programs, where\nthe program must produce intermediate outputs as soon as pieces of the input\narrive, rather than accessing the entire input at once. This setting also\nenables adaptivity, where later inputs may depend on earlier intermediate\noutputs. We show how to prove accuracy for several examples from the\ndifferential privacy literature, both interactive and non-interactive.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2016 05:46:25 GMT"}, {"version": "v2", "created": "Mon, 9 May 2016 20:20:08 GMT"}, {"version": "v3", "created": "Fri, 8 Nov 2019 06:05:16 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Barthe", "Gilles", ""], ["Gaboardi", "Marco", ""], ["Grégoire", "Benjamin", ""], ["Hsu", "Justin", ""], ["Strub", "Pierre-Yves", ""]]}, {"id": "1602.05819", "submitter": "Michael Pinsker", "authors": "Manuel Bodirsky, Barnaby Martin, Michael Pinsker, Andr\\'as Pongr\\'acz", "title": "Constraint satisfaction problems for reducts of homogeneous graphs", "comments": "41 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For $n\\geq 3$, let $(H_n, E)$ denote the $n$-th Henson graph, i.e., the\nunique countable homogeneous graph with exactly those finite graphs as induced\nsubgraphs that do not embed the complete graph on $n$ vertices. We show that\nfor all structures $\\Gamma$ with domain $H_n$ whose relations are first-order\ndefinable in $(H_n,E)$ the constraint satisfaction problem for $\\Gamma$ is\neither in P or is NP-complete.\n  We moreover show a similar complexity dichotomy for all structures whose\nrelations are first-order definable in a homogeneous graph whose reflexive\nclosure is an equivalence relation.\n  Together with earlier results, in particular for the random graph, this\ncompletes the complexity classification of constraint satisfaction problems of\nstructures first-order definable in countably infinite homogeneous graphs: all\nsuch problems are either in P or NP-complete.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2016 14:50:13 GMT"}, {"version": "v2", "created": "Thu, 16 Nov 2017 17:36:47 GMT"}, {"version": "v3", "created": "Mon, 11 Jan 2021 11:33:59 GMT"}], "update_date": "2021-01-12", "authors_parsed": [["Bodirsky", "Manuel", ""], ["Martin", "Barnaby", ""], ["Pinsker", "Michael", ""], ["Pongrácz", "András", ""]]}, {"id": "1602.05829", "submitter": "Eugene Goldberg", "authors": "Eugene Goldberg", "title": "Property Checking Without Invariant Generation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a procedure for proving safety properties. This procedure is\nbased on a technique called Partial Quantifier Elimination (PQE). In contrast\nto complete quantifier elimination, in PQE, only a part of the formula is taken\nout of the scope of quantifiers. So, PQE can be dramatically more efficient\nthan complete quantifier elimination. The appeal of our procedure is twofold.\nFirst, it can prove a property without generating an inductive invariant.\nSecond, it employs depth-first search and so can be used to find deep bugs.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2016 15:13:36 GMT"}, {"version": "v2", "created": "Wed, 27 May 2020 09:45:37 GMT"}, {"version": "v3", "created": "Thu, 29 Oct 2020 14:26:29 GMT"}], "update_date": "2020-10-30", "authors_parsed": [["Goldberg", "Eugene", ""]]}, {"id": "1602.05928", "submitter": "Mickael Randour", "authors": "Patricia Bouyer, Nicolas Markey, Mickael Randour, Arnaud Sangnier,\n  Daniel Stan", "title": "Reachability in Networks of Register Protocols under Stochastic\n  Schedulers", "comments": "Extended version of ICALP 2016 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the almost-sure reachability problem in a distributed system\nobtained as the asynchronous composition of N copies (called processes) of the\nsame automaton (called protocol), that can communicate via a shared register\nwith finite domain. The automaton has two types of transitions:\nwrite-transitions update the value of the register, while read-transitions move\nto a new state depending on the content of the register. Non-determinism is\nresolved by a stochastic scheduler. Given a protocol, we focus on almost-sure\nreachability of a target state by one of the processes. The answer to this\nproblem naturally depends on the number N of processes. However, we prove that\nour setting has a cut-off property: the answer to the almost-sure reachability\nproblem is constant when N is large enough; we then develop an EXPSPACE\nalgorithm deciding whether this constant answer is positive or negative.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2016 19:58:35 GMT"}, {"version": "v2", "created": "Wed, 4 May 2016 08:07:41 GMT"}, {"version": "v3", "created": "Thu, 5 May 2016 06:26:48 GMT"}], "update_date": "2016-05-06", "authors_parsed": [["Bouyer", "Patricia", ""], ["Markey", "Nicolas", ""], ["Randour", "Mickael", ""], ["Sangnier", "Arnaud", ""], ["Stan", "Daniel", ""]]}, {"id": "1602.05940", "submitter": "Benedikt Bollig", "authors": "Benedikt Bollig", "title": "One-Counter Automata with Counter Observability", "comments": "This version presents a more modular proof of closure under\n  complementation and the PSPACE upper bound, by establishing a link with\n  visibly one-counter automata. The register part has been removed (as it was\n  only loosely related). There is a new section on the relation between\n  one-counter automata and strong automata", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a one-counter automaton (OCA), one can produce a letter from some finite\nalphabet, increment and decrement the counter by one, or compare it with\nconstants up to some threshold. It is well-known that universality and language\ninclusion for OCAs are undecidable. In this paper, we consider OCAs with\ncounter observability: Whenever the automaton produces a letter, it outputs the\ncurrent counter value along with it. Hence, its language is now a set of words\nover an infinite alphabet. We show that universality and inclusion for that\nmodel are PSPACE-complete, thus no harder than the corresponding problems for\nfinite automata. In fact, by establishing a link with visibly one-counter\nautomata, we show that OCAs with counter observability are effectively\ndeterminizable and closed under all boolean operations.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2016 20:50:13 GMT"}, {"version": "v2", "created": "Tue, 19 Jul 2016 09:56:59 GMT"}], "update_date": "2016-07-20", "authors_parsed": [["Bollig", "Benedikt", ""]]}, {"id": "1602.06043", "submitter": "Ross Horne", "authors": "Ross Horne, Alwen Tiu, Bogdan Aman, Gabriel Ciobanu", "title": "De Morgan Dual Nominal Quantifiers Modelling Private Names in\n  Non-Commutative Logic", "comments": "Submitted for review 18/2/2016; accepted CONCUR 2016; extended\n  version submitted to journal 27/11/2017", "journal-ref": "ACM Trans. Comput. Log. 20(4): 22:1-22:44 (2019)", "doi": "10.1145/3325821", "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper explores the proof theory necessary for recommending an expressive\nbut decidable first-order system, named MAV1, featuring a de Morgan dual pair\nof nominal quantifiers. These nominal quantifiers called `new' and `wen' are\ndistinct from the self-dual Gabbay-Pitts and Miller-Tiu nominal quantifiers.\nThe novelty of these nominal quantifiers is they are polarised in the sense\nthat `new' distributes over positive operators while `wen' distributes over\nnegative operators. This greater control of bookkeeping enables private names\nto be modelled in processes embedded as formulae in MAV1. The technical\nchallenge is to establish a cut elimination result, from which essential\nproperties including the transitivity of implication follow. Since the system\nis defined using the calculus of structures, a generalisation of the sequent\ncalculus, novel techniques are employed. The proof relies on an intricately\ndesigned multiset-based measure of the size of a proof, which is used to guide\na normalisation technique called splitting. The presence of equivariance, which\nswaps successive quantifiers, induces complex inter-dependencies between\nnominal quantifiers, additive conjunction and multiplicative operators in the\nproof of splitting. Every rule is justified by an example demonstrating why the\nrule is necessary for soundly embedding processes and ensuring that cut\nelimination holds.\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2016 04:35:26 GMT"}, {"version": "v2", "created": "Mon, 27 Nov 2017 08:51:55 GMT"}, {"version": "v3", "created": "Wed, 15 Jan 2020 10:55:10 GMT"}], "update_date": "2020-01-16", "authors_parsed": [["Horne", "Ross", ""], ["Tiu", "Alwen", ""], ["Aman", "Bogdan", ""], ["Ciobanu", "Gabriel", ""]]}, {"id": "1602.06052", "submitter": "Johannes Klaus Fichte", "authors": "Johannes K. Fichte and Arne Meier and Irina Schindler", "title": "Strong Backdoors for Default Logic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.AI cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce a notion of backdoors to Reiter's propositional\ndefault logic and study structural properties of it. Also we consider the\nproblems of backdoor detection (parameterised by the solution size) as well as\nbackdoor evaluation (parameterised by the size of the given backdoor), for\nvarious kinds of target classes (cnf, horn, krom, monotone, identity). We show\nthat backdoor detection is fixed-parameter tractable for the considered target\nclasses, and backdoor evaluation is either fixed-parameter tractable, in\npara-DP2 , or in para-NP, depending on the target class.\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2016 06:42:48 GMT"}], "update_date": "2016-02-22", "authors_parsed": [["Fichte", "Johannes K.", ""], ["Meier", "Arne", ""], ["Schindler", "Irina", ""]]}, {"id": "1602.06220", "submitter": "G. A. Kavvos", "authors": "G. A. Kavvos", "title": "Kleene's Two Kinds of Recursion", "comments": "Contains slight errors. A corrected version can be found as Chapter 2\n  of DPhil thesis (arXiv:1712.09302)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is an elementary expository article regarding the application of\nKleene's Recursion Theorems in making definitions by recursion. Whereas the\nSecond Recursion Theorem (SRT) is applicable in a first-order setting, the\nFirst Recursion Theorem (FRT) requires a higher-order setting. In some cases\nboth theorems are applicable, but one is stronger than the other: the FRT\nalways produces least fixed points, but this is not always the case with the\nSRT. Nevertheless, an old result by Rogers allows us to bridge this gap by\nsubtly redefining the implementation of a higher-order functional in order to\nbring it to a `standard form.'\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2016 16:59:35 GMT"}, {"version": "v2", "created": "Sat, 4 Aug 2018 23:13:57 GMT"}], "update_date": "2018-08-07", "authors_parsed": [["Kavvos", "G. A.", ""]]}, {"id": "1602.06221", "submitter": "Marco Peressotti", "authors": "Marco Peressotti", "title": "Endofunctors modelling higher-order behaviours", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we show how the abstract behaviours of higher-order systems can\nbe modelled as final coalgebras of suitable behavioural functors. These\nfunctors have the challenging peculiarity to be circularly defined with their\nown final coalgebra. Our main contribution is a general construction for\ndefining these functors, solving this circularity which is the essence of\nhigher-order behaviours. This characterisation is syntax agnostic. To achieve\nthis property, we shift from term passing to behaviour passing: in the former\nhigher-order is expressed by passing around syntactic objects (such as terms or\nprocesses) as representations of behaviours whereas the former ditches the\nsyntactic encoding altogether and works directly with behaviours i.e. semantic\nobjects. From this perspective, the former can be seen as syntactic\nhigher-order whereas the later as semantic higher-order.\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2016 17:05:56 GMT"}, {"version": "v2", "created": "Mon, 11 Jul 2016 09:55:06 GMT"}], "update_date": "2016-07-12", "authors_parsed": [["Peressotti", "Marco", ""]]}, {"id": "1602.06284", "submitter": "Sean Tull", "authors": "Sean Tull", "title": "Operational Theories of Physics as Categories", "comments": "30 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math-ph cs.LO math.CT math.MP quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new approach to the study of operational theories of physics\nusing category theory. We define a generalisation of the (causal)\noperational-probabilistic theories of Chiribella et al. and establish their\ncorrespondence with our new notion of an operational category. Our work is\nbased on effectus theory, a recently developed area of categorical logic, to\nwhich we give an operational interpretation, demonstrating its relevance to the\nmodelling of general probabilistic theories.\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2016 20:40:19 GMT"}], "update_date": "2016-02-22", "authors_parsed": [["Tull", "Sean", ""]]}, {"id": "1602.06420", "submitter": "Jonathan Warrell", "authors": "Jonathan H. Warrell", "title": "A Probabilistic Dependent Type System based on Non-Deterministic Beta\n  Reduction", "comments": "15 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce Probabilistic Dependent Type Systems (PDTS) via a functional\nlanguage based on a subsystem of intuitionistic type theory including dependent\nsums and products, which is expanded to include stochastic functions. We\nprovide a sampling-based semantics for the language based on non-deterministic\nbeta reduction. Further, we derive a probabilistic logic from the PDTS\nintroduced as a direct result of the Curry-Howard isomorphism. The\nprobabilistic logic derived is shown to provide a universal representation for\nfinite discrete distributions.\n", "versions": [{"version": "v1", "created": "Sat, 20 Feb 2016 15:31:27 GMT"}, {"version": "v2", "created": "Tue, 23 Feb 2016 23:05:10 GMT"}], "update_date": "2016-02-25", "authors_parsed": [["Warrell", "Jonathan H.", ""]]}, {"id": "1602.06771", "submitter": "Aleks Kissinger", "authors": "Filippo Bonchi, Fabio Gadducci, Aleks Kissinger, Pawel Sobocinski,\n  Fabio Zanasi", "title": "Rewriting modulo symmetric monoidal structure", "comments": "preprint. 32 pages", "journal-ref": null, "doi": "10.1145/2933575.2935316", "report-no": null, "categories": "math.CT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  String diagrams are a powerful and intuitive graphical syntax for terms of\nsymmetric monoidal categories (SMCs). They find many applications in computer\nscience and are becoming increasingly relevant in other fields such as physics\nand control theory.\n  An important role in many such approaches is played by equational theories of\ndiagrams, typically oriented and applied as rewrite rules. This paper lays a\ncomprehensive foundation of this form of rewriting. We interpret diagrams\ncombinatorially as typed hypergraphs and establish the precise correspondence\nbetween diagram rewriting modulo the laws of SMCs on the one hand and double\npushout (DPO) rewriting of hypergraphs, subject to a soundness condition called\nconvexity, on the other. This result rests on a more general characterisation\ntheorem in which we show that typed hypergraph DPO rewriting amounts to diagram\nrewriting modulo the laws of SMCs with a chosen special Frobenius structure.\n  We illustrate our approach with a proof of termination for the theory of\nnon-commutative bimonoids.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2016 13:43:35 GMT"}, {"version": "v2", "created": "Tue, 23 Feb 2016 15:01:09 GMT"}], "update_date": "2016-12-01", "authors_parsed": [["Bonchi", "Filippo", ""], ["Gadducci", "Fabio", ""], ["Kissinger", "Aleks", ""], ["Sobocinski", "Pawel", ""], ["Zanasi", "Fabio", ""]]}, {"id": "1602.06897", "submitter": "Jorge Fandinno", "authors": "Pedro Cabalar and Jorge Fandinno", "title": "Enablers and Inhibitors in Causal Justifications of Logic Programs", "comments": null, "journal-ref": null, "doi": "10.1017/S1471068416000107", "report-no": null, "categories": "cs.LO cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To appear in Theory and Practice of Logic Programming (TPLP). In this paper\nwe propose an extension of logic programming (LP) where each default literal\nderived from the well-founded model is associated to a justification\nrepresented as an algebraic expression. This expression contains both causal\nexplanations (in the form of proof graphs built with rule labels) and terms\nunder the scope of negation that stand for conditions that enable or disable\nthe application of causal rules. Using some examples, we discuss how these new\nconditions, we respectively call \"enablers\" and \"inhibitors\", are intimately\nrelated to default negation and have an essentially different nature from\nregular cause-effect relations. The most important result is a formal\ncomparison to the recent algebraic approaches for justifications in LP:\n\"Why-not Provenance\" (WnP) and \"Causal Graphs\" (CG). We show that the current\napproach extends both WnP and CG justifications under the Well-Founded\nSemantics and, as a byproduct, we also establish a formal relation between\nthese two approaches.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2016 19:18:54 GMT"}], "update_date": "2016-05-11", "authors_parsed": [["Cabalar", "Pedro", ""], ["Fandinno", "Jorge", ""]]}, {"id": "1602.06987", "submitter": "\\\"Amin Baumeler", "authors": "\\\"Amin Baumeler and Stefan Wolf", "title": "Causality - Complexity - Consistency: Can Space-Time Be Based on Logic\n  and Computation?", "comments": "17 pages, 16 figures, small corrections", "journal-ref": "In Renner R., Stupar S. (eds) Time in Physics (Birkh\\\"auser, Cham,\n  2017)", "doi": "10.1007/978-3-319-68655-4_6", "report-no": null, "categories": "quant-ph cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The difficulty of explaining non-local correlations in a fixed causal\nstructure sheds new light on the old debate on whether space and time are to be\nseen as fundamental. Refraining from assuming space-time as given a priori has\na number of consequences. First, the usual definitions of randomness depend on\na causal structure and turn meaningless. So motivated, we propose an intrinsic,\nphysically motivated measure for the randomness of a string of bits: its length\nminus its normalized work value, a quantity we closely relate to its Kolmogorov\ncomplexity (the length of the shortest program making a universal Turing\nmachine output this string). We test this alternative concept of randomness for\nthe example of non-local correlations, and we end up with a reasoning that\nleads to similar conclusions as in, but is conceptually more direct than, the\nprobabilistic view since only the outcomes of measurements that can actually\nall be carried out together are put into relation to each other. In the same\ncontext-free spirit, we connect the logical reversibility of an evolution to\nthe second law of thermodynamics and the arrow of time. Refining this, we end\nup with a speculation on the emergence of a space-time structure on bit strings\nin terms of data-compressibility relations. Finally, we show that logical\nconsistency, by which we replace the abandoned causality, it strictly weaker a\nconstraint than the latter in the multi-party case.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2016 22:35:48 GMT"}, {"version": "v2", "created": "Fri, 11 Mar 2016 12:51:32 GMT"}, {"version": "v3", "created": "Fri, 12 Jan 2018 11:30:36 GMT"}], "update_date": "2018-01-15", "authors_parsed": [["Baumeler", "Ämin", ""], ["Wolf", "Stefan", ""]]}, {"id": "1602.07115", "submitter": "Christian Sternagel", "authors": "Christian Sternagel and Thomas Sternagel", "title": "Level-Confluence of 3-CTRSs in Isabelle/HOL", "comments": "In Proceedings of the 4th International Workshop on Confluence (IWC\n  2015)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an Isabelle/HOL formalization of an earlier result by Suzuki,\nMiddeldorp, and Ida; namely that a certain class of conditional rewrite systems\nis level-confluent. Our formalization is basically along the lines of the\noriginal proof, from which we deviate mostly in the level of detail as well as\nconcerning some basic definitions.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2016 10:55:56 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Sternagel", "Christian", ""], ["Sternagel", "Thomas", ""]]}, {"id": "1602.07455", "submitter": "Ying-ping Chen", "authors": "Li-An Yang, Jui-Pin Liu, Chao-Hong Chen, Ying-ping Chen", "title": "Automatically Proving Mathematical Theorems with Evolutionary Algorithms\n  and Proof Assistants", "comments": "Accepted by 2016 IEEE Congress on Evolutionary Computation (CEC\n  2016), part of 2016 IEEE World Congress on Computational Intelligence (IEEE\n  WCCI 2016)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical theorems are human knowledge able to be accumulated in the form\nof symbolic representation, and proving theorems has been considered\nintelligent behavior. Based on the BHK interpretation and the Curry-Howard\nisomorphism, proof assistants, software capable of interacting with human for\nconstructing formal proofs, have been developed in the past several decades.\nSince proofs can be considered and expressed as programs, proof assistants\nsimplify and verify a proof by computationally evaluating the program\ncorresponding to the proof. Thanks to the transformation from logic to\ncomputation, it is now possible to generate or search for formal proofs\ndirectly in the realm of computation. Evolutionary algorithms, known to be\nflexible and versatile, have been successfully applied to handle a variety of\nscientific and engineering problems in numerous disciplines for also several\ndecades. Examining the feasibility of establishing the link between\nevolutionary algorithms, as the program generator, and proof assistants, as the\nproof verifier, in order to automatically find formal proofs to a given logic\nsentence is the primary goal of this study. In the article, we describe in\ndetail our first, ad-hoc attempt to fully automatically prove theorems as well\nas the preliminary results. Ten simple theorems from various branches of\nmathematics were proven, and most of these theorems cannot be proven by using\nthe tactic auto alone in Coq, the adopted proof assistant. The implication and\npotential influence of this study are discussed, and the developed source code\nwith the obtained experimental results are released as open source.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2016 10:19:15 GMT"}, {"version": "v2", "created": "Fri, 15 Apr 2016 09:01:33 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Yang", "Li-An", ""], ["Liu", "Jui-Pin", ""], ["Chen", "Chao-Hong", ""], ["Chen", "Ying-ping", ""]]}, {"id": "1602.07486", "submitter": "Loredana Tec", "authors": "Flavio Ferrarotti, Klaus-Dieter Schewe, Loredana Tec, Qing Wang", "title": "A Complete Logic for Database Abstract State Machines", "comments": "To appear in The Logic Journal of the IGPL", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In database theory, the term $\\textit{database transformation}$ was used to\nrefer to a unifying treatment for computable queries and updates. Recently, it\nwas shown that non-deterministic database transformations can be captured\nexactly by a variant of ASMs, the so-called Database Abstract State Machines\n(DB-ASMs). In this article we present a logic for DB-ASMs, extending the logic\nof Nanchen and St\\\"ark for ASMs. In particular, we develop a rigorous proof\nsystem for the logic for DB-ASMs, which is proven to be sound and complete. The\nmost difficult challenge to be handled by the extension is a proper\nformalisation capturing non-determinism of database transformations and all its\nrelated features such as consistency, update sets or multisets associated with\nDB-ASM rules. As the database part of a state of database transformations is a\nfinite structure and DB-ASMs are restricted by allowing quantifiers only over\nthe database part of a state, we resolve this problem by taking update sets\nexplicitly into the logic, i.e. by using an additional modal operator $[X]$,\nwhere $X$ is interpreted as an update set $\\Delta$ generated by a DB-ASM rule.\nThe DB-ASM logic provides a powerful verification tool to study properties of\ndatabase transformations.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2016 12:59:07 GMT"}, {"version": "v2", "created": "Thu, 25 Feb 2016 12:27:50 GMT"}, {"version": "v3", "created": "Sun, 28 May 2017 10:40:05 GMT"}, {"version": "v4", "created": "Tue, 30 May 2017 20:10:46 GMT"}], "update_date": "2017-06-01", "authors_parsed": [["Ferrarotti", "Flavio", ""], ["Schewe", "Klaus-Dieter", ""], ["Tec", "Loredana", ""], ["Wang", "Qing", ""]]}, {"id": "1602.07509", "submitter": "Vasco Brattka", "authors": "Vasco Brattka", "title": "Computability and Analysis, a Historical Approach", "comments": "12 pages", "journal-ref": "in: Pursuit of the Universal, 12th Conference on Computability in\n  Europe, CiE 2016, Paris, France, June 27 - July 1, 2016, LNCS 9709, Springer,\n  pp. 45-57", "doi": "10.1007/978-3-319-40189-8_5", "report-no": null, "categories": "math.LO cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The history of computability theory and and the history of analysis are\nsurprisingly intertwined since the beginning of the twentieth century. For one,\n\\'Emil Borel discussed his ideas on computable real number functions in his\nintroduction to measure theory. On the other hand, Alan Turing had computable\nreal numbers in mind when he introduced his now famous machine model. Here we\nwant to focus on a particular aspect of computability and analysis, namely on\ncomputability properties of theorems from analysis. This is a topic that\nemerged already in early work of Turing, Specker and other pioneers of\ncomputable analysis and eventually leads us to the very recent project of\nclassifying the computational content of theorems in the Weihrauch lattice.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2016 14:00:45 GMT"}, {"version": "v2", "created": "Thu, 7 Apr 2016 20:27:53 GMT"}], "update_date": "2016-07-12", "authors_parsed": [["Brattka", "Vasco", ""]]}, {"id": "1602.07667", "submitter": "Raine Ronnholm", "authors": "Valentin Goranko, Antti Kuusisto, Raine R\\\"onnholm", "title": "Game-Theoretic Semantics for Alternating-Time Temporal Logic", "comments": "Preprint of a paper published in ACM Transactions on Computational\n  Logic, 19(3): 17:1-17:38, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce versions of game-theoretic semantics (GTS) for Alternating-Time\nTemporal Logic (ATL). In GTS, truth is defined in terms of existence of a\nwinning strategy in a semantic evaluation game, and thus the game-theoretic\nperspective appears in the framework of ATL on two semantic levels: on the\nobject level in the standard semantics of the strategic operators, and on the\nmeta-level where game-theoretic logical semantics is applied to ATL. We unify\nthese two perspectives into semantic evaluation games specially designed for\nATL. The game-theoretic perspective enables us to identify new variants of the\nsemantics of ATL based on limiting the time resources available to the verifier\nand falsifier in the semantic evaluation game. We introduce and analyse an\nunbounded and (ordinal) bounded GTS and prove these to be equivalent to the\nstandard (Tarski-style) compositional semantics. We show that in these both\nversions of GTS, truth of ATL formulae can always be determined in finite time,\ni.e., without constructing infinite paths. We also introduce a non-equivalent\nfinitely bounded semantics and argue that it is natural from both logical and\ngame-theoretic perspectives.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2016 20:30:56 GMT"}, {"version": "v2", "created": "Fri, 19 May 2017 20:42:09 GMT"}, {"version": "v3", "created": "Sat, 15 Jun 2019 14:32:50 GMT"}], "update_date": "2019-06-18", "authors_parsed": [["Goranko", "Valentin", ""], ["Kuusisto", "Antti", ""], ["Rönnholm", "Raine", ""]]}, {"id": "1602.08004", "submitter": "Arno Pauly", "authors": "Eike Neumann and Arno Pauly", "title": "A topological view on algebraic computation models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the topological aspects of some algebraic computation models,\nin particular the BSS-model. Our results can be seen as bounds on how different\nBSS-computability and computability in the sense of computable analysis can be.\nThe framework for this is Weihrauch reducibility. As a consequence of our\ncharacterizations, we establish that the solvability complexity index is\n(mostly) independent of the computational model, and that there thus is common\nground in the study of non-computability between the BSS and TTE setting.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2016 17:25:57 GMT"}, {"version": "v2", "created": "Fri, 17 Mar 2017 14:12:23 GMT"}], "update_date": "2017-03-20", "authors_parsed": [["Neumann", "Eike", ""], ["Pauly", "Arno", ""]]}, {"id": "1602.08260", "submitter": "M\\'aria Svore\\v{n}ov\\'a", "authors": "Eva Tesarova, Maria Svorenova, Jiri Barnat, Ivana Cerna", "title": "Optimal Observation Mode Scheduling for Systems under Temporal\n  Constraints", "comments": "Technical report accompanying ACC'16 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Autonomous control systems use various sensors to decrease the amount of\nuncertainty under which they operate. While providing partial observation of\nthe current state of the system, sensors require resources such as energy, time\nand communication. We consider discrete systems with non-deterministic\ntransitions and multiple observation modes. The observation modes provide\ndifferent information about the states of the system and are associated with\nnon-negative costs. We consider two control problems. First, we aim to\nconstruct a control and observation mode switching strategy that guarantees\nsatisfaction of a finite-time temporal property given as a formula of\nsyntactically co-safe fragment of LTL (scLTL) and at the same time, minimizes\nthe worst-case cost accumulated until the point of satisfaction. Second, the\nbounded version of the problem is considered, where the temporal property must\nbe satisfied within given finite time bound. We present correct and optimal\nsolutions to both problems and demonstrate their usability on a case study\nmotivated by robotic applications.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2016 10:06:30 GMT"}], "update_date": "2016-02-29", "authors_parsed": [["Tesarova", "Eva", ""], ["Svorenova", "Maria", ""], ["Barnat", "Jiri", ""], ["Cerna", "Ivana", ""]]}, {"id": "1602.08349", "submitter": "Luigi Santocanale", "authors": "Luigi Santocanale (LIF)", "title": "Relational lattices via duality", "comments": "Coalgebraic Methods in Computer Science 2016, Apr 2016, Eindhoven,\n  Netherlands", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.DB math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The natural join and the inner union combine in different ways tables of a\nrelational database. Tropashko [18] observed that these two operations are the\nmeet and join in a class of lattices-called the relational lattices- and\nproposed lattice theory as an alternative algebraic approach to databases.\nAiming at query optimization, Litak et al. [12] initiated the study of the\nequational theory of these lattices. We carry on with this project, making use\nof the duality theory developed in [16]. The contributions of this paper are as\nfollows. Let A be a set of column's names and D be a set of cell values; we\ncharacterize the dual space of the relational lattice R(D, A) by means of a\ngeneralized ultrametric space, whose elements are the functions from A to D,\nwith the P (A)-valued distance being the Hamming one but lifted to subsets of\nA. We use the dual space to present an equational axiomatization of these\nlattices that reflects the combinatorial properties of these generalized\nultrametric spaces: symmetry and pairwise completeness. Finally, we argue that\nthese equations correspond to combinatorial properties of the dual spaces of\nlattices, in a technical sense analogous of correspondence theory in modal\nlogic. In particular, this leads to an exact characterization of the finite\nlattices satisfying these equations.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2016 14:42:03 GMT"}], "update_date": "2016-02-29", "authors_parsed": [["Santocanale", "Luigi", "", "LIF"]]}, {"id": "1602.08361", "submitter": "Sebastien Tixeuil", "authors": "Pierre Courtieu (CEDRIC), Lionel Rieg, S\\'ebastien Tixeuil (LINCS,\n  NPA, IUF), Xavier Urbain (ENSIIE, LRI)", "title": "Certified Universal Gathering in $R^2$ for Oblivious Mobile Robots", "comments": "arXiv admin note: substantial text overlap with arXiv:1506.01603", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DS cs.LO cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a unified formal framework for expressing mobile robots models,\nprotocols, and proofs, and devise a protocol design/proof methodology dedicated\nto mobile robots that takes advantage of this formal framework. As a case\nstudy, we present the first formally certified protocol for oblivious mobile\nrobots evolving in a two-dimensional Euclidean space. In more details, we\nprovide a new algorithm for the problem of universal gathering mobile oblivious\nrobots (that is, starting from any initial configuration that is not bivalent,\nusing any number of robots, the robots reach in a finite number of steps the\nsame position, not known beforehand) without relying on a common orientation\nnor chirality. We give very strong guaranties on the correctness of our\nalgorithm by proving formally that it is correct, using the COQ proof\nassistant. This result demonstrates both the effectiveness of the approach to\nobtain new algorithms that use as few assumptions as necessary, and its\nmanageability since the amount of developed code remains human readable.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2016 15:16:21 GMT"}], "update_date": "2016-02-29", "authors_parsed": [["Courtieu", "Pierre", "", "CEDRIC"], ["Rieg", "Lionel", "", "LINCS,\n  NPA, IUF"], ["Tixeuil", "Sébastien", "", "LINCS,\n  NPA, IUF"], ["Urbain", "Xavier", "", "ENSIIE, LRI"]]}, {"id": "1602.08504", "submitter": "Valery Isaev", "authors": "Valery Isaev", "title": "Algebraic Presentations of Dependent Type Theories", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.LO math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose an abstract definition of dependent type theories\nas essentially algebraic theories. One of the main advantages of this\ndefinition is its composability: simple theories can be combined into more\ncomplex ones, and different properties of the resulting theory may be deduced\nfrom properties of the basic ones. We define a category of algebraic dependent\ntype theories which allows us not only to combine theories but also to consider\nequivalences between them. We also study models of such theories and show that\none can think of them as contextual categories with additional structure.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2016 21:05:05 GMT"}, {"version": "v2", "created": "Tue, 3 Jan 2017 11:35:31 GMT"}, {"version": "v3", "created": "Sat, 25 Mar 2017 11:53:29 GMT"}], "update_date": "2017-03-28", "authors_parsed": [["Isaev", "Valery", ""]]}, {"id": "1602.08620", "submitter": "Daniel Fremont", "authors": "Nathan Mull, Daniel J. Fremont, Sanjit A. Seshia", "title": "On the Hardness of SAT with Community Structure", "comments": "23 pages. Full version of a SAT 2016 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent attempts to explain the effectiveness of Boolean satisfiability (SAT)\nsolvers based on conflict-driven clause learning (CDCL) on large industrial\nbenchmarks have focused on the concept of community structure. Specifically,\nindustrial benchmarks have been empirically found to have good community\nstructure, and experiments seem to show a correlation between such structure\nand the efficiency of CDCL. However, in this paper we establish hardness\nresults suggesting that community structure is not sufficient to explain the\nsuccess of CDCL in practice. First, we formally characterize a property shared\nby a wide class of metrics capturing community structure, including\n\"modularity\". Next, we show that the SAT instances with good community\nstructure according to any metric with this property are still NP-hard.\nFinally, we study a class of random instances generated from the\n\"pseudo-industrial\" community attachment model of Gir\\'aldez-Cru and Levy. We\nprove that, with high probability, instances from this model that have\nrelatively few communities but are still highly modular require exponentially\nlong resolution proofs and so are hard for CDCL. We also present experimental\nevidence that our result continues to hold for instances with many more\ncommunities. This indicates that actual industrial instances easily solved by\nCDCL may have some other relevant structure not captured by the community\nattachment model.\n", "versions": [{"version": "v1", "created": "Sat, 27 Feb 2016 17:48:21 GMT"}, {"version": "v2", "created": "Wed, 20 Apr 2016 00:15:00 GMT"}, {"version": "v3", "created": "Mon, 30 May 2016 16:47:37 GMT"}, {"version": "v4", "created": "Sat, 13 Aug 2016 17:22:18 GMT"}], "update_date": "2016-08-16", "authors_parsed": [["Mull", "Nathan", ""], ["Fremont", "Daniel J.", ""], ["Seshia", "Sanjit A.", ""]]}, {"id": "1602.08739", "submitter": "David Spivak", "authors": "Joachim Kock and David I. Spivak", "title": "Homotopy composition of cospans", "comments": "4 pages. In this version: A more direct introduction and a additional\n  few details on the tubular neighborhood argument. Final version, to appear in\n  Commun. Contemp. Math", "journal-ref": "Commun. Contemp. Math. 19 (2017), 1650047", "doi": "10.1142/S0219199716500474", "report-no": null, "categories": "math.CT cs.LO math.AT quant-ph", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  It is well known that the category of finite sets and cospans, composed by\npushout, contains the universal {\\em special} commutative Frobenius algebra. In\nthis note we observe that the same construction yields also general commutative\nFrobenius algebras, if just the pushouts are changed to homotopy pushouts.\n", "versions": [{"version": "v1", "created": "Sun, 28 Feb 2016 16:54:12 GMT"}, {"version": "v2", "created": "Wed, 27 Apr 2016 13:39:45 GMT"}], "update_date": "2021-03-31", "authors_parsed": [["Kock", "Joachim", ""], ["Spivak", "David I.", ""]]}, {"id": "1602.08778", "submitter": "W{\\l}odzimierz Drabent", "authors": "W{\\l}odzimierz Drabent", "title": "Proving completeness of logic programs with the cut", "comments": "17 pages", "journal-ref": "final version: Formal Aspects of Computing, 2017, 29(1),155-172", "doi": "10.1007/s00165-016-0392-0", "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Completeness of a logic program means that the program produces all the\nanswers required by its specification. The cut is an important construct of\nprogramming language Prolog. It prunes part of the search space, this may\nresult in a loss of completeness. This paper proposes a way of proving\ncompleteness of programs with the cut. The semantics of the cut is formalized\nby describing how SLD-trees are pruned. A sufficient condition for completeness\nis presented, proved sound, and illustrated by examples.\n", "versions": [{"version": "v1", "created": "Sun, 28 Feb 2016 22:27:25 GMT"}], "update_date": "2020-01-03", "authors_parsed": [["Drabent", "Włodzimierz", ""]]}, {"id": "1602.08903", "submitter": "Juan Carlos Nieves", "authors": "Mauricio Osorio, Juan Carlos Nieves", "title": "Range-based argumentation semantics as 2-valued models", "comments": "16 pages, to appear in Theory and Practice of Logic Programming\n  (TPLP)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Characterizations of semi-stable and stage extensions in terms of 2-valued\nlogical models are presented. To this end, the so-called GL-supported and\nGL-stage models are defined. These two classes of logical models are logic\nprogramming counterparts of the notion of range which is an established concept\nin argumentation semantics.\n", "versions": [{"version": "v1", "created": "Mon, 29 Feb 2016 10:55:12 GMT"}], "update_date": "2016-03-01", "authors_parsed": [["Osorio", "Mauricio", ""], ["Nieves", "Juan Carlos", ""]]}, {"id": "1602.08912", "submitter": "Arno Pauly", "authors": "St\\'ephane Le Roux and Arno Pauly", "title": "Extending Finite Memory Determinacy to Multiplayer Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that under some general conditions the finite memory determinacy of a\nclass of two-player win/lose games played on finite graphs implies the\nexistence of a Nash equilibrium built from finite memory strategies for the\ncorresponding class of multi-player multi-outcome games. This generalizes a\nprevious result by Brihaye, De Pril and Schewe. We provide a number of example\nthat separate the various criteria we explore.\n  Our proofs are generally constructive, that is, provide upper bounds for the\nmemory required, as well as algorithms to compute the relevant Nash equilibria.\n", "versions": [{"version": "v1", "created": "Mon, 29 Feb 2016 11:28:04 GMT"}, {"version": "v2", "created": "Sat, 31 Dec 2016 16:11:30 GMT"}], "update_date": "2017-01-03", "authors_parsed": [["Roux", "Stéphane Le", ""], ["Pauly", "Arno", ""]]}, {"id": "1602.08971", "submitter": "Fabian Reiter", "authors": "Fabian Reiter", "title": "Alternating Set Quantifiers in Modal Logic", "comments": "20 pages, 2 figures; Can be seen as a follow-up paper to\n  arXiv:1408.3030; Typeset using Linux Libertine as main font and AMS Euler as\n  math font", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.FL math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish the strictness of several set quantifier alternation hierarchies\nthat are based on modal logic, evaluated on various classes of finite graphs.\nThis extends to the modal setting a celebrated result of Matz, Schweikardt and\nThomas (2002), which states that the analogous hierarchy of monadic\nsecond-order logic is strict.\n  Thereby, the present paper settles a question raised by van Benthem (1983),\nrevived by ten Cate (2006), and partially answered by Kuusisto (2008, 2015).\n", "versions": [{"version": "v1", "created": "Mon, 29 Feb 2016 14:16:31 GMT"}], "update_date": "2016-03-01", "authors_parsed": [["Reiter", "Fabian", ""]]}, {"id": "1602.09061", "submitter": "Witold Charatonik", "authors": "Witold Charatonik and Piotr Witkowski", "title": "Bounded Model Checking of Pointer Programs Revisited", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bounded model checking of pointer programs is a debugging technique for\nprograms that manipulate dynamically allocated pointer structures on the heap.\nIt is based on the following four observations. First, error conditions like\ndereference of a dangling pointer, are expressible in a~fragment of first-order\nlogic with two-variables. Second, the fragment is closed under weakest\npreconditions wrt. finite paths. Third, data structures like trees, lists etc.\nare expressible by inductive predicates defined in a fragment of Datalog.\nFinally, the combination of the two fragments of the two-variable logic and\nDatalog is decidable.\n  In this paper we improve this technique by extending the expressivity of the\nunderlying logics. In a~sequence of examples we demonstrate that the new logic\nis capable of modeling more sophisticated data structures with more complex\ndependencies on heaps and more complex analyses.\n", "versions": [{"version": "v1", "created": "Mon, 29 Feb 2016 17:35:28 GMT"}], "update_date": "2016-03-02", "authors_parsed": [["Charatonik", "Witold", ""], ["Witkowski", "Piotr", ""]]}]