[{"id": "1006.0517", "submitter": "Andrew Buckley", "authors": "Andy Buckley, Mike Whalley", "title": "HepData reloaded: reinventing the HEP data archive", "comments": "7 pages, 3 figures, Presented at 13th International Workshop on\n  Advanced Computing and Analysis Techniques in Physics Research (ACAT 2010),\n  February 22-27, 2010, Jaipur, India", "journal-ref": "PoS ACAT2010:067,2010", "doi": null, "report-no": null, "categories": "hep-ex cs.DL hep-ph physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe the status of the HepData database system, following a major\nre-development in time for the advent of LHC data. The new HepData system\nbenefits from use of modern database and programming language technologies, as\nwell as a variety of high-quality tools for interfacing the data sources and\ntheir presentation, primarily via the Web. The new back-end provides much more\nflexible and semantic data representations than before, on which new external\napplications can be built to respond to the data demands of the LHC\nexperimental era. The HepData re-development was largely motivated by a desire\nto have a single source of reference data for Monte Carlo validation and tuning\ntools, whose status and connection to HepData we also briefly review.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jun 2010 22:48:15 GMT"}, {"version": "v2", "created": "Wed, 4 Aug 2010 15:17:30 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Buckley", "Andy", ""], ["Whalley", "Mike", ""]]}, {"id": "1006.0670", "submitter": "Alberto Accomazzi", "authors": "Alberto Accomazzi", "title": "Astronomy 3.0 Style", "comments": "9 pages, 2 figures, to appear in Library and Information Services in\n  Astronomy VI, ASP Conference Proceedings", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the next decade we will witness the development of a new infrastructure\nin support of data-intensive scientific research, which includes Astronomy.\nThis new networked environment will offer both challenges and opportunities to\nour community and has the potential to transform the way data are described,\ncurated and preserved. Based on the lessons learned during the development and\nmanagement of the ADS, a case is made for adopting the emerging technologies\nand practices of the Semantic Web to support the way Astronomy research will be\nconducted. Examples of how small, incremental steps can, in the aggregate, make\na significant difference in the provision and repurposing of astronomical data\nare provided.\n", "versions": [{"version": "v1", "created": "Thu, 3 Jun 2010 15:06:56 GMT"}], "update_date": "2010-06-04", "authors_parsed": [["Accomazzi", "Alberto", ""]]}, {"id": "1006.1032", "submitter": "Ludo Waltman", "authors": "Ludo Waltman, Nees Jan van Eck, Ed C.M. Noyons", "title": "A unified approach to mapping and clustering of bibliometric networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the analysis of bibliometric networks, researchers often use mapping and\nclustering techniques in a combined fashion. Typically, however, mapping and\nclustering techniques that are used together rely on very different ideas and\nassumptions. We propose a unified approach to mapping and clustering of\nbibliometric networks. We show that the VOS mapping technique and a weighted\nand parameterized variant of modularity-based clustering can both be derived\nfrom the same underlying principle. We illustrate our proposed approach by\nproducing a combined mapping and clustering of the most frequently cited\npublications that appeared in the field of information science in the period\n1999-2008.\n", "versions": [{"version": "v1", "created": "Sat, 5 Jun 2010 09:56:51 GMT"}], "update_date": "2010-07-16", "authors_parsed": [["Waltman", "Ludo", ""], ["van Eck", "Nees Jan", ""], ["Noyons", "Ed C. M.", ""]]}, {"id": "1006.1714", "submitter": "Eva Isaksson", "authors": "Eva Isaksson", "title": "Bibliometric Evaluation of the Changing Finnish Astronomy", "comments": "3 pages, 2 figures, to appear in Library and Information Services in\n  Astronomy VI, ASP Conference Proceedings", "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.IM cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is a follow-up on the bibliometric evaluation of Finnish astronomy\npresented by the author at the LISA V conference in 2006. The data from the\nprevious study are revisited to determine how a wider institutional base and\nmergers affect comparisons between research units.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 06:46:28 GMT"}], "update_date": "2010-06-10", "authors_parsed": [["Isaksson", "Eva", ""]]}, {"id": "1006.1788", "submitter": "Tim Evans", "authors": "T.S. Evans, R. Lambiotte and P. Panzarasa", "title": "Communities and Patterns of Scientific collaboration", "comments": "17 pages. To appear in special edition of Scientometrics. Abstract on\n  arXiv meta-data a shorter version of abstract on actual paper (both in\n  journal and arXiv full paper version)", "journal-ref": null, "doi": null, "report-no": "Imperial/TP/10/TSE/01", "categories": "physics.soc-ph cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the role of homophily and focus constraint in shaping\ncollaborative scientific research. First, homophily structures collaboration\nwhen scientists adhere to a norm of exclusivity in selecting similar partners\nat a higher rate than dissimilar ones. Two dimensions on which similarity\nbetween scientists can be assessed are their research specialties and status\npositions. Second, focus constraint shapes collaboration when connections among\nscientists depend on opportunities for social contact. Constraint comes in two\nforms, depending on whether it originates in institutional or geographic space.\nInstitutional constraint refers to the tendency of scientists to select\ncollaborators within rather than across institutional boundaries. Geographic\nconstraint is the principle that, when collaborations span different\ninstitutions, they are more likely to involve scientists that are\ngeographically co-located than dispersed. To study homophily and focus\nconstraint, the paper will argue in favour of an idea of collaboration that\nmoves beyond formal co-authorship to include also other forms of informal\nintellectual exchange that do not translate into the publication of joint work.\nA community-detection algorithm is applied to the co-authorship network of the\nscientists that submitted in Business and Management in the 2001 UK RAE. While\nresults only partially support research-based homophily, they indicate that\nscientists use status positions for discriminating between potential partners\nby selecting collaborators from institutions with a rating similar to their\nown. Strong support is provided in favour of institutional and geographic\nconstraints. Scientists tend to forge intra-institutional collaborations; yet,\nwhen they seek collaborators outside their own institutions, they tend to\nselect those who are in geographic proximity.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jun 2010 12:38:33 GMT"}, {"version": "v2", "created": "Mon, 16 May 2011 14:30:56 GMT"}], "update_date": "2011-05-17", "authors_parsed": [["Evans", "T. S.", ""], ["Lambiotte", "R.", ""], ["Panzarasa", "P.", ""]]}, {"id": "1006.1993", "submitter": "Krzysztof Moskwa", "authors": "Krzysztof Moskwa, Piotr Rossa", "title": "Rozw\\'oj bibliotek cyfrowych i repozytori\\'ow elektronicznych na Dolnym\n  Slasku w latach 2004-2008 / Development of Digital Libraries and Electronic\n  Repositories in Lower Silesia in Years 2004-2008", "comments": "12 pages in Polish, 4 tables; Komputerowe wspomaganie bada\\'n\n  naukowych XVI / The Computer-Aided Scientific Research XVI", "journal-ref": "Komputerowe wspomaganie badan naukowych XVI = The Computer-Aided\n  Scientific Research XVI / red. Jan Zarzycki. Wroclaw, 2009. pp. 15-26, 4\n  tab., Summ. (Prace Wroclawskiego Towarzystwa Naukowego., ISSN 0084-3024; nr\n  215)", "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In following elaboration were presented digital libraries and electronic\nrepositories operating in Lower Silesia region (of Poland) in years 2004-2008.\nGeneral description of character and size of their collections was presented,\nas well as standards and methods of digital collections management and\njuridical aspects of this management. Potential of usage of digital collections\nin regional scientific researches was described.\n  -----\n  W referacie przedstawiono biblioteki cyfrowe i repozytoria elektroniczne\nfunkcjonujace na Dolnym Slasku w latach 2004-2008. Scharakteryzowano og\\'olnie\nich zawarto\\'s\\'c i wielko\\'s\\'c, zaprezentowano standardy i systemy\nzarzadzania kolekcjami cyfrowymi oraz om\\'owiono uwarunkowania prawne\ntowarzyszace zarzadzaniu zasobami cyfrowymi. Wskazano mo\\.zliwo\\'sci\nwykorzystania kolekcji cyfrowych w badaniach naukowych realizowanych w\nregionie.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jun 2010 10:25:52 GMT"}], "update_date": "2010-06-11", "authors_parsed": [["Moskwa", "Krzysztof", ""], ["Rossa", "Piotr", ""]]}, {"id": "1006.2718", "submitter": "Erik Wilde", "authors": "Rosa Alarcon and Erik Wilde", "title": "From RESTful Services to RDF: Connecting the Web and the Semantic Web", "comments": null, "journal-ref": null, "doi": null, "report-no": "2010-041", "categories": "cs.AI cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  RESTful services on the Web expose information through retrievable resource\nrepresentations that represent self-describing descriptions of resources, and\nthrough the way how these resources are interlinked through the hyperlinks that\ncan be found in those representations. This basic design of RESTful services\nmeans that for extracting the most useful information from a service, it is\nnecessary to understand a service's representations, which means both the\nsemantics in terms of describing a resource, and also its semantics in terms of\ndescribing its linkage with other resources. Based on the Resource Linking\nLanguage (ReLL), this paper describes a framework for how RESTful services can\nbe described, and how these descriptions can then be used to harvest\ninformation from these services. Building on this framework, a layered model of\nRESTful service semantics allows to represent a service's information in\nRDF/OWL. Because REST is based on the linkage between resources, the same model\ncan be used for aggregating and interlinking multiple services for extracting\nRDF data from sets of RESTful services.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jun 2010 18:39:20 GMT"}], "update_date": "2010-06-15", "authors_parsed": [["Alarcon", "Rosa", ""], ["Wilde", "Erik", ""]]}, {"id": "1006.2895", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff and Tobias Opthof", "title": "Scopus' SNIP Indicator", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rejoinder to Moed [arXiv:1005.4906]: Our main objection is against developing\nnew indicators which, like some of the older ones (for example, the \"crown\nindicator\" of CWTS), do not allow for indicating error because they do not\nprovide a statistics, but are based, in our opinion, on a violation of the\norder of operations. The claim of validity for the SNIP indicator is hollow\nbecause the normalizations are based on field classifications which are not\nvalid. Both problems can perhaps be solved by using fractional counting.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jun 2010 06:15:09 GMT"}], "update_date": "2010-06-16", "authors_parsed": [["Leydesdorff", "Loet", ""], ["Opthof", "Tobias", ""]]}, {"id": "1006.2896", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff and Tobias Opthof", "title": "Normalization at the field level: fractional counting of citations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Van Raan et al. (2010; arXiv:1003.2113) have proposed a new indicator (MNCS)\nfor field normalization. Since field normalization is also used in the Leiden\nRankings of universities, we elaborate our critique of journal normalization in\nOpthof & Leydesdorff (2010; arXiv:1002.2769) in this rejoinder concerning field\nnormalization. Fractional citation counting thoroughly solves the issue of\nnormalization for differences in citation behavior among fields. This indicator\ncan also be used to obtain a normalized impact factor.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jun 2010 06:21:43 GMT"}], "update_date": "2010-06-16", "authors_parsed": [["Leydesdorff", "Loet", ""], ["Opthof", "Tobias", ""]]}, {"id": "1006.3701", "submitter": "Ralph Kenna", "authors": "Ralph Kenna and Bertrand Berche", "title": "Concentration versus dispersion of research resources: a contribution to\n  the debate", "comments": "17 pages, 8 figures, each with 3 panels", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using the results of the UK's research assessment exercise, we show that the\nsize or mass of research groups, rather than individual caliber or prestige of\nthe institution, is the dominant factor which drives the quality of research\nteams. There are two critical masses in research: a lower one, below which\nteams are vulnerable and an upper one, above which average dependency of\nresearch quality on team size reduces. This leveling off refutes arguments\nwhich advocate ever increasing concentration of research support into a few\nlarge institutions. We also show that to increase research quality, policies\nwhich nourish two-way communication links between researchers are paramount.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jun 2010 14:24:39 GMT"}], "update_date": "2010-06-21", "authors_parsed": [["Kenna", "Ralph", ""], ["Berche", "Bertrand", ""]]}, {"id": "1006.3863", "submitter": "Ralph Kenna", "authors": "Ralph Kenna and Bertrand Berche", "title": "Normalization of peer-evaluation measures of group research quality\n  across academic disciplines", "comments": "5 figures, each with 2 panels. To appear in the journal Research\n  Evaluation", "journal-ref": "Research Evaluation 20 (2011) 107-116", "doi": "10.3152/095820211X12941371876625", "report-no": null, "categories": "physics.soc-ph cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer-evaluation based measures of group research quality such as the UK's\nResearch Assessment Exercise (RAE), which do not employ bibliometric analyses,\ncannot directly avail of such methods to normalize research impact across\ndisciplines. This is seen as a conspicuous flaw of such exercises and calls\nhave been made to find a remedy. Here a simple, systematic solution is proposed\nbased upon a mathematical model for the relationship between research quality\nand group quantity. This model manifests both the Matthew effect and a\nphenomenon akin to the Ringelmann effect and reveals the existence of two\ncritical masses for each academic discipline: a lower value, below which groups\nare vulnerable, and an upper value beyond which the dependency of quality on\nquantity reduces and plateaus appear when the critical masses are large. A\npossible normalization procedure is then to pitch these plateaus at similar\nlevels. We examine the consequences of this procedure at RAE for a multitude of\nacademic disciplines, corresponding to a range of critical masses.\n", "versions": [{"version": "v1", "created": "Sat, 19 Jun 2010 12:36:42 GMT"}, {"version": "v2", "created": "Tue, 22 Feb 2011 17:31:19 GMT"}], "update_date": "2011-11-23", "authors_parsed": [["Kenna", "Ralph", ""], ["Berche", "Bertrand", ""]]}, {"id": "1006.4057", "submitter": "Christoph Lange", "authors": "Christoph Lange", "title": "Towards OpenMath Content Dictionaries as Linked Data", "comments": "Presented at the OpenMath Workshop 2010, http://cicm2010.cnam.fr/om/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.MS", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  \"The term 'Linked Data' refers to a set of best practices for publishing and\nconnecting structured data on the web\". Linked Data make the Semantic Web work\npractically, which means that information can be retrieved without complicated\nlookup mechanisms, that a lightweight semantics enables scalable reasoning, and\nthat the decentral nature of the Web is respected. OpenMath Content\nDictionaries (CDs) have the same characteristics - in principle, but not yet in\npractice. The Linking Open Data movement has made a considerable practical\nimpact: Governments, broadcasting stations, scientific publishers, and many\nmore actors are already contributing to the \"Web of Data\". Queries can be\nanswered in a distributed way, and services aggregating data from different\nsources are replacing hard-coded mashups. However, these services are currently\nentirely lacking mathematical functionality. I will discuss real-world\nscenarios, where today's RDF-based Linked Data do not quite get their job done,\nbut where an integration of OpenMath would help - were it not for certain\nconceptual and practical restrictions. I will point out conceptual shortcomings\nin the OpenMath 2 specification and common bad practices in publishing CDs and\nthen propose concrete steps to overcome them and to contribute OpenMath CDs to\nthe Web of Data.\n", "versions": [{"version": "v1", "created": "Mon, 21 Jun 2010 13:00:22 GMT"}], "update_date": "2010-06-22", "authors_parsed": [["Lange", "Christoph", ""]]}, {"id": "1006.4547", "submitter": "William Jackson", "authors": "Fahad H. Alshammari, Rami Alnaqeib, M. A. Zaidan, Ali K. Hmood, B. B.\n  Zaidan and A. A. Zaidan", "title": "New Quantitative Study for Dissertations Repository System", "comments": "IEEE Publication Format,\n  https://sites.google.com/site/journalofcomputing/", "journal-ref": "Journal of Computing, Vol. 2, No. 6, June 2010, NY, USA, ISSN\n  2151-9617", "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the age of technology, the information communication technology becomes\nvery important especially in education field. Students must be allowed to learn\nanytime, anywhere and at their own place. The facility of library in the\nuniversity should be developed. In this paper we are going to present new\nQuantitative Study for Dissertations Repository System and also recommend\nfuture application of the approach.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jun 2010 15:05:47 GMT"}], "update_date": "2010-06-24", "authors_parsed": [["Alshammari", "Fahad H.", ""], ["Alnaqeib", "Rami", ""], ["Zaidan", "M. A.", ""], ["Hmood", "Ali K.", ""], ["Zaidan", "B. B.", ""], ["Zaidan", "A. A.", ""]]}]