[{"id": "0707.0808", "submitter": "Patrick C. McGuire", "authors": "Alexandra Bartolo, Patrick C. McGuire, Kenneth P. Camilleri,\n  Christopher Spiteri, Jonathan C. Borg, Philip J. Farrugia, Jens Ormo, Javier\n  Gomez-Elvira, Jose Antonio Rodriguez-Manfredi, Enrique Diaz-Martinez, Helge\n  Ritter, Robert Haschke, Markus Oesker, Joerg Ontrup", "title": "The Cyborg Astrobiologist: Porting from a wearable computer to the\n  Astrobiology Phone-cam", "comments": "15 pages, 4 figures, accepted for publication in the International\n  Journal of Astrobiology", "journal-ref": "International Journal of Astrobiology, vol. 6, issue 4, pp.\n  255-261 (2007)", "doi": "10.1017/S1473550407003862", "report-no": null, "categories": "cs.CV astro-ph cs.AI cs.CE cs.HC cs.NI cs.RO cs.SE", "license": null, "abstract": "  We have used a simple camera phone to significantly improve an `exploration\nsystem' for astrobiology and geology. This camera phone will make it much\neasier to develop and test computer-vision algorithms for future planetary\nexploration. We envision that the `Astrobiology Phone-cam' exploration system\ncan be fruitfully used in other problem domains as well.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2007 15:19:37 GMT"}], "update_date": "2010-01-08", "authors_parsed": [["Bartolo", "Alexandra", ""], ["McGuire", "Patrick C.", ""], ["Camilleri", "Kenneth P.", ""], ["Spiteri", "Christopher", ""], ["Borg", "Jonathan C.", ""], ["Farrugia", "Philip J.", ""], ["Ormo", "Jens", ""], ["Gomez-Elvira", "Javier", ""], ["Rodriguez-Manfredi", "Jose Antonio", ""], ["Diaz-Martinez", "Enrique", ""], ["Ritter", "Helge", ""], ["Haschke", "Robert", ""], ["Oesker", "Markus", ""], ["Ontrup", "Joerg", ""]]}, {"id": "0707.1480", "submitter": "Rene Chalon", "authors": "Ren\\'e Chalon (ICTT), Bertrand T. David (ICTT)", "title": "IRVO: an Interaction Model for designing Collaborative Mixed Reality\n  systems", "comments": "10 pages", "journal-ref": "Human Computer International 2005, U.S. CD (11/08/2005) 1-10", "doi": null, "report-no": null, "categories": "cs.HC", "license": null, "abstract": "  This paper presents an interaction model adapted to mixed reality\nenvironments known as IRVO (Interacting with Real and Virtual Objects). IRVO\naims at modeling the interaction between one or more users and the Mixed\nReality system by representing explicitly the objects and tools involved and\ntheir relationship. IRVO covers the design phase of the life cycle and models\nthe intended use of the system. In a first part, we present a brief review of\nrelated HCI models. The second part is devoted to the IRVO model, its notation\nand some examples. In the third part, we present how IRVO is used for designing\napplications and in particular we show how this model can be integrated in a\nModel-Based Approach (CoCSys) which is currently designed at our lab.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jul 2007 16:01:30 GMT"}], "update_date": "2007-07-11", "authors_parsed": [["Chalon", "René", "", "ICTT"], ["David", "Bertrand T.", "", "ICTT"]]}, {"id": "0707.1618", "submitter": "Per Ola Kristensson", "authors": "Per Ola Kristensson, Nils Dahlback, Daniel Anundi, Marius Bjornstad,\n  Hanna Gillberg, Jonas Haraldsson, Ingrid Martensson, Matttias Nordvall,\n  Josefin Stahl", "title": "The Trade-offs with Space Time Cube Representation of Spatiotemporal\n  Patterns", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.GR", "license": null, "abstract": "  Space time cube representation is an information visualization technique\nwhere spatiotemporal data points are mapped into a cube. Fast and correct\nanalysis of such information is important in for instance geospatial and social\nvisualization applications. Information visualization researchers have\npreviously argued that space time cube representation is beneficial in\nrevealing complex spatiotemporal patterns in a dataset to users. The argument\nis based on the fact that both time and spatial information are displayed\nsimultaneously to users, an effect difficult to achieve in other\nrepresentations. However, to our knowledge the actual usefulness of space time\ncube representation in conveying complex spatiotemporal patterns to users has\nnot been empirically validated. To fill this gap we report on a\nbetween-subjects experiment comparing novice users error rates and response\ntimes when answering a set of questions using either space time cube or a\nbaseline 2D representation. For some simple questions the error rates were\nlower when using the baseline representation. For complex questions where the\nparticipants needed an overall understanding of the spatiotemporal structure of\nthe dataset, the space time cube representation resulted in on average twice as\nfast response times with no difference in error rates compared to the baseline.\nThese results provide an empirical foundation for the hypothesis that space\ntime cube representation benefits users when analyzing complex spatiotemporal\npatterns.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jul 2007 13:39:34 GMT"}], "update_date": "2007-07-12", "authors_parsed": [["Kristensson", "Per Ola", ""], ["Dahlback", "Nils", ""], ["Anundi", "Daniel", ""], ["Bjornstad", "Marius", ""], ["Gillberg", "Hanna", ""], ["Haraldsson", "Jonas", ""], ["Martensson", "Ingrid", ""], ["Nordvall", "Matttias", ""], ["Stahl", "Josefin", ""]]}, {"id": "0707.3559", "submitter": "Wilson Wong", "authors": "Wilson Wong", "title": "Practical Approach to Knowledge-based Question Answering with Natural\n  Language Understanding and Advanced Reasoning", "comments": "Master of Science thesis, National Technical University College of\n  Malaysia, 2005", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.AI cs.HC cs.IR", "license": null, "abstract": "  This research hypothesized that a practical approach in the form of a\nsolution framework known as Natural Language Understanding and Reasoning for\nIntelligence (NaLURI), which combines full-discourse natural language\nunderstanding, powerful representation formalism capable of exploiting\nontological information and reasoning approach with advanced features, will\nsolve the following problems without compromising practicality factors: 1)\nrestriction on the nature of question and response, and 2) limitation to scale\nacross domains and to real-life natural language text.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2007 14:30:27 GMT"}], "update_date": "2007-07-25", "authors_parsed": [["Wong", "Wilson", ""]]}, {"id": "0707.3638", "submitter": "Vita Hinze-Hoare", "authors": "V. Hinze-Hoare", "title": "The Review and Analysis of Human Computer Interaction (HCI) Principles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": null, "abstract": "  The History of HCI is briefly reviewed together with three HCI models and\nstructure including CSCW, CSCL and CSCR. It is shown that a number of\nauthorities consider HCI to be a fragmented discipline with no agreed set of\nunifying design principles. An analysis of usability criteria based upon\ncitation frequency of authors is performed in order to discover the eight most\nrecognised HCI principles.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jul 2007 20:19:47 GMT"}], "update_date": "2007-07-26", "authors_parsed": [["Hinze-Hoare", "V.", ""]]}]