[{"id": "1701.00612", "submitter": "Gangan Prathap", "authors": "Gangan Prathap", "title": "Citation indices and dimensional homogeneity", "comments": "10 pages, 1 table, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The importance of dimensional analysis and dimensional homogeneity in\nbibliometric studies is always overlooked. In this paper, we look at this issue\nsystematically and show that most h-type indices have the dimensions of [P],\nwhere [P] is the basic dimensional unit in bibliometrics which is the unit\npublication or paper. The newly introduced Euclidean index, based on the\nEuclidean length of the citation vector has the dimensions [P3/2]. An empirical\nexample is used to illustrate the concepts.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jan 2017 09:35:59 GMT"}], "update_date": "2017-01-04", "authors_parsed": [["Prathap", "Gangan", ""]]}, {"id": "1701.02455", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff, Mark W. Johnson, and Inga Ivanova", "title": "Toward a Calculus of Redundancy: The feedback arrow of expectations in\n  knowledge-based systems", "comments": "accepted for publication by the Journal of the Association for\n  Information Science and Technology, 24 March 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper considers the relationships among meaning generation, selection,\nand the dynamics of discourse from a variety of perspectives ranging from\ninformation theory and biology to sociology. Following Husserl's idea of a\nhorizon of meaning in intersubjective communication, we propose a way in which,\nusing Shannon's equations, the generation and selection of meanings from a\nhorizon of possibilities can be considered probabilistically. The\ninformation-theoretical dynamics we articulate considers a process of meaning\ngeneration within cultural evolution: information is imbued with meaning, and\nthrough this process, the number of options for the selection of meaning in\ndiscourse proliferates. The redundancy of possible meanings contributes to a\ncodification of expectations within the discourse. Unlike hard-wired DNA, the\ncodes of non-biological systems can co-evolve with the variations. Spanning\nhorizons of meaning, the codes structure the communications as selection\nenvironments that shape discourses. Discursive knowledge can be considered as\nmeta-coded communication which enables us to translate among differently coded\ncommunications. The dynamics of discursive knowledge production can thus infuse\nthe historical dynamics with a cultural evolution by adding options, that is,\nby increasing redundancy. A calculus of redundancy is presented as an indicator\nwhereby these dynamics of discourse and meaning may be explored empirically.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2017 07:27:57 GMT"}, {"version": "v2", "created": "Sat, 24 Mar 2018 20:48:10 GMT"}], "update_date": "2018-03-28", "authors_parsed": [["Leydesdorff", "Loet", ""], ["Johnson", "Mark W.", ""], ["Ivanova", "Inga", ""]]}, {"id": "1701.02461", "submitter": "Karen Shashok", "authors": "Karen Shashok", "title": "Can scientists and their institutions become their own open access\n  publishers?", "comments": "23 pages, 2 tabes, 58 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This article offers a personal perspective on the current state of academic\npublishing, and posits that the scientific community is beset with journals\nthat contribute little valuable knowledge, overload the community's capacity\nfor high-quality peer review, and waste resources. Open access publishing can\noffer solutions that benefit researchers and other information users, as well\nas institutions and funders, but commercial journal publishers have influenced\nopen access policies and practices in ways that favor their economic interests\nover those of other stakeholders in knowledge creation and sharing. One way to\nfree research from constraints on access is the diamond route of open access\npublishing, in which institutions and funders that produce new knowledge\nreclaim responsibility for publication via institutional journals or other open\nplatforms. I argue that research journals (especially those published for\nprofit) may no longer be fit for purpose, and hope that readers will consider\nwhether the time has come to put responsibility for publishing back into the\nhands of researchers and their institutions. The potential advantages and\nchallenges involved in a shift away from for-profit journals in favor of\ninstitutional open access publishing are explored.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2017 07:55:00 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Shashok", "Karen", ""]]}, {"id": "1701.02617", "submitter": "Amit Awekar", "authors": "Anasua Mitra, Amit Awekar", "title": "On Low Overlap Among Search Results of Academic Search Engines", "comments": "2 pages, submitted to ACM WWW Conference 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Number of published scholarly articles is growing exponentially. To tackle\nthis information overload, researchers are increasingly depending on niche\nacademic search engines. Recent works have shown that two major general web\nsearch engines: Google and Bing, have high level of agreement in their top\nsearch results. In contrast, we show that various academic search engines have\nlow degree of agreement among themselves. We performed experiments using 2500\nqueries over four academic search engines. We observe that overlap in search\nresult sets of any pair of academic search engines is significantly low and in\nmost of the cases the search result sets are mutually exclusive. We also\ndiscuss implications of this low overlap.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jan 2017 14:46:17 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Mitra", "Anasua", ""], ["Awekar", "Amit", ""]]}, {"id": "1701.04906", "submitter": "Alexander Petersen", "authors": "Alexander M. Petersen", "title": "Quantifying the distribution of editorial power and manuscript decision\n  bias at the mega-journal PLOS ONE", "comments": "25 pages, 5 figures, 1 Table", "journal-ref": "Journal of Informetrics, 13, 100974 (2019)", "doi": "10.1016/j.joi.2019.100974", "report-no": null, "categories": "cs.DL cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyzed the longitudinal activity of nearly 7,000 editors at the\nmega-journal PLOS ONE over the 10-year period 2006-2015. Using the\narticle-editor associations, we develop editor-specific measures of power,\nactivity, article acceptance time, citation impact, and editorial renumeration\n(an analogue to self-citation). We observe remarkably high levels of power\ninequality among the PLOS ONE editors, with the top-10 editors responsible for\n3,366 articles -- corresponding to 2.4% of the 141,986 articles we analyzed.\nSuch high inequality levels suggest the presence of unintended incentives,\nwhich may reinforce unethical behavior in the form of decision-level biases at\nthe editorial level. Our results indicate that editors may become apathetic in\njudging the quality of articles and susceptible to modes of power-driven\nmisconduct. We used the longitudinal dimension of editor activity to develop\ntwo panel regression models which test and verify the presence of editor-level\nbias. In the first model we analyzed the citation impact of articles, and in\nthe second model we modeled the decision time between an article being\nsubmitted and ultimately accepted by the editor. We focused on two variables\nthat represent social factors that capture potential conflicts-of-interest: (i)\nwe accounted for the social ties between editors and authors by developing a\nmeasure of repeat authorship among an editor's article set, and (ii) we\naccounted for the rate of citations directed towards the editor's own\npublications in the reference list of each article he/she oversaw. Our results\nindicate that these two factors play a significant role in the editorial\ndecision process. Moreover, these two effects appear to increase with editor\nage, which is consistent with behavioral studies concerning the evolution of\nmisbehavior and response to temptation in power-driven environments.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jan 2017 00:21:29 GMT"}], "update_date": "2019-12-17", "authors_parsed": [["Petersen", "Alexander M.", ""]]}, {"id": "1701.05347", "submitter": "Zoltan Neda", "authors": "Zolt\\'an N\\'eda, Levente Varga and Tam\\'as S. Bir\\'o", "title": "Science and Facebook: the same popularity law!", "comments": "11 pages, 3 Figures", "journal-ref": null, "doi": "10.1371/journal.pone.0179656", "report-no": null, "categories": "physics.soc-ph cs.DL physics.pop-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The distribution of scientific citations for publications selected with\ndifferent rules (author, topic, institution, country, journal, etc.) collapse\non a single curve if one plots the citations relative to their mean value. We\nfind that the distribution of shares for the Facebook posts re-scale in the\nsame manner to the very same curve with scientific citations. This finding\nsuggests that citations are subjected to the same growth mechanism with\nFacebook popularity measures, being influenced by a statistically similar\nsocial environment and selection mechanism. In a simple master-equation\napproach the exponential growth of the number of publications and a\npreferential selection mechanism leads to a Tsallis-Pareto distribution\noffering an excellent description for the observed statistics. Based on our\nmodel and on the data derived from PubMed we predict that according to the\npresent trend the average citations per scientific publications exponentially\nrelaxes to about 4.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2017 09:42:33 GMT"}], "update_date": "2017-11-01", "authors_parsed": [["Néda", "Zoltán", ""], ["Varga", "Levente", ""], ["Biró", "Tamás S.", ""]]}, {"id": "1701.05377", "submitter": "Uwe Springmann", "authors": "Florian Fink, Klaus-U. Schulz and Uwe Springmann", "title": "Profiling of OCR'ed Historical Texts Revisited", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the absence of ground truth it is not possible to automatically determine\nthe exact spectrum and occurrences of OCR errors in an OCR'ed text. Yet, for\ninteractive postcorrection of OCR'ed historical printings it is extremely\nuseful to have a statistical profile available that provides an estimate of\nerror classes with associated frequencies, and that points to conjectured\nerrors and suspicious tokens. The method introduced in Reffle (2013) computes\nsuch a profile, combining lexica, pattern sets and advanced matching techniques\nin a specialized Expectation Maximization (EM) procedure. Here we improve this\nmethod in three respects: First, the method in Reffle (2013) is not adaptive:\nuser feedback obtained by actual postcorrection steps cannot be used to compute\nrefined profiles. We introduce a variant of the method that is open for\nadaptivity, taking correction steps of the user into account. This leads to\nhigher precision with respect to recognition of erroneous OCR tokens. Second,\nduring postcorrection often new historical patterns are found. We show that\nadding new historical patterns to the linguistic background resources leads to\na second kind of improvement, enabling even higher precision by telling\nhistorical spellings apart from OCR errors. Third, the method in Reffle (2013)\ndoes not make any active use of tokens that cannot be interpreted in the\nunderlying channel model. We show that adding these uninterpretable tokens to\nthe set of conjectured errors leads to a significant improvement of the recall\nfor error detection, at the same time improving precision.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jan 2017 11:31:14 GMT"}], "update_date": "2017-01-20", "authors_parsed": [["Fink", "Florian", ""], ["Schulz", "Klaus-U.", ""], ["Springmann", "Uwe", ""]]}, {"id": "1701.08008", "submitter": "Michael Taylor Dr", "authors": "Micha\\\"el Bon, Michael Taylor, Gary S. McDowell", "title": "Novel processes and metrics for a scientific evaluation rooted in the\n  principles of science - Version 1", "comments": "22 pages, 1 figure, open peer-review of this article can be performed\n  at: http://www.sjscience.org/article?id=580, SJS, 26 January 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Scientific evaluation is a determinant of how scientists, institutions and\nfunders behave, and as such is a key element in the making of science. In this\narticle, we propose an alternative to the current norm of evaluating research\nwith journal rank. Following a well-defined notion of scientific value, we\nintroduce qualitative processes that can also be quantified and give rise to\nmeaningful and easy-to-use article-level metrics. In our approach, the goal of\na scientist is transformed from convincing an editorial board through a\nvertical process to convincing peers through an horizontal one. We argue that\nsuch an evaluation system naturally provides the incentives and logic needed to\nconstantly promote quality, reproducibility, openness and collaboration in\nscience. The system is legally and technically feasible and can gradually lead\nto the self-organized reappropriation of the scientific process by the\nscholarly community and its institutions. We propose an implementation of our\nevaluation system with the platform \"the Self-Journals of Science\"\n(www.sjscience.org).\n", "versions": [{"version": "v1", "created": "Fri, 27 Jan 2017 10:48:21 GMT"}], "update_date": "2017-01-30", "authors_parsed": [["Bon", "Michaël", ""], ["Taylor", "Michael", ""], ["McDowell", "Gary S.", ""]]}, {"id": "1701.08256", "submitter": "Philipp Kemkes", "authors": "Nattiya Kanhabua, Philipp Kemkes, Wolfgang Nejdl, Tu Ngoc Nguyen,\n  Felipe Reis, Nam Khanh Tran", "title": "How to Search the Internet Archive Without Indexing It", "comments": null, "journal-ref": "20th International Conference on Theory and Practice of Digital\n  Libraries, TPDL 2016, Proceedings, pp 147-160", "doi": "10.1007/978-3-319-43997-6_12", "report-no": null, "categories": "cs.DL cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Significant parts of cultural heritage are produced on the web during the\nlast decades. While easy accessibility to the current web is a good baseline,\noptimal access to the past web faces several challenges. This includes dealing\nwith large-scale web archive collections and lacking of usage logs that contain\nimplicit human feedback most relevant for today's web search. In this paper, we\npropose an entity-oriented search system to support retrieval and analytics on\nthe Internet Archive. We use Bing to retrieve a ranked list of results from the\ncurrent web. In addition, we link retrieved results to the WayBack Machine;\nthus allowing keyword search on the Internet Archive without processing and\nindexing its raw archived content. Our search system complements existing web\narchive search tools through a user-friendly interface, which comes close to\nthe functionalities of modern web search engines (e.g., keyword search, query\nauto-completion and related query suggestion), and provides a great benefit of\ntaking user feedback on the current web into account also for web archive\nsearch. Through extensive experiments, we conduct quantitative and qualitative\nanalyses in order to provide insights that enable further research on and\npractical applications of web archives.\n", "versions": [{"version": "v1", "created": "Sat, 28 Jan 2017 05:46:46 GMT"}], "update_date": "2017-01-31", "authors_parsed": [["Kanhabua", "Nattiya", ""], ["Kemkes", "Philipp", ""], ["Nejdl", "Wolfgang", ""], ["Nguyen", "Tu Ngoc", ""], ["Reis", "Felipe", ""], ["Tran", "Nam Khanh", ""]]}]