[{"id": "1805.00106", "submitter": "Nathaniel McVicar", "authors": "Nathaniel McVicar, Akina Hoshino, Anna La Torre, Thomas A. Reh, Walter\n  L. Ruzzo and Scott Hauck", "title": "FPGA Acceleration of Short Read Alignment", "comments": "15 pages, technical report version", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.CE cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Aligning millions of short DNA or RNA reads, of 75 to 250 base pairs each, to\na reference genome is a significant computation problem in bioinformatics. We\npresent a flexible and fast FPGA-based short read alignment tool. Our aligner\nmakes use of the processing power of FPGAs in conjunction with the greater host\nmemory bandwidth and flexibility of software to improve performance and achieve\na high level of configurability. This flexible design supports a variety of\nreference genome sizes without the performance degradation suffered by other\nsoftware and FPGA-based aligners. It is also better able to support the\nfeatures of new alignment algorithms, which frequently crop up in the rapidly\nevolving field of bioinformatics. We demonstrate these advantages in a case\nstudy where we align RNA-Seq data from a hypothesized mouse / human xenograft.\nIn this case study, our aligner provides a speedup of 5.6x over BWA-SW with\nenergy savings of 21%, while also reducing incorrect short read classification\nby 29%. To demonstrate the flexibility of our system we show that the speedup\ncan be substantially improved while retaining most of the accuracy gains over\nBWA-SW. The speedup can be increased to 71.3x, while still enjoying a 28%\nincorrect classification improvement and 52% improvement in unaligned reads.\n", "versions": [{"version": "v1", "created": "Mon, 30 Apr 2018 21:26:41 GMT"}], "update_date": "2018-05-02", "authors_parsed": [["McVicar", "Nathaniel", ""], ["Hoshino", "Akina", ""], ["La Torre", "Anna", ""], ["Reh", "Thomas A.", ""], ["Ruzzo", "Walter L.", ""], ["Hauck", "Scott", ""]]}, {"id": "1805.00290", "submitter": "Robert Kl\\\"ofkorn", "authors": "Andreas Dedner, Birane Kane, Robert Kl\\\"ofkorn, and Martin Nolte", "title": "Python Framework for HP Adaptive Discontinuous Galerkin Method for Two\n  Phase Flow in Porous Media", "comments": "Keywords: DG, hp-adaptivity, Two-phase flow, IMPES, Fully implicit,\n  Dune, Python, Porous media. 28 pages, 9 figures, various code snippets", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.DC math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a framework for solving two phase flow problems in\nporous media. The discretization is based on a Discontinuous Galerkin method\nand includes local grid adaptivity and local choice of polynomial degree. The\nmethod is implemented using the new Python frontend Dune-FemPy to the open\nsource framework Dune. The code used for the simulations is made available as\nJupyter notebook and can be used through a Docker container. We present a\nnumber of time stepping approaches ranging from a classical IMPES method to\nfully coupled implicit scheme. The implementation of the discretization is very\nflexible allowing for test different formulations of the two phase flow model\nand adaptation strategies.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2018 12:30:23 GMT"}], "update_date": "2018-05-02", "authors_parsed": [["Dedner", "Andreas", ""], ["Kane", "Birane", ""], ["Klöfkorn", "Robert", ""], ["Nolte", "Martin", ""]]}, {"id": "1805.00291", "submitter": "Deepak Gupta", "authors": "Debjani Bhowmick, Deepak K. Gupta, Saumen Maiti and Uma Shankar", "title": "Deep Autoassociative Neural Networks for Noise Reduction in Seismic data", "comments": "6 pages; Accepted at 80th EAGE Annual Conference & Exhibition 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine learning is currently a trending topic in various science and\nengineering disciplines, and the field of geophysics is no exception. With the\nadvent of powerful computers, it is now possible to train the machine to learn\ncomplex patterns in the data, which may not be easily realized using the\ntraditional methods. Among the various machine learning methods, the artificial\nneural networks (ANNs) have received enormous attention. A variant of ANNs,\nautoassociative neural network (autoNN) tries to learn the reconstruction of\ninput itself using backpropagation. In an autoNN, the input and output are the\nsame, and an approximation to the identity mapping is obtained in a nonlinear\nsetting. AutoNNs have primarily been used to extract sparse internal\nrepresentations of any input and reduce its dimensionality. In this paper, we\nexplore the potential of autoNNs in reducing random noise in geophysical data.\nIn this paper, the first results of this study are presented. The synthetic\nmathematical example demonstrates the concept of autoNN. For the test seismic\ndata, it is observed that autoNN can significantly remove the vertical time-\nand frequency-local noise, however, the resolution of the output signal is\ncompromised to a certain extent. Future work includes testing larger examples\nwith several different types of noise, and using deep-stacked-autoNNs to\nfurther reduce the noise, ensuring minimal compromise with the resolution of\nthe signal.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2018 12:40:16 GMT"}], "update_date": "2018-05-02", "authors_parsed": [["Bhowmick", "Debjani", ""], ["Gupta", "Deepak K.", ""], ["Maiti", "Saumen", ""], ["Shankar", "Uma", ""]]}, {"id": "1805.00571", "submitter": "Matthew Hirn", "authors": "Michael Eickenberg, Georgios Exarchakis, Matthew Hirn, St\\'ephane\n  Mallat, Louis Thiry", "title": "Solid Harmonic Wavelet Scattering for Predictions of Molecule Properties", "comments": "Keywords: wavelets, electronic structure calculations, solid\n  harmonics, invariants, multilinear regression", "journal-ref": "J. Chem. Phys. 148, 241732 (2018)", "doi": "10.1063/1.5023798", "report-no": null, "categories": "physics.chem-ph cs.CE cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a machine learning algorithm for the prediction of molecule\nproperties inspired by ideas from density functional theory. Using\nGaussian-type orbital functions, we create surrogate electronic densities of\nthe molecule from which we compute invariant \"solid harmonic scattering\ncoefficients\" that account for different types of interactions at different\nscales. Multi-linear regressions of various physical properties of molecules\nare computed from these invariant coefficients. Numerical experiments show that\nthese regressions have near state of the art performance, even with relatively\nfew training examples. Predictions over small sets of scattering coefficients\ncan reach a DFT precision while being interpretable.\n", "versions": [{"version": "v1", "created": "Tue, 1 May 2018 22:23:37 GMT"}], "update_date": "2019-11-27", "authors_parsed": [["Eickenberg", "Michael", ""], ["Exarchakis", "Georgios", ""], ["Hirn", "Matthew", ""], ["Mallat", "Stéphane", ""], ["Thiry", "Louis", ""]]}, {"id": "1805.00630", "submitter": "Ming Dong", "authors": "Ming Dong, Benzhe Li, Alex Nassif", "title": "A Data-Driven Residential Transformer Overloading Risk Assessment Method", "comments": "10 Pages, 4 figures, IEEE Transactions on Power Delivery, 2018", "journal-ref": "IEEE Transactions on Power Delivery ( Volume: 34 , Issue: 1 , Feb.\n  2019 )", "doi": "10.1109/TPWRD.2018.2882215", "report-no": null, "categories": "cs.CE cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Residential transformer population is a critical type of asset that many\nelectric utility companies have been attempting to manage proactively and\neffectively to reduce unexpected failures and life losses that are often caused\nby transformer overloading. Within the typical power asset portfolio, the\nresidential transformer asset is often large in population, having lowest\nreliability design, lacking transformer loading data and susceptible to\ncustomer loading behaviors such as adoption of distributed energy resources and\nelectric vehicles. On the bright side, the availability of more residential\noperation data along with the advancement of data analytics techniques have\nprovided a new path to further our understanding of local residential\ntransformer overloading risks statistically. This research developed a new\ndata-driven method to combine clustering analysis and the simulation of\ntransformer temperature rise and insulation life loss to quantitatively and\nstatistically assess the overloading risk of residential transformer population\nin one area and suggest proper risk management measures according to the\nassessment results. Case studies from an actual Canadian utility company have\nbeen presented and discussed in detail to demonstrate the applicability and\nusefulness of the proposed method.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2018 05:22:56 GMT"}, {"version": "v2", "created": "Sun, 9 Dec 2018 06:34:32 GMT"}, {"version": "v3", "created": "Wed, 1 Jul 2020 04:30:09 GMT"}], "update_date": "2020-07-02", "authors_parsed": [["Dong", "Ming", ""], ["Li", "Benzhe", ""], ["Nassif", "Alex", ""]]}, {"id": "1805.00702", "submitter": "Bijay Neupane", "authors": "Bijay Neupane, Torben Bach Pedersen, and Bo Thiesson", "title": "Utilizing Device-level Demand Forecasting for Flexibility Markets - Full\n  Version", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The uncertainty in the power supply due to fluctuating Renewable Energy\nSources (RES) has severe (financial and other) implications for energy market\nplayers. In this paper, we present a device-level Demand Response (DR) scheme\nthat captures the atomic (all available) flexibilities in energy demand and\nprovides the largest possible solution space to generate demand/supply\nschedules that minimize market imbalances. We evaluate the effectiveness and\nfeasibility of widely used forecasting models for device-level flexibility\nanalysis. In a typical device-level flexibility forecast, a market player is\nmore concerned with the \\textit{utility} that the demand flexibility brings to\nthe market, rather than the intrinsic forecast accuracy. In this regard, we\nprovide comprehensive predictive modeling and scheduling of demand flexibility\nfrom household appliances to demonstrate the (financial and otherwise)\nviability of introducing flexibility-based DR in the Danish/Nordic market.\nFurther, we investigate the correlation between the potential utility and the\naccuracy of the demand forecast model. Furthermore, we perform a number of\nexperiments to determine the data granularity that provides the best financial\nreward to market players for adopting the proposed DR scheme. A cost-benefit\nanalysis of forecast results shows that even with somewhat low forecast\naccuracy, market players can achieve regulation cost savings of 54% of the\ntheoretically optimal.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2018 09:55:57 GMT"}], "update_date": "2018-05-03", "authors_parsed": [["Neupane", "Bijay", ""], ["Pedersen", "Torben Bach", ""], ["Thiesson", "Bo", ""]]}, {"id": "1805.00749", "submitter": "Abhishta -", "authors": "Abhishta, Reinoud Joosten, L.J.M. Nieuwenhuis", "title": "Analysing The Impact Of A DDoS Attack Announcement On Victim Stock\n  Prices", "comments": null, "journal-ref": "2017 25th Euromicro International Conference on Parallel,\n  Distributed and Network-based Processing (PDP), St. Petersburg, 2017, pp.\n  354-362", "doi": "10.1109/PDP.2017.82", "report-no": null, "categories": "cs.CE cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  DDoS attacks are increasingly used by `hackers' and `hacktivists' for various\npurposes. A number of on-line tools are available to launch an attack of\nsignificant intensity. These attacks lead to a variety of losses at the\nvictim's end. We analyse the impact of Distributed Denial-of-Service (DDoS)\nattack announcements over a period of 5 years on the stock prices of the victim\nfirms. We propose a method for event studies that does not assume the\ncumulative abnormal returns to be normally distributed, instead we use the\nempirical distribution for testing purposes. In most cases we find no\nsignificant impact on the stock returns but in cases where a DDoS attack\ncreates an interruption in the services provided to the customer, we find a\nsignificant negative impact.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2018 11:55:12 GMT"}], "update_date": "2018-05-03", "authors_parsed": [["Abhishta", "", ""], ["Joosten", "Reinoud", ""], ["Nieuwenhuis", "L. J. M.", ""]]}, {"id": "1805.01389", "submitter": "Kalyana Babu Nakshatrala", "authors": "M. S. Joshaghani, S. H. S. Joodat and K. B. Nakshatrala", "title": "A stabilized mixed discontinuous Galerkin formulation for double\n  porosity/permeability model", "comments": "There was a mistake in the boundedness proof in the earlier version\n  (specifically version #1). We now rectified this mistake and improved\n  sections 1 and 3", "journal-ref": null, "doi": "10.1016/j.cma.2019.04.010", "report-no": null, "categories": "cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modeling flow through porous media with multiple pore-networks has now become\nan active area of research due to recent technological endeavors like\ngeological carbon sequestration and recovery of hydrocarbons from tight rock\nformations. Herein, we consider the double porosity/permeability (DPP) model,\nwhich describes the flow of a single-phase incompressible fluid through a\nporous medium exhibiting two dominant pore-networks with a possibility of mass\ntransfer across them. We present a stable mixed discontinuous Galerkin (DG)\nformulation for the DPP model. The formulation enjoys several attractive\nfeatures. These include: (i) Equal-order interpolation for all the field\nvariables (which is computationally the most convenient) is stable under the\nproposed formulation. (ii) The stabilization terms are residual-based, and the\nstabilization parameters do not contain any mesh-dependent parameters. (iii)\nThe formulation is theoretically shown to be consistent, stable, and hence\nconvergent. (iv) The formulation supports non-conforming discretizations and\ndistorted meshes. (v) The DG formulation has improved element-wise (local) mass\nbalance compared to the corresponding continuous formulation. (vi) The proposed\nformulation can capture physical instabilities in coupled flow and transport\nproblems under the DPP model.\n", "versions": [{"version": "v1", "created": "Thu, 3 May 2018 16:02:33 GMT"}, {"version": "v2", "created": "Sat, 20 Oct 2018 05:24:38 GMT"}], "update_date": "2019-06-26", "authors_parsed": [["Joshaghani", "M. S.", ""], ["Joodat", "S. H. S.", ""], ["Nakshatrala", "K. B.", ""]]}, {"id": "1805.01506", "submitter": "Md Mehedi Hassan Onik", "authors": "Md Mehedi Hassan Onik, Shakhawat Ahmmed Nobin, Adnan Ferdous Ashrafi,\n  Tareque Mohmud Chowdhury", "title": "Prediction of a Gene Regulatory Network from Gene Expression Profiles\n  With Linear Regression and Pearson Correlation Coefficient", "comments": "In The 19Th International Conference On Computer And Information\n  Technology, North South University, Dhaka -1229, Bangladesh, 2016, P. 327", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.CE q-bio.MN", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Reconstruction of gene regulatory networks is the process of identifying gene\ndependency from gene expression profile through some computation techniques. In\nour human body, though all cells pose similar genetic material but the\nactivation state may vary. This variation in the activation of genes helps\nresearchers to understand more about the function of the cells. Researchers get\ninsight about diseases like mental illness, infectious disease, cancer disease\nand heart disease from microarray technology, etc. In this study, a\ncancer-specific gene regulatory network has been constructed using a simple and\nnovel machine learning approach. In First Step, linear regression algorithm\nprovided us the significant genes those expressed themselves differently. Next,\nregulatory relationships between the identified genes has been computed using\nPearson correlation coefficient. Finally, the obtained results have been\nvalidated with the available databases and literatures. We can identify the hub\ngenes and can be targeted for the cancer diagnosis.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2018 01:44:43 GMT"}], "update_date": "2018-05-07", "authors_parsed": [["Onik", "Md Mehedi Hassan", ""], ["Nobin", "Shakhawat Ahmmed", ""], ["Ashrafi", "Adnan Ferdous", ""], ["Chowdhury", "Tareque Mohmud", ""]]}, {"id": "1805.02008", "submitter": "Xu Guo", "authors": "Chang Liu, Yichao Zhu, Zhi Sun, Dingding Li, Zongliang Du, Weisheng\n  Zhang, Xu Guo", "title": "An efficient Moving Morphable Component (MMC)-based approach for\n  multi-resolution topology optimization", "comments": null, "journal-ref": "Structural and Multidisciplinary Optimization (2018) 58: 2455", "doi": "10.1007/s00158-018-2114-0", "report-no": null, "categories": "cs.CE cond-mat.mtrl-sci", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the present work, a highly efficient Moving Morphable Component (MMC)\nbased approach for multi-resolution topology optimization is proposed. In this\napproach, high-resolution optimization results can be obtained with much less\nnumber of degrees of freedoms (DOFs) and design variables since the finite\nelement analysis model and the design optimization model are totally decoupled\nin the MMC-based problem formulation. This is achieved by introducing\nsuper-elements for structural response analysis and adopting a domain\ndecomposition strategy to preserve the topology complexity of optimized\nstructures. Both two-and three-dimensional numerical results demonstrate that\nsubstantial computational efforts can be saved with use of the proposed\napproach.\n", "versions": [{"version": "v1", "created": "Sat, 5 May 2018 05:38:53 GMT"}, {"version": "v2", "created": "Sun, 8 Jul 2018 04:56:17 GMT"}], "update_date": "2018-12-10", "authors_parsed": [["Liu", "Chang", ""], ["Zhu", "Yichao", ""], ["Sun", "Zhi", ""], ["Li", "Dingding", ""], ["Du", "Zongliang", ""], ["Zhang", "Weisheng", ""], ["Guo", "Xu", ""]]}, {"id": "1805.02061", "submitter": "Christian Lessig", "authors": "Christian Lessig", "title": "Polar Wavelets in Space", "comments": "Supplementary material available at\n  http://graphics.cs.uni-magdeburg.de/projects/polarlets/polarlets_supp.pdf", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent work introduced a unified framework for steerable and directional\nwavelets in two and three dimensions that ensures many desirable properties,\nsuch as a multi-scale structure, fast transforms, and a flexible angular\nlocalization. We show that, for an appropriate choice for the radial window\nfunction, these wavelets also have closed form expressions for, among other\nthings, the spatial representation, the filter taps for the fast transform, and\nthe frame representation of the Laplace operator. The numerical practicality\nand benefits of our work are demonstrated using signal estimation from\nnon-uniform, point-wise samples, as required for example in ray tracing, and\nfor reconstructing a signal over a lower-dimensional sub-manifold, with\napplications for instance in medical imaging.\n", "versions": [{"version": "v1", "created": "Sat, 5 May 2018 14:23:45 GMT"}], "update_date": "2018-05-08", "authors_parsed": [["Lessig", "Christian", ""]]}, {"id": "1805.02062", "submitter": "Christian Lessig", "authors": "Christian Lessig", "title": "Divergence Free Polar Wavelets for the Analysis and Representation of\n  Fluid Flows", "comments": "To appear in Journal of Mathematical Fluid Dynamics. Extensive\n  supplementary material available at\n  http://graphics.cs.uni-magdeburg.de/projects/psidiv/psidiv_supp.pdf", "journal-ref": null, "doi": "10.1007/s00021-019-0408-7", "report-no": null, "categories": "cs.NA cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a Parseval tight wavelet frame for the representation and analysis\nof velocity vector fields of incompressible fluids. Our wavelets have closed\nform expressions in the frequency and spatial domains, are divergence free in\nthe ideal, analytic sense, have a multi-resolution structure and fast\ntransforms, and an intuitive correspondence to common flow phenomena. Our\nconstruction also allows for well defined directional selectivity, e.g. to\nmodel the behavior of divergence free vector fields in the vicinity of\nboundaries or to represent highly directional features like in a von K\\'arm\\'an\nvortex street. We demonstrate the practicality and efficiency of our\nconstruction by analyzing the representation of different divergence free\nvector fields in our wavelets.\n", "versions": [{"version": "v1", "created": "Sat, 5 May 2018 14:24:48 GMT"}, {"version": "v2", "created": "Sat, 12 May 2018 15:50:35 GMT"}, {"version": "v3", "created": "Sun, 30 Sep 2018 09:57:03 GMT"}], "update_date": "2019-03-27", "authors_parsed": [["Lessig", "Christian", ""]]}, {"id": "1805.02301", "submitter": "Emmanouil Valsomatzis", "authors": "Emmanouil Valsomatzis, Torben Bach Pedersen, Alberto Abello", "title": "Day-ahead Trading of Aggregated Energy Flexibility - Full Version", "comments": "9 pages, 7 figures, note paper of the full version to appear at ACM\n  e-Energy 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flexibility of small loads, in particular from Electric Vehicles (EVs), has\nrecently attracted a lot of interest due to their possibility of participating\nin the energy market and the new commercial potentials. Different from existing\nwork, the aggregation techniques proposed in this paper produce flexible\naggregated loads from EVs taking into account technical market requirements.\nThey can be further transformed into the so-called flexible orders and be\ntraded in the day-ahead market by a Balance Responsible Party (BRP). As a\nresult, the BRP can achieve at least 20% cost reduction on average in energy\npurchase compared to traditional charging based on 2017 real electricity prices\nfrom the Danish electricity market.\n", "versions": [{"version": "v1", "created": "Mon, 7 May 2018 00:46:38 GMT"}, {"version": "v2", "created": "Tue, 8 May 2018 11:35:44 GMT"}, {"version": "v3", "created": "Thu, 24 May 2018 20:10:21 GMT"}], "update_date": "2018-05-28", "authors_parsed": [["Valsomatzis", "Emmanouil", ""], ["Pedersen", "Torben Bach", ""], ["Abello", "Alberto", ""]]}, {"id": "1805.02784", "submitter": "Xiaolin Li", "authors": "Xiaolin Li, Yichi Zhang, He Zhao, Craig Burkhart, L Catherine Brinson,\n  Wei Chen", "title": "A Transfer Learning Approach for Microstructure Reconstruction and\n  Structure-property Predictions", "comments": "Submitted to Scientific Reports, under review", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.mtrl-sci cs.CE physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic microstructure reconstruction has become an indispensable part of\ncomputational materials science, but ongoing developments are specific to\nparticular material systems. In this paper, we address this generality problem\nby presenting a transfer learning-based approach for microstructure\nreconstruction and structure-property predictions that is applicable to a wide\nrange of material systems. The proposed approach incorporates an\nencoder-decoder process and feature-matching optimization using a deep\nconvolutional network. For microstructure reconstruction, model pruning is\nimplemented in order to study the correlation between the microstructural\nfeatures and hierarchical layers within the deep convolutional network.\nKnowledge obtained in model pruning is then leveraged in the development of a\nstructure-property predictive model to determine the network architecture and\ninitialization conditions. The generality of the approach is demonstrated\nnumerically for a wide range of material microstructures with geometrical\ncharacteristics of varying complexity. Unlike previous approaches that only\napply to specific material systems or require a significant amount of prior\nknowledge in model selection and hyper-parameter tuning, the present approach\nprovides an off-the-shelf solution to handle complex microstructures, and has\nthe potential of expediting the discovery of new materials.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2018 00:01:48 GMT"}], "update_date": "2018-05-09", "authors_parsed": [["Li", "Xiaolin", ""], ["Zhang", "Yichi", ""], ["Zhao", "He", ""], ["Burkhart", "Craig", ""], ["Brinson", "L Catherine", ""], ["Chen", "Wei", ""]]}, {"id": "1805.03696", "submitter": "Rohitash Chandra", "authors": "Rohitash Chandra, Danial Azam, R. Dietmar M\\\"uller, Tristan Salles,\n  Sally Cripps", "title": "Bayeslands: A Bayesian inference approach for parameter uncertainty\n  quantification in Badlands", "comments": null, "journal-ref": "Computers & Geoscience, Volume 131, October 2019, Pages 89-101", "doi": "10.1016/j.cageo.2019.06.012", "report-no": null, "categories": "physics.geo-ph cs.AI cs.CE", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Bayesian inference provides a rigorous methodology for estimation and\nuncertainty quantification of parameters in geophysical forward models.\nBadlands (basin and landscape dynamics model) is a landscape evolution model\nthat simulates topography development at various space and time scales.\nBadlands consists of a number of geophysical parameters that needs estimation\nwith appropriate uncertainty quantification; given the observed present-day\nground truth such as surface topography and the stratigraphy of sediment\ndeposition through time. The inference of unknown parameters is challenging due\nto the scarcity of data, sensitivity of the parameter setting and complexity of\nthe Badlands model. In this paper, we take a Bayesian approach to provide\ninference using Markov chain Monte Carlo sampling (MCMC). We present\n\\textit{Bayeslands}; a Bayesian framework for Badlands that fuses information\nobtained from complex forward models with observational data and prior\nknowledge. As a proof-of-concept, we consider a synthetic and real-world\ntopography with two parameters for Bayeslands inference, namely precipitation\nand erodibility. The results of the experiments show that Bayeslands yields a\npromising distribution of the parameters. Moreover, we demonstrate the\nchallenge in sampling irregular and multi-modal posterior distributions using a\nlikelihood surface that has a range of sub-optimal modes.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2018 08:25:30 GMT"}, {"version": "v2", "created": "Mon, 5 Jul 2021 10:46:43 GMT"}], "update_date": "2021-07-06", "authors_parsed": [["Chandra", "Rohitash", ""], ["Azam", "Danial", ""], ["Müller", "R. Dietmar", ""], ["Salles", "Tristan", ""], ["Cripps", "Sally", ""]]}, {"id": "1805.05617", "submitter": "Jichang Zhao", "authors": "Huiwen Wang, Shan Lu and Jichang Zhao", "title": "Aggregating multiple types of complex data in stock market prediction: A\n  model-independent framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP cs.CE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing richness in volume, and especially types of data in the\nfinancial domain provides unprecedented opportunities to understand the stock\nmarket more comprehensively and makes the price prediction more accurate than\nbefore. However, they also bring challenges to classic statistic approaches\nsince those models might be constrained to a certain type of data. Aiming at\naggregating differently sourced information and offering type-free capability\nto existing models, a framework for predicting stock market of scenarios with\nmixed data, including scalar data, compositional data (pie-like) and functional\ndata (curve-like), is established. The presented framework is\nmodel-independent, as it serves like an interface to multiple types of data and\ncan be combined with various prediction models. And it is proved to be\neffective through numerical simulations. Regarding to price prediction, we\nincorporate the trading volume (scalar data), intraday return series\n(functional data), and investors' emotions from social media (compositional\ndata) through the framework to competently forecast whether the market goes up\nor down at opening in the next day. The strong explanatory power of the\nframework is further demonstrated. Specifically, it is found that the intraday\nreturns impact the following opening prices differently between bearish market\nand bullish market. And it is not at the beginning of the bearish market but\nthe subsequent period in which the investors' \"fear\" comes to be indicative.\nThe framework would help extend existing prediction models easily to scenarios\nwith multiple types of data and shed light on a more systemic understanding of\nthe stock market.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2018 07:58:31 GMT"}], "update_date": "2018-05-16", "authors_parsed": [["Wang", "Huiwen", ""], ["Lu", "Shan", ""], ["Zhao", "Jichang", ""]]}, {"id": "1805.06236", "submitter": "Mohammad Reza Fouladi", "authors": "Hossein Ghadiri, Mohammad Reza Fouladi, Arman Rahmim", "title": "An Analysis Scheme for Investigation of Effects of Various Parameters on\n  Signals in Acoustic-Resolution Photoacoustic Microscopy of Mice Brain: a\n  Simulation Study", "comments": "11 pages, 12 figure, 36 references", "journal-ref": "Frontiers in Biomedical Technologies 4, no. 3-4 (2018): 59-69", "doi": null, "report-no": null, "categories": "cs.CE eess.SP", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Photoacoustic spectral analysis is a novel tool for studying various\nparameters affecting signals in Photoacoustic microscopy. But only observing\nfrequency components of photoacoustic signals doesn't make enough data for a\ndesirable analysis. Thus a hybrid time-domain and frequency-domain analysis\nscheme has been proposed to investigate effects of various parameters like\ndepth of microscopy, laser focal spot size and contrast agent concentration on\nPhotoacoustic signals.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2018 10:33:33 GMT"}], "update_date": "2018-05-17", "authors_parsed": [["Ghadiri", "Hossein", ""], ["Fouladi", "Mohammad Reza", ""], ["Rahmim", "Arman", ""]]}, {"id": "1805.06453", "submitter": "Henry Jay Melosh", "authors": "Dirk Elbeshausen and Jay Melosh", "title": "A nonlinear and time-dependent visco-elasto-plastic rheology model for\n  studying shock-physics phenomena", "comments": "20 pages 6 figures", "journal-ref": "Engineering Reports. 2020;e12322", "doi": "10.1002/eng2.12322", "report-no": null, "categories": "physics.geo-ph astro-ph.EP cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a simple and efficient implementation of a viscous creep rheology\nbased on diffusion creep, dislocation creep and the Peierls mechanism in\nconjunction with an elasto-plastic rheology model into a shock-physics code,\nthe iSALE open-source impact code. Our approach is based on the calculation of\nan effective viscosity which is then used as a reference viscosity for any\nunderlying viscoelastic (or even visco-elasto-plastic) model. Here we use a\nMaxwell-model which best describes stress relaxation and is therefore likely\nmost important for the formation of large meteorite impact basins. While common\nviscoelastic behavior during mantle convection or other slow geodynamic or\ngeological processes is mostly controlled by diffusion and dislocation creep,\nwe showed that the Peierls mechanism dominates at the large strain rates that\ntypically occur during meteorite impacts. Thus, the resulting\nvisco-elasto-plastic rheology allows implementation of a more realistic mantle\nbehavior in computer simulations, especially for those dealing with large\nmeteorite impacts. The approach shown here opens the way to more faithful\nsimulations of large impact basin formation, especially in elucidating the\nphysics behind the formation of the external fault rings characteristic of\nlarge lunar basins.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2018 18:28:59 GMT"}], "update_date": "2020-11-24", "authors_parsed": [["Elbeshausen", "Dirk", ""], ["Melosh", "Jay", ""]]}, {"id": "1805.06454", "submitter": "Maruti Mudunuru", "authors": "V. V. Vesselinov, M. K. Mudunuru, S. Karra, D. O. Malley, and B. S.\n  Alexandrov", "title": "Unsupervised Machine Learning Based on Non-Negative Tensor Factorization\n  for Analyzing Reactive-Mixing", "comments": "34 pages", "journal-ref": null, "doi": "10.1016/j.jcp.2019.05.039", "report-no": null, "categories": "cs.CE cs.NA stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Analysis of reactive-diffusion simulations requires a large number of\nindependent model runs. For each high-fidelity simulation, inputs are varied\nand the predicted mixing behavior is represented by changes in species\nconcentration. It is then required to discern how the model inputs impact the\nmixing process. This task is challenging and typically involves interpretation\nof large model outputs. However, the task can be automated and substantially\nsimplified by applying Machine Learning (ML) methods. In this paper, we present\nan application of an unsupervised ML method (called NTFk) using Non-negative\nTensor Factorization (NTF) coupled with a custom clustering procedure based on\nk-means to reveal hidden features in product concentration. An attractive\naspect of the proposed ML method is that it ensures the extracted features are\nnon-negative, which are important to obtain a meaningful deconstruction of the\nmixing processes. The ML method is applied to a large set of high-resolution\nFEM simulations representing reaction-diffusion processes in perturbed\nvortex-based velocity fields. The applied FEM ensures that species\nconcentration are always non-negative. The simulated reaction is a fast\nirreversible bimolecular reaction. The reactive-diffusion model input\nparameters that control mixing include properties of velocity field,\nanisotropic dispersion, and molecular diffusion. We demonstrate the\napplicability of the ML method to produce a meaningful deconstruction of model\noutputs to discriminate between different physical processes impacting the\nreactants, their mixing, and the spatial distribution of the product. The\npresented ML analysis allowed us to identify additive features that\ncharacterize mixing behavior.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2018 03:05:40 GMT"}, {"version": "v2", "created": "Thu, 21 Feb 2019 20:21:12 GMT"}], "update_date": "2019-07-24", "authors_parsed": [["Vesselinov", "V. V.", ""], ["Mudunuru", "M. K.", ""], ["Karra", "S.", ""], ["Malley", "D. O.", ""], ["Alexandrov", "B. S.", ""]]}, {"id": "1805.06557", "submitter": "Martin Schreiber", "authors": "Martin Schreiber, Nathana\\\"el Schaeffer, Richard Loft", "title": "Exponential Integrators with Parallel-in-Time Rational Approximations\n  for the Shallow-Water Equations on the Rotating Sphere", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High-performance computing trends towards many-core systems are expected to\ncontinue over the next decade. As a result, parallel-in-time methods,\nmathematical formulations which exploit additional degrees of parallelism in\nthe time dimension, have gained increasing interest in recent years. In this\nwork we study a massively parallel rational approximation of exponential\nintegrators (REXI). This method replaces a time integration of stiff linear\noscillatory and diffusive systems by the sum of the solutions of many decoupled\nsystems, which can be solved in parallel. Previous numerical studies showed\nthat this reformulation allows taking arbitrarily long time steps for the\nlinear oscillatory parts.\n  The present work studies the non-linear shallow-water equations on the\nrotating sphere, a simplified system of equations used to study properties of\nspace and time discretization methods in the context of atmospheric\nsimulations. After introducing time integrators, we first compare the time step\nsizes to the errors in the simulation, discussing pros and cons of different\nformulations of REXI. Here, REXI already shows superior properties compared to\nexplicit and implicit time stepping methods. Additionally, we present\nwallclock-time-to-error results revealing the sweet spots of REXI obtaining\neither an over 6x higher accuracy within the same time frame or an about 3x\nreduced time-to-solution for a similar error threshold. Our results motivate\nfurther explorations of REXI for operational weather/climate systems.\n", "versions": [{"version": "v1", "created": "Wed, 16 May 2018 23:52:28 GMT"}, {"version": "v2", "created": "Wed, 17 Oct 2018 19:54:56 GMT"}, {"version": "v3", "created": "Sat, 2 Feb 2019 11:25:45 GMT"}], "update_date": "2019-02-05", "authors_parsed": [["Schreiber", "Martin", ""], ["Schaeffer", "Nathanaël", ""], ["Loft", "Richard", ""]]}, {"id": "1805.07472", "submitter": "Jeremy Morton", "authors": "Jeremy Morton, Freddie D. Witherden, Antony Jameson, Mykel J.\n  Kochenderfer", "title": "Deep Dynamical Modeling and Control of Unsteady Fluid Flows", "comments": "10 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The design of flow control systems remains a challenge due to the nonlinear\nnature of the equations that govern fluid flow. However, recent advances in\ncomputational fluid dynamics (CFD) have enabled the simulation of complex fluid\nflows with high accuracy, opening the possibility of using learning-based\napproaches to facilitate controller design. We present a method for learning\nthe forced and unforced dynamics of airflow over a cylinder directly from CFD\ndata. The proposed approach, grounded in Koopman theory, is shown to produce\nstable dynamical models that can predict the time evolution of the cylinder\nsystem over extended time horizons. Finally, by performing model predictive\ncontrol with the learned dynamical models, we are able to find a\nstraightforward, interpretable control law for suppressing vortex shedding in\nthe wake of the cylinder.\n", "versions": [{"version": "v1", "created": "Fri, 18 May 2018 23:14:17 GMT"}, {"version": "v2", "created": "Sat, 10 Nov 2018 02:31:56 GMT"}], "update_date": "2018-11-13", "authors_parsed": [["Morton", "Jeremy", ""], ["Witherden", "Freddie D.", ""], ["Jameson", "Antony", ""], ["Kochenderfer", "Mykel J.", ""]]}, {"id": "1805.08454", "submitter": "James Paulin", "authors": "James Paulin, Anisoara Calinescu and Michael Wooldridge", "title": "Understanding Flash Crash Contagion and Systemic Risk: A Micro-Macro\n  Agent-Based Approach", "comments": "37 pages, 9 figures", "journal-ref": "Journal of Economic Dynamics and Control 100 (2019) p.200-229", "doi": "10.1016/j.jedc.2018.12.008", "report-no": null, "categories": "q-fin.TR cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this paper is to advance the understanding of the conditions\nthat give rise to flash crash contagion, particularly with respect to\noverlapping asset portfolio crowding. To this end, we designed, implemented,\nand assessed a hybrid micro-macro agent-based model, where price impact arises\nendogenously through the limit order placement activity of algorithmic traders.\nOur novel hybrid microscopic and macroscopic model allows us to quantify\nsystemic risk not just in terms of system stability, but also in terms of the\nspeed of financial distress propagation over intraday timescales. We find that\nsystemic risk is strongly dependent on the behaviour of algorithmic traders, on\nleverage management practices, and on network topology. Our results demonstrate\nthat, for high-crowding regimes, contagion speed is a non-monotone function of\nportfolio diversification. We also find the surprising result that, in certain\ncircumstances, increased portfolio crowding is beneficial to systemic\nstability. We are not aware of previous studies that have exhibited this\nphenomenon, and our results establish the importance of considering non-uniform\nasset allocations in future studies. Finally, we characterise the time window\navailable for regulatory interventions during the propagation of flash crash\ndistress, with results suggesting ex ante precautions may have higher efficacy\nthan ex post reactions.\n", "versions": [{"version": "v1", "created": "Tue, 22 May 2018 08:30:52 GMT"}], "update_date": "2019-02-01", "authors_parsed": [["Paulin", "James", ""], ["Calinescu", "Anisoara", ""], ["Wooldridge", "Michael", ""]]}, {"id": "1805.08706", "submitter": "Jignesh Bhatt Shashikant", "authors": "Jignesh S. Bhatt and N. Padmanabhan", "title": "Automatic Data Registration of Geostationary Payloads for Meteorological\n  Applications at ISRO", "comments": "16 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The launch of KALPANA-1 satellite in the year 2002 heralded the establishment\nof an indigenous operational payload for meteorological predictions. This was\nfurther enhanced in the year 2003 with the launching of INSAT-3A satellite. The\nsoftware for generating products from the data of these two satellites was\ntaken up subsequently in the year 2004 and the same was installed at the Indian\nMeteorological Department, New Delhi in January 2006. Registration has been one\nof the most fundamental operations to generate almost all the data products\nfrom the remotely sensed data. Registration is a challenging task due to\ninevitable radiometric and geometric distortions during the acquisition\nprocess. Besides the presence of clouds makes the problem more complicated. In\nthis paper, we present an algorithm for multitemporal and multiband\nregistration. In addition, India facing reference boundaries for the CCD data\nof INSAT-3A have also been generated. The complete implementation is made up of\nthe following steps: 1) automatic identification of the ground control points\n(GCPs) in the sensed data, 2) finding the optimal transformation model based on\nthe match-points, and 3) resampling the transformed imagery to the reference\ncoordinates. The proposed algorithm is demonstrated using the real datasets\nfrom KALPANA-1 and INSAT-3A. Both KALAPANA-1 and INSAT-3A have recently been\ndecommissioned due to lack of fuel, however, the experience gained from them\nhave given rise to a series of meteorological satellites and associated\nsoftware; like INSAT-3D series which give continuous weather forecasting for\nthe country. This paper is not so much focused on the theory (widely available\nin the literature) but concentrates on the implementation of operational\nsoftware.\n", "versions": [{"version": "v1", "created": "Thu, 17 May 2018 07:41:48 GMT"}], "update_date": "2018-05-23", "authors_parsed": [["Bhatt", "Jignesh S.", ""], ["Padmanabhan", "N.", ""]]}, {"id": "1805.09135", "submitter": "Marco Frasca", "authors": "Maryam Sepehri and Marco Frasca", "title": "Analysis of Novel Annotations in the Gene Ontology for Boosting the\n  Selection of Negative Examples", "comments": "13 pages, 5 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Public repositories for genome and proteome annotations, such as the Gene\nOntology (GO), rarely stores negative annotations, i.e. proteins not possessing\na given function. This leaves undefined or ill defined the set of negative\nexamples, which is crucial for training the majority of machine learning\nmethods inferring proteins functions. Automated techniques to choose reliable\nnegative proteins are thereby required to train accurate function prediction\nmodels. This study proposes the first extensive analysis of the temporal\nevolution of protein annotations in the GO repository. Novel annotations\nregistered through the years have been analyzed to verify the presence of\nannotation patterns in the GO hierarchy. Our research supplied fundamental\nclues about proteins likely to be unreliable as negative examples, that we\nverified into a novel algorithm of our own construction, validated on two\norganisms in a genome wide fashion against approaches proposed to choose\nnegative examples in the context of functional prediction.\n", "versions": [{"version": "v1", "created": "Wed, 23 May 2018 13:31:32 GMT"}], "update_date": "2018-05-24", "authors_parsed": [["Sepehri", "Maryam", ""], ["Frasca", "Marco", ""]]}, {"id": "1805.10121", "submitter": "Edoardo di Napoli", "authors": "Jan Winkelmann (1) and Paul Springer (1) and Edoardo Di Napoli (1 and\n  2) ((1) AICES, RWTH Aachen University, (2) JSC, Forschungszentrum J\\\"ulich)", "title": "ChASE: Chebyshev Accelerated Subspace iteration Eigensolver for\n  sequences of Hermitian eigenvalue problems", "comments": "33 pages. Submitted to ACM TOMS", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.CE cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Solving dense Hermitian eigenproblems arranged in a sequence with direct\nsolvers fails to take advantage of those spectral properties which are\npertinent to the entire sequence, and not just to the single problem. When such\nfeatures take the form of correlations between the eigenvectors of consecutive\nproblems, as is the case in many real-world applications, the potential benefit\nof exploiting them can be substantial. We present ChASE, a modern algorithm and\nlibrary based on subspace iteration with polynomial acceleration. Novel to\nChASE is the computation of the spectral estimates that enter in the filter and\nan optimization of the polynomial degree which further reduces the necessary\nFLOPs. ChASE is written in C++ using the modern software engineering concepts\nwhich favor a simple integration in application codes and a straightforward\nportability over heterogeneous platforms. When solving sequences of Hermitian\neigenproblems for a portion of their extremal spectrum, ChASE greatly benefits\nfrom the sequence's spectral properties and outperforms direct solvers in many\nscenarios. The library ships with two distinct parallelization schemes,\nsupports execution over distributed GPUs, and it is easily extensible to other\nparallel computing architectures.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2018 12:56:18 GMT"}], "update_date": "2018-05-29", "authors_parsed": [["Winkelmann", "Jan", "", "AICES, RWTH Aachen University"], ["Springer", "Paul", "", "AICES, RWTH Aachen University"], ["Di Napoli", "Edoardo", "", "1 and\n  2"]]}, {"id": "1805.10420", "submitter": "Ming Dong", "authors": "Ming Dong and Alexandre B. Nassif", "title": "Combining Modified Weibull Distribution Models for Power System\n  Reliability Forecast", "comments": "8 pages, 8 figures", "journal-ref": "IEEE Transactions on Power Systems ( Volume: 34 , Issue: 2 , March\n  2019 )", "doi": "10.1109/TPWRS.2018.2877743", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In recent years, under deregulated environment, electric utility companies\nhave been encouraged to ensure maximum system reliability through the\nemployment of cost-effective long-term asset management strategies. To help\nachieve this goal, this research proposes a novel statistical approach to\nforecast power system asset population reliability. It uniquely combines a few\nmodified Weibull distribution models to build a robust joint forecast model. At\nfirst, the classic age based Weibull distribution model is reviewed. In\ncomparison, this paper proposes a few modified Weibull distribution models to\nincorporate special considerations for power system applications. Furthermore,\nthis paper proposes a novel method to effectively measure the forecast accuracy\nand evaluate different Weibull distribution models. As a result, for a specific\nasset population, the suitable model(s) can be selected. More importantly, if\nmore than one suitable model exists, these models can be mathematically\ncombined as a joint forecast model to forecast future asset reliability.\nFinally, the proposed methods were applied to a Canadian utility company for\nthe reliability forecast of electromechanical relays and the results are\ndiscussed in detail to demonstrate the practicality and usefulness of this\nresearch.\n", "versions": [{"version": "v1", "created": "Sat, 26 May 2018 03:12:23 GMT"}, {"version": "v2", "created": "Wed, 1 Jul 2020 04:29:15 GMT"}], "update_date": "2020-07-02", "authors_parsed": [["Dong", "Ming", ""], ["Nassif", "Alexandre B.", ""]]}, {"id": "1805.11007", "submitter": "Maria Bruna", "authors": "Maria Bruna, Philip K. Maini, Martin Robinson", "title": "Particle-based simulations of reaction-diffusion processes with Aboria", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.MS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical models of transport and reactions in biological systems have\nbeen traditionally written in terms of partial differential equations (PDEs)\nthat describe the time evolution of population-level variables. In recent\nyears, the use of stochastic particle-based models, which keep track of the\nevolution of each organism in the system, has become widespread. These models\nprovide a lot more detail than the population-based PDE models, for example by\nexplicitly modelling particle-particle interactions, but bring with them many\ncomputational challenges. In this paper we overview Aboria, a powerful and\nflexible C++ library for the implementation of numerical methods for\nparticle-based models. We demonstrate the use of Aboria with a commonly used\nmodel in mathematical biology, namely cell chemotaxis. Cells interact with each\nother and diffuse, biased by extracellular chemicals, that can be altered by\nthe cells themselves. We use a hybrid approach where particle-based models of\ncells are coupled with a PDE for the concentration of the extracellular\nchemical.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2018 16:07:30 GMT"}], "update_date": "2018-05-29", "authors_parsed": [["Bruna", "Maria", ""], ["Maini", "Philip K.", ""], ["Robinson", "Martin", ""]]}, {"id": "1805.11472", "submitter": "Carlos Alberto Bulant", "authors": "P.J. Blanco, C.A. Bulant, L.O. M\\\"uller, G.D. Maso Talou, C. Guedes\n  Bezerra, P.L. Lemos, R.A. Feij\\'oo", "title": "Comparison of 1D and 3D Models for the Estimation of Fractional Flow\n  Reserve", "comments": "11 pages, 2 figures, 2 tables, submited to Scientific Reports", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.med-ph cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we propose to validate the predictive capabilities of\none-dimensional (1D) blood flow models with full three-dimensional (3D) models\nin the context of patient-specific coronary hemodynamics in hyperemic\nconditions. Such conditions mimic the state of coronary circulation during the\nacquisition of the Fractional Flow Reserve (FFR) index. Demonstrating that 1D\nmodels accurately reproduce FFR estimates obtained with 3D models has\nimplications in the approach to computationally estimate FFR. To this end, a\nsample of 20 patients was employed from which 29 3D geometries of arterial\ntrees were constructed, 9 obtained from coronary computed tomography\nangiography (CCTA) and 20 from intra-vascular ultrasound (IVUS). For each 3D\narterial model, a 1D counterpart was generated. The same outflow and inlet\npressure boundary conditions were applied to both (3D and 1D) models. In the 1D\nsetting, pressure losses at stenoses and bifurcations were accounted for\nthrough specific lumped models. Comparisons between 1D models\n($\\text{FFR}_{\\text{1D}}$) and 3D models ($\\text{FFR}_{\\text{3D}}$) were\nperformed in terms of predicted $\\text{FFR}$ value. Compared to\n$\\text{FFR}_{\\text{3D}}$, $\\text{FFR}_{\\text{1D}}$ resulted with a difference\nof 0.00$\\pm$0.03 and overall predictive capability AUC, Acc, Spe, Sen, PPV and\nNPV of 0.97, 0.98, 0.90, 0.99, 0.82, and 0.99, with an FFR threshold of 0.8. We\nconclude that inexpensive $\\text{FFR}_{\\text{1D}}$ simulations can be reliably\nused as a surrogate of demanding $\\text{FFR}_{\\text{3D}}$ computations.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2018 13:50:55 GMT"}], "update_date": "2018-05-30", "authors_parsed": [["Blanco", "P. J.", ""], ["Bulant", "C. A.", ""], ["Müller", "L. O.", ""], ["Talou", "G. D. Maso", ""], ["Bezerra", "C. Guedes", ""], ["Lemos", "P. L.", ""], ["Feijóo", "R. A.", ""]]}, {"id": "1805.11978", "submitter": "Daniel Sch\\\"ollhammer", "authors": "D. Sch\\\"ollhammer and T.P. Fries", "title": "Kirchhoff-Love shell theory based on tangential differential calculus", "comments": "Submitted to Computational Mechanics V1: Initial submission V2:\n  Revised version for resubmission", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Kirchhoff-Love shell theory is recasted in the frame of the tangential\ndifferential calculus (TDC) where differential operators on surfaces are\nformulated based on global, three-dimensional coordinates. As a consequence,\nthere is no need for a parametrization of the shell geometry implying\ncurvilinear surface coordinates as used in the classical shell theory.\nTherefore, the proposed TDC-based formulation also applies to shell geometries\nwhich are zero-isosurfaces as in the level-set method where no parametrization\nis available in general. For the discretization, the TDC-based formulation may\nbe used based on surface meshes implying element-wise parametrizations. Then,\nthe results are equivalent to those obtained based on the classical theory.\nHowever, it may also be used in recent finite element approaches as the\nTraceFEM and CutFEM where shape functions are generated on a background mesh\nwithout any need for a parametrization. Numerical results presented herein are\nachieved with isogeometric analysis for classical and new benchmark tests.\nHigher-order convergence rates in the residual errors are achieved when the\nphysical fields are sufficiently smooth.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2018 12:57:07 GMT"}, {"version": "v2", "created": "Wed, 10 Oct 2018 12:28:57 GMT"}], "update_date": "2018-10-11", "authors_parsed": [["Schöllhammer", "D.", ""], ["Fries", "T. P.", ""]]}, {"id": "1805.12066", "submitter": "Irina Georgescu", "authors": "Irina Georgescu", "title": "The effect of prudence on the optimal allocation in possibilistic and\n  mixed models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper two portfolio choice models are studied: a purely possibilistic\nmodel, in which the return of a risky asset is a fuzzy number, and a mixed\nmodel in which a probabilistic background risk is added. For the two models an\napproximate formula of the optimal allocation is computed, with respect to the\npossibilistic moments associated with fuzzy numbers and the indicators of the\ninvestor risk preferences (risk aversion, prudence).\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2018 15:13:30 GMT"}], "update_date": "2018-05-31", "authors_parsed": [["Georgescu", "Irina", ""]]}, {"id": "1805.12111", "submitter": "Zhengyang Dong", "authors": "Zhengyang Dong", "title": "Dynamic Advisor-Based Ensemble (dynABE): Case study in stock trend\n  prediction of critical metal companies", "comments": "This is the latest version published in Plos ONE", "journal-ref": "PLOS ONE 14(2): e0212487 (2019)", "doi": "10.1371/journal.pone.0212487", "report-no": null, "categories": "q-fin.ST cs.CE cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stock trend prediction is a challenging task due to the market's noise, and\nmachine learning techniques have recently been successful in coping with this\nchallenge. In this research, we create a novel framework for stock prediction,\nDynamic Advisor-Based Ensemble (dynABE). dynABE explores domain-specific areas\nbased on the companies of interest, diversifies the feature set by creating\ndifferent \"advisors\" that each handles a different area, follows an effective\nmodel ensemble procedure for each advisor, and combines the advisors together\nin a second-level ensemble through an online update strategy we developed.\ndynABE is able to adapt to price pattern changes of the market during the\nactive trading period robustly, without needing to retrain the entire model. We\ntest dynABE on three cobalt-related companies, and it achieves the best-case\nmisclassification error of 31.12% and an annualized absolute return of 359.55%\nwith zero maximum drawdown. dynABE also consistently outperforms the baseline\nmodels of support vector machine, neural network, and random forest in all case\nstudies.\n", "versions": [{"version": "v1", "created": "Thu, 24 May 2018 04:03:39 GMT"}, {"version": "v2", "created": "Thu, 31 May 2018 02:39:02 GMT"}, {"version": "v3", "created": "Wed, 15 Aug 2018 03:00:45 GMT"}, {"version": "v4", "created": "Sat, 23 Feb 2019 00:47:43 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Dong", "Zhengyang", ""]]}, {"id": "1805.12223", "submitter": "Sameh Abdulah", "authors": "Sara Shehab, Sameh Abdulah, Arabi E. Keshk", "title": "A Survey of the State-of-the-Art Parallel Multiple Sequence Alignment\n  Algorithms on Multicore Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary modeling applications are the best way to provide full\ninformation to support in-depth understanding of evaluation of organisms. These\napplications mainly depend on identifying the evolutionary history of existing\norganisms and understanding the relations between them, which is possible\nthrough the deep analysis of their biological sequences. Multiple Sequence\nAlignment (MSA) is considered an important tool in such applications, where it\ngives an accurate representation of the relations between different biological\nsequences. In literature, many efforts have been put into presenting a new MSA\nalgorithm or even improving existing ones. However, little efforts on\noptimizing parallel MSA algorithms have been done. Nowadays, large datasets\nbecome a reality, and big data become a primary challenge in various fields,\nwhich should be also a new milestone for new bioinformatics algorithms. This\nsurvey presents four of the state-of-the-art parallel MSA algorithms, TCoffee,\nMAFFT, MSAProbs, and M2Align. We provide a detailed discussion of each\nalgorithm including its strengths, weaknesses, and implementation details and\nthe effectiveness of its parallel implementation compared to the other\nalgorithms, taking into account the MSA accuracy on two different datasets,\nBAliBASE and OXBench.\n", "versions": [{"version": "v1", "created": "Wed, 30 May 2018 20:48:59 GMT"}], "update_date": "2018-06-01", "authors_parsed": [["Shehab", "Sara", ""], ["Abdulah", "Sameh", ""], ["Keshk", "Arabi E.", ""]]}]