[{"id": "1102.1152", "submitter": "Hongbo Ni", "authors": "Hongbo Ni, Bessam Abdulrazak, Daqing Zhang, Shu Wu", "title": "CDTOM: A Context-driven Task-oriented Middleware for Pervasive Homecare\n  Environment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the growing number of the elderly, we see a greater demand for home\ncare, and the vision of pervasive computing is also floating into the domain of\nthe household that aims to build a smart home which can assist inhabitants\n(users) to live more conveniently and harmoniously. Such health-care pervasive\napplications in smart home should focus on the inhabitant's goal or task in\ndiverse situations, rather than the various complex devices and services. The\ncore challenge for homecare design is to perceive the environment and assess\noccurring situations, thus allowing systems to behave intelligently according\nto the user's intent. Due to the dynamic and heterogeneous nature of pervasive\ncomputing environment, it is difficult for an average user to obtain right\ninformation and service and in right place at right time. This paper proposes a\ncontext-driven task-oriented middleware (CDTOM) to meet the challenge. The most\nimportant component is its task model that provides an adequate high-level\ndescription of user-oriented tasks and their related contexts. Leveraging the\nmodel multiple entities can easily exchange, share and reuse their knowledge.\nBased on the hierarchy of task ontology, a novel task recognition approach\nusing CBR (case-based reasoning) is presented and the performance of task\nrecognition is evaluated by task number, context size and time costing.\nMoreover, a dynamic mechanism for mapping the recognized task and services is\nalso discussed. Finally, we present the design and implementation of our task\nsupporting system (TSS) to aid an inhabitant's tasks in light of his lifestyle\nand environment conditions in pervasive homecare environment, and the results\nof the prototype system show that our middleware approach achieves good\nefficiency of context management and good accuracy of user's activity\ninference, and can improve efficiently quality of user's life.\n", "versions": [{"version": "v1", "created": "Sun, 6 Feb 2011 14:00:30 GMT"}], "update_date": "2011-02-08", "authors_parsed": [["Ni", "Hongbo", ""], ["Abdulrazak", "Bessam", ""], ["Zhang", "Daqing", ""], ["Wu", "Shu", ""]]}, {"id": "1102.3325", "submitter": "Pejman Mirza-Babaei", "authors": "Pejman Mirza-Babaei", "title": "Using physiological measures in conjunction with other UX approaches for\n  better understanding of the player's gameplay experiences", "comments": "15 Pages. This paper has been presented at Games Research Methods\n  Seminar,8-9 April 2010,University of Tampere, Finland", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The goal of video games is to challenge and entertain the players. Successful\nvideo games deliver experience that impact players on a level of arousal.\nTherefore undertaking a user experience (UX) study is crucial to ensure that a\ngame achieves both critical and financial success. However, traditional\nusability methods (observation, subjective reporting, questionnaire, and\ninterview) have a number of limitations on game user research. In this study we\ncapture player's physiological measures during a gameplay session, to indicate\nmicro-events that have caused changes in their body signals. At the\npost-gameplay interviews we ask participants to comment and describe their\nfeelings on the selected events. The aim of this study is not to over-interpret\nphysiological measures, but on using blips in measures to help identify key\npoints in a game, which we then use to investigate further with the\nparticipant. This approach provides a method that can identify not only the\nnegative user experience and usability issues but also the events which have a\npositive impact on player's experience.\n", "versions": [{"version": "v1", "created": "Wed, 16 Feb 2011 12:42:59 GMT"}], "update_date": "2011-02-17", "authors_parsed": [["Mirza-Babaei", "Pejman", ""]]}, {"id": "1102.3865", "submitter": "Thomas Mandl", "authors": "Thomas Mandl, Christa Womser-Hacker", "title": "Probability Based Clustering for Document and User Properties", "comments": "In: Ojala, Timo (ed.): Infotech Oulo International Workshop on\n  Information Retrieval (IR 2001). Oulo, Finnland. 19.- 21.9.2001. S. 100-107", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.HC cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information Retrieval systems can be improved by exploiting context\ninformation such as user and document features. This article presents a model\nbased on overlapping probabilistic or fuzzy clusters for such features. The\nmodel is applied within a fusion method which linearly combines several\nretrieval systems. The fusion is based on weights for the different retrieval\nsystems which are learned by exploiting relevance feedback information. This\ncalculation can be improved by maintaining a model for each document and user\ncluster. That way, the optimal retrieval system for each document or user type\ncan be identified and applied. The extension presented in this article allows\noverlapping, probabilistic clusters of features to further refine the process.\n", "versions": [{"version": "v1", "created": "Fri, 18 Feb 2011 16:03:52 GMT"}], "update_date": "2011-02-21", "authors_parsed": [["Mandl", "Thomas", ""], ["Womser-Hacker", "Christa", ""]]}, {"id": "1102.5225", "submitter": "Teemu Roos", "authors": "Teemu Roos, Antti Oulasvirta, Laura Lepp\\\"anen and Arttu Modig", "title": "Let Us Dance Just a Little Bit More --- On the Information Capacity of\n  the Human Motor System", "comments": "Presented at the 2012 Information Theory and Applications Workshop,\n  San Diego, CA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.HC math.IT physics.bio-ph q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fitts' law is a fundamental tool in measuring the capacity of the human motor\nsystem. However, it is, by definition, limited to aimed movements toward\nspatially expanded targets. We revisit its information-theoretic basis with the\ngoal of generalizing it into unconstrained trained movement such as dance and\nsports. The proposed new measure is based on a subject's ability to accurately\nreproduce a complex movement pattern. We demonstrate our framework using\nmotion-capture data from professional dance performances.\n", "versions": [{"version": "v1", "created": "Fri, 25 Feb 2011 12:29:51 GMT"}, {"version": "v2", "created": "Thu, 3 Mar 2011 09:01:44 GMT"}, {"version": "v3", "created": "Fri, 13 May 2011 12:26:28 GMT"}, {"version": "v4", "created": "Mon, 13 Feb 2012 17:51:39 GMT"}], "update_date": "2012-02-14", "authors_parsed": [["Roos", "Teemu", ""], ["Oulasvirta", "Antti", ""], ["Leppänen", "Laura", ""], ["Modig", "Arttu", ""]]}]