[{"id": "1404.3167", "submitter": "Rebecca Hoyle", "authors": "Christopher J.K. Knight, Alexandra S. Penn and Rebecca B. Hoyle", "title": "A Dynamical Model of the Industrial Economy of the Humber Region", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Humber region in the UK is a large and diverse industrial area centred\naround oil refining, chemical industries and energy production. However there\nis currently a desire to see the region transition towards a more bio-based\neconomy. New bio-related industries are being situated in the region as a\nconsequence of policy and economic incentives. Many of these industries are\nconnected through their supply chains, either directly, or by sharing common\nsuppliers or customers and the growth or decline of one industry can hence have\nimpacts on many others. Therefore an important question to consider is what\neffect this movement towards bio-based industry will actually have on the\nregional economy as a whole. In this paper we develop a general abstract\ndynamical model for the metabolic interactions of firms or industries. This\ndynamical model has been applied to the Humber region in order to gain a deeper\nunderstanding of how the region may develop. The model suggests that the\ntransition to a bio-based economy will occur with oil refining losing its\ndominance to bioethanol production and biological chemical production, whilst\nanaerobic digestion grows as a major source of electricity, in turn driving up\nthe value of regional waste aggregators and arable farming in the overall\neconomy.\n", "versions": [{"version": "v1", "created": "Thu, 10 Apr 2014 15:16:05 GMT"}], "update_date": "2014-04-14", "authors_parsed": [["Knight", "Christopher J. K.", ""], ["Penn", "Alexandra S.", ""], ["Hoyle", "Rebecca B.", ""]]}, {"id": "1404.3347", "submitter": "Jean-Bernard Chatelain", "authors": "Jean-Bernard Chatelain, Kirsten Ralf", "title": "Stability and Identification with Optimal Macroprudential Policy Rules", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the identification, the determinacy and the stability\nof ad hoc, \"quasi-optimal\" and optimal policy rules augmented with financial\nstability indicators (such as asset prices deviations from their fundamental\nvalues) and minimizing the volatility of the policy interest rates, when the\ncentral bank precommits to financial stability. Firstly, ad hoc and\nquasi-optimal rules parameters of financial stability indicators cannot be\nidentified. For those rules, non zero policy rule parameters of financial\nstability indicators are observationally equivalent to rule parameters set to\nzero in another rule, so that they are unable to inform monetary policy.\nSecondly, under controllability conditions, optimal policy rules parameters of\nfinancial stability indicators can all be identified, along with a bounded\nsolution stabilizing an unstable economy as in Woodford (2003), with\ndeterminacy of the initial conditions of non- predetermined variables.\n", "versions": [{"version": "v1", "created": "Sun, 13 Apr 2014 06:27:31 GMT"}], "update_date": "2014-04-15", "authors_parsed": [["Chatelain", "Jean-Bernard", ""], ["Ralf", "Kirsten", ""]]}, {"id": "1404.3678", "submitter": "Vadim Borokhov Dr.", "authors": "Vadim Borokhov", "title": "On the properties of nodal price response matrix in electricity markets", "comments": "Paper shortened and reformatted, some explanations added", "journal-ref": "IEEE Transactions on Power Systems, 30(6): 3286-3294 November 2015", "doi": "10.1109/TPWRS.2014.2376494", "report-no": null, "categories": "math.OC q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We establish sufficient conditions for nodal price response matrix in\nelectric power system to be symmetric and negative (semi-)definite. The results\nare applicable for electricity markets with nonlinear and intertemporal\nconstraints.\n", "versions": [{"version": "v1", "created": "Mon, 14 Apr 2014 18:17:30 GMT"}, {"version": "v2", "created": "Sat, 24 Jan 2015 20:43:02 GMT"}], "update_date": "2015-10-05", "authors_parsed": [["Borokhov", "Vadim", ""]]}, {"id": "1404.7377", "submitter": "Stefano Olgiati PhD MS", "authors": "Stefano Olgiati, Gilberto Bronzini, Alessandro Danovi", "title": "The Italian Crisis and Producer Households Debt: a Source of Stability?\n  A Reproducible Research", "comments": "Accepted at the Risk, Banking and Finance Society, University of\n  Florence, New York University Stern Salomon Center, and Warsaw School of\n  Economics International Credit Risk Management Conference 2014, June 23,24 in\n  Warsaw, Poland", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The European Credit Research Institute Research Report 2013 identifies\nHouseholds debt \"rapid increase and abrupt retrenchment\" among the causes of\nmacroeconomic instability in the European Union after 2008. In our research: i)\nwe accessed the Bank of Italy Online Statistical Database on Customers and Risk\nfor Producer Households and Non-Financial Corporations with R Sweave open\naccess statistical software, which makes our analysis freely reproducible by\nother researchers; ii) we subset the European System of Accounts sector\nHouseholds into the Bank of Italy sub-sectors Households and Producer\nHouseholds, which are market producing entities limited to informal\npartnerships, de facto companies and sole proprietorships with up to five\nemployees and iii) we tested the hypothesis of \"rapid increase and abrupt\nretrenchment\" of debt for this subset in Italy for the period 1996-2013. We\nfound that PH debt (bad debt) has been more stable with a lower Variation\nCoefficient of 10.3% (14.2%) versus 13.2% (20.1%) in NFC. We also found that\nthe time series of the ratio of debt granted to NFC (numerator) versus PH\n(denominator) is best described (Multiple Squared 0.95) by the concavity of the\n5th degree coefficient (slope -1.22; 95% CI -1.52 - -0.91) of a 5th order\npolynomial linear regression and by the convexity of the 2nd degree coefficient\n(slope 4.26; 95% CI 2.53 - 5.99) for bad debt (Multiple R Squared 0.47), with\nthis concavity of debt and convexity of bad debt beginning with the Italian\ncrisis in the second trimester of 2008. We reject the hypothesis (p < 0.01) of\n\"rapid increase and abrupt retrenchment\" of debt for the subset Producer\nHouseholds during the Italian Crisis. We generate the hypothesis that this\nsubset could represent a prospective source of stability relative to\nNon-Financial Corporation.\n", "versions": [{"version": "v1", "created": "Mon, 28 Apr 2014 08:15:57 GMT"}], "update_date": "2014-04-30", "authors_parsed": [["Olgiati", "Stefano", ""], ["Bronzini", "Gilberto", ""], ["Danovi", "Alessandro", ""]]}]