[{"id": "1411.1152", "submitter": "Demian Pouzo", "authors": "Ignacio Esponda and Demian Pouzo", "title": "Berk-Nash Equilibrium: A Framework for Modeling Agents with Misspecified\n  Models", "comments": "The statement of Theorem 3 in the previous version was corrected. We\n  thank Yuichi Yamamoto for pointing out this correction to us", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an equilibrium framework that relaxes the standard assumption that\npeople have a correctly-specified view of their environment. Each player is\ncharacterized by a (possibly misspecified) subjective model, which describes\nthe set of feasible beliefs over payoff-relevant consequences as a function of\nactions. We introduce the notion of a Berk-Nash equilibrium: Each player\nfollows a strategy that is optimal given her belief, and her belief is\nrestricted to be the best fit among the set of beliefs she considers possible.\nThe notion of best fit is formalized in terms of minimizing the\nKullback-Leibler divergence, which is endogenous and depends on the equilibrium\nstrategy profile. Standard solution concepts such as Nash equilibrium and\nself-confirming equilibrium constitute special cases where players have\ncorrectly-specified models. We provide a learning foundation for Berk-Nash\nequilibrium by extending and combining results from the statistics literature\non misspecified learning and the economics literature on learning in games.\n", "versions": [{"version": "v1", "created": "Wed, 5 Nov 2014 05:03:24 GMT"}, {"version": "v2", "created": "Mon, 17 Aug 2015 04:31:29 GMT"}, {"version": "v3", "created": "Sat, 7 May 2016 15:17:12 GMT"}, {"version": "v4", "created": "Thu, 21 Nov 2019 02:34:36 GMT"}], "update_date": "2019-11-22", "authors_parsed": [["Esponda", "Ignacio", ""], ["Pouzo", "Demian", ""]]}, {"id": "1411.1368", "submitter": "C Maor", "authors": "Cy Maor and Eilon Solan", "title": "Cooperation under Incomplete Information on the Discount Factors", "comments": "appears in International Journal of Game Theory, 2014", "journal-ref": "Int J Game Theory (2015) 44: 321", "doi": "10.1007/s00182-014-0431-0", "report-no": null, "categories": "q-fin.EC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In repeated games, cooperation is possible in equilibrium only if players are\nsufficiently patient, and long-term gains from cooperation outweigh short-term\ngains from deviation. What happens if the players have incomplete information\nregarding each other's discount factors? In this paper we look at repeated\ngames in which each player has incomplete information regarding the other\nplayer's discount factor, and ask when full cooperation can arise in\nequilibrium. We provide necessary and sufficient conditions that allow full\ncooperation in equilibrium that is composed of grim trigger strategies, and\ncharacterize the states of the world in which full cooperation occurs. We then\nask whether these \"cooperation events\" are close to those in the complete\ninformation case, when the information on the other player's discount factor is\n\"almost\" complete.\n", "versions": [{"version": "v1", "created": "Tue, 14 Oct 2014 06:14:16 GMT"}], "update_date": "2019-01-23", "authors_parsed": [["Maor", "Cy", ""], ["Solan", "Eilon", ""]]}, {"id": "1411.2138", "submitter": "Francesco Sarracino", "authors": "Stefano Bartolini and Francesco Sarracino", "title": "It's not the economy, stupid! How social capital and GDP relate to\n  happiness over time", "comments": "48 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  What predicts the evolution over time of subjective well-being? We correlate\nthe trends of subjective well-being with the trends of social capital and/or\nGDP. We find that in the long and medium run social capital largely predicts\nthe trends of subjective wellbeing in our sample of countries. In the\nshort-term this relationship weakens. Indeed, in the short run, changes in\nsocial capital predict a much smaller portion of the changes in subjective\nwell-being than over longer periods. GDP follows a reverse path, thus\nconfirming the Easterlin paradox: in the short run GDP is more positively\ncorrelated to well-being than in the medium-term, while in the long run this\ncorrelation vanishes.\n", "versions": [{"version": "v1", "created": "Sat, 8 Nov 2014 17:09:39 GMT"}], "update_date": "2014-11-11", "authors_parsed": [["Bartolini", "Stefano", ""], ["Sarracino", "Francesco", ""]]}, {"id": "1411.2167", "submitter": "Shi-Dong Wang", "authors": "Shidong Wang, Renaud Foucart, Cheng Wan", "title": "Comeback kids: an evolutionary approach of the long-run innovation\n  process", "comments": "26 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide a theoretical framework to understand when firms may benefit from\nexploiting previously abandoned technologies and brands. We model for the long\nrun process of innovation, allowing for sustainable diversity and comebacks of\nold brands and technologies. We present two extensions to the logistic and\nLotka-Volterra equations, which describe the diffusion of an innovation. First,\nwe extend the short-term competition to a long-term process characterized by a\nsequence of innovations and substitutions. Second, by allowing the\nsubstitutions to be incomplete, we extend the one-dimensional process to a\ntree-form multidimensional one featuring diversification throughout the\nlong-term development.\n", "versions": [{"version": "v1", "created": "Sat, 8 Nov 2014 22:15:09 GMT"}, {"version": "v2", "created": "Wed, 27 Jul 2016 12:55:07 GMT"}], "update_date": "2016-07-28", "authors_parsed": [["Wang", "Shidong", ""], ["Foucart", "Renaud", ""], ["Wan", "Cheng", ""]]}, {"id": "1411.3078", "submitter": "Likuan Qin", "authors": "Likuan Qin and Vadim Linetsky", "title": "Long Term Risk: A Martingale Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper extends the long-term factorization of the stochastic discount\nfactor introduced and studied by Alvarez and Jermann (2005) in discretetime\nergodic environments and by Hansen and Scheinkman (2009) and Hansen (2012) in\nMarkovian environments to general semimartingale environments. The transitory\ncomponent discounts at the stochastic rate of return on the long bond and is\nfactorized into discounting at the long-term yield and a positive\nsemimartingale that extends the principal eigenfunction of Hansen and\nScheinkman (2009) to the semimartingale setting. The permanent component is a\nmartingale that accomplishes a change of probabilities to the long forward\nmeasure, the limit of T-forward measures. The change of probabilities from the\ndata generating to the long forward measure absorbs the long-term risk-return\ntrade-off and interprets the latter as the long-term risk-neutral measure.\n", "versions": [{"version": "v1", "created": "Wed, 12 Nov 2014 05:43:35 GMT"}, {"version": "v2", "created": "Wed, 6 May 2015 21:21:55 GMT"}, {"version": "v3", "created": "Wed, 13 Apr 2016 02:30:47 GMT"}, {"version": "v4", "created": "Wed, 4 May 2016 00:53:11 GMT"}, {"version": "v5", "created": "Fri, 19 Aug 2016 01:03:33 GMT"}, {"version": "v6", "created": "Tue, 4 Oct 2016 02:26:00 GMT"}], "update_date": "2016-10-05", "authors_parsed": [["Qin", "Likuan", ""], ["Linetsky", "Vadim", ""]]}, {"id": "1411.6250", "submitter": "Gaurab Aryal", "authors": "Gaurab Aryal", "title": "Identifying Multidiemsnional Adverse Selection Models", "comments": "43 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, I study the nonparametric identification of a multidimensional\nadverse selection model. In particular, I consider the screening model of\nRochet and Chone (1998), where products have multiple characteristics and\nconsumers have private information about their multidimensional taste for these\ncharacteristics, and determine the data features and additional condition(s)\nthat identify model parameters. The parameters include the nonparametric joint\ndensity of consumer taste, the cost function, and the utility function, and the\ndata includes individual-level data on choices and prices paid from one market.\nWhen the utility is nonlinear in product characteristics, however, data from\none market is not enough, but with data from at least two markets, or over two\nperiods, with different marginal prices is sufficient for identification as\nlong as these price differences are due to exogenous (and binary) changes in\ncost and not because the two markets are inherently different. I also derive\nall testable conditions for a joint distribution of observed choices and prices\nto be rationalized by a model of multidimensional adverse selection.\n", "versions": [{"version": "v1", "created": "Sun, 23 Nov 2014 15:36:45 GMT"}, {"version": "v2", "created": "Wed, 7 Jan 2015 21:56:41 GMT"}, {"version": "v3", "created": "Tue, 3 Feb 2015 15:43:08 GMT"}, {"version": "v4", "created": "Thu, 12 Mar 2015 15:12:59 GMT"}, {"version": "v5", "created": "Tue, 7 Apr 2015 14:03:05 GMT"}, {"version": "v6", "created": "Mon, 5 Oct 2015 20:27:36 GMT"}, {"version": "v7", "created": "Sat, 21 Nov 2015 04:13:58 GMT"}], "update_date": "2015-11-24", "authors_parsed": [["Aryal", "Gaurab", ""]]}, {"id": "1411.7880", "submitter": "Marcel Ausloos", "authors": "Roy Cerqueti and Marcel Ausloos", "title": "Evidence of Economic Regularities and Disparities of Italian Regions\n  From Aggregated Tax Income Size Data", "comments": "34 pages; 49 references; 29 figures; 9 Tables; to be published in\n  Physica A", "journal-ref": "Physica A 421 (2015) 187-207", "doi": "10.1016/j.physa.2014.11.027", "report-no": null, "categories": "physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses the size distribution, - in economic terms - of the\nItalian municipalities over the period 2007-2011. Yearly data are rather well\nfitted by a modified Lavalette law, while Zipf-Mandelbrot-Pareto law seems to\nfail in this doing. The analysis is performed either at a national as well as\nat a local (regional and provincial) level. Deviations are discussed as\noriginating in so called king and vice-roy effects. Results confirm that Italy\nis shared among very different regional realities. The case of Lazio is\npuzzling.\n", "versions": [{"version": "v1", "created": "Fri, 28 Nov 2014 14:34:08 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Cerqueti", "Roy", ""], ["Ausloos", "Marcel", ""]]}]