[{"id": "1503.00529", "submitter": "Sergei Maslov", "authors": "Sergei Maslov and Kim Sneppen", "title": "Diversity waves in collapse-driven population dynamics", "comments": "15 pages (including SI), 6 figures + 7 supplementary figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1004440", "report-no": null, "categories": "q-bio.PE nlin.AO physics.soc-ph q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Populations of species in ecosystems are often constrained by availability of\nresources within their environment. In effect this means that a growth of one\npopulation, needs to be balanced by comparable reduction in populations of\nothers. In neutral models of biodiversity all populations are assumed to change\nincrementally due to stochastic births and deaths of individuals. Here we\npropose and model another redistribution mechanism driven by abrupt and severe\ncollapses of the entire population of a single species freeing up resources for\nthe remaining ones. This mechanism may be relevant e.g. for communities of\nbacteria, with strain-specific collapses caused e.g. by invading\nbacteriophages, or for other ecosystems where infectious diseases play an\nimportant role.\n  The emergent dynamics of our system is cyclic \"diversity waves\" triggered by\ncollapses of globally dominating populations. The population diversity peaks at\nthe beginning of each wave and exponentially decreases afterwards. Species\nabundances are characterized by a bimodal time-aggregated distribution with the\nlower peak formed by populations of recently collapsed or newly introduced\nspecies, while the upper peak - species that has not yet collapsed in the\ncurrent wave. In most waves both upper and lower peaks are composed of several\nsmaller peaks. This self-organized hierarchical peak structure has a long-term\nmemory transmitted across several waves. It gives rise to a scale-free tail of\nthe time-aggregated population distribution with a universal exponent of 1.7.\nWe show that diversity wave dynamics is robust with respect to variations in\nthe rules of our model such as diffusion between multiple environments,\nspecies-specific growth and extinction rates, and bet-hedging strategies.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2015 14:03:39 GMT"}, {"version": "v2", "created": "Tue, 14 Jul 2015 18:39:20 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Maslov", "Sergei", ""], ["Sneppen", "Kim", ""]]}, {"id": "1503.02479", "submitter": "Baosen Zhang", "authors": "Baosen Zhang and Ramesh Johari and Ram Rajagopal", "title": "Competition and Efficiency of Coalitions in Cournot Games with\n  Uncertainty", "comments": "Submitted to IEEE TCNS", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY math.OC q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the impact of coalition formation on the efficiency of Cournot\ngames where producers face uncertainties. In particular, we study a market\nmodel where firms must determine their output before an uncertain production\ncapacity is realized. In contrast to standard Cournot models, we show that the\ngame is not efficient when there are many small firms. Instead, producers tend\nto act conservatively to hedge against their risks. We show that in the\npresence of uncertainty, the game becomes efficient when firms are allowed to\ntake advantage of diversity to form groups of certain sizes. We characterize\nthe tradeoff between market power and uncertainty reduction as a function of\ngroup size. In particular, we compare the welfare and output obtained with\ncoalitional competition, with the same benchmarks when output is controlled by\na single system operator. We show when there are $N$ firms present, competition\nbetween groups of size $\\Omega(\\sqrt{N})$ results in equilibria that are\nsocially optimal in terms of welfare and groups of size $\\Omega(N^{2/3})$ are\nsocially optimal in terms of production. We also extend our results to the case\nof uncertain demand by establishing an equivalency between Cournot oligopoly\nand Cournot Oligopsony. We demonstrate our results with real data from\nelectricity markets with significant wind power penetration.\n", "versions": [{"version": "v1", "created": "Mon, 9 Mar 2015 14:00:11 GMT"}, {"version": "v2", "created": "Mon, 14 Aug 2017 04:19:26 GMT"}], "update_date": "2017-08-15", "authors_parsed": [["Zhang", "Baosen", ""], ["Johari", "Ramesh", ""], ["Rajagopal", "Ram", ""]]}, {"id": "1503.04772", "submitter": "Mehdi Salimi", "authors": "Mehrnoosh Khademi, Massimiliano Ferrara, Bruno Pansera, Mehdi Salimi", "title": "A dynamic game on Green Supply Chain Management", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we establish a dynamic game to allocate CSR (Corporate Social\nResponsibility) to the members of a supply chain. We propose a model of\nthree-tier supply chain in decentralized state that is including supplier,\nmanufacturer and retailer. For analyzing supply chain performance in\ndecentralized state and the relationships between the members of supply chain,\nwe use Stackelberg game and we consider in this paper a hierarchical\nequilibrium solution for a two-level game. Specially, we formulate a model that\ncrosses through multi-periods by a dynamic discreet Stackelberg game. We try to\nobtain an equilibrium point at where both the profits of members and the level\nof CSR taken by supply chains are maximized.\n", "versions": [{"version": "v1", "created": "Thu, 12 Mar 2015 18:11:59 GMT"}], "update_date": "2015-03-17", "authors_parsed": [["Khademi", "Mehrnoosh", ""], ["Ferrara", "Massimiliano", ""], ["Pansera", "Bruno", ""], ["Salimi", "Mehdi", ""]]}, {"id": "1503.05283", "submitter": "Haonan Wu", "authors": "Haonan Wu", "title": "Re-visiting the Distance Coefficient in Gravity Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper revisits the classic gravity model in international trade and\nreexamines the distance coefficient. As pointed out by Frankel (1997), this\ncoefficient measures the relative unit transportation cost between short\ndistance and long distance rather than the absolute level of average\ntransportation cost. Our results confirm this point in the sense that the\ncoefficient has been very stable between 1991-2006, despite the obvious\ntechnological progress taken place during this period. Moreover, by comparing\nthe sensitivity of these coefficients to change in oil prices at short periods\nof time, in which technology remained unchanged, we conclude that the average\ntechnology has indeed reduced the average trading cost. The results are robust\nwhen we divide the aggregate international trades into different industries.\n", "versions": [{"version": "v1", "created": "Wed, 18 Mar 2015 04:58:18 GMT"}, {"version": "v2", "created": "Sun, 22 Mar 2015 04:58:52 GMT"}], "update_date": "2015-03-24", "authors_parsed": [["Wu", "Haonan", ""]]}, {"id": "1503.05416", "submitter": "Peter Helgesson", "authors": "Boualem Djehiche and Peter Helgesson", "title": "The Principal-Agent Problem With Time Inconsistent Utility Functions", "comments": "arXiv admin note: substantial text overlap with arXiv:1410.6392", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC math.PR q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study a generalization of the continuous time\nPrincipal-Agent problem allowing for time inconsistent utility functions, for\ninstance of mean-variance type. Using recent results on the Pontryagin maximum\nprinciple for FBSDEs we suggest a method of characterizing optimal contracts\nfor such models. To illustrate this we consider a fully solved explicit example\nin the linear quadratic setting.\n", "versions": [{"version": "v1", "created": "Wed, 18 Mar 2015 14:01:22 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Djehiche", "Boualem", ""], ["Helgesson", "Peter", ""]]}, {"id": "1503.07389", "submitter": "Andreas Bjerre-Nielsen", "authors": "Andreas Bjerre-Nielsen", "title": "Sorting in Networks: Adversity and Structure", "comments": "49 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  People choose friendships with people similar to themselves, i.e. they sort\nby resemblence. Economic studies have shown when sorting is optimal and\nconstitute an equilibrium, however, this presumes lack of beneficial\nspillovers. We investigate formation of economic and social networks where\nagents may form or cut ties. We combine a setup with link formation where\nagents have types that determine the value of a connection. We provide\nconditions for sorting in friendships, i.e. that agents tend to partner only\nwith those with those sufficiently similar to themselves. Conditions are\nprovided with and without beneficial spillovers from indirect connections. We\nshow that sorting may be suboptimal, yet a socially stable outcome, despite\notherwise obeying the conditions for sorting in Becker (1973). We analyze\npolicy tools to mitigate suboptimal sorting. Another feature is that agents\nwith higher value are more central in networks under certain conditions; a side\neffect is sorting by degree centrality under certain conditions. Finally we\nillustrate the limits to patterns of sorting and centrality.\n", "versions": [{"version": "v1", "created": "Wed, 25 Mar 2015 14:20:43 GMT"}, {"version": "v2", "created": "Thu, 26 Mar 2015 09:54:15 GMT"}, {"version": "v3", "created": "Tue, 31 Mar 2015 10:29:18 GMT"}, {"version": "v4", "created": "Tue, 2 Aug 2016 13:37:11 GMT"}, {"version": "v5", "created": "Tue, 15 Aug 2017 19:06:33 GMT"}], "update_date": "2017-08-17", "authors_parsed": [["Bjerre-Nielsen", "Andreas", ""]]}, {"id": "1503.08900", "submitter": "Wei He", "authors": "Wei He, Yeneng Sun", "title": "Dynamic Games with Almost Perfect Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper aims to solve two fundamental problems on finite or infinite\nhorizon dynamic games with perfect or almost perfect information. Under some\nmild conditions, we prove (1) the existence of subgame-perfect equilibria in\ngeneral dynamic games with almost perfect information, and (2) the existence of\npure-strategy subgame-perfect equilibria in perfect-information dynamic games\nwith uncertainty. Our results go beyond previous works on continuous dynamic\ngames in the sense that public randomization and the continuity requirement on\nthe state variables are not needed. As an illustrative application, a dynamic\nstochastic oligopoly market with intertemporally dependent payoffs is\nconsidered.\n", "versions": [{"version": "v1", "created": "Tue, 31 Mar 2015 03:45:03 GMT"}], "update_date": "2015-04-01", "authors_parsed": [["He", "Wei", ""], ["Sun", "Yeneng", ""]]}]