[{"id": "1504.02516", "submitter": "Gaurab Aryal", "authors": "Gaurab Aryal and Dong-Hyuk Kim", "title": "Empirical Relevance of Ambiguity in First Price Auction Models", "comments": "43 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the identification and estimation of first-price auction models\nwhere bidders have ambiguity about the valuation distribution and their\npreferences are represented by maxmin expected utility. When entry is\nexogenous, the distribution and ambiguity structure are nonparametrically\nidentified, separately from risk aversion (CRRA). We propose a flexible\nBayesian method based on Bernstein polynomials. Monte Carlo experiments show\nthat our method estimates parameters precisely, and chooses reserve prices with\n(nearly) optimal revenues, whether there is ambiguity or not. Furthermore, if\nthe model is misspecified -- incorrectly assuming no ambiguity among bidders --\nit may induce estimation bias with a substantial revenue loss.\n", "versions": [{"version": "v1", "created": "Thu, 9 Apr 2015 23:14:39 GMT"}], "update_date": "2015-04-13", "authors_parsed": [["Aryal", "Gaurab", ""], ["Kim", "Dong-Hyuk", ""]]}, {"id": "1504.03232", "submitter": "Giovanni Modanese", "authors": "Maria Letizia Bertotti and Giovanni Modanese", "title": "Economic inequality and mobility in kinetic models for social sciences", "comments": "11 pages, 6 figures. Proceedings of the Sigma-Phi Conference on\n  Statistical Physics, Rhodes, 2014", "journal-ref": "Europ. Phys. J. ST, 225 (2016) 1945-1958", "doi": "10.1140/epjst/e2015-50117-8", "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Statistical evaluations of the economic mobility of a society are more\ndifficult than measurements of the income distribution, because they require to\nfollow the evolution of the individuals' income for at least one or two\ngenerations. In micro-to-macro theoretical models of economic exchanges based\non kinetic equations, the income distribution depends only on the asymptotic\nequilibrium solutions, while mobility estimates also involve the detailed\nstructure of the transition probabilities of the model, and are thus an\nimportant tool for assessing its validity. Empirical data show a remarkably\ngeneral negative correlation between economic inequality and mobility, whose\nexplanation is still unclear. It is therefore particularly interesting to study\nthis correlation in analytical models. In previous work we investigated the\nbehavior of the Gini inequality index in kinetic models in dependence on\nseveral parameters which define the binary interactions and the taxation and\nredistribution processes: saving propensity, taxation rates gap, tax evasion\nrate, welfare means-testing etc. Here, we check the correlation of mobility\nwith inequality by analyzing the mobility dependence from the same parameters.\nAccording to several numerical solutions, the correlation is confirmed to be\nnegative.\n", "versions": [{"version": "v1", "created": "Tue, 27 Jan 2015 14:59:44 GMT"}], "update_date": "2016-11-01", "authors_parsed": [["Bertotti", "Maria Letizia", ""], ["Modanese", "Giovanni", ""]]}, {"id": "1504.03508", "submitter": "Peter Klimek", "authors": "Peter Klimek, Michael Obersteiner, Stefan Thurner", "title": "Systemic trade-risk of critical resources", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the wake of the 2008 financial crisis the role of strongly interconnected\nmarkets in fostering systemic instability has been increasingly acknowledged.\nTrade networks of commodities are susceptible to deleterious cascades of supply\nshocks that increase systemic trade-risks and pose a threat to geopolitical\nstability. On a global and a regional level we show that supply risk, scarcity,\nand price volatility of non-fuel mineral resources are intricately connected\nwith the structure of the world-trade network of or spanned by these resources.\nOn the global level we demonstrate that the scarcity of a resource, as measured\nby its trade volume compared to extractable reserves, is closely related to the\nsusceptibility of the trade network with respect to cascading shocks. On the\nregional level we find that to some extent the region-specific price volatility\nand supply risk can be understood by centrality measures that capture systemic\ntrade-risk. The resources associated with the highest systemic trade-risk\nindicators are often those that are produced as byproducts of major metals. We\nidentify significant shortcomings in the management of systemic trade-risk, in\nparticular in the EU.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2015 12:08:54 GMT"}], "update_date": "2015-04-15", "authors_parsed": [["Klimek", "Peter", ""], ["Obersteiner", "Michael", ""], ["Thurner", "Stefan", ""]]}, {"id": "1504.03895", "submitter": "Cyril Pitrou", "authors": "Cyril Pitrou", "title": "Graph representation of balance sheets: from exogenous to endogenous\n  money", "comments": "25 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The nature of monetary arrangements is often discussed without any reference\nto its detailed construction. We present a graph representation that allows for\na clear understanding of modern monetary systems. First, we show that systems\nbased on commodity money are incompatible with credit. We then study the\ncurrent chartalist systems based on pure fiat money, and we discuss the\nconsolidation of the central bank with the Treasury. We obtain a visual\nexplanation about how commercial banks are responsible for endogenous money\ncreation whereas the Treasury and the central bank are in charge of the total\namount of net money. Finally we draw an analogy between systems based on gold\nconvertibility and currency pegs to show that fixed exchange rates can never be\nmaintained.\n", "versions": [{"version": "v1", "created": "Wed, 15 Apr 2015 12:54:51 GMT"}, {"version": "v2", "created": "Thu, 10 Sep 2015 22:05:20 GMT"}, {"version": "v3", "created": "Tue, 30 Jan 2018 22:21:29 GMT"}], "update_date": "2018-02-01", "authors_parsed": [["Pitrou", "Cyril", ""]]}, {"id": "1504.06113", "submitter": "Matthias Raddant", "authors": "Matthias Raddant and Friedrich Wagner", "title": "Transitions in the Stock Markets of the US, UK, and Germany", "comments": null, "journal-ref": "Quantitative Finance, 17(2), 289-297 (2017)", "doi": "10.1080/14697688.2016.1183812", "report-no": null, "categories": "q-fin.PM cond-mat.stat-mech q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In an analysis of the US, the UK, and the German stock market we find a\nchange in the behavior based on the stock's beta values. Before 2006 risky\ntrades were concentrated on stocks in the IT and technology sector. Afterwards\nrisky trading takes place for stocks from the financial sector. We show that an\nagent-based model can reproduce these changes. We further show that the initial\nimpulse for the transition might stem from the increase of high frequency\ntrading at that time.\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2015 09:52:10 GMT"}], "update_date": "2017-01-16", "authors_parsed": [["Raddant", "Matthias", ""], ["Wagner", "Friedrich", ""]]}, {"id": "1504.06634", "submitter": "Mohsen Mosleh", "authors": "Babak Heydari, Mohsen Mosleh, Kia Dalili", "title": "Efficient Network Structures with Separable Heterogeneous Connection\n  Costs", "comments": "9 pages", "journal-ref": "Economics Letters, Vol. 134, September 2015, 82-85", "doi": "10.1016/j.econlet.2015.06.014", "report-no": null, "categories": "q-fin.EC cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a heterogeneous connection model for network formation to\ncapture the effect of cost heterogeneity on the structure of efficient\nnetworks. In the proposed model, connection costs are assumed to be separable,\nwhich means the total connection cost for each agent is uniquely proportional\nto its degree. For these sets of networks, we provide the analytical solution\nfor the efficient network and discuss stability impli- cations. We show that\nthe efficient network exhibits a core-periphery structure, and for a given\ndensity, we find a lower bound for clustering coefficient of the efficient\nnetwork.\n", "versions": [{"version": "v1", "created": "Fri, 24 Apr 2015 20:28:53 GMT"}, {"version": "v2", "created": "Tue, 7 Jul 2015 20:51:20 GMT"}, {"version": "v3", "created": "Fri, 11 Dec 2015 15:45:51 GMT"}], "update_date": "2015-12-14", "authors_parsed": [["Heydari", "Babak", ""], ["Mosleh", "Mohsen", ""], ["Dalili", "Kia", ""]]}, {"id": "1504.06909", "submitter": "Yongyang Cai", "authors": "Yongyang Cai, Kenneth L. Judd, Thomas S. Lontzek", "title": "The Social Cost of Carbon with Economic and Climate Risks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is great uncertainty about future climate conditions and the\nappropriate policies for managing interactions between the climate and the\neconomy. We develop a multidimensional computational model to examine how\nuncertainties and risks in the economic and climate systems affect the social\ncost of carbon (SCC)---that is, the present value of the marginal damage to\neconomic output caused by carbon emissions. The SCC is substantially increased\nby economic and climate risks at both current and future times. Furthermore,\nthe SCC is itself a stochastic process with significant variation; for example,\nthe basic elements of risk incorporated into our model cause the SCC in 2100 to\nbe, with significant probability, ten times what it would be without those\nrisks. We have only imprecise information about what parameter values are best\nfor approximating reality. To deal with this parametric uncertainty we perform\nextensive uncertainty quantification and show that these findings are robust\nfor a wide range of alternative specifications. More generally, this work shows\nthat large-scale computing can enable economists to examine substantially more\ncomplex and realistic models for the purposes of policy analysis.\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2015 02:31:52 GMT"}, {"version": "v2", "created": "Tue, 28 Apr 2015 22:04:44 GMT"}], "update_date": "2015-04-30", "authors_parsed": [["Cai", "Yongyang", ""], ["Judd", "Kenneth L.", ""], ["Lontzek", "Thomas S.", ""]]}]