[{"id": "1603.00850", "submitter": "Robert E. Kopp", "authors": "Robert E. Kopp, Rachael Shwom, Gernot Wagner, Jiacan Yuan", "title": "Tipping elements and climate-economic shocks: Pathways toward integrated\n  assessment", "comments": "43 pages, 2 figure, 2 tables. Published in Earth's Future", "journal-ref": null, "doi": "10.1002/2016EF000362", "report-no": null, "categories": "q-fin.EC physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The literature on the costs of climate change often draws a link between\nclimatic 'tipping points' and large economic shocks, frequently called\n'catastrophes'. The use of the phrase 'tipping points' in this context can be\nmisleading. In popular and social scientific discourse, 'tipping points'\ninvolve abrupt state changes. For some climatic 'tipping points,' the\ncommitment to a state change may occur abruptly, but the change itself may be\nrate-limited and take centuries or longer to realize. Additionally, the\nconnection between climatic 'tipping points' and economic losses is tenuous,\nthough emerging empirical and process-model-based tools provide pathways for\ninvestigating it. We propose terminology to clarify the distinction between\n'tipping points' in the popular sense, the critical thresholds exhibited by\nclimatic and social 'tipping elements,' and 'economic shocks'. The last may be\nassociated with tipping elements, gradual climate change, or non-climatic\ntriggers. We illustrate our proposed distinctions by surveying the literature\non climatic tipping elements, climatically sensitive social tipping elements,\nand climate-economic shocks, and we propose a research agenda to advance the\nintegrated assessment of all three.\n", "versions": [{"version": "v1", "created": "Wed, 2 Mar 2016 20:16:10 GMT"}, {"version": "v2", "created": "Fri, 6 May 2016 17:50:23 GMT"}, {"version": "v3", "created": "Mon, 11 Jul 2016 14:33:23 GMT"}], "update_date": "2016-07-12", "authors_parsed": [["Kopp", "Robert E.", ""], ["Shwom", "Rachael", ""], ["Wagner", "Gernot", ""], ["Yuan", "Jiacan", ""]]}, {"id": "1603.00991", "submitter": "Ravi Kashyap", "authors": "Ravi Kashyap", "title": "Financial Services, Economic Growth and Well-Being: A Four-Pronged Study", "comments": "Contains Supplementary Material (Research Questions, Methodology and\n  Data Sources) in the Appendix", "journal-ref": "Indian Journal of Finance, Vol. 9, No. 1 (2015), pp. 9-22", "doi": "10.17010//2015/v9i1/71531", "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A four-pronged approach to dealing with Social Science Phenomenon is\noutlined. This methodology is applied to Financial Services, Economic Growth\nand Well-Being. The four prongs are like the four directions for an army\ngeneral looking for victory. Just like the four directions, we need to be aware\nthat there is a degree of interconnectedness in the below four prongs.\n-Uncertainty Principle of the Social Sciences -Responsibilities of Fiscal\nJanitors -Need for Smaller Organizations -Redirecting Growth that Generates\nGarbage The importance of gaining a more profound comprehension of welfare and\ndelineating its components into those that result from an increase in goods and\nservices, and hence can be attributed to economic growth, and into those that\nare not related to economic growth but lead to a better quality of life, is\nhighlighted. The reasoning being that economic growth alone is an inadequate\nindicator of well-being. Hand in hand with a better understanding of the\ncharacteristics of welfare, comes the need to consider the metrics we currently\nhave that gauge economic growth and supplement those with measures that capture\nwell-being more holistically.\n", "versions": [{"version": "v1", "created": "Thu, 3 Mar 2016 06:35:43 GMT"}, {"version": "v2", "created": "Tue, 9 May 2017 07:02:47 GMT"}], "update_date": "2017-05-10", "authors_parsed": [["Kashyap", "Ravi", ""]]}, {"id": "1603.01416", "submitter": "Bent Flyvbjerg", "authors": "Atif Ansar, Bent Flyvbjerg, Alexander Budzier, and Daniel Lunn", "title": "Big is Fragile: An Attempt at Theorizing Scale", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we characterise the propensity of big capital investments to\nsystematically deliver poor outcomes as \"fragility,\" a notion suggested by\nNassim Taleb. A thing or system that is easily harmed by randomness is fragile.\nWe argue that, contrary to their appearance, big capital investments break\neasily - i.e. deliver negative net present value - due to various sources of\nuncertainty that impact them during their long gestation, implementation, and\noperation periods. We do not refute the existence of economies of scale and\nscope. Instead we argue that big capital investments have a disproportionate\n(non-linear) exposure to uncertainties that deliver poor or negative returns\nabove and beyond their economies of scale and scope. We further argue that to\nsucceed, leaders of capital projects need to carefully consider where scaling\npays off and where it does not. To automatically assume that \"bigger is\nbetter,\" which is common in megaproject management, is a recipe for failure.\n", "versions": [{"version": "v1", "created": "Fri, 4 Mar 2016 10:31:54 GMT"}, {"version": "v2", "created": "Thu, 1 Jun 2017 22:38:10 GMT"}], "update_date": "2017-06-05", "authors_parsed": [["Ansar", "Atif", ""], ["Flyvbjerg", "Bent", ""], ["Budzier", "Alexander", ""], ["Lunn", "Daniel", ""]]}, {"id": "1603.01685", "submitter": "Ron Nielsen", "authors": "Ron W Nielsen", "title": "Mathematical analysis of historical income per capita distributions", "comments": "20 pages, 8 figures, 1 table, 8331 words", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Data describing historical growth of income per capita [Gross Domestic\nProduct per capita (GDP/cap)] for the world economic growth and for the growth\nin Western Europe, Eastern Europe, Asia, former USSR, Africa and Latin America\nare analysed. They follow closely the linearly-modulated hyperbolic\ndistributions represented by the ratios of hyperbolic distributions obtained by\nfitting the GDP and population data. Results of this analysis demonstrate that\nincome per capita was increasing monotonically. There was no stagnation and\nthere were no transitions from stagnation to growth. The usually postulated\ndramatic escapes from the Malthusian trap never happened because there was no\ntrap. Unified Growth Theory is fundamentally incorrect because its central\npostulates are contradicted repeatedly by data, which were used but never\nanalysed during the formulation of this theory. The large body of\nreadily-available data opens new avenues for the economic and demographic\nresearch. They show that certain fundamental postulates revolving around the\nconcept of Malthusian stagnation need to be replaced by the evidence-based\ninterpretations. Within the range of analysable data, which for the growth of\npopulation extends down to 10,000 BC, growth of human population and economic\ngrowth were hyperbolic. There was no Malthusian stagnation and there were no\ntransitions to distinctly faster trajectories. Industrial Revolution had no\nimpact on changing growth trajectories.\n", "versions": [{"version": "v1", "created": "Sat, 5 Mar 2016 06:30:18 GMT"}, {"version": "v2", "created": "Fri, 25 Mar 2016 04:04:03 GMT"}, {"version": "v3", "created": "Fri, 29 Apr 2016 21:15:09 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Nielsen", "Ron W", ""]]}, {"id": "1603.02438", "submitter": "Gopal Basak", "authors": "Gopal K. Basak, Pranab Kumar Das and Allena Rohit", "title": "A Mathematical Model of Foreign Capital Inflow", "comments": "32 pages, 4 sets of figures each set consists of capital inflow,\n  interest rate and exchange rate", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.GN q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper models foreign capital inflow from the developed to the developing\ncountries in a stochastic dynamic programming (SDP) framework. Under some\nregularity conditions, the existence of the solutions to the SDP problem is\nproved and they are then obtained by numerical technique because of the\nnon-linearity of the related functions. A number of comparative dynamic\nanalyses explore the impact of parameters of the model on dynamic paths of\ncapital inflow, interest rate in the international loan market and the exchange\nrate.\n", "versions": [{"version": "v1", "created": "Tue, 8 Mar 2016 09:35:58 GMT"}, {"version": "v2", "created": "Sat, 20 May 2017 11:30:04 GMT"}], "update_date": "2017-05-23", "authors_parsed": [["Basak", "Gopal K.", ""], ["Das", "Pranab Kumar", ""], ["Rohit", "Allena", ""]]}, {"id": "1603.05142", "submitter": "Tomasz Gubiec", "authors": "Pawe{\\l} Smaga, Mateusz Wili\\'nski, Piotr Ochnicki, Piotr Arendarski\n  and Tomasz Gubiec", "title": "Can banks default overnight? Modeling endogenous contagion on O/N\n  interbank market", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC physics.soc-ph q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new model of the liquidity driven banking system focusing on\novernight interbank loans. This significant branch of the interbank market is\ncommonly neglected in the banking system modeling and systemic risk analysis.\nWe construct a model where banks are allowed to use both the interbank and the\nsecurities markets to manage their liquidity demand and supply as driven by\nprudential requirements in a volatile environment. The network of interbank\nloans is dynamic and simulated every day. We show how only the intrasystem cash\nfluctuations, without any external shocks, may lead to systemic defaults, what\nmay be a symptom of the self-organized criticality of the system. We also\nanalyze the impact of different prudential regulations and market conditions on\nthe interbank market resilience. We confirm that central bank's asset purchase\nprograms, limiting the declines in government bond prices, can successfully\nstabilize bank's liquidity demand. The model can be used to analyze the\ninterbank market impact of macroprudential tools.\n", "versions": [{"version": "v1", "created": "Wed, 16 Mar 2016 15:22:59 GMT"}], "update_date": "2016-03-17", "authors_parsed": [["Smaga", "Paweł", ""], ["Wiliński", "Mateusz", ""], ["Ochnicki", "Piotr", ""], ["Arendarski", "Piotr", ""], ["Gubiec", "Tomasz", ""]]}, {"id": "1603.05828", "submitter": "Fabio Sabatini", "authors": "Angelo Antoci, Fabio Sabatini, Francesco Sarracino", "title": "Online Networks, Social Interaction and Segregation: An Evolutionary\n  Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.GT math.DS q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have developed an evolutionary game model, where agents can choose between\ntwo forms of social participation: interaction via online social networks and\ninteraction by exclusive means of face-to-face encounters. We illustrate the\nsocietal dynamics that the model predicts, in light of the empirical evidence\nprovided by previous literature. We then assess their welfare implications. We\nshow that dynamics, starting from a world in which online social interaction is\nless gratifying than offline encounters, will lead to the extinction of the\nsub-population of online networks users, thereby making Facebook and alike\ndisappear in the long run. Furthermore, we show that the higher the propensity\nfor discrimination between the two sub-populations of socially active\nindividuals, the greater the probability that individuals will ultimately\nsegregate themselves, making society fall into a social poverty trap.\n", "versions": [{"version": "v1", "created": "Fri, 18 Mar 2016 10:51:38 GMT"}], "update_date": "2016-03-21", "authors_parsed": [["Antoci", "Angelo", ""], ["Sabatini", "Fabio", ""], ["Sarracino", "Francesco", ""]]}, {"id": "1603.06034", "submitter": "Ravi Kashyap", "authors": "Ravi Kashyap", "title": "Solving Society's Big Ills, A Small Step", "comments": "arXiv admin note: substantial text overlap with arXiv:1603.00991", "journal-ref": "Asian Social Science, (April 2017), Canadian Center of Science and\n  Education, Vol. 13, No. 4, pp. 175-191", "doi": "10.5539/ass.v13n4p175", "report-no": null, "categories": "q-fin.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We look at a collection of conjectures with the unifying message that smaller\nsocial systems, tend to be less complex and can be aligned better, towards\nfulfilling their intended objectives. We touch upon a framework, referred to as\nthe four pronged approach that can aid the analysis of social systems. The four\nprongs are:\n  1. The Uncertainty Principle of the Social Sciences\n  2. The Objectives of a Social System or the Responsibilities of the Players\n  3. The Need for Smaller Organizations\n  4. Redirecting Unintended Outcomes\n  Smaller organizations mitigating the disruptive effects of corruption is\ndiscussed and also the need for organizations, whose objective is to foster the\ndevelopment of other smaller organizations. We consider a way of life, which is\nabout respect for knowledge and a desire to seek it. Knowledge can help\neradicate ignorance, but the accumulation of knowledge can lead to\noverconfidence. Hence it becomes important to instill an attitude that does not\nknowledge too seriously, along with the thirst for knowledge. All of this is\nimportant to create an environment that is conducive for smaller organizations\nand can be viewed as a natural extension of studies that fall under the wider\ncategory of understanding factors and policies aimed at increasing the welfare\nor well-being to society.\n", "versions": [{"version": "v1", "created": "Sat, 19 Mar 2016 02:43:06 GMT"}, {"version": "v2", "created": "Tue, 31 May 2016 09:44:15 GMT"}, {"version": "v3", "created": "Tue, 2 Aug 2016 08:31:44 GMT"}, {"version": "v4", "created": "Mon, 26 Sep 2016 08:44:22 GMT"}, {"version": "v5", "created": "Sun, 26 Mar 2017 12:34:07 GMT"}], "update_date": "2017-03-28", "authors_parsed": [["Kashyap", "Ravi", ""]]}, {"id": "1603.06047", "submitter": "Ravi Kashyap", "authors": "Ravi Kashyap", "title": "The Circle of Investment: Connecting the Dots of the Portfolio\n  Management Cycle...", "comments": "Expanded into a book \"The Circle of Investment\", Available at\n  http://www.amazon.com", "journal-ref": "International Journal of Economics and Finance, Vol. 6, No. 5\n  (2014), pp. 244-263", "doi": "10.5539/ijef.v6n5p244", "report-no": null, "categories": "q-fin.PM q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We will look at the entire cycle of the investment process relating to all\naspects of, formulating an investment hypothesis, constructing a portfolio\nbased on that, executing the trades to implement it, on-going risk management,\nperiodically measuring the performance of the portfolio, and rebalancing the\nportfolio either due to an increase in the risk parameters or due to a\ndeviation from the intended asset allocation. We provide several illustrative\nanalogies that are meant to intuitively explain the pleasures and the pitfalls\nthat can arise while managing a portfolio. If we consider the entire investment\nmanagement procedure as being akin to connecting the dots of a circle, then the\nCircle of Investment can be represented as a dotted circle with many dots\nfalling approximately on the circumference and with no clue about the exact\nlocation of the centre or the length of the radius. We represent the investment\nprocess as a dotted circle since there is a lot of ambiguity in the various\nsteps involved. The circle also indicates the repetitive nature of many steps\nthat are continuously carried out while investing. This work introduces two new\npoints pertaining to this dotted circle and improves the ability, to understand\nhow far-off this dotted circle is, from a more well-defined circle and, to\ncreate a well-formed circle. The two innovations we introduce are:\n  1. The first, relating to the limitations that apply to any finding in the\nsocial sciences, would be the additional point we introduce that lies near the\ncentre of the circle. We title this as, 'The Uncertainty Principle of the\nSocial Sciences'.\n  2. The second, relating to establishing confidence levels in a systematic\nmanner for each view we associate with a security or group of securities as\nrequired by the Black-Litterman framework, would be the new point we present\nnear the circumference of the circle.\n", "versions": [{"version": "v1", "created": "Sat, 19 Mar 2016 05:29:40 GMT"}, {"version": "v2", "created": "Thu, 31 Mar 2016 03:21:09 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Kashyap", "Ravi", ""]]}, {"id": "1603.06407", "submitter": "Manuel Sebastian Mariani", "authors": "Rui-Jie Wu, Gui-Yuan Shi, Yi-Cheng Zhang, Manuel Sebastian Mariani", "title": "The mathematics of non-linear metrics for nested networks", "comments": null, "journal-ref": "Physica A: Statistical Mechanics and its Applications 460 (2016):\n  254-269", "doi": "10.1016/j.physa.2016.05.023", "report-no": null, "categories": "q-fin.EC cs.DM cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Numerical analysis of data from international trade and ecological networks\nhas shown that the non-linear fitness-complexity metric is the best candidate\nto rank nodes by importance in bipartite networks that exhibit a nested\nstructure. Despite its relevance for real networks, the mathematical properties\nof the metric and its variants remain largely unexplored. Here, we perform an\nanalytic and numeric study of the fitness-complexity metric and a new variant,\ncalled minimal extremal metric. We rigorously derive exact expressions for node\nscores for perfectly nested networks and show that these expressions explain\nthe non-trivial convergence properties of the metrics. A comparison between the\nfitness-complexity metric and the minimal extremal metric on real data reveals\nthat the latter can produce improved rankings if the input data are reliable.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2016 12:27:22 GMT"}], "update_date": "2018-06-04", "authors_parsed": [["Wu", "Rui-Jie", ""], ["Shi", "Gui-Yuan", ""], ["Zhang", "Yi-Cheng", ""], ["Mariani", "Manuel Sebastian", ""]]}, {"id": "1603.06888", "submitter": "Jean-Francois Mercure", "authors": "F. Knobloch and J.-F. Mercure", "title": "The behavioural aspect of green technology investments: a general\n  positive model in the context of heterogeneous agents", "comments": "21 pages, 6 figures, 7 tables, to appear in Environmental Innovation\n  and Societal Transitions", "journal-ref": "Environmental Innovation and Societal Transitions 21 (2016) 39-55", "doi": "10.1016/j.eist.2016.03.002", "report-no": null, "categories": "q-fin.EC cs.MA physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Studies report that firms do not invest in cost-effective green technologies.\nWhile economic barriers can explain parts of the gap, behavioural aspects cause\nfurther under-valuation. This could be partly due to systematic deviations of\ndecision-making agents' perceptions from normative benchmarks, and partly due\nto their diversity. This paper combines available behavioural knowledge into a\nsimple model of technology adoption. Firms are modelled as heterogeneous agents\nwith different behavioural responses. To quantify the gap, the model simulates\ntheir investment decisions from different theoretical perspectives. While\nrelevant parameters are uncertain at the micro-level, using distributed agent\nperspectives provides a realistic representation of the macro adoption rate.\nThe model is calibrated using audit data for proposed investments in energy\nefficient electric motors. The inclusion of behavioural factors reduces\nsignificantly expected adoption rates: from 81% using a normative optimisation\nperspective, down to 20% using a behavioural perspective. The effectiveness of\nvarious policies is tested.\n", "versions": [{"version": "v1", "created": "Tue, 22 Mar 2016 17:48:47 GMT"}], "update_date": "2017-03-09", "authors_parsed": [["Knobloch", "F.", ""], ["Mercure", "J. -F.", ""]]}, {"id": "1603.07682", "submitter": "Bo Waggoner", "authors": "Robert Kleinberg, Bo Waggoner, E. Glen Weyl", "title": "Descending Price Optimally Coordinates Search", "comments": "JEL Classification: D44, D47, D82, D83. 117 pages, of which 74 are\n  appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Investigating potential purchases is often a substantial investment under\nuncertainty. Standard market designs, such as simultaneous or English auctions,\ncompound this with uncertainty about the price a bidder will have to pay in\norder to win. As a result they tend to confuse the process of search both by\nleading to wasteful information acquisition on goods that have already found a\ngood purchaser and by discouraging needed investigations of objects,\npotentially eliminating all gains from trade. In contrast, we show that the\nDutch auction preserves all of its properties from a standard setting without\ninformation costs because it guarantees, at the time of information\nacquisition, a price at which the good can be purchased. Calibrations to\nstart-up acquisition and timber auctions suggest that in practice the social\nlosses through poor search coordination in standard formats are an order of\nmagnitude or two larger than the (negligible) inefficiencies arising from\nex-ante bidder asymmetries.\n", "versions": [{"version": "v1", "created": "Thu, 24 Mar 2016 17:49:24 GMT"}, {"version": "v2", "created": "Mon, 25 Jul 2016 18:21:26 GMT"}, {"version": "v3", "created": "Wed, 21 Dec 2016 18:05:22 GMT"}], "update_date": "2016-12-22", "authors_parsed": [["Kleinberg", "Robert", ""], ["Waggoner", "Bo", ""], ["Weyl", "E. Glen", ""]]}, {"id": "1603.08142", "submitter": "Mikhail Timonin", "authors": "Mikhail Timonin", "title": "Conjoint axiomatization of the Choquet integral for heterogeneous\n  product sets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an axiomatization of the Choquet integral model for the general\ncase of a heterogeneous product set $X = X_1 \\times \\ldots \\times X_n$. In MCDA\nelements of $X$ are interpreted as alternatives, characterized by criteria\ntaking values from the sets $X_i$. Previous axiomatizations of the Choquet\nintegral have been given for particular cases $X = Y^n$ and $X = \\mathbb{R}^n$.\nHowever, within multicriteria context such identicalness, hence\ncommensurateness, of criteria cannot be assumed a priori. This constitutes the\nmajor difference of this paper from the earlier axiomatizations. In particular,\nthe notion of \"comonotonicity\" cannot be used in a heterogeneous structure, as\nthere does not exist a \"built-in\" order between elements of sets $X_i$ and\n$X_j$. However, such an order is implied by the representation model. Our\napproach does not assume commensurateness of criteria. We construct the\nrepresentation and study its uniqueness properties.\n", "versions": [{"version": "v1", "created": "Sat, 26 Mar 2016 19:53:32 GMT"}], "update_date": "2016-03-29", "authors_parsed": [["Timonin", "Mikhail", ""]]}, {"id": "1603.08311", "submitter": "Michael Coopersmith", "authors": "Michael Coopersmith and Pascal J. Gambardella", "title": "Interest Rates and Inflation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article is an extension of the work of one of us (Coopersmith, 2011) in\nderiving the relationship between certain interest rates and the inflation rate\nof a two component economic system. We use the well-known Fisher relation\nbetween the difference of the nominal interest rate and its inflation adjusted\nvalue to eliminate the inflation rate and obtain a delay differential equation.\nWe provide computer simulated solutions for this equation over regimes of\ninterest. This paper could be of interest to three audiences: those in\nEconomics who are interested in interest and inflation; those in Mathematics\nwho are interested in examining a detailed analysis of a delay differential\nequation, which includes a summary of existing results, simulations, and an\nexact solution; and those in Physics who are interested in non-traditional\napplications of traditional methods of modeling.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2016 05:17:31 GMT"}], "update_date": "2016-03-29", "authors_parsed": [["Coopersmith", "Michael", ""], ["Gambardella", "Pascal J.", ""]]}, {"id": "1603.08344", "submitter": "Ron Nielsen", "authors": "Ron W Nielsen", "title": "The unresolved mystery of the great divergence is solved", "comments": "26pages, 19 figures, 9282 words", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The so-called great divergence in the income per capita is described in the\nUnified Growth Theory as the mind-boggling and unresolved mystery about the\ngrowth process. This mystery has now been solved: the great divergence never\nhappened. It was created by the manipulation of data. Economic growth in\nvarious regions is at different levels of development but it follows similar,\nnon-divergent trajectories. Unified Growth Theory is shown yet again to be\nincorrect and scientifically unacceptable. It promotes incorrect and even\npotentially dangerous concepts. The distorted presentation of data supporting\nthe concept of the great divergence shows that economic growth is now\ndeveloping along moderately-increasing trajectories but mathematical analysis\nof the same data and even their undistorted presentation shows that these\ntrajectories are now increasing approximately vertically with time. So, while\nthe distorted presentation of data used in the Unified Growth Theory suggests\ngenerally sustainable and secure economic growth, the undistorted presentation\nof data demonstrates that the growth is unsustainable and insecure. The concept\nof takeoffs from stagnation to the sustained-growth regime promoted in the\nUnified Growth Theory is also dangerously misleading because it suggests a\nsustainable and prosperous future while the mathematical analysis of data shows\nthat the current economic growth is insecure and unsustainable.\n", "versions": [{"version": "v1", "created": "Mon, 28 Mar 2016 09:00:44 GMT"}, {"version": "v2", "created": "Wed, 11 May 2016 00:27:08 GMT"}], "update_date": "2016-05-12", "authors_parsed": [["Nielsen", "Ron W", ""]]}, {"id": "1603.08961", "submitter": "John J Nay", "authors": "John J. Nay, Martin Van der Linden, Jonathan M. Gilligan", "title": "Betting and Belief: Prediction Markets and Attribution of Climate Change", "comments": "All code and data for the model is available at\n  http://johnjnay.com/predMarket/. Forthcoming in Proceedings of the 2016\n  Winter Simulation Conference. IEEE Press", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite much scientific evidence, a large fraction of the American public\ndoubts that greenhouse gases are causing global warming. We present a\nsimulation model as a computational test-bed for climate prediction markets.\nTraders adapt their beliefs about future temperatures based on the profits of\nother traders in their social network. We simulate two alternative climate\nfutures, in which global temperatures are primarily driven either by carbon\ndioxide or by solar irradiance. These represent, respectively, the scientific\nconsensus and a hypothesis advanced by prominent skeptics. We conduct\nsensitivity analyses to determine how a variety of factors describing both the\nmarket and the physical climate may affect traders' beliefs about the cause of\nglobal climate change. Market participation causes most traders to converge\nquickly toward believing the \"true\" climate model, suggesting that a climate\nmarket could be useful for building public consensus.\n", "versions": [{"version": "v1", "created": "Tue, 29 Mar 2016 20:53:57 GMT"}, {"version": "v2", "created": "Wed, 29 Jun 2016 19:13:53 GMT"}, {"version": "v3", "created": "Mon, 11 Jul 2016 22:16:35 GMT"}], "update_date": "2016-07-13", "authors_parsed": [["Nay", "John J.", ""], ["Van der Linden", "Martin", ""], ["Gilligan", "Jonathan M.", ""]]}, {"id": "1603.09060", "submitter": "Ravi Kashyap", "authors": "Ravi Kashyap", "title": "The Perfect Marriage and Much More: Combining Dimension Reduction,\n  Distance Measures and Covariance", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2019.04.174", "report-no": null, "categories": "q-fin.TR math.PR math.ST q-fin.EC stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a novel methodology based on the marriage between the\nBhattacharyya distance, a measure of similarity across distributions of random\nvariables, and the Johnson-Lindenstrauss Lemma, a technique for dimension\nreduction. The resulting technique is a simple yet powerful tool that allows\ncomparisons between data-sets representing any two distributions. The degree to\nwhich different entities, (markets, universities, hospitals, cities, groups of\nsecurities, etc.), have different distance measures of their corresponding\ndistributions tells us the extent to which they are different, aiding\nparticipants looking for diversification or looking for more of the same thing.\nWe demonstrate a relationship between covariance and distance measures based on\na generic extension of Stein's Lemma. We consider an asset pricing application\nand then briefly discuss how this methodology lends itself to numerous\nmarket-structure studies and even applications outside the realm of finance /\nsocial sciences by illustrating a biological application. We provide numerical\nillustrations using security prices, volumes and volatilities of both these\nvariables from six different countries.\n", "versions": [{"version": "v1", "created": "Wed, 30 Mar 2016 07:36:20 GMT"}, {"version": "v2", "created": "Wed, 4 May 2016 02:43:23 GMT"}, {"version": "v3", "created": "Fri, 25 Nov 2016 04:30:07 GMT"}, {"version": "v4", "created": "Tue, 31 Oct 2017 05:14:21 GMT"}, {"version": "v5", "created": "Fri, 1 Dec 2017 01:36:02 GMT"}, {"version": "v6", "created": "Fri, 12 Jul 2019 15:12:38 GMT"}], "update_date": "2019-07-15", "authors_parsed": [["Kashyap", "Ravi", ""]]}]