[{"id": "1706.00849", "submitter": "Mark Whitmeyer", "authors": "Artem Hulko and Mark Whitmeyer", "title": "A Game of Nontransitive Dice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.GT q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a two player simultaneous-move game where the two players each\nselect any permissible $n$-sided die for a fixed integer $n$. A player wins if\nthe outcome of his roll is greater than that of his opponent. Remarkably, for\n$n>3$, there is a unique Nash Equilibrium in pure strategies. The unique Nash\nEquilibrium is for each player to throw the Standard $n$-sided die, where each\nside has a different number. Our proof of uniqueness is constructive. We\nintroduce an algorithm with which, for any nonstandard die, we may generate\nanother die that beats it.\n", "versions": [{"version": "v1", "created": "Fri, 2 Jun 2017 20:45:27 GMT"}, {"version": "v2", "created": "Mon, 22 Oct 2018 14:42:48 GMT"}], "update_date": "2018-10-23", "authors_parsed": [["Hulko", "Artem", ""], ["Whitmeyer", "Mark", ""]]}, {"id": "1706.01254", "submitter": "Thibaut Mastrolia", "authors": "Thibaut Mastrolia", "title": "Moral hazard in welfare economics: on the advantage of Planner's advices\n  to manage employees' actions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study moral hazard problems in contract theory by adding an\nexogenous Planner to manage the actions of Agents hired by a Principal. We\nprovide conditions ensuring that Pareto optima exist for the Agents using the\nscalarization method associated with the multi-objective optimization problem\nand we solve the problem of the Principal by finding optimal remunerations\ngiven to the Agents. We illustrate our study with a linear-quadratic model by\ncomparing the results obtained when we add a Planner in the\nPrincipal/multi-Agents problem with the results obtained in the classical\nsecond-best case. More particularly in this example, we give necessary and\nsufficient conditions ensuring that Pareto optima are Nash equilibria and we\nprove that the Principal takes the benefit of the action of the Planner in some\ncases\n", "versions": [{"version": "v1", "created": "Mon, 5 Jun 2017 09:58:04 GMT"}], "update_date": "2017-06-06", "authors_parsed": [["Mastrolia", "Thibaut", ""]]}, {"id": "1706.01437", "submitter": "Obryan Poyser", "authors": "Obryan Poyser", "title": "Exploring the determinants of Bitcoin's price: an application of\n  Bayesian Structural Time Series", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Currently, there is no consensus on the real properties of Bitcoin. The\ndiscussion comprises its use as a speculative or safe haven assets, while other\nauthors argue that the augmented attractiveness could end accomplishing money's\nfunctions that economic theory demands. This paper explores the association\nbetween Bitcoin's market price and a set of internal and external factors using\nBayesian Structural Time Series Approach. I aim to contribute to the discussion\nby differentiating among several attractiveness sources and employing a method\nthat provides a more flexible analytic framework that decompose each of the\ncomponents of the time series, apply variable selection, include information on\nprevious studies, and dynamically examine the behavior of the explanatory\nvariables, all in a transparent and tractable setting. The results show that\nthe Bitcoin price is negatively associated with a neutral investor's sentiment,\ngold's price and Yuan to USD exchange rate, while positively related to stock\nmarket index, USD to Euro exchange rate and variated signs among the different\ncountries' search trends. Hence, I find that Bitcoin has mixed properties since\nstill seems to act as a speculative, safe haven and a potential a capital\nflights instrument.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jun 2017 17:42:05 GMT"}], "update_date": "2017-06-06", "authors_parsed": [["Poyser", "Obryan", ""]]}, {"id": "1706.01748", "submitter": "Victor Olkhov", "authors": "Victor Olkhov", "title": "Econophysics of Macro-Finance: Local Multi-fluid Models and Surface-like\n  Waves of Financial Variables", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper models macro financial variables alike to financial fluids with\nlocal interactions and describes surface-like waves of Investment and Profits.\nWe regard macro-finance as ensemble of economic agents and use their risk\nratings as coordinates on economic space. Aggregations of agent's financial\nvariables with risk coordinates x on economic space define macro financial\nvariables as function of x. We describe evolution and interactions between\nmacro financial variables alike to financial fluids by hydrodynamic-like\nequations. Minimum and maximum risk grades define most secure and most risky\nagents respectively. That determines borders of macro-finance domain that is\nfilled by economic agents. Perturbations of agent's risk coordinates near risk\nborders of macro domain cause disturbances of macro financial variables like\nInvestment and Profits. Such disturbances can generate waves that propagate\nalong risk borders. These waves may exponentially amplify perturbations inside\nof macro domain and impact financial sustainability. We study simple model\nInvestment and Profits and describe linear approximation of steady state\ndistributions of Investment and Profits on macro-finance domain that fulfill\ndreams of Investors: \"more risks-more Profits\". We describe Investment and\nProfits waves on risk border of economic space alike to surface waves in\nfluids. We present simple examples that specify waves as possible origin of\ntime fluctuations of macro financial variables. Description of possible steady\nstate distributions of macro financial variables and financial risk waves on\neconomic space could help for better policy-making and managing sustainable\nmacro-finance.\n", "versions": [{"version": "v1", "created": "Wed, 17 May 2017 16:38:06 GMT"}], "update_date": "2017-06-07", "authors_parsed": [["Olkhov", "Victor", ""]]}, {"id": "1706.01934", "submitter": "Nicol\\'as Hern\\'andez Santib\\'a\\~nez", "authors": "Cl\\'emence Alasseur, Ivar Ekeland, Romuald Elie, Nicol\\'as Hern\\'andez\n  Santib\\'a\\~nez and Dylan Possama\\\"i", "title": "An adverse selection approach to power pricing", "comments": "39 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the optimal design of electricity contracts among a population of\nconsumers with different needs. This question is tackled within the framework\nof Principal-Agent problems in presence of adverse selection. The particular\nfeatures of electricity induce an unusual structure on the production cost,\nwith no decreasing return to scale. We are nevertheless able to provide an\nexplicit solution for the problem at hand. The optimal contracts are either\nlinear or polynomial with respect to the consumption. Whenever the outside\noptions offered by competitors are not uniform among the different type of\nconsumers, we exhibit situations where the electricity provider should contract\nwith consumers with either low or high appetite for electricity.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 19:07:03 GMT"}, {"version": "v2", "created": "Tue, 19 Jun 2018 14:02:54 GMT"}, {"version": "v3", "created": "Sun, 15 Sep 2019 19:29:32 GMT"}], "update_date": "2019-09-17", "authors_parsed": [["Alasseur", "Clémence", ""], ["Ekeland", "Ivar", ""], ["Elie", "Romuald", ""], ["Santibáñez", "Nicolás Hernández", ""], ["Possamaï", "Dylan", ""]]}, {"id": "1706.02090", "submitter": "Martin Baumers Dr", "authors": "Martin Baumers, Luca Beltrametti, Angelo Gasparre, and Richard Hague", "title": "Informing Additive Manufacturing technology adoption: total cost and the\n  impact of capacity utilisation", "comments": "pre-submission manuscript for green open access", "journal-ref": null, "doi": "10.1080/00207543.2017.1334978", "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Informing Additive Manufacturing (AM) technology adoption decisions, this\npaper investigates the relationship between build volume capacity utilisation\nand efficient technology operation in an inter-process comparison of the costs\nof manufacturing a complex component used in the packaging industry.\nConfronting the reported costs of a conventional machining and welding pathway\nwith an estimator of the costs incurred through an AM route utilising Direct\nMetal Laser Sintering (DMLS), we weave together four aspects: optimised\ncapacity utilisation, ancillary process steps, the effect of build failure, and\ndesign adaptation. Recognising that AM users can fill unused machine capacity\nwith other, potentially unrelated, geometries, we posit a characteristic of\n'fungible' build capacity. This aspect is integrated in the cost estimation\nframework through computational build volume packing, drawing on a basket of\nsample geometries. We show that the unit cost in mixed builds at full capacity\nis lower than in builds limited to a single type of geometry; in our study this\nresults in a mean unit cost overstatement of 157%. The estimated manufacturing\ncosts savings from AM adoption range from 36% to 46%. Additionally, we indicate\nthat operating cost savings resulting from design adaptation are likely to far\noutweigh the manufacturing cost advantage.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jun 2017 08:38:14 GMT"}], "update_date": "2017-06-08", "authors_parsed": [["Baumers", "Martin", ""], ["Beltrametti", "Luca", ""], ["Gasparre", "Angelo", ""], ["Hague", "Richard", ""]]}, {"id": "1706.02168", "submitter": "Sandro Sozzo", "authors": "Diederik Aerts, Suzette Geriente, Catarina Moreira, Sandro Sozzo", "title": "Testing Ambiguity and Machina Preferences Within a Quantum-theoretic\n  Framework for Decision-making", "comments": "19 pages, 1 figure, standard LaTex. arXiv admin note: substantial\n  text overlap with arXiv:1612.08583, arXiv:1510.09058", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC econ.GN q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Machina thought experiments pose to major non-expected utility models\nchallenges that are similar to those posed by the Ellsberg thought experiments\nto subjective expected utility theory (SEUT). We test human choices in the\n`Ellsberg three-color example', confirming typical ambiguity aversion patterns,\nand the `Machina 50/51 and reflection examples', partially confirming the\npreferences hypothesized by Machina. Then, we show that a quantum-theoretic\nframework for decision-making under uncertainty recently elaborated by some of\nus allows faithful modeling of all data on the Ellsberg and Machina paradox\nsituations. In the quantum-theoretic framework subjective probabilities are\nrepresented by quantum probabilities, while quantum state transformations\nenable representations of ambiguity aversion and subjective attitudes toward\nit.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 08:48:14 GMT"}], "update_date": "2018-08-09", "authors_parsed": [["Aerts", "Diederik", ""], ["Geriente", "Suzette", ""], ["Moreira", "Catarina", ""], ["Sozzo", "Sandro", ""]]}, {"id": "1706.03502", "submitter": "Ashwin Seshadri", "authors": "Ashwin K Seshadri", "title": "Economics of limiting cumulative CO2 emissions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Global warming from carbon dioxide (CO2) is known to depend on cumulative CO2\nemissions. We introduce a model of global expenditures on limiting cumulative\nCO2 emissions, taking into account effects of decarbonization and rising global\nincome and making an approximation to the marginal abatement costs (MAC) of\nCO2. Discounted mitigation expenditures are shown to be a convex function of\ncumulative CO2 emissions. We also consider minimum-expenditure solutions for\nmeeting cumulative emissions goals, using a regularized variational method\nyielding an initial value problem in the integrated decarbonization rate. A\nquasi-stationary solution to this problem can be obtained for a special case,\nyielding decarbonization rate that is proportional to annual CO2 emissions.\nMinimum-expenditure trajectories in scenarios where CO2 emissions decrease must\nbegin with rapid decarbonization at rate decreasing with time. Due to the shape\nof global MAC the fraction of global income spent on CO2 mitigation (\"burden\")\ngenerally increases with time, as cheaper avenues for mitigation are exhausted.\nTherefore failure to rapidly decarbonize early on reduces expenditures by a\nsmall fraction (on the order of 0.01 %) of income in the present, but leads to\nmuch higher burden to future generations (on the order of 1 % of income).\n", "versions": [{"version": "v1", "created": "Mon, 12 Jun 2017 08:15:05 GMT"}], "update_date": "2017-06-13", "authors_parsed": [["Seshadri", "Ashwin K", ""]]}, {"id": "1706.05735", "submitter": "Matthew Andrews", "authors": "Matthew Andrews and Milan Bradonjic and Iraj Saniee", "title": "Quantifying the Benefits of Infrastructure Sharing", "comments": "Shorter version accepted to NetEcon 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the benefits of network sharing between telecommunications\noperators. Sharing is seen as one way to speed the roll out of expensive\ntechnologies such as 5G since it allows the service providers to divide the\ncost of providing ubiquitous coverage. Our theoretical analysis focuses on\nscenarios with two service providers and compares the system dynamics when they\nare competing with the dynamics when they are cooperating. We show that sharing\ncan be beneficial to a service provider even when it has the power to drive the\nother service provider out of the market, a byproduct of a non-convex cost\nfunction. A key element of this study is an analysis of the competitive\nequilibria for both cooperative and non-cooperative 2-person games in the\npresence of (non-convex) cost functions that involve a fixed cost component.\n", "versions": [{"version": "v1", "created": "Sun, 18 Jun 2017 22:07:43 GMT"}], "update_date": "2017-06-20", "authors_parsed": [["Andrews", "Matthew", ""], ["Bradonjic", "Milan", ""], ["Saniee", "Iraj", ""]]}, {"id": "1706.05911", "submitter": "Mariam Barry", "authors": "Mariam Barry, Giorgio Triulzi, Christopher L. Magee", "title": "Food Productivity Trends from Hybrid Corn: Statistical Analysis of\n  Patents and Field-test data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this research we study productivity trends of hybrid corn - an important\nsubdomain of food production. We estimate the yearly rate of yield improvement\nof hybrid corn (measured as bushel per acre) by using both information on\nyields contained in US patent documents for patented hybrid corn varieties and\non field-test data of several hybrid corn varieties performed at US State\nlevel. We have used a generalization of Moore's law to fit productivity trends\nand obtain the performance improvement rate by analyzing time series of hybrid\ncorn performance for a period covering the last thirty years. The linear\nregressions results obtained from different data sources indicate that the\nestimated improvement rates per year are between 1.2 and 2.4 percent. In\nparticular, using yields reported in a sample of patents filed between 1985 and\n2010, we estimated an improvement rate of 0.015 (R2 = 0.74, Pvalue = 1.37 x\n10^-8). Moreover, we apply two predicting models developed by Benson and Magee\n(2015) and Triulzi and Magee (2016) that only use patent metadata to estimate\nthe rate of improvement. We compare these predicted values to the rate\nestimated using US States field-test data. We find that, due to a turning point\nin patenting practices which begun in 2008, only the predicted rate (rate =\n0.015) using patents filed before 2008 is consistent with the empirical rate.\nFinally, we also investigate at the micro level - on the basis of 70 patents\n(granted between 1986 and 2015) - whether the number of citations received by a\npatent is correlated with performance achieved by the patented variety. We find\nthat the relative performance (yield ratio) of the patented seed is positively\ncorrelated with the total number of citations received by the patent (until\nDecember 2015) but not the citations received within 3 years after the granted\nyear, with the patent application year used as control variable.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jun 2017 15:30:42 GMT"}], "update_date": "2017-06-20", "authors_parsed": [["Barry", "Mariam", ""], ["Triulzi", "Giorgio", ""], ["Magee", "Christopher L.", ""]]}, {"id": "1706.06302", "submitter": "Sander Van Der Hoog", "authors": "Sander van der Hoog", "title": "Deep Learning in (and of) Agent-Based Models: A Prospectus", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  A very timely issue for economic agent-based models (ABMs) is their empirical\nestimation. This paper describes a line of research that could resolve the\nissue by using machine learning techniques, using multi-layer artificial neural\nnetworks (ANNs), or so called Deep Nets. The seminal contribution by Hinton et\nal. (2006) introduced a fast and efficient training algorithm called Deep\nLearning, and there have been major breakthroughs in machine learning ever\nsince. Economics has not yet benefited from these developments, and therefore\nwe believe that now is the right time to apply Deep Learning and multi-layered\nneural networks to agent-based models in economics.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jun 2017 08:08:44 GMT"}], "update_date": "2017-06-21", "authors_parsed": [["van der Hoog", "Sander", ""]]}, {"id": "1706.07216", "submitter": "d'Artis Kancs", "authors": "Pavel Ciaian, Miroslava Rajcaniova, d'Artis Kancs", "title": "Virtual Relationships: Short- and Long-run Evidence from BitCoin and\n  Altcoin Markets", "comments": "36 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study empirically examines interdependencies between BitCoin and altcoin\nmarkets in the short- and long-run. We apply time-series analytical mechanisms\nto daily data of 17 virtual currencies (BitCoin + 16 alternative virtual\ncurrencies) and two Altcoin price indices for the period 2013-2016. Our\nempirical findings confirm that indeed BitCoin and Altcoin markets are\ninterdependent. The BitCoin-Altcoin price relationship is significantly\nstronger in the short-run than in the long-run. We cannot fully confirm the\nhypothesis that the BitCoin price relationship is stronger with those Altcoins\nthat are more similar in their price formation mechanism to BitCoin. In the\nlong-run, macro-financial indicators determine the altcoin price formation to a\ngreater degree than BitCoin does. The virtual currency supply is exogenous and\ntherefore plays only a limited role in the price formation.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 09:15:16 GMT"}], "update_date": "2017-06-23", "authors_parsed": [["Ciaian", "Pavel", ""], ["Rajcaniova", "Miroslava", ""], ["Kancs", "d'Artis", ""]]}, {"id": "1706.07758", "submitter": "Victor Olkhov", "authors": "Victor Olkhov", "title": "Non-Local Macroeconomic Transactions and Credits-Loans Surface-Like\n  Waves", "comments": "20 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes surface-like waves of macroeconomic Credits-Loans\ntransactions on economic space. We use agent's risk ratings as their\ncoordinates and describe evolution of macro variables by transactions between\nagents. Aggregations of agent's variables with risk coordinates x on economic\nspace define macro variables as function of x. Aggregations of transactions\nbetween agents at point x and y determine functions of two variables (x,y) on\neconomic space. As example we study Credits transactions provided from agents\nat point x to agents at point y and thus amount of Loans received by agents at\npoint y from agents at point x at moment t during time term dt. We model\nevolution of macro transactions by hydrodynamic-like equations. Agents fill\nmacro domain on economic space that is bounded by minimum risk ratings of most\nsecure and maximum risk ratings of most risky agents. Economic and financial\nshocks can disturb steady borders of macro domain and cause perturbations of\ntransactions. Such disturbances can generate waves that can propagate along\nrisk borders alike to surface waves in fluids. As example, we describe simple\nmodel interactions between two transactions by hydrodynamic like equations in a\nclosed form. We introduce notions of \"macro accelerations\" and their potentials\nthat establish steady state distributions of transactions on economic space.\nFor this model in linear approximation we describe surface-like waves and show\nthat perturbations induced by surface-like waves can exponentially grow up\ninside macro domain and induce macro instabilities in a low risk area.\nDescription of possible steady state distributions of transactions and\nsurface-like waves on economic space might be important for macro modeling and\npolicy-making.\n", "versions": [{"version": "v1", "created": "Mon, 29 May 2017 07:55:41 GMT"}], "update_date": "2017-06-26", "authors_parsed": [["Olkhov", "Victor", ""]]}, {"id": "1706.07759", "submitter": "Roberto De Luca", "authors": "Roberto De Luca, Marco Di Mauro, Angelo Falzarano, Adele Naddeo", "title": "The effect of the behavior of an average consumer on the public debt\n  dynamics", "comments": "4 pages, 1 figures, submitted for publication to Physica A", "journal-ref": null, "doi": "10.1016/j.physa.2017.04.099", "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important issue within the present economic crisis is understanding the\ndynamics of the public debt of a given country, and how the behavior of average\nconsumers and tax payers in that country affects it. Starting from a model of\nthe average consumer behavior introduced earlier by the authors, we propose a\nsimple model to quantitatively address this issue. The model is then studied\nand analytically solved under some reasonable simplifying assumptions. In this\nway we obtain a condition under which the public debt steadily decreases.\n", "versions": [{"version": "v1", "created": "Sun, 23 Apr 2017 15:28:50 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["De Luca", "Roberto", ""], ["Di Mauro", "Marco", ""], ["Falzarano", "Angelo", ""], ["Naddeo", "Adele", ""]]}, {"id": "1706.07783", "submitter": "Yonatan Berman", "authors": "Yonatan Berman", "title": "Intergenerational mobility measures in a bivariate normal model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We model the joint log-income distribution of parents and children and derive\nanalytic expressions for canonical relative and absolute intergenerational\nmobility measures. We find that both types of mobility measures can be\nexpressed as a function of the other.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jun 2017 17:28:25 GMT"}], "update_date": "2017-06-26", "authors_parsed": [["Berman", "Yonatan", ""]]}, {"id": "1706.08479", "submitter": "Kostyantyn Mazur", "authors": "Kostyantyn Mazur", "title": "A Partial Solution to Continuous Blotto", "comments": "This paper cites and relies on another paper, arXiv1706.02060 \"Convex\n  Hull of (t, t^2, ..., t^N)\", that is posted on arXiv at the same time as this\n  paper Version 2: added a reference", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.EC cs.GT math.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyzes the structure of mixed-strategy equilibria for Colonel\nBlotto games, where the outcome on each battlefield is a polynomial function of\nthe difference between the two players' allocations. This paper severely\nreduces the set of strategies that needs to be searched to find a Nash\nequilibrium. It finds that there exists a Nash equilibrium where both players'\nmixed strategies are discrete distributions, and it places an upper bound on\nthe number of points in the supports of these discrete distributions.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jun 2017 22:08:05 GMT"}, {"version": "v2", "created": "Thu, 14 Sep 2017 04:55:18 GMT"}], "update_date": "2017-09-15", "authors_parsed": [["Mazur", "Kostyantyn", ""]]}, {"id": "1706.09038", "submitter": "Anatoliy Swishchuk Dr.", "authors": "Anatoliy Swishchuk", "title": "Risk Model Based on General Compound Hawkes Process", "comments": "16 pages; this paper will be presented at the 21st International\n  Congress Insurance: Mathematics and Economics-IME 2017, TUW, Vienna", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce a new model for the risk process based on general\ncompound Hawkes process (GCHP) for the arrival of claims. We call it risk model\nbased on general compound Hawkes process (RMGCHP). The Law of Large Numbers\n(LLN) and the Functional Central Limit Theorem (FCLT) are proved. We also study\nthe main properties of this new risk model, net profit condition, premium\nprinciple and ruin time (including ultimate ruin time) applying the LLN and\nFCLT for the RMGCHP. We show, as applications of our results, similar results\nfor risk model based on compound Hawkes process (RMCHP) and apply them to the\nclassical risk model based on compound Poisson process (RMCPP).\n", "versions": [{"version": "v1", "created": "Tue, 27 Jun 2017 20:15:09 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Swishchuk", "Anatoliy", ""]]}, {"id": "1706.09365", "submitter": "Kazuhiko Nishimura", "authors": "Jiyoung Kim, Satoshi Nakano, Kazuhiko Nishimura", "title": "Bilateral multifactor CES general equilibrium with state-replicating\n  Armington elasticities", "comments": null, "journal-ref": "Asia-Pacific Journal of Regional Science 2018", "doi": "10.1007/s41685-017-0068-7", "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We measure elasticity of substitution between foreign and domestic\ncommodities by two-point calibration such that the Armington aggregator can\nreplicate the two temporally distant observations of market shares and prices.\nAlong with the sectoral multifactor CES elasticities which we estimate by\nregression using a set of disaggregated linked input--output observations, we\nintegrate domestic production of two countries, namely, Japan and the Republic\nof Korea, with bilateral trade models and construct a bilateral general\nequilibrium model. Finally, we make an assessment of a tariff elimination\nscheme between the two countries.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jun 2017 17:06:38 GMT"}, {"version": "v2", "created": "Thu, 20 Jul 2017 14:52:34 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Kim", "Jiyoung", ""], ["Nakano", "Satoshi", ""], ["Nishimura", "Kazuhiko", ""]]}, {"id": "1706.09756", "submitter": "Michael  Kateregga M", "authors": "Michael Kateregga, Sure Mataramvura and David Taylor", "title": "Parameter estimation for stable distributions with application to\n  commodity futures log returns", "comments": "23 pages, 11 Figures and 3 Tables", "journal-ref": null, "doi": "10.1080/23322039.2017.1318813", "report-no": null, "categories": "q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper explores the theory behind the rich and robust family of\n{\\alpha}-stable distributions to estimate parameters from financial asset\nlog-returns data. We discuss four-parameter estimation methods including the\nquantiles, logarithmic moments method, maximum likelihood (ML), and the\nempirical characteristics function (ECF) method. The contribution of the paper\nis two-fold: first, we discuss the above parametric approaches and investigate\ntheir performance through error analysis. Moreover, we argue that the ECF\nperforms better than the ML over a wide range of shape parameter values,\n{\\alpha}{\\alpha} including values closest to 0 and 2 and that the ECF has a\nbetter convergence rate than the ML. Secondly, we compare the t location-scale\ndistribution to the general stable distribution and show that the former fails\nto capture skewness which might exist in the data. This is observed through\napplying the ECF to commodity futures log-returns data to obtain the skewness\nparameter.\n", "versions": [{"version": "v1", "created": "Wed, 3 May 2017 20:53:13 GMT"}], "update_date": "2017-06-30", "authors_parsed": [["Kateregga", "Michael", ""], ["Mataramvura", "Sure", ""], ["Taylor", "David", ""]]}, {"id": "1706.09763", "submitter": "Robin Nicole Mr", "authors": "Robin Nicole and Peter Sollich", "title": "Dynamical selection of Nash equilibria using Experience Weighted\n  Attraction Learning: emergence of heterogeneous mixed equilibria", "comments": "35 pages, 16 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0196577", "report-no": null, "categories": "cs.GT cond-mat.stat-mech cs.LG q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the distribution of strategies in a large game that models how\nagents choose among different double auction markets. We classify the possible\nmean field Nash equilibria, which include potentially segregated states where\nan agent population can split into subpopulations adopting different\nstrategies. As the game is aggregative, the actual equilibrium strategy\ndistributions remain undetermined, however. We therefore compare with the\nresults of Experience-Weighted Attraction (EWA) learning, which at long times\nleads to Nash equilibria in the appropriate limits of large intensity of\nchoice, low noise (long agent memory) and perfect imputation of missing scores\n(fictitious play). The learning dynamics breaks the indeterminacy of the Nash\nequilibria. Non-trivially, depending on how the relevant limits are taken, more\nthan one type of equilibrium can be selected. These include the standard\nhomogeneous mixed and heterogeneous pure states, but also \\emph{heterogeneous\nmixed} states where different agents play different strategies that are not all\npure. The analysis of the EWA learning involves Fokker-Planck modeling combined\nwith large deviation methods. The theoretical results are confirmed by\nmulti-agent simulations.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 14:02:04 GMT"}], "update_date": "2018-09-05", "authors_parsed": [["Nicole", "Robin", ""], ["Sollich", "Peter", ""]]}, {"id": "1706.10141", "submitter": "Everton Murilo Carvalho Abreu", "authors": "Everton M. C. Abreu, Newton J. Moura Jr., Abner D. Soares and Marcelo\n  B. Ribeiro", "title": "Oscillations in the Tsallis income distribution", "comments": "14 pages. Final version to appear in Physica A", "journal-ref": "Physica A 533 (2019) 121967", "doi": "10.1016/j.physa.2019.121967", "report-no": null, "categories": "physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Oscillations in the complementary cumulative distribution function (CCDF) of\nindividual income data have been found in the data of various countries studied\nby different authors at different time periods, but the dynamical origins of\nthis behavior are currently unknown. Although these datasets can be fitted by\ndifferent functions at different income ranges, the Tsallis distribution has\nrecently been found capable of fitting the whole distribution by means of only\ntwo parameters. This procedure showed clearly such oscillatory feature in the\nentire income range feature, but made it particularly visible at the tail of\nthe distribution. Although log-periodic functions fitted to the data are\ncapable of describing this behavior, a different approach to naturally disclose\nsuch oscillatory characteristics is to allow the Tsallis $q$-parameter to\nbecome complex. In this paper we use this idea in order to describe the\nbehavior of the CCDF of the Brazilian personal income recently studied\nempirically by Soares et al.\\ (2016). Typical elements of periodic motion, such\nas amplitude and angular frequency coupled to this income analysis, were\nobtained by means of this approach. A highly non-linear function for the CCDF\nwas obtained through this methodology and a numerical test showed it capable of\nrecovering the main oscillatory feature of the original CCDF of the personal\nincome data of Brazil.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jun 2017 16:25:44 GMT"}, {"version": "v2", "created": "Sun, 14 Jul 2019 16:05:56 GMT"}], "update_date": "2021-02-01", "authors_parsed": [["Abreu", "Everton M. C.", ""], ["Moura", "Newton J.", "Jr."], ["Soares", "Abner D.", ""], ["Ribeiro", "Marcelo B.", ""]]}]