[{"id": "1805.00785", "submitter": "Piero Mazzarisi", "authors": "Piero Mazzarisi, Fabrizio Lillo, Stefano Marmi", "title": "When panic makes you blind: a chaotic route to systemic risk", "comments": "24 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN math.DS q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an analytical model to study the role of expectation feedbacks and\noverlapping portfolios on systemic stability of financial systems. Building on\n[Corsi et al., 2016], we model a set of financial institutions having Value at\nRisk capital requirements and investing in a portfolio of risky assets, whose\nprices evolve stochastically in time and are endogenously driven by the trading\ndecisions of financial institutions. Assuming that they use adaptive\nexpectations of risk, we show that the evolution of the system is described by\na slow-fast random dynamical system, which can be studied analytically in some\nregimes. The model shows how the risk expectations play a central role in\ndetermining the systemic stability of the financial system and how wrong risk\nexpectations may create panic-induced reduction or over-optimistic expansion of\nbalance sheets. Specifically, when investors are myopic in estimating the risk,\nthe fixed point equilibrium of the system breaks into leverage cycles and\nfinancial variables display a bifurcation cascade eventually leading to chaos.\nWe discuss the role of financial policy and the effects of some market\nfrictions, as the cost of diversification and financial transaction taxes, in\ndetermining the stability of the system in the presence of adaptive\nexpectations of risk.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2018 13:19:25 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Mazzarisi", "Piero", ""], ["Lillo", "Fabrizio", ""], ["Marmi", "Stefano", ""]]}, {"id": "1805.00896", "submitter": "Alexis Akira Toda", "authors": "Alexis Akira Toda", "title": "Data-based Automatic Discretization of Nonparametric Distributions", "comments": null, "journal-ref": null, "doi": "10.1007/s10614-020-10012-6", "report-no": null, "categories": "q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although using non-Gaussian distributions in economic models has become\nincreasingly popular, currently there is no systematic way for calibrating a\ndiscrete distribution from the data without imposing parametric assumptions.\nThis paper proposes a simple nonparametric calibration method based on the\nGolub-Welsch algorithm for Gaussian quadrature. Application to an optimal\nportfolio problem suggests that assuming Gaussian instead of nonparametric\nshocks leads to up to 17% overweighting in the stock portfolio because the\ninvestor underestimates the probability of crashes.\n", "versions": [{"version": "v1", "created": "Wed, 2 May 2018 16:24:04 GMT"}, {"version": "v2", "created": "Thu, 9 May 2019 23:42:18 GMT"}], "update_date": "2020-07-23", "authors_parsed": [["Toda", "Alexis Akira", ""]]}, {"id": "1805.01019", "submitter": "Joel Nishimura", "authors": "Joel Nishimura", "title": "When a `rat race' implies an intergenerational wealth trap", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two critical questions about intergenerational outcomes are: one, whether\nsignificant barriers or traps exist between different social or economic\nstrata; and two, the extent to which intergenerational outcomes do (or can be\nused to) affect individual investment and consumption decisions. We develop a\nmodel to explicitly relate these two questions, and prove the first such `rat\nrace' theorem, showing that a fundamental relationship exists between high\nlevels of individual investment and the existence of a wealth trap, which traps\notherwise identical agents at a lower level of wealth. Our simple model of\nintergenerational wealth dynamics involves agents which balance current\nconsumption with investment in a single descendant. Investments then determine\ndescendant wealth via a potentially nonlinear and discontinuous competitiveness\nfunction about which we do not make concavity assumptions. From this model we\ndemonstrate how to infer such a competitiveness function from investments,\nalong with geometric criteria to determine individual decisions. Additionally\nwe investigate the stability of a wealth distribution, both to local\nperturbations and to the introduction of new agents with no wealth.\n", "versions": [{"version": "v1", "created": "Mon, 30 Apr 2018 18:46:19 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Nishimura", "Joel", ""]]}, {"id": "1805.03347", "submitter": "Pedram Safari", "authors": "Keivan Mallahi-Karai and Pedram Safari", "title": "Future exchange rates and Siegel's paradox", "comments": "To appear in Global Finance Journal. 9 pages", "journal-ref": null, "doi": "10.1016/j.gfj.2018.04.007", "report-no": null, "categories": "q-fin.MF q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Siegel's paradox is a fundamental question in international finance about\nexchange rates for futures contracts and has puzzled many scholars for over\nforty years. The unorthodox approach presented in this article leads to an\narbitrage-free solution which is invariant under currency re-denominations and\nis symmetric, as explained. We will also give a complete classification of all\nsuch aggregators in the general case. The formula obtained in this setting\ntherefore describes all the negotiated no-arbitrage forward exchange rates in\nterms of a reciprocity function.\n  Keywords: Siegel's paradox, forward exchange rates, discount bias.\n", "versions": [{"version": "v1", "created": "Wed, 9 May 2018 01:52:35 GMT"}], "update_date": "2018-05-10", "authors_parsed": [["Mallahi-Karai", "Keivan", ""], ["Safari", "Pedram", ""]]}, {"id": "1805.03492", "submitter": "Mario Coccia", "authors": "Mario Coccia", "title": "The laws of the evolution of research fields", "comments": "40 pages, 14 Figures, 4 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN physics.soc-ph q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A fundamental question in the field of social studies of science is how\nresearch fields emerge, grow and decline over time and space. This study\nconfronts this question here by developing an inductive analysis of emerging\nresearch fields represented by human microbiome, evolutionary robotics and\nastrobiology. In particular, number of papers from starting years to 2017 of\neach emerging research field is analyzed considering the subject areas (i.e.,\ndisciplines) of authors. Findings suggest some empirical laws of the evolution\nof research fields: the first law states that the evolution of a specific\nresearch field is driven by few scientific disciplines (3- 5) that generate\nmore than 80% of documents (concentration of the scientific production); the\nsecond law states that the evolution of research fields is path-dependent of a\ncritical discipline (it can be a native discipline that has originated the\nresearch field or a new discipline emerged during the social dynamics of\nscience); the third law states that a research field can be driven during its\nevolution by a new discipline originated by a process of specialization within\nscience. The findings here can explain and generalize, whenever possible some\nproperties of the evolution of scientific fields that are due to interaction\nbetween disciplines, convergence between basic and applied research fields and\ninterdisciplinary in scientific research. Overall, then, this study begins the\nprocess of clarifying and generalizing, as far as possible, the properties of\nthe social construction and evolution of science to lay a foundation for the\ndevelopment of sophisticated theories.\n", "versions": [{"version": "v1", "created": "Tue, 8 May 2018 13:09:31 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Coccia", "Mario", ""]]}, {"id": "1805.06829", "submitter": "Kiran Sharma Ms.", "authors": "Kiran Sharma, Anindya S. Chakrabarti and Anirban Chakraborti", "title": "Multi-layered Network Structure: Relationship Between Financial and\n  Macroeconomic Dynamics", "comments": "43 pages, 7 figures, 31 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate using multi-layered networks, the existence of an empirical\nlinkage between the dynamics of the financial network constructed from the\nmarket indices and the macroeconomic networks constructed from macroeconomic\nvariables such as trade, foreign direct investments, etc. for several countries\nacross the globe. The temporal scales of the dynamics of the financial\nvariables and the macroeconomic fundamentals are very different, which make the\nempirical linkage even more interesting and significant. Also, we find that\nthere exist in the respective networks, core-periphery structures (determined\nthrough centrality measures) that are composed of the similar set of countries\n-- a result that may be related through the `gravity model' of the\ncountry-level macroeconomic networks. Thus, from a multi-lateral openness\nperspective, we elucidate that for individual countries, larger trade\nconnectivity is positively associated with higher financial return\ncorrelations. Furthermore, we show that the Economic Complexity Index and the\nequity markets have a positive relationship among themselves, as is the case\nfor Gross Domestic Product. The data science methodology using network theory,\ncoupled with standard econometric techniques constitute a new approach to\nstudying multi-level economic phenomena in a comprehensive manner.\n", "versions": [{"version": "v1", "created": "Thu, 17 May 2018 15:42:51 GMT"}, {"version": "v2", "created": "Fri, 15 Mar 2019 07:24:13 GMT"}], "update_date": "2019-03-18", "authors_parsed": [["Sharma", "Kiran", ""], ["Chakrabarti", "Anindya S.", ""], ["Chakraborti", "Anirban", ""]]}, {"id": "1805.09686", "submitter": "Oleg Malafeyev", "authors": "O.A. Malafeyev, V.E. Onishenko, I.V. Zaytseva", "title": "Forecasting the sustainable status of the labor market in agriculture", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, a game-theoretic model is constructed that is related to the\nproblem of optimal assignments. Examples are considered. A compromise point is\nfound, the Nash equilibriums and the decision of the Nash arbitration scheme\nare constructed.\n", "versions": [{"version": "v1", "created": "Wed, 23 May 2018 10:18:45 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Malafeyev", "O. A.", ""], ["Onishenko", "V. E.", ""], ["Zaytseva", "I. V.", ""]]}, {"id": "1805.11562", "submitter": "Maurice Omane-Adjepong Mr.", "authors": "Nana Kwame Akosah, Francis W. Loloh, Maurice Omane-Adjepong", "title": "Justifying the Adoption and Relevance of Inflation Targeting Framework:\n  A Time-Varying Evidence from Ghana", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  This paper scrutinizes the rationale for the adoption of inflation targeting\n(IT) by Bank of Ghana in 2002. In this case, we determine the stability or\notherwise of the relationship between money supply and inflation in Ghana over\nthe period 1970M1-2016M3 using battery of econometric methods. The empirical\nresults show an unstable link between inflation and monetary growth in Ghana,\nwhile the final state coefficient of inflation elasticity to money growth is\npositive but statistically insignificant. We find that inflation elasticity to\nmonetary growth has continued to decline since the 1970s, showing a waning\nimpact of money growth on inflation in Ghana. Notably, there is also evidence\nof negative inflation elasticity to monetary growth between 2001 and 2004,\nlending support to the adoption of IT framework in Ghana in 2002. We emphasized\nthat the unprecedented 31-months of single-digit inflation (June 2010-December\n2012), despite the observed inflationary shocks in 2010 and 2012, reinforces\nthe immense contribution of the IT framework in anchoring inflation\nexpectations, with better inflation outcomes and inflation variability in\nGhana. The paper therefore recommends the continuous pursuance and\nstrengthening of the IT framework in Ghana, as it embodies a more eclectic\napproach to policy formulation and implementation.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2018 16:17:19 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Akosah", "Nana Kwame", ""], ["Loloh", "Francis W.", ""], ["Omane-Adjepong", "Maurice", ""]]}, {"id": "1805.11932", "submitter": "Mario Coccia", "authors": "Mario Coccia", "title": "How do public research labs use funding for research? A case study", "comments": "33 pages; 4 tables; 7 figures (4 in text + 3 in appendix)", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper discusses how public research organizations consume funding for\nresearch, applying a new approach based on economic metabolism of research\nlabs, in a broad analogy with biology. This approach is applied to a case study\nin Europe represented by one of the biggest European public research\norganizations, the National Research council of Italy. Results suggest that\nfunding for research (state subsidy and public contracts) of this public\nresearch organization is mainly consumed for the cost of personnel. In\naddition, the analysis shows a disproportionate growth of the cost of personnel\nin public research labs in comparison with total revenue from government. In\nthe presence of shrinking public research lab budgets, this organizational\nbehavior generates inefficiencies and stress. R&D management and public policy\nimplications are suggested for improving economic performance of public\nresearch organizations in turbulent markets.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2018 11:43:27 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Coccia", "Mario", ""]]}, {"id": "1805.12083", "submitter": "Ivan P Yamshchikov", "authors": "Ivan P. Yamshchikov, Sharwin Rezagholi", "title": "Elephants, Donkeys, and Colonel Blotto", "comments": null, "journal-ref": "In Proceedings of the 3rd International Conference on Complexity,\n  Future Information Systems and Risk - Volume 1: COMPLEXIS, pages 113-119\n  (2018)", "doi": "10.5220/0006761601130119", "report-no": null, "categories": "physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper employs a novel method for the empirical analysis of political\ndiscourse and develops a model that demonstrates dynamics comparable with the\nempirical data. Applying a set of binary text classifiers based on\nconvolutional neural networks, we label statements in the political programs of\nthe Democratic and the Republican Party in the United States. Extending the\nframework of the Colonel Blotto game by a stochastic activation structure, we\nshow that, under a simple learning rule, the simulated game exhibits dynamics\nthat resemble the empirical data.\n", "versions": [{"version": "v1", "created": "Sat, 26 May 2018 08:52:45 GMT"}], "update_date": "2018-05-31", "authors_parsed": [["Yamshchikov", "Ivan P.", ""], ["Rezagholi", "Sharwin", ""]]}, {"id": "1805.12102", "submitter": "Ran Huang", "authors": "Ran Huang", "title": "A Physical Review on Currency", "comments": "14 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A theoretical self-sustainable economic model is established based on the\nfundamental factors of production, consumption, reservation and reinvestment,\nwhere currency is set as a unconditional credit symbol serving as transaction\nequivalent and stock means. Principle properties of currency are explored in\nthis ideal economic system. Physical analysis reveals some facts that were not\naddressed by traditional monetary theory, and several basic principles of ideal\ncurrency are concluded: 1. The saving-replacement is a more primary function of\ncurrency than the transaction equivalents; 2. The ideal efficiency of currency\ncorresponds to the least practical value; 3. The contradiction between constant\nface value of currency and depreciable goods leads to intrinsic inflation.\n", "versions": [{"version": "v1", "created": "Wed, 18 Apr 2018 03:07:24 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Huang", "Ran", ""]]}, {"id": "1805.12107", "submitter": "Vladimir Gorelov", "authors": "V. I. Gorelov", "title": "Information Technologies in Public Administration", "comments": "10 pages, 4 tables, 18 references", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There are visible changes in the world organization, environment and health\nof national conscience that create a background for discussion on possible\nredefinition of global, state and regional management goals. The author applies\nthe sustainable development criteria to a hierarchical management scheme that\nis to lead the world community to non-contradictory growth. Concrete\ndefinitions are discussed in respect of decision-making process representing\nthe state mostly. With the help of systems analysis it is highlighted how to\nunderstand who would carry the distinctive sign of world leadership in the\nnearest future.\n", "versions": [{"version": "v1", "created": "Thu, 5 Apr 2018 13:49:09 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Gorelov", "V. I.", ""]]}, {"id": "1805.12112", "submitter": "Christopher Kirrane Mr", "authors": "Chris Kirrane", "title": "Lessons from the History of European EMU", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines the history of previous examples of EMU from the\nviewpoint that state actors make decisions about whether to participate in a\nmonetary union based on rational self-interest concerning costs and benefits to\ntheir national economies. Illustrative examples are taken from nineteenth\ncentury German, Italian and Japanese attempts at monetary integration with\nearly twentieth century ones from the Latin Monetary Union and the Scandinavian\nMonetary Union and contemporary ones from the West African Monetary Union and\nthe European Monetary System. Lessons learned from the historical examples will\nbe used to identify issues that could arise with the move towards closer EMU in\nEurope.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2018 10:58:01 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Kirrane", "Chris", ""]]}, {"id": "1805.12113", "submitter": "Christopher Kirrane Mr", "authors": "Chris Kirrane", "title": "Implications of EMU for the European Community", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Monetary integration has both costs and benefits. Europeans have a strong\naversion to exchange rate instability. From this perspective, the EMS has shown\nits limits and full monetary union involving a single currency appears to be a\nnecessity. This is the goal of the EMU project contained in the Maastricht\nTreaty. This paper examines the pertinent choices: independence of the Central\nBank, budgetary discipline and economic policy coordination. Therefore, the\nimplications of EMU for the economic policy of France will be examined. If the\nexternal force disappears, the public sector still cannot circumvent its\nsolvency constraint. The instrument of national monetary policy will not be\navailable so the absorption of asymmetric shocks will require greater wage\nflexibility and fiscal policy will play a greater role. The paper includes\nthree parts. The first concerns the economic foundations of monetary union and\nthe costs it entails. The second is devoted to the institutional arrangements\nunder the Treaty of Maastricht. The third examines the consequences of monetary\nunion for the economy and the economic policy of France.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2018 11:02:51 GMT"}], "update_date": "2018-07-23", "authors_parsed": [["Kirrane", "Chris", ""]]}]