[{"id": "1901.00191", "submitter": "Szabolcs Nagy Dr.", "authors": "Lyudmyla Potrashkova, Diana Raiko, Leonid Tseitlin, Olga Savchenko,\n  Szabolcs Nagy", "title": "Methodological provisions for conducting empirical research of the\n  availability and implementation of the consumers socially responsible\n  intentions", "comments": null, "journal-ref": "Marketing and Management of Innovations 2018(3) pp 133-141", "doi": "10.21272/mmi.2018.3-11", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Social responsibility of consumers is one of the main conditions for the\nrecoupment of enterprises expenses associated with the implementation of social\nand ethical marketing tasks. Therefore, the enterprises, which plan to act on\nterms of social and ethical marketing, should monitor the social responsibility\nof consumers in the relevant markets. At the same time, special attention\nshould be paid to the analysis of factors that prevent consumers from\nimplementing their socially responsible intentions in the regions with a low\nlevel of social activity of consumers. The purpose of the article is to develop\nmethodological guidelines that determine the tasks and directions of conducting\nempirical studies aimed at assessing the gap between the socially responsible\nintentions of consumers and the actual implementation of these intentions, as\nwell as to identify the causes of this gap. An empirical survey of the sampled\nconsumers in Kharkiv was carried out in terms of the proposed methodological\nprovisions. It revealed a rather high level of respondents' willingness to\nsupport socially responsible enterprises and a rather low level of\nimplementation of these intentions due to the lack of consumers awareness. To\ntest the proposed methodological guidelines, an empirical study of the\nconsumers social responsibility was conducted in 2017 on a sample of students\nand professors of the Semen Kuznets Kharkiv National University of Economics\n(120 people). Questioning of the respondents was carried out using the Google\nForms. The finding allowed to make conclusion for existence of a high level of\nrespondents' willingness to support socially responsible and socially active\nenterprises. However, the study also revealed the existence of a significant\ngap between the intentions and actions of consumers, caused by the lack of\nawareness.\n", "versions": [{"version": "v1", "created": "Tue, 1 Jan 2019 18:22:08 GMT"}], "update_date": "2019-01-03", "authors_parsed": [["Potrashkova", "Lyudmyla", ""], ["Raiko", "Diana", ""], ["Tseitlin", "Leonid", ""], ["Savchenko", "Olga", ""], ["Nagy", "Szabolcs", ""]]}, {"id": "1901.00227", "submitter": "Shenhao Wang", "authors": "Shenhao Wang, Qingyi Wang, Jinhua Zhao", "title": "Multitask Learning Deep Neural Networks to Combine Revealed and Stated\n  Preference Data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.LG q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is an enduring question how to combine revealed preference (RP) and stated\npreference (SP) data to analyze travel behavior. This study presents a\nframework of multitask learning deep neural networks (MTLDNNs) for this\nquestion, and demonstrates that MTLDNNs are more generic than the traditional\nnested logit (NL) method, due to its capacity of automatic feature learning and\nsoft constraints. About 1,500 MTLDNN models are designed and applied to the\nsurvey data that was collected in Singapore and focused on the RP of four\ncurrent travel modes and the SP with autonomous vehicles (AV) as the one new\ntravel mode in addition to those in RP. We found that MTLDNNs consistently\noutperform six benchmark models and particularly the classical NL models by\nabout 5% prediction accuracy in both RP and SP datasets. This performance\nimprovement can be mainly attributed to the soft constraints specific to\nMTLDNNs, including its innovative architectural design and regularization\nmethods, but not much to the generic capacity of automatic feature learning\nendowed by a standard feedforward DNN architecture. Besides prediction, MTLDNNs\nare also interpretable. The empirical results show that AV is mainly the\nsubstitute of driving and AV alternative-specific variables are more important\nthan the socio-economic variables in determining AV adoption. Overall, this\nstudy introduces a new MTLDNN framework to combine RP and SP, and demonstrates\nits theoretical flexibility and empirical power for prediction and\ninterpretation. Future studies can design new MTLDNN architectures to reflect\nthe speciality of RP and SP and extend this work to other behavioral analysis.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jan 2019 01:02:00 GMT"}, {"version": "v2", "created": "Thu, 22 Aug 2019 22:26:08 GMT"}], "update_date": "2019-08-28", "authors_parsed": [["Wang", "Shenhao", ""], ["Wang", "Qingyi", ""], ["Zhao", "Jinhua", ""]]}, {"id": "1901.00283", "submitter": "Szabolcs Nagy Dr.", "authors": "Szabolcs Nagy", "title": "Digital Economy And Society. A Cross Country Comparison Of Hungary And\n  Ukraine", "comments": "ISSN 2519-4461 (print)", "journal-ref": "Visnyk Natsionalnogo Tekhichnogo Universytetu Kharkivskyj\n  Politekhnichnyj Instytut Ekonomichni Nauky: 46 (1267) pp. 174-179 (2017)", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We live in the Digital Age in which both economy and society have been\ntransforming significantly. The Internet and the connected digital devices are\ninseparable parts of our daily life and the engine of the economic growth. In\nthis paper, first I analyzed the status of digital economy and society in\nHungary, then compared it with Ukraine and made conclusions regarding the\nfuture development tendencies. Using secondary data provided by the European\nCommission I investigated the five components of the Digital Economy and\nSociety Index of Hungary. I performed cross country analysis to find out the\nsignificant differences between Ukraine and Hungary in terms of access to the\nInternet and device use including smartphones, computers and tablets. Based on\nmy findings, I concluded that Hungary is more developed in terms of the\nsignificant parameters of the digital economy and society than Ukraine, but\neven Hungary is an emerging digital nation. Considering the high growth rate of\nInternet, tablet and smartphone penetration in both countries, I expect faster\nprogress in the development of the digital economy and society in Hungary and\nUkraine.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jan 2019 07:19:54 GMT"}], "update_date": "2019-01-03", "authors_parsed": [["Nagy", "Szabolcs", ""]]}, {"id": "1901.00495", "submitter": "Shteryo Nozharov PhD", "authors": "Shteryo Nozharov", "title": "The Institutional Economics of Collective Waste Recovery Systems: an\n  empirical investigation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main purpose of the study is to develop the model for transaction costs\nmeasurement in the Collective Waste Recovery Systems. The methodology of New\nInstitutional Economics is used in the research. The impact of the study is\nrelated both to the enlargement of the limits of the theory about the\ninteraction between transaction costs and social costs and to the\nidentification of institutional failures of the European concept for circular\neconomy. A new model for social costs measurement is developed. Keywords:\ncircular economy, transaction costs, extended producer responsibility JEL: A13,\nC51, D23, L22, Q53\n", "versions": [{"version": "v1", "created": "Wed, 2 Jan 2019 09:48:27 GMT"}, {"version": "v2", "created": "Fri, 4 Jan 2019 13:54:32 GMT"}], "update_date": "2019-01-07", "authors_parsed": [["Nozharov", "Shteryo", ""]]}, {"id": "1901.00793", "submitter": "Szabolcs Nagy Dr.", "authors": "Szabolcs Nagy", "title": "The Impact Of Country Of Origin In Mobile Phone Choice Of Generation Y\n  And Z", "comments": "14 p", "journal-ref": "Journal of Management and Training for Industries Vol.4, No.2 pp.\n  16-29. 2017", "doi": "10.12792/JMTI.4.2.16", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Mobile phones play a very important role in our life. Mobile phone sales have\nbeen soaring over the last decade due to the growing acceptance of\ntechnological innovations, especially by Generations Y and Z. Understanding the\nchange in customers' requirement is the key to success in the smartphone\nbusiness. New, strong mobile phone models will emerge if the voice of the\ncustomer can be heard. Although it has been widely known that country of origin\nhas serious impact on the attitudes and purchase decisions of mobile phone\nconsumers, there lack substantial studies that investigate the mobile phone\npreference of young adults aged 18-25, members of late Generation Y and early\nGeneration Z. In order to investigate the role of country of origin in mobile\nphone choice of Generations Y and Z, an online survey with 228 respondents was\nconducted in Hungary in 2016. Besides the descriptive statistical methods,\ncrosstabs, ANOVA and Pearson correlation are used to analyze the collected data\nand find out significant relationships. Factor analysis (Principal Component\nAnalysis) is used for data reduction to create new factor components. The\nfindings of this exploratory study support the idea that country of origin\nplays a significant role in many respects related to young adults' mobile phone\nchoice. Mobile phone owners with different countries of origin attribute\ncrucial importance to the various product features including technical\nparameters, price, design, brand name, operating system, and memory size.\nCountry of origin has a moderating effect on the price sensitivity of consumers\nwith varied net income levels. It is also found that frequent buyers of mobile\nphones, especially US brand products, spend the most significant amount of\nmoney for their consumption in this aspect.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jan 2019 06:53:15 GMT"}], "update_date": "2019-01-04", "authors_parsed": [["Nagy", "Szabolcs", ""]]}, {"id": "1901.01486", "submitter": "H. Dharma Kwon", "authors": "H. Dharma Kwon", "title": "Invest or Exit? Optimal Decisions in the Face of a Declining Profit\n  Stream", "comments": null, "journal-ref": "Operations Research, 58(3), 638-649 (2010)", "doi": "10.1287/opre.1090.0740", "report-no": null, "categories": "math.OC econ.GN q-fin.EC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Even in the face of deteriorating and highly volatile demand, firms often\ninvest in, rather than discard, aging technologies. In order to study this\nphenomenon, we model the firm's profit stream as a Brownian motion with\nnegative drift. At each point in time, the firm can continue operations, or it\ncan stop and exit the project. In addition, there is a one-time option to make\nan investment which boosts the project's profit rate. Using stochastic\nanalysis, we show that the optimal policy always exists and that it is\ncharacterized by three thresholds. There are investment and exit thresholds\nbefore investment, and there is a threshold for exit after investment. We also\neffect a comparative statics analysis of the thresholds with respect to the\ndrift and the volatility of the Brownian motion. When the profit boost upon\ninvestment is sufficiently large, we find a novel result: the investment\nthreshold decreases in volatility.\n", "versions": [{"version": "v1", "created": "Sun, 6 Jan 2019 02:03:52 GMT"}], "update_date": "2019-01-08", "authors_parsed": [["Kwon", "H. Dharma", ""]]}, {"id": "1901.01976", "submitter": "Michele Starnini", "authors": "Michele Starnini, Mari\\'an Bogu\\~n\\'a, and M. \\'Angeles Serrano", "title": "The interconnected wealth of nations: Shock propagation on global\n  trade-investment multiplex networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph econ.GN q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing integration of world economies, which organize in complex\nmultilayer networks of interactions, is one of the critical factors for the\nglobal propagation of economic crises. We adopt the network science approach to\nquantify shock propagation on the global trade-investment multiplex network. To\nthis aim, we propose a model that couples a Susceptible-Infected-Recovered\nepidemic spreading dynamics, describing how economic distress propagates\nbetween connected countries, with an internal contagion mechanism, describing\nthe spreading of such economic distress within a given country. At the local\nlevel, we find that the interplay between trade and financial interactions\ninfluences the vulnerabilities of countries to shocks. At the large scale, we\nfind a simple linear relation between the relative magnitude of a shock in a\ncountry and its global impact on the whole economic system, albeit the strength\nof internal contagion is country-dependent and the intercountry propagation\ndynamics is non-linear. Interestingly, this systemic impact can be predicted on\nthe basis of intra-layer and inter-layer scale factors that we name network\nmultipliers, that are independent of the magnitude of the initial shock. Our\nmodel sets-up a quantitative framework to stress-test the robustness of\nindividual countries and of the world economy to propagating crashes.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2019 15:16:02 GMT"}], "update_date": "2019-01-09", "authors_parsed": [["Starnini", "Michele", ""], ["Boguñá", "Marián", ""], ["Serrano", "M. Ángeles", ""]]}, {"id": "1901.02384", "submitter": "Juan Bautista Gonz\\'alez Blanco", "authors": "Juan Gonzalez-Blanco", "title": "Public Health and access to medicine. Pharmaceutical industry's role", "comments": "Paper written in Spanish", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Every year, 10 million people die from lack of access to treatment for\ncurable diseases, specially in developing countries. Meanwhile, legal but\nunsafe drugs cause 130 thousand deaths per year. How can this be happening in\n21st Century? What role does the pharmaceutical industry play in this tragedy?\nIn this research, WHO reports are analyzed and primary information gathered so\nas to answer this questions.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2019 16:05:15 GMT"}], "update_date": "2019-01-09", "authors_parsed": [["Gonzalez-Blanco", "Juan", ""]]}, {"id": "1901.02391", "submitter": "Bernardo Furtado", "authors": "Bernardo Alves Furtado", "title": "Modeling tax distribution in metropolitan regions with PolicySpace", "comments": "10 pages, 1 figure, submitted to CAPS2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.MA q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Brazilian executive body has consistently vetoed legislative initiatives\neasing creation and emancipation of municipalities. The literature lists\nevidence of the negative results of municipal fragmentation, especially so for\nmetropolitan regions. In order to provide evidences for the argument of\nmetropolitan union, this paper quantifies the quality of life of metropolitan\ncitizens in the face of four alternative rules of distribution of municipal tax\ncollection. Methodologically, a validated agent-based spatial model is\nsimulated. On top of that, econometric models are tested using real exogenous\nvariables and simulated data. Results suggest two central conclusions. First,\nthe progressiveness of the Municipal Participation Fund and its relevance to a\nbetter quality of life in metropolitan municipalities is confirmed. Second,\nmunicipal financial merging would improve citizens' quality of life, compared\nto the status quo for 23 Brazilian metropolises. Further, the paper presents\nquantitative evidence that allows comparing alternative tax distributions for\neach of the 40 simulated metropolises, identifying more efficient forms of\nfiscal distribution and contributing to the literature and to contemporary\nparliamentary debate.\n", "versions": [{"version": "v1", "created": "Mon, 31 Dec 2018 19:01:03 GMT"}], "update_date": "2019-01-09", "authors_parsed": [["Furtado", "Bernardo Alves", ""]]}, {"id": "1901.02471", "submitter": "Alexis Akira Toda", "authors": "Alexis Akira Toda and Yulong Wang", "title": "Efficient Minimum Distance Estimation of Pareto Exponent from Top Income\n  Shares", "comments": null, "journal-ref": null, "doi": "10.1002/jae.2788", "report-no": null, "categories": "math.ST econ.GN q-fin.EC stat.AP stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an efficient estimation method for the income Pareto exponent when\nonly certain top income shares are observable. Our estimator is based on the\nasymptotic theory of weighted sums of order statistics and the efficient\nminimum distance estimator. Simulations show that our estimator has excellent\nfinite sample properties. We apply our estimation method to U.S. top income\nshare data and find that the Pareto exponent has been stable at around 1.5\nsince 1985, suggesting that the rise in inequality during the last three\ndecades is mainly driven by redistribution between the rich and poor, not among\nthe rich.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2019 19:06:05 GMT"}, {"version": "v2", "created": "Fri, 21 Feb 2020 16:31:51 GMT"}], "update_date": "2020-07-23", "authors_parsed": [["Toda", "Alexis Akira", ""], ["Wang", "Yulong", ""]]}, {"id": "1901.02715", "submitter": "Yanling Chang", "authors": "Yanling Chang, Eleftherios Iakovou and Weidong Shi4", "title": "Blockchain in Global Supply Chains and Cross Border Trade: A Critical\n  Synthesis of the State-of-the-Art, Challenges and Opportunities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blockchain in supply chain management is expected to boom over the next five\nyears. It is estimated that the global blockchain supply chain market would\ngrow at a compound annual growth rate of 87% and increase from \\$45 million in\n2018 to \\$3,314.6 million by 2023. Blockchain will improve business for all\nglobal supply chain stakeholders by providing enhanced traceability,\nfacilitating digitisation, and securing chain-of-custody. This paper provides a\nsynthesis of the existing challenges in global supply chain and trade\noperations, as well as the relevant capabilities and potential of blockchain.\nWe further present leading pilot initiatives on applying blockchains to supply\nchains and the logistics industry to fulfill a range of needs. Finally, we\ndiscuss the implications of blockchain on customs and governmental agencies,\nsummarize challenges in enabling the wide scale deployment of blockchain in\nglobal supply chain management, and identify future research directions.\n", "versions": [{"version": "v1", "created": "Sat, 5 Jan 2019 20:33:36 GMT"}], "update_date": "2019-01-10", "authors_parsed": [["Chang", "Yanling", ""], ["Iakovou", "Eleftherios", ""], ["Shi4", "Weidong", ""]]}, {"id": "1901.03356", "submitter": "Christopher Boudreaux", "authors": "Christopher Boudreaux", "title": "When does privatization spur entrepreneurial performance? The moderating\n  effect of institutional quality in an emerging market", "comments": "40 pages, 7 tables, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore how institutional quality moderates the effectiveness of\nprivatization on entrepreneurs sales performance. To do this, we blend agency\ntheory and entrepreneurial cognition theory with insights from institutional\neconomics to develop a model of emerging market venture performance. Using data\nfrom the World Banks Enterprise Survey of entrepreneurs in China, our results\nsuggest that private-owned enterprises (POEs) outperform state-owned\nenterprises (SOEs) but only in environments with high-quality market\ninstitutions. In environments with low-quality market institutions, SOEs\noutperform POEs. These findings suggest that the effectiveness of privatization\non entrepreneurial performance is context-specific, which reveals more nuance\nthan previously has been attributed.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jan 2019 19:49:03 GMT"}], "update_date": "2019-01-14", "authors_parsed": [["Boudreaux", "Christopher", ""]]}, {"id": "1901.03544", "submitter": "Melanie Luhrmann", "authors": "Laura Abramovsky (1), Britta Augsburg (1), Melanie L\\\"uhrmann (2 and\n  1), Francisco Oteiza (3), Juan Pablo Rud (2 and 1) ((1) Centre for the\n  Evaluation of Social Policies (EDePo) Institute for Fiscal Studies, (2) Royal\n  Holloway Department of Economics, (3) UCL Institute of Education)", "title": "Community Matters: Heterogeneous Impacts of a Sanitation Intervention", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN econ.EM q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the effectiveness of a community-level information intervention\naimed at improving sanitation using a cluster-randomized controlled trial (RCT)\nin Nigerian communities. The intervention, Community-Led Total Sanitation\n(CLTS), is currently part of national sanitation policy in more than 25\ncountries. While average impacts are exiguous almost three years after\nimplementation at scale, the results hide important heterogeneity: the\nintervention has strong and lasting effects on sanitation practices in poorer\ncommunities. These are realized through increased sanitation investments. We\nshow that community wealth, widely available in secondary data, is a key\nstatistic for effective intervention targeting. Using data from five other\nsimilar randomized interventions in various contexts, we find that\ncommunity-level wealth heterogeneity can rationalize the wide range of impact\nestimates in the literature. This exercise provides plausible external validity\nto our findings, with implications for intervention scale-up. JEL Codes: O12,\nI12, I15, I18.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jan 2019 10:39:38 GMT"}, {"version": "v2", "created": "Tue, 4 Jun 2019 11:28:44 GMT"}, {"version": "v3", "created": "Wed, 5 Jun 2019 14:11:42 GMT"}, {"version": "v4", "created": "Thu, 11 Jul 2019 22:19:46 GMT"}, {"version": "v5", "created": "Mon, 10 Feb 2020 15:53:00 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Abramovsky", "Laura", "", "2 and\n  1"], ["Augsburg", "Britta", "", "2 and\n  1"], ["Lührmann", "Melanie", "", "2 and\n  1"], ["Oteiza", "Francisco", "", "2 and 1"], ["Rud", "Juan Pablo", "", "2 and 1"]]}, {"id": "1901.03843", "submitter": "Alex Augusto Timm Rathke", "authors": "Alex A.T. Rathke", "title": "Fuzzy Profit Shifting: A Model for Optimal Tax-induced Transfer Pricing\n  with Fuzzy Arm's Length Parameter", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a model of optimal tax-induced transfer pricing with a\nfuzzy arm's length parameter. Fuzzy numbers provide a suitable structure for\nmodelling the ambiguity that is intrinsic to the arm's length parameter. For\nthe usual conditions regarding the anti-shifting mechanisms, the optimal\ntransfer price becomes a maximising $\\alpha$-cut of the fuzzy arm's length\nparameter. Nonetheless, we show that it is profitable for firms to choose any\nmaximising transfer price if the probability of tax audit is sufficiently low,\neven if the chosen price is considered a completely non-arm's length price by\ntax authorities. In this case, we derive the necessary and sufficient\nconditions to prevent this extreme shifting strategy\n", "versions": [{"version": "v1", "created": "Sat, 12 Jan 2019 10:43:52 GMT"}], "update_date": "2019-01-15", "authors_parsed": [["Rathke", "Alex A. T.", ""]]}, {"id": "1901.03889", "submitter": "Antonio Casilli Dr.", "authors": "Cl\\'ement Le Ludec, Paola Tubaro, Antonio A. Casilli", "title": "How many people microwork in France? Estimating the size of a new labor\n  force", "comments": "9 pages, 1 figure, 7 tables. The article is part of the DiPLab\n  (\"Digital Platform Labor\") research project. For more information:\n  http://diplab.eu/", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Microwork platforms allocate fragmented tasks to crowds of providers with\nremunerations as low as few cents. Instrumental to the development of today's\nartificial intelligence, these micro-tasks push to the extreme the logic of\ncasualization already observed in \"uberized\" workers. The present article uses\nthe results of the DiPLab study to estimate the number of people who microwork\nin France. We distinguish three categories of microworkers, corresponding to\ndifferent modes of engagement: a group of 14,903 \"very active\" microworkers,\nmost of whom are present on these platforms at least once a week; a second\nfeaturing 52,337 \"routine\" microworkers, more selective and present at least\nonce a month; a third circle of 266,126 \"casual\" microworkers, more\nheterogeneous and who alternate inactivity and various levels of work practice.\nOur results show that microwork is comparable to, and even larger than, the\nworkforce of ride-sharing and delivery platforms in France. It is therefore not\nan anecdotal phenomenon and deserves great attention from researchers, unions\nand policy-makers.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jan 2019 18:16:41 GMT"}], "update_date": "2019-01-15", "authors_parsed": [["Ludec", "Clément Le", ""], ["Tubaro", "Paola", ""], ["Casilli", "Antonio A.", ""]]}, {"id": "1901.03951", "submitter": "Simone Righi", "authors": "Simone Righi, Yuri Biondi", "title": "Inequality, mobility and the financial accumulation process: A\n  computational economic analysis", "comments": "31 pages, 10 figures. Accepted for publication in Journal of Economic\n  Interaction and Coordination", "journal-ref": "Journal of Economic Interaction and Coordination (2020), online", "doi": "10.1007/s11403-019-00236-7", "report-no": null, "categories": "econ.GN econ.TH physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Our computational economic analysis investigates the relationship between\ninequality, mobility and the financial accumulation process. Extending the\nbaseline model by Levy et al., we characterise the economic process through\nstylised return structures generating alternative evolutions of income and\nwealth through time. First, we explore the limited heuristic contribution of\none and two factors models comprising one single stock (capital wealth) and one\nsingle flow factor (labour) as pure drivers of income and wealth generation and\nallocation over time. Second, we introduce heuristic modes of taxation in line\nwith the baseline approach. Our computational economic analysis corroborates\nthat the financial accumulation process featuring compound returns plays a\nsignificant role as source of inequality, while institutional arrangements\nincluding taxation play a significant role in framing and shaping the aggregate\neconomic process that evolves over socioeconomic space and time.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jan 2019 09:14:52 GMT"}], "update_date": "2020-02-20", "authors_parsed": [["Righi", "Simone", ""], ["Biondi", "Yuri", ""]]}, {"id": "1901.04265", "submitter": "Ali Haeri", "authors": "Ali Haeri and Abbas Arabmazar", "title": "Designing An Industrial Policy For Developing Countries: A New Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study, the prevalent methodology for design of the industrial policy\nin developing countries was critically assessed, and it was shown that the\nmechanism and content of classical method is fundamentally contradictory to the\ngoals and components of the endogenous growth theories. This study, by\nproposing a new approach, along settling Schumpeter's economic growth theory as\na policy framework, designed the process of entering, analyzing and processing\ndata as the mechanism of the industrial policy in order to provide \"theoretical\nconsistency\" and \"technical and Statistical requirements\" for targeting the\ngrowth stimulant factor effectively.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jan 2019 12:43:24 GMT"}], "update_date": "2019-01-15", "authors_parsed": [["Haeri", "Ali", ""], ["Arabmazar", "Abbas", ""]]}, {"id": "1901.04819", "submitter": "Kai-Kristian Kemell", "authors": "Kai-Kristian Kemell, Xiaofeng Wang, Anh Nguyen-Duc, Jason Grendus,\n  Tuure Tuunanen and Pekka Abrahamsson", "title": "100+ Metrics for Software Startups - A Multi-Vocal Literature Review", "comments": "Published in the proceedings of The 1st Software-intensive Business\n  Workshop on Start-ups, Platforms and Ecosystems (SiBW 2018), Espoo, December\n  3rd, 2018. http://ceur-ws.org/Vol-2305/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GL econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metrics can be used by businesses to make more objective decisions based on\ndata. Software startups in particular are characterized by the uncertain or\neven chaotic nature of the contexts in which they operate. Using data in the\nform of metrics can help software startups to make the right decisions amidst\nuncertainty and limited resources. However, whereas conventional business\nmetrics and software metrics have been studied in the past, metrics in the\nspe-cific context of software startup are not widely covered within academic\nliterature. To promote research in this area and to create a starting point for\nit, we have conducted a multi-vocal literature review focusing on practitioner\nliterature in order to compile a list of metrics used by software startups.\nSaid list is intended to serve as a basis for further research in the area, as\nthe metrics in it are based on suggestions made by practitioners and not\nempirically verified.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jan 2019 13:47:06 GMT"}], "update_date": "2019-01-16", "authors_parsed": [["Kemell", "Kai-Kristian", ""], ["Wang", "Xiaofeng", ""], ["Nguyen-Duc", "Anh", ""], ["Grendus", "Jason", ""], ["Tuunanen", "Tuure", ""], ["Abrahamsson", "Pekka", ""]]}, {"id": "1901.05024", "submitter": "Victor Olkhov", "authors": "Victor Olkhov", "title": "Econophysics of Asset Price, Return and Multiple Expectations", "comments": "23 pages", "journal-ref": null, "doi": "10.21314/JNTF.2019.055", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes asset price and return disturbances as result of\nrelations between transactions and multiple kinds of expectations. We show that\ndisturbances of expectations can cause fluctuations of trade volume, price and\nreturn. We model price disturbances for transactions made under all types of\nexpectations as weighted sum of partial price and trade volume disturbances for\ntransactions made under separate kinds of expectations. Relations on price\nallow present return as weighted sum of partial return and trade volume\n\"return\" for transactions made under separate expectations. Dependence of price\ndisturbances on trade volume disturbances as well as dependence of return on\ntrade volume \"return\" cause dependence of volatility and statistical\ndistributions of price and return on statistical properties of trade volume\ndisturbances and trade volume \"return\" respectively.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jan 2019 19:06:42 GMT"}, {"version": "v2", "created": "Tue, 8 Sep 2020 15:09:28 GMT"}], "update_date": "2020-09-09", "authors_parsed": [["Olkhov", "Victor", ""]]}, {"id": "1901.06609", "submitter": "Clovia Hamilton", "authors": "Barbara Burgess-Wilkerson, Clovia Hamilton, Chlotia Garrison, Keith\n  Robbins", "title": "Preparing millennials as digital citizens and socially and\n  environmentally responsible business professionals in a socially\n  irresponsible climate", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As of 2015, a millennial born in the 1990's became the largest population in\nthe workplace and are still growing. Studies indicate that a millennial is tech\nsavvy but lag in the exercise of digital responsibility. In addition, they are\npassive towards environmental sustainability and fail to grasp the importance\nof social responsibility. This paper provides a review of such findings\nrelating to business communications educators in their classrooms. The\nliterature should enable the development of a millennial as an excellent global\ncitizen through business communications curricula that emphasizes digital\ncitizenship, environmental sustainability and social responsibility. The\nimpetus for this work is to provide guidance in the development of courses and\nteaching strategies customized to the development of each millennial as a\ndigital, environmental and socially responsible global citizen.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jan 2019 01:05:01 GMT"}], "update_date": "2019-01-23", "authors_parsed": [["Burgess-Wilkerson", "Barbara", ""], ["Hamilton", "Clovia", ""], ["Garrison", "Chlotia", ""], ["Robbins", "Keith", ""]]}, {"id": "1901.07542", "submitter": "Kyle D'Souza", "authors": "Robert Chuchro, Kyle D'Souza, Darren Mei", "title": "Dancing with Donald: Polarity in the 2016 Presidential Election", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN econ.TH q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In almost every election cycle, the validity of the United States Electoral\nCollege is brought into question. The 2016 Presidential Election again brought\nup the issue of a candidate winning the popular vote but not winning the\nElectoral College, with Hillary Clinton receiving close to three million more\nvotes than Donald Trump. However, did the popular vote actually determine the\nmost liked candidate in the election? In this paper, we demonstrate that\ndifferent voting policies can alter which candidate is elected. Additionally,\nwe explore the trade-offs between each of these mechanisms. Finally, we\nintroduce two novel mechanisms with the intent of electing the least polarizing\ncandidate.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jan 2019 02:43:28 GMT"}], "update_date": "2019-01-24", "authors_parsed": [["Chuchro", "Robert", ""], ["D'Souza", "Kyle", ""], ["Mei", "Darren", ""]]}, {"id": "1901.07725", "submitter": "Dongbo Shi", "authors": "Dongbo Shi, Yeyanran Ge", "title": "Academic Engagement and Commercialization in an Institutional Transition\n  Environment: Evidence from Shanghai Maritime University", "comments": "30pages,4tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Does academic engagement accelerate or crowd out the commercialization of\nuniversity knowledge? Research on this topic seldom considers the impact of the\ninstitutional environment, especially when a formal institution for encouraging\nthe commercial activities of scholars has not yet been established. This study\ninvestigates this question in the context of China, which is in the\ninstitutional transition stage. Based on a survey of scholars from Shanghai\nMaritime University, we demonstrate that academic engagement has a positive\nimpact on commercialization and that this impact is greater for risk-averse\nscholars than for other risk-seeking scholars. Our results suggest that in an\ninstitutional transition environment, the government should consider\nencouraging academic engagement to stimulate the commercialization activities\nof conservative scholars.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2019 05:13:11 GMT"}], "update_date": "2019-01-24", "authors_parsed": [["Shi", "Dongbo", ""], ["Ge", "Yeyanran", ""]]}, {"id": "1901.08112", "submitter": "Robert Manduca", "authors": "Benedikt S. L. Fritz and Robert A. Manduca", "title": "The Economic Complexity of US Metropolitan Areas", "comments": "80 pages, 13 figures", "journal-ref": null, "doi": "10.1080/00343404.2021.1884215", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We calculate measures of economic complexity for US metropolitan areas for\nthe years 2007-2015 based on industry employment data. We show that the concept\nof economic complexity translates well from the cross-country to the regional\nsetting, and is able to incorporate local as well as traded industries. The\nlargest cities and the Northeast of the US have the highest average complexity,\nwhile traded industries are more complex than local-serving ones on average,\nbut with some exceptions. On average, regions with higher complexity have a\nhigher income per capita, but those regions also were more affected by the\nfinancial crisis. Finally, economic complexity is a significant predictor of\nwithin-decreases in income per capita and population. Our findings highlight\nthe importance of subnational regions, and particularly metropolitan areas, as\nunits of economic geography.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2019 20:00:51 GMT"}], "update_date": "2021-04-14", "authors_parsed": [["Fritz", "Benedikt S. L.", ""], ["Manduca", "Robert A.", ""]]}, {"id": "1901.08133", "submitter": "Ulrik Nash", "authors": "Ulrik W. Nash", "title": "The Wisdom of a Kalman Crowd", "comments": "29 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.EM econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Kalman Filter has been called one of the greatest inventions in\nstatistics during the 20th century. Its purpose is to measure the state of a\nsystem by processing the noisy data received from different electronic sensors.\nIn comparison, a useful resource for managers in their effort to make the right\ndecisions is the wisdom of crowds. This phenomenon allows managers to combine\njudgments by different employees to get estimates that are often more accurate\nand reliable than estimates, which managers produce alone. Since harnessing the\ncollective intelligence of employees, and filtering signals from multiple noisy\nsensors appear related, we looked at the possibility of using the Kalman Filter\non estimates by people. Our predictions suggest, and our findings based on the\nSurvey of Professional Forecasters reveal, that the Kalman Filter can help\nmanagers solve their decision-making problems by giving them stronger signals\nbefore they choose. Indeed, when used on a subset of forecasters identified by\nthe Contribution Weighted Model, the Kalman Filter beat that rule clearly,\nacross all the forecasting horizons in the survey.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2019 21:17:12 GMT"}], "update_date": "2019-01-25", "authors_parsed": [["Nash", "Ulrik W.", ""]]}, {"id": "1901.08356", "submitter": "Giorgia Callegaro", "authors": "Giorgia Callegaro, Claudia Ceci, Giorgio Ferrari", "title": "Optimal Reduction of Public Debt under Partial Observation of the\n  Economic Growth", "comments": "31 pages, no figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a government that aims at reducing the debt-to-gross domestic\nproduct (GDP) ratio of a country. The government observes the level of the\ndebt-to-GDP ratio and an indicator of the state of the economy, but does not\ndirectly observe the development of the underlying macroeconomic conditions.\nThe government's criterion is to minimize the sum of the total expected costs\nof holding debt and of debt's reduction policies. We model this problem as a\nsingular stochastic control problem under partial observation. The contribution\nof the paper is twofold. Firstly, we provide a general formulation of the model\nin which the level of debt-to-GDP ratio and the value of the macroeconomic\nindicator evolve as a diffusion and a jump-diffusion, respectively, with\ncoefficients depending on the regimes of the economy. These are described\nthrough a finite-state continuous-time Markov chain. We reduce via filtering\ntechniques the original problem to an equivalent one with full information (the\nso-called separated problem), and we provide a general verification result in\nterms of a related optimal stopping problem under full information. Secondly,\nwe specialize to a case study in which the economy faces only two regimes, and\nthe macroeconomic indicator has a suitable diffusive dynamics. In this setting\nwe provide the optimal debt reduction policy. This is given in terms of the\ncontinuous free boundary arising in an auxiliary fully two-dimensional optimal\nstopping problem.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jan 2019 11:25:58 GMT"}, {"version": "v2", "created": "Fri, 25 Jan 2019 22:56:12 GMT"}], "update_date": "2019-01-29", "authors_parsed": [["Callegaro", "Giorgia", ""], ["Ceci", "Claudia", ""], ["Ferrari", "Giorgio", ""]]}, {"id": "1901.09073", "submitter": "Mario Coccia", "authors": "Mario Coccia", "title": "Technological Parasitism", "comments": "44 pages; 6 figures; 9 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Technological parasitism is a new theory to explain the evolution of\ntechnology in society. In this context, this study proposes a model to analyze\nthe interaction between a host technology (system) and a parasitic technology\n(subsystem) to explain evolutionary pathways of technologies as complex\nsystems. The coefficient of evolutionary growth of the model here indicates the\ntypology of evolution of parasitic technology in relation to host technology:\ni.e., underdevelopment, growth and development. This approach is illustrated\nwith realistic examples using empirical data of product and process\ntechnologies. Overall, then, the theory of technological parasitism can be\nuseful for bringing a new perspective to explain and generalize the evolution\nof technology and predict which innovations are likely to evolve rapidly in\nsociety.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jan 2019 20:35:59 GMT"}], "update_date": "2019-01-29", "authors_parsed": [["Coccia", "Mario", ""]]}, {"id": "1901.09629", "submitter": "Jos\\'e Moran", "authors": "Jos\\'e Moran, Jean-Philippe Bouchaud", "title": "May's Instability in Large Economies", "comments": null, "journal-ref": "Phys. Rev. E 100, 032307 (2019)", "doi": "10.1103/PhysRevE.100.032307", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Will a large economy be stable? Building on Robert May's original argument\nfor large ecosystems, we conjecture that evolutionary and behavioural forces\nconspire to drive the economy towards marginal stability. We study networks of\nfirms in which inputs for production are not easily substitutable, as in\nseveral real-world supply chains. Relying on results from Random Matrix Theory,\nwe argue that such networks generically become dysfunctional when their size\nincreases, when the heterogeneity between firms becomes too strong or when\nsubstitutability of their production inputs is reduced. At marginal stability\nand for large heterogeneities, we find that the distribution of firm sizes\ndevelops a power-law tail, as observed empirically. Crises can be triggered by\nsmall idiosyncratic shocks, which lead to \"avalanches\" of defaults\ncharacterized by a power-law distribution of total output losses. This scenario\nwould naturally explain the well-known \"small shocks, large business cycles\"\npuzzle, as anticipated long ago by Bak, Chen, Scheinkman and Woodford.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2019 12:37:50 GMT"}, {"version": "v2", "created": "Tue, 12 Feb 2019 22:51:21 GMT"}, {"version": "v3", "created": "Sun, 7 Jul 2019 15:47:57 GMT"}, {"version": "v4", "created": "Sat, 21 Sep 2019 10:19:48 GMT"}], "update_date": "2019-09-25", "authors_parsed": [["Moran", "José", ""], ["Bouchaud", "Jean-Philippe", ""]]}, {"id": "1901.09729", "submitter": "Micha{\\l} Narajewski", "authors": "Micha{\\l} Narajewski and Florian Ziel", "title": "Estimation and simulation of the transaction arrival process in intraday\n  electricity markets", "comments": null, "journal-ref": "Energies 2019, 12(23), 4518", "doi": "10.3390/en12234518", "report-no": null, "categories": "econ.GN q-fin.EC q-fin.ST stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine the novel problem of the estimation of transaction arrival\nprocesses in the intraday electricity markets. We model the inter-arrivals\nusing multiple time-varying parametric densities based on the generalized F\ndistribution estimated by maximum likelihood. We analyse both the in-sample\ncharacteristics and the probabilistic forecasting performance. In a rolling\nwindow forecasting study, we simulate many trajectories to evaluate the\nforecasts and gain significant insights into the model fit. The prediction\naccuracy is evaluated by a functional version of the MAE (mean absolute error),\nRMSE (root mean squared error) and CRPS (continuous ranked probability score)\nfor the simulated count processes. This paper fills the gap in the literature\nregarding the intensity estimation of transaction arrivals and is a major\ncontribution to the topic, yet leaves much of the field for further\ndevelopment. The study presented in this paper is conducted based on the German\nIntraday Continuous electricity market data, but this method can be easily\napplied to any other continuous intraday electricity market. For the German\nmarket, a specific generalized gamma distribution setup explains the overall\nbehaviour significantly best, especially as the tail behaviour of the process\nis well covered.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2019 15:17:45 GMT"}, {"version": "v2", "created": "Tue, 5 Nov 2019 11:05:10 GMT"}, {"version": "v3", "created": "Wed, 27 Nov 2019 13:54:36 GMT"}, {"version": "v4", "created": "Mon, 2 Dec 2019 09:31:39 GMT"}], "update_date": "2019-12-03", "authors_parsed": [["Narajewski", "Michał", ""], ["Ziel", "Florian", ""]]}, {"id": "1901.10581", "submitter": "Morteza Taiebat", "authors": "Morteza Taiebat, Austin L. Brown, Hannah R. Safford, Shen Qu, Ming Xu", "title": "A Review on Energy, Environmental, and Sustainability Implications of\n  Connected and Automated Vehicles", "comments": null, "journal-ref": "Environmental Science & Technology, 2018, 52(20), 11449-11465", "doi": "10.1021/acs.est.8b00127", "report-no": null, "categories": "cs.CY econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Connected and automated vehicles (CAVs) are poised to reshape transportation\nand mobility by replacing humans as the driver and service provider. While the\nprimary stated motivation for vehicle automation is to improve safety and\nconvenience of road mobility, this transformation also provides a valuable\nopportunity to improve vehicle energy efficiency and reduce emissions in the\ntransportation sector. Progress in vehicle efficiency and functionality,\nhowever, does not necessarily translate to net positive environmental outcomes.\nHere we examine the interactions between CAV technology and the environment at\nfour levels of increasing complexity: vehicle, transportation system, urban\nsystem, and society. We find that environmental impacts come from\nCAV-facilitated transformations at all four levels, rather than from CAV\ntechnology directly. We anticipate net positive environmental impacts at the\nvehicle, transportation system, and urban system levels, but expect greater\nvehicle utilization and shifts in travel patterns at the society level to\noffset some of these benefits. Focusing on the vehicle-level improvements\nassociated with CAV technology is likely to yield excessively optimistic\nestimates of environmental benefits. Future research and policy efforts should\nstrive to clarify the extent and possible synergetic effects from a systems\nlevel in order to envisage and address concerns regarding the short- and\nlong-term sustainable adoption of CAV technology.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2019 03:20:24 GMT"}, {"version": "v2", "created": "Sun, 17 Feb 2019 05:05:42 GMT"}], "update_date": "2019-02-19", "authors_parsed": [["Taiebat", "Morteza", ""], ["Brown", "Austin L.", ""], ["Safford", "Hannah R.", ""], ["Qu", "Shen", ""], ["Xu", "Ming", ""]]}, {"id": "1901.10860", "submitter": "Karlson Pfannschmidt", "authors": "Karlson Pfannschmidt, Pritha Gupta, Eyke H\\\"ullermeier", "title": "Learning Choice Functions: Concepts and Architectures", "comments": "arXiv admin note: text overlap with arXiv:1803.05796", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.NE econ.GN q-fin.EC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of learning choice functions, which play an important\nrole in various domains of application, most notably in the field of economics.\nFormally, a choice function is a mapping from sets to sets: Given a set of\nchoice alternatives as input, a choice function identifies a subset of most\npreferred elements. Learning choice functions from suitable training data comes\nwith a number of challenges. For example, the sets provided as input and the\nsubsets produced as output can be of any size. Moreover, since the order in\nwhich alternatives are presented is irrelevant, a choice function should be\nsymmetric. Perhaps most importantly, choice functions are naturally\ncontext-dependent, in the sense that the preference in favor of an alternative\nmay depend on what other options are available. We formalize the problem of\nlearning choice functions and present two general approaches based on two\nrepresentations of context-dependent utility functions. Both approaches are\ninstantiated by means of appropriate neural network architectures, and their\nperformance is demonstrated on suitable benchmark tasks.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jan 2019 12:59:00 GMT"}, {"version": "v2", "created": "Fri, 24 May 2019 08:20:39 GMT"}, {"version": "v3", "created": "Tue, 8 Dec 2020 16:37:24 GMT"}], "update_date": "2020-12-09", "authors_parsed": [["Pfannschmidt", "Karlson", ""], ["Gupta", "Pritha", ""], ["Hüllermeier", "Eyke", ""]]}]