[{"id": "1902.00382", "submitter": "Morteza Taiebat", "authors": "Morteza Taiebat, Samuel Stolper, Ming Xu", "title": "Forecasting the Impact of Connected and Automated Vehicles on Energy Use\n  A Microeconomic Study of Induced Travel and Energy Rebound", "comments": null, "journal-ref": "Applied Energy, 2019, 247, 297-308", "doi": "10.1016/j.apenergy.2019.03.174", "report-no": null, "categories": "econ.GN q-fin.EC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Connected and automated vehicles (CAVs) are expected to yield significant\nimprovements in safety, energy efficiency, and time utilization. However, their\nnet effect on energy and environmental outcomes is unclear. Higher fuel economy\nreduces the energy required per mile of travel, but it also reduces the fuel\ncost of travel, incentivizing more travel and causing an energy \"rebound\neffect.\" Moreover, CAVs are predicted to vastly reduce the time cost of travel,\ninducing further increases in travel and energy use. In this paper, we forecast\nthe induced travel and rebound from CAVs using data on existing travel\nbehavior. We develop a microeconomic model of vehicle miles traveled (VMT)\nchoice under income and time constraints; then we use it to estimate\nelasticities of VMT demand with respect to fuel and time costs, with fuel cost\ndata from the 2017 United States National Household Travel Survey (NHTS) and\nwage-derived predictions of travel time cost. Our central estimate of the\ncombined price elasticity of VMT demand is -0.4, which differs substantially\nfrom previous estimates. We also find evidence that wealthier households have\nmore elastic demand, and that households at all income levels are more\nsensitive to time costs than to fuel costs. We use our estimated elasticities\nto simulate VMT and energy use impacts of full, private CAV adoption under a\nrange of possible changes to the fuel and time costs of travel. We forecast a\n2-47% increase in travel demand for an average household. Our results indicate\nthat backfire - i.e., a net rise in energy use - is a possibility, especially\nin higher income groups. This presents a stiff challenge to policy goals for\nreductions in not only energy use but also traffic congestion and local and\nglobal air pollution, as CAV use increases.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2019 17:19:33 GMT"}, {"version": "v2", "created": "Fri, 15 Mar 2019 23:55:58 GMT"}, {"version": "v3", "created": "Thu, 18 Apr 2019 18:47:24 GMT"}, {"version": "v4", "created": "Thu, 9 May 2019 20:16:04 GMT"}], "update_date": "2019-05-13", "authors_parsed": [["Taiebat", "Morteza", ""], ["Stolper", "Samuel", ""], ["Xu", "Ming", ""]]}, {"id": "1902.00428", "submitter": "Omar A. Guerrero", "authors": "Omar A. Guerrero and Gonzalo Casta\\~neda", "title": "Does Better Governance Guarantee Less Corruption? Evidence of Loss in\n  Effectiveness of the Rule of Law", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Corruption is an endemic societal problem with profound implications in the\ndevelopment of nations. In combating this issue, cross-national evidence\nsupporting the effectiveness of the rule of law seems at odds with poorly\nrealized outcomes from reforms inspired in such literature. This paper provides\nan explanation for such contradiction. By taking a computational approach, we\ndevelop two methodological novelties into the empirical study of corruption:\n(1) generating large within-country variation by means of simulation (instead\nof cross-national data pooling), and (2) accounting for interactions between\ncovariates through a spillover network. The latter (the network), seems\nresponsible for a significant reduction in the effectiveness of the rule of\nlaw; especially among the least developed countries. We also find that\neffectiveness can be boosted by improving complementary policy issues that may\nlie beyond the governance agenda. Moreover, our simulations suggest that\nimprovements to the rule of law are a necessary yet not sufficient condition to\ncurve corruption.\n", "versions": [{"version": "v1", "created": "Fri, 1 Feb 2019 16:05:41 GMT"}], "update_date": "2019-02-04", "authors_parsed": [["Guerrero", "Omar A.", ""], ["Castañeda", "Gonzalo", ""]]}, {"id": "1902.00429", "submitter": "Omar A. Guerrero", "authors": "Gonzalo Casta\\~eda and Omar A. Guerrero", "title": "The Importance of Social and Government Learning in Ex Ante Policy\n  Evaluation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We provide two methodological insights on \\emph{ex ante} policy evaluation\nfor macro models of economic development. First, we show that the problems of\nparameter instability and lack of behavioral constancy can be overcome by\nconsidering learning dynamics. Hence, instead of defining social constructs as\nfixed exogenous parameters, we represent them through stable functional\nrelationships such as social norms. Second, we demonstrate how agent computing\ncan be used for this purpose. By deploying a model of policy prioritization\nwith endogenous government behavior, we estimate the performance of different\npolicy regimes. We find that, while strictly adhering to policy recommendations\nincreases efficiency, the nature of such recipes has a bigger effect. In other\nwords, while it is true that lack of discipline is detrimental to prescription\noutcomes (a common defense of failed recommendations), it is more important\nthat such prescriptions consider the systemic and adaptive nature of the\npolicymaking process (something neglected by traditional technocratic advice).\n", "versions": [{"version": "v1", "created": "Fri, 1 Feb 2019 16:05:47 GMT"}], "update_date": "2019-02-04", "authors_parsed": [["Castaeda", "Gonzalo", ""], ["Guerrero", "Omar A.", ""]]}, {"id": "1902.00430", "submitter": "Omar A. Guerrero", "authors": "Omar A. Guerrero and Gonzalo Casta\\~neda", "title": "Quantifying the Coherence of Development Policy Priorities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the last 30 years, the concept of policy coherence for development has\nreceived especial attention among academics, practitioners and international\norganizations. However, its quantification and measurement remain elusive. To\naddress this challenge, we develop a theoretical and empirical framework to\nmeasure the coherence of policy priorities for development. Our procedure takes\ninto account the country-specific constraints that governments face when trying\nto reach specific development goals. Hence, we put forward a new definition of\npolicy coherence where context-specific efficient resource allocations are\nemployed as the baseline to construct an index. To demonstrate the usefulness\nand validity of our index, we analyze the cases of Mexico, Korea and Estonia,\nthree developing countries that, arguably, joined the OECD with the aim of\ncoherently establishing policies that could enable a catch-up process. We find\nthat Korea shows significant signs of policy coherence, Estonia seems to be in\nthe process of achieving it, and Mexico has unequivocally failed. Furthermore,\nour results highlight the limitations of assessing coherence in terms of naive\nbenchmark comparisons using development-indicator data. Altogether, our\nframework sheds new light in a promising direction to develop bespoke analytic\ntools to meet the 2030 agenda.\n", "versions": [{"version": "v1", "created": "Fri, 1 Feb 2019 16:05:52 GMT"}], "update_date": "2019-02-04", "authors_parsed": [["Guerrero", "Omar A.", ""], ["Castañeda", "Gonzalo", ""]]}, {"id": "1902.00432", "submitter": "Omar A. Guerrero", "authors": "Omar A. Guerrero, Gonzalo Casta\\~neda and Florian Ch\\'avez-Ju\\'arez", "title": "How do governments determine policy priorities? Studying development\n  strategies through spillover networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Determining policy priorities is a challenging task for any government\nbecause there may be, for example, a multiplicity of objectives to be\nsimultaneously attained, a multidimensional policy space to be explored,\ninefficiencies in the implementation of public policies, interdependencies\nbetween policy issues, etc. Altogether, these factor s generate a complex\nlandscape that governments need to navigate in order to reach their goals. To\naddress this problem, we develop a framework to model the evolution of\ndevelopment indicators as a political economy game on a network. Our approach\naccounts for the --recently documented-- network of spillovers between policy\nissues, as well as the well-known political economy problem arising from budget\nassignment. This allows us to infer not only policy priorities, but also the\neffective use of resources in each policy issue. Using development indicators\ndata from more than 100 countries over 11 years, we show that the\ncountry-specific context is a central determinant of the effectiveness of\npolicy priorities. In addition, our model explains well-known aggregate facts\nabout the relationship between corruption and development. Finally, this\nframework provides a new analytic tool to generate bespoke advice on\ndevelopment strategies.\n", "versions": [{"version": "v1", "created": "Fri, 1 Feb 2019 16:05:59 GMT"}], "update_date": "2019-02-04", "authors_parsed": [["Guerrero", "Omar A.", ""], ["Castañeda", "Gonzalo", ""], ["Chávez-Juárez", "Florian", ""]]}, {"id": "1902.00678", "submitter": "Thomas Kirschstein", "authors": "Mathias Kloss and Thomas Kirschstein and Steffen Liebscher and Martin\n  Petrick", "title": "Robust Productivity Analysis: An application to German FADN data", "comments": "27 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sources of bias in empirical studies can be separated in those coming from\nthe modelling domain (e.g. multicollinearity) and those coming from outliers.\nWe propose a two-step approach to counter both issues. First, by\ndecontaminating data with a multivariate outlier detection procedure and\nsecond, by consistently estimating parameters of the production function. We\napply this approach to a panel of German field crop data. Results show that the\ndecontamination procedure detects multivariate outliers. In general,\nmultivariate outlier control delivers more reasonable results with a higher\nprecision in the estimation of some parameters and seems to mitigate the\neffects of multicollinearity.\n", "versions": [{"version": "v1", "created": "Sat, 2 Feb 2019 09:30:08 GMT"}, {"version": "v2", "created": "Wed, 13 Feb 2019 09:17:16 GMT"}], "update_date": "2019-02-14", "authors_parsed": [["Kloss", "Mathias", ""], ["Kirschstein", "Thomas", ""], ["Liebscher", "Steffen", ""], ["Petrick", "Martin", ""]]}, {"id": "1902.01265", "submitter": "Joshua Benjamin Miller", "authors": "Joshua B. Miller, Adam Sanjurjo", "title": "Surprised by the Hot Hand Fallacy? A Truth in the Law of Small Numbers", "comments": null, "journal-ref": "Econometrica, Vol. 86, No. 6 (November 2018), pp. 2019-2047", "doi": "10.3982/ECTA14943", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that a subtle but substantial bias exists in a common measure of the\nconditional dependence of present outcomes on streaks of past outcomes in\nsequential data. The magnitude of this streak selection bias generally\ndecreases as the sequence gets longer, but increases in streak length, and\nremains substantial for a range of sequence lengths often used in empirical\nwork. We observe that the canonical study in the influential hot hand fallacy\nliterature, along with replications, are vulnerable to the bias. Upon\ncorrecting for the bias we find that the long-standing conclusions of the\ncanonical study are reversed.\n", "versions": [{"version": "v1", "created": "Mon, 4 Feb 2019 15:53:56 GMT"}], "update_date": "2019-02-05", "authors_parsed": [["Miller", "Joshua B.", ""], ["Sanjurjo", "Adam", ""]]}, {"id": "1902.01398", "submitter": "Jennifer Hinton", "authors": "Jennifer Hinton and Donnie Maclurcan", "title": "How on Earth: Flourishing in a Not-for-Profit World by 2050", "comments": "Working draft from August 2016 (still a work-in-progress), 266 pages,\n  41 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this book, we outline a model of a non-capitalist market economy based on\nnot-for-profit forms of business. This work presents both a critique of the\ncurrent economic system and a vision of a more socially, economically, and\necologically sustainable economy. The point of departure is the purpose and\nprofit-orientation embedded in the legal forms used by businesses (e.g.,\nfor-profit or not-for-profit) and the ramifications of this for global\nsustainability challenges such as environmental pollution, resource use,\nclimate change, and economic inequality. We document the rapid rise of\nnot-for-profit forms of business in the global economy and offer a conceptual\nframework and an analytical lens through which to view these relatively new\neconomic actors and their potential for transforming the economy. The book\nexplores how a market consisting of only or mostly not-for-profit forms of\nbusiness might lead to better financial circulation, economic equality, social\nwell-being, and environmental regeneration as compared to for-profit markets.\n", "versions": [{"version": "v1", "created": "Mon, 4 Feb 2019 17:33:48 GMT"}], "update_date": "2019-02-06", "authors_parsed": [["Hinton", "Jennifer", ""], ["Maclurcan", "Donnie", ""]]}, {"id": "1902.01986", "submitter": "Ali Ardeshiri", "authors": "Ali Ardeshiri and Akshay Vij", "title": "A lifestyle-based model of household neighbourhood location and\n  individual travel mode choice behaviours", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Issues such as urban sprawl, congestion, oil dependence, climate change and\npublic health, are prompting urban and transportation planners to turn to land\nuse and urban design to rein in automobile use. One of the implicit beliefs in\nthis effort is that the right land-use policies will, in fact, help to reduce\nautomobile use and increase the use of alternative modes of transportation.\nThus, planners and transport engineers are increasingly viewing land use\npolicies and lifestyle patterns as a way to manage transportation demand. While\na substantial body of work has looked at the relationship between the built\nenvironment and travel behaviour, as well as the influence of lifestyles and\nlifestyle-related decisions on using different travel modes and activity\nbehaviours, limited work has been done in capturing these effects\nsimultaneously and also in exploring the effect of intra-household interaction\non individual attitudes and beliefs towards travel and activity behavior, and\ntheir subsequent influence on lifestyles and modality styles. Therefore, for\nthis study we proposed a framework that captures the concurrent influence of\nlifestyles and modality styles on both household-level decisions, such as\nneighbourhood location, and individual-level decisions, such as travel mode\nchoices using a hierarchical Latent Class Choice Model.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2019 00:41:08 GMT"}, {"version": "v2", "created": "Thu, 28 Nov 2019 23:11:17 GMT"}], "update_date": "2019-12-02", "authors_parsed": [["Ardeshiri", "Ali", ""], ["Vij", "Akshay", ""]]}, {"id": "1902.02418", "submitter": "Ali Ardeshiri", "authors": "Ali Ardeshiri, Roya Etminani Ghasrodashti, Taha Hossein Rashidi,\n  Mahyar Ardeshiri, Ken Willis", "title": "Conservation or deterioration in heritage sites? Estimating willingness\n  to pay for preservation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A significant part of the United Nations World Heritage Sites (WHSs) is\nlocated in developing countries. These sites attract an increasing number of\ntourist and income to these countries. Unfortunately, many of these WHSs are in\na poor condition due to climatic and environmental impacts; war and tourism\npressure, requiring the urgent need for restoration and preservation (Tuan &\nNavrud, 2007). In this study, we characterise residents from Shiraz city\n(visitors and non-visitors) willingness to invest in the management of the\nheritage sites through models for the preservation of heritage and development\nof tourism as a local resource. The research looks at different categories of\nheritage sites within Shiraz city, Iran. The measurement instrument is a stated\npreference referendum task administered state-wide to a sample of 489\nrespondents, with the payment mechanism defined as a purpose-specific\nincremental levy of a fixed amount over a set period of years. A Latent Class\nBinary Logit model, using parametric constraints is used innovatively to deal\nwith any strategic voting such as Yea-sayers and Nay-sayers, as well as\nrevealing the latent heterogeneity among sample members. Results indicate that\nalmost 14% of the sampled population is unwilling to be levied any amount\n(Nay-sayers) to preserve any heritage sites. Not recognizing the presence of\nnay-sayers in the data or recognizing them but eliminating them from the\nestimation will result in biased Willingness to Pay (WTP) results and,\nconsequently, biased policy propositions by authorities. Moreover, it is found\nthat the type of heritage site is a driver of WTP. The results from this study\nprovide insights into the WTP of heritage site visitors and non-visitors with\nrespect to avoiding the impacts of future erosion and destruction and\ncontributing to heritage management and maintenance policies.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2019 22:32:32 GMT"}], "update_date": "2019-02-08", "authors_parsed": [["Ardeshiri", "Ali", ""], ["Ghasrodashti", "Roya Etminani", ""], ["Rashidi", "Taha Hossein", ""], ["Ardeshiri", "Mahyar", ""], ["Willis", "Ken", ""]]}, {"id": "1902.02419", "submitter": "Ali Ardeshiri", "authors": "Ali Ardeshiri, Spring Sampson, Joffre Swait", "title": "Seasonality Effects on Consumers Preferences Over Quality Attributes of\n  Different Beef Products", "comments": null, "journal-ref": null, "doi": "10.1016/j.meatsci.2019.06.004", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using discrete choice modelling, the study investigates 946 American\nconsumers willingness-to-pay and preferences for diverse beef products. A novel\nexperiment was used to elicit the number of beef products that each consumer\nwould purchase. The range of products explored in this study included ground,\ndiced, roast, and six cuts of steaks (sirloin, tenderloin, flank, flap, New\nYork and cowboy or rib-eye). The outcome of the study suggests that US\nconsumers vary in their preferences for beef products by season. The presence\nof a USDA certification logo is by far the most important factor affecting\nconsumers willingness to pay for all beef cuts, which is also heavily dependent\non season. In relation to packaging, US consumers have mixed preference for\ndifferent beef products by season. The results from a scaled adjusted ordered\nlogit model showed that after price, safety-related attributes such as\ncertification logos, types of packaging, and antibiotic free and organic\nproducts are a stronger influence on American consumers choice. Furthermore, US\nconsumers on average purchase diced and roast products more often in winter\nslow cooking season, than in summer, whereas New York strip and flank steak are\nmore popular in the summer grilling season. This study provides valuable\ninsights for businesses as well as policymakers to make inform decisions while\nconsidering how consumers relatively value among different labelling and\nproduct attributes by season and better address any ethical, safety and\naesthetic concerns that consumers might have.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2019 22:35:43 GMT"}], "update_date": "2019-06-18", "authors_parsed": [["Ardeshiri", "Ali", ""], ["Sampson", "Spring", ""], ["Swait", "Joffre", ""]]}, {"id": "1902.02480", "submitter": "Sounman Hong", "authors": "Sounman Hong, Jungmin Ryu", "title": "Crowdfunding Public Projects: Collaborative Governance for Achieving\n  Citizen Co-funding of Public Goods", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study explores the potential of crowdfunding as a tool for achieving\ncitizen co-funding of public projects. Focusing on philanthropic crowdfunding,\nwe examine whether collaborative projects between public and private\norganizations are more successful in fundraising than projects initiated solely\nby private organizations. We argue that government involvement in crowdfunding\nprovides some type of accreditation or certification that attests to a project\naim to achieve public rather than private goals, thereby mitigating information\nasymmetry and improving mutual trust between creators (i.e., private sector\norganizations) and funders (i.e., crowd). To support this argument, we show\nthat crowdfunding projects with government involvement achieved a greater\nsuccess rate and attracted a greater amount of funding than comparable projects\nwithout government involvement. This evidence shows that governments may take\nadvantage of crowdfunding to co-fund public projects with the citizenry for\naddressing the complex challenges that we face in the twenty-first century.\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2019 05:36:45 GMT"}], "update_date": "2019-02-08", "authors_parsed": [["Hong", "Sounman", ""], ["Ryu", "Jungmin", ""]]}, {"id": "1902.03310", "submitter": "Ali Ardeshiri", "authors": "Ali Ardeshiri, Joffre Swait, Elizabeth C. Heagney, Mladen Kovac", "title": "Preserve or retreat? Willingness-to-pay for Coastline Protection in New\n  South Wales", "comments": "arXiv admin note: substantial text overlap with arXiv:1902.02418", "journal-ref": null, "doi": "10.1016/j.ocecoaman.2019.05.007", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coastal erosion is a global and pervasive phenomenon that predicates a need\nfor a strategic approach to the future management of coastal values and assets\n(both built and natural), should we invest in protective structures like\nseawalls that aim to preserve specific coastal features, or allow natural\ncoastline retreat to preserve sandy beaches and other coastal ecosystems.\nDetermining the most suitable management approach in a specific context\nrequires a better understanding of the full suite of economic values the\npopulations holds for coastal assets, including non-market values. In this\nstudy, we characterise New South Wales residents willingness to pay to maintain\nsandy beaches (width and length). We use an innovative application of a Latent\nClass Binary Logit model to deal with Yea-sayers and Nay-sayers, as well as\nrevealing the latent heterogeneity among sample members. We find that 65% of\nthe population would be willing to pay some amount of levy, dependent on the\npolicy setting. In most cases, there is no effect of degree of beach\ndeterioration characterised as loss of width and length of sandy beaches of\nbetween 5% and 100% on respondents willingness to pay for a management levy.\nThis suggests that respondents who agreed to pay a management levy were\nmotivated to preserve sandy beaches in their current state irrespective of the\nseverity of sand loss likely to occur as a result of coastal erosion.\nWillingness to pay also varies according to beach type (amongst Iconic, Main,\nBay and Surf beaches) a finding that can assist with spatial prioritisation of\ncoastal management. Not recognizing the presence of nay-sayers in the data or\nrecognizing them but eliminating them from the estimation will result in biased\nWTP results and, consequently, biased policy propositions by coastal managers.\n", "versions": [{"version": "v1", "created": "Wed, 6 Feb 2019 22:28:44 GMT"}], "update_date": "2019-05-28", "authors_parsed": [["Ardeshiri", "Ali", ""], ["Swait", "Joffre", ""], ["Heagney", "Elizabeth C.", ""], ["Kovac", "Mladen", ""]]}, {"id": "1902.04940", "submitter": "Didier Sornette", "authors": "Didier Sornette, Spencer Wheatley and Peter Cauwels", "title": "The fair reward problem: the illusion of success and how to solve it", "comments": "41 pages, 12 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Humanity has been fascinated by the pursuit of fortune since time immemorial,\nand many successful outcomes benefit from strokes of luck. But success is\nsubject to complexity, uncertainty, and change - and at times becoming\nincreasingly unequally distributed. This leads to tension and confusion over to\nwhat extent people actually get what they deserve (i.e., fairness/meritocracy).\nMoreover, in many fields, humans are over-confident and pervasively confuse\nluck for skill (I win, it's skill; I lose, it's bad luck). In some fields,\nthere is too much risk taking; in others, not enough. Where success derives in\nlarge part from luck - and especially where bailouts skew the incentives\n(heads, I win; tails, you lose) - it follows that luck is rewarded too much.\nThis incentivizes a culture of gambling, while downplaying the importance of\nproductive effort. And, short term success is often rewarded, irrespective, and\npotentially at the detriment, of the long-term system fitness. However, much\nsuccess is truly meritocratic, and the problem is to discern and reward based\non merit. We call this the fair reward problem. To address this, we propose\nthree different measures to assess merit: (i) raw outcome; (ii) risk adjusted\noutcome, and (iii) prospective. We emphasize the need, in many cases, for the\ndeductive prospective approach, which considers the potential of a system to\nadapt and mutate in novel futures. This is formalized within an evolutionary\nsystem, comprised of five processes, inter alia handling the\nexploration-exploitation trade-off. Several human endeavors - including\nfinance, politics, and science -are analyzed through these lenses, and concrete\nsolutions are proposed to support a prosperous and meritocratic society.\n", "versions": [{"version": "v1", "created": "Sun, 3 Feb 2019 10:22:28 GMT"}, {"version": "v2", "created": "Thu, 18 Apr 2019 12:43:15 GMT"}], "update_date": "2019-04-19", "authors_parsed": [["Sornette", "Didier", ""], ["Wheatley", "Spencer", ""], ["Cauwels", "Peter", ""]]}, {"id": "1902.05938", "submitter": "Donovan Platt", "authors": "Donovan Platt", "title": "A Comparison of Economic Agent-Based Model Calibration Methods", "comments": "32 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interest in agent-based models of financial markets and the wider economy has\nincreased consistently over the last few decades, in no small part due to their\nability to reproduce a number of empirically-observed stylised facts that are\nnot easily recovered by more traditional modelling approaches. Nevertheless,\nthe agent-based modelling paradigm faces mounting criticism, focused\nparticularly on the rigour of current validation and calibration practices,\nmost of which remain qualitative and stylised fact-driven. While the literature\non quantitative and data-driven approaches has seen significant expansion in\nrecent years, most studies have focused on the introduction of new calibration\nmethods that are neither benchmarked against existing alternatives nor\nrigorously tested in terms of the quality of the estimates they produce. We\ntherefore compare a number of prominent ABM calibration methods, both\nestablished and novel, through a series of computational experiments in an\nattempt to determine the respective strengths and weaknesses of each approach\nand the overall quality of the resultant parameter estimates. We find that\nBayesian estimation, though less popular in the literature, consistently\noutperforms frequentist, objective function-based approaches and results in\nreasonable parameter estimates in many contexts. Despite this, we also find\nthat agent-based model calibration techniques require further development in\norder to definitively calibrate large-scale models. We therefore make\nsuggestions for future research.\n", "versions": [{"version": "v1", "created": "Fri, 15 Feb 2019 18:45:48 GMT"}], "update_date": "2019-02-18", "authors_parsed": [["Platt", "Donovan", ""]]}, {"id": "1902.06549", "submitter": "Aleksandra Alori\\'c", "authors": "Aleksandra Alori\\'c, Peter Sollich", "title": "Market fragmentation and market consolidation: Multiple steady states in\n  systems of adaptive traders choosing where to trade", "comments": "25 pages, 17 figures", "journal-ref": "Phys. Rev. E 99, 062309 (2019)", "doi": "10.1103/PhysRevE.99.062309", "report-no": null, "categories": "q-fin.TR econ.GN nlin.AO q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Technological progress is leading to proliferation and diversification of\ntrading venues, thus increasing the relevance of the long-standing question of\nmarket fragmentation versus consolidation. To address this issue\nquantitatively, we analyse systems of adaptive traders that choose where to\ntrade based on their previous experience. We demonstrate that only based on\naggregate parameters about trading venues, such as the demand to supply ratio,\nwe can assess whether a population of traders will prefer fragmentation or\nspecialization towards a single venue. We investigate what conditions lead to\nmarket fragmentation for populations with a long memory and analyse the\nstability and other properties of both fragmented and consolidated steady\nstates. Finally we investigate the dynamics of populations with finite memory;\nwhen this memory is long the true long-time steady states are consolidated but\nfragmented states are strongly metastable, dominating the behaviour out to long\ntimes.\n", "versions": [{"version": "v1", "created": "Mon, 18 Feb 2019 12:56:09 GMT"}, {"version": "v2", "created": "Mon, 24 Jun 2019 15:27:46 GMT"}], "update_date": "2019-06-26", "authors_parsed": [["Alorić", "Aleksandra", ""], ["Sollich", "Peter", ""]]}, {"id": "1902.07355", "submitter": "Kirk Bansak", "authors": "Avidit Acharya, Kirk Bansak, Jens Hainmueller", "title": "Combining Outcome-Based and Preference-Based Matching: A Constrained\n  Priority Mechanism", "comments": "This manuscript has been accepted for publication by Political\n  Analysis and will appear in a revised form subject to peer review and/or\n  input from the journal's editor. End-users of this manuscript may only make\n  use of it for private research and study and may not distribute it further", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.LG q-fin.EC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a constrained priority mechanism that combines outcome-based\nmatching from machine-learning with preference-based allocation schemes common\nin market design. Using real-world data, we illustrate how our mechanism could\nbe applied to the assignment of refugee families to host country locations, and\nkindergarteners to schools. Our mechanism allows a planner to first specify a\nthreshold $\\bar g$ for the minimum acceptable average outcome score that should\nbe achieved by the assignment. In the refugee matching context, this score\ncorresponds to the predicted probability of employment, while in the student\nassignment context it corresponds to standardized test scores. The mechanism is\na priority mechanism that considers both outcomes and preferences by assigning\nagents (refugee families, students) based on their preferences, but subject to\nmeeting the planner's specified threshold. The mechanism is both strategy-proof\nand constrained efficient in that it always generates a matching that is not\nPareto dominated by any other matching that respects the planner's threshold.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2019 00:17:33 GMT"}, {"version": "v2", "created": "Wed, 20 Nov 2019 01:41:28 GMT"}, {"version": "v3", "created": "Tue, 11 Aug 2020 17:22:34 GMT"}], "update_date": "2020-08-13", "authors_parsed": [["Acharya", "Avidit", ""], ["Bansak", "Kirk", ""], ["Hainmueller", "Jens", ""]]}, {"id": "1902.08681", "submitter": "Tho Le", "authors": "Tho V. Le and Satish V. Ukkusuri", "title": "Influencing factors that determine the usage of the crowd-shipping\n  services", "comments": "32 pages", "journal-ref": "TRR, 2019", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective of this study is to understand how senders choose shipping\nservices for different products, given the availability of both emerging\ncrowd-shipping (CS) and traditional carriers in a logistics market. Using data\ncollected from a US survey, Random Utility Maximization (RUM) and Random Regret\nMinimization (RRM) models have been employed to reveal factors that influence\nthe diversity of decisions made by senders. Shipping costs, along with\nadditional real-time services such as courier reputations, tracking info,\ne-notifications, and customized delivery time and location, have been found to\nhave remarkable impacts on senders' choices. Interestingly, potential senders\nwere willing to pay more to ship grocery items such as food, beverages, and\nmedicines by CS services. Moreover, the real-time services have low\nelasticities, meaning that only a slight change in those services will lead to\na change in sender-behavior. Finally, data-science techniques were used to\nassess the performance of the RUM and RRM models and found to have similar\naccuracies. The findings from this research will help logistics firms address\npotential market segments, prepare service configurations to fulfill senders'\nexpectations, and develop effective business operations strategies.\n", "versions": [{"version": "v1", "created": "Fri, 22 Feb 2019 21:49:22 GMT"}], "update_date": "2019-02-26", "authors_parsed": [["Le", "Tho V.", ""], ["Ukkusuri", "Satish V.", ""]]}, {"id": "1902.09167", "submitter": "Alje van Dam", "authors": "Alje van Dam", "title": "Diversity and its decomposition into variety, balance and disparity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE econ.GN physics.data-an physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Diversity is a central concept in many fields. Despite its importance, there\nis no unified methodological framework to measure diversity and its three\ncomponents of variety, balance and disparity. Current approaches take into\naccount disparity of the types by considering their pairwise similarities.\nPairwise similarities between types do not adequately capture total disparity,\nsince they fail to take into account in which way pairs are similar. Hence,\npairwise similarities do not discriminate between similarity of types in terms\nof the same feature and similarity of types in terms of different features.\nThis paper presents an alternative approach which is based similarities of\nfeatures between types over the whole set. The proposed measure of diversity\nproperly takes into account the aspects of variety, balance and disparity, and\nwithout having to set an arbitrary weight for each aspect of diversity. Based\non this measure, the 'ABC decomposition' is introduced, which provides separate\nmeasures for the variety, balance and disparity, allowing them to enter\nanalysis separately. The method is illustrated by analyzing the industrial\ndiversity from 1850 to present while taking into account the overlap in\noccupations they employ. Finally, the framework is extended to take into\naccount disparity considering multiple features, providing a helpful tool in\nanalysis of high-dimensional data.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 09:48:05 GMT"}, {"version": "v2", "created": "Tue, 26 Feb 2019 10:41:42 GMT"}], "update_date": "2019-02-27", "authors_parsed": [["van Dam", "Alje", ""]]}, {"id": "1902.09204", "submitter": "Francisco Oteiza", "authors": "Fernando M. Arag\\'on (1), Francisco Oteiza (2) and Juan Pablo Rud (3)\n  ((1) Department of Economics, Simon Fraser University, (2) Department of\n  Social Science, UCL Institute of Education, (3) Department of Economics,\n  Royal Holloway, University of London and Institute of Fiscal Studies)", "title": "Climate Change and Agriculture: Subsistence Farmers' Response to Extreme\n  Heat", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  This paper examines how subsistence farmers respond to extreme heat. Using\nmicro-data from Peruvian households, we find that high temperatures reduce\nagricultural productivity, increase area planted, and change crop mix. These\nfindings are consistent with farmers using input adjustments as a short-term\nmechanism to attenuate the effect of extreme heat on output. This response\nseems to complement other coping strategies, such as selling livestock, but\nexacerbates the drop in yields, a standard measure of agricultural\nproductivity. Using our estimates, we show that accounting for land adjustments\nis important to quantify damages associated with climate change.\n", "versions": [{"version": "v1", "created": "Mon, 25 Feb 2019 11:40:42 GMT"}, {"version": "v2", "created": "Thu, 28 Feb 2019 15:17:52 GMT"}], "update_date": "2019-03-01", "authors_parsed": [["Aragón", "Fernando M.", ""], ["Oteiza", "Francisco", ""], ["Rud", "Juan Pablo", ""]]}, {"id": "1902.09999", "submitter": "Attila Andr\\'as V\\'ig", "authors": "Zsolt Bihary and Attila Andr\\'as V\\'ig", "title": "Analytic solutions in a continuous-time financial market model", "comments": "Journal of Economic Literature (JEL) code: G11, G17", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a heterogeneous agent market model (HAM) in continuous time. The\nmarket is populated by fundamental traders and chartists, who both use simple\nlinear trading rules. Most of the related literature explores stability, price\ndynamics and profitability either within deterministic models or by simulation.\nOur novel formulation lends itself to analytic treatment even in the stochastic\ncase. We prove conditions for the (stochastic) stability of the price process,\nand also for the price to mean-revert to the fundamental value. Assuming\nstability, we derive analytic formulae on how the population ratios influence\nprice dynamics and the profitability of the strategies. Our results suggest\nthat whichever trader type is more present in the market will achieve higher\nreturns.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2019 15:26:29 GMT"}], "update_date": "2019-02-27", "authors_parsed": [["Bihary", "Zsolt", ""], ["Víg", "Attila András", ""]]}, {"id": "1902.10021", "submitter": "P\\'eter Ker\\'enyi", "authors": "Zsolt Bihary, P\\'eter Cs\\'oka, P\\'eter Ker\\'enyi and Alexander\n  Szimayer", "title": "Self-respecting worker in the gig economy: A dynamic principal-agent\n  model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a dynamic principal-agent model to understand the nature of\ncontracts between an employer and an independent gig worker. We model the\nworker's self-respect with an endogenous participation constraint; he accepts a\njob offer if and only if its utility is at least as large as his reference\nvalue, which is based on the average of previously realized wages. If the\ndynamically changing reference value capturing the worker's demand is too high,\nthen no contract is struck until the reference value hits a threshold. Below\nthe threshold, contracts are offered and accepted, and the worker's wage demand\nfollows a stochastic process. We apply our model to different labor market\nstructures and investigate first-best and second-best solutions. We show that a\nfar-sighted employer may sacrifice instantaneous profit to regulate the agent's\ndemand. Employers who can afford to stall production due to a lower subjective\ndiscount rate will obtain higher profits. Our model captures the worker's\nbargaining power by a vulnerability parameter that measures the rate at which\nhis wage demand decreases when unemployed. With a low vulnerability parameter,\nthe worker can afford to go unemployed and need not take a job at all costs.\nConversely, a worker with high vulnerability can be exploited by the employer,\nand in this case our model also exhibits self-exploitation.\n", "versions": [{"version": "v1", "created": "Tue, 26 Feb 2019 16:05:06 GMT"}, {"version": "v2", "created": "Sat, 19 Jun 2021 15:35:29 GMT"}], "update_date": "2021-06-22", "authors_parsed": [["Bihary", "Zsolt", ""], ["Csóka", "Péter", ""], ["Kerényi", "Péter", ""], ["Szimayer", "Alexander", ""]]}, {"id": "1902.10080", "submitter": "Hannu Laine", "authors": "Hannu S. Laine, Jyri Salpakari, Erin E. Looney, Hele Savin, Ian Marius\n  Peters and Tonio Buonassisi", "title": "Meeting Global Cooling Demand with Photovoltaics during the 21st Century", "comments": null, "journal-ref": null, "doi": "10.1039/C9EE00002J", "report-no": null, "categories": "econ.GN physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Space conditioning, and cooling in particular, is a key factor in human\nproductivity and well-being across the globe. During the 21st century, global\ncooling demand is expected to grow significantly due to the increase in wealth\nand population in sunny nations across the globe and the advance of global\nwarming. The same locations that see high demand for cooling are also ideal for\nelectricity generation via photovoltaics (PV). Despite the apparent synergy\nbetween cooling demand and PV generation, the potential of the cooling sector\nto sustain PV generation has not been assessed on a global scale. Here, we\nperform a global assessment of increased PV electricity adoption enabled by the\nresidential cooling sector during the 21st century. Already today, utilizing PV\nproduction for cooling could facilitate an additional installed PV capacity of\napproximately 540 GW, more than the global PV capacity of today. Using\nestablished scenarios of population and income growth, as well as accounting\nfor future global warming, we further project that the global residential\ncooling sector could sustain an added PV capacity between 20-200 GW each year\nfor most of the 21st century, on par with the current global manufacturing\ncapacity of 100 GW. Furthermore, we find that without storage, PV could\ndirectly power approximately 50% of cooling demand, and that this fraction is\nset to increase from 49% to 56% during the 21st century, as cooling demand\ngrows in locations where PV and cooling have a higher synergy. With this\ngeographic shift in demand, the potential of distributed storage also grows. We\nsimulate that with a 1 m$^3$ water-based latent thermal storage per household,\nthe fraction of cooling demand met with PV would increase from 55% to 70%\nduring the century. These results show that the synergy between cooling and PV\nis notable and could significantly accelerate the growth of the global PV\nindustry.\n", "versions": [{"version": "v1", "created": "Sun, 24 Feb 2019 10:52:59 GMT"}], "update_date": "2019-06-12", "authors_parsed": [["Laine", "Hannu S.", ""], ["Salpakari", "Jyri", ""], ["Looney", "Erin E.", ""], ["Savin", "Hele", ""], ["Peters", "Ian Marius", ""], ["Buonassisi", "Tonio", ""]]}, {"id": "1902.10405", "submitter": "Dylan Possama\\\"i", "authors": "Romuald Elie, Emma Hubert, Thibaut Mastrolia, Dylan Possama\\\"i", "title": "Mean-field moral hazard for optimal energy demand response management", "comments": "54 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR econ.GN math.OC q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of demand response contracts in electricity markets by\nquantifying the impact of considering a mean-field of consumers, whose\nconsumption is impacted by a common noise. We formulate the problem as a\nPrincipal-Agent problem with moral hazard in which the Principal - she - is an\nelectricity producer who observes continuously the consumption of a continuum\nof risk-averse consumers, and designs contracts in order to reduce her\nproduction costs. More precisely, the producer incentivises the consumers to\nreduce the average and the volatility of their consumption in different usages,\nwithout observing the efforts they make. We prove that the producer can benefit\nfrom considering the mean-field of consumers by indexing contracts on the\nconsumption of one Agent and aggregate consumption statistics from the\ndistribution of the entire population of consumers. In the case of linear\nenergy valuation, we provide closed-form expression for this new type of\noptimal contracts that maximises the utility of the producer. In most cases, we\nshow that this new type of contracts allows the Principal to choose the risks\nshe wants to bear, and to reduce the problem at hand to an uncorrelated one.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2019 09:16:34 GMT"}, {"version": "v2", "created": "Thu, 14 Mar 2019 14:49:41 GMT"}, {"version": "v3", "created": "Tue, 24 Mar 2020 17:00:28 GMT"}], "update_date": "2020-03-25", "authors_parsed": [["Elie", "Romuald", ""], ["Hubert", "Emma", ""], ["Mastrolia", "Thibaut", ""], ["Possamaï", "Dylan", ""]]}, {"id": "1902.10790", "submitter": "L\\'aszl\\'o Csat\\'o", "authors": "L\\'aszl\\'o Csat\\'o and D\\'ora Gr\\'eta Petr\\'oczy", "title": "On the monotonicity of the eigenvector method", "comments": "16 pages, 2 figures, 2 tables", "journal-ref": "European Journal of Operational Research, 292(1): 230-237, 2021", "doi": "10.1016/j.ejor.2020.10.020", "report-no": null, "categories": "math.OC econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pairwise comparisons are used in a wide variety of decision situations where\nthe importance of alternatives should be measured on a numerical scale. One\npopular method to derive the priorities is based on the right eigenvector of a\nmultiplicative pairwise comparison matrix. We consider two monotonicity axioms\nin this setting. First, increasing an arbitrary entry of a pairwise comparison\nmatrix is not allowed to result in a counter-intuitive rank reversal, that is,\nthe favoured alternative in the corresponding row cannot be ranked lower than\nany other alternative if this was not the case before the change (rank\nmonotonicity). Second, the same modification should not decrease the normalised\nweight of the favoured alternative (weight monotonicity). Both properties are\nsatisfied by the geometric mean method but violated by the eigenvector method.\nThe axioms do not uniquely determine the geometric mean. The relationship\nbetween the two monotonicity properties and the Saaty inconsistency index are\ninvestigated for the eigenvector method via simulations. Even though their\nviolation turns out not to be a usual problem even for heavily inconsistent\nmatrices, all decision-makers should be informed about the possible occurrence\nof such unexpected consequences of increasing a matrix entry.\n", "versions": [{"version": "v1", "created": "Wed, 27 Feb 2019 21:19:22 GMT"}, {"version": "v2", "created": "Thu, 20 Jun 2019 12:09:17 GMT"}, {"version": "v3", "created": "Thu, 6 Feb 2020 11:38:16 GMT"}, {"version": "v4", "created": "Thu, 25 Jun 2020 16:00:02 GMT"}, {"version": "v5", "created": "Tue, 20 Oct 2020 12:25:22 GMT"}], "update_date": "2021-02-23", "authors_parsed": [["Csató", "László", ""], ["Petróczy", "Dóra Gréta", ""]]}]