[{"id": "2007.00449", "submitter": "Shahryar Rahnamayan", "authors": "Mostapha Kalami Heris and Shahryar Rahnamayan", "title": "Multi-objective Optimal Control of Dynamic Integrated Model of Climate\n  and Economy: Evolution in Action", "comments": "8 pages, 6 figures, conference paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.NE cs.SY eess.SY q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  One of the widely used models for studying economics of climate change is the\nDynamic Integrated model of Climate and Economy (DICE), which has been\ndeveloped by Professor William Nordhaus, one of the laureates of the 2018 Nobel\nMemorial Prize in Economic Sciences. Originally a single-objective optimal\ncontrol problem has been defined on DICE dynamics, which is aimed to maximize\nthe social welfare. In this paper, a bi-objective optimal control problem\ndefined on DICE model, objectives of which are maximizing social welfare and\nminimizing the temperature deviation of atmosphere. This multi-objective\noptimal control problem solved using Non-Dominated Sorting Genetic Algorithm II\n(NSGA-II) also it is compared to previous works on single-objective version of\nthe problem. The resulting Pareto front rediscovers the previous results and\ngeneralizes to a wide range of non-dominant solutions to minimize the global\ntemperature deviation while optimizing the economic welfare. The previously\nused single-objective approach is unable to create such a variety of\npossibilities, hence, its offered solution is limited in vision and reachable\nperformance. Beside this, resulting Pareto-optimal set reveals the fact that\ntemperature deviation cannot go below a certain lower limit, unless we have\nsignificant technology advancement or positive change in global conditions.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2020 20:41:34 GMT"}], "update_date": "2020-07-02", "authors_parsed": [["Heris", "Mostapha Kalami", ""], ["Rahnamayan", "Shahryar", ""]]}, {"id": "2007.00486", "submitter": "Yu Hu", "authors": "Yu Hu, David Soler Soneira, Mar\\'ia Jes\\'us S\\'anchez", "title": "Barriers to grid-connected battery systems: Evidence from the Spanish\n  electricity market", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electrical energy storage is considered essential for the future energy\nsystems. Among all the energy storage technologies, battery systems may provide\nflexibility to the power grid in a more distributed and decentralized way. In\ncountries with deregulated electricity markets, grid-connected battery systems\nshould be operated under the specific market design of the country. In this\nwork, using the Spanish electricity market as an example, the barriers to\ngrid-connected battery systems are investigated using utilization analysis. The\nconcept of \"potentially profitable utilization time\" is proposed and introduced\nto identify and evaluate future potential grid applications for battery\nsystems. The numerical and empirical analysis suggests that the high cycle cost\nfor battery systems is still the main barrier for grid-connected battery\nsystems. In Spain, for energy arbitrage within the day-ahead market, it is\nrequired that the battery wear cost decreases to 15 Euro/MWh to make the\npotentially profitable utilization rate higher than 20%. Nevertheless, the\npotentially profitable utilization of batteries is much higher in the\napplications when higher flexibility is demanded. The minimum required battery\nwear cost corresponding to 20% potentially profitable utilization time\nincreases to 35 Euro/MWh for energy arbitrage within the day-ahead market and\nancillary services, and 50 Euro/MWh for upward secondary reserve. The results\nof this study contribute to the awareness of battery storage technology and its\nflexibility in grid applications. The findings also have significant\nimplications for policy makers and market operators interested in promoting\ngrid-connected battery storage under a deregulated power market.\n", "versions": [{"version": "v1", "created": "Sun, 28 Jun 2020 13:08:05 GMT"}, {"version": "v2", "created": "Thu, 26 Nov 2020 09:58:50 GMT"}], "update_date": "2020-11-30", "authors_parsed": [["Hu", "Yu", ""], ["Soneira", "David Soler", ""], ["Sánchez", "María Jesús", ""]]}, {"id": "2007.00933", "submitter": "Magnus Lundgren", "authors": "Magnus Lundgren, Mark Klamberg, Karin Sundstr\\\"om, and Julia Dahlqvist", "title": "Emergency Powers in Response to COVID-19: Policy diffusion, Democracy,\n  and Preparedness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine COVID-19-related states of emergency (SOEs) using data on 180\ncountries in the period January 1 through June 12, 2020. The results suggest\nthat states' declaration of SOEs is driven by both external and internal\nfactors. A permissive regional environment, characterized by many and\nsimultaneously declared SOEs, may have diminished reputational and political\ncosts, making employment of emergency powers more palatable for a wider range\nof governments. At the same time, internal characteristics, specifically\ndemocratic institutions and pandemic preparedness, shaped governments'\ndecisions. Weak democracies with poor pandemic preparedness were considerably\nmore likely to opt for SOEs than dictatorships and robust democracies with\nhigher preparedness. We find no significant association between pandemic\nimpact, measured as national COVID-19-related deaths, and SOEs, suggesting that\nmany states adopted SOEs proactively before the disease spread locally.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jul 2020 07:16:15 GMT"}], "update_date": "2020-07-03", "authors_parsed": [["Lundgren", "Magnus", ""], ["Klamberg", "Mark", ""], ["Sundström", "Karin", ""], ["Dahlqvist", "Julia", ""]]}, {"id": "2007.01448", "submitter": "Yanying Sheng", "authors": "Runjing Lu and Yanying Sheng", "title": "From Fear to Hate: How the Covid-19 Pandemic Sparks Racial Animus in the\n  United States", "comments": "34 pages, 12 figures, 7 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.SI q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We estimate the effect of the Coronavirus (Covid-19) pandemic on racial\nanimus, as measured by Google searches and Twitter posts including a commonly\nused anti-Asian racial slur. Our empirical strategy exploits the plausibly\nexogenous variation in the timing of the first Covid-19 diagnosis across\nregions in the United States. We find that the first local diagnosis leads to\nan immediate increase in racist Google searches and Twitter posts, with the\nlatter mainly coming from existing Twitter users posting the slur for the first\ntime. This increase could indicate a rise in future hate crimes, as we document\na strong correlation between the use of the slur and anti-Asian hate crimes\nusing historic data. Moreover, we find that the rise in the animosity is\ndirected at Asians rather than other minority groups and is stronger on days\nwhen the connection between the disease and Asians is more salient, as proxied\nby President Trump's tweets mentioning China and Covid-19 at the same time. In\ncontrast, the negative economic impact of the pandemic plays little role in the\ninitial increase in racial animus. Our results suggest that de-emphasizing the\nconnection between the disease and a particular racial group can be effective\nin curbing current and future racial animus.\n", "versions": [{"version": "v1", "created": "Fri, 3 Jul 2020 01:21:44 GMT"}], "update_date": "2020-07-06", "authors_parsed": [["Lu", "Runjing", ""], ["Sheng", "Yanying", ""]]}, {"id": "2007.02109", "submitter": "Marc Barthelemy", "authors": "Jiachen Ye, Peng Ji, Marc Barthelemy", "title": "Scenarios for a post-COVID-19 world airline network", "comments": "12 pages, 7 main figures (+5 figures in appendix)", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cond-mat.dis-nn econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The airline industry was severely hit by the COVID-19 crisis with an average\ndemand decrease of about $64\\%$ (IATA, April 2020) which triggered already\nseveral bankruptcies of airline companies all over the world. While the\nrobustness of the world airline network (WAN) was mostly studied as an\nhomogeneous network, we introduce a new tool for analyzing the impact of a\ncompany failure: the `airline company network' where two airlines are connected\nif they share at least one route segment. Using this tool, we observe that the\nfailure of companies well connected with others has the largest impact on the\nconnectivity of the WAN. We then explore how the global demand reduction\naffects airlines differently, and provide an analysis of different scenarios if\nits stays low and does not come back to its pre-crisis level. Using traffic\ndata from the Official Aviation Guide (OAG) and simple assumptions about\ncustomer's airline choice strategies, we find that the local effective demand\ncan be much lower than the average one, especially for companies that are not\nmonopolistic and share their segments with larger companies. Even if the\naverage demand comes back to $60\\%$ of the total capacity, we find that between\n$46\\%$ and $59\\%$ of the companies could experience a reduction of more than\n$50\\%$ of their traffic, depending on the type of competitive advantage that\ndrives customer's airline choice. These results highlight how the complex\ncompetitive structure of the WAN weakens its robustness when facing such a\nlarge crisis.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jul 2020 14:31:12 GMT"}], "update_date": "2020-07-08", "authors_parsed": [["Ye", "Jiachen", ""], ["Ji", "Peng", ""], ["Barthelemy", "Marc", ""]]}, {"id": "2007.02934", "submitter": "Wolfgang Banzhaf", "authors": "Wolfgang Banzhaf", "title": "The Effects of Taxes on Wealth Inequality in Artificial Chemistry Models\n  of Economic Activity", "comments": "13 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN cs.MA econ.GN physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a number of Artificial Chemistry models for economic activity and\nwhat consequences they have for the formation of economic inequality. We are\nparticularly interested in what tax measures are effective in dampening\neconomic inequality. By starting from well-known kinetic exchange models, we\nexamine different scenarios for reducing the tendency of economic activity\nmodels to form unequal wealth distribution in equilibrium.\n", "versions": [{"version": "v1", "created": "Fri, 3 Jul 2020 18:00:18 GMT"}], "update_date": "2020-07-08", "authors_parsed": [["Banzhaf", "Wolfgang", ""]]}, {"id": "2007.02935", "submitter": "Jaime Orrillo", "authors": "Jos\\'e Nilmar Alves de Oliveira, Jaime Orrillo, Franklin Gamboa", "title": "The Home Office in Times of COVID-19 Pandemic and its impact in the\n  Labor Supply", "comments": "13 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We lightly modify Eriksson's (1996) model to accommodate the home office in a\nsimple model of endogenous growth. By home office we mean any working activity\ncarried out away from the workplace which is assumed to be fixed. Due to the\nstrong mobility restrictions imposed on citizens during the COVID-19 pandemic,\nwe allow the home office to be located at home. At the home office, however, in\nconsequence of the fear and anxiety workers feel because of COVID-19, they\nbecome distracted and spend less time working. We show that in the long run,\nthe intertemporal elasticity of substitution of the home-office labor is\nsufficiently small only if the intertemporal elasticity of substitution of the\ntime spent on distracting activities is small enough also.\n", "versions": [{"version": "v1", "created": "Sun, 5 Jul 2020 03:16:08 GMT"}, {"version": "v2", "created": "Wed, 8 Jul 2020 10:24:23 GMT"}], "update_date": "2020-07-09", "authors_parsed": [["de Oliveira", "José Nilmar Alves", ""], ["Orrillo", "Jaime", ""], ["Gamboa", "Franklin", ""]]}, {"id": "2007.03477", "submitter": "Valeria Fanghella", "authors": "Carlo Fezzi, Valeria Fanghella", "title": "Real-time estimation of the short-run impact of COVID-19 on economic\n  activity using electricity market data", "comments": "Accepted for publication in Environmental and Resource Economics", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The COVID-19 pandemic has caused more than 8 million confirmed cases and\n500,000 death to date. In response to this emergency, many countries have\nintroduced a series of social-distancing measures including lockdowns and\nbusinesses' temporary shutdowns, in an attempt to curb the spread of the\ninfection. Accordingly, the pandemic has been generating unprecedent disruption\non practically every aspect of society. This paper demonstrates that\nhigh-frequency electricity market data can be used to estimate the causal,\nshort-run impact of COVID-19 on the economy. In the current uncertain economic\nconditions, timeliness is essential. Unlike official statistics, which are\npublished with a delay of a few months, with our approach one can monitor\nvirtually every day the impact of the containment policies, the extent of the\nrecession and measure whether the monetary and fiscal stimuli introduced to\naddress the crisis are being effective. We illustrate our methodology on daily\ndata for the Italian day-ahead power market. Not surprisingly, we find that the\ncontainment measures caused a significant reduction in economic activities and\nthat the GDP at the end of in May 2020 is still about 11% lower that what it\nwould have been without the outbreak.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jul 2020 14:10:41 GMT"}], "update_date": "2020-07-08", "authors_parsed": [["Fezzi", "Carlo", ""], ["Fanghella", "Valeria", ""]]}, {"id": "2007.03654", "submitter": "Andreas M. Hein", "authors": "Andreas M. Hein", "title": "The Cathedral and the Starship: Learning from the Middle Ages for Future\n  Long-Duration Projects", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN physics.pop-ph physics.space-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A popular analogue used in the space domain is that of historical building\nprojects, notably cathedrals that took decades and in some cases centuries to\ncomplete. Cathedrals are often taken as archetypes for long-term projects. In\nthis article, I will explore the cathedral from the point of view of project\nmanagement and systems architecting and draw implications for long-term\nprojects in the space domain, notably developing a starship. I will show that\nthe popular image of a cathedral as a continuous long-term project is in\ncontradiction to the current state of research. More specifically, I will show\nthat for the following propositions: The cathedrals were built based on an\ninitial detailed master plan; Building was a continuous process that adhered to\nthe master plan; Investments were continuously provided for the building\nprocess. Although initial plans might have existed, the construction process\ntook often place in multiple campaigns, sometimes separated by decades. Such\ninterruptions made knowledge-preservation very challenging. The reason for the\nlong stretches of inactivity was mostly due to a lack of funding. Hence, the\navailability of funding coincided with construction activity. These findings\npaint a much more relevant picture of cathedral building for long-duration\nprojects today: How can a project be completed despite a range of uncertainties\nregarding loss in skills, shortage in funding, and interruptions? It is\nconcluded that long-term projects such as an interstellar exploration program\ncan take inspiration from cathedrals by developing a modular architecture,\nallowing for extensibility and flexibility, thinking about value delivery at an\nearly point, and establishing mechanisms and an organization for stable\nfunding.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jul 2020 17:43:49 GMT"}], "update_date": "2020-07-08", "authors_parsed": [["Hein", "Andreas M.", ""]]}, {"id": "2007.03980", "submitter": "Matthias Raddant", "authors": "Matthias Raddant and Hiroshi Takahashi", "title": "Network effects and the appointment of female board members in Japan", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.GN q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the dynamics in the networks of Japanese corporates and its\ninterplay with the appointment of female board members. We find that firms with\nfemale board members show homophily with respect to gender and often have above\naverage profitability. We also find that new appointments of women are more\nlikely at boards which observe female board members at other firms to which\nthey are tied by either ownership relations or corporate board interlocks.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jul 2020 09:37:07 GMT"}], "update_date": "2020-07-09", "authors_parsed": [["Raddant", "Matthias", ""], ["Takahashi", "Hiroshi", ""]]}, {"id": "2007.04435", "submitter": "Doron Klunover", "authors": "Doron Klunover", "title": "Nice guys don't always finish last: succeeding in hierarchical\n  organizations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  What are the chances of an ethical individual rising through the ranks of a\npolitical party or a corporation in the presence of unethical peers? To answer\nthis question, I consider a four-player two-stage elimination tournament, in\nwhich players are partitioned into those willing to be involved in sabotage\nbehavior and those who are not. I show that, under certain conditions, the\nlatter are more likely to win the tournament.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jul 2020 10:42:10 GMT"}, {"version": "v2", "created": "Fri, 10 Jul 2020 18:02:25 GMT"}, {"version": "v3", "created": "Wed, 22 Jul 2020 19:35:53 GMT"}, {"version": "v4", "created": "Mon, 7 Sep 2020 14:43:34 GMT"}], "update_date": "2020-09-08", "authors_parsed": [["Klunover", "Doron", ""]]}, {"id": "2007.04962", "submitter": "Vitor Pestana Ostrensky", "authors": "Giovane Cerezuela Policeno, Mario Edson Passerino Fischer da Silva and\n  Vitor Pestana Ostrensky", "title": "An\\'alise dos fatores determinantes para o decreto de pris\\~ao\n  preventiva em casos envolvendo acusa\\c{c}\\~oes por roubo, tr\\'afico de drogas\n  e furto: Um estudo no \\^ambito das cidades mais populosas do Paran\\'a", "comments": "23 pages, in Portuguese", "journal-ref": "RJLB - REVISTA JUR\\'IDICA LUSO-BRASILEIRA, v. 1, p. 919-944, 2019", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on the theoretical assumptions of the Labeling Approach, Critical\nCriminology and Behavioral Economics, taking into account that almost half of\nthe Brazilian prison population is composed of individuals who are serving\npre-trial detention, it was sought to assess the characteristics of the\nflagranteated were presented as determinants to influence the subjectivity of\nthe judges in the decision to determine, or not, the custody of these. The\nresearch initially adopted a deductive methodology, based on the principle that\nexternal objective factors encourage magistrates to decide in a certain sense.\nIt was then focused on the identification of which characteristics of the\nflagranteated and allegedly committed crimes would be relevant to guide such\ndecisions. Subsequently, after deduction of such factors, an inductive\nmethodology was adopted, analyzing the data from the theoretical assumptions\npointed out. During the research, 277 decisions were analyzed, considering\ndecision as individual decision and not custody hearing. This sample embarked\ndecisions of six judges among the largest cities of the State of Paran\\'a and\nconcerning the crimes of theft, robbery and drug trafficking. It was then\nconcluded that the age, gender, social class and type of accusation that the\nflagranteated suffered are decisive for the decree of his provisional arrest,\nbeing that, depending on the judge competent in the case, the chances of the\ndecree can increase in Up to 700%, taking into account that the circumstantial\nand causal variables are constant. Given the small sample size, as far as the\nnumber of judges is concerned, more extensive research is needed so that\nconclusions of national validity can be developed.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jul 2020 17:51:27 GMT"}], "update_date": "2020-07-10", "authors_parsed": [["Policeno", "Giovane Cerezuela", ""], ["da Silva", "Mario Edson Passerino Fischer", ""], ["Ostrensky", "Vitor Pestana", ""]]}, {"id": "2007.05884", "submitter": "Plamen Nikolov", "authors": "Plamen Nikolov, Alan Adelman", "title": "Pension Benefits, Retirement and Human Capital Depreciation in Late\n  Adulthood", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Economists have mainly focused on human capital accumulation and considerably\nless on the causes and consequences of human capital depreciation in late\nadulthood. Studying human capital depreciation over the life cycle has powerful\neconomic consequences for decision-making in old age. Using data from China, we\nexamine how a new retirement program affects cognitive performance. We find\nlarge negative effects of pension benefits on cognitive functioning among the\nelderly. We detect the most substantial impact of the program on delayed\nrecall, a significant predictor of the onset of dementia. We show suggestive\nevidence that the program leads to larger negative impacts among women. We\ndemonstrate that retirement and access to a retirement pension plan plays a\nsignificant role in explaining cognitive decline at older ages.\n", "versions": [{"version": "v1", "created": "Sun, 12 Jul 2020 01:31:13 GMT"}, {"version": "v2", "created": "Tue, 14 Jul 2020 08:04:53 GMT"}, {"version": "v3", "created": "Wed, 19 Aug 2020 05:02:33 GMT"}, {"version": "v4", "created": "Wed, 2 Dec 2020 04:25:52 GMT"}, {"version": "v5", "created": "Sun, 6 Dec 2020 10:16:14 GMT"}, {"version": "v6", "created": "Sun, 20 Dec 2020 20:08:42 GMT"}], "update_date": "2020-12-22", "authors_parsed": [["Nikolov", "Plamen", ""], ["Adelman", "Alan", ""]]}, {"id": "2007.06468", "submitter": "Lucas B\\\"ottcher", "authors": "Lucas B\\\"ottcher and Hans Gersbach", "title": "Incentivizing Narrow-Spectrum Antibiotic Development with Refunding", "comments": "21 pages and 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid rise of antibiotic resistance is a serious threat to global public\nhealth. Without further incentives, pharmaceutical companies have little\ninterest in developing antibiotics, since the success probability is low and\ndevelopment costs are huge. The situation is exacerbated by the \"antibiotics\ndilemma\": Developing narrow-spectrum antibiotics against resistant bacteria is\nmost beneficial for society, but least attractive for companies since their\nusage is more limited than for broad-spectrum drugs and thus sales are low.\nStarting from a general mathematical framework for the study of\nantibiotic-resistance dynamics with an arbitrary number of antibiotics, we\nidentify efficient treatment protocols and introduce a market-based refunding\nscheme that incentivizes pharmaceutical companies to develop narrow-spectrum\nantibiotics: Successful companies can claim a refund from a newly established\nantibiotics fund that partially covers their development costs. The proposed\nrefund involves a fixed and variable part. The latter (i) increases with the\nuse of the new antibiotic for currently resistant strains in comparison with\nother newly developed antibiotics for this purpose---the resistance\npremium---and (ii) decreases with the use of this antibiotic for non-resistant\nbacteria. We outline how such a refunding scheme can solve the antibiotics\ndilemma and cope with various sources of uncertainty inherent in antibiotic\nR\\&D. Finally, connecting our refunding approach to the recently established\nantimicrobial resistance (AMR) action fund, we discuss how the antibiotics fund\ncan be financed.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jul 2020 16:00:13 GMT"}], "update_date": "2020-07-14", "authors_parsed": [["Böttcher", "Lucas", ""], ["Gersbach", "Hans", ""]]}, {"id": "2007.06535", "submitter": "Shahzada Mushtaq Mr.", "authors": "Shahzada Aamir Mushtaq, Wang Yuhui", "title": "The New Digital Platforms: Merger Control in Pakistan", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Pakistan competition policy, as in many other countries, was originally\ndesigned to regulate business conduct in traditional markets and for tangible\ngoods and services. However, the development and proliferation of the internet\nhas led to the emergence of digital companies which have disrupted many sectors\nof the economy. These platforms provide digital infrastructure for a range of\nservices including search engines, marketplaces, and social networking sites.\nThe digital economy poses a myriad of challenges for competition authorities\nworldwide, especially with regard to digital mergers and acquisitions (M&As).\nWhile some jurisdictions such as the European Union and the United States have\ntaken significant strides in regulating technological M&As, there is an\nincreasing need for developing countries such as Pakistan to rethink their\ncompetition policy tools. This paper investigates whether merger reviews in the\nPakistan digital market are informed by the same explanatory variables as in\nthe traditional market, by performing an empirical comparative analysis of the\nCompetition Commission of Pakistan's (CCP's) M&A decisions between 2014 and\n2019. The findings indicate the CCP applies the same decision factors in\nreviewing both traditional and digital M&As. As such, this paper establishes a\nbasis for igniting the policy and economic debate of regulating the digital\nplatform industry in Pakistan.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2020 12:06:46 GMT"}], "update_date": "2020-07-14", "authors_parsed": [["Mushtaq", "Shahzada Aamir", ""], ["Yuhui", "Wang", ""]]}, {"id": "2007.06994", "submitter": "Mohammad Arshad Rahman", "authors": "Manini Ojha and Mohammad Arshad Rahman", "title": "Do Online Courses Provide an Equal Educational Value Compared to\n  In-Person Classroom Teaching? Evidence from US Survey Data using Quantile\n  Regression", "comments": "20 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Education has traditionally been classroom-oriented with a gradual growth of\nonline courses in recent times. However, the outbreak of the COVID-19 pandemic\nhas dramatically accelerated the shift to online classes. Associated with this\nlearning format is the question: what do people think about the educational\nvalue of an online course compared to a course taken in-person in a classroom?\nThis paper addresses the question and presents a Bayesian quantile analysis of\npublic opinion using a nationally representative survey data from the United\nStates. Our findings show that previous participation in online courses and\nfull-time employment status favor the educational value of online courses. We\nalso find that the older demographic and females have a greater propensity for\nonline education. In contrast, highly educated individuals have a lower\nwillingness towards online education vis-\\`a-vis traditional classes. Besides,\ncovariate effects show heterogeneity across quantiles which cannot be captured\nusing probit or logit models.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jul 2020 12:23:18 GMT"}], "update_date": "2020-07-15", "authors_parsed": [["Ojha", "Manini", ""], ["Rahman", "Mohammad Arshad", ""]]}, {"id": "2007.07353", "submitter": "Ignacio Escanuela Romana", "authors": "Ignacio Escanuela Romana", "title": "Keynesian models of depression. Supply shocks and the COVID-19 Crisis", "comments": "The last sentence has been deleted (\"a possible critical\n  quasi-experiment\")", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective of this work is twofold: to expand the depression models\nproposed by Tobin and analyse a supply shock, such as the Covid-19 pandemic, in\nthis Keynesian conceptual environment. The expansion allows us to propose the\nevolution of all endogenous macroeconomic variables. The result obtained is\nrelevant due to its theoretical and practical implications. A quantity or\nKeynesian adjustment to the shock produces a depression through the effect on\naggregate demand. This depression worsens in the medium/long-term. It is\naccompanied by increases in inflation, inflation expectations and the real\ninterest rate. A stimulus tax policy is also recommended, as well as an active\nmonetary policy to reduce real interest rates. On the other hand, the pricing\nor Marshallian adjustment foresees a more severe and rapid depression in the\nshort-term. There would be a reduction in inflation and inflation expectations,\nand an increase in the real interest rates. The tax or monetary stimulus\nmeasures would only impact inflation. This result makes it possible to clarify\nand assess the resulting depression, as well as propose policies. Finally, it\noffers conflicting predictions that allow one of the two models to be\nfalsified.\n", "versions": [{"version": "v1", "created": "Sat, 11 Jul 2020 18:08:10 GMT"}, {"version": "v2", "created": "Fri, 17 Jul 2020 06:26:36 GMT"}], "update_date": "2020-07-20", "authors_parsed": [["Romana", "Ignacio Escanuela", ""]]}, {"id": "2007.07839", "submitter": "Ugur Korkut Pata", "authors": "Ugur Korkut Pata", "title": "COVID-19 Induced Economic Uncertainty: A Comparison between the United\n  Kingdom and the United States", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN physics.soc-ph q-fin.EC stat.ME", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The purpose of this study is to investigate the effects of the COVID-19\npandemic on economic policy uncertainty in the US and the UK. The impact of the\nincrease in COVID-19 cases and deaths in the country, and the increase in the\nnumber of cases and deaths outside the country may vary. To examine this, the\nstudy employs bootstrap ARDL cointegration approach from March 8, 2020 to May\n24, 2020. According to the bootstrap ARDL results, a long-run equilibrium\nrelationship is confirmed for five out of the 10 models. The long-term\ncoefficients obtained from the ARDL models suggest that an increase in COVID-19\ncases and deaths outside of the UK and the US has a significant effect on\neconomic policy uncertainty. The US is more affected by the increase in the\nnumber of COVID-19 cases. The UK, on the other hand, is more negatively\naffected by the increase in the number of COVID-19 deaths outside the country\nthan the increase in the number of cases. Moreover, another important finding\nfrom the study demonstrates that COVID-19 is a factor of great uncertainty for\nboth countries in the short-term.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2020 00:22:07 GMT"}], "update_date": "2020-07-16", "authors_parsed": [["Pata", "Ugur Korkut", ""]]}, {"id": "2007.07963", "submitter": "Keisuke Kokubun", "authors": "Keisuke Kokubun, Yoshiaki Ino, Kazuyoshi Ishimura", "title": "Social capital and resilience make an employee cooperate for coronavirus\n  measures and lower his/her turnover intention", "comments": "amendment in Table 1", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important theme is how to maximize the cooperation of employees when\ndealing with crisis measures taken by the company. Therefore, to find out what\nkind of employees have cooperated with the company's measures in the current\ncorona (COVID-19) crisis, and what effect the cooperation has had to these\nemployees/companies to get hints for preparing for the next crisis, the pass\nanalysis was carried out using awareness data obtained from a questionnaire\nsurvey conducted on 2,973 employees of Japanese companies in China. The results\nshowed that employees with higher social capital and resilience were more\nsupportive of the company's measures against corona and that employees who were\nmore supportive of corona measures were less likely to leave their jobs.\nHowever, regarding fatigue and anxiety about the corona felt by employees, it\nwas shown that it not only works to support cooperation in corona\ncountermeasures but also enhances the turnover intention. This means that just\nby raising the anxiety of employees, even if a company achieves the short-term\ngoal of having them cooperate with the company's countermeasures against\ncorona, it may not reach the longer-term goal by making them increase their\nintention to leave. It is important for employees to be aware of the crisis and\nto fear it properly. But more than that, it should be possible for the company\nto help employees stay resilient, build good relationships with them, and\nincrease their social capital to make them support crisis measurement of the\ncompany most effectively while keeping their turnover intention low.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jul 2020 19:36:51 GMT"}, {"version": "v2", "created": "Sun, 19 Jul 2020 12:57:35 GMT"}, {"version": "v3", "created": "Thu, 23 Jul 2020 14:24:20 GMT"}], "update_date": "2020-07-24", "authors_parsed": [["Kokubun", "Keisuke", ""], ["Ino", "Yoshiaki", ""], ["Ishimura", "Kazuyoshi", ""]]}, {"id": "2007.08523", "submitter": "Paolo Pin", "authors": "Matteo Bizzarri, Fabrizio Panebianco, Paolo Pin", "title": "Epidemic dynamics with homophily, vaccination choices, and pseudoscience\n  attitudes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE econ.GN physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We interpret attitudes towards science and pseudosciences as cultural traits\nthat diffuse in society through communication efforts exerted by agents. We\npresent a tractable model that allows us to study the interaction among the\ndiffusion of an epidemic, vaccination choices, and the dynamics of cultural\ntraits. We apply it to study the impact of homophily between pro-vaxxers and\nanti-vaxxers on the total number of cases (the cumulative infection). We show\nthat, during the outbreak of a disease, homophily has the direct effect of\ndecreasing the speed of recovery. Hence, it may increase the number of cases\nand make the disease endemic. The dynamics of the shares of the two cultural\ntraits in the population is crucial in determining the sign of the total effect\non the cumulative infection: more homophily is beneficial if agents are not too\nflexible in changing their cultural trait, is detrimental otherwise.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jul 2020 09:23:02 GMT"}, {"version": "v2", "created": "Fri, 18 Sep 2020 08:56:06 GMT"}, {"version": "v3", "created": "Fri, 11 Jun 2021 08:04:31 GMT"}], "update_date": "2021-06-14", "authors_parsed": [["Bizzarri", "Matteo", ""], ["Panebianco", "Fabrizio", ""], ["Pin", "Paolo", ""]]}, {"id": "2007.09230", "submitter": "Daniel Mendoza", "authors": "Daniel L. Mendoza (1 and 2), Cheryl S. Pirozzi (1), Erik T. Crosman\n  (3), Theodore G. Liou (1 and 4), Yue Zhang (5), Jessica J. Cleeves (6),\n  Stephen C. Bannister (7), William R.L. Anderegg (8), Robert Paine III (1)\n  ((1) Division of Respiratory, Critical Care and Occupational Pulmonary\n  Medicine, School of Medicine, University of Utah, (2) Department of\n  Atmospheric Sciences, University of Utah, (3) Department of Life, Earth, and\n  Environmental Sciences, West Texas A&M University, (4) Center for\n  Quantitative Biology, University of Utah, (5) Division of Epidemiology,\n  Department of Internal Medicine, University of Utah School of Medicine, (6)\n  Center for Science and Mathematics Education, University of Utah, (7)\n  Department of Economics, University of Utah, (8) School of Biological\n  Sciences, University of Utah)", "title": "Absentee and Economic Impact of Low-Level Fine Particulate Matter and\n  Ozone Exposure in K-12 Students", "comments": "31 pages, 11 figures, 2 tables", "journal-ref": null, "doi": "10.13140/RG.2.2.12720.17925", "report-no": null, "categories": "econ.GN cs.CY q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High air pollution levels are associated with school absences. However, low\nlevel pollution impact on individual school absences are under-studied. We\nmodelled PM2.5 and ozone concentrations at 36 schools from July 2015 to June\n2018 using data from a dense, research grade regulatory sensor network. We\ndetermined exposures and daily absences at each school. We used generalized\nestimating equations model to retrospectively estimate rate ratios for\nassociation between outdoor pollutant concentrations and school absences. We\nestimated lost school revenue, productivity, and family economic burden. PM2.5\nand ozone concentrations and absence rates vary across the School District.\nPollution exposure were associated with as high a rate ratio of 1.02 absences\nper ug/m$^3$ and 1.01 per ppb increase for PM2.5 and ozone, respectively.\nSignificantly, even PM2.5 and ozone exposure below regulatory standards (<12.1\nug/m$^3$ and <55 ppb) was associated with positive rate ratios of absences:\n1.04 per ug/m$^3$ and 1.01 per ppb increase, respectively. Granular local\nmeasurements enabled demonstration of air pollution impacts that varied between\nschools undetectable with averaged pollution levels. Reducing pollution by 50%\nwould save $452,000 per year districtwide. Pollution reduction benefits would\nbe greatest in schools located in socioeconomically disadvantaged areas.\nExposures to air pollution, even at low levels, are associated with increased\nschool absences. Heterogeneity in exposure, disproportionately affecting\nsocioeconomically disadvantaged schools, points to the need for fine resolution\nexposure estimation. The economic cost of absences associated with air\npollution is substantial even excluding indirect costs such as hospital visits\nand medication. These findings may help inform decisions about recess during\nsevere pollution events and regulatory considerations for localized pollution\nsources.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jul 2020 01:27:27 GMT"}], "update_date": "2020-07-21", "authors_parsed": [["Mendoza", "Daniel L.", "", "1 and 2"], ["Pirozzi", "Cheryl S.", "", "1 and 4"], ["Crosman", "Erik T.", "", "1 and 4"], ["Liou", "Theodore G.", "", "1 and 4"], ["Zhang", "Yue", ""], ["Cleeves", "Jessica J.", ""], ["Bannister", "Stephen C.", ""], ["Anderegg", "William R. L.", ""], ["Paine", "Robert", "III"]]}, {"id": "2007.09566", "submitter": "Anup Malani", "authors": "Mudit Kapoor, Anup Malani, Shamika Ravi, Arnav Agrawal", "title": "Authoritarian Governments Appear to Manipulate COVID Data", "comments": "23 pages (including 5 figures and 3 tables)", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Because SARS-Cov-2 (COVID-19) statistics affect economic policies and\npolitical outcomes, governments have an incentive to control them. Manipulation\nmay be less likely in democracies, which have checks to ensure transparency. We\nshow that data on disease burden bear indicia of data modification by\nauthoritarian governments relative to democratic governments. First, data on\nCOVID-19 cases and deaths from authoritarian governments show significantly\nless variation from a 7 day moving average. Because governments have no reason\nto add noise to data, lower deviation is evidence that data may be massaged.\nSecond, data on COVID-19 deaths from authoritarian governments do not follow\nBenford's law, which describes the distribution of leading digits of numbers.\nDeviations from this law are used to test for accounting fraud. Smoothing and\nadjustments to COVID-19 data may indicate other alterations to these data and a\nneed to account for such alterations when tracking the disease.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jul 2020 02:54:01 GMT"}], "update_date": "2020-07-21", "authors_parsed": [["Kapoor", "Mudit", ""], ["Malani", "Anup", ""], ["Ravi", "Shamika", ""], ["Agrawal", "Arnav", ""]]}, {"id": "2007.09939", "submitter": "Keisuke Kokubun", "authors": "Keisuke Kokubun", "title": "Social capital may mediate the relationship between social distance and\n  COVID-19 prevalence", "comments": "amendments in references", "journal-ref": "INQUIRY, Vol. 58 (2021) 1-11", "doi": "10.1177/00469580211005189", "report-no": null, "categories": "econ.GN physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The threat of the new coronavirus (COVID-19) is increasing. Regarding the\ndifference in the infection rate observed in each region, in addition to\nstudies seeking the cause due to differences in the social distance (population\ndensity), there is an increasing trend toward studies seeking the cause due to\ndifferences in social capital. However, studies have not yet been conducted on\nwhether social capital could influence the infection rate even if it controls\nthe effect of population density. Therefore, in this paper, we analyzed the\nrelationship between infection rate, population density, and social capital\nusing statistical data for each prefecture. Statistical analysis showed that\nsocial capital not only correlates with infection rates and population\ndensities but still has a negative correlation with infection rates controlling\nfor the effects of population density. Besides, controlling the relationship\nbetween variables by mean age showed that social capital had a greater\ncorrelation with infection rate than population density. In other words, social\ncapital mediates the correlation between population density and infection\nrates. This means that social distance alone is not enough to deter coronavirus\ninfection, and social capital needs to be recharged.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 08:36:30 GMT"}, {"version": "v2", "created": "Tue, 21 Jul 2020 14:23:56 GMT"}], "update_date": "2021-07-23", "authors_parsed": [["Kokubun", "Keisuke", ""]]}, {"id": "2007.10268", "submitter": "David Roodman", "authors": "David Roodman", "title": "The impacts of incarceration on crime", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper reviews the research on the impacts of incarceration on crime.\nWhere data availability permits, reviewed studies are replicated and\nreanalyzed. Among three dozen studies I reviewed, I obtained or reconstructed\nthe data and code for eight. Replication and reanalysis revealed significant\nmethodological concerns in seven and led to major reinterpretations of four. I\nestimate that, at typical policy margins in the United States today,\ndecarceration has zero net impact on crime outside of prison. That estimate is\nuncertain, but at least as much evidence suggests that decarceration reduces\ncrime as increases it. The crux of the matter is that tougher sentences hardly\ndeter crime, and that while imprisoning people temporarily stops them from\ncommitting crime outside prison walls, it also tends to increase their\ncriminality after release. As a result, \"tough-on-crime\" initiatives can reduce\ncrime in the short run but cause offsetting harm in the long run. A\ncost-benefit analysis finds that even under a devil's advocate reading of this\nevidence, in which incarceration does reduce crime in U.S., it is unlikely to\nincrease aggregate welfare.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jul 2020 00:28:02 GMT"}], "update_date": "2020-07-21", "authors_parsed": [["Roodman", "David", ""]]}, {"id": "2007.10269", "submitter": "David Roodman", "authors": "David Roodman", "title": "The domestic economic impacts of immigration", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper critically reviews the research on the impact of immigration on\nemployment and wages of natives in wealthy countries--where \"natives\" includes\nprevious immigrants and their descendants. While written for a non-technical\naudience, the paper engages with technical issues and probes one particularly\nintense scholarly debate in an appendix. While the available evidence is not\ndefinitive, it paints a consistent picture. Industrial economies can generally\nabsorb migrants quickly, in part because capital is mobile and flexible, in\npart because immigrants are consumers as well as producers. Thus, long-term\naverage impacts are probably zero at worst. And the long-term may come quickly,\nespecially if migration inflows are predictable to investors. Possibly, skilled\nimmigration boosts productivity and wages for many others. Around the averages,\nthere are distributional effects. Among low-income \"native\" workers, the ones\nwho stand to lose the most are those who most closely resemble new arrivals, in\nbeing immigrants themselves, being low-skill, being less assimilated, and,\npotentially, undocumented. But native workers and earlier immigrants tend to\nbenefit from the arrival of workers different from them, who complement more\nthan compete with them in production. Thus skilled immigration can offset the\neffects of low-skill immigration on natives and earlier immigrants.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jul 2020 00:36:24 GMT"}], "update_date": "2020-07-21", "authors_parsed": [["Roodman", "David", ""]]}, {"id": "2007.10270", "submitter": "David Roodman", "authors": "David Roodman", "title": "The impacts of alcohol taxes: A replication review", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper reviews the research on the impacts of alcohol taxation outcomes\nsuch as heavy drinking and mortality. Where data availability permits, reviewed\nstudies are replicated and reanalyzed. Despite weaknesses in the majority of\nstudies, and despite seeming disagreements among the more credible one--ones\nbased on natural experiments--we can be reasonably confident that taxing\nalcohol reduces drinking in general and problem drinking in particular. The\nlarger and cleaner the underlying natural experiment, the more apt a study is\nto detect impacts on drinking. Estimates from the highest-powered study\nsettings, such as in Alaska in 2002 and Finland in 2004, suggest an elasticity\nof mortality with respect to price of -1 to -3. A 10% price increase in the US\nwould, according to this estimate, save 2,000-6,000 lives and 48,000-130,000\nyears of life each year.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jul 2020 00:40:48 GMT"}], "update_date": "2020-07-21", "authors_parsed": [["Roodman", "David", ""]]}, {"id": "2007.10415", "submitter": "Ariel Ortiz-Bobea", "authors": "Ariel Ortiz-Bobea, Toby R. Ault, Carlos M. Carrillo, Robert G.\n  Chambers and David B. Lobell", "title": "The Historical Impact of Anthropogenic Climate Change on Global\n  Agricultural Productivity", "comments": "paper (14 pages; 5 figures) and supplemental materials (24 pages; 14\n  figures and 4 tables)", "journal-ref": "Nat. Clim. Chang. 11, 306-312 (2021)", "doi": "10.1038/s41558-021-01000-1", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Agricultural research has fostered productivity growth, but the historical\ninfluence of anthropogenic climate change on that growth has not been\nquantified. We develop a robust econometric model of weather effects on global\nagricultural total factor productivity (TFP) and combine this model with\ncounterfactual climate scenarios to evaluate impacts of past climate trends on\nTFP. Our baseline model indicates that anthropogenic climate change has reduced\nglobal agricultural TFP by about 21% since 1961, a slowdown that is equivalent\nto losing the last 9 years of productivity growth. The effect is substantially\nmore severe (a reduction of ~30-33%) in warmer regions such as Africa and Latin\nAmerica and the Caribbean. We also find that global agriculture has grown more\nvulnerable to ongoing climate change.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 19:05:29 GMT"}, {"version": "v2", "created": "Fri, 2 Apr 2021 16:25:36 GMT"}], "update_date": "2021-04-05", "authors_parsed": [["Ortiz-Bobea", "Ariel", ""], ["Ault", "Toby R.", ""], ["Carrillo", "Carlos M.", ""], ["Chambers", "Robert G.", ""], ["Lobell", "David B.", ""]]}, {"id": "2007.10564", "submitter": "Peng-Fei Dai", "authors": "Jiqiang Wang, Jianfeng Guo, Peng-Fei Dai, Yinpeng Liu, Ying Fan", "title": "The risk spillover from economic policy uncertainties to the European\n  Union Emission Trading Scheme", "comments": "16 pages, 3 figures, 7 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN econ.EM q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The European Union Emission Trading Scheme is a carbon emission allowance\ntrading system designed by Europe to achieve emission reduction targets. The\namount of carbon emission caused by production activities is closely related to\nthe socio-economic environment. Therefore, from the perspective of economic\npolicy uncertainty, this article constructs the GARCH-MIDAS-EUEPU and\nGARCH-MIDAS-GEPU models for the impact of European and global economic policy\nuncertainty on carbon price fluctuations. The results show that both European\nand global economic policy uncertainty will exacerbate the volatility of carbon\nprice returns, with the latter having a stronger impact. Moreover, the\nvolatility of carbon price returns can be forecasted better with the predictor\nof global economic policy uncertainty. This research can provide some\nimplications for market managers in grasping market trends and helping\nparticipants control the risk of fluctuations in carbon allowances.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jul 2020 02:17:03 GMT"}], "update_date": "2020-07-22", "authors_parsed": [["Wang", "Jiqiang", ""], ["Guo", "Jianfeng", ""], ["Dai", "Peng-Fei", ""], ["Liu", "Yinpeng", ""], ["Fan", "Ying", ""]]}, {"id": "2007.11388", "submitter": "David Roodman", "authors": "David Roodman", "title": "The impact of life-saving interventions on fertility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Many interventions in global health save lives. One criticism sometimes\nlobbed at these interventions invokes the spirit of Malthus. The good done, the\ncharge goes, is offset by the harm of spreading the earth's limited resources\nmore thinly: more people, and more misery per person. To the extent this holds,\nthe net benefit of savings lives is lower than it appears at first. On the\nother hand, if lower mortality, especially in childhood, leads families to have\nfewer children, life-saving interventions could reduce population. This\ndocument critically reviews the evidence. It finds that the impact of\nlife-saving interventions on fertility and population growth varies by context,\nand is rarely greater than 1:1. In places where lifetime births/woman has been\nconverging to 2 or lower, saving one child's life should lead parents to avert\na birth they would otherwise have. The impact of mortality drops on fertility\nwill be nearly 1:1, so population growth will hardly change. In the\nincreasingly exceptional locales where couples appear not to limit fertility\nmuch, such as Niger and Mali, the impact of saving a life on total births will\nbe smaller, and may come about mainly through the biological channel of\nlactational amenorrhea. Here, mortality-drop-fertility-drop ratios of 1:0.5 and\n1:0.33 appear more plausible. But in the long-term, it would be surprising if\nthese few countries do not join the rest of the world in the transition to\nlower and more intentionally controlled fertility.\n", "versions": [{"version": "v1", "created": "Thu, 16 Jul 2020 00:45:00 GMT"}], "update_date": "2020-07-23", "authors_parsed": [["Roodman", "David", ""]]}, {"id": "2007.11407", "submitter": "Ionut Jianu Dr", "authors": "Ionut Jianu", "title": "Examining the drivers of business cycle divergence between Euro Area and\n  Romania", "comments": "14 pages", "journal-ref": "Theoretical and Applied Economics, Vol. 27 (2020), No. 2", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This research aims to provide an explanatory analyses of the business cycles\ndivergence between Euro Area and Romania, respectively its drivers, since the\nsynchronisation of output-gaps is one of the most important topic in the\ncontext of a potential EMU accession. According to the estimates, output-gaps\nsynchronisation entered on a downward path in the subperiod 2010-2017, compared\nto 2002-2009. The paper demonstrates there is a negative relationship between\nbusiness cycles divergence and three factors (economic structure convergence,\nwage structure convergence and economic openness), but also a positive\nrelationship between it and its autoregressive term, respectively the GDP per\ncapita convergence.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 14:45:41 GMT"}], "update_date": "2020-07-23", "authors_parsed": [["Jianu", "Ionut", ""]]}, {"id": "2007.11408", "submitter": "Ionut Jianu Dr", "authors": "Ionut Jianu", "title": "The impact of private sector credit on income inequalities in European\n  Union (15 member states)", "comments": "14 pages", "journal-ref": "Theoretical and Applied Economics, Vol. 24 (2017), No. 2", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper aims to provide a comprehensive analysis on the income\ninequalities recorded in the EU-15 in the 1995-2014 period and to estimate the\nimpact of private sector credit on income disparities. In order to estimate the\nimpact, I used the panel data technique with 15 cross-sections for the first 15\nMember States of the European Union, applying generalized error correction\nmodel.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 14:49:22 GMT"}], "update_date": "2020-07-23", "authors_parsed": [["Jianu", "Ionut", ""]]}, {"id": "2007.11409", "submitter": "Ionut Jianu Dr", "authors": "Ionut Jianu", "title": "The impact of government health and education expenditure on income\n  inequality in European Union", "comments": "15 pages", "journal-ref": "Theoretical and Applied Economics, Special Issue, 2018", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This research aims to provide an overview of the existing inequalities and\ntheir drivers in the member states of the European Union as well as their\ndevelopements in the 2002-2008 and 2009- 2015 sub-periods. It also analyses the\nimpact of health and education government spending on income inequality in the\nEuropean Union over the 2002-2015 period. In this context, I applied the\nEstimated Generalized Least Squares method using panel data for the 28-member\nstates of the European Union.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 14:53:35 GMT"}], "update_date": "2020-07-23", "authors_parsed": [["Jianu", "Ionut", ""]]}, {"id": "2007.11435", "submitter": "Ionut Jianu Dr", "authors": "Ionut Jianu", "title": "The Effect of Young People Not In Employment, Education or Training, On\n  Poverty Rate in European Union", "comments": "14 pages", "journal-ref": "Journal of Eastern Europe Research in Business and Economics, Vol.\n  2019, Article ID 955941", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper aims to estimate the effect of young people who are not in\nemployment, education or training (neets rate) on the people at risk of poverty\nrate in the European Union. Statistical data covering the 2010-2016 period for\nall EU-28 Member States have been used. Regarding the methodology, the study\nwas performed by using Panel Estimated Generalized Least Squares method,\nweighted by Period SUR option. The effect of neets rate on poverty rate proved\nto be positive and statistically significant in European Union, since this\nindicator includes two main areas which are extremely relevant for poverty\ndimension. Firstly, young unemployment rate was one of the main channels\nthrough which the financial crisis has affected the population income.\nSecondly, it accounts for the educational system coverage and its skills\ndeficiencies.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 14:24:36 GMT"}], "update_date": "2020-07-23", "authors_parsed": [["Jianu", "Ionut", ""]]}, {"id": "2007.11436", "submitter": "Ionut Jianu Dr", "authors": "Ionut Jianu, Ion Dobre, Dumitru Alexandru Bodislav, Carmen Valentina\n  Radulescu, Sorin Burlacu", "title": "The implications of institutional specificities on the income\n  inequalities drivers in European Union", "comments": "18 pages", "journal-ref": "Economic Computation and Economic Cybernetics Studies and\n  Research, Vol. 53, No. 2 / 2019", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper aims to review the different impacts of income inequality drivers\non the Gini coefficient, depending on institutional specificities. In this\ncontext, we divided the European Union member states in two clusters (the\ncluster of member states with inclusive institutions / extractive institutions)\nusing the institutional pillar as a clustering criterion. In both cases, we\nassesed the impact of income inequality drivers on Gini coefficient by using a\nfixed effects model in order to examine the role and importance of the\ninstitutions in the dynamics of income disparities.The models were estimated by\napplying the Panel Estimated Generalized Least Squares (EGLS) method, this\nbeing weighted by Cross-section weights option. The separate assessment of the\nincome inequality reactivity to the change in its determinants according to the\ninstitutional criterion represents a new approach in this field of research and\nthe results show that the impact of moderating income inequality strategies is\nlimitedin the case of member states with extractive institutions.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 14:37:22 GMT"}], "update_date": "2020-07-23", "authors_parsed": [["Jianu", "Ionut", ""], ["Dobre", "Ion", ""], ["Bodislav", "Dumitru Alexandru", ""], ["Radulescu", "Carmen Valentina", ""], ["Burlacu", "Sorin", ""]]}, {"id": "2007.11439", "submitter": "Ionut Jianu Dr", "authors": "Ionut Jianu", "title": "A comprehensive view of the manifestations of aggregate demand and\n  aggregate supply shocks in Greece, Ireland, Italy and Portugal", "comments": "18 pages", "journal-ref": "Theoretical and Applied Economics, Vol. 23 (2016), No. 2", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The main goal of the paper is to extract the aggregate demand and aggregate\nsupply shocks in Greece, Ireland, Italy and Portugal, as well as to examine the\ncorrelation among the two types of shocks. The decomposition of the shocks was\nachieved by using a structural vector autoregression that analyses the\nrelationship between the evolution of the gross domestic product and inflation\nin the period 1997-2015. The goal of the paper is to confirm the aggregate\ndemand - aggregate supply model in the above-mentioned economies.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 14:42:51 GMT"}], "update_date": "2020-07-23", "authors_parsed": [["Jianu", "Ionut", ""]]}, {"id": "2007.11580", "submitter": "Thanasis Ziogas M.Sc.", "authors": "Thanasis Ziogas, Dimitris Ballas, Sierdjan Koster, Arjen Edzes", "title": "How happy are my neighbours? Modelling spatial spillover effects of\n  well-being", "comments": "45 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article uses data of subjective Life Satisfaction aggregated to the\ncommunity level in Canada and examines the spatial interdependencies and\nspatial spillovers of community happiness. A theoretical model of utility is\npresented. Using spatial econometric techniques, we find that the utility of\ncommunity, proxied by subjective measures of life satisfaction, is affected\nboth by the utility of neighbouring communities as well as by the latter's\naverage household income and unemployment rate. Shared cultural traits and\ninstitutions may justify such spillovers. The results are robust to the\ndifferent binary contiguity spatial weights matrices used and to the various\neconometric models. Clusters of both high-high and low-low in Life Satisfaction\ncommunities are also found based on the Moran's I test\n", "versions": [{"version": "v1", "created": "Wed, 22 Jul 2020 11:24:09 GMT"}], "update_date": "2020-07-24", "authors_parsed": [["Ziogas", "Thanasis", ""], ["Ballas", "Dimitris", ""], ["Koster", "Sierdjan", ""], ["Edzes", "Arjen", ""]]}, {"id": "2007.11789", "submitter": "M. Keith Chen", "authors": "M. Keith Chen, Judith A. Chevalier, and Elisa F. Long", "title": "Nursing Home Staff Networks and COVID-19", "comments": "22 pages, 2 figures. This working paper updated July 22nd, 2020. For\n  the most recent version, see\n  https://www.anderson.ucla.edu/faculty_pages/keith.chen/papers/WP_Nursing_Home_Networks_and_COVID19.pdf", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN physics.soc-ph q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Nursing homes and other long term-care facilities account for a\ndisproportionate share of COVID-19 cases and fatalities worldwide. Outbreaks in\nU.S. nursing homes have persisted despite nationwide visitor restrictions\nbeginning in mid-March. An early report issued by the Centers for Disease\nControl and Prevention identified staff members working in multiple nursing\nhomes as a likely source of spread from the Life Care Center in Kirkland,\nWashington to other skilled nursing facilities. The full extent of staff\nconnections between nursing homes---and the crucial role these connections\nserve in spreading a highly contagious respiratory infection---is currently\nunknown given the lack of centralized data on cross-facility nursing home\nemployment. In this paper, we perform the first large-scale analysis of nursing\nhome connections via shared staff using device-level geolocation data from 30\nmillion smartphones, and find that 7 percent of smartphones appearing in a\nnursing home also appeared in at least one other facility---even after visitor\nrestrictions were imposed. We construct network measures of nursing home\nconnectedness and estimate that nursing homes have, on average, connections\nwith 15 other facilities. Controlling for demographic and other factors, a\nhome's staff-network connections and its centrality within the greater network\nstrongly predict COVID-19 cases. Traditional federal regulatory metrics of\nnursing home quality are unimportant in predicting outbreaks, consistent with\nrecent research. Results suggest that eliminating staff linkages between\nnursing homes could reduce COVID-19 infections in nursing homes by 44 percent.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2020 05:04:12 GMT"}, {"version": "v2", "created": "Fri, 24 Jul 2020 06:04:20 GMT"}], "update_date": "2020-07-27", "authors_parsed": [["Chen", "M. Keith", ""], ["Chevalier", "Judith A.", ""], ["Long", "Elisa F.", ""]]}, {"id": "2007.11941", "submitter": "Giuseppe Mangioni", "authors": "Marco Grassia, Giuseppe Mangioni, Stefano Schiavo, Silvio Traverso", "title": "(Unintended) Consequences of export restrictions on medical goods during\n  the Covid-19 pandemic", "comments": "9 pages, 1 figure, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph econ.GN q-fin.EC q-fin.TR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the first half of 2020, several countries have responded to the challenges\nposed by the Covid-19 pandemic by restricting their export of medical supplies.\nSuch measures are meant to increase the domestic availability of critical\ngoods, and are commonly used in times of crisis. Yet, not much is known about\ntheir impact, especially on countries imposing them. Here we show that export\nbans are, by and large, counterproductive. Using a model of shock diffusion\nthrough the network of international trade, we simulate the impact of\nrestrictions under different scenarios. We observe that while they would be\nbeneficial to a country implementing them in isolation, their generalized use\nmakes most countries worse off relative to a no-ban scenario. As a corollary,\nwe estimate that prices increase in many countries imposing the restrictions.\nWe also find that the cost of restraining from export bans is small, even when\nothers continue to implement them. Finally, we document a change in countries'\nposition within the international trade network, suggesting that export bans\nhave geopolitical implications.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2020 11:43:09 GMT"}], "update_date": "2020-07-24", "authors_parsed": [["Grassia", "Marco", ""], ["Mangioni", "Giuseppe", ""], ["Schiavo", "Stefano", ""], ["Traverso", "Silvio", ""]]}, {"id": "2007.11973", "submitter": "Michele Loi Dr.", "authors": "Michele Loi, Eleonora Vigan\\`o, Lonneke van der Plas", "title": "The societal and ethical relevance of computational creativity", "comments": "4 pages, 1 figure, Eleventh International Conference on Computational\n  Creativity, ICCC'20", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we provide a philosophical account of the value of creative\nsystems for individuals and society. We characterize creativity in very broad\nphilosophical terms, encompassing natural, existential, and social creative\nprocesses, such as natural evolution and entrepreneurship, and explain why\ncreativity understood in this way is instrumental for advancing human\nwell-being in the long term. We then explain why current mainstream AI tends to\nbe anti-creative, which means that there are moral costs of employing this type\nof AI in human endeavors, although computational systems that involve\ncreativity are on the rise. In conclusion, there is an argument for ethics to\nbe more hospitable to creativity-enabling AI, which can also be in a trade-off\nwith other values promoted in AI ethics, such as its explainability and\naccuracy.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2020 12:39:10 GMT"}], "update_date": "2020-07-24", "authors_parsed": [["Loi", "Michele", ""], ["Viganò", "Eleonora", ""], ["van der Plas", "Lonneke", ""]]}, {"id": "2007.12007", "submitter": "Ionut Jianu Dr", "authors": "Ionut Jianu", "title": "The Relationship between the Economic and Financial Crises and\n  Unemployment Rate in the European Union -- How Institutions Affected Their\n  Linkage", "comments": null, "journal-ref": "Journal of Eastern Europe Research in Business and Economics, Vol.\n  2019, Article ID 403548", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper aims to estimate the impact of economic and financial crises on\nthe unemployment rate in the European Union, taking also into consideration the\ninstitutional specificities, since unemployment was the main channel through\nwhich the economic and financial crisis influenced the social developments.. In\nthis context, I performed two institutional clusters depending on their\ninclusive or extractive institutional features and, in each cases, I computed\nthe crisis effect on unemployment rate over the 2003-2017 period. Both models\nwere estimated by using Panel Estimated Generalized Least Squares method, and\nare weighted by Period SUR option in order to remove, in advance the possible\ninconveniences of the models. The institutions proved to be a relevant\ncriterion that drives the impact of economic and financial crises on the\nunemployment rate, highlighting that countries with inclusive institutions are\nless vulnerable to economic shocks and are more resilient than countries with\nextractive institutions. The quality of institutions was also found to have a\nsignificant effect on the response of unemployment rate to the dynamic of its\ndrivers.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jul 2020 14:18:56 GMT"}], "update_date": "2020-07-24", "authors_parsed": [["Jianu", "Ionut", ""]]}, {"id": "2007.12177", "submitter": "Dominic Russel", "authors": "Michael Bailey, Drew Johnston, Theresa Kuchler, Dominic Russel, Bogdan\n  State, Johannes Stroebel", "title": "Online Appendix & Additional Results for The Determinants of Social\n  Connectedness in Europe", "comments": "21 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN physics.soc-ph q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this online appendix we provide additional information and analyses to\nsupport \"The Determinants of Social Connectedness in Europe.\" We include a\nnumber of case studies illustrating how language, history, and other factors\nhave shaped European social networks. We also look at the effects of social\nconnectedness. Our results provide empirical support for theoretical models\nthat suggest social networks play an important role in individuals' travel\ndecisions. We study variation in the degree of connectedness of regions to\nother European countries, finding a negative correlation between Euroscepticism\nand greater levels of international connection.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2020 17:05:53 GMT"}], "update_date": "2020-07-27", "authors_parsed": [["Bailey", "Michael", ""], ["Johnston", "Drew", ""], ["Kuchler", "Theresa", ""], ["Russel", "Dominic", ""], ["State", "Bogdan", ""], ["Stroebel", "Johannes", ""]]}, {"id": "2007.12226", "submitter": "Stephan Leitner", "authors": "Stephan Leitner, Bartosz Gula, Dietmar Jannach, Ulrike Krieg-Holz,\n  Friederike Wall", "title": "Understanding the dynamics emerging from infodemics: A call to action\n  for interdisciplinary research", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.SI econ.GN math.DS q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Research on infodemics, i.e., the rapid spread of (mis)information related to\na hazardous event, such as the COVID-19 pandemic, requires the integration of a\nmultiplicity of scientific disciplines. The dynamics emerging from infodemics\nhave the potential to generate complex behavioral patterns. In order to react\nappropriately, it is of ultimate importance for the fields of Business and\nEconomics to understand the dynamics emerging from it. In the short run,\ndynamics might lead to an adaptation in household spending or to a shift in\nbuying behavior towards online providers. In the long run, changes in\ninvestments, consumer behavior, and markets are to be expected. We argue that\nthe dynamics emerge from complex interactions among multiple factors, such as\ninformation and misinformation accessible for individuals and the formation and\nrevision of beliefs. (Mis)information accessible to individuals is, amongst\nothers, affected by algorithms specifically designed to provide personalized\ninformation, while automated fact-checking algorithms can help reduce the\namount of circulating misinformation. The formation and revision of individual\n(and probably false) beliefs and individual fact-checking and interpretation of\ninformation are heavily affected by linguistic patterns inherent to information\nduring pandemics and infodemics and further factors, such as affect, intuition\nand motives. We argue that, in order to get a deep(er) understanding of the\ndynamics emerging from infodemics, the fields of Business and Economics should\nintegrate the perspectives of Computer Science and Information Systems,\n(Computational) Linguistics, and Cognitive Science into the wider context of\neconomic systems (e.g., organizations, markets or industries) and propose a way\nto do so.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2020 19:43:27 GMT"}, {"version": "v2", "created": "Thu, 1 Oct 2020 16:44:25 GMT"}], "update_date": "2020-10-02", "authors_parsed": [["Leitner", "Stephan", ""], ["Gula", "Bartosz", ""], ["Jannach", "Dietmar", ""], ["Krieg-Holz", "Ulrike", ""], ["Wall", "Friederike", ""]]}, {"id": "2007.12255", "submitter": "Carlos Denner dos Santos Jr.", "authors": "Carlos Denner dos Santos, Jessica Alves", "title": "Home Advantage in the Brazilian Elite Football: Verifying managers'\n  capacity to outperform their disadvantage", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Home advantage (HA) in football, soccer is well documented in the literature;\nhowever, the explanation for such phenomenon is yet to be completed, as this\npaper demonstrates that it is possible to overcome such disadvantage through\nmanagerial planning and intervention (tactics), an effect so far absent in the\nliterature. To accomplish that, this study develops an integrative theoretical\nmodel of team performance to explain HA based on prior literature, pushing its\nlimits to unfold the manager role in such a persistent pattern of performance\nin soccer. Data on one decade of the national tournament of Brazil was obtained\nfrom public sources, including information about matches and coaches of all 12\nteams who played these competitions. Our conceptual modeling allows an\nempirical analysis of HA and performance that covers the effects of tactics,\npresence of supporters in matches and team fatigue via logistic regression. The\nresults confirm the HA in the elite division of Brazilian soccer across all\nlevels of comparative technical quality, a new variable introduced to control\nfor a potential technical gap between teams (something that would turn the\nmanagerial influence null). Further analysis provides evidence that highlights\nmanagerial capacity to block the HA effect above and beyond the influences of\nfatigue (distance traveled) and density of people in the matches. This is the\ncase of coaches Abel Braga, Marcelo Fernandes and Roger Machado, who were\ncapable to reverse HA when playing against teams of similar quality. Overall,\nthe home advantage diminishes as the comparative quality increases but\ndisappears only when the two teams are of extremely different technical\nquality.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2020 21:07:02 GMT"}], "update_date": "2020-07-27", "authors_parsed": [["Santos", "Carlos Denner dos", ""], ["Alves", "Jessica", ""]]}, {"id": "2007.12433", "submitter": "Akhamd Muhammadin", "authors": "Akhmad Muhammadin, Rashila Ramli, Syamsul Ridjal, Muhlis Kanto,\n  Syamsul Alam, Hamzah Idris", "title": "Effects of dynamic capability and marketing strategy on the\n  organizational performance of the banking sector in Makassar, Indonesia", "comments": "16 pages, 1 figure, 14 tables", "journal-ref": "Revista ESPACIOS. 41/24(2020)26-41", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The dynamic capability and marketing strategy are challenges to the banking\nsector in Indonesia. This study uses a survey method solving 39 banks in\nMakassar. Data collection was conducted of questionnaires. The results show\nthat, the dynamic capability has a positive yet insignificant impact on the\norganizational performance, the marketing strategy has a positive and\nsignificant effect on organizational performance and, dynamic capability and\nmarketing strategy have a positive and significant effect on the organization's\nperformance in the banking sector in Makassar. Keywords : dynamic capability,\nmarketing strategy, organizational performance, banking\n", "versions": [{"version": "v1", "created": "Fri, 24 Jul 2020 10:02:35 GMT"}], "update_date": "2020-07-27", "authors_parsed": [["Muhammadin", "Akhmad", ""], ["Ramli", "Rashila", ""], ["Ridjal", "Syamsul", ""], ["Kanto", "Muhlis", ""], ["Alam", "Syamsul", ""], ["Idris", "Hamzah", ""]]}, {"id": "2007.12880", "submitter": "Peng-Fei Dai", "authors": "Peng-Fei Dai (TJU), Xiong Xiong (TJU), Wei-Xing Zhou (ECUST)", "title": "Visibility graph analysis of economy policy uncertainty indices", "comments": "9 pages, 13 figures", "journal-ref": "Physica A 0378-4371(2019)", "doi": "10.1016/j.physa.2019.121748", "report-no": null, "categories": "q-fin.ST econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Uncertainty plays an important role in the global economy. In this paper, the\neconomic policy uncertainty (EPU) indices of the United States and China are\nselected as the proxy variable corresponding to the uncertainty of national\neconomic policy. By adopting the visibility graph algorithm, the four economic\npolicy uncertainty indices of the United States and China are mapped into\ncomplex networks, and the topological properties of the corresponding networks\nare studied. The Hurst exponents of all the four indices are within\n$\\left[0.5,1\\right]$, which implies that the economic policy uncertainty is\npersistent. The degree distributions of the EPU networks have power-law tails\nand are thus scale-free. The average clustering coefficients of the four EPU\nnetworks are high and close to each other, while these networks exhibit weak\nassortative mixing. We also find that the EPU network in United States based on\ndaily data shows the small-world feature since the average shortest path length\nincreases logarithmically with the network size such that\n$L\\left(N\\right)=0.626\\ln N+0.405$. Our research highlights the possibility to\nstudy the EPU from the view angle of complex networks.\n", "versions": [{"version": "v1", "created": "Sat, 25 Jul 2020 08:12:17 GMT"}], "update_date": "2020-07-28", "authors_parsed": [["Dai", "Peng-Fei", "", "TJU"], ["Xiong", "Xiong", "", "TJU"], ["Zhou", "Wei-Xing", "", "ECUST"]]}, {"id": "2007.13238", "submitter": "Vadim Karatayev", "authors": "Vadim A. Karatayev, V\\'itor V. Vasconcelos, Anne-Sophie Lafuite, Simon\n  A. Levin, Chris T. Bauch, Madhur Anand", "title": "A well-timed switch from local to global agreements accelerates climate\n  change mitigation", "comments": null, "journal-ref": null, "doi": "10.1038/s41467-021-23056-5", "report-no": null, "categories": "nlin.AO econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent attempts at cooperating on climate change mitigation highlight the\nlimited efficacy of large-scale agreements, when commitment to mitigation is\ncostly and initially rare. Bottom-up approaches using region-specific\nmitigation agreements promise greater success, at the cost of slowing global\nadoption. Here, we show that a well-timed switch from regional to global\nnegotiations dramatically accelerates climate mitigation compared to using only\nlocal, only global, or both agreement types simultaneously. This highlights the\nscale-specific roles of mitigation incentives: local incentives capitalize on\nregional differences (e.g., where recent disasters incentivize mitigation) by\ncommitting early-adopting regions, after which global agreements draw in\nlate-adopting regions. We conclude that global agreements are key to overcoming\nthe expenses of mitigation and economic rivalry among regions but should be\nattempted once regional agreements are common. Gradually up-scaling efforts\ncould likewise accelerate mitigation at smaller scales, for instance when\ncostly ecosystem restoration initially faces limited public and legislative\nsupport.\n", "versions": [{"version": "v1", "created": "Sun, 26 Jul 2020 23:06:22 GMT"}], "update_date": "2021-06-09", "authors_parsed": [["Karatayev", "Vadim A.", ""], ["Vasconcelos", "Vítor V.", ""], ["Lafuite", "Anne-Sophie", ""], ["Levin", "Simon A.", ""], ["Bauch", "Chris T.", ""], ["Anand", "Madhur", ""]]}, {"id": "2007.13549", "submitter": "Plamen Nikolov", "authors": "Plamen Nikolov, Hongjian Wang, Kevin Acker", "title": "The Wage Premium of Communist Party Membership: Evidence from China", "comments": "arXiv admin note: text overlap with arXiv:1010.5586 by other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social status and political connections could confer large economic benefits\nto an individual. Previous studies focused on China examine the relationship\nbetween Communist party membership and earnings and find a positive\ncorrelation. However, this correlation may be partly or totally spurious,\nthereby generating upwards-biased estimates of the importance of political\nparty membership. Using data from three surveys spanning more than three\ndecades, we estimate the causal effect of Chinese party membership on monthly\nearnings in in China. We find that, on average, membership in the Communist\nparty of China increases monthly earnings and we find evidence that the wage\npremium has grown in recent years. We explore for potential mechanisms and we\nfind suggestive evidence that improvements in one's social network, acquisition\nof job-related qualifications and improvement in one's social rank and life\nsatisfaction likely play an important role. (JEL D31, J31, P2)\n", "versions": [{"version": "v1", "created": "Thu, 23 Jul 2020 18:35:25 GMT"}], "update_date": "2020-07-28", "authors_parsed": [["Nikolov", "Plamen", ""], ["Wang", "Hongjian", ""], ["Acker", "Kevin", ""]]}, {"id": "2007.13823", "submitter": "Kristoffer Persson", "authors": "Kristoffer Persson", "title": "Economic Reality, Economic Media and Individuals' Expectations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper investigates the relationship between economic media sentiment and\nindividuals' expetations and perceptions about economic conditions. We test if\neconomic media sentiment Granger-causes individuals' expectations and opinions\nconcerning economic conditions, controlling for macroeconomic variables. We\ndevelop a measure of economic media sentiment using a supervised machine\nlearning method on a data set of Swedish economic media during the period\n1993-2017. We classify the sentiment of 179,846 media items, stemming from\n1,071 unique media outlets, and use the number of news items with positive and\nnegative sentiment to construct a time series index of economic media\nsentiment. Our results show that this index Granger-causes individuals'\nperception of macroeconomic conditions. This indicates that the way the\neconomic media selects and frames macroeconomic news matters for individuals'\naggregate perception of macroeconomic reality.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jul 2020 19:30:08 GMT"}], "update_date": "2020-07-29", "authors_parsed": [["Persson", "Kristoffer", ""]]}, {"id": "2007.13902", "submitter": "Kirk Bansak", "authors": "Jeremy Ferwerda, Nicholas Adams-Cohen, Kirk Bansak, Jennifer Fei,\n  Duncan Lawrence, Jeremy M. Weinstein, Jens Hainmueller", "title": "Leveraging the Power of Place: A Data-Driven Decision Helper to Improve\n  the Location Decisions of Economic Immigrants", "comments": "51 pages (including appendix), 13 figures. Immigration Policy Lab\n  (IPL) Working Paper Series, Working Paper No. 20-06", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.LG econ.GN q-fin.EC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A growing number of countries have established programs to attract immigrants\nwho can contribute to their economy. Research suggests that an immigrant's\ninitial arrival location plays a key role in shaping their economic success.\nYet immigrants currently lack access to personalized information that would\nhelp them identify optimal destinations. Instead, they often rely on\navailability heuristics, which can lead to the selection of sub-optimal landing\nlocations, lower earnings, elevated outmigration rates, and concentration in\nthe most well-known locations. To address this issue and counteract the effects\nof cognitive biases and limited information, we propose a data-driven decision\nhelper that draws on behavioral insights, administrative data, and machine\nlearning methods to inform immigrants' location decisions. The decision helper\nprovides personalized location recommendations that reflect immigrants'\npreferences as well as data-driven predictions of the locations where they\nmaximize their expected earnings given their profile. We illustrate the\npotential impact of our approach using backtests conducted with administrative\ndata that links landing data of recent economic immigrants from Canada's\nExpress Entry system with their earnings retrieved from tax records.\nSimulations across various scenarios suggest that providing location\nrecommendations to incoming economic immigrants can increase their initial\nearnings and lead to a mild shift away from the most populous landing\ndestinations. Our approach can be implemented within existing institutional\nstructures at minimal cost, and offers governments an opportunity to harness\ntheir administrative data to improve outcomes for economic immigrants.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jul 2020 23:02:11 GMT"}], "update_date": "2020-07-29", "authors_parsed": [["Ferwerda", "Jeremy", ""], ["Adams-Cohen", "Nicholas", ""], ["Bansak", "Kirk", ""], ["Fei", "Jennifer", ""], ["Lawrence", "Duncan", ""], ["Weinstein", "Jeremy M.", ""], ["Hainmueller", "Jens", ""]]}, {"id": "2007.14022", "submitter": "Andreas Tryphonides", "authors": "Andreas Tryphonides", "title": "Heterogeneity and the Dynamic Effects of Aggregate Shocks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using a semi-structural approach, the paper identifies how heterogeneity and\nfinancial frictions affect the transmission of aggregate shocks. Approximating\na heterogeneous agent model around the representative agent allocation can\nsuccessfully trace the aggregate and distributional dynamics and can be\nconsistent with alternative mechanisms. Employing Spanish macroeconomic data as\nwell as firm and household survey data, the paper finds that frictions on both\nconsumption and investment have rich interactions with aggregate shocks. The\nresponse of heterogeneity amplifies or dampens these effects depending on the\ntype of the shock. Both dispersion in consumption shares and the marginal\nrevenue product of firms, as well as the proportion of investment constrained\nfirms are key determinants of the fiscal multiplier.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jul 2020 06:59:29 GMT"}], "update_date": "2020-07-29", "authors_parsed": [["Tryphonides", "Andreas", ""]]}, {"id": "2007.14620", "submitter": "David Lambert", "authors": "Fabio Vanni, David Lambert, and Luigi Palatella", "title": "Epidemic response to physical distancing policies and their impact on\n  the outbreak risk", "comments": "45 pages, 20 figures, Corrected bibliography typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph econ.GN q-bio.PE q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a theoretical framework that highlights the impact of physical\ndistancing variables such as human mobility and physical proximity on the\nevolution of epidemics and, crucially, on the reproduction number. In\nparticular, in response to the coronavirus disease (CoViD-19) pandemic,\ncountries have introduced various levels of 'lockdown' to reduce the number of\nnew infections. Specifically we use a collisional approach to an infection-age\nstructured model described by a renewal equation for the time homogeneous\nevolution of epidemics. As a result, we show how various contributions of the\nlockdown policies, namely physical proximity and human mobility, reduce the\nimpact of SARS-CoV-2 and mitigate the risk of disease resurgence. We check our\ntheoretical framework using real-world data on physical distancing with two\ndifferent data repositories, obtaining consistent results. Finally, we propose\nan equation for the effective reproduction number which takes into account\ntypes of interactions among people, which may help policy makers to improve\nremote-working organizational structure.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jul 2020 06:12:25 GMT"}, {"version": "v2", "created": "Fri, 31 Jul 2020 07:21:03 GMT"}], "update_date": "2020-08-03", "authors_parsed": [["Vanni", "Fabio", ""], ["Lambert", "David", ""], ["Palatella", "Luigi", ""]]}, {"id": "2007.14841", "submitter": "Vadim Balashov", "authors": "Vadim S. Balashov, Yuxing Yan, Xiaodi Zhu", "title": "Who Manipulates Data During Pandemics? Evidence from Newcomb-Benford Law", "comments": "37 pages, 11 tables, 2 Appendices", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use the Newcomb-Benford law to test if countries have manipulated reported\ndata during the COVID-19 pandemic. We find that democratic countries, countries\nwith the higher gross domestic product (GDP) per capita, higher healthcare\nexpenditures, and better universal healthcare coverage are less likely to\ndeviate from the Newcomb-Benford law. The relationship holds for the cumulative\nnumber of reported deaths and total cases but is more pronounced for the death\ntoll. The findings are robust for second-digit tests, for a sub-sample of\ncountries with regional data, and in relation to the previous swine flu (H1N1)\n2009-2010 pandemic. The paper further highlights the importance of independent\nsurveillance data verification projects.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jul 2020 13:58:46 GMT"}, {"version": "v2", "created": "Thu, 24 Dec 2020 18:47:03 GMT"}, {"version": "v3", "created": "Fri, 25 Dec 2020 11:59:48 GMT"}, {"version": "v4", "created": "Wed, 13 Jan 2021 17:15:19 GMT"}], "update_date": "2021-01-14", "authors_parsed": [["Balashov", "Vadim S.", ""], ["Yan", "Yuxing", ""], ["Zhu", "Xiaodi", ""]]}, {"id": "2007.15265", "submitter": "Xiaozhou Wang", "authors": "Xiaojun Chen, Yun Shi, Xiaozhou Wang", "title": "Equilibrium Oil Market Share under the COVID-19 Pandemic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Equilibrium models for energy markets under uncertain demand and supply have\nattracted considerable attentions. This paper focuses on modelling crude oil\nmarket share under the COVID-19 pandemic using two-stage stochastic\nequilibrium. We describe the uncertainties in the demand and supply by random\nvariables and provide two types of production decisions (here-and-now and\nwait-and-see). The here-and-now decision in the first stage does not depend on\nthe outcome of random events to be revealed in the future and the wait-and-see\ndecision in the second stage is allowed to depend on the random events in the\nfuture and adjust the feasibility of the here-and-now decision in rare\nunexpected scenarios such as those observed during the COVID-19 pandemic. We\ndevelop a fast algorithm to find a solution of the two-stage stochastic\nequilibrium. We show the robustness of the two-stage stochastic equilibrium\nmodel for forecasting the oil market share using the real market data from\nJanuary 2019 to May 2020.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jul 2020 07:08:39 GMT"}], "update_date": "2020-07-31", "authors_parsed": [["Chen", "Xiaojun", ""], ["Shi", "Yun", ""], ["Wang", "Xiaozhou", ""]]}, {"id": "2007.15550", "submitter": "Adel Daoud", "authors": "Adel Daoud, Anders Herlitz, and SV Subramanian", "title": "Combining distributive ethics and causal Inference to make trade-offs\n  between austerity and population health", "comments": "Working paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.CY q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The International Monetary Fund (IMF) provides financial assistance to its\nmember-countries in economic turmoil, but requires at the same time that these\ncountries reform their public policies. In several contexts, these reforms are\nat odds with population health. While researchers have empirically analyzed the\nconsequences of these reforms on health, no analysis exist on identifying fair\ntradeoffs between consequences on population health and economic outcomes. Our\narticle analyzes and identifies the principles governing these tradeoffs.\nFirst, this article reviews existing policy-evaluation studies, which show, on\nbalance, that IMF policies frequently cause adverse effects on child health and\nmaterial standards in the pursuit of macroeconmic improvement. Second, this\narticle discusses four theories in distributive ethics (maximization,\negalitarianianism, prioritarianiasm, and sufficientarianism) to identify which\nis the most compatible with the core mission of the IMF, that is, improved\nmacroeconomics (Articles of Agreement) while at the same time balancing\nconsequences on health. Using a distributive-ethics analyses of IMF polices, we\nargue that sufficientarianism is the most compatible theory. Third, this\narticle offer a qualitative rearticulation of the Articles of Agreement, and\nformalize sufficientarian principles in the language of causal inference. We\nalso offer a framework on how to empirically measure, from observational data,\nthe extent that IMF policies trade off fairly between population health and\neconomic outcomes. We conclude with policy recommendations and suggestions for\nfuture research.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jul 2020 15:54:40 GMT"}, {"version": "v2", "created": "Mon, 10 Aug 2020 09:56:33 GMT"}], "update_date": "2020-12-09", "authors_parsed": [["Daoud", "Adel", ""], ["Herlitz", "Anders", ""], ["Subramanian", "SV", ""]]}, {"id": "2007.15704", "submitter": "Maksym Obrizan", "authors": "Tymofii Brik and Maksym Obrizan", "title": "Job market effects of COVID-19 on urban Ukrainian households", "comments": "12 pages, 0 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The employment status of billions of people has been affected by the COVID\nepidemic around the Globe. New evidence is needed on how to mitigate the job\nmarket crisis, but there exists only a handful of studies mostly focusing on\ndeveloped countries. We fill in this gap in the literature by using novel data\nfrom Ukraine, a transition country in Eastern Europe, which enacted strict\nquarantine policies early on. We model four binary outcomes to identify\nrespondents (i) who are not working during quarantine, (ii) those who are more\nlikely to work from home, (iii) respondents who are afraid of losing a job,\nand, finally, (iv) survey participants who have savings for 1 month or less if\nquarantine is further extended. Our findings suggest that respondents employed\nin public administration, programming and IT, as well as highly qualified\nspecialists, were more likely to secure their jobs during the quarantine.\nFemales, better educated respondents, and those who lived in Kyiv were more\nlikely to work remotely. Working in the public sector also made people more\nconfident about their future employment perspectives. Although our findings are\nlimited to urban households only, they provide important early evidence on the\ncorrelates of job market outcomes, expectations, and financial security,\nindicating potential deterioration of socio-economic inequalities.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jul 2020 19:41:57 GMT"}], "update_date": "2020-08-03", "authors_parsed": [["Brik", "Tymofii", ""], ["Obrizan", "Maksym", ""]]}, {"id": "2007.15980", "submitter": "Ale\\v{s} \\v{C}ern\\'y", "authors": "Ale\\v{s} \\v{C}ern\\'y", "title": "The Hansen ratio in mean--variance portfolio theory", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM econ.GN q-fin.EC q-fin.GN q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is shown that the ratio between the mean and the $L^2$-norm leads to a\nparticularly parsimonious description of the mean-variance efficient frontier\nand the dual pricing kernel restrictions known as the Hansen-Jagannathan (HJ)\nbounds. Because this ratio has not appeared in economic theory previously, it\nseems appropriate to name it the Hansen ratio. The initial treatment of the\nmean-variance theory via the Hansen ratio is extended in two directions, to\nmonotone mean-variance preferences and to arbitrary Hilbert space setting. A\nmultiperiod example with IID returns is also discussed.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jul 2020 11:38:07 GMT"}], "update_date": "2020-08-05", "authors_parsed": [["Černý", "Aleš", ""]]}, {"id": "2007.16096", "submitter": "Nassim Nicholas Taleb", "authors": "Nassim Nicholas Taleb, Yaneer Bar-Yam, and Pasquale Cirillo", "title": "On Single Point Forecasts for Fat-Tailed Variables", "comments": "Accepted, International Journal of Forecasting", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph econ.GN q-fin.EC stat.AP stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss common errors and fallacies when using naive \"evidence based\"\nempiricism and point forecasts for fat-tailed variables, as well as the\ninsufficiency of using naive first-order scientific methods for tail risk\nmanagement. We use the COVID-19 pandemic as the background for the discussion\nand as an example of a phenomenon characterized by a multiplicative nature, and\nwhat mitigating policies must result from the statistical properties and\nassociated risks. In doing so, we also respond to the points raised by\nIoannidis et al. (2020).\n", "versions": [{"version": "v1", "created": "Fri, 31 Jul 2020 14:20:16 GMT"}], "update_date": "2020-08-03", "authors_parsed": [["Taleb", "Nassim Nicholas", ""], ["Bar-Yam", "Yaneer", ""], ["Cirillo", "Pasquale", ""]]}]