[{"id": "2102.00197", "submitter": "Nicola Melluso", "authors": "Nicola Melluso, Andrea Bonaccorsi, Filippo Chiarello, Gualtiero\n  Fantoni", "title": "Rapid detection of fast innovation under the pressure of COVID-19", "comments": "Published in PlOs One in 12/31/2020", "journal-ref": "PLOS ONE (2020) 15(12): e0244175", "doi": "10.1371/journal.pone.0244175", "report-no": null, "categories": "cs.IR econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Covid-19 has rapidly redefined the agenda of technological research and\ndevelopment both for academics and practitioners. If the medical scientific\npublication system has promptly reacted to this new situation, other domains,\nparticularly in new technologies, struggle to map what is happening in their\ncontexts. The pandemic has created the need for a rapid detection of\ntechnological convergence phenomena, but at the same time it has made clear\nthat this task is impossible on the basis of traditional patent and publication\nindicators. This paper presents a novel methodology to perform a rapid\ndetection of the fast technological convergence phenomenon that is occurring\nunder the pressure of the Covid-19 pandemic. The fast detection has been\nperformed thanks to the use of a novel source: the online blogging platform\nMedium. We demonstrate that the hybrid structure of this social journalism\nplatform allows a rapid detection of innovation phenomena, unlike other\ntraditional sources. The technological convergence phenomenon has been modelled\nthrough a network-based approach, analysing the differences of networks\ncomputed during two time periods (pre and post COVID-19). The results led us to\ndiscuss the repurposing of technologies regarding \"Remote Control\", \"Remote\nWorking\", \"Health\" and \"Remote Learning\".\n", "versions": [{"version": "v1", "created": "Sat, 30 Jan 2021 09:37:40 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Melluso", "Nicola", ""], ["Bonaccorsi", "Andrea", ""], ["Chiarello", "Filippo", ""], ["Fantoni", "Gualtiero", ""]]}, {"id": "2102.00233", "submitter": "Matheus E. Leusin", "authors": "Matheus E. Leusin, Bjoern Jindra, Daniel S. Hain", "title": "An evolutionary view on the emergence of Artificial Intelligence", "comments": "Keywords: Artificial Intelligence; technological space; evolutionary\n  economic geography; technological relatedness; knowledge complexity", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.AI q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper draws upon the evolutionary concepts of technological relatedness\nand knowledge complexity to enhance our understanding of the long-term\nevolution of Artificial Intelligence (AI). We reveal corresponding patterns in\nthe emergence of AI - globally and in the context of specific geographies of\nthe US, Japan, South Korea, and China. We argue that AI emergence is associated\nwith increasing related variety due to knowledge commonalities as well as\nincreasing complexity. We use patent-based indicators for the period between\n1974-2018 to analyse the evolution of AI's global technological space, to\nidentify its technological core as well as changes to its overall relatedness\nand knowledge complexity. At the national level, we also measure countries'\noverall specialisations against AI-specific ones. At the global level, we find\nincreasing overall relatedness and complexity of AI. However, for the\ntechnological core of AI, which has been stable over time, we find decreasing\nrelated variety and increasing complexity. This evidence points out that AI\ninnovations related to core technologies are becoming increasingly distinct\nfrom each other. At the country level, we find that the US and Japan have been\nincreasing the overall relatedness of their innovations. The opposite is the\ncase for China and South Korea, which we associate with the fact that these\ncountries are overall less technologically developed than the US and Japan.\nFinally, we observe a stable increasing overall complexity for all countries\napart from China, which we explain by the focus of this country in technologies\nnot strongly linked to AI.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jan 2021 14:46:23 GMT"}], "update_date": "2021-02-03", "authors_parsed": [["Leusin", "Matheus E.", ""], ["Jindra", "Bjoern", ""], ["Hain", "Daniel S.", ""]]}, {"id": "2102.00298", "submitter": "Moritz Mueller", "authors": "Stefano Bianchini, Moritz M\\\"uller, Pierre Pelletier, Kevin Wirtz", "title": "Global health science leverages established collaboration network to\n  fight COVID-19", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  How has the science system reacted to the early stages of the COVID-19\npandemic? Here we compare the (growing) international network for coronavirus\nresearch with the broader international health science network. Our findings\nshow that, before the outbreak, coronavirus research realized a relatively\nsmall and rather peculiar niche within the global health sciences. As a\nresponse to the pandemic, the international network for coronavirus research\nexpanded rapidly along the hierarchical structure laid out by the global health\nscience network. Thus, in face of the crisis, the global health science system\nproved to be structurally stable yet versatile in research. The observed\nversatility supports optimistic views on the role of science in meeting future\nchallenges. However, the stability of the global core-periphery structure may\nbe worrying, because it reduces learning opportunities and social capital of\nscientifically peripheral countries -- not only during this pandemic but also\nin its \"normal\" mode of operation.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jan 2021 19:39:35 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Bianchini", "Stefano", ""], ["Müller", "Moritz", ""], ["Pelletier", "Pierre", ""], ["Wirtz", "Kevin", ""]]}, {"id": "2102.00444", "submitter": "Andrew Zeitlin", "authors": "Clare Leaver, Owen Ozier, Pieter Serneels, and Andrew Zeitlin", "title": "Recruitment, effort, and retention effects of performance contracts for\n  civil servants: Experimental evidence from Rwandan primary schools", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper reports on a two-tiered experiment designed to separately identify\nthe selection and effort margins of pay-for-performance (P4P). At the\nrecruitment stage, teacher labor markets were randomly assigned to a\n'pay-for-percentile' or fixed-wage contract. Once recruits were placed, an\nunexpected, incentive-compatible, school-level re-randomization was performed,\nso that some teachers who applied for a fixed-wage contract ended up being paid\nby P4P, and vice versa. By the second year of the study, the within-year effort\neffect of P4P was 0.16 standard deviations of pupil learning, with the total\neffect rising to 0.20 standard deviations after allowing for selection.\n", "versions": [{"version": "v1", "created": "Sun, 31 Jan 2021 13:06:41 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Leaver", "Clare", ""], ["Ozier", "Owen", ""], ["Serneels", "Pieter", ""], ["Zeitlin", "Andrew", ""]]}, {"id": "2102.00447", "submitter": "Anuradha Singh Ms", "authors": "A. Singh, A. Forcina, K. Muniyoor", "title": "Social Mobility in India", "comments": "11 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC stat.AP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Rapid rise in income inequality in India is a serious concern. While the\nemphasis is on inclusive growth, it seems difficult to tackle the problem\nwithout looking at the intricacies of the problem. Social mobility is one such\nimportant tool which helps in reaching the cause of the problem and focuses on\nbringing long term equality in the country. The purpose of this study is to\nexamine the role of social background and education attainment in generating\noccupation mobility in the country. By applying an extended version of the RC\nassociation model to 68th round (2011-12) of the Employment and Unemployment\nSurvey by the National Sample Survey Office of India, we found that the role of\neducation is not important in generating occupation mobility in India, while\nsocial background plays a critical role in determining one's occupation. This\nstudy successfully highlights the strong intergenerational occupation\nimmobility in the country and also the need to focus on education. In this\nregard, further studies are needed to uncover other crucial factors limiting\nthe growth of individuals in the country.\n", "versions": [{"version": "v1", "created": "Sun, 31 Jan 2021 13:18:36 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Singh", "A.", ""], ["Forcina", "A.", ""], ["Muniyoor", "K.", ""]]}, {"id": "2102.00497", "submitter": "Luca Verginer", "authors": "Massimo Riccaboni, Luca Verginer", "title": "The Impact of the COVID-19 Pandemic on Scientific Research in the Life\n  Sciences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The COVID-19 outbreak has posed an unprecedented challenge to humanity and\nscience. On the one side, public and private incentives have been put in place\nto promptly allocate resources toward research areas strictly related to the\nCOVID-19 emergency. But on the flip side, research in many fields not directly\nrelated to the pandemic has lagged behind. In this paper, we assess the impact\nof COVID-19 on world scientific production in the life sciences. We investigate\nhow the usage of medical subject headings (MeSH) has changed following the\noutbreak. We estimate through a difference-in-differences approach the impact\nof COVID-19 on scientific production through PubMed. We find that COVID-related\nresearch topics have risen to prominence, displaced clinical publications,\ndiverted funds away from research areas not directly related to COVID-19 and\nthat the number of publications on clinical trials in unrelated fields has\ncontracted. Our results call for urgent targeted policy interventions to\nreactivate biomedical research in areas that have been neglected by the\nCOVID-19 emergency.\n", "versions": [{"version": "v1", "created": "Sun, 31 Jan 2021 17:32:32 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Riccaboni", "Massimo", ""], ["Verginer", "Luca", ""]]}, {"id": "2102.00587", "submitter": "Hans Lustfeld Dr.", "authors": "Hans Lustfeld", "title": "Controlling volatility of wind-solar power", "comments": "12 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The main advantage of wind and solar power plants is the power production\nfree of CO2. Their main disadvantage is the volatility of the generated power.\nAccording to the estimates of H.-W. Sinn[1], suppressing this volatility\nrequires pumped-storage plants with a huge capacity, several orders of\nmagnitude larger than the present available capacity in Germany[2]. Sinn\nconcluded that wind-solar power can be used only together with conventional\npower plants as backups. However, based on German power data[3] of 2019 we show\nthat the required storage capacity can significantly be reduced, provided i) a\nsurplus of wind-solar power plants is supplied, ii) smart meters are installed,\niii) partly a different kind of wind turbines and solar panels are used in\nGermany. Our calculations suggest that all the electric energy, presently\nproduced in Germany, can be obtained from wind-solar power alone. And our\nresults let us predict that wind-solar power can be used to produce in addition\nthe energy for transportation, warm water, space heating and in part for\nprocess heating, meaning an increase of the present electric energy production\nby a factor of about 5[1]. Of course, to put such a prediction on firm ground\nthe present calculations have to be confirmed for a period of many years. And\nit should be kept in mind, that in any case a huge number of wind turbines and\nsolar panels is required.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2021 01:54:34 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Lustfeld", "Hans", ""]]}, {"id": "2102.00687", "submitter": "Kota Ogasawara", "authors": "Kota Ogasawara, Erika Igarashi", "title": "The Impacts of the Gender Imbalance on Marriage and Birth: Evidence from\n  World War II in Japan", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study uses the unprecedented changes in the sex ratio due to the losses\nof men during World War II to identify the impacts of the gender imbalance on\nmarriage market and birth outcomes in Japan. Using newly digitized census-based\nhistorical statistics, we find evidence that men had a stronger bargaining\nposition in the marriage market and intra-household fertility decisions than\nwomen. Under relative male scarcity, while people, especially younger people,\nwere more likely to marry and divorce, widowed women were less likely to\nremarry than widowed men. We also find that women's bargaining position in the\nmarriage market might not have improved throughout the 1950s. Given the\ninstitutional changes in the abortion law after the war, marital fertility and\nstillbirth rates increased in the areas that suffered relative male scarcity.\nOur result on out-of-wedlock births indicates that the theoretical prediction\nof intra-household bargaining is considered to be robust in an economy in which\nmarital fertility is dominant.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2021 08:03:28 GMT"}], "update_date": "2021-02-02", "authors_parsed": [["Ogasawara", "Kota", ""], ["Igarashi", "Erika", ""]]}, {"id": "2102.01071", "submitter": "Pramod Mane", "authors": "Pramod C. Mane, Nagarajan Krishnamurthy, Kapil Ahuja", "title": "Resource Availability in the Social Cloud: An Economics Perspective", "comments": "11 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DC econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper focuses on social cloud formation, where agents are involved in a\ncloseness-based conditional resource sharing and build their resource sharing\nnetwork themselves. The objectives of this paper are: (1) to investigate the\nimpact of agents' decisions of link addition and deletion on their local and\nglobal resource availability, (2) to analyze spillover effects in terms of the\nimpact of link addition between a pair of agents on others' utility, (3) to\nstudy the role of agents' closeness in determining what type of spillover\neffects these agents experience in the network, and (4) to model the choices of\nagents that suggest with whom they want to add links in the social cloud. The\nfindings include the following. Firstly, agents' decision of link addition\n(deletion) increases (decreases) their local resource availability. However,\nthese observations do not hold in the case of global resource availability.\nSecondly, in a connected network, agents experience either positive or negative\nspillover effect and there is no case with no spillover effects. Agents observe\nno spillover effects if and only if the network is disconnected and consists of\nmore than two components (sub-networks). Furthermore, if there is no change in\nthe closeness of an agent (not involved in link addition) due to a newly added\nlink, then the agent experiences negative spillover effect. Although an\nincrease in the closeness of agents is necessary in order to experience\npositive spillover effects, the condition is not sufficient. By focusing on\nparameters such as closeness and shortest distances, we provide conditions\nunder which agents choose to add links so as to maximise their resource\navailability.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jan 2021 06:00:03 GMT"}], "update_date": "2021-02-03", "authors_parsed": [["Mane", "Pramod C.", ""], ["Krishnamurthy", "Nagarajan", ""], ["Ahuja", "Kapil", ""]]}, {"id": "2102.01269", "submitter": "Rabab Haider", "authors": "Rabab Haider, David D'Achiardi, Venkatesh Venkataramanan, Anurag\n  Srivastava, Anjan Bose, and Anuradha M. Annaswamy", "title": "Reinventing the Utility for DERs: A Proposal for a DSO-Centric Retail\n  Electricity Market", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.SY eess.SY q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing penetration of intermittent renewables, storage devices, and\nflexible loads is introducing operational challenges in distribution grids. The\nproper coordination and scheduling of these resources using a distributed\napproach is warranted, and can only be achieved through local retail markets\nemploying transactive energy schemes. To this end, we propose a\ndistribution-level retail market operated by a Distribution System Operator\n(DSO), which schedules DERs and determines the real-time distribution-level\nLocational Marginal Price (d-LPM). The retail market is built using a\ndistributed Proximal Atomic Coordination (PAC) algorithm, which solves the\noptimal power flow model while accounting for network physics, rendering\nlocationally and temporally varying d-LMPs. A numerical study of the market\nstructure is carried out via simulations of the IEEE-123 node network using\ndata from ISO-NE and Eversource in Massachusetts, US. The market performance is\ncompared to existing retail practices, including demand response (DR) with\nno-export rules and net metering. The DSO-centric market increases DER\nutilization, permits continual market participation for DR, lowers electricity\nrates for customers, and eliminates the subsidies inherent to net metering\nprograms. The resulting lower revenue stream for the DSO highlights the\nevolving business model of the modern utility, moving from commoditized markets\ntowards performance-based ratemaking.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2021 02:57:30 GMT"}], "update_date": "2021-02-03", "authors_parsed": [["Haider", "Rabab", ""], ["D'Achiardi", "David", ""], ["Venkataramanan", "Venkatesh", ""], ["Srivastava", "Anurag", ""], ["Bose", "Anjan", ""], ["Annaswamy", "Anuradha M.", ""]]}, {"id": "2102.01527", "submitter": "Asim Ghosh Mr", "authors": "Asim Ghosh, Bikas K Chakrabarti", "title": "Limiting Value of the Kolkata Index for Social Inequality and a Possible\n  Social Constant", "comments": "Accepted for publication in Physica A", "journal-ref": "Physica A 573 (2021) 125944", "doi": "10.1016/j.physa.2021.125944", "report-no": null, "categories": "physics.soc-ph econ.GN q-fin.EC", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Based on some analytic structural properties of the Gini and Kolkata indices\nfor social inequality, as obtained from a generic form of the Lorenz function,\nwe make a conjecture that the limiting (effective saturation) value of the\nabove-mentioned indices is about 0.865. This, together with some more new\nobservations on the citation statistics of individual authors (including Nobel\nlaureates), suggests that about $14\\%$ of people or papers or social conflicts\ntend to earn or attract or cause about $86\\%$ of wealth or citations or deaths\nrespectively in very competitive situations in markets, universities or wars.\nThis is a modified form of the (more than a) century old $80-20$ law of Pareto\nin economy (not visible today because of various welfare and other strategies)\nand gives an universal value ($0.86$) of social (inequality) constant or\nnumber.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2021 14:51:43 GMT"}, {"version": "v2", "created": "Mon, 8 Feb 2021 14:49:36 GMT"}, {"version": "v3", "created": "Wed, 17 Mar 2021 14:27:28 GMT"}, {"version": "v4", "created": "Tue, 30 Mar 2021 11:32:39 GMT"}, {"version": "v5", "created": "Thu, 8 Apr 2021 13:26:20 GMT"}], "update_date": "2021-04-09", "authors_parsed": [["Ghosh", "Asim", ""], ["Chakrabarti", "Bikas K", ""]]}, {"id": "2102.01609", "submitter": "Ateeb Akhter Shah Syed", "authors": "Ateeb Akhter Shah Syed and Kaneez Fatima and Riffat Arshad", "title": "The Macroeconomic Impacts of Entitlements", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The worries expressed by Alan Greenspan that the long run economic growth of\nthe United States will fade away due to increasing burden of entitlements\nmotivated us to empirically investigate the impact of entitlements of key\nmacroeconomic variables. To examine this contemporary issue, we estimate a\nvector error-correction model is used to analyze the impact of entitlements on\nthe price level, real output, and the long-term interest rate. The results show\nthat a shock to entitlements leads to decrease in output and lends support to\nthe assertion made by Alan Greenspan. Several robustness checks are conducted\nand the results of the model qualitatively remains unchanged.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2021 17:07:40 GMT"}], "update_date": "2021-02-03", "authors_parsed": [["Syed", "Ateeb Akhter Shah", ""], ["Fatima", "Kaneez", ""], ["Arshad", "Riffat", ""]]}, {"id": "2102.01716", "submitter": "Alfred Galichon", "authors": "Alfred Galichon", "title": "A survey of some recent applications of optimal transport methods to\n  econometrics", "comments": null, "journal-ref": "The Econometrics Journal 20-2 (2017) C1-C11", "doi": "10.1111/ectj.12083", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  This paper surveys recent applications of methods from the theory of optimal\ntransport to econometric problems.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2021 19:16:59 GMT"}], "update_date": "2021-02-04", "authors_parsed": [["Galichon", "Alfred", ""]]}, {"id": "2102.02071", "submitter": "Simon Weber", "authors": "Liang Chen, Eugene Choo, Alfred Galichon and Simon Weber", "title": "Matching Function Equilibria with Partial Assignment: Existence,\n  Uniqueness and Estimation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In this paper, we argue that models coming from a variety of fields share a\ncommon structure that we call matching function equilibria with partial\nassignment. This structure revolves around an aggregate matching function and a\nsystem of nonlinear equations. This encompasses search and matching models,\nmatching models with transferable, non-transferable and imperfectly\ntransferable utility, and matching with peer effects. We provide a proof of\nexistence and uniqueness of an equilibrium as well as an efficient algorithm to\ncompute it. We show how to estimate parametric versions of these models by\nmaximum likelihood. We also propose an approach to construct counterfactuals\nwithout estimating the matching functions for a subclass of models. We\nillustrate our estimation approach by analyzing the impact of the elimination\nof the Social Security Student Benefit Program in 1982 on the marriage market\nin the United States.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2021 14:02:39 GMT"}], "update_date": "2021-02-04", "authors_parsed": [["Chen", "Liang", ""], ["Choo", "Eugene", ""], ["Galichon", "Alfred", ""], ["Weber", "Simon", ""]]}, {"id": "2102.02142", "submitter": "Paul Goldsmith-Pinkham", "authors": "Paul Goldsmith-Pinkham, Maxim Pinkovskiy, and Jacob Wallace", "title": "The Great Equalizer: Medicare and the Geography of Consumer Financial\n  Strain", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use a five percent sample of Americans' credit bureau data, combined with\na regression discontinuity approach, to estimate the effect of universal health\ninsurance at age 65-when most Americans become eligible for Medicare-at the\nnational, state, and local level. We find a 30 percent reduction in debt\ncollections-and a two-thirds reduction in the geographic variation in\ncollections-with limited effects on other financial outcomes. The areas that\nexperienced larger reductions in collections debt at age 65 were concentrated\nin the Southern United States, and had higher shares of black residents, people\nwith disabilities, and for-profit hospitals.\n", "versions": [{"version": "v1", "created": "Wed, 3 Feb 2021 16:57:23 GMT"}], "update_date": "2021-02-04", "authors_parsed": [["Goldsmith-Pinkham", "Paul", ""], ["Pinkovskiy", "Maxim", ""], ["Wallace", "Jacob", ""]]}, {"id": "2102.02379", "submitter": "Branko Bubalo", "authors": "Branko Bubalo", "title": "Airport Capacity and Performance in Europe -- A study of transport\n  economics, service quality and sustainability", "comments": "358 pages, 99 figures and 63 tables", "journal-ref": null, "doi": "10.25592/uhhfdm.8631", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The purpose of this dissertation is to present an overview of the operational\nand financial performance of airports in Europe. In benchmarking studies,\nairports are assessed and compared with other airports based on key indicators\nfrom a technical and an economic point of view. The interest lies primarily in\nthe question, which key figures can best measure the perception of quality of\nservice from the point of view of the passenger for the services at an airport.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2021 02:42:36 GMT"}], "update_date": "2021-02-05", "authors_parsed": [["Bubalo", "Branko", ""]]}, {"id": "2102.02577", "submitter": "Alfred Galichon", "authors": "Alfred Galichon", "title": "The VAR at Risk", "comments": "4 Pages", "journal-ref": "International Journal of Theoretical and Applied Finance 13-4\n  (2010) pp. 503-506", "doi": "10.1142/S0219024910005875", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  I show that the structure of the firm is not neutral in respect to regulatory\ncapital budgeted under rules which are based on the Value-at-Risk.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2021 12:30:07 GMT"}], "update_date": "2021-02-05", "authors_parsed": [["Galichon", "Alfred", ""]]}, {"id": "2102.02593", "submitter": "Alfred Galichon", "authors": "Ivar Ekeland and Alfred Galichon", "title": "The housing problem and revealed preference theory: duality and an\n  application", "comments": "19 pages", "journal-ref": "Economic Theory 54 (2013) pp. 425-441", "doi": "10.1007/s00199-012-0719-x", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  This paper exhibits a duality between the theory of Revealed Preference of\nAfriat and the housing allocation problem of Shapley and Scarf. In particular,\nit is shown that Afriat's theorem can be interpreted as a second welfare\ntheorem in the housing problem. Using this duality, the revealed preference\nproblem is connected to an optimal assignment problem, and a geometrical\ncharacterization of the rationalizability of experiment data is given. This\nallows in turn to give new indices of rationalizability of the data, and to\ndefine weaker notions of rationalizability, in the spirit of Afriat's\nefficiency index.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2021 13:09:50 GMT"}], "update_date": "2021-02-05", "authors_parsed": [["Ekeland", "Ivar", ""], ["Galichon", "Alfred", ""]]}, {"id": "2102.02884", "submitter": "Kenneth Wilbur", "authors": "Meenakshi Balakrishna and Kenneth C. Wilbur", "title": "How the Massachusetts Assault Weapons Ban Enforcement Notice Changed\n  Firearm Sales", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Massachusetts Attorney General issued an Enforcement Notice in 2016 to\nannounce a new interpretation of a key phrase in the state's assault weapons\nban. The Enforcement Notice increased sales of tagged assault rifles by 616% in\nthe first 5 days, followed by a 9% decrease over the next three weeks. Sales of\nHandguns and Shotguns did not change significantly. Tagged assault rifle sales\nfell 28-30% in 2017 compared to previous years, suggesting that the Enforcement\nNotice reduced assault weapon sales but also that many banned weapons continued\nto be sold. Tagged assault rifles sold most in 2017 in zip codes with higher\nhousehold incomes and proportions of white males. Overall, the results suggest\nthat the firearm market reacts rapidly to policy changes and partially complies\nwith firearm restrictions.\n", "versions": [{"version": "v1", "created": "Thu, 4 Feb 2021 20:55:31 GMT"}], "update_date": "2021-02-08", "authors_parsed": [["Balakrishna", "Meenakshi", ""], ["Wilbur", "Kenneth C.", ""]]}, {"id": "2102.02935", "submitter": "Albert Zevelev", "authors": "Albert Alex Zevelev", "title": "Does Collateral Value Affect Asset Prices? Evidence from a Natural\n  Experiment in Texas", "comments": null, "journal-ref": null, "doi": "10.1093/rfs/hhaa117", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Does the ability to pledge an asset as collateral, after purchase, affect its\nprice? This paper identifies the impact of collateral service flows on house\nprices, exploiting a plausibly exogenous constitutional amendment in Texas\nwhich legalized home equity loans in 1998. The law change increased Texas house\nprices 4%; this is price-based evidence that households are credit-constrained\nand value home equity loans to facilitate consumption smoothing. Prices rose\nmore in locations with inelastic supply, higher pre-law house prices, higher\nincome, and lower unemployment. These estimates reveal that richer households\nvalue the option to pledge their home as collateral more strongly.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2021 00:37:49 GMT"}], "update_date": "2021-02-08", "authors_parsed": [["Zevelev", "Albert Alex", ""]]}, {"id": "2102.03187", "submitter": "Achmad Firman Dr", "authors": "Achmad Firman and Ratna Ayu Saptati", "title": "Econometric model of children participation in family dairy farming in\n  the center of dairy farming, West Java Province, Indonesia", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  The involvement of children in the family dairy farming is pivotal point to\nreduce the cost of production input, especially in smallholder dairy farming.\nThe purposes of the study are to analysis the factors that influence children's\nparticipation in working in the family dairy farm. The study was held December\n2020 in the development center of dairy farming in Pangalengan subdistrict,\nWest Java Province, Indonesia. The econometric method used in the study was the\nlogit regression model. The results of the study determine that the there were\nnumber of respondents who participates in family farms was 52.59% of total\nrespondents, and the rest was no participation in the family farms. There are 3\nvariables in the model that are very influential on children's participation in\nthe family dairy farming, such as X1 (number of dairy farm land ownership), X2\n(number of family members), and X6 (the amount of work spent on the family's\ndairy farm). Key words: Participation, children, family, dairy farming, logit\nmodel\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2021 14:16:16 GMT"}], "update_date": "2021-02-08", "authors_parsed": [["Firman", "Achmad", ""], ["Saptati", "Ratna Ayu", ""]]}, {"id": "2102.03240", "submitter": "Zhu Liu", "authors": "Zhu Liu, Biqing Zhu, Philippe Ciais, Steven J. Davis, Chenxi Lu,\n  Haiwang Zhong, Piyu Ke, Yanan Cui, Zhu Deng, Duo Cui, Taochun Sun, Xinyu Dou,\n  Jianguang Tan, Rui Guo, Bo Zheng, Katsumasa Tanaka, Wenli Zhao, Pierre\n  Gentine", "title": "De-carbonization of global energy use during the COVID-19 pandemic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.ao-ph econ.GN q-fin.EC stat.OT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The COVID-19 pandemic has disrupted human activities, leading to\nunprecedented decreases in both global energy demand and GHG emissions. Yet a\nlittle known that there is also a low carbon shift of the global energy system\nin 2020. Here, using the near-real-time data on energy-related GHG emissions\nfrom 30 countries (about 70% of global power generation), we show that the\npandemic caused an unprecedented de-carbonization of global power system,\nrepresenting by a dramatic decrease in the carbon intensity of power sector\nthat reached a historical low of 414.9 tCO2eq/GWh in 2020. Moreover, the share\nof energy derived from renewable and low-carbon sources (nuclear, hydro-energy,\nwind, solar, geothermal, and biomass) exceeded that from coal and oil for the\nfirst time in history in May of 2020. The decrease in global net energy demand\n(-1.3% in the first half of 2020 relative to the average of the period in\n2016-2019) masks a large down-regulation of fossil-fuel-burning power plants\nsupply (-6.1%) coincident with a surge of low-carbon sources (+6.2%).\nConcomitant changes in the diurnal cycle of electricity demand also favored\nlow-carbon generators, including a flattening of the morning ramp, a lower\nmidday peak, and delays in both the morning and midday load peaks in most\ncountries. However, emission intensities in the power sector have since\nrebounded in many countries, and a key question for climate mitigation is thus\nto what extent countries can achieve and maintain lower, pandemic-level carbon\nintensities of electricity as part of a green recovery.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2021 15:37:57 GMT"}], "update_date": "2021-02-08", "authors_parsed": [["Liu", "Zhu", ""], ["Zhu", "Biqing", ""], ["Ciais", "Philippe", ""], ["Davis", "Steven J.", ""], ["Lu", "Chenxi", ""], ["Zhong", "Haiwang", ""], ["Ke", "Piyu", ""], ["Cui", "Yanan", ""], ["Deng", "Zhu", ""], ["Cui", "Duo", ""], ["Sun", "Taochun", ""], ["Dou", "Xinyu", ""], ["Tan", "Jianguang", ""], ["Guo", "Rui", ""], ["Zheng", "Bo", ""], ["Tanaka", "Katsumasa", ""], ["Zhao", "Wenli", ""], ["Gentine", "Pierre", ""]]}, {"id": "2102.03417", "submitter": "Yuchong Zhang", "authors": "Marcel Nutz, Yuchong Zhang", "title": "Reward Design in Risk-Taking Contests", "comments": "15 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC econ.GN q-fin.EC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Following the risk-taking model of Seel and Strack, $n$ players decide when\nto stop privately observed Brownian motions with drift and absorption at zero.\nThey are then ranked according to their level of stopping and paid a\nrank-dependent reward. We study the problem of a principal who aims to induce a\ndesirable equilibrium performance of the players by choosing how much reward is\nattributed to each rank. Specifically, we determine optimal reward schemes for\nprincipals interested in the average performance and the performance at a given\nrank. While the former can be related to reward inequality in the Lorenz sense,\nthe latter can have a surprising shape.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2021 20:44:03 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["Nutz", "Marcel", ""], ["Zhang", "Yuchong", ""]]}, {"id": "2102.03561", "submitter": "Edward Oughton", "authors": "Edward Oughton", "title": "Policy options for digital infrastructure strategies: A simulation model\n  for broadband universal service in Africa", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.NI econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Internet access is essential for economic development and helping to deliver\nthe Sustainable Development Goals, especially as even basic broadband can\nrevolutionize available economic opportunities. Yet, more than one billion\npeople still live without internet access. Governments must make strategic\nchoices to connect these citizens, but currently have few independent,\ntransparent and scientifically reproducible assessments to rely on. This paper\ndevelops open-source software to test broadband universal service strategies\nwhich meet the 10 Mbps target being considered by the UN Broadband Commission.\nThe private and government costs of different infrastructure decisions are\nquantified in six East and West African countries (C\\^ote D`Ivoire, Mali,\nSenegal, Kenya, Tanzania and Uganda). The results provide strong evidence that\n`leapfrogging` straight to 4G in unconnected areas is the least-cost option for\nproviding broadband universal service, with savings between 13-51% over 3G. The\nresults also demonstrate how the extraction of spectrum and tax revenues in\nunviable markets provide no net benefit, as for every $1 taken in revenue, a $1\ninfrastructure subsidy is required from government to achieve broadband\nuniversal service. Importantly, the use of a Shared Rural Network in unviable\nlocations provides impressive cost savings (up to 78%), while retaining the\nbenefits of dynamic infrastructure competition in viable urban and suburban\nareas. This paper provides evidence to design national and international\npolicies aimed at broadband universal service.\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2021 11:09:14 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["Oughton", "Edward", ""]]}, {"id": "2102.03644", "submitter": "Mahdi HajiAliAkbari", "authors": "Mahdi HajiAliAkbari and Shahin Esmaeili", "title": "Prisoner Dilemma in maximization constrained: the rationality of\n  cooperation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  David Gauthier in his article, Maximization constrained: the rationality of\ncooperation, tries to defend the joint strategy in situations in which no\noutcome is both equilibrium and optimal. Prisoner Dilemma is the most familiar\nexample of these situations. He first starts with some quotes by Hobbes in\nLeviathan; Hobbes, in chapter 15 discusses an objection by someone is called\nFoole, and then will reject his view. In response to Foole, Hobbes presents two\nstrategies (i.e. joint and individual) and two kinds of agents in such problems\nincluding Prisoner Dilemma, i.e. straightforward maximizer (SM) and constrained\nmaximizer(CM). Then he considers two arguments respectively for SM and CM, and\nhe will show that why in an ideal and transparent situation, the first argument\nfails and the second one would be the only valid argument. Likewise, in the\nfollowing part of his article, he considers more realistic situations with\ntranslucency and he concludes that under some conditions, the joint strategy\nwould be still the rational decision.\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2021 18:56:09 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["HajiAliAkbari", "Mahdi", ""], ["Esmaeili", "Shahin", ""]]}, {"id": "2102.03698", "submitter": "Rajat Verma", "authors": "Rajat Verma, Takahiro Yabe, Satish V. Ukkusuri", "title": "Mobility-based contact exposure explains the disparity of spread of\n  COVID-19 in urban neighborhoods", "comments": "13 pages (overall) with 7 figures and 1 table; currently under review\n  in another journal - Scientific Reports", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The rapid early spread of COVID-19 in the U.S. was experienced very\ndifferently by different socioeconomic groups and business industries. In this\nstudy, we study aggregate mobility patterns of New York City and Chicago to\nidentify the relationship between the amount of interpersonal contact between\npeople in urban neighborhoods and the disparity in the growth of positive cases\namong these groups. We introduce an aggregate Contact Exposure Index (CEI) to\nmeasure exposure due to this interpersonal contact and combine it with social\ndistancing metrics to show its effect on positive case growth. With the help of\nstructural equations modeling, we find that the effect of exposure on case\ngrowth was consistently positive and that it remained consistently higher in\nlower-income neighborhoods, suggesting a causal path of income on case growth\nvia contact exposure. Using the CEI, schools and restaurants are identified as\nhigh-exposure industries, and the estimation suggests that implementing\nspecific mobility restrictions on these point-of-interest categories are most\neffective. This analysis can be useful in providing insights for government\nofficials targeting specific population groups and businesses to reduce\ninfection spread as reopening efforts continue to expand across the nation.\n", "versions": [{"version": "v1", "created": "Sun, 7 Feb 2021 02:02:15 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["Verma", "Rajat", ""], ["Yabe", "Takahiro", ""], ["Ukkusuri", "Satish V.", ""]]}, {"id": "2102.03956", "submitter": "Fabio Italo Martinenghi", "authors": "Fabio Italo Martinenghi", "title": "Increasing the price of a university degree does not significantly\n  affect enrolment if income contingent loans are available: evidence from HECS\n  in Australia", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  I provide evidence that, when income-contingent loans are available, student\nenrolment in university courses is not significantly affected by large\nincreases in the price of those courses. I use publicly available domestic\nenrolment data from Australia. I study whether large increases in the price of\nhigher education for selected disciplines in Australia in 2009 and in 2012 was\nassociated with changes in their enrolment growth. I find that large increases\nin the price of a course did not lead to significant changes in their enrolment\ngrowth for that course.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2021 00:50:45 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["Martinenghi", "Fabio Italo", ""]]}, {"id": "2102.04090", "submitter": "Alberto Sardi", "authors": "A. Sardi and E. Sorano", "title": "Dynamic Performance Management: An Approach for Managing the Common\n  Goods", "comments": null, "journal-ref": "https://www.mdpi.com/2071-1050/11/22/6435", "doi": "10.3390/su11226435", "report-no": null, "categories": "econ.GN cs.PF q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Public organizations need innovative approaches for managing common goods and\nto explain the dynamics linking the (re)generation of common goods and\norganizational performance. Although system dynamics is recognised as a useful\napproach for managing common goods, public organizations rarely adopt the\nsystem dynamics for this goal. The paper aims to review the literature on the\nsystem dynamics and its recent application, known as dynamic performance\nmanagement, to highlight the state of the art and future opportunities on the\nmanagement of common goods. The authors analyzed 144 documents using a\nsystematic literature review. The results obtained outline a fair number of\ndocuments, countries and journals involving the study of system dynamics, but\ndo not cover sufficient research on the linking between the (re)generation of\ncommon goods and organizational performance. This paper outlines academic and\npractical contributions. Firstly, it contributes to the theory of common goods.\nIt provides insight for linking the management of common goods and\norganizational performance through the use of dynamic performance management\napproach. Furthermore, it shows scholars the main research opportunities.\nSecondly, it indicates to practitioners the documents providing useful ideas on\nthe adoption of system dynamics for managing common goods.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2021 09:53:19 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["Sardi", "A.", ""], ["Sorano", "E.", ""]]}, {"id": "2102.04093", "submitter": "Alberto Sardi", "authors": "Alberto Sardi, Alessandro Rizzi, Enrico Sorano, Anna Guerrieri", "title": "Cyber Risk in Health Facilities: A Systematic Literature Review", "comments": null, "journal-ref": "https://www.mdpi.com/2071-1050/12/17/7002", "doi": "10.3390/su12177002", "report-no": null, "categories": "econ.GN cs.SY eess.SY q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The current world challenges include issues such as infectious disease\npandemics, environmental health risks, food safety, and crime prevention.\nThrough this article, a special emphasis is given to one of the main challenges\nin the healthcare sector during the COVID-19 pandemic, the cyber risk. Since\nthe beginning of the Covid-19 pandemic, the World Health Organization has\ndetected a dramatic increase in the number of cyber-attacks. For instance, in\nItaly the COVID-19 emergency has heavily affected cybersecurity; from January\nto April 2020, the total of attacks, accidents, and violations of privacy to\nthe detriment of companies and individuals has doubled. Using a systematic and\nrigorous approach, this paper aims to analyze the literature on the cyber risk\nin the healthcare sector to understand the real knowledge on this topic. The\nfindings highlight the poor attention of the scientific community on this\ntopic, except in the United States. The literature lacks research contributions\nto support cyber risk management in subject areas such as Business, Management\nand Accounting; Social Science; and Mathematics. This research outlines the\nneed to empirically investigate the cyber risk, giving a practical solution to\nhealth facilities. Keywords: cyber risk; cyber-attack; cybersecurity; computer\nsecurity; COVID-19; coronavirus;information technology risk; risk management;\nrisk assessment; health facilities; healthcare sector;systematic literature\nreview; insurance\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2021 09:59:39 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["Sardi", "Alberto", ""], ["Rizzi", "Alessandro", ""], ["Sorano", "Enrico", ""], ["Guerrieri", "Anna", ""]]}, {"id": "2102.04137", "submitter": "Saeed Nosratabadi", "authors": "Szilvia Borbely, Csaba Mako, Miklos Illessy, Saeed Nostrabadi", "title": "Trade Union Strategies towards Platform Workers: Exploration Instead of\n  Action (The Case of Hungarian Trade Unions)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Although the share of platform work is very small compared to conventional\nand traditional employment system, research shows that the use of platform work\nis increasingly growing all over the world. Trade unions have also paid special\nattention to the platform work because they know that the transfer of a\npercentage of human resources to the platforms is undeniable. To this end, the\ntrade unions prepare themselves for the challenges and dynamics of this\nemerging phenomenon in the field of human resources. Using a qualitative\nresearch method and a case study of Hungary, the present study aimed to\nidentify the strategies adopted by Trade Unions to manage the transition to\nplatform works and provide suggestions for both practitioners and future\nresearch.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2021 11:33:22 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["Borbely", "Szilvia", ""], ["Mako", "Csaba", ""], ["Illessy", "Miklos", ""], ["Nostrabadi", "Saeed", ""]]}, {"id": "2102.04176", "submitter": "Sourish Dutta", "authors": "Sourish Dutta", "title": "Research Methods of Assessing Global Value Chains", "comments": "15 pages", "journal-ref": "SSRN Electronic Journal, 2021", "doi": "10.2139/ssrn.3784173", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The global production (as a system of creating values) is eventually forming\na vast web of value chains that explains the transitional structures of global\ntrade and development of the world economy. It is truly a new wave of\nglobalisation, and we can term it as the global value chains (GVCs), creating\nthe nexus among firms, workers and consumers around the globe. The emergence of\nthis new scenario is asking how an economy's businesses, producers and\nemployees are connecting to the global economy and capturing the gains out of\nit regarding different dimensions of economic development. Indeed, this GVC\napproach is very crucial for understanding the organisation of the global\nindustries (including firms) through analysing the statics and dynamics of\ndifferent economic players involved in this complex global production network.\nIts widespread notion deals with various global issues (including regional\nvalue chains also) from the top down to the bottom up, founding a scope for\npolicy analysis.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2021 13:12:56 GMT"}, {"version": "v2", "created": "Tue, 9 Feb 2021 21:41:07 GMT"}, {"version": "v3", "created": "Thu, 11 Feb 2021 18:15:59 GMT"}], "update_date": "2021-03-03", "authors_parsed": [["Dutta", "Sourish", ""]]}, {"id": "2102.04263", "submitter": "Tanut Treetanthiploet", "authors": "Samuel Cohen and Tanut Treetanthiploet", "title": "Correlated Bandits for Dynamic Pricing via the ARC algorithm", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CE cs.LG econ.GN q-fin.EC stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Asymptotic Randomised Control (ARC) algorithm provides a rigorous\napproximation to the optimal strategy for a wide class of Bayesian bandits,\nwhile retaining reasonable computational complexity. In particular, it allows a\ndecision maker to observe signals in addition to their rewards, to incorporate\ncorrelations between the outcomes of different choices, and to have nontrivial\ndynamics for their estimates. The algorithm is guaranteed to asymptotically\noptimise the expected discounted payoff, with error depending on the initial\nuncertainty of the bandit. In this paper, we consider a batched bandit problem\nwhere observations arrive from a generalised linear model; we extend the ARC\nalgorithm to this setting. We apply this to a classic dynamic pricing problem\nbased on a Bayesian hierarchical model and demonstrate that the ARC algorithm\noutperforms alternative approaches.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2021 14:54:26 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["Cohen", "Samuel", ""], ["Treetanthiploet", "Tanut", ""]]}, {"id": "2102.04337", "submitter": "Alfred Galichon", "authors": "Federico Echenique and Alfred Galichon", "title": "Ordinal and cardinal solution concepts for two-sided matching", "comments": "29 pages, 2 figures", "journal-ref": "Games and Economic Behavior 101 (2017) pp. 63-77", "doi": "10.1016/j.geb.2015.10.002", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We characterize solutions for two-sided matching, both in the transferable\nand in the nontransferable-utility frameworks, using a cardinal formulation.\nOur approach makes the comparison of the matching models with and without\ntransfers particularly transparent. We introduce the concept of a no-trade\nmatching to study the role of transfers in matching. A no-trade matching is one\nin which the availability of transfers do not affect the outcome.\n", "versions": [{"version": "v1", "created": "Mon, 8 Feb 2021 16:42:52 GMT"}, {"version": "v2", "created": "Fri, 12 Feb 2021 12:18:41 GMT"}], "update_date": "2021-02-15", "authors_parsed": [["Echenique", "Federico", ""], ["Galichon", "Alfred", ""]]}, {"id": "2102.04658", "submitter": "Eiji Yamamura", "authors": "Eiji Yamamura", "title": "View about consumption tax and grandchildren", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Japan, the increase in the consumption tax rate, a measure of balanced\npublic finance, reduces the inequality of fiscal burden between the present and\nfuture generations. This study estimates the effect of grandchildren on an\nolder person's view of consumption tax, using independently collected data. The\nresults show that having grandchildren is positively associated with supporting\nan increase in consumption tax. Further, this association is observed strongly\nbetween granddaughters and grandparents. However, the association between\ngrandsons and grandparents depends on the sub-sample. This implies that people\nof the old generation are likely to accept the tax burden to reduce the burden\non their grandchildren, especially granddaughters. In other words, grandparents\nshow intergenerational altruism.\n", "versions": [{"version": "v1", "created": "Tue, 9 Feb 2021 05:57:58 GMT"}], "update_date": "2021-02-10", "authors_parsed": [["Yamamura", "Eiji", ""]]}, {"id": "2102.04757", "submitter": "Samuel Cohen", "authors": "Samuel N. Cohen and Derek Snow and Lukasz Szpruch", "title": "Black-box model risk in finance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine learning models are increasingly used in a wide variety of financial\nsettings. The difficulty of understanding the inner workings of these systems,\ncombined with their wide applicability, has the potential to lead to\nsignificant new risks for users; these risks need to be understood and\nquantified. In this sub-chapter, we will focus on a well studied application of\nmachine learning techniques, to pricing and hedging of financial options. Our\naim will be to highlight the various sources of risk that the introduction of\nmachine learning emphasises or de-emphasises, and the possible risk mitigation\nand management strategies that are available.\n", "versions": [{"version": "v1", "created": "Tue, 9 Feb 2021 11:10:51 GMT"}], "update_date": "2021-02-10", "authors_parsed": [["Cohen", "Samuel N.", ""], ["Snow", "Derek", ""], ["Szpruch", "Lukasz", ""]]}, {"id": "2102.04758", "submitter": "Jacob Janssen", "authors": "Jacob Janssen and Yaneer Bar-Yam", "title": "Lowest-cost virus suppression", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN econ.TH q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Analysis of policies for managing epidemics require simultaneously an\neconomic and epidemiological perspective. We adopt a cost-of-policy framework\nto model both the virus spread and the cost of handling the pandemic. Because\nit is harder and more costly to fight the pandemic when the circulation is\nhigher, we find that the optimal policy is to go to zero or near-zero case\nnumbers. Without imported cases, if a region is willing to implement measures\nto prevent spread at one level in number of cases, it must also be willing to\nprevent the spread with at a lower level, since it will be cheaper to do so and\nhas only positive other effects. With imported cases, if a region is not\ncoordinating with other regions, we show the cheapest policy is continually low\nbut nonzero cases due to decreasing cost of halting imported cases. When it is\ncoordinating, zero is cost-optimal. Our analysis indicates that within Europe\ncooperation targeting a reduction of both within country transmission, and\nbetween country importation risk, should help achieve lower transmission and\nreduced costs.\n", "versions": [{"version": "v1", "created": "Tue, 9 Feb 2021 11:18:30 GMT"}], "update_date": "2021-02-10", "authors_parsed": [["Janssen", "Jacob", ""], ["Bar-Yam", "Yaneer", ""]]}, {"id": "2102.04936", "submitter": "Fred Morstatter", "authors": "Rajiv Sethi, Julie Seager, Emily Cai, Daniel M. Benjamin, Fred\n  Morstatter", "title": "Models, Markets, and the Forecasting of Elections", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.CY q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine probabilistic forecasts for battleground states in the 2020 US\npresidential election, using daily data from two sources over seven months: a\nmodel published by The Economist, and prices from the PredictIt exchange. We\nfind systematic differences in accuracy over time, with markets performing\nbetter several months before the election, and the model performing better as\nthe election approached. A simple average of the two forecasts performs better\nthan either one of them overall, even though no average can outperform both\ncomponent forecasts for any given state-date pair. This effect arises because\nthe model and the market make different kinds of errors in different states:\nthe model was confidently wrong in some cases, while the market was excessively\nuncertain in others. We conclude that there is value in using hybrid\nforecasting methods, and propose a market design that incorporates model\nforecasts via a trading bot to generate synthetic predictions. We also propose\nand conduct a profitability test that can be used as a novel criterion for the\nevaluation of forecasting performance.\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2021 19:05:07 GMT"}, {"version": "v2", "created": "Wed, 10 Feb 2021 20:05:41 GMT"}, {"version": "v3", "created": "Wed, 31 Mar 2021 23:28:13 GMT"}, {"version": "v4", "created": "Tue, 25 May 2021 16:34:04 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Sethi", "Rajiv", ""], ["Seager", "Julie", ""], ["Cai", "Emily", ""], ["Benjamin", "Daniel M.", ""], ["Morstatter", "Fred", ""]]}, {"id": "2102.05358", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Ciriaco Andrea D'Angelo, Leonardo Grilli", "title": "The effects of citation-based research evaluation schemes on\n  self-citation behavior", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the changes in the self-citation behavior of Italian\nprofessors following the introduction of a citation-based incentive scheme, for\nnational accreditation to academic appointments. Previous contributions on\nself-citation behavior have either focused on small samples or relied on simple\nmodels, not controlling for all confounding factors. The present work adopts a\ncomplex statistics model implemented on bibliometric individual data for over\n15,000 Italian professors. Controlling for a number of covariates (number of\ncitable papers published by the author; presence of international authors;\nnumber of co-authors; degree of the professor's specialization), the average\nincrease in self-citation rates following introduction of the ASN is of 9.5%.\nThe increase is common to all disciplines and academic ranks, albeit with\ndiverse magnitude. Moreover, the increase is sensitive to the relative\nincentive, depending on the status of the scholar with respect to the\nscientific accreditation. A further analysis shows that there is much\nheterogeneity in the individual patterns of self-citing behavior, albeit with\nvery few outliers.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2021 09:58:45 GMT"}], "update_date": "2021-02-11", "authors_parsed": [["Abramo", "Giovanni", ""], ["D'Angelo", "Ciriaco Andrea", ""], ["Grilli", "Leonardo", ""]]}, {"id": "2102.05360", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Ciriaco Andrea D'Angelo, Ida Mele", "title": "Gendered impact of COVID-19 pandemic on research production: a\n  cross-country analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The massive shock of the COVID-19 pandemic is already showing its negative\neffects on economies around the world, unprecedented in recent history.\nCOVID-19 infections and containment measures have caused a general slowdown in\nresearch and new knowledge production. Because of the link between R&D spending\nand economic growth, it is to be expected then that a slowdown in research\nactivities will slow in turn the global recovery from the pandemic. Many recent\nstudies also claim an uneven impact on scientific production across gender. In\nthis paper, we investigate the phenomenon across countries, analysing preprint\ndepositions. Differently from other works, that compare the number of preprint\ndepositions before and after the pandemic outbreak, we analyse the depositions\ntrends across geographical areas, and contrast after-pandemic depositions with\nexpected ones. Differently from common belief and initial evidence, in few\ncountries female scientists increased their scientific output while males\nplunged.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2021 10:00:58 GMT"}], "update_date": "2021-02-11", "authors_parsed": [["Abramo", "Giovanni", ""], ["D'Angelo", "Ciriaco Andrea", ""], ["Mele", "Ida", ""]]}, {"id": "2102.05364", "submitter": "Ciriaco Andrea D'Angelo", "authors": "Giovanni Abramo, Francesca Apponi, Ciriaco Andrea D'Angelo", "title": "Do the propensity and drivers of academics' engagement in research\n  collaboration with industry vary over time?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.DL q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study is about public-private research collaboration. In particular, we\nwant to measure how the propensity of academics to collaborate with their\ncolleagues from private firms varies over time and whether the typical profile\nof such academics change. Furthermore, we investigate the change of the weights\nof main drivers underlying the academics' propensity to collaborate with\nindustry. In order to achieve such goals, we apply an inferential model on a\ndataset of professors working in Italian universities in two subsequent\nperiods, 2010-2013 and 2014-2017. Results can be useful for supporting the\ndefinition of policies aimed at fostering public-private research\ncollaborations, and should be taken into account when assessing their\neffectiveness afterwards.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2021 10:05:07 GMT"}], "update_date": "2021-02-11", "authors_parsed": [["Abramo", "Giovanni", ""], ["Apponi", "Francesca", ""], ["D'Angelo", "Ciriaco Andrea", ""]]}, {"id": "2102.05405", "submitter": "Andrea Vandin", "authors": "Andrea Vandin, Daniele Giachini, Francesco Lamperti, Francesca\n  Chiaromonte", "title": "Automated and Distributed Statistical Analysis of Economic Agent-Based\n  Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.MA cs.PF q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a novel approach to the statistical analysis of simulation models\nand, especially, agent-based models (ABMs). Our main goal is to provide a fully\nautomated and model-independent tool-kit to inspect simulations and perform\ncounterfactual analysis. Our approach: (i) is easy-to-use by the modeller, (ii)\nimproves reproducibility of results, (iii) optimizes running time given the\nmodeller's machine, (iv) automatically chooses the number of required\nsimulations and simulation steps to reach user-specified statistical\nconfidence, and (v) automatically performs a variety of statistical tests. In\nparticular, our framework is designed to distinguish the transient dynamics of\nthe model from its steady-state behaviour (if any), estimate properties of the\nmodel in both \"phases\", and provide indications on the ergodic (or non-ergodic)\nnature of the simulated processes -- which, in turns allows one to gauge the\nreliability of a steady-state analysis. Estimates are equipped with statistical\nguarantees, allowing for robust comparisons across computational experiments.\nTo demonstrate the effectiveness of our approach, we apply it to two models\nfrom the literature: a large scale macro-financial ABM and a small scale\nprediction market model. Compared to prior analyses of these models, we obtain\nnew insights and we are able to identify and fix some erroneous conclusions.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2021 12:39:34 GMT"}], "update_date": "2021-02-11", "authors_parsed": [["Vandin", "Andrea", ""], ["Giachini", "Daniele", ""], ["Lamperti", "Francesco", ""], ["Chiaromonte", "Francesca", ""]]}, {"id": "2102.05411", "submitter": "Vladim\\'ir Hol\\'y", "authors": "Vladim\\'ir Hol\\'y and Tom\\'a\\v{s} Evan", "title": "The Role of a Nation's Culture in the Country's Governance: Stochastic\n  Frontier Analysis", "comments": null, "journal-ref": null, "doi": "10.1007/s10100-021-00754-5", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  What role does culture play in determining institutions in a country? This\npaper argues that the establishment of institutions is a process originating\npredominantly in a nation's culture and tries to discern the role of a cultural\nbackground in the governance of countries. We use the six Hofstede's Cultural\nDimensions and the six Worldwide Governance Indicators to test the strength of\nthe relationship on 94 countries between 1996 and 2019. We find that the\nstrongest cultural characteristics are Power Distance with negative effect on\ngovernance and Long-Term Orientation with positive effect. We also determine\nhow well countries transform their cultural characteristics into institutions\nusing stochastic frontier analysis.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2021 13:09:22 GMT"}, {"version": "v2", "created": "Wed, 14 Apr 2021 15:37:30 GMT"}], "update_date": "2021-06-29", "authors_parsed": [["Holý", "Vladimír", ""], ["Evan", "Tomáš", ""]]}, {"id": "2102.05506", "submitter": "Beibei Li", "authors": "Anindya Ghose, Xitong Guo, Beibei Li, Yuanyuan Dang", "title": "Empowering Patients Using Smart Mobile Health Platforms: Evidence From A\n  Randomized Field Experiment", "comments": "Forthcoming at MIS Quarterly (2021)", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.HC q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  With today's technological advancements, mobile phones and wearable devices\nhave become extensions of an increasingly diffused and smart digital\ninfrastructure. In this paper, we examine mobile health (mHealth) platforms and\ntheir health and economic impacts on the outcomes of chronic disease patients.\nWe partnered with a major mHealth firm that provides one of the largest mHealth\napps in Asia specializing in diabetes care. We designed a randomized field\nexperiment based on detailed patient health activities (e.g., exercises, sleep,\nfood intake) and blood glucose values from 1,070 diabetes patients over several\nmonths. We find the adoption of the mHealth app leads to an improvement in\nhealth behavior, which leads to both short term metrics (reduction in patients'\nblood glucose and glycated hemoglobin levels) and longer-term metrics (hospital\nvisits and medical expenses). Patients who adopted the mHealth app undertook\nmore exercise, consumed healthier food, walked more steps and slept for longer\ntimes. They also were more likely to substitute offline visits with telehealth.\nA comparison of mobile vs. PC version of the same app demonstrates that mobile\nhas a stronger effect than PC in helping patients make these behavioral\nmodifications with respect to diet, exercise and lifestyle, which leads to an\nimprovement in their healthcare outcomes. We also compared outcomes when the\nplatform facilitates personalized health reminders to patients vs. generic\nreminders. Surprisingly, we find personalized mobile messages with\npatient-specific guidance can have an inadvertent (smaller) effect on patient\napp engagement and lifestyle changes, leading to a lower health improvement.\nHowever, they are more like to encourage a substitution of offline visits by\ntelehealth. Overall, our findings indicate the massive potential of mHealth\ntechnologies and platform design in achieving better healthcare outcomes.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2021 15:48:09 GMT"}, {"version": "v2", "created": "Wed, 17 Feb 2021 16:44:47 GMT"}], "update_date": "2021-02-18", "authors_parsed": [["Ghose", "Anindya", ""], ["Guo", "Xitong", ""], ["Li", "Beibei", ""], ["Dang", "Yuanyuan", ""]]}, {"id": "2102.05554", "submitter": "Rupam Bhattacharyya", "authors": "Rupam Bhattacharyya, Sheo Rama, Atul Kumar, Indrajit Banerjee", "title": "Dynamic Structural Impact of the COVID-19 Outbreak on the Stock Market\n  and the Exchange Rate: A Cross-country Analysis Among BRICS Nations", "comments": "18 pages, 4 figures, 2 appendices", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.ST", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  COVID-19 has impacted the economy of almost every country in the world. Of\nparticular interest are the responses of the economic indicators of developing\nnations (such as BRICS) to the COVID-19 shock. As an extension to our earlier\nwork on the dynamic associations of pandemic growth, exchange rate, and stock\nmarket indices in the context of India, we look at the same question with\nrespect to the BRICS nations. We use structural variable autoregression (SVAR)\nto identify the dynamic underlying associations across the normalized growth\nmeasurements of the COVID-19 cumulative case, recovery, and death counts, and\nthose of the exchange rate, and stock market indices, using data over 203 days\n(March 12 - September 30, 2020). Using impulse response analyses, the COVID-19\nshock to the growth of exchange rate was seen to persist for around 10+ days,\nand that for stock exchange was seen to be around 15 days. The models capture\nthe contemporaneous nature of these shocks and the subsequent responses,\npotentially guiding to inform policy decisions at a national level. Further,\ncausal inference-based analyses would allow us to infer relationships that are\nstronger than mere associations.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2021 16:37:07 GMT"}], "update_date": "2021-02-11", "authors_parsed": [["Bhattacharyya", "Rupam", ""], ["Rama", "Sheo", ""], ["Kumar", "Atul", ""], ["Banerjee", "Indrajit", ""]]}, {"id": "2102.05739", "submitter": "Gaurab Aryal", "authors": "Gaurab Aryal and Federico Ciliberto and Benjamin T. Leyden", "title": "Coordinated Capacity Reductions and Public Communication in the Airline\n  Industry", "comments": "forthcoming The Review of Economic Studies", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the allegation that legacy U.S. airlines communicated via\nearnings calls to coordinate with other legacy airlines in offering fewer seats\non competitive routes. To this end, we first use text analytics to build a\nnovel dataset on communication among airlines about their capacity choices.\nEstimates from our preferred specification show that the number of offered\nseats is 2% lower when all legacy airlines in a market discuss the concept of\n\"capacity discipline.\" We verify that this reduction materializes only when\nlegacy airlines communicate concurrently, and that it cannot be explained by\nother possibilities, including that airlines are simply announcing to investors\ntheir unilateral plans to reduce capacity, and then following through on those\nannouncements.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2021 21:06:58 GMT"}, {"version": "v2", "created": "Fri, 16 Jul 2021 13:32:56 GMT"}, {"version": "v3", "created": "Mon, 26 Jul 2021 17:39:31 GMT"}], "update_date": "2021-07-27", "authors_parsed": [["Aryal", "Gaurab", ""], ["Ciliberto", "Federico", ""], ["Leyden", "Benjamin T.", ""]]}, {"id": "2102.05751", "submitter": "Gaurab Aryal", "authors": "Gaurab Aryal and Charles Murry and Jonathan W. Williams", "title": "Price Discrimination in International Airline Markets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We develop a model of inter-temporal and intra-temporal price discrimination\nby monopoly airlines to study the ability of different discriminatory pricing\nmechanisms to increase efficiency and the associated distributional\nimplications. To estimate the model, we use unique data from international\nairline markets with flight-level variation in prices across time, cabins, and\nmarkets, as well as information on passengers' reasons for travel and time of\npurchase. We find that the ability to screen passengers across cabins every\nperiod increases total surplus by 35% relative to choosing only one price per\nperiod, with both the airline and passengers benefiting. However, further\ndiscrimination based on passenger's reason to traveling improve airline surplus\nat the expense of total efficiency. We also find that the current pricing\npractice yields approximately 89% of the first-best welfare. The source of this\ninefficiency arises mostly from dynamic uncertainty about demand, not private\ninformation about passenger valuations.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2021 21:49:55 GMT"}, {"version": "v2", "created": "Mon, 22 Feb 2021 20:50:52 GMT"}, {"version": "v3", "created": "Wed, 24 Feb 2021 01:56:35 GMT"}], "update_date": "2021-02-25", "authors_parsed": [["Aryal", "Gaurab", ""], ["Murry", "Charles", ""], ["Williams", "Jonathan W.", ""]]}, {"id": "2102.05803", "submitter": "Alina Malkova", "authors": "Alina Malkova, Klara Sabirianova Peter, Jan Svejnar", "title": "Labor Informality and Credit Market Accessibility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The paper investigates the effects of the credit market development on the\nlabor mobility between the informal and formal labor sectors. In the case of\nRussia, due to the absence of a credit score system, a formal lender may set a\ncredit limit based on the verified amount of income. To get a loan, an informal\nworker must first formalize his or her income (switch to a formal job), and\nthen apply for a loan. To show this mechanism, the RLMS data was utilized, and\nthe empirical method is the dynamic multinomial logit model of employment. The\nempirical results show that a relaxation of credit constraints increases the\nprobability of transition from an informal to a formal job, and improved CMA\n(by one standard deviation) increases the chances of informal sector workers to\nformalize by 5.4 ppt. These results are robust in different specifications of\nthe model. Policy simulations show strong support for a reduction in informal\nemployment in response to better CMA in credit-constrained communities.\n", "versions": [{"version": "v1", "created": "Thu, 11 Feb 2021 01:54:02 GMT"}], "update_date": "2021-02-12", "authors_parsed": [["Malkova", "Alina", ""], ["Peter", "Klara Sabirianova", ""], ["Svejnar", "Jan", ""]]}, {"id": "2102.05876", "submitter": "Changkuk Im", "authors": "Changkuk Im and Jinkwon Lee", "title": "On the Fragility of Third-party Punishment: The Context Effect of a\n  Dominated Risky Investment Option", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Some studies have shown that third-party punishment (TPP) substantially\nexists in a controlled laboratory setting. However, only a few studies\ninvestigate the robustness of TPP. This study experimentally investigates to\nwhat extent TPP can be robust by offering an additional but unattractive risky\ninvestment option to a third party. We find that when both the punishment and\ninvestment options are available, the demand for punishment decreases whereas\nthe demand for investment increases. These findings support our hypothesis that\nthe seemingly unrelated and dominated investment option may work as a\ncompromise and suggest the fragility of TPP.\n", "versions": [{"version": "v1", "created": "Thu, 11 Feb 2021 07:40:31 GMT"}, {"version": "v2", "created": "Fri, 12 Feb 2021 04:54:35 GMT"}], "update_date": "2021-02-15", "authors_parsed": [["Im", "Changkuk", ""], ["Lee", "Jinkwon", ""]]}, {"id": "2102.06331", "submitter": "Federico Echenique", "authors": "Federico Echenique, Kota Saito, Taisuke Imai", "title": "Approximate Expected Utility Rationalization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new measure of deviations from expected utility theory. For any\npositive number~$e$, we give a characterization of the datasets with a\nrationalization that is within~$e$ (in beliefs, utility, or perceived prices)\nof expected utility theory. The number~$e$ can then be used as a measure of how\nfar the data is to expected utility theory. We apply our methodology to data\nfrom three large-scale experiments. Many subjects in those experiments are\nconsistent with utility maximization, but not with expected utility\nmaximization. Our measure of distance to expected utility is correlated with\nsubjects' demographic characteristics.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2021 02:37:35 GMT"}], "update_date": "2021-02-15", "authors_parsed": [["Echenique", "Federico", ""], ["Saito", "Kota", ""], ["Imai", "Taisuke", ""]]}, {"id": "2102.06404", "submitter": "Emanuele Bacchiocchi", "authors": "Emanuele Bacchiocchi and Catalin Dragomirescu-Gaina", "title": "Uncertainty spill-overs: when policy and financial realms overlap", "comments": "52 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  No matter its source, financial- or policy-related, uncertainty can feed onto\nitself, inflicting the real economic sector, altering expectations and\nbehaviours, and leading to identification challenges in empirical applications.\nThe strong intertwining between policy and financial realms prevailing in\nEurope, and in Euro Area in particular, might complicate the problem and create\namplification mechanisms difficult to pin down. To reveal the complex\ntransmission of country-specific uncertainty shocks in a multi-country setting,\nand to properly account for cross-country interdependencies, we employ a global\nVAR specification for which we adapt an identification approach based on\nmagnitude restrictions. Once we separate policy uncertainty from financial\nuncertainty shocks, we find evidence of important cross-border uncertainty\nspill-overs. We also uncover a new amplification mechanism for domestic\nuncertainty shocks, whose true nature becomes more blurred once they cross the\nnational boundaries and spill over to other countries. With respect to ECB\npolicy reactions, we reveal stronger but less persistent responses to financial\nuncertainty shocks compared to policy uncertainty shocks. This points to ECB\nadopting a more (passive or) accommodative stance towards the former, but a\nmore pro-active stance towards the latter shocks, possibly as an attempt to\ntame policy uncertainty spill-overs and prevent the fragmentation of the Euro\nArea financial markets.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2021 09:09:22 GMT"}], "update_date": "2021-02-15", "authors_parsed": [["Bacchiocchi", "Emanuele", ""], ["Dragomirescu-Gaina", "Catalin", ""]]}, {"id": "2102.06487", "submitter": "Alfred Galichon", "authors": "Pierre-Andr\\'e Chiappori, Alfred Galichon and Bernard Salani\\'e", "title": "On Human Capital and Team Stability", "comments": "30 pages", "journal-ref": "Journal of Human Capital 13-2 (2019) pp. 236-259", "doi": "10.1086/702925", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In many economic contexts, agents from a same population team up to better\nexploit their human capital. In such contexts (often called \"roommate matching\nproblems\"), stable matchings may fail to exist even when utility is\ntransferable. We show that when each individual has a close substitute, a\nstable matching can be implemented with minimal policy intervention. Our\nresults shed light on the stability of partnerships on the labor market.\nMoreover, they imply that the tools crafted in empirical studies of the\nmarriage problem can easily be adapted to many roommate problems.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2021 12:39:03 GMT"}], "update_date": "2021-02-15", "authors_parsed": [["Chiappori", "Pierre-André", ""], ["Galichon", "Alfred", ""], ["Salanié", "Bernard", ""]]}, {"id": "2102.06547", "submitter": "Alfred Galichon", "authors": "Edoardo Ciscato, Alfred Galichon and Marion Gouss\\'e", "title": "Like Attract Like? A Structural Comparison of Homogamy across Same-Sex\n  and Different-Sex Households", "comments": "48 pages, 8 tables", "journal-ref": "Journal of Political Economy 128-2 (2020) pp. 740-781", "doi": "10.1086/704611", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In this paper, we extend Gary Becker's empirical analysis of the marriage\nmarket to same-sex couples. Becker's theory rationalizes the well-known\nphenomenon of homogamy among different-sex couples: individuals mate with their\nlikes because many characteristics, such as education, consumption behaviour,\ndesire to nurture children, religion, etc., exhibit strong complementarities in\nthe household production function. However, because of asymmetries in the\ndistributions of male and female characteristics, men and women may need to\nmarry \"up\" or \"down\" according to the relative shortage of their\ncharacteristics among the populations of men and women. Yet, among same-sex\ncouples, this limitation does not exist as partners are drawn from the same\npopulation, and thus the theory of assortative mating would boldly predict that\nindividuals will choose a partner with nearly identical characteristics.\nEmpirical evidence suggests a very different picture: a robust stylized fact is\nthat the correlation of the characteristics is in fact weaker among same-sex\ncouples. In this paper, we build an equilibrium model of same-sex marriage\nmarket which allows for straightforward identification of the gains to\nmarriage. We estimate the model with 2008-2012 ACS data on California and show\nthat positive assortative mating is weaker for homosexuals than for\nheterosexuals with respect to age and race. Our results suggest that positive\nassortative mating with respect to education is stronger among lesbians, and\nnot significantly different when comparing gay men and married different-sex\ncouples. As regards labor market outcomes, such as hourly wages and working\nhours, we find some indications that the process of specialization within the\nhousehold mainly applies to different-sex couples.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2021 14:22:05 GMT"}], "update_date": "2021-02-15", "authors_parsed": [["Ciscato", "Edoardo", ""], ["Galichon", "Alfred", ""], ["Goussé", "Marion", ""]]}, {"id": "2102.07001", "submitter": "Friedhelm Victor", "authors": "Friedhelm Victor, Andrea Marie Weintraud", "title": "Detecting and Quantifying Wash Trading on Decentralized Cryptocurrency\n  Exchanges", "comments": "Accepted at the Web Conference 2021 (WWW '21) 10 pages, 10 figures", "journal-ref": null, "doi": "10.1145/3442381.3449824", "report-no": null, "categories": "cs.CR econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Cryptoassets such as cryptocurrencies and tokens are increasingly traded on\ndecentralized exchanges. The advantage for users is that the funds are not in\ncustody of a centralized external entity. However, these exchanges are prone to\nmanipulative behavior. In this paper, we illustrate how wash trading activity\ncan be identified on two of the first popular limit order book-based\ndecentralized exchanges on the Ethereum blockchain, IDEX and EtherDelta. We\nidentify a lower bound of accounts and trading structures that meet the legal\ndefinitions of wash trading, discovering that they are responsible for a wash\ntrading volume in equivalent of 159 million U.S. Dollars. While self-trades and\ntwo-account structures are predominant, complex forms also occur. We quantify\nthese activities, finding that on both exchanges, more than 30\\% of all traded\ntokens have been subject to wash trading activity. On EtherDelta, 10% of the\ntokens have almost exclusively been wash traded. All data is made available for\nfuture research. Our findings underpin the need for countermeasures that are\napplicable in decentralized systems.\n", "versions": [{"version": "v1", "created": "Sat, 13 Feb 2021 20:58:48 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Victor", "Friedhelm", ""], ["Weintraud", "Andrea Marie", ""]]}, {"id": "2102.07147", "submitter": "Xiaoyan Wang", "authors": "Xiaoyan Wang, Xi Lin and Meng Li", "title": "Aggregate Modeling and Equilibrium Analysis of the Crowdsourcing Market\n  for Autonomous Vehicles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Autonomous vehicles (AVs) have the potential of reshaping the human mobility\nin a wide variety of aspects. This paper focuses on a new possibility that the\nAV owners have the option of \"renting\" their AVs to a company, which can use\nthese collected AVs to provide on-demand ride services without any drivers. We\ncall such a mobility market with AV renting options the \"AV crowdsourcing\nmarket\". This paper establishes an aggregate equilibrium model with multiple\ntransport modes to analyze the AV crowdsourcing market. The modeling framework\ncan capture the customers' mode choices and AV owners' rental decisions with\nthe presence of traffic congestion. Then, we explore different scenarios that\neither maximize the crowdsourcing platform's profit or maximize social welfare.\nGradient-based optimization algorithms are designed for solving the problems.\nThe results obtained by numerical examples reveal the welfare enhancement and\nthe strong profitability of the AV crowdsourcing service. However, when the\ncrowdsourcing scale is small, the crowdsourcing platform might not be\nprofitable. A second-best pricing scheme is able to avoid such undesirable\ncases. The insights generated from the analyses provide guidance for\nregulators, service providers and citizens to make future decisions regarding\nthe utilization of the AV crowdsourcing markets for serving the good of the\nsociety.\n", "versions": [{"version": "v1", "created": "Sun, 14 Feb 2021 13:13:32 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Wang", "Xiaoyan", ""], ["Lin", "Xi", ""], ["Li", "Meng", ""]]}, {"id": "2102.07198", "submitter": "Rahul Batra", "authors": "Shailesh Bharati, Rahul Batra", "title": "How Misuse of Statistics Can Spread Misinformation: A Study of\n  Misrepresentation of COVID-19 Data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper investigates various ways in which a pandemic such as the novel\ncoronavirus, could be predicted using different mathematical models. It also\nstudies the various ways in which these models could be depicted using various\nvisualization techniques. This paper aims to present various statistical\ntechniques suggested by the Centres for Disease Control and Prevention in order\nto represent the epidemiological data. The main focus of this paper is to\nanalyse how epidemiological data or contagious diseases are theorized using any\navailable information and later may be presented wrongly by not following the\nguidelines, leading to inaccurate representation and interpretations of the\ncurrent scenario of the pandemic; with a special reference to the Indian\nSubcontinent.\n", "versions": [{"version": "v1", "created": "Sun, 14 Feb 2021 17:09:08 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Bharati", "Shailesh", ""], ["Batra", "Rahul", ""]]}, {"id": "2102.07222", "submitter": "Andrea Moro", "authors": "Andrea Moro, Martin Van der Linden", "title": "Exclusion of Extreme Jurors and Minority Representation: The Effect of\n  Jury Selection Procedures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN econ.TH q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We compare two established jury selection procedures meant to safeguard\nagainst the inclusion of biased jurors that are also perceived as causing\nminorities to be under-represented in juries. The Strike and Replace procedure\npresents potential jurors one-by-one to the parties, while the Struck procedure\npresents all potential jurors before the parties exercise vetoes. In\nequilibrium, Struck more effectively excludes extreme jurors than Strike and\nReplace but leads to a worse representation of minorities. Simulations suggest\nthat the advantage of Struck in terms of excluding extremes is sizable in a\nwide range of cases. In contrast, Strike and Replace only provides a\nsignificantly better representation of minorities if the minority and majority\nare heavily polarized. When parameters are estimated to match the parties'\nselection of jurors by race with jury-selection data from Mississippi in trials\nagainst black defendants, the procedures' outcomes are substantially different,\nand the size of the trade-off between objectives can be quantitatively\nevaluated.\n", "versions": [{"version": "v1", "created": "Sun, 14 Feb 2021 18:56:46 GMT"}, {"version": "v2", "created": "Sun, 27 Jun 2021 10:14:54 GMT"}, {"version": "v3", "created": "Tue, 20 Jul 2021 16:03:23 GMT"}], "update_date": "2021-07-21", "authors_parsed": [["Moro", "Andrea", ""], ["Van der Linden", "Martin", ""]]}, {"id": "2102.07476", "submitter": "Alfred Galichon", "authors": "Arnaud Dupuy and Alfred Galichon", "title": "Personality Traits and the Marriage Market", "comments": "72 pages, 5 tables", "journal-ref": "Journal of Political Economy 122-6 (2014) pp. 1271-1319", "doi": "10.1086/677191", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Which and how many attributes are relevant for the sorting of agents in a\nmatching market? This paper addresses these questions by constructing indices\nof mutual attractiveness that aggregate information about agents' attributes.\nThe first k indices for agents on each side of the market provide the best\napproximation of the matching surplus by a k-dimensional model. The methodology\nis applied on a unique Dutch households survey containing information about\neducation, height, BMI, health, attitude toward risk and personality traits of\nspouses.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2021 11:35:35 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Dupuy", "Arnaud", ""], ["Galichon", "Alfred", ""]]}, {"id": "2102.07489", "submitter": "Alfred Galichon", "authors": "Arnaud Dupuy and Alfred Galichon", "title": "Canonical Correlation and Assortative Matching: A Remark", "comments": "11 pages", "journal-ref": null, "doi": "10.15609/annaeconstat2009.119-120.375", "report-no": "Annals of Economics and Statistics 119/120 (2015) pp. 375-383", "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In the context of the Beckerian theory of marriage, when men and women match\non a single-dimensional index that is the weighted sum of their respective\nmultivariate attributes, many papers in the literature have used linear\ncanonical correlation, and related techniques, in order to estimate these\nweights. We argue that this estimation technique is inconsistent and suggest\nsome solutions.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2021 11:45:13 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Dupuy", "Arnaud", ""], ["Galichon", "Alfred", ""]]}, {"id": "2102.07536", "submitter": "Nils K\\\"obis C", "authors": "Margarita Leib, Nils C. K\\\"obis, Rainer Michael Rilke, Marloes Hagens,\n  Bernd Irlenbusch", "title": "The corruptive force of AI-generated advice", "comments": "Leib & K\\\"obis share first authorship", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Artificial Intelligence (AI) is increasingly becoming a trusted advisor in\npeople's lives. A new concern arises if AI persuades people to break ethical\nrules for profit. Employing a large-scale behavioural experiment (N = 1,572),\nwe test whether AI-generated advice can corrupt people. We further test whether\ntransparency about AI presence, a commonly proposed policy, mitigates potential\nharm of AI-generated advice. Using the Natural Language Processing algorithm,\nGPT-2, we generated honesty-promoting and dishonesty-promoting advice.\nParticipants read one type of advice before engaging in a task in which they\ncould lie for profit. Testing human behaviour in interaction with actual AI\noutputs, we provide first behavioural insights into the role of AI as an\nadvisor. Results reveal that AI-generated advice corrupts people, even when\nthey know the source of the advice. In fact, AI's corrupting force is as strong\nas humans'.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2021 13:15:12 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Leib", "Margarita", ""], ["Köbis", "Nils C.", ""], ["Rilke", "Rainer Michael", ""], ["Hagens", "Marloes", ""], ["Irlenbusch", "Bernd", ""]]}, {"id": "2102.07656", "submitter": "Maria Rosaria Pappalardo", "authors": "Silvia Angilella, Maria Rosaria Pappalardo", "title": "Assessment of a failure prediction model in the energy sector: a\n  multicriteria discrimination approach with Promethee based classification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study presents the implementation of a non-parametric multiple criteria\ndecision aiding (MCDA) model, the Multi-group Hierarchy Discrimination\n(M.H.DIS) model, with the Preference Ranking Organization Method for Enrichment\nEvaluations (PROMETHEE), on a dataset of 114 European unlisted companies\noperating in the energy sector. Firstly, the M.H.DIS model has been developed\nfollowing a five-fold cross validation procedure to analyze whether the model\nexplains and replicates a two-group pre-defined classification of companies in\nthe considered sample, provided by Bureau van Dijk's Amadeus database. Since\nthe M.H.DIS method achieves a quite limited satisfactory accuracy in predicting\nthe considered Amadeus classification in the holdout sample, the PROMETHEE\nmethod has been performed then to provide a benchmark sorting procedure useful\nfor comparison purposes.\n", "versions": [{"version": "v1", "created": "Mon, 15 Feb 2021 16:34:37 GMT"}], "update_date": "2021-02-16", "authors_parsed": [["Angilella", "Silvia", ""], ["Pappalardo", "Maria Rosaria", ""]]}, {"id": "2102.08086", "submitter": "Edward Oughton", "authors": "Edward J. Oughton and Ashutosh Jha", "title": "Supportive 5G Infrastructure Policies are Essential for Universal 6G:\n  Assessment using an Open-source Techno-economic Simulation Model utilizing\n  Remote Sensing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.CY cs.NI q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Work has now begun on the sixth generation of cellular technologies (`6G`)\nand cost-efficient global broadband coverage is already becoming a key pillar.\nIndeed, we are still far from providing universal and affordable broadband\nconnectivity, despite this being a key part of the Sustainable Development\nGoals (Target 9.c). Currently, both Mobile Network Operators and governments\nstill lack independent analysis of the strategies that can help achieve this\ntarget with the cellular technologies available (4G and 5G). Therefore, this\npaper undertakes quantitative assessment demonstrating how current 5G policies\naffect universal broadband, as well as drawing conclusions over how decisions\nmade now affect future evolution to 6G. Using a method based on an open-source\ntechno-economic codebase, combining remote sensing with least-cost network\nalgorithms, performance analytics are provided for different 4G and 5G\nuniversal broadband strategies. As an example, the assessment approach is\napplied to India, the world`s second-largest mobile market and a country with\nvery high spectrum prices. The results demonstrate the trade-offs between\ntechnological decisions. This includes demonstrating how important current\ninfrastructure policy is, particularly given fiber backhaul will be essential\nfor delivering 6G quality of service. We find that by eliminating the spectrum\nlicensing costs, 100% 5G population coverage can viably be achieved using fiber\nbackhaul. Therefore, supportive infrastructure policies are essential in\nproviding a superior foundation for evolution to future cellular generation,\nsuch as 6G.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2021 11:15:46 GMT"}, {"version": "v2", "created": "Thu, 18 Feb 2021 12:18:45 GMT"}, {"version": "v3", "created": "Mon, 21 Jun 2021 10:45:46 GMT"}], "update_date": "2021-06-22", "authors_parsed": [["Oughton", "Edward J.", ""], ["Jha", "Ashutosh", ""]]}, {"id": "2102.08107", "submitter": "d'Artis Kancs", "authors": "Pavel Ciaian, d'Artis Kancs, Miroslava Rajcaniova", "title": "Interdependencies between Mining Costs, Mining Rewards and Blockchain\n  Security", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.IT math.IT q-fin.EC q-fin.TR", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper studies to what extent the cost of operating a proof-of-work\nblockchain is intrinsically linked to the cost of preventing attacks, and to\nwhat extent the underlying digital ledger security budgets are correlated with\nthe cryptocurrency market outcomes. We theoretically derive an equilibrium\nrelationship between the cryptocurrency price, mining rewards and mining costs,\nand blockchain security outcomes. Using daily crypto market data for 2014-2021\nand employing the autoregressive distributed lag approach - that allows\ntreating all the relevant moments of the blockchain series as potentially\nendogenous - we provide empirical evidence of cryptocurrency price and mining\nrewards indeed being intrinsically linked to blockchain security outcomes.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2021 12:14:11 GMT"}], "update_date": "2021-02-17", "authors_parsed": [["Ciaian", "Pavel", ""], ["Kancs", "d'Artis", ""], ["Rajcaniova", "Miroslava", ""]]}, {"id": "2102.08162", "submitter": "Nicolas Pr\\\"ollochs", "authors": "Kirill Solovev, Nicolas Pr\\\"ollochs", "title": "Integrating Floor Plans into Hedonic Models for Rent Price Appraisal", "comments": null, "journal-ref": null, "doi": "10.1145/3442381.3449967", "report-no": null, "categories": "cs.LG econ.GN q-fin.EC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online real estate platforms have become significant marketplaces\nfacilitating users' search for an apartment or a house. Yet it remains\nchallenging to accurately appraise a property's value. Prior works have\nprimarily studied real estate valuation based on hedonic price models that take\nstructured data into account while accompanying unstructured data is typically\nignored. In this study, we investigate to what extent an automated visual\nanalysis of apartment floor plans on online real estate platforms can enhance\nhedonic rent price appraisal. We propose a tailored two-staged deep learning\napproach to learn price-relevant designs of floor plans from historical price\ndata. Subsequently, we integrate the floor plan predictions into hedonic rent\nprice models that account for both structural and locational characteristics of\nan apartment. Our empirical analysis based on a unique dataset of 9174 real\nestate listings suggests that current hedonic models underutilize the available\ndata. We find that (1) the visual design of floor plans has significant\nexplanatory power regarding rent prices - even after controlling for structural\nand locational apartment characteristics, and (2) harnessing floor plans\nresults in an up to 10.56% lower out-of-sample prediction error. We further\nfind that floor plans yield a particularly high gain in prediction performance\nfor older and smaller apartments. Altogether, our empirical findings contribute\nto the existing research body by establishing the link between the visual\ndesign of floor plans and real estate prices. Moreover, our approach has\nimportant implications for online real estate platforms, which can use our\nfindings to enhance user experience in their real estate listings.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2021 14:05:33 GMT"}], "update_date": "2021-02-17", "authors_parsed": [["Solovev", "Kirill", ""], ["Pröllochs", "Nicolas", ""]]}, {"id": "2102.08174", "submitter": "Andrea Moro", "authors": "Alberto Bisin and Andrea Moro", "title": "LATE for History", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN econ.EM q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In Historical Economics, Persistence studies document the persistence of some\nhistorical phenomenon or leverage this persistence to identify causal\nrelationships of interest in the present. In this chapter, we analyze the\nimplications of allowing for heterogeneous treatment effects in these studies.\nWe delineate their common empirical structure, argue that heterogeneous\ntreatment effects are likely in their context, and propose minimal abstract\nmodels that help interpret results and guide the development of empirical\nstrategies to uncover the mechanisms generating the effects.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2021 14:22:44 GMT"}], "update_date": "2021-02-17", "authors_parsed": [["Bisin", "Alberto", ""], ["Moro", "Andrea", ""]]}, {"id": "2102.08262", "submitter": "Andry Alamsyah", "authors": "Alisya Putri Rabbani, Andry Alamsyah, Sri Widiyanesti", "title": "An Effort to Measure Customer Relationship Performance in Indonesia's\n  Fintech Industry", "comments": "5 pages, 2 figures, 5 tables", "journal-ref": "The 11th SCBTII 2020 : Sustainable Collaboration in Business,\n  Technology, Information and Innovation presents Virtual International\n  Conference", "doi": null, "report-no": null, "categories": "econ.GN cs.CY cs.LG cs.SI q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The availability of social media simplifies the companies-customers\nrelationship. An effort to engage customers in conversation networks using\nsocial media is called Social Customer Relationship Management (SCRM). Social\nNetwork Analysis helps to understand network characteristics and how active the\nconversation network on social media. Calculating its network properties is\nbeneficial for measuring customer relationship performance. Financial\nTechnology, a new emerging industry that provides digital-based financial\nservices utilize social media to interact with its customers. Measuring SCRM\nperformance is needed in order to stay competitive among others. Therefore, we\naim to explore the SCRM performance of the Indonesia Fintech company. In terms\nof discovering the market majority thought in conversation networks, we perform\nsentiment analysis by classifying into positive and negative opinion. As case\nstudies, we investigate Twitter conversations about GoPay, OVO, Dana, and\nLinkAja during the observation period from 1st October until 1st November 2019.\nThe result of this research is beneficial for business intelligence purposes\nespecially in managing relationships with customers.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2021 16:33:46 GMT"}], "update_date": "2021-02-18", "authors_parsed": [["Rabbani", "Alisya Putri", ""], ["Alamsyah", "Andry", ""], ["Widiyanesti", "Sri", ""]]}, {"id": "2102.08378", "submitter": "d'Artis Kancs", "authors": "Pavel Ciaian, d'Artis Kancs, Miroslava Rajcaniova", "title": "The economic dependency of the Bitcoin security", "comments": "arXiv admin note: substantial text overlap with arXiv:2102.08107", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.CP q-fin.EC q-fin.PR", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  We study to what extent the Bitcoin blockchain security permanently depends\non the underlying distribution of cryptocurrency market outcomes. We use daily\nblockchain and Bitcoin data for 2014-2019 and employ the ARDL approach. We test\nthree equilibrium hypotheses: (i) sensitivity of the Bitcoin blockchain to\nmining reward; (ii) security outcomes of the Bitcoin blockchain and the\nproof-of-work cost; and (iii) the speed of adjustment of the Bitcoin blockchain\nsecurity to deviations from the equilibrium path. Our results suggest that the\nBitcoin price and mining rewards are intrinsically linked to Bitcoin security\noutcomes. The Bitcoin blockchain security's dependency on mining costs is\ngeographically differenced - it is more significant for the global mining\nleader China than for other world regions. After input or output price shocks,\nthe Bitcoin blockchain security reverts to its equilibrium security level.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2021 12:36:21 GMT"}], "update_date": "2021-02-18", "authors_parsed": [["Ciaian", "Pavel", ""], ["Kancs", "d'Artis", ""], ["Rajcaniova", "Miroslava", ""]]}, {"id": "2102.09102", "submitter": "Andry Alamsyah", "authors": "Farid Naufal Aslam, Andry Alamsyah", "title": "The Small World Phenomenon and Network Analysis of ICT Startup\n  Investment in Indonesia and Singapore", "comments": "7 pages, 4 figures, 2 tables", "journal-ref": "The 7th Smart Collaboration for Business in Technology and\n  Information Industry Conference 2016", "doi": null, "report-no": null, "categories": "cs.CY econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The internet's rapid growth stimulates the emergence of start-up companies\nbased on information technology and telecommunication (ICT) in Indonesia and\nSingapore. As the number of start-ups and its investor growth, the network of\nits relationship become larger and complex, but on the other side feel small.\nEveryone in the ICT start-up investment network can be reached in short steps,\nled to a phenomenon called small-world phenomenon, a principle that we are all\nconnected by a short chain of relationships. We investigate the pattern of the\nrelationship between a start-up with its investor and the small world\ncharacteristics using network analysis methodology. The research is conducted\nby creating the ICT start-up investment network model of each country and\ncalculate its small-world network properties to see the characteristic of the\nnetworks. Then we compare and analyze the result of each network model. The\nresult of this research is to give knowledge about the current condition of ICT\nstart-up investment in Indonesia and Singapore. The research is beneficial for\nbusiness intelligence purposes to support decision-making related to ICT\nstart-up investment.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2021 01:20:54 GMT"}], "update_date": "2021-02-19", "authors_parsed": [["Aslam", "Farid Naufal", ""], ["Alamsyah", "Andry", ""]]}, {"id": "2102.09107", "submitter": "Andry Alamsyah", "authors": "Andry Alamsyah, Nurlisa Laksmiani, Lies Anisa Rahimi", "title": "A Core of E-Commerce Customer Experience based on Conversational Data\n  using Network Text Methodology", "comments": "9 pages, 1 figure, 4 tables", "journal-ref": "International Journal of Business, 2018, 23(3)", "doi": null, "report-no": null, "categories": "econ.GN cs.CY q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  E-commerce provides an efficient and effective way to exchange goods between\nsellers and customers. E-commerce has been a popular method for doing business,\nbecause of its simplicity of having commerce activity transparently available,\nincluding customer voice and opinion about their own experience. Those\nexperiences can be a great benefit to understand customer experience\ncomprehensively, both for sellers and future customers. This paper applies to\ne-commerces and customers in Indonesia. Many Indonesian customers expressed\ntheir voice to open social network services such as Twitter and Facebook, where\na large proportion of data is in the form of conversational data. By\nunderstanding customer behavior through open social network service, we can\nhave descriptions about the e-commerce services level in Indonesia. Thus, it is\nrelated to the government's effort to improve the Indonesian digital economy\necosystem. A method for finding core topics in large-scale internet\nunstructured text data is needed, where the method should be fast but\nsufficiently accurate. Processing large-scale data is not a straightforward\njob, it often needs special skills of people and complex software and hardware\ncomputer system. We propose a fast methodology of text mining methods based on\nfrequently appeared words and their word association to form network text\nmethodology. This method is adapted from Social Network Analysis by the model\nrelationships between words instead of actors.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2021 01:33:14 GMT"}], "update_date": "2021-02-19", "authors_parsed": [["Alamsyah", "Andry", ""], ["Laksmiani", "Nurlisa", ""], ["Rahimi", "Lies Anisa", ""]]}, {"id": "2102.09122", "submitter": "Sahar Zandi", "authors": "Sahar Zandi", "title": "Sustainable and Resilient Systems for Intergenerational Justice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Rawls' theory of justice aims at fairness. He does not only think of justice\nbetween exiting parties in existing society, but he also thinks of it between\ngenerations intergenerational justice problem. Rawls' solution to this problem\nis the saving principle, and he says that we are responsible for being just\nwith the next generations. Wolf thinks of our responsibility for future\ngenerations as a kind of financial debt that we have to pay. He also develops\nthe meaning of \"saving\" and says that it is not restricted to the monetary one.\nWolf extends the definition of \"saving\" such that it includes investment on\nbehalf of the next generations as well. In this paper, I want to extend the\nmeaning of \"saving\" to \"using the resources for sustainable and resilient\nsystems.\" By referring to the problem of time, I show that our decision on\nbehalf of the next generations will be rational only if we entirely use the\nnatural resources and wealth to produce sustainable and resilient systems.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2021 02:47:43 GMT"}], "update_date": "2021-02-19", "authors_parsed": [["Zandi", "Sahar", ""]]}, {"id": "2102.09139", "submitter": "Bingyan Han", "authors": "Bingyan Han", "title": "Understanding algorithmic collusion with experience replay", "comments": "References updated. Comments are welcome", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.AI cs.GT q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In an infinitely repeated pricing game, pricing algorithms based on\nartificial intelligence (Q-learning) may consistently learn to charge\nsupra-competitive prices even without communication. Although concerns on\nalgorithmic collusion have arisen, little is known on underlying factors. In\nthis work, we experimentally analyze the dynamics of algorithms with three\nvariants of experience replay. Algorithmic collusion still has roots in human\npreferences. Randomizing experience yields prices close to the static Bertrand\nequilibrium and higher prices are easily restored by favoring the latest\nexperience. Moreover, relative performance concerns also stabilize the\ncollusion. Finally, we investigate the scenarios with heterogeneous agents and\ntest robustness on various factors.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2021 03:28:41 GMT"}, {"version": "v2", "created": "Sun, 21 Mar 2021 13:57:36 GMT"}], "update_date": "2021-03-23", "authors_parsed": [["Han", "Bingyan", ""]]}, {"id": "2102.09207", "submitter": "Anthony Strittmatter", "authors": "Anthony Strittmatter, Conny Wunsch", "title": "The Gender Pay Gap Revisited with Big Data: Do Methodological Choices\n  Matter?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC stat.AP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The vast majority of existing studies that estimate the average unexplained\ngender pay gap use unnecessarily restrictive linear versions of the\nBlinder-Oaxaca decomposition. Using a notably rich and large data set of 1.7\nmillion employees in Switzerland, we investigate how the methodological\nimprovements made possible by such big data affect estimates of the unexplained\ngender pay gap. We study the sensitivity of the estimates with regard to i) the\navailability of observationally comparable men and women, ii) model flexibility\nwhen controlling for wage determinants, and iii) the choice of different\nparametric and semi-parametric estimators, including variants that make use of\nmachine learning methods. We find that these three factors matter greatly.\nBlinder-Oaxaca estimates of the unexplained gender pay gap decline by up to 39%\nwhen we enforce comparability between men and women and use a more flexible\nspecification of the wage equation. Semi-parametric matching yields estimates\nthat when compared with the Blinder-Oaxaca estimates, are up to 50% smaller and\nalso less sensitive to the way wage determinants are included.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2021 08:12:32 GMT"}, {"version": "v2", "created": "Fri, 19 Feb 2021 08:59:00 GMT"}], "update_date": "2021-02-22", "authors_parsed": [["Strittmatter", "Anthony", ""], ["Wunsch", "Conny", ""]]}, {"id": "2102.09608", "submitter": "Anton Pichler", "authors": "Anton Pichler, Marco Pangallo, R. Maria del Rio-Chanona, Fran\\c{c}ois\n  Lafond, J. Doyne Farmer", "title": "In and out of lockdown: Propagation of supply and demand shocks in a\n  dynamic input-output model", "comments": "54 pages, 17 figures, 8 tables. arXiv admin note: text overlap with\n  arXiv:2005.10585", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Economic shocks due to Covid-19 were exceptional in their severity,\nsuddenness and heterogeneity across industries. To study the upstream and\ndownstream propagation of these industry-specific demand and supply shocks, we\nbuild a dynamic input-output model inspired by previous work on the economic\nresponse to natural disasters. We argue that standard production functions, at\nleast in their most parsimonious parametrizations, are not adequate to model\ninput substitutability in the context of Covid-19 shocks. We use a survey of\nindustry analysts to evaluate, for each industry, which inputs were absolutely\nnecessary for production over a short time period. We calibrate our model on\nthe UK economy and study the economic effects of the lockdown that was imposed\nat the end of March and gradually released in May. Looking back at predictions\nthat we released in May, we show that the model predicted aggregate dynamics\nvery well, and sectoral dynamics to a large extent. We discuss the relative\nextent to which the model's dynamics and performance was due to the choice of\nthe production function or the choice of an exogenous shock scenario. To\nfurther explore the behavior of the model, we use simpler scenarios with only\ndemand or supply shocks, and find that popular metrics used to predict a priori\nthe impact of shocks, such as output multipliers, are only mildly useful.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2021 20:49:05 GMT"}], "update_date": "2021-02-22", "authors_parsed": [["Pichler", "Anton", ""], ["Pangallo", "Marco", ""], ["del Rio-Chanona", "R. Maria", ""], ["Lafond", "François", ""], ["Farmer", "J. Doyne", ""]]}, {"id": "2102.09625", "submitter": "Marco Mariani", "authors": "Giuseppe Francesco Gori, Patrizia Lattarulo, Marco Mariani", "title": "The Expediting Effect of Monitoring on Infrastructural Works. A\n  Regression-Discontinuity Approach with Multiple Assignment Variables", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC stat.AP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Decentralised government levels are often entrusted with the management of\npublic works and required to ensure well-timed infrastructure delivery to their\ncommunities. We investigate whether monitoring the activity of local procuring\nauthorities during the execution phase of the works they manage may expedite\nthe infrastructure delivery process. Focussing on an Italian regional law which\nimposes monitoring by the regional government on \"strategic\" works carried out\nby local buyers, we draw causal claims using a regression-discontinuity\napproach, made unusual by the presence of multiple assignment variables.\nEstimation is performed through discrete-time survival analysis techniques.\nResults show that monitoring does expedite infrastructure delivery.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2021 15:14:41 GMT"}], "update_date": "2021-02-22", "authors_parsed": [["Gori", "Giuseppe Francesco", ""], ["Lattarulo", "Patrizia", ""], ["Mariani", "Marco", ""]]}, {"id": "2102.10145", "submitter": "Andrea Moro", "authors": "Alberto Bisin and Andrea Moro", "title": "Learning Epidemiology by Doing: The Empirical Implications of a\n  Spatial-SIR Model with Behavioral Responses", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN econ.TH q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We simulate a spatial behavioral model of the diffusion of an infection to\nunderstand the role of geographic characteristics: the number and distribution\nof outbreaks, population size, density, and agents' movements. We show that\nseveral invariance properties of the SIR model concerning these variables do\nnot hold when agents interact with neighbors in a (two dimensional)\ngeographical space. Indeed, the spatial model's local interactions generate\nmatching frictions and local herd immunity effects, which play a fundamental\nrole in the infection dynamics. We also show that geographical factors affect\nhow behavioral responses affect the epidemics. We derive relevant implications\nfor estimating the effects of the epidemics and policy interventions that use\npanel data from several geographical units.\n", "versions": [{"version": "v1", "created": "Fri, 19 Feb 2021 20:16:20 GMT"}, {"version": "v2", "created": "Thu, 3 Jun 2021 13:15:33 GMT"}], "update_date": "2021-06-04", "authors_parsed": [["Bisin", "Alberto", ""], ["Moro", "Andrea", ""]]}, {"id": "2102.10211", "submitter": "Thomas Victor Conti", "authors": "Thomas V. Conti", "title": "M\\'etodos Emp\\'iricos Aplicados \\`a An\\'alise Econ\\^omica do Direito", "comments": "Book chapter manuscript, in Portuguese", "journal-ref": "Em: YEUNG, Luciana L. (Org.). An\\'alise Econ\\^omica do Direito:\n  Temas Contempor\\^aneos. S\\~ao Paulo: Actual, 2020", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Nas \\'ultimas d\\'ecadas houve forte mudan\\c{c}a no perfil das\npublica\\c{c}\\~oes em an\\'alise econ\\^omica do direito e nos m\\'etodos\nemp\\'iricos mais utilizados. Por\\'em, nos pr\\'oximos anos a mudan\\c{c}a pode\nser maior e mais r\\'apida, exigindo adapta\\c{c}\\~ao dos pesquisadores da\n\\'area. Neste cap\\'itulo analiso algumas tend\\^encias recentes de mudan\\c{c}a e\noportunidades futuras que se avizinham a partir avan\\c{c}os nas bases de dados,\nestat\\'istica, computa\\c{c}\\~ao e no arcabou\\c{c}o regulat\\'orio dos pa\\'ises.\nAvan\\c{c}o a hip\\'otese de que expans\\~ao de objetos e m\\'etodos favorecer\\'a\nequipes de pesquisa maiores e interdisciplinares e apresento evid\\^encias\ncircunstanciais a partir de dados bibliom\\'etricos de que isso j\\'a vem\nacontecendo no Journal of Law and Economics.\n", "versions": [{"version": "v1", "created": "Sat, 20 Feb 2021 00:17:33 GMT"}], "update_date": "2021-02-23", "authors_parsed": [["Conti", "Thomas V.", ""]]}, {"id": "2102.10453", "submitter": "Hiroyuki Kasahara", "authors": "Victor Chernozhukov, Hiroyuki Kasahara, Paul Schrimpf", "title": "The Association of Opening K-12 Schools with the Spread of COVID-19 in\n  the United States: County-Level Panel Data Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper empirically examines how the opening of K-12 schools and colleges\nis associated with the spread of COVID-19 using county-level panel data in the\nUnited States. Using data on foot traffic and K-12 school opening plans, we\nanalyze how an increase in visits to schools and opening schools with different\nteaching methods (in-person, hybrid, and remote) is related to the 2-weeks\nforward growth rate of confirmed COVID-19 cases. Our debiased panel data\nregression analysis with a set of county dummies, interactions of state and\nweek dummies, and other controls shows that an increase in visits to both K-12\nschools and colleges is associated with a subsequent increase in case growth\nrates. The estimates indicate that fully opening K-12 schools with in-person\nlearning is associated with a 5 (SE = 2) percentage points increase in the\ngrowth rate of cases. We also find that the positive association of K-12 school\nvisits or in-person school openings with case growth is stronger for counties\nthat do not require staff to wear masks at schools. These results have a causal\ninterpretation in a structural model with unobserved county and time\nconfounders. Sensitivity analysis shows that the baseline results are robust to\ntiming assumptions and alternative specifications.\n", "versions": [{"version": "v1", "created": "Sat, 20 Feb 2021 22:00:53 GMT"}, {"version": "v2", "created": "Tue, 15 Jun 2021 18:43:32 GMT"}], "update_date": "2021-06-17", "authors_parsed": [["Chernozhukov", "Victor", ""], ["Kasahara", "Hiroyuki", ""], ["Schrimpf", "Paul", ""]]}, {"id": "2102.10756", "submitter": "Masaaki Fujii", "authors": "Masaaki Fujii, Akihiko Takahashi", "title": "Equilibrium Price Formation with a Major Player and its Mean Field Limit", "comments": "typos corrected, comments added", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF econ.GN q-fin.EC q-fin.TR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this article, we consider the problem of equilibrium price formation in an\nincomplete securities market consisting of one major financial firm and a large\nnumber of minor firms. They carry out continuous trading via the securities\nexchange to minimize their cost while facing idiosyncratic and common noises as\nwell as stochastic order flows from their individual clients. The equilibrium\nprice process that balances demand and supply of the securities, including the\nfunctional form of the price impact for the major firm, is derived endogenously\nboth in the market of finite population size and in the corresponding mean\nfield limit.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2021 03:43:34 GMT"}, {"version": "v2", "created": "Fri, 12 Mar 2021 10:06:16 GMT"}], "update_date": "2021-03-15", "authors_parsed": [["Fujii", "Masaaki", ""], ["Takahashi", "Akihiko", ""]]}, {"id": "2102.10909", "submitter": "Semyon Malamud", "authors": "Semyon Malamud, Anna Cieslak, and Andreas Schrimpf", "title": "Optimal Transport of Information", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN math.OC q-fin.EC stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the general problem of Bayesian persuasion (optimal information\ndesign) with continuous actions and continuous state space in arbitrary\ndimensions. First, we show that with a finite signal space, the optimal\ninformation design is always given by a partition. Second, we take the limit of\nan infinite signal space and characterize the solution in terms of a\nMonge-Kantorovich optimal transport problem with an endogenous information\ntransport cost. We use our novel approach to: 1. Derive necessary and\nsufficient conditions for optimality based on Bregman divergences for\nnon-convex functions. 2. Compute exact bounds for the Hausdorff dimension of\nthe support of an optimal policy. 3. Derive a non-linear, second-order partial\ndifferential equation whose solutions correspond to regular optimal policies.\nWe illustrate the power of our approach by providing explicit solutions to\nseveral non-linear, multidimensional Bayesian persuasion problems.\n", "versions": [{"version": "v1", "created": "Mon, 22 Feb 2021 11:28:36 GMT"}, {"version": "v2", "created": "Sat, 27 Feb 2021 07:52:10 GMT"}, {"version": "v3", "created": "Mon, 8 Mar 2021 08:41:59 GMT"}, {"version": "v4", "created": "Tue, 9 Mar 2021 13:43:29 GMT"}], "update_date": "2021-03-10", "authors_parsed": [["Malamud", "Semyon", ""], ["Cieslak", "Anna", ""], ["Schrimpf", "Andreas", ""]]}, {"id": "2102.11729", "submitter": "Emmanuel Hostia Yindi", "authors": "Emmanuel H.Yindi, Immaculate Maumoh and Prisillah L. Mahavile", "title": "Exploring the role of Awareness, Government Policy, and Infrastructure\n  in adapting B2C E-Commerce to East African Countries", "comments": "14 pages, 2 figure, 4 table, and 1 Appendix", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  -It has considered almost 30 years since the emergence of e-commerce, but it\nis still a global phenomenon to this day. E-commerce is replacing the\ntraditional way of doing business. Yet, expectations of sustainable development\nhave been unmet. There are still significant differences between online and\noffline shopping. Although many academic studies have conducted on the adoption\nof various forms of ecommerce, there are little research topics on East African\ncountries, The adoption of B2C e-commerce in East African countries has faced\nmany challenges that have been unaddressed because of the complex nature of\ne-commerce in these nations. This study examines the adaptation of B2C in East\nAfrica using the theory of diffusion of innovation. Data collected from 279\nparticipants in Tanzania were used to test the research model. The results show\nthat awareness, infrastructure innovation and social media play a significant\nrole in the adoption of e-commerce. Lack of good e-commerce policy and\nawareness discourages the adoption of B2C. We also examine how time influences\nthe adaptation of B2C e-commerce to the majority. So, unlike previous adoption\nstudies, which have tended to focus on technology, organizational, and\nenvironmental factors, this study guides the government on how to use social\nmedia to promote B2C e-commerce.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2021 14:43:00 GMT"}], "update_date": "2021-02-24", "authors_parsed": [["Yindi", "Emmanuel H.", ""], ["Maumoh", "Immaculate", ""], ["Mahavile", "Prisillah L.", ""]]}, {"id": "2102.11807", "submitter": "Toshiko Matsui", "authors": "Toshiko Matsui and Daniel Perez", "title": "Data-driven analysis of central bank digital currency (CBDC) projects\n  drivers", "comments": "14 pages (8 pages, excluding references and annex), 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we use a variety of machine learning methods to quantify the\nextent to which economic and technological factors are predictive of the\nprogression of Central Bank Digital Currencies (CBDC) within a country, using\nas our measure of this progression the CBDC project index (CBDCPI). We find\nthat a financial development index is the most important feature for our model,\nfollowed by the GDP per capita and an index of the voice and accountability of\nthe country's population. Our results are consistent with previous qualitative\nresearch which finds that countries with a high degree of financial development\nor digital infrastructure have more developed CBDC projects. Further, we obtain\nrobust results when predicting the CBDCPI at different points in time.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2021 17:15:56 GMT"}], "update_date": "2021-02-24", "authors_parsed": [["Matsui", "Toshiko", ""], ["Perez", "Daniel", ""]]}, {"id": "2102.11929", "submitter": "Bernardo Furtado", "authors": "Bernardo Alves Furtado", "title": "PolicySpace2: modeling markets and endogenous housing policies", "comments": "29 pages, 4 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA econ.GN physics.soc-ph q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Policymakers decide on alternative policies facing restricted budgets and\nuncertain, ever-changing future. Designing housing policies is further\ndifficult given the heterogeneous characteristics of properties themselves and\nthe intricacy of housing markets and the spatial context of cities. We propose\nPolicySpace2 (PS2) as an adapted and extended version of the open source\nPolicySpace agent-based model. PS2 is a computer simulation that relies on\nempirically detailed spatial data to model real estate, along with labor,\ncredit, and goods and services markets. Interaction among workers, firms, a\nbank, households and municipalities follow the literature benchmarks to\nintegrate economic, spatial and transport literature. PS2 is applied to a\ncomparison among three competing municipal housing policies aimed at\nalleviating poverty: (a) property acquisition and distribution, (b) rental\nvouchers, and (c) monetary aid. Within the model context, the monetary aid,\nthat is, smaller amounts of help for a larger number of households, makes the\neconomy perform better in terms of production, consumption, reduction of\ninequality, and maintenance of financial duties. PS2 as such is also a\nframework that may be further adapted to a number of related research\nquestions.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2021 20:29:59 GMT"}, {"version": "v2", "created": "Tue, 29 Jun 2021 14:30:37 GMT"}], "update_date": "2021-06-30", "authors_parsed": [["Furtado", "Bernardo Alves", ""]]}, {"id": "2102.12300", "submitter": "Andry Alamsyah", "authors": "Andry Alamsyah, Fariz Denada Sudrajat, Herry Irawan", "title": "Property Business Classification Model Based on Indonesia E-Commerce\n  Data", "comments": "6 pages, 3 figures, 4 tables", "journal-ref": "The 8th International Conference on Sustainable Collaboration in\n  Business, Technology, Information and Innovation, 2017", "doi": null, "report-no": null, "categories": "econ.GN cs.CY q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Online property business or known as e-commerce is currently experiencing an\nincrease in home sales. Indonesia's e-commerce property business has positive\ntrending shown by the increasing sales of more than 500% from 2011 to 2015. A\nprediction of the property price is important to help investors or the public\nto have accurate information before buying property. One of the methods for\nprediction is a classification based on several distinctive property industry\nattributes, such as building size, land size, number of rooms, and location.\nToday, data is easily obtained, there are many open data from E-commerce sites.\nE-commerce contains information about homes and other properties advertised to\nsell. People also regularly visit the site to find the right property or to\nsell the property using price information which collectively available as open\ndata. To predict the property sales, this research employed two different\nclassification methods in Data Mining which are Decision Tree and k-NN\nclassification. We compare which model classification is better to predict\nproperty price and their attributes. We use Indonesia's biggest property-based\ne-commerce site Rumah123.com as our open data source, and choose location\nBandung in our experiment. The accuracy result of the decision tree is 75% and\nKNN is 71%, other than that k-NN can explore more data patterns than the\nDecision Tree.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2021 14:29:34 GMT"}], "update_date": "2021-02-25", "authors_parsed": [["Alamsyah", "Andry", ""], ["Sudrajat", "Fariz Denada", ""], ["Irawan", "Herry", ""]]}, {"id": "2102.12309", "submitter": "Ravshanbek Khodzhimatov", "authors": "Ravshanbek Khodzhimatov, Stephan Leitner, Friederike Wall", "title": "Interactions between social norms and incentive mechanisms in\n  organizations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We focus on how individual behavior that complies with social norms\ninterferes with performance-based incentive mechanisms in organizations with\nmultiple distributed decision-making agents. We model social norms to emerge\nfrom interactions between agents: agents observe other the agents' actions and,\nfrom these observations, induce what kind of behavior is socially acceptable.\nBy complying with the induced socially accepted behavior, agents experience\nutility. Also, agents get utility from a pay-for-performance incentive\nmechanism. Thus, agents pursue two objectives. We place the interaction between\nsocial norms and performance-based incentive mechanisms in the complex\nenvironment of an organization with distributed decision-makers, in which a set\nof interdependent tasks is allocated to multiple agents. The results suggest\nthat, unless the sets of assigned tasks are highly correlated, complying with\nemergent socially accepted behavior is detrimental to the organization's\nperformance. However, we find that incentive schemes can help offset the\nperformance loss by applying individual-based incentives in environments with\nlower task-complexity and team-based incentives in environments with higher\ntask-complexity.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2021 14:37:42 GMT"}], "update_date": "2021-02-25", "authors_parsed": [["Khodzhimatov", "Ravshanbek", ""], ["Leitner", "Stephan", ""], ["Wall", "Friederike", ""]]}, {"id": "2102.12320", "submitter": "Andry Alamsyah", "authors": "Andry Alamsyah, Endang Sofyan, Tsana Hasti Nabila", "title": "Measuring Marketing Communications Mix Effort Using Magnitude Of\n  Influence And Influence Rank Metric", "comments": "7 pages, 8 figures", "journal-ref": "The 7th Smart Collaboration for Business in Technology and\n  Information Industry, 2016", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In the context of modern marketing, Twitter is considered a communication\nplatform to spread information. Many companies create and acquire several\nTwitter accounts to support and perform varieties of marketing mix activities.\nInitially, each accounts used to capture a specific market profile. Together,\nthe accounts create a network of information that provide consumer to the\ninformation they need depends on their contextual utilization. From many\naccounts available, we have the fundamental question on how to measure the\ninfluence of each account in the market based not only on their relations but\nalso on the effects of their postings. The magnitude of Influence (MOI) metric\nis adapted together with Influence Rank (IR) measurement of accounts in their\nsocial network neighborhood. We use social network analysis approach to analyze\n65 accounts in the social network of an Indonesian mobile phone network\noperator, Telkomsel which involved in marketing communications mix activities\nthrough series of related tweets. Using social network provide the idea of the\nactivity in building and maintaining relationships with the target audience.\nThis paper shows the results of the most potential accounts based on the\nnetwork structure and engagement. Based on this research, the more number of\nfollowers one account has, the more responsibility it has to generate the\ninteraction from their followers in order to achieve the expected\neffectiveness. The focus of this paper is to determine the most potential\naccounts in the application of marketing communications mix in Twitter.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2021 14:56:47 GMT"}], "update_date": "2021-02-25", "authors_parsed": [["Alamsyah", "Andry", ""], ["Sofyan", "Endang", ""], ["Nabila", "Tsana Hasti", ""]]}, {"id": "2102.12337", "submitter": "Andry Alamsyah", "authors": "Andry Alamsyah, Maribella Syawiluna", "title": "Mapping Organization Knowledge Network and Social Media Based Reputation\n  Management", "comments": "9 pages, 8 figues, 2 tables", "journal-ref": "Journal of Data Science and Its Applications, 2018, Vol 1 No 1", "doi": "10.21108/jdsa.2018.1.3", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Knowledge management is an important aspect of an organization, especially in\nthe ICT industry. Having more control of it is essentials for the organization\nto stay competitive in the business. One way to assess the organization's\nknowledge capital is by measuring employee knowledge networks and their\npersonal reputation in social media. Using this measurement, we see how\nemployees build relationships around their peer networks or clients virtually.\nWe are also able to see how knowledge networks support organizational\nperformance. The research objective is to map knowledge network and reputation\nformulation in order to fully understand how knowledge flow and whether\nemployee reputation has a higher degree of influence in the organization's\nknowledge network. We particularly develop formulas to measure knowledge\nnetworks and personal reputation based on their social media activities. As a\ncase study, we pick an Indonesian ICT company that actively build their\nbusiness around their employee peer knowledge outside the company. For the\nknowledge network, we perform data collection by conducting interviews. For\nreputation management, we collect data from several popular social media. We\nbase our work on Social Network Analysis (SNA) methodology. The result shows\nthat employees' knowledge is directly proportional to their reputation, but\nthere are different reputations level on different social media observed in\nthis research.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2021 15:15:16 GMT"}], "update_date": "2021-02-25", "authors_parsed": [["Alamsyah", "Andry", ""], ["Syawiluna", "Maribella", ""]]}, {"id": "2102.12350", "submitter": "Andry Alamsyah", "authors": "Andry Alamsyah, Sheila Shafira, Muhamad Alfin Yudhistira", "title": "Summarizing Online Conversation of Indonesia Tourism Industry using\n  Network Text Analysis", "comments": "6 pages, 2 figures, 2 tables", "journal-ref": "The 8th International Conference on Sustainable Collaboration in\n  Business, Technology, Information and Innovation, 2017", "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The tourism industry is one of the potential revenues and has an important\nrole in economics in Indonesia. The tourism Industry brings job and business\nopportunities, foreign exchange earnings, and infrastructure development,\ntourism also plays the role of one of the main drivers in socio-economic\nprogress in Indonesia. The number of foreign tourists visiting Indonesia\nincrease cumulatively and has reached 10.41 million visits or an increase of\n10.46 percent from the same period in the previous year. Government trying to\nincrease the number of tourists to visit Indonesia by promoting many Indonesian\ntourist attractions.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2021 15:33:14 GMT"}], "update_date": "2021-02-25", "authors_parsed": [["Alamsyah", "Andry", ""], ["Shafira", "Sheila", ""], ["Yudhistira", "Muhamad Alfin", ""]]}, {"id": "2102.12378", "submitter": "Emmanuel Hostia Yindi", "authors": "Immaculate Maumoh and Emmanuel H. Yindi", "title": "Understanding the Farmers, Environmental Citizenship Behaviors Towards\n  Climate Change. The Moderating Mediating Role of Environmental Knowledge and\n  Ascribed Responsibility", "comments": "14 pages,6 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Knowledge is known to be a pre-condition for an individuals behavior. For the\nmost efficient informational strategies for education, it is essential that we\nidentify the types of knowledge that promote behavior effectively and\ninvestigate their structure. The purpose of this paper is therefore to examine\nthe factors that affect Kenyan farmers, environmental citizenship behavior\n(ECB) in the context of Adaptation and mitigation (Climate smart agriculture).\nTo achieve this objective, a theoretical framework has been developed based on\nvalue belief norm (VBN) theory. Design/methodology/approach, Data were obtained\nfrom 350 farmers using a survey method. Partial lease square structural\nequation modelling (PLS-SEM) was used to examine the hypothetical model. The\nresults of PLS analysis confirm the direct and mediating effect of the causal\nsequences of the variables in the VBN model. The moderating role of\nEnvironmental knowledge has been seen to be impactful in Climate Smart\nAgriculture.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2021 15:05:51 GMT"}], "update_date": "2021-02-25", "authors_parsed": [["Maumoh", "Immaculate", ""], ["Yindi", "Emmanuel H.", ""]]}, {"id": "2102.12423", "submitter": "Ren\\'e A\\\"id", "authors": "Ren\\'e A\\\"id, Sara Biagini", "title": "Optimal dynamic regulation of carbon emissions market: A variational\n  approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.MF", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We consider the problem of reducing the carbon emissions of a set of firms\nover a finite horizon. A regulator dynamically allocates emission allowances to\neach firm. Firms face idiosyncratic as well as common economic shocks on\nemissions, and have linear quadratic abatement costs. Firms can trade\nallowances so to minimise total expected costs, from abatement and trading plus\na quadratic terminal penalty. Using variational methods, we exhibit in\nclosed-form the market equilibrium in function of regulator's dynamic\nallocation. We then solve the Stackelberg game between the regulator and the\nfirms. Again, we obtain a closed-form expression of the dynamic allocation\npolicies that allow a desired expected emission reduction. Optimal policies are\nnot unique but share common properties. Surprisingly, all optimal policies\ninduce a constant abatement effort and a constant price of allowances. Dynamic\nallocations outperform static ones because of adjustment costs and uncertainty,\nin particular given the presence of common shocks. Our results are robust to\nsome extensions, like risk aversion of firms or different penalty functions.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2021 17:32:36 GMT"}], "update_date": "2021-02-25", "authors_parsed": [["Aïd", "René", ""], ["Biagini", "Sara", ""]]}, {"id": "2102.12454", "submitter": "Panpan Zhang", "authors": "Tao Wang, Shiying Xiao, Jun Yan, Panpan Zhang", "title": "Regional and Sectoral Structures and Their Dynamics of Chinese Economy:\n  A Network Perspective from Multi-Regional Input-Output Tables", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2021.126196", "report-no": null, "categories": "physics.soc-ph econ.GN q-fin.EC stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A multi-regional input-output table (MRIOT) containing the transactions among\nthe region-sectors in an economy defines a weighted and directed network. Using\nnetwork analysis tools, we analyze the regional and sectoral structure of the\nChinese economy and their temporal dynamics from 2007 to 2012 via the MRIOTs of\nChina. Global analyses are done with network topology measures. Growth-driving\nprovince-sector clusters are identified with community detection methods.\nInfluential province-sectors are ranked by weighted PageRank scores. The\nresults revealed a few interesting and telling insights. The level of\ninter-province-sector activities increased with the rapid growth of the\nnational economy, but not as fast as that of intra-province economic\nactivities. Regional community structures were deeply associated with\ngeographical factors. The community heterogeneity across the regions was high\nand the regional fragmentation increased during the study period. Quantified\nmetrics assessing the relative importance of the province-sectors in the\nnational economy echo the national and regional economic development policies\nto a certain extent.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2021 18:38:03 GMT"}], "update_date": "2021-07-14", "authors_parsed": [["Wang", "Tao", ""], ["Xiao", "Shiying", ""], ["Yan", "Jun", ""], ["Zhang", "Panpan", ""]]}, {"id": "2102.12809", "submitter": "Alfred Galichon", "authors": "Guillaume Carlier, Victor Chernozhukov, Gwendoline De Bie and Alfred\n  Galichon", "title": "Vector quantile regression and optimal transport, from theory to\n  numerics", "comments": "35 pages, 19 figures, 4 tables. arXiv admin note: text overlap with\n  arXiv:1610.06833", "journal-ref": "Empirical Economics (2020)", "doi": "10.1007/s00181-020-01919-y", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  In this paper, we first revisit the Koenker and Bassett variational approach\nto (univariate) quantile regression, emphasizing its link with latent factor\nrepresentations and correlation maximization problems. We then review the\nmultivariate extension due to Carlier et al. (2016, 2017) which relates vector\nquantile regression to an optimal transport problem with mean independence\nconstraints. We introduce an entropic regularization of this problem, implement\na gradient descent numerical method and illustrate its feasibility on\nunivariate and bivariate examples.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2021 12:25:11 GMT"}], "update_date": "2021-02-26", "authors_parsed": [["Carlier", "Guillaume", ""], ["Chernozhukov", "Victor", ""], ["De Bie", "Gwendoline", ""], ["Galichon", "Alfred", ""]]}, {"id": "2102.12811", "submitter": "Alfred Galichon", "authors": "Alfred Galichon and Bernard Salani\\'e", "title": "Matching with Trade-offs: Revealed Preferences over Competing\n  Characteristics", "comments": "62 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We investigate in this paper the theory and econometrics of optimal matchings\nwith competing criteria. The surplus from a marriage match, for instance, may\ndepend both on the incomes and on the educations of the partners, as well as on\ncharacteristics that the analyst does not observe. Even if the surplus is\ncomplementary in incomes, and complementary in educations, imperfect\ncorrelation between income and education at the individual level implies that\nthe social optimum must trade off matching on incomes and matching on\neducations. Given a flexible specification of the surplus function, we\ncharacterize under mild assumptions the properties of the set of feasible\nmatchings and of the socially optimal matching. Then we show how data on the\ncovariation of the types of the partners in observed matches can be used to\ntest that the observed matches are socially optimal for this specification, and\nto estimate the parameters that define social preferences over matches.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2021 12:27:16 GMT"}], "update_date": "2021-02-26", "authors_parsed": [["Galichon", "Alfred", ""], ["Salanié", "Bernard", ""]]}, {"id": "2102.13047", "submitter": "Furkan Sezer", "authors": "Furkan Sezer, Hossein Khazaei, and Ceyhun Eksin", "title": "Social Welfare Maximization and Conformism via Information Design in\n  Linear-Quadratic-Gaussian Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.MA cs.SY econ.GN eess.SY q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We consider linear-quadratic Gaussian (LQG) games in which players have\nquadratic payoffs that depend on the players' actions and an unknown\npayoff-relevant state, and signals on the state that follow a Gaussian\ndistribution conditional on the state realization. An information designer\ndecides the fidelity of information revealed to the players in order to\nmaximize the social welfare of the players or reduce the disagreement among\nplayers' actions. Leveraging the semi-definiteness of the information design\nproblem, we derive analytical solutions for these objectives under specific LQG\ngames. We show that full information disclosure maximizes social welfare when\nthere is a common payoff-relevant state, when there is strategic\nsubstitutability in the actions of players, or when the signals are public.\nNumerical results show that as strategic substitution increases, the value of\nthe information disclosure increases. When the objective is to induce\nconformity among players' actions, hiding information is optimal. Lastly, we\nconsider the information design objective that is a weighted combination of\nsocial welfare and cohesiveness of players' actions. We obtain an interval for\nthe weights where full information disclosure is optimal under public signals\nfor games with strategic substitutability. Numerical solutions show that the\nactual interval where full information disclosure is optimal gets close to the\nanalytical interval obtained as substitution increases.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2021 17:56:39 GMT"}], "update_date": "2021-02-26", "authors_parsed": [["Sezer", "Furkan", ""], ["Khazaei", "Hossein", ""], ["Eksin", "Ceyhun", ""]]}, {"id": "2102.13110", "submitter": "Richard Tol", "authors": "Richard S.J. Tol", "title": "The economic impact of weather and climate", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I propose a new conceptual framework to disentangle the impacts of weather\nand climate on economic activity and growth: A stochastic frontier model with\nclimate in the production frontier and weather shocks as a source of\ninefficiency. I test it on a sample of 160 countries over the period 1950-2014.\nTemperature and rainfall determine production possibilities in both rich and\npoor countries; positively in cold countries and negatively in hot ones.\nWeather anomalies reduce inefficiency in rich countries but increase\ninefficiency in poor and hot countries; and more so in countries with low\nweather variability. The climate effect is larger that the weather effect.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2021 18:08:12 GMT"}, {"version": "v2", "created": "Mon, 8 Mar 2021 18:13:25 GMT"}, {"version": "v3", "created": "Wed, 5 May 2021 18:44:38 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Tol", "Richard S. J.", ""]]}, {"id": "2102.13157", "submitter": "Albert Zevelev", "authors": "Yildiray Yildirim and Albert Alex Zevelev", "title": "Does Bankruptcy Protection Affect Asset Prices? Evidence from changes in\n  Homestead Exemptions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Does the ability to protect an asset from unsecured creditors affect its\nprice? This paper identifies the impact of bankruptcy protection on house\nprices using 139 changes in homestead exemptions. Large increases in the\nhomestead exemption raised house prices 3% before 2005. Smaller exemption\nincreases, to adjust for inflation, did not affect house prices. The effect\ndisappeared after BAPCPA, a 2005 federal law designed to prevent bankruptcy\nabuse. The effect was bigger in inelastic locations.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2021 20:32:45 GMT"}], "update_date": "2021-03-01", "authors_parsed": [["Yildirim", "Yildiray", ""], ["Zevelev", "Albert Alex", ""]]}, {"id": "2102.13464", "submitter": "Eiji Yamamura", "authors": "Eiji Yamamura", "title": "Granddaughter and voting for a female candidate", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study examines the influence of grandchildren's gender on grandparents'\nvoting behavior using independently collected individual-level data. The survey\nwas conducted immediately after the House of Councilors election in Japan. I\nobserved that individuals with a granddaughter were more likely to vote for\nfemale candidates by around 10 % than those without. However, having a daughter\ndid not affect the parents' voting behavior. Furthermore, having a son or a\ngrandson did not influence grandparents' voting behavior. This implies that\ngrandparents voted for their granddaughter's future benefit because\ngranddaughters may be too young vote in a male-dominated and aging society.\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2021 23:22:12 GMT"}], "update_date": "2021-03-01", "authors_parsed": [["Yamamura", "Eiji", ""]]}, {"id": "2102.13538", "submitter": "Valeria Fanghella", "authors": "Valeria Fanghella, Thi-Thanh-Tam Vu, Luigi Mittone", "title": "Priming prosocial behavior and expectations in response to the Covid-19\n  pandemic -- Evidence from an online experiment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper studies whether and how differently projected information about\nthe impact of the Covid-19 pandemic affects individuals' prosocial behavior and\nexpectations on future outcomes. We conducted an online experiment with British\nparticipants (N=961) when the UK introduced its first lockdown and the outbreak\nwas on its growing stage. Participants were primed with either the\nenvironmental or economic consequences (i.e., negative primes), or the\nenvironmental or economic benefits (i.e., positive primes) of the pandemic, or\nwith neutral information. We measured priming effects on an incentivized\ntake-and-give dictator game and on participants' expectations about future\nenvironmental quality and economic growth. Our results show that primes affect\nparticipants' expectations, but not their prosociality. In particular,\nparticipants primed with environmental consequences hold a more pessimistic\nview on future environmental quality, while those primed with economic benefits\nare more optimistic about future economic growth. Instead, the positive\nenvironmental prime and the negative economic prime do not influence\nexpectations. Our results offer insights into how information affects behavior\nand expectations during the Covid-19 pandemic.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2021 15:16:35 GMT"}], "update_date": "2021-03-01", "authors_parsed": [["Fanghella", "Valeria", ""], ["Vu", "Thi-Thanh-Tam", ""], ["Mittone", "Luigi", ""]]}, {"id": "2102.13539", "submitter": "Sam Hamels", "authors": "Sam Hamels, Eline Himpe, Jelle Laverge, Marc Delghust, Kjartan Van den\n  Brande, Arnold Janssens and Johan Albrecht", "title": "The use of primary energy factors and CO2 intensities -- reviewing the\n  state of play in academic literature", "comments": "34 pages, 1 figure", "journal-ref": "Renew. Sustain. Energy Rev. 146 (2021)", "doi": "10.1016/j.rser.2021.111182", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Reaching the 2030 targets for the EU primary energy use (PE) and CO2eq\nemissions (CE) requires an accurate assessment of how different technologies\nperform on these two fronts. In this regard, the focus in academia is\nincreasingly shifting from traditional technologies to electricity consuming\nalternatives. Calculating and comparing their performance with respect to\ntraditional technologies requires conversion factors (CFs) like a primary\nenergy factor and a CO2eq intensity. These reflect the PE and CE associated\nwith each unit of electricity consumed. Previous work has shown that the\ncalculation and use of CFs is a contentious and multifaceted issue. However,\nthis has mostly remained a theoretical discussion. A stock-taking of how CFs\nare actually calculated and used in academic literature has so far been\nmissing, impeding insight into what the contemporary trends and challenges are.\nTherefore, we structurally review 65 publications across six methodological\naspects. We find that 72% of the publications consider only a single country,\n86% apply a purely retrospective perspective, 54% apply a yearly temporal\nresolution, 65% apply a purely operational (instead of a life-cycle)\nperspective, 91% make use of average (rather than marginal) CFs, and 75% ignore\nelectricity imports from surrounding countries. We conclude that there is a\nstrong need in the literature for a publicly available, transparently\ncalculated dataset of CFs, which avoids the shortcomings found in the\nliterature. This would enable more accurate and transparent PE and CE\ncalculations, and support the development of new building energy performance\nassessment methods and smart grid algorithms.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2021 15:21:45 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Hamels", "Sam", ""], ["Himpe", "Eline", ""], ["Laverge", "Jelle", ""], ["Delghust", "Marc", ""], ["Brande", "Kjartan Van den", ""], ["Janssens", "Arnold", ""], ["Albrecht", "Johan", ""]]}]