[{"id": "2105.00130", "submitter": "Frederik Vom Scheidt", "authors": "Frederik vom Scheidt, Jingyi Qu, Philipp Staudt, Dharik S.\n  Mallapragada, Christof Weinhardt", "title": "Integrating Hydrogen in Single-Price Electricity Systems: The Effects of\n  Spatial Economic Signals", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Hydrogen can contribute substantially to the reduction of carbon emissions in\nindustry and transportation. However, the production of hydrogen through\nelectrolysis creates interdependencies between hydrogen supply chains and\nelectricity systems. Therefore, as governments worldwide are planning\nconsiderable financial subsidies and new regulation to promote hydrogen\ninfrastructure investments in the next years, energy policy research is needed\nto guide such policies with holistic analyses. In this study, we link a\nelectrolytic hydrogen supply chain model with an electricity system dispatch\nmodel. We use this methodology for a cross-sectoral case study of Germany in\n2030. We find that hydrogen infrastructure investments and their effects on the\nelectricity system are strongly influenced by electricity prices. Given current\nuniform zonal prices, hydrogen production increases congestion costs in the\nelectricity grid by 11%. In contrast, passing spatially resolved electricity\nprice signals leads to electrolyzers being placed at low-cost grid nodes and\nfurther away from consumption centers. This causes lower end-use costs for\nhydrogen. Moreover, congestion management costs decrease substantially, by 24%\ncompared to the benchmark case without hydrogen. These savings could be\ntransferred into according subsidies for hydrogen production. Thus, our study\ndemonstrates the benefits of differentiating subsidies for hydrogen production\nbased on spatial criteria.\n", "versions": [{"version": "v1", "created": "Sat, 1 May 2021 00:36:44 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Scheidt", "Frederik vom", ""], ["Qu", "Jingyi", ""], ["Staudt", "Philipp", ""], ["Mallapragada", "Dharik S.", ""], ["Weinhardt", "Christof", ""]]}, {"id": "2105.00204", "submitter": "Mikhail Freer", "authors": "Ahrash Dianat and Mikhail Freer", "title": "Credibility in Second-Price Auctions: An Experimental Test", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We provide the first direct test of how the credibility of an auction format\naffects bidding behavior and final outcomes. To do so, we conduct a series of\nlaboratory experiments where the role of the seller is played by a human\nsubject who receives the revenue from the auction and who (depending on the\ntreatment) has agency to determine the outcome of the auction. We find that a\nlarge majority of bids in the non-credible version of the second-price auction\nlie between the theoretical benchmarks of the first-price auction and the\ncredible second-price auction. While sellers in the non-credible second-price\nauction often break the rules of the auction and overcharge the winning bidder,\nthey typically do not maximize revenue. We provide a behavioral explanation for\nour results based on incorrect beliefs (on the part of bidders) and aversion to\nrule-breaking (on the part of sellers), which is confirmed by revealed\npreference tests.\n", "versions": [{"version": "v1", "created": "Sat, 1 May 2021 09:55:58 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Dianat", "Ahrash", ""], ["Freer", "Mikhail", ""]]}, {"id": "2105.00337", "submitter": "Hannes Wallimann", "authors": "David Imhof and Hannes Wallimann", "title": "Detecting bid-rigging coalitions in different countries and auction\n  formats", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an original application of screening methods using machine\nlearning to detect collusive groups of firms in procurement auctions. As a\nmethodical innovation, we calculate coalition-based screens by forming\ncoalitions of bidders in tenders to flag bid-rigging cartels. Using Swiss,\nJapanese and Italian procurement data, we investigate the effectiveness of our\nmethod in different countries and auction settings, in our cases first-price\nsealed-bid and mean-price sealed-bid auctions. We correctly classify 90\\% of\nthe collusive and competitive coalitions when applying four machine learning\nalgorithms: lasso, support vector machine, random forest, and super learner\nensemble method. Finally, we find that coalition-based screens for the variance\nand the uniformity of bids are in all the cases the most important predictors\naccording the random forest.\n", "versions": [{"version": "v1", "created": "Sat, 1 May 2021 19:48:51 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Imhof", "David", ""], ["Wallimann", "Hannes", ""]]}, {"id": "2105.00517", "submitter": "Guillaume Pouliot", "authors": "{\\O}ystein Daljord, Guillaume Pouliot, Junji Xiao, Mandy Hu", "title": "The Black Market for Beijing License Plates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Black markets can reduce the effects of distortionary regulations by\nreallocating scarce resources toward consumers who value them most. The illegal\nnature of black markets, however, creates transaction costs that reduce the\ngains from trade. We take a partial identification approach to infer gains from\ntrade and transaction costs in the black market for Beijing car license plates,\nwhich emerged following their recent rationing. We find that at least 11% of\nemitted license plates are illegally traded. The estimated transaction costs\nsuggest severe market frictions: between 61% and 82% of the realized gains from\ntrade are lost to transaction costs.\n", "versions": [{"version": "v1", "created": "Sun, 2 May 2021 17:50:54 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Daljord", "Øystein", ""], ["Pouliot", "Guillaume", ""], ["Xiao", "Junji", ""], ["Hu", "Mandy", ""]]}, {"id": "2105.00556", "submitter": "Kelsey O'Connor", "authors": "Francesco Sarracino (STATEC Research, GLO) and Kelsey J. O'Connor\n  (STATEC Research, IZA, GLO)", "title": "Neo-humanism and COVID-19: Opportunities for a socially and\n  environmentally sustainable world", "comments": "34 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  A series of crises, culminating with COVID-19, shows that going Beyond GDP is\nurgently necessary. Social and environmental degradation are consequences of\nemphasizing GDP as a measure of progress. This degradation created the\nconditions for the COVID-19 pandemic and limited the efficacy of\ncounter-measures. Additionally, rich countries did not fare the pandemic much\nbetter than poor ones. COVID-19 thrived on inequalities and a lack of\ncooperation. In this article we leverage on defensive growth models to explain\nthe complex relationships between these factors, and we put forward the idea of\nneo-humanism, a cultural movement grounded on evidence from quality-of-life\nstudies. The movement proposes a new culture leading towards a socially and\nenvironmentally sustainable future. Specifically, neo-humanism suggests that\nprioritizing well-being by, for instance, promoting social relations, would\nbenefit the environment, enable collective action to address public issues,\nwhich in turn positively affects productivity and health, among other\nbehavioral outcomes, and thereby instills a virtuous cycle. Arguably, such a\nsociety would have been better endowed to cope with COVID-19, and possibly even\nprevented the pandemic. Neo-humanism proposes a world in which the well-being\nof people comes before the well-being of markets, in which promoting\ncooperation and social relations represents the starting point for better\nlives, and a peaceful and respectful coexistence with other species on Earth.\n", "versions": [{"version": "v1", "created": "Sun, 2 May 2021 21:37:52 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Sarracino", "Francesco", "", "STATEC Research, GLO"], ["O'Connor", "Kelsey J.", "", "STATEC Research, IZA, GLO"]]}, {"id": "2105.00617", "submitter": "Armand Sim", "authors": "Patrick Opoku Asuming, Hyuncheol Bryant Kim, and Armand Sim", "title": "Selection and Behavioral Responses of Health Insurance Subsidies in the\n  Long Run: Evidence from a Field Experiment in Ghana", "comments": "arXiv admin note: substantial text overlap with arXiv:1811.09004", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We conduct a randomized experiment that varies one-time health insurance\nsubsidy amounts (partial and full) in Ghana to study the impacts of subsidies\non insurance enrollment and health care utilization. We find that both partial\nand full subsidies promote insurance enrollment in the long run, even after the\nsubsidies expired. Although the long run enrollment rate and selective\nenrollment do not differ by subsidy level, long run health care utilization\nincreased only for the partial subsidy group. We show that this can plausibly\nbe explained by stronger learning-through-experience behavior in the partial\nthan in the full subsidy group.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 03:40:14 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Asuming", "Patrick Opoku", ""], ["Kim", "Hyuncheol Bryant", ""], ["Sim", "Armand", ""]]}, {"id": "2105.00796", "submitter": "Fabian Scheller", "authors": "Fabian Scheller, S\\\"oren Graupner, James Edwards, Jann Weinand, Thomas\n  Bruckner", "title": "Active peer effects in residential photovoltaic adoption: evidence on\n  impact drivers among potential and current adopters in Germany", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  While the importance of peer influences has been demonstrated in several\nstudies, little is known about the underlying mechanisms of active peer effects\nin residential photovoltaic (PV) diffusion. Empirical evidence indicates that\nthe impacts of inter-subjective exchanges are dependent on the subjective\nmutual evaluation of the interlocutors. This paper aims to quantify, how\nsubjective evaluations of peers affect peer effects across different stages of\nPV adoption decision-making. The findings of a survey among potential and\ncurrent adopters in Germany(N=1,165)confirm two hypotheses. First, peer effects\nplay a role in residential PV adoption: the number of peer adopters in the\ndecision-maker's social circle has a positive effect on the decision-maker's\nbelief that their social network supports PV adoption; their ascription of\ncredibility on PV-related topics to their peers; and their interest in actively\nseeking information from their peers in all decision-making stages. Second,\nthere is a correlation between the perceived positive attributes of a given\npeer and the reported influence of said peer within the decision-making\nprocess, suggesting that decision-makers' subjective evaluations of peers play\nan important role in active peer effects. Decision-makers are significantly\nmore likely to engage in and be influenced by interactions with peers who they\nperceive as competent, trustworthy, and likeable. In contrast, attributes such\nas physical closeness and availability have a less significant effect. From a\npolicymaking perspective, this study suggests that the density and quality of\npeer connections empower potential adopters. Accordingly, peer consultation and\ncommunity-led outreach initiatives should be promoted to accelerate residential\nPV adoption.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 12:48:03 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Scheller", "Fabian", ""], ["Graupner", "Sören", ""], ["Edwards", "James", ""], ["Weinand", "Jann", ""], ["Bruckner", "Thomas", ""]]}, {"id": "2105.00939", "submitter": "Justin Loye", "authors": "Justin Loye, Katia Jaffr\\`es-Runser and Dima Shepelyansky", "title": "Post-Brexit power of European Union from the world trade network\n  analysis", "comments": "11 pages, 6 figures + Supplementary Material", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI econ.GN physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop the Google matrix analysis of the multiproduct world trade network\nobtained from the UN COMTRADE database in recent years. The comparison is done\nbetween this new approach and the usual Import-Export description of this world\ntrade network. The Google matrix analysis takes into account the multiplicity\nof trade transactions thus highlighting in a better way the world influence of\nspecific countries and products. It shows that after Brexit, the European Union\nof 27 countries has the leading position in the world trade network ranking,\nbeing ahead of USA and China. Our approach determines also a sensitivity of\ntrade country balance to specific products showing the dominant role of\nmachinery and mineral fuels in multiproduct exchanges. It also underlines the\ngrowing influence of Asian countries.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 15:15:13 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Loye", "Justin", ""], ["Jaffrès-Runser", "Katia", ""], ["Shepelyansky", "Dima", ""]]}, {"id": "2105.01043", "submitter": "Mohsen Foroughifar", "authors": "Mohsen Foroughifar", "title": "Why Are Rational Expectations Violated in Social Interactions?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Individuals often interact with each other through observation -- they\nobserve the choices of other people who possess private information. In\nempirical models of social interactions, it is typically assumed that decision\nmakers are Bayesian rational, therefore their beliefs are identified by the\nempirical distribution of other agents' decisions. In this study, I assess the\nvalidity of the rational expectations assumption in a social interaction\nexperiment. I use a simple and transparent experimental setting to show that\ndecision makers often fail to exhibit rational expectations in social\ninteractions and this behavior is independent of commonly documented errors in\nstatistical reasoning: subjects exhibit a higher level of irrationality in the\npresence than in the absence of social interaction, even when they receive\ninformationally equivalent signals across the two conditions. A series of\ntreatments aimed at identifying mechanisms suggests that a decision maker is\noften uncertain about the behavior of other people. So, she might have\ndifficulty in inferring the information contained in others' choices. A general\ndecision-making process is then non-parametrically estimated and sheds light on\nthe identification of three types of error in subjects' behavior.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 17:40:44 GMT"}, {"version": "v2", "created": "Sun, 13 Jun 2021 19:47:23 GMT"}], "update_date": "2021-06-15", "authors_parsed": [["Foroughifar", "Mohsen", ""]]}, {"id": "2105.01127", "submitter": "Diana B\\\"ottger", "authors": "Diana B\\\"ottger, Philipp H\\\"artel", "title": "On Wholesale Electricity Prices and Market Values in a Carbon-Neutral\n  Energy System", "comments": "Preprint submitted to Energy Economics", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Climate and energy policy targets of the European Commission aim to make\nEurope the first climate-neutral continent by 2050. For low-carbon and\nnet-neutral energy systems primarily based on variable renewable power\ngeneration, issues related to the market integration, cannibalisation of\nrevenues, and cost recovery of wind and solar photovoltaics have become major\nconcerns. The traditional discussion of the merit-order effect expects\nwholesale power prices in a system with 100 % renewable energy sources to\nalternate between very high and very low values. Unlike previous work, we\npresent a structured and technology-specific analysis of the cross-sectoral\ndemand bidding effect for the price formation in low-carbon power markets.\nStarting from a stylised market arrangement and by successively augmenting it\nwith all relevant technologies, we construct and quantify the cross-sectoral\ndemand bidding effects in future European power markets with the cross-sectoral\nmarket modelling framework SCOPE SD. As the main contribution, we explain and\nsubstantiate the market clearing effects of new market participants in detail.\nHereby, we put a special focus on hybrid heat supply systems consisting of\ncombined heat and power plant, fuel boiler, thermal storage and electrical back\nup and derive the opportunity costs of these systems. Furthermore, we show the\neffects of cross-border integration for a large-scale European net-neutral\nenergy scenario. Finally, the detailed information on market clearing effects\nallows us to evaluate the resulting revenues of all major technology categories\non future electricity markets.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 19:00:36 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Böttger", "Diana", ""], ["Härtel", "Philipp", ""]]}, {"id": "2105.01142", "submitter": "Alexandre Ligo", "authors": "Alexandre K. Ligo, Emerson Mahoney, Jeffrey Cegan, Benjamin D. Trump,\n  Andrew S. Jin, Maksim Kitsak, Jesse Keenan, Igor Linkov", "title": "Relationship among state reopening policies, health outcomes and\n  economic recovery through first wave of the COVID-19 pandemic in the U.S", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  State governments in the U.S. have been facing difficult decisions involving\ntradeoffs between economic and health-related outcomes during the COVID-19\npandemic. Despite evidence of the effectiveness of government-mandated\nrestrictions mitigating the spread of contagion, these orders are stigmatized\ndue to undesirable economic consequences. This tradeoff resulted in state\ngovernments employing mandates at widely different ways. We compare the\ndifferent policies states implemented during periods of restriction\n(\"lockdown\") and reopening with indicators of COVID-19 spread and consumer card\nspending at each state during the first \"wave\" of the pandemic in the U.S.\nbetween March and August 2020. We find that while some states enacted reopening\ndecisions when the incidence rate of COVID-19 was minimal or sustained in its\nrelative decline, other states relaxed socioeconomic restrictions near their\nhighest incidence and prevalence rates experienced so far. Nevertheless, all\nstates experienced similar trends in consumer card spending recovery, which was\nstrongly correlated with reopening policies following the lockdowns and\nrelatively independent from COVID-19 incidence rates at the time. Our findings\nsuggest that consumer card spending patterns can be attributed to government\nmandates rather than COVID-19 incidence in the states. This result highlights\nthe important role of state policies in minimizing health impacts while\npromoting economic recovery and helps planning effective interventions in\nsubsequent waves and immunization efforts.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 19:43:34 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Ligo", "Alexandre K.", ""], ["Mahoney", "Emerson", ""], ["Cegan", "Jeffrey", ""], ["Trump", "Benjamin D.", ""], ["Jin", "Andrew S.", ""], ["Kitsak", "Maksim", ""], ["Keenan", "Jesse", ""], ["Linkov", "Igor", ""]]}, {"id": "2105.01154", "submitter": "Gregor Berz", "authors": "Gregor Berz, Florian Rupp, Brian Sieben", "title": "How the 'Auction Cube' Supports the Selection of Auction Designs in\n  Industrial Procurement", "comments": "32 pages, in German, 3 figures, 9 tabels", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  It is well known that rightly applied reverse auctions offer big commercial\npotential to procurement departments. However, the sheer number of auction\ntypes often overwhelms users in practice. And since the implications of a\nwrongly chosen auction type are equally well known, the overall usage of\nreverse auctions lacks its potential significantly. In this paper, a novel\nmethod is being proposed that guides the user in selecting the right\ncombination of basic auction forms for single lot events, considering both\nmarket-, as well as supplier-related, bijective criteria.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 20:16:06 GMT"}, {"version": "v2", "created": "Thu, 13 May 2021 10:38:24 GMT"}], "update_date": "2021-05-14", "authors_parsed": [["Berz", "Gregor", ""], ["Rupp", "Florian", ""], ["Sieben", "Brian", ""]]}, {"id": "2105.01426", "submitter": "Martin Huber", "authors": "Martin Huber, Jonas Meier, Hannes Wallimann", "title": "Business analytics meets artificial intelligence: Assessing the demand\n  effects of discounts on Swiss train tickets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We assess the demand effects of discounts on train tickets issued by the\nSwiss Federal Railways, the so-called `supersaver tickets', based on machine\nlearning, a subfield of artificial intelligence. Considering a survey-based\nsample of buyers of supersaver tickets, we investigate which customer- or\ntrip-related characteristics (including the discount rate) predict buying\nbehavior, namely: booking a trip otherwise not realized by train, buying a\nfirst- rather than second-class ticket, or rescheduling a trip (e.g.\\ away from\nrush hours) when being offered a supersaver ticket. Predictive machine learning\nsuggests that customer's age, demand-related information for a specific\nconnection (like departure time and utilization), and the discount level permit\nforecasting buying behavior to a certain extent. Furthermore, we use causal\nmachine learning to assess the impact of the discount rate on rescheduling a\ntrip, which seems relevant in the light of capacity constraints at rush hours.\nAssuming that (i) the discount rate is quasi-random conditional on our rich set\nof characteristics and (ii) the buying decision increases weakly monotonically\nin the discount rate, we identify the discount rate's effect among `always\nbuyers', who would have traveled even without a discount, based on our survey\nthat asks about customer behavior in the absence of discounts. We find that on\naverage, increasing the discount rate by one percentage point increases the\nshare of rescheduled trips by 0.16 percentage points among always buyers.\nInvestigating effect heterogeneity across observables suggests that the effects\nare higher for leisure travelers and during peak hours when controlling several\nother characteristics.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2021 11:29:54 GMT"}, {"version": "v2", "created": "Wed, 19 May 2021 14:55:12 GMT"}, {"version": "v3", "created": "Thu, 15 Jul 2021 15:58:06 GMT"}], "update_date": "2021-07-16", "authors_parsed": [["Huber", "Martin", ""], ["Meier", "Jonas", ""], ["Wallimann", "Hannes", ""]]}, {"id": "2105.01446", "submitter": "Federico Fioravanti", "authors": "Federico Fioravanti, Fernando Delbianco and Fernando Tohm\\'e", "title": "Home advantage and crowd attendance: Evidence from rugby during the\n  Covid 19 pandemic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The COVID-19 pandemic forced almost all professional and amateur sports to be\nplayed without attending crowds. Thus, it induced a large-scale natural\nexperiment on the impact of social pressure on decision making and behavior in\nsports fields. Using a data set of 1027 rugby union matches from 11 tournaments\nin 10 countries, we find that home teams have won less matches and their points\ndifference decreased during the pandemics, shedding light on the impact of\ncrowd attendance on the {\\em home advantage} of sports teams.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2021 12:14:20 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Fioravanti", "Federico", ""], ["Delbianco", "Fernando", ""], ["Tohmé", "Fernando", ""]]}, {"id": "2105.01581", "submitter": "Hanzhe Zhang", "authors": "Mehmet Ekmekci and Hanzhe Zhang", "title": "Reputational Bargaining with Ultimatum Opportunities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study two-sided reputational bargaining with opportunities to issue an\nultimatum -- threats to force dispute resolution. Each player is either a\njustified type, who never concedes and issues an ultimatum whenever an\nopportunity arrives, or an unjustified type, who can concede, wait, or bluff\nwith an ultimatum. In equilibrium, the presence of ultimatum opportunities can\nharm or benefit a player by decelerating or accelerating reputation building.\nWhen only one player can issue an ultimatum, equilibrium play is unique. The\nhazard rate of dispute resolution is discontinuous and piecewise monotonic in\ntime. As the probabilities of being justified vanish, agreement is immediate\nand efficient, and if the set of justifiable demands is rich, payoffs modify\nAbreu and Gul (2000), with the discount rate replaced by the ultimatum\nopportunity arrival rate if the former is smaller. When both players' ultimatum\nopportunities arrive sufficiently fast, there may exist multiple equilibria in\nwhich their reputations do not build up and negotiation lasts forever.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2021 15:44:48 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Ekmekci", "Mehmet", ""], ["Zhang", "Hanzhe", ""]]}, {"id": "2105.01644", "submitter": "Jun Wong", "authors": "Jun Wong, Jonathan Santoso, Marjorie Went, and Daniel Sanchez", "title": "Market Potential for CO$_2$ Removal and Sequestration from Renewable\n  Natural Gas Production in California", "comments": "25 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.SY econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Bioenergy with Carbon Capture and Sequestration (BECCS) is critical for\nstringent climate change mitigation, but is commercially and technologically\nimmature and resource-intensive. In California, state and federal fuel and\nclimate policies can drive first-markets for BECCS. We develop a spatially\nexplicit optimization model to assess niche markets for renewable natural gas\n(RNG) production with carbon capture and sequestration (CCS) from waste biomass\nin California. Existing biomass residues produce biogas and RNG and enable\nlow-cost CCS through the upgrading process and CO$_2$ truck transport. Under\ncurrent state and federal policy incentives, we could capture and sequester 2.9\nmillion MT CO$_2$/year (0.7% of California's 2018 CO$_2$ emissions) and produce\n93 PJ RNG/year (4% of California's 2018 natural gas demand) with a profit\nmaximizing objective. Existing federal and state policies produce profits of\n\\$11/GJ. Distributed RNG production with CCS potentially catalyzes markets and\ntechnologies for CO$_2$ capture, transport, and storage in California.\n", "versions": [{"version": "v1", "created": "Tue, 4 May 2021 17:41:38 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Wong", "Jun", ""], ["Santoso", "Jonathan", ""], ["Went", "Marjorie", ""], ["Sanchez", "Daniel", ""]]}, {"id": "2105.01745", "submitter": "Nicholas Dacre PhD", "authors": "Katerina Antonopoulou, Nicholas Dacre", "title": "Exploring Diffusion Characteristics that Influence Serious Games\n  Adoption Decisions", "comments": "Citation: Antonopoulou, K., & Dacre, N. (2015). Exploring Diffusion\n  Characteristics that Influence Serious Games Adoption Decisions. Innovation\n  in Information Infrastructures, Coventry, UK.\n  https://dx.doi.org/10.2139/ssrn.3829185", "journal-ref": "Innovation in Information Infrastructures 2015", "doi": "10.2139/ssrn.3829185", "report-no": null, "categories": "econ.GN cs.HC q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper we discuss the diffusion of serious games and present reasons\nfor why Rogers traditional approach is limited in this context. We present an\nalternative overview through the characteristics of relative advantage,\ncompatibility, complexity, trialability, and observability, that reflect on the\nadoption decision and contributes on the commercialization of serious games.\n", "versions": [{"version": "v1", "created": "Mon, 3 May 2021 14:51:17 GMT"}], "update_date": "2021-05-06", "authors_parsed": [["Antonopoulou", "Katerina", ""], ["Dacre", "Nicholas", ""]]}, {"id": "2105.02094", "submitter": "Jacopo De Tullio", "authors": "Jacopo De Tullio, Giuseppe Puleio", "title": "Sustainability of Collusion and Market Transparency in a Sequential\n  Search Market: a Generalization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The present work generalizes the analytical results of Petrikaite (2016) to a\nmarket where more than two firms interact. As a consequence, for a generic\nnumber of firms in the oligopoly model described by Janssen et al (2005), the\nrelationship between the critical discount factor which sustains the monopoly\ncollusive allocation and the share of perfectly informed buyers is\nnon-monotonic, reaching a unique internal point of minimum. The first section\nlocates the work within the proper economic framework. The second section hosts\nthe analytical computations and the mathematical reasoning needed to derive the\ndesired generalization, which mainly relies on the Leibniz rule for the\ndifferentiation under the integral sign and the Bounded Convergence Theorem.\n", "versions": [{"version": "v1", "created": "Wed, 5 May 2021 14:49:10 GMT"}], "update_date": "2021-05-06", "authors_parsed": [["De Tullio", "Jacopo", ""], ["Puleio", "Giuseppe", ""]]}, {"id": "2105.02387", "submitter": "Torsten Heinrich", "authors": "Torsten Heinrich", "title": "Epidemics in modern economies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How are economies in a modern age impacted by epidemics? In what ways is\neconomic life disrupted? How can pandemics be modeled? What can be done to\nmitigate and manage the danger? Does the threat of pandemics increase or\ndecrease in the modern world? The Covid-19 pandemic has demonstrated the\nimportance of these questions and the potential of complex systems science to\nprovide answers. This article offers a broad overview of the history of\npandemics, of established facts, and of models of infection diffusion,\nmitigation strategies, and economic impact. The example of the Covid-19\npandemic is used to illustrate the theoretical aspects, but the article also\nincludes considerations concerning other historic epidemics and the danger of\nmore infectious and less controllable outbreaks in the future.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2021 01:24:43 GMT"}, {"version": "v2", "created": "Wed, 12 May 2021 03:27:03 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Heinrich", "Torsten", ""]]}, {"id": "2105.02849", "submitter": "Dr. Cesar R. Salas-Guerra", "authors": "Dr. Cesar R Salas-Guerra", "title": "Impact of digital economic activity on regional economic growth: A Case\n  study from northern Minas Gerais between 2009 To 2018", "comments": "in Spanish", "journal-ref": "UAGM Doctoral Thesis 2020", "doi": "10.13140/RG.2.2.15633.35686", "report-no": null, "categories": "econ.GN cs.CY q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  At present, the economic measurement of the national statistical offices has\nnot defined or captured the benefits of the digital economy activity due to the\nlow quality or inexistence of methodologies. Currently, there is a relevant\ndebate on the capacity of the digital economy activity to generate\nproductivity, economic growth, and well-being through innovation and knowledge.\nFor this reason, this research identified and studied specialized knowledge,\nhuman settlement, and digital economic activity as the factors that influence\nregional economic growth. As a result, the impact generated by a new business\noperating models based on information technology was measured. Furthermore,\nthis research used an empirical measurement model that made it possible to\nidentify certain phenomena such as regional poles of regional economic\ndevelopment (PRDE) that surround economically flourishing regions. In addition,\nit showed that municipalities with high degrees of economic growth were\nimpacted by digital economic activity and specialized knowledge. This finding\nis consistent with economic growth theories that point to technological\nevolution as the main factor of modern economic growth. Consequently, this\nstudy contributed beneficial results to the local government to develop\nstrategies framed in solving industrial cooperation of economically flourishing\nregions with their neighbors, facing the problem of agglomeration of resources\nand capital reflected in human settlement promote an imbalance in economic\ngrowth and social development.\n", "versions": [{"version": "v1", "created": "Thu, 6 May 2021 17:39:48 GMT"}], "update_date": "2021-05-07", "authors_parsed": [["Salas-Guerra", "Dr. Cesar R", ""]]}, {"id": "2105.03405", "submitter": "Arega Getaneh Abate Dr.", "authors": "Arega Getaneh Abate, Rosana Riccardi, Carlos Ruiz", "title": "Retailer-consumers model in electricity market under demand response", "comments": "31", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Demand response (DR) programs have gained much attention during the last\nthree decades to optimize the decisions of the electricity market participants\nconsidering the demand-side management (DSM). It can potentially enhance system\nreliability and manages price volatility by modifying the amount or time of\nelectricity consumption. This paper proposes a novel game-theoretical model\naccounting for the relationship between retailers (leaders) and consumers\n(followers) in a dynamic price environment where both players optimize their\nrespective economic goals under uncertainty. The model is solved under two\nframeworks. First by considering retailer's market power and second by\naccounting for an equilibrium setting based on a Cournot game. These are\nformulated in terms of a mathematical program with equilibrium constraints\n(MPEC) and with a mixed-integer linear program (MILP), respectively. In\nparticular, the retailers' market power model is first formulated as a bi-level\noptimization problem, and the MPEC is subsequently derived by replacing the\nconsumers' problem (lower level) with its Karush-Kuhn-Tucker (KKT) optimality\nconditions. In contrast, the Cournot equilibrium model is solved as a MILP by\nconcatenating the retailer's and consumers' KKT optimality conditions. The\nsolution sets, the practical approaches for solutions, the required techniques\nto test and compare the performance of the model are undertaken with realistic\ndata. Numerical simulations confirm the applicability and effectiveness of the\nproposed model to explore the interactions of markets power and DR programs.\nThe results confirm that consumers are better off in an equilibrium framework\nwhile the retailer increases its expected profit when the market power is\nconsidered. However, we show how these results are highly affected by the\nlevels of of consumers' flexibility.\n", "versions": [{"version": "v1", "created": "Fri, 7 May 2021 17:35:51 GMT"}], "update_date": "2021-05-10", "authors_parsed": [["Abate", "Arega Getaneh", ""], ["Riccardi", "Rosana", ""], ["Ruiz", "Carlos", ""]]}, {"id": "2105.03512", "submitter": "Amanda Stathopoulos", "authors": "Jason Soria, Amanda Stathopoulos", "title": "Investigating Socio-spatial Differences between Solo Ridehailing and\n  Pooled Rides in Diverse Communities", "comments": "Submitted to journal of Transport Geography", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC stat.AP", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Transformative mobility services present both considerable opportunities and\nchallenges for urban mobility systems. Increasing attention is being paid to\nridehailing platforms and connections between demand and continuous innovation\nin service features; one of these features is dynamic ride-pooling. To\ndisentangle how ridehailing impacts existing transportation networks and its\nability to support economic vitality and community livability it is essential\nto consider the distribution of demand across diverse communities. In this\npaper we expand the literature on ridehailing demand by exploring community\nvariation and spatial dependence in ridehailing use. Specifically, we\ninvestigate the diffusion and role of solo requests versus ride-pooling to shed\nlight on how different mobility services, with different environmental and\naccessibility implications, are used by diverse communities. This paper employs\na Social Disadvantage Index, Transit Access Analysis, and a Spatial Durbin\nModel to investigate the influence of both local and spatial spillover effects\non the demand for shared and solo ridehailing. The analysis of 127 million\nridehailing rides, of which 15% are pooled, confirms the presence of spatial\neffects. Results indicate that density and vibrancy variables have analogue\neffects, both direct and indirect, on demand for solo vs pooled rides. Instead,\nour analysis reveals significant contrasting effects for socio-economic\ndisadvantage, which is positively correlated with ride-pooling and negatively\nwith solo rides. Additionally, we find that higher rail transit access is\nassociated with higher demand for both solo and pooled ridehailing along with\nsubstantial spatial spillovers. We discuss implications for policy, operations\nand research related to the novel insight on how pooled ridesourcing relate to\ngeography, living conditions, and transit interactions.\n", "versions": [{"version": "v1", "created": "Fri, 7 May 2021 21:20:15 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Soria", "Jason", ""], ["Stathopoulos", "Amanda", ""]]}, {"id": "2105.03562", "submitter": "Takuro Kobashi", "authors": "Takuro Kobashi, Younghun Choi, Yujiro Hirano, Yoshiki Yamagata, Kelvin\n  Say", "title": "Deeply decarbonizing residential and urban central districts through\n  photovoltaics plus electric vehicle applications", "comments": "40 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  With the costs of renewable energy technologies declining, new forms of urban\nenergy systems are emerging that can be established in a cost-effective way.\nThe SolarEV City concept has been proposed that uses rooftop Photovoltaics (PV)\nto its maximum extent, combined with Electric Vehicle (EV) with bi-directional\ncharging for energy storage. Urban environments consist of various areas, such\nas residential and commercial districts, with different energy consumption\npatterns, building structures, and car parks. The cost effectiveness and\ndecarbonization potentials of PV + EV and PV (+ battery) systems vary across\nthese different urban environments and change over time as cost structures\ngradually shift. To evaluate these characteristics, we performed\ntechno-economic analyses of PV, battery, and EV technologies for a residential\narea in Shinchi, Fukushima and the central commercial district of Kyoto, Japan\nbetween 2020 and 2040. We found that PV + EV and PV only systems in 2020 are\nalready cost competitive relative to existing energy systems (grid electricity\nand gasoline car). In particular, the PV + EV system rapidly increases its\neconomic advantage over time, particularly in the residential district which\nhas larger PV capacity and EV battery storage relative to the size of energy\ndemand. Electricity exchanges between neighbors (e.g., peer-to-peer or\nmicrogrid) further enhanced the economic value (net present value) and\ndecarbonization potential of PV + EV systems up to 23 percent and 7 percent in\n2030, respectively. These outcomes have important strategic implications for\nurban decarbonization over the coming decades.\n", "versions": [{"version": "v1", "created": "Sat, 8 May 2021 02:40:15 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Kobashi", "Takuro", ""], ["Choi", "Younghun", ""], ["Hirano", "Yujiro", ""], ["Yamagata", "Yoshiki", ""], ["Say", "Kelvin", ""]]}, {"id": "2105.03656", "submitter": "Richard Tol", "authors": "Richard S.J. Tol", "title": "Estimates of the social cost of carbon have not changed over time", "comments": "arXiv admin note: text overlap with arXiv:2003.09276", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Some claim that as knowledge about climate change accumulates, the social\ncost of carbon increases. A meta-analysis of published estimates shows that\nthis is not the case. Correcting for inflation and emission year and\ncontrolling for the discount rate, kernel density decomposition reveals a\nstationary distribution. Actual carbon prices are almost everywhere below the\nestimated social cost of carbon.\n", "versions": [{"version": "v1", "created": "Sat, 8 May 2021 09:59:06 GMT"}], "update_date": "2021-05-11", "authors_parsed": [["Tol", "Richard S. J.", ""]]}, {"id": "2105.03707", "submitter": "James Merrick", "authors": "James H. Merrick, John E.T. Bistline, Geoffrey J. Blanford", "title": "On representation of energy storage in electricity planning models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  This paper considers the representation of energy storage in electricity\nsector capacity planning models. The incorporation of storage in long-term\nsystems models of this type is increasingly relevant as the cost of storage\ntechnologies, particularly batteries, and of complementary variable renewable\ntechnologies, decline. To value storage technologies appropriately, a\nrepresentation of linkages between time periods is required, breaking classical\ntemporal aggregation strategies that greatly improve computation time. We\nappraise approaches to address this problem, highlighting a common underlying\nstructure, conditions for lossless aggregation, and challenges of aggregation\nat relevant geographical scales. We then investigate solutions to the modeling\nproblem including a decomposition scheme to avoid temporal aggregation at a\nparallelizable computational cost. These examples frame aspects of the problem\nripe for contributions from the operational research community.\n", "versions": [{"version": "v1", "created": "Sat, 8 May 2021 14:18:30 GMT"}, {"version": "v2", "created": "Mon, 31 May 2021 11:48:16 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Merrick", "James H.", ""], ["Bistline", "John E. T.", ""], ["Blanford", "Geoffrey J.", ""]]}, {"id": "2105.04514", "submitter": "Stephan Leitner", "authors": "Stephan Leitner", "title": "On the Role of Incentives in Evolutionary Approaches to Organizational\n  Design", "comments": "14 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.MA nlin.AO q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces a model of a stylized organization that is comprised of\nseveral departments that autonomously allocate tasks. To do so, the departments\neither take short-sighted decisions that immediately maximize their utility or\ntake long-sighted decisions that aim at minimizing the interdependencies\nbetween tasks. The organization guides the departments' behavior by either an\nindividualistic, a balanced, or an altruistic linear incentive scheme. Even if\ntasks are perfectly decomposable, altruistic incentive schemes are preferred\nover individualistic incentive schemes since they substantially increase the\norganization's performance. Interestingly, if altruistic incentive schemes are\neffective, short-sighted decisions appear favorable since they do not only\nincrease performance in the short run but also result in significantly higher\nperformances in the long run.\n", "versions": [{"version": "v1", "created": "Mon, 10 May 2021 17:06:50 GMT"}, {"version": "v2", "created": "Tue, 11 May 2021 05:52:18 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Leitner", "Stephan", ""]]}, {"id": "2105.04718", "submitter": "Zoe Goss MEng", "authors": "Zoe Goss, Daniel Coles, Matthew Piggott", "title": "Economic analysis of tidal stream turbine arrays: a review", "comments": "29 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This tidal stream energy industry has to date been comprised of small\ndemonstrator projects made up of one to a four turbines. However, there are\ncurrently plans to expand to commercially sized projects with tens of turbines\nor more. As the industry moves to large-scale arrays for the first time, there\nhas been a push to develop tools to optimise the array design and help bring\ndown the costs. This review investigates different methods of modelling the\neconomic performance of tidal-stream arrays, for use within these optimisation\ntools. The different cost reduction pathways are discussed from costs falling\nas the global installed capacity increases, due to greater experience, improved\npower curves through larger-diameter higher-rated turbines, to economic\nefficiencies that can be found by moving to large-scale arrays. A literature\nreview is conducted to establish the most appropriate input values for use in\neconomic models. This includes finding a best case, worst case and typical\nvalues for costs and other related parameters. The information collated in this\nreview can provide a useful steering for the many optimisation tools that have\nbeen developed, especially when cost information is commercially sensitive and\na realistic parameter range is difficult to obtain.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 00:14:33 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Goss", "Zoe", ""], ["Coles", "Daniel", ""], ["Piggott", "Matthew", ""]]}, {"id": "2105.04900", "submitter": "Andrea Fronzetti Colladon PhD", "authors": "A. Fronzetti Colladon, F. Grippa, B. Guardabascio, F. Ravazzolo", "title": "Exploring the Antecedents of Consumer Confidence through Semantic\n  Network Analysis of Online News", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.CL cs.SI q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article studies the impact of online news on social and economic\nconsumer perceptions through the application of semantic network analysis.\nUsing almost 1.3 million online articles on Italian media covering a period of\nfour years, we assessed the incremental predictive power of economic-related\nkeywords on the Consumer Confidence Index. We transformed news into networks of\nco-occurring words and calculated the semantic importance of specific keywords,\nto see if words appearing in the articles could anticipate consumers'\njudgements about the economic situation. Results show that economic-related\nkeywords have a stronger predictive power if we consider the current households\nand national situation, while their predictive power is less significant with\nregards to expectations about the future. Our indicator of semantic importance\noffers a complementary approach to estimate consumer confidence, lessening the\nlimitations of traditional survey-based methods.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 09:41:25 GMT"}], "update_date": "2021-05-12", "authors_parsed": [["Colladon", "A. Fronzetti", ""], ["Grippa", "F.", ""], ["Guardabascio", "B.", ""], ["Ravazzolo", "F.", ""]]}, {"id": "2105.05297", "submitter": "Oliver Pf\\\"auti", "authors": "Oliver Pf\\\"auti", "title": "Inflation -- who cares? Monetary Policy in Times of Low Attention", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Based on a model of optimal information acquisition, I propose an approach to\nmeasure attention to inflation in the data. Applying this approach to US\nconsumers and professional forecasters provides substantial evidence that\nattention to inflation in the US decreased significantly over the last five\ndecades. Consistent with the theoretical model, attention covaries positively\nwith inflation volatility and persistence. To examine the consequences of\nlimited attention for monetary policy, I augment the standard New Keynesian\nmodel with a lower-bound constraint on the nominal interest rate and inflation\nexpectations that are characterized by limited attention. Accounting for the\nlower bound fundamentally alters the normative implications of declining\nattention. While lower attention raises welfare absent the lower-bound\nconstraint, it decreases welfare when accounting for the lower bound. In fact,\nlimited attention can lead to inflation-attention traps: prolonged periods of a\nbinding lower bound and low inflation due to slowly-adjusting inflation\nexpectations. To prevent these traps, it is optimal to increase the inflation\ntarget as attention declines.\n", "versions": [{"version": "v1", "created": "Tue, 11 May 2021 18:48:07 GMT"}, {"version": "v2", "created": "Fri, 4 Jun 2021 13:45:14 GMT"}], "update_date": "2021-06-07", "authors_parsed": [["Pfäuti", "Oliver", ""]]}, {"id": "2105.05651", "submitter": "Saeed Nosratabadi", "authors": "Csaba Mako, Miklos Illessy, Jozsef Pap, Saeed Nosratabadi", "title": "Emerging Platform Work in the Context of the Regulatory Loophole (The\n  Uber Fiasco in Hungary)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The study examines the essential features of the so-called platform-based\nwork, which is rapidly evolving into a major, potentially game-changing force\nin the labor market. From low-skilled, low-paid services (such as passenger\ntransport) to highly skilled and high-paying project-based work (such as the\ndevelopment of artificial intelligence algorithms), a broad range of tasks can\nbe carried out through a variety of digital platforms. Our paper discusses the\nplatform-based content, working conditions, employment status, and advocacy\nproblems. Terminological and methodological problems are dealt with in-depth in\nthe course of the literature review, together with the 'gray areas' of work and\nemployment regulation. To examine some of the complex dynamics of this\nfast-evolving arena, we focus on the unsuccessful market entry of the digital\nplatform company Uber in Hungary 2016 and the relationship to\ninstitutional-regulatory platform-based work standards. Dilemmas relevant to\nthe enforcement of labor law regarding platform-based work are also paid\nspecial attention to the study. Employing a digital workforce is a significant\nchallenge not only for labor law regulation but also for stakeholder advocacy.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2021 13:34:55 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Mako", "Csaba", ""], ["Illessy", "Miklos", ""], ["Pap", "Jozsef", ""], ["Nosratabadi", "Saeed", ""]]}, {"id": "2105.05669", "submitter": "Markus Schlott", "authors": "Markus Schlott, Omar El Sayed, Mariia Bilousova, Fabian Hofmann,\n  Alexander Kies, Horst St\\\"ocker", "title": "Carbon Leakage in a European Power System with Inhomogeneous Carbon\n  Prices", "comments": "19 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Global warming is one of the main threats to the future of humanity and\nextensive emissions of greenhouse gases are found to be the main cause of\nglobal temperature rise as well as climate change. During the last decades\ninternational attention has focused on this issue, as well as on searching for\nviable solutions to mitigate global warming. In this context, the pricing of\ngreenhouse gas emissions turned out to be the most prominent mechanism: First,\nto lower the emissions, and second, to capture their external costs. By now,\nvarious carbon dioxide taxes have been adopted by several countries in Europe\nand around the world; moreover, the list of these countries is growing.\nHowever, there is no standardized approach and the price for carbon varies\nsignificantly from one country to another. Regionally diversified carbon prices\nin turn lead to carbon leakage, which will offset the climate protection goals.\nIn this paper, a simplified European power system with flexible carbon prices\nregarding the Gross Domestic Product (GDP) is investigated. A distribution\nparameter that quantifies carbon leakage is defined and varied together with\nthe base carbon price, where the combination of both parameters describes the\nspatially resolved price distribution, i.e. the effective carbon pricing among\nthe European regions. It is shown that inhomogeneous carbon prices will indeed\nlead to significant carbon leakage across the continent, and that coal-fired\nelectricity generation will remain a cheap and therefore major source of power\nin Eastern and South-Eastern Europe - representing a potential risk for the\nlong term decarbonization targets within the European Union.\n", "versions": [{"version": "v1", "created": "Wed, 12 May 2021 14:00:30 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Schlott", "Markus", ""], ["Sayed", "Omar El", ""], ["Bilousova", "Mariia", ""], ["Hofmann", "Fabian", ""], ["Kies", "Alexander", ""], ["Stöcker", "Horst", ""]]}, {"id": "2105.06017", "submitter": "Scott Hegerty", "authors": "Scott W. Hegerty", "title": "Do City Borders Constrain Ethnic Diversity?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  U.S. metropolitan areas, particularly in the industrial Midwest and\nNortheast, are well-known for high levels of racial segregation. This is\nespecially true where core cities end and suburbs begin; often crossing the\nstreet can lead to physically similar, but much less ethnically diverse,\nsuburban neighborhood. While these differences are often visually or\n\"intuitively\" apparent, this study seeks to quantify them using Geographic\nInformation Systems and a variety of statistical methods. 2016 Census block\ngroup data are used to calculate an ethnic Herfindahl index for a set of two\ndozen large U.S. cities and their contiguous suburbs. Then, a mathematical\nmethod is developed to calculate a block-group-level \"Border Disparity Index\"\n(BDI), which is shown to vary by MSA and by specific suburbs. Its values can be\ncompared across the sample to examine which cities are more likely to have\nborders that separate more-diverse block groups from less-diverse ones. The\nindex can also be used to see which core cities are relatively more or less\ndiverse than their suburbs, and which individual suburbs have the largest\ndisparities vis-\\`a-vis their core city. Atlanta and Detroit have particularly\ndiverse suburbs, while Milwaukee's are not. Regression analysis shows that\nincome differences and suburban shares of Black residents play significant\nroles in explaining variation across suburbs.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 01:08:07 GMT"}], "update_date": "2021-05-14", "authors_parsed": [["Hegerty", "Scott W.", ""]]}, {"id": "2105.06021", "submitter": "Scott Hegerty", "authors": "Scott W. Hegerty", "title": "How Unique is Milwaukee's 53206? An Examination of Disaggregated\n  Socioeconomic Characteristics Across the City and Beyond", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Milwaukee's 53206 ZIP code, located on the city's near North Side, has drawn\nconsiderable attention for its poverty and incarceration rates, as well as for\nits large proportion of vacant properties. As a result, it has benefited from\ntargeted policies at the city level. Keeping in mind that ZIP codes are often\nnot the most effective unit of geographic analysis, this study investigates\nMilwaukee's socioeconomic conditions at the block group level. These smaller\nareas' statistics are then compared with those of their corresponding ZIP\ncodes. The 53206 ZIP code is compared against others in Milwaukee for eight\nsocioeconomic variables and is found to be near the extreme end of most\nrankings. This ZIP code would also be among Chicago's most extreme areas, but\nwould lie near the middle of the rankings if located in Detroit. Parts of other\nZIP codes, which are often adjacent, are statistically similar to 53206,\nhowever--suggesting that a focus solely on ZIP codes, while a convenient\nshorthand, might overlook neighborhoods that have similar need for investment.\nA multivariate index created for this study performs similarly to a standard\nmultivariate index of economic deprivation if spatial correlation is taken into\naccount, confirming that poverty and other socioeconomic stresses are\nclustered, both in the 53206 ZIP code and across Milwaukee.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 01:13:33 GMT"}], "update_date": "2021-05-14", "authors_parsed": [["Hegerty", "Scott W.", ""]]}, {"id": "2105.07341", "submitter": "Fei Cao", "authors": "Fei Cao and Sebastien Motsch", "title": "Derivation of wealth distributions from biased exchange of money", "comments": "47 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR econ.GN physics.soc-ph q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the manuscript, we are interested in using kinetic theory to better\nunderstand the time evolution of wealth distribution and their large scale\nbehavior such as the evolution of inequality (e.g. Gini index). We investigate\nthree type of dynamics denoted unbiased, poor-biased and rich-biased dynamics.\nAt the particle level, one agent is picked randomly based on its wealth and one\nof its dollar is redistributed among the population. Proving the so-called\npropagation of chaos, we identify the limit of each dynamics as the number of\nindividual approaches infinity using both coupling techniques [48] and\nmartingale-based approach [36]. Equipped with the limit equation, we identify\nand prove the convergence to specific equilibrium for both the unbiased and\npoor-biased dynamics. In the rich-biased dynamics however, we observe a more\ncomplex behavior where a dispersive wave emerges. Although the dispersive wave\nis vanishing in time, its also accumulates all the wealth leading to a Gini\napproaching 1 (its maximum value). We characterize numerically the behavior of\ndispersive wave but further analytic investigation is needed to derive such\ndispersive wave directly from the dynamics.\n", "versions": [{"version": "v1", "created": "Sun, 16 May 2021 03:29:59 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Cao", "Fei", ""], ["Motsch", "Sebastien", ""]]}, {"id": "2105.07554", "submitter": "Laura Blattner", "authors": "Laura Blattner and Scott Nelson", "title": "How Costly is Noise? Data and Disparities in Consumer Credit", "comments": "86 pages, 17 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.LG q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We show that lenders face more uncertainty when assessing default risk of\nhistorically under-served groups in US credit markets and that this information\ndisparity is a quantitatively important driver of inefficient and unequal\ncredit market outcomes. We first document that widely used credit scores are\nstatistically noisier indicators of default risk for historically under-served\ngroups. This noise emerges primarily through the explanatory power of the\nunderlying credit report data (e.g., thin credit files), not through issues\nwith model fit (e.g., the inability to include protected class in the scoring\nmodel). Estimating a structural model of lending with heterogeneity in\ninformation, we quantify the gains from addressing these information\ndisparities for the US mortgage market. We find that equalizing the precision\nof credit scores can reduce disparities in approval rates and in credit\nmisallocation for disadvantaged groups by approximately half.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2021 00:42:26 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Blattner", "Laura", ""], ["Nelson", "Scott", ""]]}, {"id": "2105.07565", "submitter": "Daniel Csaba", "authors": "D\\'aniel Csaba", "title": "Attention elasticities and invariant information costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN econ.TH q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider a generalization of rational inattention problems by measuring\ncosts of information through the information radius (Sibson, 1969; Verd\\'u,\n2015) of statistical experiments. We introduce a notion of attention elasticity\nmeasuring the sensitivity of attention strategies with respect to changes in\nincentives. We show how the introduced class of cost functions controls\nattention elasticities while the Shannon model restricts attention elasticity\nto be unity. We explore further differences and similarities relative to the\nShannon model in relation to invariance, posterior separability, consideration\nsets, and the ability to learn events with certainty. Lastly, we provide an\nefficient alternating minimization method -- analogous to the Blahut-Arimoto\nalgorithm -- to obtain optimal attention strategies.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2021 01:24:32 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Csaba", "Dániel", ""]]}, {"id": "2105.07749", "submitter": "Andrea Fronzetti Colladon PhD", "authors": "A. Fronzetti Colladon, F. Grippa, R. Innarella", "title": "Studying the association of online brand importance with museum\n  visitors: An application of the semantic brand score", "comments": null, "journal-ref": "Tourism Management Perspectives 33, 100588 (2020)", "doi": "10.1016/j.tmp.2019.100588", "report-no": null, "categories": "cs.CL cs.SI econ.GN physics.soc-ph q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  This paper explores the association between brand importance and growth in\nmuseum visitors. We analyzed 10 years of online forum discussions and applied\nthe Semantic Brand Score (SBS) to assess the brand importance of five European\nMuseums. Our Naive Bayes and regression models indicate that variations in the\ncombined dimensions of the SBS (prevalence, diversity and connectivity) are\naligned with changes in museum visitors. Results suggest that, in order to\nattract more visitors, museum brand managers should focus on increasing the\nvolume of online posting and the richness of information generated by users\naround the brand, rather than controlling for the posts' overall positivity or\nnegativity.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2021 11:49:30 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Colladon", "A. Fronzetti", ""], ["Grippa", "F.", ""], ["Innarella", "R.", ""]]}, {"id": "2105.07821", "submitter": "Scott Hegerty", "authors": "Scott W. Hegerty", "title": "Spatial Measures of Socioeconomic Deprivation: An Application to Four\n  Midwestern Industrial Cities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Decades of economic decline have led to areas of increased deprivation in a\nnumber of U.S. inner cities, which can be linked to adverse health and other\noutcomes. Yet the calculation of a single \"deprivation\" index, which has\nreceived wide application in Britain and elsewhere in the world, involves a\nchoice of variables and methods that have not been directly compared in the\nAmerican context. This study creates four related measures--using two sets of\nvariables and two weighting schemes--to create such indices for block groups in\nBuffalo, Cleveland, Detroit, and Milwaukee. After examining the indices'\nsimilarities, we then map concentrations of high deprivation in each city and\nanalyze their relationships to income, racial makeup, and transportation usage.\nOverall, we find certain measures to have higher correlations than others, but\nthat all show deprivation to be linked with lower incomes and a higher nonwhite\npopulation.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 00:53:10 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Hegerty", "Scott W.", ""]]}, {"id": "2105.07822", "submitter": "Scott Hegerty", "authors": "Scott W. Hegerty", "title": "Acquisitive Crimes, Time of Day, and Multiunit Housing in the City of\n  Milwaukee", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  According to \"Social Disorganization\" theory, criminal activity increases if\nthe societal institutions that might be responsible for maintaining order are\nweakened. Do large apartment buildings, which often have fairly transient\npopulations and low levels of community involvement, have disproportionately\nhigh rates of crime? Do these rates differ during the daytime or nighttime,\ndepending when residents are present, or away from their property? This study\nexamines four types of \"acquisitive\" crime in Milwaukee during 2014. Overall,\nnighttime crimes are shown to be more dispersed than daytime crimes. A spatial\nregression estimation finds that the density of multiunit housing is positively\nrelated to all types of crime except burglaries, but not for all times of day.\nDaytime robberies, in particular, increase as the density of multiunit housing\nincreases.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 00:51:06 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Hegerty", "Scott W.", ""]]}, {"id": "2105.07823", "submitter": "Scott Hegerty", "authors": "Scott W. Hegerty", "title": "Bank Density, Population Density, and Economic Deprivation Across the\n  United States", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent research on the geographic locations of bank branches in the United\nStates has identified thresholds below which a given area can be considered to\nbe a \"banking desert.\" Thus far, most analyses of the country as a whole have\ntended to focus on minimum distances from geographic areas to the nearest bank,\nwhile a recent density-based analysis focused only on the city of Chicago. As\nsuch, there is not yet a nationwide study of bank densities for the entire\nUnited States. This study calculates banks per square mile for U.S. Census\ntracts over ten different ranges of population density. One main finding is\nthat bank density is sensitive to the measurement radius used (for example,\ndensity in urban areas can be calculated as the number of banks within two\nmiles, while some rural areas require a 20-mile radius). This study then\ncompiles a set of lower 5- and 10-percent thresholds that might be used to\nidentify \"banking deserts\" in various urban, suburban, and rural areas; these\nlargely conform to the findings of previous analyses. Finally, adjusting for\npopulation density using regression residuals, this paper examines whether an\nindex of economic deprivation is significantly higher in the five percent of\n\"desert\" tracts than in the remaining 95 percent. The differences are largest\n-- and highly significant -- in the densest tracts in large urban areas.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 00:46:12 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Hegerty", "Scott W.", ""]]}, {"id": "2105.07824", "submitter": "Scott Hegerty", "authors": "Scott W. Hegerty", "title": "Are the Spatial Concentrations of Core-City and Suburban Poverty\n  Converging in the Rust Belt?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Decades of deindustrialization have led to economic decline and population\nloss throughout the U.S. Midwest, with the highest national poverty rates found\nin Detroit, Cleveland, and Buffalo. This poverty is often confined to core\ncities themselves, however, as many of their surrounding suburbs continue to\nprosper. Poverty can therefore be highly concentrated at the MSA level, but\nmore evenly distributed within the borders of the city proper. One result of\nthis disparity is that if suburbanites consider poverty to be confined to the\ncentral city, they might be less willing to devote resources to alleviate it.\nBut due to recent increases in suburban poverty, particularly since the 2008\nrecession, such urban-suburban gaps might be shrinking. Using Census\ntract-level data, this study quantifies poverty concentrations for four \"Rust\nBelt\" MSAs, comparing core-city and suburban concentrations in 2000, 2010, and\n2015. There is evidence of a large gap between core cities and outlying areas,\nwhich is closing in the three highest-poverty cities, but not in Milwaukee. A\nset of four comparison cities show a smaller, more stable city-suburban divide\nin the U.S. \"Sunbelt,\" while Chicago resembles a \"Rust Belt\" metro.\n", "versions": [{"version": "v1", "created": "Thu, 13 May 2021 00:32:26 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Hegerty", "Scott W.", ""]]}, {"id": "2105.07867", "submitter": "Juan Bautista Gonz\\'alez Blanco", "authors": "Juan B Gonzalez, Alfonso Sanchez", "title": "What shapes climate change perceptions in Africa? A random forest\n  approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Climate change perceptions are fundamental for adaptation and environmental\npolicy support. Although Africa is one of the most vulnerable regions to\nclimate change, little research has focused on how climate change is perceived\nin the continent. Using random forest methodology, we analyse Afrobarometer\ndata (N = 45,732), joint with climatic data, to explore what shapes climate\nchange perceptions in Africa. We include 5 different dimensions of climate\nchange perceptions: awareness, belief in its human cause, risk perception, need\nto stop it and self-efficacy. Results indicate that perceived agriculture\nconditions are crucial for perceiving climate change. Country-level factors and\nlong-term changes in local weather conditions are among the most important\npredictors. Moreover, education level, access to information, poverty,\nauthoritarian values, and trust in institutions shape individual climate change\nperceptions. Demographic effects -- including religion -- seem negligible.\nThese findings suggest policymakers and environmental communicators how to\nframe climate change in Africa to raise awareness, gather public support and\ninduce adaptation.\n", "versions": [{"version": "v1", "created": "Mon, 17 May 2021 14:03:14 GMT"}], "update_date": "2021-05-18", "authors_parsed": [["Gonzalez", "Juan B", ""], ["Sanchez", "Alfonso", ""]]}, {"id": "2105.08208", "submitter": "Tjeerd De Vries", "authors": "Tjeerd de Vries", "title": "A Quantile Approach to Asset Pricing Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  This paper develops a new way of analyzing the performance of asset pricing\nmodels. I show that many classical asset pricing bounds, such as the Hansen and\nJagannathan (1991) (HJ) bound, can be improved upon by looking at derivative\ncontracts. The resulting bound is found to be much tighter than the HJ bound in\nempirical data. A direct implication is that the SDF process is more volatile\nthan previously assumed and poses new challenges to consumption based asset\npricing models. A central ingredient of this new bound is the risk-neutral\nquantile function. Two additional applications consider the use of this\nfunction: (i) As a predictor of Value-at-Risk (ii) As a forward looking measure\nof crash risk. Both applications underscore the importance of analyzing\nquantiles of the data, instead of the more prevalent variance and equity\npremia.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 00:22:34 GMT"}], "update_date": "2021-05-19", "authors_parsed": [["de Vries", "Tjeerd", ""]]}, {"id": "2105.08349", "submitter": "Elena Gubar", "authors": "Elena Gubar, Laura Policardo, Edgar J. Sanchez Carrera, Vladislav\n  Taynitskiy", "title": "Optimal Lockdown Policies driven by Socioeconomic Costs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this research paper we modify a classical SIR model to better adapt to the\ndynamics of COVID-19, that is we propose the heterogeneous SQAIRD model where\nCOVID-19 spreads over a population of economic agents, namely: the elderly,\nadults and young people. We then compute and simulate an optimal control\nproblem faced by a Government, where its objective is to minimize the costs\ngenerated by the pandemics using as control a compulsory quarantine measure\n(that is, a lockdown). We first analyze the problem from a theoretical\nperspective, claiming that different lockdown policies (total lockdown, no\nlockdown or partial lockdown) may justified by different cost (concave or\nconvex) structures of the economies. We then focus on a particular cost\nstructure (convex costs) and we simulate a targeted optimal policy vs. a\nuniform optimal policy, by dividing the whole population in three demographic\ngroups (young, adults and old). We also simulate the dynamic of the pandemic\nwith no policy implemented. Simulations highlighted the fact that: a) a policy\nof lockdown is always better than the \\emph{laissez faire} policy, because it\nlimits the costs that the pandemic generates in an uncontrolled situation; b) a\ntargeted policy based on age of the individuals outperforms a uniform policy in\nterms of costs that it generates, being a targeted policy less costly and\nequally effective in the control of the pandemic.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 08:22:30 GMT"}], "update_date": "2021-05-19", "authors_parsed": [["Gubar", "Elena", ""], ["Policardo", "Laura", ""], ["Carrera", "Edgar J. Sanchez", ""], ["Taynitskiy", "Vladislav", ""]]}, {"id": "2105.08475", "submitter": "Anton Korinek", "authors": "Katya Klinova and Anton Korinek", "title": "AI and Shared Prosperity", "comments": null, "journal-ref": "Proceedings of the 2021 AAAI/ACM Conference on AI, Ethics, and\n  Society (AIES '21)", "doi": "10.1145/3461702.3462619", "report-no": null, "categories": "cs.AI cs.CY econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Future advances in AI that automate away human labor may have stark\nimplications for labor markets and inequality. This paper proposes a framework\nto analyze the effects of specific types of AI systems on the labor market,\nbased on how much labor demand they will create versus displace, while taking\ninto account that productivity gains also make society wealthier and thereby\ncontribute to additional labor demand. This analysis enables ethically-minded\ncompanies creating or deploying AI systems as well as researchers and\npolicymakers to take into account the effects of their actions on labor markets\nand inequality, and therefore to steer progress in AI in a direction that\nadvances shared prosperity and an inclusive economic future for all of\nhumanity.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 12:37:18 GMT"}], "update_date": "2021-05-19", "authors_parsed": [["Klinova", "Katya", ""], ["Korinek", "Anton", ""]]}, {"id": "2105.08814", "submitter": "Geoff Boeing", "authors": "Shiqin Liu, Carl Higgs, Jonathan Arundel, Geoff Boeing, Nicholas\n  Cerdera, David Moctezuma, Ester Cerin, Deepti Adlakha, Melanie Lowe, and\n  Billie Giles-Corti", "title": "A Generalized Framework for Measuring Pedestrian Accessibility around\n  the World Using Open Data", "comments": null, "journal-ref": "Geographical Analysis, 2021", "doi": "10.1111/gean.12290", "report-no": null, "categories": "cs.CY econ.GN physics.soc-ph q-fin.EC stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pedestrian accessibility is an important factor in urban transport and land\nuse policy and critical for creating healthy, sustainable cities. Developing\nand evaluating indicators measuring inequalities in pedestrian accessibility\ncan help planners and policymakers benchmark and monitor the progress of city\nplanning interventions. However, measuring and assessing indicators of urban\ndesign and transport features at high resolution worldwide to enable city\ncomparisons is challenging due to limited availability of official, high\nquality, and comparable spatial data, as well as spatial analysis tools\noffering customizable frameworks for indicator construction and analysis. To\naddress these challenges, this study develops an open source software framework\nto construct pedestrian accessibility indicators for cities using open and\nconsistent data. It presents a generalized method to consistently measure\npedestrian accessibility at high resolution and spatially aggregated scale, to\nallow for both within- and between-city analyses. The open source and open data\nmethods developed in this study can be extended to other cities worldwide to\nsupport local planning and policymaking. The software is made publicly\navailable for reuse in an open repository.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 20:22:58 GMT"}], "update_date": "2021-05-20", "authors_parsed": [["Liu", "Shiqin", ""], ["Higgs", "Carl", ""], ["Arundel", "Jonathan", ""], ["Boeing", "Geoff", ""], ["Cerdera", "Nicholas", ""], ["Moctezuma", "David", ""], ["Cerin", "Ester", ""], ["Adlakha", "Deepti", ""], ["Lowe", "Melanie", ""], ["Giles-Corti", "Billie", ""]]}, {"id": "2105.09148", "submitter": "Fabian Stephany", "authors": "Fabian Stephany, Otto K\\\"assi, Uma Rani, Vili Lehdonvirta", "title": "Online Labour Index 2020: New ways to measure the world's remote\n  freelancing market", "comments": "10 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Online Labour Index (OLI) was launched in 2016 to measure the global\nutilisation of online freelance work at scale. Five years after its creation,\nthe OLI has become a point of reference for scholars and policy experts\ninvestigating the online gig economy. As the market for online freelancing work\nmatures, a high volume of data and new analytical tools allow us to revisit\nhalf a decade of online freelance monitoring and extend the index's scope to\nmore dimensions of the global online freelancing market. In addition to\nmeasuring the utilisation of online labour across countries and occupations by\ntracking the number of projects and tasks posted on major English-language\nplatforms, the new Online Labour Index 2020 (OLI 2020) also tracks Spanish- and\nRussian-language platforms, reveals changes over time in the geography of\nlabour supply, and estimates female participation in the online gig economy.\nThe rising popularity of software and tech work and the concentration of\nfreelancers on the Indian subcontinent are examples of the insights that the\nOLI 2020 provides. The OLI 2020 delivers a more detailed picture of the world\nof online freelancing via an interactive online visualisation updated daily. It\nprovides easy access to downloadable open data for policymakers, labour market\nresearchers, and the general public (www.onlinelabourobservatory.org).\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2021 14:10:04 GMT"}, {"version": "v2", "created": "Mon, 21 Jun 2021 10:37:22 GMT"}], "update_date": "2021-06-22", "authors_parsed": [["Stephany", "Fabian", ""], ["Kässi", "Otto", ""], ["Rani", "Uma", ""], ["Lehdonvirta", "Vili", ""]]}, {"id": "2105.09154", "submitter": "Andrea Fronzetti Colladon PhD", "authors": "M. Elshendy, A. Fronzetti Colladon, E. Battistoni, P. A. Gloor", "title": "Using four different online media sources to forecast the crude oil\n  price", "comments": null, "journal-ref": "Journal of Information Science 44(3), 408-421 (2018)", "doi": "10.1177/0165551517698298", "report-no": null, "categories": "econ.GN cs.CL q-fin.EC q-fin.GN", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  This study looks for signals of economic awareness on online social media and\ntests their significance in economic predictions. The study analyses, over a\nperiod of two years, the relationship between the West Texas Intermediate daily\ncrude oil price and multiple predictors extracted from Twitter, Google Trends,\nWikipedia, and the Global Data on Events, Language, and Tone database (GDELT).\nSemantic analysis is applied to study the sentiment, emotionality and\ncomplexity of the language used. Autoregressive Integrated Moving Average with\nExplanatory Variable (ARIMAX) models are used to make predictions and to\nconfirm the value of the study variables. Results show that the combined\nanalysis of the four media platforms carries valuable information in making\nfinancial forecasting. Twitter language complexity, GDELT number of articles\nand Wikipedia page reads have the highest predictive power. This study also\nallows a comparison of the different fore-sighting abilities of each platform,\nin terms of how many days ahead a platform can predict a price movement before\nit happens. In comparison with previous work, more media sources and more\ndimensions of the interaction and of the language used are combined in a joint\nanalysis.\n", "versions": [{"version": "v1", "created": "Wed, 19 May 2021 14:19:18 GMT"}], "update_date": "2021-05-20", "authors_parsed": [["Elshendy", "M.", ""], ["Colladon", "A. Fronzetti", ""], ["Battistoni", "E.", ""], ["Gloor", "P. A.", ""]]}, {"id": "2105.09736", "submitter": "Russell McKenna", "authors": "R. McKenna, I. Mulalic, I. Soutar, J. M. Weinand, J. Price, S.\n  Petrovic, K. Mainzer", "title": "Exploring trade-offs between landscape impact, land use and resource\n  quality for onshore variable renewable energy: an application to Great\n  Britain", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The ambitious Net Zero aspirations of Great Britain (GB) require massive and\nrapid developments of Variable Renewable Energy (VRE) technologies. GB\npossesses substantial resources for these technologies, but questions remain\nabout which VRE should be exploited where. This study explores the trade-offs\nbetween landscape impact, land use competition and resource quality for onshore\nwind as well as ground- and roof-mounted photovoltaic (PV) systems for GB.\nThese trade-offs constrain the technical and economic potentials for these\ntechnologies at the Local Authority level. Our approach combines\ntechno-economic and geospatial analyses with crowd-sourced scenicness data to\nquantify landscape aesthetics. Despite strong correlations between scenicness\nand planning application outcomes for onshore wind, no such relationship exists\nfor ground-mounted PV. The innovative method for rooftop-PV assessment combines\nbottom-up analysis of four cities with a top-down approach at the national\nlevel. The results show large technical potentials that are strongly\nconstrained by both landscape and land use aspects. This equates to about 1324\nTWh of onshore wind, 153 TWh of rooftop PV and 1200-7093 TWh ground-mounted PV,\ndepending on scenario. We conclude with five recommendations that focus around\naligning energy and planning policies for VRE technologies across multiple\nscales and governance arenas.\n", "versions": [{"version": "v1", "created": "Thu, 20 May 2021 13:35:13 GMT"}], "update_date": "2021-05-21", "authors_parsed": [["McKenna", "R.", ""], ["Mulalic", "I.", ""], ["Soutar", "I.", ""], ["Weinand", "J. M.", ""], ["Price", "J.", ""], ["Petrovic", "S.", ""], ["Mainzer", "K.", ""]]}, {"id": "2105.09782", "submitter": "A G Adeeth Cariappa", "authors": "A. G. A. Cariappa, B. S. Chandel, G. Sankhala, V. Mani, R. Sendhil, A.\n  K. Dixit and B. S. Meena", "title": "Estimation of economic losses due to milk fever and efficiency gains if\n  prevented: evidence from Haryana, India", "comments": null, "journal-ref": null, "doi": "10.2139/ssrn.3851567", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Calcium (Ca) requirement increases tenfold upon parturition in dairy cows &\nbuffaloes and its deficiency leads to a condition called milk fever (MF).\nEstimation of losses is necessary to understand the depth of the problem and\ndesign preventive measures. How much is the economic loss due to MF? What will\nbe the efficiency gain if MF is prevented at the advent of a technology? We\nanswer these questions using survey data and official statistics employing\neconomic surplus model. MF incidence in sample buffaloes and cows was 19% and\n28%, respectively. Total economic losses were calculated as a sum total of\nlosses from milk production, mortality of animals and treatment costs. Yearly\neconomic loss due to MF was estimated to be INR 1000 crores (US$ 137 million)\nin Haryana. Value of milk lost had the highest share in total economic losses\n(58%), followed by losses due to mortality (29%) and treatment costs (13%).\nDespite lower MF incidence, losses were higher in buffaloes due to higher milk\nprices and market value of animals. The efficiency gain accruing to producers\nif MF is prevented, resulting from increased milk production at decreased costs\nwas estimated at INR 10990 crores (US$ 1.5 billion). As the potential gain if\nprevented is around 10 times the economic losses, this study calls for the use\nof preventive technology against MF.\n", "versions": [{"version": "v1", "created": "Thu, 20 May 2021 14:31:01 GMT"}, {"version": "v2", "created": "Fri, 21 May 2021 11:54:51 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Cariappa", "A. G. A.", ""], ["Chandel", "B. S.", ""], ["Sankhala", "G.", ""], ["Mani", "V.", ""], ["Sendhil", "R.", ""], ["Dixit", "A. K.", ""], ["Meena", "B. S.", ""]]}, {"id": "2105.10007", "submitter": "Yuya Sasaki", "authors": "Ji Hyung Lee, Yuya Sasaki, Alexis Akira Toda, Yulong Wang", "title": "Tax Progressivity and Wealth Inequality: Evidence from Forbes 400", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Using Forbes 400 data together with historical data on tax rates and\nmacroeconomic indicators, we study the effects of the maximum marginal income\ntax rate on wealth inequality. To this end, we develop a novel tail regression\nmethod, which accommodates the unique feature that the data are truncated from\nbelow at the 400th order statistic. Applying this tail regression to the\n\"natural experiment\" (Feldstein, 1995) of the event that tax rates rapidly\ndeclined in the 1980s, we find that higher maximum marginal income tax rates\ninduce higher Pareto exponents of the wealth distribution. Setting the maximum\ntax rate to 0.30-0.40 (as in U.S. currently) leads to a Pareto exponent of\n1.5-1.8, while counterfactually setting it to 0.80 (as suggested by Piketty,\n2014) would lead to a Pareto exponent of 2.6. We present a simple economic\nmodel that explains these findings and discuss the welfare implications of\ntaxation.\n", "versions": [{"version": "v1", "created": "Thu, 20 May 2021 19:48:54 GMT"}, {"version": "v2", "created": "Wed, 2 Jun 2021 21:18:15 GMT"}], "update_date": "2021-06-04", "authors_parsed": [["Lee", "Ji Hyung", ""], ["Sasaki", "Yuya", ""], ["Toda", "Alexis Akira", ""], ["Wang", "Yulong", ""]]}, {"id": "2105.10099", "submitter": "Rui (Aruhan) Shi", "authors": "Rui (Aruhan) Shi", "title": "Learning to make consumption-saving decisions in a changing environment:\n  an AI approach", "comments": "27 pages, 19 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This exercise offers an innovative learning mechanism to model economic\nagent's decision making process using a deep reinforcement learning algorithm.\nIn particular, this AI agent has limited or no information on the underlying\neconomic structure and its own preference. I model how the AI agent learns in\nterms of how it collects and processes information. It is able to learn in real\ntime through constantly interacting with the environment and adjusting its\nactions accordingly. I illustrate that the economic agent under deep\nreinforcement learning is adaptive to changes in a given environment in real\ntime. AI agents differ in their ways of collecting and processing information,\nand this leads to different learning behaviours and welfare distinctions. The\nchosen economic structure can be generalised to other decision making processes\nand economic models.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 02:39:12 GMT"}], "update_date": "2021-05-24", "authors_parsed": [["Rui", "", "", "Aruhan"], ["Shi", "", ""]]}, {"id": "2105.10237", "submitter": "Andrea Fronzetti Colladon PhD", "authors": "P. A. Gloor, A. Fronzetti Colladon, F. Grippa, B. M. Hadley, S.\n  Woerner", "title": "The impact of social media presence and board member composition on new\n  venture success: Evidences from VC-backed U.S. startups", "comments": null, "journal-ref": "Technological Forecasting & Social Change 157, 120098 (2020)", "doi": "10.1016/j.techfore.2020.120098", "report-no": null, "categories": "cs.SI econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The purpose of this study is to examine the impact of board member\ncomposition and board members' social media presence on the performance of\nstartups. Using multiple sources, we compile a unique dataset of about 500\nUS-based technology startups. We find that startups with more venture\ncapitalists on the board and whose board members are active on Twitter attract\nadditional funding over the years, though they do not generate additional\nsales. By contrast, startups which have no venture capitalists on the board and\nwhose board members are not on Twitter show an increased ability to translate\nassets into sales. Consistent with other research, our results indicate that\nstartups potentially benefit from working with VCs because of the opportunity\nto access additional funding, although their presence does not necessarily\ntranslate into sales growth and operational efficiency. We use a number of\ncontrol variables, including board gender representation and board members'\nposition in the interlocking directorates' network.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 09:50:17 GMT"}], "update_date": "2021-05-24", "authors_parsed": [["Gloor", "P. A.", ""], ["Colladon", "A. Fronzetti", ""], ["Grippa", "F.", ""], ["Hadley", "B. M.", ""], ["Woerner", "S.", ""]]}, {"id": "2105.10265", "submitter": "Ahmed Awwad", "authors": "Ahmed Awwad", "title": "The impact of Over The Top service providers on the Global Mobile\n  Telecom Industry: A quantified analysis and recommendations for recovery", "comments": "28 Pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM econ.GN q-fin.EC stat.AP", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Telecom industry is significantly evolving all over the globe than ever.\nMobile users number is increasing remarkably. Telecom operators are investing\nto get more users connected and to improve user experience, however, they are\nfacing various challenges. Decrease of main revenue streams of voice calls, SMS\n(Short Message Service) and LDC (Long distance calls) with a significant\nincrease in data traffic. In contrary, with free cost, OTT (Over the top)\nproviders such as WhatsApp and Facebook communication services rendered over\nnetworks that built and owned by MNOs. Recently, OTT services gradually\nsubstituting the traditional MNOs` services and became ubiquitous with the help\nof the underlying data services provided by MNOs. The OTTs` services massive\npenetration into telecom industry is driving the MNOs to reconsider their\nstrategies and revenue sources.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 10:34:26 GMT"}], "update_date": "2021-05-24", "authors_parsed": [["Awwad", "Ahmed", ""]]}, {"id": "2105.10459", "submitter": "Jiongyan Zhang", "authors": "Jiongyan Zhang", "title": "Research on Regional Urban Economic Development by Nightlight-time\n  Remote Sensing", "comments": "in Chinese", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN eess.IV q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In order to study the phenomenon of regional economic development and urban\nexpansion from the perspective of night-light remote sensing images,\nresearchers use NOAA-provided night-light remote sensing image data (data from\n1992 to 2013) along with ArcGIS software to process image information, obtain\nthe basic pixel information data of specific areas of the image, and analyze\nthese data from the space-time domain for presentation of the trend of regional\neconomic development in China in recent years, and tries to explore the\nurbanization effect brought by the rapid development of China's economy.\nThrough the analysis and study of the data, the results show that the\nurbanization development speed in China is still at its peak, and has great\ndevelopment potential and space. But at the same time, people also need to pay\nattention to the imbalance of regional development.\n", "versions": [{"version": "v1", "created": "Tue, 24 Nov 2020 13:40:30 GMT"}], "update_date": "2021-05-24", "authors_parsed": [["Zhang", "Jiongyan", ""]]}, {"id": "2105.10464", "submitter": "David Cerezo S\\'anchez", "authors": "David Cerezo S\\'anchez", "title": "Pravuil: Global Consensus for a United World", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.DC econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pravuil is a robust, secure, and scalable consensus protocol for a\npermissionless blockchain suitable for deployment in an adversarial environment\nsuch as the Internet. Pravuil circumvents previous shortcomings of other\nblockchains:\n  - Bitcoin's limited adoption problem: as transaction demand grows, payment\nconfirmation times grow much lower than other PoW blockchains\n  - higher transaction security at a lower cost\n  - more decentralisation than other permissionless blockchains\n  - impossibility of full decentralisation and the blockchain scalability\ntrilemma: decentralisation, scalability, and security can be achieved\nsimultaneously\n  - Sybil-resistance for free implementing the social optimum\n  - Pravuil goes beyond the economic limits of Bitcoin or other PoW/PoS\nblockchains, leading to a more valuable and stable crypto-currency\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 17:02:14 GMT"}], "update_date": "2021-05-24", "authors_parsed": [["Sánchez", "David Cerezo", ""]]}, {"id": "2105.10567", "submitter": "Scott Hegerty", "authors": "Scott W. Hegerty", "title": "Deprivation, Crime, and Abandonment: Do Other Midwestern Cities Have\n  'Little Detroits'?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Both within the United States and worldwide, the city of Detroit has become\nsynonymous with economic decline, depopulation, and crime. Is Detroit's\nsituation unique, or can similar neighborhoods be found elsewhere? This study\nexamines Census block group data, as well as local crime statistics for 2014,\nfor a set of five Midwestern cities. Roughly three percent of Chicago's and\nMilwaukee's block groups--all of which are in majority nonwhite areas--exceed\nDetroit's median values for certain crimes, vacancies, and a poverty measure.\nThis figure rises to 11 percent for St. Louis, while Minneapolis has only a\nsingle \"Detroit-like\" block group. Detroit's selected areas are more likely to\nbe similar to the entire city itself, both spatially and statistically, while\nthese types of neighborhoods for highly concentrated \"pockets\" of poverty\nelsewhere. Development programs that are targeted in one city, therefore, must\ntake these differences into account and should be targeted to appropriate\nneighborhoods.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 20:50:57 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Hegerty", "Scott W.", ""]]}, {"id": "2105.10865", "submitter": "Ryan Badman", "authors": "Ryan P. Badman, Yunxin Wu, Keigo Inukai, Rei Akaishi", "title": "Blessing or Curse of Democracy?: Current Evidence from the Covid-19\n  Pandemic", "comments": "21 pages, 2 main figures, 1 main table, 1 supplementary data table", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-bio.OT q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Background: A major question in Covid-19 research is whether democracies\nhandled the Covid-19 pandemic crisis better or worse than authoritarian\ncountries. However, it is important to consider the issues of democracy versus\nauthoritarianism, and state fragility, when examining official Covid-19 death\ncounts in research, because these factors can influence the accurate reporting\nof pandemic deaths by governments. In contrast, excess deaths are less prone to\nvariability in differences in definitions of Covid-19 deaths and testing\ncapacities across countries. Here we use excess pandemic deaths to explore\npotential relationships between political systems and public health outcomes.\n  Methods: We address these issues by comparing the official government\nCovid-19 death counts in a well-established John Hopkins database to the\ngenerally more reliable excess mortality measure of Covid-19 deaths, taken from\nthe recently released World Mortality Dataset. We put the comparison in the\ncontext of the political and fragile state dimensions.\n  Findings: We find (1) significant potential underreporting of Covid-19 deaths\nby authoritarian governments and governments with high state fragility and (2)\nsubstantial geographic variation among countries and regions with regard to\nstandard democracy indices. Additionally, we find that more authoritarian\ngovernments are (weakly) associated with more excess deaths during the pandemic\nthan democratic governments.\n  Interpretations: The inhibition and censorship of information flows, inherent\nto authoritarian states, likely results in major inaccuracies in pandemic\nstatistics that confound global public health analyses. Thus, both excess\npandemic deaths and official Covid-19 death counts should be examined in\nstudies using death as an outcome variable.\n", "versions": [{"version": "v1", "created": "Sun, 23 May 2021 06:52:50 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Badman", "Ryan P.", ""], ["Wu", "Yunxin", ""], ["Inukai", "Keigo", ""], ["Akaishi", "Rei", ""]]}, {"id": "2105.10965", "submitter": "Demian Pouzo", "authors": "Marina Dias and Demian Pouzo", "title": "Inference for multi-valued heterogeneous treatment effects when the\n  number of treated units is small", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.EM econ.GN math.ST q-fin.EC stat.AP stat.ME stat.TH", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We propose a method for conducting asymptotically valid inference for\ntreatment effects in a multi-valued treatment framework where the number of\nunits in the treatment arms can be small and do not grow with the sample size.\nWe accomplish this by casting the model as a semi-/non-parametric conditional\nquantile model and using known finite sample results about the law of the\nindicator function that defines the conditional quantile. Our framework allows\nfor structural functions that are non-additively separable, with flexible\nfunctional forms and heteroskedasticy in the residuals, and it also encompasses\ncommonly used designs like difference in difference. We study the finite sample\nbehavior of our test in a Monte Carlo study and we also apply our results to\nassessing the effect of weather events on GDP growth.\n", "versions": [{"version": "v1", "created": "Sun, 23 May 2021 16:06:22 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Dias", "Marina", ""], ["Pouzo", "Demian", ""]]}, {"id": "2105.11077", "submitter": "Cunyi Yang", "authors": "Fen Li, Cunyi Yang, Zhenghui Li, and Pierre Failler", "title": "Does Geopolitics Have an Impact on Energy Trade? Empirical Research on\n  Emerging Countries", "comments": "23 Pages,16 Tables, 8 Figures", "journal-ref": "Sustainability. 2021, 13 (9), 5199", "doi": "10.3390/su13095199", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The energy trade is an important pillar of each country's development, making\nup for the imbalance in the production and consumption of fossil fuels.\nGeopolitical risks affect the energy trade of various countries to a certain\nextent, but the causes of geopolitical risks are complex, and energy trade also\ninvolves many aspects, so the impact of geopolitics on energy trade is also\ncomplex. Based on the monthly data from 2000 to 2020 of 17 emerging economies,\nthis paper employs the fixed-effect model and the regression-discontinuity (RD)\nmodel to verify the negative impact of geopolitics on energy trade first and\nthen analyze the mechanism and heterogeneity of the impact. The following\nconclusions are drawn: First, geopolitics has a significant negative impact on\nthe import and export of the energy trade, and the inhibition on the export is\ngreater than that on the import. Second, the impact mechanism of geopolitics on\nthe energy trade is reflected in the lagging effect and mediating effect on the\nimports and exports; that is, the negative impact of geopolitics on energy\ntrade continued to be significant 10 months later. Coal and crude oil prices,\nas mediating variables, decreased to reduce the imports and exports, whereas\nnatural gas prices showed an increase. Third, the impact of geopolitics on\nenergy trade is heterogeneous in terms of national attribute characteristics\nand geo-event types.\n", "versions": [{"version": "v1", "created": "Mon, 24 May 2021 03:12:23 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Li", "Fen", ""], ["Yang", "Cunyi", ""], ["Li", "Zhenghui", ""], ["Failler", "Pierre", ""]]}, {"id": "2105.11080", "submitter": "Cunyi Yang", "authors": "Cunyi Yang, Tinghui Li, Khaldoon Albitar", "title": "Does energy efficiency affect ambient PM2.5? The moderating role of\n  energy investment", "comments": "27 Pages, 11 Tables, 2 Figures", "journal-ref": "Frontiers in Environmental Science. 2021, 9", "doi": "10.3389/fenvs.2021.707751", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The difficulty of balance between environment and energy consumption makes\ncountries and enterprises face a dilemma, and improving energy efficiency has\nbecome one of the ways to solve this dilemma. Based on data of 158 countries\nfrom 1980 to 2018, the dynamic TFP of different countries is calculated by\nmeans of the Super-SBM-GML model. The TFP is decomposed into indexes of EC\n(Technical Efficiency Change), TC (Technological Change) and EC has been\nextended to PEC (Pure Efficiency Change) and SEC (Scale Efficiency Change).\nThen the fixed effect model and fixed effect panel quantile model are used to\nanalyze the moderating effect and exogenous effect of energy efficiency on\nPM2.5 concentration on the basis of verifying that energy efficiency can reduce\nPM2.5 concentration. We conclude, first, the global energy efficiency has been\ncontinuously improved during the sample period, and both of technological\nprogress and technical efficiency have been improved. Second, the impact of\nenergy efficiency on PM2.5 is heterogeneous which is reflected in the various\nelements of energy efficiency decomposition. The increase of energy efficiency\ncan inhibit PM2.5 concentration and the inhibition effect mainly comes from TC\nand PEC but SEC promotes PM2.5 emission. Third, energy investment plays a\nmoderating role in the environmental protection effect of energy efficiency.\nFourth, the impact of energy efficiency on PM2.5 concentration is heterogeneous\nin terms of national attribute, which is embodied in the differences of\nnational development, science & technology development level, new energy\nutilization ratio and the role of international energy trade.\n", "versions": [{"version": "v1", "created": "Mon, 24 May 2021 03:45:22 GMT"}], "update_date": "2021-07-26", "authors_parsed": [["Yang", "Cunyi", ""], ["Li", "Tinghui", ""], ["Albitar", "Khaldoon", ""]]}, {"id": "2105.11195", "submitter": "Fabian Scheller", "authors": "Fritz Braeuer, Max Kleinebrahm, Elias Naber, Fabian Scheller, Russell\n  McKenna", "title": "Optimal system design for energy communities in multi-family buildings:\n  the case of the German Tenant Electricity Law", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Involving residential actors in the energy transition is crucial for its\nsuccess. Local energy generation, consumption and trading are identified as\ndesirable forms of involvement, especially in energy communities. The\npotentials for energy communities in the residential building stock are high\nbut are largely untapped in multi-family buildings. In many countries, rapidly\nevolving legal frameworks aim at overcoming related barriers, e.g. ownership\nstructures, principal-agent problems and system complexity. But academic\nliterature is scarce regarding the techno-economic and environmental\nimplications of such complex frameworks. This paper develops a mixed-integer\nlinear program (MILP) optimisation model for assessing the implementation of\nmulti-energy systems in an energy community in multi-family buildings with a\nspecial distinction between investor and user. The model is applied to the\nGerman Tenant Electricity Law. Based on hourly demands from appliances, heating\nand electric vehicles, the optimal energy system layout and dispatch are\ndetermined. The results contain a rich set of performance indicators that\ndemonstrate how the legal framework affects the technologies' interdependencies\nand economic viability of multi-energy system energy communities. Certain\neconomic technology combinations may fail to support national emissions\nmitigation goals and lead to lock-ins in Europe's largest residential building\nstock. The subsidies do not lead to the utilisation of a battery storage.\nDespite this, self-sufficiency ratios of more than 90% are observable for\nsystems with combined heat and power plants and heat pumps. Public CO2\nmitigation costs range between 147.5-272.8 EUR/tCO2. Finally, the results show\nthe strong influence of the heat demand on the system layout.\n", "versions": [{"version": "v1", "created": "Mon, 24 May 2021 10:44:24 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Braeuer", "Fritz", ""], ["Kleinebrahm", "Max", ""], ["Naber", "Elias", ""], ["Scheller", "Fabian", ""], ["McKenna", "Russell", ""]]}, {"id": "2105.11405", "submitter": "Ar\\'anzazu de Juan Fern\\'andez", "authors": "C. Seri and A. de Juan Fernandez", "title": "The relationship between economic growth and environment. Testing the\n  EKC hypothesis for Latin American countries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC stat.AP", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We employ an ARDL bounds testing approach to cointegration and Unrestricted\nError Correction Models (UECMs) to estimate the relationship between income and\nCO2 emissions per capita in 21 Latin American Countries (LACs) over 1960-2017.\nUsing time series we estimate six different specifications of the model to take\ninto account the independent effect on CO2 emissions per capita of different\nfactors considered as drivers of different dynamics of CO2 emissions along the\ndevelopment path. This approach allows to address two concerns. First, the\nestimation of the model controlling for different variables serves to assess if\nthe EKC hypothesis is supported by evidence in any of the LACs considered and\nto evaluate if this evidence is robust to different model specifications.\nSecond, the inclusion of control variables accounting for the effect on CO2\nemissions is directed at increasing our understanding of CO2 emissions drivers\nin different countries. The EKC hypothesis effectively describes the long term\nincome-emissions relationship only in a minority of LACs and, in many cases,\nthe effect on CO2 emissions of different factors depends on the individual\ncountry experience and on the type and quantity of environmental policies\nadopted. Overall, these results call for increased environmental action in the\nregion.\n", "versions": [{"version": "v1", "created": "Tue, 18 May 2021 15:26:57 GMT"}], "update_date": "2021-05-25", "authors_parsed": [["Seri", "C.", ""], ["Fernandez", "A. de Juan", ""]]}, {"id": "2105.11716", "submitter": "Aloysius Sequeira", "authors": "Manohar Serrao and Aloysius Sequeira and K. V. M. Varambally", "title": "Impact of Financial Inclusion on the Socio-Economic Status of Rural and\n  Urban Households of Vulnerable Sections in Karnataka", "comments": "28 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Financial inclusion and inclusive growth are the buzzwords today. Inclusive\ngrowth empowers people belonging to vulnerable sections. This in turn depends\nupon a variety of factors, the most important being financial inclusion, which\nplays a strategic role in promoting inclusive growth and helps in reducing\npoverty by providing regular and reliable sources of finance to the vulnerable\nsections. In this direction, the Government of India in its drive for financial\ninclusion has taken several measures to increase the access to and availing of\nformal financial services by unbanked households. The purpose of this paper is\nto assess the nature and extent of financial inclusion and its impact on the\nsocio-economic status of households belonging to vulnerable sections focusing\non inclusive growth. This has been analyzed with the theoretical background on\nfinancial access and economic growth, and by analyzing the primary data\ncollected from the Revenue Divisions of Karnataka. The results show that there\nis a disparity in nature and extent of financial inclusion. Access to, availing\nof formal banking services pave the way to positive changes in the\nsocio-economic status of households belonging to vulnerable sections which are\ncorrelated, leading to inclusive growth based on which the paper proposes a\nmodel to make the financial system more inclusive and pro-poor.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2021 07:39:33 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Serrao", "Manohar", ""], ["Sequeira", "Aloysius", ""], ["Varambally", "K. V. M.", ""]]}, {"id": "2105.11756", "submitter": "Bayram Cakir", "authors": "Elvan Ece Satici and Bayram Cakir", "title": "Environmental Kuznets Curve & Effectiveness of International Policies:\n  Evidence from Cross Country Carbon Emission Analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this article, we are presenting the relationship between environmental\npollution and the income level of the selected twenty-four countries. We\nimplemented a data-based research analysis where, for each country, we analyzed\nthe related data for fifty-six years, from 1960 to 2016, to assess the\nrelationship between the carbon emission and income level. After performing the\nrelated data analysis for each country, we concluded whether the results for\nthat country were in line with the Environmental Kuznets Curve (EKC)\nhypothesis. The EKC hypothesis suggests that the carbon emission per capita\nstarts a declining trend when the country-specific high level of income is\nreached. The results of our data analyses show that the EKC hypothesis is valid\nfor high-income countries and the declining trends of carbon emission are\nclearly observed when the income level reaches a specific high enough level. On\nthe other hand, for the non-high income countries, our analysis results show\nthat it is too early to make an assessment at this growth stage of their\neconomies because they have not reached their related high-enough income per\ncapita levels yet. Furthermore, we performed two more additional analyses on\nhigh-income countries. First, we analyzed the related starting years of their\ncarbon emission declining trends. The big variance in the starting years of the\ncarbon emission declining trends shows that the international policies are\nclearly ineffective in initiating the declining trend in carbon emission. In\naddition, for the high-income countries, we explained the differences in their\ncarbon emission per capita levels in 2014 with their SGI indices and their\ndependence on high-carbon emission energy production.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2021 08:52:36 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Satici", "Elvan Ece", ""], ["Cakir", "Bayram", ""]]}, {"id": "2105.11829", "submitter": "F. Javier S\\'anchez-Vidal", "authors": "F. Javier Sanchez-Vidal and Camino Ramon-Llorens", "title": "Perception of corruption influences entrepreneurship inside established\n  companies", "comments": "18 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Based on the Global Entrepreneurship Monitor (GEM) surveys and conducting a\npanel data estimation to test our hypothesis, this paper examines whether\ncorruption perceptions might sand or grease the wheels for entrepreneurship\ninside companies or intrapreneurship in a sample of 92 countries for the period\n2012 to 2019. Our results find that the corruption perception sands the wheel\nfor intrapreneurship. There is evidence of a quadratic relation, but this\nrelation is only clear for the less developed countries, which sort of moderate\nthe very negative effect of corruption for these countries. The results also\nconfirm that corruption influences differently on intrapreneurship depending on\nthe level of development of the country.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2021 10:54:37 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Sanchez-Vidal", "F. Javier", ""], ["Ramon-Llorens", "Camino", ""]]}, {"id": "2105.11840", "submitter": "Martin Huber", "authors": "Berno Buechel, Selina Gangl, Martin Huber", "title": "How residence permits affect the labor market attachment of foreign\n  workers: Evidence from a migration lottery in Liechtenstein", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We analyze the impact of obtaining a residence permit on foreign workers'\nlabor market and residential attachment. To overcome the usually severe\nselection issues, we exploit a unique migration lottery that randomly assigns\naccess to otherwise restricted residence permits in Liechtenstein (situated\nbetween Austria and Switzerland). Using an instrumental variable approach, our\nresults show that lottery compliers (whose migration behavior complies with the\nassignment in their first lottery) raise their employment probability in\nLiechtenstein by on average 24 percentage points across outcome periods (2008\nto 2018) as a result of receiving a permit. Relatedly, their activity level and\nemployment duration in Liechtenstein increase by on average 20 percentage\npoints and 1.15 years, respectively, over the outcome window. These substantial\nand statistically significant effects are mainly driven by individuals not\n(yet) working in Liechtenstein prior to the lottery rather than by previous\ncross-border commuters. Moreover, we find both the labor market and residential\neffects to be persistent even several years after the lottery with no sign of\nfading out. These results suggest that granting resident permits to foreign\nworkers can be effective to foster labor supply even beyond the effect of\ncross-border commuting from adjacent regions.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2021 11:23:30 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Buechel", "Berno", ""], ["Gangl", "Selina", ""], ["Huber", "Martin", ""]]}, {"id": "2105.12044", "submitter": "Ariel Ortiz-Bobea", "authors": "Ariel Ortiz-Bobea", "title": "Climate, Agriculture and Food", "comments": "100 pages, 14 figures, handbook chapter", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Agriculture is arguably the most climate-sensitive sector of the economy.\nGrowing concerns about anthropogenic climate change have increased research\ninterest in assessing its potential impact on the sector and in identifying\npolicies and adaptation strategies to help the sector cope with a changing\nclimate. This chapter provides an overview of recent advancements in the\nanalysis of climate change impacts and adaptation in agriculture with an\nemphasis on methods. The chapter provides an overview of recent research\nefforts addressing key conceptual and empirical challenges. The chapter also\ndiscusses practical matters about conducting research in this area and provides\nreproducible R code to perform common tasks of data preparation and model\nestimation in this literature. The chapter provides a hands-on introduction to\nnew researchers in this area.\n", "versions": [{"version": "v1", "created": "Tue, 25 May 2021 16:22:28 GMT"}], "update_date": "2021-05-26", "authors_parsed": [["Ortiz-Bobea", "Ariel", ""]]}, {"id": "2105.12292", "submitter": "Eiji Yamamura", "authors": "Eiji Yamamura", "title": "The Effect of Providing Peer Information on Evaluation for Gender\n  Equalized and ESG Oriented Firms: An Internet Survey Experiment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet survey experiment is conducted to examine how providing peer\ninformation of evaluation about progressive firms changed individual's\nevaluations. Using large sample including over 13,000 observations collected by\ntwo-step experimental surveys, I found; (1) provision of the information leads\nindividuals to expect higher probability of rising of stocks and be more\nwilling to buy it. (2) the effect on willingness to buy is larger than the\nexpected probability of stock price rising, (3) The effect for woman is larger\nthan for man. (4) individuals who prefer environment (woman's empowerment)\nbecome more willing to buy stock of pro-environment (gender-balanced) firms\nthan others if they have the information. (5) The effect of the peer\ninformation is larger for individuals with \"warm -glow\" motivation.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2021 01:34:43 GMT"}], "update_date": "2021-05-27", "authors_parsed": [["Yamamura", "Eiji", ""]]}, {"id": "2105.12304", "submitter": "Rahul Deb", "authors": "Rahul Deb and Anne-Katrin Roesler", "title": "Multi-Dimensional Screening: Buyer-Optimal Learning and Informational\n  Robustness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A monopolist seller of multiple goods screens a buyer whose type is initially\nunknown to both but drawn from a commonly known distribution. The buyer\nprivately learns about his type via a signal. We derive the seller's optimal\nmechanism in two different information environments. We begin by deriving the\nbuyer-optimal outcome. Here, an information designer first selects a signal,\nand then the seller chooses an optimal mechanism in response; the designer's\nobjective is to maximize consumer surplus. Then, we derive the optimal\ninformationally robust mechanism. In this case, the seller first chooses the\nmechanism, and then nature picks the signal that minimizes the seller's\nprofits. We derive the relation between both problems and show that the optimal\nmechanism in both cases takes the form of pure bundling.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2021 02:31:57 GMT"}], "update_date": "2021-05-27", "authors_parsed": [["Deb", "Rahul", ""], ["Roesler", "Anne-Katrin", ""]]}, {"id": "2105.12469", "submitter": "Patrick Reinwald", "authors": "Patrick Reinwald, Stephan Leitner and Friederike Wall", "title": "Effects of limited and heterogeneous memory in hidden-action situations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Limited memory of decision-makers is often neglected in economic models,\nalthough it is reasonable to assume that it significantly influences the\nmodels' outcomes. The hidden-action model introduced by Holmstr\\\"om also\nincludes this assumption. In delegation relationships between a principal and\nan agent, this model provides the optimal sharing rule for the outcome that\noptimizes both parties' utilities. This paper introduces an agent-based model\nof the hidden-action problem that includes limitations in the cognitive\ncapacity of contracting parties. Our analysis mainly focuses on the sensitivity\nof the principal's and the agent's utilities to the relaxed assumptions. The\nresults indicate that the agent's utility drops with limitations in the\nprincipal's cognitive capacity. Also, we find that the agent's cognitive\ncapacity limitations affect neither his nor the principal's utility. Thus, the\nagent bears all adverse effects resulting from limitations in cognitive\ncapacity.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2021 10:55:28 GMT"}], "update_date": "2021-05-27", "authors_parsed": [["Reinwald", "Patrick", ""], ["Leitner", "Stephan", ""], ["Wall", "Friederike", ""]]}, {"id": "2105.12699", "submitter": "Andreea Avramescu", "authors": "Andreea Avramescu, Richard Allmendinger, Manuel L\\'opez-Ib\\'a\\~nez", "title": "Managing Manufacturing and Delivery of Personalised Medicine: Current\n  and Future Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN math.OC q-bio.QM q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With almost 50% of annual commercial drug approvals being Personalised\nMedicine (PM) and its huge potential to improve quality of life, this emerging\nmedical sector has received increased attention from the industry and medical\nresearch, driven by health and care services, and us, the patients.\nNotwithstanding the power of Advanced Therapy Medicinal Products (ATMPs) to\ntreat progressive illnesses and rare genetic conditions, their delivery on\nlarge scale is still problematic. The biopharmaceutical companies are currently\nstruggling to meet timely delivery and, given high prices of up to $2 million\nper patient, prove the cost-effectiveness of their ATMP. The fragility of ATMPs\ncombined with the impossibility for replacements due to the nature of the\ntreatment and the advanced stages of the patient's condition are some of the\nbottlenecks added to a generally critical supply chain. As a consequence, ATMPs\nare currently used in most cases only as a last resort. ATMPs are at the\nintersection of multiple healthcare logistic networks and, due to their\nnovelty, research around their commercialisation is still in its infancy from\nan operations research perspective. To accelerate technology adoption in this\ndomain, we characterize pertinent practical challenges in a PM supply chain and\nthen capture them in a holistic mathematical model ready for optimisation. The\nidentified challenges and derived model will be contrasted with literature of\nrelated supply chains in terms of model formulations and suitable optimisation\nmethods. Finally, needed technological advancements are discussed to pave the\nway to affordable commercialisation of PM.\n", "versions": [{"version": "v1", "created": "Fri, 21 May 2021 12:42:12 GMT"}], "update_date": "2021-05-27", "authors_parsed": [["Avramescu", "Andreea", ""], ["Allmendinger", "Richard", ""], ["López-Ibáñez", "Manuel", ""]]}, {"id": "2105.12878", "submitter": "Sajad Rahimian", "authors": "Sajad Rahimian", "title": "Corruption Determinants, Geography, and Model Uncertainty", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  This paper aims to identify the robust determinants of corruption after\nintegrating out the effects of spatial spillovers in corruption levels between\ncountries. In other words, we want to specify which variables play the most\ncritical role in determining the corruption levels after accounting for the\neffects that neighbouring countries have on each other. We collected the annual\ndata of 115 countries over the 1985-2015 period and used the averaged values to\nconduct our empirical analysis. Among 39 predictors of corruption, our spatial\nBMA models identify Rule of Law as the most persistent determinant of\ncorruption.\n", "versions": [{"version": "v1", "created": "Wed, 26 May 2021 23:39:56 GMT"}], "update_date": "2021-05-28", "authors_parsed": [["Rahimian", "Sajad", ""]]}, {"id": "2105.12915", "submitter": "Xi Zhi Lim", "authors": "Xi Zhi \"RC\" Lim", "title": "Ordered Reference Dependent Choice", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  We study how violations of structural assumptions like expected utility and\nexponential discounting can be connected to reference dependent preferences\nwith set-dependent reference points, even if behavior conforms with these\nassumptions when the reference is fixed. An axiomatic framework jointly and\nsystematically relaxes general rationality (WARP) and structural assumptions to\ncapture reference dependence across domains. It gives rise to a linear order\nthat determines references points, which in turn determines the preference\nparameters for a choice problem. This allows us to study risk, time, and social\npreferences collectively, where seemingly independent anomalies are\ninterconnected through the lens of reference-dependent choice.\n", "versions": [{"version": "v1", "created": "Thu, 27 May 2021 02:22:02 GMT"}], "update_date": "2021-05-28", "authors_parsed": [["Lim", "Xi Zhi \"RC\"", ""]]}, {"id": "2105.13556", "submitter": "Carlos Carrion", "authors": "Carlos Carrion, Zenan Wang, Harikesh Nair, Xianghong Luo, Yulin Lei,\n  Xiliang Lin, Wenlong Chen, Qiyu Hu, Changping Peng, Yongjun Bao and Weipeng\n  Yan", "title": "Blending Advertising with Organic Content in E-Commerce: A Virtual Bids\n  Optimization Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In e-commerce platforms, sponsored and non-sponsored content are jointly\ndisplayed to users and both may interactively influence their engagement\nbehavior. The former content helps advertisers achieve their marketing goals\nand provides a stream of ad revenue to the platform. The latter content\ncontributes to users' engagement with the platform, which is key to its\nlong-term health. A burning issue for e-commerce platform design is how to\nblend advertising with content in a way that respects these interactions and\nbalances these multiple business objectives. This paper describes a system\ndeveloped for this purpose in the context of blending personalized sponsored\ncontent with non-sponsored content on the product detail pages of JD.COM, an\ne-commerce company. This system has three key features: (1) Optimization of\nmultiple competing business objectives through a new virtual bids approach and\nthe expressiveness of the latent, implicit valuation of the platform for the\nmultiple objectives via these virtual bids. (2) Modeling of users' click\nbehavior as a function of their characteristics, the individual characteristics\nof each sponsored content and the influence exerted by other sponsored and\nnon-sponsored content displayed alongside through a deep learning approach; (3)\nConsideration of externalities in the allocation of ads, thereby making it\ndirectly compatible with a Vickrey-Clarke-Groves (VCG) auction scheme for the\ncomputation of payments in the presence of these externalities. The system is\ncurrently deployed and serving all traffic through JD.COM's mobile application.\nExperiments demonstrating the performance and advantages of the system are\npresented.\n", "versions": [{"version": "v1", "created": "Fri, 28 May 2021 02:27:31 GMT"}], "update_date": "2021-05-31", "authors_parsed": [["Carrion", "Carlos", ""], ["Wang", "Zenan", ""], ["Nair", "Harikesh", ""], ["Luo", "Xianghong", ""], ["Lei", "Yulin", ""], ["Lin", "Xiliang", ""], ["Chen", "Wenlong", ""], ["Hu", "Qiyu", ""], ["Peng", "Changping", ""], ["Bao", "Yongjun", ""], ["Yan", "Weipeng", ""]]}, {"id": "2105.13652", "submitter": "Adam Sulich Dr", "authors": "Adam Sulich, Malgorzata Rutkowska, Agnieszka Krawczyk-Jezierska,\n  Jaroslaw Jezierski, Tomasz Zema", "title": "Cybersecurity and Sustainable Development", "comments": null, "journal-ref": null, "doi": "10.13140/RG.2.2.16633.60001", "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Growing interdependencies between organizations lead them towards the\ncreation of inter-organizational networks where cybersecurity and sustainable\ndevelopment have become one of the most important issues. The Environmental\nGoods and Services Sector (EGSS) is one of the fastest developing sectors of\nthe economy fueled by the growing relationships between network entities based\non ICT usage. In this sector, Green Cybersecurity is an emerging issue because\nit secures processes related directly and indirectly to environmental\nmanagement and protection. In the future, the multidimensional development of\nthe EGSS can help European Union to overcome the upcoming crises. At the same\ntime, computer technologies and cybersecurity can contribute to the\nimplementation of the concept of sustainable development. The development of\nenvironmental technologies along with their cybersecurity is one of the aims of\nthe realization of sustainable production and domestic security concepts among\nthe EU countries. Hence, the aim of this article is a theoretical discussion\nand research on the relationships between cybersecurity and sustainable\ndevelopment in inter-organizational networks. Therefore, the article is an\nattempt to give an answer to the question about the current state of the\nimplementation of cybersecurity in relation to the EGSS part of the economy in\ndifferent EU countries.\n", "versions": [{"version": "v1", "created": "Fri, 28 May 2021 07:58:46 GMT"}], "update_date": "2021-05-31", "authors_parsed": [["Sulich", "Adam", ""], ["Rutkowska", "Malgorzata", ""], ["Krawczyk-Jezierska", "Agnieszka", ""], ["Jezierski", "Jaroslaw", ""], ["Zema", "Tomasz", ""]]}, {"id": "2105.13903", "submitter": "Victor Olkhov", "authors": "Victor Olkhov", "title": "Three Remarks On Asset Pricing", "comments": "29 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC q-fin.GN q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We make three remarks to the main CAPM equation presented in the well-known\ntextbook by John Cochrane (2001). First, we believe that any economic averaging\nprocedure implies aggregation of corresponding time series during certain time\ninterval ${\\Delta}$ and explain the necessity to use math expectation for both\nsides of the main CAPM equation. Second, the first-order condition of utility\nmax used to derive main CAPM equation should be complemented by the second one\nthat requires negative utility second derivative. Both define the amount of\nassets ${\\xi}_{max}$ that delivers max to utility. Expansions of the utility in\na Taylor series by price and payoff variations give approximations for\n${\\xi}_{max}$ and uncover equations on price, payoff, volatility, skewness,\ntheir covariance's and etc. We discuss why market price-volume positive\ncorrelations may prohibit existence of ${\\xi}_{max}$ and main CAPM equation.\nThird, we argue that the economic sense of the conventional frequency-based\nprice probability may be poor. To overcome this trouble we propose new price\nprobability measure based on widely used volume weighted average price (VWAP).\nTo forecast price volatility one should predict evolution of squares of the\nvalue and the volume of market trades aggregated during averaging interval\n${\\Delta}$. The forecast of the new price probability measure may be the main\ntough puzzle for CAPM and finance. However investors are free to chose any\nprobability measure they prefer as ground for their investment strategies but\nshould be ready for unexpected losses due to possible distinctions with real\nmarket trade price dynamics.\n", "versions": [{"version": "v1", "created": "Mon, 24 May 2021 17:22:24 GMT"}], "update_date": "2021-05-31", "authors_parsed": [["Olkhov", "Victor", ""]]}, {"id": "2105.14198", "submitter": "Faruque Ahamed", "authors": "Md Saimum Hossain, Faruque Ahamed", "title": "Comprehensive Analysis On Determinants Of Bank Profitability In\n  Bangladesh", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The study investigates the relationship between bank profitability and a\ncomprehensive list of bank specific, industry specific and macroeconomic\nvariables using unique panel data from 23 Bangladeshi banks with large market\nshares from 2005 to 2019 employing the Pooled Ordinary Least Square (POLS)\nMethod for regression estimation. The random Effect model has been used to\ncheck for robustness. Three variables, namely, Return on Asset (ROA), Return on\nEquity (ROE), and Net Interest Margin (NIM), have been used as profitability\nproxies. Non-interest income, capital ratio, and GDP growth have been found to\nhave a significant relationship with ROA. In addition to non-interest income,\nmarket share, bank size, and real exchange rates are significant explaining\nvariables if profitability is measured as NIM. The only significant determinant\nof profitability measured by ROE is market share. The primary contribution of\nthis study to the existing knowledge base is an extensive empirical analysis by\ncovering the entire gamut of independent variables (bank specific, industry\nrelated, and macroeconomic) to explain the profitability of the banks in\nBangladesh. It also covers an extensive and recent data set. Banking sector\nstakeholders may find great value from the outputs of this paper. Regulators\nand policymakers may find this useful in undertaking analyses in setting policy\nrates, banking industry stability, and impact assessment of critical policy\nmeasures before and after the enactment, etc. Investors and the bank management\nare to use the findings of this paper in analyzing the real drivers of\nprofitability of the banks they are contemplating to invest and managing on a\ndaily basis.\n", "versions": [{"version": "v1", "created": "Sat, 29 May 2021 03:35:42 GMT"}, {"version": "v2", "created": "Thu, 10 Jun 2021 18:12:38 GMT"}], "update_date": "2021-06-14", "authors_parsed": [["Hossain", "Md Saimum", ""], ["Ahamed", "Faruque", ""]]}, {"id": "2105.14199", "submitter": "Faruque Ahamed", "authors": "Faruque Ahamed", "title": "Impact of Public and Private Investments on Economic Growth of\n  Developing Countries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  This paper aims to study the impact of public and private investments on the\neconomic growth of developing countries. The study uses the panel data of 39\ndeveloping countries covering the periods 1990-2019. The study was based on the\nneoclassical growth models or exogenous growth models state in which land,\nlabor, capital accumulation, etc., and technology proved substantial for\neconomic growth. The paper finds that public investment has a strong positive\nimpact on economic growth than private investment. Gross capital formation,\nlabor growth, and government final consumption expenditure were found\nsignificant in explaining the economic growth. Overall, both public and private\ninvestments are substantial for the economic growth and development of\ndeveloping countries.\n", "versions": [{"version": "v1", "created": "Sat, 29 May 2021 03:40:26 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Ahamed", "Faruque", ""]]}, {"id": "2105.14318", "submitter": "Shenhao Wang", "authors": "Da Zhang, Qingyi Wang, Shaojie Song, Simiao Chen, Mingwei Li, Lu Shen,\n  Siqi Zheng, Bofeng Cai, Shenhao Wang", "title": "Estimating air quality co-benefits of energy transition using machine\n  learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN cs.LG q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Estimating health benefits of reducing fossil fuel use from improved air\nquality provides important rationales for carbon emissions abatement.\nSimulating pollution concentration is a crucial step of the estimation, but\ntraditional approaches often rely on complicated chemical transport models that\nrequire extensive expertise and computational resources. In this study, we\ndevelop a novel and succinct machine learning framework that is able to provide\nprecise and robust annual average fine particle (PM2.5) concentration\nestimations directly from a high-resolution fossil energy use data set. The\naccessibility and applicability of this framework show great potentials of\nmachine learning approaches for integrated assessment studies. Applications of\nthe framework with Chinese data reveal highly heterogeneous health benefits of\nreducing fossil fuel use in different sectors and regions in China with a mean\nof \\$34/tCO2 and a standard deviation of \\$84/tCO2. Reducing rural and\nresidential coal use offers the highest co-benefits with a mean of \\$360/tCO2.\nOur findings prompt careful policy designs to maximize cost-effectiveness in\nthe transition towards a carbon-neutral energy system.\n", "versions": [{"version": "v1", "created": "Sat, 29 May 2021 14:52:57 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Zhang", "Da", ""], ["Wang", "Qingyi", ""], ["Song", "Shaojie", ""], ["Chen", "Simiao", ""], ["Li", "Mingwei", ""], ["Shen", "Lu", ""], ["Zheng", "Siqi", ""], ["Cai", "Bofeng", ""], ["Wang", "Shenhao", ""]]}, {"id": "2105.14587", "submitter": "Tatiana Kozitsina", "authors": "Mikhail Kunavin, Tatiana Kozitsina (Babkina), Mikhail Myagkov, Irina\n  Kozhevnikova, Mikhail Pankov, Ludmila Sokolova", "title": "Bioelectrical brain activity can predict prosocial behavior", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-bio.NC q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Generally, people behave in social dilemmas such as proself and prosocial.\nHowever, inside social groups, people have a tendency to choose prosocial\nalternatives due to in-group favoritism. The bioelectrical activity of the\nhuman brain shows the differences between proself and prosocial exist even out\nof a socialized group. Moreover, a group socialization strengthens these\ndifferences. We used EEG System, \"Neuron-Spectrum-4/EPM\" (16 channels), to\ntrack the brain bioelectrical activity during decision making in laboratory\nexperiments with the Prisoner's dilemma game and the short-term socialization\nstage. We compared the spatial distribution of the spectral density during the\ndifferent experimental parts. The noncooperative decision was characterized by\nthe increased values of spectral the beta rhythm in the orbital regions of\nprefrontal cortex. The cooperative choice, on the contrary, was accompanied by\nthe theta-rhythm activation in the central cortex regions in both hemispheres\nand the high-frequency alpha rhythm in the medial regions of the prefrontal\ncortex. People who increased the cooperation level after the socialization\nstage was initially different from the ones who decreased the cooperation in\nterms of the bioelectrical activity. Well-socialized participants differed by\nincreased values of spectral density of theta-diapason and decreased values of\nspectral density of beta-diapason in the middle part of frontal lobe. People\nwho decreased the cooperation level after the socialization stage was\ncharacterized by decreased values of spectral density of alpha rhythm in the\nmiddle and posterior convex regions of both hemispheres.\n", "versions": [{"version": "v1", "created": "Sun, 30 May 2021 17:35:12 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Kunavin", "Mikhail", "", "Babkina"], ["Kozitsina", "Tatiana", "", "Babkina"], ["Myagkov", "Mikhail", ""], ["Kozhevnikova", "Irina", ""], ["Pankov", "Mikhail", ""], ["Sokolova", "Ludmila", ""]]}, {"id": "2105.14959", "submitter": "Viktor Stojkoski PhD", "authors": "Dragan Tevdovski, Petar Jolakoski and Viktor Stojkoski", "title": "Determinants of budget deficits: Focus on the effects from the COVID-19\n  crisis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper revisits the discussion on determinants of budget balances and\ninvestigates the change in their effect in light of the COVID-19 crisis by\nutilizing data on 43 countries and a system generalized method of moments\napproach. The results show that the overall impact of the global pandemic led\nto a disproportionate increase in the magnitude of the estimated effects of the\nmacroeconomic determinants on the budget balance. However, we also find that\nmore developed economies were able to undertake higher stimulus packages for\nthe relatively same level of primary balance. We believe that one of the\nfactors affecting this outcome is that that they exhibit a higher government\ndebt position in domestic currency denomination.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 13:45:04 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Tevdovski", "Dragan", ""], ["Jolakoski", "Petar", ""], ["Stojkoski", "Viktor", ""]]}, {"id": "2105.14996", "submitter": "Stefano Ghinoi", "authors": "Valdemar J. Wesz Junior, Simone Piras, Catia Grisa, Stefano Ghinoi", "title": "Assessing Brazilian agri-food policies: what impact on family farms?", "comments": "1 figure, 5 tables, supplementary material available", "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.GN q-fin.EC", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Since the beginning of the 1990s, Brazil has introduced different policies\nfor increasing agricultural production among family farms, such as the National\nProgram for Strengthening Family Farming (Pronaf), the technical assistance and\nrural extension programmes (ATER), and seeds distribution. Despite the\nimportance of these policies for the development of family farming, there is a\nlack of empirical studies investigating their impact on commercialization of\nfood products. By considering household-level data from the 2014 Brazilian\nNational Household Sample Survey, we use propensity score matching techniques\naccounting for the interaction effects between policies to compare the\ncommercialisation behaviour of recipients with non recipients. We find that\nPronaf has a significant positive impact on family farmers propensity to engage\nin commercialisation, and this effect increases if farmers have also access to\nATER. Receiving technical assistance alone has a positive effect, but this is\nmostly limited to smaller farms. In turn, seed distribution appears not to\nincrease commercialization significantly. A well balanced policy mix could\nensure that, in a country subject to the pressure of international food\nmarkets, increased commercialisation does not result in reduced food security\nfor rural dwellers.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 14:30:58 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Junior", "Valdemar J. Wesz", ""], ["Piras", "Simone", ""], ["Grisa", "Catia", ""], ["Ghinoi", "Stefano", ""]]}, {"id": "2105.15175", "submitter": "Mikhail Freer", "authors": "Mikhail Freer and Cesar Martinelli", "title": "An algebraic approach to revealed preferences", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "econ.TH econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose and develop an algebraic approach to revealed preference. Our\napproach dispenses with non algebraic structure, such as topological\nassumptions. We provide algebraic axioms of revealed preference that subsume\nprevious, classical revealed preference axioms, as well as generate new axioms\nfor behavioral theories, and show that a data set is rationalizable if and only\nif it is consistent with an algebraic axiom.\n", "versions": [{"version": "v1", "created": "Mon, 31 May 2021 17:34:06 GMT"}], "update_date": "2021-06-01", "authors_parsed": [["Freer", "Mikhail", ""], ["Martinelli", "Cesar", ""]]}]