[{"id": "0708.0603", "submitter": "L.T. Handoko", "authors": "Z. Akbar, Slamet, B. I. Ajinagoro, G.I. Ohara, I. Firmansyah, B.\n  Hermanto and L.T. Handoko", "title": "Public Cluster : parallel machine with multi-block approach", "comments": "4 pages, Proceeding of the International Conference on Electrical\n  Engineering and Informatics 2007", "journal-ref": null, "doi": null, "report-no": "FISIKALIPI-07002", "categories": "cs.DC cs.CY", "license": null, "abstract": "  We introduce a new approach to enable an open and public parallel machine\nwhich is accessible for multi users with multi jobs belong to different blocks\nrunning at the same time. The concept is required especially for parallel\nmachines which are dedicated for public use as implemented at the LIPI Public\nCluster. We have deployed the simplest technique by running multi daemons of\nparallel processing engine with different configuration files specified for\neach user assigned to access the system, and also developed an integrated\nsystem to fully control and monitor the whole system over web. A brief\nperformance analysis is also given for Message Parsing Interface (MPI) engine.\nIt is shown that the proposed approach is quite reliable and affect the whole\nperformances only slightly.\n", "versions": [{"version": "v1", "created": "Sat, 4 Aug 2007 05:18:21 GMT"}], "update_date": "2007-08-07", "authors_parsed": [["Akbar", "Z.", ""], ["Slamet", "", ""], ["Ajinagoro", "B. I.", ""], ["Ohara", "G. I.", ""], ["Firmansyah", "I.", ""], ["Hermanto", "B.", ""], ["Handoko", "L. T.", ""]]}, {"id": "0708.0604", "submitter": "L.T. Handoko", "authors": "T.B. Waluyo and L.T. Handoko", "title": "Introducing OPTO : Portal for Optical Communities in Indonesia", "comments": "3 pages, Proceeding of the 2nd International Conf. on Optics and\n  Laser Applications 2007", "journal-ref": null, "doi": null, "report-no": "FISIKALIPI-07006", "categories": "cs.CY", "license": null, "abstract": "  Since January 1, 2005 we have launched \"OPTO\" Portal, a website dedicated to\noptical communities in Indonesia. The address of this portal is\nhttp://www.opto.lipi.go.id and is self-supporting managed and not for\ncommercial purposes. Our aims in launching this portal are to benefit Internet\nfacility in increasing the communities' scientific activity; to provide an\nonline reference in Indonesian language for optics-based science and technology\nsubjects; as well as to pioneer the communities' online activities with real\nimpacts and benefits for our society. We will describe in the paper the\nfeatures of this portal that can be utilized by all individuals or members of\noptical communities to store and share information and to build networks or\npartnership as well. We realized that this portal is still not popular and most\nof our aims are still not reached. This conference should be a good place for\nall of us to collaborate to properly utilize this portal for the advantages to\nthe optical communities in Indonesia and our society at large.\n", "versions": [{"version": "v1", "created": "Sat, 4 Aug 2007 05:16:10 GMT"}], "update_date": "2007-08-07", "authors_parsed": [["Waluyo", "T. B.", ""], ["Handoko", "L. T.", ""]]}, {"id": "0708.0605", "submitter": "L.T. Handoko", "authors": "Z. Akbar, Slamet, B. I. Ajinagoro, G.I. Ohara, I. Firmansyah, B.\n  Hermanto and L.T. Handoko", "title": "Open and Free Cluster for Public", "comments": "4 pages, Proceeding of the International Conference on Rural\n  Information and Communication Technology 2007", "journal-ref": null, "doi": null, "report-no": "FISIKALIPI-07003", "categories": "cs.DC cs.CY", "license": null, "abstract": "  We introduce the LIPI Public Cluster, the first parallel machine facility\nfully open for public and for free in Indonesia and surrounding countries. In\nthis paper, we focus on explaining our globally new concept on open cluster,\nand how to realize and manage it to meet the users needs. We show that after 2\nyears trial running and several upgradings, the Public Cluster performs well\nand is able to fulfil all requirements as expected.\n", "versions": [{"version": "v1", "created": "Sat, 4 Aug 2007 05:17:34 GMT"}], "update_date": "2007-08-07", "authors_parsed": [["Akbar", "Z.", ""], ["Slamet", "", ""], ["Ajinagoro", "B. I.", ""], ["Ohara", "G. I.", ""], ["Firmansyah", "I.", ""], ["Hermanto", "B.", ""], ["Handoko", "L. T.", ""]]}, {"id": "0708.2021", "submitter": "Juan J. Merelo Pr.", "authors": "Juan J. Merelo and Carlos Cotta", "title": "Who is the best connected EC researcher? Centrality analysis of the\n  complex network of authors in evolutionary computation", "comments": "Abstract accepted as poster to the GECCO 2007 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.NE", "license": null, "abstract": "  Co-authorship graphs (that is, the graph of authors linked by co-authorship\nof papers) are complex networks, which expresses the dynamics of a complex\nsystem. Only recently its study has started to draw interest from the EC\ncommunity, the first paper dealing with it having been published two years ago.\nIn this paper we will study the co-authorship network of EC at a microscopic\nlevel. Our objective is ascertaining which are the most relevant nodes (i.e.\nauthors) in it. For this purpose, we examine several metrics defined in the\ncomplex-network literature, and analyze them both in isolation and combined\nwithin a Pareto-dominance approach. The result of our analysis indicates that\nthere are some well-known researchers that appear systematically in top\nrankings. This also provides some hints on the social behavior of our\ncommunity.\n", "versions": [{"version": "v1", "created": "Wed, 15 Aug 2007 10:13:03 GMT"}], "update_date": "2007-08-16", "authors_parsed": [["Merelo", "Juan J.", ""], ["Cotta", "Carlos", ""]]}, {"id": "0708.2266", "submitter": "Kai Pan", "authors": "Pan Kai, Tan Yue and Jiang Sheng", "title": "The study of a new gerrymandering methodology", "comments": "23 pages,15 figures, 2007 American mathematical modeling contest\n  \"Meritorious Winner\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": null, "abstract": "  This paper is to obtain a simple dividing-diagram of the congressional\ndistricts, where the only limit is that each district should contain the same\npopulation if possibly. In order to solve this problem, we introduce three\ndifferent standards of the \"simple\" shape. The first standard is that the final\nshape of the congressional districts should be of a simplest figure and we\napply a modified \"shortest split line algorithm\" where the factor of the same\npopulation is considered only. The second standard is that the gerrymandering\nshould ensure the integrity of the current administrative area as the\nconvenience for management. Thus we combine the factor of the administrative\narea with the first standard, and generate an improved model resulting in the\nnew diagram in which the perimeters of the districts are along the boundaries\nof some current counties. Moreover, the gerrymandering should consider the\ngeographic features.The third standard is introduced to describe this\nsituation. Finally, it can be proved that the difference between the supporting\nratio of a certain party in each district and the average supporting ratio of\nthat particular party in the whole state obeys the Chi-square distribution\napproximately. Consequently, we can obtain an archetypal formula to check\nwhether the gerrymandering we propose is fair.\n", "versions": [{"version": "v1", "created": "Thu, 16 Aug 2007 18:44:53 GMT"}], "update_date": "2007-08-17", "authors_parsed": [["Kai", "Pan", ""], ["Yue", "Tan", ""], ["Sheng", "Jiang", ""]]}, {"id": "0708.2414", "submitter": "Kristina Lerman", "authors": "Kristina Lerman", "title": "User Participation in Social Media: Digg Study", "comments": "Workshops of 2007 IEEE/WIC/ACM International Conference on Web\n  Intelligence and Intelligent Agent Technology (WI-IAT 07)", "journal-ref": null, "doi": "10.1109/WI-IATW.2007.68", "report-no": null, "categories": "cs.CY", "license": null, "abstract": "  The social news aggregator Digg allows users to submit and moderate stories\nby voting on (digging) them. As is true of most social sites, user\nparticipation on Digg is non-uniformly distributed, with few users contributing\na disproportionate fraction of content. We studied user participation on Digg,\nto see whether it is motivated by competition, fueled by user ranking, or\nsocial factors, such as community acceptance.\n  For our study we collected activity data of the top users weekly over the\ncourse of a year. We computed the number of stories users submitted, dugg or\ncommented on weekly. We report a spike in user activity in September 2006,\nfollowed by a gradual decline, which seems unaffected by the elimination of\nuser ranking. The spike can be explained by a controversy that broke out at the\nbeginning of September 2006. We believe that the lasting acrimony that this\nincident has created led to a decline of top user participation on Digg.\n", "versions": [{"version": "v1", "created": "Fri, 17 Aug 2007 18:46:55 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Lerman", "Kristina", ""]]}, {"id": "0708.3230", "submitter": "Kamil Kulesza", "authors": "Kamil Kulesza", "title": "Can Alice and Bob be random: a study on human playing zero knowledge\n  protocols", "comments": "An extended abstract of the paper submitted for publication, 3 pages\n  total", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": null, "abstract": "  The research described in this abstract was initiated by discussions between\nthe author and Giovanni Di Crescenzo in Barcelona in early 2004. It was during\nAdvanced Course on Contemporary Cryptology that Di Crescenzo gave a course on\nzero knowledge protocols (ZKP), see [1]. After that course we started to play\nwith unorthodox ideas for breaking ZKP, especially one based on graph\n3-coloring. It was chosen for investigation because it is being considered as a\n\"benchmark\" ZKP, see [2], [3]. At this point we briefly recall such a\nprotocol's description.\n", "versions": [{"version": "v1", "created": "Thu, 23 Aug 2007 18:39:56 GMT"}], "update_date": "2007-08-24", "authors_parsed": [["Kulesza", "Kamil", ""]]}]