[{"id": "1806.00388", "submitter": "Tristan Naumann", "authors": "Marzyeh Ghassemi, Tristan Naumann, Peter Schulam, Andrew L. Beam,\n  Irene Y. Chen, Rajesh Ranganath", "title": "A Review of Challenges and Opportunities in Machine Learning for Health", "comments": "Updated version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CY stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern electronic health records (EHRs) provide data to answer clinically\nmeaningful questions. The growing data in EHRs makes healthcare ripe for the\nuse of machine learning. However, learning in a clinical setting presents\nunique challenges that complicate the use of common machine learning\nmethodologies. For example, diseases in EHRs are poorly labeled, conditions can\nencompass multiple underlying endotypes, and healthy individuals are\nunderrepresented. This article serves as a primer to illuminate these\nchallenges and highlights opportunities for members of the machine learning\ncommunity to contribute to healthcare.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 15:12:20 GMT"}, {"version": "v2", "created": "Tue, 5 Jun 2018 17:11:13 GMT"}, {"version": "v3", "created": "Fri, 19 Jul 2019 03:49:08 GMT"}, {"version": "v4", "created": "Thu, 5 Dec 2019 19:18:59 GMT"}], "update_date": "2019-12-09", "authors_parsed": [["Ghassemi", "Marzyeh", ""], ["Naumann", "Tristan", ""], ["Schulam", "Peter", ""], ["Beam", "Andrew L.", ""], ["Chen", "Irene Y.", ""], ["Ranganath", "Rajesh", ""]]}, {"id": "1806.00397", "submitter": "Tristan Naumann", "authors": "Dina Levy-Lambert, Jen J. Gong, Tristan Naumann, Tom J. Pollard, John\n  V. Guttag", "title": "Visualizing Patient Timelines in the Intensive Care Unit", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electronic Health Records (EHRs) contain a large volume of heterogeneous\npatient data, which are useful at the point of care and for retrospective\nresearch. These data are typically stored in relational databases. Gaining an\nintegrated view of these data for a single patient typically requires complex\nSQL queries joining multiple tables. In this work, we present a visualization\ntool that integrates heterogeneous health care data (e.g., clinical notes,\nlaboratory test values, vital signs) into a single timeline. We train risk\nmodels offline and dynamically generate and present their predictions alongside\npatient data. Our visualization is designed to enable users to understand the\nheterogeneous temporal data quickly and comprehensively, and to place the\noutput of analytic models in the context of the underlying data.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 15:33:12 GMT"}], "update_date": "2018-06-04", "authors_parsed": [["Levy-Lambert", "Dina", ""], ["Gong", "Jen J.", ""], ["Naumann", "Tristan", ""], ["Pollard", "Tom J.", ""], ["Guttag", "John V.", ""]]}, {"id": "1806.00543", "submitter": "Manish Raghavan", "authors": "Manish Raghavan, Aleksandrs Slivkins, Jennifer Wortman Vaughan, Zhiwei\n  Steven Wu", "title": "The Externalities of Exploration and How Data Diversity Helps\n  Exploitation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CY stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online learning algorithms, widely used to power search and content\noptimization on the web, must balance exploration and exploitation, potentially\nsacrificing the experience of current users for information that will lead to\nbetter decisions in the future. Recently, concerns have been raised about\nwhether the process of exploration could be viewed as unfair, placing too much\nburden on certain individuals or groups. Motivated by these concerns, we\ninitiate the study of the externalities of exploration - the undesirable side\neffects that the presence of one party may impose on another - under the linear\ncontextual bandits model. We introduce the notion of a group externality,\nmeasuring the extent to which the presence of one population of users impacts\nthe rewards of another. We show that this impact can in some cases be negative,\nand that, in a certain sense, no algorithm can avoid it. We then study\nexternalities at the individual level, interpreting the act of exploration as\nan externality imposed on the current user of a system by future users. This\ndrives us to ask under what conditions inherent diversity in the data makes\nexplicit exploration unnecessary. We build on a recent line of work on the\nsmoothed analysis of the greedy algorithm that always chooses the action that\ncurrently looks optimal, improving on prior results to show that a greedy\napproach almost matches the best possible Bayesian regret rate of any other\nalgorithm on the same problem instance whenever the diversity conditions hold,\nand that this regret is at most $\\tilde{O}(T^{1/3})$. Returning to group-level\neffects, we show that under the same conditions, negative group externalities\nessentially vanish under the greedy algorithm. Together, our results uncover a\nsharp contrast between the high externalities that exist in the worst case, and\nthe ability to remove all externalities if the data is sufficiently diverse.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 21:22:12 GMT"}, {"version": "v2", "created": "Mon, 2 Jul 2018 21:23:13 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Raghavan", "Manish", ""], ["Slivkins", "Aleksandrs", ""], ["Vaughan", "Jennifer Wortman", ""], ["Wu", "Zhiwei Steven", ""]]}, {"id": "1806.00555", "submitter": "Luke Hsiao", "authors": "Yuichi Hanada, Luke Hsiao, Philip Levis", "title": "Smart Contracts for Machine-to-Machine Communication: Possibilities and\n  Limitations", "comments": null, "journal-ref": null, "doi": "10.1109/IOTAIS.2018.8600854", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blockchain technologies, such as smart contracts, present a unique interface\nfor machine-to-machine communication that provides a secure, append-only record\nthat can be shared without trust and without a central administrator. We study\nthe possibilities and limitations of using smart contracts for\nmachine-to-machine communication by designing, implementing, and evaluating\nAGasP, an application for automated gasoline purchases. We find that using\nsmart contracts allows us to directly address the challenges of transparency,\nlongevity, and trust in IoT applications. However, real-world applications\nusing smart contracts must address their important trade-offs, such as\nperformance, privacy, and the challenge of ensuring they are written correctly.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 22:24:36 GMT"}, {"version": "v2", "created": "Tue, 8 Jan 2019 02:59:04 GMT"}], "update_date": "2019-01-09", "authors_parsed": [["Hanada", "Yuichi", ""], ["Hsiao", "Luke", ""], ["Levis", "Philip", ""]]}, {"id": "1806.00615", "submitter": "Slava Jankin Mikhaylov", "authors": "Caleb Pomeroy and Niheer Dasandi and Slava Jankin Mikhaylov", "title": "Multiplex Communities and the Emergence of International Conflict", "comments": "arXiv admin note: text overlap with arXiv:1802.00396", "journal-ref": "PLoS ONE 14(10): e0223040 (2019)", "doi": "10.1371/journal.pone.0223040", "report-no": null, "categories": "cs.CL cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in community detection reveal new insights into multiplex and\nmultilayer networks. Less work, however, investigates the relationship between\nthese communities and outcomes in social systems. We leverage these advances to\nshed light on the relationship between the cooperative mesostructure of the\ninternational system and the onset of interstate conflict. We detect\ncommunities based upon weaker signals of affinity expressed in United Nations\nvotes and speeches, as well as stronger signals observed across multiple layers\nof bilateral cooperation. Communities of diplomatic affinity display an\nexpected negative relationship with conflict onset. Ties in communities based\nupon observed cooperation, however, display no effect under a standard model\nspecification and a positive relationship with conflict under an alternative\nspecification. These results align with some extant hypotheses but also point\nto a paucity in our understanding of the relationship between community\nstructure and behavioral outcomes in networks.\n", "versions": [{"version": "v1", "created": "Sat, 2 Jun 2018 09:58:50 GMT"}, {"version": "v2", "created": "Tue, 17 Dec 2019 08:41:22 GMT"}], "update_date": "2019-12-19", "authors_parsed": [["Pomeroy", "Caleb", ""], ["Dasandi", "Niheer", ""], ["Mikhaylov", "Slava Jankin", ""]]}, {"id": "1806.00793", "submitter": "Slava Jankin Mikhaylov", "authors": "Alexander Herzog and Peter John and Slava Jankin Mikhaylov", "title": "Transfer Topic Labeling with Domain-Specific Knowledge Base: An Analysis\n  of UK House of Commons Speeches 1935-2014", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Topic models are widely used in natural language processing, allowing\nresearchers to estimate the underlying themes in a collection of documents.\nMost topic models use unsupervised methods and hence require the additional\nstep of attaching meaningful labels to estimated topics. This process of manual\nlabeling is not scalable and suffers from human bias. We present a\nsemi-automatic transfer topic labeling method that seeks to remedy these\nproblems. Domain-specific codebooks form the knowledge-base for automated topic\nlabeling. We demonstrate our approach with a dynamic topic model analysis of\nthe complete corpus of UK House of Commons speeches 1935-2014, using the coding\ninstructions of the Comparative Agendas Project to label topics. We show that\nour method works well for a majority of the topics we estimate; but we also\nfind that institution-specific topics, in particular on subnational governance,\nrequire manual input. We validate our results using human expert coding.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jun 2018 13:22:10 GMT"}, {"version": "v2", "created": "Mon, 27 Aug 2018 16:56:27 GMT"}], "update_date": "2018-08-28", "authors_parsed": [["Herzog", "Alexander", ""], ["John", "Peter", ""], ["Mikhaylov", "Slava Jankin", ""]]}, {"id": "1806.00830", "submitter": "Robert Gorwa", "authors": "Robert Gorwa, Philip N. Howard", "title": "Studying Politically Vulnerable Communities Online: Ethical Dilemmas,\n  Questions, and Solutions", "comments": "2018 ICWSM Workshop on Exploring Ethical Trade-offs in Social Media\n  Research, June 25, Stanford, CA, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This short article introduces the concept of political vulnerability for\nsocial media researchers. How are traditional notions of harm challenged by\nresearch subjects in politically vulnerable communities? Through a selection of\ncase studies, we explore some of the trade-offs, challenges, and questions\nraised by research that seeks be robust and transparent while also preserving\nanonymity and privacy, especially in high-stakes, politically fraught contexts.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jun 2018 16:46:39 GMT"}], "update_date": "2018-06-05", "authors_parsed": [["Gorwa", "Robert", ""], ["Howard", "Philip N.", ""]]}, {"id": "1806.00894", "submitter": "Xiao Chen", "authors": "Barak Oshri, Annie Hu, Peter Adelson, Xiao Chen, Pascaline Dupas,\n  Jeremy Weinstein, Marshall Burke, David Lobell and Stefano Ermon", "title": "Infrastructure Quality Assessment in Africa using Satellite Imagery and\n  Deep Learning", "comments": null, "journal-ref": "KDD 2018 Proceedings of the 24th ACM SIGKDD International\n  Conference on Knowledge Discovery & Data Mining", "doi": "10.1145/3219819.3219924", "report-no": null, "categories": "cs.CY cs.CV stat.ML", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The UN Sustainable Development Goals allude to the importance of\ninfrastructure quality in three of its seventeen goals. However, monitoring\ninfrastructure quality in developing regions remains prohibitively expensive\nand impedes efforts to measure progress toward these goals. To this end, we\ninvestigate the use of widely available remote sensing data for the prediction\nof infrastructure quality in Africa. We train a convolutional neural network to\npredict ground truth labels from the Afrobarometer Round 6 survey using Landsat\n8 and Sentinel 1 satellite imagery.\n  Our best models predict infrastructure quality with AUROC scores of 0.881 on\nElectricity, 0.862 on Sewerage, 0.739 on Piped Water, and 0.786 on Roads using\nLandsat 8. These performances are significantly better than models that\nleverage OpenStreetMap or nighttime light intensity on the same tasks. We also\ndemonstrate that our trained model can accurately make predictions in an unseen\ncountry after fine-tuning on a small sample of images. Furthermore, the model\ncan be deployed in regions with limited samples to predict infrastructure\noutcomes with higher performance than nearest neighbor spatial interpolation.\n", "versions": [{"version": "v1", "created": "Sun, 3 Jun 2018 23:30:01 GMT"}], "update_date": "2018-11-02", "authors_parsed": [["Oshri", "Barak", ""], ["Hu", "Annie", ""], ["Adelson", "Peter", ""], ["Chen", "Xiao", ""], ["Dupas", "Pascaline", ""], ["Weinstein", "Jeremy", ""], ["Burke", "Marshall", ""], ["Lobell", "David", ""], ["Ermon", "Stefano", ""]]}, {"id": "1806.01198", "submitter": "Filipo Sharevski", "authors": "Filipo Sharevski, Adam Trowbridge, Jessica Westbrook", "title": "Novel Approach for Cybersecurity Workforce Development: A Course in\n  Secure Design", "comments": "The 8th IEEE Integrated STEM Education Conference (ISEC) 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Training the future cybersecurity workforce to respond to emerging threats\nrequires introduction of novel educational interventions into the cybersecurity\ncurriculum. To be effective, these interventions have to incorporate trending\nknowledge from cybersecurity and other related domains while allowing for\nexperiential learning through hands-on experimentation. To date, the\ntraditional interdisciplinary approach for cybersecurity training has infused\npolitical science, law, economics or linguistics knowledge into the\ncybersecurity curriculum, allowing for limited experimentation. Cybersecurity\nstudents were left with little opportunity to acquire knowledge, skills, and\nabilities in domains outside of these. Also, students in outside majors had no\noptions to get into cybersecurity. With this in mind, we developed an\ninterdisciplinary course for experiential learning in the fields of\ncybersecurity and interaction design. The inaugural course teaches students\nfrom cybersecurity, user interaction design, and visual design the principles\nof designing for secure use - or secure design - and allows them to apply them\nfor prototyping of Internet-of-Things (IoT) products for smart homes. This\npaper elaborates on the concepts of secure design and how our approach enhances\nthe training of the future cybersecurity workforce.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 16:39:46 GMT"}], "update_date": "2018-06-05", "authors_parsed": [["Sharevski", "Filipo", ""], ["Trowbridge", "Adam", ""], ["Westbrook", "Jessica", ""]]}, {"id": "1806.01322", "submitter": "Tim Taylor", "authors": "Tim Taylor and Alan Dorin", "title": "Past Visions of Artificial Futures: One Hundred and Fifty Years under\n  the Spectre of Evolving Machines", "comments": "To appear in Proceedings of the Artificial Life Conference 2018\n  (ALIFE 2018), MIT Press", "journal-ref": "Proceedings of the Artificial Life Conference 2018, T. Ikegami et\n  al. (eds.), MIT Press (pp.91-98)", "doi": "10.1162/isal_a_00022", "report-no": null, "categories": "cs.AI cs.CY cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The influence of Artificial Intelligence (AI) and Artificial Life (ALife)\ntechnologies upon society, and their potential to fundamentally shape the\nfuture evolution of humankind, are topics very much at the forefront of current\nscientific, governmental and public debate. While these might seem like very\nmodern concerns, they have a long history that is often disregarded in\ncontemporary discourse. Insofar as current debates do acknowledge the history\nof these ideas, they rarely look back further than the origin of the modern\ndigital computer age in the 1940s-50s. In this paper we explore the earlier\nhistory of these concepts. We focus in particular on the idea of\nself-reproducing and evolving machines, and potential implications for our own\nspecies. We show that discussion of these topics arose in the 1860s, within a\ndecade of the publication of Darwin's The Origin of Species, and attracted\nincreasing interest from scientists, novelists and the general public in the\nearly 1900s. After introducing the relevant work from this period, we\ncategorise the various visions presented by these authors of the future\nimplications of evolving machines for humanity. We suggest that current debates\non the co-evolution of society and technology can be enriched by a proper\nappreciation of the long history of the ideas involved.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 18:52:40 GMT"}], "update_date": "2018-08-10", "authors_parsed": [["Taylor", "Tim", ""], ["Dorin", "Alan", ""]]}, {"id": "1806.01351", "submitter": "Khoi-Nguyen Tran", "authors": "Khoi-Nguyen Tran and Jey Han Lau and Danish Contractor and Utkarsh\n  Gupta and Bikram Sengupta and Christopher J. Butler and Mukesh Mohania", "title": "Document Chunking and Learning Objective Generation for Instruction\n  Design", "comments": "Proceedings of the 11th International Conference on Education Data\n  Mining (EDM 2018)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Instructional Systems Design is the practice of creating of instructional\nexperiences that make the acquisition of knowledge and skill more efficient,\neffective, and appealing. Specifically in designing courses, an hour of\ntraining material can require between 30 to 500 hours of effort in sourcing and\norganizing reference data for use in just the preparation of course material.\nIn this paper, we present the first system of its kind that helps reduce the\neffort associated with sourcing reference material and course creation. We\npresent algorithms for document chunking and automatic generation of learning\nobjectives from content, creating descriptive content metadata to improve\ncontent-discoverability. Unlike existing methods, the learning objectives\ngenerated by our system incorporate pedagogically motivated Bloom's verbs. We\ndemonstrate the usefulness of our methods using real world data from the\nbanking industry and through a live deployment at a large pharmaceutical\ncompany.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 06:47:28 GMT"}, {"version": "v2", "created": "Mon, 6 Aug 2018 02:18:26 GMT"}], "update_date": "2018-08-07", "authors_parsed": [["Tran", "Khoi-Nguyen", ""], ["Lau", "Jey Han", ""], ["Contractor", "Danish", ""], ["Gupta", "Utkarsh", ""], ["Sengupta", "Bikram", ""], ["Butler", "Christopher J.", ""], ["Mohania", "Mukesh", ""]]}, {"id": "1806.01400", "submitter": "Cristina Kadar", "authors": "Cristina Kadar, Irena Pletikosa", "title": "Mining large-scale human mobility data for long-term crime prediction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Traditional crime prediction models based on census data are limited, as they\nfail to capture the complexity and dynamics of human activity. With the rise of\nubiquitous computing, there is the opportunity to improve such models with data\nthat make for better proxies of human presence in cities. In this paper, we\nleverage large human mobility data to craft an extensive set of features for\ncrime prediction, as informed by theories in criminology and urban studies. We\nemploy averaging and boosting ensemble techniques from machine learning, to\ninvestigate their power in predicting yearly counts for different types of\ncrimes occurring in New York City at census tract level. Our study shows that\nspatial and spatio-temporal features derived from Foursquare venues and\ncheckins, subway rides, and taxi rides, improve the baseline models relying on\ncensus and POI data. The proposed models achieve absolute R^2 metrics of up to\n65% (on a geographical out-of-sample test set) and up to 89% (on a temporal\nout-of-sample test set). This proves that, next to the residential population\nof an area, the ambient population there is strongly predictive of the area's\ncrime levels. We deep-dive into the main crime categories, and find that the\npredictive gain of the human dynamics features varies across crime types: such\nfeatures bring the biggest boost in case of grand larcenies, whereas assaults\nare already well predicted by the census features. Furthermore, we identify and\ndiscuss top predictive features for the main crime categories. These results\noffer valuable insights for those responsible for urban policy or law\nenforcement.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 21:30:05 GMT"}], "update_date": "2018-06-06", "authors_parsed": [["Kadar", "Cristina", ""], ["Pletikosa", "Irena", ""]]}, {"id": "1806.01539", "submitter": "Christine Michel", "authors": "Elena Codreanu (GRePS, SICAL, WSE), Christine Michel (SICAL),\n  Marc-Eric Bobillier-Chaumond (GRePS), Olivier Vigneau (WSE)", "title": "L'acceptation et l'appropriation des ENT (Espaces Num{\\'e}riques de\n  Travail) par les enseignants du primaire", "comments": "in french", "journal-ref": "2017, 24 (1), 39p. http://sticef.org", "doi": "10.23709/sticef.24.1.1", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article presents an evaluation of the conditions of use of a VWE\n(Virtual Work Environment) by primary school teachers. To this end, we\nconducted two studies and used activity theory as theoretical framework. Our\nfirst study aims to assess real practices carried out with the VWE and analyzed\npublications' content in order to understand how users appropriate the tool.\nThe second study describes how teachers perceive the role of the VWE in the\nevolution of their working prac-tices (maintaining, transforming and\nrestricting the existent practices). These stud-ies indicate that technological\nappropriation is achieved through instructional and communicational uses. The\nacceptance of this VWE is due to its ease of use and interface adequacy to\nteachers and young children.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2018 08:09:57 GMT"}], "update_date": "2018-06-06", "authors_parsed": [["Codreanu", "Elena", "", "GRePS, SICAL, WSE"], ["Michel", "Christine", "", "SICAL"], ["Bobillier-Chaumond", "Marc-Eric", "", "GRePS"], ["Vigneau", "Olivier", "", "WSE"]]}, {"id": "1806.01926", "submitter": "Johan Pouwelse", "authors": "Quinten Stokkink, Johan Pouwelse", "title": "Deployment of a Blockchain-Based Self-Sovereign Identity", "comments": "2018 IEEE International Conference on Blockchain", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Digital identity is unsolved: after many years of research there is still no\ntrusted communication over the Internet. To provide identity within the context\nof mutual distrust, this paper presents a blockchain-based digital identity\nsolution. Without depending upon a single trusted third party, the proposed\nsolution achieves passport-level legally valid identity. This solution for\nmaking identities Self-Sovereign, builds on a generic provable claim model for\nwhich attestations of truth from third parties need to be collected. The claim\nmodel is then shown to be both blockchain structure and proof method agnostic.\nFour different implementations in support of these two claim model properties\nare shown to offer sub-second performance for claim creation and claim\nverification. Through the properties of Self-Sovereign Identity, legally valid\nstatus and acceptable performance, our solution is considered to be fit for\nadoption by the general public.\n", "versions": [{"version": "v1", "created": "Tue, 5 Jun 2018 20:19:17 GMT"}], "update_date": "2018-06-07", "authors_parsed": [["Stokkink", "Quinten", ""], ["Pouwelse", "Johan", ""]]}, {"id": "1806.02291", "submitter": "Marcos Baez", "authors": "Francisco Ibarra, Marcos Baez, Francesca Fiore, Fabio Casati", "title": "Designing for Co-located and Virtual Social Interactions in Residential\n  Care", "comments": null, "journal-ref": null, "doi": "10.1145/3197391.3205424", "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we explore the feasibility and design challenges in supporting\nco-located and virtual social interactions in residential care by building on\nthe practice of reminiscence. Motivated by the challenges of social interaction\nin this context, we first explore the feasibility of a reminiscence-based\nsocial interaction tool designed to stimulate conversation in residential care\nwith different stakeholders. Then, we explore the design challenges in\nsupporting an assisting role in co-located reminiscence sessions, by running\npilot studies with a technology probe. Our findings point to the feasibility of\nthe tool and the willingness of stakeholders to contribute in the process,\nalthough with some skepticism about virtual interactions. The reminiscence\nsessions showed that compromises are needed when designing for both story\ncollection and conversation stimulation, evidencing specific design areas where\nfurther exploration is needed.\n", "versions": [{"version": "v1", "created": "Thu, 31 May 2018 09:35:38 GMT"}], "update_date": "2018-06-07", "authors_parsed": [["Ibarra", "Francisco", ""], ["Baez", "Marcos", ""], ["Fiore", "Francesca", ""], ["Casati", "Fabio", ""]]}, {"id": "1806.02608", "submitter": "Michael Robinson", "authors": "Michael Robinson, Kevin Jones, Helge Janicke, Leandros Maglaras", "title": "Developing Cyber Peacekeeping: Observation, Monitoring and Reporting", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cyber peacekeeping is an emerging and multi-disciplinary field of research,\ntouching upon technical, political and societal domains of thought. In this\narticle we build upon previous works by developing the cyber peacekeeping\nactivity of observation, monitoring and reporting. We take a practical\napproach: describing a scenario in which two countries request UN support in\ndrawing up and overseeing a ceasefire which includes cyber terms. We explore\nhow a cyber peacekeeping operation could start up and discuss the challenges it\nwill face. The article makes a number of proposals, including the use of a\nvirtual collaborative environment to bring multiple benefits. We conclude by\nsummarising our findings, and describing where further work lies.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 11:06:18 GMT"}], "update_date": "2018-06-08", "authors_parsed": [["Robinson", "Michael", ""], ["Jones", "Kevin", ""], ["Janicke", "Helge", ""], ["Maglaras", "Leandros", ""]]}, {"id": "1806.02615", "submitter": "Areg Karapetyan", "authors": "Anahit Sargsyan, Areg Karapetyan, Wei Lee Woon, Aamena Alshamsi", "title": "Explainable AI as a Social Microscope: A Case Study on Academic\n  Performance", "comments": null, "journal-ref": null, "doi": "10.1007/978-3-030-64583-0_24", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Academic performance is perceived as a product of complex interactions\nbetween students' overall experience, personal characteristics and upbringing.\nData science techniques, most commonly involving regression analysis and\nrelated approaches, serve as a viable means to explore this interplay. However,\nthese tend to extract factors with wide-ranging impact, while overlooking\nvariations specific to individual students. Focusing on each student's\npeculiarities is generally impossible with thousands or even hundreds of\nsubjects, yet data mining methods might prove effective in devising more\ntargeted approaches. For instance, subjects with shared characteristics can be\nassigned to clusters, which can then be examined separately with machine\nlearning algorithms, thereby providing a more nuanced view of the factors\naffecting individuals in a particular group. In this context, we introduce a\ndata science workflow allowing for fine-grained analysis of academic\nperformance correlates that captures the subtle differences in students'\nsensitivities to these factors. Leveraging the Local Interpretable\nModel-Agnostic Explanations (LIME) algorithm from the toolbox of Explainable\nArtificial Intelligence (XAI) techniques, the proposed pipeline yields groups\nof students having similar academic attainment indicators, rather than similar\nfeatures (e.g. familial background) as typically practiced in prior studies. As\na proof-of-concept case study, a rich longitudinal dataset is selected to\nevaluate the effectiveness of the proposed approach versus a standard\nregression model.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 11:19:07 GMT"}, {"version": "v2", "created": "Fri, 15 Jun 2018 04:39:16 GMT"}, {"version": "v3", "created": "Wed, 3 Jun 2020 11:25:04 GMT"}, {"version": "v4", "created": "Thu, 4 Jun 2020 11:30:00 GMT"}], "update_date": "2021-01-19", "authors_parsed": [["Sargsyan", "Anahit", ""], ["Karapetyan", "Areg", ""], ["Woon", "Wei Lee", ""], ["Alshamsi", "Aamena", ""]]}, {"id": "1806.02711", "submitter": "Bogdan Kulynych", "authors": "Bogdan Kulynych, Rebekah Overdorf, Carmela Troncoso, Seda G\\\"urses", "title": "POTs: Protective Optimization Technologies", "comments": "Appears in Conference on Fairness, Accountability, and Transparency\n  (FAT* 2020). Bogdan Kulynych and Rebekah Overdorf contributed equally to this\n  work. Version v1/v2 by Seda G\\\"urses, Rebekah Overdorf, and Ero Balsa was\n  presented at HotPETS 2018 and at PiMLAI 2018", "journal-ref": null, "doi": "10.1145/3351095.3372853", "report-no": null, "categories": "cs.CY cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Algorithmic fairness aims to address the economic, moral, social, and\npolitical impact that digital systems have on populations through solutions\nthat can be applied by service providers. Fairness frameworks do so, in part,\nby mapping these problems to a narrow definition and assuming the service\nproviders can be trusted to deploy countermeasures. Not surprisingly, these\ndecisions limit fairness frameworks' ability to capture a variety of harms\ncaused by systems.\n  We characterize fairness limitations using concepts from requirements\nengineering and from social sciences. We show that the focus on algorithms'\ninputs and outputs misses harms that arise from systems interacting with the\nworld; that the focus on bias and discrimination omits broader harms on\npopulations and their environments; and that relying on service providers\nexcludes scenarios where they are not cooperative or intentionally adversarial.\n  We propose Protective Optimization Technologies (POTs). POTs provide means\nfor affected parties to address the negative impacts of systems in the\nenvironment, expanding avenues for political contestation. POTs intervene from\noutside the system, do not require service providers to cooperate, and can\nserve to correct, shift, or expose harms that systems impose on populations and\ntheir environments. We illustrate the potential and limitations of POTs in two\ncase studies: countering road congestion caused by traffic-beating\napplications, and recalibrating credit scoring for loan applicants.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 14:41:32 GMT"}, {"version": "v2", "created": "Mon, 18 Jun 2018 14:46:42 GMT"}, {"version": "v3", "created": "Thu, 30 Aug 2018 12:24:14 GMT"}, {"version": "v4", "created": "Wed, 18 Dec 2019 17:07:17 GMT"}, {"version": "v5", "created": "Thu, 19 Dec 2019 09:40:31 GMT"}, {"version": "v6", "created": "Sun, 26 Jan 2020 10:37:31 GMT"}], "update_date": "2020-01-28", "authors_parsed": [["Kulynych", "Bogdan", ""], ["Overdorf", "Rebekah", ""], ["Troncoso", "Carmela", ""], ["Gürses", "Seda", ""]]}, {"id": "1806.02944", "submitter": "Adnan Mahmood", "authors": "Adnan Mahmood, Hushairi Zen, and Shadi M. S. Hilles", "title": "Big Data and Privacy Issues for Connected Vehicles in Intelligent\n  Transportation Systems", "comments": null, "journal-ref": "Mahmood A., Zen H., Hilles S.M.S. (2018) Big Data and Privacy\n  Issues for Connected Vehicles in Intelligent Transportation Systems. In: Sakr\n  S., Zomaya A. (eds) Encyclopedia of Big Data Technologies. Springer, Cham", "doi": "10.1007/978-3-319-63962-8_234-1", "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The evolution of Big Data in large-scale Internet-of-Vehicles has brought\nforward unprecedented opportunities for a unified management of the\ntransportation sector, and for devising smart Intelligent Transportation\nSystems. Nevertheless, such form of frequent heterogeneous data collection\nbetween the vehicles and numerous applications platforms via diverse radio\naccess technologies has led to a number of security and privacy attacks, and\naccordingly demands for a secure data collection in such architectures. In this\nrespect, this chapter is primarily an effort to highlight the said challenge to\nthe readers, and to subsequently propose some security requirements and a basic\nsystem model for secure Big Data collection in Internet-of-Vehicles. Open\nresearch challenges and future directions have also been deliberated.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 02:14:24 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Mahmood", "Adnan", ""], ["Zen", "Hushairi", ""], ["Hilles", "Shadi M. S.", ""]]}, {"id": "1806.03086", "submitter": "Damien Jacques", "authors": "Damien C. Jacques", "title": "Mobile Phone Metadata for Development", "comments": "28 pages, 8 figures, 1 table. Published in Ph.D. Thesis: Jacques,\n  D.C. Harnessing the Data Revolution for Food Security and Poverty Mapping:\n  synergies between Mobile Phone Data, Earth Observation and Official\n  Statistics in Senegal. May 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Mobile phones are now widely adopted by most of the world population. Each\ntime a call is made (or an SMS sent), a Call Detail Record (CDR) is generated\nby the telecom companies for billing purpose. These metadata provide\ninformation on when, how, from where and with whom we communicate.\nConceptually, they can be described as a geospatial, dynamic, weighted and\ndirected network. Applications of CDRs for development are numerous. They have\nbeen used to model the spread of infectious diseases, study road traffic,\nsupport electrification planning strategies or map socio-economic level of\npopulation. While massive, CDRs are not statistically representative of the\nwhole population due to several sources of bias (market, usage, spatial and\ntemporal resolution). Furthermore, mobile phone metadata are held by telecom\ncompanies. Consequently, their access is not necessarily straightforward and\ncan seriously hamper any operational application. Finally, a trade-off exists\nbetween privacy and utility when using sensitive data like CDRs. New\ninitiatives such as Open Algorithm might help to deal with these fundamental\nquestions by allowing researchers to run algorithms on the data that remain\nsafely stored behind the firewall of the providers.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 11:06:39 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Jacques", "Damien C.", ""]]}, {"id": "1806.03184", "submitter": "Lena Maier-Hein", "authors": "Lena Maier-Hein, Matthias Eisenmann, Carolin Feldmann, Hubertus\n  Feussner, Germain Forestier, Stamatia Giannarou, Bernard Gibaud, Gregory D.\n  Hager, Makoto Hashizume, Darko Katic, Hannes Kenngott, Ron Kikinis, Michael\n  Kranzfelder, Anand Malpani, Keno M\\\"arz, Beat M\\\"uuller-Stich, Nassir Navab,\n  Thomas Neumuth, Nicolas Padoy, Adrian Park, Carla Pugh, Nicolai Schoch,\n  Danail Stoyanov, Russell Taylor, Martin Wagner, S. Swaroop Vedula, Pierre\n  Jannin*, and Stefanie Speidel* (*: shared senior authors)", "title": "Surgical Data Science: A Consensus Perspective", "comments": "29 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Surgical data science is a scientific discipline with the objective of\nimproving the quality of interventional healthcare and its value through\ncapturing, organization, analysis, and modeling of data. The goal of the 1st\nworkshop on Surgical Data Science was to bring together researchers working on\ndiverse topics in surgical data science in order to discuss existing\nchallenges, potential standards and new research directions in the field.\nInspired by current open space and think tank formats, it was organized in June\n2016 in Heidelberg. While the first day of the workshop, which was dominated by\ninteractive sessions, was open to the public, the second day was reserved for a\nboard meeting on which the information gathered on the public day was processed\nby (1) discussing remaining open issues, (2) deriving a joint definition for\nsurgical data science and (3) proposing potential strategies for advancing the\nfield. This document summarizes the key findings.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 14:29:03 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Maier-Hein", "Lena", "", "*: shared senior authors"], ["Eisenmann", "Matthias", "", "*: shared senior authors"], ["Feldmann", "Carolin", "", "*: shared senior authors"], ["Feussner", "Hubertus", "", "*: shared senior authors"], ["Forestier", "Germain", "", "*: shared senior authors"], ["Giannarou", "Stamatia", "", "*: shared senior authors"], ["Gibaud", "Bernard", "", "*: shared senior authors"], ["Hager", "Gregory D.", "", "*: shared senior authors"], ["Hashizume", "Makoto", "", "*: shared senior authors"], ["Katic", "Darko", "", "*: shared senior authors"], ["Kenngott", "Hannes", "", "*: shared senior authors"], ["Kikinis", "Ron", "", "*: shared senior authors"], ["Kranzfelder", "Michael", "", "*: shared senior authors"], ["Malpani", "Anand", "", "*: shared senior authors"], ["März", "Keno", "", "*: shared senior authors"], ["Müuller-Stich", "Beat", "", "*: shared senior authors"], ["Navab", "Nassir", "", "*: shared senior authors"], ["Neumuth", "Thomas", "", "*: shared senior authors"], ["Padoy", "Nicolas", "", "*: shared senior authors"], ["Park", "Adrian", "", "*: shared senior authors"], ["Pugh", "Carla", "", "*: shared senior authors"], ["Schoch", "Nicolai", "", "*: shared senior authors"], ["Stoyanov", "Danail", "", "*: shared senior authors"], ["Taylor", "Russell", "", "*: shared senior authors"], ["Wagner", "Martin", "", "*: shared senior authors"], ["Vedula", "S. Swaroop", "", "*: shared senior authors"], ["Jannin*", "Pierre", "", "*: shared senior authors"], ["Speidel*", "Stefanie", "", "*: shared senior authors"]]}, {"id": "1806.03235", "submitter": "Viktoras Veitas Mr.", "authors": "Viktoras Kabir Veitas and Simon Delaere", "title": "Policy Scan and Technology Strategy Design methodology", "comments": "Unpublished draft; 20 pages (incl. references), 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Increasingly accelerating technology advancement affects and disrupts almost\nall aspects of human society and civilization at large as we know it. Actually,\nthis has been true since the technology started at the dawn of human society,\nyet the mere speed and magnitude of modern technology development brings about\nthe situation where societies and economies have to adapt to the changing\ntechnological landscape as much as technologies have to integrate into the\nsocial fabric. The way to to achieve such integration in a changing and\nunpredictable world is to support the close interaction between the world of\nsocietal expectations and the world of technology. Policy Scan and Technology\nStrategy design methodology presented in this paper was developed precisely for\nthe purpose of addressing specific types of 'ill-defined' problems in terms of\nobserving, analyzing and integrating technology developments and availabilities\nwith policy requirements, social governance and societal expectations. The\nmethodology consists of conceptual tools and methods for developing concrete\nactions and products for guiding technology adoption for social change. It is\ngeared towards increasingly complex and uncertain situations where existing\nanalysis and problem solving methods often fail due to many non-linearities\ninherent in the social and technology worlds and, especially, at their area of\ntheir inter intersection. The development of the methodology followed the\ngrounded theory construction process which requires a close relation to a\nspecific context of an application domain, determined by actual interaction\nbetween the worlds of societal problems and technology. The chosen application\ndomain of this research is the intersection of smart mobility problematics and\nopportunities, the rising autonomous driving technology, data privacy,\nprovenance and security challenges, policies and legislation.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2018 17:26:40 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Veitas", "Viktoras Kabir", ""], ["Delaere", "Simon", ""]]}, {"id": "1806.03236", "submitter": "Mohammad Asadul Hoque", "authors": "Noah Carter, Mohammad A. Hoque, Md Salman Ahmed", "title": "Simulating Vehicle Movement and Multi-Hop Connectivity from Basic Safety\n  Messages", "comments": null, "journal-ref": "Noah Carter, Mohammad A. Hoque, Md Salman Ahmed. \"Simulating\n  Vehicle Movement and Multi-Hop Connectivity from Basic Safety Messages.\" IEEE\n  SoutheastCon 2018", "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The Basic Safety Message (BSM) is a standardized communication packet that is\nsent every tenth of a second between connected vehicles using Dedicated Short\nRange Communication (DSRC). BSMs contain data about the sending vehicle's\nstate, such as speed, location, and the status of the turn signal. Currently,\nmany BSM datasets are available through the connected vehicle testbeds of U.S.\nDepartment of Transportation from all over the country. However, without a\nproper visualization tool, it is not possible to analyze or visually get an\noverview of the spatio-temporal distribution of the data. With this goal, a web\napplication has been developed which can ingest a raw BSM dataset and display a\ntime-based simulation of vehicle movement. The simulation also displays\nmulti-hop vehicular network connectivity over DSRC. This paper gives details\nabout the application, including an explanation of the multi-hop partitioning\nalgorithm used to classify the vehicles into separate network partitions. A\nperformance analysis for the simulation is included, in which it is suggested\nthat calculating a connectivity matrix with the multi-hop partitioning\nalgorithm is computationally expensive for large number of vehicles.\n", "versions": [{"version": "v1", "created": "Sat, 5 May 2018 14:12:18 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Carter", "Noah", ""], ["Hoque", "Mohammad A.", ""], ["Ahmed", "Md Salman", ""]]}, {"id": "1806.03237", "submitter": "Hongling Shi", "authors": "Hongling Shi (LIMOS), Kun Mean Hou (LIMOS), Xunxing Diao (LIMOS), Liu\n  Xing (LIMOS), Jian-Jin Li (LIMOS), Christophe De Vaulx (LIMOS)", "title": "A Wireless Multimedia Sensor Network Platform for Environmental Event\n  Detection Dedicated to Precision Agriculture", "comments": null, "journal-ref": "New and Smart Information Communication Science and Technology to\n  Support Sustainable Development (NICST 2013), Sep 2013, Clermont-Ferrand,\n  France", "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Precision agriculture has been considered as a new technique to improve\nagricultural production and support sustainable development by preserving\nplanet resource and minimizing pollution. By monitoring different parameters of\ninterest in a cultivated field, wireless sensor network (WSN) enables real-time\ndecision making with regard to issues such as management of water resources for\nirrigation, choosing the optimum point for harvesting, estimating fertilizer\nrequirements and predicting crop yield more accurately. In spite the tremendous\nadvanced of scalar WSN in recent year, scalar WSN cannot meet all the\nrequirements of ubiquitous intelligent environmental event detections because\nscalar data such as temperature, soil humidity, air humidity and light\nintensity are not rich enough to detect all the environmental events such as\nplant diseases and present of insects. Thus to fulfill those requirements\nmultimedia data is needed. In this paper we present a robust multi-support and\nmodular Wireless Multimedia Sensor Network (WMSN) platform, which is a type of\nwireless sensor network equipped with a low cost CCD camera. This WMSN platform\nmay be used for diverse environmental event detections such as the presence of\nplant diseases and insects in precision agriculture applications.\n", "versions": [{"version": "v1", "created": "Tue, 15 May 2018 07:37:23 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Shi", "Hongling", "", "LIMOS"], ["Hou", "Kun Mean", "", "LIMOS"], ["Diao", "Xunxing", "", "LIMOS"], ["Xing", "Liu", "", "LIMOS"], ["Li", "Jian-Jin", "", "LIMOS"], ["De Vaulx", "Christophe", "", "LIMOS"]]}, {"id": "1806.03238", "submitter": "Khaled Sellami KSI", "authors": "Khaled Sellami, Lynda Sellami, Pierre F Tiako", "title": "Reconfigurable Ubiquitous Computing Infrastructure for Load Balancing", "comments": null, "journal-ref": "World Academy of Science, Engineering and Technology International\n  Journal of Industrial and Manufacturing Engineering Vol 12, No 3, 2018", "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Ubiquitous computing helps make data and services available to users anytime\nand anywhere. This makes the cooperation of devices a crucial need. In return,\nsuch cooperation causes an overload of the devices and/or networks, resulting\nin network malfunction and suspension of its activities. Our goal in this paper\nis to propose an approach of devices reconfiguration in order to help to reduce\nthe energy consumption in ubiquitous environments. The idea is that when\nhigh-energy consumption is detected, we proceed to a change in component\ndistribution on the devices to reduce and/or balance the energy consumption. We\nalso investigate the possibility to detect high-energy consumption of\ndevices/network based on devices abilities. As a result, our idea realizes a\nreconfiguration of devices aimed at reducing the consumption of energy and/or\nload balancing in ubiquitous environments.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 21:58:28 GMT"}, {"version": "v2", "created": "Thu, 29 Nov 2018 17:34:31 GMT"}], "update_date": "2018-11-30", "authors_parsed": [["Sellami", "Khaled", ""], ["Sellami", "Lynda", ""], ["Tiako", "Pierre F", ""]]}, {"id": "1806.03240", "submitter": "Radek Pel\\'anek", "authors": "Radek Pel\\'anek and Tom\\'a\\v{s} Effenberger and Mat\\v{e}j Van\\v{e}k\n  and Vojt\\v{e}ch Sassmann and Dominik Gmiterko", "title": "Measuring Item Similarity in Introductory Programming: Python and Robot\n  Programming Case Studies", "comments": "Full version of the L@S'18 paper \"Measuring Item Similarity in\n  Introductory Programming\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A personalized learning system needs a large pool of items for learners to\nsolve. When working with a large pool of items, it is useful to measure the\nsimilarity of items. We outline a general approach to measuring the similarity\nof items and discuss specific measures for items used in introductory\nprogramming. Evaluation of quality of similarity measures is difficult. To this\nend, we propose an evaluation approach utilizing three levels of abstraction.\nWe illustrate our approach to measuring similarity and provide evaluation using\nitems from three diverse programming environments.\n", "versions": [{"version": "v1", "created": "Thu, 24 May 2018 11:12:25 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Pelánek", "Radek", ""], ["Effenberger", "Tomáš", ""], ["Vaněk", "Matěj", ""], ["Sassmann", "Vojtěch", ""], ["Gmiterko", "Dominik", ""]]}, {"id": "1806.03241", "submitter": "Yasyf Mohamedali", "authors": "Yasyf Mohamedali", "title": "Matching Startup Founders to Investors: a Tool and a Study", "comments": "MIT Master's of Engineering in Computer Science thesis. June 2018.\n  152 pages", "journal-ref": null, "doi": "1721.1/119731", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The process of matching startup founders with venture capital investors is a\nnecessary first step for many modern technology companies, yet there have been\nfew attempts to study the characteristics of the two parties and their\ninteractions. Surprisingly little has been shown quantitatively about the\nprocess, and many of the common assumptions are based on anecdotal evidence. In\nthis thesis, we aim to learn more about the matching component of the startup\nfundraising process. We begin with a tool (VCWiz), created from the current set\nof best-practices to help inexperienced founders navigate the founder-investor\nmatching process. The goal of this tool is to increase efficiency and\nequitability, while collecting data to inform further studies. We use this\ndata, combined with public data on venture investments in the USA, to draw\nconclusions about the characteristics of venture financing rounds. Finally, we\nexplore the communication data contributed to the tool by founders who are\nactively fundraising, and use it to learn which social attributes are most\nbeneficial for individuals to possess when soliciting investments.\n", "versions": [{"version": "v1", "created": "Fri, 25 May 2018 17:25:58 GMT"}], "update_date": "2020-05-11", "authors_parsed": [["Mohamedali", "Yasyf", ""]]}, {"id": "1806.03242", "submitter": "Mansaf Alam Dr", "authors": "Leena Khanna, Shailendra Narayan Singh, Mansaf Alam", "title": "Multidimensional Analysis of Psychological Factors affecting Students\n  Academic Performance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Academic performance of any individual is dependent upon numerous aspects\nregarding the day to day life of the individual under consideration. Academic\nperformance is measured in terms of the grade point average or GPA as it is\ncalled. Grade point average is dependent not only on the faculty but also on\nvarious psychological parameters including the study habits, social anxiety and\nallied. In this study, a detail analysis of numerous psychological factors\nimpacting the grade point was carried and based upon various psychological\nfactors the performance for the student in forth coming examination was\nforecasted.\n", "versions": [{"version": "v1", "created": "Sat, 26 May 2018 07:34:15 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Khanna", "Leena", ""], ["Singh", "Shailendra Narayan", ""], ["Alam", "Mansaf", ""]]}, {"id": "1806.03243", "submitter": "Viktoras Veitas Mr.", "authors": "Viktoras Kabir Veitas and Simon Delaere", "title": "In-vehicle data recording, storage and access management in autonomous\n  vehicles", "comments": "Unpublished draft: 21 pages (with references); 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transport sector is in the process of being rapidly and fundamentally\nreshaped by autonomous and collaborative driving technologies. This reshaping\npromises huge economic and social benefits as well as challenges in terms of\ndeveloping and deploying secure and safe transportations systems, their smooth\nintegration to social fabric. We have employed Policy Scan and Technology\nStrategy Design methodology in order to identify concrete societal expectations\nand problems and map them with mitigating technological availabilities in the\ndomain of autonomous driving and smart mobility.\n  Event Data Recorder for Autonomous Driving (EDR/AD) is an envisioned\nsubsystem of a vehicular Controller Area Network which ensures the\nconfidentiality, integrity and availability of data related to operation of a\nvehicle in order to permit recovery of exact situation following the occurrence\nof an event or on demand. The exact technical and regulatory requirements for\nthe device are still in the development internationally, but it is clear that\nit will be included into vehicle type-approval requirements at UNECE level. We\npresent an analysis of the context of the usage of the EDR/AD in collaborative\nintelligent transport systems, related security, data provenance and privacy,\nother regulatory and technical issues considering many interest groups and\nstakeholders involved. We present a concrete proposal for developing a EDR/AD\nproof of the concept prototype with clear market deployment potential and urge\nsecurity researchers, vehicle manufacturers, and component suppliers to form a\ncollaboration towards implementing important technology for making future\nautonomous vehicles more socially acceptable and legally compliant.\nFurthermore, EDR/AD technology, apart from its immediate use in autonomous\ndriving and smart mobility domain has a potential to be extended to general\nautonomous robot and AI applications.\n", "versions": [{"version": "v1", "created": "Mon, 28 May 2018 17:46:54 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Veitas", "Viktoras Kabir", ""], ["Delaere", "Simon", ""]]}, {"id": "1806.03245", "submitter": "Vicky Charisi", "authors": "Chronis Kynigos, Marianthi Grizioti, Christina Gkreka", "title": "Studying real-world societal problems in a STEM context through robotics", "comments": "Presented at Interaction Design and Children (IDC-CRI2018) Workshop\n  (arXiv:submit/2277826)", "journal-ref": null, "doi": null, "report-no": "IDC/2018/01", "categories": "cs.CY cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we will discuss the design and implementation of three\neducational robotics workshops that focus on the use of robotics for addressing\nreal-world societal problems. Through the workshops, we aimed to investigate\nhow the integration of real-world problems to robotics can provide a\nmultidisciplinary approach for child-robot interaction that allows students to\nengage with different STE(A)M concepts. In addition, we examined if this\nintegration increased or strengthened students' interest in STEM/robotics\neducation and careers. The workshops were designed and implemented in the\ncontext of the European project Educational Robotics for STEM (ER4STEM) with\nstudents from different age groups using Lego Mindstorms and Arduino kits.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2018 17:13:48 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Kynigos", "Chronis", ""], ["Grizioti", "Marianthi", ""], ["Gkreka", "Christina", ""]]}, {"id": "1806.03246", "submitter": "Vicky Charisi", "authors": "Ornella Mich, Roberto Tiella", "title": "ROBOTIKANDO: a Web Tool for Supporting Teacher Practicing Robotics in\n  Kindergarten", "comments": "Presented at Interaction Design and Children (IDC-CRI2018) Workshop\n  (arXiv:submit/2277826)", "journal-ref": null, "doi": null, "report-no": "IDC-CRI/2018/02", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes ROBOTIKANDO, a web application for supporting both\nkindergarten teachers in planning educational robotics activities and\neducational robotics experts who would like to share their knowledge and\nexperience. ROBOTIKANDO has been designed and implemented following a co-design\nprocess, which devised a conceptual map aiming to connect educational robotics\nand kindergarten education principles. As future work, we are planning a\nlongitudinal evaluation with Preschools teachers. Moreover, we are thinking of\nextending the application to teachers of primary and secondary schools.\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2018 17:14:09 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Mich", "Ornella", ""], ["Tiella", "Roberto", ""]]}, {"id": "1806.03248", "submitter": "Vicky Charisi", "authors": "Camilla Monaco, Ornella Mich, Tiziana Ceol, Alessandra Potrich", "title": "Investigating Mental Representations about Robots in Preschool Children", "comments": "Presented at Interaction Design and Children (IDC-CRI2018) Workshop\n  (arXiv:submit/2277826)", "journal-ref": null, "doi": null, "report-no": "IDC-CRI/2018/04", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper refers to an observational research that investigates preschool\nchildren's mental representations of robots. Our hypotheses were that: a) three\nto six years-old children think about robots as human-like entities, concerning\nto both the physical and the conceptual nature of human beings, and b) they do\nnot understand the concept of the software programming behind the operation of\na robot. The study is based on two different data collection systems: an\nindividual-based system and a group-based one. In both cases, the investigation\nuses a complex and multimodal research structure that combines a drawing-based\napproach with a conversational-discursive methodology. This paper focuses on\nthe individual based data collection (348 drawings and 118 interviews).\nPreliminary results show that the human-like representation of robots is not\nthe only one, even though it is present in about 64%of the drawings, and that\nthis percentage decreases after the interview about robotics. Moreover, in\nseveral cases children refer to some concepts related to programming (e.g. the\npresence of sensors or human beings that make robots do things).\n", "versions": [{"version": "v1", "created": "Tue, 29 May 2018 17:14:40 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Monaco", "Camilla", ""], ["Mich", "Ornella", ""], ["Ceol", "Tiziana", ""], ["Potrich", "Alessandra", ""]]}, {"id": "1806.03249", "submitter": "Marcos Baez", "authors": "Francisco Ibarra, Grzegorz Kowalik, Marcos Baez, Rados{\\l}aw Nielek,\n  Norma Lau, Luca Cernuzzi, Fabio Casati", "title": "Design Challenges for Reconnecting in Later Life: A Qualitative Study", "comments": null, "journal-ref": null, "doi": "10.1145/3197391.3205426", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Friendships and social interactions are renown contributors to wellbeing. As\nsuch, keeping a healthy amount of relationships becomes very important as\npeople age and the size of their social network tends to decrease. In this\npaper, we take a step back and explore reconnection -- find out about or\nre-contact old friends, an emerging topic due to the increased use of\ncomputer-mediated technology by older adults to maintain friendships and form\nnew ones. We report on our findings from semi-structured interviews with 28\nindividuals from Costa Rica and Poland. The interviews aimed to explore whether\nthere is a wish to reconnect, and the challenges encountered by older adults to\nreconnect. We contribute with design considerations for tools allow- ing older\nadults to reconnect, discussing opportunities for technology.\n", "versions": [{"version": "v1", "created": "Thu, 31 May 2018 09:31:08 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Ibarra", "Francisco", ""], ["Kowalik", "Grzegorz", ""], ["Baez", "Marcos", ""], ["Nielek", "Radosław", ""], ["Lau", "Norma", ""], ["Cernuzzi", "Luca", ""], ["Casati", "Fabio", ""]]}, {"id": "1806.03250", "submitter": "Dimiter Dobrev", "authors": "Dimiter Dobrev", "title": "AI Should Not Be an Open Source Project", "comments": null, "journal-ref": "International Journal \"Information Content and Processing\", Volume\n  6, Number 1, 2019, pp. 34-48", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Who should own the Artificial Intelligence technology? It should belong to\neveryone, properly said not the technology per se, but the fruits that can be\nreaped from it. Obviously, we should not let AI end up in the hands of\nirresponsible persons. Likewise, nuclear technology should benefit all, however\nit should be kept secret and inaccessible by the public at large.\n", "versions": [{"version": "v1", "created": "Thu, 31 May 2018 09:55:24 GMT"}], "update_date": "2019-06-25", "authors_parsed": [["Dobrev", "Dimiter", ""]]}, {"id": "1806.03251", "submitter": "Shiva H C Prasad Prof", "authors": "Shiva Prasad H C, Giridhar Kamath, Gopalkrishna Barkur, Rakesh Naik", "title": "Does supplier evaluation impact process improvement?", "comments": "24 pages, 09 figures, 13 tables", "journal-ref": "Journal of Industrial Engineering and Management, Vol 9, No 3\n  (2016),708-731", "doi": "10.3926/jiem.1777", "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The research explores and examines factors for supplier evaluation and its\nimpact on process improvement particularly aiming on a steel pipe manufacturing\nfirm in Gujarat, India. Data was collected using in-depth interview. The\nquestionnaire primarily involves the perception of evaluation of supplier.\nFactors influencing supplier evaluation and its influence on process\nimprovement is also examined in this study. The model testing and validation\nwere done using partial least square method. Outcomes signified that the\nfactors that influence the evaluation of the supplier are quality, cost,\ndelivery and supplier relationship management. The study depicted that quality\nand cost factors for supplier evaluation are insignificant. The delivery and\nsupplier relationship management have the significant influence on the\nevaluation of the supplier. The research also depicted that supplier evaluation\nhas a significant influence on process improvement. Many researchers have\nconsidered quality, cost and delivery as the factors for evaluating the\nsuppliers. But for a company, it is quintessential to have a good relationship\nwith the supplier. Hence, the factor, supplier relationship management is\nconsidered for the study. Also, the case study company focused more on quality\nand cost factors for the supplier evaluation of the firm. However, delivery and\nsupplier relationship management are also equally important for a firm in\nevaluating the supplier.\n", "versions": [{"version": "v1", "created": "Thu, 31 May 2018 14:03:23 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["C", "Shiva Prasad H", ""], ["Kamath", "Giridhar", ""], ["Barkur", "Gopalkrishna", ""], ["Naik", "Rakesh", ""]]}, {"id": "1806.03252", "submitter": "Shiva H C Prasad Prof", "authors": "Giridhar Kamath, Rakesh Naik, Shiva Prasad H C", "title": "A vendors evaluation using AHP for an Indian steel pipe manufacturing\n  company", "comments": "20 pages, 3 figures, 25 Tables", "journal-ref": "International Journal of the Analytic Hierarchy Process, 2016,\n  Vol. 8 Issue 3, Page no. 442-461,", "doi": "10.13033/ijahp.v8i3.460", "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  To improve a firms supply chain performance it is essential to have a vendor\nevaluation process to be able to showcase an organizations success in the\npresent aggressive market. Hence, the process of evaluating the vendor is a\ncrucial task of the purchasing executives in supply chain management. The\nobjective of this research is to propose a methodology to evaluate the vendors\nfor a steel pipe manufacturing firm in Gujarat, India. For the purpose of the\nstudy, the Analytical Hierarchy Process was used to evaluate the best raw\nmaterial vendor for this company. Multiple qualitative and quantitative\ncriteria are involved in the vendor evaluation process. To solve the complex\nproblem of vendor evaluation, a tradeoff between this multicriteria is\nimportant. The outcomes indicated that the AHP technique makes it simpler to\nassign weights for the different criteria for evaluating the vendor. Research\nfindings showed that quality is the most important criterion followed by\ndelivery, cost and vendor relationship management.\n", "versions": [{"version": "v1", "created": "Thu, 31 May 2018 14:25:38 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Kamath", "Giridhar", ""], ["Naik", "Rakesh", ""], ["C", "Shiva Prasad H", ""]]}, {"id": "1806.03253", "submitter": "Sanchit Alekh", "authors": "Sanchit Alekh", "title": "EU General Data Protection Regulation: A Gentle Introduction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The GDPR, or the Datenschutz Grundverordnung (DSGVO) in German, is an EU Law\nwhich addresses the subject of safeguarding privacy of personal data of the\ncitizens of the EU and EEA. It also specifies how data the collected data might\nbe transported out of the EU/EEA. It is the first genuine effort to unify the\nplethora of disparate privacy regulations put forward by different regulatory\nbodies. The GDPR aims to not only give more control over their personal data to\nthe citizens, but also make conformance for businesses easier by defining\nunified guidelines. It also presses businesses, especially those dealing with\nsensitive personal data, to build their information systems in a way that\nconfirms with Privacy by Design. These regulations aim to ensure a more\ntransparent handling and processing of personal data, and create an environment\nof trust and awareness on both sides, i.e., the data owner as well as the\ncontrollers/processors.\n", "versions": [{"version": "v1", "created": "Fri, 1 Jun 2018 22:20:08 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Alekh", "Sanchit", ""]]}, {"id": "1806.03254", "submitter": "Idit Sohlberg", "authors": "Idit Sohlberg", "title": "Driving by the Elderly and their Awareness of their Driving Difficulties\n  (Hebrew)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY econ.EM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the past twenty years the number of elderly drivers has increased for two\nreasons. one is the higher proportion of elderly in the population, and the\nother is the rise in the share of the elderly who drive. This paper examines\nthe features of their driving and the level of their awareness of problems\nrelating to it, by analysis preference survey that included interviews with 205\ndrivers aged between 70 and 80. The interviewees exhibited a level of optimism\nand self confidence in their driving that is out of line with the real\nsituation. There is also a discrepancy between how their driving is viewed by\nothers and their own assessment, and between their self assessment and their\nassessment of the driving of other elderly drivers, which they rate lower than\ntheir own. they attributed great importance to safety feature in cars, although\nthey did not think that they themselves needed them, and most elderly drivers\ndid not think there was any reason that they should stop driving, despite\nsuggestions from family members and others that they should do so. A declared\npreference survey was undertaken to assess the degree of difficulty elderly\ndrivers attribute to driving conditions. It was found that they are concerned\nmainly about weather condition, driving at night, and long journeys. Worry\nabout night driving was most marked among women, the oldest drivers, and those\nwho drove less frequently. In light of the findings, imposing greater\nresponsibility on the health system should be considered. Consideration should\nalso be given to issuing partial licenses to the elderly for daytime driving\nonly, or restricted to certain weather conditions, dependent on their medical\ncondition. Such flexibility will enable the elderly to maintain their life\nstyle and independence for a longer period on the one hand, and on the other,\nwill minimize the risks to themselves and other.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 19:32:26 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Sohlberg", "Idit", ""]]}, {"id": "1806.03255", "submitter": "Austin Hounsel", "authors": "Austin Hounsel, Prateek Mittal, Nick Feamster", "title": "Automatically Generating a Large, Culture-Specific Blocklist for China", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet censorship measurements rely on lists of websites to be tested, or\n\"block lists\" that are curated by third parties. Unfortunately, many of these\nlists are not public, and those that are tend to focus on a small group of\ntopics, leaving other types of sites and services untested. To increase and\ndiversify the set of sites on existing block lists, we use natural language\nprocessing and search engines to automatically discover a much wider range of\nwebsites that are censored in China. Using these techniques, we create a list\nof 1125 websites outside the Alexa Top 1,000 that cover Chinese politics,\nminority human rights organizations, oppressed religions, and more.\nImportantly, $\\textit{none of the sites we discover are present on the current\nlargest block list}$. The list that we develop not only vastly expands the set\nof sites that current Internet measurement tools can test, but it also deepens\nour understanding of the nature of content that is censored in China. We have\nreleased both this new block list and the code for generating it.\n", "versions": [{"version": "v1", "created": "Mon, 4 Jun 2018 20:58:09 GMT"}, {"version": "v2", "created": "Thu, 19 Jul 2018 16:02:31 GMT"}], "update_date": "2018-07-20", "authors_parsed": [["Hounsel", "Austin", ""], ["Mittal", "Prateek", ""], ["Feamster", "Nick", ""]]}, {"id": "1806.03256", "submitter": "Chun Kit Yeung", "authors": "Chun-kit Yeung, Zizheng Lin, Kai Yang, Dit-yan Yeung", "title": "Incorporating Features Learned by an Enhanced Deep Knowledge Tracing\n  Model for STEM/Non-STEM Job Prediction", "comments": "10 pages; Career prediction; Knowledge tracing; Machine learning", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The 2017 ASSISTments Data Mining competition aims to use data from a\nlongitudinal study for predicting a brand-new outcome of students which had\nnever been studied before by the educational data mining research community.\nSpecifically, it facilitates research in developing predictive models that\npredict whether the first job of a student out of college belongs to a STEM\n(the acronym for science, technology, engineering, and mathematics) field. This\nis based on the student's learning history on the ASSISTments blended learning\nplatform in the form of extensive clickstream data gathered during the middle\nschool years. To tackle this challenge, we first estimate the expected\nknowledge state of students with respect to different mathematical skills using\na deep knowledge tracing (DKT) model and an enhanced DKT (DKT+) model. We then\ncombine the features corresponding to the DKT/DKT+ expected knowledge state\nwith other features extracted directly from the student profile in the dataset\nto train several machine learning models for the STEM/non-STEM job prediction.\nOur experiments show that models trained with the combined features generally\nperform better than the models trained with the student profile alone. Detailed\nanalysis of the student's knowledge state reveals that, when compared with\nnon-STEM students, STEM students generally show a higher mastery level and a\nhigher learning gain in mathematics.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jun 2018 13:57:47 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Yeung", "Chun-kit", ""], ["Lin", "Zizheng", ""], ["Yang", "Kai", ""], ["Yeung", "Dit-yan", ""]]}, {"id": "1806.03257", "submitter": "Barbara Solenthaler", "authors": "Barbara Solenthaler, Severin Klingler, Tanja K\\\"aser, Markus Gross", "title": "Ten Years of Research on Intelligent Educational Games for Learning\n  Spelling and Mathematics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we present our findings from ten years of research on\nintelligent educational games. We discuss the architecture of our training\nenvironments for learning spelling and mathematics, and specifically focus on\nthe representation of the content and the controller that enables personalized\ntrainings. We first show the multi-modal representation that reroutes\ninformation through multiple perceptual cues and discuss the game structure. We\nthen present the data-driven student model that is used for a personalized,\nadaptive presentation of the content. We further leverage machine learning for\nanalytics and visualization tools targeted at teachers and experts. A large\ndata set consisting of training sessions of more than 20,000 children allows\nstatistical interpretations and insights into the nature of learning.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jun 2018 07:55:15 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Solenthaler", "Barbara", ""], ["Klingler", "Severin", ""], ["Käser", "Tanja", ""], ["Gross", "Markus", ""]]}, {"id": "1806.03281", "submitter": "Niki Kilbertus", "authors": "Niki Kilbertus, Adri\\`a Gasc\\'on, Matt J. Kusner, Michael Veale,\n  Krishna P. Gummadi, Adrian Weller", "title": "Blind Justice: Fairness with Encrypted Sensitive Attributes", "comments": "published at ICML 2018", "journal-ref": "Proceedings of the 35th International Conference on Machine\n  Learning, PMLR 80:2630-2639, 2018", "doi": null, "report-no": null, "categories": "stat.ML cs.CR cs.CY cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent work has explored how to train machine learning models which do not\ndiscriminate against any subgroup of the population as determined by sensitive\nattributes such as gender or race. To avoid disparate treatment, sensitive\nattributes should not be considered. On the other hand, in order to avoid\ndisparate impact, sensitive attributes must be examined, e.g., in order to\nlearn a fair model, or to check if a given model is fair. We introduce methods\nfrom secure multi-party computation which allow us to avoid both. By encrypting\nsensitive attributes, we show how an outcome-based fair model may be learned,\nchecked, or have its outputs verified and held to account, without users\nrevealing their sensitive attributes.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 17:19:38 GMT"}], "update_date": "2018-09-06", "authors_parsed": [["Kilbertus", "Niki", ""], ["Gascón", "Adrià", ""], ["Kusner", "Matt J.", ""], ["Veale", "Michael", ""], ["Gummadi", "Krishna P.", ""], ["Weller", "Adrian", ""]]}, {"id": "1806.03357", "submitter": "Victor Ardulov", "authors": "Victor Ardulov, Manoj Kumar, Shanna Williams, Thomas Lyon, Shrikanth\n  Narayanan", "title": "Measuring Conversational Productivity in Child Forensic Interviews", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Child Forensic Interviewing (FI) presents a challenge for effective\ninformation retrieval and decision making. The high stakes associated with the\nprocess demand that expert legal interviewers are able to effectively establish\na channel of communication and elicit substantive knowledge from the\nchild-client while minimizing potential for experiencing trauma. As a first\nstep toward computationally modeling and producing quality spoken interviewing\nstrategies and a generalized understanding of interview dynamics, we propose a\nnovel methodology to computationally model effectiveness criteria, by applying\nsummarization and topic modeling techniques to objectively measure and rank the\nresponsiveness and conversational productivity of a child during FI. We score\ninformation retrieval by constructing an agenda to represent general topics of\ninterest and measuring alignment with a given response and leveraging lexical\nentrainment for responsiveness. For comparison, we present our methods along\nwith traditional metrics of evaluation and discuss the use of prior information\nfor generating situational awareness.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jun 2018 21:21:19 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Ardulov", "Victor", ""], ["Kumar", "Manoj", ""], ["Williams", "Shanna", ""], ["Lyon", "Thomas", ""], ["Narayanan", "Shrikanth", ""]]}, {"id": "1806.03615", "submitter": "H{\\aa}kan Jonsson", "authors": "Vedran Sekara, Enys Mones, H{\\aa}kan Jonsson", "title": "Temporal Limits of Privacy in Human Behavior", "comments": null, "journal-ref": "Scientific Reports volume 11, Article number: 3861 (2021)", "doi": "10.1038/s41598-021-82294-1", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large-scale collection of human behavioral data by companies raises serious\nprivacy concerns. We show that behavior captured in the form of application\nusage data collected from smartphones is highly unique even in very large\ndatasets encompassing millions of individuals. This makes behavior-based\nre-identification of users across datasets possible. We study 12 months of data\nfrom 3.5 million users and show that four apps are enough to uniquely\nre-identify 91.2% of users using a simple strategy based on public information.\nFurthermore, we show that there is seasonal variability in uniqueness and that\napplication usage fingerprints drift over time at an average constant rate.\n", "versions": [{"version": "v1", "created": "Sun, 10 Jun 2018 09:17:42 GMT"}], "update_date": "2021-02-24", "authors_parsed": [["Sekara", "Vedran", ""], ["Mones", "Enys", ""], ["Jonsson", "Håkan", ""]]}, {"id": "1806.03627", "submitter": "Sandy Engelhardt", "authors": "Sandy Engelhardt and Raffaele De Simone and Peter M. Full and Matthias\n  Karck and Ivo Wolf", "title": "Improving Surgical Training Phantoms by Hyperrealism: Deep Unpaired\n  Image-to-Image Translation from Real Surgeries", "comments": "8 pages, accepted at MICCAI 2018, supplemental material at\n  https://youtu.be/qugAYpK-Z4M", "journal-ref": null, "doi": "10.1007/978-3-030-00928-1_84", "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Current `dry lab' surgical phantom simulators are a valuable tool for\nsurgeons which allows them to improve their dexterity and skill with surgical\ninstruments. These phantoms mimic the haptic and shape of organs of interest,\nbut lack a realistic visual appearance. In this work, we present an innovative\napplication in which representations learned from real intraoperative\nendoscopic sequences are transferred to a surgical phantom scenario. The term\nhyperrealism is introduced in this field, which we regard as a novel subform of\nsurgical augmented reality for approaches that involve real-time object\ntransfigurations. For related tasks in the computer vision community, unpaired\ncycle-consistent Generative Adversarial Networks (GANs) have shown excellent\nresults on still RGB images. Though, application of this approach to continuous\nvideo frames can result in flickering, which turned out to be especially\nprominent for this application. Therefore, we propose an extension of\ncycle-consistent GANs, named tempCycleGAN, to improve temporal consistency.The\nnovel method is evaluated on captures of a silicone phantom for training\nendoscopic reconstructive mitral valve procedures. Synthesized videos show\nhighly realistic results with regard to 1) replacement of the silicone\nappearance of the phantom valve by intraoperative tissue texture, while 2)\nexplicitly keeping crucial features in the scene, such as instruments, sutures\nand prostheses. Compared to the original CycleGAN approach, tempCycleGAN\nefficiently removes flickering between frames. The overall approach is expected\nto change the future design of surgical training simulators since the generated\nsequences clearly demonstrate the feasibility to enable a considerably more\nrealistic training experience for minimally-invasive procedures.\n", "versions": [{"version": "v1", "created": "Sun, 10 Jun 2018 10:17:21 GMT"}], "update_date": "2019-04-09", "authors_parsed": [["Engelhardt", "Sandy", ""], ["De Simone", "Raffaele", ""], ["Full", "Peter M.", ""], ["Karck", "Matthias", ""], ["Wolf", "Ivo", ""]]}, {"id": "1806.03693", "submitter": "Umar Ruhi", "authors": "Karim Sultan, Umar Ruhi, Rubina Lakhani", "title": "Conceptualizing Blockchains: Characteristics & Applications", "comments": "9 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blockchain technology has recently gained widespread attention by media,\nbusinesses, public sector agencies, and various international organizations,\nand it is being regarded as potentially even more disruptive than the Internet.\nDespite significant interest, there is a dearth of academic literature that\ndescribes key components of blockchains and discusses potential applications.\nThis paper aims to address this gap. This paper presents an overview of\nblockchain technology, identifies the blockchain's key functional\ncharacteristics, builds a formal definition, and offers a discussion and\nclassification of current and emerging blockchain applications.\n", "versions": [{"version": "v1", "created": "Sun, 10 Jun 2018 17:23:42 GMT"}], "update_date": "2018-06-12", "authors_parsed": [["Sultan", "Karim", ""], ["Ruhi", "Umar", ""], ["Lakhani", "Rubina", ""]]}, {"id": "1806.04033", "submitter": "Johannes Haupt", "authors": "Johannes Haupt, Benedict Bender, Benjamin Fabian and Stefan Lessmann", "title": "Robust identification of email tracking: A machine learning approach", "comments": "Accepted publication, In press, European Journal of Operational\n  Research, 2018", "journal-ref": null, "doi": "10.1016/j.ejor.2018.05.018", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Email tracking allows email senders to collect fine-grained behavior and\nlocation data on email recipients, who are uniquely identifiable via their\nemail address. Such tracking invades user privacy in that email tracking\ntechniques gather data without user consent or awareness. Striving to increase\nprivacy in email communication, this paper develops a detection engine to be\nthe core of a selective tracking blocking mechanism in the form of three\ncontributions. First, a large collection of email newsletters is analyzed to\nshow the wide usage of tracking over different countries, industries and time.\nSecond, we propose a set of features geared towards the identification of\ntracking images under real-world conditions. Novel features are devised to be\ncomputationally feasible and efficient, generalizable and resilient towards\nchanges in tracking infrastructure. Third, we test the predictive power of\nthese features in a benchmarking experiment using a selection of state-\nof-the-art classifiers to clarify the effectiveness of model-based tracking\nidentification. We evaluate the expected accuracy of the approach on\nout-of-sample data, over increasing periods of time, and when faced with\nunknown senders.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jun 2018 14:59:24 GMT"}], "update_date": "2018-06-12", "authors_parsed": [["Haupt", "Johannes", ""], ["Bender", "Benedict", ""], ["Fabian", "Benjamin", ""], ["Lessmann", "Stefan", ""]]}, {"id": "1806.04410", "submitter": "Anupam Saraph", "authors": "Anupam Saraph, Lalit Kathpalia, Anab Kidwai, Aniruddha Joshi", "title": "Is India's Unique Identification Number a legally valid identification?", "comments": "21 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR cs.SI", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  A legally valid identification document allows impartial arbitration of the\nidentification of individuals. It protects individuals from a violation of\ntheir dignity, justice, liberty and equality. It protects the nation from a\ndestruction of its republic, democratic, sovereign status. In order to test the\nability of an identification document to establish impartial identification of\nindividuals, it must be evaluated for its ability to establish identity,\nundertake identification and build confidence to impartial, reliable and valid\nidentification. The processes of issuing, using and validating identification\ndocuments alter the ability of the document to establish identity, undertake\nidentification and build confidence to impartial and valid identification.\nThese processes alter the ability of the document to serve as proof of\nidentity, proof of address, proof of being a resident, or even the proof of\nexistence of a person. We examine the ability of the UID number to serve as an\nidentification document with the ability to impartially arbitrate the\nidentification of individuals and serve as proof of identity, address, and\ndemonstrate existence of a person. We evaluate the implications of the\ncontinued use UID system on our ability to undertake legally valid\nidentification ensure integrity of the identity and address databases across\nthe world.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 09:30:33 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Saraph", "Anupam", ""], ["Kathpalia", "Lalit", ""], ["Kidwai", "Anab", ""], ["Joshi", "Aniruddha", ""]]}, {"id": "1806.04467", "submitter": "Loic Baron", "authors": "Lo\\\"ic Baron (NPA, CNRS), Radomir Klacza (UPMC, NPA), Pauline\n  Gaudet-Chardonnet (NPA, UPMC), Amira Bradai (UPMC, NPA), Ciro Scognamiglio\n  (UPMC, NPA), Serge Fdida (NPA, LINCS)", "title": "Next generation portal for federated testbeds MySlice v2: from prototype\n  to production", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CY cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A number of projects in computer science around the world have contributed to\nbuild federated experimental facilities providing access to a large set of\ndistributed compute, storage and network resources for the research community.\nSeveral tools have been developed to provide users an easy access to the\nfederated testbeds. This paper presents the architecture of the new version of\nthe MySlice web portal, that has evolved from a prototype to a production ready\nsoftware.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 12:39:00 GMT"}], "update_date": "2018-06-16", "authors_parsed": [["Baron", "Loïc", "", "NPA, CNRS"], ["Klacza", "Radomir", "", "UPMC, NPA"], ["Gaudet-Chardonnet", "Pauline", "", "NPA, UPMC"], ["Bradai", "Amira", "", "UPMC, NPA"], ["Scognamiglio", "Ciro", "", "UPMC, NPA"], ["Fdida", "Serge", "", "NPA, LINCS"]]}, {"id": "1806.04497", "submitter": "Frank Glavin", "authors": "David L. Smyth, James Fennell, Sai Abinesh, Nazli B. Karimi, Frank G.\n  Glavin, Ihsan Ullah, Brett Drury, Michael G. Madden", "title": "A Virtual Environment with Multi-Robot Navigation, Analytics, and\n  Decision Support for Critical Incident Investigation", "comments": "27th International Joint Conference on Artificial Intelligence\n  (IJCAI), Stockholm, Sweden", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Accidents and attacks that involve chemical, biological, radiological/nuclear\nor explosive (CBRNE) substances are rare, but can be of high consequence. Since\nthe investigation of such events is not anybody's routine work, a range of AI\ntechniques can reduce investigators' cognitive load and support\ndecision-making, including: planning the assessment of the scene; ongoing\nevaluation and updating of risks; control of autonomous vehicles for collecting\nimages and sensor data; reviewing images/videos for items of interest;\nidentification of anomalies; and retrieval of relevant documentation. Because\nof the rare and high-risk nature of these events, realistic simulations can\nsupport the development and evaluation of AI-based tools. We have developed\nrealistic models of CBRNE scenarios and implemented an initial set of tools.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 13:26:56 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Smyth", "David L.", ""], ["Fennell", "James", ""], ["Abinesh", "Sai", ""], ["Karimi", "Nazli B.", ""], ["Glavin", "Frank G.", ""], ["Ullah", "Ihsan", ""], ["Drury", "Brett", ""], ["Madden", "Michael G.", ""]]}, {"id": "1806.04724", "submitter": "Adnan Mahmood", "authors": "Adnan Mahmood, Bernard Butler and Brendan Jennings", "title": "Potential of Augmented Reality for Intelligent Transportation Systems", "comments": "In: Lee N. (eds) Encyclopedia of Computer Graphics and Games.\n  Springer, Cham, 2018", "journal-ref": null, "doi": "10.1007/978-3-319-08234-9_274-1", "report-no": null, "categories": "cs.HC cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Rapid advances in wireless communication technologies coupled with ongoing\nmassive development in vehicular networking standards and innovations in\ncomputing, sensing, and analytics have paved the way for intelligent\ntransportation systems (ITS) to develop rapidly in the near future. ITS\nprovides a complete solution for the efficient and intelligent management of\nreal-time traffic, wherein sensory data is collected from within the vehicles\n(i.e., via their onboard units) as well as data exchanged between the vehicles,\nbetween the vehicles and their supporting roadside infrastructure/network,\namong the vehicles and vulnerable pedestrians, subsequently paving the way for\nthe realization of the futuristic Internet of Vehicles. The traditional intent\nof an ITS system is to detect, monitor, control, and subsequently reduce\ntraffic congestion based on a real-time analysis of the data pertinent to\ncertain patterns of the road traffic, including traffic density at a\ngeographical area of interest, precise velocity of vehicles, current and\npredicted travelling trajectories and times, etc. However, merely relying on an\nITS framework is not an optimal solution. In case of dense traffic\nenvironments, where communication broadcasts from hundreds of thousands of\nvehicles could potentially choke the entire network (and so could lead to fatal\naccidents in the case of autonomous vehicles that depend on reliable\ncommunications for their operational safety), a fall back to the traditional\ndecentralized vehicular ad hoc network (VANET) approach becomes necessary. It\nis therefore of critical importance to enhance the situational awareness of\nvehicular drivers so as to enable them to make quick but well-founded manual\ndecisions in such safety-critical situations.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jun 2018 03:52:07 GMT"}], "update_date": "2018-06-14", "authors_parsed": [["Mahmood", "Adnan", ""], ["Butler", "Bernard", ""], ["Jennings", "Brendan", ""]]}, {"id": "1806.04796", "submitter": "Peng Hu", "authors": "Peng Hu", "title": "A Holistic Framework for Open Low-Power Internet of Things Technology\n  Ecosystems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The low-power Internet of Things (IoT) has been thriving because of the\nrecent technological advancement and ecosystems meeting the vertical\napplication requirements and market needs. An open IoT technology ecosystem of\nthe low-power IoT has become increasingly important to all the players and\nstakeholders and to the research community. However, there are several\nmainstream low-power IoT ecosystems available out of industry consortia or\nresearch projects and there are different models implied in them. We need to\nidentify the working framework behind the scene and find out the principle of\ndriving the future trends in the industry and research community. With a close\nlook at these IoT technology ecosystems, four major business models are\nidentified that can lead to the proposed ecosystem framework. The framework\nconsiders the technical building blocks, market needs, and business vertical\nsegments, where these parts are making the IoT evolve as a whole for the years\nto come.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 23:22:54 GMT"}], "update_date": "2018-06-14", "authors_parsed": [["Hu", "Peng", ""]]}, {"id": "1806.05208", "submitter": "Joshua Gardner", "authors": "Josh Gardner, Yuming Yang, Ryan Baker, Christopher Brooks", "title": "Enabling End-To-End Machine Learning Replicability: A Case Study in\n  Educational Data Mining", "comments": "arXiv admin note: text overlap with arXiv:1801.05236", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of machine learning techniques has expanded in education research,\ndriven by the rich data from digital learning environments and institutional\ndata warehouses. However, replication of machine learned models in the domain\nof the learning sciences is particularly challenging due to a confluence of\nexperimental, methodological, and data barriers. We discuss the challenges of\nend-to-end machine learning replication in this context, and present an\nopen-source software toolkit, the MOOC Replication Framework (MORF), to address\nthem. We demonstrate the use of MORF by conducting a replication at scale, and\nprovide a complete executable container, with unique DOIs documenting the\nconfigurations of each individual trial, for replication or future extension at\nhttps://github.com/educational-technology-collective/fy2015-replication. This\nwork demonstrates an approach to end-to-end machine learning replication which\nis relevant to any domain with large, complex or multi-format,\nprivacy-protected data with a consistent schema.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2018 18:27:32 GMT"}, {"version": "v2", "created": "Tue, 10 Jul 2018 20:57:22 GMT"}], "update_date": "2018-08-23", "authors_parsed": [["Gardner", "Josh", ""], ["Yang", "Yuming", ""], ["Baker", "Ryan", ""], ["Brooks", "Christopher", ""]]}, {"id": "1806.05426", "submitter": "Lynsay Shepherd", "authors": "Lynsay A. Shepherd, Karen Renaud", "title": "How to design browser security and privacy alerts", "comments": "Symposium on Digital Behaviour Intervention for Cyber Security, AISB\n  2018 Convention", "journal-ref": "AISB 2018: Symposium on Digital Behaviour Intervention for Cyber\n  Security (pp. 21-28). Society for the Study of Artificial Intelligence and\n  Simulation for Behaviour (AISB)", "doi": null, "report-no": null, "categories": "cs.HC cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is important to design browser security and privacy alerts so as to\nmaximise their value to the end user, and their efficacy in terms of\ncommunicating risk. We derived a list of design guidelines from the research\nliterature by carrying out a systematic review. We analysed the papers both\nquantitatively and qualitatively to arrive at a comprehensive set of\nguidelines. Our findings aim to to provide designers and developers with\nguidance as to how to construct privacy and security alerts. We conclude by\nproviding an alert template,highlighting its adherence to the derived\nguidelines.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2018 09:18:42 GMT"}], "update_date": "2018-06-15", "authors_parsed": [["Shepherd", "Lynsay A.", ""], ["Renaud", "Karen", ""]]}, {"id": "1806.05520", "submitter": "Chengsheng Mao", "authors": "Chengsheng Mao, Yuan Zhao, Mengxin Sun, Yuan Luo", "title": "Are My EHRs Private Enough? -Event-level Privacy Protection", "comments": "accepted by TCBB", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Privacy is a major concern in sharing human subject data to researchers for\nsecondary analyses. A simple binary consent (opt-in or not) may significantly\nreduce the amount of sharable data, since many patients might only be concerned\nabout a few sensitive medical conditions rather than the entire medical\nrecords. We propose event-level privacy protection, and develop a feature\nablation method to protect event-level privacy in electronic medical records.\nUsing a list of 13 sensitive diagnoses, we evaluate the feasibility and the\nefficacy of the proposed method. As feature ablation progresses, the\nidentifiability of a sensitive medical condition decreases with varying speeds\non different diseases. We find that these sensitive diagnoses can be divided\ninto 3 categories: (1) 5 diseases have fast declining identifiability (AUC\nbelow 0.6 with less than 400 features excluded); (2) 7 diseases with\nprogressively declining identifiability (AUC below 0.7 with between 200 and 700\nfeatures excluded); and (3) 1 disease with slowly declining identifiability\n(AUC above 0.7 with 1000 features excluded). The fact that the majority (12 out\nof 13) of the sensitive diseases fall into the first two categories suggests\nthe potential of the proposed feature ablation method as a solution for\nevent-level record privacy protection.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jun 2018 18:48:14 GMT"}], "update_date": "2018-06-15", "authors_parsed": [["Mao", "Chengsheng", ""], ["Zhao", "Yuan", ""], ["Sun", "Mengxin", ""], ["Luo", "Yuan", ""]]}, {"id": "1806.05521", "submitter": "Jisun An", "authors": "Jisun An, Haewoon Kwak, Yong-Yeol Ahn", "title": "SemAxis: A Lightweight Framework to Characterize Domain-Specific Word\n  Semantics Beyond Sentiment", "comments": "Accepted in ACL 2018 as a full paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Because word semantics can substantially change across communities and\ncontexts, capturing domain-specific word semantics is an important challenge.\nHere, we propose SEMAXIS, a simple yet powerful framework to characterize word\nsemantics using many semantic axes in word- vector spaces beyond sentiment. We\ndemonstrate that SEMAXIS can capture nuanced semantic representations in\nmultiple online communities. We also show that, when the sentiment axis is\nexamined, SEMAXIS outperforms the state-of-the-art approaches in building\ndomain-specific sentiment lexicons.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2018 13:11:36 GMT"}], "update_date": "2018-06-15", "authors_parsed": [["An", "Jisun", ""], ["Kwak", "Haewoon", ""], ["Ahn", "Yong-Yeol", ""]]}, {"id": "1806.05583", "submitter": "Yang Zhang", "authors": "Yang Zhang, Zehui Xiong, Dusit Niyato, Ping Wang, and Zhu Han", "title": "Market-Oriented Information Trading in Internet of Things (IoT) for\n  Smart Cities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet of Things (IoT) technology is a fundamental infrastructure for\ninformation transmission and integration in smart city implementations to\nachieve effective fine-grained city management, efficient operations, and\nimproved life quality of citizens. Smart-city IoT systems usually involve high\nvolume and variety of information circulation. The information lifecycle also\ninvolves many parties, stakeholders, and entities such as individuals,\nbusinesses, and government agencies with their own objectives which needed to\nbe incentivized properly. As such, recent studies have modeled smart-city IoT\nsystems as a market, where information is treated as a commodity by market\nparticipants. In this work, we first present a general information-centric\nsystem architecture to analyze smart-city IoT systems. We then discuss features\nof market-oriented approaches in IoT, including market incentive, IoT service\npattern, information freshness, and social impacts. System design chanlenges\nand related work are also reviewed. Finally, we optimize information trading in\nsmart-city IoT systems, considering direct and indirect network externalities\nin a social domain.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2018 14:39:56 GMT"}], "update_date": "2018-06-15", "authors_parsed": [["Zhang", "Yang", ""], ["Xiong", "Zehui", ""], ["Niyato", "Dusit", ""], ["Wang", "Ping", ""], ["Han", "Zhu", ""]]}, {"id": "1806.05740", "submitter": "Rediet Abebe", "authors": "Rediet Abebe, Shawndra Hill, Jennifer Wortman Vaughan, Peter M. Small,\n  H. Andrew Schwartz", "title": "Using Search Queries to Understand Health Information Needs in Africa", "comments": "Extended version of an ICWSM 2019 paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI cs.CL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The lack of comprehensive, high-quality health data in developing nations\ncreates a roadblock for combating the impacts of disease. One key challenge is\nunderstanding the health information needs of people in these nations. Without\nunderstanding people's everyday needs, concerns, and misconceptions, health\norganizations and policymakers lack the ability to effectively target education\nand programming efforts. In this paper, we propose a bottom-up approach that\nuses search data from individuals to uncover and gain insight into health\ninformation needs in Africa. We analyze Bing searches related to HIV/AIDS,\nmalaria, and tuberculosis from all 54 African nations. For each disease, we\nautomatically derive a set of common search themes or topics, revealing a\nwide-spread interest in various types of information, including disease\nsymptoms, drugs, concerns about breastfeeding, as well as stigma, beliefs in\nnatural cures, and other topics that may be hard to uncover through traditional\nsurveys. We expose the different patterns that emerge in health information\nneeds by demographic groups (age and sex) and country. We also uncover\ndiscrepancies in the quality of content returned by search engines to users by\ntopic. Combined, our results suggest that search data can help illuminate\nhealth information needs in Africa and inform discussions on health policy and\ntargeted education efforts both on- and offline.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2018 20:48:41 GMT"}, {"version": "v2", "created": "Wed, 17 Apr 2019 17:49:06 GMT"}], "update_date": "2019-04-18", "authors_parsed": [["Abebe", "Rediet", ""], ["Hill", "Shawndra", ""], ["Vaughan", "Jennifer Wortman", ""], ["Small", "Peter M.", ""], ["Schwartz", "H. Andrew", ""]]}, {"id": "1806.05855", "submitter": "Alejandro Vera-Baquero", "authors": "Alejandro Vera-Baquero and Ricardo Colomo-Palacios", "title": "A Big-Data based and process-oriented decision support system for\n  traffic management", "comments": null, "journal-ref": "EAI Endorsed Transactions on Scalable Information Systems (2018)\n  18(17): e5", "doi": "10.4108/eai.29-5-2018.154810", "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Data analysis and monitoring of road networks in terms of reliability and\nperformance are valuable but hard to achieve, especially when the analytical\ninformation has to be available to decision makers on time. The gathering and\nanalysis of the observable facts can be used to infer knowledge about traffic\ncongestion over time and gain insights into the roads safety. However, the\ncontinuous monitoring of live traffic information produces a vast amount of\ndata that makes it difficult for business intelligence (BI) tools to generate\nmetrics and key performance indicators (KPI) in nearly real-time. In order to\novercome these limitations, we propose the application of a big-data based and\nprocess-centric approach that integrates with operational traffic information\nsystems to give insights into the road network's efficiency. This paper\ndemonstrates how the adoption of an existent process-oriented DSS solution with\nbig-data support can be leveraged to monitor and analyse live traffic data on\nan acceptable response time basis.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jun 2018 08:36:32 GMT"}], "update_date": "2018-06-18", "authors_parsed": [["Vera-Baquero", "Alejandro", ""], ["Colomo-Palacios", "Ricardo", ""]]}, {"id": "1806.06055", "submitter": "Huang Lingxiao", "authors": "L. Elisa Celis, Lingxiao Huang, Vijay Keswani, Nisheeth K. Vishnoi", "title": "Classification with Fairness Constraints: A Meta-Algorithm with Provable\n  Guarantees", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AI cs.CY cs.DS stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Developing classification algorithms that are fair with respect to sensitive\nattributes of the data has become an important problem due to the growing\ndeployment of classification algorithms in various social contexts. Several\nrecent works have focused on fairness with respect to a specific metric,\nmodeled the corresponding fair classification problem as a constrained\noptimization problem, and developed tailored algorithms to solve them. Despite\nthis, there still remain important metrics for which we do not have fair\nclassifiers and many of the aforementioned algorithms do not come with\ntheoretical guarantees; perhaps because the resulting optimization problem is\nnon-convex. The main contribution of this paper is a new meta-algorithm for\nclassification that takes as input a large class of fairness constraints, with\nrespect to multiple non-disjoint sensitive attributes, and which comes with\nprovable guarantees. This is achieved by first developing a meta-algorithm for\na large family of classification problems with convex constraints, and then\nshowing that classification problems with general types of fairness constraints\ncan be reduced to those in this family. We present empirical results that show\nthat our algorithm can achieve near-perfect fairness with respect to various\nfairness metrics, and that the loss in accuracy due to the imposed fairness\nconstraints is often small. Overall, this work unifies several prior works on\nfair classification, presents a practical algorithm with theoretical\nguarantees, and can handle fairness metrics that were previously not possible.\n", "versions": [{"version": "v1", "created": "Fri, 15 Jun 2018 17:45:58 GMT"}, {"version": "v2", "created": "Thu, 2 Aug 2018 17:53:43 GMT"}, {"version": "v3", "created": "Wed, 15 Apr 2020 06:08:21 GMT"}], "update_date": "2020-04-16", "authors_parsed": [["Celis", "L. Elisa", ""], ["Huang", "Lingxiao", ""], ["Keswani", "Vijay", ""], ["Vishnoi", "Nisheeth K.", ""]]}, {"id": "1806.06169", "submitter": "Chuka Oham", "authors": "Chuka Oham, Raja Jurdak, Salil S. Kanhere, Ali Dorri and Sanjay Jha", "title": "B-FICA: BlockChain based Framework for Auto-insurance Claim and\n  Adjudication", "comments": "10 Pages, 3 Figures and accepted for publication at the IEEE 2018\n  International Conference on BlockChain", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a partitioned BlockChain based Framework for\nAuto-insurance Claims and Adjudication (B-FICA) for CAVs that tracks both\nsensor data and entity interactions with two-sided verification. B-FICA uses\npermissioned BC with two partitions to share information on a need to know\nbasis. It also uses multi-signed transactions for proof of execution of\ninstructions, for reliability and auditability and also uses a dynamic\nlightweight consensus and validation protocol to prevent evidence alteration.\nQualitative evaluation shows that B-FICA is resilient to several security\nattacks from potential liable entities. Finally, simulations show that compared\nto the state of the art, B-FICA reduces processing time and its delay overhead\nis negligible for practical scenarios and at marginal security cost.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 01:45:10 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Oham", "Chuka", ""], ["Jurdak", "Raja", ""], ["Kanhere", "Salil S.", ""], ["Dorri", "Ali", ""], ["Jha", "Sanjay", ""]]}, {"id": "1806.06518", "submitter": "Devashish Gosain", "authors": "Devashish Gosain, Anshika Agarwal, Sahil Shekhawat, H. B. Acharya, and\n  S. Chakravarty", "title": "Mending Wall: On the Implementation of Censorship in India", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a study of the Internet infrastructure in India from the\npoint of view of censorship. First, we show that the current state of\naffairs---where each ISP implements its own content filters (nominally as per a\ngovernmental blacklist)---results in dramatic differences in the censorship\nexperienced by customers. In practice, a well-informed Indian citizen can\nescape censorship through a judicious choice of service provider. We then\nconsider the question of whether India might potentially follow the Chinese\nmodel and institute a single, government-controlled filter. This would not be\ndifficult, as the Indian Internet is quite centralized already. A few \"key\"\nASes (approx 1% of Indian ASes) collectively intercept approx 95% of paths to\nthe censored sites we sample in our study, and also to all publicly-visible DNS\nservers. 5,000 routers spanning these key ASes would suffice to carry out IP or\nDNS filtering for the entire country; approx 70% of these routers belong to\nonly two private ISPs. If the government is willing to employ more powerful\nmeasures, such as an IP Prefix Hijacking attack, any one of several key ASes\ncan censor traffic for nearly all Indian users. Finally, we demonstrate that\nsuch federated censorship by India would cause substantial collateral damage to\nnon-Indian ASes whose traffic passes through Indian cyberspace (which do not\nlegally come under Indian jurisdiction at all).\n", "versions": [{"version": "v1", "created": "Mon, 18 Jun 2018 07:04:55 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Gosain", "Devashish", ""], ["Agarwal", "Anshika", ""], ["Shekhawat", "Sahil", ""], ["Acharya", "H. B.", ""], ["Chakravarty", "S.", ""]]}, {"id": "1806.06654", "submitter": "Amir Ban", "authors": "Amir Ban, Yishay Mansour", "title": "Are All Experts Equally Good? A Study of Analyst Earnings Estimates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate whether experts possess differential expertise when making\npredictions. We note that this would make it possible to aggregate multiple\npredictions into a result that is more accurate than their consensus average,\nand that the improvement prospects grow with the amount of differentiation.\nTurning this argument on its head, we show how differentiation can be measured\nby how much weighted aggregation improves on simple averaging. Taking\nstock-market analysts as experts in their domain, we do a retrospective study\nusing historical quarterly earnings forecasts and actual results for large\npublicly traded companies. We use it to shed new light on the Sinha et al.\n(1997) result, showing that analysts indeed possess individual expertise, but\nthat their differentiation is modest. On the other hand, they have significant\nindividual bias. Together, these enable a 20%-30% accuracy improvement over\nconsensus average.\n", "versions": [{"version": "v1", "created": "Sun, 13 May 2018 09:08:47 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Ban", "Amir", ""], ["Mansour", "Yishay", ""]]}, {"id": "1806.06664", "submitter": "Grigorios Kalogiannis Mr", "authors": "Konstantinos Manousaridis, Apostolos Mavridis, Konstantinos\n  Anagnostopoulos, Gregory Kalogiannis", "title": "Introducing an innovative robot-based mobile platform for programming\n  learning", "comments": "6 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The present study introduces an Android based application that focuses on\npromoting students' learning experience when interacting with Lego Mindstorms\nRobotic Kit NXT. A thorough investigation of the current literature reveals\nthat there are numerous applications attempting to overcome the limitations of\nLego platform which, however, appear to only partially succeed in significantly\nimproving children's engagement in fruitful learning. Their main limitations\nare that they either function on an elemental level or suffer from a general\nlack of creating effectively room for children to test their abilities and\nother curiosities. Aiming at confronting these limitations, the proposed\nandroid application, which is referred to as MyNXT, was created and presented.\nMyNXT offers direct access control along with the choice to program using\nsimple linear logic through an easy and a user friendly environment with built\nin instructions for all ages. Concluding, the proposed application constitutes\na stepping to an educating platform, which can facilitate the learning needs of\nchildren in contemporary times.\n", "versions": [{"version": "v1", "created": "Wed, 23 May 2018 14:23:30 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Manousaridis", "Konstantinos", ""], ["Mavridis", "Apostolos", ""], ["Anagnostopoulos", "Konstantinos", ""], ["Kalogiannis", "Gregory", ""]]}, {"id": "1806.06681", "submitter": "V\\'ictor Mayoral Vilches", "authors": "Laura Alzola Kirschgens, Irati Zamalloa Ugarte, Endika Gil Uriarte,\n  Aday Mu\\~niz Rosas and V\\'ictor Mayoral Vilches", "title": "Robot hazards: from safety to security", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Robotics landscape is experiencing big changes. Robots are spreading and will\nsoon be everywhere. Systems traditionally employed in industry are being\nreplaced by collaborative robots, while more and more professional and consumer\nrobots are introduced in people's daily activities. Robots are increasingly\nintertwined with other facets of IT and envisioned to get much more autonomy,\ninteracting physically with humans. We claim that, following Personal Computers\n(PCs) and smartphones, robots are the next technological revolution and yet,\nrobot security is being ignored by manufacturers. The present paper aims to\nalert about the need of dealing not only with safety but with robot security\nfrom the very beginning of the forthcoming technological era. We provide herein\na document that reviews robot hazards and analyzes the consequences of not\nfacing these issues. We advocate strongly for a security-first approach as a\nmust to be implemented now.\n", "versions": [{"version": "v1", "created": "Mon, 11 Jun 2018 15:15:06 GMT"}, {"version": "v2", "created": "Thu, 12 Sep 2019 11:28:56 GMT"}, {"version": "v3", "created": "Sat, 21 Sep 2019 06:47:05 GMT"}], "update_date": "2019-09-24", "authors_parsed": [["Kirschgens", "Laura Alzola", ""], ["Ugarte", "Irati Zamalloa", ""], ["Uriarte", "Endika Gil", ""], ["Rosas", "Aday Muñiz", ""], ["Vilches", "Víctor Mayoral", ""]]}, {"id": "1806.06684", "submitter": "Kamal Karkonasasi", "authors": "Oh Tai Lan, Ahmad Suhaimi Baharudin, Kamal Karkonasasi", "title": "VTracker: Impact of User Factors On Users' Intention to Adopt Dietary\n  Intake Monitoring System with Auto Workout Tracker", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nowadays, Malaysian are so concerned about their body health. In respond to\nthis, this study proposed a conceptual prototype called vTracker to assist its\nusers to have a healthier body. vTracker is a web-based mobile application\nwhich helps users to self-monitor their dietary intakes and workout activities\nin a few simple steps. A research framework has been proposed using the Unified\nTheory of Acceptance and Use of Technology (UTAUT) model to understand the\nlevel of users' intention to adopt vTracker in Malaysia. Data was collected\nfrom 206 respondents in Malaysia using survey method. Based on the result of\nthe analysis, it was found that respondents agree to subscribe to the system.\nIt addition to that, it was found that the three factors have a positive impact\non users' intention to adopt vTracker. These mentioned factors are performance\neffort expectancy (PEE), social influence (SI) and facilitating condition (FC).\nThese significant factors are used for designing vTracker portal.\n", "versions": [{"version": "v1", "created": "Wed, 13 Jun 2018 16:57:26 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Lan", "Oh Tai", ""], ["Baharudin", "Ahmad Suhaimi", ""], ["Karkonasasi", "Kamal", ""]]}, {"id": "1806.06689", "submitter": "Vidhu Mitha", "authors": "Vidhu Mitha", "title": "A Tour Of The Student's E-Learning Puddle", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  E-learning has revolutionized our realm in more than just a listable number\nof ways. But it took a paradigm shift when it entered the threshold of the\nvarsity system. With the prevailing spoon-feeding era, are the students really\nindustry ready? We answer that by confirming a fact: web-based learning has\nbecome the oxygen of freshers in the IT Industry instead of the traditional\nlearning done through graduation. Furthermore, are university enforced\ne-learning assessment systems a true representation of a student's proficiency?\nThis paper is a peep into what web-based e-learning systems are to a student of\ntoday's world, by giving an overview of university-level e-learning in India\ndeploying an example from SRM University's organizational framework. It\nassesses a key e-learning trend, the implementation of which bridges the gap\nbetween universities and the industry. It is proposed to provide constructive\nfeedback to the e-learning community and shine some light on areas of scope for\nfuture developments.\n", "versions": [{"version": "v1", "created": "Thu, 14 Jun 2018 05:48:33 GMT"}], "update_date": "2018-06-19", "authors_parsed": [["Mitha", "Vidhu", ""]]}, {"id": "1806.06947", "submitter": "JongRoul Woo", "authors": "JongRoul Woo, Christopher L. Magee", "title": "Forecasting the value of battery electric vehicles compared to internal\n  combustion engine vehicles: the influence of driving range and battery\n  technology", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CY q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Battery electric vehicles (BEVs) are now clearly a promising candidate in\naddressing the environmental problems associated with conventional internal\ncombustion engine vehicles (ICEVs). However, BEVs, unlike ICEVs, are still not\nwidely accepted in the automobile market but continuing technological change\ncould overcome this barrier. The aim of this study is to assess and forecast\nwhether and when design changes and technological improvements related to major\nchallenges in driving range and battery cost will make the user value of BEVs\ngreater than the user value of ICEVs. Specifically, we estimate the relative\nuser value of BEVs and ICEVs resulting after design modifications to achieve\ndifferent driving ranges by considering the engineering trade-offs based on a\nvehicle simulation. Then, we analyze when the relative user value of BEVs is\nexpected to exceed ICEVs as the energy density and cost of batteries improve\nbecause of ongoing technological change. Our analysis demonstrates that the\nrelative value of BEVs is lower than that of ICEVs because BEVs have high\nbattery cost and high cost of time spent recharging despite high torque, high\nfuel efficiency, and low fuel cost. Moreover, we found the relative value\ndifferences between BEVs and ICEVs are found to be less in high performance\nlarge cars than in low performance compact cars because BEVs can achieve high\nacceleration performance more easily than ICEVs. In addition, this study\npredicts that in approximately 2050, high performance large BEVs could have\nhigher relative value than high performance large ICEVs because of\ntechnological improvements in batteries; however low performance compact BEVs\nare still very likely to have significantly lower user value than comparable\nICEVs until well beyond 2050.\n", "versions": [{"version": "v1", "created": "Thu, 31 May 2018 04:41:52 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Woo", "JongRoul", ""], ["Magee", "Christopher L.", ""]]}, {"id": "1806.06967", "submitter": "Marco De Nadai", "authors": "Marco Mamei, Francesca Pancotto, Marco De Nadai, Bruno Lepri, Michele\n  Vescovi, Franco Zambonelli, Alex Pentland", "title": "Is social capital associated with synchronization in human\n  communication? An analysis of Italian call records and measures of civic\n  engagement", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social capital has been studied in economics, sociology and political science\nas one of the key elements that promote the development of modern societies. It\ncan be defined as the source of capital that facilitates cooperation through\nshared social norms. In this work, we investigate whether and to what extent\nsynchronization aspects of mobile communication patterns are associated with\nsocial capital metrics. Interestingly, our results show that our\nsynchronization-based approach well correlates with existing social capital\nmetrics (i.e., Referendum turnout, Blood donations, and Association density),\nbeing also able to characterize the different role played by high\nsynchronization within a close proximity-based community and high\nsynchronization among different communities. Hence, the proposed approach can\nprovide timely, effective analysis at a limited cost over a large territory.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jun 2018 22:10:50 GMT"}, {"version": "v2", "created": "Fri, 22 Jun 2018 21:15:12 GMT"}, {"version": "v3", "created": "Fri, 6 Jul 2018 08:38:16 GMT"}], "update_date": "2018-07-09", "authors_parsed": [["Mamei", "Marco", ""], ["Pancotto", "Francesca", ""], ["De Nadai", "Marco", ""], ["Lepri", "Bruno", ""], ["Vescovi", "Michele", ""], ["Zambonelli", "Franco", ""], ["Pentland", "Alex", ""]]}, {"id": "1806.07080", "submitter": "He Jiang", "authors": "He Jiang, Dong Liu, Zhilei Ren, and Tao Zhang", "title": "Blockchain in the Eyes of Developers", "comments": "10 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The popularity of blockchain technology continues to grow rapidly in both\nindustrial and academic fields. Most studies of blockchain focus on the\nimprovements of security, usability, or efficiency of blockchain protocols, or\nthe applications of blockchain in finance, Internet of Things, or public\nservices. However, few of them could reveal the concerns of front-line\ndevelopers and the situations of blockchain in practice. In this article, we\ninvestigate how developers use and discuss blockchain with a case study of\nStack Overflow posts. We find blockchain is a relatively new topic in Stack\nOverflow but it is rising to popularity. We detect 13 types of questions that\ndevelopers post in Stack Overflow and identify 45 blockchain relevant entities\n(e.g., frameworks, libraries, or tools) for building blockchain applications.\nThese findings may help blockchain project communities to know where to improve\nand help novices to know where to start.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 07:39:47 GMT"}], "update_date": "2018-06-20", "authors_parsed": [["Jiang", "He", ""], ["Liu", "Dong", ""], ["Ren", "Zhilei", ""], ["Zhang", "Tao", ""]]}, {"id": "1806.07158", "submitter": "Luca Vassio Mr.", "authors": "Luca Vassio, Idilio Drago, Marco Mellia, Zied Ben Houidi, Mohamed\n  Lamine Lamali", "title": "You, the Web and Your Device: Longitudinal Characterization of Browsing\n  Habits", "comments": "30 pages. ACM Transactions on the Web. 12, 4, Article 24 (November\n  2018), 30 pages", "journal-ref": "ACM Trans. Web 12, 4, Article 24 (November 2018), 30 pages", "doi": "10.1145/3231466", "report-no": null, "categories": "cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding how people interact with the web is key for a variety of\napplications, e.g., from the design of effective web pages to the definition of\nsuccessful online marketing campaigns. Browsing behavior has been traditionally\nrepresented and studied by means of clickstreams, i.e., graphs whose vertices\nare web pages, and edges are the paths followed by users. Obtaining large and\nrepresentative data to extract clickstreams is however challenging. The\nevolution of the web questions whether browsing behavior is changing and, by\nconsequence, whether properties of clickstreams are changing. This paper\npresents a longitudinal study of clickstreams in from 2013 to 2016. We evaluate\nan anonymized dataset of HTTP traces captured in a large ISP, where thousands\nof households are connected. We first propose a methodology to identify actual\nURLs requested by users from the massive set of requests automatically fired by\nbrowsers when rendering web pages. Then, we characterize web usage patterns and\nclickstreams, taking into account both the temporal evolution and the impact of\nthe device used to explore the web. Our analyses precisely quantify various\naspects of clickstreams and uncover interesting patterns, such as the typical\nshort paths followed by people while navigating the web, the fast increasing\ntrend in browsing from mobile devices and the different roles of search engines\nand social networks in promoting content. Finally, we contribute a dataset of\nanonymized clickstreams to the community to foster new studies (anonymized\nclickstreams are available to the public at\nhttp://bigdata.polito.it/clickstream).\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 11:25:32 GMT"}, {"version": "v2", "created": "Tue, 4 May 2021 10:37:04 GMT"}], "update_date": "2021-05-05", "authors_parsed": [["Vassio", "Luca", ""], ["Drago", "Idilio", ""], ["Mellia", "Marco", ""], ["Houidi", "Zied Ben", ""], ["Lamali", "Mohamed Lamine", ""]]}, {"id": "1806.07385", "submitter": "Nils Strodthoff", "authors": "Nils Strodthoff and Claas Strodthoff", "title": "Detecting and interpreting myocardial infarction using fully\n  convolutional neural networks", "comments": "11 pages, 4 figures", "journal-ref": "Physiological Measurement, vol. 40, no. 1, p. 015001, 2019", "doi": "10.1088/1361-6579/aaf34d", "report-no": null, "categories": "cs.CY cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objective: We aim to provide an algorithm for the detection of myocardial\ninfarction that operates directly on ECG data without any preprocessing and to\ninvestigate its decision criteria. Approach: We train an ensemble of fully\nconvolutional neural networks on the PTB ECG dataset and apply state-of-the-art\nattribution methods. Main results: Our classifier reaches 93.3% sensitivity and\n89.7% specificity evaluated using 10-fold cross-validation with sampling based\non patients. The presented method outperforms state-of-the-art approaches and\nreaches the performance level of human cardiologists for detection of\nmyocardial infarction. We are able to discriminate channel-specific regions\nthat contribute most significantly to the neural network's decision.\nInterestingly, the network's decision is influenced by signs also recognized by\nhuman cardiologists as indicative of myocardial infarction. Significance: Our\nresults demonstrate the high prospects of algorithmic ECG analysis for future\nclinical applications considering both its quantitative performance as well as\nthe possibility of assessing decision criteria on a per-example basis, which\nenhances the comprehensibility of the approach.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jun 2018 19:00:44 GMT"}, {"version": "v2", "created": "Tue, 5 Feb 2019 13:28:55 GMT"}], "update_date": "2019-02-06", "authors_parsed": [["Strodthoff", "Nils", ""], ["Strodthoff", "Claas", ""]]}, {"id": "1806.07461", "submitter": "Khanh Hung Hoang", "authors": "Khanh-Hung Hoang and Tu-Bao Ho", "title": "Learning Treatment Regimens from Electronic Medical Records", "comments": "This is a post-peer-review, pre-copyedit version of an article\n  published in PAKDD 2018's proceeding", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Appropriate treatment regimens play a vital role in improving patient health\nstatus. Although some achievements have been made, few of the recent studies of\nlearning treatment regimens have exploited different kinds of patient\ninformation due to the difficulty in adopting heterogeneous data to many data\nmining methods. Moreover, current studies seem too rigid with fixed intervals\nof treatment periods corresponding to the varying lengths of hospital stay. To\nthis end, this work proposes a generic data-driven framework which can derive\ngroup-treatment regimens from electronic medical records by utilizing a\nmixed-variate restricted Boltzmann machine and incorporating medical domain\nknowledge. We conducted experiments on coronary artery disease as a case study.\nThe obtained results show that the framework is promising and capable of\nassisting physicians in making clinical decisions.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jun 2018 22:59:29 GMT"}], "update_date": "2018-06-21", "authors_parsed": [["Hoang", "Khanh-Hung", ""], ["Ho", "Tu-Bao", ""]]}, {"id": "1806.07530", "submitter": "Raj Gaire", "authors": "Raj Gaire, Chigulapalli Sriharsha, Deepak Puthal, Hendra Wijaya,\n  Jongkil Kim, Prateeksha Keshari, Rajiv Ranjan, Rajkumar Buyya, Ratan K.\n  Ghosh, R.K. Shyamasundar and Surya Nepal", "title": "Internet of Things (IoT) and Cloud Computing Enabled Disaster Management", "comments": "Submitted for the book titled \"Integration of Cyber-Physical Systems,\n  Cloud, and Internet of Things\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR cs.DC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Disaster management demands a near real-time information dissemina-tion so\nthat the emergency services can be provided to the right people at the right\ntime. Recent advances in information and communication technologies enable\ncollection of real-time information from various sources. For example, sensors\ndeployed in the fields collect data about the environment. Similarly, social\nnetworks like Twitter and Facebook can help to collect data from people in the\ndisaster zone. On one hand, inadequate situation awareness in disasters has\nbeen identified as one of the primary factors in human errors with grave\nconsequences such as loss of lives and destruction of critical infrastructure.\nOn the other hand, the growing ubiquity of social media and mobile devices, and\npervasive nature of the Internet-of-Things means that there are more sources of\noutbound traffic, which ultimately results in the creation of a data deluge,\nbeginning shortly after the onset of disaster events, leading to the problem of\ninformation tsunami. In addition, security and privacy has crucial role to\novercome the misuse of the system for either intrusions into data or overcome\nthe misuse of the information that was meant for a specified purpose. .... In\nthis chapter, we provide such a situation aware application to support disaster\nmanagement data lifecycle, i.e. from data ingestion and processing to alert\ndissemination. We utilize cloud computing, Internet of Things and social\ncomputing technologies to achieve a scalable, effi-cient, and usable\nsituation-aware application called Cloud4BigData.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2018 03:00:29 GMT"}], "update_date": "2018-06-21", "authors_parsed": [["Gaire", "Raj", ""], ["Sriharsha", "Chigulapalli", ""], ["Puthal", "Deepak", ""], ["Wijaya", "Hendra", ""], ["Kim", "Jongkil", ""], ["Keshari", "Prateeksha", ""], ["Ranjan", "Rajiv", ""], ["Buyya", "Rajkumar", ""], ["Ghosh", "Ratan K.", ""], ["Shyamasundar", "R. K.", ""], ["Nepal", "Surya", ""]]}, {"id": "1806.07534", "submitter": "Raj Gaire", "authors": "Raj Gaire, Ratan K. Ghosh, Jongkil Kim, Alexander Krumpholz, Rajiv\n  Ranjan, R.K. Shyamasundar, Surya Nepal", "title": "Crowdsensing and privacy in smart city applications", "comments": "Preprint submitted to Book: Smart Cities, Cybersecurity and Privacy,\n  Elsevier", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Smartness in smart cities is achieved by sensing phenomena of interest and\nusing them to make smart decisions. Since the decision makers may not own all\nthe necessary sensing infrastructures, crowdsourced sensing, can help collect\nimportant information of the city in near real-time. However, involving people\nbrings of the risk of exposing their private information.This chapter explores\ncrowdsensing in smart city applications and its privacy implications.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2018 03:21:36 GMT"}], "update_date": "2018-06-21", "authors_parsed": [["Gaire", "Raj", ""], ["Ghosh", "Ratan K.", ""], ["Kim", "Jongkil", ""], ["Krumpholz", "Alexander", ""], ["Ranjan", "Rajiv", ""], ["Shyamasundar", "R. K.", ""], ["Nepal", "Surya", ""]]}, {"id": "1806.07713", "submitter": "Amin Omidvar", "authors": "Amin Omidvar, Hui Jiang, Aijun An", "title": "Using Neural Network for Identifying Clickbaits in Online News Media", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online news media sometimes use misleading headlines to lure users to open\nthe news article. These catchy headlines that attract users but disappointed\nthem at the end, are called Clickbaits. Because of the importance of automatic\nclickbait detection in online medias, lots of machine learning methods were\nproposed and employed to find the clickbait headlines. In this research, a\nmodel using deep learning methods is proposed to find the clickbaits in\nClickbait Challenge 2017's dataset. The proposed model gained the first rank in\nthe Clickbait Challenge 2017 in terms of Mean Squared Error. Also, data\nanalytics and visualization techniques are employed to explore and discover the\nprovided dataset to get more insight from the data.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2018 13:21:53 GMT"}], "update_date": "2018-06-21", "authors_parsed": [["Omidvar", "Amin", ""], ["Jiang", "Hui", ""], ["An", "Aijun", ""]]}, {"id": "1806.07833", "submitter": "Khan Rahman", "authors": "Khan Mashiur Rahman", "title": "A Narrative Literature Review and E-Commerce Website Research", "comments": "11 pages, 1 figure", "journal-ref": "Rahman, K. M. (2018), A Narrative Literature review and E-Commerce\n  Website Research, EAI Endorsed Transactions on Scalable Information Systems,\n  18 (17):e1, Volume 5, ISSN 2032-9407, 29 May 2018", "doi": "10.4108/eai.29-5-2018.154806", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this study, a narrative literature review regarding culture and e-commerce\nwebsite design has been introduced. Cultural aspect and e-commerce website\ndesign will play a significant role for successful global e-commerce sites in\nthe future. Future success of businesses will rely on e-commerce. To compete in\nthe global e-commerce marketplace, local businesses need to focus on designing\nculturally friendly e-commerce websites. To the best of my knowledge, there has\nbeen insignificant research conducted on correlations between culture and\ne-commerce website design. The research shows that there are correlations\nbetween e-commerce, culture, and website design. The result of the study\nindicates that cultural aspects influence e-commerce website design. This study\naims to deliver a reference source for information systems and information\ntechnology researchers interested in culture and e-commerce website design, and\nwill show lessfocused research areas in addition to future directions.\n", "versions": [{"version": "v1", "created": "Wed, 30 May 2018 12:03:05 GMT"}, {"version": "v2", "created": "Wed, 17 Oct 2018 23:06:39 GMT"}], "update_date": "2018-10-19", "authors_parsed": [["Rahman", "Khan Mashiur", ""]]}, {"id": "1806.07842", "submitter": "Yuri G. Gordienko", "authors": "Olga Barkova, Natalia Pysarevska, Oleg Allenin, Serhii Hamotsky,\n  Nikita Gordienko, Vladyslav Sarnatskyi, Vadym Ovcharenko, Mariia Tkachenko,\n  Yurii Gordienko, Sergei Stirenko", "title": "Gamification for Education of the Digitally Native Generation by Means\n  of Virtual Reality, Augmented Reality, Machine Learning, and Brain-Computing\n  Interfaces in Museums", "comments": "16 pages, 8 figures,\n  http://uncommonculture.org/ojs/index.php/UC/article/view/9238", "journal-ref": "Uncommon Culture, vol. 7, no.1/2(13/14), pp.86-101 (2018)", "doi": null, "report-no": null, "categories": "cs.CY cs.DL cs.HC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Particularly close attention is being paid today among researchers in social\nscience disciplines to aspects of learning in the digital age, especially for\nthe Digitally Native Generation. In the context of museums, the question is:\nhow can rich learning experiences be provided for increasingly technologically\nadvanced young visitors in museums? Which high-tech platforms and solutions do\nmuseums need to focus on? At the same time, the software games business is\ngrowing fast and now finding its way into non-entertainment contexts, helping\nto deliver substantial benefits, particularly in education, training, research,\nand health. This article outlines some aspects facing Digitally Native learners\nin museums through an analysis of several radically new key technologies:\nInteractivity, Wearables, Virtual Reality, and Augmented Reality. Special\nattention is paid to use cases for application of games-based scenarios via\nthese technologies in non-leisure contexts and specifically for educational\npurposes in museums.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2018 17:03:52 GMT"}], "update_date": "2018-06-21", "authors_parsed": [["Barkova", "Olga", ""], ["Pysarevska", "Natalia", ""], ["Allenin", "Oleg", ""], ["Hamotsky", "Serhii", ""], ["Gordienko", "Nikita", ""], ["Sarnatskyi", "Vladyslav", ""], ["Ovcharenko", "Vadym", ""], ["Tkachenko", "Mariia", ""], ["Gordienko", "Yurii", ""], ["Stirenko", "Sergei", ""]]}, {"id": "1806.07918", "submitter": "Scott Kirkpatrick", "authors": "Scott Kirkpatrick (Hebrew University), Ron Bekkerman and Adi Zmirli\n  (Haifa University), Francesco Malandrino (Politecnico de Torino)", "title": "Mining the Air -- for Research in Social Science and Networking\n  Measurement", "comments": "4 pages, 7 Figures, 6 References. Presented at NetMob 2017, Milano", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Smartphone apps provide a vitally important opportunity for monitoring human\nmobility, human experience of ubiquitous information aids, and human activity\nin our increasingly well-instrumented spaces. As wireless data capabilities\nmove steadily up in performance, from 2&3G to 4G (today's LTE) and 5G, it has\nbecome more important to measure human activity in this connected world from\nthe phones themselves. The newer protocols serve larger areas than ever before\nand a wider range of data, not just voice calls, so only the phone can\naccurately measure its location. Access to the application activity permits not\nonly monitoring the performance and spatial coverage with which the users are\nserved, but as a crowd-sourced, unbiased background source of input on all\nthese subjects, becomes a uniquely valuable resource for input to social\nscience and government as well as telecom providers\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 10:41:00 GMT"}], "update_date": "2018-06-22", "authors_parsed": [["Kirkpatrick", "Scott", "", "Hebrew University"], ["Bekkerman", "Ron", "", "Haifa University"], ["Zmirli", "Adi", "", "Haifa University"], ["Malandrino", "Francesco", "", "Politecnico de Torino"]]}, {"id": "1806.08468", "submitter": "Andrew Lan", "authors": "Andrew S. Lan, Jonathan C. Spencer, Ziqi Chen, Christopher G. Brinton,\n  Mung Chiang", "title": "Personalized Thread Recommendation for MOOC Discussion Forums", "comments": "To appear at ECML-PKDD 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social learning, i.e., students learning from each other through social\ninteractions, has the potential to significantly scale up instruction in online\neducation. In many cases, such as in massive open online courses (MOOCs),\nsocial learning is facilitated through discussion forums hosted by course\nproviders. In this paper, we propose a probabilistic model for the process of\nlearners posting on such forums, using point processes. Different from existing\nworks, our method integrates topic modeling of the post text, timescale\nmodeling of the decay in post activity over time, and learner topic interest\nmodeling into a single model, and infers this information from user data. Our\nmethod also varies the excitation levels induced by posts according to the\nthread structure, to reflect typical notification settings in discussion\nforums. We experimentally validate the proposed model on three real-world MOOC\ndatasets, with the largest one containing up to 6,000 learners making 40,000\nposts in 5,000 threads. Results show that our model excels at thread\nrecommendation, achieving significant improvement over a number of baselines,\nthus showing promise of being able to direct learners to threads that they are\ninterested in more efficiently. Moreover, we demonstrate analytics that our\nmodel parameters can provide, such as the timescales of different topic\ncategories in a course.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2018 02:16:14 GMT"}], "update_date": "2018-06-25", "authors_parsed": [["Lan", "Andrew S.", ""], ["Spencer", "Jonathan C.", ""], ["Chen", "Ziqi", ""], ["Brinton", "Christopher G.", ""], ["Chiang", "Mung", ""]]}, {"id": "1806.08471", "submitter": "Jasmine DeHart", "authors": "Jasmine DeHart and Christan Grant", "title": "Visual Content Privacy Leaks on Social Media Networks", "comments": "2 pages, 3 figures, IEEE Security and Privacy Conference, Poster", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  With the growth and accessibility of mobile devices and internet, the ease of\nposting and sharing content on social media networks (SMNs) has increased\nexponentially. Many users post images that contain \"privacy leaks\" regarding\nthemselves or someone else. Privacy leaks include any instance in which a\ntransfer of personal identifying visual content is shared on SMNs. Private\nvisual content (images and videos) exposes intimate information that can be\ndetrimental to your finances, personal life, and reputation. Private visual\ncontent can include baby faces, credit cards, social security cards, house keys\nand others. The Hawaii Emergency Agency example provides evidence that visual\ncontent privacy leaks can happen on an individual or organization level. We\nfind that monitoring techniques are essential for the improvement of private\nlife and the development of future techniques. More extensive and enduring\ntechniques will allow typical users, organizations, and the government to have\na positive social media footprint.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2018 02:39:45 GMT"}], "update_date": "2018-06-25", "authors_parsed": [["DeHart", "Jasmine", ""], ["Grant", "Christan", ""]]}, {"id": "1806.08492", "submitter": "Yugandhar Sarkale", "authors": "Saeed Nozhati, Bruce R. Ellingwood, Hussam Mahmoud, Yugandhar Sarkale,\n  Edwin K. P. Chong, Nathanael Rosenheim", "title": "An Approximate Dynamic Programming Approach to Community Recovery\n  Management (Extended Abstract)", "comments": "The material in this work provides a gist of the material in the\n  journal version of our work (arXiv:1803.01451) that has in-detailed\n  description of the methods employed in this article in addition to a more\n  comprehensive treatment. This work will serve as a suitable introduction to\n  the interested reader", "journal-ref": "Presented at Engineering Mechanics Institute Conference 2018 (EMI\n  2018 -- MS36 Robustness of Infrastructures), Cambridge -- Boston, MA, May\n  29--June 1, 2018", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The functioning of interdependent civil infrastructure systems in the\naftermath of a disruptive event is critical to the performance and vitality of\nany modern urban community. Post-event stressors and chaotic circumstances,\ntime limitations, and complexities in the community recovery process highlight\nthe necessity for a comprehensive decision-making framework at the\ncommunity-level for post-event recovery management. Such a framework must be\nable to handle large-scale scheduling and decision processes, which involve\ndifficult control problems with large combinatorial decision spaces. This study\nutilizes approximate dynamic programming algorithms along with heuristics for\nthe identification of optimal community recovery actions following the\noccurrence of an extreme earthquake event. The proposed approach addresses the\ncurse of dimensionality in its analysis and management of multi-state,\nlarge-scale infrastructure systems. Furthermore, the proposed approach can\nconsider the cur-rent recovery policies of responsible public and private\nentities within the community and shows how their performance might be\nimproved. A testbed community coarsely modeled after Gilroy, California, is\nutilized as an illustrative example. While the illustration provides optimal\npolicies for the Electrical Power Network serving Gilroy following a severe\nearthquake, preliminary work shows that the methodology is computationally well\nsuited to other infrastructure systems and hazards.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jun 2018 04:51:06 GMT"}], "update_date": "2018-06-25", "authors_parsed": [["Nozhati", "Saeed", ""], ["Ellingwood", "Bruce R.", ""], ["Mahmoud", "Hussam", ""], ["Sarkale", "Yugandhar", ""], ["Chong", "Edwin K. P.", ""], ["Rosenheim", "Nathanael", ""]]}, {"id": "1806.08953", "submitter": "Mahdi Miraz", "authors": "Zainab Alansari, Nor Badrul Anuar, Amirrudin Kamsin, Safeeullah\n  Soomro, Mohammad Riyaz Belgaum, Mahdi H. Miraz and Jawdat Alshaer", "title": "Challenges of Internet of Things and Big Data Integration", "comments": "Proceedings of the International Conference on International\n  Conference on Emerging Technologies in Computing 2018 (iCETiC '18), 23rd\n  -24th August, 2018, at London Metropolitan University, London, UK, Published\n  by Springer-Verlag", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things anticipates the conjunction of physical gadgets to the\nIn-ternet and their access to wireless sensor data which makes it expedient to\nrestrain the physical world. Big Data convergence has put multifarious new\nopportunities ahead of business ventures to get into a new market or enhance\ntheir operations in the current market. considering the existing techniques and\ntechnologies, it is probably safe to say that the best solution is to use big\ndata tools to provide an analytical solution to the Internet of Things. Based\non the current technology deployment and adoption trends, it is envisioned that\nthe Internet of Things is the technology of the future, while to-day's\nreal-world devices can provide real and valuable analytics, and people in the\nreal world use many IoT devices. Despite all the advertisements that companies\noffer in connection with the Internet of Things, you as a liable consumer, have\nthe right to be suspicious about IoT advertise-ments. The primary question is:\nWhat is the promise of the Internet of things con-cerning reality and what are\nthe prospects for the future.\n", "versions": [{"version": "v1", "created": "Sat, 23 Jun 2018 12:19:40 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Alansari", "Zainab", ""], ["Anuar", "Nor Badrul", ""], ["Kamsin", "Amirrudin", ""], ["Soomro", "Safeeullah", ""], ["Belgaum", "Mohammad Riyaz", ""], ["Miraz", "Mahdi H.", ""], ["Alshaer", "Jawdat", ""]]}, {"id": "1806.09081", "submitter": "Razi Iqbal", "authors": "Ricardo Silva, Razi Iqbal", "title": "Ethical Implications of Social Internet of Vehicles Systems", "comments": null, "journal-ref": "IEEE Internet of Things Journal 2018", "doi": "10.1109/JIOT.2018.2841969", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The core concept of IoT is to equip real world objects with computing,\nprocessing and communicating capabilities to enable socializing between them.\nInternet of Vehicles (IoV) is an adherent of IoT that has realized significant\nadvancements using communication technologies. Vehicles connected through\nInternet are capable of sharing information that can substantially enhance the\nquality of traffic on roads. Social Internet of Things (SIoT) is an instance of\nIoT that deals specifically in socialization of connected objects. SIoT enables\nthe notion of Social Internet of Vehicles (SIoV) where vehicles are the key\nentities for sharing information between themselves and the infrastructure\n(commonly known as Road Side Units (RSUs)). Vehicles in SIoV socialize by\nexchanging data such as traffic congestions, weather conditions, infotainment,\nvacant parking slots, alternate routes and discount coupons for restaurants\netc. In SIoV, vehicles can communicate with other vehicles and infrastructure\nthrough traditional communication technologies like Wi-Fi, Cellular networks or\nthrough Dedicated Short Range Communication (DSRC) etc. SIoV will be confronted\nwith ethical dilemmas and expected to function in an ethically responsible\nmanner. This paper highlights the ethical implications of SIoV systems. Vehicle\nto Vehicle (V2V) and Vehicle to Infrastructure (V2I) involves autonomous\ndecision making that requires setting ethical and moral rules before taking\nverdict. The article discusses the lack of ethical guidelines in designing and\ndeploying of SIoV systems that are of utmost importance. Finally, an addition\nto SIoV architecture is proposed to incorporate the ethical and moral\nprinciples for scheming the SIoV systems.\n", "versions": [{"version": "v1", "created": "Sun, 24 Jun 2018 04:28:36 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Silva", "Ricardo", ""], ["Iqbal", "Razi", ""]]}, {"id": "1806.09202", "submitter": "Sayash Kapoor", "authors": "Sayash Kapoor, Vijay Keswani, Nisheeth K. Vishnoi, L. Elisa Celis", "title": "Balanced News Using Constrained Bandit-based Personalization", "comments": "To appear as a demo-paper in IJCAI-ECAI 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a prototype for a news search engine that presents balanced\nviewpoints across liberal and conservative articles with the goal of\nde-polarizing content and allowing users to escape their filter bubble. The\nbalancing is done according to flexible user-defined constraints, and leverages\nrecent advances in constrained bandit optimization. We showcase our balanced\nnews feed by displaying it side-by-side with the news feed produced by a\ntraditional (polarized) feed.\n", "versions": [{"version": "v1", "created": "Sun, 24 Jun 2018 20:02:25 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Kapoor", "Sayash", ""], ["Keswani", "Vijay", ""], ["Vishnoi", "Nisheeth K.", ""], ["Celis", "L. Elisa", ""]]}, {"id": "1806.09244", "submitter": "Renato Luiz de Freitas Cunha", "authors": "Igor Oliveira, Renato L. F. Cunha, Bruno Silva, Marco A. S. Netto", "title": "A Scalable Machine Learning System for Pre-Season Agriculture Yield\n  Forecast", "comments": "8 pages, 5 figures, Submitted to 14th IEEE eScience", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.LG stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Yield forecast is essential to agriculture stakeholders and can be obtained\nwith the use of machine learning models and data coming from multiple sources.\nMost solutions for yield forecast rely on NDVI (Normalized Difference\nVegetation Index) data, which is time-consuming to be acquired and processed.\nTo bring scalability for yield forecast, in the present paper we describe a\nsystem that incorporates satellite-derived precipitation and soil properties\ndatasets, seasonal climate forecasting data from physical models and other\nsources to produce a pre-season prediction of soybean/maize yield---with no\nneed of NDVI data. This system provides significantly useful results by the\nexempting the need for high-resolution remote-sensing data and allowing farmers\nto prepare for adverse climate influence on the crop cycle. In our studies, we\nforecast the soybean and maize yields for Brazil and USA, which corresponded to\n44% of the world's grain production in 2016. Results show the error metrics for\nsoybean and maize yield forecasts are comparable to similar systems that only\nprovide yield forecast information in the first weeks to months of the crop\ncycle.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2018 01:05:19 GMT"}, {"version": "v2", "created": "Mon, 15 Oct 2018 22:27:53 GMT"}], "update_date": "2018-10-17", "authors_parsed": [["Oliveira", "Igor", ""], ["Cunha", "Renato L. F.", ""], ["Silva", "Bruno", ""], ["Netto", "Marco A. S.", ""]]}, {"id": "1806.09335", "submitter": "Thorsten Sommer", "authors": "Thorsten Sommer, Gergana Deppe, Valerie Stehling, Max Haberstroh,\n  Frank Hees", "title": "Request for Comments: Proposal of a Blockchain for the Automatic\n  Management and Acceptance of Student Achievements", "comments": null, "journal-ref": null, "doi": "10.13140/RG.2.2.32493.49129", "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Staying abroad during their studies is increasingly popular for students.\nHowever, there are various challenges for both students and universities. One\nimportant question for students is whether or not achievements performed at\ndifferent universities can be taken into account for either enrolling at a\nforeign university or for completing the studies at their home university. In\naddition to university achievements, an increasing proportion of the 195\nmillion students worldwide increasingly receive certificates from MOOCs or\nother social media services. The integration of such services into university\nteaching is still in the initial stages and presents some challenges. In this\npaper we describe the idea to manage all these study achievements worldwide in\na blockchain, which might solve the national and international challenges\nregarding the recognition of student achievements. The aim of this paper is to\nencourage discussion in the global community instead of presenting a finished\nconcept. Some of the open research questions are: How to ensure student data\nprotection, how to deal with fraud and how to deal with the possibility that\nstudents can analytically calculate the easiest way through their studies?\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2018 09:07:41 GMT"}], "update_date": "2018-06-27", "authors_parsed": [["Sommer", "Thorsten", ""], ["Deppe", "Gergana", ""], ["Stehling", "Valerie", ""], ["Haberstroh", "Max", ""], ["Hees", "Frank", ""]]}, {"id": "1806.09458", "submitter": "Yan Ding", "authors": "Yan Ding", "title": "Eco-Route: Recommending Economical Driving Routes For Plug-in Hybrid\n  Electric Vehicles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High fuel consumption cost results in drivers' economic burden. Plug-In\nHybrid Electric Vehicles (PHEVs) consume two fuel sources (i.e., gasoline and\nelectricity energy sources) with floating prices. To reduce drivers' total fuel\ncost, recommending economical routes to them becomes one of the effective\nmethods. In this paper, we present a novel economical path-planning framework\ncalled Eco-Route, which consists of two phases. In the first phase, we build a\ndriving route cost model (DRCM) for each PHEV (and driver) under the energy\nmanagement strategy, based on driving condition and vehicles' parameters. In\nthe second phase, with the real-time traffic information collected via the\nmobile crowdsensing manner, we are able to estimate and compare the driving\ncost among the shortest and the fastest routes for a given PHEV, and then\nrecommend the driver with the more economical one. We evaluate the two-phase\nframework using 8 different PHEVs simulated in Matlab/Simulink, and the\nreal-world datasets consisting of the road network, POI and GPS trajectory data\ngenerated by 559 taxis in seven days in Beijing, China. Experimental results\ndemonstrate that the proposed model achieves good accuracy, with a mean cost\nerror of less 8% when paths length is longer than 5 km. Moreover, users could\nsave about 9% driving cost on average if driving along suggested routes in our\ncase studies.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jun 2018 13:56:52 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Ding", "Yan", ""]]}, {"id": "1806.09535", "submitter": "Chrisovaladis Malesios", "authors": "Kantartzis A., Malesios C", "title": "A Decision Support System Web-Application for the Management of Forest\n  Road Network", "comments": null, "journal-ref": "Journal of Environmental Science and Engineering A 2018", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The present study contributes to the development of an online FRMP (Forest\nRoad Management Platform) that aims to assist in the management of forest road\nnetwork in a holistic way. This is achieved by the proposed methodology which\nserves as a database using geoprocessing and geospatial technologies for the\nhandling, and the identification of critical issues in the infrastructure of\nforest road networks, visualization of forest roads, and the optimization of\nthe management of the forest road network by proposing alternative strategies.\nIn this paper, the development of the decision making web-tool, and present\nexamples to demonstrate effectively its application and resulting advantages\nare described. The developed web-application may provide assistance to various\nforest organizations in the management of forest road networks and associated\nproblems in an effective and sustainable way.\n", "versions": [{"version": "v1", "created": "Tue, 19 Jun 2018 23:35:32 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["A.", "Kantartzis", ""], ["C", "Malesios", ""]]}, {"id": "1806.09541", "submitter": "Panagiotis Metaxas", "authors": "Panagiotis Metaxas", "title": "Technology, Propaganda, and the Limits of Human Intellect", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GL cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  \"Fake news\" is a recent phenomenon, but misinformation and propaganda are\nnot. Our new communication technologies make it easy for us to be exposed to\nhigh volumes of true, false, irrelevant, and unprovable information. Future AI\nis expected to amplify the problem even more. At the same time, our brains are\nreaching their limits in handling information. How should we respond to\npropaganda? Technology can help, but relying on it alone will not suffice in\nthe long term. We also need ethical policies, laws, regulations, and trusted\nauthorities, including fact-checkers. However, we will not solve the problem\nwithout the active engagement of the educated citizen. Epistemological\neducation, recognition of self biases and protection of our channels of\ncommunication and trusted networks are all needed to overcome the problem and\ncontinue our progress as democratic societies.\n", "versions": [{"version": "v1", "created": "Wed, 6 Jun 2018 10:47:20 GMT"}], "update_date": "2018-06-26", "authors_parsed": [["Metaxas", "Panagiotis", ""]]}, {"id": "1806.09687", "submitter": "Mahdi Miraz", "authors": "Mahdi H. Miraz and David C. Donald", "title": "Application of Blockchain in Booking and Registration Systems of\n  Securities Exchanges", "comments": null, "journal-ref": "Proceedings of the IEEE International Conference on Computing,\n  Electronics & Communications Engineering 2018 (IEEE iCCECE '18), to be held\n  between 16-17 August 2018, at University of Essex, Southend, UK, published by\n  IEEE", "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Securities exchange being digitalised and online, security of information and\ndata has become a major concern. Blockchain (BC) technology, being distributed\nand immutable in nature, has proved to the \"Trust Machine\" eliminating the need\nfor third-parties. Authors of this paper investigate how Blockchain can be used\nto secure stock exchange transactions, with an especial focus to the\ntechnological as well as legal aspects of such applications. Considering the\nintricate operational structure of the securities exchange, the research\nproposes to design, develop and implement a hybrid BC, customised according to\nthe need of the respective stock exchange. The study suggests that the use of\nsuch BC can bring many benefits which the other technologies currently being\nused cannot offer. However, during the design process of any such application\nusing BC, the relevant laws and regulations of the corresponding country need\nto be considered.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jun 2018 09:44:15 GMT"}, {"version": "v2", "created": "Tue, 3 Jul 2018 03:42:47 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Miraz", "Mahdi H.", ""], ["Donald", "David C.", ""]]}, {"id": "1806.09936", "submitter": "Riccardo Guidotti", "authors": "Dino Pedreschi, Fosca Giannotti, Riccardo Guidotti, Anna Monreale,\n  Luca Pappalardo, Salvatore Ruggieri, Franco Turini", "title": "Open the Black Box Data-Driven Explanation of Black Box Decision Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Black box systems for automated decision making, often based on machine\nlearning over (big) data, map a user's features into a class or a score without\nexposing the reasons why. This is problematic not only for lack of\ntransparency, but also for possible biases hidden in the algorithms, due to\nhuman prejudices and collection artifacts hidden in the training data, which\nmay lead to unfair or wrong decisions. We introduce the local-to-global\nframework for black box explanation, a novel approach with promising early\nresults, which paves the road for a wide spectrum of future developments along\nthree dimensions: (i) the language for expressing explanations in terms of\nhighly expressive logic-based rules, with a statistical and causal\ninterpretation; (ii) the inference of local explanations aimed at revealing the\nlogic of the decision adopted for a specific instance by querying and auditing\nthe black box in the vicinity of the target instance; (iii), the bottom-up\ngeneralization of the many local explanations into simple global ones, with\nalgorithms that optimize the quality and comprehensibility of explanations.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jun 2018 12:14:44 GMT"}], "update_date": "2018-06-27", "authors_parsed": [["Pedreschi", "Dino", ""], ["Giannotti", "Fosca", ""], ["Guidotti", "Riccardo", ""], ["Monreale", "Anna", ""], ["Pappalardo", "Luca", ""], ["Ruggieri", "Salvatore", ""], ["Turini", "Franco", ""]]}, {"id": "1806.10095", "submitter": "Feng Liu", "authors": "Feng Liu, Yong Shi", "title": "Research on Artificial Intelligence Ethics Based on the Evolution of\n  Population Knowledge Base", "comments": "12 pages, 6 figures,1 table", "journal-ref": "Intelligence Science II. ICIS 2018.IFIP Advances in Information\n  and Communication Technology, vol 539. Springer, Cham", "doi": "10.1007/978-3-030-01313-4_48", "report-no": null, "categories": "cs.OH cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The unclear development direction of human society is a deep reason for that\nit is difficult to form a uniform ethical standard for human society and\nartificial intelligence. Since the 21st century, the latest advances in the\nInternet, brain science and artificial intelligence have brought new\ninspiration to the research on the development direction of human society.\nThrough the study of the Internet brain model, AI IQ evaluation, and the\nevolution of the brain, this paper proposes that the evolution of population\nknowledge base is the key for judging the development direction of human\nsociety, thereby discussing the standards and norms for the construction of\nartificial intelligence ethics.\n", "versions": [{"version": "v1", "created": "Sat, 9 Jun 2018 17:01:27 GMT"}, {"version": "v2", "created": "Wed, 27 Jun 2018 05:27:36 GMT"}, {"version": "v3", "created": "Sun, 18 Nov 2018 04:03:39 GMT"}], "update_date": "2018-11-20", "authors_parsed": [["Liu", "Feng", ""], ["Shi", "Yong", ""]]}, {"id": "1806.10227", "submitter": "Kamal Karkonasasi", "authors": "Khoo Han Ni, Ahmad Suhaimi Baharudin, Kamal Karkonasasi", "title": "The Determinants For User Intention To Adopt Web Based Early Childhood\n  Supplementary Educational Platform", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Education is defined as the fundamental key for the success and development\nfor any given society. Hence, the forming of a strong basic educational\nfoundation is crucial to ensure the children to stay competitive and achieve\nextraordinary in the changing world. I-zLink Sdn. Bhd. is a partnership company\nthat formed by four individuals with the commitment to develop an early\nchildhood learning solution named i-Future. The system, i-Future is a\nSupplementary Educational Platform that designs specially for children that\nfall between the age categories of two to six years which integrate with the\nlatest technology to increase the engagement and flexibility in learning\nprocess as well as the effectiveness of study. In order to ensure that the\nsystem has a market value, an empirical study was conducted to determine the\nacceptance level and also the variables that would affect the user's intention\nto adopt i-Future. The variables used in the study include Perceived Ease of\nUse (PEU), Perceived Usefulness (PU), System Quality (SQ) and Social Norm (SN).\nThrough the quantitative study, the relationship between these variables and\nuser's intention to adopt i-Future was determined. Those variables which have\nsignificant impact on user's intention to adopt i-Future will be used to design\ni-Future.\n", "versions": [{"version": "v1", "created": "Tue, 26 Jun 2018 22:00:49 GMT"}], "update_date": "2018-06-28", "authors_parsed": [["Ni", "Khoo Han", ""], ["Baharudin", "Ahmad Suhaimi", ""], ["Karkonasasi", "Kamal", ""]]}, {"id": "1806.10692", "submitter": "Arya Farahi", "authors": "Jacob Abernethy, Alex Chojnacki, Arya Farahi, Eric Schwartz, Jared\n  Webb", "title": "ActiveRemediation: The Search for Lead Pipes in Flint, Michigan", "comments": "10 pages, 10 figures, To appear in KDD 2018, For associated\n  promotional video, see https://www.youtube.com/watch?v=YbIn_axYu9E", "journal-ref": null, "doi": "10.1145/3219819.3219896", "report-no": null, "categories": "cs.LG cs.CY stat.AP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We detail our ongoing work in Flint, Michigan to detect pipes made of lead\nand other hazardous metals. After elevated levels of lead were detected in\nresidents' drinking water, followed by an increase in blood lead levels in area\nchildren, the state and federal governments directed over $125 million to\nreplace water service lines, the pipes connecting each home to the water\nsystem. In the absence of accurate records, and with the high cost of\ndetermining buried pipe materials, we put forth a number of predictive and\nprocedural tools to aid in the search and removal of lead infrastructure.\nAlongside these statistical and machine learning approaches, we describe our\ninteractions with government officials in recommending homes for both\ninspection and replacement, with a focus on the statistical model that adapts\nto incoming information. Finally, in light of discussions about increased\nspending on infrastructure development by the federal government, we explore\nhow our approach generalizes beyond Flint to other municipalities nationwide.\n", "versions": [{"version": "v1", "created": "Sun, 10 Jun 2018 13:04:53 GMT"}, {"version": "v2", "created": "Fri, 17 Aug 2018 17:10:17 GMT"}], "update_date": "2018-08-20", "authors_parsed": [["Abernethy", "Jacob", ""], ["Chojnacki", "Alex", ""], ["Farahi", "Arya", ""], ["Schwartz", "Eric", ""], ["Webb", "Jared", ""]]}, {"id": "1806.10744", "submitter": "Kamal Karkonasasi", "authors": "Kamal Karkonasasi, Cheah Yu-N, Seyed Aliakbar Mousavi", "title": "Intention to Use SMS Vaccination Reminder and Management System among\n  Health Centers in Malaysia: The Mediating Effect of Attitude", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this study is to find out influential factors of intention to\nuse the proposed system among health centers by considering the technology\nacceptance model as the underlying theory. The proposed model of this study is\ntested using data collected from self-directed questionnaires filled up by 70\nnurses in government hospitals and government clinics in Malaysia. A research\nmethod, which is based on the multi-analytical approach of Multiple Regression\nAnalysis and Artificial Neural Networks, helps to refine the results of this\nstudy. The compatibility of the proposed system only has a significant and\npositive effect on attitude to use the system among other factors. Moreover,\nhealth centers' intention to use the system is further influenced by their\nperceived usefulness than their attitude to use. The mediating effect of\nAttitude is also proved. However, there is not any statistically significant\ndifference in Intention scores accounting for the participants' demographic\ncharacteristics. The implication of this study is that by developing the\nsystem, which fits to the current procedures of health centers, we give them\npositive feelings. IT educational programs also should be provided for nurses\nto identify the benefits of the proposed system. It is also important to\nconsider the indirect effects from independent variables on intention to use\nthe system. However, the system does not require to consider the demographic\ncharacteristics of its end users.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 02:47:37 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Karkonasasi", "Kamal", ""], ["Yu-N", "Cheah", ""], ["Mousavi", "Seyed Aliakbar", ""]]}, {"id": "1806.10836", "submitter": "Alessia Amelio Dr.", "authors": "Lucio Amelio and Alessia Amelio", "title": "CT Image Registration in Acute Stroke Monitoring", "comments": "10 pages, 9 figures, Accepted at the 41th Jubilee International\n  Convention on Information and Communication Technology, Electronics and\n  Microelectronics (MIPRO), Opatija, Croatia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new system based on tracking the temporal evolution of stroke\nlesions using an image registration technique on CT exams of the patient's\nbrain. The system is able to compare past CT exams with the most recent one\nrelated to stroke event in order to evaluate past lesions which are not related\nto stroke. Then, it can compare recent CT exams related to the current stroke\nfor assessing the evolution of the lesion over time. A new similarity measure\nis also introduced for the comparison of the source and target images during\nimage registration. It will result in a cheaper, faster and more accessible\nevaluation of the acute phase of the stroke overcoming the current limitations\nof the proposed systems in the state-of-the-art.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 09:11:57 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Amelio", "Lucio", ""], ["Amelio", "Alessia", ""]]}, {"id": "1806.10906", "submitter": "Jason R.C. Nurse Dr", "authors": "Jason R.C. Nurse and Petar Radanliev and Sadie Creese and David De\n  Roure", "title": "If you can't understand it, you can't properly assess it! The reality of\n  assessing security risks in Internet of Things systems", "comments": "9 pages, 1 figure", "journal-ref": "IET Living in the Internet of Things: Cybersecurity of the IoT\n  Conference 2018", "doi": "10.1049/cp.2018.0001", "report-no": null, "categories": "cs.CR cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security risk assessment methods have served us well over the last two\ndecades. As the complexity, pervasiveness and automation of technology systems\nincreases, particularly with the Internet of Things (IoT), there is a\nconvincing argument that we will need new approaches to assess risk and build\nsystem trust. In this article, we report on a series of scoping workshops and\ninterviews with industry professionals (experts in enterprise systems, IoT and\nrisk) conducted to investigate the validity of this argument. Additionally, our\nresearch aims to consult with these professionals to understand two crucial\naspects. Firstly, we seek to identify the wider concerns in adopting IoT\nsystems into a corporate environment, be it a smart manufacturing shop floor or\na smart office. Secondly, we investigate the key challenges for approaches in\nindustry that attempt to effectively and efficiently assess cyber-risk in the\nIoT.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 12:07:12 GMT"}], "update_date": "2018-06-29", "authors_parsed": [["Nurse", "Jason R. C.", ""], ["Radanliev", "Petar", ""], ["Creese", "Sadie", ""], ["De Roure", "David", ""]]}, {"id": "1806.11154", "submitter": "Andrey Gorshenin", "authors": "Andrey Gorshenin", "title": "Toward modern educational IT-ecosystems: from learning management\n  systems to digital platforms", "comments": "8 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The development of a learning management system (LMS) as a key service seems\nto be very effective for creation of educational digital platforms. Such\nplatforms for both higher education institutions and various companies can\nprovide the opportunities for networked forms of educational communication,\nimprove the quality of the perception of innovative technologies and support\ntools for progress of talented youth as well as knowledge transfer. An example\nof such LMS is presented. The paper focuses on the demand for further\ndevelopment of learning management systems, their integration with modern\ndigital platforms and potential exploitation as key services of such platforms\nin the context of the current educational trends of Industry 4.0 and the global\ntrend towards a transition to a digital economy. The implementation of\nartificial intelligence technologies into the educational process is mentioned\nas an innovative way to form IT-ecosystems of modern education.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jun 2018 19:36:01 GMT"}], "update_date": "2018-07-02", "authors_parsed": [["Gorshenin", "Andrey", ""]]}, {"id": "1806.11386", "submitter": "Wazir Zada Khan", "authors": "Wazir Zada Khan, Mohammed Zahid, Mohammed Y Aalsalem, Hussein Mohammed\n  Zangoti and Quratulain Arshad", "title": "Ethical Aspects of Internet of Things from Islamic Perspective", "comments": "4 pages, 3 figures, 9th IEEE-GCC Conference & Exhibition - 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things (IoTs) is an evolving new face of technology that\nprovides state of the art services using ubiquitously connected smart objects.\nThese smart objects are capable of sensing, processing, collaborating,\ncommunicating the events and provide services. The IoT is a collection of\nheterogeneous technologies like Sensor, RFID, Communication and nanotechnology.\nThese technologies enable smart objects to identify objects, collect\ninformation about their status,communicating the collected information for\ntaking some desired actions. Widespread adaptations of IoT based devices and\nservices raised the ethical challenges for their users. In this paper we\nhighlight ethical challenges raised by IoT and discuss the solutions and\nmethods for encouraging people to properly use these technologies according to\nIslamic teachings.\n", "versions": [{"version": "v1", "created": "Fri, 29 Jun 2018 12:53:17 GMT"}], "update_date": "2018-07-02", "authors_parsed": [["Khan", "Wazir Zada", ""], ["Zahid", "Mohammed", ""], ["Aalsalem", "Mohammed Y", ""], ["Zangoti", "Hussein Mohammed", ""], ["Arshad", "Quratulain", ""]]}]