[{"id": "1402.0121", "submitter": "Alexandre Maurer", "authors": "Alexandre Maurer (EPFL), S\\'ebastien Tixeuil (LINCS, NPA), Xavier\n  D\\'efago (JAIST)", "title": "Reliable Communication in a Dynamic Network in the Presence of Byzantine\n  Faults", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the following problem: two nodes want to reliably communicate in\na dynamic multihop network where some nodes have been compromised, and may have\na totally arbitrary and unpredictable behavior. These nodes are called\nByzantine. We consider the two cases where cryptography is available and not\navailable. We prove the necessary and sufficient condition (that is, the\nweakest possible condition) to ensure reliable communication in this context.\nOur proof is constructive, as we provide Byzantine-resilient algorithms for\nreliable communication that are optimal with respect to our impossibility\nresults. In a second part, we investigate the impact of our conditions in three\ncase studies: participants interacting in a conference, robots moving on a grid\nand agents in the subway. Our simulations indicate a clear benefit of using our\nalgorithms for reliable communication in those contexts.\n", "versions": [{"version": "v1", "created": "Sat, 1 Feb 2014 20:01:57 GMT"}, {"version": "v2", "created": "Wed, 12 Feb 2014 07:53:09 GMT"}, {"version": "v3", "created": "Tue, 27 May 2014 18:55:43 GMT"}, {"version": "v4", "created": "Mon, 16 Feb 2015 17:34:12 GMT"}], "update_date": "2015-02-17", "authors_parsed": [["Maurer", "Alexandre", "", "EPFL"], ["Tixeuil", "Sébastien", "", "LINCS, NPA"], ["Défago", "Xavier", "", "JAIST"]]}, {"id": "1402.0214", "submitter": "George Kesidis", "authors": "George Kesidis, Guodong Pang", "title": "Golden-rule capacity allocation for distributed delay management in\n  peer-to-peer networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a distributed framework for resources management in peer-to-peer\nnetworks leading to golden-rule reciprocity, a kind of one-versus-rest\ntit-for-tat, so that the delays experienced by any given peer's messages in the\nrest of the network are proportional to those experienced by others' messages\nat that peer.\n", "versions": [{"version": "v1", "created": "Sun, 2 Feb 2014 17:18:05 GMT"}], "update_date": "2014-02-04", "authors_parsed": [["Kesidis", "George", ""], ["Pang", "Guodong", ""]]}, {"id": "1402.0454", "submitter": "Alain Simonian", "authors": "F. B\\'en\\'ezit, S. Elayoubi, R-M. Indre, A. Simonian", "title": "Modelling Load Balancing and Carrier Aggregation in Mobile Networks", "comments": "8 pages, 6 figures, submitted to WiOpt2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the performance of multicarrier mobile networks.\nSpecifically, we analyze the flow-level performance of two inter-carrier load\nbalancing schemes and the gain engendered by Carrier Aggregation (CA). CA is\none of the most important features of HSPA+ and LTE-A networks; it allows\ndevices to be served simultaneously by several carriers. We propose two load\nbalancing schemes, namely Join the Fastest Queue (JFQ) and Volume Balancing\n(VB), that allow the traffic of CA and non-CA users to be distributed over the\naggregated carriers. We then evaluate the performance of these schemes by means\nof analytical modeling. We show that the proposed schemes achieve quasi-ideal\nload balancing. We also investigate the impact of mixing traffic of CA and\nnon-CA users in the same cell and show that performance is practically\ninsensitive to the traffic mix.\n", "versions": [{"version": "v1", "created": "Mon, 3 Feb 2014 18:21:11 GMT"}], "update_date": "2014-02-04", "authors_parsed": [["Bénézit", "F.", ""], ["Elayoubi", "S.", ""], ["Indre", "R-M.", ""], ["Simonian", "A.", ""]]}, {"id": "1402.0521", "submitter": "Vesal Hakami", "authors": "Vesal Hakami and Mehdi Dehghan", "title": "Cognitive Forwarding Control in Wireless Ad-Hoc Networks with Slow\n  Fading Channels", "comments": "29 pages, 9 figures, 2 tables. Wireless Networks (Springer), Vol. XX,\n  No. XX, 2015", "journal-ref": "Wireless Networks, Vol. 21, No. 7, pp 2327-2343, Oct. 2015", "doi": "10.1007/s11276-015-0919-y", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a decentralized stochastic control solution for the broadcast\nmessage dissemination problem in wireless ad hoc networks with slow fading\nchannels. We formulate the control problem as a dynamic robust game which is\nwell justified by two key observations; first, the shared nature of the\nwireless medium which inevitably cross-couples the nodes' forwarding decisions,\nthus binding them together as strategic players; second, the stochastic\ndynamics associated with the link qualities which renders the transmission\ncosts noisy, thus motivating a robust formulation. Given the non stationarity\ninduced by the fading process, an online solution for the formulated game would\nthen require an adaptive procedure capable of both convergence to and tracking\nstrategic equilibria as the environment changes. To this end, we deploy the\nstrategic and non stationary learning algorithm of regret tracking, the\ntemporally adaptive variant of the celebrated regret matching algorithm, to\nguarantee the emergence and active tracking of the correlated equilibria in the\ndynamic robust forwarding game. We also make provision for exploiting the\nchannel state information, when available, to enhance the convergence speed of\nthe learning algorithm by conducting an accurate transmission cost estimation.\nThis cost estimate can basically serve as a model which spares the algorithm\nfrom extra action exploration, thus rendering the learning process more sample\nefficient. Simulation results reveal that our proposed solution excels in terms\nof both the number of transmissions and load distribution while also\nmaintaining near perfect delivery ratio, especially in dense crowded\nenvironments.\n", "versions": [{"version": "v1", "created": "Mon, 3 Feb 2014 21:19:17 GMT"}, {"version": "v2", "created": "Mon, 1 Jun 2015 11:44:05 GMT"}], "update_date": "2016-06-16", "authors_parsed": [["Hakami", "Vesal", ""], ["Dehghan", "Mehdi", ""]]}, {"id": "1402.0729", "submitter": "Nikolaos Pappas", "authors": "Nikolaos Pappas, Anthony Ephremides, Apostolos Traganitis", "title": "Stability and Performance Issues of a Relay Assisted Multiple Access\n  Scheme with MPR Capabilities", "comments": "Accepted for publication in Elsevier Computer Communications. arXiv\n  admin note: substantial text overlap with arXiv:1105.0452", "journal-ref": null, "doi": "10.1016/j.comcom.2014.01.004", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we study the impact of a relay node to a network with a finite\nnumber of users-sources and a destination node. We assume that the users have\nsaturated queues and the relay node does not have packets of its own; we have\nrandom access of the medium and the time is slotted. The relay node stores a\nsource packet that it receives successfully in its queue when the transmission\nto the destination node has failed. The relay and the destination nodes have\nmulti-packet reception capabilities. We obtain analytical equations for the\ncharacteristics of the relay's queue such as average queue length, stability\nconditions etc. We also study the throughput per user and the aggregate\nthroughput for the network.\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2014 13:31:44 GMT"}], "update_date": "2014-02-05", "authors_parsed": [["Pappas", "Nikolaos", ""], ["Ephremides", "Anthony", ""], ["Traganitis", "Apostolos", ""]]}, {"id": "1402.0736", "submitter": "V Karthikeyan VKK", "authors": "V.Karthikeyan, Geethanjali.S, Mekala.M, Deepika.T", "title": "Water Eminence Scrutinizing Scheme Based On Zigbee and Wireless Antenna\n  Expertise - A Study", "comments": "8 FIGURES AND 5 PAGES", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Sensor Network is the essential structure of a water eminence\nmonitoring by means of wireless sensor network technology To scrutinize water\nquality greater than different sites as a synchronized application an estimable\nsystem structural design constituted by spread sensor nodes and a base station\nis suggested The nodes and base stations are linked using WSN technology like\nZigbee Base stations are related via Ethernet. Design and execution of a\nprototype using WSN technology are the exigent work. Data are identified by\nmeans of dissimilar sensors at the node plane to compute the parameters like\nturbidity and oxygen quantity is transmitted via WSN to the support station\nInformation unruffled from the distant location is capable of displayed in\ndiagram setup as well as it is able to be calculated using dissimilar\nreplication tools at the supporting station. The recent methods have benefits\nsuch as null amount carbon emission low power utilization more stretchy to put\ntogether at distant locations.\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2014 13:58:38 GMT"}], "update_date": "2014-02-05", "authors_parsed": [["Karthikeyan", "V.", ""], ["S", "Geethanjali.", ""], ["M", "Mekala.", ""], ["T", "Deepika.", ""]]}, {"id": "1402.0932", "submitter": "Ali Rakhshan", "authors": "Ali Rakhshan, Hossein Pishro-Nik, Donald L. Fisher, Mohammad Nekoui", "title": "Tuning Collision Warning Algorithms to Individual Drivers for Design of\n  Active Safety Systems", "comments": "A major reason: Since now CV2X has considerable advantages over\n  802.11p and it can be the next specification used for V2X communication, I'd\n  like to withdraw this paper in order to make it easier for the readers to\n  find the best papers in the area. See:\n  https://www.qualcomm.com/news/onq/2018/04/25/lets-set-record-straight-c-v2x", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Every year, many people are killed and injured in highway traffic accidents.\nIn order to reduce such casualties, collisions warning systems has been studied\nextensively. These systems are built by taking the driver reaction times into\naccount. However, most of the existing literature focuses on characterizing how\ndriver reaction times vary across an entire population. Therefore, many of the\nwarnings that are given turn out to be false alarms. A false alarm occurs\nwhenever a warning is sent, but it is not needed. This would nagate any safety\nbenefit of the system, and could even reduce the overall safety if warnings\nbecome a distraction. In this paper, we propose our solution to address the\ndescribed problem; First, we briefly describe our method for estimating the\ndistribution of brake response times for a particular driver using data from a\nVehicular Ad-Hoc Network (VANET) system. Then, we investigate how brake\nresponse times of individual drivers can be used in collision warning\nalgorithms to reduce false alarm rates while still maintaining a high level of\nsafety. This will yield a system that is overall more reliable and trustworthy\nfor drivers, which could lead to wider adoption and applicability for V2V/V2I\ncommunication systems. Moreover, we show how false alarm rate varies with\nrespect to probability of accident. Our simulation results show that by\nindividualizing collision warnings the number of false alarms can be reduced\nmore than $50\\%$. Then, we conclude safety applications could potentially take\nfull advantage of being customized to an individual's characteristics.\n", "versions": [{"version": "v1", "created": "Wed, 5 Feb 2014 04:19:03 GMT"}, {"version": "v2", "created": "Sat, 2 Mar 2019 00:32:05 GMT"}], "update_date": "2019-03-05", "authors_parsed": [["Rakhshan", "Ali", ""], ["Pishro-Nik", "Hossein", ""], ["Fisher", "Donald L.", ""], ["Nekoui", "Mohammad", ""]]}, {"id": "1402.1191", "submitter": "Xing Shi Cai", "authors": "Xing Shi Cai, Luc Devroye", "title": "The Analysis of Kademlia for random IDs", "comments": "15 pages. 2 figures", "journal-ref": null, "doi": "10.1080/15427951.2015.1051674", "report-no": null, "categories": "cs.DS cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Kademlia is the de facto standard searching algorithm for P2P (peer-to-peer)\nnetworks on the Internet. In our earlier work, we introduced two slightly\ndifferent models for Kademlia and studied how many steps it takes to search for\na target node by using Kademlia's searching algorithm. The first model, in\nwhich nodes of the network are labelled with deterministic IDs, had been\ndiscussed in that paper. The second one, in which nodes are labelled with\nrandom IDs, which we call the Random ID Model, was only briefly mentioned.\nRefined results with detailed proofs for this model are given in this paper.\nOur analysis shows that with high probability it takes about $c \\log n$ steps\nto locate any node, where $n$ is the total number of nodes in the network and\n$c$ is a constant that does not depend on $n$.\n", "versions": [{"version": "v1", "created": "Wed, 5 Feb 2014 21:37:29 GMT"}, {"version": "v2", "created": "Tue, 12 May 2015 14:07:52 GMT"}], "update_date": "2020-04-21", "authors_parsed": [["Cai", "Xing Shi", ""], ["Devroye", "Luc", ""]]}, {"id": "1402.1245", "submitter": "Aruna  G.R", "authors": "Ms.Aruna.G.R, Mr.SivanArulSelvan", "title": "A Survey on Delay-Aware Network Structure for Wireless Sensor Networks\n  with Consecutive Data Collection Processes", "comments": "4 pages,3 figures, \"Published with International Journal of\n  Engineering Trends and Technology (IJETT)\"", "journal-ref": "IJETT, 7(4),198-201, 2014 published by seventh sense research\n  group", "doi": "10.14445/22315381/IJETT-V7P240", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Wireless Sensor Network (WSN) consists of spatially distributed autonomous\nsensors to monitor physical or environmental conditions, such as temperature,\nsound, pressure,etc. In sensing applications, data packets are flowing from\nsensor nodes to base station. In data collection processes, bottom up approach\nis used. In bottom up approach, all nodes send their sensed data packets to\nbase station directly. In this approach will lead to increased delay, which\nwill lead to higher energy consumption. To reduce the energy consumption of\nsensor nodes,Clustering Algorithm and Low-Energy Adaptive Clustering Hierarchy\n(LEACH) are being used. Efficient gathering in Wireless Sensor information\nsystems, Power Efficient Gathering in Sensor Information System (PEGASIS) is\nbeing used. There are lot of research issues in Wireless Sensor Networks such\nas delay, lifetime of network, energy dissipation which needs to be resolved.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2014 05:10:55 GMT"}], "update_date": "2014-02-07", "authors_parsed": [["R", "Ms. Aruna. G.", ""], ["SivanArulSelvan", "Mr.", ""]]}, {"id": "1402.1246", "submitter": "Rubia  R", "authors": "Ms.Rubia.R, Mr.SivanArulSelvan", "title": "A Survey on Mobile Data Gathering in Wireless Sensor Networks - Bounded\n  Relay", "comments": "4 pages, 1 figure, \"Published with International Journal of\n  Engineering Trends and Technology (IJETT)\"", "journal-ref": "IJETT, 7(5),205-208,2014 published by seventh sense research group", "doi": "10.14445/22315381/IJETT-V7P247", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most of the wireless sensor networks consist of static sensors, which can be\ndeployed in a wide environment for monitoring applications. While transmitting\nthe data from source to static sink, the amount of energy consumption of the\nsensor node is high. It results in reduced lifetime of the network.Some of the\nWSN architectures have been proposed based on Mobile Elements. There is large\nnumber of approaches to resolve the above problem. It is found those two\napproaches, namely Single Hop Data Gathering problem (SHDGP) and mobile Data\nGathering, which is used to increase the lifetime of the network. Single Hop\nData Gathering Problem is used to achieve the uniform energy consumption. The\nmobile Data Gathering algorithm is used to find the minimal set of points in\nthe sensor network, which serves as data gathering points for mobile network.\nEven after so many decades of research, there are some unresolved problems like\nnon uniform energy consumption, increased latency, which needs to be resolved.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2014 05:11:35 GMT"}], "update_date": "2014-02-07", "authors_parsed": [["R", "Ms. Rubia.", ""], ["SivanArulSelvan", "Mr.", ""]]}, {"id": "1402.1252", "submitter": "Manojkumar  M. K.", "authors": "Manojkumar.M.K, Sathya.D", "title": "A Survey on an Effective Defense Mechanism against Reactive Jamming\n  Attacks in WSN", "comments": "4 pages,3 figures,\"Published with International Journal of Computer\n  Trends and Technology (IJCTT)\"", "journal-ref": "IJCTT 7(3):143-146, January 2014. Published by Seventh Sense\n  Research Group", "doi": "10.14445/22312803/IJCTT-V7P129", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Wireless Sensor Network (WSN) is a self-configure network of sensor nodes\ncommunicate among themselves using radio signals and deployed in quantity to\nsense, monitor and to understand the physical world. A jammer is an entity\nwhich interferes with the physical transmission and reception of wireless\ncommunications. Reactive jamming attack is a major security problem in the\nwireless sensor network. The reactive jammer stays quiet when the channel is\nidle. The jammer starts transmitting a radio signal as soon as it senses\nactivity on the channel. The reactive jammer nodes will be deactivated by\nidentifying all the trigger nodes, at the same time a jammer node is localized\nby exploiting the changes in the neighbor nodes. The affected node can be\nidentified, by analyzing the changes in its communication range, compared to\nits neighbors. The paper proposes a survey on trigger node identification and a\ndetailed survey on techniques to identify trigger nodes and highly concentrated\non the reactive jammer.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2014 05:34:32 GMT"}], "update_date": "2014-02-07", "authors_parsed": [["K", "Manojkumar. M.", ""], ["D", "Sathya.", ""]]}, {"id": "1402.1399", "submitter": "Carlos Kornuta", "authors": "Juan Toloza, Nelson Acosta, Carlos Kornuta", "title": "WiFiPos: An In/Out-Door Positioning Tool", "comments": "7 pages, 6 figures, \"Published with International Journal of Computer\n  Trends and Technology (IJCTT)\"", "journal-ref": "International Journal of Computer Trends and Technology\n  (IJCTT.6(2).1-7.December 2013.Published by Seventh Sense Research Group", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Geographical location solutions have a wide diversity of applications,\nranging from emergency services to access to tourist and entertainment\nservices. GPS (Global Positioning System) is the most widely used system for\noutdoor areas. Since it requires a direct line of sight with the satellites, it\ncannot be used indoors. For indoor positioning, the most commonly used\ntechnology to calculate the position of mobile devices is Wi-Fi. In this\narticle, we present a positioning tool called WiFiPos based on Wi-Fi signal\nprocessing. This tool uses different variations of the Fingerprint technique to\nanalyze the performance and accuracy of the system both indoors and outdoors.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2014 16:36:22 GMT"}], "update_date": "2014-02-07", "authors_parsed": [["Toloza", "Juan", ""], ["Acosta", "Nelson", ""], ["Kornuta", "Carlos", ""]]}, {"id": "1402.1674", "submitter": "Xiaojun Feng", "authors": "Xiaojun Feng, Qian Zhang, Jin Zhang", "title": "A Hybrid Pricing Framework for TV White Space Database", "comments": "12 pages, 9 figures, accepted by IEEE Transactions on Wireless\n  Communications in Jan. 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  According to the recent rulings of the Federal Communications Commission\n(FCC), TV white spaces (TVWS) can now be accessed by secondary users (SUs)\nafter a list of vacant TV channels is obtained via a geo-location database.\nProper business models are therefore essential for database operators to manage\ngeo-location databases. Database access can be simultaneously priced under two\ndifferent schemes: the registration scheme and the service plan scheme. In the\nregistration scheme, the database reserves part of the TV bandwidth for\nregistered White Space Devices (WSDs). In the service plan scheme, the WSDs are\ncharged according to their queries. In this paper, we investigate the business\nmodel for the TVWS database under a hybrid pricing scheme. We consider the\nscenario where a database operator employs both the registration scheme and the\nservice plan scheme to serve the SUs. The SUs' choices of different pricing\nschemes are modeled as a non-cooperative game and we derive distributed\nalgorithms to achieve Nash Equilibrium (NE). Considering the NE of the SUs, the\ndatabase operator optimally determines pricing parameters for both pricing\nschemes in terms of bandwidth reservation, registration fee and query plans.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2014 05:57:40 GMT"}], "update_date": "2014-02-10", "authors_parsed": [["Feng", "Xiaojun", ""], ["Zhang", "Qian", ""], ["Zhang", "Jin", ""]]}, {"id": "1402.1761", "submitter": "Muriel  Medard", "authors": "Linda Zeger, Muriel M\\'edard", "title": "On Scalability of Wireless Networks: A Practical Primer for Large Scale\n  Cooperation", "comments": "7 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An intuitive overview of the scalability of a variety of types of wireless\nnetworks is presented. Simple heuris- tic arguments are demonstrated here for\nscaling laws presented in other works, as well as for conditions not previously\nconsidered in the literature. Unicast and multicast messages, topology,\nhierarchy, and effects of reliability protocols are discussed. We show how two\nkey factors, bottlenecks and erasures, can often domi- nate the network scaling\nbehavior. Scaling of through- put or delay with the number of transmitting\nnodes, the number of receiving nodes, and the file size is described.\n", "versions": [{"version": "v1", "created": "Fri, 7 Feb 2014 16:11:35 GMT"}], "update_date": "2016-11-26", "authors_parsed": [["Zeger", "Linda", ""], ["Médard", "Muriel", ""]]}, {"id": "1402.1819", "submitter": "Sahaya Rose Vigita", "authors": "Sahaya Rose Vigita, Golden Julie", "title": "Reliable Link-Based Routing Protocol for Highly Dynamic Mobile Adhoc\n  Networks", "comments": "7 pages, 8 figures, Published with International Journal of\n  Engineering Trends and Technology (IJETT)", "journal-ref": "International Journal of Engineering Trends and Technology\n  (IJETT)-Volume 4 Issue 5/ May 2013, Pages 1636 - 1642", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional topology-based MANET routing protocols use stateful routing which\nincreases the processing,communication and memory overheads. The high mobility\nof nodes in MANETs makes it difficult to maintain a deterministic route. To\novercome this, stateless geographic routing protocols which ensure reliable\ndata delivery have been proposed. It is found that link instability can be a\nmajor factor for unreliable data delivery. Driven by this issue, Link and\nPosition based Opportunistic Routing (L-POR) protocol which chooses a forwarder\nbased on the reception power of a node has been proposed. A back-up scheme is\nalso proposed to handle communication holes. Simulation results show that the\nproposed protocol achieves excellent performance even under high node mobility.\n", "versions": [{"version": "v1", "created": "Sat, 8 Feb 2014 04:31:18 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Vigita", "Sahaya Rose", ""], ["Julie", "Golden", ""]]}, {"id": "1402.1882", "submitter": "Hong Huang", "authors": "Hong Huang, Hajar Barani, and Hussein Al-Azzawi", "title": "Network Multiple-Input and Multiple-Output for Wireless Local Area\n  Networks", "comments": "This paper has been withdraw by the authors due to a crucial error in\n  algorithm 1", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a tutorial for network multiple-input and multiple-output\n(netMIMO) in wireless local area networks (WLAN). Wireless traffic demand is\ngrowing exponentially. NetMIMO allows access points (APs) in a WLAN to\ncooperate in their transmissions as if the APs form a single virtual MIMO node.\nNetMIMO can significantly increase network capacity by reducing interferences\nand contentions through the cooperation of the APs. This paper covers a few\nrepresentative netMIMO methods, ranging from interference alignment and\ncancelation, channel access protocol to allow MIMO nodes to join ongoing\ntransmissions, distributed synchronization, to interference and contention\nmitigation in multiple contention domains. We believe the netMIMO methods\ndescribed here are just the beginning of the new technologies to address the\nchallenge of ever-increasing wireless traffic demand, and the future will see\neven more new developments in this field.\n", "versions": [{"version": "v1", "created": "Sat, 8 Feb 2014 19:35:51 GMT"}, {"version": "v2", "created": "Mon, 5 May 2014 19:31:39 GMT"}], "update_date": "2014-05-06", "authors_parsed": [["Huang", "Hong", ""], ["Barani", "Hajar", ""], ["Al-Azzawi", "Hussein", ""]]}, {"id": "1402.1943", "submitter": "Ravi Raykundaliya", "authors": "G. Vijay Kumar, Ravikumar S. Raykundaliya, Dr. P. Naga Prasad", "title": "Proactive Web Server Protocol for Complaint Assessment", "comments": null, "journal-ref": "International Journal of Computer Trends and Technology (IJCTT)\n  6(40):4-6, December 2013", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vulnerability Discovery with attack Injection security threats are increasing\nfor the server software, when software is developed, the software tested for\nthe functionality. Due to unawareness of software vulnerabilities most of the\nsoftware before pre-Release the software should be thoroughly tested for not\nonly functionality reliability, but should be tested for the security flows\n(or) vulnerabilities. The approaches such as fuzzers, Fault injection,\nvulnerabilities scanners, static vulnerabilities analyzers, Run time prevention\nmechanisms and software Rejuvenation are identifying the un-patched software\nwhich is open for security threats address to solve the problem \"security\ntesting\". These techniques are useful for generating attacks but cannot be\nextendable for the new land of attacks. The system called proactive\nvulnerability attack injection tool is suitable for adding new attacks\ninjection vectors, methods to define new protocol states (or) Specification\nusing the interface of tool includes Network server protocol specification\nusing GUI, Attacks generator, Attack injector, monitoring module at the victim\ninjector, monitoring module at the victim machine and the attacks injection\nreport generation. This tool can address most of the vulnerabilities (or)\nsecurity flows.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2014 12:13:22 GMT"}], "update_date": "2014-02-12", "authors_parsed": [["Kumar", "G. Vijay", ""], ["Raykundaliya", "Ravikumar S.", ""], ["Prasad", "Dr. P. Naga", ""]]}, {"id": "1402.1946", "submitter": "Prajwal Thakare", "authors": "Prajwal R Thakare, K. Hanumantha Rao", "title": "Anomaly Detection Based on Access Behavior and Document Rank Algorithm", "comments": "6 pages, 3 figures", "journal-ref": "International Journal of Computer Trends and Technology (IJCTT)\n  6(39):4-6, December 2013", "doi": null, "report-no": null, "categories": "cs.NI cs.CR cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distributed denial of service(DDos) attack is ongoing dangerous threat to the\nInternet. Commonly, DDos attacks are carried out at the network layer, e.g. SYN\nflooding, ICMP flooding and UDP flooding, which are called Distributed denial\nof service attacks. The intention of these DDos attacks is to utilize the\nnetwork bandwidth and deny service to authorize users of the victim systems.\nObtain from the low layers, new application-layer-based DDos attacks utilizing\nauthorize HTTP requests to overload victim resources are more undetectable.\nWhen these are taking place during crowd events of any popular website, this is\nthe case is very serious. The state-of-art approaches cannot handle the\nsituation where there is no considerable deviation between the normal and the\nattackers activity. The page rank and proximity graph representation of online\nweb accesses takes much time in practice. There should be less computational\ncomplexity, than of proximity graph search. Hence proposing Web Access Table\nmechanism to hold the data such as \"who accessed what and how many times, and\ntheir rank on average\" to find the anomalous web access behavior. The system\ntakes less computational complexity and may produce considerable time\ncomplexity.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2014 12:50:58 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Thakare", "Prajwal R", ""], ["Rao", "K. Hanumantha", ""]]}, {"id": "1402.1974", "submitter": "Rajesh Chauhan Ramjanam", "authors": "Rajesh R Chauhan, G S Praveen Kumar", "title": "A Novel Approach to Detect Spam Worms Propagation with Monitoring the\n  Footprinting", "comments": null, "journal-ref": "International Journal of Computer Trends and Technology (IJCTT)\n  6(23):3-6, December 2013", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the key security threats on the Internet are the compromised machines\nthat can be used to launch various security attacks such as spamming and\nspreading malware, accessing useful information and DDoS. Attackers for\nspamming activity are volunteer by large number of compromised machines. Our\nmain focus is on detection of the compromised machines in a network that may be\nor are involved in the spamming activities; these machines are commonly known\nas spam zombies. Activities such as port scan, DB scan and so on are treated as\nmalicious activity within the network. So to overcome that we develop one of\nthe most effective spam zombie detection system within the network based on the\nbehavior of other systems as if performing the above activities are treated as\nzombies machines. If any system within the network try's to gather some\ninformation about any other system then this is treated as a malicious activity\nand should be not allowed to do so. SYN packets are used in order to initiate\ncommunication within the network so as to establish connection. If any system\ntry's to flood the network with these packets we can make an assumption that\nthe system is trying to gather the information about other system. This is what\ncalled footprinting. So we will try to detect any system involved in\nfootprinting and report to the administrator.\n", "versions": [{"version": "v1", "created": "Sun, 9 Feb 2014 18:19:59 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Chauhan", "Rajesh R", ""], ["Kumar", "G S Praveen", ""]]}, {"id": "1402.2108", "submitter": "Uttam Ghosh", "authors": "Waleed S. Alnumay and Uttam Ghosh", "title": "Secure Routing and Data Transmission in Mobile Ad Hoc Networks", "comments": null, "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.6, No.1, January 2014", "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In this paper, we present an identity (ID) based protocol that secures AODV\nand TCP so that it can be used in dynamic and attack prone environments of\nmobile ad hoc networks. The proposed protocol protects AODV using Sequential\nAggregate Signatures (SAS) based on RSA. It also generates a session key for\neach pair of source-destination nodes of a MANET for securing the end-to-end\ntransmitted data. Here each node has an ID which is evaluated from its public\nkey and the messages that are sent are authenticated with a signature/ MAC. The\nproposed scheme does not allow a node to change its ID throughout the network\nlifetime. Thus it makes the network secure against attacks that target AODV and\nTCP in MANET. We present performance analysis to validate our claim.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2014 11:17:18 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Alnumay", "Waleed S.", ""], ["Ghosh", "Uttam", ""]]}, {"id": "1402.2110", "submitter": "Smitha Pai N", "authors": "Smitha N. Pai, K.C. Shet and H.S Mruthyunjaya", "title": "In-network Aggregation using Efficient Routing Techniques for Event\n  Driven Sensor Network", "comments": "20 pages 16 figures, 7 tables", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.6, No.1, January 2014", "doi": "10.5121/ijcnc.2014.6110", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sensors used in applications such as agriculture, weather, etc., monitoring\nphysical parameters like soil moisture, temperature, humidity, will have to\nsustain their battery power for long intervals of time. In order to accomplish\nthis, parameter which assists in reducing the consumption of power from battery\nneed to be attended to. One of the factors affecting the consumption of energy\nis transmit and receive power. This energy consumption can be reduced by\navoiding unnecessary transmission and reception. Efficient routing techniques\nand incorporating aggregation whenever possible can save considerable amount of\nenergy. Aggregation reduces repeated transmission of relative values and also\nreduces lot of computation at the base station. In this paper, the benefits of\naggregation over direct transmission in saving the amount of energy consumed is\ndiscussed. Routing techniques which assist aggregation are incorporated.\nAspects like transmission of average value of sensed data around an area of the\nnetwork, minimum value in the whole of the network, triggering of event when\nthere is low battery are assimilated.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2014 11:21:41 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Pai", "Smitha N.", ""], ["Shet", "K. C.", ""], ["Mruthyunjaya", "H. S", ""]]}, {"id": "1402.2140", "submitter": "Aybars Ural", "authors": "Vedat Kavalci, Aybars Ural and Orhan Dagdeviren", "title": "Distributed Vertex Cover Algorithms For Wireless Sensor Networks", "comments": null, "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.6, No.1, January 2014", "doi": "10.5121/ijcnc.2014.6107", "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vertex covering has important applications for wireless sensor networks such\nas monitoring link failures, facility location, clustering, and data\naggregation. In this study, we designed three algorithms for constructing\nvertex cover in wireless sensor networks. The first algorithm, which is an\nadaption of the Parnas & Ron's algorithm, is a greedy approach that finds a\nvertex cover by using the degrees of the nodes. The second algorithm finds a\nvertex cover from graph matching where Hoepman's weighted matching algorithm is\nused. The third algorithm firstly forms a breadth-first search tree and then\nconstructs a vertex cover by selecting nodes with predefined levels from\nbreadth-first tree. We show the operation of the designed algorithms, analyze\nthem, and provide the simulation results in the TOSSIM environment. Finally we\nhave implemented, compared and assessed all these approaches. The transmitted\nmessage count of the first algorithm is smallest among other algorithms where\nthe third algorithm has turned out to be presenting the best results in vertex\ncover approximation ratio.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2014 13:30:25 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Kavalci", "Vedat", ""], ["Ural", "Aybars", ""], ["Dagdeviren", "Orhan", ""]]}, {"id": "1402.2187", "submitter": "Carlo Rodrigues KLEBER", "authors": "Carlo Kleber Da Silva Rodrigues", "title": "Analyzing Peer Selection Policies for BitTorrent Multimedia On-Demand\n  Streaming Systems in Internet", "comments": "19 PAGES", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.6, No.1, January 2014", "doi": "10.5121/ijcnc.2014.6114", "report-no": null, "categories": "cs.NI cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The adaptation of the BitTorrent protocol to multimedia on-demand streaming\nsystems essentially lies on the modification of its two core algorithms, namely\nthe piece and the peer selection policies, respectively. Much more attention\nhas though been given to the piece selection policy. Within this context, this\narticle proposes three novel peer selection policies for the design of\nBitTorrent-like protocols targeted at that type of systems: Select Balanced\nNeighbour Policy (SBNP), Select Regular Neighbour Policy (SRNP), and Select\nOptimistic Neighbour Policy (SONP). These proposals are validated through a\ncompetitive analysis based on simulations which encompass a variety of\nmultimedia scenarios, defined in function of important characterization\nparameters such as content type, content size, and client interactivity\nprofile. Service time, number of clients served and efficiency retrieving\ncoefficient are the performance metrics assessed in the analysis. The final\nresults mainly show that the novel proposals constitute scalable solutions that\nmay be considered for real project designs. Lastly, future work is included in\nthe conclusion of this paper.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2014 15:36:41 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Rodrigues", "Carlo Kleber Da Silva", ""]]}, {"id": "1402.2204", "submitter": "Saibharath S", "authors": "S. Saibharath and J. Aarthi", "title": "Virtual Backbone Trees for Most Minimal Energy Consumption and\n  Increasing Network Lifetime In WSNs", "comments": "10 pages, 4 figures, International Journal of Computer Networks &\n  Communications (IJCNC) Vol.6, No.1, January 2014", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.6, No.1, January 2014", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Virtual backbone trees have been used for efficient communication between\nsink node and any other node in the deployed area. But all the proposed virtual\nbackbone trees are not fully energy efficient and EVBTs have few flaws\nassociated with them. In this paper two such virtual backbones are proposed.\nThe motive behind the first algorithm, Most Minimal Energy Virtual Backbone\nTree (MMEVBT), is to minimise the energy consumption when packets are\ntransmitted between sink and a target sensor node. The energy consumption is\nmost minimal and optimal and it is shown why it always has minimal energy\nconsumption during any transfer of packet between every node with the sink\nnode. For every node, route path with most minimal energy consumption is\nidentified and a new tree node is elected only when a better minimal energy\nconsumption route is identified for a node to communicate with the sink and\nvice versa. By moving sink periodically it is ensured the battery of the nodes\nnear sink is not completely drained out. Another backbone construction\nalgorithm is proposed which maximises the network lifetime by increasing the\nlifetime of all tree nodes. Simulations are done in NS2 to practically test the\nalgorithms and the results are discussed in detail.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2014 16:43:00 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Saibharath", "S.", ""], ["Aarthi", "J.", ""]]}, {"id": "1402.2217", "submitter": "Nirbhay Chaubey Kumar", "authors": "Akshai Aggarwal, Savita Gandhi, Nirbhay Chaubey", "title": "Performance Analysis of AODV, DSDV and DSR in MANETs", "comments": "11 Pages, 8 Figure and 2 Tables", "journal-ref": null, "doi": "10.5121/ijdps.2011.2615", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile Ad hoc Networks (MANETs) are considered as a new paradigm of\ninfrastructure-less mobile wireless communication systems. MANETs are being\nwidely studied and it is the technology that is attracting a large variety of\napplications. Routing in MANETs is considered a challenging task due to the\nunpredictable changes in the network topology, resulting from the random and\nfrequent movement of the nodes and due to the absence of any centralized\ncontrol [1][2]. In this paper, we evaluate the performance of reactive routing\nprotocols, Ad hoc On demand Distance Vector (AODV) and Dynamic Source Routing\n(DSR) and proactive routing protocol Destination Sequenced Distance Vector\n(DSDV). The major goal of this study is to analyze the performance of well\nknown MANETs routing protocol in high mobility case under low, medium and high\ndensity scenario. Unlike military applications, most of the other applications\nof MANETs require moderate to high mobility. Hence it becomes important to\nstudy the impact of high mobility on the performance of these routing\nprotocols. The performance is analyzed with respect to Average End-to-End\nDelay, Normalized Routing Load (NRL), Packet Delivery Fraction (PDF) and\nThroughput. Simulation results verify that AODV gives better performance as\ncompared to DSR and DSDV.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2014 17:20:35 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["Aggarwal", "Akshai", ""], ["Gandhi", "Savita", ""], ["Chaubey", "Nirbhay", ""]]}, {"id": "1402.2228", "submitter": "Wolfgang John", "authors": "Wolfgang John, Alisa Devlic, Zhemin Ding, David Jocha, Andras Kern,\n  Mario Kind, Andreas K\\\"opsel, Viktor Nordell, Sachin Sharma, Pontus\n  Sk\\\"oldstr\\\"om, Dimitri Staessens, Attila Takacs, Steffen Topp, F.-Joachim\n  Westphal, Hagen Woesner and Andreas Gladisch", "title": "Split Architecture for Large Scale Wide Area Networks", "comments": "This is the public deliverable D3.3 of the EU FP7 SPARC project\n  (ICT-258457) - \"Split Architecture for Carrier Grade Networks\". Original\n  Deliverable published at http://www.fp7-sparc.eu/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This report defines a carrier-grade split architecture based on requirements\nidentified during the SPARC project. It presents the SplitArchitecture\nproposal, the SPARC concept for Software Defined Networking (SDN) introduced\nfor large-scale wide area networks such as access/aggregation networks, and\nevaluates technical issues against architectural trade-offs. First we present\nthe control and management architecture of the proposed SplitArchitecture.\nHere, we discuss a recursive control architecture consisting of hierarchically\nstacked control planes and provide initial considerations regarding network\nmanagement integration to SDN in general and SplitArchitecture in particular.\nNext, OpenFlow extensions to support the carrier-grade SplitArchitecture are\ndiscussed. These are: a) Openness & Extensibility; b) Virtualization; c) OAM;\nd) Resiliency approaches; e) Bootstrapping and topology discovery; f) Service\ncreation; g) Energy-efficient networking; h) QoS aspects; and i) Multilayer\naspects. In addition, we discuss selected deployment and adoption scenarios\nfaced by modern operator networks, such as service creation scenarios and\npeering aspects, i.e., how to interconnect with legacy networks. Finally, we\nindicate how our SplitArchitecture approach meets carrier grade scalability\nrequirements in access/aggregation network scenarios\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2014 15:26:51 GMT"}], "update_date": "2014-02-11", "authors_parsed": [["John", "Wolfgang", ""], ["Devlic", "Alisa", ""], ["Ding", "Zhemin", ""], ["Jocha", "David", ""], ["Kern", "Andras", ""], ["Kind", "Mario", ""], ["Köpsel", "Andreas", ""], ["Nordell", "Viktor", ""], ["Sharma", "Sachin", ""], ["Sköldström", "Pontus", ""], ["Staessens", "Dimitri", ""], ["Takacs", "Attila", ""], ["Topp", "Steffen", ""], ["Westphal", "F. -Joachim", ""], ["Woesner", "Hagen", ""], ["Gladisch", "Andreas", ""]]}, {"id": "1402.2231", "submitter": "William Bradley", "authors": "J. N. Laska, W. F. Bradley, T. W. Rondeau, K. E. Nolan, and B. Vigoda", "title": "Compressive sensing for dynamic spectrum access networks: Techniques and\n  tradeoffs", "comments": "2011 IEEE Symposium on New Frontiers in Dynamic Spectrum, May 2011", "journal-ref": null, "doi": "10.1109/DYSPAN.2011.5936202", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore the practical costs and benefits of CS for dynamic spectrum access\n(DSA) networks. Firstly, we review several fast and practical techniques for\nenergy detection without full reconstruction and provide theoretical\nguarantees. We also define practical metrics to measure the performance of\nthese techniques. Secondly, we perform comprehensive experiments comparing the\ntechniques on real signals captured over the air. Our results show that we can\nsignificantly compressively acquire the signal while still accurately\ndetermining spectral occupancy.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2014 18:27:53 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Laska", "J. N.", ""], ["Bradley", "W. F.", ""], ["Rondeau", "T. W.", ""], ["Nolan", "K. E.", ""], ["Vigoda", "B.", ""]]}, {"id": "1402.2327", "submitter": "Zbigniew Lipi\\'nski", "authors": "Z. Lipi\\'nski", "title": "On the role of symmetry in solving maximum lifetime problem in\n  two-dimensional sensor networks", "comments": "14 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze a continuous and discrete symmetries of the maximum lifetime\nproblem in two dimensional sensor networks. We show, how a symmetry of the\nnetwork and invariance of the problem under a given transformation group $G$\ncan be utilized to simplify its solution. We prove, that for a $G$-invariant\nmaximum lifetime problem there exists a $G$-invariant solution. Constrains\nwhich follow from the $G$-invariance allow to reduce the problem and its\nsolution to a subset, an optimal fundamental region of the sensor network. We\nanalyze in detail solutions of the maximum lifetime problem invariant under a\ngroup of isometry transformations of a two dimensional Euclidean plane.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2014 23:17:34 GMT"}, {"version": "v2", "created": "Wed, 16 Jul 2014 10:02:22 GMT"}], "update_date": "2014-07-17", "authors_parsed": [["Lipiński", "Z.", ""]]}, {"id": "1402.2390", "submitter": "Shuqin Li", "authors": "Shuqin Li and Liyu Cai", "title": "A Distributed Optimization Framework For Multi-channel Multi-user Small\n  Cell Networks", "comments": "Technical report of the paper with the same name to be published in\n  IEEE communication letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Small cell enchantment is emerging as the key technique for wireless network\nevolution. One challenging problem for small cell enhancement is how to achieve\nhigh data rate with as-low-as-possible control and computation overheads. As a\nsolution, we propose a low-complexity distributed optimization framework in\nthis paper. Our solution includes two parts. One is a novel implicit\ninformation exchange mechanism that enables channel-aware opportunistic\nscheduling and resource allocation among links. The other is the sub-gradient\nbased algorithm with a polynomial-time complexity. What is more, for large\nscale systems, we design an improved distributed algorithm based on insights\nobtained from the problem structure. This algorithm achieves a close-to-optimal\nperformance with a much lower complexity. Our numerical evaluations validate\nthe analytical results and show the advantage of our algorithms.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2014 08:06:38 GMT"}], "update_date": "2014-02-12", "authors_parsed": [["Li", "Shuqin", ""], ["Cai", "Liyu", ""]]}, {"id": "1402.2489", "submitter": "Yingjie Zhou", "authors": "Yingjie Zhou, Nicholas Maxemchuk, Xiangying Qian, Chen Wang", "title": "The Fair Distribution of Power to Electric Vehicles: An Alternative to\n  Pricing", "comments": "accepted in IEEE Smartgridcomm'14", "journal-ref": null, "doi": "10.1109/SmartGridComm.2014.7007727", "report-no": null, "categories": "cs.NI cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the popularity of electric vehicles increases, the demand for more power\ncan increase more rapidly than our ability to install additional generating\ncapacity. In the long term we expect that the supply and demand will become\nbalanced. However, in the interim the rate at which electric vehicles can be\ndeployed will depend on our ability to charge these vehicles without\ninconveniencing their owners. In this paper, we investigate using fairness\nmechanisms to distribute power to electric vehicles on a smart grid. We assume\nthat during peak demand there is insufficient power to charge all the vehicles\nsimultaneously. In each five minute interval of time we select a subset of the\nvehicles to charge, based upon information about the vehicles. We evaluate the\nselection mechanisms using published data on the current demand for electric\npower as a function of time of day, current driving habits for commuting, and\nthe current rates at which electric vehicles can be charged on home outlets. We\nfound that conventional selection strategies, such as first-come-first-served\nor round robin, may delay a significant fraction of the vehicles by more than\ntwo hours, even when the total available power over the course of a day is two\nor three times the power required by the vehicles. However, a selection\nmechanism that minimizes the maximum delay can reduce the delays to a few\nminutes, even when the capacity available for charging electric vehicles\nexceeds their requirements by as little as 5%.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2014 14:06:36 GMT"}, {"version": "v2", "created": "Wed, 30 Jul 2014 01:30:44 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Zhou", "Yingjie", ""], ["Maxemchuk", "Nicholas", ""], ["Qian", "Xiangying", ""], ["Wang", "Chen", ""]]}, {"id": "1402.2531", "submitter": "Sangeetha Abdu Jyothi", "authors": "Sangeetha Abdu Jyothi, Ankit Singla, P. Brighten Godfrey, Alexandra\n  Kolla", "title": "Measuring and Understanding Throughput of Network Topologies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  High throughput is of particular interest in data center and HPC networks.\nAlthough myriad network topologies have been proposed, a broad head-to-head\ncomparison across topologies and across traffic patterns is absent, and the\nright way to compare worst-case throughput performance is a subtle problem.\n  In this paper, we develop a framework to benchmark the throughput of network\ntopologies, using a two-pronged approach. First, we study performance on a\nvariety of synthetic and experimentally-measured traffic matrices (TMs).\nSecond, we show how to measure worst-case throughput by generating a\nnear-worst-case TM for any given topology. We apply the framework to study the\nperformance of these TMs in a wide range of network topologies, revealing\ninsights into the performance of topologies with scaling, robustness of\nperformance across TMs, and the effect of scattered workload placement. Our\nevaluation code is freely available.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2014 15:41:31 GMT"}, {"version": "v2", "created": "Wed, 19 Mar 2014 22:16:52 GMT"}, {"version": "v3", "created": "Mon, 9 Feb 2015 12:11:31 GMT"}, {"version": "v4", "created": "Tue, 15 Nov 2016 04:17:21 GMT"}], "update_date": "2016-11-16", "authors_parsed": [["Jyothi", "Sangeetha Abdu", ""], ["Singla", "Ankit", ""], ["Godfrey", "P. Brighten", ""], ["Kolla", "Alexandra", ""]]}, {"id": "1402.2622", "submitter": "Emmanuel Baccelli", "authors": "Emmanuel Baccelli (INRIA Saclay - Ile de France), Oliver Hahm (INRIA\n  Saclay - Ile de France), Matthias W\\\"ahlisch", "title": "Spontaneous Wireless Networking to Counter Pervasive Monitoring", "comments": "W3C / IAB workshop on Strengthening the Internet Against Pervasive\n  Monitoring (STRINT) (2014)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several approaches can be employed to counter pervasive monitoring at large\nscale on the Internet. One category of approaches aims to harden the current\nInternet architecture and to increase the security of high profile targets\n(data centers, exchange points etc.). Another category of approaches aims\ninstead for target dispersal, i.e. disabling systematic mass surveillance via\nthe elimination of existing vantage points, thus forcing surveillance efforts\nto be more specific and personalized. This paper argues how networking\napproaches that do not rely on central entities -- but rather on spontaneous\ninteraction, as locally as possible, between autonomous peer entities -- can\nhelp realize target dispersal and thus counter pervasive monitoring.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2014 20:14:47 GMT"}], "update_date": "2014-02-12", "authors_parsed": [["Baccelli", "Emmanuel", "", "INRIA Saclay - Ile de France"], ["Hahm", "Oliver", "", "INRIA\n  Saclay - Ile de France"], ["Wählisch", "Matthias", ""]]}, {"id": "1402.2680", "submitter": "Marcos Manzano Mr.", "authors": "Marc Manzano, Anna Manolova Fagertun, Sarah Ruepp, Eusebi Calle,\n  Caterina Scoglio, Ali Sydney, Antonio de la Oliva, and Alfonso Mu\\~noz", "title": "Unveiling Potential Failure Propagation Scenarios in Core Transport\n  Networks", "comments": "Submitted to IEEE Communications Magazine", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The contemporary society has become more dependent on telecommunication\nnetworks. Novel services and technologies supported by such networks, such as\ncloud computing or e-Health, hold a vital role in modern day living.\nLarge-scale failures are prone to occur, thus being a constant threat to\nbusiness organizations and individuals. To the best of our knowledge, there are\nno publicly available reports regarding failure propagation in core transport\nnetworks. Furthermore, Software Defined Networking (SDN) is becoming more\nprevalent in our society and we can envision more SDN-controlled Backbone\nTransport Networks (BTNs) in the future. For this reason, we investigate the\nmain motivations that could lead to epidemic-like failures in BTNs and SDNTNs.\nTo do so, we enlist the expertise of several research groups with significant\nbackground in epidemics, network resiliency, and security. In addition, we\nconsider the experiences of three network providers. Our results illustrate\nthat Dynamic Transport Networks (DTNs) are prone to epidemic-like failures.\nMoreover, we propose different situations in which a failure can propagate in\nSDNTNs. We believe that the key findings will aid network engineers and the\nscientific community to predict this type of disastrous failure scenario and\nplan adequate survivability strategies.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2014 21:57:55 GMT"}], "update_date": "2014-02-13", "authors_parsed": [["Manzano", "Marc", ""], ["Fagertun", "Anna Manolova", ""], ["Ruepp", "Sarah", ""], ["Calle", "Eusebi", ""], ["Scoglio", "Caterina", ""], ["Sydney", "Ali", ""], ["de la Oliva", "Antonio", ""], ["Muñoz", "Alfonso", ""]]}, {"id": "1402.2963", "submitter": "William Bradley", "authors": "William F. Bradley", "title": "Running in Circles: Packet Routing on Ring Networks", "comments": "Bradley, William F. (2002). Running in circles: packet routing on\n  ring networks (Doctoral dissertation, Massachusetts Institute of Technology)", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I analyze packet routing on unidirectional ring networks, with an eye towards\nestablishing bounds on the expected length of the queues. Suppose we route\npackets by a greedy \"hot potato\" protocol. If packets are inserted by a\nBernoulli process and have uniform destinations around the ring, and if the\nnominal load is kept fixed, then I can construct an upper bound on the expected\nqueue length per node that is independent of the size of the ring. If the\npackets only travel one or two steps, I can calculate the exact expected queue\nlength for rings of any size.\n  I also show some stability results under more general circumstances. If the\npackets are inserted by any ergodic hidden Markov process with nominal loads\nless than one, and routed by any greedy protocol, I prove that the ring is\nergodic.\n", "versions": [{"version": "v1", "created": "Wed, 12 Feb 2014 20:29:58 GMT"}], "update_date": "2014-02-13", "authors_parsed": [["Bradley", "William F.", ""]]}, {"id": "1402.3074", "submitter": "Parastoo Sadeghi", "authors": "Ulric J. Ferner, Parastoo Sadeghi, Neda Aboutorab, and Muriel Medard", "title": "Scheduling Advantages of Network Coded Storage in Point-to-Multipoint\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider scheduling strategies for point-to-multipoint (PMP) storage area\nnetworks (SANs) that use network coded storage (NCS). In particular, we present\na simple SAN system model, two server scheduling algorithms for PMP networks,\nand analytical expressions for internal and external blocking probability. We\npoint to select scheduling advantages in NCS systems under normal operating\nconditions, where content requests can be temporarily denied owing to finite\nsystem capacity from drive I/O access or storage redundancy limitations. NCS\ncan lead to improvements in throughput and blocking probability due to\nincreased immediate scheduling options, and complements other well documented\nNCS advantages such as regeneration, and can be used as a guide for future\nstorage system design.\n", "versions": [{"version": "v1", "created": "Thu, 13 Feb 2014 10:07:06 GMT"}], "update_date": "2014-02-14", "authors_parsed": [["Ferner", "Ulric J.", ""], ["Sadeghi", "Parastoo", ""], ["Aboutorab", "Neda", ""], ["Medard", "Muriel", ""]]}, {"id": "1402.3225", "submitter": "Mohammad Hassan Lotfi", "authors": "Mohammad Hassan Lotfi, George Kesidis, Saswati Sarkar", "title": "Market-Based Power Allocation for a Differentially Priced FDMA System", "comments": "5 Pages, 2 Figures, Conference Publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.GT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the problem of differential pricing and QoS\nassignment by a broadband data provider. In our model, the broadband data\nprovider decides on the power allocated to an end-user not only based on\nparameters of the transmission medium, but also based on the price the user is\nwilling to pay. In addition, end-users bid the price that they are willing to\npay to the BTS based on their channel condition, the throughput they require,\nand their belief about other users' parameters. We will characterize the\noptimum power allocation by the BTS which turns out to be a modification of the\nsolution to the well-known water-filling problem. We also characterize the\noptimum bidding strategy of end-users using the belief of each user about the\ncell condition.\n", "versions": [{"version": "v1", "created": "Thu, 13 Feb 2014 17:16:23 GMT"}, {"version": "v2", "created": "Mon, 28 Apr 2014 17:09:58 GMT"}, {"version": "v3", "created": "Tue, 30 Sep 2014 20:47:26 GMT"}], "update_date": "2014-10-02", "authors_parsed": [["Lotfi", "Mohammad Hassan", ""], ["Kesidis", "George", ""], ["Sarkar", "Saswati", ""]]}, {"id": "1402.3332", "submitter": "Cesar Ghali", "authors": "Cesar Ghali, Gene Tsudik and Ersin Uzun", "title": "Elements of Trust in Named-Data Networking", "comments": "9 pages, 2 figures", "journal-ref": "ACM SIGCOMM Computer Communication Review, Volume 44 Issue 5,\n  October 2014", "doi": "10.1145/2677046.2677049", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In contrast to today's IP-based host-oriented Internet architecture,\nInformation-Centric Networking (ICN) emphasizes content by making it directly\naddressable and routable. Named Data Networking (NDN) architecture is an\ninstance of ICN that is being developed as a candidate next-generation Internet\narchitecture. By opportunistically caching content within the network (in\nrouters), NDN appears to be well-suited for large-scale content distribution\nand for meeting the needs of increasingly mobile and bandwidth-hungry\napplications that dominate today's Internet.\n  One key feature of NDN is the requirement for each content object to be\ndigitally signed by its producer. Thus, NDN should be, in principle, immune to\ndistributing fake (aka \"poisoned\") content. However, in practice, this poses\ntwo challenges for detecting fake content in NDN routers: (1) overhead due to\nsignature verification and certificate chain traversal, and (2) lack of trust\ncontext, i.e., determining which public keys are trusted to verify which\ncontent. Because of these issues, NDN does not force routers to verify content\nsignatures, which makes the architecture susceptible to content poisoning\nattacks.\n  This paper explores root causes of, and some cures for, content poisoning\nattacks in NDN. In the process, it becomes apparent that meaningful mitigation\nof content poisoning is contingent upon a network-layer trust management\narchitecture, elements of which we construct while carefully justifying\nspecific design choices. This work represents the initial effort towards\ncomprehensive trust management for NDN.\n", "versions": [{"version": "v1", "created": "Thu, 13 Feb 2014 23:11:57 GMT"}, {"version": "v2", "created": "Mon, 17 Feb 2014 17:28:53 GMT"}, {"version": "v3", "created": "Thu, 20 Feb 2014 20:53:19 GMT"}, {"version": "v4", "created": "Wed, 26 Feb 2014 00:49:02 GMT"}, {"version": "v5", "created": "Thu, 30 Oct 2014 18:38:35 GMT"}], "update_date": "2014-10-31", "authors_parsed": [["Ghali", "Cesar", ""], ["Tsudik", "Gene", ""], ["Uzun", "Ersin", ""]]}, {"id": "1402.3374", "submitter": "Thippeswamy B M", "authors": "B M Thippeswamy, S Reshma, K Shaila, K R Venugopal, S S Iyengar, L M\n  Patnaik", "title": "EDOCR: Energy Density On-demand Cluster Routing in Wireless Sensor\n  Networks", "comments": "18 pages,7 Figures", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) Vol.6, No.1, January 2014", "doi": "10.5121/ijcnc.2014.6115", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Energy management is one of the critical parameters in Wireless Sensor\nNetworks. In this paper we attempt for a solution to balance the energy usage\nfor maximizing the network lifetime, increase the packet delivery ratio and\nthroughput. Our proposed algorithm is based on Energy Density of the clusters\nin Wireless Sensor Networks. The cluster head is selected using two step method\nand on-demand routing approach to calculate the balanced energy shortest path\nfrom source to sink. This unique approach maintains the balanced energy\nutilization among all nodes by selecting the different cluster heads\ndynamically. Our simulation results have compared with one of the plain routing\nscheme (EBRP) and cluster based routing (TSCHS), which shows the significant\nimprovements in minimizing the delay and energy utilization and maximizing the\nnetwork lifetime and throughput with respect to these works.\n", "versions": [{"version": "v1", "created": "Fri, 14 Feb 2014 06:16:01 GMT"}], "update_date": "2014-02-17", "authors_parsed": [["Thippeswamy", "B M", ""], ["Reshma", "S", ""], ["Shaila", "K", ""], ["Venugopal", "K R", ""], ["Iyengar", "S S", ""], ["Patnaik", "L M", ""]]}, {"id": "1402.3401", "submitter": "Emiliano De Cristofaro", "authors": "Abdelberi Chaabane, Terence Chen, Mathieu Cunche, Emiliano De\n  Cristofaro, Arik Friedman, Mohamed Ali Kaafar", "title": "Censorship in the Wild: Analyzing Internet Filtering in Syria", "comments": "A preliminary version of this paper appears in IMC 2014. This is the\n  full version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet censorship is enforced by numerous governments worldwide, however,\ndue to the lack of publicly available information, as well as the inherent\nrisks of performing active measurements, it is often hard for the research\ncommunity to investigate censorship practices in the wild. Thus, the leak of\n600GB worth of logs from 7 Blue Coat SG-9000 proxies, deployed in Syria to\nfilter Internet traffic at a country scale, represents a unique opportunity to\nprovide a detailed snapshot of a real-world censorship ecosystem. This paper\npresents the methodology and the results of a measurement analysis of the\nleaked Blue Coat logs, revealing a relatively stealthy, yet quite targeted,\ncensorship. We find that traffic is filtered in several ways: using IP\naddresses and domain names to block subnets or websites, and keywords or\ncategories to target specific content. We show that keyword-based censorship\nproduces some collateral damage as many requests are blocked even if they do\nnot relate to sensitive content. We also discover that Instant Messaging is\nheavily censored, while filtering of social media is limited to specific pages.\nFinally, we show that Syrian users try to evade censorship by using web/socks\nproxies, Tor, VPNs, and BitTorrent. To the best of our knowledge, our work\nprovides the first analytical look into Internet filtering in Syria.\n", "versions": [{"version": "v1", "created": "Fri, 14 Feb 2014 09:13:11 GMT"}, {"version": "v2", "created": "Wed, 19 Feb 2014 07:45:54 GMT"}, {"version": "v3", "created": "Sun, 18 May 2014 16:09:40 GMT"}, {"version": "v4", "created": "Sun, 7 Sep 2014 08:55:11 GMT"}, {"version": "v5", "created": "Wed, 5 Nov 2014 19:31:15 GMT"}], "update_date": "2014-11-06", "authors_parsed": [["Chaabane", "Abdelberi", ""], ["Chen", "Terence", ""], ["Cunche", "Mathieu", ""], ["De Cristofaro", "Emiliano", ""], ["Friedman", "Arik", ""], ["Kaafar", "Mohamed Ali", ""]]}, {"id": "1402.3655", "submitter": "V Karthikeyan VKK", "authors": "V. Karthikeyan, A. Vinod, P. Jeyakumar", "title": "An Energy Efficient Neighbour Node Discovery Method for Wireless Sensor\n  Networks", "comments": "4 figures and 5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The discovery of neighbouring nodes in multihop wireless networks has become\na key challenge. Due to tribulations in communication, synchronization loss\nbetween nodes, disparity in transmission power etc, the connectivity of nodes\nwill always experience disruptions. On the other hand, the energy utilization\nby the nodes also became critical . In this paper, we propose a new method for\nneighbour discovery in wireless sensor networks (WSNs) which pays an eminent\nconsideration for energy utilization and QoS parameters like latency,\nthroughput, error rate etc. In the proposed method, the network routing is\nenhanced using AOMDV protocol which can accurately discover the neighbour nodes\nand power management with HMAC protocol which reduces the energy utilization\nsignificantly. A complete analysis is being performed to estimate how the Q o S\nmetrics varies in various scenarios of power consumption in wireless networks.\n", "versions": [{"version": "v1", "created": "Sat, 15 Feb 2014 06:33:50 GMT"}], "update_date": "2014-02-18", "authors_parsed": [["Karthikeyan", "V.", ""], ["Vinod", "A.", ""], ["Jeyakumar", "P.", ""]]}, {"id": "1402.3656", "submitter": "V Karthikeyan VKK", "authors": "V. Karthikeyan, V.J. Vijayalakshmi", "title": "Analysis of Carrier Frequency Selective Offset Estimation - Using\n  Zero-IF and ZCZIn MC-DS-CDMA", "comments": "5 pages and 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new method for frequency synchronization based upon Zero-Intermediate\nFrequency Zero-IF receiver and characteristics of the received signal s power\nspectrum for MC-DSCDMA Up link system is proposed in this paper. In addition to\nthis, employing Zero Correlation Zone (ZCZ) sequences, designed specifically\nfor quasi synchronous up link transmissions, is proposed to exploit frequency\nand temporal diversity in frequency-selective block fading channels. The\nvariance for Carrier Frequency Offset (CFO) estimators of MC DS CDMA Uplink is\ncompared with that of an OFDM system to estimate the CFO. Our study and results\nshow that the MC DS CDMA system is outperforming the OFDM method\n", "versions": [{"version": "v1", "created": "Sat, 15 Feb 2014 06:44:30 GMT"}], "update_date": "2014-02-18", "authors_parsed": [["Karthikeyan", "V.", ""], ["Vijayalakshmi", "V. J.", ""]]}, {"id": "1402.3696", "submitter": "Nicolas Broutin", "authors": "Nicolas Broutin, Luc Devroye and G\\'abor Lugosi", "title": "Connectivity of sparse Bluetooth networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.DM cs.NI math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a random geometric graph defined on $n$ vertices uniformly\ndistributed in the $d$-dimensional unit torus. Two vertices are connected if\ntheir distance is less than a \"visibility radius\" $r_n$. We consider {\\sl\nBluetooth networks} that are locally sparsified random geometric graphs. Each\nvertex selects $c$ of its neighbors in the random geometric graph at random and\nconnects only to the selected points. We show that if the visibility radius is\nat least of the order of $n^{-(1-\\delta)/d}$ for some $\\delta > 0$, then a\nconstant value of $c$ is sufficient for the graph to be connected, with high\nprobability. It suffices to take $c \\ge \\sqrt{(1+\\epsilon)/\\delta} + K$ for any\npositive $\\epsilon$ where $K$ is a constant depending on $d$ only. On the other\nhand, with $c\\le \\sqrt{(1-\\epsilon)/\\delta}$, the graph is disconnected, with\nhigh probability.\n", "versions": [{"version": "v1", "created": "Sat, 15 Feb 2014 14:27:12 GMT"}], "update_date": "2014-02-18", "authors_parsed": [["Broutin", "Nicolas", ""], ["Devroye", "Luc", ""], ["Lugosi", "Gábor", ""]]}, {"id": "1402.3951", "submitter": "Jeroen van der Ham PhD", "authors": "Jeroen van der Ham and Mattijs Ghijsen and Paola Grosso and Cees de\n  Laat", "title": "Trends in Computer Network Modeling Towards the Future Internet", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  This article provides a taxonomy of current and past network modeling\nefforts. In all these efforts over the last few years we see a trend towards\nnot only describing the network, but connected devices as well. This is\nespecially current given the many Future Internet projects, which are combining\ndifferent models, and resources in order to provide complete virtual\ninfrastructures to users.\n  An important mechanism for managing complexity is the creation of an abstract\nmodel, a step which has been undertaken in computer networks too. The fact that\nmore and more devices are network capable, coupled with increasing popularity\nof the Internet, has made computer networks an important focus area for\nmodeling. The large number of connected devices creates an increasing\ncomplexity which must be harnessed to keep the networks functioning.\n  Over the years many different models for computer networks have been\nproposed, and used for different purposes. While for some time the community\nhas moved away from the need of full topology exchange, this requirement\nresurfaced for optical networks. Subsequently, research on topology\ndescriptions has seen a rise in the last few years. Many different models have\nbeen created and published, yet there is no publication that shows an overview\nof the different approaches.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2014 10:15:16 GMT"}, {"version": "v2", "created": "Wed, 5 Mar 2014 15:33:57 GMT"}], "update_date": "2014-03-06", "authors_parsed": [["van der Ham", "Jeroen", ""], ["Ghijsen", "Mattijs", ""], ["Grosso", "Paola", ""], ["de Laat", "Cees", ""]]}, {"id": "1402.3982", "submitter": "Juhoon Kim", "authors": "Juhoon Kim, Nadi Sarrar, Anja Feldmann", "title": "Watching the IPv6 Takeoff from an IXP's Viewpoint", "comments": "Also appears as TU-Berlin technical report 2013-01, ISSN: 1436-9915", "journal-ref": null, "doi": null, "report-no": "2014-01 (ISSN: 1436-9915)", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The different level of interest in deploying the new Internet address space\nacross network operators has kept IPv6 tardy in its deployment. However, since\nthe last block of IPv4 addresses has been assigned, Internet communities took\nthe concern of the address space scarcity seriously and started to move forward\nactively. After the successful IPv6 test on 8 June, 2011 (World IPv6 Day [1]),\nnetwork operators and service/content providers were brought together for\npreparing the next step of the IPv6 global deployment (World IPv6 Launch on 6\nJune, 2012 [2]). The main purpose of the event was to permanently enable their\nIPv6 connectivity. In this paper, based on the Internet traffic collected from\na large European Internet Exchange Point (IXP), we present the status of IPv6\ntraffic mainly focusing on the periods of the two global IPv6 events. Our\nresults show that IPv6 traffic is responsible for a small fraction such as 0.5\n% of the total traffic in the peak period. Nevertheless, we are positively\nimpressed by the facts that the increase of IPv6 traffic/prefixes shows a steep\nincrease and that the application mix of IPv6 traffic starts to imitate the one\nof IPv4-dominated Internet.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2014 12:37:50 GMT"}], "update_date": "2014-02-18", "authors_parsed": [["Kim", "Juhoon", ""], ["Sarrar", "Nadi", ""], ["Feldmann", "Anja", ""]]}, {"id": "1402.3985", "submitter": "Payaswini P", "authors": "P Payaswini, D. H Manjaiah", "title": "Challenges and issues in 4G Networks Mobility Management", "comments": "4 Pages, \"Published with International Journal of Computer Trends and\n  Technology (IJCTT)\". arXiv admin note: text overlap with arXiv:1105.0043 by\n  other authors", "journal-ref": "International Journal of Computer Trends and Technology (IJCTT)\n  volume 4 Issue 5 May 2013", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless broadband technology is now in motion to provide higher data rate,\nwider coverage and improved mobility. Towards this the 4G - network is an\nintegration of various wireless technologies and expected to provide seamless\nmobility. Moreover 4G-networks will be entirely packet switched systems based\non IP protocol. One of the research challenges for 4G-Network is the design of\nintelligent mobility management techniques that take advantage of IP-based\ntechnologies to achieve global roaming among various access technologies. Hence\nMobile IPv6 is considered to be one of the key technologies for integration of\nheterogeneous networks. However the original Mobile IPv6 does not support fast\nhandover, which is essential function for mobile networks. Number of research\ngroups working towards this to develop a common protocol to enable seamless\nmobility. In this paper we identify and explore the different issues and\nchallenges related to mobility management in 4G - networks.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2014 12:54:34 GMT"}], "update_date": "2014-02-18", "authors_parsed": [["Payaswini", "P", ""], ["Manjaiah", "D. H", ""]]}, {"id": "1402.4100", "submitter": "Lei Zhang Mr.", "authors": "Lei Zhang, Hong-Chuan Yang, and Mazen O. Hasna", "title": "Generalized Area Spectral Efficiency: An Effective Performance Metric\n  for Green Wireless Communications", "comments": "11 pages, 8 figures, accepted by TCom", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Area spectral efficiency (ASE) was introduced as a metric to quantify the\nspectral utilization efficiency of cellular systems. Unlike other performance\nmetrics, ASE takes into account the spatial property of cellular systems. In\nthis paper, we generalize the concept of ASE to study arbitrary wireless\ntransmissions. Specifically, we introduce the notion of affected area to\ncharacterize the spatial property of arbitrary wireless transmissions. Based on\nthe definition of affected area, we define the performance metric, generalized\narea spectral efficiency (GASE), to quantify the spatial spectral utilization\nefficiency as well as the greenness of wireless transmissions. After\nillustrating its evaluation for point-to-point transmission, we analyze the\nGASE performance of several different transmission scenarios, including\ndual-hop relay transmission, three-node cooperative relay transmission and\nunderlay cognitive radio transmission. We derive closed-form expressions for\nthe GASE metric of each transmission scenario under Rayleigh fading environment\nwhenever possible. Through mathematical analysis and numerical examples, we\nshow that the GASE metric provides a new perspective on the design and\noptimization of wireless transmissions, especially on the transmitting power\nselection. We also show that introducing relay nodes can greatly improve the\nspatial utilization efficiency of wireless systems. We illustrate that the GASE\nmetric can help optimize the deployment of underlay cognitive radio systems.\n", "versions": [{"version": "v1", "created": "Thu, 13 Feb 2014 22:10:35 GMT"}], "update_date": "2014-02-18", "authors_parsed": [["Zhang", "Lei", ""], ["Yang", "Hong-Chuan", ""], ["Hasna", "Mazen O.", ""]]}, {"id": "1402.4508", "submitter": "Noureddine Haouari", "authors": "Haouari Noureddine, Moussaoui Samira", "title": "Efficient Local Density Estimation Strategy for VANETs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Local vehicle density estimation is increasingly becoming an essential factor\nof many vehicular ad-hoc network applications such as congestion control and\ntraffic state estimation. This estimation is used to get an approximate number\nof neighbors within the transmission range since beacons do not give accurate\naccuracy about neighborhood. These is due to the special characteristics of\nVANETs such as high mobility, high density variation. To enhance the\nperformance of these applications, an accurate estimation of the local density\nwith minimum of overhead is needed. Most of the proposed strategies address the\nglobal traffic density estimation without a big attention on the local density\nestimation. This paper proposes an improved approach for local density\nestimation in VANETs in terms of accuracy and overhead. The simulation results\nshowed that our strategy allows an interesting precision of estimation with\nacceptable overhead.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2014 21:54:03 GMT"}], "update_date": "2014-02-20", "authors_parsed": [["Noureddine", "Haouari", ""], ["Samira", "Moussaoui", ""]]}, {"id": "1402.4576", "submitter": "Mingyue Ji", "authors": "Mingyue Ji, Antonia M. Tulino, Jaime Llorca, Giuseppe Caire", "title": "On the Average Performance of Caching and Coded Multicasting with Random\n  Demands", "comments": "5 pages, 3 figure, to appear in ISWCS 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a network with one sender, $n$ receivers (users) and $m$ possible\nmessages (files), caching side information at the users allows to satisfy\narbitrary simultaneous demands by sending a common (multicast) coded message.\nIn the worst-case demand setting, explicit deterministic and random caching\nstrategies and explicit linear coding schemes have been shown to be order\noptimal. In this work, we consider the same scenario where the user demands are\nrandom i.i.d., according to a Zipf popularity distribution. In this case, we\npose the problem in terms of the minimum average number of equivalent message\ntransmissions. We present a novel decentralized random caching placement and a\ncoded delivery scheme which are shown to achieve order-optimal performance. As\na matter of fact, this is the first order-optimal result for the caching and\ncoded multicasting problem in the case of random demands.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2014 07:40:33 GMT"}, {"version": "v2", "created": "Wed, 2 Jul 2014 21:20:43 GMT"}], "update_date": "2014-07-04", "authors_parsed": [["Ji", "Mingyue", ""], ["Tulino", "Antonia M.", ""], ["Llorca", "Jaime", ""], ["Caire", "Giuseppe", ""]]}, {"id": "1402.4663", "submitter": "Evgeny Nikulchev", "authors": "Evgeniy Pluzhnik, Evgeniy Nikulchev, Simon Payain", "title": "Concept of Feedback in Future Computing Models to Cloud Systems", "comments": "10 pages. arXiv admin note: substantial text overlap with\n  arXiv:1402.1469", "journal-ref": "World Applied Sciences Journal 32 (7): 1394-1399, 2014", "doi": "10.5829/idosi.wasj.2014.32.07.588", "report-no": null, "categories": "cs.DC cs.NI cs.SY", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Currently, it is urgent to ensure QoS in distributed computing systems. This\nbecame especially important to the development and spread of cloud services.\nBig data structures become heavily distributed. Necessary to consider the\ncommunication channels and data transmission systems and virtualization and\nscalability in future design of computational models in problems of designing\ncloud systems, evaluating the effectiveness of the algorithms, the assessment\nof economic performance data centers. Requires not only the monitoring of data\nflows and computing resources, but also the operational management of these\nresources to QoS provide. Such a tool may be just the introduction of feedback\nin computational models. The article presents the main dynamic model with\nfeedback as a basis for a new model of distributed computing processes. The\nresearch results are presented here. Formulated in this work can be used for\nother complex tasks - estimation of structural complexity of distributed\ndatabases, evaluation of dynamic characteristics of systems operating in the\nhybrid cloud, etc.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2014 13:53:22 GMT"}], "update_date": "2014-11-18", "authors_parsed": [["Pluzhnik", "Evgeniy", ""], ["Nikulchev", "Evgeniy", ""], ["Payain", "Simon", ""]]}, {"id": "1402.4675", "submitter": "Boris Bellalta Dr.", "authors": "T. Adame, A. Bel, B. Bellalta, J. Barcelo, M. Oliver", "title": "IEEE 802.11ah: The Wi-Fi Approach for M2M Communications", "comments": "IEEE Wireless Magazine, 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  M2M communications are projected to be one of the fastest growing technology\nsegments of the IT sector in the next years. Sensor and actuator networks\nconnect communication machines and devices so that they automatically transmit\ninformation, serving the growing demand for environmental data acquisition.\nIEEE 802.11ah Task Group addresses the creation of a new standard for giving\nresponse to the particular requirements of this type of networks: large number\nof power-constrained stations, long transmission range, small and infrequent\ndata messages, low data-rates and non-critical delay. This article explores the\nkey features of this new standard under development, especially those related\nto the reduction of energy consumption in the MAC Layer. In this direction, a\nperformance assessment of IEEE 802.11ah in four typical M2M scenarios has been\nperformed.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2014 14:35:12 GMT"}, {"version": "v2", "created": "Sun, 5 Oct 2014 17:46:59 GMT"}], "update_date": "2014-10-07", "authors_parsed": [["Adame", "T.", ""], ["Bel", "A.", ""], ["Bellalta", "B.", ""], ["Barcelo", "J.", ""], ["Oliver", "M.", ""]]}, {"id": "1402.4892", "submitter": "Kiran Thekumparampil", "authors": "Kiran Koshy Thekumparampil, Andrew Thangaraj, Rahul Vaze", "title": "Sub-Modularity of Waterfilling with Applications to Online Basestation\n  Allocation", "comments": "5 pages, 2 figures; submitted to the International Symposium on\n  Information Theory 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DS cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the popular water-filling algorithm for maximizing the mutual\ninformation in parallel Gaussian channels is sub-modular. The sub-modularity of\nwater-filling algorithm is then used to derive online basestation allocation\nalgorithms, where mobile users are assigned to one of many possible\nbasestations immediately and irrevocably upon arrival without knowing the\nfuture user information. The goal of the allocation is to maximize the sum-rate\nof the system under power allocation at each basestation. We present online\nalgorithms with competitive ratio of at most 2 when compared to offline\nalgorithms that have knowledge of all future user arrivals.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2014 05:12:00 GMT"}], "update_date": "2014-02-21", "authors_parsed": [["Thekumparampil", "Kiran Koshy", ""], ["Thangaraj", "Andrew", ""], ["Vaze", "Rahul", ""]]}, {"id": "1402.5003", "submitter": "Magnus M. Halldorsson", "authors": "Marijke H.L. Bodlaender and Magn\\'us M. Halld\\'orsson", "title": "Beyond Geometry : Towards Fully Realistic Wireless Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Signal-strength models of wireless communications capture the gradual fading\nof signals and the additivity of interference. As such, they are closer to\nreality than other models. However, nearly all theoretic work in the SINR model\ndepends on the assumption of smooth geometric decay, one that is true in free\nspace but is far off in actual environments. The challenge is to model\nrealistic environments, including walls, obstacles, reflections and anisotropic\nantennas, without making the models algorithmically impractical or analytically\nintractable.\n  We present a simple solution that allows the modeling of arbitrary static\nsituations by moving from geometry to arbitrary decay spaces. The complexity of\na setting is captured by a metricity parameter Z that indicates how far the\ndecay space is from satisfying the triangular inequality. All results that hold\nin the SINR model in general metrics carry over to decay spaces, with the\nresulting time complexity and approximation depending on Z in the same way that\nthe original results depends on the path loss term alpha. For distributed\nalgorithms, that to date have appeared to necessarily depend on the planarity,\nwe indicate how they can be adapted to arbitrary decay spaces.\n  Finally, we explore the dependence on Z in the approximability of core\nproblems. In particular, we observe that the capacity maximization problem has\nexponential upper and lower bounds in terms of Z in general decay spaces. In\nEuclidean metrics and related growth-bounded decay spaces, the performance\ndepends on the exact metricity definition, with a polynomial upper bound in\nterms of Z, but an exponential lower bound in terms of a variant parameter phi.\nOn the plane, the upper bound result actually yields the first approximation of\na capacity-type SINR problem that is subexponential in alpha.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2014 14:11:14 GMT"}], "update_date": "2014-02-21", "authors_parsed": [["Bodlaender", "Marijke H. L.", ""], ["Halldórsson", "Magnús M.", ""]]}, {"id": "1402.5196", "submitter": "Kensuke Nakanishi", "authors": "Kensuke Nakanishi, Shinsuke Hara, Takahiro Matsuda, Kenichi Takizawa,\n  Fumie Ono, and Ryu Miura", "title": "Synchronization-Free Delay Tomography Based on Compressed Sensing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Delay tomography has so far burdened source and receiver measurement nodes in\na network with two requirements such as path establishment and clock\nsynchronization between them. In this letter, we focus on the clock\nsynchronization problem in delay tomography and propose a synchronization-free\ndelay tomography scheme. The proposed scheme selects a path between source and\nreceiver measurement nodes as a reference path, which results in a loss of\nequation in a conventional delay tomography problem. However, by utilizing\ncompressed sensing, the proposed scheme becomes robust to the loss. Simulation\nexperiments confirm that the proposed scheme works comparable to a conventional\ndelay tomography scheme in networks with no clock synchronization between\nsource and receiver measurement nodes.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2014 03:33:24 GMT"}], "update_date": "2014-02-24", "authors_parsed": [["Nakanishi", "Kensuke", ""], ["Hara", "Shinsuke", ""], ["Matsuda", "Takahiro", ""], ["Takizawa", "Kenichi", ""], ["Ono", "Fumie", ""], ["Miura", "Ryu", ""]]}, {"id": "1402.5207", "submitter": "Maxwell Young", "authors": "Michael A. Bender and Jeremy T. Fineman and Seth Gilbert and Maxwell\n  Young", "title": "How to Scale Exponential Backoff", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Randomized exponential backoff is a widely deployed technique for\ncoordinating access to a shared resource. A good backoff protocol should,\narguably, satisfy three natural properties: (i) it should provide constant\nthroughput, wasting as little time as possible; (ii) it should require few\nfailed access attempts, minimizing the amount of wasted effort; and (iii) it\nshould be robust, continuing to work efficiently even if some of the access\nattempts fail for spurious reasons. Unfortunately, exponential backoff has some\nwell-known limitations in two of these areas: it provides poor (sub-constant)\nthroughput (in the worst case), and is not robust (to resource acquisition\nfailures).\n  The goal of this paper is to \"fix\" exponential backoff by making it scalable,\nparticularly focusing on the case where processes arrive in an on-line,\nworst-case fashion. We present a relatively simple backoff\nprotocol~Re-Backoff~that has, at its heart, a version of exponential backoff.\nIt guarantees expected constant throughput with dynamic process arrivals and\nrequires only an expected polylogarithmic number of access attempts per\nprocess.\n  Re-Backoff is also robust to periods where the shared resource is unavailable\nfor a period of time. If it is unavailable for $D$ time slots, Re-Backoff\nprovides the following guarantees. When the number of packets is a finite $n$,\nthe average expected number of access attempts for successfully sending a\npacket is $O(\\log^2( n + D))$. In the infinite case, the average expected\nnumber of access attempts for successfully sending a packet is $O( \\log^2(\\eta)\n+ \\log^2(D) )$ where $\\eta$ is the maximum number of processes that are ever in\nthe system concurrently.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2014 05:47:48 GMT"}, {"version": "v2", "created": "Wed, 16 Jul 2014 14:51:16 GMT"}, {"version": "v3", "created": "Fri, 14 Nov 2014 06:09:09 GMT"}, {"version": "v4", "created": "Sun, 12 Jul 2015 06:09:28 GMT"}], "update_date": "2015-07-14", "authors_parsed": [["Bender", "Michael A.", ""], ["Fineman", "Jeremy T.", ""], ["Gilbert", "Seth", ""], ["Young", "Maxwell", ""]]}, {"id": "1402.5486", "submitter": "Huazi Zhang", "authors": "Huazi Zhang, Zhaoyang Zhang, Huaiyu Dai", "title": "Rateless-Coding-Assisted Multi-Packet Spreading over Mobile Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A novel Rateless-coding-assisted Multi-Packet Relaying (RMPR) protocol is\nproposed for large-size data spreading in mobile wireless networks. With this\nlightweight and robust protocol, the packet redundancy is reduced by a factor\nof $\\sqrt n$, while the spreading time is reduced at least by a factor of $\\ln\n(n)$. Closed-form bounds and explicit non-asymptotic results are presented,\nwhich are further validated through simulations. Besides, the packet\nduplication phenomenon in the network setting is analyzed for the first time.\n", "versions": [{"version": "v1", "created": "Sat, 22 Feb 2014 06:21:54 GMT"}], "update_date": "2014-02-25", "authors_parsed": [["Zhang", "Huazi", ""], ["Zhang", "Zhaoyang", ""], ["Dai", "Huaiyu", ""]]}, {"id": "1402.5488", "submitter": "Huazi Zhang", "authors": "Huazi Zhang, Zhaoyang Zhang, Huaiyu Dai, Rui Yin, Xiaoming Chen", "title": "Distributed Spectrum-Aware Clustering in Cognitive Radio Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A novel Distributed Spectrum-Aware Clustering (DSAC) scheme is proposed in\nthe context of Cognitive Radio Sensor Networks (CRSN). DSAC aims at forming\nenergy efficient clusters in a self-organized fashion while restricting\ninterference to Primary User (PU) systems. The spectrum-aware clustered\nstructure is presented where the communications consist of intra-cluster\naggregation and inter-cluster relaying. In order to save communication power,\nthe optimal number of clusters is derived and the idea of groupwise constrained\nclustering is introduced to minimize intra-cluster distance under\nspectrum-aware constraint. In terms of practical implementation, DSAC\ndemonstrates preferable scalability and stability because of its low complexity\nand quick convergence under dynamic PU activity. Finally, simulation results\nare given to validate the proposed scheme.\n", "versions": [{"version": "v1", "created": "Sat, 22 Feb 2014 06:54:29 GMT"}], "update_date": "2014-02-25", "authors_parsed": [["Zhang", "Huazi", ""], ["Zhang", "Zhaoyang", ""], ["Dai", "Huaiyu", ""], ["Yin", "Rui", ""], ["Chen", "Xiaoming", ""]]}, {"id": "1402.5503", "submitter": "Huazi Zhang", "authors": "Huazi Zhang, Zhaoyang Zhang, Yuen Chau", "title": "Distributed Compressed Wideband Sensing in Cognitive Radio Sensor\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A novel distributed compressed wideband sensing scheme for Cognitive Radio\nSensor Networks (CRSN) is proposed in this paper. Taking advantage of the\ndistributive nature of CRSN, the proposed scheme deploys only one single\nnarrowband sampler with ultra-low sampling rate at each nodes to accomplish the\nwideband spectrum sensing. First, the practical structure of the compressed\nsampler at each node is described in detail. Second, we show how the Fusion\nCenter (FC) exploits the sampled signals with their spectrum randomly-aliased\nto detect the global wideband spectrum activity. Finally, the proposed scheme\nis validated through extensive simulations, which shows that it is particularly\nsuitable for CRSN.\n", "versions": [{"version": "v1", "created": "Sat, 22 Feb 2014 11:58:39 GMT"}], "update_date": "2014-02-25", "authors_parsed": [["Zhang", "Huazi", ""], ["Zhang", "Zhaoyang", ""], ["Chau", "Yuen", ""]]}, {"id": "1402.5748", "submitter": "Aarti", "authors": "Aarti, Sanjiv Kumar Tomar", "title": "A Parametric Chain based Routing Approach for Underwater Sensor Network", "comments": "4 pages,1 figure", "journal-ref": "International Journal of Computer Trends and Technology (IJCTT) ,\n  4(1): 1492-1495, May 2013, Published by Seventh Sense Research Group", "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A sensor network is one of the critical networks that is based on hardware\ncomponents as well the energy parameters. Because of this, such network\nrequires the optimization in all kind communication to improve the network\nlife. In case of underwater sensor network, the criticality of network is also\nincreased because of the random floating movement of the nodes. In this work, a\ncomposition of the multicast or broadcast communication is presented by the\ngeneration of aggregative path. The presented work is about to define a new\nchain based aggregative routing approach to provide the effective communication\nover the network. In this work, an effective aggregative path is suggested\nunder the different parameters of energy, distance and congestion analysis.\nBased on these parameters a trustful aggregative route will be generated so\nthat the network life will be improved.\n", "versions": [{"version": "v1", "created": "Mon, 24 Feb 2014 08:44:46 GMT"}], "update_date": "2014-02-25", "authors_parsed": [["Aarti", "", ""], ["Tomar", "Sanjiv Kumar", ""]]}, {"id": "1402.5845", "submitter": "Priyanka Sharma", "authors": "Priyanka Sharma and Garimella Rama Murthy", "title": "Mathematical Modelling of Energy Wastage in Absence of Levelling and\n  Sectoring in Wireless Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we quantitatively (mathematically) reason the energy savings\nachieved by the Leveling and Sectoring protocol. Due to the energy constraints\non the sensor nodes (in terms of supply of energy) energy awareness has become\ncrucial in networking protocol stack. The understanding of routing protocols\nalong with energy awareness in a network would help in energy opti-mization\nwith efficient routing .We provide analytical modelling of the energy wastage\nin the absence of Leveling and Sectoring protocol by considering the network in\nthe form of binary tree, nested tree and Q-ary tree. The simulation results\nreflect the energy wastage in the absence of Levelling and Sectoring based\nhybrid protocol.\n", "versions": [{"version": "v1", "created": "Mon, 24 Feb 2014 14:56:17 GMT"}], "update_date": "2014-02-25", "authors_parsed": [["Sharma", "Priyanka", ""], ["Murthy", "Garimella Rama", ""]]}, {"id": "1402.5987", "submitter": "Daniel S. Berger", "authors": "Daniel S. Berger, Philipp Gland, Sahil Singla, and Florin Ciucu", "title": "Exact Analysis of TTL Cache Networks: The Case of Caching Policies\n  driven by Stopping Times", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  TTL caching models have recently regained significant research interest,\nlargely due to their ability to fit popular caching policies such as LRU. This\npaper advances the state-of-the-art analysis of TTL-based cache networks by\ndeveloping two exact methods with orthogonal generality and computational\ncomplexity. The first method generalizes existing results for line networks\nunder renewal requests to the broad class of caching policies whereby evictions\nare driven by stopping times. The obtained results are further generalized,\nusing the second method, to feedforward networks with Markov arrival processes\n(MAP) requests. MAPs are particularly suitable for non-line networks because\nthey are closed not only under superposition and splitting, as known, but also\nunder input-output caching operations as proven herein for phase-type TTL\ndistributions. The crucial benefit of the two closure properties is that they\njointly enable the first exact analysis of feedforward networks of TTL caches\nin great generality.\n", "versions": [{"version": "v1", "created": "Mon, 24 Feb 2014 21:19:39 GMT"}], "update_date": "2014-02-26", "authors_parsed": [["Berger", "Daniel S.", ""], ["Gland", "Philipp", ""], ["Singla", "Sahil", ""], ["Ciucu", "Florin", ""]]}, {"id": "1402.6096", "submitter": "Rom Aschner", "authors": "Rom Aschner and Matthew J. Katz", "title": "Bounded-Angle Spanning Tree: Modeling Networks with Angular Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a new structure for a set of points in the plane and an angle\n$\\alpha$, which is similar in flavor to a bounded-degree MST. We name this\nstructure $\\alpha$-MST. Let $P$ be a set of points in the plane and let $0 <\n\\alpha \\le 2\\pi$ be an angle. An $\\alpha$-ST of $P$ is a spanning tree of the\ncomplete Euclidean graph induced by $P$, with the additional property that for\neach point $p \\in P$, the smallest angle around $p$ containing all the edges\nadjacent to $p$ is at most $\\alpha$. An $\\alpha$-MST of $P$ is then an\n$\\alpha$-ST of $P$ of minimum weight. For $\\alpha < \\pi/3$, an $\\alpha$-ST does\nnot always exist, and, for $\\alpha \\ge \\pi/3$, it always exists. In this paper,\nwe study the problem of computing an $\\alpha$-MST for several common values of\n$\\alpha$.\n  Motivated by wireless networks, we formulate the problem in terms of\ndirectional antennas. With each point $p \\in P$, we associate a wedge $W_p$ of\nangle $\\alpha$ and apex $p$. The goal is to assign an orientation and a radius\n$r_p$ to each wedge $W_p$, such that the resulting graph is connected and its\nMST is an $\\alpha$-MST. (We draw an edge between $p$ and $q$ if $p \\in W_q$, $q\n\\in W_p$, and $|pq| \\le r_p, r_q$.) Unsurprisingly, the problem of computing an\n$\\alpha$-MST is NP-hard, at least for $\\alpha=\\pi$ and $\\alpha=2\\pi/3$. We\npresent constant-factor approximation algorithms for $\\alpha = \\pi/2, 2\\pi/3,\n\\pi$.\n  One of our major results is a surprising theorem for $\\alpha = 2\\pi/3$,\nwhich, besides being interesting from a geometric point of view, has important\napplications. For example, the theorem guarantees that given any set $P$ of\n$3n$ points in the plane and any partitioning of the points into $n$ triplets,\none can orient the wedges of each triplet {\\em independently}, such that the\ngraph induced by $P$ is connected. We apply the theorem to the {\\em antenna\nconversion} problem.\n", "versions": [{"version": "v1", "created": "Tue, 25 Feb 2014 09:00:19 GMT"}], "update_date": "2014-02-26", "authors_parsed": [["Aschner", "Rom", ""], ["Katz", "Matthew J.", ""]]}, {"id": "1402.6243", "submitter": "Ahmed Alaa", "authors": "Ahmed M. Alaa and Omar A. Nasr", "title": "Globally Optimal Cooperation in Dense Cognitive Radio Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The problem of calculating the local and global decision thresholds in hard\ndecisions based cooperative spectrum sensing is well known for its mathematical\nintractability. Previous work relied on simple suboptimal counting rules for\ndecision fusion in order to avoid the exhaustive numerical search required for\nobtaining the optimal thresholds. However, these simple rules are not globally\noptimal as they do not maximize the overall global detection probability by\njointly selecting local and global thresholds. Instead, they maximize the\ndetection probability for a specific global threshold. In this paper, a\nglobally optimal decision fusion rule for Primary User signal detection based\non the Neyman- Pearson (NP) criterion is derived. The algorithm is based on a\nnovel representation for the global performance metrics in terms of the\nregularized incomplete beta function. Based on this mathematical\nrepresentation, it is shown that the globally optimal NP hard decision fusion\ntest can be put in the form of a conventional one dimensional convex\noptimization problem. A binary search for the global threshold can be applied\nyielding a complexity of O(log2(N)), where N represents the number of\ncooperating users. The logarithmic complexity is appreciated because we are\nconcerned with dense networks, and thus N is expected to be large. The proposed\noptimal scheme outperforms conventional counting rules, such as the OR, AND,\nand MAJORITY rules. It is shown via simulations that, although the optimal rule\ntends to the simple OR rule when the number of cooperating secondary users is\nsmall, it offers significant SNR gain in dense cognitive radio networks with\nlarge number of cooperating users.\n", "versions": [{"version": "v1", "created": "Tue, 25 Feb 2014 17:04:11 GMT"}], "update_date": "2014-02-26", "authors_parsed": [["Alaa", "Ahmed M.", ""], ["Nasr", "Omar A.", ""]]}, {"id": "1402.6430", "submitter": "Tianyang Bai", "authors": "Tianyang Bai and Robert W. Heath Jr", "title": "Coverage and Rate Analysis for Millimeter Wave Cellular Networks", "comments": "16 pages, 10 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Millimeter wave (mmWave) holds promise as a carrier frequency for fifth\ngeneration cellular networks. Because mmWave signals are sensitive to blockage,\nprior models for cellular networks operated in the ultra high frequency (UHF)\nband do not apply to analyze mmWave cellular networks directly. Leveraging\nconcepts from stochastic geometry, this paper proposes a general framework to\nevaluate the coverage and rate performance in mmWave cellular networks. Using a\ndistance-dependent line-of-site (LOS) probability function, the locations of\nthe LOS and non-LOS base stations are modeled as two independent\nnon-homogeneous Poisson point processes, to which different path loss laws are\napplied. Based on the proposed framework, expressions for the\nsignal-to-noise-and-interference ratio (SINR) and rate coverage probability are\nderived. The mmWave coverage and rate performance are examined as a function of\nthe antenna geometry and base station density. The case of dense networks is\nfurther analyzed by applying a simplified system model, in which the LOS region\nof a user is approximated as a fixed LOS ball. The results show that dense\nmmWave networks can achieve comparable coverage and much higher data rates than\nconventional UHF cellular systems, despite the presence of blockages. The\nresults suggest that the cell size to achieve the optimal SINR scales with the\naverage size of the area that is LOS to a user.\n", "versions": [{"version": "v1", "created": "Wed, 26 Feb 2014 06:33:38 GMT"}, {"version": "v2", "created": "Sat, 1 Mar 2014 17:53:59 GMT"}, {"version": "v3", "created": "Sat, 18 Oct 2014 21:17:26 GMT"}], "update_date": "2014-10-21", "authors_parsed": [["Bai", "Tianyang", ""], ["Heath", "Robert W.", "Jr"]]}, {"id": "1402.6457", "submitter": "Tung-Wei Kuo", "authors": "Tung-Wei Kuo, Kate Ching-Ju Lin, Ming-Jer Tsai", "title": "On the Construction of Data Aggregation Tree with Minimum Energy Cost in\n  Wireless Sensor Networks: NP-Completeness and Approximation Algorithms", "comments": "19 pages, 9 figures, 1 table, submitted to IEEE Transactions on\n  Information Theory, Feb 2014", "journal-ref": null, "doi": "10.1109/TC.2015.2512862", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many applications, it is a basic operation for the sink to periodically\ncollect reports from all sensors. Since the data gathering process usually\nproceeds for many rounds, it is important to collect these data efficiently,\nthat is, to reduce the energy cost of data transmission. Under such\napplications, a tree is usually adopted as the routing structure to save the\ncomputation costs for maintaining the routing tables of sensors. In this paper,\nwe work on the problem of constructing a data aggregation tree that minimizes\nthe total energy cost of data transmission in a wireless sensor network. In\naddition, we also address such a problem in the wireless sensor network where\nrelay nodes exist. We show these two problems are NP-complete, and propose\nO(1)-approximation algorithms for each of them. Simulations show that the\nproposed algorithms each have good performance in terms of the energy cost.\n", "versions": [{"version": "v1", "created": "Wed, 26 Feb 2014 09:00:18 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Kuo", "Tung-Wei", ""], ["Lin", "Kate Ching-Ju", ""], ["Tsai", "Ming-Jer", ""]]}, {"id": "1402.6474", "submitter": "Woon Hau Chin", "authors": "Woon Hau Chin, Zhong Fan, and Russell J. Haines", "title": "Emerging Technologies and Research Challenges for 5G Wireless Networks", "comments": "Accepted for publication in IEEE Wireless Communications April 2014", "journal-ref": null, "doi": "10.1109/MWC.2014.6812298", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the take-up of Long Term Evolution (LTE)/4G cellular accelerates, there is\nincreasing interest in technologies that will define the next generation (5G)\ntelecommunication standard. This paper identifies several emerging technologies\nwhich will change and define the future generations of telecommunication\nstandards. Some of these technologies are already making their way into\nstandards such as 3GPP LTE, while others are still in development.\nAdditionally, we will look at some of the research problems that these new\ntechnologies pose.\n", "versions": [{"version": "v1", "created": "Wed, 26 Feb 2014 09:52:23 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Chin", "Woon Hau", ""], ["Fan", "Zhong", ""], ["Haines", "Russell J.", ""]]}, {"id": "1402.6515", "submitter": "Atul  Singh Kushwah Mr.", "authors": "Atul Singh Kushwah", "title": "Performance Analysis of 2*4 MIMO-MC-CDMA in Rayleigh Fading Channel\n  Using ZF-Decoder", "comments": "4 pages, 2 figures, 2 tables Published with International Journal of\n  Engineering Trends and Technology (IJETT) Volume-8 Number-4 Year of\n  Publication : 2014", "journal-ref": "International Journal of Engineering Trends and Technology(IJETT),\n  V8(4),204-207 February 2014. ISSN:2231-5381", "doi": "10.14445/22315381/IJETT-V8P237", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we analyze the performance of 2*4 MIMO-MC-CDMA system in MATLAB\nwhich highly reduces BER. In this paper we combine MIMO and MC-CDMA system to\nreduce bit error rate in which MC-CDMA is multi user and multiple access\nschemes which is used to increase the data rate of the system. MC-CDMA system\nis a single wideband frequency selective carrier which converts frequency\nselective to parallel narrowband flat fading multiple sub-carriers to enhance\nthe performance of system. Now MC-CDMA system further improved by grouping with\n2*4 MIMO system which uses ZF (Zero Forcing) decoder at the receiver to\ndecrease BER with half rate convolutionally encoded Alamouti STBC block code is\nused as transmit diversity of MIMO through multiple transmit antenna.\nImportance of using MIMO-MC-CDMA using convolution code is firstly to reduce\nthe complexity of system secondary to reduce BER and lastly to increase gain.\nIn this paper we examine system performance in diverse modulation techniques\nlike, 8-PSK, 16-QAM, QPSK, 32-QAM, 8-QAM and 64-QAM in Rayleigh fading channel\nusing MATLAB.\n", "versions": [{"version": "v1", "created": "Wed, 26 Feb 2014 12:36:45 GMT"}], "update_date": "2014-02-27", "authors_parsed": [["Kushwah", "Atul Singh", ""]]}, {"id": "1402.6809", "submitter": "Arindam Pal", "authors": "Sushmita Ruj and Arindam Pal", "title": "Analyzing Cascading Failures in Smart Grids under Random and Targeted\n  Attacks", "comments": "Accepted for publication in 28th IEEE International Conference on\n  Advanced Information Networking and Applications (AINA) 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.DM cs.NI math.CO physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We model smart grids as complex interdependent networks, and study targeted\nattacks on smart grids for the first time. A smart grid consists of two\nnetworks: the power network and the communication network, interconnected by\nedges. Occurrence of failures (attacks) in one network triggers failures in the\nother network, and propagates in cascades across the networks. Such cascading\nfailures can result in disintegration of either (or both) of the networks.\nEarlier works considered only random failures. In practical situations, an\nattacker is more likely to compromise nodes selectively.\n  We study cascading failures in smart grids, where an attacker selectively\ncompromises the nodes with probabilities proportional to their degrees; high\ndegree nodes are compromised with higher probability. We mathematically analyze\nthe sizes of the giant components of the networks under targeted attacks, and\ncompare the results with the corresponding sizes under random attacks. We show\nthat networks disintegrate faster for targeted attacks compared to random\nattacks. A targeted attack on a small fraction of high degree nodes\ndisintegrates one or both of the networks, whereas both the networks contain\ngiant components for random attack on the same fraction of nodes.\n", "versions": [{"version": "v1", "created": "Thu, 27 Feb 2014 07:17:55 GMT"}], "update_date": "2015-02-19", "authors_parsed": [["Ruj", "Sushmita", ""], ["Pal", "Arindam", ""]]}, {"id": "1402.6835", "submitter": "Hiroshi Saito", "authors": "Hiroshi Saito", "title": "Spatial Design of Physical Network Robust against Earthquakes", "comments": "arXiv admin note: text overlap with arXiv:1312.7187", "journal-ref": null, "doi": "10.1109/JLT.2014.2385100", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper analyzes the survivability of a physical network against\nearthquakes and proposes spatial network design rules to make a network robust\nagainst earthquakes. The disaster area model used is fairly generic and\nbounded. The proposed design rules for physical networks include: (i) a shorter\nzigzag route can reduce the probability that a network intersects a disaster\narea, (ii) an additive performance metric, such as repair cost, is independent\nof the network shape if the route length is fixed, and (iii) additional routes\nwithin a ring network does not decrease the probability that all the routes\nbetween a given pair of nodes intersect the disaster area, but a wider detour\nroute decreases it. Formulas for evaluating the probability of disconnecting\ntwo given nodes are also derived. An optimal server placement is shown as an\napplication of the theoretical results. These analysis results are validated\nthrough empirical earthquake data.\n", "versions": [{"version": "v1", "created": "Thu, 27 Feb 2014 09:23:09 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Saito", "Hiroshi", ""]]}, {"id": "1402.6973", "submitter": "Michael Markovitch", "authors": "Michael Markovitch, Gabriel Scalosub", "title": "Bounded Delay Scheduling with Packet Dependencies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A common situation occurring when dealing with multimedia traffic is having\nlarge data frames fragmented into smaller IP packets, and having these packets\nsent independently through the network. For real-time multimedia traffic,\ndropping even few packets of a frame may render the entire frame useless. Such\ntraffic is usually modeled as having {\\em inter-packet dependencies}. We study\nthe problem of scheduling traffic with such dependencies, where each packet has\na deadline by which it should arrive at its destination. Such deadlines are\ncommon for real-time multimedia applications, and are derived from stringent\ndelay constraints posed by the application. The figure of merit in such\nenvironments is maximizing the system's {\\em goodput}, namely, the number of\nframes successfully delivered.\n  We study online algorithms for the problem of maximizing goodput of\ndelay-bounded traffic with inter-packet dependencies, and use competitive\nanalysis to evaluate their performance. We present competitive algorithms for\nthe problem, as well as matching lower bounds that are tight up to a constant\nfactor. We further present the results of a simulation study which further\nvalidates our algorithmic approach and shows that insights arising from our\nanalysis are indeed manifested in practice.\n", "versions": [{"version": "v1", "created": "Thu, 27 Feb 2014 17:02:30 GMT"}], "update_date": "2014-02-28", "authors_parsed": [["Markovitch", "Michael", ""], ["Scalosub", "Gabriel", ""]]}, {"id": "1402.7017", "submitter": "Ichrak Amdouni", "authors": "Ichrak Amdouni (INRIA Paris-Rocquencourt), C\\'edric Adjih (INRIA\n  Paris-Rocquencourt), Pascale Minet (INRIA Paris-Rocquencourt)", "title": "Joint Routing and STDMA-based Scheduling to Minimize Delays in Grid\n  Wireless Sensor Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": "RR-8488", "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this report, we study the issue of delay optimization and energy\nefficiency in grid wireless sensor networks (WSNs). We focus on STDMA (Spatial\nReuse TDMA)) scheduling, where a predefined cycle is repeated, and where each\nnode has fixed transmission opportunities during specific slots (defined by\ncolors). We assume a STDMA algorithm that takes advantage of the regularity of\ngrid topology to also provide a spatially periodic coloring (\"tiling\" of the\nsame color pattern). In this setting, the key challenges are: 1) minimizing the\naverage routing delay by ordering the slots in the cycle 2) being energy\nefficient. Our work follows two directions: first, the baseline performance is\nevaluated when nothing specific is done and the colors are randomly ordered in\nthe STDMA cycle. Then, we propose a solution, ORCHID that deliberately\nconstructs an efficient STDMA schedule. It proceeds in two steps. In the first\nstep, ORCHID starts form a colored grid and builds a hierarchical routing based\non these colors. In the second step, ORCHID builds a color ordering, by\nconsidering jointly both routing and scheduling so as to ensure that any node\nwill reach a sink in a single STDMA cycle. We study the performance of these\nsolutions by means of simulations and modeling. Results show the excellent\nperformance of ORCHID in terms of delays and energy compared to a shortest path\nrouting that uses the delay as a heuristic. We also present the adaptation of\nORCHID to general networks under the SINR interference model.\n", "versions": [{"version": "v1", "created": "Thu, 27 Feb 2014 18:53:29 GMT"}, {"version": "v2", "created": "Mon, 1 Sep 2014 12:19:50 GMT"}], "update_date": "2014-09-02", "authors_parsed": [["Amdouni", "Ichrak", "", "INRIA Paris-Rocquencourt"], ["Adjih", "Cédric", "", "INRIA\n  Paris-Rocquencourt"], ["Minet", "Pascale", "", "INRIA Paris-Rocquencourt"]]}, {"id": "1402.7198", "submitter": "Venugopal K r", "authors": "T Shiva Prakash, K B Raja, K R Venugopal, S S Iyengar, L M Patnaik", "title": "Two-Hop Routing with Traffic-Differentiation for QoS Guarantee in\n  Wireless Sensor Networks", "comments": "13 pages", "journal-ref": "International Journal of Information Processing, 7(3), 100-112,\n  2013", "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper proposes a Traffic-Differentiated Two-Hop Routing protocol for\nQuality of Service (QoS) in Wireless Sensor Networks (WSNs). It targets WSN\napplications having different types of data traffic with several priorities.\nThe protocol achieves to increase Packet Reception Ratio (PRR) and reduce\nend-to-end delay while considering multi-queue priority policy, two-hop\nneighborhood information, link reliability and power efficiency. The protocol\nis modular and utilizes effective methods for estimating the link metrics.\nNumerical results show that the proposed protocol is a feasible solution to\naddresses QoS service differenti- ation for traffic with different priorities.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2014 10:45:59 GMT"}], "update_date": "2014-03-03", "authors_parsed": [["Prakash", "T Shiva", ""], ["Raja", "K B", ""], ["Venugopal", "K R", ""], ["Iyengar", "S S", ""], ["Patnaik", "L M", ""]]}, {"id": "1402.7292", "submitter": "Mohammed ElBamby", "authors": "Mohammed S. ElBamby, Mehdi Bennis, Walid Saad, Matti Latva-aho", "title": "Dynamic Uplink-Downlink Optimization in TDD-based Small Cell Networks", "comments": "In the IEEE 11th International Symposium on Wireless Communication\n  Systems (ISWCS) 2014", "journal-ref": null, "doi": "10.1109/ISWCS.2014.6933488", "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dynamic Time-division duplex (TDD) can provide efficient and flexible\nsplitting of the common wireless cellular resources between uplink (UL) and\ndownlink (DL) users. In this paper, the UL/DL optimization problem is\nformulated as a noncooperative game among the small cell base stations (SCBSs)\nin which each base station aims at minimizing its total UL and DL flow delays.\nTo solve this game, a self-organizing UL/DL resource configuration scheme for\nTDD-based small cell networks is proposed. Using the proposed scheme, an SCBS\nis able to estimate and learn the UL and DL loads autonomously while optimizing\nits UL/DL configuration accordingly. Simulations results show that the proposed\nalgorithm achieves significant gains in terms of packet throughput in case of\nasymmetric UL and DL traffic loads. This gain increases as the traffic\nasymmetry increases, reaching up to 97% and 200% gains relative to random and\nfixed duplexing schemes respectively. Our results also show that the proposed\nalgorithm is well- adapted to dynamic traffic conditions and different network\nsizes, and operates efficiently in case of severe cross-link interference in\nwhich neighboring cells transmit in opposite directions.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2014 16:02:12 GMT"}, {"version": "v2", "created": "Thu, 11 Sep 2014 12:05:05 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["ElBamby", "Mohammed S.", ""], ["Bennis", "Mehdi", ""], ["Saad", "Walid", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1402.7314", "submitter": "Konstantinos Poularakis", "authors": "Konstantinos Poularakis, George Iosifidis, Vasilis Sourlas and\n  Leandros Tassiulas", "title": "Multicast-aware Caching for Small Cell Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The deployment of small cells is expected to gain huge momentum in the near\nfuture, as a solution for managing the skyrocketing mobile data demand growth.\nLocal caching of popular files at the small cell base stations has been\nrecently proposed, aiming at reducing the traffic incurred when transferring\nthe requested content from the core network to the users. In this paper, we\npropose and analyze a novel caching approach that can achieve significantly\nlower traffic compared to the traditional caching schemes. Our cache design\npolicy carefully takes into account the fact that an operator can serve the\nrequests for the same file that happen at nearby times via a single multicast\ntransmission. The latter incurs less traffic as the requested file is\ntransmitted to the users only once, rather than with many unicast\ntransmissions. Systematic experiments demonstrate the effectiveness of our\napproach, as compared to the existing caching schemes.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2014 16:40:23 GMT"}], "update_date": "2014-03-03", "authors_parsed": [["Poularakis", "Konstantinos", ""], ["Iosifidis", "George", ""], ["Sourlas", "Vasilis", ""], ["Tassiulas", "Leandros", ""]]}]