[{"id": "0708.3721", "submitter": "Marc Daumas", "authors": "Marc Daumas (LIRMM, Eliaus), David Lester (UNIVERSITY of Manchester),\n  C\\'esar Mu\\~noz (NIA)", "title": "Verified Real Number Calculations: A Library for Interval Arithmetic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.LO", "license": null, "abstract": "  Real number calculations on elementary functions are remarkably difficult to\nhandle in mechanical proofs. In this paper, we show how these calculations can\nbe performed within a theorem prover or proof assistant in a convenient and\nhighly automated as well as interactive way. First, we formally establish upper\nand lower bounds for elementary functions. Then, based on these bounds, we\ndevelop a rational interval arithmetic where real number calculations take\nplace in an algebraic setting. In order to reduce the dependency effect of\ninterval arithmetic, we integrate two techniques: interval splitting and taylor\nseries expansions. This pragmatic approach has been developed, and formally\nverified, in a theorem prover. The formal development also includes a set of\ncustomizable strategies to automate proofs involving explicit calculations over\nreal numbers. Our ultimate goal is to provide guaranteed proofs of numerical\nproperties with minimal human theorem-prover interaction.\n", "versions": [{"version": "v1", "created": "Tue, 28 Aug 2007 07:14:29 GMT"}], "update_date": "2007-08-29", "authors_parsed": [["Daumas", "Marc", "", "LIRMM, Eliaus"], ["Lester", "David", "", "UNIVERSITY of Manchester"], ["Muñoz", "César", "", "NIA"]]}, {"id": "0708.3722", "submitter": "Marc Daumas", "authors": "Sylvie Boldo (INRIA Futurs), Marc Daumas (LIRMM, Eliaus), Ren Cang Li", "title": "Formally Verified Argument Reduction with a Fused-Multiply-Add", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.PF", "license": null, "abstract": "  Cody & Waite argument reduction technique works perfectly for reasonably\nlarge arguments but as the input grows there are no bit left to approximate the\nconstant with enough accuracy. Under mild assumptions, we show that the result\ncomputed with a fused-multiply-add provides a fully accurate result for many\npossible values of the input with a constant almost accurate to the full\nworking precision. We also present an algorithm for a fully accurate second\nreduction step to reach double full accuracy (all the significand bits of two\nnumbers are significant) even in the worst cases of argument reduction. Our\nwork recalls the common algorithms and presents proofs of correctness. All the\nproofs are formally verified using the Coq automatic proof checker.\n", "versions": [{"version": "v1", "created": "Tue, 28 Aug 2007 07:15:08 GMT"}], "update_date": "2007-08-29", "authors_parsed": [["Boldo", "Sylvie", "", "INRIA Futurs"], ["Daumas", "Marc", "", "LIRMM, Eliaus"], ["Li", "Ren Cang", ""]]}]