[{"id": "1109.0032", "submitter": "Robert Kent", "authors": "Robert E. Kent", "title": "Semantic Integration in the IFF", "comments": "Presented at the Semantic Integration Workshop of the 2nd\n  International Semantic Web Conference (ISWC2003), Sanibel Island, Florida,\n  October 20, 2003", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.LO math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The IEEE P1600.1 Standard Upper Ontology (SUO) project aims to specify an\nupper ontology that will provide a structure and a set of general concepts upon\nwhich domain ontologies could be constructed. The Information Flow Framework\n(IFF), which is being developed under the auspices of the SUO Working Group,\nrepresents the structural aspect of the SUO. The IFF is based on category\ntheory. Semantic integration of object-level ontologies in the IFF is\nrepresented with its fusion construction. The IFF maintains ontologies using\npowerful composition primitives, which includes the fusion construction.\n", "versions": [{"version": "v1", "created": "Wed, 31 Aug 2011 20:45:08 GMT"}], "update_date": "2011-09-05", "authors_parsed": [["Kent", "Robert E.", ""]]}, {"id": "1109.0616", "submitter": "Josef Urban", "authors": "Josef Urban, Piotr Rudnicki and Geoff Sutcliffe", "title": "ATP and Presentation Service for Mizar Formalizations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes the Automated Reasoning for Mizar (MizAR) service, which\nintegrates several automated reasoning, artificial intelligence, and\npresentation tools with Mizar and its authoring environment. The service\nprovides ATP assistance to Mizar authors in finding and explaining proofs, and\noffers generation of Mizar problems as challenges to ATP systems. The service\nis based on a sound translation from the Mizar language to that of first-order\nATP systems, and relies on the recent progress in application of ATP systems in\nlarge theories containing tens of thousands of available facts. We present the\nmain features of MizAR services, followed by an account of initial experiments\nin finding proofs with the ATP assistance. Our initial experience indicates\nthat the tool offers substantial help in exploring the Mizar library and in\npreparing new Mizar articles.\n", "versions": [{"version": "v1", "created": "Sat, 3 Sep 2011 11:42:52 GMT"}, {"version": "v2", "created": "Tue, 9 Oct 2012 17:45:34 GMT"}], "update_date": "2012-10-10", "authors_parsed": [["Urban", "Josef", ""], ["Rudnicki", "Piotr", ""], ["Sutcliffe", "Geoff", ""]]}, {"id": "1109.0680", "submitter": "Petros Stefaneas", "authors": "Prodromos Tsiavos (London School of Economics, UK) and Petros\n  Stefaneas (National Technical University of Athens, Greece)", "title": "Beyond the Boundaries of Open, Closed and Pirate Archives: Lessons from\n  a Hybrid Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The creation of open archives i.e. archives where access is regulated by open\nlicensing models (content, source, data), should be seen as part of a broader\nsocio-economic phenomenon that finds legal expression in specific\norganizational and technical formats.This paper examines the origins and main\ncharacteristics of the open archives phenomenon. We investigate the extent to\nwhich different models of production of economic or social value can be\nexpressed in different forms of licensing in the context of open archives.\nThrough this process, we assess the extent to which the digital archive is\nmoving towards providing access that is deeper (meaning, that offers more\naccess rights) and wider (in the sense that most of the information given is in\nopen content licensing) or face a gradual stratification and polarization of\nthe content. Such stratification entails the emergence of two types of content:\ncontent to which access is extremely limited and content to which access\nremains completely open. This differentiation between classes of content is the\nresult of multiple factors: from purely legislative, administrative and\ncontractual restrictions (e.g. data protection and confidentiality\nrestrictions) to information economics (e.g. peer production) or social\n(minimum universal access).\n  We claim that with respect to the access management model, most of the\ncurrent archiving processes include elements of openness. Usually, this is the\nresult of economic necessity expressed in licensing instruments or\norganisational arrangements. The viability and the socio-economic importance of\nthe digital archives also contributes to the use of open archiving practices.\nIn such a context, although pure forms of open digital archives may remain an\nideal, the reality of hybrid open digital archives is a necessity.\n", "versions": [{"version": "v1", "created": "Sun, 4 Sep 2011 07:07:04 GMT"}], "update_date": "2011-09-06", "authors_parsed": [["Tsiavos", "Prodromos", "", "London School of Economics, UK"], ["Stefaneas", "Petros", "", "National Technical University of Athens, Greece"]]}, {"id": "1109.0983", "submitter": "Robert Kent", "authors": "Robert E. Kent", "title": "The Information Flow Framework: New architecture", "comments": "Presented at the International Category Theory Conference (CT 2006)\n  June 25 - July 1, 2006 at White Point, Nova Scotia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.LO math.CT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This presentation discusses a new, modular, more mature architecture for the\nInformation Flow Framework (IFF). The IFF uses institution theory as a\nfoundation for the semantic integration of ontologies. It represents metalogic,\nand as such operates at the structural level of ontologies. The content, form\nand experience of the IFF could contribute to the development of a standard\nontology for category theory. The foundational aspect of the IFF helps to\nexplain the relationship between the fundamental concepts of set theory and\ncategory theory. The development of the IFF follows two design principles:\nconceptual warrant and categorical design. Both are limitations of the logical\nexpression. Conceptual warrant limits the content of logical expression, by\nrequiring us to justify the introduction of new terminology (and attendant\naxiomatizations). Categorical design limits the form of logical expression (of\nall mathematical concepts and constraints) to atomic expressions: declarations,\nequations or relational expressions. The IFF is a descriptive category\nmetatheory. It is descriptive, since it follows the principle of conceptual\nwarrant; it is categorical, since it follows the principle of categorical\ndesign; and it is a metatheory, since it provides a framework for all theories.\n", "versions": [{"version": "v1", "created": "Mon, 5 Sep 2011 19:15:17 GMT"}], "update_date": "2011-09-06", "authors_parsed": [["Kent", "Robert E.", ""]]}, {"id": "1109.1059", "submitter": "Seok-Ho Yoon", "authors": "Seok-Ho Yoon, Sang-Wook Kim, and Sunju Park", "title": "C-Rank: A Link-based Similarity Measure for Scientific Literature\n  Databases", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.IR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the number of people who use scientific literature databases grows, the\ndemand for literature retrieval services has been steadily increased. One of\nthe most popular retrieval services is to find a set of papers similar to the\npaper under consideration, which requires a measure that computes similarities\nbetween papers. Scientific literature databases exhibit two interesting\ncharacteristics that are different from general databases. First, the papers\ncited by old papers are often not included in the database due to technical and\neconomic reasons. Second, since a paper references the papers published before\nit, few papers cite recently-published papers. These two characteristics cause\nall existing similarity measures to fail in at least one of the following\ncases: (1) measuring the similarity between old, but similar papers, (2)\nmeasuring the similarity between recent, but similar papers, and (3) measuring\nthe similarity between two similar papers: one old, the other recent. In this\npaper, we propose a new link-based similarity measure called C-Rank, which uses\nboth in-link and out-link by disregarding the direction of references. In\naddition, we discuss the most suitable normalization method for scientific\nliterature databases and propose an evaluation method for measuring the\naccuracy of similarity measures. We have used a database with real-world papers\nfrom DBLP and their reference information crawled from Libra for experiments\nand compared the performance of C-Rank with those of existing similarity\nmeasures. Experimental results show that C-Rank achieves a higher accuracy than\nexisting similarity measures.\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2011 04:35:39 GMT"}], "update_date": "2011-09-07", "authors_parsed": [["Yoon", "Seok-Ho", ""], ["Kim", "Sang-Wook", ""], ["Park", "Sunju", ""]]}, {"id": "1109.1173", "submitter": "Loet Leydesdorff", "authors": "Lutz Bornmann and Loet Leydesdorff", "title": "Which cities' paper output and citation impact are above expectation in\n  information science? Some improvements of our previous mapping approaches", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bornmann and Leydesdorff (in press) proposed methods based on Web-of-Science\ndata to identify field-specific excellence in cities where highly-cited papers\nwere published more frequently than can be expected. Top performers in output\nare cities in which authors are located who publish a number of highly-cited\npapers that is statistically significantly higher than can be expected for\nthese cities. Using papers published between 1989 and 2009 in information\nscience improvements to the methods of Bornmann and Leydesdorff (in press) are\npresented and an alternative mapping approach based on the indicator I3 is\nintroduced here. The I3 indicator was introduced by Leydesdorff and Bornmann\n(in press).\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2011 13:21:33 GMT"}], "update_date": "2011-09-07", "authors_parsed": [["Bornmann", "Lutz", ""], ["Leydesdorff", "Loet", ""]]}, {"id": "1109.1186", "submitter": "Linyuan Lu", "authors": "Yan-Bo Zhou, Linyuan L\\\"u, Menghui Li", "title": "Quantifying the influence of scientists and their publications:\n  Distinguish prestige from popularity", "comments": "9 pages, 10 figures, 2 tables", "journal-ref": "New J Phys 14 (2012) 033033", "doi": "10.1088/1367-2630/14/3/033033", "report-no": null, "categories": "cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The number of citations is a widely used metric to evaluate the scientific\ncredit of papers, scientists and journals. However, it does happen that a paper\nwith fewer citations from prestigious scientists is of higher influence than\npapers with more citations. In this paper, we argue that from whom the paper is\nbeing cited is of higher significance than merely the number of received\ncitations. Accordingly, we propose an interactive model on author-paper\nbipartite networks as well as an iterative algorithm to get better rankings for\nscientists and their publications. The main advantage of this method is\ntwofold: (i) it is a parameter-free algorithm; (ii) it considers the\nrelationship between the prestige of scientists and the quality of their\npublications. We conducted real experiments on publications in econophysics,\nand applied this method to evaluate the influences of related scientific\njournals. The comparisons between the rankings by our method and simple\ncitation counts suggest that our method is effective to distinguish prestige\nfrom popularity.\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2011 13:47:30 GMT"}, {"version": "v2", "created": "Thu, 13 Oct 2011 03:35:46 GMT"}], "update_date": "2012-04-03", "authors_parsed": [["Zhou", "Yan-Bo", ""], ["Lü", "Linyuan", ""], ["Li", "Menghui", ""]]}, {"id": "1109.1525", "submitter": "Robert Kent", "authors": "Robert E. Kent", "title": "Conceptual Knowledge Markup Language: The central core", "comments": "Presented at the Twelfth Workshop on Knowledge Acquisition, Modeling\n  and Management (KAW'99), 1999", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The conceptual knowledge framework OML/CKML needs several components for a\nsuccessful design. One important, but previously overlooked, component is the\ncentral core of OML/CKML. The central core provides a theoretical link between\nthe ontological specification in OML and the conceptual knowledge\nrepresentation in CKML. This paper discusses the formal semantics and syntactic\nstyles of the central core, and also the important role it plays in defining\ninteroperability between OML/CKML, RDF/S and Ontolingua.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 18:09:49 GMT"}], "update_date": "2011-09-08", "authors_parsed": [["Kent", "Robert E.", ""]]}, {"id": "1109.1808", "submitter": "Alberto Pepe", "authors": "Alberto Pepe and Matthew S. Mayernik", "title": "The use of microblogging for field-based scientific research", "comments": "Proceedings of the 45th Hawaii International Conference on System\n  Science (HICSS-45 2012)", "journal-ref": null, "doi": "10.1109/HICSS.2012.589", "report-no": null, "categories": "cs.SI cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Documenting the context in which data are collected is an integral part of\nthe scientific research lifecycle. In field-based research, contextual\ninformation provides a detailed description of scientific practices and thus\nenables data interpretation and reuse. For field data, losing contextual\ninformation often means losing the data altogether. Yet, documenting the\ncontext of distributed, collaborative, field-based research can be a\nsignificant challenge due to the unpredictable nature of real-world settings\nand to the high degree of variability in data collection methods and scientific\npractices of different researchers. In this article, we propose the use of\nmicroblogging as a mechanism to support collection, ingestion, and publication\nof contextual information about the variegated digital artifacts that are\nproduced in field research. We perform interviews with scholars involved in\nfield-based environmental and urban sensing research, to determine the extent\nof adoption of Twitter and similar microblogging platforms and their potential\nuse for field-specific research applications. Based on the results of these\ninterviews as well as participant observation of field activities, we present\nthe design, development, and pilot evaluation of a microblogging application\nintegrated with an existing data collection platform on a handheld device. We\ninvestigate whether microblogging accommodates the variable and unpredictable\nnature of highly mobile research and whether it represents a suitable mechanism\nto document the context of field research data early in the scientific\ninformation lifecycle.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2011 19:09:04 GMT"}], "update_date": "2015-05-30", "authors_parsed": [["Pepe", "Alberto", ""], ["Mayernik", "Matthew S.", ""]]}, {"id": "1109.1841", "submitter": "Robert Kent", "authors": "Robert E. Kent and C. Mic Bowman", "title": "Digital Libraries, Conceptual Knowledge Systems, and the Nebula\n  Interface", "comments": "Technical report, Transarc Corporation, Pittsburgh, Pennsylvania,\n  April 1995", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Concept Analysis provides a principled approach to effective management of\nwide area information systems, such as the Nebula File System and Interface.\nThis not only offers evidence to support the assertion that a digital library\nis a bounded collection of incommensurate information sources in a logical\nspace, but also sheds light on techniques for collaboration through coordinated\naccess to the shared organization of knowledge.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2011 20:35:02 GMT"}], "update_date": "2011-09-12", "authors_parsed": [["Kent", "Robert E.", ""], ["Bowman", "C. Mic", ""]]}, {"id": "1109.2058", "submitter": "Ludo Waltman", "authors": "Nees Jan van Eck and Ludo Waltman", "title": "Text mining and visualization using VOSviewer", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  VOSviewer is a computer program for creating, visualizing, and exploring\nbibliometric maps of science. In this report, the new text mining functionality\nof VOSviewer is presented. A number of examples are given of applications in\nwhich VOSviewer is used for analyzing large amounts of text data.\n", "versions": [{"version": "v1", "created": "Fri, 9 Sep 2011 16:16:22 GMT"}], "update_date": "2011-09-12", "authors_parsed": [["van Eck", "Nees Jan", ""], ["Waltman", "Ludo", ""]]}, {"id": "1109.2306", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff", "title": "An Evaluation of Impacts in \"Nanoscience & nanotechnology:\" Steps\n  towards standards for citation analysis", "comments": "Scientometrics (in press). Paper to be presented at the 2011 Atlanta\n  Conference on Science, Technology, and Innovation Policy, September 15-17,\n  Atlanta GA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One is inclined to conceptualize impact in terms of citations per\npublication, and thus as an average. However, citation distributions are\nskewed, and the average has the disadvantage that the number of publications is\nused in the denominator. Using hundred percentiles, one can integrate the\nnormalized citation curve and develop an indicator that can be compared across\ndocument sets because percentile ranks are defined at the article level. I\napply this indicator to the set of 58 journals in the ISI Subject Category of\n\"Nanoscience & nanotechnology,\" and rank journals, countries, cities, and\ninstitutes using non-parametric statistics. The significance levels of results\ncan thus be indicated. The results are first compared with the ISI-Impact\nFactors, but this Integrated Impact Indicator (I3) can be used with any set\ndownloaded from the (Social) Science Citation Index. The software is made\npublicly available at the Internet. Visualization techniques are also specified\nfor evaluation by positioning institutes on Google Map overlays.\n", "versions": [{"version": "v1", "created": "Sun, 11 Sep 2011 11:22:01 GMT"}, {"version": "v2", "created": "Sat, 7 Apr 2012 11:52:11 GMT"}], "update_date": "2012-04-10", "authors_parsed": [["Leydesdorff", "Loet", ""]]}, {"id": "1109.3687", "submitter": "Josef Urban", "authors": "Jesse Alama, Lionel Mamane, Josef Urban", "title": "Dependencies in Formal Mathematics: Applications and Extraction for Coq\n  and Mizar", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two methods for extracting detailed formal dependencies from the Coq and\nMizar system are presented and compared. The methods are used for dependency\nextraction from two large mathematical repositories: the Coq Repository at\nNijmegen and the Mizar Mathematical Library. Several applications of the\ndetailed dependency analysis are described and proposed. Motivated by the\ndifferent applications, we discuss the various kinds of dependencies that we\nare interested in,and the suitability of various dependency extraction methods.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2011 18:25:18 GMT"}, {"version": "v2", "created": "Fri, 16 Mar 2012 19:20:02 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Alama", "Jesse", ""], ["Mamane", "Lionel", ""], ["Urban", "Josef", ""]]}, {"id": "1109.5520", "submitter": "Leo Waaijers", "authors": "Leo Waaijers", "title": "Viva the h-index", "comments": "Commenting article http://arxiv.org/abs/1108.3901 by Ludo Waltman and\n  Nees Jan van Neck on \"The inconsistency of the h-index\"", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.DL", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In their article 'The inconsistency of the h-index' Ludo Waltman and Nees Jan\nvan Neck give three examples to demonstrate the inconsistency of the h-index.\nAs will be explained, a little extension of their examples just illustrate the\nopposite, a stable feature of the h-index. For starting authors it, the h-index\nthat is, focusses on the number of articles; for experienced authors its focus\nshifts towards the citation scores. This feature may be liked or not but does\nnot make the h-index an inconsistent and inappropriate indicator, as the\nauthors claim.\n", "versions": [{"version": "v1", "created": "Mon, 26 Sep 2011 10:32:26 GMT"}], "update_date": "2011-09-27", "authors_parsed": [["Waaijers", "Leo", ""]]}, {"id": "1109.5560", "submitter": "Matus Medo", "authors": "Matus Medo, Giulio Cimini, Stanislao Gualdi", "title": "Temporal effects in the growth of networks", "comments": "4 pages, 3 figures", "journal-ref": "Physical Review Letters 107, 238701, 2011", "doi": "10.1103/PhysRevLett.107.238701", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that to explain the growth of the citation network by preferential\nattachment (PA), one has to accept that individual nodes exhibit heterogeneous\nfitness values that decay with time. While previous PA-based models assumed\neither heterogeneity or decay in isolation, we propose a simple analytically\ntreatable model that combines these two factors. Depending on the input\nassumptions, the resulting degree distribution shows an exponential, log-normal\nor power-law decay, which makes the model an apt candidate for modeling a wide\nrange of real systems.\n", "versions": [{"version": "v1", "created": "Mon, 26 Sep 2011 13:36:34 GMT"}], "update_date": "2011-12-05", "authors_parsed": [["Medo", "Matus", ""], ["Cimini", "Giulio", ""], ["Gualdi", "Stanislao", ""]]}, {"id": "1109.6211", "submitter": "Olesya Mryglod", "authors": "O. Mryglod, Yu. Holovatch, I. Mryglod", "title": "Editorial process in scientific journals: analysis and modeling", "comments": "14 pages", "journal-ref": "Scientometrics 91 (2012) 101-112", "doi": "10.1007/s11192-011-0536-1", "report-no": null, "categories": "physics.data-an cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The editorial handling of papers in scientific journals as a human activity\nprocess is considered. Using recently proposed approaches of human dynamics\ntheory we examine the probability distributions of random variables reflecting\nthe temporal characteristics of studied processes. The first part of this paper\ncontains our results of analysis of the real data about papers published in\nscientific journals. The second part is devoted to modeling of time-series\nconnected with editorial work. The purpose of our work is to present new object\nthat can be studied in terms of human dynamics theory and to corroborate the\nscientometrical application of the results obtained.\n", "versions": [{"version": "v1", "created": "Wed, 28 Sep 2011 14:06:36 GMT"}], "update_date": "2020-03-25", "authors_parsed": [["Mryglod", "O.", ""], ["Holovatch", "Yu.", ""], ["Mryglod", "I.", ""]]}, {"id": "1109.6221", "submitter": "Seung Ki Baek", "authors": "Seung Ki Baek, Petter Minnhagen and Beom Jun Kim", "title": "The Ten Thousand Kims", "comments": "13 pages, 8 figures", "journal-ref": "New J. Phys. 13, 073036 (2011)", "doi": "10.1088/1367-2630/13/7/073036", "report-no": null, "categories": "physics.soc-ph cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the Korean culture the family members are recorded in special family\nbooks. This makes it possible to follow the distribution of Korean family names\nfar back in history. It is here shown that these name distributions are well\ndescribed by a simple null model, the random group formation (RGF) model. This\nmodel makes it possible to predict how the name distributions change and these\npredictions are shown to be borne out. In particular, the RGF model predicts\nthat, for married women entering a collection of family books in a certain\nyear, the occurrence of the most common family name \"Kim\" should be directly\nproportional the total number of married women with the same proportionality\nconstant for all the years. This prediction is also borne out to high degree.\nWe speculate that it reflects some inherent social stability in the Korean\nculture. In addition, we obtain an estimate of the total population of the\nKorean culture down to year 500 AD, based on the RGF model and find about ten\nthousand Kims.\n", "versions": [{"version": "v1", "created": "Wed, 28 Sep 2011 14:26:15 GMT"}], "update_date": "2011-09-29", "authors_parsed": [["Baek", "Seung Ki", ""], ["Minnhagen", "Petter", ""], ["Kim", "Beom Jun", ""]]}]