[{"id": "1306.1491", "submitter": "Kian Hsiang Low", "authors": "Jie Chen, Kian Hsiang Low, Colin Keng-Yan Tan", "title": "Gaussian Process-Based Decentralized Data Fusion and Active Sensing for\n  Mobility-on-Demand System", "comments": "Robotics: Science and Systems (RSS 2013), Extended version with\n  proofs, 10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.DC cs.LG cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobility-on-demand (MoD) systems have recently emerged as a promising\nparadigm of one-way vehicle sharing for sustainable personal urban mobility in\ndensely populated cities. In this paper, we enhance the capability of a MoD\nsystem by deploying robotic shared vehicles that can autonomously cruise the\nstreets to be hailed by users. A key challenge to managing the MoD system\neffectively is that of real-time, fine-grained mobility demand sensing and\nprediction. This paper presents a novel decentralized data fusion and active\nsensing algorithm for real-time, fine-grained mobility demand sensing and\nprediction with a fleet of autonomous robotic vehicles in a MoD system. Our\nGaussian process (GP)-based decentralized data fusion algorithm can achieve a\nfine balance between predictive power and time efficiency. We theoretically\nguarantee its predictive performance to be equivalent to that of a\nsophisticated centralized sparse approximation for the GP model: The\ncomputation of such a sparse approximate GP model can thus be distributed among\nthe MoD vehicles, hence achieving efficient and scalable demand prediction.\nThough our decentralized active sensing strategy is devised to gather the most\ninformative demand data for demand prediction, it can achieve a dual effect of\nfleet rebalancing to service the mobility demands. Empirical evaluation on\nreal-world mobility demand data shows that our proposed algorithm can achieve a\nbetter balance between predictive accuracy and time efficiency than\nstate-of-the-art algorithms.\n", "versions": [{"version": "v1", "created": "Sun, 2 Jun 2013 14:05:49 GMT"}], "update_date": "2013-06-07", "authors_parsed": [["Chen", "Jie", ""], ["Low", "Kian Hsiang", ""], ["Tan", "Colin Keng-Yan", ""]]}, {"id": "1306.1849", "submitter": "Nicolas Maudet", "authors": "J\\'er\\^ome Lang, Nicolas Maudet, Maria Polukarov, Alice Cohen-Hadria", "title": "New Results on Equilibria in Strategic Candidacy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a voting setting where candidates have preferences about the\noutcome of the election and are free to join or leave the election. The\ncorresponding candidacy game, where candidates choose strategically to\nparticipate or not, has been studied %initially by Dutta et al., who showed\nthat no non-dictatorial voting procedure satisfying unanimity is\ncandidacy-strategyproof, that is, is such that the joint action where all\ncandidates enter the election is always a pure strategy Nash equilibrium. Dutta\net al. also showed that for some voting tree procedures, there are candidacy\ngames with no pure Nash equilibria, and that for the rule that outputs the\nsophisticated winner of voting by successive elimination, all games have a pure\nNash equilibrium. No results were known about other voting rules. Here we prove\nseveral such results. For four candidates, the message is, roughly, that most\nscoring rules (with the exception of Borda) do not guarantee the existence of a\npure Nash equilibrium but that Condorcet-consistent rules, for an odd number of\nvoters, do. For five candidates, most rules we study no longer have this\nguarantee. Finally, we identify one prominent rule that guarantees the\nexistence of a pure Nash equilibrium for any number of candidates (and for an\nodd number of voters): the Copeland rule. We also show that under mild\nassumptions on the voting rule, the existence of strong equilibria cannot be\nguaranteed.\n", "versions": [{"version": "v1", "created": "Fri, 7 Jun 2013 21:49:30 GMT"}, {"version": "v2", "created": "Wed, 24 Feb 2016 00:01:09 GMT"}], "update_date": "2016-02-25", "authors_parsed": [["Lang", "Jérôme", ""], ["Maudet", "Nicolas", ""], ["Polukarov", "Maria", ""], ["Cohen-Hadria", "Alice", ""]]}, {"id": "1306.1881", "submitter": "Cm Pintea", "authors": "Camelia-M. Pintea", "title": "Artificial Ant Species on Solving Optimization Problems", "comments": "4 pages, accepted paper", "journal-ref": "Sci. Stud. Res., Ser. Math. Inform. 23(1) (2013) 121-126", "doi": null, "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During the last years several ant-based techniques were involved to solve\nhard and complex optimization problems. The current paper is a short study\nabout the influence of artificial ant species in solving optimization problems.\nThere are studied the artificial Pharaoh Ants, Lasius Niger and also artificial\nants with no special specificity used commonly in Ant Colony Optimization.\n", "versions": [{"version": "v1", "created": "Sat, 8 Jun 2013 04:54:07 GMT"}], "update_date": "2013-08-20", "authors_parsed": [["Pintea", "Camelia-M.", ""]]}, {"id": "1306.1956", "submitter": "Giovanni Viglietta", "authors": "Paola Flocchini, Nicola Santoro, Giovanni Viglietta, Masafumi\n  Yamashita", "title": "Rendezvous of Two Robots with Constant Memory", "comments": "18 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.CG cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the impact that persistent memory has on the classical rendezvous\nproblem of two mobile computational entities, called robots, in the plane. It\nis well known that, without additional assumptions, rendezvous is impossible if\nthe entities are oblivious (i.e., have no persistent memory) even if the system\nis semi-synchronous (SSynch). It has been recently shown that rendezvous is\npossible even if the system is asynchronous (ASynch) if each robot is endowed\nwith O(1) bits of persistent memory, can transmit O(1) bits in each cycle, and\ncan remember (i.e., can persistently store) the last received transmission.\nThis setting is overly powerful.\n  In this paper we weaken that setting in two different ways: (1) by\nmaintaining the O(1) bits of persistent memory but removing the communication\ncapabilities; and (2) by maintaining the O(1) transmission capability and the\nability to remember the last received transmission, but removing the ability of\nan agent to remember its previous activities. We call the former setting\nfinite-state (FState) and the latter finite-communication (FComm). Note that,\neven though its use is very different, in both settings, the amount of\npersistent memory of a robot is constant.\n  We investigate the rendezvous problem in these two weaker settings. We model\nboth settings as a system of robots endowed with visible lights: in FState, a\nrobot can only see its own light, while in FComm a robot can only see the other\nrobot's light. We prove, among other things, that finite-state robots can\nrendezvous in SSynch, and that finite-communication robots are able to\nrendezvous even in ASynch. All proofs are constructive: in each setting, we\npresent a protocol that allows the two robots to rendezvous in finite time.\n", "versions": [{"version": "v1", "created": "Sat, 8 Jun 2013 20:34:43 GMT"}], "update_date": "2013-06-11", "authors_parsed": [["Flocchini", "Paola", ""], ["Santoro", "Nicola", ""], ["Viglietta", "Giovanni", ""], ["Yamashita", "Masafumi", ""]]}, {"id": "1306.3134", "submitter": "Steffen Eger", "authors": "Steffen Eger", "title": "Opinion dynamics and wisdom under out-group discrimination", "comments": "Further slight/minor ameliorations throughout. Also, fixed a small\n  error in Example 3.1", "journal-ref": "Mathematical Social Sciences (80), pp. 97-107, 2016", "doi": "10.1016/j.mathsocsci.2016.02.005", "report-no": null, "categories": "cs.MA cs.SI nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a DeGroot-like opinion dynamics model in which agents may oppose\nother agents. As an underlying motivation, in our setup, agents want to adjust\ntheir opinions to match those of the agents of their 'in-group' and, in\naddition, they want to adjust their opinions to match the 'inverse' of those of\nthe agents of their 'out-group'. Our paradigm can account for persistent\ndisagreement in connected societies as well as bi- and multi-polarization.\nOutcomes depend upon network structure and the choice of deviation function\nmodeling the mode of opposition between agents. For a particular choice of\ndeviation function, which we call soft opposition, we derive necessary and\nsufficient conditions for long-run polarization. We also consider social\ninfluence (who are the opinion leaders in the network?) as well as the question\nof wisdom in our naive learning paradigm, finding that wisdom is difficult to\nattain when there exist sufficiently strong negative relations between agents.\n", "versions": [{"version": "v1", "created": "Thu, 13 Jun 2013 15:21:32 GMT"}, {"version": "v2", "created": "Thu, 5 Sep 2013 20:52:04 GMT"}, {"version": "v3", "created": "Mon, 20 Apr 2015 11:48:25 GMT"}, {"version": "v4", "created": "Mon, 20 Jun 2016 20:49:11 GMT"}, {"version": "v5", "created": "Mon, 10 Oct 2016 22:39:53 GMT"}, {"version": "v6", "created": "Mon, 31 Oct 2016 21:06:12 GMT"}], "update_date": "2016-11-02", "authors_parsed": [["Eger", "Steffen", ""]]}, {"id": "1306.5166", "submitter": "Peter Hegarty", "authors": "Peter Hegarty, Anders Martinsson, Dmitry Zhelezov", "title": "A variant of the multi-agent rendezvous problem", "comments": "18 pages, 3 figures. None of the authors has any previous experience\n  in this area of research (multi-agent systems), hence we welcome any feedback\n  from specialists", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.CG cs.DS cs.RO math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The classical multi-agent rendezvous problem asks for a deterministic\nalgorithm by which $n$ points scattered in a plane can move about at constant\nspeed and merge at a single point, assuming each point can use only the\nlocations of the others it sees when making decisions and that the visibility\ngraph as a whole is connected. In time complexity analyses of such algorithms,\nonly the number of rounds of computation required are usually considered, not\nthe amount of computation done per round. In this paper, we consider\n$\\Omega(n^2 \\log n)$ points distributed independently and uniformly at random\nin a disc of radius $n$ and, assuming each point can not only see but also, in\nprinciple, communicate with others within unit distance, seek a randomised\nmerging algorithm which asymptotically almost surely (a.a.s.) runs in time\nO(n), in other words in time linear in the radius of the disc rather than in\nthe number of points. Under a precise set of assumptions concerning the\ncommunication capabilities of neighboring points, we describe an algorithm\nwhich a.a.s. runs in time O(n) provided the number of points is $o(n^3)$.\nSeveral questions are posed for future work.\n", "versions": [{"version": "v1", "created": "Fri, 21 Jun 2013 15:15:22 GMT"}], "update_date": "2013-06-24", "authors_parsed": [["Hegarty", "Peter", ""], ["Martinsson", "Anders", ""], ["Zhelezov", "Dmitry", ""]]}, {"id": "1306.6649", "submitter": "Jose Hernandez-Orallo", "authors": "Michel Halmes", "title": "Measurements of collective machine intelligence", "comments": "78 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Independent from the still ongoing research in measuring individual\nintelligence, we anticipate and provide a framework for measuring collective\nintelligence. Collective intelligence refers to the idea that several\nindividuals can collaborate in order to achieve high levels of intelligence. We\npresent thus some ideas on how the intelligence of a group can be measured and\nsimulate such tests. We will however focus here on groups of artificial\nintelligence agents (i.e., machines). We will explore how a group of agents is\nable to choose the appropriate problem and to specialize for a variety of\ntasks. This is a feature which is an important contributor to the increase of\nintelligence in a group (apart from the addition of more agents and the\nimprovement due to common decision making). Our results reveal some interesting\nresults about how (collective) intelligence can be modeled, about how\ncollective intelligence tests can be designed and about the underlying dynamics\nof collective intelligence. As it will be useful for our simulations, we\nprovide also some improvements of the threshold allocation model originally\nused in the area of swarm intelligence but further generalized here.\n", "versions": [{"version": "v1", "created": "Thu, 27 Jun 2013 20:10:45 GMT"}], "update_date": "2013-07-01", "authors_parsed": [["Halmes", "Michel", ""]]}]