[{"id": "1002.0344", "submitter": "Norman Packard", "authors": "Robert S. Shaw, Norman H. Packard", "title": "Leaky Membrane Dynamics", "comments": "4 pages, contains responses to referees", "journal-ref": null, "doi": "10.1103/PhysRevLett.105.098102", "report-no": null, "categories": "cond-mat.soft cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A concentration difference of particles across a membrane perforated by pores\nwill induce a diffusive flux. If the diffusing objects are of the same length\nscale as the the pores, diffusion may not be simple, objects can move into the\npore in a configuration that requires them to back up in order to continue\nforward. A configuration that blocks flow through the pore may be statistically\npreferred, an attracting metastable state of the system. This effect is purely\nkinetic, and not dependent on potentials, friction or dissipation. We discuss\nseveral geometries which generate this effect, and introduce a heuristic model\nwhich captures the qualitative features.\n", "versions": [{"version": "v1", "created": "Mon, 1 Feb 2010 21:39:07 GMT"}, {"version": "v2", "created": "Thu, 1 Jul 2010 23:42:44 GMT"}], "update_date": "2015-05-18", "authors_parsed": [["Shaw", "Robert S.", ""], ["Packard", "Norman H.", ""]]}, {"id": "1002.0409", "submitter": "Michael B\\\"orsch", "authors": "Stefan Ernst, Claire Batisse, Nawid Zarrabi, Bettina Boettcher,\n  Michael Boersch", "title": "Regulatory assembly of the vacuolar proton pump VOV1-ATPase in yeast\n  cells by FLIM-FRET", "comments": "8 pages, 3 figures", "journal-ref": null, "doi": "10.1117/12.841169", "report-no": null, "categories": "q-bio.SC q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the reversible disassembly of VOV1-ATPase in life yeast cells\nby time resolved confocal FRET imaging. VOV1-ATPase in the vacuolar membrane\npumps protons from the cytosol into the vacuole. VOV1-ATPase is a rotary\nbiological nanomotor driven by ATP hydrolysis. The emerging proton gradient is\nused for transport processes as well as for pH and Ca2+ homoeostasis in the\ncell. Activity of the VOV1-ATPase is regulated through assembly / disassembly\nprocesses. During starvation the two parts of VOV1-ATPase start to disassemble.\nThis process is reversed after addition of glucose. The exact mechanisms are\nunknown. To follow the disassembly / reassembly in vivo we tagged two subunits\nC and E with different fluorescent proteins. Cellular distributions of C and E\nwere monitored using a duty cycle-optimized alternating laser excitation scheme\n(DCO-ALEX) for time resolved confocal FRET-FLIM measurements.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2010 07:52:12 GMT"}], "update_date": "2015-05-18", "authors_parsed": [["Ernst", "Stefan", ""], ["Batisse", "Claire", ""], ["Zarrabi", "Nawid", ""], ["Boettcher", "Bettina", ""], ["Boersch", "Michael", ""]]}, {"id": "1002.1298", "submitter": "John Maloney", "authors": "John M. Maloney, Krystyn J. Van Vliet", "title": "The mechanical creep compliance of tissue cells is gamma distributed", "comments": "Withdrawn and replaced by arXiv:1104.0702", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Investigations of natural variation among cells within a population are\nessential for understanding the stochastic nature of tissue cell deformation\nunder applied load. In the existing literature, the population variation of\nsingle-cell creep compliance has so far been modeled universally by using a\nlog-normal distribution. Here we use optical stretching, a non-contact and\nrelatively high-throughput technique for probing cell mechanics, to accumulate\na sufficient data set that demonstrates robustly that cell compliance varies\naccording to the similar but distinct gamma distribution. Additionally, we\nre-examine existing simulations that were originally proposed to justify a\nlog-normal fit, and show that in fact these simulation data also correspond to\nthe gamma distribution. Finally, we propose a general stochastic differential\nequation that analytically predicts a gamma distribution of creep compliance\nduring cell stretching, as well as the Gaussian distribution of cell recovery\nthat we observe experimentally upon removal of applied load. The population\nvariation is well characterized by just a single parameter in each of the creep\nand recovery regimes. We expect our correction of a phenomenological\ndistribution fit, enabled by an expansive data set for mesenchymal stem cells,\nto enable the development of more accurate constitutive laws to describe\ncytoskeletal deformation. These findings thus serve to replace an empirical\ndistribution with a better-fitting model that rests on a more solid\nexperimental and theoretical foundation, and also provides a basis to predict\nand understand the stochastic nature of the mechanical response of individual\ncells within populations.\n", "versions": [{"version": "v1", "created": "Fri, 5 Feb 2010 19:06:37 GMT"}, {"version": "v2", "created": "Wed, 13 Jul 2011 19:05:57 GMT"}], "update_date": "2011-07-14", "authors_parsed": [["Maloney", "John M.", ""], ["Van Vliet", "Krystyn J.", ""]]}, {"id": "1002.1411", "submitter": "L. John Gagliardi Ph. D", "authors": "L. John Gagliardi", "title": "Continuum Electrostatics in Cell Biology", "comments": "16 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent experiments revealing possible nanoscale electrostatic interactions in\nforce generation at kinetochores for chromosome motions have prompted\nspeculation regarding possible models for interactions between positively\ncharged molecules in kinetochores and negative charge on C-termini near the\nplus ends of microtubules. A clear picture of how kinetochores establish and\nmaintain a dynamic coupling to microtubules for force generation during the\ncomplex motions of mitosis remains elusive. The current paradigm of molecular\ncell biology requires that specific molecules, or molecular geometries, for\nforce generation be identified. However, it is possible to account for mitotic\nmotions within a classical electrostatics approach in terms of experimentally\nknown cellular electric charge interacting over nanometer distances. These\ncharges are modeled as bound surface and volume continuum charge distributions.\nElectrostatic consequences of intracellular pH changes during mitosis may\nprovide a master clock for the events of mitosis.\n", "versions": [{"version": "v1", "created": "Sat, 6 Feb 2010 20:30:18 GMT"}], "update_date": "2010-02-09", "authors_parsed": [["Gagliardi", "L. John", ""]]}, {"id": "1002.1499", "submitter": "Simon Tindemans", "authors": "Simon H. Tindemans, Bela M. Mulder", "title": "Microtubule length distributions in the presence of protein-induced\n  severing", "comments": "9 pages, 4 figures", "journal-ref": "Phys. Rev. E 81, 031910 (2010)", "doi": "10.1103/PhysRevE.81.031910", "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Microtubules are highly regulated dynamic elements of the cytoskeleton of\neukaryotic cells. One of the regulation mechanisms observed in living cells is\nthe severing by the proteins katanin and spastin. We introduce a model for the\ndynamics of microtubules in the presence of randomly occurring severing events.\nUnder the biologically motivated assumption that the newly created plus end\nundergoes a catastrophe, we investigate the steady state length distribution.\nWe show that the presence of severing does not affect the number of\nmicrotubules, regardless of the distribution of severing events. In the special\ncase in which the microtubules cannot recover from the depolymerizing state (no\nrescue events) we derive an analytical expression for the length distribution.\nIn the general case we transform the problem into a single ODE that is solved\nnumerically.\n", "versions": [{"version": "v1", "created": "Sun, 7 Feb 2010 23:13:42 GMT"}], "update_date": "2010-03-12", "authors_parsed": [["Tindemans", "Simon H.", ""], ["Mulder", "Bela M.", ""]]}, {"id": "1002.2474", "submitter": "Andrew Mugler", "authors": "Andrew Mugler, Aleksandra M. Walczak, Chris H. Wiggins", "title": "Telling time with an intrinsically noisy clock", "comments": "10 pages, 5 figures", "journal-ref": "Published as \"Information-optimal transcriptional response to\n  oscillatory driving,\" Phys. Rev. Lett. 105, 058101 (2010)", "doi": "10.1103/PhysRevLett.105.058101", "report-no": null, "categories": "q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intracellular transmission of information via chemical and transcriptional\nnetworks is thwarted by a physical limitation: the finite copy number of the\nconstituent chemical species introduces unavoidable intrinsic noise. Here we\nprovide a method for solving for the complete probabilistic description of\nintrinsically noisy oscillatory driving. We derive and numerically verify a\nnumber of simple scaling laws. Unlike in the case of measuring a static\nquantity, response to an oscillatory driving can exhibit a resonant frequency\nwhich maximizes information transmission. Further, we show that the optimal\nregulatory design is dependent on the biophysical constraints (i.e., the\nallowed copy number and response time). The resulting phase diagram illustrates\nunder what conditions threshold regulation outperforms linear regulation.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2010 05:11:01 GMT"}], "update_date": "2010-08-27", "authors_parsed": [["Mugler", "Andrew", ""], ["Walczak", "Aleksandra M.", ""], ["Wiggins", "Chris H.", ""]]}, {"id": "1002.2644", "submitter": "Jan-Timm Kuhr", "authors": "Gerlinde Schwake, Simon Youssef, Jan-Timm Kuhr, Sebastian Gude, Maria\n  Pamela David, Eduardo Mendoza, Erwin Frey, Joachim O. R\\\"adler", "title": "Predictive Modeling of Non-Viral Gene Transfer", "comments": "20 pages, 6 figures, 12 pages supporting information", "journal-ref": "Biotechnology and Bioengineering, Volume 105, Issue 4, 805-813,\n  (2010)", "doi": "10.1002/bit.22604", "report-no": "LMU-ASC 44/09", "categories": "q-bio.QM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In non-viral gene delivery, the variance of transgenic expression stems from\nthe low number of plasmids successfully transferred. Here, we experimentally\ndetermine Lipofectamine- and PEI-mediated exogenous gene expression\ndistributions from single cell time-lapse analysis. Broad Poisson-like\ndistributions of steady state expression are observed for both transfection\nagents, when used with synchronized cell lines. At the same time,\nco-transfection analysis with YFP- and CFP-coding plasmids shows that multiple\nplasmids are simultaneously expressed, suggesting that plasmids are delivered\nin correlated units (complexes). We present a mathematical model of\ntransfection, where a stochastic, two-step process is assumed, with the first\nbeing the low-probability entry step of complexes into the nucleus, followed by\nthe subsequent release and activation of a small number of plasmids from a\ndelivered complex. This conceptually simple model consistently predicts the\nobserved fraction of transfected cells, the cotransfection ratio and the\nexpression level distribution. It yields the number of efficient plasmids per\ncomplex and elucidates the origin of the associated noise, consequently\nproviding a platform for evaluating and improving non-viral vectors.\n", "versions": [{"version": "v1", "created": "Fri, 12 Feb 2010 21:13:37 GMT"}], "update_date": "2010-02-16", "authors_parsed": [["Schwake", "Gerlinde", ""], ["Youssef", "Simon", ""], ["Kuhr", "Jan-Timm", ""], ["Gude", "Sebastian", ""], ["David", "Maria Pamela", ""], ["Mendoza", "Eduardo", ""], ["Frey", "Erwin", ""], ["Rädler", "Joachim O.", ""]]}, {"id": "1002.2987", "submitter": "Tom Chou", "authors": "S. Nowak and T. Chou", "title": "Models of dynamic extraction of lipid tethers from cell membranes", "comments": "16 pages, 7 figures", "journal-ref": null, "doi": "10.1088/1478-3975/7/2/026002", "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When a ligand that is bound to an integral membrane receptor is pulled, the\nmembrane and the underlying cytoskeleton can deform before either the membrane\ndelaminates from the cytoskeleton or the ligand detaches from the receptor. If\nthe membrane delaminates from the cytoskeleton, it may be further extruded and\nform a membrane tether. We develop a phenomenological model for this processes\nby assuming that deformations obey Hooke's law up to a critical force at which\nthe cell membrane locally detaches from the cytoskeleton and a membrane tether\nforms. We compute the probability of tether formation and show that they can be\nextruded only within an intermediate range of force loading rates and pulling\nvelocities. The mean tether length that arises at the moment of ligand\ndetachment is computed as are the force loading rates and pulling velocities\nthat yield the longest tethers.\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2010 02:06:06 GMT"}], "update_date": "2015-05-18", "authors_parsed": [["Nowak", "S.", ""], ["Chou", "T.", ""]]}, {"id": "1002.3907", "submitter": "Thierry Mora", "authors": "Thierry Mora and Ned S. Wingreen", "title": "Limits of sensing temporal concentration changes by single cells", "comments": "11 pages, 2 figures", "journal-ref": "Phys. Rev. Lett. 104, 248101 (2010)", "doi": "10.1103/PhysRevLett.104.248101", "report-no": null, "categories": "q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Berg and Purcell [Biophys. J. 20, 193 (1977)] calculated how the accuracy of\nconcentration sensing by single-celled organisms is limited by noise from the\nsmall number of counted molecules. Here we generalize their results to the\nsensing of concentration ramps, which is often the biologically relevant\nsituation (e.g. during bacterial chemotaxis). We calculate lower bounds on the\nuncertainty of ramp sensing by three measurement devices: a single receptor, an\nabsorbing sphere, and a monitoring sphere. We contrast two strategies, simple\nlinear regression of the input signal versus maximum likelihood estimation, and\nshow that the latter can be twice as accurate as the former. Finally, we\nconsider biological implementations of these two strategies, and identify\npossible signatures that maximum likelihood estimation is implemented by real\nbiological systems.\n", "versions": [{"version": "v1", "created": "Sat, 20 Feb 2010 16:54:08 GMT"}], "update_date": "2011-11-28", "authors_parsed": [["Mora", "Thierry", ""], ["Wingreen", "Ned S.", ""]]}, {"id": "1002.4273", "submitter": "Filipe Tostevin", "authors": "Filipe Tostevin, Pieter Rein ten Wolde", "title": "Mutual information in time-varying biochemical systems", "comments": "Minor corrections and expanded references. 17 pages, 4 figures, 2\n  tables; revtex4", "journal-ref": "Phys. Rev. E 81, 061917 (2010)", "doi": "10.1103/PhysRevE.81.061917", "report-no": null, "categories": "q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cells must continuously sense and respond to time-varying environmental\nstimuli. These signals are transmitted and processed by biochemical signalling\nnetworks. However, the biochemical reactions making up these networks are\nintrinsically noisy, which limits the reliability of intracellular signalling.\nHere we use information theory to characterise the reliability of transmission\nof time-varying signals through elementary biochemical reactions in the\npresence of noise. We calculate the mutual information for both instantaneous\nmeasurements and trajectories of biochemical systems for a Gaussian model. Our\nresults indicate that the same network can have radically different\ncharacteristics for the transmission of instantaneous signals and trajectories.\nFor trajectories, the ability of a network to respond to changes in the input\nsignal is determined by the timing of reaction events, and is independent of\nthe correlation time of the output of the network. We also study how reliably\nsignals on different time-scales can be transmitted by considering the\nfrequency-dependent coherence and gain-to-noise ratio. We find that a detector\nthat does not consume the ligand molecule upon detection can more reliably\ntransmit slowly varying signals, while an absorbing detector can more reliably\ntransmit rapidly varying signals. Furthermore, we find that while one reaction\nmay more reliably transmit information than another when considered in\nisolation, when placed within a signalling cascade the relative performance of\nthe two reactions can be reversed. This means that optimising signal\ntransmission at a single level of a signalling cascade can reduce signalling\nperformance for the cascade as a whole.\n", "versions": [{"version": "v1", "created": "Tue, 23 Feb 2010 09:14:43 GMT"}, {"version": "v2", "created": "Wed, 16 Jun 2010 16:50:31 GMT"}], "update_date": "2015-05-18", "authors_parsed": [["Tostevin", "Filipe", ""], ["Wolde", "Pieter Rein ten", ""]]}, {"id": "1002.5046", "submitter": "Scott Hotton", "authors": "Scott Hotton", "title": "A dynamical systems approach to actin-based motility in Listeria\n  monocytogenes", "comments": "6 pages, 2 figures", "journal-ref": "Europhysics Letters, 92 (2010) 30005", "doi": "10.1209/0295-5075/92/30005", "report-no": null, "categories": "q-bio.SC q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A simple kinematic model for the trajectories of Listeria monocytogenes is\ngeneralized to a dynamical system rich enough to exhibit the resonant Hopf\nbifurcation structure of excitable media and simple enough to be studied\ngeometrically. It is shown how L. monocytogenes trajectories and meandering\nspiral waves are organized by the same type of attracting set.\n", "versions": [{"version": "v1", "created": "Fri, 26 Feb 2010 19:59:03 GMT"}, {"version": "v2", "created": "Sun, 2 May 2010 18:56:57 GMT"}, {"version": "v3", "created": "Sat, 31 Jul 2010 04:19:20 GMT"}, {"version": "v4", "created": "Tue, 30 Nov 2010 00:10:12 GMT"}], "update_date": "2010-12-01", "authors_parsed": [["Hotton", "Scott", ""]]}]