[{"id": "1008.0298", "submitter": "Debashish Chowdhury", "authors": "Ajeet K. Sharma and Debashish Chowdhury", "title": "Distribution of dwell times of a ribosome: effects of infidelity,\n  kinetic proofreading and ribosome crowding", "comments": "This is an author-created, un-copyedited version of an article\n  accepted for publication in Physical Biology. IOP Publishing Ltd is not\n  responsible for any errors or omissions in this version of the manuscript or\n  any version derived from it. The definitive publisher authenticated version\n  is available online at DOI:10.1088/1478-3975/8/2/026005", "journal-ref": "Physical Biology, 8 (2011) 026005", "doi": "10.1088/1478-3975/8/2/026005", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ribosome is a molecular machine that polymerizes a protein where the sequence\nof the amino acid residues, the monomers of the protein, is dictated by the\nsequence of codons (triplets of nucleotides) on a messenger RNA (mRNA) that\nserves as the template. The ribosome is a molecular motor that utilizes the\ntemplate mRNA strand also as the track. Thus, in each step the ribosome moves\nforward by one codon and, simultaneously, elongates the protein by one amino\nacid. We present a theoretical model that captures most of the main steps in\nthe mechano-chemical cycle of a ribosome. The stochastic movement of the\nribosome consists of an alternating sequence of pause and translocation; the\nsum of the durations of a pause and the following translocation is the time of\ndwell of the ribosome at the corresponding codon. We derive the analytical\nexpression for the distribution of the dwell times of a ribosome in our model.\nWhereever experimental data are available, our theoretical predictions are\nconsistent with those results. We suggest appropriate experiments to test the\nnew predictions of our model, particularly, the effects of the quality control\nmechanism of the ribosome and that of their crowding on the mRNA track.\n", "versions": [{"version": "v1", "created": "Mon, 2 Aug 2010 13:06:10 GMT"}, {"version": "v2", "created": "Wed, 27 Oct 2010 09:37:46 GMT"}, {"version": "v3", "created": "Wed, 26 Jan 2011 09:25:06 GMT"}], "update_date": "2011-01-28", "authors_parsed": [["Sharma", "Ajeet K.", ""], ["Chowdhury", "Debashish", ""]]}, {"id": "1008.0950", "submitter": "Tsvi Tlusty", "authors": "D. Biron, E. Alvarez-Lacalle, Tsvi Tlusty, and Elisha Moses", "title": "Molecular Model of the Contractile Ring", "comments": "PACS numbers: 87.16.Ka, 87.16.Ac\n  http://www.ncbi.nlm.nih.gov/pubmed/16197254\n  http://www.weizmann.ac.il/complex/tlusty/papers/PhysRevLett2005.pdf", "journal-ref": "Phys. Rev. Lett. 95, 098102 (2005)", "doi": "10.1103/PhysRevLett.95.098102", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a model for the actin contractile ring of adherent animal cells.\nThe model suggests that the actin concentration within the ring and\nconsequently the power that the ring exerts both increase during contraction.\nWe demonstrate the crucial role of actin polymerization and depolymerization\nthroughout cytokinesis, and the dominance of viscous dissipation in the\ndynamics. The physical origin of two phases in cytokinesis dynamics (\"biphasic\ncytokinesis\") follows from a limitation on the actin density. The model is\nconsistent with a wide range of measurements of the midzone of dividing animal\ncells.\n", "versions": [{"version": "v1", "created": "Thu, 5 Aug 2010 11:40:14 GMT"}], "update_date": "2010-08-06", "authors_parsed": [["Biron", "D.", ""], ["Alvarez-Lacalle", "E.", ""], ["Tlusty", "Tsvi", ""], ["Moses", "Elisha", ""]]}, {"id": "1008.1091", "submitter": "J. M. Schwarz", "authors": "D. A. Quint and J. M. Schwarz", "title": "Optimal orientation in branched cytoskeletal networks", "comments": "14 pages, 10 figures, accepted to J. of Mathematical Biology", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC cond-mat.soft physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Actin cytoskeletal protrusions in crawling cells, or lamellipodia, exhibit\nvarious morphological properties such as two characteristic peaks in the\ndistribution of filament orientation with respect to the leading edge. To\nunderstand these properties, using the dendritic nucleation model as a basis\nfor cytoskeletal restructuring, a kinetic-population model with\norientational-dependent branching (birth) and capping (death) is constructed\nand analyzed. Optimizing for growth yields a relation between the branch angle\nand filament orientation that explains the two characteristic peaks. The model\nalso exhibits a subdominant population that allows for more accurate modeling\nof recent measurements of filamentous actin density along the leading edge of\nlamellipodia in keratocytes. Finally, we explore the relationship between\norientational and spatial organization of filamentous actin in lamellipodia and\naddress recent observations of a prevalence of overlapping filaments to\nbranched filaments---a finding that is claimed to be in contradiction with the\ndendritic nucleation model.\n", "versions": [{"version": "v1", "created": "Thu, 5 Aug 2010 21:49:52 GMT"}, {"version": "v2", "created": "Tue, 22 Feb 2011 19:41:15 GMT"}], "update_date": "2011-02-23", "authors_parsed": [["Quint", "D. A.", ""], ["Schwarz", "J. M.", ""]]}, {"id": "1008.2323", "submitter": "Ophir Flomenbom", "authors": "Ophir Flomenbom", "title": "Renewal-anomalous-heterogeneous files", "comments": "Accepted for publication (August, 2010)", "journal-ref": null, "doi": "10.1016/j.physleta.2010.08.029", "report-no": null, "categories": "cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Renewal-anomalous-heterogeneous files are solved. A simple file is made of\nBrownian hard spheres that diffuse stochastically in an effective 1D channel.\nGenerally, Brownian files are heterogeneous: the spheres' diffusion\ncoefficients are distributed and the initial spheres' density is non-uniform.\nIn renewal-anomalous files, the distribution of waiting times for individual\njumps is exponential as in Brownian files, yet obeys: {\\psi}_{\\alpha}\n(t)~t^(-1-{\\alpha}), 0<{\\alpha}<1. The file is renewal as all the particles\nattempt to jump at the same time. It is shown that the mean square displacement\n(MSD) in a renewal-anomalous-heterogeneous file, <r^2>, obeys,\n<r^2>~[<r^2>_{nrml}]^{\\alpha}, where <r^2 >_{nrml} is the MSD in the\ncorresponding Brownian file. This scaling is an outcome of an exact relation\n(derived here) connecting probability density functions of Brownian files and\nrenewal-anomalous files. It is also shown that non-renewal-anomalous files are\nslower than the corresponding renewal ones.\n", "versions": [{"version": "v1", "created": "Fri, 13 Aug 2010 14:16:32 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Flomenbom", "Ophir", ""]]}, {"id": "1008.2335", "submitter": "Giovanni Meacci", "authors": "Giovanni Meacci, Ganhui Lan, and Yuhai Tu", "title": "The Effects of Stator Compliance, Backs Steps, Temperature, and\n  Clockwise Rotation on the Torque-Speed Curve of Bacterial Flagellar Motor", "comments": "Article: 32 pages, 6 figures. Supplementary Information: 16 pages, 6\n  figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rotation of a single bacterial flagellar motor is powered by multiple stators\ntethered to the cell wall. In a \"power-stroke\" model the observed independence\nof the speed at low load on the number of stators is explained by a\ntorque-dependent stepping mechanism independent of the strength of the stator\ntethering spring. On the other hand, in models that depend solely on the stator\nspring to explain the observed behavior, exceedingly small stator spring\nconstants are required. To study the dynamics of the motor driven by external\nforces (such as those exerted by an optical tweezer), back-stepping is\nintroduced when stators are driven far out of equilibrium. Our model with\nback-stepping reproduces the observed absence of a barrier to backward\nrotation, as well the behaviors in the high-speed negative-torque regime.\nRecently measured temperature dependence of the motor speed near zero load\n(Yuan & Berg 2010 Biophys J) is explained quantitatively by the thermally\nactivated stepping rates in our model. Finally, we suggest that the general\nmechanical properties of all molecular motors (linear and rotary),\ncharacterized by their force(torque)-speed curve, can be determined by their\npower-stroke potentials and the dependence of the stepping rates on the\nmechanical state of the motor (force or speed). The torque-speed curve for the\nclockwise rotating flagellar motor has been observed for the first time\nrecently (Yuan et al. 2010 PNAS). Its quasi-linear behavior is quantitatively\nreproduced by our model. In particular, we show that concave and convex shapes\nof the torque-speed curve can be achieved by changing the interaction potential\nfrom linear to quadratic form. We also show that reversing the stepping rate\ndependence on force (torque) can lead to non-monotonicity in the speed-load\ndependency.\n", "versions": [{"version": "v1", "created": "Fri, 13 Aug 2010 14:53:14 GMT"}], "update_date": "2010-08-16", "authors_parsed": [["Meacci", "Giovanni", ""], ["Lan", "Ganhui", ""], ["Tu", "Yuhai", ""]]}, {"id": "1008.2525", "submitter": "Homin Shin", "authors": "Homin Shin and Gregory M. Grason", "title": "Structural Reorganization of Parallel Actin Bundles by Crosslinking\n  Proteins: Incommensurate States of Twist", "comments": "Main Text (25 pages, 7 figures) with supporting material (12 pages, 9\n  figures, 2 tables)", "journal-ref": null, "doi": "10.1103/PhysRevE.82.051919", "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct a coarse-grained model of parallel actin bundles crosslinked by\ncompact, globular bundling proteins, such as fascin and espin, necessary\ncomponents of filapodial and mechanosensory bundles. Consistent with structural\nobservations of bundles, we find that the optimal geometry for crosslinking is\novertwisted, requiring a coherent structural change of the helical geometry of\nthe filaments. We study the linker-dependent thermodynamic transition of\nbundled actin filaments from their native state to the overtwisted state and\nmap out the \"twist-state'' phase diagram in terms of the availability as well\nas the flexibility of crosslinker proteins. We predict that the transition from\nthe uncrosslinked to fully-crosslinked state is highly sensitive to linker\nflexibility: flexible crosslinking smoothly distorts the twist-state of bundled\nfilaments, while rigidly crosslinked bundles undergo a phase transition,\nrapidly overtwisting filaments over a narrow range of free crosslinker\nconcentrations. Additionally, we predict a rich spectrum of intermediate\nstructures, composed of alternating domains of sparsely-bound (untwisted) and\nstrongly-bound (overtwisted) filaments. This model reveals that subtle\ndifferences in crosslinking agents themselves modify not only the detailed\nstructure of parallel actin bundles, but also the thermodynamic pathway by\nwhich they form.\n", "versions": [{"version": "v1", "created": "Sun, 15 Aug 2010 14:36:29 GMT"}], "update_date": "2013-05-29", "authors_parsed": [["Shin", "Homin", ""], ["Grason", "Gregory M.", ""]]}, {"id": "1008.5171", "submitter": "Gerardo Aquino", "authors": "Gerardo Aquino and Robert G. Endres", "title": "Increased accuracy of ligand sensing by receptor diffusion on cell\n  surface", "comments": "11 pages, 7 figures, accepted for publication on Physical Review E", "journal-ref": "Physical Review E 82, 041902 (2010)", "doi": "10.1103/PhysRevE.82.041902", "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The physical limit with which a cell senses external ligand concentration\ncorresponds to the perfect absorber, where all ligand particles are absorbed\nand overcounting of same ligand particles does not occur. Here we analyze how\nthe lateral diffusion of receptors on the cell membrane affects the accuracy of\nsensing ligand concentration. Specifically, we connect our modeling to\nneurotransmission in neural synapses where the diffusion of glutamate receptors\nis already known to refresh synaptic connections. We find that receptor\ndiffusion indeed increases the accuracy of sensing for both the glutamate AMPA\nand NDMA receptors, although the NMDA receptor is overall much noiser. We\npropose that the difference in accuracy of sensing of the two receptors can be\nlinked to their different roles in neurotransmission. Specifically, the high\naccuracy in sensing glutamate is essential for the AMPA receptor to start\nmembrane depolarization, while the NMDA receptor is believed to work in a\nsecond stage as a coincidence detector, involved in long-term potentiation and\nmemory.\n", "versions": [{"version": "v1", "created": "Mon, 30 Aug 2010 21:23:04 GMT"}], "update_date": "2015-11-06", "authors_parsed": [["Aquino", "Gerardo", ""], ["Endres", "Robert G.", ""]]}]