[{"id": "1011.5431", "submitter": "Mois\\'es Santill\\'an Dr.", "authors": "Mois\\'es Santill\\'an", "title": "Dynamic Stability and Thermodynamic Characterization in an Enzymatic\n  Reaction at the Single Molecule Level", "comments": "In Press in Physica A", "journal-ref": null, "doi": "10.1016/j.physa.2011.05.032", "report-no": null, "categories": "q-bio.SC cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we study, at the single molecular level, the thermodynamic and\ndynamic characteristics of an enzymatic reaction comprising a rate limiting\nstep. We investigate how the stability of the enzyme-state stationary\nprobability distribution, the reaction velocity, and its efficiency of energy\nconversion depend on the system parameters. We employ in this study a recently\nintroduced formalism for performing a multiscale thermodynamic analysis in\ncontinuous-time discrete-state stochastic systems.\n", "versions": [{"version": "v1", "created": "Wed, 24 Nov 2010 17:04:16 GMT"}, {"version": "v2", "created": "Fri, 4 Feb 2011 16:43:14 GMT"}, {"version": "v3", "created": "Wed, 16 Mar 2011 21:55:43 GMT"}, {"version": "v4", "created": "Fri, 27 May 2011 16:59:28 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Santillán", "Moisés", ""]]}, {"id": "1011.6062", "submitter": "Philippe Marcq", "authors": "N. Yoshinaga, J.-F. Joanny, J. Prost and P. Marcq", "title": "Polarity patterns of stress fibers", "comments": "5 pages, 3 figures", "journal-ref": "Phys. Rev. Lett. 105, 238103 (2010)", "doi": "10.1103/PhysRevLett.105.238103", "report-no": null, "categories": "q-bio.QM cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stress fibers are contractile actomyosin bundles commonly observed in the\ncytoskeleton of metazoan cells. The spatial profile of the polarity of actin\nfilaments inside contractile actomyosin bundles is either monotonic (graded) or\nperiodic (alternating). In the framework of linear irreversible thermodynamics,\nwe write the constitutive equations for a polar, active, elastic\none-dimensional medium. An analysis of the resulting equations for the dynamics\nof polarity shows that the transition from graded to alternating polarity\npatterns is a nonequilibrium Lifshitz point. Active contractility is a\nnecessary condition for the emergence of sarcomeric, alternating polarity\npatterns.\n", "versions": [{"version": "v1", "created": "Sun, 28 Nov 2010 17:00:47 GMT"}], "update_date": "2010-12-09", "authors_parsed": [["Yoshinaga", "N.", ""], ["Joanny", "J. -F.", ""], ["Prost", "J.", ""], ["Marcq", "P.", ""]]}, {"id": "1011.6344", "submitter": "Anatoly Smirnov", "authors": "Anatoly Yu. Smirnov, Lev G. Mourokh, and Franco Nori", "title": "Electrostatic models of electron-driven proton transfer across a lipid\n  membrane", "comments": "25 pages, 8 figures", "journal-ref": "J. Phys.: Condens. Matter 23, 234101 (2011)", "doi": "10.1088/0953-8984/23/23/234101", "report-no": null, "categories": "cond-mat.mes-hall physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present two models for electron-driven uphill proton transport across\nlipid membranes, with the electron energy converted to the proton gradient via\nthe electrostatic interaction. In the first model, associated with the\ncytochrome c oxidase complex in the inner mitochondria membranes, the\nelectrostatic coupling to the site occupied by an electron lowers the energy\nlevel of the proton-binding site, making the proton transfer possible. In the\nsecond model, roughly describing the redox loop in a nitrate respiration of E.\ncoli bacteria, an electron displaces a proton from the negative side of the\nmembrane to a shuttle, which subsequently diffuses across the membrane and\nunloads the proton to its positive side. We show that both models can be\ndescribed by the same approach, which can be significantly simplified if the\nsystem is separated into several clusters, with strong Coulomb interaction\ninside each cluster and weak transfer couplings between them. We derive and\nsolve the equations of motion for the electron and proton creation/annihilation\noperators, taking into account the appropriate Coulomb terms, tunnel couplings,\nand the interaction with the environment. For the second model, these equations\nof motion are solved jointly with a Langevin-type equation for the shuttle\nposition. We obtain expressions for the electron and proton currents and\ndetermine their dependence on the electron and proton voltage build-ups,\non-site charging energies, reorganization energies, temperature, and other\nsystem parameters. We show that the quantum yield in our models can be up to\n100% and the power-conversion efficiency can reach 35%.\n", "versions": [{"version": "v1", "created": "Mon, 29 Nov 2010 19:44:34 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Smirnov", "Anatoly Yu.", ""], ["Mourokh", "Lev G.", ""], ["Nori", "Franco", ""]]}]