[{"id": "1104.0876", "submitter": "Gregory Boutis Steven", "authors": "Cheng Sun, Odingo Mitchell, Jiaxin Huang and Gregory S. Boutis", "title": "Direct measurement of the correlated dynamics of the protein-backbone\n  and proximal waters of hydration in mechanically strained elastin", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report on the direct measurement of the correlation times of the protein\nbackbone carbons and proximal waters of hydration in mechanically strained\nelastin by nuclear magnetic resonance methods. The experimental data indicate a\ndecrease in the correlation times of the carbonyl carbons as the strain on the\nbiopolymer is increased. These observations are in good agreement with short\n4ns molecular dynamics simulations of (VPGVG)3, a well studied mimetic peptide\nof elastin. The experimental results also indicate a reduction in the\ncorrelation time of proximal waters of hydration with increasing strain applied\nto the elastomer. A simple model is suggested that correlates the increase in\nthe motion of proximal waters of hydration to the increase in frequency of\nlibration of the protein backbone that develops with increasing strain.\nTogether, the reduction in the protein entropy accompanied with the increase in\nentropy of the proximal waters of hydration with increasing strain, support the\nnotion that the source of elasticity is driven by an entropic mechanism arising\nfrom the change in entropy of the protein backbone.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2011 16:06:29 GMT"}], "update_date": "2011-04-06", "authors_parsed": [["Sun", "Cheng", ""], ["Mitchell", "Odingo", ""], ["Huang", "Jiaxin", ""], ["Boutis", "Gregory S.", ""]]}, {"id": "1104.0910", "submitter": "Michael Sheinman", "authors": "M. Sheinman, O. B\\'enichou, Y. Kafri and R. Voituriez", "title": "Classes of fast and specific search mechanisms for proteins on DNA", "comments": "65 pages, 23 figures", "journal-ref": "Rep. Prog. Phys. 75 (2012) 026601", "doi": "10.1088/0034-4885/75/2/026601", "report-no": null, "categories": "q-bio.BM cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Problems of search and recognition appear over different scales in biological\nsystems. In this review we focus on the challenges posed by interactions\nbetween proteins, in particular transcription factors, and DNA and possible\nmechanisms which allow for a fast and selective target location. Initially we\nargue that DNA-binding proteins can be classified, broadly, into three distinct\nclasses which we illustrate using experimental data. Each class calls for a\ndifferent search process and we discuss the possible application of different\nsearch mechanisms proposed over the years to each class. The main thrust of\nthis review is a new mechanism which is based on barrier discrimination. We\nintroduce the model and analyze in detail its consequences. It is shown that\nthis mechanism applies to all classes of transcription factors and can lead to\na fast and specific search. Moreover, it is shown that the mechanism has\ninteresting transient features which allow for stability at the target despite\nrapid binding and unbinding of the transcription factor from the target.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2011 18:47:08 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Sheinman", "M.", ""], ["Bénichou", "O.", ""], ["Kafri", "Y.", ""], ["Voituriez", "R.", ""]]}, {"id": "1104.1028", "submitter": "Louis-Serge Bouchard", "authors": "K. Youssef, J. J. Mack, M. L. Iruela-Arispe, L.-S. Bouchard", "title": "Macro-scale Topology Optimization for Controlling Internal Shear Stress\n  in a Porous Scaffold Bioreactor", "comments": null, "journal-ref": "Biotechnology & Bioengineering, 109(7):1844-1854 (2012)", "doi": "10.1002/bit.24440", "report-no": null, "categories": "cond-mat.soft physics.bio-ph physics.flu-dyn q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Shear stress is an important physical factor that regulates proliferation,\nmigration and morphogenesis. In particular, the homeostasis of blood vessels is\ndependent on shear stress. To mimic this process ex vivo, efforts have been\nmade to seed scaffolds with vascular and other cell types in the presence of\ngrowth factors and under pulsatile flow conditions. However, the resulting\nbioreactors lack information on shear stress and flow distributions within the\nscaffold. Consequently, it is difficult to interpret the effects of shear\nstress on cell function. Such knowledge would enable researchers to improve\nupon cell culture protocols. Recent work has focused on optimizing the\nmicrostructural parameters of the scaffold to fine tune the shear stress. In\nthis study, we have adopted a different approach whereby flows are redirected\nthroughout the bioreactor along channels patterned in the porous scaffold to\nyield shear stress distributions that are optimized for uniformity centered on\na target value. A topology optimization algorithm coupled to computational\nfluid dynamics simulations was devised to this end. The channel topology in the\nporous scaffold was varied using a combination of genetic algorithm and fuzzy\nlogic. The method is validated by experiments using magnetic resonance imaging\n(MRI) readouts of the flow field.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2011 08:14:33 GMT"}, {"version": "v2", "created": "Mon, 9 Jan 2012 19:17:09 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Youssef", "K.", ""], ["Mack", "J. J.", ""], ["Iruela-Arispe", "M. L.", ""], ["Bouchard", "L. -S.", ""]]}, {"id": "1104.2204", "submitter": "Juergen Reingruber", "authors": "Juergen Reingruber and David Holcman", "title": "Transcription factor search for a DNA promoter in a three-states model", "comments": "4 pages, 3 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.84.020901", "report-no": null, "categories": "q-bio.SC q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To ensure fast gene activation, Transcription Factors (TF) use a mechanism\nknown as facilitated diffusion to find their DNA promoter site. Here we analyze\nsuch a process where a TF alternates between 3D and 1D diffusion. In the latter\n(TF bound to the DNA), the TF further switches between a fast translocation\nstate dominated by interaction with the DNA backbone, and a slow examination\nstate where interaction with DNA base pairs is predominant. We derive a new\nformula for the mean search time, and show that it is faster and less sensitive\nto the binding energy fluctuations compared to the case of a single sliding\nstate. We find that for an optimal search, the time spent bound to the DNA is\nlarger compared to the 3D time in the nucleus, in agreement with recent\nexperimental data. Our results further suggest that modifying switching via\nphosphorylation or methylation of the TF or the DNA can efficiently regulate\ntranscription.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2011 13:16:09 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Reingruber", "Juergen", ""], ["Holcman", "David", ""]]}, {"id": "1104.2613", "submitter": "Benjamin Machta", "authors": "Aurelia R. Honerkamp-Smith, Benjamin B. Machta, Sarah L. Keller", "title": "Experimental observations of dynamic critical phenomena in a lipid\n  membrane", "comments": "5 pages, 3 figures and 2 additional pages of supplement", "journal-ref": null, "doi": "10.1103/PhysRevLett.108.265702", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph physics.flu-dyn q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Near a critical point, the time scale of thermally-induced fluctuations\ndiverges in a manner determined by the dynamic universality class. Experiments\nhave verified predicted 3D dynamic critical exponents in many systems, but\nsimilar experiments in 2D have been lacking for the case of conserved order\nparameter. Here we analyze time-dependent correlation functions of a quasi-2D\nlipid bilayer in water to show that its critical dynamics agree with a recently\npredicted universality class. In particular, the effective dynamic exponent\n$z_{\\text{eff}}$ crosses over from $\\sim 2$ to $\\sim 3$ as the correlation\nlength of fluctuations exceeds a hydrodynamic length set by the membrane and\nbulk viscosities.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2011 20:35:13 GMT"}, {"version": "v2", "created": "Wed, 9 May 2012 15:08:34 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Honerkamp-Smith", "Aurelia R.", ""], ["Machta", "Benjamin B.", ""], ["Keller", "Sarah L.", ""]]}, {"id": "1104.4092", "submitter": "Pablo Sartori", "authors": "Pablo Sartori and Yuhai Tu", "title": "Noise Filtering Strategies of Adaptive Signaling Networks: The Case of\n  E. Coli Chemotaxis", "comments": "15 pages, 4 figures", "journal-ref": "Journal of Statistical Physics: Statistical Mechanics and Biology\n  special issue, Year 2011, Month April, Volume 142, Number 6, 1206-1217", "doi": "10.1007/s10955-011-0169-z", "report-no": null, "categories": "q-bio.CB physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two distinct mechanisms for filtering noise in an input signal are identified\nin a class of adaptive sensory networks. We find that the high frequency noise\nis filtered by the output degradation process through time-averaging; while the\nlow frequency noise is damped by adaptation through negative feedback. Both\nfiltering processes themselves introduce intrinsic noises, which are found to\nbe unfiltered and can thus amount to a significant internal noise floor even\nwithout signaling. These results are applied to E. coli chemotaxis. We show\nunambiguously that the molecular mechanism for the Berg-Purcell time-averaging\nscheme is the dephosphorylation of the response regulator CheY-P, not the\nreceptor adaptation process as previously suggested. The high frequency noise\ndue to the stochastic ligand binding-unbinding events and the random ligand\nmolecule diffusion is averaged by the CheY-P dephosphorylation process to a\nnegligible level in E.coli. We identify a previously unstudied noise source\ncaused by the random motion of the cell in a ligand gradient. We show that this\nrandom walk induced signal noise has a divergent low frequency component, which\nis only rendered finite by the receptor adaptation process. For gradients\nwithin the E. coli sensing range, this dominant external noise can be\ncomparable to the significant intrinsic noise in the system. The dependence of\nthe response and its fluctuations on the key time scales of the system are\nstudied systematically. We show that the chemotaxis pathway may have evolved to\noptimize gradient sensing, strong response, and noise control in different time\nscales\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2011 18:30:19 GMT"}], "update_date": "2016-11-25", "authors_parsed": [["Sartori", "Pablo", ""], ["Tu", "Yuhai", ""]]}, {"id": "1104.5090", "submitter": "Peter Ashwin", "authors": "Congping Lin, Gero Steinberg and Peter Ashwin", "title": "Bidirectional transport and pulsing states in a multi-lane ASEP model", "comments": "11 figures", "journal-ref": null, "doi": "10.1088/1742-5468/2011/09/P09027", "report-no": null, "categories": "nlin.CG math.DS physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we introduce an ASEP-like transport model for bidirectional\nmotion of particles on a multi-lane lattice. The model is motivated by {\\em in\nvivo} experiments on organelle motility along a microtubule (MT), consisting of\nthirteen protofilaments, where particles are propelled by molecular motors\n(dynein and kinesin). In the model, organelles (particles) can switch\ndirections of motion due to \"tug-of-war\" events between counteracting motors.\nCollisions of particles on the same lane can be cleared by switching to\nadjacent protofilaments (lane changes).\n  We analyze transport properties of the model with no-flux boundary conditions\nat one end of a MT (\"plus-end\" or tip). We show that the ability of lane\nchanges can affect the transport efficiency and the particle-direction change\nrate obtained from experiments is close to optimal in order to achieve\nefficient motor and organelle transport in a living cell. In particular, we\nfind a nonlinear scaling of the mean {\\em tip size} (the number of particles\naccumulated at the tip) with injection rate and an associated phase transition\nleading to {\\em pulsing states} characterized by periodic filling and emptying\nof the system.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2011 08:36:04 GMT"}, {"version": "v2", "created": "Wed, 13 Jul 2011 11:05:16 GMT"}], "update_date": "2015-05-28", "authors_parsed": [["Lin", "Congping", ""], ["Steinberg", "Gero", ""], ["Ashwin", "Peter", ""]]}]