[{"id": "1111.0201", "submitter": "Geraldine Celliere", "authors": "Geraldine Celliere, Georgios Fengos, Marianne Herve and Dagmar Iber", "title": "The plasticity of TGF-beta signaling", "comments": "43 pages, main text, supplementary figures and supplementary tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The family of TGFb ligands is large and its members are involved in many\ndifferent signaling processes. These signaling processes strongly differ in\ntype with TGFb ligands eliciting both sustained or transient responses. Members\nof the TGFb family can also act as morphogen and cellular responses would then\nbe expected to provide a direct read-out of the extracellular ligand\nconcentration. We were interested to define the set of minimal modifications\nthat are required to change the type of signal processing in the TGFb signaling\nnetwork. To define the key aspects for signaling plasticity we focused on the\ncore of the TGFb signaling network. With the help of a parameter screen we\nidentified ranges of kinetic parameters and protein concentrations that give\nrise to transient, sustained, or oscillatory responses to constant stimuli, as\nwell as those parameter ranges that enable a proportional response to\ntime-varying ligand concentrations (as expected in the read-out of morphogens).\nA combination of a strong negative feedback and fast shuttling to the nucleus\nbiases signaling to a transient rather than a sustained response, while\noscillations were obtained if ligand binding to the receptor is weak and the\nturn-over of the I-Smad is fast. A proportional read-out required inefficient\nreceptor activation in addition to a low affinity of receptor-ligand binding.\nWe find that targeted modification of single parameters suffices to alter the\nresponse type. The architecture of the TGFb pathway enables the observed\nsignaling plasticity. The observed range of signaling outputs to TGFb ligand in\ndifferent cell types and under different conditions can be explained with\ndifferences in cellular protein concentrations and with changes in effective\nrate constants due to cross-talk with other signaling pathways.\n", "versions": [{"version": "v1", "created": "Tue, 1 Nov 2011 13:34:54 GMT"}, {"version": "v2", "created": "Wed, 2 Nov 2011 14:54:32 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Celliere", "Geraldine", ""], ["Fengos", "Georgios", ""], ["Herve", "Marianne", ""], ["Iber", "Dagmar", ""]]}, {"id": "1111.0684", "submitter": "Scott McKinley", "authors": "Scott A. McKinley, Avanti Athreya, John Fricks and Peter R. Kramer", "title": "Asymptotic Analysis of Microtubule-Based Transport by Multiple Identical\n  Molecular Motors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a system of stochastic differential equations (SDEs) which model\nthe interaction between processive molecular motors, such as kinesin and\ndynein, and the biomolecular cargo they tow as part of microtubule-based\nintracellular transport. We show that the classical experimental environment\nfits within a parameter regime which is qualitatively distinct from conditions\none expects to find in living cells. Through an asymptotic analysis of our\nsystem of SDEs, we develop a means for applying in vitro observations of the\nnonlinear response by motors to forces induced on the attached cargo to make\nanalytical predictions for two parameter regimes that have thus far eluded\ndirect experimental observation: 1) highly viscous in vivo transport and 2)\ndynamics when multiple identical motors are attached to the cargo and\nmicrotubule.\n", "versions": [{"version": "v1", "created": "Wed, 2 Nov 2011 22:46:41 GMT"}], "update_date": "2011-11-04", "authors_parsed": [["McKinley", "Scott A.", ""], ["Athreya", "Avanti", ""], ["Fricks", "John", ""], ["Kramer", "Peter R.", ""]]}, {"id": "1111.1047", "submitter": "Ziqing Wang", "authors": "Ziqing Wang and Ming Li", "title": "A new cooperation mechanism of kinesin motors when extracting membrane\n  tube", "comments": "6 pages, 5 figures. Submitted to Physical Review E", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.BM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Membrane tubes are important elements for living cells to organize many\nfunctions. Experiments have found that membrane tube can be extracted from\ngiant lipid vesicles by a group of kinesin. How these motors cooperate in\nextracting the fluid-like membrane tube is still unclear. In this paper, we\npropose a new cooperation mechanism called two-track-dumbbell model, in which\nkinesin is regarded as a dumbbell with an end (tail domain) tightly bound onto\nthe fluid-like membrane and the other end (head domain) stepping on or\nunbinding from the microtubule. Taking account of the elasticity of kinesin\nmolecule and the exclude volume effect of both the head domain and the tail\ndomain of kinesin, which are not considered in previous models, we simulate the\ngrowth process of the membrane tube pulled by kinesin motors. Our results\nindicate that motors along a single microtubule protofilament can generate\nenough force to extract membrane tubes from vesicles, and the average number of\nmotors pulling the tube is about 8~9. These results are quite different from\nprevious studies (Ref. \\cite{camp.08}), and further experimental tests are\nnecessary to elucidate the cooperation mechanism.\n", "versions": [{"version": "v1", "created": "Fri, 4 Nov 2011 05:18:12 GMT"}], "update_date": "2011-11-08", "authors_parsed": [["Wang", "Ziqing", ""], ["Li", "Ming", ""]]}, {"id": "1111.1415", "submitter": "Jay Newby", "authors": "Jay Newby", "title": "Isolating intrinsic noise sources in a stochastic genetic switch", "comments": "25 pages, 5 figures", "journal-ref": null, "doi": "10.1088/1478-3975/9/2/026002", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The stochastic mutual repressor model is analysed using perturbation methods.\nThis simple model of a gene circuit consists of two genes and three promotor\nstates. Either of the two protein products can dimerize, forming a repressor\nmolecule that binds to the promotor of the other gene. When the repressor is\nbound to a promotor, the corresponding gene is not transcribed and no protein\nis produced. Either one of the promotors can be repressed at any given time or\nboth can be unrepressed, leaving three possible promotor states. This model is\nanalysed in its bistable regime in which the deterministic limit exhibits two\nstable fixed points and an unstable saddle, and the case of small noise is\nconsidered. On small time scales, the stochastic process fluctuates near one of\nthe stable fixed points, and on large time scales, a metastable transition can\noccur, where fluctuations drive the system past the unstable saddle to the\nother stable fixed point. To explore how different intrinsic noise sources\naffect these transitions, fluctuations in protein production and degradation\nare eliminated, leaving fluctuations in the promotor state as the only source\nof noise in the system. Perturbation methods are then used to compute the\nstability landscape and the distribution of transition times, or first exit\ntime density. To understand how protein noise affects the system, small\nmagnitude fluctuations are added back into the process, and the stability\nlandscape is compared to that of the process without protein noise. It is found\nthat significant differences in the random process emerge in the presence of\nprotein noise.\n", "versions": [{"version": "v1", "created": "Sun, 6 Nov 2011 13:04:10 GMT"}], "update_date": "2014-06-12", "authors_parsed": [["Newby", "Jay", ""]]}, {"id": "1111.2143", "submitter": "Martin Castelnovo", "authors": "Elmar Nurmemmedov (L.U.), Martin Castelnovo (Phys-ENS), Elizabeth\n  Medina, Carlos Enrique Catalano, Alex Evilevitch (L.U., CMU)", "title": "Challenging packaging limits and infectivity of phage {\\lambda}", "comments": null, "journal-ref": null, "doi": "10.1016/j.bpj.2011.11.3500", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The terminase motors of bacteriophages have been shown to be among the\nstrongest active machines in the biomolecular world, being able to package\nseveral tens of kilobase pairs of viral genome into a capsid within minutes.\nYet these motors are hindered at the end of the packaging process by the\nprogressive build-up of a force resisting packaging associated with already\npackaged DNA. In this experimental work, we raise the issue of what sets the\nupper limit on the length of the genome that can be packaged by the terminase\nmotor of phage {\\lambda} and still yield infectious virions, and the conditions\nunder which this can be efficiently performed. Using a packaging strategy\ndeveloped in our laboratory of building phage {\\lambda} from scratch, together\nwith plaque assay monitoring, we have been able to show that the terminase\nmotor of phage {\\lambda} is able to produce infectious particles with up to\n110% of the wild-type (WT) {\\lambda}-DNA length. However, the phage production\nrate, and thus the infectivity, decreased exponentially with increasing DNA\nlength, and was a factor of 103 lower for the 110% {\\lambda}-DNA phage.\nInterestingly, our in vitro strategy was still efficient in fully packaging\nphages with DNA lengths as high as 114% of the WT length, but these viruses\nwere unable to infect bacterial cells efficiently. Further, we demonstrated\nthat the phage production rate is modulated by the presence of multivalent\nionic species. The biological consequences of these finding are discussed.\n", "versions": [{"version": "v1", "created": "Wed, 9 Nov 2011 09:07:52 GMT"}], "update_date": "2015-06-03", "authors_parsed": [["Nurmemmedov", "Elmar", "", "L.U."], ["Castelnovo", "Martin", "", "Phys-ENS"], ["Medina", "Elizabeth", "", "L.U., CMU"], ["Catalano", "Carlos Enrique", "", "L.U., CMU"], ["Evilevitch", "Alex", "", "L.U., CMU"]]}, {"id": "1111.4106", "submitter": "Jose Vilar", "authors": "Jose M. G. Vilar and Leonor Saiz", "title": "Trafficking Coordinate Description of Intracellular Transport Control of\n  Signaling Networks", "comments": "17 pages, 5 figures", "journal-ref": "Biophys. J. 101, 2315-2323 (2011)", "doi": "10.1016/j.bpj.2011.09.035", "report-no": null, "categories": "q-bio.SC physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many cellular networks rely on the regulated transport of their components to\ntransduce extracellular information into precise intracellular signals. The\ndynamics of these networks is typically described in terms of compartmentalized\nchemical reactions. There are many important situations, however, in which the\nproperties of the compartments change continuously in a way that cannot\nnaturally be described by chemical reactions. Here, we develop an approach\nbased on transport along a trafficking coordinate to precisely describe these\nprocesses and we apply it explicitly to the TGF-{\\beta} signal transduction\nnetwork, which plays a fundamental role in many diseases and cellular\nprocesses. The results of this newly introduced approach accurately capture for\nthe first time the distinct TGF-{\\beta} signaling dynamics of cells with and\nwithout cancerous backgrounds and provide an avenue to predict the effects of\nchemical perturbations in a way that closely recapitulates the observed\ncellular behavior.\n", "versions": [{"version": "v1", "created": "Thu, 17 Nov 2011 14:17:18 GMT"}], "update_date": "2011-11-18", "authors_parsed": [["Vilar", "Jose M. G.", ""], ["Saiz", "Leonor", ""]]}, {"id": "1111.6611", "submitter": "Daniel Smith", "authors": "Daniel B. Smith and Jian Liu", "title": "Branching actin network remodeling governs the force-velocity\n  relationship", "comments": "Submitted to Biophysical Journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Actin networks, acting as an engine pushing against an external load, are\nfundamentally important to cell motility. A measure of the effectiveness of an\nengine is the velocity the engine is able to produce at a given force, the\nforce-velocity curve. One type of force-velocity curve, consisting of a concave\nregion where velocity is insensitive to increasing force followed by a decrease\nin velocity, is indicative of an adaptive response. In contrast, an engine\nwhose velocity rapidly decays as a convex curve in response to increasing force\nwould indicate a lack of adaptive response. Even taken outside of a cellular\ncontext, branching actin networks have been observed to exhibit both concave\nand convex force-velocity curves. The exact mechanism that can explain both\nforce-velocity curves is not yet known. We carried out an agent-based\nstochastic simulation to explore such a mechanism. Our results suggest that\nupon loading, branching actin networks are capable of remodeling by increasing\nthe number filaments growing against the load. Our model provides a mechanism\nthat can account for both convex and concave force-velocity relationships\nobserved in branching actin networks. Finally, our model gives a potential\nexplanation to the experimentally observed force history dependence for actin\nnetwork velocity.\n", "versions": [{"version": "v1", "created": "Mon, 28 Nov 2011 21:15:29 GMT"}], "update_date": "2011-11-30", "authors_parsed": [["Smith", "Daniel B.", ""], ["Liu", "Jian", ""]]}, {"id": "1111.6906", "submitter": "Fernando Falo", "authors": "Sebastian Bouzat (CNEA, Bariloche, Argentina) and Fernando Falo\n  (BIFI-Universidad de Zaragoza, Spain)", "title": "Tug-of-war of molecular motors: the effects of uneven load sharing", "comments": "21 pages, 8 figures", "journal-ref": "Phys. Biol. 8 066010 (2011)", "doi": "10.1088/1478-3975/8/6/066010", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze theoretically the problem of cargo transport along microtubules by\nmotors of two species with opposite polarities. We consider two different\none-dimensional models previously developed in the literature. On the one hand,\na quite widespread model which assumes equal force sharing, here referred to as\nmean field model (MFM). On the other hand, a stochastic model (SM) which\nconsiders individual motor-cargo links. We find that in generic situations the\nMFM predicts larger cargo mean velocity, smaller mean run time and less\nfrequent reversions than the SM. These phenomena are found to be consequences\nof the load sharing assumptions and can be interpreted in terms the\nprobabilities of the different motility states. We also explore the influence\nof the viscosity in both models and the role of the stiffness of the\nmotor-cargo links within the SM. Our results show that the mean cargo velocity\nis independent of the stiffness while the mean run time decreases with such a\nparameter. We explore the case of symmetric forward and backward motors\nconsidering kinesin- 1 parameters, and the problem of transport by kinesin-1\nand cytoplasmic dyneins considering two different sets of parameters previously\nproposed for dyneins.\n", "versions": [{"version": "v1", "created": "Tue, 29 Nov 2011 17:15:55 GMT"}], "update_date": "2011-11-30", "authors_parsed": [["Bouzat", "Sebastian", "", "CNEA, Bariloche, Argentina"], ["Falo", "Fernando", "", "BIFI-Universidad de Zaragoza, Spain"]]}]