[{"id": "1302.1641", "submitter": "N. Ramakrishnan", "authors": "N. Ramakrishnan, P. B. Sunil Kumar, John H. Ipsen", "title": "Membrane mediated aggregation of curvature inducing nematogens and\n  membrane tubulation", "comments": "15pages, 8 figures", "journal-ref": "Biophysical Journal 104, 1-11 (2013)", "doi": "10.1016/j.bpj.2012.12.045", "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The shapes of cell membranes are largely regulated by membrane associated,\ncurvature active, proteins. We use a numerical model of the membrane with\nelongated membrane inclusions, recently developed by us, which posses\nspontaneous directional curvatures that could be different along and\nperpendicular to its long axis. We show that, due to membrane mediated\ninteractions these curvature inducing membrane nematogens can oligomerize\nspontaneously, even at low concentrations, and change the local shape of the\nmembrane. We demonstrate that for a large group of such inclusions, where the\ntwo spontaneous curvatures have equal sign, the tubular conformation and\nsometime the sheet conformation of the membrane are the common equilibrium\nshapes. We elucidate the factors necessary for the formation of these {\\it\nprotein lattices}. Furthermore, the elastic properties of the tubes, like their\ncompressional stiffness and persistence length are calculated. Finally, we\ndiscuss the possible role of nematic disclination in capping and branching of\nthe tubular membranes.\n", "versions": [{"version": "v1", "created": "Thu, 7 Feb 2013 04:40:52 GMT"}], "update_date": "2013-02-08", "authors_parsed": [["Ramakrishnan", "N.", ""], ["Kumar", "P. B. Sunil", ""], ["Ipsen", "John H.", ""]]}, {"id": "1302.2653", "submitter": "Javier Sparacino", "authors": "J. Sparacino, M.G. Far\\'ias, P.W. Lamberti", "title": "Effect of microtubule-associated protein tau in dynamics of\n  single-headed motor proteins KIF1A", "comments": "5 pages, 5 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.89.022714", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intracellular transport based on molecular motors and its regulation are\ncrucial to the functioning of cells. Filamentary tracks of the cells are\nabundantly decorated with non-motile microtubule-associated proteins, such as\ntau. Motivated by experiments on kinesin-tau interactions [Dixit et al. Science\n319, 1086 (2008)] we developed a stochastic model of interacting single-headed\nmotor proteins KIF1A that also takes into account the interactions between\nmotor proteins and tau molecules. Our model reproduce experimental observations\nand predicts significant effects of tau on bound time and run length which\nsuggest an important role of tau in regulation of kinesin-based transport.\n", "versions": [{"version": "v1", "created": "Mon, 11 Feb 2013 21:45:16 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Sparacino", "J.", ""], ["Farías", "M. G.", ""], ["Lamberti", "P. W.", ""]]}, {"id": "1302.2798", "submitter": "Jose Alvarado", "authors": "Jose Alvarado, Michael Sheinman, Abhinav Sharma, Fred C. MacKintosh,\n  Gijsje H. Koenderink", "title": "Molecular motors robustly drive active gels to a critically connected\n  state", "comments": "Main text: 21 pages, 5 figures. Supplementary Information: 13 pages,\n  8 figures", "journal-ref": null, "doi": "10.1038/nphys2715", "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Living systems often exhibit internal driving: active, molecular processes\ndrive nonequilibrium phenomena such as metabolism or migration. Active gels\nconstitute a fascinating class of internally driven matter, where molecular\nmotors exert localized stresses inside polymer networks. There is evidence that\nnetwork crosslinking is required to allow motors to induce macroscopic\ncontraction. Yet a quantitative understanding of how network connectivity\nenables contraction is lacking. Here we show experimentally that myosin motors\ncontract crosslinked actin polymer networks to clusters with a scale-free size\ndistribution. This critical behavior occurs over an unexpectedly broad range of\ncrosslink concentrations. To understand this robustness, we develop a\nquantitative model of contractile networks that takes into account network\nrestructuring: motors reduce connectivity by forcing crosslinks to unbind.\nParadoxically, to coordinate global contractions, motor activity should be low.\nOtherwise, motors drive initially well-connected networks to a critical state\nwhere ruptures form across the entire network.\n", "versions": [{"version": "v1", "created": "Tue, 12 Feb 2013 14:14:49 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Alvarado", "Jose", ""], ["Sheinman", "Michael", ""], ["Sharma", "Abhinav", ""], ["MacKintosh", "Fred C.", ""], ["Koenderink", "Gijsje H.", ""]]}, {"id": "1302.3196", "submitter": "M. D. Betterton", "authors": "Hui-Shun Kuan, M. D. Betterton", "title": "Biophysics of filament length regulation by molecular motors", "comments": "Accepted for publication in Physical Biology", "journal-ref": "Phys. Biol. 10 (2013) 03600", "doi": "10.1088/1478-3975/10/3/036004", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regulating physical size is an essential problem that biological organisms\nmust solve from the subcellular to the organismal scales, but it is not well\nunderstood what physical principles and mechanisms organisms use to sense and\nregulate their size. Any biophysical size-regulation scheme operates in a noisy\nenvironment and must be robust to other cellular dynamics and fluctuations.\nThis work develops theory of filament length regulation inspired by recent\nexperiments on kinesin-8 motor proteins, which move with directional bias on\nmicrotubule filaments and alter microtubule dynamics. Purified kinesin-8 motors\ncan depolymerize chemically-stabilized microtubules. In the length-dependent\ndepolymerization model, the rate of depolymerization tends to increase with\nfilament length, because long filaments accumulate more motors at their tips\nand therefore shorten more quickly. When balanced with a constant filament\ngrowth rate, this mechanism can lead to a fixed polymer length. However, the\nmechanism by which kinesin-8 motors affect the length of dynamic microtubules\nin cells is less clear. We study the more biologically realistic problem of\nmicrotubule dynamic instability modulated by a motor-dependent increase in the\nfilament catastrophe frequency. This leads to a significant decrease in the\nmean filament length and a narrowing of the filament length distribution. The\nresults improve our understanding of the biophysics of length regulation in\ncells.\n", "versions": [{"version": "v1", "created": "Wed, 13 Feb 2013 19:28:03 GMT"}], "update_date": "2014-07-21", "authors_parsed": [["Kuan", "Hui-Shun", ""], ["Betterton", "M. D.", ""]]}, {"id": "1302.4002", "submitter": "Pierre Recho", "authors": "Pierre Recho and Lev Truskinovsky", "title": "An asymmetry between pushing and pulling for crawling cells", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevE.87.022720", "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Eukaryotic cells possess motility mechanisms allowing them not only to\nself-propel but also to exert forces on obstacles (to push) and to carry\ncargoes (to pull). To study the inherent asymmetry between active pushing and\npulling we model a crawling acto-myosin cell extract as a 1D layer of active\ngel subjected to external forces. We show that pushing is controlled by\nprotrusion and that the macroscopic signature of the protrusion dominated\nmotility mechanism is concavity of the force velocity relation. Instead,\npulling is driven by protrusion only at small values of the pulling force and\nit is replaced by contraction when the pulling force is sufficiently large.\nThis leads to more complex convex-concave structure of the force velocity\nrelation, in particular, competition between protrusion and contraction can\nproduce negative mobility in a biologically relevant range. The model\nillustrates active readjustment of the force generating machinery in response\nto changes in the dipole structure of external forces. The possibility of\nswitching between complementary active mechanisms implies that if necessary\n'pushers' can replace 'pullers' and visa versa.\n", "versions": [{"version": "v1", "created": "Sat, 16 Feb 2013 21:24:45 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Recho", "Pierre", ""], ["Truskinovsky", "Lev", ""]]}, {"id": "1302.5025", "submitter": "Sriram Ramaswamy", "authors": "Jean-Francois Joanny, Karsten Kruse, Jacques Prost, and Sriram\n  Ramaswamy", "title": "The actin cortex as an active wetting layer", "comments": "submitted to Eur Phys Jour E", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using active gel theory we study theoretically the properties of the cortical\nactin layer of animal cells. The cortical layer is described as a\nnon-equilibrium wetting film on the cell membrane. The actin density is\napproximately constant in the layer and jumps to zero at its edge. The layer\nthickness is determined by the ratio of the polymerization velocity and the\ndepolymerization rate of actin.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2013 16:37:04 GMT"}], "update_date": "2013-02-21", "authors_parsed": [["Joanny", "Jean-Francois", ""], ["Kruse", "Karsten", ""], ["Prost", "Jacques", ""], ["Ramaswamy", "Sriram", ""]]}, {"id": "1302.5128", "submitter": "Alexandre  Ferreira Ramos", "authors": "Guilherme C.P. Innocentini, Alexandre F. Ramos, Jos\\'e Eduardo M.\n  Hornos", "title": "Comment on \"Steady-state fluctuations of a genetic feedback loop: an\n  exact solution\" [J. Chem. Phys. {\\bf 137}, 035104 (2012).]", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The comment is intended to answer the criticism presented on `Steady-state\nfluctuations of a genetic feedback loop: an exact solution' [J. Chem. Phys.\n{\\bf 137}, 035104 (2012).] and provides the missing component for the complete\nanalytic solutions to the author's model.\n", "versions": [{"version": "v1", "created": "Wed, 20 Feb 2013 21:29:06 GMT"}], "update_date": "2013-02-22", "authors_parsed": [["Innocentini", "Guilherme C. P.", ""], ["Ramos", "Alexandre F.", ""], ["Hornos", "José Eduardo M.", ""]]}]