[{"id": "1308.1271", "submitter": "Laura Facchini", "authors": "Laura Facchini, Alberto Bellin and Eleuterio F. Toro", "title": "A new model of filtration and macromolecules transport across capillary\n  walls", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC math.NA q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metabolic substrates, such as oxygen and glucose, are rapidly delivered to\nthe cell through filtration across microvessels walls. Modelling this important\nprocess is complicated by the coupling between flow and transport equations,\nwhich are linked through the osmotic pressure induced by the colloidal plasma\nproteins. Microvessel wall is a composite media with the internal glycocalyx\nlayer exerting a remarkable sieving effect on macromolecules, with respect to\nthe external layer composed by endothelial cells. The physiological structure\nof microvessel is represented as the superimposition of two membranes with\ndifferent properties; the inner membrane represents the glycocalyx, while the\nouter membrane represents the surrounding endothelial cells. Application of\nmass conservation principle and thermodynamic considerations lead to a model\ncomposed by two coupled second-order partial differential equations in the\nhydrostatic and osmotic pressures, one expressing volumetric mass conservation\nand the other, which is non-linear, expressing macromolecules mass\nconservation. Despite system complexity, the assumption that the properties of\nthe layers are piece-wise constant allows us to obtain analytical solutions for\nthe two pressures. This solution is in agreement with experimental\nobservations, which contrary to common belief, show that flow reversal cannot\noccur in steady state unless luminal hydrostatic pressure drops below\nphysiologically plausible values. The observed variations of volumetric and\nsolute mass flux in case of a significant reduction of luminal hydrostatic\npressure are in qualitative agreement with observed variations during\nexperiments reported in the literature. On the other hand, homogenising\nmicrovessel wall into a single-layer membrane with equivalent properties leads\nto a different distribution of pressure across microvessel wall, not consistent\nwith observations.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 13:52:07 GMT"}, {"version": "v2", "created": "Fri, 9 Aug 2013 08:44:18 GMT"}], "update_date": "2013-08-12", "authors_parsed": [["Facchini", "Laura", ""], ["Bellin", "Alberto", ""], ["Toro", "Eleuterio F.", ""]]}, {"id": "1308.1328", "submitter": "Laura Facchini", "authors": "Laura Facchini, Alberto Bellin and Eleuterio F. Toro", "title": "A simple model of filtration and macromolecule transport through\n  microvascular walls", "comments": null, "journal-ref": "Numerical Methods for Hyperbolic Equations: Theory and\n  Applications. An international conference to honour Professor E. F. Toro.,\n  London, UK: CRC Press, Taylor-Francis Group, 2012, p. 339-346. ISBN:\n  9780415621502", "doi": null, "report-no": null, "categories": "q-bio.SC math.NA q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiple Sclerosis (MS) is a disorder that usually appears in adults in their\nthirties. It has a prevalence that ranges between 2 and 150 per 100 000.\nEpidemiological studies of MS have provided hints on possible causes for the\ndisease ranging from genetic, environmental and infectious factors to other\nfactors of vascular origin. Despite the tremendous effort spent in the last few\nyears, none of the hypotheses formulated so far has gained wide acceptance and\nthe causes of the disease remain unknown. From a clinical point of view, a high\ncorrelation has been recently observed between MS and Chronic Cerebro-Spinal\nVenous Insufficiency (CCSVI) in a statistically significant number of patients.\nIn this pathological situation CCSVI may induce alterations of blood pressure\nin brain microvessels, thereby perturbing the exchange of small hydrophilic\nmolecules between the blood and the external cells. In the presence of large\npressure alterations it cannot be excluded also the leakage of macromolecules\nthat otherwise would not cross the vessel wall. All these disorders may trigger\nimmune defenses with the destruction of myelin as a side effect. In the present\nwork we investigate the role of perturbed blood pressure in brain microvessels\nas driving force for an altered exchange of small hydrophilic solutes and\nleakage of macromolecules into the interstitial fluid. With a simplified, yet\nrealistic, model we obtain closed-form steady-state solutions for fluid flow\nand solute transport across the microvessel wall. Finally, we use these results\n(i) to interpret experimental data available in the literature and (ii) to\ncarry out a preliminary analysis of the disorder in the exchange processes\ntriggered by an increase of blood pressure, thereby relating our preliminary\nresults to the hypothesised vascular connection to MS.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 16:21:02 GMT"}, {"version": "v2", "created": "Thu, 22 Aug 2013 08:49:47 GMT"}], "update_date": "2013-08-23", "authors_parsed": [["Facchini", "Laura", ""], ["Bellin", "Alberto", ""], ["Toro", "Eleuterio F.", ""]]}, {"id": "1308.1875", "submitter": "Luca Caniparoli", "authors": "Luca Caniparoli and Pierangelo Lombardo", "title": "Non-equilibrium, stochastic model for tRNA binding time statistics", "comments": "12 pages, 5 figure", "journal-ref": "Phys. Rev. E 89, 012712 (2014)", "doi": "10.1103/PhysRevE.89.012712", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protein translation is one of the most important processes in cell life but,\ndespite being well understood biochemically, the implications of its intrinsic\nstochastic nature have not been fully elucidated. In this paper we develop a\nmicroscopic and stochastic model which describes a crucial step in protein\ntranslation, namely the binding of the tRNA to the ribosome. Our model\nexplicitly takes into consideration tRNA recharging dynamics, spatial\ninhomogeneity and stochastic fluctuations in the number of charged tRNAs around\nthe ribosome. By analyzing this non-equilibrium system we are able to derive\nthe statistical distribution of the times needed by the tRNAs to bind to the\nribosome, and to show that it deviates from an exponential due to the coupling\nbetween the fluctuations of charged and uncharged populations of tRNA.\n", "versions": [{"version": "v1", "created": "Thu, 8 Aug 2013 15:31:17 GMT"}, {"version": "v2", "created": "Fri, 3 Jan 2014 17:31:39 GMT"}], "update_date": "2014-01-29", "authors_parsed": [["Caniparoli", "Luca", ""], ["Lombardo", "Pierangelo", ""]]}, {"id": "1308.1985", "submitter": "Hunter Fraser", "authors": "Hunter B. Fraser", "title": "Cell-cycle regulated transcription associates with DNA replication\n  timing in yeast and human", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Eukaryotic DNA replication follows a specific temporal program, with some\ngenomic regions consistently replicating earlier than others, yet what\ndetermines this program is largely unknown. Highly transcribed regions have\nbeen observed to replicate in early S-phase in all plant and animal species\nstudied to date, but this relationship is thought to be absent from both\nbudding yeast and fission yeast. No association between cell-cycle regulated\ntranscription and replication timing has been reported for any species. Here I\nshow that in budding yeast, fission yeast, and human, the genes most highly\ntranscribed during S-phase replicate early, whereas those repressed in S-phase\nreplicate late. Transcription during other cell-cycle phases shows either the\nopposite correlation with replication timing, or no relation. The relationship\nis strongest near late-firing origins of replication, which is not consistent\nwith a previously proposed model -- that replication timing may affect\ntranscription -- and instead suggests a potential mechanism involving the\nrecruitment of limiting replication initiation factors during S-phase. These\nresults suggest that S-phase transcription may be an important determinant of\nDNA replication timing across eukaryotes, which may explain the\nwell-established association between transcription and replication timing.\n", "versions": [{"version": "v1", "created": "Thu, 8 Aug 2013 21:43:33 GMT"}], "update_date": "2013-08-12", "authors_parsed": [["Fraser", "Hunter B.", ""]]}, {"id": "1308.2751", "submitter": "Manoj Gopalakrishnan", "authors": "Deepak Bhat and Manoj Gopalakrishnan (IIT Madras)", "title": "Memory, Bias and Correlations in Bidirectional Transport of Molecular\n  Motor-driven Cargoes", "comments": "11 pages, minor additions in text and expanded reference list,\n  accepted version in Phys. Rev. E", "journal-ref": "Phys. Rev. E 88,042702 (2013)", "doi": "10.1103/PhysRevE.88.042702", "report-no": null, "categories": "q-bio.SC cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Molecular motors are specialized proteins which perform active, directed\ntransport of cellular cargoes on cytoskeletal filaments. In many cases, cargo\nmotion powered by motor proteins is found to be bidirectional, and may be\nviewed as a biased random walk with fast unidirectional runs interspersed with\nslow `tug-of-war' states. The statistical properties of this walk are not known\nin detail, and here, we study memory and bias, as well as directional\ncorrelations between successive runs in bidirectional transport. We show, based\non a study of the direction reversal probabilities of the cargo using a purely\nstochastic (tug-of-war) model, that bidirectional motion of cellular cargoes\nis, in general, a correlated random walk. In particular, while the motion of a\ncargo driven by two oppositely pulling motors is a Markovian random walk,\nmemory of direction appears when multiple motors haul the cargo in one or both\ndirections. In the latter case, the Markovian nature of the underlying single\nmotor processes is hidden by internal transitions between degenerate run and\npause states of the cargo. Interestingly, memory is found to be a non-monotonic\nfunction of the number of motors. Stochastic numerical simulations of the\ntug-of-war model support our mathematical results and extend them to\nbiologically relevant situations.\n", "versions": [{"version": "v1", "created": "Tue, 13 Aug 2013 04:29:25 GMT"}, {"version": "v2", "created": "Wed, 14 Aug 2013 11:38:40 GMT"}, {"version": "v3", "created": "Thu, 19 Sep 2013 04:21:28 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Bhat", "Deepak", "", "IIT Madras"], ["Gopalakrishnan", "Manoj", "", "IIT Madras"]]}, {"id": "1308.4374", "submitter": "Sarthok Sircar", "authors": "Sarthok Sircar, Aaron Fogelson and James Keener", "title": "Ion mediated cross-shield driven mucous swelling kinetics", "comments": "This paper has been withdrawn because the underlying mathematical\n  model (used in this work) has been completely redone and revised from the\n  sratch. The version used in this work is incorrect. Further, the correct\n  names of the authors who have contributed to this work (in terms of\n  completing the various sections of this work) have been listed", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC cond-mat.soft physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an experimentally guided, bi-phasic, multi-species ionic gel model\nto compare and make quantitative predictions on the viscoelastic properties of\nhealthy mucus versus Cystic-Fibrosis infected mucus. The mixture theory\nconsists of the mucus (polymer phase) and water (solvent phase) as well as\nseveral different ions: H$^+$, Na$^+$, Cl$^-$ and Ca$^{2+}$. The model is\ncalibrated with the experimental data of mucus diffusivities. Numerical studies\nreveal that the Donnan forces are the dominating mechanism driving the mucus\nswelling/deswelling transition. However, these transitions could be continuous\nor discontinuous, depending on the complex interplay between ionic bath\nconcentrations, pH, polymer mass in the solvent and the average charge per\nmonomer.\n", "versions": [{"version": "v1", "created": "Tue, 20 Aug 2013 18:49:02 GMT"}, {"version": "v2", "created": "Wed, 21 Jan 2015 22:48:47 GMT"}], "update_date": "2015-01-23", "authors_parsed": [["Sircar", "Sarthok", ""], ["Fogelson", "Aaron", ""], ["Keener", "James", ""]]}, {"id": "1308.5548", "submitter": "Pierre Sens", "authors": "Serge Dmitrieff, and Pierre Sens", "title": "Transient domain formation in membrane-bound organelles undergoing\n  maturation", "comments": "7 pages, 6 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.88.062704", "report-no": null, "categories": "q-bio.SC cond-mat.soft physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The membrane components of cellular organelles have been shown to segregate\ninto domains as the result of biochemical maturation. We propose that the\ndynamical competition between maturation and lateral segregation of membrane\ncomponents regulates domain formation. We study a two- component fluid membrane\nin which enzymatic reaction irreversibly converts one component into another,\nand phase separation triggers the formation of transient membrane domains. The\nmaximum domains size is shown to depend on the maturation rate as a power-law\nsimilar to the one observed for domain growth with time in the absence of\nmaturation, despite this time dependence not being verified in the case of\nirreversible maturation. This control of domain size by enzymatic activity\ncould play a critical role in intra-organelle dynamics.\n", "versions": [{"version": "v1", "created": "Mon, 26 Aug 2013 11:53:39 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Dmitrieff", "Serge", ""], ["Sens", "Pierre", ""]]}, {"id": "1308.5778", "submitter": "Manoj Gopalakrishnan", "authors": "Jemseena V. and Manoj Gopalakrishnan (Department of Physics, IIT\n  Madras)", "title": "Microtubule catastrophe from protofilament dynamics", "comments": "17 pages, minor changes in text and fig3, accepted version in Phys.\n  Rev. E", "journal-ref": "Phys. Rev. E 88, 032717 (2013)", "doi": "10.1103/PhysRevE.88.032717", "report-no": null, "categories": "q-bio.SC cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The disappearance of the guanosine triphosphate (GTP)-tubulin cap is widely\nbelieved to be the forerunner event for the growth-shrinkage transition\n(`catastrophe') in microtubule filaments in eukaryotic cells. We study a\ndiscrete version of a stochastic model of the GTP cap dynamics, originally\nproposed by Flyvbjerg, Holy and Leibler (Flyvbjerg, Holy and Leibler, Phys.\nRev. Lett. 73, 2372, 1994). Our model includes both spontaneous and vectorial\nhydrolysis, as well as dissociation of a non-hydrolyzed dimer from the filament\nafter incorporation. In the first part of the paper, we apply this model to a\nsingle protofilament of a microtubule. A catastrophe transition is defined for\neach protofilament, similar to the earlier one-dimensional models, the\nfrequency of occurrence of which is then calculated under various conditions,\nbut without explicit assumption of steady state conditions. Using a\nperturbative approach, we show that the leading asymptotic behavior of the\nprotofilament catastrophe in the limit of large growth velocities is remarkably\nsimilar across different models. In the second part of the paper, we extend our\nanalysis to the entire filament by making a conjecture that a minimum number of\nsuch transitions are required to occur for the onset of microtubule\ncatastrophe. The frequency of microtubule catastrophe is then determined using\nnumerical simulations, and compared with analytical/semi-analytical estimates\nmade under steady state/quasi-steady state assumptions respectively for the\nprotofilament dynamics. A few relevant experimental results are analyzed in\ndetail, and compared with predictions from the model. Our results indicate that\nloss of GTP cap in 2-3 protofilaments is necessary to trigger catastrophe in a\nmicrotubule.\n", "versions": [{"version": "v1", "created": "Tue, 27 Aug 2013 07:34:59 GMT"}, {"version": "v2", "created": "Thu, 19 Sep 2013 04:26:28 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["V.", "Jemseena", "", "Department of Physics, IIT\n  Madras"], ["Gopalakrishnan", "Manoj", "", "Department of Physics, IIT\n  Madras"]]}, {"id": "1308.6033", "submitter": "Caterina La Porta AM", "authors": "Elena Monzani, Riccardo Bazzotti, Carla Perego, Caterina A. M. La\n  Porta", "title": "AQP1 Is Not Only a Water Channel: It Contributes to Cell Migration\n  through Lin7/Beta-Catenin", "comments": null, "journal-ref": "PLoS ONE 4(7): e6167, 2009", "doi": "10.1371/journal.pone.0006167", "report-no": null, "categories": "q-bio.CB q-bio.QM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: AQP1 belongs to aquaporins family, water-specific,\nmembrane-channel proteins expressed in diverse tissues. Recent papers showed\nthat during angiogenesis, AQP1 is expressed preferentially by microvessels,\nfavoring angiogenesis via the increase of permeability In particular, in AQP1\nnull mice, endothelial cell migration is impaired without altering their\nproliferation or adhesion. Therefore, AQP1 has been proposed as a novel\npromoter of tumor angiogenesis. Methods/Findings: Using targeted silencing of\nAQP1 gene expression, an impairment in the organization of F-actin and a\nreduced migration capacity was demonstrated in human endothelial and melanoma\ncell lines. Interestingly, we showed, for the first time, that AQP1\nco-immunoprecipitated with Lin-7. Lin7-GFP experiments confirmed\nco-immunoprecipitation. In addition, the knock down of AQP1 decreased the level\nof expression of Lin-7 and b-catenin and the inhibition of proteasome\ncontrasted partially such a decrease. Conclusions/Significance: All together,\nour findings show that AQP1 plays a role inside the cells through\nLin-7/b-catenin interaction. Such a role of AQP1 is the same in human melanoma\nand endothelial cells, suggesting that AQP1 plays a global physiological role.\nA model is presented.\n", "versions": [{"version": "v1", "created": "Wed, 28 Aug 2013 02:33:24 GMT"}], "update_date": "2013-08-29", "authors_parsed": [["Monzani", "Elena", ""], ["Bazzotti", "Riccardo", ""], ["Perego", "Carla", ""], ["La Porta", "Caterina A. M.", ""]]}, {"id": "1308.6035", "submitter": "Caterina La Porta AM", "authors": "Rouzbeh Taghizadeh, Minsoo Noh, Yang Hoon Huh, Emilio Ciusani, Luca\n  Sigalotti, Michele Maio, Beatrice Arosio, Maria R. Nicotra, PierGiorgio\n  Natali, James L. Sherley, Caterina A. M. La Porta", "title": "CXCR6, a Newly Defined Biomarker of Tissue-Specific Stem Cell Asymmetric\n  Self-Renewal, Identifies More Aggressive Human Melanoma Cancer Stem Cells", "comments": null, "journal-ref": "PLoS ONE 5(12): e15183, 2010", "doi": "10.1371/journal.pone.0015183", "report-no": null, "categories": "q-bio.SC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: A fundamental problem in cancer research is identifying the cell\ntype that is capable of sustaining neoplastic growth and its origin from normal\ntissue cells. Recent investigations of a variety of tumor types have shown that\nphenotypically identifiable and isolable subfractions of cells possess the\ntumor-forming ability. In the present paper, using two lineage-related human\nmelanoma cell lines, primary melanoma line IGR39 and its metastatic derivative\nline IGR37, two main observations are reported. The first one is the first\nphenotypic evidence to support the origin of melanoma cancer stem cells (CSCs)\nfrom mutated tissue-specific stem cells; and the second one is the\nidentification of a more aggressive subpopulation of CSCs in melanoma that are\nCXCR6+. Conclusions/Significance: The association of a more aggressive tumor\nphenotype with asymmetric self-renewal phenotype reveals a previously\nunrecognized aspect of tumor cell physiology. Namely, the retention of some\ntissue-specific stem cell attributes, like the ability to asymmetrically\nself-renew, impacts the natural history of human tumor development. Knowledge\nof this new aspect of tumor development and progression may provide new targets\nfor cancer prevention and treatment.\n", "versions": [{"version": "v1", "created": "Wed, 28 Aug 2013 02:39:29 GMT"}], "update_date": "2013-08-29", "authors_parsed": [["Taghizadeh", "Rouzbeh", ""], ["Noh", "Minsoo", ""], ["Huh", "Yang Hoon", ""], ["Ciusani", "Emilio", ""], ["Sigalotti", "Luca", ""], ["Maio", "Michele", ""], ["Arosio", "Beatrice", ""], ["Nicotra", "Maria R.", ""], ["Natali", "PierGiorgio", ""], ["Sherley", "James L.", ""], ["La Porta", "Caterina A. M.", ""]]}]