[{"id": "1309.0599", "submitter": "Suman Kumar Banik", "authors": "Arnab Bandyopadhyay, Soumi Biswas, Alok Kumar Maity and Suman K Banik", "title": "Analysis of DevR regulated genes in Mycobacterium tuberculosis", "comments": "Title changed in this submission. 33 pages, 16 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The DevRS two component system of Mycobacterium tuberculosis is responsible\nfor its dormancy in host and becomes operative under hypoxic condition. It is\nexperimentally known that phosphorylated DevR controls the expression of\nseveral downstream genes in a complex manner. In the present work we propose a\ntheoretical model to show role of binding sites in DevR mediated gene\nexpression. Individual and collective role of binding sites in regulating DevR\nmediated gene expression has been shown via modeling. Objective of the present\nwork is two fold. First, to describe qualitatively the temporal dynamics of\nwild type genes and their known mutants. Based on these results we propose that\nDevR controlled gene expression follows a specific pattern which is efficient\nin describing other DevR mediated gene expression. Second, to analyze behavior\nof the system from information theoretical point of view. Using the tools of\ninformation theory we have calculated molecular efficiency of the system and\nhave shown that it is close to the maximum limit of isothermal efficiency.\n", "versions": [{"version": "v1", "created": "Tue, 3 Sep 2013 07:30:36 GMT"}, {"version": "v2", "created": "Wed, 29 Jan 2014 11:41:16 GMT"}], "update_date": "2014-01-30", "authors_parsed": [["Bandyopadhyay", "Arnab", ""], ["Biswas", "Soumi", ""], ["Maity", "Alok Kumar", ""], ["Banik", "Suman K", ""]]}, {"id": "1309.0936", "submitter": "Namiko Mitarai", "authors": "Namiko Mitarai and Steen Pedersen", "title": "Control of ribosome traffic by position-dependent choice of synonymous\n  codons", "comments": "12 pages, 6 Figures. This is an author-created, un-copyedited version\n  of an article accepted for publication in Physical Biology. IOP Publishing\n  Ltd is not responsible for any errors or omissions in this version of the\n  manuscript or any version derived from it", "journal-ref": "Phys. Biol. 10 (2013) 056011", "doi": "10.1088/1478-3975/10/5/056011", "report-no": null, "categories": "q-bio.SC q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Messenger RNA encodes a sequence of amino acids by using codons. For most\namino acids there are multiple synonymous codons that can encode the amino\nacid. The translation speed can vary from one codon to another, thus there is\nroom for changing the ribosome speed while keeping the amino acid sequence and\nhence the resulting protein. Recently, it has been noticed that the choice of\nthe synonymous codon, via the resulting distribution of slow- and\nfast-translated codons, affects not only on the average speed of one ribosome\ntranslating the messenger RNA (mRNA) but also might have an effect on nearby\nribosomes by affecting the appearance of \"traffic jams\" where multiple\nribosomes collide and form queues. To test this \"context effect\" further, we\nhere investigate the effect of the sequence of synonymous codons on the\nribosome traffic by using a ribosome traffic model with codon-dependent rates,\nestimated from experiments. We compare the ribosome traffic on wild type\nsequences and sequences where the synonymous codons were swapped randomly. By\nsimulating translation of 87 genes, we demonstrate that the wild type\nsequences, especially those with a high bias in codon usage, tend to have the\nability to reduce ribosome collisions, hence optimizing the cellular investment\nin the translation apparatus. The magnitude of such reduction of the\ntranslation time might have a significant impact on the cellular growth rate\nand thereby have importance for the survival of the species.\n", "versions": [{"version": "v1", "created": "Wed, 4 Sep 2013 08:05:06 GMT"}], "update_date": "2013-10-10", "authors_parsed": [["Mitarai", "Namiko", ""], ["Pedersen", "Steen", ""]]}, {"id": "1309.1010", "submitter": "Chris Brackley", "authors": "C. A. Brackley, M. E. Cates, D. Marenduzzo", "title": "Intracellular facilitated diffusion: searchers, crowders and blockers", "comments": null, "journal-ref": "Phys. Rev. Lett. 111, 108101 (2013)", "doi": "10.1103/PhysRevLett.111.108101", "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In bacteria, regulatory proteins search for a specific DNA binding target via\n\"facilitated diffusion\": a series of rounds of 3D diffusion in the cytoplasm,\nand 1D linear diffusion along the DNA contour. Using large scale Brownian\ndynamics simulations we find that each of these steps is affected differently\nby crowding proteins, which can either be bound to the DNA acting as a road\nblock to the 1D diffusion, or freely diffusing in the cytoplasm. Macromolecular\ncrowding can strongly affect mechanistic features such as the balance between\n3D and 1D diffusion, but leads to surprising robustness of the total search\ntime.\n", "versions": [{"version": "v1", "created": "Wed, 4 Sep 2013 12:52:03 GMT"}], "update_date": "2013-09-05", "authors_parsed": [["Brackley", "C. A.", ""], ["Cates", "M. E.", ""], ["Marenduzzo", "D.", ""]]}, {"id": "1309.1569", "submitter": "Iaroslav Ispolatov", "authors": "Iaroslav Ispolatov and Anne Muesch", "title": "A model for the self-organization of vesicular flux and protein\n  distributions in the Golgi apparatus", "comments": "15 pages, 6 figures", "journal-ref": "PLoS Comput Biol 9(7): e1003125. (2013)", "doi": "10.1371/journal.pcbi.1003125", "report-no": null, "categories": "q-bio.SC nlin.AO physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The generation of two non-identical membrane compartments via exchange of\nvesicles is considered to require two types of vesicles specified by distinct\ncytosolic coats that selectively recruit cargo and two membrane-bound SNARE\npairs that specify fusion and differ in their affinities for each type of\nvesicles. The mammalian Golgi complex is composed of 6-8 non-identical\ncisternae that undergo gradual maturation and replacement yet features only two\nSNARE pairs. We present a model that explains how the distinct composition of\nGolgi cisternae can be generated with two and even a single SNARE pair and one\nvesicle coat. A decay of active SNARE concentration in aging cisternae provides\nthe seed for a cis > trans SNARE gradient that generates the predominantly\nretrograde vesicle flux which further enhances the gradient. This flux in turn\nyields the observed inhomogeneous steady-state distribution of Golgi enzymes,\nwhich compete with each other and with the SNAREs for incorporation into\ntransport vesicles. We show analytically that the steady state SNARE\nconcentration decays exponentially with the cisterna number. Numerical\nsolutions of rate equations reproduce the experimentally observed SNARE\ngradients, overlapping enzyme peaks in cis, medial and trans and the reported\nchange in vesicle nature across Golgi: Vesicles originating from younger\ncisternae mostly contain Golgi enzymes and SNAREs enriched in these cisternae\nand extensively recycle through the Endoplasmic Reticulum (ER), while the other\nsubpopulation of vesicles contains Golgi proteins prevalent in older cisternae\nand hardly reaches the ER.\n", "versions": [{"version": "v1", "created": "Fri, 6 Sep 2013 08:52:11 GMT"}], "update_date": "2017-02-07", "authors_parsed": [["Ispolatov", "Iaroslav", ""], ["Muesch", "Anne", ""]]}, {"id": "1309.2588", "submitter": "Kyung Hyuk Kim", "authors": "Kyung Hyuk Kim, Hong Qian, Herbert M. Sauro", "title": "Nonlinear Biochemical Signal Processing via Noise Propagation", "comments": "23 pages, 5 figures, Accepted by Journal of Chemical Physics", "journal-ref": null, "doi": "10.1063/1.4822103", "report-no": null, "categories": "q-bio.QM q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Single-cell studies often show significant phenotypic variability due to the\nstochastic nature of intra-cellular biochemical reactions. When the numbers of\nmolecules, e.g., transcription factors and regulatory enzymes, are in low\nabundance, fluctuations in biochemical activities become significant and such\n\"noise\" can propagate through regulatory cascades in terms of biochemical\nreaction networks. Here we develop an intuitive, yet fully quantitative method\nfor analyzing how noise affects cellular phenotypes based on identifying a\nsystem's nonlinearities and noise propagations. We observe that such noise can\nsimultaneously enhance sensitivities in one behavioral region while reducing\nsensitivities in another. Employing this novel phenomenon we designed three\nbiochemical signal processing modules: (a) A gene regulatory network that acts\nas a concentration detector with both enhanced amplitude and sensitivity. (b) A\nnon-cooperative positive feedback system, with a graded dose-response in the\ndeterministic case, that serves as a bistable switch due to noise-induced\nbimodality. (c) A noise-induced linear amplifier for gene regulation that\nrequires no feedback. The methods developed in the present work allow one to\nunderstand and engineer nonlinear biochemical signal processors based on\nfluctuation-induced phenotypes.\n", "versions": [{"version": "v1", "created": "Tue, 10 Sep 2013 17:46:40 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Kim", "Kyung Hyuk", ""], ["Qian", "Hong", ""], ["Sauro", "Herbert M.", ""]]}, {"id": "1309.3436", "submitter": "David Holcman", "authors": "N. Hoze, D. Holcman", "title": "Potential wells for AMPA receptors organized in ring nanodomains", "comments": "4 figures extension of Hoze et al, PNAS 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By combining high-density super-resolution imaging with a novel stochastic\nanalysis, we report here a peculiar nano-structure organization revealed by the\ndensity function of individual AMPA receptors moving on the surface of cultured\nhippocampal dendrites. High density regions of hundreds of nanometers for the\ntrajectories are associated with local molecular assembly generated by direct\nmolecular interactions due to physical potential wells. We found here that for\nsome of these regions, the potential wells are organized in ring structures. We\ncould find up to 3 wells in a single ring. Inside a ring receptors move in a\nsmall band the width of which is of hundreds of nanometers. In addition, rings\nare transient structures and can be observed for tens of minutes. Potential\nwells located in a ring are also transient and the position of their peaks can\nshift with time. We conclude that these rings can trap receptors in a unique\ngeometrical structure contributing to shape receptor trafficking, a process\nthat sustains synaptic transmission and plasticity.\n", "versions": [{"version": "v1", "created": "Fri, 13 Sep 2013 12:27:24 GMT"}, {"version": "v2", "created": "Tue, 24 Sep 2013 17:58:42 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Hoze", "N.", ""], ["Holcman", "D.", ""]]}, {"id": "1309.5778", "submitter": "Dipjyoti Das", "authors": "Dipjyoti Das and Dibyendu Das and Ranjith Padinhateeri", "title": "Collective force generated by multiple biofilaments can exceed the sum\n  of forces due to individual ones", "comments": "New J. Phys., 2014", "journal-ref": null, "doi": "10.1088/1367-2630/16/6/063032", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Collective dynamics and force generation by cytoskeletal filaments are\ncrucial in many cellular processes. Investigating growth dynamics of a bundle\nof N independent cytoskeletal filaments pushing against a wall, we show that\nchemical switching (ATP/GTP hydrolysis) leads to a collective phenomenon that\nis currently unknown. Obtaining force-velocity relations for different models\nthat capture chemical switching, we show, analytically and numerically, that\nthe collective stall force of N filaments is greater than N times the stall\nforce of a single filament. Employing an exactly solvable toy model, we\nanalytically prove the above result for N=2. We, further, numerically show the\nexistence of this collective phenomenon, for N>=2, in realistic models (with\nrandom and sequential hydrolysis) that simulate actin and microtubule bundle\ngrowth. We make quantitative predictions for the excess forces, and argue that\nthis collective effect is related to the non-equilibrium nature of chemical\nswitching.\n", "versions": [{"version": "v1", "created": "Mon, 23 Sep 2013 11:55:05 GMT"}, {"version": "v2", "created": "Sat, 11 Jan 2014 06:42:43 GMT"}, {"version": "v3", "created": "Wed, 14 May 2014 06:59:32 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Das", "Dipjyoti", ""], ["Das", "Dibyendu", ""], ["Padinhateeri", "Ranjith", ""]]}, {"id": "1309.6444", "submitter": "Hjalmar Brismar", "authors": "Thomas Liebmann, Hans Blom, Anita Aperia, Hjalmar Brismar", "title": "Nanoscale elucidation of Na,K-ATPase isoforms in dendritic spines", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.NC q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dimensions of neuronal synapses suggest that optical super-resolution\nimaging methods are necessary for thorough investigation of protein\ndistributions and interactions. Nanoscopic evaluation of neuronal samples has\npresented practical hurdles, but advancing methods are making synaptic protein\ntopology and quantification measurements feasible. This work explores the\napplication of Photoactivated Localization Microscopy (PALM) pointilistic\nsuper-resolution imaging for investigation of the membrane bound sodium pump,\nthe Na,K-ATPase, in matured neurons.\n  Two isoforms of the sodium pump (ATP1a1 and ATP1a3) were studied in cultured\nneurons using the PALM-compatible fluorescent proteins PAGFP and mEos.\nNanoscopic imaging reveals a compartmentalized distribution of sodium pumps in\ndendritic spines. Several nanoclusters of pumps are typically found in the\nspine head and relatively few in the spine neck. The density of sodium pumps\nwas estimated from a quantification of detected single molecules to 600-800\npump copies/um2 in the spine heads.\n  We have utilized PALM for dissection of nanoscale localization in mature\ncultured neurons and demonstrated similar topology and quantification estimates\nwith PAGFP and mEos. PALM topology assessments of the sodium pump appeared\nsimilar to previous STED studies, though quantification estimates varied\nnotably, implying that sample labeling strategies and choice of nanoscopic\nimaging method are critical factors for correct quantification.\n", "versions": [{"version": "v1", "created": "Wed, 25 Sep 2013 09:35:09 GMT"}], "update_date": "2013-09-26", "authors_parsed": [["Liebmann", "Thomas", ""], ["Blom", "Hans", ""], ["Aperia", "Anita", ""], ["Brismar", "Hjalmar", ""]]}, {"id": "1309.6724", "submitter": "Igor Goychuk", "authors": "Igor Goychuk, Vasyl O. Kharchenko, R. Metzler", "title": "Coexistence and efficiency of normal and anomalous transport by\n  molecular motors in living cells", "comments": null, "journal-ref": "PLoS ONE 9, e91700 (2014)", "doi": "10.1371/journal.pone.0091700", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent experiments reveal both passive subdiffusion of various nanoparticles\nand anomalous active transport of such particles by molecular motors in the\nmolecularly crowded environment of living biological cells. Passive and active\nmicrorheology reveals that the origin of this anomalous dynamics is due to the\nviscoelasticity of the intracellular fluid. How do molecular motors perform in\nsuch a highly viscous, dissipative environment? Can we explain the observed\nco-existence of the anomalous transport of relatively large particles of 100 to\n500 nm in size by kinesin motors with the normal transport of smaller particles\nby the same molecular motors? What is the efficiency of molecular motors in the\nanomalous transport regime? Here we answer these seemingly conflicting\nquestions and consistently explain experimental findings in a generalization of\nthe well-known continuous diffusion model for molecular motors with two\nconformational states in which viscoelastic effects are included.\n", "versions": [{"version": "v1", "created": "Thu, 26 Sep 2013 05:35:36 GMT"}], "update_date": "2014-03-24", "authors_parsed": [["Goychuk", "Igor", ""], ["Kharchenko", "Vasyl O.", ""], ["Metzler", "R.", ""]]}, {"id": "1309.7602", "submitter": "Itai Pinkoviezky", "authors": "Itai Pinkoviezky and Nir S Gov", "title": "Traffic Jams and Shocks of Molecular Motors inside Cellular Protrusions", "comments": "5 pages, 5 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.89.052703", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Molecular motors are involved in key transport processes inside actin-based\ncellular protrusions. The motors carry cargo proteins to the protrusion tip\nwhich participate in regulating the actin polymerization, and play a key role\nin facilitating the growth and formation of such protrusions. It is observed\nthat the motors accumulate at the tips of cellular protrusions, and in addition\nform aggregates that are found to drift towards the protrusion base at the rate\nof actin treadmilling. We present a one-dimensional driven lattice model, where\nmotors become inactive after delivering their cargo at the tip, or by loosing\ntheir cargo to a cargo-less neighbor. The results suggest that the experimental\nobservations may be explained by the formation of traffic jams that form at the\ntip. The model is solved using a novel application of mean-field and shock\nanalysis. We find a new class of shocks that undergo intermittent collapses,\nand on average do not obey the Rankine-Hugoniot relation.\n", "versions": [{"version": "v1", "created": "Sun, 29 Sep 2013 14:33:10 GMT"}], "update_date": "2014-06-12", "authors_parsed": [["Pinkoviezky", "Itai", ""], ["Gov", "Nir S", ""]]}]