[{"id": "1401.1668", "submitter": "Thomas R. Weikl", "authors": "Michael Raatz, Reinhard Lipowsky, and Thomas R. Weikl", "title": "Cooperative wrapping of nanoparticles by membrane tubes", "comments": "9 pages, 7 figures; to appear in Soft Matter", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The bioactivity of nanoparticles crucially depends on their ability to cross\nbiomembranes. Recent simulations indicate the cooperative wrapping and\ninternalization of spherical nanoparticles in tubular membrane structures. In\nthis article, we systematically investigate the energy gain of this cooperative\nwrapping by minimizing the energies of the rotationally symmetric shapes of the\nmembrane tubes and of membrane segments wrapping single particles. We find that\nthe energy gain for the cooperative wrapping of nanoparticles in membrane tubes\nrelative to their individual wrapping as single particles strongly depends on\nthe ratio of the particle radius and the range of the particle-membrane\nadhesion potential. For a potential range of the order of one nanometer, the\ncooperative wrapping in tubes is highly favorable for particles with a radius\nof tens of nanometers and intermediate adhesion energies, but not for particles\nthat are significantly larger.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jan 2014 11:30:23 GMT"}], "update_date": "2014-01-09", "authors_parsed": [["Raatz", "Michael", ""], ["Lipowsky", "Reinhard", ""], ["Weikl", "Thomas R.", ""]]}, {"id": "1401.5893", "submitter": "Suman Kumar Banik", "authors": "Alok Kumar Maity, Arnab Bandyopadhyay, Pinaki Chaudhury, Suman K Banik", "title": "Role of functionality in two-component signal transduction: A stochastic\n  study", "comments": "Revised version, 11 pages, 7 figures", "journal-ref": "Phys Rev E 89 (2014) 032713", "doi": "10.1103/PhysRevE.89.032713", "report-no": null, "categories": "q-bio.SC physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a stochastic formalism for signal transduction processes in\nbacterial two-component system. Using elementary mass action kinetics, the\nproposed model takes care of signal transduction in terms of phosphotransfer\nmechanism between the cognate partners of a two-component system, viz, the\nsensor kinase and the response regulator. Based on the difference in\nfunctionality of the sensor kinase, the noisy phosphotransfer mechanism has\nbeen studied for monofunctional and bifunctional two component system using the\nformalism of linear noise approximation. Steady state analysis of both models\nquantifies different physically realizable quantities, e.g., variance,\ncoefficient of variation, mutual information. The resultant data reveals that\nboth systems reliably transfer information of extra-cellular environment under\nlow external stimulus and at high kinase and phosphatase regime. We extend our\nanalysis further by studying the role of two-component system in downstream\ngene regulation.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2014 08:45:43 GMT"}, {"version": "v2", "created": "Thu, 20 Mar 2014 13:14:13 GMT"}], "update_date": "2014-03-26", "authors_parsed": [["Maity", "Alok Kumar", ""], ["Bandyopadhyay", "Arnab", ""], ["Chaudhury", "Pinaki", ""], ["Banik", "Suman K", ""]]}, {"id": "1401.7055", "submitter": "Nicola Fameli", "authors": "Nicola Fameli, Oluseye A. Ogunbayo, Cornelis van Breemen, A. Mark\n  Evans", "title": "Cytoplasmic nanojunctions between lysosomes and sarcoplasmic reticulum\n  are required for specific calcium signaling", "comments": "25 pages, 7 figures, 2 tables; a slightly expanded version of this\n  manuscript was submitted for publication in PLoS One", "journal-ref": null, "doi": "10.12688/f1000research.3720.1", "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate how nanojunctions between lysosomes and sarcoplasmic reticulum\n(L-SR junctions) serve to couple lysosomal activation to regenerative,\nryanodine receptor-mediated cellular calcium (Ca2+) waves. In pulmonary artery\nsmooth muscle cells (PASMCs) nicotinic acid adenine dinucleotide phosphate\n(NAADP) may trigger increases in cytoplasmic Ca2+ via L-SR junctions, in a\nmanner that requires initial Ca2+ release from lysosomes and subsequent\nCa2+-induced Ca2+ release (CICR) via ryanodine receptor (RyR) subtype 3 on the\nSR membrane proximal to lysosomes. L-SR junction membrane separation has been\nestimated to be <400 nm and thus beyond the resolution of light microscopy.\nThis study utilizes transmission electron microscopy to provide a thorough\nultrastructural characterization of the L-SR junctions in PASMCs. These\njunctions are prominent features in these cells and we estimate that the\nmembrane separation and extension are about 15 nm and 300 nm, respectively. We\nalso develop a quantitative model of the L-SR junction using these\nmeasurements, prior kinetic and specific Ca2+ signal information as input data.\nSimulations of NAADP-dependent junctional Ca2+ transients show that the\nmagnitude of these signals can breach the threshold for CICR via RyR3. By\ncorrelation analysis of live cell Ca2+ signals and simulated L-SR junctional\nCa2+ transients, we estimate that \"trigger zones\" with a 60-100 junctions are\nrequired to confer a signal of similar magnitude. This is compatible with the\n130 lysosomes/cell estimated from our ultrastructural observations. Most\nimportantly, our model shows that increasing the L-SR junctional width above 50\nnm lowers the magnitude of junctional [Ca2+] such that there is a failure to\nbreach the threshold for CICR via RyR3. L-SR junctions are therefore a\npre-requisite for efficient Ca2+ signal coupling and may contribute to cellular\nfunction in health and disease.\n", "versions": [{"version": "v1", "created": "Tue, 28 Jan 2014 00:25:52 GMT"}], "update_date": "2014-11-03", "authors_parsed": [["Fameli", "Nicola", ""], ["Ogunbayo", "Oluseye A.", ""], ["van Breemen", "Cornelis", ""], ["Evans", "A. Mark", ""]]}, {"id": "1401.7803", "submitter": "Ben Shirt-Ediss", "authors": "Ben Shirt-Ediss, Kepa Ruiz-Mirazo, Fabio Mavelli and Ricard V. Sol\\'e", "title": "Modelling Lipid Competition Dynamics in Heterogeneous Protocell\n  Populations", "comments": "15 pages, 6 figures, 1 table", "journal-ref": null, "doi": "10.1038/srep05675", "report-no": null, "categories": "q-bio.QM q-bio.SC", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  In addressing the origins of Darwinian evolution, recent experimental work\nhas been focussed on the discovery of simple physical effects which would\nprovide a relevant selective advantage to protocells competing with each other\nfor a limited supply of lipid. In particular, data coming from Szostak's lab\nsuggest that the transition from simple prebiotically plausible lipid membranes\nto more complex and heterogeneous ones, closer to real biomembranes, may have\nbeen driven by changes in the fluidity of the membrane and its affinity for the\navailable amphiphilic compound, which in turn would involve changes in vesicle\ngrowth dynamics. Earlier work from the same group reported osmotically-driven\ncompetition effects, whereby swelled vesicles grow at the expense of isotonic\nones. In this paper, we try to expand on these experimental studies by\nproviding a simple mathematical model of a population of competing vesicles,\nstudied at the level of lipid kinetics. In silico simulations of the model are\nable to reproduce qualitatively and often quantitatively the experimentally\nreported competition effects in both scenarios. We also develop a method for\nnumerically solving the equilibrium of a population of competing model\nvesicles, which is quite general and applicable to different vesicle kinetics\nschemes.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2014 11:31:11 GMT"}], "update_date": "2014-07-15", "authors_parsed": [["Shirt-Ediss", "Ben", ""], ["Ruiz-Mirazo", "Kepa", ""], ["Mavelli", "Fabio", ""], ["Solé", "Ricard V.", ""]]}, {"id": "1401.8076", "submitter": "Tatiana T.  Marquez-Lago", "authors": "Eder Zavala and Tatiana T. Marquez-Lago", "title": "The Long and Viscous Road: Uncovering Nuclear Diffusion Barriers in\n  Closed Mitosis", "comments": "21 pages, 6 figures and supplementary material (including 8\n  additional figures and a Table)", "journal-ref": "PLoS Comput Biol 10(7): e1003725, 2014", "doi": "10.1371/journal.pcbi.1003725", "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During Saccharomyces cerevisiae closed mitosis, parental identity is\nsustained by the asymmetric segregation of ageing factors. Such asymmetry has\nbeen hypothesized to occur via diffusion barriers, constraining protein lateral\nexchange in cellular membranes. Diffusion barriers have been extensively\nstudied in the plasma membrane, but their identity and organization within the\nnucleus remain unknown. Here, we propose how sphingolipid domains, protein\nrings, and morphological changes of the nucleus may coordinate to restrict\nprotein exchange between nuclear lobes. Our spatial stochastic model is based\non several lines of experimental evidence and predicts that, while a\nsphingolipid domain and a protein ring could constitute the barrier during\nearly anaphase; a sphingolipid domain spanning the bridge between lobes during\nlate anaphase would be entirely sufficient. Additionally, we explore the\nstructural organization of plausible diffusion barriers. Our work shows how\nnuclear diffusion barriers in closed mitosis may be emergent properties of\nsimple nanoscale biophysical interactions.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2014 07:28:03 GMT"}, {"version": "v2", "created": "Mon, 28 Jul 2014 04:03:45 GMT"}], "update_date": "2014-07-29", "authors_parsed": [["Zavala", "Eder", ""], ["Marquez-Lago", "Tatiana T.", ""]]}]