[{"id": "1403.0030", "submitter": "Peter D. Olmsted", "authors": "Chinmay Das, Massimo G. Noro, and Peter D. Olmsted", "title": "Fast cholesterol flip-flop and lack of swelling in skin lipid\n  multilayers", "comments": "9 Pages, link to animations", "journal-ref": "Soft Matter 10 (2014) 7346", "doi": "10.1039/c4sm01161a.", "report-no": null, "categories": "cond-mat.soft q-bio.SC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Atomistic simulations were performed on hydrated model lipid multilayers that\nare representative of the lipid matrix in the outer skin (stratum corneum). We\nfind that cholesterol transfers easily between adjacent leaflets belonging to\nthe same bilayer via fast orientational diffusion (tumbling) in the\ninter-leaflet disordered region, while at the same time there is a large free\nenergy cost against swelling. This fast flip-flop may play an important role in\naccommodating the variety of curvatures that would be required in the three\ndimensional arrangement of the lipid multilayers in skin, and for enabling\nmechanical or hydration induced strains without large curvature elastic costs.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2014 23:49:22 GMT"}], "update_date": "2014-10-27", "authors_parsed": [["Das", "Chinmay", ""], ["Noro", "Massimo G.", ""], ["Olmsted", "Peter D.", ""]]}, {"id": "1403.2269", "submitter": "Teresa Ruiz Herrero", "authors": "Teresa Ruiz-Herrero and Michael F. Hagan", "title": "Virus Assembly on a Membrane is Facilitated by Membrane Microdomains", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC cond-mat.soft", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For many viruses assembly and budding occur simultaneously during virion\nformation. Understanding the mechanisms underlying this process could promote\nbiomedical efforts to block viral propagation and enable use of capsids in\nnanomaterials applications. To this end, we have performed molecular dynamics\nsimulations on a coarse-grained model that describes virus assembly on a\nfluctuating lipid membrane. Our simulations show that the membrane can promote\nassociation of adsorbed subunits through dimensional reduction, but also can\nintroduce barriers that inhibit complete assembly. We find several mechanisms,\nincluding one not anticipated by equilibrium theories, by which membrane\nmicrodomains, such as lipid rafts, can enhance assembly by reducing these\nbarriers. We show how this predicted mechanism can be experimentally tested.\nFurthermore, the simulations demonstrate that assembly and budding depend\ncrucially on the system dynamics via multiple timescales related to membrane\ndeformation, protein diffusion, association, and adsorption onto the membrane.\n", "versions": [{"version": "v1", "created": "Mon, 10 Mar 2014 15:38:50 GMT"}], "update_date": "2014-03-11", "authors_parsed": [["Ruiz-Herrero", "Teresa", ""], ["Hagan", "Michael F.", ""]]}, {"id": "1403.2574", "submitter": "Sven Bilke", "authors": "Yevgeniy Gindin, Manuel S. Valenzuela, Mirit I. Aladjem, Paul S.\n  Meltzer and Sven Bilke", "title": "A chromatin structure based model accurately predicts DNA replication\n  timing in human cells", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC q-bio.GN", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  The metazoan genome is replicated in precise cell lineage specific temporal\norder. However, the mechanism controlling this orchestrated process is poorly\nunderstood as no molecular mechanisms have been identified that actively\nregulate the firing sequence of genome replication. Here we develop a\nmechanistic model of genome replication capable of predicting, with accuracy\nrivaling experimental repeats, observed empirical replication timing program in\nhumans. In our model, replication is initiated in an uncoordinated\n(time-stochastic) manner at well-defined sites. The model contains, in addition\nto the choice of the genomic landmark that localizes initiation, only a single\nadjustable parameter of direct biological relevance: the number of replication\nforks. We find that DNase hypersensitive sites are optimal and independent\ndeterminants of DNA replication initiation. We demonstrate that the DNA\nreplication timing program in human cells is a robust emergent phenomenon that,\nby its very nature, does not require a regulatory mechanism determining a\nproper replication initiation firing sequence.\n", "versions": [{"version": "v1", "created": "Tue, 11 Mar 2014 13:41:52 GMT"}], "update_date": "2014-03-12", "authors_parsed": [["Gindin", "Yevgeniy", ""], ["Valenzuela", "Manuel S.", ""], ["Aladjem", "Mirit I.", ""], ["Meltzer", "Paul S.", ""], ["Bilke", "Sven", ""]]}, {"id": "1403.3776", "submitter": "Yusuke Himeoka", "authors": "Yusuke Himeoka and Kunihiko Kaneko", "title": "Entropy production of a steady-growth cell with catalytic reactions", "comments": "17 pages, 6 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.90.042714", "report-no": null, "categories": "q-bio.SC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cells generally convert external nutrient resources to support metabolismand\ngrowth. Understanding the thermodynamic efficiency of this conversion is\nessential to determine the general characteristics of cellular growth. Using a\nsimple protocell model with catalytic reaction dynamics to synthesize the\nnecessary enzyme and membrane components from nutrients, the entropy production\nper unit cell-volume growth is calculated analytically and numerically based on\nthe rate equation for chemical kinetics and linear non-equilibrium\nthermodynamics. The minimal entropy production per unit cell growth is found to\nbe achieved at a non-zero nutrient uptake rate, rather than at a quasi-static\nlimit as in the standard Carnot engine. This difference appears because the\nequilibration mediated by the enzyme exists only within cells that grow through\nenzyme and membrane synthesis. Optimal nutrient uptake is also confirmed by\nprotocell models with many chemical components synthesized through a catalytic\nreaction network. The possible relevance of the identified optimal uptake to\noptimal yield for cellular growth is also discussed.\n", "versions": [{"version": "v1", "created": "Sat, 15 Mar 2014 09:44:01 GMT"}], "update_date": "2015-06-19", "authors_parsed": [["Himeoka", "Yusuke", ""], ["Kaneko", "Kunihiko", ""]]}, {"id": "1403.5934", "submitter": "Jacob Halatek", "authors": "Jacob Halatek and Erwin Frey", "title": "Effective two-dimensional model does not account for geometry sensing by\n  self-organized proteins patterns - Supplementary document", "comments": "supplementary document, 24 pages, 9 figures", "journal-ref": "PNAS 2014 111 (18) E1817; published ahead of print April 3, 2014", "doi": "10.1073/pnas.1220971111", "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we provide a thorough discussion of the model for Min protein dynamics\nproposed by Schweizer et al. [11]. The manuscript serves as supplementary\ndocument for our letter to the editor to appear in PNAS. Our analysis is based\non the original COMSOL simulation files that were used for the publication. We\nshow that all computational data in Schweizer et al. rely on exploitation of\nsimulation artifacts and various unmentioned modifications of model parameters\nthat strikingly contradict the experimental setup and experimental data. We\nfind that the model neither accounts for MinE membrane interactions nor for any\nobserved MinDE protein patterns. All conclusions drawn from the computational\nmodel are void. There is no evidence at all that persistent MinE membrane\nbinding has any role in geometry sensing.\n", "versions": [{"version": "v1", "created": "Mon, 24 Mar 2014 12:40:35 GMT"}], "update_date": "2014-06-13", "authors_parsed": [["Halatek", "Jacob", ""], ["Frey", "Erwin", ""]]}, {"id": "1403.6738", "submitter": "Hu Cang", "authors": "Yina Zhu, Pingchuan Li, Paolo Beuzer, Zhisong Tong, Robin Watters, Dan\n  Lv, Cornelis Murre, and Hu Cang", "title": "CRISPR/Cas9 For Photoactivated Localization Microscopy (PALM)", "comments": "13 pages, and 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate that endonuclease deficient Clustered Regularly Interspaced\nShort Palindromic Repeats CRISPR-associated Cas9 protein (dCas9) fused to the\nphoto-convertible fluorescence protein monomeric mEos3.1 (dCas9-mEos3) can be\nused to resolve sub-diffraction limited features of repetitive gene elements,\nthus providing a new route to investigate high-order chromatin organization at\nthese sites.\n", "versions": [{"version": "v1", "created": "Wed, 26 Mar 2014 16:36:57 GMT"}], "update_date": "2014-03-27", "authors_parsed": [["Zhu", "Yina", ""], ["Li", "Pingchuan", ""], ["Beuzer", "Paolo", ""], ["Tong", "Zhisong", ""], ["Watters", "Robin", ""], ["Lv", "Dan", ""], ["Murre", "Cornelis", ""], ["Cang", "Hu", ""]]}, {"id": "1403.7708", "submitter": "Dipjyoti Das", "authors": "Dipjyoti Das and Dibyendu Das and Ranjith Padinhateeri", "title": "Force-induced dynamical properties of multiple cytoskeletal filaments\n  are distinct from that of single filaments", "comments": "11 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0114014", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How cytoskeletal filaments collectively undergo growth and shrinkage is an\nintriguing question. Collective properties of multiple bio-filaments (actin or\nmicrotubules) undergoing hydrolysis, have not been studied extensively earlier,\nwithin simple theoretical frameworks. In this paper, we show that collective\nproperties of multiple filaments under force are very distinct from the\nproperties of a single filament under similar conditions -- these distinctions\nmanifest as follows: (i) the collapse time during collective catastrophe for a\nmultifilament system is much larger than that of a single filament with the\nsame average length, (ii) force-dependence of the cap-size distribution of\nmultiple filaments are quantitatively different from that of single filament,\n(iii) the diffusion constant associated with the system length fluctuations is\ndistinct for multiple filaments, (iv) switching dynamics of multiple filaments\nbetween capped and uncapped states and the fluctuations therein are also\ndistinct. We build a unified picture by establishing interconnections among all\nthese collective phenomena. Additionally, we show that the collapse times\nduring catastrophes can be sharp indicators of collective stall forces\nexceeding the additive contributions of single filaments.\n", "versions": [{"version": "v1", "created": "Sun, 30 Mar 2014 07:12:55 GMT"}], "update_date": "2015-06-19", "authors_parsed": [["Das", "Dipjyoti", ""], ["Das", "Dibyendu", ""], ["Padinhateeri", "Ranjith", ""]]}]