[{"id": "1502.00155", "submitter": "Ulrich S. Schwarz", "authors": "Marvin A. Boettcher, Heinrich C. R. Klein and Ulrich S. Schwarz\n  (Heidelberg University)", "title": "Role of dynamic capsomere supply for viral capsid self-assembly", "comments": "Revtex, 26 pages, 7 EPS figures", "journal-ref": "Phys. Biol. 12:016014 (2015)", "doi": "10.1088/1478-3975/12/1/016014", "report-no": null, "categories": "q-bio.SC physics.bio-ph q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many viruses rely on the self-assembly of their capsids to protect and\ntransport their genomic material. For many viral systems, in particular for\nhuman viruses like hepatitis B, adeno or human immunodeficiency virus, that\nlead to persistent infections, capsomeres are continuously produced in the\ncytoplasm of the host cell while completed capsids exit the cell for a new\nround of infection. Here we use coarse-grained Brownian dynamics simulations of\na generic patchy particle model to elucidate the role of the dynamic supply of\ncapsomeres for the reversible self-assembly of empty T1 icosahedral virus\ncapsids. We find that for high rates of capsomere influx only a narrow range of\nbond strengths exists for which a steady state of continuous capsid production\nis possible. For bond strengths smaller and larger than this optimal value, the\nreaction volume becomes crowded by small and large intermediates, respectively.\nFor lower rates of capsomere influx a broader range of bond strengths exists\nfor which a steady state of continuous capsid production is established,\nalthough now the production rate of capsids is smaller. Thus our simulations\nsuggest that the importance of an optimal bond strength for viral capsid\nassembly typical for in vitro conditions can be reduced by the dynamic influx\nof capsomeres in a cellular environment.\n", "versions": [{"version": "v1", "created": "Sat, 31 Jan 2015 19:43:07 GMT"}], "update_date": "2015-02-03", "authors_parsed": [["Boettcher", "Marvin A.", "", "Heidelberg University"], ["Klein", "Heinrich C. R.", "", "Heidelberg University"], ["Schwarz", "Ulrich S.", "", "Heidelberg University"]]}, {"id": "1502.00156", "submitter": "Ulrich S. Schwarz", "authors": "Johanna E. Baschek, Heinrich C. R. Klein and Ulrich S. Schwarz\n  (Heidelberg University)", "title": "Stochastic dynamics of virus capsid formation: direct versus\n  hierarchical self-assembly", "comments": "Revtex, 31 pages, 9 EPS figures", "journal-ref": "BMC Biophysics 5:22 (2012)", "doi": "10.1186/2046-1682-5-22", "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to replicate within their cellular host, many viruses have developed\nself-assembly strategies for their capsids which are sufficiently robust as to\nbe reconstituted in vitro. Mathematical models for virus self-assembly usually\nassume that the bonds leading to cluster formation have constant reactivity\nover the time course of assembly (direct assembly). In some cases, however,\nbinding sites between the capsomers have been reported to be activated during\nthe self-assembly process (hierarchical assembly). In order to study possible\nadvantages of such hierarchical schemes for icosahedral virus capsid assembly,\nwe use Brownian dynamics simulations of a patchy particle model that allows us\nto switch binding sites on and off during assembly. For T1 viruses, we\nimplement a hierarchical assembly scheme where inter-capsomer bonds become\nactive only if a complete pentamer has been assembled. We find direct assembly\nto be favorable for reversible bonds allowing for repeated structural\nreorganizations, while hierarchical assembly is favorable for strong bonds with\nsmall dissociation rate, as this situation is less prone to kinetic trapping.\nHowever, at the same time it is more vulnerable to monomer starvation during\nthe final phase. Increasing the number of initial monomers does have only a\nweak effect on these general features. The differences between the two assembly\nschemes become more pronounced for more complex virus geometries, as shown here\nfor T3 viruses, which assemble through homogeneous pentamers and heterogeneous\nhexamers in the hierarchical scheme. In order to complement the simulations for\nthis more complicated case, we introduce a master equation approach that agrees\nwell with the simulation results.\n", "versions": [{"version": "v1", "created": "Sat, 31 Jan 2015 19:47:54 GMT"}], "update_date": "2015-02-03", "authors_parsed": [["Baschek", "Johanna E.", "", "Heidelberg University"], ["Klein", "Heinrich C. R.", "", "Heidelberg University"], ["Schwarz", "Ulrich S.", "", "Heidelberg University"]]}, {"id": "1502.00286", "submitter": "David Holcman", "authors": "D. Holcman, N. Hoze, Z. Schuss", "title": "Analysis of single particle trajectories: when things go wrong", "comments": "4 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To recover the long-time behavior and the statistics of molecular\ntrajectories from the large number (tens of thousands) of their short\nfragments, obtained by super-resolution methods at the single molecule level,\ndata analysis based on a stochastic model of their non-equilibrium motion is\nrequired. Recently, we characterized the local biophysical properties\nunderlying receptor motion based on coarse-grained long-range interactions,\ncorresponding to attracting potential wells of large sizes. The purpose of this\nletter is to discuss optimal estimators and show what happens when thing goes\nwrong.\n", "versions": [{"version": "v1", "created": "Sun, 1 Feb 2015 17:08:22 GMT"}], "update_date": "2015-02-03", "authors_parsed": [["Holcman", "D.", ""], ["Hoze", "N.", ""], ["Schuss", "Z.", ""]]}, {"id": "1502.01143", "submitter": "Vasily Ogryzko V", "authors": "Evelyne Saade and Vasily Ogryzko", "title": "Epigenetics: What it is about?", "comments": "7 pages, 3 figures", "journal-ref": "Biopolymers and Cell 2014", "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Epigenetics has captured the attention of scientists in the past decades, yet\nits scope has been continuously changing. In this paper, we give an overview on\nhow and why its definition has evolved and suggest several clarification on the\nconcepts used in this field, in particular, on the notions of epigenetic\ninformation, epigenetic stability and epigenetic templating. Another issue that\nwe address is the role of epigenetic information. Not only it is important in\nallowing alternative interpretations of genetic information, but it appears to\nbe important in protecting the genetic information, moreover, we suggest that\nthis function appeared first in evolution and only later on the epigenetic\nmechanisms were recruited to play a role in cell differentiation.\n", "versions": [{"version": "v1", "created": "Wed, 4 Feb 2015 09:57:08 GMT"}], "update_date": "2015-02-05", "authors_parsed": [["Saade", "Evelyne", ""], ["Ogryzko", "Vasily", ""]]}, {"id": "1502.01765", "submitter": "Nikhil Walani", "authors": "Nikhil Walani, Jennifer Torres and Ashutosh Agrawal", "title": "Endocytic proteins drive vesicle growth via instability in high membrane\n  tension environment", "comments": "Some typos in a figure", "journal-ref": null, "doi": "10.1073/pnas.1418491112", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Clathrin-mediated endocytosis (CME) is a key pathway for transporting cargo\ninto cells via membrane vesicles. It plays an integral role in nutrient import,\nsignal transduction, neurotransmission and cellular entry of pathogens and\ndrug-carrying nanoparticles. As CME entails substantial local remodeling of the\nplasma membrane, the presence of membrane tension offers resistance to bending\nand hence, vesicle formation. Experiments show that in such high tension\nconditions, actin dynamics is required to carry out CME successfully. In this\nstudy, we build upon these pioneering experimental studies to provide\nfundamental mechanistic insights into the roles of two key endocytic proteins,\nnamely, actin and BAR proteins in driving vesicle formation in high membrane\ntension environment. Our study reveals a new actin force induced `snap-through\ninstability' that triggers a rapid shape transition from a shallow invagination\nto a highly invaginated tubular structure. We show that the association of BAR\nproteins stabilizes vesicles and induces a milder instability. In addition, we\npresent a new counterintuitive role of BAR depolymerization in regulating the\nshape evolution of vesicles. We show that the dissociation of BAR proteins,\nsupported by actin-BAR synergy, leads to considerable elongation and squeezing\nof vesicles. Going beyond the membrane geometry, we put forth a new\nstress-based perspective for the onset of vesicle scission and predict the\nshapes and composition of detached vesicles. We present the snap-through\ntransition and the high in-plane stress as possible explanations for the\nintriguing direct transformation of broad and shallow invaginations into\ndetached vesicles in BAR mutant yeast cells.\n", "versions": [{"version": "v1", "created": "Fri, 6 Feb 2015 00:54:21 GMT"}, {"version": "v2", "created": "Sat, 14 Feb 2015 13:33:52 GMT"}], "update_date": "2016-07-13", "authors_parsed": [["Walani", "Nikhil", ""], ["Torres", "Jennifer", ""], ["Agrawal", "Ashutosh", ""]]}, {"id": "1502.01768", "submitter": "Timothy Saunders", "authors": "Timothy E Saunders", "title": "Aggregation-fragmentation model of robust concentration gradient\n  formation", "comments": "9 pages, 5 figures", "journal-ref": "Physical Review E 91, 022704 (2015)", "doi": "10.1103/PhysRevE.91.022704", "report-no": null, "categories": "q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Concentration gradients of signaling molecules are essential for patterning\nduring development and they have been observed in both unicellular and\nmulticellular systems. In subcellular systems, clustering of the signaling\nmolecule has been observed. We develop a theoretical model of cluster- mediated\nconcentration gradient formation based on the Becker-Doring equations of\naggregation- fragmentation processes. We show that such a mechanism produces\nrobust concentration gradients on realistic time and spatial scales so long as\nthe process of clustering does not significantly stabilize the signaling\nmolecule. Finally, we demonstrate that such a model is applicable to the pom1p\nsubcellular gradient in fission yeast.\n", "versions": [{"version": "v1", "created": "Fri, 6 Feb 2015 01:24:16 GMT"}], "update_date": "2015-02-09", "authors_parsed": [["Saunders", "Timothy E", ""]]}, {"id": "1502.01902", "submitter": "Adam MacLean Dr", "authors": "Adam L. MacLean, Heather A. Harrington, Michael P.H. Stumpf, Helen M.\n  Byrne", "title": "Mathematical and Statistical Techniques for Systems Medicine: The Wnt\n  Signaling Pathway as a Case Study", "comments": "Submitted to 'Systems Medicine' as a book chapter", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM math.DS q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The last decade has seen an explosion in models that describe phenomena in\nsystems medicine. Such models are especially useful for studying signaling\npathways, such as the Wnt pathway. In this chapter we use the Wnt pathway to\nshowcase current mathematical and statistical techniques that enable modelers\nto gain insight into (models of) gene regulation, and generate testable\npredictions. We introduce a range of modeling frameworks, but focus on ordinary\ndifferential equation (ODE) models since they remain the most widely used\napproach in systems biology and medicine and continue to offer great potential.\nWe present methods for the analysis of a single model, comprising applications\nof standard dynamical systems approaches such as nondimensionalization, steady\nstate, asymptotic and sensitivity analysis, and more recent statistical and\nalgebraic approaches to compare models with data. We present parameter\nestimation and model comparison techniques, focusing on Bayesian analysis and\ncoplanarity via algebraic geometry. Our intention is that this (non exhaustive)\nreview may serve as a useful starting point for the analysis of models in\nsystems medicine.\n", "versions": [{"version": "v1", "created": "Fri, 6 Feb 2015 14:40:01 GMT"}, {"version": "v2", "created": "Thu, 30 Jul 2015 17:28:59 GMT"}], "update_date": "2015-07-31", "authors_parsed": [["MacLean", "Adam L.", ""], ["Harrington", "Heather A.", ""], ["Stumpf", "Michael P. H.", ""], ["Byrne", "Helen M.", ""]]}, {"id": "1502.02105", "submitter": "Yunxin Zhang", "authors": "Jingwei Li and Yunxin Zhang", "title": "Theoretical analysis of transcription process with polymerase stalling", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Experimental evidences show that in gene transcription, RNA polymerase has\nthe possibility to be stalled at certain position of the transcription\ntemplate. This may be due to the template damage, or protein barriers. Once\nstalled, polymerase may backtrack along the template to the previous nucleotide\nto wait for the repair of the damaged site, or simply bypass the barrier or\ndamaged site and consequently synthesize an incorrect messenger RNA, or degrade\nand detach from the template. Thus, the {\\it effective} transcription rate (the\nrate to synthesize correct product mRNA) and the transcription {\\it\neffectiveness} (the ratio of the {\\it effective} transcription rate to the {\\it\neffective} transcription initiation rate) are both influenced by polymerase\nstalling events. This study shows that, Without backtracking, detachment of\nstalled polymerase can also help to increase the {\\it effective} transcription\nrate and transcription {\\it effectiveness}. Generally, the increase of bypass\nrate of the stalled polymerase will lead to the decrease of the {\\it effective}\ntranscription rate and transcription {\\it effectiveness}. But when both\ndetachment rate and backtracking rate of the stalled polymerase vanish, the\n{\\it effective} transcription rate may also be increased by the bypass\nmechanism.\n", "versions": [{"version": "v1", "created": "Sat, 7 Feb 2015 07:22:13 GMT"}], "update_date": "2015-02-10", "authors_parsed": [["Li", "Jingwei", ""], ["Zhang", "Yunxin", ""]]}, {"id": "1502.02109", "submitter": "Yunxin Zhang", "authors": "Jingwei Li and Yunxin Zhang", "title": "Translation with frameshifting of ribosome along mRNA transcript", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Translation is an important process for prokaryotic and eukaryotic cells to\nproduce necessary proteins for cell growth. Numerious experiments have been\nperformed to explore the translational properties. Diverse models have also\nbeen developed to determine the biochemical mechanism of translation. However,\nto simplify the majority of the existing models, the frameshifting of ribosome\nalong the mRNA transcript is neglected, which actually occurs in real cells and\nhas been extensively experimentally studied. The frameshifting of ribosome\nevidently influences the efficiency and speed of translation, considering that\nthe peptide chains synthesized by shifted ribosomes will not fold into\nfunctional proteins and will degrade rapidly. In this study, a theoretical\nmodel is presented to describe the translational process based on the model for\ntotally asymmetric simple exclusion process. In this model, the frameshifting\nof the ribosome along the mRNA transcript and the attachment/detachment of the\nribosome to/from the main body of mRNA codons during translation elongation\nprocess, are explicitly included. The results show that, with ribosome\nframeshifing, the speed of correctly synthesized peptide chains may increase\nfirst and then decrease with both the translation initiation rate $\\alpha$ and\nthe ribosome detachment rate $\\omega_d$. This results indicates that regulating\nthe translation process to reach maximal synthesized speed of proteins is\ntheoretically feasible. Traffic-related problems of ribosome motion along the\nmRNA transcript are also addressed theoretically. Depending on parameter\nvalues, shock wave (or domain wall) may exist for ribosome probabilities along\nthe mRNA.\n", "versions": [{"version": "v1", "created": "Sat, 7 Feb 2015 07:37:08 GMT"}], "update_date": "2015-02-10", "authors_parsed": [["Li", "Jingwei", ""], ["Zhang", "Yunxin", ""]]}, {"id": "1502.02164", "submitter": "Ludvig Lizana", "authors": "Sebastian Ahlberg and Tobias Ambj\\\"ornsson and Ludvig Lizana", "title": "Many-body effects in tracer particle diffusion with applications for\n  single-protein dynamics on DNA", "comments": "10 pages, 8 figures", "journal-ref": null, "doi": "10.1088/1367-2630/17/4/043036", "report-no": null, "categories": "cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  30% of the DNA in E. coli bacteria is covered by proteins. Such high degree\nof crowding affect the dynamics of generic biological processes (e.g. gene\nregulation, DNA repair, protein diffusion etc.) in ways that are not yet fully\nunderstood. In this paper, we theoretically address the diffusion constant of a\ntracer particle in a one dimensional system surrounded by impenetrable crowder\nparticles. While the tracer particle always stays on the lattice, crowder\nparticles may unbind to a surrounding bulk and rebind at another or the same\nlocation. In this scenario we determine how the long time diffusion constant\n${\\cal D}$ (after many unbinding events) depends on (i) the unbinding rate of\ncrowder particles $k_{\\rm off}$, and (ii) crowder particle line density $\\rho$,\nfrom simulations (Gillespie algorithm) and analytical calculations. For small\n$k_{\\rm off}$, we find ${\\cal D}\\sim k_{\\rm off}/\\rho^2$ when crowder particles\nare immobile on the line, and ${\\cal D}\\sim \\sqrt{D k_{\\rm off}}/\\rho$ when\nthey are diffusing; $D$ is the free particle diffusion constant. For large\n$k_{\\rm off}$, we find agreement with mean-field results which do not depend on\n$k_{\\rm off}$. From literature values of $k_{\\rm off}$ and $D$, we show that\nthe small $k_{\\rm off}$-limit is relevant for in vivo protein diffusion on a\ncrowded DNA. Our results applies to single-molecule tracking experiments.\n", "versions": [{"version": "v1", "created": "Sat, 7 Feb 2015 17:18:13 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Ahlberg", "Sebastian", ""], ["Ambjörnsson", "Tobias", ""], ["Lizana", "Ludvig", ""]]}, {"id": "1502.04591", "submitter": "Yintao Wang", "authors": "Yintao Wang, Hao He, Shaoyang Wang, Yaohui Liu, Minglie Hu, Youjia\n  Cao, Chingyue Wang", "title": "Photostimulation activates restorable fragmentation of single\n  mitochondrion by initiating oxide flashes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC physics.optics q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mitochondrial research is important to ageing, apoptosis, and mitochondrial\ndiseases. In previous works, mitochondria are usually stimulated indirectly by\nproapoptotic drugs to study mitochondrial development, which is in lack of\ncontrollability, or spatial and temporal resolution. These chemicals or even\ngene techniques regulating mitochondrial dynamics may also activate other\ninter- or intra-cellular processes simultaneously. Here we demonstrate a\nphotostimulation method on single-mitochondrion level by tightly-focused\nfemtosecond laser that can precisely activate restorable fragmentation of\nmitochondria which soon recover their original tubular structure after tens of\nseconds. In this process, series of mitochondrial reactive oxygen species\n(mROS) flashes are observed and found very critical to mitochondrial\nfragmentation. Meanwhile, transient openings of mitochondrial permeability\ntransition pores (mPTP), suggested by oscillations of mitochondrial membrane\npotential, contribute to the scavenging of redundant mROS and recovery of\nfragmented mitochondria. Those results demonstrate photostimulation as an\nactive, precise and controllable method for the study of mitochondrial\noxidative and morphological dynamics or related fields.\n", "versions": [{"version": "v1", "created": "Mon, 16 Feb 2015 16:06:21 GMT"}, {"version": "v2", "created": "Tue, 17 Feb 2015 13:54:30 GMT"}], "update_date": "2015-02-18", "authors_parsed": [["Wang", "Yintao", ""], ["He", "Hao", ""], ["Wang", "Shaoyang", ""], ["Liu", "Yaohui", ""], ["Hu", "Minglie", ""], ["Cao", "Youjia", ""], ["Wang", "Chingyue", ""]]}, {"id": "1502.06638", "submitter": "Aldo Ledesma", "authors": "Aldo Ledesma Duran, I. Santamaria-Holek", "title": "Multiscale modeling of exocytosis in the fertilization process", "comments": "16 pages, 9 figures, 1 table", "journal-ref": "J Phys Chem Biophys 4: 161 (2014)", "doi": "10.4172/2161-0398.1000161", "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss the implementation of a multiscale biophysico-chemical model able\nto cope with the main mechanisms underlying cumulative exocytosis in cells. The\nmodel is based on a diffusion equation in the presence of external forces that\nlinks calcium signaling and the biochemistry associated to the activity of\ncytoskeletal-based protein motors. This multiscale model offers an excellent\nquantitative spatio-temporal description of the cumulative exocytosis measured\nby means of fluorescence experiments. We also review pre-existing models\nreported in the literature on calcium waves, protein motor activation and\ndynamics, and intracellular directed transport of vesicles. As an example of\nthe proposed model, we analyze the formation of the shield against polyspermy\nin the early events of fertilization in sea urchin eggs.\n", "versions": [{"version": "v1", "created": "Mon, 23 Feb 2015 21:49:28 GMT"}, {"version": "v2", "created": "Mon, 4 Jan 2016 23:01:11 GMT"}], "update_date": "2016-01-06", "authors_parsed": [["Duran", "Aldo Ledesma", ""], ["Santamaria-Holek", "I.", ""]]}, {"id": "1502.07709", "submitter": "Debashish Chowdhury", "authors": "Tripti Bameta, Debashish Chowdhury, Dipanwita Ghanti and Soumendu\n  Ghosh", "title": "Mixed molecular motor traffic on nucleic acid tracks: models of\n  transcriptional interference and regulation of gene expression", "comments": "6+ pages, including 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech nlin.AO q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  RNA polymerase (RNAP) is molecular machine that polymerizes a RNA molecule, a\nlinear heteropolymer, using a single stranded DNA (ssDNA) as the corresponding\ntemplate; the sequence of monomers of the RNA is dictated by that of monomers\non the ssDNA template. While polymerizing a RNA, the RNAP walks step-by-step on\nthe ssDNA template in a specific direction. Thus, a RNAP can be regarded also\nas a molecular motor and the sites of start and stop of its walk on the DNA\nmark the two ends of the genetic message that it transcribes into RNA.\nInterference of transcription of two overlapping genes is believed to regulate\nthe levels of their expression, i.e., the overall rate of the corresponding RNA\nsynthesis, through suppressive effect of one on the other. Here we model this\nprocess as a mixed traffic of two groups of RNAP motors that are characterized\nby two distinct pairs of start and stop sites. Each group polymerizes identical\ncopies of a RNA while the RNAs polymerized by the two groups are different.\nThese models, which may also be viewed as two interfering totally asymmetric\nsimple exclusion processes, account for all modes of transcriptional\ninterference in spite of their extreme simplicity. A combination of mean-field\ntheory and computer simulation of these models demonstrate the physical origin\nof the switch-like regulation of the two interfering genes in both\nco-directional and contra-directional traffic of the two groups of RNAP motors.\n", "versions": [{"version": "v1", "created": "Wed, 25 Feb 2015 02:48:24 GMT"}], "update_date": "2015-02-27", "authors_parsed": [["Bameta", "Tripti", ""], ["Chowdhury", "Debashish", ""], ["Ghanti", "Dipanwita", ""], ["Ghosh", "Soumendu", ""]]}]