[{"id": "1607.02479", "submitter": "Thibault Lagache", "authors": "Thibault Lagache and David Holcman", "title": "Narrow escape to small windows on a small ball modeling the viral entry\n  into the cell nucleus", "comments": "21 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A certain class of viruses replicates inside a cell if they can enter the\nnucleus through one of many small target pores, before being permanently\ntrapped or degraded. We adopt for viral motion a switching stochastic process\nmodel and we estimate here the probability and the conditional mean first\npassage time for a viral particle to attain alive the nucleus. The cell nucleus\nis covered with thousands of small absorbing nuclear pores and the minimum\ndistance between them defines the smallest spatial scale that limits the\nefficiency of stochastic simulations. Using the Neuman-Green's function method\nto solve the steady-state Fokker-Planck equation, we derive asymptotic formula\nfor the probability and mean arrival time to a small window for various pores'\ndistributions, that agree with stochastic simulations. These formulas reveal\nhow key geometrical parameters defines the cytoplasmic stage of viral\ninfection.\n", "versions": [{"version": "v1", "created": "Fri, 8 Jul 2016 18:20:23 GMT"}, {"version": "v2", "created": "Mon, 18 Jul 2016 21:10:09 GMT"}], "update_date": "2016-07-20", "authors_parsed": [["Lagache", "Thibault", ""], ["Holcman", "David", ""]]}, {"id": "1607.03246", "submitter": "Yusuke Himeoka", "authors": "Yusuke Himeoka, and Kunihiko Kaneko", "title": "Theory for transitions between log and stationary phases: universal laws\n  for lag time", "comments": "17 pages, 5 figures", "journal-ref": "Phys. Rev. X 7, 021049 (2017)", "doi": "10.1103/PhysRevX.7.021049", "report-no": null, "categories": "physics.bio-ph q-bio.CB q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantitative characterization of bacterial growth has gathered substantial\nattention since Monod's pioneering study. Theoretical and experimental work has\nuncovered several laws for describing the log growth phase, in which the number\nof cells grows exponentially. However, microorganism growth also exhibits lag,\nstationary, and death phases under starvation conditions, in which cell growth\nis highly suppressed, while quantitative laws or theories for such phases are\nunderdeveloped. In fact, models commonly adopted for the log phase that consist\nof autocatalytic chemical components, including ribosomes, can only show\nexponential growth or decay in a population, and phases that halt growth are\nnot realized. Here, we propose a simple, coarse-grained cell model that\nincludes inhibitor molecule species in addition to the autocatalytic active\nprotein. The inhibitor forms a complex with active proteins to suppress the\ncatalytic process. Depending on the nutrient condition, the model exhibits the\ntypical transition among the lag, log, stationary, and death phases.\nFurthermore, the lag time needed for growth recovery after starvation follows\nthe square root of the starvation time and is inverse to the maximal growth\nrate, in agreement with experimental observations. Moreover, the distribution\nof lag time among cells shows an exponential tail, also consistent with\nexperiments. Our theory further predicts strong dependence of lag time upon the\nspeed of substrate depletion, which should be examined experimentally. The\npresent model and theoretical analysis provide universal growth laws beyond the\nlog phase, offering insight into how cells halt growth without entering the\ndeath phase.\n", "versions": [{"version": "v1", "created": "Tue, 12 Jul 2016 07:26:35 GMT"}], "update_date": "2017-07-05", "authors_parsed": [["Himeoka", "Yusuke", ""], ["Kaneko", "Kunihiko", ""]]}, {"id": "1607.05304", "submitter": "Emanuel Reithmann", "authors": "Emanuel Reithmann, Louis Reese, Erwin Frey", "title": "A nonequilibrium diffusion and capture mechanism ensures\n  tip-localization of regulating proteins on dynamic filaments", "comments": "6 pages, 4 figures, and 9 pages supplemental material (including 8\n  figures and 1 table)", "journal-ref": "Phys. Rev. Lett. 117, 078102 (2016)", "doi": "10.1103/PhysRevLett.117.078102", "report-no": "LMU-ASC 032/16", "categories": "physics.bio-ph cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Diffusive motion of regulatory enzymes on biopolymers with eventual capture\nat a reaction site is a common feature in cell biology. Using a lattice gas\nmodel we study the impact of diffusion and capture for a microtubule polymerase\nand a depolymerase. Our results show that the capture mechanism localizes the\nproteins and creates large-scale spatial correlations. We develop an analytic\napproximation that globally accounts for relevant correlations and yields\nresults that are in excellent agreement with experimental data. Our results\nshow that diffusion and capture operates most efficiently at cellular enzyme\nconcentrations which points to in vivo relevance.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2016 20:13:39 GMT"}], "update_date": "2016-08-12", "authors_parsed": [["Reithmann", "Emanuel", ""], ["Reese", "Louis", ""], ["Frey", "Erwin", ""]]}, {"id": "1607.05855", "submitter": "Lorenzo Marcucci", "authors": "Lorenzo Marcucci and Carlo Reggiani", "title": "Mechanosensing in myosin filament solves a 60 years old conflict in\n  skeletal muscle modeling between high power output and slow rise in tension", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.QM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Almost 60 years ago Andrew Huxley with his seminal paper \\cite{Huxley1957}\nlaid the foundation of modern muscle modeling, linking chemical events to\nmechanical performance. He described mechanics and energetics of muscle\ncontraction through the cyclical attachment and detachment of myosin motors to\nthe actin filament with ad hoc assumptions on the dependence of the rate\nconstants on the strain of the myosin motors. That relatively simple hypothesis\nis still present in recent models, even though with several modifications to\nadapt the model to the different experimental constraints which became\nsubsequently available. However, already in that paper, one controversial\naspect of the model became clear. Relatively high attachment and detachment\nrates of myosin to the actin filament were needed to simulate the high power\noutput at intermediate velocity of contraction. However, these rates were\nincompatible with the relatively slow rise in tension after activation, despite\nthe rise should be generated by the same rate functions. This discrepancy has\nnot been fully solved till today, despite several hypotheses have been\nforwarded to reconcile the two aspects. Here, using a conventional muscle\nmodel, we show that the recently revealed mechanosensing mechanism of\nrecruitment of myosin motors \\cite{Linarietal2015} can solve this long standing\nproblem without any further ad-hoc hypotheses.\n", "versions": [{"version": "v1", "created": "Wed, 20 Jul 2016 08:09:06 GMT"}], "update_date": "2016-07-21", "authors_parsed": [["Marcucci", "Lorenzo", ""], ["Reggiani", "Carlo", ""]]}, {"id": "1607.06640", "submitter": "Davide Michieletto", "authors": "C. A. Brackley, B. Liebchen, D. Michieletto, F. Mouvet, P. R. Cook, D.\n  Marenduzzo", "title": "Ephemeral protein binding to DNA shapes stable nuclear bodies and\n  chromatin domains", "comments": "Combined text + SI; Supplementary Movies can be found at\n  http://www2.ph.ed.ac.uk/~dmarendu/RecolouringSupplementaryMaterial.html", "journal-ref": null, "doi": "10.1016/j.bpj.2017.01.025", "report-no": null, "categories": "physics.bio-ph cond-mat.soft cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fluorescence microscopy reveals that the contents of many (membrane-free)\nnuclear \"bodies\" exchange rapidly with the soluble pool whilst the underlying\nstructure persists; such observations await a satisfactory biophysical\nexplanation. To shed light on this, we perform large-scale Brownian dynamics\nsimulations of a chromatin fiber interacting with an ensemble of (multivalent)\nDNA-binding proteins; these proteins switch between two states -- active\n(binding) and inactive (non-binding). This system provides a model for any\nDNA-binding protein that can be modified post-translationally to change its\naffinity for DNA (e.g., like the phosphorylation of a transcription factor).\nDue to this out-of-equilibrium process, proteins spontaneously assemble into\nclusters of self-limiting size, as individual proteins in a cluster exchange\nwith the soluble pool with kinetics like those seen in photo-bleaching\nexperiments. This behavior contrasts sharply with that exhibited by\n\"equilibrium\", or non-switching, proteins that exist only in the binding state;\nwhen these bind to DNA non-specifically, they form clusters that grow\nindefinitely in size. Our results point to post-translational modification of\nchromatin-bridging proteins as a generic mechanism driving the self-assembly of\nhighly dynamic, non-equilibrium, protein clusters with the properties of\nnuclear bodies. Such active modification also reshapes intra-chromatin contacts\nto give networks resembling those seen in topologically-associating domains, as\nswitching markedly favors local (short-range) contacts over distant ones.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2016 11:51:24 GMT"}], "update_date": "2017-04-26", "authors_parsed": [["Brackley", "C. A.", ""], ["Liebchen", "B.", ""], ["Michieletto", "D.", ""], ["Mouvet", "F.", ""], ["Cook", "P. R.", ""], ["Marenduzzo", "D.", ""]]}, {"id": "1607.06836", "submitter": "Benjamin Machta", "authors": "Ofer Kimchi, Sarah L. Veatch, Benjamin B. Machta", "title": "Allosteric Regulation by a Critical Membrane", "comments": "6 pages 3 figures, and 3 page supplement", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph cond-mat.soft cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many of the processes that underly neural computation are carried out by ion\nchannels embedded in the plasma membrane, a two-dimensional liquid that\nsurrounds all cells. Recent experiments have demonstrated that this membrane is\npoised close to a liquid-liquid critical point in the Ising universality class.\nHere we use both exact and stochastic techniques on the lattice Ising model to\nexplore the ramifications of proximity to criticality for proteins that are\nallosterically coupled to Ising composition modes. Owing to diverging\ngeneralized susceptibilities, such a protein's activity becomes strongly\ninfluenced by perturbations that influence the two relevant parameters of the\ncritical point, especially the critical temperature. In addition, the protein's\nkinetics acquire a range of time scales from its surrounding membrane,\nnaturally leading to non-Markovian dynamics.\n", "versions": [{"version": "v1", "created": "Fri, 22 Jul 2016 20:37:37 GMT"}], "update_date": "2016-07-26", "authors_parsed": [["Kimchi", "Ofer", ""], ["Veatch", "Sarah L.", ""], ["Machta", "Benjamin B.", ""]]}, {"id": "1607.07196", "submitter": "Farshid Mohammad-Rafiee", "authors": "Bahareh Shakiba, Maryam Dayeri, and Farshid Mohammad-Rafiee", "title": "Modeling of Ribosome Dynamics on a ds-mRNA under an External Load", "comments": null, "journal-ref": "J. Chem. Phys. 145, 025101 (2016)", "doi": "10.1063/1.4958321", "report-no": null, "categories": "q-bio.SC cond-mat.soft physics.bio-ph q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protein molecules in cells are synthesized by macromolecular machines called\nribosomes. According to recent experimental data, we reduce the complexity of\nthe ribosome and propose a model to express its activity in six main states.\nUsing our model, we study the translation rate in different biological relevant\nsituations in the presence of external force, and translation through the RNA\ndouble stranded region in the absence or presence of the external force. In the\npresent study, we give a quantitative theory for translation rate and show that\nthe ribosome behaves more like a Brownian Ratchet motor. Our findings could\nshed some light on understanding behaviors of the ribosome in biological\nconditions.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jul 2016 10:21:18 GMT"}], "update_date": "2016-07-26", "authors_parsed": [["Shakiba", "Bahareh", ""], ["Dayeri", "Maryam", ""], ["Mohammad-Rafiee", "Farshid", ""]]}, {"id": "1607.08507", "submitter": "Kamal Dhakal", "authors": "Jingsong Zhou, Kamal Dhakal, Jianxun Yi", "title": "Mitochondrial Ca2+ uptake in skeletal muscle health and disease", "comments": null, "journal-ref": null, "doi": "10.1007/s11427-016-5089-3", "report-no": null, "categories": "q-bio.BM physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Muscle uses Ca2+ as a messenger to control contraction and relies on ATP to\nmaintain the intracellular Ca2+ homeostasis. Mitochondria are the major\nsub-cellular organelle of ATP production. With a negative inner membrane\npotential, mitochondria take up Ca2+ from their surroundings, a process called\nmitochondrial Ca2+ uptake. Under physiological conditions, Ca2+ uptake into\nmitochondria promotes ATP production. Excessive uptake causes mitochondrial\nCa2+ overload, which activates downstream adverse responses leading to cell\ndysfunction. Moreover, mitochondrial Ca2+ uptake could shape spatio-temporal\npatterns of intracellular Ca2+ signaling. Malfunction of mitochondrial Ca2+\nuptake is implicated in muscle degeneration. Unlike non-excitable cells,\nmitochondria in muscle cells experience dramatic changes of intracellular Ca2+\nlevels. Besides the sudden elevation of Ca2+ level induced by action\npotentials, Ca2+ transients in muscle cells can be as short as a few\nmilliseconds during a single twitch or as long as minutes during tetanic\ncontraction, which raises the question whether mitochondrial Ca2+ uptake is\nfast and big enough to shape intracellular Ca2+ signaling during\nexcitation-contraction coupling and creates technical challenges for\nquantification of the dynamic changes of Ca2+ inside mitochondria. This review\nfocuses on characterization of mitochondrial Ca2+ uptake in skeletal muscle and\nits role in muscle physiology and diseases.\n", "versions": [{"version": "v1", "created": "Thu, 28 Jul 2016 15:47:22 GMT"}], "update_date": "2016-07-29", "authors_parsed": [["Zhou", "Jingsong", ""], ["Dhakal", "Kamal", ""], ["Yi", "Jianxun", ""]]}]