[{"id": "1609.00557", "submitter": "Ludger Santen", "authors": "Ines Weber, C\\'ecile Appert-Rolland, Gr\\'egory Schehr and Ludger\n  Santen", "title": "Non-equilibrium fluctuations of a semi-flexible filament driven by\n  active cross-linkers", "comments": "9 pages, 5 figures", "journal-ref": "EPL 120 (2017) 38006", "doi": "10.1209/0295-5075/120/38006", "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The cytoskeleton is an inhomogeneous network of semi-flexible filaments,\nwhich are involved in a wide variety of active biological processes. Although\nthe cytoskeletal filaments can be very stiff and embedded in a dense and\ncross-linked network, it has been shown that, in cells, they typically exhibit\nsignificant bending on all length scales. In this work we propose a model of a\nsemi-flexible filament deformed by different types of cross-linkers for which\none can compute and investigate the bending spectrum. Our model allows to\ncouple the evolution of the deformation of the semi-flexible polymer with the\nstochastic dynamics of linkers which exert transversal forces onto the\nfilament. We observe a $q^{-2}$ dependence of the bending spectrum for some\nbiologically relevant parameters and in a certain range of wavenumbers $q$.\nHowever, generically, the spatially localized forcing and the non-thermal\ndynamics both introduce deviations from the thermal-like $q^{-2}$ spectrum.\n", "versions": [{"version": "v1", "created": "Fri, 2 Sep 2016 11:43:14 GMT"}], "update_date": "2019-05-24", "authors_parsed": [["Weber", "Ines", ""], ["Appert-Rolland", "Cécile", ""], ["Schehr", "Grégory", ""], ["Santen", "Ludger", ""]]}, {"id": "1609.03829", "submitter": "Manos Mavrakis", "authors": "Manos Mavrakis (MOSAIC)", "title": "Visualizing septins in early Drosophila embryos", "comments": null, "journal-ref": "Methods in Cell Biology, Elsevier, 2016, Septins, 136, pp.183", "doi": "10.1016/bs.mcb.2016.03.026", "report-no": null, "categories": "q-bio.SC q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Functional studies in Drosophila have been key for establishing a role for\nthe septin family of proteins in animal cell division and thus extending for\nthe first time observations from the budding yeast to animal cells. Visualizing\nthe distribution of specific septins in different Drosophila tissues and, in\nparticular, in the Drosophila embryo, together with biochemical and mutant\nphenotype data, has contributed important advances to our understanding of\nanimal septin biology, suggesting roles in processes other than in cytokinesis.\nSeptin localization using immunofluorescence assays has been possible due to\nthe generation of antibodies against different Drosophila septins. The recent\navailability of lines expressing fluorescent protein fusions of specific\nseptins further promises to facilitate studies on septin dynamics. Here, we\nprovide protocols for preparing early Drosophila embryos to visualize septins\nusing immunofluorescence assays and live fluorescence microscopy. The genetic\ntractability of the Drosophila embryo together with its amenability to\nhigh-resolution fluorescence microscopy promises to provide novel insights into\nanimal septin structure and function.\n", "versions": [{"version": "v1", "created": "Tue, 13 Sep 2016 13:46:30 GMT"}], "update_date": "2016-09-14", "authors_parsed": [["Mavrakis", "Manos", "", "MOSAIC"]]}, {"id": "1609.03845", "submitter": "Manos Mavrakis", "authors": "Manos Mavrakis (MOSAIC), Tsai Feng-Ching (FOM Institute AMOLF), Gijsje\n  H. Koenderink (FOM Institute AMOLF)", "title": "Purification of recombinant human and Drosophila septin hexamers for\n  TIRF assays of actin-septin filament assembly", "comments": null, "journal-ref": "Methods in Cell Biology, Elsevier, 2016, Septins, 136, pp.199", "doi": "10.1016/bs.mcb.2016.03.020", "report-no": null, "categories": "q-bio.SC q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Septins are guanine nucleotide-binding proteins that are conserved from fungi\nto humans. Septins assemble into heterooligomeric complexes and higher-order\nstructures with key roles in various cellular functions including cell\nmigration and division. The mechanisms by which septins assemble and interact\nwith other cytoskeletal elements like actin remain elusive. A powerful approach\nto address this question is by cell-free reconstitution of pu- rified\ncytoskeletal proteins combined with fluorescence microscopy. Here, we describe\nprocedures for the purification of recombinant Drosophila and human septin\nhexamers from Escherichia coli and reconstitution of actin-septin coassembly.\nThese procedures can be used to compare assembly of Drosophila and human\nseptins and their coassembly with the actin cytoskeleton by total internal\nreflection fluorescence microscopy.\n", "versions": [{"version": "v1", "created": "Tue, 13 Sep 2016 14:13:29 GMT"}], "update_date": "2016-09-14", "authors_parsed": [["Mavrakis", "Manos", "", "MOSAIC"], ["Feng-Ching", "Tsai", "", "FOM Institute AMOLF"], ["Koenderink", "Gijsje H.", "", "FOM Institute AMOLF"]]}, {"id": "1609.04007", "submitter": "Cecilia Liliana Villarruel", "authors": "Lorena Sigaut, Cecilia Villarruel, Mar\\'ia Laura Ponce and Silvina\n  Ponce Dawson", "title": "Sets of FCS experiments to quantify free diffusion coefficients in\n  reaction-diffusion systems. The case of Ca2+ and its dyes", "comments": "32 pages, 7 figures", "journal-ref": "Phys. Rev. E 95, 062408 (2017)", "doi": "10.1103/PhysRevE.95.062408", "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many cell signaling pathways involve the diffusion of messengers that\nbind/unbind to intracellular components. Quantifying their net transport rate\nunder different conditions, then requires having separate estimates of their\nfree diffusion coefficient and binding/unbinding rates. In this paper, we show\nhow performing sets of Fluorescence Correlation Spectroscopy (FCS) experiments\nunder different conditions, it is possible to quantify free diffusion\ncoefficients and on and off rates of reaction-diffusion systems. We develop the\ntheory and present a practical implementation for the case of the universal\nsecond messenger, calcium (Ca$^{2+}$) and single-wavelength dyes that increase\ntheir fluorescence upon Ca$^{2+}$ binding. We validate the approach with\nexperiments performed in aqueous solutions containing Ca$^{2+}$ and Fluo4\ndextran (both in its High and Low Affinity versions). Performing FCS\nexperiments with tetramethylrhodamine-dextran in Xenopus laevis oocytes, we\ninfer the corresponding free diffusion coefficients in the cytosol of these\ncells. Our approach can be extended to other physiologically relevant\nreaction-diffusion systems to quantify biophysical parameters that determine\nthe dynamics of various variables of interest.\n", "versions": [{"version": "v1", "created": "Tue, 13 Sep 2016 15:07:10 GMT"}], "update_date": "2017-06-21", "authors_parsed": [["Sigaut", "Lorena", ""], ["Villarruel", "Cecilia", ""], ["Ponce", "María Laura", ""], ["Dawson", "Silvina Ponce", ""]]}, {"id": "1609.04163", "submitter": "Yael Roichman", "authors": "Adar Sonn-Segev, Anne Bernheim-Groswasser, and Yael Roichman", "title": "Scale dependence of mechanics and dynamics of active gels with\n  increasing motor concentration", "comments": "12 pages 6 figures", "journal-ref": null, "doi": "10.1039/C7SM01391D", "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The cytoskeleton protein actin assembles into large bundles when supporting\nstresses in the cell, but grows into a fine branched network to induce cell\nmotion. Such self-organization processes are studied in artificial networks of\ncytoskeleton proteins with thick actin bundles and large motor protein\naggregates to enable optical observation. The effect of motor aggregate size on\nthe cytoskeleton mechanical properties is studied here in networks comprised of\nmuch smaller motor assemblies. Large motor protein clusters are known to\nincrease the stiffness of actin based networks by introducing tension and\nadditional cross-linking cites. We find that these effects are universal to\nactin gels regardless of actin bundle thickness and motor aggregate size and\nare relevant, therefore, to a wide range of cytoskeleton based cellular\nprocesses. In contrast, motor induced active fluctuations depend significantly\non motor assembly size, featuring unique non-Gaussian statistics at high\nconcentrations of small assemblies.\n", "versions": [{"version": "v1", "created": "Wed, 14 Sep 2016 08:19:03 GMT"}, {"version": "v2", "created": "Tue, 12 Jun 2018 16:07:22 GMT"}], "update_date": "2018-06-13", "authors_parsed": [["Sonn-Segev", "Adar", ""], ["Bernheim-Groswasser", "Anne", ""], ["Roichman", "Yael", ""]]}, {"id": "1609.04515", "submitter": "Thomas R. Weikl", "authors": "Michael Raatz and Thomas R. Weikl", "title": "Membrane tubulation by elongated and patchy nanoparticles", "comments": "11 pages, 6 figures", "journal-ref": "Adv. Mater. Interfaces 2016, 1600325", "doi": "10.1002/admi.201600325", "report-no": null, "categories": "q-bio.SC cond-mat.soft physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in nanotechnology lead to an increasing interest in how\nnanoparticles interact with biomembranes. Nanoparticles are wrapped\nspontaneously by biomembranes if the adhesive interactions between the\nparticles and membranes compensate for the cost of membrane bending. In the\nlast years, the cooperative wrapping of spherical nanoparticles in membrane\ntubules has been observed in experiments and simulations. For spherical\nnanoparticles, the stability of the particle-filled membrane tubules strongly\ndepends on the range of the adhesive particle-membrane interactions. In this\narticle, we show via modeling and energy minimization that elongated and patchy\nparticles are wrapped cooperatively in membrane tubules that are highly stable\nfor all ranges of the particle-membrane interactions, compared to individual\nwrapping of the particles. The cooperative wrapping of linear chains of\nelongated or patchy particles in membrane tubules may thus provide an efficient\nroute to induce membrane tubulation, or to store such particles in membranes.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2016 05:38:50 GMT"}], "update_date": "2016-09-16", "authors_parsed": [["Raatz", "Michael", ""], ["Weikl", "Thomas R.", ""]]}, {"id": "1609.05676", "submitter": "Michael Margaliot", "authors": "Yoram Zarai and Michael Margaliot and Tamir Tuller", "title": "A Deterministic Mathematical Model for Bidirectional Excluded Flow with\n  Langmuir Kinetics", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0182178", "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many important cellular processes, including mRNA translation, gene\ntranscription, phosphotransfer, and intracellular transport, biological\n\"particles\" move along some kind of \"tracks\". The motion of these particles can\nbe modeled as a one-dimensional movement along an ordered sequence of sites.\nThe biological particles (e.g., ribosomes, RNAPs, phosphate groups, motor\nproteins) have volume and cannot surpass one another. In some cases, there is a\npreferred direction of movement along the track, but in general the movement\nmay be two-directional, and furthermore the particles may attach or detach from\nvarious regions along the tracks (e.g. ribosomes may drop off the mRNA molecule\nbefore reaching a stop codon). We derive a new deterministic mathematical model\nfor such transport phenomena that may be interpreted as the dynamic mean-field\napproximation of an important model from mechanical statistics called the\nasymmetric simple exclusion process (ASEP) with Langmuir kinetics. Using tools\nfrom the theory of monotone dynamical systems and contraction theory we show\nthat the model admits a unique globally asymptotically stable equilibrium. This\nmeans that the occupancy in all the sites along the lattice converges to a\nsteady-state value that depends on the parameters but not on the initial\nconditions. We also show that the model entrains (or phase locks) to periodic\nexcitations in any of its forward, backward, attachment, or detachment rates.\nWe demonstrate an application of this phenomenological transport model for\nanalyzing the effect of ribosome drop off in mRNA translation. One may perhaps\nexpect that drop off from a jammed site may increase the total flow by reducing\ncongestion. Our results show that this is not true. Drop off has a substantial\neffect on the flow, yet always leads to a reduction in the steady-state protein\nproduction rate.\n", "versions": [{"version": "v1", "created": "Mon, 19 Sep 2016 11:55:29 GMT"}], "update_date": "2017-11-01", "authors_parsed": [["Zarai", "Yoram", ""], ["Margaliot", "Michael", ""], ["Tuller", "Tamir", ""]]}, {"id": "1609.07292", "submitter": "David A. Kessler", "authors": "David A. Kessler and Herbert Levine", "title": "Nonlinear self-adapting wave patterns", "comments": null, "journal-ref": null, "doi": "10.1088/1367-2630/18/12/122001", "report-no": null, "categories": "q-bio.SC nlin.PS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new type of traveling wave pattern, one that can adapt to the\nsize of physical system in which it is embedded. Such a system arises when the\ninitial state has an instability that extends down to zero wavevector,\nconnecting at that point to two symmetry modes of the underlying dynamical\nsystem. The Min system of proteins in E. coli is such as system with the\nsymmetry emerging from the global conservation of two proteins, MinD and MinE.\nFor this and related systems, traveling waves can adiabatically deform as the\nsystem is increased in size without the increase in node number that would be\nexpected for an oscillatory version of a Turing instability containing an\nallowed wavenumber band with a finite minimum.\n", "versions": [{"version": "v1", "created": "Fri, 23 Sep 2016 09:46:51 GMT"}], "update_date": "2017-01-04", "authors_parsed": [["Kessler", "David A.", ""], ["Levine", "Herbert", ""]]}, {"id": "1609.07461", "submitter": "Khem Raj Ghusinga", "authors": "Khem Raj Ghusinga, Abhyudai Singh", "title": "Effect of gene-expression bursts on stochastic timing of cellular events", "comments": "submitted to American Control Conference 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gene expression is inherently a noisy process which manifests as cell-to-cell\nvariability in time evolution of proteins. Consequently, events that trigger at\ncritical threshold levels of regulatory proteins exhibit stochasticity in their\ntiming. An important contributor to the noise in gene expression is translation\nbursts which correspond to randomness in number of proteins produced in a\nsingle mRNA lifetime. Modeling timing of an event as a first-passage time (FPT)\nproblem, we explore the effect of burst size distribution on event timing.\nTowards this end, the probability density function of FPT is computed for a\ngene expression model with burst size drawn from a generic non-negative\ndistribution. Analytical formulas for FPT moments are provided in terms of\nknown vectors and inverse of a matrix. The effect of burst size distribution is\ninvestigated by looking at how the feedback regulation strategy that minimizes\nnoise in timing around a given time deviates from the case when burst is\ndeterministic. Interestingly, results show that the feedback strategy for\ndeterministic burst case is quite robust to change in burst size distribution,\nand deviations from it are confined to about 20% of the optimal value. These\nfindings facilitate an improved understanding of noise regulation in event\ntiming.\n", "versions": [{"version": "v1", "created": "Fri, 23 Sep 2016 18:51:38 GMT"}], "update_date": "2016-09-26", "authors_parsed": [["Ghusinga", "Khem Raj", ""], ["Singh", "Abhyudai", ""]]}, {"id": "1609.07853", "submitter": "Ralf Metzler", "authors": "O. Pulkkinen and R. Metzler", "title": "Variance-corrected Michaelis-Menten equation predicts transient rates of\n  single-enzyme reactions and response times in bacterial gene-regulation", "comments": "22 pages, 3 figures, RevTeX", "journal-ref": "Scientific Reports 5, 17820 (2015)", "doi": null, "report-no": null, "categories": "q-bio.QM physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many chemical reactions in biological cells occur at very low concentrations\nof constituent molecules. Thus, transcriptional gene-regulation is often\ncontrolled by poorly expressed transcription-factors, such as E.coli lac\nrepressor with few tens of copies. Here we study the effects of inherent\nconcentration fluctuations of substrate-molecules on the seminal\nMichaelis-Menten scheme of biochemical reactions. We present a universal\ncorrection to the Michaelis-Menten equation for the reaction-rates. The\nrelevance and validity of this correction for enzymatic reactions and\nintracellular gene-regulation is demonstrated. Our analytical theory and\nsimulation results confirm that the proposed variance-corrected\nMichaelis-Menten equation predicts the rate of reactions with remarkable\naccuracy even in the presence of large non-equilibrium concentration\nfluctuations. The major advantage of our approach is that it involves only the\nmean and variance of the substrate-molecule concentration. Our theory is\ntherefore accessible to experiments and not specific to the exact source of the\nconcentration fluctuations.\n", "versions": [{"version": "v1", "created": "Mon, 26 Sep 2016 05:48:39 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Pulkkinen", "O.", ""], ["Metzler", "R.", ""]]}, {"id": "1609.08099", "submitter": "Julyan Cartwright", "authors": "Yang Ding, Bruno Batista, Oliver Steinbock, Julyan H. E. Cartwright,\n  Silvana S. S. Cardoso", "title": "Wavy membranes and the growth rate of a planar chemical garden: Enhanced\n  diffusion and bioenergetics", "comments": null, "journal-ref": "PNAS, vol. 113, no. 33, 9182-9186, 2016", "doi": "10.1073/pnas.1607828113", "report-no": null, "categories": "nlin.AO cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to model ion transport across protocell membranes in Hadean\nhydrothermal vents, we consider both theoretically and experimentally the\nplanar growth of a precipitate membrane formed at the interface between two\nparallel fluid streams in a two-dimensional microfluidic reactor. The growth\nrate of the precipitate is found to be proportional to the square root of time,\nwhich is characteristic of diffusive transport. However, the dependence of the\ngrowth rate on the concentrations of hydroxide and metal ions is approximately\nlinear and quadratic, respectively. We show that such a difference in ionic\ntransport dynamics arises from the enhanced transport of metal ions across a\nthin gel layer present at the surface of the precipitate. The fluctuations in\ntransverse velocity in this wavy porous gel layer allow an enhanced transport\nof the cation, so that the effective diffusivity is about an order of magnitude\nhigher than that expected from molecular diffusion alone. Our theoretical\npredictions are in excellent agreement with our laboratory measurements of the\ngrowth of a manganese hydroxide membrane in a microfluidic channel, and this\nenhanced transport is thought to have been needed to account for the\nbioenergetics of the first single-celled organisms.\n", "versions": [{"version": "v1", "created": "Mon, 26 Sep 2016 18:00:41 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Ding", "Yang", ""], ["Batista", "Bruno", ""], ["Steinbock", "Oliver", ""], ["Cartwright", "Julyan H. E.", ""], ["Cardoso", "Silvana S. S.", ""]]}]