[{"id": "1702.00512", "submitter": "Michael B\\\"orsch", "authors": "Franziska Foertsch, Mykhailo Ilchenko, Thomas Heitkamp, Silke\n  Nossmann, Birgit Hoffmann, Ilka Starke, Ralf Mrowka, Christoph Biskup,\n  Michael Borsch", "title": "Imaging cytochrome C oxidase and FoF1-ATP synthase in mitochondrial\n  cristae of living human cells by FLIM and superresolution microscopy", "comments": "14 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cytochrome C oxidase and FoF1-ATP synthase constitute complex IV and V,\nrespectively, of the five membrane-bound enzymes in mitochondria comprising the\nrespiratory chain. These enzymes are located in the inner mitochondrial\nmembrane (IMM), which exhibits large invaginations called cristae. According to\nrecent cryo-tomography, FoF1-ATP synthases are located predominantly at the rim\nof the cristae, while cytochrome C oxidases are likely distributed in planar\nmembrane areas of the cristae. Previous FLIM measurements (K. Busch and\ncoworkers) of complex II and III unravelled differences in the local\nenvironment of the membrane enzymes in the cristae. Here, we tagged complex IV\nand V with mNeonGreen and investigated their mitochondrial nano-environment by\nFLIM and superresolution microscopy in living human cells. Different lifetimes\nand anisotropy values were found and will be discussed.\n", "versions": [{"version": "v1", "created": "Thu, 2 Feb 2017 00:52:46 GMT"}], "update_date": "2017-02-03", "authors_parsed": [["Foertsch", "Franziska", ""], ["Ilchenko", "Mykhailo", ""], ["Heitkamp", "Thomas", ""], ["Nossmann", "Silke", ""], ["Hoffmann", "Birgit", ""], ["Starke", "Ilka", ""], ["Mrowka", "Ralf", ""], ["Biskup", "Christoph", ""], ["Borsch", "Michael", ""]]}, {"id": "1702.00632", "submitter": "Luca Ciandrini", "authors": "Lucas D. Fernandes, Alessandro P.S. de Moura and Luca Ciandrini", "title": "Gene length as a regulator for ribosome recruitment and protein\n  synthesis: theoretical insights", "comments": null, "journal-ref": "Scientific Reports 7, Article number: 17409 (2017)", "doi": "10.1038/s41598-017-17618-1", "report-no": null, "categories": "q-bio.SC cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protein synthesis rates are determined, at the translational level, by\nproperties of the transcript's sequence. The efficiency of an mRNA can be tuned\nby varying the ribosome binding sites controlling the recruitment of the\nribosomes, or the codon usage establishing the speed of protein elongation. In\nthis work we propose transcript length as a further key determinant of\ntranslation efficiency. Based on a physical model that considers the kinetics\nof ribosomes advancing on the mRNA and diffusing in its surrounding, as well as\nmRNA circularisation and ribosome drop-off, we explain how the transcript\nlength may play a central role in establishing ribosome recruitment and the\noverall translation rate of an mRNA. According to our results, the proximity of\nthe 3' end to the ribosomal recruitment site of the mRNA could induce a\nfeedback in the translation process that would favour the recycling of\nribosomes. We also demonstrate how this process may be involved in shaping the\nexperimental ribosome density-gene length dependence. Finally, we argue that\ncells could exploit this mechanism to adjust and balance the usage of its\nribosomal resources.\n", "versions": [{"version": "v1", "created": "Thu, 2 Feb 2017 11:57:32 GMT"}, {"version": "v2", "created": "Mon, 3 Jul 2017 09:39:44 GMT"}, {"version": "v3", "created": "Tue, 12 Dec 2017 15:47:08 GMT"}], "update_date": "2017-12-14", "authors_parsed": [["Fernandes", "Lucas D.", ""], ["de Moura", "Alessandro P. S.", ""], ["Ciandrini", "Luca", ""]]}, {"id": "1702.01265", "submitter": "H\\'el\\`ene Bouvrais", "authors": "H\\'el\\`ene Bouvrais, Laurent Chesneau, Sylvain Pastezeur, Marie\n  Delattre, Jacques P\\'ecr\\'eaux", "title": "LET-99-dependent spatial restriction of active force generators makes\n  spindle's position robust", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  During the asymmetric division of the Caenorhabditis elegans nematode zygote,\nthe polarity cues distribution and daughter cell fates depend on the correct\npositioning of the mitotic spindle, which results from both centering and\ncortical pulling forces. Revealed by anaphase spindle rocking, these pulling\nforces are regulated by the force generator dynamics, which are in turn\nconsequent of mitotic progression. We found a novel, additional, regulation of\nthese forces by the spindle position. It controls astral microtubule\navailability at the cortex, on which the active force generators can pull.\nImportantly, this positional control relies on the polarity dependent LET-99\ncortical band, which restricts or concentrates generators to a posterior\ncrescent. We ascribed this control to the microtubule dynamics at the cortex.\nIndeed, in mapping the cortical contacts, we found a correlation between the\ncentrosome-cortex distance and the microtubule contact density. In turn, it\nmodulates pulling force generator activity. We modelled this control,\npredicting and experimentally validating that the posterior crescent extent\ncontrolled where the anaphase oscillations started, in addition to mitotic\nprogression. Finally, we propose that spatially restricting force generator to\na posterior crescent sets the spindle's final position, reflecting polarity\nthrough the LET-99 dependent restriction of force generators to a posterior\ncrescent. This regulation superimposes that of force generator processivity.\nThis novel control confers a low dependence on microtubule and active force\ngenerator exact numbers or dynamics, provided that they exceed the threshold\nneeded for posterior displacement. Interestingly, this robustness originates in\ncell mechanics rather than biochemical networks.\n", "versions": [{"version": "v1", "created": "Sat, 4 Feb 2017 11:06:25 GMT"}, {"version": "v2", "created": "Mon, 10 Apr 2017 16:02:11 GMT"}, {"version": "v3", "created": "Wed, 24 May 2017 13:50:09 GMT"}, {"version": "v4", "created": "Thu, 5 Apr 2018 14:02:06 GMT"}], "update_date": "2018-04-06", "authors_parsed": [["Bouvrais", "Hélène", ""], ["Chesneau", "Laurent", ""], ["Pastezeur", "Sylvain", ""], ["Delattre", "Marie", ""], ["Pécréaux", "Jacques", ""]]}, {"id": "1702.02076", "submitter": "Gao-De Li Dr", "authors": "Gao-De Li", "title": "Cell-Cycle-Associated Amplified Genomic-DNA Fragments (CAGFs) Might Be\n  Involved in Chloroquine Action and Resistance in Plasmodium falciparum", "comments": "11 pages, 1 figure, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As a cheap and safe antimalarial agent, chloroquine (CQ) has been used in the\nbattle against malaria for more than half century. However, the mechanism of CQ\naction and resistance in Plasmodium falciparum remains elusive. Based on\nfurther analysis of our published experimental results, we propose that the\nmechanism of CQ action and resistance might be closely linked with\ncell-cycle-associated amplified genomic-DNA fragments (CAGFs, singular form =\nCAGF) as CQ induces CAGF production in P. falciparum, which could affect\nmultiple biological processes of the parasite, and thus might contribute to\nparasite death and CQ resistance. Recently, we found that CQ induced one of\nCAGFs, UB1- CAGF, might downregulate a probable P. falciparum cystine\ntransporter (Pfct) gene expression, which could be used to understand the\nmechanism of CQ action and resistance in P. falciparum.\n", "versions": [{"version": "v1", "created": "Tue, 7 Feb 2017 16:07:49 GMT"}, {"version": "v2", "created": "Tue, 21 Feb 2017 18:37:03 GMT"}, {"version": "v3", "created": "Thu, 2 Mar 2017 16:00:53 GMT"}, {"version": "v4", "created": "Sun, 5 Mar 2017 23:37:29 GMT"}, {"version": "v5", "created": "Wed, 15 Mar 2017 00:43:17 GMT"}, {"version": "v6", "created": "Sun, 16 Jul 2017 20:44:34 GMT"}, {"version": "v7", "created": "Mon, 29 Jan 2018 08:58:58 GMT"}], "update_date": "2018-01-30", "authors_parsed": [["Li", "Gao-De", ""]]}, {"id": "1702.07372", "submitter": "Jean-Charles Walter", "authors": "Jean-Charles Walter, J\\'er\\^ome Dorignac, Vladimir Lorman, J\\'er\\^ome\n  Rech, Jean-Yves Bouet, Marcelo Nollmann, John Palmeri, Andrea Parmeggiani,\n  Fr\\'ed\\'eric Geniet", "title": "Surfing on protein waves: proteophoresis as a mechanism for bacterial\n  genome partitioning", "comments": "6 pages, 3 figures", "journal-ref": "Physical Review Letters Vol.119, 028101 (2017)", "doi": "10.1103/PhysRevLett.119.028101", "report-no": null, "categories": "q-bio.SC cond-mat.soft nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Efficient bacterial chromosome segregation typically requires the coordinated\naction of a three-components, fueled by adenosine triphosphate machinery called\nthe partition complex. We present a phenomenological model accounting for the\ndynamic activity of this system. The model is obtained by coupling simple\nlinear reaction-diffusion equations with a proteophoresis, or \"volumetric\"\nchemophoresis, force field. This minimal description, in the sense of Occam's\nRazor principle, captures most known experimental observations: dynamic\noscillations of complex components, complex separation and subsequent\nsymmetrical positioning. The predictions of our model are in phenomenological\nagreement with and provide substantial insights into recent experiments. From a\nnon-linear physics view point, this system explores the active separation of\nmatter at micrometric scales with a dynamical instability between static\npositioning and travelling wave regimes.\n", "versions": [{"version": "v1", "created": "Thu, 23 Feb 2017 19:36:07 GMT"}, {"version": "v2", "created": "Wed, 19 Jul 2017 09:21:00 GMT"}], "update_date": "2017-07-20", "authors_parsed": [["Walter", "Jean-Charles", ""], ["Dorignac", "Jérôme", ""], ["Lorman", "Vladimir", ""], ["Rech", "Jérôme", ""], ["Bouet", "Jean-Yves", ""], ["Nollmann", "Marcelo", ""], ["Palmeri", "John", ""], ["Parmeggiani", "Andrea", ""], ["Geniet", "Frédéric", ""]]}, {"id": "1702.07460", "submitter": "Tal Einav", "authors": "Manuel Razo-Mejia, Stephanie L. Barnes, Nathan M. Belliveau, Griffin\n  Chure, Tal Einav, Mitchell Lewis, Rob Phillips", "title": "Tuning transcriptional regulation through signaling: A predictive theory\n  of allosteric induction", "comments": "Substantial revisions for resubmission (3 new figures, significantly\n  elaborated discussion); added Professor Mitchell Lewis as another author for\n  his continuing contributions to the project", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Allosteric regulation is found across all domains of life, yet we still lack\nsimple, predictive theories that directly link the experimentally tunable\nparameters of a system to its input-output response. To that end, we present a\ngeneral theory of allosteric transcriptional regulation using the\nMonod-Wyman-Changeux model. We rigorously test this model using the ubiquitous\nsimple repression motif in bacteria by first predicting the behavior of strains\nthat span a large range of repressor copy numbers and DNA binding strengths and\nthen constructing and measuring their response. Our model not only accurately\ncaptures the induction profiles of these strains but also enables us to derive\nanalytic expressions for key properties such as the dynamic range and\n$[EC_{50}]$. Finally, we derive an expression for the free energy of allosteric\nrepressors which enables us to collapse our experimental data onto a single\nmaster curve that captures the diverse phenomenology of the induction profiles.\n", "versions": [{"version": "v1", "created": "Fri, 24 Feb 2017 04:12:20 GMT"}, {"version": "v2", "created": "Wed, 21 Jun 2017 21:32:21 GMT"}], "update_date": "2017-06-23", "authors_parsed": [["Razo-Mejia", "Manuel", ""], ["Barnes", "Stephanie L.", ""], ["Belliveau", "Nathan M.", ""], ["Chure", "Griffin", ""], ["Einav", "Tal", ""], ["Lewis", "Mitchell", ""], ["Phillips", "Rob", ""]]}, {"id": "1702.08682", "submitter": "Deepak Bhat", "authors": "Deepak Bhat and Manoj Gopalakrishnan", "title": "Stall force of a cargo driven by N interacting motor proteins", "comments": "Accepted in Europhysics Letters", "journal-ref": null, "doi": "10.1209/0295-5075/117/28004", "report-no": null, "categories": "physics.bio-ph cond-mat.soft cond-mat.stat-mech q-bio.QM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a generic one-dimensional model for an intracellular cargo driven by\nN motor proteins against an external applied force. The model includes\nmotor-cargo and motor-motor interactions. The cargo motion is described by an\nover-damped Langevin equation, while motor dynamics is specified by hopping\nrates which follow a local detailed balance condition with respect to change in\nenergy per hopping event. Based on this model, we show that the stall force,\nthe mean external force corresponding to zero mean cargo velocity, is\ncompletely independent of the details of the interactions and is, therefore,\nalways equal to the sum of the stall forces of the individual motors. This\nexact result is arrived on the basis of a simple assumption: the (macroscopic)\nstate of stall of the cargo is analogous to a state of thermodynamic\nequilibrium, and is characterized by vanishing net probability current between\nany two microstates, with the latter specified by motor positions relative to\nthe cargo. The corresponding probability distribution of the microstates under\nstall is also determined. These predictions are in complete agreement with\nnumerical simulations, carried out using specific forms of interaction\npotentials.\n", "versions": [{"version": "v1", "created": "Tue, 28 Feb 2017 07:57:58 GMT"}], "update_date": "2017-04-05", "authors_parsed": [["Bhat", "Deepak", ""], ["Gopalakrishnan", "Manoj", ""]]}]