[{"id": "1803.01674", "submitter": "Simon Girel", "authors": "Simon Girel (DRACULA, ICJ), Fabien Crauste (DRACULA, ICJ)", "title": "Existence and stability of periodic solutions of an impulsive\n  differential equation and application to CD8 T-cell differentiation", "comments": null, "journal-ref": "Journal of Mathematical Biology, Springer Verlag (Germany), 2018,\n  pp.1-32", "doi": null, "report-no": null, "categories": "math.DS q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unequal partitioning of the molecular content at cell division has been shown\nto be a source of heterogeneity in a cell population. We propose to model this\nphenomenon with the help of a scalar, nonlinear impulsive differential equation\n(IDE). In a first part, we consider a general autonomous IDE with fixed times\nof impulse and a specific form of impulse function. We establish properties of\nthe solutions of that equation, most of them obtained under the hypothesis that\nimpulses occur periodically. In particular, we show how to investigate the\nexistence of periodic solutions and their stability by studying the flow of an\nautonomous differential equation. A second part is dedicated to the analysis of\nthe convexity of this flow. Finally, we apply those results to an IDE\ndescribing the concentration of the protein Tbet in a CD8 T-cell, where\nimpulses are associated to cell division, to study the effect of molecular\npartitioning at cell division on the effector/memory cell-fate decision in a\nCD8 T-cell lineage. We show that the degree of asymmetry in the molecular\npartitioning can affect the process of cell differentiation and the\nphenotypical heterogeneity of a cell population.\n", "versions": [{"version": "v1", "created": "Mon, 5 Mar 2018 14:22:44 GMT"}], "update_date": "2018-03-06", "authors_parsed": [["Girel", "Simon", "", "DRACULA, ICJ"], ["Crauste", "Fabien", "", "DRACULA, ICJ"]]}, {"id": "1803.02585", "submitter": "Masaki Sasai", "authors": "Sumita Das, Tomoki P. Terada, Masaki Sasai", "title": "Single-molecular and Ensemble-level Oscillations of Cyanobacterial\n  Circadian Clock", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.dis-nn q-bio.SC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  When three cyanobacterial proteins, KaiA, KaiB, and KaiC, are incubated with\nATP in vitro, the phosphorylation level of KaiC hexamers shows stable\noscillation with approximately 24 h period. In order to understand this KaiABC\nclockwork, we need to analyze both the macroscopic synchronization of a large\nnumber of KaiC hexamers and the microscopic reactions and structural changes in\nindividual KaiC molecules. In the present paper, we explain two coarse-grained\ntheoretical models, the many-molecule (MM) model and the single-molecule (SM)\nmodel, to bridge the gap between macroscopic and microscopic understandings. In\nthe simulation results with these models, ATP hydrolysis drives oscillation of\nindividual KaiC hexamers and ATP hydrolysis is necessary for synchronizing\noscillations of a large number of KaiC hexamers. Sensitive temperature\ndependence of the lifetime of the ADP bound state in the CI domain of KaiC\nhexamers makes the oscillation period temperature insensitive. ATPase activity\nis correlated to the frequency of phosphorylation oscillation in the single\nmolecule of KaiC hexamer, which should be the origin of the observed\nensemble-level correlation between the ATPase activity and the frequency of\nphosphorylation oscillation. Thus, the simulation results with the MM and SM\nmodels suggest that ATP hydrolysis randomly occurring in each CI domain of\nindividual KaiC hexamers is a key process for oscillatory behaviors of the\nensemble of many KaiC hexamers.\n", "versions": [{"version": "v1", "created": "Wed, 7 Mar 2018 10:34:40 GMT"}], "update_date": "2018-03-08", "authors_parsed": [["Das", "Sumita", ""], ["Terada", "Tomoki P.", ""], ["Sasai", "Masaki", ""]]}, {"id": "1803.03942", "submitter": "Isabella Graf", "authors": "Mareike Bojer, Isabella R. Graf, Erwin Frey", "title": "Self-organized system-size oscillation of a stochastic lattice-gas model", "comments": "added references; changed style of figures; added some more\n  explanations; results unchanged", "journal-ref": "Phys. Rev. E 98, 012410 (2018)", "doi": "10.1103/PhysRevE.98.012410", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The totally asymmetric simple exclusion process (TASEP) is a paradigmatic\nstochastic model for non-equilibrium physics, and has been successfully applied\nto describe active transport of molecular motors along cytoskeletal filaments.\nBuilding on this simple model, we consider a two-lane lattice-gas model that\ncouples directed transport (TASEP) to diffusive motion in a semi-closed\ngeometry, and simultaneously accounts for spontaneous growth and\nparticle-induced shrinkage of the system's size. This particular extension of\nthe TASEP is motivated by the question of how active transport and diffusion\nmight influence length regulation in confined systems. Surprisingly, we find\nthat the size of our intrinsically stochastic system exhibits robust temporal\npatterns over a broad range of growth rates. More specifically, when particle\ndiffusion is slow relative to the shrinkage dynamics, we observe quasi-periodic\nchanges in length. We provide an intuitive explanation for the occurrence of\nthese self-organized temporal patterns, which is based on the imbalance between\nthe diffusion and shrinkage speed in the confined geometry. Finally, we\nformulate an effective theory for the oscillatory regime, which explains the\norigin of the oscillations and correctly predicts the dependence of key\nquantities, as for instance the oscillation frequency, on the growth rate.\n", "versions": [{"version": "v1", "created": "Sun, 11 Mar 2018 11:09:18 GMT"}, {"version": "v2", "created": "Thu, 29 Mar 2018 17:20:49 GMT"}, {"version": "v3", "created": "Wed, 20 Jun 2018 23:03:52 GMT"}], "update_date": "2018-07-25", "authors_parsed": [["Bojer", "Mareike", ""], ["Graf", "Isabella R.", ""], ["Frey", "Erwin", ""]]}, {"id": "1803.04391", "submitter": "Eugene Terentjev M.", "authors": "Samuel Bell, Anna-Lena Redmann, Eugene M. Terentjev", "title": "Universal kinetics for engagement of mechanosensing pathways in cell\n  adhesion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When plated onto substrates, cell morphology and even stem cell\ndifferentiation are influenced by the stiffness of their environment. Stiffer\nsubstrates give strongly spread (eventually polarized) cells with strong focal\nadhesions, and stress fibers; very soft substrates give a less developed\ncytoskeleton, and much lower cell spreading. The kinetics of this process of\ncell spreading is studied extensively, and important universal relationships\nare established on how the cell area grows with time. Here we study the\npopulation dynamics of spreading cells, investigating the characteristic\nprocesses involved in cell response to the substrate. We show that unlike the\nindividual cell morphology, this population dynamics does not depend on the\nsubstrate stiffness. Instead, a strong activation temperature dependence is\nobserved. Different cell lines on different substrates all have long-time\nstatistics controlled by the thermal activation over a single energy barrier\ndG=19 kcal/mol, while the early-time kinetics follows a power law $t^5$. This\nimplies that the rate of spreading depends on an internal process of\nadhesion-mechanosensing complex assembly and activation: the operational\ncomplex must have 5 component proteins, and the last process in the sequence\n(which we believe is the activation of focal adhesion kinase) is controlled by\nthe binding energy dG.\n", "versions": [{"version": "v1", "created": "Mon, 12 Mar 2018 17:40:04 GMT"}, {"version": "v2", "created": "Tue, 13 Mar 2018 02:34:02 GMT"}, {"version": "v3", "created": "Thu, 4 Oct 2018 16:44:46 GMT"}], "update_date": "2018-10-05", "authors_parsed": [["Bell", "Samuel", ""], ["Redmann", "Anna-Lena", ""], ["Terentjev", "Eugene M.", ""]]}, {"id": "1803.04498", "submitter": "\\'Elie Besserer-Offroy", "authors": "\\'Elie Besserer-Offroy, Rebecca L Brouillette, Sandrine Lavenus,\n  Ulrike Froehlich, Andrea Brumwell, Alexandre Murza, Jean-Michel Longpr\\'e,\n  \\'Eric Marsault, Michel Grandbois, Philippe Sarret, and Richard Leduc", "title": "The signaling signature of the neurotensin type 1 receptor with\n  endogenous ligands", "comments": "This is the accepted (postprint) version of the following article:\n  Besserer-Offroy \\'E, et al. (2017). Eur J Pharmacol. doi:\n  10.1016/j.ejphar.2017.03.046, which has been accepted and published in its\n  final form at\n  http://www.sciencedirect.com/science/article/pii/S0014299917302157 V1:\n  Preprint version V2: Accepted version (postprint)", "journal-ref": "Besserer-Offroy \\'E, et al. (2017). Eur J Pharmacol. 805 (2017)\n  1-13", "doi": "10.1016/j.ejphar.2017.03.046", "report-no": null, "categories": "q-bio.CB q-bio.MN q-bio.SC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The human neurotensin 1 receptor (hNTS1) is a G protein-coupled receptor\ninvolved in many physiological functions, including analgesia, hypothermia, and\nhypotension. To gain a better understanding of which signaling pathways or\ncombination of pathways are linked to NTS1 activation and function, we\ninvestigated the ability of activated hNTS1, which was stably expressed by\nCHO-K1 cells, to directly engage G proteins, activate second messenger cascades\nand recruit \\b{eta}-arrestins. Using BRET-based biosensors, we found that\nneurotensin (NT), NT(8-13) and neuromedin N (NN) activated the G{\\alpha}q-,\nG{\\alpha}i1-, G{\\alpha}oA-, and G{\\alpha}13-protein signaling pathways as well\nas the recruitment of \\b{eta}-arrestins 1 and 2. Using pharmacological\ninhibitors, we further demonstrated that all three ligands stimulated the\nproduction of inositol phosphate and modulation of cAMP accumulation along with\nERK1/2 activation. Interestingly, despite the functional coupling to\nG{\\alpha}i1 and G{\\alpha}oA, NT was found to produce higher levels of cAMP in\nthe presence of pertussis toxin, supporting that hNTS1 activation leads to cAMP\naccumulation in a G{\\alpha}s-dependent manner. Additionally, we demonstrated\nthat the full activation of ERK1/2 required signaling through both a\nPTX-sensitive Gi/o-c-Src signaling pathway and PLCb-DAG-PKC-Raf-1- dependent\npathway downstream of Gq. Finally, the whole-cell integrated signatures\nmonitored by the cell-based surface plasmon resonance and changes in the\nelectrical impedance of a confluent cell monolayer led to identical phenotypic\nresponses between the three ligands. The characterization of the hNTS1-mediated\ncellular signaling network will be helpful to accelerate the validation of\npotential NTS1 biased ligands with an improved therapeutic/adverse effect\nprofile.\n", "versions": [{"version": "v1", "created": "Mon, 12 Mar 2018 19:59:18 GMT"}, {"version": "v2", "created": "Wed, 14 Mar 2018 00:45:57 GMT"}], "update_date": "2018-03-15", "authors_parsed": [["Besserer-Offroy", "Élie", ""], ["Brouillette", "Rebecca L", ""], ["Lavenus", "Sandrine", ""], ["Froehlich", "Ulrike", ""], ["Brumwell", "Andrea", ""], ["Murza", "Alexandre", ""], ["Longpré", "Jean-Michel", ""], ["Marsault", "Éric", ""], ["Grandbois", "Michel", ""], ["Sarret", "Philippe", ""], ["Leduc", "Richard", ""]]}, {"id": "1803.05870", "submitter": "Anne-Florence Bitbol", "authors": "Miglena I. Angelova, Anne-Florence Bitbol, Michel Seigneuret, Galya\n  Staneva, Atsuji Kodama, Yuka Sakuma, Toshihiro Kawakatsu, Masayuki Imai and\n  Nicolas Puff", "title": "pH Sensing by Lipids in Membranes: The Fundamentals of pH-driven\n  Migration, Polarization and Deformations of Lipid Bilayer Assemblies", "comments": "26 pages, 22 figures, review article", "journal-ref": "Biochim. Biophys. Acta - Biomembr. 1860 (10): 2042-2063 (2018)", "doi": "10.1016/j.bbamem.2018.02.026", "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most biological molecules contain acido-basic groups that modulate their\nstructure and interactions. A consequence is that pH gradients, local\nheterogeneities and dynamic variations are used by cells and organisms to drive\nor regulate specific biological functions including energetic metabolism,\nvesicular traffic, migration and spatial patterning of tissues in development.\nWhile the direct or regulatory role of pH in protein function is well\ndocumented, the role of hydrogen and hydroxyl ions in modulating the properties\nof lipid assemblies such as bilayer membranes is only beginning to be\nunderstood. Here, we review approaches using artificial lipid vesicles that\nhave been instrumental in providing an understanding of the influence of pH\ngradients and local variations on membrane vectorial motional processes:\nmigration, membrane curvature effects promoting global or local deformations,\ncrowding generation by segregative polarization processes. In the case of pH\ninduced local deformations, an extensive theoretical framework is given and an\napplication to a specific biological issue, namely the structure and stability\nof mitochondrial cristae, is described.\n", "versions": [{"version": "v1", "created": "Thu, 15 Mar 2018 17:07:51 GMT"}], "update_date": "2018-10-24", "authors_parsed": [["Angelova", "Miglena I.", ""], ["Bitbol", "Anne-Florence", ""], ["Seigneuret", "Michel", ""], ["Staneva", "Galya", ""], ["Kodama", "Atsuji", ""], ["Sakuma", "Yuka", ""], ["Kawakatsu", "Toshihiro", ""], ["Imai", "Masayuki", ""], ["Puff", "Nicolas", ""]]}, {"id": "1803.06013", "submitter": "Wylie Ahmed", "authors": "Danielle Posey, Paris Blaisdell-Pijuan, Samantha K. Knoll, Taher A.\n  Saif, and Wylie W. Ahmed", "title": "Small-scale displacement fluctuations of vesicles in fibroblasts", "comments": "10 pages, 5 figures, 3 tables", "journal-ref": null, "doi": "10.1038/s41598-018-31656-3", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The intracellular environment is a dynamic space filled with various\norganelles moving in all directions. Included in this diverse group of\norganelles are vesicles, which are involved in transport of molecular cargo\nthroughout the cell. Vesicles move in either a directed or non-directed\nfashion, often depending on interactions with cytoskeletal proteins such as\nmicrotubules, actin filaments, and molecular motors. How these proteins affect\nthe local fluctuations of vesicles in the cytoplasm is not clear since they\nhave the potential to both facilitate and impede movement. Here we show that\nvesicle mobility is significantly affected by myosin-II, even though it is not\na cargo transport motor. We find that myosin-II activity increases the\neffective diffusivity of vesicles and its inhibition facilitates longer states\nof non-directed motion. Our study suggests that altering myosin-II activity in\nthe cytoplasm of cells can modulate the mobility of vesicles, providing a\npossible mechanism for cells to dynamically tune the cytoplasmic environment in\nspace and time.\n", "versions": [{"version": "v1", "created": "Thu, 15 Mar 2018 21:50:12 GMT"}, {"version": "v2", "created": "Thu, 5 Apr 2018 22:26:43 GMT"}, {"version": "v3", "created": "Thu, 16 Aug 2018 18:55:04 GMT"}], "update_date": "2018-09-07", "authors_parsed": [["Posey", "Danielle", ""], ["Blaisdell-Pijuan", "Paris", ""], ["Knoll", "Samantha K.", ""], ["Saif", "Taher A.", ""], ["Ahmed", "Wylie W.", ""]]}, {"id": "1803.07312", "submitter": "Simon Pearce", "authors": "Simon P Pearce and Matthias Heil and Oliver E Jensen and Gareth W\n  Jones and Andreas Prokop", "title": "Curvature-sensitive kinesin binding can explain microtubule ring\n  formation and reveals chaotic dynamics in a mathematical model", "comments": "24 pages, 6 figures. Accepted for publication in the Bulletin of\n  Mathematical Biology", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC nlin.CD", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Microtubules are filamentous tubular protein polymers which are essential for\na range of cellular behaviour, and are generally straight over micron length\nscales. However, in some gliding assays, where microtubules move over a carpet\nof molecular motors, individual microtubules can also form tight arcs or rings,\neven in the absence of crosslinking proteins. Understanding this phenomenon may\nprovide important explanations for similar highly curved microtubules which can\nbe found in nerve cells undergoing neurodegeneration. We propose a model for\ngliding assays where the kinesins moving the microtubules over the surface\ninduce ring formation through differential binding, substantiated by recent\nfindings that a mutant version of the motor protein kinesin applied in solution\nis able to lock-in microtubule curvature. For certain parameter regimes, our\nmodel predicts that both straight and curved microtubules can exist\nsimultaneously as stable steady-states, as has been seen experimentally.\nAdditionally, unsteady solutions are found, where a wave of differential\nbinding propagates down the microtubule as it glides across the surface, which\ncan lead to chaotic motion. Whilst this model explains two-dimensional\nmicrotubule behaviour in an experimental gliding assay, it has the potential to\nbe adapted to explain pathological curling in nerve cells.\n", "versions": [{"version": "v1", "created": "Tue, 20 Mar 2018 09:10:15 GMT"}, {"version": "v2", "created": "Wed, 1 Aug 2018 12:07:14 GMT"}], "update_date": "2018-08-02", "authors_parsed": [["Pearce", "Simon P", ""], ["Heil", "Matthias", ""], ["Jensen", "Oliver E", ""], ["Jones", "Gareth W", ""], ["Prokop", "Andreas", ""]]}, {"id": "1803.08110", "submitter": "Luca Ciandrini", "authors": "Lucas D. Fernandes and Luca Ciandrini", "title": "Driven transport on a flexible polymer with particle recycling: a model\n  inspired by transcription and translation", "comments": "Grayscale friendly figures", "journal-ref": "Phys. Rev. E 99, 052409 (2019)", "doi": "10.1103/PhysRevE.99.052409", "report-no": null, "categories": "cond-mat.stat-mech cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many theoretical works have attempted to coarse grain gene expression at the\nlevel of transcription and translation via frameworks based on exclusion\nprocesses. Usually in these models the three-dimensional conformation of the\nsubstrates (DNA and mRNA) is neglected, and particles move on a static\nunidimensional lattice in contact to an infinite reservoir. In this work we\ngeneralise the paradigmatic exclusion process and study the transport of\nparticles along a unidimensional polymer-like flexible lattice immersed in a\nthree-dimensional particle reservoir. We study the recycling of particles in\nthe reservoir, how the transport is influenced by the global conformation of\nthe lattice and, in turn, how particle density dictates the structure of the\npolymer.\n", "versions": [{"version": "v1", "created": "Wed, 21 Mar 2018 20:02:28 GMT"}, {"version": "v2", "created": "Fri, 23 Mar 2018 08:37:25 GMT"}, {"version": "v3", "created": "Sat, 26 Jan 2019 16:27:34 GMT"}, {"version": "v4", "created": "Sat, 4 May 2019 12:49:46 GMT"}], "update_date": "2019-05-22", "authors_parsed": [["Fernandes", "Lucas D.", ""], ["Ciandrini", "Luca", ""]]}, {"id": "1803.09598", "submitter": "Jaime Agudo-Canalejo", "authors": "Jaime Agudo-Canalejo, Roland L. Knorr", "title": "Formation of autophagosomes coincides with relaxation of membrane\n  curvature", "comments": "Book chapter, 13 pages, 5 figures", "journal-ref": "N. Ktistakis and O. Florey (eds.), Autophagy: Methods and\n  Protocols, Methods in Molecular Biology, vol. 1880, 2019", "doi": "10.1007/978-1-4939-8873-0_10", "report-no": null, "categories": "q-bio.SC cond-mat.soft", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Autophagy is an intracellular degradation process that employs complex\nmembrane dynamics to isolate and break down cellular components. However, many\nunanswered questions remain concerning remodeling of autophagic membranes.\nHere, we focus on the advantages of theoretical modelling to study the\nformation of autophagosomes and to understand the origin of autophagosomal\nmembranes. Starting from the well-defined geometry of final autophagosomes we\nask the question of how these organelles can be formed by combining various\npreautophagosomal membranes such as vesicles, membrane tubules or sheets. We\nanalyse the geometric constraints of autophagosome formation by taking the area\nof the precursor membranes and their internal volume into account. Our results\nsuggest that vesicle fusion contributes little to the formation of\nautophagosomes. In the second part we quantify the curvature of the precursors\nand report that the formation of autophagosomes is associated with a strong\nrelaxation of membrane curvature energy. This effect we find for a wide range\nof membrane asymmetries. It is especially strong for small distances between\nboth autophagosomal membranes, as observed in vivo. We quantify the membrane\nbending energies of all precursors by considering membrane asymmetries. We\npropose that the generation and supply of pre-autophagosomal membranes is one\nlimiting step for autophagosome formation.\n", "versions": [{"version": "v1", "created": "Mon, 26 Mar 2018 14:07:57 GMT"}], "update_date": "2019-03-25", "authors_parsed": [["Agudo-Canalejo", "Jaime", ""], ["Knorr", "Roland L.", ""]]}, {"id": "1803.10579", "submitter": "Alan D. Rendall", "authors": "Pia Brechmann, Alan D. Rendall", "title": "Dynamics of the Selkov oscillator", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC math.DS physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A classical example of a mathematical model for oscillations in a biological\nsystem is the Selkov oscillator, which is a simple description of glycolysis.\nIt is a system of two ordinary differential equations which, when expressed in\ndimensionless variables, depends on two parameters. Surprisingly it appears\nthat no complete rigorous analysis of the dynamics of this model has ever been\ngiven. In this paper several properties of the dynamics of solutions of the\nmodel are established. With a view to studying unbounded solutions a thorough\nanalysis of the Poincar\\'e compactification of the system is given. It is\nproved that for any values of the parameters there are solutions which tend to\ninfinity at late times and are eventually monotone. It is shown that when the\nunique steady state is stable any bounded solution converges to the steady\nstate at late times. When the steady state is unstable it is shown that for\ngiven values of the parameters either there is a unique periodic solution to\nwhich all bounded solutions other than the steady state converge at late times\nor there is no periodic solution and all solutions other than the steady state\nare unbounded. In the latter case each unbounded solution which tends to\ninfinity is eventually monotone and each unbounded solution which does not tend\nto infinity has the property that each variable takes on arbitrarily large and\nsmall values at arbitrarily late times.\n", "versions": [{"version": "v1", "created": "Wed, 28 Mar 2018 13:17:09 GMT"}], "update_date": "2018-03-29", "authors_parsed": [["Brechmann", "Pia", ""], ["Rendall", "Alan D.", ""]]}]