[{"id": "1807.00977", "submitter": "Thiruvalllur Gowrishankar", "authors": "Thiruvallur R. Gowrishankar, Julie V. Stern, Kyle C. Smith and James\n  C. Weaver", "title": "Nanopore occlusion: A biophysical mechanism for bipolar cancellation in\n  cell membranes", "comments": "12 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Extraordinarily large but short electric field pulses are reported by many\nexperiments to cause bipolar cancellation (BPC). This unusual cell response\noccurs if a first pulse is followed by a second pulse with opposite polarity.\nPossibly universal, BPC presently lacks a mechanistic explanation. Multiple\nversions of the \"standard model\" of cell electroporation (EP) fail to account\nfor BPC. Here we show, for the first time, how an extension of the standard\nmodel can account for a key experimental observation that essentially defines\nBPC: the amount of a tracer that enters a cell, and how tracer influx can be\ndecreased by the second part of a bipolar pulse. The extended model can also\naccount for the recovery of BPC wherein the extent of BPC is diminished if the\nspacing between the first and second pulses is increased. Our approach is\nreverse engineering, meaning that we identify and introduce an additional\nbiophysical mechanism that allows pore transport to change. We hypothesize that\noccluding molecules from outside the membrane enter or relocate within a pore.\nSignificantly, the additional mechanism is fundamental and general, involving a\ncombination of partitioning and hindrance. Molecules near the membrane can\nenter pores to block transport of tracer molecules while still passing small\nions (+/- 1) that govern electrical behavior. Accounting for such behavior\nrequires an extension of the standard model.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 05:01:52 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Gowrishankar", "Thiruvallur R.", ""], ["Stern", "Julie V.", ""], ["Smith", "Kyle C.", ""], ["Weaver", "James C.", ""]]}, {"id": "1807.01243", "submitter": "Sitabhra Sinha", "authors": "Tanmay Mitra, Shakti N. Menon and Sitabhra Sinha", "title": "Non-associative learning in intra-cellular signaling networks", "comments": "6 pages, 2 figures + 5 pages supplementary information", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC nlin.AO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nonlinear systems driven by recurrent signals are known to exhibit complex\ndynamical responses which, in the physiological context, can have important\nfunctional consequences. One of the simplest biological systems that is exposed\nto such repeated stimuli is the intra-cellular signaling network. In this paper\nwe investigate the periodic activation of an evolutionarily conserved motif of\nthis network, viz., the mitogen-activated protein kinase (MAPK) signaling\ncascade, with a train of pulses. The resulting response of the cascade, which\nshows integrative capability over several successive pulses, is characterized\nby complex adaptive behavior. These include aspects of non-associative\nlearning, in particular, habituation and sensitization, which are observed in\nresponse to high- and low-frequency stimulation, respectively. In addition, the\nexistence of a response threshold of the cascade, an apparent refractory\nbehavior following stimulation with short inter-pulse interval, and an\nalternans-like response under certain conditions suggest an analogy with\nexcitable media.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2018 15:41:45 GMT"}], "update_date": "2018-07-04", "authors_parsed": [["Mitra", "Tanmay", ""], ["Menon", "Shakti N.", ""], ["Sinha", "Sitabhra", ""]]}, {"id": "1807.01768", "submitter": "Anna Maltsev", "authors": "Anna Maltsev, Michael Stern, Victor Maltsev", "title": "Mechanisms of Calcium Leak from Cardiac Sarcoplasmic Reticulum Revealed\n  by Statistical Mechanics", "comments": "20 pages, 6 figures, supplemental material", "journal-ref": null, "doi": "10.1016/j.bpj.2019.04.031", "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heart muscle contraction is normally activated by a synchronized Ca release\nfrom sarcoplasmic reticulum (SR), a major intracellular Ca store. However,\nunder abnormal conditions Ca leaks from the SR, decreasing heart contraction\namplitude and increasing risk of life-threatening arrhythmia. The mechanisms\nand regimes of SR operation generating the abnormal Ca leak remain unclear.\nHere we employed both numerical and analytical modeling to get mechanistic\ninsights into the emergent Ca leak phenomenon. Our numerical simulations using\na detailed realistic model of Ca release unit (CRU) reveal sharp transitions\nresulting in Ca leak. The emergence of leak is closely mapped mathematically to\nthe Ising model from statistical mechanics. The system steady-state behavior is\ndetermined by two aggregate parameters: the analogues of magnetic field ($h$)\nand the inverse temperature ($\\beta$) in the Ising model, for which we have\nexplicit formulas in terms of SR Ca and release channel opening/closing rates.\nThe classification of leak regimes takes the shape of a phase $\\beta$-$h$\ndiagram, with the regime boundaries occurring at $h$=0 and a critical value of\n$\\beta$ ($\\beta*$) which we estimate using a classical Ising model and mean\nfield theory. Our theory predicts that a synchronized Ca leak will occur when\n$h$>0 and $\\beta>\\beta*$ and a disordered leak occurs when $\\beta<\\beta*$ and\n$h$ is not too negative. The disorder leak is distinguished from synchronized\nleak (in long-lasting sparks) by larger Peierls contour lengths, an output\nparameter reflecting degree of disorder. Thus, in addition to our detailed\nnumerical model approach we also offer an instantaneous computational tool\nusing analytical formulas of the Ising model for respective RyR parameters and\nSR Ca load that describe and classify phase transitions and leak emergence.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jul 2018 20:47:43 GMT"}, {"version": "v2", "created": "Sun, 12 May 2019 17:53:52 GMT"}], "update_date": "2019-05-14", "authors_parsed": [["Maltsev", "Anna", ""], ["Stern", "Michael", ""], ["Maltsev", "Victor", ""]]}, {"id": "1807.02771", "submitter": "Rami Pugatch", "authors": "Rami Pugatch and Yinon M. Bar-on", "title": "Ribosome self-assembly leads to overlapping reproduction cycles and\n  increases growth rate", "comments": "7 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In permissive environments, E. coli can double its dry mass every 21 minutes.\nDuring this time, ribosomes, RNA polymerases, and the proteome are all doubled.\nYet, the question of how to relate bacterial doubling time to other\nbiologically relevant time scales in the growth process remains illusive, due\nto the complex temporal nesting pattern of these processes. In particular, the\nrelation between the cell's doubling time and the ribosome assembly time is not\nknown. Here we develop a model that connects growth rate to ribosome assembly\ntime and show that the existence of a self-assembly step increases the overall\ngrowth rate, because during ribosome self-assembly existing ribosomes can start\na new round of reproduction, by making a new batch of ribosomal proteins prior\nto the completion of the previous round. This overlapping of ribosome\nreproduction cycles increases growth rate beyond the serial-limit that is\ntypically assumed to hold. Using recent data from ribosome profiling and well\nknown measurements of the average translation rate, rigid bounds on the in-vivo\nribosome self-assembly time are set, which are robust to the assumptions\nregarding the biological noises involved. At 21 minutes doubling time, the\nribosome assembly time is found to be approximately 6 minutes --- three fold\nlarger than the common estimate. We further use our model to explain the\ndetrimental effect of a recently discovered ribosome assembly inhibitor drug,\nand predict the effect of limiting the expression of ribosome assembly\nchaperons on the overall growth rate.\n", "versions": [{"version": "v1", "created": "Sun, 8 Jul 2018 07:35:19 GMT"}, {"version": "v2", "created": "Tue, 24 Jul 2018 00:42:06 GMT"}], "update_date": "2018-07-25", "authors_parsed": [["Pugatch", "Rami", ""], ["Bar-on", "Yinon M.", ""]]}, {"id": "1807.04799", "submitter": "Karsten Kruse", "authors": "Frederic Folz, Lukas Wettmann, Giovanna Morigi, Karsten Kruse", "title": "The sound of an axon's growth", "comments": "5 pages, 4 figures", "journal-ref": "Phys. Rev. E 99, 050401 (2019)", "doi": "10.1103/PhysRevE.99.050401", "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Axons are linear processes of nerve cells that can range from a few tens of\nmicrometers up to meters in length. In addition to external cues, the length of\nan axon is also regulated by unknown internal mechanisms. Molecular motors have\nbeen suggested to generate oscillations with an axon length-dependent frequency\nthat could be used to measure an axon's extension. Here, we present a mechanism\nthat depends on the spectral decomposition of the oscillatory signal to\ndetermine the axon length.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jul 2018 19:36:50 GMT"}, {"version": "v2", "created": "Fri, 2 Nov 2018 09:36:50 GMT"}, {"version": "v3", "created": "Wed, 17 Apr 2019 07:52:08 GMT"}], "update_date": "2019-05-15", "authors_parsed": [["Folz", "Frederic", ""], ["Wettmann", "Lukas", ""], ["Morigi", "Giovanna", ""], ["Kruse", "Karsten", ""]]}, {"id": "1807.08719", "submitter": "Edvin Memet", "authors": "Edvin Memet, Feodor Hilitski, Margaret A Morris, Walter J Schwenger,\n  Zvonimir Dogic, L Mahadevan", "title": "Microtubules soften due to cross-sectional flattening", "comments": null, "journal-ref": "eLife 2018;7:e34695", "doi": "10.7554/eLife.34695", "report-no": null, "categories": "physics.bio-ph q-bio.BM q-bio.QM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use optical trapping to continuously bend an isolated microtubule while\nsimultaneously measuring the applied force and the resulting filament strain,\nthus allowing us to determine its elastic properties over a wide range of\napplied strains. We find that, while in the low-strain regime, microtubules may\nbe quantitatively described in terms of the classical Euler-Bernoulli elastic\nfilament, above a critical strain they deviate from this simple elastic model,\nshowing a softening response with increasingdeformations. A three-dimensional\nthin-shell model, in which the increased mechanical compliance is caused by\nflattening and eventual buckling of the filament cross-section, captures this\nsoftening effect in the high strain regime and yields quantitative values of\nthe effective mechanical properties of microtubules. Our results demonstrate\nthat properties of microtubules are highly dependent on the magnitude of the\napplied strain and offer a new interpretation for the large variety in\nmicrotubule mechanical data measured by different methods.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jul 2018 17:00:57 GMT"}], "update_date": "2018-07-24", "authors_parsed": [["Memet", "Edvin", ""], ["Hilitski", "Feodor", ""], ["Morris", "Margaret A", ""], ["Schwenger", "Walter J", ""], ["Dogic", "Zvonimir", ""], ["Mahadevan", "L", ""]]}, {"id": "1807.10030", "submitter": "Trinh Xuan Hoang", "authors": "Phuong Thuy Bui and Trinh Xuan Hoang", "title": "Protein escape at the ribosomal exit tunnel: Effects of native\n  interactions, tunnel length and macromolecular crowding", "comments": null, "journal-ref": "Journal of Chemical Physics 149, 045102 (2018)", "doi": "10.1063/1.5033361", "report-no": null, "categories": "q-bio.BM cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How fast a post-translational nascent protein escapes from the ribosomal exit\ntunnel is relevant to its folding and protection against aggregation. Here, by\nusing Langevin molecular dynamics, we show that non-local native interactions\nhelp decreasing the escape time, and foldable proteins generally escape much\nfaster than same-length self-repulsive homopolymers at low temperatures. The\nescape process, however, is slowed down by the local interactions that\nstabilize the {\\alpha}-helices. The escape time is found to increase with both\nthe tunnel length and the concentration of macromolecular crowders outside the\ntunnel. We show that a simple diffusion model described by the Smoluchowski\nequation with an effective linear potential can be used to map out the escape\ntime distribution for various tunnel lengths and various crowder\nconcentrations. The consistency between the simulation data and the diffusion\nmodel however is found only for the tunnel length smaller than a cross-over\nlength of 90 {\\AA} to 110 {\\AA}, above which the escape time increases much\nfaster with the tunnel length. It is suggested that the length of ribosomal\nexit tunnel has been selected by evolution to facilitate both the efficient\nfolding and efficient escape of single domain proteins. We show that\nmacromolecular crowders lead to an increase of the escape time, and attractive\ncrowders are unfavorable for the folding of nascent polypeptide.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jul 2018 09:26:49 GMT"}], "update_date": "2018-07-27", "authors_parsed": [["Bui", "Phuong Thuy", ""], ["Hoang", "Trinh Xuan", ""]]}, {"id": "1807.10137", "submitter": "Oleg  Gradov V.", "authors": "O.V. Gradov, P.A. Nasirov, A.A. Scrynnic, A.G. Jablokov", "title": "A simple device for microinjections, manipulations and measurements\n  using an electromorphological chip under microinterferometric control of the\n  interface and membrane processes at the thickness range of 5-1000 nm at\n  different angles", "comments": "in Russian", "journal-ref": "Morphologia, Vol. 11, Issue 4, pp. 7-17 (2017)", "doi": "10.26641/1997-9665.2017.4.7-17", "report-no": null, "categories": "q-bio.SC cond-mat.soft q-bio.CB q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Micromanipulations, perfusions and measurements performed using glass\nmicroelectrodes filled with an electrolyte is a conventional technique for\nexperimental morphological and membrane electrophysiological studies at a\nsingle cell and membrane surface level. The typical (effective) diameter of the\nend of the glass microelectrode is from 500 up to less than 100 nm, which\nprevents one from observing it using a standard optical microscope in\naccordance with the optical resolution criteria, since the diameter less than\n500 nm is indistinguishable within the interference zone. Microprocessor\nprogramming of the puller (microforge) that provides pulling and tearing allows\nto obtain in certain regimes the adjusted diameter and shape of the\nmicropipette tip, although this result is not fully controlled due to the above\nlimitations. In this connection it is necessary to design the control devices\nfor the micropipette tips both at the preparation and operation stages\n(intracellular or extracellular insertion). This method also should provide\nvisualization of the processes occurring upon interaction of the microelectrode\ntip with the cell in real time, depending on the electrode type and state,\nwhich allows to level the artifacts arising with the systematic error frequency\nfrom the uncontrolled operation of the micropipette tip after different ways of\nthe microelectrode filling with the electrolyte. We propose an installation\nscheme that solves the above problems by means of introducing an\ninterferometric device for microscopic control of the microelectrode and\nmicromanipulator or microperfusor, for the first time for a given type of\noptical instruments combined with the interferometric optical scheme.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jul 2018 12:35:57 GMT"}], "update_date": "2018-07-27", "authors_parsed": [["Gradov", "O. V.", ""], ["Nasirov", "P. A.", ""], ["Scrynnic", "A. A.", ""], ["Jablokov", "A. G.", ""]]}, {"id": "1807.10139", "submitter": "Oleg  Gradov V.", "authors": "Oleg V. Gradov, Margaret A. Gradova", "title": "Can graphene bilayers be the membrane mimetic materials? \"Ion channels\"\n  in graphene-based nanostructures", "comments": null, "journal-ref": "Radioelectronics. Nanosystems. Information Technologies,\n  8(2):154-170, 2016", "doi": "10.17725/rensit.2016.08.154 10.17725/rensit.2016.08.154", "report-no": null, "categories": "q-bio.SC cond-mat.soft", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The prospects of application of graphene and related structures as the\nmembrane mimetic materials, capable of reproducing several biomembrane\nfunctions up to the certain limit, are analyzed in the series of our papers.\nThis paper considers the possibility of the ion channel function modeling using\ngraphene and its derivatives. The physical mechanisms providing selective\npermeability for different membrane mimetic materials, as well as the limits of\nthe adequate simulation of the transport, catalytic, sensing and electrogenic\nproperties of the cell membrane ion channels using bilayered graphene-based\nstructures are discussed.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jul 2018 13:06:45 GMT"}], "update_date": "2018-07-27", "authors_parsed": [["Gradov", "Oleg V.", ""], ["Gradova", "Margaret A.", ""]]}, {"id": "1807.10642", "submitter": "Oleg  Gradov V.", "authors": "Oleg V. Gradov, Arthur G. Jablokov", "title": "Multiparametric qualimetric microsurgical scanning chip-lancet model:\n  theoretical metrological and biomedical considerations", "comments": null, "journal-ref": "MicroMedicine, 3(2):31-35, 2015", "doi": "10.6084/M9.FIGSHARE.1534467", "report-no": null, "categories": "q-bio.SC physics.chem-ph q-bio.BM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The construction of a novel surgical instrument is considered, which is also\na probing device providing a signal to the measuring equipment, which after its\ninterpretation allows to obtain useful information about the section quality\nand the biomaterial properties. We propose here some formalized considerations\non the possibility of its implementation for different variables registration.\nThe idea is also extrapolated into the field of micrurgy which refers to the\nmicroelectrode techniques and the local potential registration in situ.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jul 2018 13:12:45 GMT"}], "update_date": "2018-07-30", "authors_parsed": [["Gradov", "Oleg V.", ""], ["Jablokov", "Arthur G.", ""]]}, {"id": "1807.11090", "submitter": "Liam Sharp", "authors": "Liam Sharp, Reza Salari, Grace Brannigan", "title": "Boundary lipids of the nicotinic acetylcholine receptor: spontaneous\n  partitioning via coarse-grained molecular dynamics simulation", "comments": "15 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reconstituted nicotinic acetylcholine receptors (nAChRs) exhibit significant\ngain-of-function upon addition of cholesterol to reconstitution mixtures, and\ncholesterol affects organization of nAChRs within domain-forming membranes, but\nwhether nAChR partitions to cholesterol-rich liquid-ordered (\"raft\" or $l_o$)\ndomains or cholesterol-poor liquid-disordered ($l_{do}$) domains is unknown. We\nuse coarse-grained molecular dynamics simulations to observe spontaneous\ninteractions of cholesterol, saturated lipids, and polyunsaturated (PUFA)\nlipids with nAChRs. In binary Dipalmitoylphosphatidylcholine:Cholesterol\n(DPPC:CHOL) mixtures, both CHOL and DPPC acyl chains were observed\nspontaneously entering deep \"non-annular\" cavities in the nAChR TMD,\nparticularly at the subunit interface and the $\\beta$ subunit center,\nfacilitated by the low amino acid density in the cryo-EM structure of nAChR in\na native membrane. Cholesterol was highly enriched in the annulus around the\nTMD, but this effect extended over (at most) 5-10\\AA. In domain-forming ternary\nmixtures containing PUFAs, the presence of a single receptor did not\nsignificantly affect the likelihood of domain formation. nAChR partitioned to\nany cholesterol-poor $l_{do}$ domain that was present, regardless of whether\nthe $l_{do}$ or $l_o$ domain lipids had PC or PE headgroups. Enrichment of\nPUFAs among boundary lipids was positively correlated with their propensity for\ndemixing from cholesterol-rich phases. Long $n - 3$ chains (tested here with\nDocosahexaenoic Acid, DHA) were highly enriched in annular and non-annular\nembedded sites, partially displacing cholesterol and completely displacing\nDPPC, and occupying sites even deeper within the bundle. Shorter $n - 6$ chains\nwere far less effective at displacing cholesterol from non-annular sites.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jul 2018 17:48:59 GMT"}, {"version": "v2", "created": "Sun, 2 Dec 2018 19:52:04 GMT"}], "update_date": "2018-12-04", "authors_parsed": [["Sharp", "Liam", ""], ["Salari", "Reza", ""], ["Brannigan", "Grace", ""]]}, {"id": "1807.11101", "submitter": "Davide Michieletto", "authors": "Davide Coli, Davide Michieletto, Davide Marenduzzo and Enzo Orlandini", "title": "Magnetic Polymer Models for Epigenomic Organisation and Phase Separation", "comments": "main text + SI; Supplementary Movies can be found at\n  https://www2.ph.ed.ac.uk/~dmichiel/MP.html", "journal-ref": "Phys. Rev. Lett. 123, 228101 (2019)", "doi": "10.1103/PhysRevLett.123.228101", "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The genetic instructions stored in the genome require an additional layer of\ninformation to robustly determine cell fate. This additional regulation is\nprovided by the interplay between chromosome-patterning biochemical\n(\"epigenetic\") marks and three-dimensional genome folding. Yet, the physical\nprinciples underlying the dynamical coupling between three-dimensional genomic\norganisation and one-dimensional epigenetic patterns remain elusive. To shed\nlight on this issue, here we study by mean field theory and Brownian dynamics\nsimulations a magnetic polymer model for chromosomes, where each monomer\ncarries a dynamic epigenetic mark. At the single chromosome level, we show that\na first order transition describes the unlimited spreading of epigenetic marks,\na phenomenon that is often observed in vivo. At the level of the whole nucleus,\nexperiments suggest chromosomes form micro-phase separated compartments with\ndistinct epigenetic marks. We here discover that for a melt of magnetic\npolymers such a morphology is thermodynamically unstable, but can be stabilised\nby a non- equilibrium and ATP-mediated epigenetic switch between different\nmonomer states.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jul 2018 19:34:10 GMT"}], "update_date": "2019-12-04", "authors_parsed": [["Coli", "Davide", ""], ["Michieletto", "Davide", ""], ["Marenduzzo", "Davide", ""], ["Orlandini", "Enzo", ""]]}]