[{"id": "1903.05141", "submitter": "Michael Margaliot", "authors": "Eyal Bar-Shalom and Alexander Ovseevich and Michael Margaliot", "title": "Ribosome flow model with different site sizes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce and analyze two general dynamical models for unidirectional\nmovement of particles along a circular chain and an open chain of sites. The\nmodels include a soft version of the simple exclusion principle, that is, as\nthe density in a site increases the effective entry rate into this site\ndecreases. This allows to model and study the evolution of \"traffic jams\" of\nparticles along the chain. A unique feature of these two new models is that\neach site along the chain can have a different size.\n  Although the models are nonlinear, they are amenable to rigorous asymptotic\nanalysis. In particular, we show that the dynamics always converges to a\nsteady-state, and that the steady-state densities along the chain and the\nsteady-state output flow rate from the chain can be derived from the spectral\nproperties of a suitable matrix, thus eliminating the need to numerically\nsimulate the dynamics until convergence. This spectral representation also\nallows for powerful sensitivity analysis, i.e. understanding how a change in\none of the parameters in the models affects the steady-state.\n  We show that the site sizes and the transition rates from site to site play\ndifferent roles in the dynamics, and that for the purpose of maximizing the\nsteady-state output (or production) rate the site sizes are more important than\nthe transition rates. We also show that the problem of finding parameter values\nthat maximize the production rate is tractable.\n  We believe that the models introduced here can be applied to study various\nnatural and artificial processes including ribosome flow during mRNA\ntranslation, the movement of molecular motors along filaments of the\ncytoskeleton, pedestrian and vehicular traffic, evacuation dynamics, and more.\n", "versions": [{"version": "v1", "created": "Tue, 12 Mar 2019 18:44:56 GMT"}], "update_date": "2019-03-14", "authors_parsed": [["Bar-Shalom", "Eyal", ""], ["Ovseevich", "Alexander", ""], ["Margaliot", "Michael", ""]]}, {"id": "1903.10120", "submitter": "Andrey Kuznetsov", "authors": "Ivan A. Kuznetsov and Andrey V. Kuznetsov", "title": "Modeling transport and mean age of dense core vesicles in large axonal\n  arbors", "comments": "Added an acknowledgement to Holger Metzler", "journal-ref": "Proceedings of the Royal Society A, vol. 475, 20190284, 2019", "doi": "10.1098/rspa.2019.0284", "report-no": null, "categories": "q-bio.NC q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A model simulating transport of dense core vesicles (DCVs) in type II axonal\nterminals of Drosophila motoneurons has been developed. The morphology of type\nII terminals is characterized by the large number of en passant boutons. The\nlack of both scaled up DCV transport and scaled down DCV capture in boutons\nresults in a less efficient supply of DCVs to distal boutons. Furthermore, the\nlarge number of boutons that DCVs pass as they move anterogradely, until they\nreach the most distal bouton, may lead to the capture of a majority of DCVs\nbefore they turn around in the most distal bouton to move in the retrograde\ndirection. This may lead to a reduced retrograde flux of DCVs and a lack of DCV\ncirculation in type II terminals. The developed model simulates DCV\nconcentrations in boutons, DCV fluxes between the boutons, age density\ndistributions of DCVs, and the mean age of DCVs in various boutons. Unlike\npublished experimental observations, our model predicts DCV circulation in type\nII terminals after these terminals are filled to saturation. This disagreement\nis likely because experimentally observed terminals were not at steady-state,\nbut rather were accumulating DCVs for later release. Our estimates show that\nthe number of DCVs in the transiting state is much smaller than that in the\nresident state. DCVs traveling in the axon, rather than DCVs transiting in the\nterminal, may provide a reserve of DCVs for replenishing boutons after a\nrelease. The techniques for modeling transport of DCVs developed in our paper\ncan be used to model the transport of other organelles in axons.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2019 03:44:22 GMT"}, {"version": "v2", "created": "Thu, 2 May 2019 17:57:58 GMT"}, {"version": "v3", "created": "Sat, 7 Sep 2019 14:33:09 GMT"}, {"version": "v4", "created": "Sat, 1 Feb 2020 18:36:09 GMT"}], "update_date": "2020-02-04", "authors_parsed": [["Kuznetsov", "Ivan A.", ""], ["Kuznetsov", "Andrey V.", ""]]}, {"id": "1903.12320", "submitter": "Kumiko Hayashi", "authors": "Kumiko Hayashi, Shiori Matsumoto, Miki G. Miyamoto and Shinsuke Niwa", "title": "Physical parameters describing neuronal cargo transport by kinesin\n  UNC-104", "comments": "Biophysical Reviews, in press (31 pages, 14 figures)", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this review, we focus on the kinesin-3 family molecular motor protein\nUNC-104 and its regulatory protein ARL-8. UNC-104, originally identified in\nCaenorhabditis elegans (C. elegans), has a primary role transporting synaptic\nvesicle precursors (SVPs). Although in vitro single-molecule experiments have\nbeen performed to primarily investigate the kinesin motor domain, these have\nnot addressed the in vivo reality of the existence of regulatory proteins, such\nas ARL-8, that control kinesin attachment to/detachment from cargo vesicles,\nwhich is essential to the overall transport efficiency of cargo vesicles. To\nquantitatively understand the role of the regulatory protein, we review the in\nvivo physical parameters of UNC-104-mediated SVP transport, including force,\nvelocity, run length and run time, derived from wild-type and arl-8-deletion\nmutant C. elegans. Our future aim is to facilitate the construction of a\nconsensus physical model to connect SVP transport with pathologies related to\ndeficient synapse construction caused by the deficient UNC-104 regulation. We\nhope that the physical parameters of SVP transport summarized in this review\nbecome a useful guide for the development of such model.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2019 01:59:41 GMT"}, {"version": "v2", "created": "Tue, 30 Apr 2019 09:47:40 GMT"}], "update_date": "2019-05-01", "authors_parsed": [["Hayashi", "Kumiko", ""], ["Matsumoto", "Shiori", ""], ["Miyamoto", "Miki G.", ""], ["Niwa", "Shinsuke", ""]]}]