[{"id": "1906.01744", "submitter": "Jean-Francois Berret", "authors": "Fanny Mousseau, Jean-Fran\\c{c}ois Berret and Evdokia K. Oikonomou", "title": "Design and applications of a fluorescent labeling technique for lipid\n  and surfactant preformed vesicles", "comments": "19 pages, 6 figures and 2 schemes, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Amphiphilic molecules such as surfactants, lipids and block copolymers can be\nassembled into bilayers and form vesicles. Fluorescent membrane labeling\nmethods require the use of dye molecules that can be inserted in the bilayers\nat different stages of the synthesis. To our knowledge there is no generalized\nmethod for labeling preformed vesicles. Herein we develop a versatile protocol\nthat is suitable to both surfactant and lipid preformed vesicles and requires\nno separation or purification steps. Based on the lipophilic carbocyanine green\ndye PKH67, the methodology is assessed on zwitterionic phosphatidylcholine\nvesicles. To demonstrate its versatility, it is applied to dispersions of\nanionic or cationic vesicles, such as a drug administrated to premature infants\nwith respiratory distress syndrome, or a vesicle formulation used as a fabric\nsoftener for homecare applications. By means of fluorescence microscopy we then\nvisualize the interaction mechanisms of nanoparticles crossing live cell\nmembranes and of surfactant adsorbing on cotton fabric. These results highlight\nthe advantages of a membrane labeling technique that is simple and applicable\nto a large number of soft matter systems.\n", "versions": [{"version": "v1", "created": "Tue, 4 Jun 2019 22:22:58 GMT"}], "update_date": "2019-06-06", "authors_parsed": [["Mousseau", "Fanny", ""], ["Berret", "Jean-François", ""], ["Oikonomou", "Evdokia K.", ""]]}, {"id": "1906.02527", "submitter": "Harmen Wierenga", "authors": "Harmen Wierenga and Pieter Rein ten Wolde", "title": "Diffusible crosslinkers cause superexponential friction forces", "comments": null, "journal-ref": "Phys. Rev. Lett. 125, 078101 (2020)", "doi": "10.1103/PhysRevLett.125.078101", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mitotic spindle lies at the heart of the spatio-temporal control over\ncellular components during cell division. The spindle consists of microtubules,\nwhich are not only crosslinked by motor proteins but also by passive binding\nproteins. These passive crosslinkers stabilize the highly dynamic mitotic\nspindle by generating friction forces between sliding filaments. However, it\nremains unclear how the friction coefficient depends on the number of\ncrosslinkers and the size of the overlap between the microtubules. Here, we use\ntheory and computer simulations to study the friction between two filaments\nthat are crosslinked by passive proteins, which can hop between neighboring\nbinding sites while physically excluding each other. The simulations reveal\nthat the movement of one microtubule relative to the other is limited by\nfree-energy barrier crossings, causing rare and discrete jumps of the\nmicrotubule that span the distance between adjacent crosslinker binding sites.\nWe derive an exact analytical expression for the free-energy landscape and\nidentify the reaction coordinate that governs the relative movement, which\nallows us to determine the effective barrier height for the microtubule jumps.\nBoth through simulations and reaction rate theory, we make the experimentally\ntestable prediction that the friction between the microtubules increases\nsuperexponentially with the density of crosslinkers.\n", "versions": [{"version": "v1", "created": "Thu, 6 Jun 2019 11:39:34 GMT"}], "update_date": "2020-08-19", "authors_parsed": [["Wierenga", "Harmen", ""], ["Wolde", "Pieter Rein ten", ""]]}, {"id": "1906.02710", "submitter": "Gao-De Li Dr", "authors": "Gao-De Li", "title": "Flexible Cancer-Associated Chromatin Configuration (CACC) Might Be the\n  Fundamental Reason Why Cancer Is So Difficult to Cure", "comments": "8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We once proposed that cell-type-associated chromatin configurations determine\ncell types and that cancer cell type is determined by cancer-associated\nchromatin configuration (CACC). In this paper, we hypothesize that flexible\ncell-type-associated chromatin configuration is associated with cell potency\nand has an advantage over inflexible one in regulating genome related\nactivities, such as DNA replication, DNA transcription, DNA repair, and DNA\nmutagenesis. The reason why cancer is so difficult to treat is because CACC is\nflexible, which enables cancer cells not only to produce heterogeneous\nsubclones through limited cell differentiation, but also to maximally and\nefficiently use genome related resources to survive environmental changes.\nTherefore, to beat cancer, more efforts should be made to restrict the\nflexibility of CACC or to change CACC so that cancer cells can be turned back\nto normal or become less malignant.\n", "versions": [{"version": "v1", "created": "Thu, 6 Jun 2019 17:24:32 GMT"}, {"version": "v2", "created": "Mon, 10 Jun 2019 08:34:44 GMT"}, {"version": "v3", "created": "Sun, 16 Jun 2019 13:01:21 GMT"}, {"version": "v4", "created": "Fri, 28 Jun 2019 16:42:23 GMT"}], "update_date": "2019-07-01", "authors_parsed": [["Li", "Gao-De", ""]]}, {"id": "1906.02933", "submitter": "Vidya V. Menon", "authors": "Vidya V. Menon, Mandar M. Inamdar, and Anirban Sain", "title": "Cytoplasmic streaming in C. elegans: forces that drive oogenesis", "comments": "Withdrawn due to unavoidable circumstances, as we cannot have the\n  results published at the current time", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the gonad of C. elegans worms, germ cells form the outer lining of the\ncentral tube, the rachis, which carries a cytoplasmic flow.\n", "versions": [{"version": "v1", "created": "Fri, 7 Jun 2019 07:31:09 GMT"}, {"version": "v2", "created": "Thu, 13 Jun 2019 12:31:01 GMT"}], "update_date": "2019-06-14", "authors_parsed": [["Menon", "Vidya V.", ""], ["Inamdar", "Mandar M.", ""], ["Sain", "Anirban", ""]]}, {"id": "1906.05024", "submitter": "Arman Karshenas Mr.", "authors": "Arman Karshenas, Joseph Windo, Bhuvana, Jonathan Stocks, Adrian\n  Kozhevnikov, Jhanna Kryukova, Eleanor Beard, Laurel Constanti Crosby, Max\n  Taylor", "title": "Frequency and Time Domain Analysis ofsRNA-based Treatment for\n  Inflammatory BowelDisease", "comments": "8 pages , 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The validity of a complex reaction pathway proposed to treat Inflammatory\nBowel Disease (IBD) was verified by a comprehensive time and frequency domain\nanalysis. The model was taken to the frequency domain to study the effect and\nthe significance of the negative feedback loop introduced by the reaction\npathways. It could be shown that such proposed probiotics have very interesting\npotentials that could be used extensively in the near future.\n", "versions": [{"version": "v1", "created": "Wed, 12 Jun 2019 09:24:35 GMT"}], "update_date": "2019-06-13", "authors_parsed": [["Karshenas", "Arman", ""], ["Windo", "Joseph", ""], ["Bhuvana", "", ""], ["Stocks", "Jonathan", ""], ["Kozhevnikov", "Adrian", ""], ["Kryukova", "Jhanna", ""], ["Beard", "Eleanor", ""], ["Crosby", "Laurel Constanti", ""], ["Taylor", "Max", ""]]}, {"id": "1906.06443", "submitter": "Ritvik Vasan", "authors": "Ritvik Vasan, Shiva Rudraraju, Matthew Akamatsu, Krishna Garikipati,\n  and Padmini Rangamani", "title": "A mechanical model reveals that non-axisymmetric buckling lowers the\n  energy barrier associated with membrane neck constriction", "comments": "Soft Matter (2019)", "journal-ref": null, "doi": "10.1039/C9SM01494B", "report-no": null, "categories": "physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Membrane neck formation is essential for scission, which, as recent\nexperiments on tubules have demonstrated, can be location dependent. The\ndiversity of biological machinery that can constrict a neck such as dynamin,\nactin, ESCRTs and BAR proteins, and the range of forces and deflection over\nwhich they operate, suggest that the constriction process is functionally\nmechanical and robust to changes in biological environment. In this study, we\nused a mechanical model of the lipid bilayer to systematically investigate the\ninfluence of location, symmetry constraints, and helical forces on membrane\nneck constriction. Simulations from our model demonstrated that the energy\nbarriers associated with constriction of a membrane neck are\nlocation-dependent. Importantly, if symmetry restrictions are relaxed, then the\nenergy barrier for constriction is dramatically lowered and the membrane\nbuckles at lower values of forcing parameters. Our simulations also show that\nconstriction due to helical proteins further reduces the energy barrier for\nneck formation compared to cylindrical proteins. These studies establish that\ndespite different molecular mechanisms of neck formation in cells, the\nmechanics of constriction naturally leads to a loss of symmetry that can lower\nthe energy barrier to constriction.\n", "versions": [{"version": "v1", "created": "Sat, 15 Jun 2019 00:38:41 GMT"}, {"version": "v2", "created": "Tue, 10 Dec 2019 18:43:41 GMT"}], "update_date": "2019-12-11", "authors_parsed": [["Vasan", "Ritvik", ""], ["Rudraraju", "Shiva", ""], ["Akamatsu", "Matthew", ""], ["Garikipati", "Krishna", ""], ["Rangamani", "Padmini", ""]]}, {"id": "1906.08154", "submitter": "Debashish Chowdhury", "authors": "Annwesha Dutta, Gunter M Sch\\\"utz, Debashish Chowdhury", "title": "Stochastic thermodynamics and modes of operation of a ribosome: a\n  network theoretic perspective", "comments": "62 pages; augmented model, new results, thoroughly revised text", "journal-ref": "Phys. Rev. E 101, 032402 (2020)", "doi": "10.1103/PhysRevE.101.032402", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ribosome is one of the largest and most complex macromolecular machines\nin living cells. It polymerizes a protein in a step-by-step manner as directed\nby the corresponding nucleotide sequence on the template messenger RNA (mRNA)\nand this process is referred to as `translation' of the genetic message encoded\nin the sequence of mRNA transcript. In each successful chemo-mechanical cycle\nduring the (protein) elongation stage, the ribosome elongates the protein by a\nsingle subunit, called amino acid, and steps forward on the template mRNA by\nthree nucleotides called a codon. Therefore, a ribosome is also regarded as a\nmolecular motor for which the mRNA serves as the track, its step size is that\nof a codon and two molecules of GTP and one molecule of ATP hydrolyzed in that\ncycle serve as its fuel. What adds further complexity is the existence of\ncompeting pathways leading to distinct cycles, branched pathways in each cycle\nand futile consumption of fuel that leads neither to elongation of the nascent\nprotein nor forward stepping of the ribosome on its track. We investigate a\nmodel formulated in terms of the network of discrete chemo-mechanical states of\na ribosome during the elongation stage of translation. The model is analyzed\nusing a combination of stochastic thermodynamic and kinetic analysis based on a\ngraph-theoretic approach. We derive the exact solution of the corresponding\nmaster equations. We represent the steady state in terms of the cycles of the\nunderlying network and discuss the energy transduction processes. We identify\nthe various possible modes of operation of a ribosome in terms of its average\nvelocity and mean rate of GTP hydrolysis. We also compute entropy production as\nfunctions of the rates of the interstate transitions and the thermodynamic cost\nfor accuracy of the translation process.\n", "versions": [{"version": "v1", "created": "Wed, 19 Jun 2019 15:31:08 GMT"}, {"version": "v2", "created": "Tue, 11 Feb 2020 16:46:20 GMT"}], "update_date": "2020-03-11", "authors_parsed": [["Dutta", "Annwesha", ""], ["Schütz", "Gunter M", ""], ["Chowdhury", "Debashish", ""]]}, {"id": "1906.08294", "submitter": "Liang Luo", "authors": "Liang Luo and Ming Yi", "title": "Quenched trap model on the extreme landscape: the rise of sub-diffusion\n  and non-Gaussian diffusion", "comments": "9 pages, 7 figures", "journal-ref": "Phys. Rev. E 100, 042136 (2019)", "doi": "10.1103/PhysRevE.100.042136", "report-no": null, "categories": "cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Non-Gaussian diffusion has been intensively studied in recent years, which\nreflects the dynamic heterogeneity in the disordered media. The recent study on\nthe non-Gaussian diffusion in a static disordered landscape suggests novel\nphenomena due to the quenched disorder. In this work, we further investigate\nthe random walk in this landscape under various effective temperature $\\mu$,\nwhich continuously modulates the dynamic heterogeneity. We show in the long\ntime limit, the trap dynamics on the landscape is equivalent to the quenched\ntrap model, in which sub-diffusion appears for $\\mu<1$. The non-Gaussian\ndistribution of displacement has been analytically estimated for short $t$, of\nwhich the stretched exponential tail is expected for $\\mu\\neq1$. Due to the\nlocalization in the ensemble of trajectory segments, an additional peak arises\nin $P(x,t)$ around $x=0$ even for $\\mu>1$. Evolving in different time scales,\nthe peak and the tail of $P(x,t)$ are well split for a wide range of $t$. This\ntheoretical study reveals the connections among the sub-diffusion, non-Gaussian\ndiffusion, and the dynamic heterogeneity in the static disordered medium. It\nalso offers an insight on how the cell would benefit from the quasi-static\ndisordered structures.\n", "versions": [{"version": "v1", "created": "Wed, 19 Jun 2019 18:33:28 GMT"}, {"version": "v2", "created": "Thu, 16 Apr 2020 04:35:49 GMT"}], "update_date": "2020-04-17", "authors_parsed": [["Luo", "Liang", ""], ["Yi", "Ming", ""]]}, {"id": "1906.09236", "submitter": "Joseph Baron", "authors": "Joseph W. Baron and Tobias Galla", "title": "Intrinsic noise, Delta-Notch signalling and delayed reactions promote\n  sustained, coherent, synchronised oscillations in the presomitic mesoderm", "comments": "23 pages, 10 figures", "journal-ref": "J. R. Soc. Interface 16, 20190436 (2019)", "doi": "10.1098/rsif.2019.0436", "report-no": null, "categories": "q-bio.SC q-bio.BM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using a stochastic individual-based modelling approach, we examine the role\nthat Delta-Notch signalling plays in the regulation of a robust and reliable\nsomite segmentation clock. We find that not only can Delta-Notch signalling\nsynchronise noisy cycles of gene expression in adjacent cells in the presomitic\nmesoderm (as is known), but it can also amplify and increase the coherence of\nthese cycles. We examine some of the shortcomings of deterministic approaches\nto modelling these cycles and demonstrate how intrinsic noise can play an\nactive role in promoting sustained oscillations, giving rise to noise-induced\nquasi-cycles. Finally, we explore how translational/transcriptional delays can\nresult in the cycles in neighbouring cells oscillating in anti-phase and we\nstudy how this effect relates to the propagation of noise-induced stochastic\nwaves.\n", "versions": [{"version": "v1", "created": "Fri, 21 Jun 2019 16:51:10 GMT"}, {"version": "v2", "created": "Wed, 27 Nov 2019 14:43:19 GMT"}], "update_date": "2019-11-28", "authors_parsed": [["Baron", "Joseph W.", ""], ["Galla", "Tobias", ""]]}]