[{"id": "1911.03515", "submitter": "Jaeoh Shin", "authors": "Cayke Felipe, Jaeoh Shin, Yulia Loginova, Anatoly B. Kolomeisky", "title": "The Effect of Obstacles in Multi-Site Protein Target Search with DNA\n  Looping", "comments": "7 pages, 7 figures", "journal-ref": null, "doi": "10.1063/1.5135917", "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many fundamental biological processes are regulated by protein-DNA complexes\ncalled {\\it synaptosomes}, which possess multiple interaction sites. Despite\nthe critical importance of synaptosomes, the mechanisms of their formation\nremain not well understood. Because of the multi-site nature of participating\nproteins, it is widely believed that their search for specific sites on DNA\ninvolves the formation and breaking of DNA loops and sliding in the looped\nconfigurations. In reality, DNA in live cells is densely covered by other\nbiological molecules that might interfere with the formation of synaptosomes.\nIn this work, we developed a theoretical approach to evaluate the role of\nobstacles in the target search of multi-site proteins when the formation of DNA\nloops and the sliding in looped configurations are possible. Our theoretical\nmethod is based on analysis of a discrete-state stochastic model that uses a\nmaster equations approach and extensive computer simulations. It is found that\nthe obstacle slows down the search dynamics in the system when DNA loops are\nlong-lived, but the effect is minimal for short-lived DNA loops. In addition,\nthe relative positions of the target and the obstacle strongly influence the\ntarget search kinetics. Furthermore, the presence of the obstacle might\nincrease the noise in the system. These observations are discussed using\nphysical-chemical arguments. Our theoretical approach clarifies the molecular\nmechanisms of formation of protein-DNA complexes with multiple interactions\nsites.\n", "versions": [{"version": "v1", "created": "Fri, 8 Nov 2019 19:46:01 GMT"}], "update_date": "2020-01-29", "authors_parsed": [["Felipe", "Cayke", ""], ["Shin", "Jaeoh", ""], ["Loginova", "Yulia", ""], ["Kolomeisky", "Anatoly B.", ""]]}, {"id": "1911.03640", "submitter": "Debasish Chaudhuri", "authors": "Amit Kumar, Pinaki Swain, Bela M. Mulder, and Debasish Chaudhuri", "title": "Impact of crowders on the morphology of bacterial chromosomes", "comments": "7 pages, 5 figures; minor modifications; version accepted for\n  publication in Europhysics Letters", "journal-ref": "Europhysics Letters 128, 68003 (2019)", "doi": null, "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inspired by recent experiments on the effects of cytosolic crowders on the\norganization of bacterial chromosomes, we consider a \"feather-boa\" type model\nchromosome in the presence of non-additive crowders, encapsulated within a\ncylindrical cell. We observe spontaneous emergence of complementary helicity of\nthe confined polymer and crowders. This feature is reproduced within a\nsimplified effective model of the chromosome. This latter model further\nestablishes the occurrence of longitudinal and transverse spatial segregation\ntransitions between the chromosome and crowders upon increasing crowder size.\n", "versions": [{"version": "v1", "created": "Sat, 9 Nov 2019 08:23:51 GMT"}, {"version": "v2", "created": "Mon, 3 Feb 2020 07:57:05 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Kumar", "Amit", ""], ["Swain", "Pinaki", ""], ["Mulder", "Bela M.", ""], ["Chaudhuri", "Debasish", ""]]}, {"id": "1911.06684", "submitter": "G\\\"unther Kn\\\"or", "authors": "G\\\"unther Kn\\\"or", "title": "New Approaches in Synthetic Biology: Abiotic Organelles and Artificial\n  Cells Powered and Controlled by Light", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC q-bio.BM q-bio.MN q-bio.TO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  One of the major goals of nanobionics and bottom-up synthetic biology is the\ndevelopment of artificial cell organelles for the creation of cell-like\nstructures operating similar to biological systems with a minimalistic set of\nbuilding blocks. In the present contribution, versatile strategies to develop\nartificial reaction centers for novel photoautotrophic processes and to provide\nfully biocompatible synthetic enzyme counterparts for stepwise sustrate\nphoto-conversion in abiotic organelles are summarized. This unique approach has\nthe potential to create artificial cell-like systems that can be readily\nmanipulated by light providing both energy input and fundamental regulatory\nfunctions.\n", "versions": [{"version": "v1", "created": "Fri, 15 Nov 2019 15:07:27 GMT"}], "update_date": "2019-11-18", "authors_parsed": [["Knör", "Günther", ""]]}, {"id": "1911.07746", "submitter": "Maria-Veronica Ciocanel", "authors": "Maria-Veronica Ciocanel, John Fricks, Peter R. Kramer, Scott A.\n  McKinley", "title": "Renewal reward perspective on linear switching diffusion systems", "comments": "35 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many biological systems, the movement of individual agents is commonly\ncharacterized as having multiple qualitatively distinct behaviors that arise\nfrom various biophysical states. This is true for vesicles in intracellular\ntransport, micro-organisms like bacteria, or animals moving within and\nresponding to their environment. For example, in cells the movement of\nvesicles, organelles and other cargo are affected by their binding to and\nunbinding from cytoskeletal filaments such as microtubules through molecular\nmotor proteins. A typical goal of theoretical or numerical analysis of models\nof such systems is to investigate the effective transport properties and their\ndependence on model parameters. While the effective velocity of particles\nundergoing switching diffusion is often easily characterized in terms of the\nlong-time fraction of time that particles spend in each state, the calculation\nof the effective diffusivity is more complicated because it cannot be expressed\nsimply in terms of a statistical average of the particle transport state at one\nmoment of time. However, it is common that these systems are regenerative, in\nthe sense that they can be decomposed into independent cycles marked by returns\nto a base state. Using decompositions of this kind, we calculate effective\ntransport properties by computing the moments of the dynamics within each cycle\nand then applying renewal-reward theory. This method provides a useful\nalternative large-time analysis to direct homogenization for linear\nadvection-reaction-diffusion partial differential equation models. Moreover, it\napplies to a general class of semi-Markov processes and certain stochastic\ndifferential equations that arise in models of intracellular transport.\nApplications of the proposed framework are illustrated for case studies such as\nmRNA transport in developing oocytes and processive cargo movement by teams of\nmotor proteins.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 16:28:05 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Ciocanel", "Maria-Veronica", ""], ["Fricks", "John", ""], ["Kramer", "Peter R.", ""], ["McKinley", "Scott A.", ""]]}, {"id": "1911.09352", "submitter": "Thomas R. Weikl", "authors": "Thomas R. Weikl, Jinglei Hu, Batuhan Kav, and Bartosz Rozycki", "title": "Binding and segregation of proteins in membrane adhesion: Theory,\n  modelling, and simulations", "comments": "Review article with 39 pages and 11 figures in \"Advances in\n  Biomembranes and Lipid Self-Assembly\", Volume 30 (2019)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The adhesion of biomembranes is mediated by the binding of membrane-anchored\nreceptor and ligand proteins. The proteins can only bind if the separation\nbetween apposing membranes is sufficiently close to the length of the protein\ncomplexes, which leads to an interplay between protein binding and membrane\nshape. In this article, we review current models of biomembrane adhesion and\nnovel insights obtained from the models. Theory and simulations with\nelastic-membrane and coarse-grained molecular models of biomembrane adhesion\nindicate that the binding of proteins in membrane adhesion strongly depends on\nnanoscale shape fluctuations of the apposing membranes, which results in\nbinding cooperativity. A length mismatch between protein complexes leads to\nrepulsive interactions that are caused by membrane bending and act as a driving\nforce for the length-based segregation of proteins during membrane adhesion.\n", "versions": [{"version": "v1", "created": "Thu, 21 Nov 2019 09:02:39 GMT"}], "update_date": "2019-11-22", "authors_parsed": [["Weikl", "Thomas R.", ""], ["Hu", "Jinglei", ""], ["Kav", "Batuhan", ""], ["Rozycki", "Bartosz", ""]]}, {"id": "1911.11041", "submitter": "Denis Boyer", "authors": "Gabriel Mercado-V\\'asquez, Denis Boyer", "title": "First hitting times to intermittent targets", "comments": "3 Figures", "journal-ref": "Physical Review Letters 123, 250603 (2019)", "doi": "10.1103/PhysRevLett.123.250603", "report-no": null, "categories": "cond-mat.stat-mech q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In noisy environments such as the cell, many processes involve target sites\nthat are often hidden or inactive, and thus not always available for reaction\nwith diffusing entities. To understand reaction kinetics in these situations,\nwe study the first hitting time statistics of a Brownian particle searching for\na target site that switches stochastically between visible and hidden phases.\nAt high crypticity, an unexpected rate limited power-law regime emerges for the\nfirst hitting time density, which markedly differs from the classic $t^{-3/2}$\nscaling for steady targets. Our problem admits an asymptotic mapping onto a\nmixed, or Robin, boundary condition. Similar results are obtained with\nnon-Markov targets and particles diffusing anomalously.\n", "versions": [{"version": "v1", "created": "Mon, 25 Nov 2019 16:53:32 GMT"}, {"version": "v2", "created": "Tue, 7 Jan 2020 18:56:50 GMT"}], "update_date": "2020-01-29", "authors_parsed": [["Mercado-Vásquez", "Gabriel", ""], ["Boyer", "Denis", ""]]}]