[{"id": "2003.00751", "submitter": "Jianfeng Pei", "authors": "Xiaobing Deng, Xiaoyu Yu and Jianfeng Pei", "title": "Regulation of interferon production as a potential strategy for COVID-19\n  treatment", "comments": "9 pages, 3 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regulating the upstream of the cytokines production could be a promising\nstrategy to the treatment of COVID-19. We suggest to pay more attention to the\ndysregulated IFN-I production in COVID-19 and to considerate cGAS, ALK and\nSTING as potential therapeutic targets preventing cytokine storm. Approved\ndrugs like suramin and ALK inhibitors are worthy of clinical trials.\n", "versions": [{"version": "v1", "created": "Mon, 2 Mar 2020 10:36:33 GMT"}], "update_date": "2020-03-03", "authors_parsed": [["Deng", "Xiaobing", ""], ["Yu", "Xiaoyu", ""], ["Pei", "Jianfeng", ""]]}, {"id": "2003.03223", "submitter": "Andrea Gianotti Prof", "authors": "Mattia Di Nunzio, Gianfranco Picone, Federica Pasini, Elena Chiarello,\n  Maria Fiorenza Caboni, Francesco Capozzi, Andrea Gianotti, Alessandra Bordoni", "title": "Olive oil by-product as functional ingredient in bakery products", "comments": null, "journal-ref": "Food Research International, 131, 108940 (2020)", "doi": "10.1016/j.foodres.2019.108940", "report-no": null, "categories": "q-bio.TO q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By-products represent a major disposal problem for the food industry, but\nthey are also promising sources of bioactive compounds. Olive pomace, one of\nthe main by-products of olive oil production, is a potential low-cost,\nphenol-rich ingredient for the formulation of functional food. In this study,\nbakery products enriched with defatted olive pomace powder and their\nconventional counterparts were chemical characterized and in vitro digested.\nThe bioaccessible fractions were supplemented to cultured human intestinal\ncells exposed to an inflammatory stimulus, and the anti-inflammatory effect and\nmetabolome modification were evaluated. Although in all bakery products the\nenrichment with olive pomace significantly increased the total phenolic\ncontent, this increase was paralleled by an enhanced anti-inflammatory activity\nonly in conventionally fermented bread. Therefore, while confirming olive oil\nby-products as functional ingredients for bakery food enrichment, our data\nhighlight that changes in chemical composition cannot predict changes in\nfunctionality. Functionality should be first evaluated in biological in vitro\nsystems, and then confirmed in human intervention studies.\n", "versions": [{"version": "v1", "created": "Fri, 28 Feb 2020 11:08:34 GMT"}], "update_date": "2020-06-29", "authors_parsed": [["Di Nunzio", "Mattia", ""], ["Picone", "Gianfranco", ""], ["Pasini", "Federica", ""], ["Chiarello", "Elena", ""], ["Caboni", "Maria Fiorenza", ""], ["Capozzi", "Francesco", ""], ["Gianotti", "Andrea", ""], ["Bordoni", "Alessandra", ""]]}, {"id": "2003.03260", "submitter": "\\'Elie Besserer-Offroy Ph.D.", "authors": "Rebecca L. Brouillette, \\'Elie Besserer-Offroy, Christine E. Mona,\n  Magali Chartier, Sandrine Lavenus, Marc Sousbie, Karine Belleville,\n  Jean-Michel Longpr\\'e, \\'Eric Marsault, Michel Grandbois, Philippe Sarret", "title": "Cell-penetrating pepducins targeting the neurotensin receptor type 1\n  relieve pain", "comments": "This is the accepted version of the following article: Brouillette\n  RL, et al. (2020), Pharmacological Research. doi:10.1016/j.phrs.2020.104750 ,\n  which has been accepted and published in final form at\n  https://doi.org/10.1016/j.phrs.2020.104750", "journal-ref": "Pharmacological Research. 104750 (2020)", "doi": "10.1016/j.phrs.2020.104750", "report-no": null, "categories": "q-bio.BM q-bio.SC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Pepducins are cell-penetrating, membrane-tethered lipopeptides designed to\ntarget the intracellular region of a G protein-coupled receptor (GPCR) in order\nto allosterically modulate the receptor's signaling output. In this\nproof-of-concept study, we explored the pain-relief potential of a pepducin\nseries derived from the first intracellular loop of neurotensin receptor type 1\n(NTS1), a class A GPCR that mediates many of the effects of the neurotensin\n(NT) tridecapeptide, including hypothermia, hypotension and analgesia. We used\nBRET-based biosensors to determine the pepducins' ability to engage G protein\nsignaling pathways associated with NTS1 activation. We observed partial Gq and\nG13 activation at a 10 {\\mu}M concentration, indicating that these pepducins\nmay act as allosteric agonists of NTS1. Additionally, we used surface plasmon\nresonance (SPR) as a label-free assay to monitor pepducin-induced responses in\nCHO-K1 cells stably expressing hNTS1. This whole-cell integrated assay enabled\nus to subdivide our pepducin series into three profile response groups. In\norder to determine the pepducins' antinociceptive potential, we then screened\nthe series in an acute pain model (tail-flick test) by measuring tail\nwithdrawal latencies to a thermal nociceptive stimulus, following intrathecal\npepducin administration (275 nmol/kg). We further evaluated promising pepducins\nin a tonic pain model (formalin test), as well as in neuropathic (Chronic\nConstriction Injury) and inflammatory (Complete Freund's Adjuvant) chronic pain\nmodels. We report one pepducin, PP-001, that consistently reduced rat\nnociceptive behaviors, even in chronic pain paradigm. Altogether, these results\nsuggest that NTS1-derived pepducins may represent a promising strategy in\npain-relief.\n", "versions": [{"version": "v1", "created": "Fri, 6 Mar 2020 14:57:41 GMT"}, {"version": "v2", "created": "Mon, 9 Mar 2020 15:06:02 GMT"}], "update_date": "2020-06-14", "authors_parsed": [["Brouillette", "Rebecca L.", ""], ["Besserer-Offroy", "Élie", ""], ["Mona", "Christine E.", ""], ["Chartier", "Magali", ""], ["Lavenus", "Sandrine", ""], ["Sousbie", "Marc", ""], ["Belleville", "Karine", ""], ["Longpré", "Jean-Michel", ""], ["Marsault", "Éric", ""], ["Grandbois", "Michel", ""], ["Sarret", "Philippe", ""]]}, {"id": "2003.05515", "submitter": "Sean Lawley", "authors": "Sean D Lawley", "title": "The effects of fast inactivation on conditional first passage times of\n  mortal diffusive searchers", "comments": "24 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The first time a searcher finds a target is called a first passage time\n(FPT). In many physical, chemical, and biological processes, the searcher is\n\"mortal,\" which means that the searcher might become inactivated (degrade, die,\netc.) before finding the target. In the context of intracellular signaling, an\nimportant recent work discovered that fast inactivation can drastically alter\nthe conditional FPT distribution of a mortal diffusive searcher, if the\nsearcher is conditioned to find the target before inactivation. In this paper,\nwe prove a general theorem which yields an explicit formula for all the moments\nof such conditional FPTs in the fast inactivation limit. This formula is quite\nuniversal, as it holds under very general conditions on the diffusive searcher\ndynamics, the target, and the spatial domain. These results prove in\nsignificant generality that if inactivation is fast, then the conditional FPT\ncompared to the FPT without inactivation is (i) much faster, (ii) much less\naffected by spatial heterogeneity, and (iii) much less variable. Our results\nagree with recent computational and theoretical analysis of a certain discrete\nintracellular diffusion model and confirm a conjecture related to the effect of\nspatial heterogeneity on intracellular signaling.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2020 20:45:57 GMT"}, {"version": "v2", "created": "Wed, 24 Feb 2021 15:34:17 GMT"}], "update_date": "2021-02-25", "authors_parsed": [["Lawley", "Sean D", ""]]}, {"id": "2003.06789", "submitter": "Felix Schwietert", "authors": "Felix Schwietert, Jan Kierfeld", "title": "Bistability and oscillations in cooperative microtubule and kinetochore\n  dynamics in the mitotic spindle", "comments": null, "journal-ref": null, "doi": "10.1088/1367-2630/ab7ede", "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In the mitotic spindle microtubules attach to kinetochores via catch bonds\nduring metaphase, and microtubule depolymerization forces give rise to\nstochastic chromosome oscillations. We investigate the cooperative stochastic\nmicrotubule dynamics in spindle models consisting of ensembles of parallel\nmicrotubules, which attach to a kinetochore via elastic linkers. We include the\ndynamic instability of microtubules and forces on microtubules and kinetochores\nfrom elastic linkers. A one-sided model, where an external force acts on the\nkinetochore is solved analytically employing a mean-field approach based on\nFokker-Planck equations. The solution establishes a bistable force-velocity\nrelation of the microtubule ensemble in agreement with stochastic simulations.\nWe derive constraints on linker stiffness and microtubule number for\nbistability. The bistable force-velocity relation of the one-sided spindle\nmodel gives rise to oscillations in the two-sided model, which can explain\nstochastic chromosome oscillations in metaphase (directional instability). We\nderive constraints on linker stiffness and microtubule number for metaphase\nchromosome oscillations. Including poleward microtubule flux into the model we\ncan provide an explanation for the experimentally observed suppression of\nchromosome oscillations in cells with high poleward flux velocities. Chromosome\noscillations persist in the presence of polar ejection forces, however, with a\nreduced amplitude and a phase shift between sister kinetochores. Moreover,\npolar ejection forces are necessary to align the chromosomes at the spindle\nequator and stabilize an alternating oscillation pattern of the two\nkinetochores. Finally, we modify the model such that microtubules can only\nexert tensile forces on the kinetochore resulting in a tug-of-war between the\ntwo microtubule ensembles. Then, induced microtubule catastrophes after\nreaching the...\n", "versions": [{"version": "v1", "created": "Sun, 15 Mar 2020 10:37:11 GMT"}], "update_date": "2020-03-17", "authors_parsed": [["Schwietert", "Felix", ""], ["Kierfeld", "Jan", ""]]}]