[{"id": "2007.02169", "submitter": "Joe Klobusicky", "authors": "Joseph J. Klobusicky and John Fricks and Peter R. Kramer", "title": "Effective behavior of cooperative and nonidentical molecular motors", "comments": "73 pages, 4 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Analytical formulas for effective drift, diffusivity, run times, and run\nlengths are derived for an intracellular transport system consisting of a cargo\nattached to two cooperative but not identical molecular motors (for example,\nkinesin-1 and kinesin-2) which can each attach and detach from a microtubule.\nThe dynamics of the motor and cargo in each phase are governed by stochastic\ndifferential equations, and the switching rates depend on the spatial\nconfiguration of the motor and cargo. This system is analyzed in a limit where\nthe detached motors have faster dynamics than the cargo, which in turn has\nfaster dynamics than the attached motors. The attachment and detachment rates\nare also taken to be slow relative to the spatial dynamics. Through an\napplication of iterated stochastic averaging to this system, and the use of\nrenewal-reward theory to stitch together the progress within each switching\nphase, we obtain explicit analytical expressions for the effective drift,\ndiffusivity, and processivity of the motor-cargo system. Our approach accounts\nin particular for jumps in motor-cargo position that occur during attachment\nand detachment events, as the cargo tracking variable makes a rapid adjustment\ndue to the averaged fast scales. The asymptotic formulas are in generally good\nagreement with direct stochastic simulations of the detailed model based on\nexperimental parameters for various pairings of kinesin-1 and kinesin-2 under\nassisting, hindering, or no load.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jul 2020 19:24:24 GMT"}, {"version": "v2", "created": "Mon, 31 Aug 2020 18:47:07 GMT"}, {"version": "v3", "created": "Thu, 21 Jan 2021 16:15:52 GMT"}], "update_date": "2021-01-22", "authors_parsed": [["Klobusicky", "Joseph J.", ""], ["Fricks", "John", ""], ["Kramer", "Peter R.", ""]]}, {"id": "2007.02206", "submitter": "Shreyas Bhaban", "authors": "Shreyas Bhaban, James Melbourne, Saurav Talukdar and Murti V. Salapaka", "title": "Steady State Cargo Transport Modalities of Molecular Motor Ensembles\n  Emerge from Single Motor Behavior", "comments": "5 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transport of intracellular cargo is often mediated by teams of molecular\nmotors that function in a chaotic environment and varying conditions. We show\nthat the motors have unique steady state behavior which enables transport\nmodalities that are robust. Under reduced ATP concentrations, multi-motor\nconfigurations are preferred over single motors. Higher load force drives\nmotors to cluster, but very high loads compel them to separate in a manner that\npromotes immediate cargo movement once the load reduces. These inferences,\nbacked by analytical guarantees, provide unique insights into the coordination\nstrategies adopted by motors.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jul 2020 23:17:30 GMT"}], "update_date": "2020-07-07", "authors_parsed": [["Bhaban", "Shreyas", ""], ["Melbourne", "James", ""], ["Talukdar", "Saurav", ""], ["Salapaka", "Murti V.", ""]]}, {"id": "2007.03243", "submitter": "Oleksandr Oliynyk", "authors": "Lin Ren, Alexander Oleinick (PASTEUR), Irina Svir (PASTEUR), Christian\n  Amatore (PASTEUR), Andrew Ewing", "title": "Amperometric Measurements and Dynamic Models Reveal a Mechanism for How\n  Zinc Alters Neurotransmitter Release", "comments": null, "journal-ref": "Angewandte Chemie International Edition, Wiley-VCH Verlag, 2020,\n  59 (8), pp.3083-3087", "doi": "10.1002/anie.201913184", "report-no": null, "categories": "q-bio.NC q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Zinc, a suspected potentiator of learning and memory, is shown to affect\nexocytotic release and storage in neurotransmitter-containing vesicles.\nStructural and size analysis of the vesicular dense core and halo using\ntransmission electron microscopy was combined with single-cell amperometry to\nstudy the vesicle size changes induced after zinc treatment and to compare\nthese changes to theoretical predictions based on the concept of partial\nrelease as opposed to full quantal release. This powerful combined analytical\napproach establishes the existence of an unsuspected strong link between\nvesicle structure and exocytotic dynamics which can be used to explain the\nmechanism of regulation of synaptic plasticity by Zn 2+ through modulation of\nneurotransmitter release.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jul 2020 07:26:02 GMT"}], "update_date": "2020-07-08", "authors_parsed": [["Ren", "Lin", "", "PASTEUR"], ["Oleinick", "Alexander", "", "PASTEUR"], ["Svir", "Irina", "", "PASTEUR"], ["Amatore", "Christian", "", "PASTEUR"], ["Ewing", "Andrew", ""]]}, {"id": "2007.03245", "submitter": "Oleksandr Oliynyk", "authors": "Keke Hu, Yan-Ling Liu, Alexander Oleinick (PASTEUR), Michael Mirkin,\n  Wei-Hua Huang, Christian Amatore (PASTEUR)", "title": "Nanoelectrodes for intracellular measurements of reactive oxygen and\n  nitrogen species in single living cells", "comments": null, "journal-ref": "Current Opinion in Electrochemistry, Elsevier, 2020, 22, pp.44-50", "doi": "10.1016/j.coelec.2020.04.003", "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reactive oxygen and nitrogen species (ROS and RNS) play important roles in\nvarious physiological processes (e.g., phagocytosis) and pathological\nconditions (e.g., cancer). The primary ROS/RNS, viz., hydrogen peroxide,\nperoxynitrite ion, nitric oxide, and nitrite ion, can be oxidized at different\nelectrode potentials and therefore detected and quantified by electroanalytical\ntechniques. Nanometer-sized electrochemical probes are especially suitable for\nmeasuring ROS/RNS in single cells and cellular organelles. In this article, we\nsurvey recent advances in localized measurements of ROS/RNS inside single cells\nand discuss several methodological issues, including optimization of\nnanoelectrode geometry, precise positioning of an electrochemical probe inside\na cell, and interpretation of electroanalytical data.\n", "versions": [{"version": "v1", "created": "Tue, 7 Jul 2020 07:29:23 GMT"}], "update_date": "2020-07-08", "authors_parsed": [["Hu", "Keke", "", "PASTEUR"], ["Liu", "Yan-Ling", "", "PASTEUR"], ["Oleinick", "Alexander", "", "PASTEUR"], ["Mirkin", "Michael", "", "PASTEUR"], ["Huang", "Wei-Hua", "", "PASTEUR"], ["Amatore", "Christian", "", "PASTEUR"]]}, {"id": "2007.05518", "submitter": "Ulrich S. Schwarz", "authors": "Justin Grewe and Ulrich S. Schwarz (Heidelberg University)", "title": "Rheology of mixed motor ensembles", "comments": "5 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.SC cond-mat.soft", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rheology of biological cells is not only determined by their cytoskeletal\nnetworks, but also by the molecular motors that crosslink and contract them.\nRecently it has been found that the assemblies of myosin II molecular motors in\nnon-muscle cells are mixtures of fast and slow motor variants. Using computer\nsimulations and an analytical mean field theory of a crossbridge model for\nmyosin II motors, here we show that such motor ensembles effectively behave as\nactive Maxwell elements. We calculate storage and loss moduli as a function of\nthe model parameters and show that the rheological properties cross over from\nviscous to elastic as one increases the ratio of slow to fast motors. This\nsuggests that cells tune their mechanical properties by regulating the\ncomposition of their myosin assemblies.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jul 2020 17:52:26 GMT"}], "update_date": "2020-07-13", "authors_parsed": [["Grewe", "Justin", "", "Heidelberg University"], ["Schwarz", "Ulrich S.", "", "Heidelberg University"]]}, {"id": "2007.05839", "submitter": "Nikolai Slavov", "authors": "Aleksandra A. Petelski, Nikolai Slavov", "title": "Analyzing ribosome remodeling in health and disease", "comments": null, "journal-ref": "PROTEOMICS (2020)", "doi": "10.1002/pmic.202000039", "report-no": null, "categories": "q-bio.QM q-bio.BM q-bio.MN q-bio.SC", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  regulation largely unexplored, in part due to methodological limitations.\nIndeed, we review evidence demonstrating that commonly used methods, such as\ntranscriptomics, are inadequate because the variability in mRNAs coding for\nribosomal proteins (RP) does not necessarily correspond to RP variability. Thus\nprotein remodeling of ribosomes should be investigated by methods that allow\ndirect quantification of RPs, ideally of isolated ribosomes. We review such\nmethods, focusing on mass spectrometry and emphasizing method-specific biases\nand approaches to control these biases. We argue that using multiple\ncomplementary methods can help reduce the danger of interpreting reproducible\nsystematic biases as evidence for ribosome remodeling.\n", "versions": [{"version": "v1", "created": "Sat, 11 Jul 2020 19:46:18 GMT"}, {"version": "v2", "created": "Sun, 2 Aug 2020 13:02:45 GMT"}], "update_date": "2020-09-01", "authors_parsed": [["Petelski", "Aleksandra A.", ""], ["Slavov", "Nikolai", ""]]}, {"id": "2007.07510", "submitter": "Arijit Mahapatra", "authors": "Arijit Mahapatra, Can Uysalel, and Padmini Rangamani (University of\n  California San Diego)", "title": "The mechanics and thermodynamics of tubule formation in biological\n  membranes", "comments": "Arijit Mahapatra and Can Uysalel contributed equally, Padmini\n  Rangamani is the corresponding author, 21 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft physics.bio-ph q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Membrane tubulation is a ubiquitous process that occurs both at the plasma\nmembrane and on the membranes of intracellular organelles. These tubulation\nevents are known to be mediated by forces applied on the membrane either due to\nmotor proteins, by polymerization of the cytoskeleton, or due to the\ninteractions between membrane proteins binding onto the membrane. The numerous\nexperimental observations of tube formation have been amply supported by\nmathematical modeling of the associated membrane mechanics and have provided\ninsights into the force-displacement relationships of membrane tubes. Recent\nadvances in quantitative biophysical measurements of membrane-protein\ninteractions and tubule formation have necessitated the need for advances in\nmodeling that will account for the interplay of multiple aspects of physics\nthat occur simultaneously. Here, we present a comprehensive review of\nexperimental observations of tubule formation and provide context from the\nframework of continuum modeling. Finally, we explore the scope for future\nresearch in this area with an emphasis on iterative modeling and experimental\nmeasurements that will enable us to expand our mechanistic understanding of\ntubulation processes in cells.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jul 2020 07:02:18 GMT"}, {"version": "v2", "created": "Tue, 1 Dec 2020 20:34:36 GMT"}], "update_date": "2020-12-03", "authors_parsed": [["Mahapatra", "Arijit", "", "University of\n  California San Diego"], ["Uysalel", "Can", "", "University of\n  California San Diego"], ["Rangamani", "Padmini", "", "University of\n  California San Diego"]]}, {"id": "2007.09066", "submitter": "Azadeh Alavizargar", "authors": "Azadeh Alavizargar, Fabian Keller, R. Wedlich-S\\\"oldner, Andreas Heuer", "title": "Effect of Cholesterol vs. Ergosterol on DPPC Bilayer Properties:\n  Insights from Atomistic Simulations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph cond-mat.soft q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sterols have been ascribed a major role in the organization of biological\nmembranes, in particular for the formation of liquid ordered domains in complex\nlipid mixtures. Here, we employed molecular dynamics simulations to compare the\neffects of cholesterol and ergosterol as the major sterol of mammalian and\nfungal cells, respectively, on binary mixtures with\n1,2-dipalmitoyl-sn-glycero-3-phosphocholine (DPPC) as a proxy for saturated\nlipids. In agreement with previous work, we observe that the addition of sterol\nmolecules modifies the order of DPPC both in the gel phase and in the liquid\nphase. When disentangling the overall tilt angle and the structure of the tail\nimposed by trans/gauche configurations of torsion angles in the tail,\nrespectively, a more detailed picture of the impact of sterols can be\nformulated, revealing, e.g., an approximate temperature-concentration\nsuperposition ranging from the liquid to the gel phase. Furthermore, a new\nquantitative measure to identify the presence of collective sterol effects is\ndiscussed. Moreover, when comparing both types of sterols, addition of\ncholesterol has a noticeably stronger impact on phospholipid properties than of\nergosterol. The observed differences can be attributed to higher planarity of\nthe cholesterol ring system. This planarity combined with an inherent asymmetry\nin its molecular interactions leads to better alignment and hence stronger\ninteraction with saturated acyl chains. Our results suggest that the high order\ndemonstrated for ergosterol in fungal plasma membranes must therefore be\ngenerated via additional mechanisms.\n", "versions": [{"version": "v1", "created": "Fri, 17 Jul 2020 15:46:08 GMT"}, {"version": "v2", "created": "Mon, 20 Jul 2020 15:39:18 GMT"}, {"version": "v3", "created": "Tue, 21 Jul 2020 07:15:23 GMT"}, {"version": "v4", "created": "Tue, 26 Jan 2021 13:48:22 GMT"}, {"version": "v5", "created": "Mon, 19 Apr 2021 08:09:49 GMT"}, {"version": "v6", "created": "Mon, 12 Jul 2021 10:02:30 GMT"}], "update_date": "2021-07-13", "authors_parsed": [["Alavizargar", "Azadeh", ""], ["Keller", "Fabian", ""], ["Wedlich-Söldner", "R.", ""], ["Heuer", "Andreas", ""]]}, {"id": "2007.13368", "submitter": "Henning Stumpf", "authors": "Henning Stumpf (1), Andreja Ambriovi\\'c-Ristov (2), Aleksandra\n  Radenovic (3), Ana-Sun\\v{c}ana Smith (1 and 4) ((1) PULS Group, Institute for\n  Theoretical Physics, Interdisciplinary Center for Nanostructured Films,\n  Friedrich-Alexander-Universit\\\"at Erlangen-N\\\"urnberg, Erlangen, Germany, (2)\n  Laboratory for Cell Biology and Signalling, Division of Molecular Biology,\n  Ru{\\dj}er Bo\\v{s}kovi\\'c Institute, Zagreb, Croatia, (3) Laboratory of\n  Nanoscale Biology, \\'Ecole Polytechnique F\\'ed\\'erale de Lausanne, Lausanne,\n  Switzerland, (4) Group for Computational Life Sciences, Department of\n  Physical Chemistry, Ru{\\dj}er Bo\\v{s}kovi\\'c Institute, Zagreb, Croatia)", "title": "Recent Advances and Prospects in the Research of Nascent Adhesions", "comments": "38 pages, 2 figures, review article", "journal-ref": null, "doi": "10.3389/fphys.2020.574371", "report-no": null, "categories": "q-bio.SC physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Nascent adhesions are submicron transient structures promoting the early\nadhesion of cells to the extracellular matrix. Nascent adhesions typically\nconsist of several tens of integrins, and serve as platforms for the\nrecruitment and activation of proteins to build mature focal adhesions. They\nare also associated with early stage signalling and the mechanoresponse.\nDespite their crucial role in sampling the local extracellular matrix, very\nlittle is known about the mechanism of their formation. Consequently, there is\na strong scientific activity focused on elucidating the physical and\nbiochemical foundation of their development and function. Precisely the results\nof this effort will be summarized in this article.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jul 2020 08:35:15 GMT"}], "update_date": "2021-01-19", "authors_parsed": [["Stumpf", "Henning", "", "1 and 4"], ["Ambriović-Ristov", "Andreja", "", "1 and 4"], ["Radenovic", "Aleksandra", "", "1 and 4"], ["Smith", "Ana-Sunčana", "", "1 and 4"]]}, {"id": "2007.14965", "submitter": "Changjiang Liu", "authors": "Changjiang Liu, Paolo Elvati, Angela Violi", "title": "Antiviral Drug-Membrane Permeability: the Viral Envelope and Cellular\n  Organelles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM q-bio.QM q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To shorten the time required to find effective new drugs, like antivirals, a\nkey parameter to consider is membrane permeability, as a compound intended for\nan intracellular target with poor permeability will have low efficacy. Here, we\npresent a computational model that considers both drug characteristics and\nmembrane properties for the rapid assessment of drugs permeability through the\ncoronavirus envelope and various cellular membranes. We analyze 79 drugs that\nare considered as potential candidates for the treatment of SARS-CoV-2 and\ndetermine their time of permeation in different organelle membranes grouped by\nviral baits and mammalian processes. The computational results are correlated\nwith experimental data, present in the literature, on bioavailability of the\ndrugs, showing a negative correlation between fast permeation and most\npromising drugs. This model represents an important tool capable of evaluating\nhow permeability affects the ability of compounds to reach both intended and\nunintended intracellular targets in an accurate and rapid way. The method is\ngeneral and flexible and can be employed for a variety of molecules, from small\ndrugs to nanoparticles, as well to a variety of biological membranes.\n", "versions": [{"version": "v1", "created": "Wed, 29 Jul 2020 17:16:45 GMT"}], "update_date": "2020-07-30", "authors_parsed": [["Liu", "Changjiang", ""], ["Elvati", "Paolo", ""], ["Violi", "Angela", ""]]}]