[{"id": "2104.00102", "submitter": "Farzad Pourbabaee", "authors": "Farzad Pourbabaee", "title": "Robust Experimentation in the Continuous Time Bandit Problem", "comments": null, "journal-ref": "Economic Theory, pp. 1-31, 2000, Springer", "doi": "10.1007/s00199-020-01328-3", "report-no": null, "categories": "econ.TH cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the experimentation dynamics of a decision maker (DM) in a two-armed\nbandit setup (Bolton and Harris (1999)), where the agent holds ambiguous\nbeliefs regarding the distribution of the return process of one arm and is\ncertain about the other one. The DM entertains Multiplier preferences a la\nHansen and Sargent (2001), thus we frame the decision making environment as a\ntwo-player differential game against nature in continuous time. We characterize\nthe DM value function and her optimal experimentation strategy that turns out\nto follow a cut-off rule with respect to her belief process. The belief\nthreshold for exploring the ambiguous arm is found in closed form and is shown\nto be increasing with respect to the ambiguity aversion index. We then study\nthe effect of provision of an unambiguous information source about the\nambiguous arm. Interestingly, we show that the exploration threshold rises\nunambiguously as a result of this new information source, thereby leading to\nmore conservatism. This analysis also sheds light on the efficient time to\nreach for an expert opinion.\n", "versions": [{"version": "v1", "created": "Wed, 31 Mar 2021 20:42:39 GMT"}], "update_date": "2021-04-02", "authors_parsed": [["Pourbabaee", "Farzad", ""]]}, {"id": "2104.00159", "submitter": "Daniel Reusche", "authors": "Daniel Reusche, Nicol\\'as Della Penna", "title": "Towards Prior-Free Approximately Truthful One-Shot Auction Learning via\n  Differential Privacy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Designing truthful, revenue maximizing auctions is a core problem of auction\ndesign. Multi-item settings have long been elusive. Recent work\n(arXiv:1706.03459) introduces effective deep learning techniques to find such\nauctions for the prior-dependent setting, in which distributions about bidder\npreferences are known. One remaining problem is to obtain priors in a way that\nexcludes the possibility of manipulating the resulting auctions. Using\ntechniques from differential privacy for the construction of approximately\ntruthful mechanisms, we modify the RegretNet approach to be applicable to the\nprior-free setting. In this more general setting, no distributional information\nis assumed, but we trade this property for worse performance. We present\npreliminary empirical results and qualitative analysis for this work in\nprogress.\n", "versions": [{"version": "v1", "created": "Wed, 31 Mar 2021 23:22:55 GMT"}], "update_date": "2021-04-02", "authors_parsed": [["Reusche", "Daniel", ""], ["Della Penna", "Nicolás", ""]]}, {"id": "2104.00176", "submitter": "Abhishek Kulkarni", "authors": "Abhishek N. Kulkarni, Shuo Han, Nandi O. Leslie, Charles A. Kamhoua,\n  and Jie Fu", "title": "Qualitative Planning in Imperfect Information Games with Active Sensing\n  and Reactive Sensor Attacks: Cost of Unawareness", "comments": "7 pages, 5 figures, Submitted to CDC2021; Revised Alg. 2 to fix a\n  typo and notation, results unchanged", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the probabilistic planning problem where the agent (called Player\n1, or P1) can jointly plan the control actions and sensor queries in a sensor\nnetwork and an attacker (called player 2, or P2) can carry out attacks on the\nsensors. We model such an adversarial interaction using a formal model -- a\nreachability game with partially controllable observation functions. The main\ncontribution of this paper is to assess the cost of P1's unawareness: Suppose\nP1 misinterprets the sensor failures as probabilistic node failures due to\nunreliable network communication, and P2 is aware of P1's misinterpretation in\naddition to her partial observability. Then, from which states can P2 carry out\nsensor attacks to ensure, with probability one, that P1 will not be able to\ncomplete her reachability task even though, due to misinterpretation, P1\nbelieves that she can almost-surely achieve her task. We develop an algorithm\nto solve the almost-sure winning sensor-attack strategy given P1's\nobservation-based strategy. Our attack analysis could be used for attack\ndetection in wireless communication networks and the design of provably secured\nattack-aware sensor allocation in decision-theoretic models for cyber-physical\nsystems.\n", "versions": [{"version": "v1", "created": "Thu, 1 Apr 2021 00:43:10 GMT"}, {"version": "v2", "created": "Sun, 2 May 2021 18:55:10 GMT"}], "update_date": "2021-05-04", "authors_parsed": [["Kulkarni", "Abhishek N.", ""], ["Han", "Shuo", ""], ["Leslie", "Nandi O.", ""], ["Kamhoua", "Charles A.", ""], ["Fu", "Jie", ""]]}, {"id": "2104.00357", "submitter": "Charlotte Roman", "authors": "Charlotte Roman, Paolo Turrini", "title": "Bounding the Inefficiency of Route Control in Intelligent Transport\n  Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Route controlled autonomous vehicles could have a significant impact in\nreducing congestion in the future. Before applying multi-agent reinforcement\nlearning algorithms to route control, we can model the system using a\ncongestion game to predict and mitigate potential issues. We consider the\nproblem of distributed operating systems in a transportation network that\ncontrol the routing choices of their assigned vehicles. We formulate an\nassociated network control game, consisting of multiple actors seeking to\noptimise the social welfare of their assigned subpopulations in an underlying\nnonatomic congestion game. Then we find the inefficiency of the routing\nequilibria by calculating the Price of Anarchy for polynomial cost functions.\nFinally, we extend the analysis to allow vehicles to choose their operating\nsystem.\n", "versions": [{"version": "v1", "created": "Thu, 1 Apr 2021 09:23:54 GMT"}], "update_date": "2021-04-02", "authors_parsed": [["Roman", "Charlotte", ""], ["Turrini", "Paolo", ""]]}, {"id": "2104.00835", "submitter": "Juntao Wang Mr", "authors": "Yiling Chen, Alon Eden, Juntao Wang", "title": "Cursed yet Satisfied Agents", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In real life auctions, a widely observed phenomenon is the winner's curse --\nthe winner's high bid implies that the winner often over-estimates the value of\nthe good for sale, resulting in an incurred negative utility. The seminal work\nof Eyster and Rabin [Econometrica'05] introduced a behavioral model aimed to\nexplain this observed anomaly. We term agents who display this bias \"cursed\nagents\". We adopt their model in the interdependent value setting, and aim to\ndevise mechanisms that prevent the cursed agents from obtaining negative\nutility. We design mechanisms that are cursed ex-post IC, that is, incentivize\nagents to bid their true signal even though they are cursed, while ensuring\nthat the outcome is individually rational -- the price the agents pay is no\nmore than the agents' true value.\n  Since the agents might over-estimate the good's value, such mechanisms might\nrequire the seller to make positive transfers to the agents to prevent agents\nfrom over-paying. For revenue maximization, we give the optimal deterministic\nand anonymous mechanism. For welfare maximization, we require ex-post budget\nbalance (EPBB), as positive transfers might lead to negative revenue. We\npropose a masking operation that takes any deterministic mechanism, and imposes\nthat the seller would not make positive transfers, enforcing EPBB. We show that\nin typical settings, EPBB implies that the mechanism cannot make any positive\ntransfers, implying that applying the masking operation on the fully efficient\nmechanism results in a socially optimal EPBB mechanism. This further implies\nthat if the valuation function is the maximum of agents' signals, the optimal\nEPBB mechanism obtains zero welfare. In contrast, we show that for sum-concave\nvaluations, which include weighted-sum valuations and l_p-norms, the welfare\noptimal EPBB mechanism obtains half of the optimal welfare as the number of\nagents grows large.\n", "versions": [{"version": "v1", "created": "Fri, 2 Apr 2021 01:15:53 GMT"}, {"version": "v2", "created": "Wed, 12 May 2021 01:47:12 GMT"}], "update_date": "2021-05-13", "authors_parsed": [["Chen", "Yiling", ""], ["Eden", "Alon", ""], ["Wang", "Juntao", ""]]}, {"id": "2104.01520", "submitter": "Gabriele Farina", "authors": "Gabriele Farina, Andrea Celli, Alberto Marchesi, Nicola Gatti", "title": "Simple Uncoupled No-Regret Learning Dynamics for Extensive-Form\n  Correlated Equilibrium", "comments": "Extended version of our NeurIPS 2020 paper. Compared to the\n  conference version, this preprint gives finer, in-high-probability regret\n  bounds. We also better connected our work to the phi-regret minimization\n  framework", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG cs.MA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The existence of simple uncoupled no-regret learning dynamics that converge\nto correlated equilibria in normal-form games is a celebrated result in the\ntheory of multi-agent systems. Specifically, it has been known for more than 20\nyears that when all players seek to minimize their internal regret in a\nrepeated normal-form game, the empirical frequency of play converges to a\nnormal-form correlated equilibrium. Extensive-form games generalize normal-form\ngames by modeling both sequential and simultaneous moves, as well as imperfect\ninformation. Because of the sequential nature and presence of private\ninformation in the game, correlation in extensive-form games possesses\nsignificantly different properties than its counterpart in normal-form games,\nmany of which are still open research directions. Extensive-form correlated\nequilibrium (EFCE) has been proposed as the natural extensive-form counterpart\nto the classical notion of correlated equilibrium in normal-form games.\nCompared to the latter, the constraints that define the set of EFCEs are\nsignificantly more complex, as the correlation device must keep into account\nthe evolution of beliefs of each player as they make observations throughout\nthe game. Due to that significant added complexity, the existence of uncoupled\nlearning dynamics leading to an EFCE has remained a challenging open research\nquestion for a long time. In this article, we settle that question by giving\nthe first uncoupled no-regret dynamics that converge to the set of EFCEs in\nn-player general-sum extensive-form games with perfect recall. We show that\neach iterate can be computed in time polynomial in the size of the game tree,\nand that, when all players play repeatedly according to our learning dynamics,\nthe empirical frequency of play is proven to be a O(T^-0.5)-approximate EFCE\nwith high probability after T game repetitions, and an EFCE almost surely in\nthe limit.\n", "versions": [{"version": "v1", "created": "Sun, 4 Apr 2021 02:26:26 GMT"}, {"version": "v2", "created": "Thu, 27 May 2021 06:03:22 GMT"}], "update_date": "2021-05-28", "authors_parsed": [["Farina", "Gabriele", ""], ["Celli", "Andrea", ""], ["Marchesi", "Alberto", ""], ["Gatti", "Nicola", ""]]}, {"id": "2104.01828", "submitter": "Esmaeil Delfarazpahlevanloo", "authors": "Ruben Becker, Gianlorenzo D'Angelo, Esmaeil Delfaraz and Hugo Gilbert", "title": "When Can Liquid Democracy Unveil the Truth?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.SI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In this paper, we investigate the so-called ODP-problem that has been\nformulated by Caragiannis and Micha [10]. Here, we are in a setting with two\nelection alternatives out of which one is assumed to be correct. In ODP, the\ngoal is to organise the delegations in the social network in order to maximize\nthe probability that the correct alternative, referred to as ground truth, is\nelected. While the problem is known to be computationally hard, we strengthen\nexisting hardness results by providing a novel strong approximation hardness\nresult: For any positive constant $C$, we prove that, unless $P=NP$, there is\nno polynomial-time algorithm for ODP that achieves an approximation guarantee\nof $\\alpha \\ge (\\ln n)^{-C}$, where $n$ is the number of voters. The reduction\ndesigned for this result uses poorly connected social networks in which some\nvoters suffer from misinformation. Interestingly, under some hypothesis on\neither the accuracies of voters or the connectivity of the network, we obtain a\npolynomial-time $1/2$-approximation algorithm. This observation proves formally\nthat the connectivity of the social network is a key feature for the efficiency\nof the liquid democracy paradigm. Lastly, we run extensive simulations and\nobserve that simple algorithms (working either in a centralized or\ndecentralized way) outperform direct democracy on a large class of instances.\nOverall, our contributions yield new insights on the question in which\nsituations liquid democracy can be beneficial.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2021 09:45:14 GMT"}], "update_date": "2021-04-06", "authors_parsed": [["Becker", "Ruben", ""], ["D'Angelo", "Gianlorenzo", ""], ["Delfaraz", "Esmaeil", ""], ["Gilbert", "Hugo", ""]]}, {"id": "2104.02050", "submitter": "Philip Lazos", "authors": "Paul D\\\"utting, Federico Fusco, Philip Lazos, Stefano Leonardi,\n  Rebecca Reiffenh\\\"auser", "title": "Prophet Inequalities for Matching with a Single Sample", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the prophet inequality problem for (not necessarily bipartite)\nmatching problems with independent edge values, under both edge arrivals and\nvertex arrivals. We show constant-factor prophet inequalities for the case\nwhere the online algorithm has only limited access to the value distributions\nthrough samples. First, we give a $16$-approximate prophet inequality for\nmatching in general graphs under edge arrivals that uses only a single sample\nfrom each value distribution as prior information. Then, for bipartite matching\nand (one-sided) vertex arrivals, we show an improved bound of $8$ that also\nuses just a single sample from each distribution. Finally, we show how to turn\nour $16$-approximate single-sample prophet inequality into a truthful\nsingle-sample mechanism for online bipartite matching with vertex arrivals.\n", "versions": [{"version": "v1", "created": "Mon, 5 Apr 2021 17:58:36 GMT"}], "update_date": "2021-04-06", "authors_parsed": [["Dütting", "Paul", ""], ["Fusco", "Federico", ""], ["Lazos", "Philip", ""], ["Leonardi", "Stefano", ""], ["Reiffenhäuser", "Rebecca", ""]]}, {"id": "2104.02759", "submitter": "Ivan Geffner", "authors": "Ivan Geffner, Joseph Y. Halpern", "title": "Lower Bounds Implementing Mediators in Asynchronous Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR cs.DC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Abraham, Dolev, Geffner, and Halpern proved that, in asynchronous systems, a\n$(k,t)$-robust equilibrium for $n$ players and a trusted mediator can be\nimplemented without the mediator as long as $n > 4(k+t)$, where an equilibrium\nis $(k,t)$-robust if, roughly speaking, no coalition of $t$ players can\ndecrease the payoff of any of the other players, and no coalition of $k$\nplayers can increase their payoff by deviating. We prove that this bound is\ntight, in the sense that if $n \\le 4(k+t)$ there exist $(k,t)$-robust\nequilibria with a mediator that cannot be implemented by the players alone.\nEven though implementing $(k,t)$-robust mediators seems closely related to\nimplementing asynchronous multiparty $(k+t)$-secure computation \\cite{BCG93},\nto the best of our knowledge there is no known straightforward reduction from\none problem to another. Nevertheless, we show that there is a non-trivial\nreduction from a slightly weaker notion of $(k+t)$-secure computation, which we\ncall $(k+t)$-strict secure computation, to implementing $(k,t)$-robust\nmediators. We prove the desired lower bound by showing that there are functions\non $n$ variables that cannot be $(k+t)$-strictly securely computed if $n \\le\n4(k+t)$. This also provides a simple alternative proof for the well-known lower\nbound of $4t+1$ on asynchronous secure computation in the presence of up to $t$\nmalicious agents.\n", "versions": [{"version": "v1", "created": "Tue, 6 Apr 2021 19:45:20 GMT"}], "update_date": "2021-04-08", "authors_parsed": [["Geffner", "Ivan", ""], ["Halpern", "Joseph Y.", ""]]}, {"id": "2104.02936", "submitter": "Qianlan Bai", "authors": "Qianlan Bai and Yuedong Xu and Xin Wang", "title": "Understanding the Benefit of Being Patient in Payment Channel Networks", "comments": "11 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scaling blockchain efficiency is crucial to its widespread usage in which the\npayment channel is one of the most prominent approaches. With payment channels\nand the network they construct, two users can move some transactions off-chain\nin a predetermined duration to avoid expensive and time-consuming on-chain\nsettlements. Existing work is devoted to designing high-throughput payment\nchannel networks (PCNs) or efficient PCN routing policies to reduce the fee. In\nthis paper, we investigate the PCN routing from a different perspective by\nanswering whether the routing fee of transactions can be saved by being a bit\nmore patient. The key idea is to reorder the processing sequence of atomic\ntransactions, other than to handle each of them separately and immediately. We\npresent two mechanisms, one is periodic transaction processing assisted by a\nPCN broker and the other is purely strategic waiting. In the former, all the\nincoming transactions in a short time interval are processed collectively. We\nformulate an optimization model to minimize their total routing fee and derive\nthe optimal permutation of processing transactions as well as the routing\npolicy for each of them. A Shapley value based scheme is presented to\nredistribute the benefit of reordering among the transactions efficiently and\nfairly. In the latter, we model the waiting time of a strategic transaction on\na single payment channel as the first passage time problem in queueing theory\nwhen the transaction value is higher than the edge capacity upon its arrival.\nBy capturing the capacity dynamics, we are able to calculate the recursive\nexpression of waiting for time distribution that is useful to gauge a user's\ncost of patience. Experimental results manifest that our cost redistribution\nmechanism can effectively save routing fees for all the transactions, and the\nwaiting time distribution coincides with the model well.\n", "versions": [{"version": "v1", "created": "Wed, 7 Apr 2021 06:11:58 GMT"}], "update_date": "2021-04-08", "authors_parsed": [["Bai", "Qianlan", ""], ["Xu", "Yuedong", ""], ["Wang", "Xin", ""]]}, {"id": "2104.03347", "submitter": "Frederick Vincent", "authors": "Frederick M. Vincent and Dashiell E.A. Fryer", "title": "Top Score in Axelrod Tournament", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  The focus of the project will be an examination of obtaining the highest\nscore in the Axelrod Tournament. The initial design of the highest score in the\nAxelrod Tournament consisted of looking at the Cooperation rates of the top\nstrategies currently in the Axelrod Library. After creating an initial Finite\nState Machine strategy that utilized the Cooperation Rates of the top players;\nour ten-state FSM finished within the top 35 players out of 220 in the short\nrun time strategies in the Axelrod Library. After a quick evolutionary\nalgorithm, 50 generations, our original ten-state FSM was changed into an\neight-state FSM, which finished within the top 5 of the short run time\nstrategies in the Axelrod Library. This eight-state FSM was then evolved again\nusing a full evolutionary algortihm process, which lasted 500 generations,\nwhere the eight-state FSM evolved into a another eight-state FSM which finishes\nfirst in the Axelrod Library among the short run time strategies and the full\nAxelrod Tournament. From that final FSM, two of the eight states are\ninaccessible, so the final FSM strategy is a six-state FSM that finishes first\nin the Full Axelrod Tournament, against the short run time strategies as well\nas the long run time strategies.\n", "versions": [{"version": "v1", "created": "Wed, 7 Apr 2021 18:42:18 GMT"}], "update_date": "2021-04-09", "authors_parsed": [["Vincent", "Frederick M.", ""], ["Fryer", "Dashiell E. A.", ""]]}, {"id": "2104.03487", "submitter": "Chao Huang", "authors": "Chao Huang, Haoran Yu, Jianwei Huang, Randall A. Berry", "title": "Strategic Information Revelation in Crowdsourcing Systems Without\n  Verification", "comments": "To appear in IEEE INFOCOM 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a crowdsourcing problem where the platform aims to incentivize\ndistributed workers to provide high quality and truthful solutions without the\nability to verify the solutions. While most prior work assumes that the\nplatform and workers have symmetric information, we study an asymmetric\ninformation scenario where the platform has informational advantages.\nSpecifically, the platform knows more information regarding worker average\nsolution accuracy, and can strategically reveal such information to workers.\nWorkers will utilize the announced information to determine the likelihood that\nthey obtain a reward if exerting effort on the task. We study two types of\nworkers, naive workers who fully trust the announcement, and strategic workers\nwho update prior belief based on the announcement. For naive workers, we show\nthat the platform should always announce a high average accuracy to maximize\nits payoff. However, this is not always optimal for strategic workers, as it\nmay reduce the credibility of the platform announcement and hence reduce the\nplatform payoff. Interestingly, the platform may have an incentive to even\nannounce an average accuracy lower than the actual value when facing strategic\nworkers. Another counterintuitive result is that the platform payoff may\ndecrease in the number of high accuracy workers.\n", "versions": [{"version": "v1", "created": "Thu, 8 Apr 2021 03:00:33 GMT"}, {"version": "v2", "created": "Fri, 9 Apr 2021 04:48:57 GMT"}], "update_date": "2021-04-12", "authors_parsed": [["Huang", "Chao", ""], ["Yu", "Haoran", ""], ["Huang", "Jianwei", ""], ["Berry", "Randall A.", ""]]}, {"id": "2104.03692", "submitter": "Esmaeil Delfaraz Pahlevanloo", "authors": "Gianlorenzo D'Angelo, Esmaeil Delfaraz and Hugo Gilbert", "title": "Computation and Bribery of Voting Power in Delegative Simple Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.SI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Weighted voting games is one of the most important classes of cooperative\ngames. Recently, Zhang and Grossi [53] proposed a variant of this class, called\ndelegative simple games, which is well suited to analyse the relative\nimportance of each voter in liquid democracy elections. Moreover, they defined\na power index, called the delagative Banzhaf index to compute the importance of\neach agent (i.e., both voters and delegators) in a delegation graph based on\ntwo key parameters: the total voting weight she has accumulated and the\nstructure of supports she receives from her delegators.\n  We obtain several results related to delegative simple games. We first\npropose a pseudo-polynomial time algorithm to compute the delegative Banzhaf\nand Shapley-Shubik values in delegative simple games. We then investigate a\nbribery problem where the goal is to maximize/minimize the voting power/weight\nof a given voter in a delegation graph by changing at most a fixed number of\ndelegations. We show that the problems of minimizing/maximizing a voter's power\nindex value are strongly NP-hard. Furthermore, we prove that having a better\napproximation guarantee than $1-1/e$ to maximize the voting weight of a voter\nis not possible, unless $P = NP$, then we provide some parameterized complexity\nresults for this problem. Finally, we show that finding a delegation graph with\na given number of gurus that maximizes the minimum power index value an agent\ncan have is a computationally hard problem.\n", "versions": [{"version": "v1", "created": "Thu, 8 Apr 2021 11:28:50 GMT"}], "update_date": "2021-04-09", "authors_parsed": [["D'Angelo", "Gianlorenzo", ""], ["Delfaraz", "Esmaeil", ""], ["Gilbert", "Hugo", ""]]}, {"id": "2104.04159", "submitter": "Harel Yedidsion", "authors": "Harel Yedidsion, Shani Alkoby, Peter Stone", "title": "Sequential Online Chore Division for Autonomous Vehicle Convoy Formation", "comments": "9 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chore division is a class of fair division problems in which some undesirable\n\"resource\" must be shared among a set of participants, with each participant\nwanting to get as little as possible. Typically the set of participants is\nfixed and known at the outset. This paper introduces a novel variant, called\nsequential online chore division (SOCD), in which participants arrive and\ndepart online, while the chore is being performed: both the total number of\nparticipants and their arrival/departure times are initially unknown. In SOCD,\nexactly one agent must be performing the chore at any give time (e.g. keeping\nlookout), and switching the performer incurs a cost. In this paper, we propose\nand analyze three mechanisms for SOCD: one centralized mechanism using side\npayments, and two distributed ones that seek to balance the participants'\nloads. Analysis and results are presented in a domain motivated by autonomous\nvehicle convoy formation, where the chore is leading the convoy so that all\nfollowers can enjoy reduced wind resistance.\n", "versions": [{"version": "v1", "created": "Fri, 9 Apr 2021 02:28:28 GMT"}], "update_date": "2021-04-12", "authors_parsed": [["Yedidsion", "Harel", ""], ["Alkoby", "Shani", ""], ["Stone", "Peter", ""]]}, {"id": "2104.04663", "submitter": "Ning Bao", "authors": "Faisal Shah Khan and Ning Bao", "title": "Quantum Prisoner's Dilemma and High Frequency Trading on the Quantum\n  Cloud", "comments": "10 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.CE cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  High-frequency trading (HFT) offers an excellent user case and a potential\nkiller application of the commercially available, first generation\nquasi-quantum communication and computation technologies. To this end, we offer\nhere a simple but complete game-theoretic model of HFT as the famous two player\ngame, Prisoner's Dilemma. We explore the implementation of HFT as a game on the\n(quasi) quantum cloud using the Eisert, Wilkens, and Lewenstein quantum\nmediated communication protocol, and how this implementation can increase\ntransaction speed and improve the lot of the players in HFT. Using cooperative\ngame-theoretic reasoning, we also note that in the near future when the\ninternet is properly quantum, players will be able to achieve Pareto-optimality\nin HFT as an instance of reinforced learning.\n", "versions": [{"version": "v1", "created": "Sat, 10 Apr 2021 01:45:37 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Khan", "Faisal Shah", ""], ["Bao", "Ning", ""]]}, {"id": "2104.04977", "submitter": "Uriel Feige", "authors": "Uriel Feige, Ariel Sapir, Laliv Tauber", "title": "A tight negative example for MMS fair allocations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of allocating indivisible goods to agents with\nadditive valuation functions. Kurokawa, Procaccia and Wang [JACM, 2018] present\ninstances for which every allocation gives some agent less than her maximin\nshare. We present such examples with larger gaps. For three agents and nine\nitems, we design an instance in which at least one agent does not get more than\na $\\frac{39}{40}$ fraction of her maximin share. Moreover, we show that there\nis no negative example in which the difference between the number of items and\nthe number of agents is smaller than six, and that the gap (of $\\frac{1}{40}$)\nof our example is worst possible among all instances with nine items.\n  For $n \\ge 4$ agents, we show examples in which at least one agent does not\nget more than a $1 - \\frac{1}{n^4}$ fraction of her maximin share. In the\ninstances designed by Kurokawa, Procaccia and Wang, the gap is exponentially\nsmall in $n$.\n", "versions": [{"version": "v1", "created": "Sun, 11 Apr 2021 10:01:16 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Feige", "Uriel", ""], ["Sapir", "Ariel", ""], ["Tauber", "Laliv", ""]]}, {"id": "2104.05069", "submitter": "Satpreet Harcharan Singh", "authors": "Satpreet H. Singh", "title": "A Non-Negative Matrix Factorization Game", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We present a novel game-theoretic formulation of Non-Negative Matrix\nFactorization (NNMF), a popular data-analysis method with many scientific and\nengineering applications. The game-theoretic formulation is shown to have\nfavorable scaling and parallelization properties, while retaining\nreconstruction and convergence performance comparable to the traditional\nMultiplicative Updates algorithm.\n", "versions": [{"version": "v1", "created": "Sun, 11 Apr 2021 18:25:34 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Singh", "Satpreet H.", ""]]}, {"id": "2104.05182", "submitter": "Hanrui Zhang", "authors": "Hanrui Zhang, Yu Cheng, Vincent Conitzer", "title": "Automated Mechanism Design for Classification with Partial Verification", "comments": "AAAI'21", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We study the problem of automated mechanism design with partial verification,\nwhere each type can (mis)report only a restricted set of types (rather than any\nother type), induced by the principal's limited verification power. We prove\nhardness results when the revelation principle does not necessarily hold, as\nwell as when types have even minimally different preferences. In light of these\nhardness results, we focus on truthful mechanisms in the setting where all\ntypes share the same preference over outcomes, which is motivated by\napplications in, e.g., strategic classification. We present a number of\nalgorithmic and structural results, including an efficient algorithm for\nfinding optimal deterministic truthful mechanisms, which also implies a faster\nalgorithm for finding optimal randomized truthful mechanisms via a\ncharacterization based on convexity. We then consider a more general setting,\nwhere the principal's cost is a function of the combination of outcomes\nassigned to each type. In particular, we focus on the case where the cost\nfunction is submodular, and give generalizations of essentially all our results\nin the classical setting where the cost function is additive. Our results\nprovide a relatively complete picture for automated mechanism design with\npartial verification.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 03:29:31 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Zhang", "Hanrui", ""], ["Cheng", "Yu", ""], ["Conitzer", "Vincent", ""]]}, {"id": "2104.05249", "submitter": "Benjamin Heymann", "authors": "Benjamin Heymann, Michel de Lara (CERMICS), Jean-Philippe Chancelier\n  (CERMICS)", "title": "Kuhn's Equivalence Theorem for Games in Product Form", "comments": "arXiv admin note: text overlap with arXiv:2006.14838", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an alternative to the tree representation of extensive form games.\nGames in product form represent information with $\\sigma$-fields over a product\nset, and do not require an explicit description of the play temporality, as\nopposed to extensive form games on trees. This representation encompasses games\nwith a continuum of actions, randomness and players, as well as games for which\nthe play order cannot be determined in advance. We adapt and prove Kuhn's\ntheorem-regarding equivalence between mixed and behavioral strategies under\nperfect recall-for games in product form with continuous action sets.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 07:33:32 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Heymann", "Benjamin", "", "CERMICS"], ["de Lara", "Michel", "", "CERMICS"], ["Chancelier", "Jean-Philippe", "", "CERMICS"]]}, {"id": "2104.05262", "submitter": "Pierre Ohlmann", "authors": "Thomas Colcombet, Nathana\\\"el Fijalkow, Pawe{\\l} Gawrychowski and\n  Pierre Ohlmann", "title": "The Theory of Universal Graphs for Infinite Duration Games", "comments": "43 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We introduce the notion of universal graphs as a tool for constructing\nalgorithms solving games of infinite duration such as parity games and mean\npayoff games. In the first part we develop the theory of universal graphs, with\ntwo goals: showing an equivalence and normalisation result between different\nrecently introduced related models, and constructing generic value iteration\nalgorithms for any positionally determined objective. In the second part we\ngive four applications: to parity games, to mean payoff games, and to\ncombinations of them (in the form of disjunctions of objectives). For each of\nthese four cases we construct algorithms achieving or improving over the best\nknown time and space complexity.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 07:53:43 GMT"}, {"version": "v2", "created": "Wed, 21 Apr 2021 13:15:26 GMT"}, {"version": "v3", "created": "Tue, 27 Jul 2021 08:44:47 GMT"}], "update_date": "2021-07-28", "authors_parsed": [["Colcombet", "Thomas", ""], ["Fijalkow", "Nathanaël", ""], ["Gawrychowski", "Paweł", ""], ["Ohlmann", "Pierre", ""]]}, {"id": "2104.05422", "submitter": "Stefan Edelkamp", "authors": "Stefan Edelkamp", "title": "ELO System for Skat and Other Games of Chance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Assessing the skill level of players to predict the outcome and to rank the\nplayers in a longer series of games is of critical importance for tournament\nplay. Besides weaknesses, like an observed continuous inflation, through a\nsteadily increasing playing body, the ELO ranking system, named after its\ncreator Arpad Elo, has proven to be a reliable method for calculating the\nrelative skill levels of players in zero-sum games.\n  The evaluation of player strength in trick-taking card games like Skat or\nBridge, however, is not obvious. Firstly, these are incomplete information\npartially observable games with more than one player, where opponent strength\nshould influence the scoring as it does in existing ELO systems. Secondly, they\nare game of both skill and chance, so that besides the playing strength the\noutcome of a game also depends on the deal. Last but not least, there are\ninternationally established scoring systems, in which the players are used to\nbe evaluated, and to which ELO should align. Based on a tournament scoring\nsystem, we propose a new ELO system for Skat to overcome these weaknesses.\n", "versions": [{"version": "v1", "created": "Wed, 7 Apr 2021 08:30:01 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Edelkamp", "Stefan", ""]]}, {"id": "2104.05425", "submitter": "Jan Maly", "authors": "Jan Maly", "title": "Ranking Sets of Objects: The Complexity of Avoiding Impossibility\n  Results", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The problem of lifting a preference order on a set of objects to a preference\norder on a family of subsets of this set is a fundamental problem with a wide\nvariety of applications in AI. The process is often guided by axioms\npostulating properties the lifted order should have. Well-known impossibility\nresults by Kannai and Peleg and by Barber\\`a and Pattanaik tell us that some\ndesirable axioms - namely dominance and (strict) independence - are not jointly\nsatisfiable for any linear order on the objects if all non-empty sets of\nobjects are to be ordered. On the other hand, if not all non-empty sets of\nobjects are to be ordered, the axioms are jointly satisfiable for all linear\norders on the objects for some families of sets. Such families are very\nimportant for applications as they allow for the use of lifted orders, for\nexample, in combinatorial voting. In this paper, we determine the computational\ncomplexity of recognizing such families. We show that it is $\\Pi_2^p$-complete\nto decide for a given family of subsets whether dominance and independence or\ndominance and strict independence are jointly satisfiable for all linear orders\non the objects if the lifted order needs to be total. Furthermore, we show that\nthe problem remains coNP-complete if the lifted order can be incomplete.\nAdditionally, we show that the complexity of these problem can increase\nexponentially if the family of sets is not given explicitly but via a succinct\ndomain restriction. Finally, we show that it is NP-complete to decide for\nfamily of subsets whether dominance and independence or dominance and strict\nindependence are jointly satisfiable for at least one linear orders on the\nobjects.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 12:54:28 GMT"}], "update_date": "2021-04-13", "authors_parsed": [["Maly", "Jan", ""]]}, {"id": "2104.05432", "submitter": "Nils Gumpfer", "authors": "Michael Guckert, Nils Gumpfer, Jennifer Hannig, Till Keller and Neil\n  Urquhart", "title": "A Conceptual Framework for Establishing Trust in Real World Intelligent\n  Systems", "comments": null, "journal-ref": null, "doi": "10.1016/j.cogsys.2021.04.001", "report-no": null, "categories": "cs.CY cs.AI cs.GT cs.HC cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intelligent information systems that contain emergent elements often\nencounter trust problems because results do not get sufficiently explained and\nthe procedure itself can not be fully retraced. This is caused by a control\nflow depending either on stochastic elements or on the structure and relevance\nof the input data. Trust in such algorithms can be established by letting users\ninteract with the system so that they can explore results and find patterns\nthat can be compared with their expected solution. Reflecting features and\npatterns of human understanding of a domain against algorithmic results can\ncreate awareness of such patterns and may increase the trust that a user has in\nthe solution. If expectations are not met, close inspection can be used to\ndecide whether a solution conforms to the expectations or whether it goes\nbeyond the expected. By either accepting or rejecting a solution, the user's\nset of expectations evolves and a learning process for the users is\nestablished. In this paper we present a conceptual framework that reflects and\nsupports this process. The framework is the result of an analysis of two\nexemplary case studies from two different disciplines with information systems\nthat assist experts in their complex tasks.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 12:58:47 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Guckert", "Michael", ""], ["Gumpfer", "Nils", ""], ["Hannig", "Jennifer", ""], ["Keller", "Till", ""], ["Urquhart", "Neil", ""]]}, {"id": "2104.05613", "submitter": "Tan Zhu", "authors": "Tan Zhu, Guannan Liang, Chunjiang Zhu, Haining Li, Jinbo Bi", "title": "An Efficient Algorithm for Deep Stochastic Contextual Bandits", "comments": "Accepted by AAAI 2021 Appendix uploaded", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In stochastic contextual bandit (SCB) problems, an agent selects an action\nbased on certain observed context to maximize the cumulative reward over\niterations. Recently there have been a few studies using a deep neural network\n(DNN) to predict the expected reward for an action, and the DNN is trained by a\nstochastic gradient based method. However, convergence analysis has been\ngreatly ignored to examine whether and where these methods converge. In this\nwork, we formulate the SCB that uses a DNN reward function as a non-convex\nstochastic optimization problem, and design a stage-wise stochastic gradient\ndescent algorithm to optimize the problem and determine the action policy. We\nprove that with high probability, the action sequence chosen by this algorithm\nconverges to a greedy action policy respecting a local optimal reward function.\nExtensive experiments have been performed to demonstrate the effectiveness and\nefficiency of the proposed algorithm on multiple real-world datasets.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 16:34:43 GMT"}, {"version": "v2", "created": "Thu, 22 Apr 2021 00:46:50 GMT"}], "update_date": "2021-04-23", "authors_parsed": [["Zhu", "Tan", ""], ["Liang", "Guannan", ""], ["Zhu", "Chunjiang", ""], ["Li", "Haining", ""], ["Bi", "Jinbo", ""]]}, {"id": "2104.05810", "submitter": "Lu An", "authors": "Lu An, Jie Duan, Mo-Yuen Chow, Alexandra Duel-Hallen", "title": "A Distributed and Resilient Bargaining Game for Weather-Predictive\n  Microgrid Energy Cooperation", "comments": "9 pages, 8 figures, published in IEEE Transactions on Industrial\n  Informatics", "journal-ref": "IEEE Transactions on Industrial Informatics 15 (8), 4721-4730,\n  2019", "doi": "10.1109/TII.2019.2907380", "report-no": null, "categories": "cs.MA cs.GT cs.SY eess.SY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A bargaining game is investigated for cooperative energy management in\nmicrogrids. This game incorporates a fully distributed and realistic\ncooperative power scheduling algorithm (CoDES) as well as a distributed Nash\nBargaining Solution (NBS)-based method of allocating the overall power bill\nresulting from CoDES. A novel weather-based stochastic renewable generation\n(RG) prediction method is incorporated in the power scheduling. We demonstrate\nthe proposed game using a 4-user grid-connected microgrid model with diverse\nuser demands, storage, and RG profiles and examine the effect of weather\nprediction on day-ahead power scheduling and cost/profit allocation. Finally,\nthe impact of users' ambivalence about cooperation and /or dishonesty on the\nbargaining outcome is investigated, and it is shown that the proposed game is\nresilient to malicious users' attempts to avoid payment of their fair share of\nthe overall bill.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 20:49:19 GMT"}], "update_date": "2021-04-14", "authors_parsed": [["An", "Lu", ""], ["Duan", "Jie", ""], ["Chow", "Mo-Yuen", ""], ["Duel-Hallen", "Alexandra", ""]]}, {"id": "2104.05849", "submitter": "Shashank Motepalli", "authors": "Shashank Motepalli and Hans-Arno Jacobsen", "title": "Reward Mechanism for Blockchains Using Evolutionary Game Theory", "comments": "Cite: @inproceedings{motepalli2021reward, title={Reward Mechanism for\n  Blockchains Using Evolutionary Game Theory}, author={Motepalli, Shashank and\n  Jacobsen, Hans-Arno}, booktitle={2021 3rd Conference on Blockchain Research &\n  Applications for Innovative Networks and Services (BRAINS)}, year={2021} }", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CE cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Blockchains have witnessed widespread adoption in the past decade in various\nfields. The growing demand makes their scalability and sustainability\nchallenges more evident than ever. As a result, more and more blockchains have\nbegun to adopt proof-of-stake (PoS) consensus protocols to address those\nchallenges. One of the fundamental characteristics of any blockchain technology\nis its crypto-economics and incentives. Lately, each PoS blockchain has\ndesigned a unique reward mechanism, yet, many of them are prone to free-rider\nand nothing-at-stake problems. To better understand the ad-hoc design of reward\nmechanisms, in this paper, we develop a reward mechanism framework that could\napply to many PoS blockchains. We formulate the block validation game wherein\nthe rewards are distributed for validating the blocks correctly. Using\nevolutionary game theory, we analyze how the participants' behaviour could\npotentially evolve with the reward mechanism. Also, penalties are found to play\na central role in maintaining the integrity of blockchains.\n", "versions": [{"version": "v1", "created": "Mon, 12 Apr 2021 22:38:32 GMT"}, {"version": "v2", "created": "Thu, 8 Jul 2021 18:56:06 GMT"}], "update_date": "2021-07-12", "authors_parsed": [["Motepalli", "Shashank", ""], ["Jacobsen", "Hans-Arno", ""]]}, {"id": "2104.06280", "submitter": "Halvard Hummel", "authors": "Halvard Hummel, Magnus Lie Hetland", "title": "Fair Allocation of Conflicting Items", "comments": "31 pages; Updated abstract; Added references and updated prior work", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study fair allocation of indivisible items, where the items are furnished\nwith a set of conflicts, and agents are not permitted to receive conflicting\nitems. This kind of constraint captures, for example, participating in events\nthat overlap in time, or taking on roles in the presence of conflicting\ninterests. We demonstrate, both theoretically and experimentally, that fairness\ncharacterizations such as EF1, MMS and MNW still are applicable and useful\nunder item conflicts. Among other existence, non-existence and computability\nresults, we show that a $1/\\Delta$-approximate MMS allocation for $n$ agents\nmay be found in polynomial time, for any conflict graph with maximum degree\n$n>\\Delta>2$, and that, if $n > \\Delta$, a 1/3-approximate MMS allocation\nalways exists.\n", "versions": [{"version": "v1", "created": "Tue, 13 Apr 2021 15:11:21 GMT"}, {"version": "v2", "created": "Fri, 16 Apr 2021 09:57:33 GMT"}], "update_date": "2021-04-19", "authors_parsed": [["Hummel", "Halvard", ""], ["Hetland", "Magnus Lie", ""]]}, {"id": "2104.06466", "submitter": "Luis Alberto Martinez-Vaquero", "authors": "Luis A. Martinez-Vaquero, Francisco C. Santos, Vito Trianni", "title": "Signalling boosts the evolution of cooperation in repeated group\n  interactions", "comments": null, "journal-ref": "Journal of the Royal Society Interface, 17(172), 20200635 (2020)", "doi": "10.1098/rsif.2020.0635", "report-no": null, "categories": "q-bio.PE cs.GT physics.soc-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Many biological and social systems show significant levels of collective\naction. Several cooperation mechanisms have been proposed, yet they have been\nmostly studied independently. Among these, direct reciprocity supports\ncooperation on the basis of repeated interactions among individuals. Signals\nand quorum dynamics may also drive cooperation. Here, we resort to an\nevolutionary game theoretical model to jointly analyse these two mechanisms and\nstudy the conditions in which evolution selects for direct reciprocity,\nsignalling, or their combination. We show that signalling alone leads to higher\nlevels of cooperation than when combined with reciprocity, while offering\nadditional robustness against errors. Specifically, successful strategies in\nthe realm of direct reciprocity are often not selected in the presence of\nsignalling, and memory of past interactions is only exploited opportunistically\nin case of earlier coordination failure. Differently, signalling always\nevolves, even when costly. In the light of these results, it may be easier to\nunderstand why direct reciprocity has been observed only in a limited number of\ncases among non-humans, whereas signalling is widespread at all levels of\ncomplexity.\n", "versions": [{"version": "v1", "created": "Tue, 13 Apr 2021 19:15:55 GMT"}], "update_date": "2021-04-15", "authors_parsed": [["Martinez-Vaquero", "Luis A.", ""], ["Santos", "Francisco C.", ""], ["Trianni", "Vito", ""]]}, {"id": "2104.07129", "submitter": "Jing Lu", "authors": "Jing Lu", "title": "On the approximation of queue-length distributions in transportation\n  networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SY eess.SY math.OC math.PR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper focuses on the analytical probabilistic modeling of vehicular\ntraffic. It formulates a stochastic node model. It then formulates a network\nmodel by coupling the node model with the link model of Lu and Osorio (2018),\nwhich is a stochastic formulation of the traffic-theoretic link transmission\nmodel. The proposed network model is scalable and computationally efficient,\nmaking it suitable for urban network optimization. For a network with $r$\nlinks, each of space capacity $\\ell$, the model has a complexity of\n$\\mathcal{O}(r\\ell)$. The network model yields the marginal distribution of\nlink states. The model is validated versus a simulation-based network\nimplementation of the stochastic link transmission model. The validation\nexperiments consider a set of small network with intricate traffic dynamics.\nFor all scenarios, the proposed model accurately captures the traffic dynamics.\nThe network model is used to address a signal control problem. Compared to the\nprobabilistic link model of Lu and Osorio (2018) with an exogenous node model\nand a benchmark deterministic network loading model, the proposed network model\nderives signal plans with better performance. The case study highlights the\nadded value of using between-link (i.e., across-node) interaction information\nfor traffic management and accounting for stochasticity in the network.\n", "versions": [{"version": "v1", "created": "Wed, 14 Apr 2021 21:18:02 GMT"}, {"version": "v2", "created": "Thu, 29 Apr 2021 05:12:27 GMT"}, {"version": "v3", "created": "Tue, 18 May 2021 02:21:08 GMT"}], "update_date": "2021-05-19", "authors_parsed": [["Lu", "Jing", ""]]}, {"id": "2104.07323", "submitter": "Wanyang Dai", "authors": "Wanyang Dai", "title": "Internet of quantum blockchains: security modeling and dynamic resource\n  pricing for stable digital currency", "comments": "40 pages, 11 figures. This paper initially appeared in Preprints\n  (called Proceeding) of 22th Annual Conference of Jiangsu Association of\n  Applied Statistics, pages 7-45, November 13-15, 2020, Suzhou, China", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.IT math.IT math.PR stat.ML", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Internet of quantum blockchains (IoB) will be the future Internet. In this\npaper, we make two new contributions to IoB: developing a block based quantum\nchannel networking technology to handle its security modeling in face of the\nquantum supremacy and establishing IoB based FinTech platform model with\ndynamic pricing for stable digital currency. The interaction between our new\ncontributions is also addressed. In doing so, we establish a generalized IoB\nsecurity model by quantum channel networking in terms of both time and space\nquantum entanglements with quantum key distribution (QKD). Our IoB can interact\nwith general structured things (e.g., supply chain systems) having online\ntrading and payment capability via stable digital currency and can handle\nvector-valued data streams requiring synchronized services. Thus, within our\ndesigned QKD, a generalized random number generator for private and public keys\nis proposed by a mixed zero-sum and non-zero-sum resource-competition pricing\npolicy. The effectiveness of this policy is justified by diffusion modeling\nwith approximation theory and numerical implementations.\n", "versions": [{"version": "v1", "created": "Thu, 15 Apr 2021 09:23:10 GMT"}], "update_date": "2021-04-16", "authors_parsed": [["Dai", "Wanyang", ""]]}, {"id": "2104.07387", "submitter": "Biaoshuai Tao", "authors": "Biaoshuai Tao", "title": "On Existence of Truthful Fair Cake Cutting Mechanisms", "comments": "17 pages, 6 figures in one table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the fair division problem on divisible heterogeneous resources (the\ncake cutting problem) with strategic agents, where each agent can manipulate\nhis/her private valuation in order to receive a better allocation. A\n(direct-revelation) mechanism takes agents' reported valuations as input, and\noutputs an allocation that satisfies a given fairness requirement. A natural\nand fundamental open problem, first raised by [Chen et al., 2010] and\nsubsequently raised by [Procaccia, 2013] [Aziz and Ye, 2014] [Branzei and\nMiltersen, 2015] [Menon and Larson, 2017] [Bei et al., 2017] [Bei et al.,\n2020], etc., is whether there exists a deterministic, truthful and envy-free\n(or even proportional) cake cutting mechanism. In this paper, we resolve this\nopen problem by proving that there does not exist a deterministic, truthful and\nproportional cake cutting mechanism, even in the special case where all of the\nfollowings hold: 1. there are only two agents; 2. each agent's valuation is a\npiecewise-constant function; 3. each agent is hungry: each agent has a strictly\npositive value on any part of the cake. The impossibility result extends to the\ncase where the mechanism is allowed to leave some part of the cake unallocated.\n  To circumvent this impossibility result, we aim to design mechanisms that\npossess certain degree of truthfulness. Motivated by the kind of truthfulness\npossessed by the classical I-cut-you-choose protocol, we define a weaker notion\nof truthfulness: the risk-averse truthfulness. We show that the well-known\nmoving-knife procedure and Even-Paz algorithm do not have this truthful\nproperty. We propose a mechanism that is risk-averse truthful and envy-free,\nand a mechanism that is risk-averse truthful and proportional that always\noutputs allocations with connected pieces.\n", "versions": [{"version": "v1", "created": "Thu, 15 Apr 2021 11:32:18 GMT"}], "update_date": "2021-04-16", "authors_parsed": [["Tao", "Biaoshuai", ""]]}, {"id": "2104.07466", "submitter": "Alexander Svozil", "authors": "Krishnendu Chatterjee, Wolfgang Dvo\\v{r}\\'ak, Monika Henzinger and\n  Alexander Svozil", "title": "Symbolic Time and Space Tradeoffs for Probabilistic Verification", "comments": "Accepted at LICS'21", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a faster symbolic algorithm for the following central problem in\nprobabilistic verification: Compute the maximal end-component (MEC)\ndecomposition of Markov decision processes (MDPs). This problem generalizes the\nSCC decomposition problem of graphs and closed recurrent sets of Markov chains.\nThe model of symbolic algorithms is widely used in formal verification and\nmodel-checking, where access to the input model is restricted to only symbolic\noperations (e.g., basic set operations and computation of one-step\nneighborhood). For an input MDP with $n$ vertices and $m$ edges, the classical\nsymbolic algorithm from the 1990s for the MEC decomposition requires $O(n^2)$\nsymbolic operations and $O(1)$ symbolic space. The only other symbolic\nalgorithm for the MEC decomposition requires $O(n \\sqrt{m})$ symbolic\noperations and $O(\\sqrt{m})$ symbolic space. A main open question is whether\nthe worst-case $O(n^2)$ bound for symbolic operations can be beaten. We present\na symbolic algorithm that requires $\\widetilde{O}(n^{1.5})$ symbolic operations\nand $\\widetilde{O}(\\sqrt{n})$ symbolic space. Moreover, the parametrization of\nour algorithm provides a trade-off between symbolic operations and symbolic\nspace: for all $0<\\epsilon \\leq 1/2$ the symbolic algorithm requires\n$\\widetilde{O}(n^{2-\\epsilon})$ symbolic operations and\n$\\widetilde{O}(n^{\\epsilon})$ symbolic space ($\\widetilde{O}$ hides\npoly-logarithmic factors).\n  Using our techniques we present faster algorithms for computing the\nalmost-sure winning regions of $\\omega$-regular objectives for MDPs. We\nconsider the canonical parity objectives for $\\omega$-regular objectives, and\nfor parity objectives with $d$-priorities we present an algorithm that computes\nthe almost-sure winning region with $\\widetilde{O}(n^{2-\\epsilon})$ symbolic\noperations and $\\widetilde{O}(n^{\\epsilon})$ symbolic space, for all $0 <\n\\epsilon \\leq 1/2$.\n", "versions": [{"version": "v1", "created": "Thu, 15 Apr 2021 13:53:28 GMT"}], "update_date": "2021-04-16", "authors_parsed": [["Chatterjee", "Krishnendu", ""], ["Dvořák", "Wolfgang", ""], ["Henzinger", "Monika", ""], ["Svozil", "Alexander", ""]]}, {"id": "2104.07542", "submitter": "Mariya Naumova", "authors": "Vladimir Gurvich, Mariya Naumova", "title": "On Nash-solvability of n-person graphical games under Markov's and a\n  priori realizations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider graphical $n$-person games with perfect information that have no\nNash equilibria in pure stationary strategies. Solving these games in mixed\nstrategies, we introduce probabilistic distributions in all non-terminal\npositions. The corresponding plays can be analyzed under two different basic\nassumptions: Markov's and a priori realizations. The former one guarantees\nexistence of a uniformly best response of each player in every situation.\nNevertheless, Nash equilibrium may fail to exist even in mixed strategies. The\nclassical Nash theorem is not applicable, since Markov's realizations may\nresult in the limit distributions and effective payoff functions that are not\ncontinuous. The a priori realization does not share many nice properties of the\nMarkov one (for example, existence of the uniformly best response) but in\nreturn, Nash's theorem is applicable. We illustrate both realizations in\ndetails by two examples with $2$ and $3$ players and also provide some general\nresults.\n", "versions": [{"version": "v1", "created": "Thu, 15 Apr 2021 15:54:35 GMT"}], "update_date": "2021-04-16", "authors_parsed": [["Gurvich", "Vladimir", ""], ["Naumova", "Mariya", ""]]}, {"id": "2104.08010", "submitter": "Ezra Tampubolon", "authors": "Ezra Tampubolon and Holger Boche", "title": "Welfare Measure for Resource Allocation with Algorithmic Implementation:\n  Beyond Average and Max-Min", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "eess.SY cs.GT cs.MA cs.NI cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we propose an axiomatic approach for measuring the\nperformance/welfare of a system consisting of concurrent agents in a\nresource-driven system. Our approach provides a unifying view on popular system\noptimality principles, such as the maximal average/total utilities and the\nmax-min fairness. Moreover, it gives rise to other system optimality notions\nthat have not been fully exploited yet, such as the maximal lowest total\nsubgroup utilities. For the axiomatically defined welfare measures, we provide\na generic gradient-based method to find an optimal resource allocation and\npresent a theoretical guarantee for its success. Lastly, we demonstrate the\npower of our approach through the power control application in wireless\nnetworks.\n", "versions": [{"version": "v1", "created": "Fri, 16 Apr 2021 10:11:01 GMT"}], "update_date": "2021-04-19", "authors_parsed": [["Tampubolon", "Ezra", ""], ["Boche", "Holger", ""]]}, {"id": "2104.08437", "submitter": "Suneel Sarswat", "authors": "Raja Natarajan and Suneel Sarswat and Abhishek Kr Singh", "title": "Verified Double Sided Auctions for Financial Markets", "comments": "ITP 21", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LO", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Double sided auctions are widely used in financial markets to match demand\nand supply. Prior works on double sided auctions have focused primarily on\nsingle quantity trade requests. We extend various notions of double sided\nauctions to incorporate multiple quantity trade requests and provide fully\nformalized matching algorithms for double sided auctions with their correctness\nproofs. We establish new uniqueness theorems that enable automatic detection of\nviolations in an exchange program by comparing its output with that of a\nverified program. All proofs are formalized in the Coq proof assistant without\nadding any axiom to the system. We extract verified OCaml and Haskell programs\nthat can be used by the exchanges and the regulators of the financial markets.\nWe demonstrate the practical applicability of our work by running the verified\nprogram on real market data from an exchange to automatically check for\nviolations in the exchange algorithm.\n", "versions": [{"version": "v1", "created": "Sat, 17 Apr 2021 03:58:31 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Natarajan", "Raja", ""], ["Sarswat", "Suneel", ""], ["Singh", "Abhishek Kr", ""]]}, {"id": "2104.08460", "submitter": "Kosuke Toda", "authors": "Kosuke Toda, Naomi Kuze, and Toshimitsu Ushio", "title": "Modeling and control of decision-making of miners in blockchain", "comments": "7 pages, 5 figures, submitted to the journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  To maintain blockchain-based services with ensuring its security, it is an\nimportant issue how to decide a mining reward so that the number of miners\nparticipating in the mining increases. We propose a dynamical model of\ndecision-making for miners using an evolutionary game approach and analyze the\nstability of equilibrium points of the proposed model. The proposed model is\ndescribed by the 1st-order differential equation. So, it is simple but its\ntheoretical analysis gives an insight into the characteristics of the\ndecision-making. Through the analysis of the equilibrium points, we show the\ntranscritical bifurcations and hysteresis phenomena of the equilibrium points.\nWe also design a controller that determines the mining reward based on the\nnumber of participating miners to stabilize the state that all miners\nparticipate in the mining. Numerical simulation shows that there is a trade-off\nin the choice of the design parameters.\n", "versions": [{"version": "v1", "created": "Sat, 17 Apr 2021 05:52:12 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Toda", "Kosuke", ""], ["Kuze", "Naomi", ""], ["Ushio", "Toshimitsu", ""]]}, {"id": "2104.08594", "submitter": "Dominik Peters", "authors": "Dominik Peters", "title": "Proportionality and Strategyproofness in Multiwinner Elections", "comments": "9 pages, AAMAS-18 paper with an error corrected (see note on first\n  page)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multiwinner voting rules can be used to select a fixed-size committee from a\nlarger set of candidates. We consider approval-based committee rules, which\nallow voters to approve or disapprove candidates. In this setting, several\nvoting rules such as Proportional Approval Voting (PAV) and Phragm\\'en's rules\nhave been shown to produce committees that are proportional, in the sense that\nthey proportionally represent voters' preferences; all of these rules are\nstrategically manipulable by voters. On the other hand, a generalisation of\nApproval Voting gives a non-proportional but strategyproof voting rule. We show\nthat there is a fundamental tradeoff between these two properties: we prove\nthat no multiwinner voting rule can simultaneously satisfy a weak form of\nproportionality (a weakening of justified representation) and a weak form of\nstrategyproofness. Our impossibility is obtained using a formulation of the\nproblem in propositional logic and applying SAT solvers; a human-readable\nversion of the computer-generated proof is obtained by extracting a minimal\nunsatisfiable set (MUS). We also discuss several related axiomatic questions in\nthe domain of committee elections.\n", "versions": [{"version": "v1", "created": "Sat, 17 Apr 2021 16:40:45 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Peters", "Dominik", ""]]}, {"id": "2104.08636", "submitter": "Christoph Riedl", "authors": "Michael Foley, Rory Smead, Patrick Forber, Christoph Riedl", "title": "Avoiding the bullies: The resilience of cooperation among unequals", "comments": null, "journal-ref": "PLoS Computational Biology 17(4): e1008847, 2021", "doi": "10.1371/journal.pcbi.1008847", "report-no": null, "categories": "physics.soc-ph cs.GT econ.TH nlin.AO q-bio.PE", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Can egalitarian norms or conventions survive the presence of dominant\nindividuals who are ensured of victory in conflicts? We investigate the\ninteraction of power asymmetry and partner choice in games of conflict over a\ncontested resource. We introduce three models to study the emergence and\nresilience of cooperation among unequals when interaction is random, when\nindividuals can choose their partners, and where power asymmetries dynamically\ndepend on accumulated payoffs. We find that the ability to avoid bullies with\nhigher competitive ability afforded by partner choice mostly restores\ncooperative conventions and that the competitive hierarchy never forms. Partner\nchoice counteracts the hyper dominance of bullies who are isolated in the\nnetwork and eliminates the need for others to coordinate in a coalition. When\ncompetitive ability dynamically depends on cumulative payoffs, complex cycles\nof coupled network-strategy-rank changes emerge. Effective collaborators gain\npopularity (and thus power), adopt aggressive behavior, get isolated, and\nultimately lose power. Neither the network nor behavior converge to a stable\nequilibrium. Despite the instability of power dynamics, the cooperative\nconvention in the population remains stable overall and long-term inequality is\ncompletely eliminated. The interaction between partner choice and dynamic power\nasymmetry is crucial for these results: without partner choice, bullies cannot\nbe isolated, and without dynamic power asymmetry, bullies do not lose their\npower even when isolated. We analytically identify a single critical point that\nmarks a phase transition in all three iterations of our models. This critical\npoint is where the first individual breaks from the convention and cycles start\nto emerge.\n", "versions": [{"version": "v1", "created": "Sat, 17 Apr 2021 19:55:26 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Foley", "Michael", ""], ["Smead", "Rory", ""], ["Forber", "Patrick", ""], ["Riedl", "Christoph", ""]]}, {"id": "2104.08994", "submitter": "Ashutosh Dutta", "authors": "Ashutosh Dutta, Ehab Al-Shaer, and Samrat Chatterjee", "title": "Constraints Satisfiability Driven Reinforcement Learning for Autonomous\n  Cyber Defense", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  With the increasing system complexity and attack sophistication, the\nnecessity of autonomous cyber defense becomes vivid for cyber and\ncyber-physical systems (CPSs). Many existing frameworks in the current\nstate-of-the-art either rely on static models with unrealistic assumptions, or\nfail to satisfy the system safety and security requirements. In this paper, we\npresent a new hybrid autonomous agent architecture that aims to optimize and\nverify defense policies of reinforcement learning (RL) by incorporating\nconstraints verification (using satisfiability modulo theory (SMT)) into the\nagent's decision loop. The incorporation of SMT does not only ensure the\nsatisfiability of safety and security requirements, but also provides constant\nfeedback to steer the RL decision-making toward safe and effective actions.\nThis approach is critically needed for CPSs that exhibit high risk due to\nsafety or security violations. Our evaluation of the presented approach in a\nsimulated CPS environment shows that the agent learns the optimal policy fast\nand defeats diversified attack strategies in 99\\% cases.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2021 01:08:30 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Dutta", "Ashutosh", ""], ["Al-Shaer", "Ehab", ""], ["Chatterjee", "Samrat", ""]]}, {"id": "2104.09003", "submitter": "Ted Ralphs", "authors": "Suresh Bolusani and Stefano Coniglio and Ted. K. Ralphs and Sahar\n  Tahernejad", "title": "A Unified Framework for Multistage and Multilevel Mixed Integer Linear\n  Optimization", "comments": null, "journal-ref": "Bilevel optimization: advances and next challenges, S. Dempe and\n  A. Zemkoho, Eds., Springer, 2020, p. 513-560", "doi": "10.1007/978-3-030-52119-6", "report-no": "Laboratory for Computational Optimization Research @ Lehigh (COR@L)\n  Technical Report 20T-005", "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a unified framework for the study of multilevel mixed integer\nlinear optimization problems and multistage stochastic mixed integer linear\noptimization problems with recourse. The framework highlights the common\nmathematical structure of the two problems and allows for the development of a\ncommon algorithmic framework. Focusing on the two-stage case, we investigate,\nin particular, the nature of the value function of the second-stage problem,\nhighlighting its connection to dual functions and the theory of duality for\nmixed integer linear optimization problems, and summarize different\nreformulations. We then present two main solution techniques, one based on a\nBenders-like decomposition to approximate either the risk function or the value\nfunction, and the other one based on cutting plane generation.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2021 01:39:11 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Bolusani", "Suresh", ""], ["Coniglio", "Stefano", ""], ["Ralphs", "Ted. K.", ""], ["Tahernejad", "Sahar", ""]]}, {"id": "2104.09010", "submitter": "Ted Ralphs", "authors": "Sahar Tahernejad and Ted K. Ralphs and Scott T. DeNegre", "title": "A Branch-and-Cut Algorithm for Mixed Integer Bilevel Linear Optimization\n  Problems and Its Implementation", "comments": null, "journal-ref": "Mathematical Programming Computation, vol. 12, p. 529-568, 2020", "doi": "10.1007/s12532-020-00183-6", "report-no": "Laboratory for Computational Optimization Research @ Lehigh (COR@L)\n  Technical Report 16T-015-R6", "categories": "math.OC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we describe a comprehensive algorithmic framework for solving\nmixed integer bilevel linear optimization problems (MIBLPs) using a generalized\nbranch-and-cut approach. The framework presented merges features from existing\nalgorithms (for both traditional mixed integer linear optimization and MIBLPs)\nwith new techniques to produce a flexible and robust framework capable of\nsolving a wide range of bilevel optimization problems. The framework has been\nfully implemented in the open-source solver MibS. The paper describes the\nalgorithmic options offered by MibS and presents computational results\nevaluating the effectiveness of the various options for the solution of a\nnumber of classes of bilevel optimization problems from the literature.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2021 01:53:38 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Tahernejad", "Sahar", ""], ["Ralphs", "Ted K.", ""], ["DeNegre", "Scott T.", ""]]}, {"id": "2104.09130", "submitter": "Piotr Skowron", "authors": "Piotr Faliszewski and Piotr Skowron and Nimrod Talmon", "title": "Bribery as a Measure of Candidate Success: Complexity Results for\n  Approval-Based Multiwinner Rules", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of bribery in multiwinner elections, for the case where\nthe voters cast approval ballots (i.e., sets of candidates they approve) and\nthe bribery actions are limited to: adding an approval to a vote, deleting an\napproval from a vote, or moving an approval within a vote from one candidate to\nthe other. We consider a number of approval-based multiwinner rules (AV, SAV,\nGAV, RAV, approval-based Chamberlin--Courant, and PAV). We find the landscape\nof complexity results quite rich, going from polynomial-time algorithms through\nNP-hardness with constant-factor approximations, to outright inapproximability.\nMoreover, in general, our problems tend to be easier when we limit out bribery\nactions on increasing the number of approvals of the candidate that we want to\nbe in a winning committee (i.e., adding approvals only for this preferred\ncandidate, or moving approvals only to him or her). We also study parameterized\ncomplexity of our problems, with a focus on parameterizations by the numbers of\nvoters or candidates.\n", "versions": [{"version": "v1", "created": "Mon, 19 Apr 2021 08:26:40 GMT"}], "update_date": "2021-04-20", "authors_parsed": [["Faliszewski", "Piotr", ""], ["Skowron", "Piotr", ""], ["Talmon", "Nimrod", ""]]}, {"id": "2104.09717", "submitter": "Pawe{\\l} Parys", "authors": "Karoliina Lehtinen, Pawe{\\l} Parys, Sven Schewe, Dominik Wojtczak", "title": "A Recursive Approach to Solving Parity Games in Quasipolynomial Time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Zielonka's classic recursive algorithm for solving parity games is perhaps\nthe simplest among the many existing parity game algorithms. However, its\ncomplexity is exponential, while currently the state-of-the-art algorithms have\nquasipolynomial complexity. Here, we present a modification of Zielonka's\nclassic algorithm that brings its complexity down to\n$n^{\\mathcal{O}\\left(\\log\\left(1+\\frac{d}{\\log n}\\right)\\right)}$, for parity\ngames of size $n$ with $d$ priorities, in line with previous\nquasipolynomial-time solutions.\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2021 02:10:01 GMT"}], "update_date": "2021-04-21", "authors_parsed": [["Lehtinen", "Karoliina", ""], ["Parys", "Paweł", ""], ["Schewe", "Sven", ""], ["Wojtczak", "Dominik", ""]]}, {"id": "2104.09942", "submitter": "Yevgeny Tsodikovich", "authors": "Galit Ashkenazi-Golan, Yevgeny Tsodikovich, Yannick Viossat", "title": "I Want to Tell You? Maximizing Revenue in First-Price Two-Stage Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH math.OC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A common practice in many auctions is to offer bidders an opportunity to\nimprove their bids, known as a Best and Final Offer (BAFO) stage. This final\nbid can depend on new information provided about either the asset or the\ncompetitors. This paper examines the effects of new information regarding\ncompetitors, seeking to determine what information the auctioneer should\nprovide assuming the set of allowable bids is discrete. The rational strategy\nprofile that maximizes the revenue of the auctioneer is the one where each\nbidder makes the highest possible bid that is lower than his valuation of the\nitem. This strategy profile is an equilibrium for a large enough number of\nbidders, regardless of the information released. We compare the number of\nbidders needed for this profile to be an equilibrium under different\ninformation settings. We find that it becomes an equilibrium with fewer bidders\nwhen less additional information is made available to the bidders regarding the\ncompetition. It follows that when the number of bidders is a priori unknown,\nthere are some advantages to the auctioneer to not reveal information.\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2021 13:06:59 GMT"}], "update_date": "2021-04-21", "authors_parsed": [["Ashkenazi-Golan", "Galit", ""], ["Tsodikovich", "Yevgeny", ""], ["Viossat", "Yannick", ""]]}, {"id": "2104.10134", "submitter": "Garima Shakya", "authors": "Aasheesh Dixit (1), Garima Shakya (2), Suresh Kumar Jakhar (1),\n  Swaprava Nath (2) ((1) Indian Institute of Management Lucknow, (2) Indian\n  Institute of Technology Kanpur)", "title": "Egalitarian and Congestion Aware Truthful Airport Slot Allocation\n  Mechanism", "comments": "Corrected typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We propose a mechanism to allocate slots fairly at congested airports. This\nmechanism: (a) ensures that the slots are allocated according to the true\nvaluations of airlines, (b) provides fair opportunities to the flights\nconnecting remote cities to large airports, and (c) controls the number of\nflights in each slot to minimize congestion. The mechanism draws inspiration\nfrom economic theory. It allocates the slots based on an affine maximizer\nallocation rule and charges payments to the airlines such that they are\nincentivized to reveal their true valuations. The allocation also optimizes the\noccupancy of every slot to keep them as uncongested as possible. The\nformulation solves an optimal integral solution in strongly polynomial time. We\nconduct experiments on the data collected from two major airports in India. We\nalso compare our results with existing allocations and also with the\nallocations based on the International Air Transport Association (IATA)\nguidelines. The computational results show that the social utility generated\nusing our mechanism is 20-30% higher than IATA and current allocations.\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2021 17:24:39 GMT"}, {"version": "v2", "created": "Sat, 24 Apr 2021 05:21:45 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Dixit", "Aasheesh", ""], ["Shakya", "Garima", ""], ["Jakhar", "Suresh Kumar", ""], ["Nath", "Swaprava", ""]]}, {"id": "2104.10236", "submitter": "Thomas Lidbetter Dr", "authors": "Lisa Hellerstein and Thomas Lidbetter", "title": "A Polyhedral Approach to Some Max-min Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.DM cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We consider a max-min variation of the classical problem of maximizing a\nlinear function over the base of a polymatroid. In our problem we assume that\nthe vector of coefficients of the linear function is not a known parameter of\nthe problem but is some vertex of a simplex, and we maximize the linear\nfunction in the worst case. Equivalently, we view the problem as a zero-sum\ngame between a maximizing player whose mixed strategy set is the base of the\npolymatroid and a minimizing player whose mixed strategy set is a simplex. We\nshow how to efficiently obtain optimal strategies for both players and an\nexpression for the value of the game. Furthermore, we give a characterization\nof the set of optimal strategies for the minimizing player. We consider four\nversions of the game and discuss the implications of our results for problems\nin search, sequential testing and queueing.\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2021 20:24:16 GMT"}], "update_date": "2021-04-22", "authors_parsed": [["Hellerstein", "Lisa", ""], ["Lidbetter", "Thomas", ""]]}, {"id": "2104.10262", "submitter": "Andr\\'es Molina-Markham", "authors": "Andres Molina-Markham, Ransom K. Winder, Ahmad Ridley", "title": "Network Defense is Not a Game", "comments": "AI4CS, April 2021, NY. arXiv admin note: substantial text overlap\n  with arXiv:2103.07583", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Research seeks to apply Artificial Intelligence (AI) to scale and extend the\ncapabilities of human operators to defend networks. A fundamental problem that\nhinders the generalization of successful AI approaches -- i.e., beating humans\nat playing games -- is that network defense cannot be defined as a single game\nwith a fixed set of rules. Our position is that network defense is better\ncharacterized as a collection of games with uncertain and possibly drifting\nrules. Hence, we propose to define network defense tasks as distributions of\nnetwork environments, to: (i) enable research to apply modern AI techniques,\nsuch as unsupervised curriculum learning and reinforcement learning for network\ndefense; and, (ii) facilitate the design of well-defined challenges that can be\nused to compare approaches for autonomous cyberdefense.\n  To demonstrate that an approach for autonomous network defense is practical\nit is important to be able to reason about the boundaries of its applicability.\nHence, we need to be able to define network defense tasks that capture sets of\nadversarial tactics, techniques, and procedures (TTPs); quality of service\n(QoS) requirements; and TTPs available to defenders. Furthermore, the\nabstractions to define these tasks must be extensible; must be backed by\nwell-defined semantics that allow us to reason about distributions of\nenvironments; and should enable the generation of data and experiences from\nwhich an agent can learn.\n  Our approach named Network Environment Design for Autonomous Cyberdefense\ninspired the architecture of FARLAND, a Framework for Advanced Reinforcement\nLearning for Autonomous Network Defense, which we use at MITRE to develop RL\nnetwork defenders that perform blue actions from the MITRE Shield matrix\nagainst attackers with TTPs that drift from MITRE ATT&CK TTPs.\n", "versions": [{"version": "v1", "created": "Tue, 20 Apr 2021 21:52:51 GMT"}], "update_date": "2021-04-22", "authors_parsed": [["Molina-Markham", "Andres", ""], ["Winder", "Ransom K.", ""], ["Ridley", "Ahmad", ""]]}, {"id": "2104.10528", "submitter": "Arkadi Predtetchinski", "authors": "J\\'anos Flesch and Arkadi Predtetchinski and Ville Suomala", "title": "Random perfect information games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH math.PR", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  The paper proposes a natural measure space of zero-sum perfect information\ngames with upper semicontinuous payoffs. Each game is specified by the game\ntree, and by the assignment of the active player and of the capacity to each\nnode of the tree. The payoff in a game is defined as the infimum of the\ncapacity over the nodes that have been visited during the play. The active\nplayer, the number of children, and the capacity are drawn from a given joint\ndistribution independently across the nodes. We characterize the cumulative\ndistribution function of the value $v$ using the fixed points of the so-called\nvalue generating function. The characterization leads to a necessary and\nsufficient condition for the event $v \\geq k$ to occur with positive\nprobability. We also study probabilistic properties of the set of Player I's\n$k$-optimal strategies and the corresponding plays.\n", "versions": [{"version": "v1", "created": "Wed, 21 Apr 2021 13:38:03 GMT"}], "update_date": "2021-04-22", "authors_parsed": [["Flesch", "János", ""], ["Predtetchinski", "Arkadi", ""], ["Suomala", "Ville", ""]]}, {"id": "2104.10639", "submitter": "Kathinka Frieswijk", "authors": "Kathinka Frieswijk, Alain Govaert, Ming Cao", "title": "Exerting Control in Repeated Social Dilemmas with Thresholds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Situations in which immediate self-interest and long-term collective interest\nconflict often require some form of influence to prevent them from leading to\nundesirable or unsustainable outcomes. Next to sanctioning, social influence\nand social structure, it is possible that strategic solutions can exist for\nthese social dilemmas. However, the existence of strategies that enable a\nplayer to exert control in the long-run outcomes can be difficult to show and\ndifferent situations allow for different levels of strategic influence. Here,\nwe investigate the effect of threshold nonlinearities on the possibilities of\nexerting unilateral control in finitely repeated n-player public goods games\nand snowdrift games. These models can describe situations in which a collective\neffort is necessary in order for a benefit to be created. We identify\nconditions in terms of a cooperator threshold for the existence of generous,\nextortionate and equalizing zero-determinant (ZD) strategies. Our results show\nthat, for both games, the thresholds prevent equalizing ZD strategies from\nexisting. In the snowdrift game, introducing a cooperator threshold has no\neffect on the region of feasible extortionate ZD strategies. For extortionate\nstrategies in the public goods game, the threshold only restricts the region of\nenforceable strategies for small values of the public goods multiplier.\nGenerous ZD strategies exist for both games, but introducing a cooperator\nthreshold forces the slope more towards the value of a fair strategy, where the\nplayer has approximately the same payoff as the average payoff of his\nopponents.\n", "versions": [{"version": "v1", "created": "Sun, 21 Feb 2021 09:56:32 GMT"}], "update_date": "2021-04-22", "authors_parsed": [["Frieswijk", "Kathinka", ""], ["Govaert", "Alain", ""], ["Cao", "Ming", ""]]}, {"id": "2104.11275", "submitter": "Junyao Zhao", "authors": "Aviad Rubinstein and Junyao Zhao", "title": "The Randomized Communication Complexity of Randomized Auctions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the communication complexity of incentive compatible\nauction-protocols between a monopolist seller and a single buyer with a\ncombinatorial valuation function over $n$ items. Motivated by the fact that\nrevenue-optimal auctions are randomized [Tha04,MV10,BCKW10,Pav11,HR15] (as well\nas by an open problem of Babaioff, Gonczarowski, and Nisan [BGN17]),we focus on\nthe randomized communication complexity of this problem (in contrast to most\nprior work on deterministic communication). We design simple, incentive\ncompatible, and revenue-optimal auction-protocols whose expected communication\ncomplexity is much (in fact infinitely) more efficient than their deterministic\ncounterparts. We also give nearly matching lower bounds on the expected\ncommunication complexity of approximately-revenue-optimal auctions. These\nresults follow from a simple characterization of incentive compatible\nauction-protocols that allows us to prove lower bounds against randomized\nauction-protocols. In particular, our lower bounds give the first\napproximation-resistant, exponential separation between communication\ncomplexity of incentivizing vs implementing a Bayesian incentive compatible\nsocial choice rule, settling an open question of Fadel and Segal [FS09].\n", "versions": [{"version": "v1", "created": "Thu, 22 Apr 2021 18:40:14 GMT"}], "update_date": "2021-04-26", "authors_parsed": [["Rubinstein", "Aviad", ""], ["Zhao", "Junyao", ""]]}, {"id": "2104.11298", "submitter": "Siddhartha Jayanti", "authors": "Siddhartha Jayanti", "title": "Nash Equilibria of The Multiplayer Colonel Blotto Game on Arbitrary\n  Measure Spaces", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Colonel Blotto Problem proposed by Borel in 1921 has served as a widely\napplicable model of budget-constrained simultaneous winner-take-all\ncompetitions in the social sciences. Applications include elections,\nadvertising, R&D and more. However, the classic Blotto problem and variants\nlimit the study to competitions over a finite set of discrete battlefields. In\nthis paper, we extend the classical theory to study multiplayer Blotto games\nover arbitrary measurable battlegrounds, provide an algorithm to efficiently\nsample equilibria of symmetric \"equipartionable\" Generalized Blotto games, and\ncharacterize the symmetric fair equilibria of the Blotto game over the unit\ninterval.\n", "versions": [{"version": "v1", "created": "Thu, 22 Apr 2021 19:52:47 GMT"}], "update_date": "2021-04-26", "authors_parsed": [["Jayanti", "Siddhartha", ""]]}, {"id": "2104.11618", "submitter": "Pascal Lenzner", "authors": "Wilhelm Friedemann, Tobias Friedrich, Hans Gawendowicz, Pascal\n  Lenzner, Anna Melnichenko, Jannik Peters, Daniel Stephan, Michael Vaichenker", "title": "Efficiency and Stability in Euclidean Network Design", "comments": "To appear at the 33rd ACM Symposium on Paralellism in Algorithms and\n  Architectures (SPAA), full version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network Design problems typically ask for a minimum cost sub-network from a\ngiven host network. This classical point-of-view assumes a central authority\nenforcing the optimum solution. But how should networks be designed to cope\nwith selfish agents that own parts of the network? In this setting, agents will\ndeviate from a minimum cost network if this decreases their individual cost.\nHence, designed networks should be both efficient in terms of total cost and\nstable in terms of the agents' willingness to accept the network.\n  We study this novel type of Network Design problem by investigating the\ncreation of $(\\beta,\\gamma)$-networks, that are in $\\beta$-approximate Nash\nequilibrium and have a total cost of at most $\\gamma$ times the optimal cost,\nfor the recently proposed Euclidean Generalized Network Creation Game by Bil\\`o\net al. [SPAA 2019]. There, $n$ agents corresponding to points in Euclidean\nspace create costly edges among themselves to optimize their centrality in the\ncreated network. Our main result is a simple $\\mathcal{O}(n^2)$-time algorithm\nthat computes a $(\\beta,\\beta)$-network with low $\\beta$ for any given set of\npoints. Moreover, on integer grid point sets or random point sets our algorithm\nachieves a low constant $\\beta$. Besides these results, we discuss a\ngeneralization of our algorithm to instances with arbitrary, even non-metric,\nedge lengths. Moreover, we show that no such positive results are possible when\nfocusing on either optimal networks or perfectly stable networks as in both\ncases NP-hard problems arise, there exist instances with very unstable optimal\nnetworks, and there are instances for perfectly stable networks with high total\ncost. Along the way, we significantly improve several results from Bil\\`o et\nal. and we asymptotically resolve their conjecture about the Price of Anarchy\nby providing a tight bound.\n", "versions": [{"version": "v1", "created": "Fri, 23 Apr 2021 14:12:13 GMT"}], "update_date": "2021-04-26", "authors_parsed": [["Friedemann", "Wilhelm", ""], ["Friedrich", "Tobias", ""], ["Gawendowicz", "Hans", ""], ["Lenzner", "Pascal", ""], ["Melnichenko", "Anna", ""], ["Peters", "Jannik", ""], ["Stephan", "Daniel", ""], ["Vaichenker", "Michael", ""]]}, {"id": "2104.11663", "submitter": "Beno\\^it Sohet", "authors": "Beno\\^it Sohet, Yezekael Hayel, Olivier Beaude, Jean-Baptiste Br\\'eal,\n  Alban Jeandin", "title": "Online smart charging algorithm with asynchronous electric vehicles\n  demand", "comments": "6 pages, 5 figures, ISGT Europe 2021 conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  The increasing penetration of Electric Vehicles (EVs) and renewable energies\ninto the grid necessitates tools to smooth the demand curve. To this end, this\npaper suggests an EV charging scheduling algorithm and a smart charging price.\nAs EVs arrive at the charging station and leave at different times, the\noperator of the station applies at each EV arrival an online scheduling\nalgorithm based on the concept of \"water filling. The EV charging price is\nguaranteed at their arrival and defined as a function of the online algorithm's\noutput, following the idea of locational marginal pricing. A numerical\ncomparison with the offline version of the algorithm -- in which the operator\nknows in advance all future arrival and departure times -- shows the efficiency\nof the suggested online scheduling algorithm.\n", "versions": [{"version": "v1", "created": "Fri, 23 Apr 2021 15:25:59 GMT"}], "update_date": "2021-04-26", "authors_parsed": [["Sohet", "Benoît", ""], ["Hayel", "Yezekael", ""], ["Beaude", "Olivier", ""], ["Bréal", "Jean-Baptiste", ""], ["Jeandin", "Alban", ""]]}, {"id": "2104.11676", "submitter": "Abhishek Kulkarni", "authors": "Abhishek N. Kulkarni and Jie Fu", "title": "Synthesis of Deceptive Strategies in Reachability Games with Action\n  Misperception (Technical Report)", "comments": "40 pages, 6 figures, under review Journal of AI Research (JAIR)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Strategic deception is an act of manipulating the opponent's perception to\ngain strategic advantages. In this paper, we study synthesis of deceptive\nwinning strategies in two-player turn-based zero-sum reachability games on\ngraphs with one-sided incomplete information of action sets. In particular, we\nconsider the class of games in which Player 1 (P1) starts with a non-empty set\nof private actions, which she may 'reveal' to Player 2 (P2) during the course\nof the game. P2 is equipped with an inference mechanism using which he updates\nhis perception of P1's action set whenever a new action is revealed. Under this\ninformation structure, the objective of P1 is to reach a set of goal states in\nthe game graph while that of P2 is to prevent it. We address the question: how\ncan P1 leverage her information advantages to deceive P2 into choosing actions\nthat in turn benefit P1? To this end, we introduce a dynamic hypergame model to\ncapture the reachability game with evolving misperception of P2. Analyzing the\ngame qualitatively, we design algorithms to synthesize deceptive sure and\nalmost-sure winning regions, and establish two key results: (1) under\nsure-winning condition, deceptive winning strategy is equivalent to the\nnon-deceptive winning strategy - i.e. use of deception has no advantages, (2)\nunder almost-sure winning condition, the deceptive winning strategy could be\nmore powerful than the non-deceptive strategy. We illustrate our algorithms\nusing a capture-the-flag game, and demonstrate the use of proposed approach to\na larger class of games with temporal logic objectives.\n", "versions": [{"version": "v1", "created": "Fri, 23 Apr 2021 16:12:01 GMT"}], "update_date": "2021-04-26", "authors_parsed": [["Kulkarni", "Abhishek N.", ""], ["Fu", "Jie", ""]]}, {"id": "2104.11884", "submitter": "Garima Shakya", "authors": "Deepesh Kumar Lall, Garima Shakya, Swaprava Nath", "title": "Prior-free Strategic Multiagent Scheduling with focus on Social\n  Distancing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Motivated by the need for social distancing during a pandemic, we consider an\napproach to schedule the visitors of a facility. The algorithm takes input from\ncitizens and schedules the store's time-slots based on their importance to\nvisit the facility (e.g., a general store). Naturally, the formulation applies\nto several similar problems. We consider the single slot and multiple slot\ndemands of the requests. The salient properties of our approach are: it (a)\nensures social distancing by ensuring a maximum population in a given time-slot\nat the facility, (b) prioritizes individuals based on the users' importance of\nthe jobs, (c) maintains truthfulness of the reported importance by adding a\ncooling-off period after their allocated time-slot, during which the individual\ncannot re-access the same facility, (d) guarantees voluntary participation of\nthe citizens, and yet (e) is computationally tractable. We show that the\nproblem becomes NP-complete as soon as the multi-slot demands are indivisible\nand provide a polynomial-time mechanism that is truthful, individually\nrational, and approximately optimal. Experiments show that visitors with more\nimportant jobs are allocated more preferred slots, which comes at the cost of a\nlonger delay to re-access the store. We show that it reduces the social\ncongestion significantly using users' visit data from a store. For the\nmulti-slot indivisible jobs, our approximately optimal mechanism performs well\nin practice.\n", "versions": [{"version": "v1", "created": "Sat, 24 Apr 2021 05:23:35 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Lall", "Deepesh Kumar", ""], ["Shakya", "Garima", ""], ["Nath", "Swaprava", ""]]}, {"id": "2104.12043", "submitter": "Theodore Andronikos", "authors": "Theodore Andronikos and Alla Sirokofskich", "title": "The connection between the $PQ$ penny flip game and the dihedral groups", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper is inspired by the PQ penny flip game. It employs group-theoretic\nconcepts to study the original game and also its possible extensions. We show\nthat the PQ penny flip game can be associated with the dihedral group $D_{8}$.\nWe prove that within $D_{8}$ there exist precisely two classes of winning\nstrategies for Q. We establish that there are precisely two different sequences\nof states that can guaranteed Q's win with probability $1.0$. We also show that\nthe game can be played in the all dihedral groups $D_{8 n}$, $n \\geq 1$, with\nany significant change. We examine what happens when Q can draw his moves from\nthe entire $U(2)$ and we conclude that again, there are exactly two classes of\nwinning strategies for Q, each class containing now an infinite number of\nequivalent strategies, but all of them send the coin through the same sequence\nof states as before. Finally, we consider general extensions of the game with\nthe quantum player having $U(2)$ at his disposal. We prove that for Q to surely\nwin against Picard, he must make both the first and the last move.\n", "versions": [{"version": "v1", "created": "Sun, 25 Apr 2021 01:41:36 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Andronikos", "Theodore", ""], ["Sirokofskich", "Alla", ""]]}, {"id": "2104.12577", "submitter": "Damien Busatto-Gaston", "authors": "Damien Busatto-Gaston, Benjamin Monmege, Pierre-Alain Reynier", "title": "Optimal controller synthesis for timed systems", "comments": "arXiv admin note: text overlap with arXiv:1812.01062", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Weighted timed games are zero-sum games played by two players on a timed\nautomaton equipped with weights, where one player wants to minimise the\ncumulative weight while reaching a target. Used in a reactive synthesis\nperspective, this quantitative extension of timed games allows one to measure\nthe quality of controllers in real-time systems. Weighted timed games are\nnotoriously difficult and quickly undecidable, even when restricted to\nnon-negative weights. For non-negative weights, the largest class that can be\nanalysed has been introduced by Bouyer, Jaziri and Markey in 2015. Though the\nvalue problem is undecidable, the authors show how to approximate the value by\nconsidering regions with a refined granularity. In this work, we extend this\nclass to incorporate negative weights, allowing one to model energy for\ninstance, and prove that the value can still be approximated, with the same\ncomplexity. A small restriction also allows us to obtain a class of decidable\nweighted timed games with negative weights and an arbitrary number of clocks.\nIn addition, we show that a symbolic algorithm, relying on the paradigm of\nvalue iteration, can be used as an approximation/computation schema over these\nclasses. We also consider the special case of untimed weighted games, where the\nsame fragments are solvable in polynomial time: this contrasts with the\npseudo-polynomial complexity, known so far, for weighted games without\nrestrictions.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2021 13:48:23 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Busatto-Gaston", "Damien", ""], ["Monmege", "Benjamin", ""], ["Reynier", "Pierre-Alain", ""]]}, {"id": "2104.12700", "submitter": "Andrea Barontini", "authors": "Andrea Barontini", "title": "Quadratic Payments with constrained probabilities", "comments": "20 pages, 10 figures, 2 tables, companion data:\n  https://github.com/baro77/quadratic_influence", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Dealing with quadratic payments, marginal probability is usually considered\nideally constant, maybe for the sake of initial simplicity. Considering the\nvoting scenario depicted in \"Quadratic Payments: A Primer\" by Vitalik Buterin,\nfirstly its math foundations are made explicit. Developing a simple referendum\nmodel, more realistic outcome probability and marginal probability qualitative\nshapes are introduced. Enforcing seemingly reasonable assumptions, quadratic\npayments are then generalized to take into account these new functions shapes,\nand the way they are still quadratic is discussed. Closing remarks underline\nthe emerging of trade-off constraints not existing in ideal case.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2021 16:41:27 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Barontini", "Andrea", ""]]}, {"id": "2104.12761", "submitter": "Yu-Guan Hsieh", "authors": "Yu-Guan Hsieh, Kimon Antonakopoulos, Panayotis Mertikopoulos", "title": "Adaptive Learning in Continuous Games: Optimal Regret Bounds and\n  Convergence to Nash Equilibrium", "comments": "34 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.LG math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In game-theoretic learning, several agents are simultaneously following their\nindividual interests, so the environment is non-stationary from each player's\nperspective. In this context, the performance of a learning algorithm is often\nmeasured by its regret. However, no-regret algorithms are not created equal in\nterms of game-theoretic guarantees: depending on how they are tuned, some of\nthem may drive the system to an equilibrium, while others could produce cyclic,\nchaotic, or otherwise divergent trajectories. To account for this, we propose a\nrange of no-regret policies based on optimistic mirror descent, with the\nfollowing desirable properties: i) they do not require any prior tuning or\nknowledge of the game; ii) they all achieve O(\\sqrt{T}) regret against\narbitrary, adversarial opponents; and iii) they converge to the best response\nagainst convergent opponents. Also, if employed by all players, then iv) they\nguarantee O(1) social regret; while v) the induced sequence of play converges\nto Nash equilibrium with O(1) individual regret in all variationally stable\ngames (a class of games that includes all monotone and convex-concave zero-sum\ngames).\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2021 17:52:29 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Hsieh", "Yu-Guan", ""], ["Antonakopoulos", "Kimon", ""], ["Mertikopoulos", "Panayotis", ""]]}, {"id": "2104.12762", "submitter": "Omar Abdel Wahab", "authors": "Ahmed Saleh Bataineh, Jamal Bentahar, Rabeb Mizouni, Omar Abdel Wahab,\n  Gaith Rjoub, May El Barachi", "title": "Cloud computing as a platform for monetizing data services: A two-sided\n  game business model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.DC", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  With the unprecedented reliance on cloud computing as the backbone for\nstoring today's big data, we argue in this paper that the role of the cloud\nshould be reshaped from being a passive virtual market to become an active\nplatform for monetizing the big data through Artificial Intelligence (AI)\nservices. The objective is to enable the cloud to be an active platform that\ncan help big data service providers reach a wider set of customers and cloud\nusers (i.e., data consumers) to be exposed to a larger and richer variety of\ndata to run their data analytic tasks. To achieve this vision, we propose a\nnovel game theoretical model, which consists of a mix of cooperative and\ncompetitive strategies. The players of the game are the big data service\nproviders, cloud computing platform, and cloud users. The strategies of the\nplayers are modeled using the two-sided market theory that takes into\nconsideration the network effects among involved parties, while integrating the\nexternalities between the cloud resources and consumer demands into the design\nof the game. Simulations conducted using Amazon and google clustered data show\nthat the proposed model improves the total surplus of all the involved parties\nin terms of cloud resources provision and monetary profits compared to the\ncurrent merchant model.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2021 17:54:31 GMT"}], "update_date": "2021-04-27", "authors_parsed": [["Bataineh", "Ahmed Saleh", ""], ["Bentahar", "Jamal", ""], ["Mizouni", "Rabeb", ""], ["Wahab", "Omar Abdel", ""], ["Rjoub", "Gaith", ""], ["Barachi", "May El", ""]]}, {"id": "2104.12895", "submitter": "Claude Kl\\\"ockl", "authors": "Christoph Graf, Viktor Zobernig, Johannes Schmidt, Claude Kl\\\"ockl", "title": "Computational Performance of Deep Reinforcement Learning to find Nash\n  Equilibria", "comments": "48 pages + 9 figures, comments welcome!", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.LG cs.MA econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We test the performance of deep deterministic policy gradient (DDPG), a deep\nreinforcement learning algorithm, able to handle continuous state and action\nspaces, to learn Nash equilibria in a setting where firms compete in prices.\nThese algorithms are typically considered model-free because they do not\nrequire transition probability functions (as in e.g., Markov games) or\npredefined functional forms. Despite being model-free, a large set of\nparameters are utilized in various steps of the algorithm. These are e.g.,\nlearning rates, memory buffers, state-space dimensioning, normalizations, or\nnoise decay rates and the purpose of this work is to systematically test the\neffect of these parameter configurations on convergence to the analytically\nderived Bertrand equilibrium. We find parameter choices that can reach\nconvergence rates of up to 99%. The reliable convergence may make the method a\nuseful tool to study strategic behavior of firms even in more complex settings.\nKeywords: Bertrand Equilibrium, Competition in Uniform Price Auctions, Deep\nDeterministic Policy Gradient Algorithm, Parameter Sensitivity Analysis\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2021 22:14:17 GMT"}], "update_date": "2021-04-28", "authors_parsed": [["Graf", "Christoph", ""], ["Zobernig", "Viktor", ""], ["Schmidt", "Johannes", ""], ["Klöckl", "Claude", ""]]}, {"id": "2104.13228", "submitter": "Inavamsi Enaganti", "authors": "Inavamsi Enaganti and Bud Mishra", "title": "To mock a Mocking bird : Studies in Biomimicry", "comments": "15 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.GT cs.LG", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper dwells on certain novel game-theoretic investigations in\nbio-mimicry, discussed from the perspectives of information asymmetry,\nindividual utility and its optimization via strategic interactions involving\nco-evolving preys (e.g., insects) and predators (e.g., reptiles) who learn.\nFormally, we consider a panmictic ecosystem, occupied by species of prey with\nrelatively short lifespan, which evolve mimicry signals over generations as\nthey interact with predators with relatively longer lifespans, thus endowing\npredators with the ability to learn prey signals. Every prey sends a signal and\nprovides utility to the predator. The prey can be either nutritious or toxic to\nthe predator, but the prey may signal (possibly) deceptively without revealing\nits true \"type.\" The model is used to study the situation where multi-armed\nbandit predators with zero prior information are introduced into the ecosystem.\nAs a result of exploration and exploitation the predators naturally select the\nprey that result in the evolution of those signals. This co-evolution of\nstrategies produces a variety of interesting phenomena which are subjects of\nthis paper.\n", "versions": [{"version": "v1", "created": "Mon, 26 Apr 2021 09:55:40 GMT"}], "update_date": "2021-04-28", "authors_parsed": [["Enaganti", "Inavamsi", ""], ["Mishra", "Bud", ""]]}, {"id": "2104.13681", "submitter": "Gabriel Istrate", "authors": "Gabriel Istrate, Cosmin Bonchis and Adrian Craciun", "title": "Kernelization, Proof Complexity and Social Choice", "comments": "Revised version will appear in the Proceedings of ICALP 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.DS cs.GT cs.LO math.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We display an application of the notions of kernelization and data reduction\nfrom parameterized complexity to proof complexity: Specifically, we show that\nthe existence of data reduction rules for a parameterized problem having (a). a\nsmall-length reduction chain, and (b). small-size (extended) Frege proofs\ncertifying the soundness of reduction steps implies the existence of\nsubexponential size (extended) Frege proofs for propositional formalizations of\nthe given problem.\n  We apply our result to infer the existence of subexponential Frege and\nextended Frege proofs for a variety of problems. Improving earlier results of\nAisenberg et al. (ICALP 2015), we show that propositional formulas expressing\n(a stronger form of) the Kneser-Lov\\'asz Theorem have polynomial size Frege\nproofs for each constant value of the parameter k. Previously only\nquasipolynomial bounds were known (and only for the ordinary Kneser-Lov\\'asz\nTheorem).\n  Another notable application of our framework is to impossibility results in\ncomputational social choice: we show that, for any fixed number of agents,\npropositional translations of the Arrow and Gibbard-Satterthwaite impossibility\ntheorems have subexponential size Frege proofs.\n", "versions": [{"version": "v1", "created": "Wed, 28 Apr 2021 10:09:14 GMT"}], "update_date": "2021-04-29", "authors_parsed": [["Istrate", "Gabriel", ""], ["Bonchis", "Cosmin", ""], ["Craciun", "Adrian", ""]]}, {"id": "2104.13888", "submitter": "Alexander Kozachinskiy", "authors": "Alexander Kozachinskiy", "title": "One-to-Two-Player Lifting for Mildly Growing Memory", "comments": "LIPIcs style, 22 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We investigate so-called \"one-to-two-player lifting\" theorems for\ninfinite-duration two-player games on graphs with zero-sum objectives. These\ntheorems are concerned with questions of the following form. If that much\nmemory is sufficient to play optimally in one-player games, then how much\nmemory is needed to play optimally in two-player games? In 2005, Gimbert and\nZielonka (CONCUR 2005) have shown that if no memory is needed in the one-player\ngames, then the same holds for the two-player games. Building upon their work,\nBouyer et al.~(CONCUR 2020) have shown that if some constant amount of memory\n(independent of the size of a game graph) is sufficient in the one-player\ngames, then exactly the same constant is sufficient in the two-player games.\nThey also provide an example in which every one-player game requires only a\nfinite amount of memory (now this amount depends on the size of a game) while\nsome two-player game requires infinite memory.\n  Our main result states the following. If the memory grows just a bit slower\n(in the one-player games) than in the example of Bouyer et al., then in every\ntwo-player game it is sufficient to have finite memory. Thus, our work\nidentifies the exact barrier for the one-to-two-player lifting theorems in a\ncontext of finite-memory strategies.\n", "versions": [{"version": "v1", "created": "Wed, 28 Apr 2021 17:18:41 GMT"}], "update_date": "2021-04-29", "authors_parsed": [["Kozachinskiy", "Alexander", ""]]}, {"id": "2104.14317", "submitter": "Markus Brill", "authors": "Markus Brill, Rupert Freeman, Vincent Conitzer", "title": "Computing Possible and Necessary Equilibrium Actions (and Bipartisan Set\n  Winners)", "comments": null, "journal-ref": "Proceedings of the 30th AAAI Conference on Artificial Intelligence\n  (AAAI), pages 418-424. AAAI Press, 2016", "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many multiagent environments, a designer has some, but limited control\nover the game being played. In this paper, we formalize this by considering\nincompletely specified games, in which some entries of the payoff matrices can\nbe chosen from a specified set. We show that it is NP-hard for the designer to\nmake these choices optimally, even in zero-sum games. In fact, it is already\nintractable to decide whether a given action is (potentially or necessarily)\nplayed in equilibrium. We also consider incompletely specified symmetric games\nin which all completions are required to be symmetric. Here, hardness holds\neven in weak tournament games (symmetric zero-sum games whose entries are all\n-1, 0, or 1) and in tournament games (symmetric zero-sum games whose\nnon-diagonal entries are all -1 or 1). The latter result settles the complexity\nof the possible and necessary winner problems for a social-choice-theoretic\nsolution concept known as the bipartisan set. We finally give a mixed-integer\nlinear programming formulation for weak tournament games and evaluate it\nexperimentally.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 13:02:20 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Brill", "Markus", ""], ["Freeman", "Rupert", ""], ["Conitzer", "Vincent", ""]]}, {"id": "2104.14347", "submitter": "Warut Suksompong", "authors": "Mithun Chakraborty, Ulrike Schmidt-Kraepelin, Warut Suksompong", "title": "Picking Sequences and Monotonicity in Weighted Fair Division", "comments": "Appears in the 30th International Joint Conference on Artificial\n  Intelligence (IJCAI), 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of fairly allocating indivisible items to agents with\ndifferent entitlements, which captures, for example, the distribution of\nministries among political parties in a coalition government. Our focus is on\npicking sequences derived from common apportionment methods, including five\ntraditional divisor methods and the quota method. We paint a complete picture\nof these methods in relation to known envy-freeness and proportionality\nrelaxations for indivisible items as well as monotonicity properties with\nrespect to the resource, population, and weights. In addition, we provide\ncharacterizations of picking sequences satisfying each of the fairness notions,\nand show that the well-studied maximum Nash welfare solution fails resource-\nand population-monotonicity even in the unweighted setting. Our results serve\nas an argument in favor of using picking sequences in weighted fair division\nproblems.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 13:52:09 GMT"}], "update_date": "2021-04-30", "authors_parsed": [["Chakraborty", "Mithun", ""], ["Schmidt-Kraepelin", "Ulrike", ""], ["Suksompong", "Warut", ""]]}, {"id": "2104.14662", "submitter": "Ezzat Elokda", "authors": "Ezzat Elokda and Andrea Censi and Saverio Bolognani", "title": "Dynamic population games", "comments": "Working paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.GT cs.SY econ.TH eess.SY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, we define a new class of dynamic games played in large\npopulations of anonymous agents. The behavior of agents in these games depends\non a time-homogeneous type and a time-varying state, which are private to each\nagent and characterize their available actions and motifs. We consider finite\ntype, state, and action spaces. On the individual agent level, the state\nevolves in discrete-time as the agent participates in interactions, in which\nthe state transitions are affected by the agent's individual action and the\ndistribution of other agents' states and actions. On the societal level, we\nconsider that the agents form a continuum of mass and that interactions occur\neither synchronously or asynchronously, and derive models for the evolution of\nthe agents' state distribution. We characterize the stationary equilibrium as\nthe solution concept in our games, which is a condition where all agents are\nplaying their best response and the state distribution is stationary. At least\none stationary equilibrium is guaranteed to exist in every dynamic population\ngame. Our approach intersects with previous works on anonymous sequential\ngames, mean-field games, and Markov decision evolutionary games, but it is\nnovel in how we relate the dynamic setting to a classical, static population\ngame setting. In particular, stationary equilibria can be reduced to standard\nNash equilibria in classical population games. This simplifies the analysis of\nthese games and inspires the formulation of an evolutionary model for the\ncoupled dynamics of both the agents' actions and states.\n", "versions": [{"version": "v1", "created": "Thu, 29 Apr 2021 21:13:10 GMT"}], "update_date": "2021-05-03", "authors_parsed": [["Elokda", "Ezzat", ""], ["Censi", "Andrea", ""], ["Bolognani", "Saverio", ""]]}, {"id": "2104.14740", "submitter": "Daniel Freund", "authors": "Hao Yi Ong, Daniel Freund, Davide Crapis", "title": "Driver Positioning and Incentive Budgeting with an Escrow Mechanism for\n  Ridesharing Platforms", "comments": "Forthcoming in INFORMS Journal on Applied Analytics", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Drivers on the Lyft rideshare platform do not always know where the areas of\nsupply shortage are in real time. This lack of information hurts both riders\ntrying to find a ride and drivers trying to determine how to maximize their\nearnings opportunity. Lyft's Personal Power Zone (PPZ) product helps the\ncompany to maintain high levels of service on the platform by influencing the\nspatial distribution of drivers in real time via monetary incentives that\nencourage them to reposition their vehicles. The underlying system that powers\nthe product has two main components: (1) a novel 'escrow mechanism' that tracks\navailable incentive budgets tied to locations within a city in real time, and\n(2) an algorithm that solves the stochastic driver positioning problem to\nmaximize short-run revenue from riders' fares. The optimization problem is a\nmultiagent dynamic program that is too complicated to solve optimally for our\nlarge-scale application. Our approach is to decompose it into two subproblems.\nThe first determines the set of drivers to incentivize and where to incentivize\nthem to position themselves. The second determines how to fund each incentive\nusing the escrow budget. By formulating it as two convex programs, we are able\nto use commercial solvers that find the optimal solution in a matter of\nseconds. Rolled out to all 320 cities in which Lyft's operates in a little over\na year, the system now generates millions of bonuses that incentivize hundreds\nof thousands of active drivers to optimally position themselves in anticipation\nof ride requests every week. Together, the PPZ product and its underlying\nalgorithms represent a paradigm shift in how Lyft drivers drive and generate\nearnings on the platform. Its direct business impact has been a 0.5% increase\nin incremental bookings, amounting to tens of millions of dollars per year.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2021 03:31:59 GMT"}], "update_date": "2021-05-03", "authors_parsed": [["Ong", "Hao Yi", ""], ["Freund", "Daniel", ""], ["Crapis", "Davide", ""]]}, {"id": "2104.14744", "submitter": "Sam Ganzfried", "authors": "Sam Ganzfried", "title": "Human strategic decision making in parametrized games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.LG econ.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many real-world games contain parameters which can affect payoffs, action\nspaces, and information states. For fixed values of the parameters, the game\ncan be solved using standard algorithms. However, in many settings agents must\nact without knowing the values of the parameters that will be encountered in\nadvance. Often the decisions must be made by a human under time and resource\nconstraints, and it is unrealistic to assume that a human can solve the game in\nreal time. We present a new framework that enables human decision makers to\nmake fast decisions without the aid of real-time solvers. We demonstrate\napplicability to a variety of situations including settings with multiple\nplayers and imperfect information.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2021 03:40:27 GMT"}], "update_date": "2021-05-10", "authors_parsed": [["Ganzfried", "Sam", ""]]}, {"id": "2104.15058", "submitter": "Jan Maly", "authors": "Martin Lackner and Jan Maly", "title": "Perpetual Voting: The Axiomatic Lens", "comments": "Scheduled for oral presentation at COMSOC 2021", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Perpetual voting was recently introduced as a framework for long-term\ncollective decision making. In this framework, we consider a sequence of\nsubsequent approval-based elections and try to achieve a fair overall outcome.\nTo achieve fairness over time, perpetual voting rules take the history of\nprevious decisions into account and identify voters that were dissatisfied with\nprevious decisions. In this paper, we look at perpetual voting rules from an\naxiomatic perspective and study two main questions. First, we ask how simple\nsuch rules can be while still meeting basic desiderata. For two simple but\nnatural classes, we fully characterize the axiomatic possibilities. Second, we\nask how proportionality can be formalized in perpetual voting. We study\nproportionality on simple profiles that are equivalent to the apportionment\nsetting and show that lower and upper quota axioms can be used to distinguish\n(and sometimes characterize) perpetual voting rules. Furthermore, we show a\nsurprising connection between a perpetual rule called Perpetual Consensus and\nFrege's apportionment method.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2021 15:28:46 GMT"}], "update_date": "2021-05-03", "authors_parsed": [["Lackner", "Martin", ""], ["Maly", "Jan", ""]]}, {"id": "2104.15075", "submitter": "Jiehua Chen", "authors": "Jiehua Chen, Martin Lackner, Jan Maly", "title": "Participatory Budgeting with Donations and Diversity Constraints", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.CC cs.DS cs.GT", "license": "http://creativecommons.org/licenses/by-nc-nd/4.0/", "abstract": "  Participatory budgeting (PB) is a democratic process where citizens jointly\ndecide on how to allocate public funds to indivisible projects. This paper\nfocuses on PB processes where citizens may give additional money to projects\nthey want to see funded. We introduce a formal framework for this kind of PB\nwith donations. Our framework also allows for diversity constraints, meaning\nthat each project belongs to one or more types, and there are lower and upper\nbounds on the number of projects of the same type that can be funded. We\npropose three general classes of methods for aggregating the citizens'\npreferences in the presence of donations and analyze their axiomatic\nproperties. Furthermore, we investigate the computational complexity of\ndetermining the outcome of a PB process with donations and of finding a\ncitizen's optimal donation strategy.\n", "versions": [{"version": "v1", "created": "Fri, 30 Apr 2021 15:48:25 GMT"}], "update_date": "2021-05-03", "authors_parsed": [["Chen", "Jiehua", ""], ["Lackner", "Martin", ""], ["Maly", "Jan", ""]]}]