[{"id": "0804.0879", "submitter": "Serban E. Vlad", "authors": "Serban E. Vlad", "title": "The equations of the ideal latches", "comments": "The 12-th Conference on Applied and Industrial Mathematics CAIM 2004,\n  University of Pitesti, October 15-17, 2004", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The latches are simple circuits with feedback from the digital electrical\nengineering. We have included in our work the C element of Muller, the RS\nlatch, the clocked RS latch, the D latch and also circuits containing two\ninterconnected latches: the edge triggered RS flip-flop, the D flip-flop, the\nJK flip-flop, the T flip-flop. The purpose of this study is to model with\nequations the previous circuits, considered to be ideal, i.e. non-inertial. The\ntechnique of analysis is the pseudoboolean differential calculus.\n", "versions": [{"version": "v1", "created": "Sat, 5 Apr 2008 23:55:16 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Vlad", "Serban E.", ""]]}, {"id": "0804.2035", "submitter": "Serban Vlad E.", "authors": "Serban E. Vlad", "title": "The non-anticipation of the asynchronous systems", "comments": "the 6-th Congress of the Romanian mathematicians, Bucharest, June 28\n  - July 4, 2007", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The asynchronous systems are the models of the asynchronous circuits from the\ndigital electrical engineering and non-anticipation is one of the most\nimportant properties in systems theory. Our present purpose is to introduce\nseveral concepts of non-anticipation of the asynchronous systems.\n", "versions": [{"version": "v1", "created": "Sat, 12 Apr 2008 23:58:30 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Vlad", "Serban E.", ""]]}, {"id": "0804.2621", "submitter": "Christoph Schommer", "authors": "Christoph Schommer", "title": "Design and Implementation of a Master of Science in Information and\n  Computer Sciences - An Inventory and retrospect for the last four years", "comments": "27 pages, 4 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This Master of Science in Computer and Information Sciences (MICS) is an\ninternational accredited master program that has been initiated in 2004 and\nstarted in September 2005. MICS is a research-oriented academic study of 4\nsemesters and a continuation of the Bachelor towards the PhD. It is completely\ntaught in English, supported by lecturers coming from more than ten different\ncountries. This report compass a description of its underlying architecture,\ndescribes some implementation details and gives a presentation of diverse\nexperiences and results. As the program has been designed and implemented right\nafter the creation of the University, the significance of the program is\nmoreover a self-discovery of the computer science department, which has finally\nled to the creation of the today's research institutes and research axes.\n", "versions": [{"version": "v1", "created": "Wed, 16 Apr 2008 15:43:27 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Schommer", "Christoph", ""]]}, {"id": "0804.2852", "submitter": "Chris Kimble", "authors": "David King and Chris Kimble", "title": "Philosophical Smoke Signals: Theory and Practice in Information Systems\n  Design", "comments": "in Proceedings of 10th UKAIS Conference, (May 2005), Northumbria\n  University, UK", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.GL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although the gulf between the theory and practice in Information Systems is\nmuch lamented, few researchers have offered a way forward except through a\nnumber of (failed) attempts to develop a single systematic theory for\nInformation Systems. In this paper, we encourage researchers to re-examine the\npractical consequences of their theoretical arguments. By examining these\narguments we may be able to form a number of more rigorous theories of\nInformation Systems, allowing us to draw theory and practice together without\nundertaking yet another attempt at the holy grail of a single unified\nsystematic theory of Information Systems.\n", "versions": [{"version": "v1", "created": "Thu, 17 Apr 2008 16:46:55 GMT"}], "update_date": "2008-04-18", "authors_parsed": [["King", "David", ""], ["Kimble", "Chris", ""]]}]