[{"id": "1904.00421", "submitter": "Johann Knechtel", "authors": "Satwik Patnaik and Nikhil Rangarajan and Johann Knechtel and Ozgur\n  Sinanoglu and Shaloo Rakheja", "title": "Spin-Orbit Torque Devices for Hardware Security: From Deterministic to\n  Probabilistic Regime", "comments": "To be published in IEEE Transactions on Computer-Aided Design of\n  Integrated Circuits and Systems", "journal-ref": null, "doi": "10.1109/TCAD.2019.2917856", "report-no": null, "categories": "cs.ET cond-mat.mes-hall cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Protecting intellectual property (IP) has become a serious challenge for chip\ndesigners. Most countermeasures are tailored for CMOS integration and tend to\nincur excessive overheads, resulting from additional circuitry or device-level\nmodifications. On the other hand, power density is a critical concern for\nsub-50 nm nodes, necessitating alternate design concepts. Although initially\ntailored for error-tolerant applications, imprecise computing has gained\ntraction as a general-purpose design technique. Emerging devices are currently\nbeing explored to implement ultra-low-power circuits for inexact computing\napplications. In this paper, we quantify the security threats of imprecise\ncomputing using emerging devices. More specifically, we leverage the innate\npolymorphism and tunable stochastic behavior of spin-orbit torque (SOT)\ndevices, particularly, the giant spin-Hall effect (GSHE) switch. We enable IP\nprotection (by means of logic locking and camouflaging) simultaneously for\ndeterministic and probabilistic computing, directly at the GSHE device level.\nWe conduct a comprehensive security analysis using state-of-the-art Boolean\nsatisfiability (SAT) attacks; this study demonstrates the superior resilience\nof our GSHE primitive when tailored for deterministic computing. We also\ndemonstrate how probabilistic computing can thwart most, if not all, existing\nSAT attacks. Based on this finding, we propose an attack scheme called\nprobabilistic SAT (PSAT) which can bypass the defense offered by logic locking\nand camouflaging for imprecise computing schemes. Further, we illustrate how\ncareful application of our GSHE primitive can remain secure even on the\napplication of the PSAT attack. Finally, we also discuss side-channel attacks\nand invasive monitoring, which are arguably even more concerning threats than\nSAT attacks.\n", "versions": [{"version": "v1", "created": "Sun, 31 Mar 2019 14:35:09 GMT"}], "update_date": "2019-06-05", "authors_parsed": [["Patnaik", "Satwik", ""], ["Rangarajan", "Nikhil", ""], ["Knechtel", "Johann", ""], ["Sinanoglu", "Ozgur", ""], ["Rakheja", "Shaloo", ""]]}, {"id": "1904.00836", "submitter": "Raihan Sayeed Khan", "authors": "Raihan Sayeed Khan, Nadim H. Kanan, Jake Scoggin, Helena Silva, Ali\n  Gokirmak", "title": "Multi-contact Phase Change Toggle Logic Device Utilizing Thermal\n  Crosstalk", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Phase change memory (PCM) is an emerging high speed, high density, high\nendurance, and scalable non-volatile memory technology which utilizes the large\nresistivity contrast between the amorphous and crystalline phases of\nchalcogenide materials such as Ge2Sb2Te5 (GST). In addition to being used as a\nstandalone memory, there has been a growing interest in integration of PCM\ndevices on top of the CMOS layer for computation in memory and neuromorphic\ncomputing. The large CMOS overhead for memory controllers is a limiting factor\nfor this purpose. Transferring functionality like routing, multiplexing, and\nlogic to the memory layer can substantially reduce the CMOS overhead, making it\npossible to integrate 100s of GB of PCM storage on top of a conventional CPU.\nIn this work, we present computational analysis of a phase change device\nconcept that can perform toggle operations. The toggle functionality is\nachieved using two physical mechanisms: (i) isolation of different read\ncontacts due to amorphization between different write contact pairs, and (ii)\nthermal cross-talk between a molten region and a previously amorphized region.\nPhase-change devices with six contacts can be implemented as toggle flip-flops,\nmultiplexer, or demultiplexer when interfaced with CMOS transistors. Here, we\ndemonstrate the operation of the device as a toggle flip-flop with 5\ntransistors, requiring ~50% of the footprint compared to conventional CMOS\nalternatives, with the added advantage of non-volatility.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2019 15:23:48 GMT"}], "update_date": "2019-04-02", "authors_parsed": [["Khan", "Raihan Sayeed", ""], ["Kanan", "Nadim H.", ""], ["Scoggin", "Jake", ""], ["Silva", "Helena", ""], ["Gokirmak", "Ali", ""]]}, {"id": "1904.01072", "submitter": "Roger Colbeck", "authors": "Raban Iten, Oliver Reardon-Smith, Emanuel Malvetti, Luca Mondada,\n  Gabrielle Pauvert, Ethan Redmond, Ravjot Singh Kohli, Roger Colbeck", "title": "Introduction to UniversalQCompiler", "comments": "7 + 3 pages. v2: updated to include functionality for instruments and\n  Householder-based decompositions useful for sparse cases. See\n  http://www-users.york.ac.uk/~rc973/UniversalQCompiler.html for a link to the\n  code and a manual", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.ET", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We introduce an open source software package UniversalQCompiler written in\nMathematica that allows the decomposition of arbitrary quantum operations into\na sequence of single-qubit rotations (with arbitrary rotation angles) and\ncontrolled-NOT (C-NOT) gates. Together with the existing package QI, this\nallows quantum information protocols to be analysed and then compiled to\nquantum circuits. Our decompositions are based on Phys. Rev. A 93, 032318\n(2016), and hence, for generic operations, they are near optimal in terms of\nthe number of gates required. UniversalQCompiler allows the compilation of any\nisometry (in particular, it can be used for unitaries and state preparation),\nquantum channel, positive-operator valued measure (POVM) or quantum instrument,\nalthough the run time becomes prohibitive for large numbers of qubits. The\nresulting circuits can be displayed graphically within Mathematica or exported\nto LaTeX. We also provide functionality to translate the circuits to OpenQASM,\nthe quantum assembly language used, for instance, by the IBM Q Experience.\n", "versions": [{"version": "v1", "created": "Mon, 1 Apr 2019 19:19:06 GMT"}, {"version": "v2", "created": "Mon, 29 Mar 2021 21:44:49 GMT"}], "update_date": "2021-03-31", "authors_parsed": [["Iten", "Raban", ""], ["Reardon-Smith", "Oliver", ""], ["Malvetti", "Emanuel", ""], ["Mondada", "Luca", ""], ["Pauvert", "Gabrielle", ""], ["Redmond", "Ethan", ""], ["Kohli", "Ravjot Singh", ""], ["Colbeck", "Roger", ""]]}, {"id": "1904.01131", "submitter": "Guang Hao Low", "authors": "Guang Hao Low, Nicholas P. Bauman, Christopher E. Granade, Bo Peng,\n  Nathan Wiebe, Eric J. Bylaska, Dave Wecker, Sriram Krishnamoorthy, Martin\n  Roetteler, Karol Kowalski, Matthias Troyer, Nathan A. Baker", "title": "Q# and NWChem: Tools for Scalable Quantum Chemistry on Quantum Computers", "comments": "36 pages, 5 figures. Examples and data in ancillary files folder", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.ET physics.chem-ph physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fault-tolerant quantum computation promises to solve outstanding problems in\nquantum chemistry within the next decade. Realizing this promise requires\nscalable tools that allow users to translate descriptions of electronic\nstructure problems to optimized quantum gate sequences executed on physical\nhardware, without requiring specialized quantum computing knowledge. To this\nend, we present a quantum chemistry library, under the open-source MIT license,\nthat implements and enables straightforward use of state-of-art quantum\nsimulation algorithms. The library is implemented in Q#, a language designed to\nexpress quantum algorithms at scale, and interfaces with NWChem, a leading\nelectronic structure package. We define a standardized schema for this\ninterface, Broombridge, that describes second-quantized Hamiltonians, along\nwith metadata required for effective quantum simulation, such as trial\nwavefunction ansatzes. This schema is generated for arbitrary molecules by\nNWChem, conveniently accessible, for instance, through Docker containers and a\nrecently developed web interface EMSL Arrows. We illustrate use of the library\nwith various examples, including ground- and excited-state calculations for\nLiH, H$_{10}$, and C$_{20}$ with an active-space simplification, and\nautomatically obtain resource estimates for classically intractable examples.\n", "versions": [{"version": "v1", "created": "Mon, 1 Apr 2019 22:23:34 GMT"}], "update_date": "2019-05-03", "authors_parsed": [["Low", "Guang Hao", ""], ["Bauman", "Nicholas P.", ""], ["Granade", "Christopher E.", ""], ["Peng", "Bo", ""], ["Wiebe", "Nathan", ""], ["Bylaska", "Eric J.", ""], ["Wecker", "Dave", ""], ["Krishnamoorthy", "Sriram", ""], ["Roetteler", "Martin", ""], ["Kowalski", "Karol", ""], ["Troyer", "Matthias", ""], ["Baker", "Nathan A.", ""]]}, {"id": "1904.01671", "submitter": "Jonathan Baker", "authors": "Jonathan M. Baker, Casey Duckering, Alexander Hoover, Frederic T.\n  Chong", "title": "Decomposing Quantum Generalized Toffoli with an Arbitrary Number of\n  Ancilla", "comments": "10 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a general decomposition of the Generalized Toffoli, and for\ncompleteness, the multi-target gate using an arbitrary number of clean or dirty\nancilla. While prior work has shown how to decompose the Generalized Toffoli\nusing 0, 1, or $O(n)$ many clean ancilla and 0, 1, and $n-2$ dirty ancilla, we\nprovide a generalized algorithm to bridge the gap, i.e. this work gives an\nalgorithm to generate a decomposition for any number of clean or dirty ancilla.\nWhile it is hard to guarantee optimality, our decompositions guarantee a\ndecrease in circuit depth as the number of ancilla increases.\n", "versions": [{"version": "v1", "created": "Tue, 2 Apr 2019 21:22:40 GMT"}], "update_date": "2019-04-04", "authors_parsed": [["Baker", "Jonathan M.", ""], ["Duckering", "Casey", ""], ["Hoover", "Alexander", ""], ["Chong", "Frederic T.", ""]]}, {"id": "1904.01705", "submitter": "Michael Klachko", "authors": "Michael Klachko, Mohammad Reza Mahmoodi, and Dmitri B. Strukov", "title": "Improving Noise Tolerance of Mixed-Signal Neural Networks", "comments": "Accepted for publication in IJCNN 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mixed-signal hardware accelerators for deep learning achieve orders of\nmagnitude better power efficiency than their digital counterparts. In the\nultra-low power consumption regime, limited signal precision inherent to analog\ncomputation becomes a challenge. We perform a case study of a 6-layer\nconvolutional neural network running on a mixed-signal accelerator and evaluate\nits sensitivity to hardware specific noise. We apply various methods to improve\nnoise robustness of the network and demonstrate an effective way to optimize\nuseful signal ranges through adaptive signal clipping. The resulting model is\nrobust enough to achieve 80.2% classification accuracy on CIFAR-10 dataset with\njust 1.4 mW power budget, while 6 mW budget allows us to achieve 87.1%\naccuracy, which is within 1% of the software baseline. For comparison, the\nunoptimized version of the same model achieves only 67.7% accuracy at 1.4 mW\nand 78.6% at 6 mW.\n", "versions": [{"version": "v1", "created": "Tue, 2 Apr 2019 23:24:18 GMT"}], "update_date": "2019-04-04", "authors_parsed": [["Klachko", "Michael", ""], ["Mahmoodi", "Mohammad Reza", ""], ["Strukov", "Dmitri B.", ""]]}, {"id": "1904.01731", "submitter": "Shawn X. Cui", "authors": "Shawn X. Cui, Kevin T. Tian, Jennifer F. Vasquez, Zhenghan Wang, Helen\n  M. Wong", "title": "The Search For Leakage-free Entangling Fibonacci Braiding Gates", "comments": null, "journal-ref": "Journal of Physics A: Mathematical and Theoretical, vol. 52, no.\n  45 (2019)", "doi": null, "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is an open question if there are leakage-free entangling Fibonacci\nbraiding gates. We provide evidence to the conjecture for the negative in this\npaper. We also found a much simpler protocol to generate approximately\nleakage-free entangling Fibonacci braiding gates than existing algorithms in\nthe literature.\n", "versions": [{"version": "v1", "created": "Wed, 3 Apr 2019 01:17:13 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Cui", "Shawn X.", ""], ["Tian", "Kevin T.", ""], ["Vasquez", "Jennifer F.", ""], ["Wang", "Zhenghan", ""], ["Wong", "Helen M.", ""]]}, {"id": "1904.02121", "submitter": "Giulia Meuli", "authors": "Giulia Meuli, Mathias Soeken, Martin Roetteler, Nikolaj Bjorner and\n  Giovanni De Micheli", "title": "Reversible Pebbling Game for Quantum Memory Management", "comments": "In Proc. Design Automation and Test in Europe (DATE 2019)", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum memory management is becoming a pressing problem, especially given\nthe recent research effort to develop new and more complex quantum algorithms.\nThe only existing automatic method for quantum states clean-up relies on the\navailability of many extra resources. In this work, we propose an automatic\ntool for quantum memory management. We show how this problem exactly matches\nthe reversible pebbling game. Based on that, we develop a SAT-based algorithm\nthat returns a valid clean-up strategy, taking the limitations of the quantum\nhardware into account. The developed tool empowers the designer with the\nflexibility required to explore the trade-off between memory resources and\nnumber of operations. We present three show-cases to prove the validity of our\napproach. First, we apply the algorithm to straight-line programs, widely used\nin cryptographic applications. Second, we perform a comparison with the\nexisting approach, showing an average improvement of 52.77%. Finally, we show\nthe advantage of using the tool when synthesizing a quantum circuit on a\nconstrained near-term quantum device.\n", "versions": [{"version": "v1", "created": "Wed, 3 Apr 2019 17:30:59 GMT"}], "update_date": "2019-04-04", "authors_parsed": [["Meuli", "Giulia", ""], ["Soeken", "Mathias", ""], ["Roetteler", "Martin", ""], ["Bjorner", "Nikolaj", ""], ["De Micheli", "Giovanni", ""]]}, {"id": "1904.02183", "submitter": "Krishna Gnawali", "authors": "Krishna Prasad Gnawali, Seyed Nima Mozaffari, Spyros Tragoudas", "title": "Low Power Artificial Neural Network Architecture", "comments": "6 pages, 2 figures", "journal-ref": "IEEE VLSI Circuits and Systems Letter Vol.4, Issue.4, Nov. 2018", "doi": null, "report-no": null, "categories": "cs.ET cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent artificial neural network architectures improve performance and power\ndissipation by leveraging resistive devices to store and multiply synaptic\nweights with input data. Negative and positive synaptic weights are stored on\nthe memristors of a reconfigurable crossbar array (MCA). Existing MCA-based\nneural network architectures use high power consuming voltage converters or\noperational amplifiers to generate the total synaptic current through each\ncolumn of the crossbar array. This paper presents a low power MCA-based\nfeedforward neural network architecture that uses a spintronic device per pair\nof columns to generate the synaptic current for each neuron. It is shown\nexperimentally that the proposed architecture dissipates significantly less\npower compared to existing feedforward memristive neural network architectures.\n", "versions": [{"version": "v1", "created": "Wed, 3 Apr 2019 18:08:48 GMT"}], "update_date": "2019-07-29", "authors_parsed": [["Gnawali", "Krishna Prasad", ""], ["Mozaffari", "Seyed Nima", ""], ["Tragoudas", "Spyros", ""]]}, {"id": "1904.03294", "submitter": "Md Arif Iqbal", "authors": "Md Arif Iqbal, Naveen Kumar Macha, Bhavana Tejaswini Repalle,\n  Mostafizur Rahman", "title": "A Logic Simplification Approach for Very Large Scale Crosstalk Circuit\n  Designs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Crosstalk computing, involving engineered interference between nanoscale\nmetal lines, offers a fresh perspective to scaling through co-existence with\nCMOS. Through capacitive manipulations and innovative circuit style, not only\nprimitive gates can be implemented, but custom logic cells such as an Adder,\nSubtractor can be implemented with huge gains. Our simulations show over 5x\ndensity and 2x power benefits over CMOS custom designs at 16nm [1]. This paper\nintroduces the Crosstalk circuit style and a key method for large-scale circuit\nsynthesis utilizing existing EDA tool flow. We propose to manipulate the CMOS\nsynthesis flow by adding two extra steps: conversion of the gate-level netlist\nto Crosstalk implementation friendly netlist through logic simplification and\nCrosstalk gate mapping, and the inclusion of custom cell libraries for\nautomated placement and layout. Our logic simplification approach first\nconverts Cadence generated structured netlist to Boolean expressions and then\nuses the majority synthesis tool to obtain majority functions, which is further\nused to simplify functions for Crosstalk friendly implementations. We compare\nour approach of logic simplification to that of CMOS and majority logic-based\napproaches. Crosstalk circuits share some similarities to majority synthesis\nthat are typically applied to Quantum Cellular Automata technology. However,\nour investigation shows that by closely following Crosstalk's core circuit\nstyles, most benefits can be achieved. In the best case, our approach shows 36%\ndensity improvements over majority synthesis for MCNC benchmark.\n", "versions": [{"version": "v1", "created": "Fri, 5 Apr 2019 21:49:29 GMT"}], "update_date": "2019-04-09", "authors_parsed": [["Iqbal", "Md Arif", ""], ["Macha", "Naveen Kumar", ""], ["Repalle", "Bhavana Tejaswini", ""], ["Rahman", "Mostafizur", ""]]}, {"id": "1904.03387", "submitter": "Tathagata Paul", "authors": "Tathagata Paul, Tanweer Ahmed, Krishna Kanhaiya Tiwari, Chetan Singh\n  Thakur, Arindam Ghosh", "title": "A high-performance MoS2 synaptic device with floating gate engineering\n  for Neuromorphic Computing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.app-ph cond-mat.mes-hall cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As one of the most important members of the two dimensional chalcogenide\nfamily, molybdenum disulphide (MoS2) has played a fundamental role in the\nadvancement of low dimensional electronic, optoelectronic and piezoelectric\ndesigns. Here, we demonstrate a new approach to solid state synaptic\ntransistors using two dimensional MoS2 floating gate memories. By using an\nextended floating gate architecture which allows the device to be operated at\nnear-ideal subthreshold swing of 77 mV/decade over four decades of drain\ncurrent, we have realised a charge tunneling based synaptic memory with\nperformance comparable to the state of the art in neuromorphic designs. The\ndevice successfully demonstrates various features of a biological synapse,\nincluding pulsed potentiation and relaxation of channel conductance, as well as\nspike time dependent plasticity (STDP). Our device returns excellent energy\nefficiency figures and provides a robust platform based on ultrathin two\ndimensional nanosheets for future neuromorphic applications.\n", "versions": [{"version": "v1", "created": "Sat, 6 Apr 2019 08:38:59 GMT"}], "update_date": "2019-04-09", "authors_parsed": [["Paul", "Tathagata", ""], ["Ahmed", "Tanweer", ""], ["Tiwari", "Krishna Kanhaiya", ""], ["Thakur", "Chetan Singh", ""], ["Ghosh", "Arindam", ""]]}, {"id": "1904.03652", "submitter": "Damien Querlioz", "authors": "Tifenn Hirtzlin, Marc Bocquet, Jacques-Olivier Klein, Etienne Nowak,\n  Elisa Vianello, Jean-Michel Portal and Damien Querlioz", "title": "Outstanding Bit Error Tolerance of Resistive RAM-Based Binarized Neural\n  Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Resistive random access memories (RRAM) are novel nonvolatile memory\ntechnologies, which can be embedded at the core of CMOS, and which could be\nideal for the in-memory implementation of deep neural networks. A particularly\nexciting vision is using them for implementing Binarized Neural Networks\n(BNNs), a class of deep neural networks with a highly reduced memory footprint.\nThe challenge of resistive memory, however, is that they are prone to device\nvariation, which can lead to bit errors. In this work we show that BNNs can\ntolerate these bit errors to an outstanding level, through simulations of\nnetworks on the MNIST and CIFAR10 tasks. If a standard BNN is used, up to 10^-4\nbit error rate can be tolerated with little impact on recognition performance\non both MNIST and CIFAR10. We then show that by adapting the training procedure\nto the fact that the BNN will be operated on error-prone hardware, this\ntolerance can be extended to a bit error rate of 4x10^-2. The requirements for\nRRAM are therefore a lot less stringent for BNNs than more traditional\napplications. We show, based on experimental measurements on a RRAM HfO2\ntechnology, that this result can allow reduce RRAM programming energy by a\nfactor 30.\n", "versions": [{"version": "v1", "created": "Sun, 7 Apr 2019 13:52:42 GMT"}], "update_date": "2019-04-09", "authors_parsed": [["Hirtzlin", "Tifenn", ""], ["Bocquet", "Marc", ""], ["Klein", "Jacques-Olivier", ""], ["Nowak", "Etienne", ""], ["Vianello", "Elisa", ""], ["Portal", "Jean-Michel", ""], ["Querlioz", "Damien", ""]]}, {"id": "1904.04304", "submitter": "Robert Rand", "authors": "Robert Rand", "title": "Verification Logics for Quantum Programs", "comments": "Originally submitted in March 2016 as a qualifying examination\n  (WPE-II) for the PhD program at the University of Pennsylvania", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.ET cs.PL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We survey the landscape of Hoare logics for quantum programs. We review three\npapers: \"Reasoning about imperative quantum programs\" by Chadha, Mateus and\nSernadas; \"A logic for formal verification of quantum programs\" by Yoshihiko\nKakutani; and \"Floyd-hoare logic for quantum programs\" by Mingsheng Ying. We\ncompare the mathematical foundations of the logics, their underlying languages,\nand the expressivity of their assertions. We also use the languages to verify\nthe Deutsch-Jozsa Algorithm, and discuss their relative usability in practice.\n", "versions": [{"version": "v1", "created": "Mon, 8 Apr 2019 19:13:07 GMT"}], "update_date": "2019-04-10", "authors_parsed": [["Rand", "Robert", ""]]}, {"id": "1904.04323", "submitter": "Abdullah Ash Saki", "authors": "Abdullah Ash Saki, Mahabubul Alam, Swaroop Ghosh", "title": "Study of Decoherence in Quantum Computers: A Circuit-Design Perspective", "comments": "6 pages, 7 figures, GOMACTech 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Decoherence of quantum states is a major hurdle towards scalable and reliable\nquantum computing. Lower decoherence (i.e., higher fidelity) can alleviate the\nerror correction overhead and obviate the need for energy-intensive noise\nreduction techniques e.g., cryogenic cooling. In this paper, we performed a\nnoise-induced decoherence analysis of single and multi-qubit quantum gates\nusing physics-based simulations. The analysis indicates that (i) decoherence\ndepends on the input state and the gate type. Larger number of $|1\\rangle$\nstates worsen the decoherence; (ii) amplitude damping is more detrimental than\nphase damping; (iii) shorter depth implementation of a quantum function can\nachieve lower decoherence. Simulations indicate 20\\% improvement in the\nfidelity of a quantum adder when realized using lower depth topology. The\ninsights developed in this paper can be exploited by the circuit designer to\nchoose the right gates and logic implementation to optimize the system-level\nfidelity.\n", "versions": [{"version": "v1", "created": "Mon, 8 Apr 2019 19:38:26 GMT"}], "update_date": "2019-04-10", "authors_parsed": [["Saki", "Abdullah Ash", ""], ["Alam", "Mahabubul", ""], ["Ghosh", "Swaroop", ""]]}, {"id": "1904.04338", "submitter": "Omar Shehab", "authors": "Omar Shehab, Kevin A. Landsman, Yunseong Nam, Daiwei Zhu, Norbert M.\n  Linke, Matthew J. Keesan, Raphael C. Pooser, Christopher R. Monroe", "title": "Toward convergence of effective field theory simulations on digital\n  quantum computers", "comments": "6 pages, two citation added and the grant number corrected", "journal-ref": "Phys. Rev. A 100, 062319 (2019)", "doi": "10.1103/PhysRevA.100.062319", "report-no": null, "categories": "quant-ph cs.ET nucl-th", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report results for simulating an effective field theory to compute the\nbinding energy of the deuteron nucleus using a hybrid algorithm on a\ntrapped-ion quantum computer. Two increasingly complex unitary coupled-cluster\nansaetze have been used to compute the binding energy to within a few percent\nfor successively more complex Hamiltonians. By increasing the complexity of the\nHamiltonian, allowing more terms in the effective field theory expansion and\ncalculating their expectation values, we present a benchmark for quantum\ncomputers based on their ability to scalably calculate the effective field\ntheory with increasing accuracy. Our result of $E_4=-2.220 \\pm 0.179$MeV may be\ncompared with the exact Deuteron ground-state energy $-2.224$MeV. We also\ndemonstrate an error mitigation technique using Richardson extrapolation on ion\ntraps for the first time. The error mitigation circuit represents a record for\ndeepest quantum circuit on a trapped-ion quantum computer.\n", "versions": [{"version": "v1", "created": "Mon, 8 Apr 2019 20:10:06 GMT"}, {"version": "v2", "created": "Thu, 18 Apr 2019 16:07:07 GMT"}], "update_date": "2019-12-25", "authors_parsed": [["Shehab", "Omar", ""], ["Landsman", "Kevin A.", ""], ["Nam", "Yunseong", ""], ["Zhu", "Daiwei", ""], ["Linke", "Norbert M.", ""], ["Keesan", "Matthew J.", ""], ["Pooser", "Raphael C.", ""], ["Monroe", "Christopher R.", ""]]}, {"id": "1904.04767", "submitter": "Maxwell Henderson", "authors": "Maxwell Henderson, Samriddhi Shakya, Shashindra Pradhan, and Tristan\n  Cook", "title": "Quanvolutional Neural Networks: Powering Image Recognition with Quantum\n  Circuits", "comments": "7 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Convolutional neural networks (CNNs) have rapidly risen in popularity for\nmany machine learning applications, particularly in the field of image\nrecognition. Much of the benefit generated from these networks comes from their\nability to extract features from the data in a hierarchical manner. These\nfeatures are extracted using various transformational layers, notably the\nconvolutional layer which gives the model its name. In this work, we introduce\na new type of transformational layer called a quantum convolution, or\nquanvolutional layer. Quanvolutional layers operate on input data by locally\ntransforming the data using a number of random quantum circuits, in a way that\nis similar to the transformations performed by random convolutional filter\nlayers. Provided these quantum transformations produce meaningful features for\nclassification purposes, then the overall algorithm could be quite useful for\nnear term quantum computing, because it requires small quantum circuits with\nlittle to no error correction. In this work, we empirically evaluated the\npotential benefit of these quantum transformations by comparing three types of\nmodels built on the MNIST dataset: CNNs, quantum convolutional neural networks\n(QNNs), and CNNs with additional non-linearities introduced. Our results showed\nthat the QNN models had both higher test set accuracy as well as faster\ntraining compared to the purely classical CNNs.\n", "versions": [{"version": "v1", "created": "Tue, 9 Apr 2019 16:25:48 GMT"}], "update_date": "2019-04-10", "authors_parsed": [["Henderson", "Maxwell", ""], ["Shakya", "Samriddhi", ""], ["Pradhan", "Shashindra", ""], ["Cook", "Tristan", ""]]}, {"id": "1904.04899", "submitter": "Sean Bearden", "authors": "Sean R. B. Bearden, Forrest C. Sheldon, Massimiliano Di Ventra", "title": "Critical branching processes in digital memcomputing machines", "comments": "5 pages, 3 figures", "journal-ref": "EPL (Europhysics Letters), Volume 127, Number 3 2019", "doi": "10.1209/0295-5075/127/30005", "report-no": null, "categories": "cond-mat.stat-mech cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Memcomputing is a novel computing paradigm that employs time non-locality\n(memory) to solve combinatorial optimization problems. It can be realized in\npractice by means of non-linear dynamical systems whose point attractors\nrepresent the solutions of the original problem. It has been previously shown\nthat during the solution search digital memcomputing machines go through a\ntransient phase of avalanches (instantons) that promote dynamical long-range\norder. By employing mean-field arguments we predict that the distribution of\nthe avalanche sizes follows a Borel distribution typical of critical branching\nprocesses with exponent $\\tau= 3/2$. We corroborate this analysis by solving\nvarious random 3-SAT instances of the Boolean satisfiability problem. The\nnumerical results indicate a power-law distribution with exponent $\\tau = 1.51\n\\pm 0.02$, in very good agreement with the mean-field analysis. This indicates\nthat memcomputing machines self-tune to a critical state in which avalanches\nare characterized by a branching process, and that this state persists across\nthe majority of their evolution.\n", "versions": [{"version": "v1", "created": "Tue, 9 Apr 2019 20:38:32 GMT"}, {"version": "v2", "created": "Tue, 22 Oct 2019 19:54:17 GMT"}], "update_date": "2020-01-08", "authors_parsed": [["Bearden", "Sean R. B.", ""], ["Sheldon", "Forrest C.", ""], ["Di Ventra", "Massimiliano", ""]]}, {"id": "1904.06319", "submitter": "Robert Rand", "authors": "Kesha Hietala, Robert Rand, Shih-Han Hung, Xiaodi Wu, Michael Hicks", "title": "Verified Optimization in a Quantum Intermediate Representation", "comments": "Superceded by arXiv:1912.02250", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.ET cs.PL quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present sqire, a low-level language for quantum computing and\nverification. sqire uses a global register of quantum bits, allowing easy\ncompilation to and from existing `quantum assembly' languages and simplifying\nthe verification process. We demonstrate the power of sqire as an intermediate\nrepresentation of quantum programs by verifying a number of useful\noptimizations, and we demonstrate sqire's use as a tool for general\nverification by proving several quantum programs correct.\n", "versions": [{"version": "v1", "created": "Fri, 12 Apr 2019 16:54:17 GMT"}, {"version": "v2", "created": "Tue, 23 Apr 2019 20:59:06 GMT"}, {"version": "v3", "created": "Fri, 31 May 2019 16:08:47 GMT"}, {"version": "v4", "created": "Fri, 6 Dec 2019 06:17:23 GMT"}], "update_date": "2019-12-09", "authors_parsed": [["Hietala", "Kesha", ""], ["Rand", "Robert", ""], ["Hung", "Shih-Han", ""], ["Wu", "Xiaodi", ""], ["Hicks", "Michael", ""]]}, {"id": "1904.06526", "submitter": "Andrew Adamatzky", "authors": "Andrew Adamatzky", "title": "On interplay between excitability and geometry", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET nlin.PS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A commonly accepted feature of an excitable medium is that a local excitation\nleads to a propagation of circular or spiral excitation wave-fronts. This is\nindeed the case in fully excitable medium. However, with a decrease of an\nexcitability localised wave-fragments emerge and propagate ballistically. Using\nFitzhHugh-Nagumo model we numerically study how excitation wave-fronts behave\nin a geometrically constrained medium and how the wave-fronts explore a random\nplanar graph. We uncover how excitability controls propagation of excitation in\nangled branches, influences arrest of excitation entering a sudden expansion,\nand determines patterns of traversing of a random planar graph by an excitation\nwaves.\n", "versions": [{"version": "v1", "created": "Sat, 13 Apr 2019 10:49:49 GMT"}], "update_date": "2019-04-16", "authors_parsed": [["Adamatzky", "Andrew", ""]]}, {"id": "1904.06920", "submitter": "Debjyoti Bhattacharjee", "authors": "Laxmidhar Biswal, Debjyoti Bhattacharjee, Anupam Chattopadhyay and\n  Hafizur Rahaman", "title": "New techniques for fault-tolerant decomposition of Multi-Controlled\n  Toffoli gate", "comments": "9 pages, 11 figures", "journal-ref": "Phys. Rev. A 100, 062326 (2019)", "doi": "10.1103/PhysRevA.100.062326", "report-no": null, "categories": "cs.ET quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Physical implementation of scalable quantum architectures faces an immense\nchallenge in form of fragile quantum states. To overcome it, quantum\narchitectures with fault tolerance is desirable. This is achieved currently by\nusing surface code along with a transversal gate set. This dictates the need\nfor decomposition of universal Multi Control Toffoli~(MCT) gates using a\ntransversal gate set. Additionally, the transversal non-Clifford phase gate\nincurs high latency which makes it an important factor to consider during\ndecomposition.Besides, the decomposition of large Multi-control Toffoli~(MCT)\ngate without ancilla presents an additional hurdle. In this manuscript, we\naddress both of these issues by introducing Clifford+$Z_N$ gate library. We\npresent an ancilla free decomposition of MCT gates with linear phase depth and\nquadratic phase count. Furthermore, we provide a technique for decomposition of\nMCT gates in unit phase depth using the Clifford+$Z_N$ library, albeit at the\ncost of ancillary lines and quadratic phase count.\n", "versions": [{"version": "v1", "created": "Mon, 15 Apr 2019 09:17:31 GMT"}, {"version": "v2", "created": "Sun, 28 Apr 2019 10:49:45 GMT"}], "update_date": "2019-12-25", "authors_parsed": [["Biswal", "Laxmidhar", ""], ["Bhattacharjee", "Debjyoti", ""], ["Chattopadhyay", "Anupam", ""], ["Rahaman", "Hafizur", ""]]}, {"id": "1904.07864", "submitter": "Arman Roohi", "authors": "Arman Roohi, Shaahin Angizi, Deliang Fan, and Ronald F DeMara", "title": "Processing-In-Memory Acceleration of Convolutional Neural Networks for\n  Energy-Efficiency, and Power-Intermittency Resilience", "comments": "6 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.AR cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Herein, a bit-wise Convolutional Neural Network (CNN) in-memory accelerator\nis implemented using Spin-Orbit Torque Magnetic Random Access Memory (SOT-MRAM)\ncomputational sub-arrays. It utilizes a novel AND-Accumulation method capable\nof significantly-reduced energy consumption within convolutional layers and\nperforms various low bit-width CNN inference operations entirely within MRAM.\nPower-intermittence resiliency is also enhanced by retaining the partial state\ninformation needed to maintain computational forward-progress, which is\nadvantageous for battery-less IoT nodes. Simulation results indicate\n$\\sim$5.4$\\times$ higher energy-efficiency and 9$\\times$ speedup over\nReRAM-based acceleration, or roughly $\\sim$9.7$\\times$ higher energy-efficiency\nand 13.5$\\times$ speedup over recent CMOS-only approaches, while maintaining\ninference accuracy comparable to baseline designs.\n", "versions": [{"version": "v1", "created": "Tue, 16 Apr 2019 16:22:16 GMT"}], "update_date": "2019-04-18", "authors_parsed": [["Roohi", "Arman", ""], ["Angizi", "Shaahin", ""], ["Fan", "Deliang", ""], ["DeMara", "Ronald F", ""]]}, {"id": "1904.08142", "submitter": "Yuriy Pershin", "authors": "V. A. Slipko and Y. V. Pershin", "title": "Transient dynamics of pulse-driven memristors in the presence of a\n  stable fixed point", "comments": null, "journal-ref": null, "doi": "10.1016/j.physe.2019.113561", "report-no": null, "categories": "cs.ET cond-mat.mes-hall", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Some memristors are quite interesting from the point of view of dynamical\nsystems. When driven by narrow pulses of alternating polarities, their dynamics\nhas a stable fixed point, which may be useful for future applications. We study\nthe transient dynamics of two types of memristors characterized by a stable\nfixed point using a time-averaged evolution equation. Time-averaged\ntrajectories of the Biolek window function memristor and resistor-threshold\ntype memristor circuit (an effective memristor) are determined analytically,\nand the times of relaxation to the stable fixed point are found. Our analytical\nresults are in perfect agreement with the results of numerical simulations.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2019 08:58:45 GMT"}], "update_date": "2019-06-26", "authors_parsed": [["Slipko", "V. A.", ""], ["Pershin", "Y. V.", ""]]}, {"id": "1904.08307", "submitter": "Karl Svozil", "authors": "Karl Svozil", "title": "Quantum advantage by relational queries about physically realizable\n  equivalence classes", "comments": "8 Pages, one figure, invited contribution to TopHPC2019, Tehran,\n  Iran, April 22-25, 2019", "journal-ref": "In: Grandinetti L., Mirtaheri S., Shahbazian R. (eds)\n  High-Performance Computing and Big Data Analysis. TopHPC 2019. Communications\n  in Computer and Information Science, vol 891 (Springer, Cham, 2019), pp\n  504-512", "doi": "10.1007/978-3-030-33495-6_39", "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Relational quantum queries are sometimes capable to effectively decide\nbetween collections of mutually exclusive elementary cases without completely\nresolving and determining those individual instances. Thereby the set of\nmutually exclusive elementary cases is effectively partitioned into equivalence\nclasses pertinent to the respective query. In the second part of the paper, we\nreview recent progress in theoretical certifications (relative to the\nassumptions made) of quantum value indeterminacy as a means to build quantum\noracles for randomness.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2019 15:08:53 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Svozil", "Karl", ""]]}, {"id": "1904.08513", "submitter": "Charlotte Frenkel", "authors": "Charlotte Frenkel, Jean-Didier Legat, David Bol", "title": "MorphIC: A 65-nm 738k-Synapse/mm$^2$ Quad-Core Binary-Weight Digital\n  Neuromorphic Processor with Stochastic Spike-Driven Online Learning", "comments": "This document is the paper as accepted for publication in the IEEE\n  Transactions on Biomedical Circuits and Systems journal (2019), the\n  fully-edited paper is available at\n  https://ieeexplore.ieee.org/document/8764001", "journal-ref": null, "doi": "10.1109/TBCAS.2019.2928793", "report-no": null, "categories": "cs.NE cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent trends in the field of neural network accelerators investigate weight\nquantization as a means to increase the resource- and power-efficiency of\nhardware devices. As full on-chip weight storage is necessary to avoid the high\nenergy cost of off-chip memory accesses, memory reduction requirements for\nweight storage pushed toward the use of binary weights, which were demonstrated\nto have a limited accuracy reduction on many applications when\nquantization-aware training techniques are used. In parallel, spiking neural\nnetwork (SNN) architectures are explored to further reduce power when\nprocessing sparse event-based data streams, while on-chip spike-based online\nlearning appears as a key feature for applications constrained in power and\nresources during the training phase. However, designing power- and\narea-efficient spiking neural networks still requires the development of\nspecific techniques in order to leverage on-chip online learning on binary\nweights without compromising the synapse density. In this work, we demonstrate\nMorphIC, a quad-core binary-weight digital neuromorphic processor embedding a\nstochastic version of the spike-driven synaptic plasticity (S-SDSP) learning\nrule and a hierarchical routing fabric for large-scale chip interconnection.\nThe MorphIC SNN processor embeds a total of 2k leaky integrate-and-fire (LIF)\nneurons and more than two million plastic synapses for an active silicon area\nof 2.86mm$^2$ in 65nm CMOS, achieving a high density of 738k synapses/mm$^2$.\nMorphIC demonstrates an order-of-magnitude improvement in the area-accuracy\ntradeoff on the MNIST classification task compared to previously-proposed SNNs,\nwhile having no penalty in the energy-accuracy tradeoff.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2019 21:38:32 GMT"}, {"version": "v2", "created": "Tue, 16 Jul 2019 10:56:10 GMT"}], "update_date": "2019-07-17", "authors_parsed": [["Frenkel", "Charlotte", ""], ["Legat", "Jean-Didier", ""], ["Bol", "David", ""]]}, {"id": "1904.09266", "submitter": "Eduardo Castell\\'o Ferrer", "authors": "Eduardo Castell\\'o Ferrer and Thomas Hardjono and Alex 'Sandy'\n  Pentland and Marco Dorigo", "title": "Secure and secret cooperation in robotic swarms", "comments": "32 pages, 6 figures, submitted to Science Robotics", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.CR cs.DS cs.ET cs.MA", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The importance of swarm robotics systems in both academic research and\nreal-world applications is steadily increasing. However, to reach widespread\nadoption, new models that ensure the secure cooperation of large groups of\nrobots need to be developed. This work introduces a novel method to encapsulate\ncooperative robotic missions in an authenticated data structure known as Merkle\ntree. With this method, operators can provide the \"blueprint\" of the swarm's\nmission without disclosing its raw data. In other words, data verification can\nbe separated from data itself. We propose a system where robots in a swarm, to\ncooperate towards mission completion, have to \"prove\" their integrity to their\npeers by exchanging cryptographic proofs. We show the implications of this\napproach for two different swarm robotics missions: foraging and maze\nformation. In both missions, swarm robots were able to cooperate and carry out\nsequential operations without having explicit knowledge about the mission's\nhigh-level objectives. The results presented in this work demonstrate the\nfeasibility of using Merkle trees as a cooperation mechanism for swarm robotics\nsystems in both simulation and real-robot experiments, which has implications\nfor future decentralized robotics applications where security plays a crucial\nrole such as environmental monitoring, infrastructure surveillance, and\ndisaster management.\n", "versions": [{"version": "v1", "created": "Fri, 19 Apr 2019 17:00:13 GMT"}, {"version": "v2", "created": "Sun, 7 Jul 2019 01:14:07 GMT"}, {"version": "v3", "created": "Thu, 1 Apr 2021 21:45:13 GMT"}], "update_date": "2021-04-05", "authors_parsed": [["Ferrer", "Eduardo Castelló", ""], ["Hardjono", "Thomas", ""], ["Pentland", "Alex 'Sandy'", ""], ["Dorigo", "Marco", ""]]}, {"id": "1904.09363", "submitter": "Kyle Kuan", "authors": "Kyle Kuan and Tosiron Adegbija", "title": "Energy-Efficient Runtime Adaptable L1 STT-RAM Cache Design", "comments": null, "journal-ref": null, "doi": "10.1109/TCAD.2019.2912920", "report-no": null, "categories": "cs.AR cs.DC cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Much research has shown that applications have variable runtime cache\nrequirements. In the context of the increasingly popular Spin-Transfer Torque\nRAM (STT-RAM) cache, the retention time, which defines how long the cache can\nretain a cache block in the absence of power, is one of the most important\ncache requirements that may vary for different applications. In this paper, we\npropose a Logically Adaptable Retention Time STT-RAM (LARS) cache that allows\nthe retention time to be dynamically adapted to applications' runtime\nrequirements. LARS cache comprises of multiple STT-RAM units with different\nretention times, with only one unit being used at a given time. LARS\ndynamically determines which STT-RAM unit to use during runtime, based on\nexecuting applications' needs. As an integral part of LARS, we also explore\ndifferent algorithms to dynamically determine the best retention time based on\ndifferent cache design tradeoffs. Our experiments show that by adapting the\nretention time to different applications' requirements, LARS cache can reduce\nthe average cache energy by 25.31%, compared to prior work, with minimal\noverheads.\n", "versions": [{"version": "v1", "created": "Fri, 19 Apr 2019 23:03:04 GMT"}], "update_date": "2019-05-20", "authors_parsed": [["Kuan", "Kyle", ""], ["Adegbija", "Tosiron", ""]]}, {"id": "1904.09554", "submitter": "Yawen Zhang", "authors": "Yawen Zhang, Runsheng Wang, Xinyue Zhang, Zherui Zhang, Jiahao Song,\n  Zuodong Zhang, Yuan Wang, and Ru Huang", "title": "A Parallel Bitstream Generator for Stochastic Computing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.AR eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic computing (SC) presents high error tolerance and low hardware\ncost, and has great potential in applications such as neural networks and image\nprocessing. However, the bitstream generator, which converts a binary number to\nbitstreams, occupies a large area and energy consumption, thus weakening the\nsuperiority of SC. In this paper, we propose a novel technique for generating\nbitstreams in parallel, which needs only one clock for conversion and\nsignificantly reduces the hardware cost. Synthesis results demonstrate that the\nproposed parallel bitstream generator improves 2.5x area and 712x energy\nconsumption.\n", "versions": [{"version": "v1", "created": "Sun, 21 Apr 2019 07:16:06 GMT"}], "update_date": "2019-04-23", "authors_parsed": [["Zhang", "Yawen", ""], ["Wang", "Runsheng", ""], ["Zhang", "Xinyue", ""], ["Zhang", "Zherui", ""], ["Song", "Jiahao", ""], ["Zhang", "Zuodong", ""], ["Wang", "Yuan", ""], ["Huang", "Ru", ""]]}, {"id": "1904.10211", "submitter": "Tianshi Wang", "authors": "Tianshi Wang, Leon Wu, Jaijeet Roychowdhury", "title": "Late Breaking Results: New Computational Results and Hardware Prototypes\n  for Oscillator-based Ising Machines", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we report new results on a novel Ising machine technology for\nsolving combinatorial optimization problems using networks of coupled\nself-sustaining oscillators. Specifically, we present several working hardware\nprototypes using CMOS electronic oscillators, built on breadboards/perfboards\nand PCBs, implementing Ising machines consisting of up to 240 spins with\nprogrammable couplings. We also report that, just by simulating the\ndifferential equations of such Ising machines of larger sizes, good solutions\ncan be achieved easily on benchmark optimization problems, demonstrating the\neffectiveness of oscillator-based Ising machines.\n", "versions": [{"version": "v1", "created": "Tue, 23 Apr 2019 09:07:18 GMT"}], "update_date": "2019-04-24", "authors_parsed": [["Wang", "Tianshi", ""], ["Wu", "Leon", ""], ["Roychowdhury", "Jaijeet", ""]]}, {"id": "1904.10389", "submitter": "Christian Mayr", "authors": "Johannes Partzsch, Christian Mayr, Massimiliano Giulioni, Marko Noack,\n  Stefan H\\\"anzsche, Stefan Scholze, Sebastian H\\\"oppner, Paolo Del Giudice,\n  Rene Sch\\\"uffny", "title": "Mean Field Approach for Configuring Population Dynamics on a Biohybrid\n  Neuromorphic System", "comments": "21 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Real-time coupling of cell cultures to neuromorphic circuits necessitates a\nneuromorphic network that replicates biological behaviour both on a per-neuron\nand on a population basis, with a network size comparable to the culture. We\npresent a large neuromorphic system composed of 9 chips, with overall 2880\nneurons and 144M conductance-based synapses. As they are realized in a robust\nswitched-capacitor fashion, individual neurons and synapses can be configured\nto replicate with high fidelity a wide range of biologically realistic\nbehaviour. In contrast to other exploration/heuristics-based approaches, we\nemploy a theory-guided mesoscopic approach to configure the overall network to\na range of bursting behaviours, thus replicating the statistics of our targeted\nin-vitro network. The mesoscopic approach has implications beyond our proposed\nbiohybrid, as it allows a targeted exploration of the behavioural space, which\nis a non-trivial task especially in large, recurrent networks.\n", "versions": [{"version": "v1", "created": "Tue, 23 Apr 2019 15:32:28 GMT"}], "update_date": "2019-04-24", "authors_parsed": [["Partzsch", "Johannes", ""], ["Mayr", "Christian", ""], ["Giulioni", "Massimiliano", ""], ["Noack", "Marko", ""], ["Hänzsche", "Stefan", ""], ["Scholze", "Stefan", ""], ["Höppner", "Sebastian", ""], ["Del Giudice", "Paolo", ""], ["Schüffny", "Rene", ""]]}, {"id": "1904.10508", "submitter": "Yasunao Katayama Ph.D.", "authors": "Yasunao Katayama", "title": "Quantum-Inspired Computing: Can it be a Microscopic Computing Model of\n  the Brain?", "comments": "31 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC cs.ET cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Quantum computing and the workings of the brain have many aspects in common\nand have been attracting increasing attention in academia and industry. The\ncomputation in both is parallel and non-discrete. Though the underlying\nphysical dynamics (e.g., equation of motion) may be deterministic, the observed\nor interpreted outcomes are often probabilistic. Consequently, various\ninvestigations have been undertaken to understand and reproduce the brain on\nthe basis of quantum physics and computing. However, there have been arguments\non whether the brain can and have to take advantage of quantum phenomena that\nneed to survive in the macroscopic space-time region at room temperature. This\npaper presents a unique microscopic computational model for the brain based on\nan ansatz that the brain computes in a manner similar to quantum computing, but\nwith classical waves. Log-scale encoding of information in the context of\ncomputing with waves is shown to play a critical role in bridging the computing\nmodels with classical and quantum waves. Our quantum-inspired computing model\nopens up a possibility of unifying the computing framework of artificial\nintelligence and quantum computing beyond quantum machine learning approaches.\n", "versions": [{"version": "v1", "created": "Thu, 11 Apr 2019 01:12:23 GMT"}, {"version": "v2", "created": "Wed, 13 Nov 2019 02:28:54 GMT"}], "update_date": "2019-11-14", "authors_parsed": [["Katayama", "Yasunao", ""]]}, {"id": "1904.10564", "submitter": "Arman Roohi", "authors": "Arman Roohi, and Ronald F DeMara", "title": "IRC: Cross-layer design exploration of Intermittent Robust Computation\n  units for IoTs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Energy-harvesting-powered computing offers intriguing and vast opportunities\nto dramatically transform the landscape of the Internet of Things (IoT) devices\nby utilizing ambient sources of energy to achieve battery-free computing. In\norder to operate within the restricted energy capacity and intermittency\nprofile, it is proposed to innovate Intermittent Robust Computation (IRC) Unit\nas a new duty-cycle-variable computing approach leveraging the non-volatility\ninherent in spin-based switching devices. The foundations of IRC will be\nadvanced from the device-level upwards, by extending a Spin Hall Effect\nMagnetic Tunnel Junction (SHE-MTJ) device. The device will then be used to\nrealize SHE-MTJ Majority/Polymorphic Gate (MG/PG) logic approaches and\nlibraries. Then a Logic-Embedded Flip-Flop (LE-FF) is developed to realize\nrudimentary Boolean logic functions along with an inherent state-holding\ncapability within a compact footprint. Finally, the NV-Clustering synthesis\nprocedure and corresponding tool module are proposed to instantiate the LE-FF\nlibrary cells within conventional Register Transfer Language (RTL)\nspecifications. This selectively clusters together logic and NV state-holding\nfunctionality, based on energy and area minimization criteria. It also realizes\nmiddleware-coherent, intermittent computation without checkpointing,\nmicro-tasking, or software bloat and energy overheads vital to IoT. Simulation\nresults for various benchmark circuits including ISCAS-89 validate\nfunctionality and power dissipation, area, and delay benefits.\n", "versions": [{"version": "v1", "created": "Tue, 23 Apr 2019 23:03:54 GMT"}], "update_date": "2019-04-25", "authors_parsed": [["Roohi", "Arman", ""], ["DeMara", "Ronald F", ""]]}, {"id": "1904.10670", "submitter": "Christos Liaskos K.", "authors": "Christos Liaskos, Ageliki Tsioliaridou, Alexandros Pitilakis, George\n  Pirialakos, Odysseas Tsilipakos, Anna Tasolamprou, Nikolaos Kantartzis,\n  Sotiris Ioannidis, Maria Kafesaki, Andreas Pitsillides, Ian Akyildiz", "title": "Joint Compressed Sensing and Manipulation of Wireless Emissions with\n  Intelligent Surfaces", "comments": "Published at IEEE DCOSS 2019 / IoT4.0 workshop\n  (https://www.dcoss.org/workshops.html). Funded by the European Union via the\n  Horizon 2020: Future Emerging Topics - Research and Innovation Action call\n  (FETOPEN-RIA), grant EU736876, project VISORSURF (http://www.visorsurf.eu)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.NI cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Programmable, intelligent surfaces can manipulate electromagnetic waves\nimpinging upon them, producing arbitrarily shaped reflection, refraction and\ndiffraction, to the benefit of wireless users. Moreover, in their recent form\nof HyperSurfaces, they have acquired inter-networking capabilities, enabling\nthe Internet of Material Properties with immense potential in wireless\ncommunications. However, as with any system with inputs and outputs, accurate\nsensing of the impinging wave attributes is imperative for programming\nHyperSurfaces to obtain a required response. Related solutions include field\nnano-sensors embedded within HyperSurfaces to perform minute measurements over\nthe area of the HyperSurface, as well as external sensing systems. The present\nwork proposes a sensing system that can operate without such additional\nhardware. The novel scheme programs the HyperSurface to perform compressed\nsensing of the impinging wave via simple one-antenna power measurements. The\nHyperSurface can jointly be programmed for both wave sensing and wave\nmanipulation duties at the same time. Evaluation via simulations validates the\nconcept and highlight its promising potential.\n", "versions": [{"version": "v1", "created": "Wed, 24 Apr 2019 07:42:44 GMT"}], "update_date": "2019-04-25", "authors_parsed": [["Liaskos", "Christos", ""], ["Tsioliaridou", "Ageliki", ""], ["Pitilakis", "Alexandros", ""], ["Pirialakos", "George", ""], ["Tsilipakos", "Odysseas", ""], ["Tasolamprou", "Anna", ""], ["Kantartzis", "Nikolaos", ""], ["Ioannidis", "Sotiris", ""], ["Kafesaki", "Maria", ""], ["Pitsillides", "Andreas", ""], ["Akyildiz", "Ian", ""]]}, {"id": "1904.11236", "submitter": "Julie Grollier", "authors": "M. Riou, F. Abreu Araujo, J. Torrejon, S. Tsunegi, G. Khalsa, D.\n  Querlioz, P. Bortolotti, V. Cros, K. Yakushiji, A. Fukushima, H. Kubota, S.\n  Yuasa, M. D. Stiles, and J. Grollier", "title": "Neuromorphic Computing through Time-Multiplexing with a Spin-Torque\n  Nano-Oscillator", "comments": null, "journal-ref": null, "doi": "10.1109/IEDM.2017.8268505", "report-no": null, "categories": "cs.ET physics.app-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fabricating powerful neuromorphic chips the size of a thumb requires\nminiaturizing their basic units: synapses and neurons. The challenge for\nneurons is to scale them down to submicrometer diameters while maintaining the\nproperties that allow for reliable information processing: high signal to noise\nratio, endurance, stability, reproducibility. In this work, we show that\ncompact spin-torque nano-oscillators can naturally implement such neurons, and\nquantify their ability to realize an actual cognitive task. In particular, we\nshow that they can naturally implement reservoir computing with high\nperformance and detail the recipes for this capability.\n", "versions": [{"version": "v1", "created": "Thu, 25 Apr 2019 09:47:44 GMT"}], "update_date": "2019-04-26", "authors_parsed": [["Riou", "M.", ""], ["Araujo", "F. Abreu", ""], ["Torrejon", "J.", ""], ["Tsunegi", "S.", ""], ["Khalsa", "G.", ""], ["Querlioz", "D.", ""], ["Bortolotti", "P.", ""], ["Cros", "V.", ""], ["Yakushiji", "K.", ""], ["Fukushima", "A.", ""], ["Kubota", "H.", ""], ["Yuasa", "S.", ""], ["Stiles", "M. D.", ""], ["Grollier", "J.", ""]]}, {"id": "1904.11240", "submitter": "Julie Grollier", "authors": "P. Talatchian, M. Romera, S. Tsunegi, F. Abreu Araujo, V. Cros, P.\n  Bortolotti, J. Trastoy, K. Yakushiji, A. Fukushima, H. Kubota, S. Yuasa, M.\n  Ernoult, D. Vodenicarevic, T. Hirtzlin, N. Locatelli, D. Querlioz, J.\n  Grollier", "title": "Microwave neural processing and broadcasting with spintronic\n  nano-oscillators", "comments": null, "journal-ref": null, "doi": "10.1109/IEDM.2018.8614585", "report-no": null, "categories": "physics.app-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Can we build small neuromorphic chips capable of training deep networks with\nbillions of parameters? This challenge requires hardware neurons and synapses\nwith nanometric dimensions, which can be individually tuned, and densely\nconnected. While nanosynaptic devices have been pursued actively in recent\nyears, much less has been done on nanoscale artificial neurons. In this paper,\nwe show that spintronic nano-oscillators are promising to implement analog\nhardware neurons that can be densely interconnected through electromagnetic\nsignals. We show how spintronic oscillators maps the requirements of artificial\nneurons. We then show experimentally how an ensemble of four coupled\noscillators can learn to classify all twelve American vowels, realizing the\nmost complicated tasks performed by nanoscale neurons.\n", "versions": [{"version": "v1", "created": "Thu, 25 Apr 2019 09:54:42 GMT"}], "update_date": "2019-04-26", "authors_parsed": [["Talatchian", "P.", ""], ["Romera", "M.", ""], ["Tsunegi", "S.", ""], ["Araujo", "F. Abreu", ""], ["Cros", "V.", ""], ["Bortolotti", "P.", ""], ["Trastoy", "J.", ""], ["Yakushiji", "K.", ""], ["Fukushima", "A.", ""], ["Kubota", "H.", ""], ["Yuasa", "S.", ""], ["Ernoult", "M.", ""], ["Vodenicarevic", "D.", ""], ["Hirtzlin", "T.", ""], ["Locatelli", "N.", ""], ["Querlioz", "D.", ""], ["Grollier", "J.", ""]]}, {"id": "1904.11590", "submitter": "Gushu Li", "authors": "Gushu Li, Yufei Ding, Yuan Xie", "title": "SANQ: A Simulation Framework for Architecting Noisy Intermediate-Scale\n  Quantum Computing System", "comments": "13 pages, 16 figures, In Submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To bridge the gap between limited hardware access and the huge demand for\nexperiments for Noisy Intermediate-Scale Quantum (NISQ) computing system study,\na simulator which can capture the modeling of both the quantum processor and\nits classical control system to realize early-stage evaluation and design space\nexploration, is naturally invoked but still missing. This paper presents SANQ,\na Simulation framework for Architecting NISQ computing system. SANQ consists of\ntwo components, 1) an optimized noisy quantum computing (QC) simulator with\nflexible error modeling accelerated by eliminating redundant computation, and\n2) an architectural simulation infrastructure to construct behavior models for\nevaluating the control systems. SANQ is validated with existing NISQ quantum\nprocessor and control systems to ensure simulation accuracy. It can capture the\nvariance on the QC device and simulate the timing behavior precisely (<1% and\n10% error for various real control systems). Several potential applications are\nproposed to show that SANQ could benefit the future design of NISQ compiler,\narchitecture, etc.\n", "versions": [{"version": "v1", "created": "Wed, 24 Apr 2019 03:08:08 GMT"}, {"version": "v2", "created": "Tue, 7 May 2019 09:31:57 GMT"}], "update_date": "2019-05-08", "authors_parsed": [["Li", "Gushu", ""], ["Ding", "Yufei", ""], ["Xie", "Yuan", ""]]}, {"id": "1904.12292", "submitter": "Zhiri Tang", "authors": "Zhiri Tang, Ruohua Zhu, Ruihan Hu, Yanhua Chen, Edmond Q. Wu, Hao\n  Wang, Jin He, Qijun Huang, Sheng Chang", "title": "A Multilayer Neural Network Merging Image Preprocessing and Pattern\n  Recognition by Integrating Diffusion and Drift Memristors", "comments": "Accepted by IEEE Transactions on Cognitive and Developmental Systems", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the development of research on novel memristor model and device, neural\nnetworks by integrating various memristor models have become a hot research\ntopic recently. However, state-of-the-art works still build such neural\nnetworks using drift memristor only. Furthermore, some other related works are\nonly applied to a few individual applications including pattern recognition and\nedge detection. In this paper, a novel kind of multilayer neural network is\nproposed, in which diffusion and drift memristor models are applied to\nconstruct a system merging image preprocessing and pattern recognition.\nSpecifically, the entire network consists of two diffusion memristive cellular\nlayers for image preprocessing and one drift memristive feedforward layer for\npattern recognition. Experimental results show that good recognition accuracy\nof noisy MNIST is obtained due to the fusion of image preprocessing and pattern\nrecognition. Moreover, owing to high-efficiency in-memory computing and brief\nspiking encoding methods, high processing speed, high throughput, and few\nhardware resources of the entire network are achieved.\n", "versions": [{"version": "v1", "created": "Sun, 28 Apr 2019 10:00:01 GMT"}, {"version": "v2", "created": "Sat, 4 May 2019 06:42:27 GMT"}, {"version": "v3", "created": "Mon, 22 Jul 2019 04:24:59 GMT"}, {"version": "v4", "created": "Tue, 19 May 2020 08:41:52 GMT"}], "update_date": "2020-05-20", "authors_parsed": [["Tang", "Zhiri", ""], ["Zhu", "Ruohua", ""], ["Hu", "Ruihan", ""], ["Chen", "Yanhua", ""], ["Wu", "Edmond Q.", ""], ["Wang", "Hao", ""], ["He", "Jin", ""], ["Huang", "Qijun", ""], ["Chang", "Sheng", ""]]}]