[{"id": "1109.0094", "submitter": "Heba Affify", "authors": "Heba Afify, Muhammad Islam and Manal Abdel Wahed", "title": "DNA Lossless Differential Compression Algorithm based on Similarity of\n  Genomic Sequence Database", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.CE cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern biological science produces vast amounts of genomic sequence data.\nThis is fuelling the need for efficient algorithms for sequence compression and\nanalysis. Data compression and the associated techniques coming from\ninformation theory are often perceived as being of interest for data\ncommunication and storage. In recent years, a substantial effort has been made\nfor the application of textual data compression techniques to various\ncomputational biology tasks, ranging from storage and indexing of large\ndatasets to comparison of genomic databases. This paper presents a differential\ncompression algorithm that is based on production of difference sequences\naccording to op-code table in order to optimize the compression of homologous\nsequences in dataset. Therefore, the stored data are composed of reference\nsequence, the set of differences, and differences locations, instead of storing\neach sequence individually. This algorithm does not require a priori knowledge\nabout the statistics of the sequence set. The algorithm was applied to three\ndifferent datasets of genomic sequences, it achieved up to 195-fold compression\nrate corresponding to 99.4% space saving.\n", "versions": [{"version": "v1", "created": "Thu, 1 Sep 2011 05:39:35 GMT"}], "update_date": "2011-09-05", "authors_parsed": [["Afify", "Heba", ""], ["Islam", "Muhammad", ""], ["Wahed", "Manal Abdel", ""]]}, {"id": "1109.0651", "submitter": "Matthew Knepley", "authors": "Jaydeep P. Bardhan, Matthew G. Knepley", "title": "Mathematical Analysis of the BIBEE Approximation for Molecular\n  Solvation: Exact Results for Spherical Inclusions", "comments": "33 pages, 5 figures", "journal-ref": "Journal of Chemical Physics, 135(12):124107-124117, 2011", "doi": "10.1063/1.3641485", "report-no": null, "categories": "cs.CE physics.chem-ph physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the mathematically rigorous BIBEE (boundary-integral based\nelectrostatics estimation) approximation of the mixed-dielectric continuum\nmodel of molecular electrostatics, using the analytically solvable case of a\nspherical solute containing an arbitrary charge distribution. Our analysis,\nwhich builds on Kirkwood's solution using spherical harmonics, clarifies\nimportant aspects of the approximation and its relationship to Generalized Born\nmodels. First, our results suggest a new perspective for analyzing fast\nelectrostatic models: the separation of variables between material properties\n(the dielectric constants) and geometry (the solute dielectric boundary and\ncharge distribution). Second, we find that the eigenfunctions of the\nreaction-potential operator are exactly preserved in the BIBEE model for the\nsphere, which supports the use of this approximation for analyzing\ncharge-charge interactions in molecular binding. Third, a comparison of BIBEE\nto the recent GB$\\epsilon$ theory suggests a modified BIBEE model capable of\npredicting electrostatic solvation free energies to within 4% of a full\nnumerical Poisson calculation. This modified model leads to a\nprojection-framework understanding of BIBEE and suggests opportunities for\nfuture improvements.\n", "versions": [{"version": "v1", "created": "Sat, 3 Sep 2011 20:16:54 GMT"}], "update_date": "2015-05-30", "authors_parsed": [["Bardhan", "Jaydeep P.", ""], ["Knepley", "Matthew G.", ""]]}, {"id": "1109.1044", "submitter": "EPTCS", "authors": "Ion Petre ({\\AA}bo Akademi University), Erik de Vink (Eindhoven\n  University of Technology)", "title": "Proceedings Third International Workshop on Computational Models for\n  Cell Processes", "comments": null, "journal-ref": "EPTCS 67, 2011", "doi": "10.4204/EPTCS.67", "report-no": null, "categories": "cs.CE q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the final versions of the papers presented at the 3rd\nInternational Workshop on Computational Models for Cell Processes (CompMod\n2011). The workshop took place on September 10, 2011 at the University of\nAachen, Germany, in conjunction with CONCUR 2011. The first edition of the\nworkshop (2008) took place in Turku, Finland, in conjunction with Formal\nMethods 2008 and the second edition (2009) took place in Eindhoven, the\nNetherlands, as well in conjunction with Formal Methods 2009. The goal of the\nCompMod workshop series is to bring together researchers in Computer Science\n(especially in Formal Methods) and Mathematics (both discrete and continuous),\ninterested in the opportunities and the challenges of Systems Biology.\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2011 02:18:56 GMT"}, {"version": "v2", "created": "Thu, 8 Sep 2011 07:57:48 GMT"}], "update_date": "2011-09-09", "authors_parsed": [["Petre", "Ion", "", "Åbo Akademi University"], ["de Vink", "Erik", "", "Eindhoven\n  University of Technology"]]}, {"id": "1109.1062", "submitter": "Victo Sudha george", "authors": "G. Victo Sudha George and V.Cyril Raj", "title": "Review on Feature Selection Techniques and the Impact of SVM for Cancer\n  Classification using Gene Expression Profile", "comments": "12 pages", "journal-ref": "International Journal of Computer Science & Engineering Survey\n  (IJCSES) Vol.2, No.3, International Journal of Computer Science & Engineering\n  Survey (IJCSES) Vol.2, No.3, August 2011", "doi": "10.5121/ijcses.2011.2302", "report-no": null, "categories": "cs.CE cs.ET cs.LG q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The DNA microarray technology has modernized the approach of biology research\nin such a way that scientists can now measure the expression levels of\nthousands of genes simultaneously in a single experiment. Gene expression\nprofiles, which represent the state of a cell at a molecular level, have great\npotential as a medical diagnosis tool. But compared to the number of genes\ninvolved, available training data sets generally have a fairly small sample\nsize for classification. These training data limitations constitute a challenge\nto certain classification methodologies. Feature selection techniques can be\nused to extract the marker genes which influence the classification accuracy\neffectively by eliminating the un wanted noisy and redundant genes This paper\npresents a review of feature selection techniques that have been employed in\nmicro array data based cancer classification and also the predominant role of\nSVM for cancer classification.\n", "versions": [{"version": "v1", "created": "Tue, 6 Sep 2011 04:42:55 GMT"}], "update_date": "2011-09-07", "authors_parsed": [["George", "G. Victo Sudha", ""], ["Raj", "V. Cyril", ""]]}, {"id": "1109.1355", "submitter": "Michael Mahoney", "authors": "Mihai Cucuringu and Michael W. Mahoney", "title": "Localization on low-order eigenvectors of data matrices", "comments": "21 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CE cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Eigenvector localization refers to the situation when most of the components\nof an eigenvector are zero or near-zero. This phenomenon has been observed on\neigenvectors associated with extremal eigenvalues, and in many of those cases\nit can be meaningfully interpreted in terms of \"structural heterogeneities\" in\nthe data. For example, the largest eigenvectors of adjacency matrices of large\ncomplex networks often have most of their mass localized on high-degree nodes;\nand the smallest eigenvectors of the Laplacians of such networks are often\nlocalized on small but meaningful community-like sets of nodes. Here, we\ndescribe localization associated with low-order eigenvectors, i.e.,\neigenvectors corresponding to eigenvalues that are not extremal but that are\n\"buried\" further down in the spectrum. Although we have observed it in several\nunrelated applications, this phenomenon of low-order eigenvector localization\ndefies common intuitions and simple explanations, and it creates serious\ndifficulties for the applicability of popular eigenvector-based machine\nlearning and data analysis tools. After describing two examples where low-order\neigenvector localization arises, we present a very simple model that\nqualitatively reproduces several of the empirically-observed results. This\nmodel suggests certain coarse structural similarities among the\nseemingly-unrelated applications where we have observed low-order eigenvector\nlocalization, and it may be used as a diagnostic tool to help extract insight\nfrom data graphs when such low-order eigenvector localization is present.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 05:10:58 GMT"}], "update_date": "2011-09-08", "authors_parsed": [["Cucuringu", "Mihai", ""], ["Mahoney", "Michael W.", ""]]}, {"id": "1109.1363", "submitter": "EPTCS", "authors": "Cristina Calcagno (Universit\\`a di Torino), Mario Coppo (Universit\\`a\n  di Torino), Ferruccio Damiani (Universit\\`a di Torino), Maurizio Drocco\n  (Universit\\`a di Torino), Eva Sciacca (Universit\\`a di Torino), Salvatore\n  Spinella (Universit\\`a di Torino), Angelo Troina (Universit\\`a di Torino)", "title": "Modelling Spatial Interactions in the Arbuscular Mycorrhizal Symbiosis\n  using the Calculus of Wrapped Compartments", "comments": "In Proceedings CompMod 2011, arXiv:1109.1044", "journal-ref": "EPTCS 67, 2011, pp. 3-18", "doi": "10.4204/EPTCS.67.3", "report-no": null, "categories": "cs.LO cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Arbuscular mycorrhiza (AM) is the most wide-spread plant-fungus symbiosis on\nearth. Investigating this kind of symbiosis is considered one of the most\npromising ways to develop methods to nurture plants in more natural manners,\navoiding the complex chemical productions used nowadays to produce artificial\nfertilizers. In previous work we used the Calculus of Wrapped Compartments\n(CWC) to investigate different phases of the AM symbiosis. In this paper, we\ncontinue this line of research by modelling the colonisation of the plant root\ncells by the fungal hyphae spreading in the soil. This study requires the\ndescription of some spatial interaction. Although CWC has no explicit feature\nmodelling a spatial geometry, the compartment labelling feature can be\neffectively exploited to define a discrete surface topology outlining the\nrelevant sectors which determine the spatial properties of the system under\nconsideration. Different situations and interesting spatial properties can be\nmodelled and analysed in such a lightweight framework (which has not an\nexplicit notion of geometry with coordinates and spatial metrics), thus\nexploiting the existing CWC simulation tool.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 06:27:06 GMT"}], "update_date": "2011-09-08", "authors_parsed": [["Calcagno", "Cristina", "", "Università di Torino"], ["Coppo", "Mario", "", "Università\n  di Torino"], ["Damiani", "Ferruccio", "", "Università di Torino"], ["Drocco", "Maurizio", "", "Università di Torino"], ["Sciacca", "Eva", "", "Università di Torino"], ["Spinella", "Salvatore", "", "Università di Torino"], ["Troina", "Angelo", "", "Università di Torino"]]}, {"id": "1109.1364", "submitter": "EPTCS", "authors": "Luca Bortolussi (Dept. of Mathematics and Informatics, University of\n  Trieste, Italy.), Alberto Policriti (Dept. of Mathematics and Informatics,\n  University of Udine, Italy. Institute of Applied Genomics, Udine, Italy.)", "title": "Programmable models of growth and mutation of cancer-cell populations", "comments": "In Proceedings CompMod 2011, arXiv:1109.1044", "journal-ref": "EPTCS 67, 2011, pp. 19-33", "doi": "10.4204/EPTCS.67.4", "report-no": null, "categories": "cs.CE q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose a systematic approach to construct mathematical\nmodels describing populations of cancer-cells at different stages of disease\ndevelopment. The methodology we propose is based on stochastic Concurrent\nConstraint Programming, a flexible stochastic modelling language. The\nmethodology is tested on (and partially motivated by) the study of prostate\ncancer. In particular, we prove how our method is suitable to systematically\nreconstruct different mathematical models of prostate cancer growth - together\nwith interactions with different kinds of hormone therapy - at different levels\nof refinement.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 06:27:16 GMT"}], "update_date": "2011-09-08", "authors_parsed": [["Bortolussi", "Luca", "", "Dept. of Mathematics and Informatics, University of\n  Trieste, Italy."], ["Policriti", "Alberto", "", "Dept. of Mathematics and Informatics,\n  University of Udine, Italy. Institute of Applied Genomics, Udine, Italy."]]}, {"id": "1109.1365", "submitter": "EPTCS", "authors": "Vashti Galpin, Jane Hillston, Federica Ciocchetta", "title": "A semi-quantitative equivalence for abstracting from fast reactions", "comments": "In Proceedings CompMod 2011, arXiv:1109.1044", "journal-ref": "EPTCS 67, 2011, pp. 34-49", "doi": "10.4204/EPTCS.67.5", "report-no": null, "categories": "cs.CE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Semantic equivalences are used in process algebra to capture the notion of\nsimilar behaviour, and this paper proposes a semi-quantitative equivalence for\na stochastic process algebra developed for biological modelling. We consider\nabstracting away from fast reactions as suggested by the Quasi-Steady-State\nAssumption. We define a fast-slow bisimilarity based on this idea. We also show\ncongruence under an appropriate condition for the cooperation operator of\nBio-PEPA. The condition requires that there is no synchronisation over fast\nactions, and this distinguishes fast-slow bisimilarity from weak bisimilarity.\nWe also show congruence for an operator which extends the reactions available\nfor a species. We characterise models for which it is only necessary to\nconsider the matching of slow transitions and we illustrate the equivalence on\ntwo models of competitive inhibition.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 06:27:23 GMT"}], "update_date": "2011-09-08", "authors_parsed": [["Galpin", "Vashti", ""], ["Hillston", "Jane", ""], ["Ciocchetta", "Federica", ""]]}, {"id": "1109.1366", "submitter": "EPTCS", "authors": "Livio Bioglio", "title": "A Minimal OO Calculus for Modelling Biological Systems", "comments": "In Proceedings CompMod 2011, arXiv:1109.1044", "journal-ref": "EPTCS 67, 2011, pp. 50-64", "doi": "10.4204/EPTCS.67.6", "report-no": null, "categories": "cs.CE cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present a minimal object oriented core calculus for\nmodelling the biological notion of type that arises from biological ontologies\nin formalisms based on term rewriting. This calculus implements encapsulation,\nmethod invocation, subtyping and a simple formof overriding inheritance, and it\nis applicable to models designed in the most popular term-rewriting formalisms.\nThe classes implemented in a formalism can be used in several models, like\nprogramming libraries.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 06:27:29 GMT"}], "update_date": "2011-09-08", "authors_parsed": [["Bioglio", "Livio", ""]]}, {"id": "1109.1367", "submitter": "EPTCS", "authors": "Qixia Yuan (University of Luxembourg), Jun Pang (University of\n  Luxembourg), Sjouke Mauw (University of Luxembourg), Panuwat Trairatphisan\n  (University of Luxembourg), Monique Wiesinger (University of Luxembourg),\n  Thomas Sauter (University of Luxembourg)", "title": "A Study of the PDGF Signaling Pathway with PRISM", "comments": "In Proceedings CompMod 2011, arXiv:1109.1044", "journal-ref": "EPTCS 67, 2011, pp. 65-81", "doi": "10.4204/EPTCS.67.7", "report-no": null, "categories": "cs.CE cs.LO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we apply the probabilistic model checker PRISM to the analysis\nof a biological system -- the Platelet-Derived Growth Factor (PDGF) signaling\npathway, demonstrating in detail how this pathway can be analyzed in PRISM. We\nshow that quantitative verification can yield a better understanding of the\nPDGF signaling pathway.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 06:27:36 GMT"}], "update_date": "2011-09-08", "authors_parsed": [["Yuan", "Qixia", "", "University of Luxembourg"], ["Pang", "Jun", "", "University of\n  Luxembourg"], ["Mauw", "Sjouke", "", "University of Luxembourg"], ["Trairatphisan", "Panuwat", "", "University of Luxembourg"], ["Wiesinger", "Monique", "", "University of Luxembourg"], ["Sauter", "Thomas", "", "University of Luxembourg"]]}, {"id": "1109.1368", "submitter": "EPTCS", "authors": "Pietro Li\\`o (Computer Laboratory. University of Cambridge. United\n  Kingdom), Emanuela Merelli (School of Science and Technology. University of\n  Camerino. Italy), Nicola Paoletti (School of Science and Technology.\n  University of Camerino. Italy)", "title": "Multiple verification in computational modeling of bone pathologies", "comments": "In Proceedings CompMod 2011, arXiv:1109.1044", "journal-ref": "EPTCS 67, 2011, pp. 82-96", "doi": "10.4204/EPTCS.67.8", "report-no": null, "categories": "cs.LO cs.CE cs.SY math.OC q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a model checking approach to diagnose the emerging of bone\npathologies. The implementation of a new model of bone remodeling in PRISM has\nled to an interesting characterization of osteoporosis as a defective bone\nremodeling dynamics with respect to other bone pathologies. Our approach allows\nto derive three types of model checking-based diagnostic estimators. The first\ndiagnostic measure focuses on the level of bone mineral density, which is\ncurrently used in medical practice. In addition, we have introduced a novel\ndiagnostic estimator which uses the full patient clinical record, here\nsimulated using the modeling framework. This estimator detects rapid (months)\nnegative changes in bone mineral density. Independently of the actual bone\nmineral density, when the decrease occurs rapidly it is important to alarm the\npatient and monitor him/her more closely to detect insurgence of other bone\nco-morbidities. A third estimator takes into account the variance of the bone\ndensity, which could address the investigation of metabolic syndromes, diabetes\nand cancer. Our implementation could make use of different logical combinations\nof these statistical estimators and could incorporate other biomarkers for\nother systemic co-morbidities (for example diabetes and thalassemia). We are\ndelighted to report that the combination of stochastic modeling with formal\nmethods motivate new diagnostic framework for complex pathologies. In\nparticular our approach takes into consideration important properties of\nbiosystems such as multiscale and self-adaptiveness. The multi-diagnosis could\nbe further expanded, inching towards the complexity of human diseases. Finally,\nwe briefly introduce self-adaptiveness in formal methods which is a key\nproperty in the regulative mechanisms of biological systems and well known in\nother mathematical and engineering areas.\n", "versions": [{"version": "v1", "created": "Wed, 7 Sep 2011 06:27:45 GMT"}], "update_date": "2011-11-10", "authors_parsed": [["Liò", "Pietro", "", "Computer Laboratory. University of Cambridge. United\n  Kingdom"], ["Merelli", "Emanuela", "", "School of Science and Technology. University of\n  Camerino. Italy"], ["Paoletti", "Nicola", "", "School of Science and Technology.\n  University of Camerino. Italy"]]}, {"id": "1109.1649", "submitter": "EPTCS", "authors": "L. Brim (Masaryk University), J. Fabrikov\\'a (Masaryk University), S.\n  Dra\\v{z}an (Masaryk University), D. \\v{S}afr\\'anek (Masaryk University)", "title": "Reachability in Biochemical Dynamical Systems by Quantitative Discrete\n  Approximation (extended abstract)", "comments": "In Proceedings CompMod 2011, arXiv:1109.1044", "journal-ref": "EPTCS 67, 2011, pp. 97-112", "doi": "10.4204/EPTCS.67.9", "report-no": null, "categories": "cs.SY cs.CE math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel computational technique for finite discrete\napproximation of continuous dynamical systems suitable for a significant class\nof biochemical dynamical systems is introduced. The method is parameterized in\norder to affect the imposed level of approximation provided that with\nincreasing parameter value the approximation converges to the original\ncontinuous system. By employing this approximation technique, we present\nalgorithms solving the reachability problem for biochemical dynamical systems.\nThe presented method and algorithms are evaluated on several exemplary\nbiological models and on a real case study.\n", "versions": [{"version": "v1", "created": "Thu, 8 Sep 2011 08:00:06 GMT"}], "update_date": "2011-09-09", "authors_parsed": [["Brim", "L.", "", "Masaryk University"], ["Fabriková", "J.", "", "Masaryk University"], ["Dražan", "S.", "", "Masaryk University"], ["Šafránek", "D.", "", "Masaryk University"]]}, {"id": "1109.3069", "submitter": "Daniel Bartz", "authors": "Daniel Bartz, Kerr Hatrick, Christian W. Hesse, Klaus-Robert M\\\"uller,\n  Steven Lemm", "title": "Directional Variance Adjustment: improving covariance estimates for\n  high-dimensional portfolio optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.CE q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Robust and reliable covariance estimates play a decisive role in financial\nand many other applications. An important class of estimators is based on\nFactor models. Here, we show by extensive Monte Carlo simulations that\ncovariance matrices derived from the statistical Factor Analysis model exhibit\na systematic error, which is similar to the well-known systematic error of the\nspectrum of the sample covariance matrix. Moreover, we introduce the\nDirectional Variance Adjustment (DVA) algorithm, which diminishes the\nsystematic error. In a thorough empirical study for the US, European, and Hong\nKong market we show that our proposed method leads to improved portfolio\nallocation.\n", "versions": [{"version": "v1", "created": "Wed, 14 Sep 2011 13:13:51 GMT"}, {"version": "v2", "created": "Thu, 15 Sep 2011 11:55:11 GMT"}, {"version": "v3", "created": "Thu, 8 Mar 2012 11:01:49 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Bartz", "Daniel", ""], ["Hatrick", "Kerr", ""], ["Hesse", "Christian W.", ""], ["Müller", "Klaus-Robert", ""], ["Lemm", "Steven", ""]]}, {"id": "1109.3119", "submitter": "Peter van Gemmeren", "authors": "Peter van Gemmeren, David Malon", "title": "Persistent Data Layout and Infrastructure for Efficient Selective\n  Retrieval of Event Data in ATLAS", "comments": "Proceedings of the DPF-2011 Conference, Providence, RI, August 8-13,\n  2011 8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.data-an cs.CE cs.DB hep-ex", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  The ATLAS detector at CERN has completed its first full year of recording\ncollisions at 7 TeV, resulting in billions of events and petabytes of data. At\nthese scales, physicists must have the capability to read only the data of\ninterest to their analyses, with the importance of efficient selective access\nincreasing as data taking continues. ATLAS has developed a sophisticated\nevent-level metadata infrastructure and supporting I/O framework allowing event\nselections by explicit specification, by back navigation, and by selection\nqueries to a TAG database via an integrated web interface. These systems and\ntheir performance have been reported on elsewhere. The ultimate success of such\na system, however, depends significantly upon the efficiency of selective event\nretrieval. Supporting such retrieval can be challenging, as ATLAS stores its\nevent data in column-wise orientation using ROOT trees for a number of reasons,\nincluding compression considerations, histogramming use cases, and more. For\n2011 data, ATLAS will utilize new capabilities in ROOT to tune the persistent\nstorage layout of event data, and to significantly speed up selective event\nreading. The new persistent layout strategy and its implications for I/O\nperformance are described in this paper.\n", "versions": [{"version": "v1", "created": "Wed, 14 Sep 2011 16:04:31 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["van Gemmeren", "Peter", ""], ["Malon", "David", ""]]}, {"id": "1109.3488", "submitter": "Andrew Clark", "authors": "Andrew Clark and Jeff Kenyon", "title": "Using MOEAs To Outperform Stock Benchmarks In The Presence of Typical\n  Investment Constraints", "comments": "21 pages, Index Terms - multi-objective evolutionary algorithms\n  (MOEA), mean-variance optimization, financial constraints, multi-period MOEAs\n  Updated version of paper. Will appear in Journal of Investing in 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM cs.CE cs.NE stat.AP stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Portfolio managers are typically constrained by turnover limits, minimum and\nmaximum stock positions, cardinality, a target market capitalization and\nsometimes the need to hew to a style (such as growth or value). In addition,\nportfolio managers often use multifactor stock models to choose stocks based\nupon their respective fundamental data.\n  We use multiobjective evolutionary algorithms (MOEAs) to satisfy the above\nreal-world constraints. The portfolios generated consistently outperform\ntypical performance benchmarks and have statistically significant asset\nselection.\n", "versions": [{"version": "v1", "created": "Thu, 15 Sep 2011 21:15:22 GMT"}, {"version": "v2", "created": "Mon, 2 Jan 2012 21:33:25 GMT"}], "update_date": "2012-01-04", "authors_parsed": [["Clark", "Andrew", ""], ["Kenyon", "Jeff", ""]]}, {"id": "1109.3524", "submitter": "L. A. Barba", "authors": "Simon K Layton and Anush Krishnan and Lorena A. Barba", "title": "cuIBM -- A GPU-accelerated Immersed Boundary Method", "comments": "Extended paper post-conference, presented at the 23rd International\n  Conference on Parallel Computational Fluid Dynamics (http://www.parcfd.org),\n  ParCFD 2011, Barcelona (unpublished)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A projection-based immersed boundary method is dominated by sparse linear\nalgebra routines. Using the open-source Cusp library, we observe a speedup\n(with respect to a single CPU core) which reflects the constraints of a\nbandwidth-dominated problem on the GPU. Nevertheless, GPUs offer the capacity\nto solve large problems on commodity hardware. This work includes validation\nand a convergence study of the GPU-accelerated IBM, and various optimizations.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2011 04:02:15 GMT"}, {"version": "v2", "created": "Sat, 9 Apr 2016 00:39:08 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Layton", "Simon K", ""], ["Krishnan", "Anush", ""], ["Barba", "Lorena A.", ""]]}, {"id": "1109.3563", "submitter": "Victor Zhukov", "authors": "Victor P. Zhukov", "title": "Verification, Validation and Testing of Kinetic Mechanisms of Hydrogen\n  Combustion in Fluid Dynamic Computations", "comments": "The alternate reference of this paper: V.P. Zhukov, \"Verification,\n  Validation and Testing of Kinetic Models of Hydrogen Combustion in Fluid\n  Dynamic Computations\", Paper ID35 at 4th European Conference for Aerospace\n  Sciences, Saint Petersburg, Russia, 4--8 July, 2011", "journal-ref": "ISRN Mechanical Engineering, vol. 2012, Article ID 475607, 11\n  pages, 2012", "doi": "10.5402/2012/475607", "report-no": null, "categories": "cs.CE physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A one-step, a two-step, an abridged, a skeletal and four detailed kinetic\nschemes of hydrogen oxidation have been tested. A new skeletal kinetic scheme\nof hydrogen oxidation has been developed. The CFD calculations were carried out\nusing ANSYS CFX software. Ignition delay times and speeds of flames were\nderived from the computational results. The computational data obtained using\nANSYS CFX and CHEMKIN, and experimental data were compared. The precision,\nreliability, and range of validity of the kinetic schemes in CFD simulations\nwere estimated. The impact of kinetic scheme on the results of computations was\ndiscussed. The relationship between grid spacing, timestep, accuracy, and\ncomputational cost were analyzed.\n", "versions": [{"version": "v1", "created": "Fri, 16 Sep 2011 09:42:03 GMT"}, {"version": "v2", "created": "Thu, 1 Aug 2013 14:46:30 GMT"}], "update_date": "2013-08-02", "authors_parsed": [["Zhukov", "Victor P.", ""]]}, {"id": "1109.4928", "submitter": "Leo Lahti", "authors": "Leo Lahti, Laura L. Elo, Tero Aittokallio, Samuel Kaski", "title": "RPA: Probabilistic analysis of probe performance and robust\n  summarization", "comments": "Replaced by extended work which forms an independent publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE stat.AP stat.ML", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Probe-level models have led to improved performance in microarray studies but\nthe various sources of probe-level contamination are still poorly understood.\nData-driven analysis of probe performance can be used to quantify the\nuncertainty in individual probes and to highlight the relative contribution of\ndifferent noise sources. Improved understanding of the probe-level effects can\nlead to improved preprocessing techniques and microarray design.\n  We have implemented probabilistic tools for probe performance analysis and\nsummarization on short oligonucleotide arrays. In contrast to standard\npreprocessing approaches, the methods provide quantitative estimates of\nprobe-specific noise and affinity terms and tools to investigate these\nparameters. Tools to incorporate prior information of the probes in the\nanalysis are provided as well. Comparisons to known probe-level error sources\nand spike-in data sets validate the approach.\n  Implementation is freely available in R/BioConductor:\nhttp://www.bioconductor.org/packages/release/bioc/html/RPA.html\n", "versions": [{"version": "v1", "created": "Thu, 22 Sep 2011 19:46:02 GMT"}, {"version": "v2", "created": "Sat, 6 Apr 2013 09:39:10 GMT"}], "update_date": "2013-04-09", "authors_parsed": [["Lahti", "Leo", ""], ["Elo", "Laura L.", ""], ["Aittokallio", "Tero", ""], ["Kaski", "Samuel", ""]]}, {"id": "1109.5002", "submitter": "Constantinos Daskalakis", "authors": "Constantinos Daskalakis, Sebastien Roch", "title": "Alignment-free phylogenetic reconstruction: Sample complexity via a\n  branching process analysis", "comments": "Published in at http://dx.doi.org/10.1214/12-AAP852 the Annals of\n  Applied Probability (http://www.imstat.org/aap/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Probability 2013, Vol. 23, No. 2, 693-721", "doi": "10.1214/12-AAP852", "report-no": "IMS-AAP-AAP852", "categories": "math.PR cs.CE cs.DS math.ST q-bio.PE stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an efficient phylogenetic reconstruction algorithm allowing\ninsertions and deletions which provably achieves a sequence-length requirement\n(or sample complexity) growing polynomially in the number of taxa. Our\nalgorithm is distance-based, that is, it relies on pairwise sequence\ncomparisons. More importantly, our approach largely bypasses the difficult\nproblem of multiple sequence alignment.\n", "versions": [{"version": "v1", "created": "Fri, 23 Sep 2011 05:38:55 GMT"}, {"version": "v2", "created": "Fri, 22 Feb 2013 12:10:49 GMT"}], "update_date": "2013-02-25", "authors_parsed": [["Daskalakis", "Constantinos", ""], ["Roch", "Sebastien", ""]]}, {"id": "1109.5329", "submitter": "Giovanni Lapenta", "authors": "Giovanni Lapenta", "title": "Space Weather Prediction with Exascale Computing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.SR cs.CE physics.plasm-ph physics.space-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Space weather refers to conditions on the Sun, in the interplanetary space\nand in the Earth space environment that can influence the performance and\nreliability of space-borne and ground-based technological systems and can\nendanger human life or health. Adverse conditions in the space environment can\ncause disruption of satellite operations, communications, navigation, and\nelectric power distribution grids, leading to a variety of socioeconomic\nlosses. The conditions in space are also linked to the Earth climate. The\nactivity of the Sun affects the total amount of heat and light reaching the\nEarth and the amount of cosmic rays arriving in the atmosphere, a phenomenon\nlinked with the amount of cloud cover and precipitation. Given these great\nimpacts on society, space weather is attracting a growing attention and is the\nsubject of international efforts worldwide. We focus here on the steps\nnecessary for achieving a true physics-based ability to predict the arrival and\nconsequences of major space weather storms. Great disturbances in the space\nenvironment are common but their precise arrival and impact on human activities\nvaries greatly. Simulating such a system is a grand- challenge, requiring\ncomputing resources at the limit of what is possible not only with current\ntechnology but also with the foreseeable future generations of super computers\n", "versions": [{"version": "v1", "created": "Sun, 25 Sep 2011 07:03:59 GMT"}, {"version": "v2", "created": "Sat, 1 Oct 2011 10:14:14 GMT"}], "update_date": "2011-10-04", "authors_parsed": [["Lapenta", "Giovanni", ""]]}, {"id": "1109.5488", "submitter": "Edlira Nano", "authors": "Beno\\^it Valot, Olivier Langella, Edlira Nano, Michel Zivy", "title": "MassChroQ: A versatile tool for mass spectrometry quantification", "comments": "23 pages, 8 figures", "journal-ref": "Proteomics, volume 11, issue 17, pages 3572-3577, September 2011", "doi": "10.1002/pmic.201100120", "report-no": null, "categories": "q-bio.QM cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, many software tools have been developed to perform quantification\nin LC-MS analyses. However, most of them are specific to either a\nquantification strategy (e.g. label-free or isotopic labelling) or a\nmass-spectrometry system (e.g. high or low resolution).\n  In this context, we have developed MassChroQ, a versatile software that\nperforms LC-MS data alignment and peptide quantification by peak area\nintegration on extracted ion chromatograms. MassChroQ is suitable for\nquantification with or without labelling and is not limited to high resolution\nsystems. Peptides of interest (for example all the identified peptides) can be\ndetermined automatically or manually by providing targeted m/z and retention\ntime values. It can handle large experiments that include protein or peptide\nfractionation (as SDS-PAGE, 2D-LC). It is fully configurable. Every processing\nstep is traceable, the produced data are in open standard format and its\nmodularity allows easy integration into proteomic pipelines. The output results\nare ready for use in statistical analyses.\n  Evaluation of MassChroQ on complex label-free data obtained from low and high\nresolution mass spectrometers showed low CVs for technical reproducibility\n(1.4%) and high coefficients of correlation to protein quantity (0.98).\n  MassChroQ is freely available under the GNU General Public Licence v3.0 at\nhttp://pappso.inra.fr/bioinfo/masschroq/.\n", "versions": [{"version": "v1", "created": "Mon, 26 Sep 2011 08:52:55 GMT"}], "update_date": "2011-09-27", "authors_parsed": [["Valot", "Benoît", ""], ["Langella", "Olivier", ""], ["Nano", "Edlira", ""], ["Zivy", "Michel", ""]]}, {"id": "1109.5796", "submitter": "Xuan Vinh Nguyen", "authors": "Nguyen Xuan Vinh", "title": "Genetic Testing for Complex Diseases: a Simulation Study Perspective", "comments": "5 pages technical report", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.CE q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is widely recognized nowadays that complex diseases are caused by, amongst\nthe others, multiple genetic factors. The recent advent of genome-wide\nassociation study (GWA) has triggered a wave of research aimed at discovering\ngenetic factors underlying common complex diseases. While the number of\nreported susceptible genetic variants is increasing steadily, the application\nof such findings into diseases prognosis for the general population is still\nunclear, and there are doubts about whether the size of the contribution by\nsuch factors is significant. In this respect, some recent simulation-based\nstudies have shed more light to the prospect of genetic tests. In this report,\nwe discuss several aspects of simulation-based studies: their parameters, their\nassumptions, and the information they provide.\n", "versions": [{"version": "v1", "created": "Tue, 27 Sep 2011 07:36:07 GMT"}, {"version": "v2", "created": "Thu, 29 Sep 2011 12:24:56 GMT"}], "update_date": "2011-09-30", "authors_parsed": [["Vinh", "Nguyen Xuan", ""]]}]