[{"id": "1911.01179", "submitter": "Zhepu Xu", "authors": "Zhepu Xu and Qun Yang", "title": "Fast Safety Assessment and Correction Framework for Maintenance Work\n  Zones", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A framework is proposed to assess the safety of maintenance work zones in a\ntimely manner, show whether there are safety hazards, whether adjustments need\nto be made and how to adjust it. By means of advanced data acquisition\ntechnologies such as multi video detection and portable device based\nnaturalistic driving, the microscopic vehicle behaviour data can be collected.\nBased on this data, a method for expressing and displaying the distribution of\nunsafe vehicle behaviour is used to show whether safety hazards exist. Using\nVissim, the impacts of the length and speed limit of the warning area, the\nlength and type of the upstream transition area and the length of the work area\nof the maintenance work zone on the distribution of unsafe vehicle behaviour\nare simulated to establish the safety correction matrix, which can tell\nmaintenance departments the direction of adjustment when safety hazards exist\nin maintenance work zones.\n", "versions": [{"version": "v1", "created": "Fri, 1 Nov 2019 03:05:52 GMT"}], "update_date": "2019-11-05", "authors_parsed": [["Xu", "Zhepu", ""], ["Yang", "Qun", ""]]}, {"id": "1911.02912", "submitter": "Lena Pons", "authors": "Lena Pons and Ipek Ozkaya", "title": "Priority Quality Attributes for Engineering AI-enabled Systems", "comments": "Presented at AAAI FSS-19: Artificial Intelligence in Government and\n  Public Sector, Arlington, Virginia, USA", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Deploying successful software-reliant systems that address their mission\ngoals and user needs within cost, resource, and expected quality constraints\nrequire design trade-offs. These trade-offs dictate how systems are structured\nand how they behave and consequently can effectively be evolved and sustained.\nSoftware engineering practices address this challenge by centering system\ndesign and evolution around delivering key quality attributes, such as\nsecurity, privacy, data centricity, sustainability, and explainability. These\nconcerns are more urgent requirements for software-reliant systems that also\ninclude AI components due to the uncertainty introduced by data elements.\nMoreover, systems employed by the public sector exhibit unique design time and\nruntime challenges due to the regulatory nature of the domains. We assert that\nthe quality attributes of security, privacy, data centricity, sustainability,\nand explainability pose new challenges to AI engineering and will drive the\nsuccess of AI-enabled systems in the public sector. In this position paper, we\nenumerate with examples from healthcare domain concerns related to these\nrequirements to mitigate barriers to architecting and fielding AI-enabled\nsystems in the public sector.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2019 14:33:12 GMT"}], "update_date": "2019-11-11", "authors_parsed": [["Pons", "Lena", ""], ["Ozkaya", "Ipek", ""]]}, {"id": "1911.07582", "submitter": "Farbod Taymouri", "authors": "Farbod Taymouri, Marcello La Rosa, Marlon Dumas, Fabrizio Maria Maggi", "title": "Business Process Variant Analysis: Survey and Classification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Process variant analysis aims at identifying and addressing the differences\nexisting in a set of process executions enacted by the same process model. A\nprocess model can be executed differently in different situations for various\nreasons, e.g., the process could run in different locations or seasons, which\ngives rise to different behaviors. Having intuitions about the discrepancies in\nprocess behaviors, though challenging, is beneficial for managers and process\nanalysts since they can improve their process models efficiently, e.g., via\ninteractive learning or adapting mechanisms. Several methods have been proposed\nto tackle the problem of uncovering discrepancies in process executions.\nHowever, because of the interdisciplinary nature of the challenge, the methods\nand sorts of analysis in the literature are very heterogeneous. This article\nnot only presents a systematic literature review and taxonomy of methods for\nvariant analysis of business processes but also provides a methodology\nincluding the required steps to apply this type of analysis for the\nidentification of variants in business process executions.\n", "versions": [{"version": "v1", "created": "Mon, 18 Nov 2019 12:21:54 GMT"}, {"version": "v2", "created": "Mon, 23 Dec 2019 02:16:53 GMT"}], "update_date": "2019-12-24", "authors_parsed": [["Taymouri", "Farbod", ""], ["La Rosa", "Marcello", ""], ["Dumas", "Marlon", ""], ["Maggi", "Fabrizio Maria", ""]]}, {"id": "1911.07630", "submitter": "Sandeep Madireddy", "authors": "Peihong Jiang, Hieu Doan, Sandeep Madireddy, Rajeev Surendran Assary,\n  Prasanna Balaprakash", "title": "Value-Added Chemical Discovery Using Reinforcement Learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computer-assisted synthesis planning aims to help chemists find better\nreaction pathways faster. Finding viable and short pathways from sugar\nmolecules to value-added chemicals can be modeled as a retrosynthesis planning\nproblem with a catalyst allowed. This is a crucial step in efficient biomass\nconversion. The traditional computational chemistry approach to identifying\npossible reaction pathways involves computing the reaction energies of hundreds\nof intermediates, which is a critical bottleneck in silico reaction discovery.\nDeep reinforcement learning has shown in other domains that a well-trained\nagent with little or no prior human knowledge can surpass human performance.\nWhile some effort has been made to adapt machine learning techniques to the\nretrosynthesis planning problem, value-added chemical discovery presents unique\nchallenges. Specifically, the reaction can occur in several different sites in\na molecule, a subtle case that has never been treated in previous works. With a\nmore versatile formulation of the problem as a Markov decision process, we\naddress the problem using deep reinforcement learning techniques and present\npromising preliminary results.\n", "versions": [{"version": "v1", "created": "Sun, 10 Nov 2019 07:36:37 GMT"}], "update_date": "2019-11-19", "authors_parsed": [["Jiang", "Peihong", ""], ["Doan", "Hieu", ""], ["Madireddy", "Sandeep", ""], ["Assary", "Rajeev Surendran", ""], ["Balaprakash", "Prasanna", ""]]}, {"id": "1911.08612", "submitter": "Casey Cole", "authors": "Casey A Cole, Caleb Parks, Julian Rachele, Homayoun Valafar", "title": "Improvements of the REDCRAFT Software Package", "comments": "7 pages, 5 figures, Int'l Conf. Bioinformatics and Computational\n  Biology (BIOCOMP'19), Las Vegas, NV, August 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional approaches to elucidation of protein structures by NMR\nspectroscopy rely on distance restraints also known as nuclear Overhauser\neffects (NOEs). The use of NOEs as the primary source of structure\ndetermination by NMR spectroscopy is time consuming and expensive. Residual\nDipolar Couplings (RDCs) have become an alternate approach for structure\ncalculation by NMR spectroscopy. In previous works, the software package\nREDCRAFT has been presented as a means of harnessing the information containing\nin RDCs for structure calculation of proteins. In this work, we present\nsignificant improvements to the REDCRAFT package including: refinement of the\ndecimation procedure, the inclusion of graphical user interface, adoption of\nNEF standards, and addition of scripts for enhanced protein modeling options.\nThe improvements to REDCRAFT have resulted in the ability to fold proteins that\nthe previous versions were unable to fold. For instance, we report the results\nof folding of the protein 1A1Z in the presence of highly erroneous data.\n", "versions": [{"version": "v1", "created": "Tue, 19 Nov 2019 22:18:24 GMT"}], "update_date": "2019-11-21", "authors_parsed": [["Cole", "Casey A", ""], ["Parks", "Caleb", ""], ["Rachele", "Julian", ""], ["Valafar", "Homayoun", ""]]}, {"id": "1911.12338", "submitter": "Mehrdad Niknami", "authors": "Mehrdad Niknami", "title": "Inflationary Constant Factors and Why Python is Faster Than C++", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Constant-factor differences are frequently ignored when analyzing the\ncomplexity of algorithms and implementations, as they appear to be\ninsignificant in practice. In this paper, we demonstrate that this assumption\ncan in fact have far more profound implications on time complexity than is\nobvious at first glance, and that a poor consideration of trade-offs can result\nin polynomially slower algorithms whose roots can be deeply and fundamentally\ningrained into a programming language itself. While the general observation may\nnot be novel from a theoretical standpoint, it is rarely (if ever) presented in\ntraditional computer science curricula or other settings, and appears to be far\nfrom common knowledge in practical software engineering. We thus hope bring\nawareness to this issue and urge careful consideration of significant\ntrade-offs that can result from trivial decisions made while programming.\n", "versions": [{"version": "v1", "created": "Sat, 23 Nov 2019 20:29:49 GMT"}, {"version": "v2", "created": "Thu, 8 Oct 2020 10:59:31 GMT"}], "update_date": "2020-10-09", "authors_parsed": [["Niknami", "Mehrdad", ""]]}]