[{"id": "1301.2649", "submitter": "Amirreza Zarrabi", "authors": "Amirreza Zarrabi", "title": "Dynamic Transparent General Purpose Process Migration For Linux", "comments": null, "journal-ref": "International Journal of Grid Computing & Applications (IJGCA)\n  Vol.3, No.4, December 2012", "doi": "10.5121/ijgca.2012.3402", "report-no": null, "categories": "cs.DC cs.OS cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Process migration refers to the act of transferring a process in the middle\nof its execution from one machine to another in a network. In this paper, we\nproposed a process migration framework for Linux OS. It is a multilayer\narchitecture to confine every functionality independent section of the system\nin separate layer. This architecture is capable of supporting diverse\napplications due to generic user space interface and dynamic structure that can\nbe modified according to demands.\n", "versions": [{"version": "v1", "created": "Sat, 12 Jan 2013 05:31:57 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Zarrabi", "Amirreza", ""]]}, {"id": "1301.4800", "submitter": "Omar Kermia", "authors": "Omar Kermia", "title": "Schedulability Analysis of Distributed Real-Time Applications under\n  Dependence and Several Latency Constraints", "comments": "8 pages, 6 figures, Published with International Journal of Computer\n  Applications (IJCA)", "journal-ref": "International Journal of Computer Applications 62(14):1-7, January\n  2013. Published by Foundation of Computer Science, New York, USA", "doi": "10.5120/10145-4978", "report-no": null, "categories": "cs.OS cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper focuses on the analysis of real-time non preemptive multiprocessor\nscheduling with precedence and several latency constraints. It aims to specify\na schedulability condition which enables a designer to check a priori -without\nexecuting or simulating- if its scheduling of tasks will hold the precedences\nbetween tasks as well as several latency constraints imposed on determined\npairs of tasks. It is shown that the required analysis is closely linked to the\ntopological structure of the application graph. More precisely, it depends on\nthe configuration of tasks paths subject to latency constraints. As a result of\nthe study, a sufficient schedulability condition is introduced for precedences\nand latency constraints in the hardest configuration in term of complexity with\nan optimal number of processors in term of applications parallelism. In\naddition, the proposed conditions provides a practical lower bounds for general\ncases. Performances results and comparisons with an optimal approach\ndemonstrate the effectiveness of the proposed approach.\n", "versions": [{"version": "v1", "created": "Mon, 21 Jan 2013 10:00:22 GMT"}], "update_date": "2013-01-22", "authors_parsed": [["Kermia", "Omar", ""]]}]