[{"id": "1009.0045", "submitter": "David Eppstein", "authors": "David Eppstein, Maarten L\\\"offler, Elena Mumford, Martin N\\\"ollenburg", "title": "Optimal 3D Angular Resolution for Low-Degree Graphs", "comments": "18 pages, 10 figures. Extended version of paper to appear in Proc.\n  18th Int. Symp. Graph Drawing, Konstanz, Germany, 2010", "journal-ref": "J. Graph Algorithms & Applications 17(3): 173-200, 2013", "doi": "10.7155/jgaa.00290", "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that every graph of maximum degree three can be drawn in three\ndimensions with at most two bends per edge, and with 120-degree angles between\nany two edge segments meeting at a vertex or a bend. We show that every graph\nof maximum degree four can be drawn in three dimensions with at most three\nbends per edge, and with 109.5-degree angles, i.e., the angular resolution of\nthe diamond lattice, between any two edge segments meeting at a vertex or bend.\n", "versions": [{"version": "v1", "created": "Tue, 31 Aug 2010 22:50:32 GMT"}], "update_date": "2015-07-16", "authors_parsed": [["Eppstein", "David", ""], ["Löffler", "Maarten", ""], ["Mumford", "Elena", ""], ["Nöllenburg", "Martin", ""]]}, {"id": "1009.0088", "submitter": "David Eppstein", "authors": "Erin W. Chambers, David Eppstein, Michael T. Goodrich, Maarten\n  L\\\"offler", "title": "Drawing Graphs in the Plane with a Prescribed Outer Face and Polynomial\n  Area", "comments": "13 pages, 5 figures. This is an extended version of a paper to appear\n  in Proc. 18th Int. Symp. Graph Drawing, 2010", "journal-ref": "J. Graph Algorithms and Applications 16(2):243-259, 2012", "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the classic graph drawing problem of drawing a planar graph using\nstraight-line edges with a prescribed convex polygon as the outer face. Unlike\nprevious algorithms for this problem, which may produce drawings with\nexponential area, our method produces drawings with polynomial area. In\naddition, we allow for collinear points on the boundary, provided such vertices\ndo not create overlapping edges. Thus, we solve an open problem of Duncan et\nal., which, when combined with their work, implies that we can produce a planar\nstraight-line drawing of a combinatorially-embedded genus-g graph with the\ngraph's canonical polygonal schema drawn as a convex polygonal external face.\n", "versions": [{"version": "v1", "created": "Wed, 1 Sep 2010 04:43:43 GMT"}], "update_date": "2012-03-01", "authors_parsed": [["Chambers", "Erin W.", ""], ["Eppstein", "David", ""], ["Goodrich", "Michael T.", ""], ["Löffler", "Maarten", ""]]}, {"id": "1009.0579", "submitter": "Christian Duncan", "authors": "Christian A. Duncan and David Eppstein and Michael T. Goodrich and\n  Stephen G. Kobourov and Martin N\\\"ollenburg", "title": "Lombardi Drawings of Graphs", "comments": "Expanded version of paper appearing in the 18th International\n  Symposium on Graph Drawing (GD 2010). 13 pages, 7 figures", "journal-ref": "J. Graph Algorithms and Applications 16(1):85-108, 2012 (special\n  issue for GD 2010)", "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce the notion of Lombardi graph drawings, named after the American\nabstract artist Mark Lombardi. In these drawings, edges are represented as\ncircular arcs rather than as line segments or polylines, and the vertices have\nperfect angular resolution: the edges are equally spaced around each vertex. We\ndescribe algorithms for finding Lombardi drawings of regular graphs, graphs of\nbounded degeneracy, and certain families of planar graphs.\n", "versions": [{"version": "v1", "created": "Fri, 3 Sep 2010 03:36:03 GMT"}], "update_date": "2011-12-20", "authors_parsed": [["Duncan", "Christian A.", ""], ["Eppstein", "David", ""], ["Goodrich", "Michael T.", ""], ["Kobourov", "Stephen G.", ""], ["Nöllenburg", "Martin", ""]]}, {"id": "1009.0581", "submitter": "Martin N\\\"ollenburg", "authors": "Christian A. Duncan and David Eppstein and Michael T. Goodrich and\n  Stephen G. Kobourov and Martin N\\\"ollenburg", "title": "Drawing Trees with Perfect Angular Resolution and Polynomial Area", "comments": "30 pages, 17 figures", "journal-ref": "Discrete Comput. Geom. 49 (2): 157-182, 2013", "doi": "10.1007/s00454-012-9472-y", "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study methods for drawing trees with perfect angular resolution, i.e.,\nwith angles at each node v equal to 2{\\pi}/d(v). We show:\n  1. Any unordered tree has a crossing-free straight-line drawing with perfect\nangular resolution and polynomial area.\n  2. There are ordered trees that require exponential area for any\ncrossing-free straight-line drawing having perfect angular resolution.\n  3. Any ordered tree has a crossing-free Lombardi-style drawing (where each\nedge is represented by a circular arc) with perfect angular resolution and\npolynomial area. Thus, our results explore what is achievable with\nstraight-line drawings and what more is achievable with Lombardi-style\ndrawings, with respect to drawings of trees with perfect angular resolution.\n", "versions": [{"version": "v1", "created": "Fri, 3 Sep 2010 04:17:19 GMT"}, {"version": "v2", "created": "Thu, 10 Sep 2015 09:30:59 GMT"}], "update_date": "2015-09-11", "authors_parsed": [["Duncan", "Christian A.", ""], ["Eppstein", "David", ""], ["Goodrich", "Michael T.", ""], ["Kobourov", "Stephen G.", ""], ["Nöllenburg", "Martin", ""]]}, {"id": "1009.0794", "submitter": "Charlie C.L. Wang Dr.", "authors": "Charlie C. L. Wang and Yong Chen", "title": "Layered Depth-Normal Images: a Sparse Implicit Representation of Solid\n  Models", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a novel implicit representation of solid models. With\nthis representation, every solid model can be effectively presented by three\nlayered depth-normal images (LDNIs) that are perpendicular to three orthogonal\naxes respectively. The layered depth-normal images for a solid model, whose\nboundary is presented by a polygonal mesh, can be generated efficiently with\nhelp of the graphics hardware accelerated sampling. Based on this implicit\nrepresentation - LDNIs, solid modeling operations including the Boolean\noperations and the offsetting operation have been developed. A contouring\nalgorithm is also introduced in this paper to generate thin structure and sharp\nfeature preserved mesh surfaces from the layered depth-normal images.\nComparisons between LDNIs and other implicit representation of solid models are\ngiven at the end of the paper to demonstrate the advantages of LDNIs.\n", "versions": [{"version": "v1", "created": "Sat, 4 Sep 2010 01:17:54 GMT"}], "update_date": "2010-09-07", "authors_parsed": [["Wang", "Charlie C. L.", ""], ["Chen", "Yong", ""]]}, {"id": "1009.1373", "submitter": "Akitoshi Kawamura", "authors": "Akitoshi Kawamura", "title": "Generalized Semimagic Squares for Digital Halftoning", "comments": "6 pages, 6 figures", "journal-ref": "Theory of Computing Systems 49(3):632-638, 2011", "doi": "10.1007/s00224-010-9290-7", "report-no": null, "categories": "cs.CG math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Completing Aronov et al.'s study on zero-discrepancy matrices for digital\nhalftoning, we determine all (m, n, k, l) for which it is possible to put mn\nconsecutive integers on an m-by-n board (with wrap-around) so that each k-by-l\nregion holds the same sum. For one of the cases where this is impossible, we\ngive a heuristic method to find a matrix with small discrepancy.\n", "versions": [{"version": "v1", "created": "Tue, 7 Sep 2010 19:23:51 GMT"}], "update_date": "2013-05-03", "authors_parsed": [["Kawamura", "Akitoshi", ""]]}, {"id": "1009.1419", "submitter": "Joshua E. S. Socolar", "authors": "Joshua E. S. Socolar and Joan M. Taylor", "title": "Forcing nonperiodicity with a single tile", "comments": "18 pages, 10 figures. This article has been substantially revised and\n  accepted for publication in the Mathematical Intelligencer and is scheduled\n  to appear in Vol 33. Citations to and quotations from this work should\n  reference that publication. If you cite this work, please check that the\n  published form contains precisely the material to which you intend to refer", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG math.MG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An aperiodic prototile is a shape for which infinitely many copies can be\narranged to fill Euclidean space completely with no overlaps, but not in a\nperiodic pattern. Tiling theorists refer to such a prototile as an \"einstein\"\n(a German pun on \"one stone\"). The possible existence of an einstein has been\npondered ever since Berger's discovery of large set of prototiles that in\ncombination can tile the plane only in a nonperiodic way. In this article we\nreview and clarify some features of a prototile we recently introduced that is\nan einstein according to a reasonable definition. [This abstract does not\nappear in the published article.]\n", "versions": [{"version": "v1", "created": "Tue, 7 Sep 2010 22:58:03 GMT"}, {"version": "v2", "created": "Thu, 15 Sep 2011 04:03:49 GMT"}], "update_date": "2011-09-16", "authors_parsed": [["Socolar", "Joshua E. S.", ""], ["Taylor", "Joan M.", ""]]}, {"id": "1009.1575", "submitter": "Vincent Pilaud", "authors": "Julien Fert\\'e, Vincent Pilaud and Michel Pocchiola", "title": "On the number of simple arrangements of five double pseudolines", "comments": "24 pages, 16 figures, 6 tables", "journal-ref": "Discrete Comput. Geom., 45(2):279-302, 2011", "doi": "10.1007/s00454-010-9298-4", "report-no": null, "categories": "cs.CG math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe an incremental algorithm to enumerate the isomorphism classes of\ndouble pseudoline arrangements. The correction of our algorithm is based on the\nconnectedness under mutations of the spaces of one-extensions of double\npseudoline arrangements, proved in this paper. Counting results derived from an\nimplementation of our algorithm are also reported.\n", "versions": [{"version": "v1", "created": "Wed, 8 Sep 2010 16:02:41 GMT"}], "update_date": "2011-02-03", "authors_parsed": [["Ferté", "Julien", ""], ["Pilaud", "Vincent", ""], ["Pocchiola", "Michel", ""]]}, {"id": "1009.1605", "submitter": "Vincent Pilaud", "authors": "Vincent Pilaud", "title": "Multitriangulations, pseudotriangulations and some problems of\n  realization of polytopes", "comments": "PhD thesis; 312 pages, 129 figures; included summaries in french and\n  spanish", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG math.MG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This thesis explores two specific topics of discrete geometry, the\nmultitriangulations and the polytopal realizations of products, whose\nconnection is the problem of finding polytopal realizations of a given\ncombinatorial structure.\n  A k-triangulation is a maximal set of chords of the convex n-gon such that no\nk+1 of them mutually cross. We propose a combinatorial and geometric study of\nmultitriangulations based on their stars, which play the same role as triangles\nof triangulations. This study leads to interpret multitriangulations by duality\nas pseudoline arrangements with contact points covering a given support. We\nexploit finally these results to discuss some open problems on\nmultitriangulations, in particular the question of the polytopal realization of\ntheir flip graphs.\n  We study secondly the polytopality of Cartesian products. We investigate the\nexistence of polytopal realizations of cartesian products of graphs, and we\nstudy the minimal dimension that can have a polytope whose k-skeleton is that\nof a product of simplices.\n", "versions": [{"version": "v1", "created": "Wed, 8 Sep 2010 19:00:21 GMT"}], "update_date": "2010-09-09", "authors_parsed": [["Pilaud", "Vincent", ""]]}, {"id": "1009.1866", "submitter": "Krzysztof Onak", "authors": "Mark de Berg, Krzysztof Onak, Anastasios Sidiropoulos", "title": "Fat Polygonal Partitions with Applications to Visualization and\n  Embeddings", "comments": "26 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Let $\\mathcal{T}$ be a rooted and weighted tree, where the weight of any node\nis equal to the sum of the weights of its children. The popular Treemap\nalgorithm visualizes such a tree as a hierarchical partition of a square into\nrectangles, where the area of the rectangle corresponding to any node in\n$\\mathcal{T}$ is equal to the weight of that node. The aspect ratio of the\nrectangles in such a rectangular partition necessarily depends on the weights\nand can become arbitrarily high.\n  We introduce a new hierarchical partition scheme, called a polygonal\npartition, which uses convex polygons rather than just rectangles. We present\ntwo methods for constructing polygonal partitions, both having guarantees on\nthe worst-case aspect ratio of the constructed polygons; in particular, both\nmethods guarantee a bound on the aspect ratio that is independent of the\nweights of the nodes.\n  We also consider rectangular partitions with slack, where the areas of the\nrectangles may differ slightly from the weights of the corresponding nodes. We\nshow that this makes it possible to obtain partitions with constant aspect\nratio. This result generalizes to hyper-rectangular partitions in\n$\\mathbb{R}^d$. We use these partitions with slack for embedding ultrametrics\ninto $d$-dimensional Euclidean space: we give a $\\mathop{\\rm\npolylog}(\\Delta)$-approximation algorithm for embedding $n$-point ultrametrics\ninto $\\mathbb{R}^d$ with minimum distortion, where $\\Delta$ denotes the spread\nof the metric, i.e., the ratio between the largest and the smallest distance\nbetween two points. The previously best-known approximation ratio for this\nproblem was polynomial in $n$. This is the first algorithm for embedding a\nnon-trivial family of weighted-graph metrics into a space of constant dimension\nthat achieves polylogarithmic approximation ratio.\n", "versions": [{"version": "v1", "created": "Thu, 9 Sep 2010 19:31:27 GMT"}, {"version": "v2", "created": "Fri, 13 Dec 2013 21:10:50 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["de Berg", "Mark", ""], ["Onak", "Krzysztof", ""], ["Sidiropoulos", "Anastasios", ""]]}, {"id": "1009.1904", "submitter": "David Eppstein", "authors": "David Eppstein, Michael T. Goodrich, Roberto Tamassia", "title": "Privacy-Preserving Data-Oblivious Geometric Algorithms for Geographic\n  Data", "comments": "19 pages, 5 figures. Extended version of a paper to appear in Proc.\n  18th ACM SIGSPATIAL Int. Conf. Advances in Geographic Information Systems\n  (ACM GIS 2010), San Jose, California", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give efficient data-oblivious algorithms for several fundamental geometric\nproblems that are relevant to geographic information systems, including planar\nconvex hulls and all-nearest neighbors. Our methods are \"data-oblivious\" in\nthat they don't perform any data-dependent operations, with the exception of\noperations performed inside low-level blackbox circuits having a constant\nnumber of inputs and outputs. Thus, an adversary who observes the control flow\nof one of our algorithms, but who cannot see the inputs and outputs to the\nblackbox circuits, cannot learn anything about the input or output. This\nbehavior makes our methods applicable to secure multiparty computation (SMC)\nprotocols for geographic data used in location-based services. In SMC\nprotocols, multiple parties wish to perform a computation on their combined\ndata without revealing individual data to the other parties. For instance, our\nmethods can be used to solve a problem posed by Du and Atallah, where Alice has\na set, A, of m private points in the plane, Bob has another set, B, of n\nprivate points in the plane, and Alice and Bob want to jointly compute the\nconvex hull of A u B without disclosing any more information than what can be\nderived from the answer. In particular, neither Alice nor Bob want to reveal\nany of their respective points that are in the interior of the convex hull of A\nu B.\n", "versions": [{"version": "v1", "created": "Thu, 9 Sep 2010 22:24:13 GMT"}], "update_date": "2010-09-13", "authors_parsed": [["Eppstein", "David", ""], ["Goodrich", "Michael T.", ""], ["Tamassia", "Roberto", ""]]}, {"id": "1009.2160", "submitter": "Mugurel Ionut Andreica", "authors": "Mugurel Ionut Andreica, Eliana-Dina Tirsa", "title": "Clustering, Encoding and Diameter Computation Algorithms for\n  Multidimensional Data", "comments": "ISBN: 978-973-662-574-9", "journal-ref": "Proceedings of the IEEE International Conference on Automation,\n  Quality and Testing, Robotics (THETA 17) (AQTR) - Student Forum, Cluj-Napoca,\n  Romania, 28-30 May, 2010", "doi": null, "report-no": null, "categories": "cs.DS cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present novel algorithms for several multidimensional data\nprocessing problems. We consider problems related to the computation of\nrestricted clusters and of the diameter of a set of points using a new distance\nfunction. We also consider two string (1D data) processing problems, regarding\nan optimal encoding method and the computation of the number of occurrences of\na substring within a string generated by a grammar. The algorithms have been\nthoroughly analyzed from a theoretical point of view and some of them have also\nbeen evaluated experimentally.\n", "versions": [{"version": "v1", "created": "Sat, 11 Sep 2010 12:03:26 GMT"}], "update_date": "2010-09-14", "authors_parsed": [["Andreica", "Mugurel Ionut", ""], ["Tirsa", "Eliana-Dina", ""]]}, {"id": "1009.2216", "submitter": "Amol Aggarwal", "authors": "Amol Aggarwal", "title": "On Unit Distances in a Convex Polygon", "comments": "7 pages, no figures", "journal-ref": "Discrete Mathematics 338, 88-92 (2015)", "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 1959, Erd\\H{o}s and Moser asked for the maximum number of unit distances\nthat may be formed among the vertices of a convex $n$-gon; until now, the best\nknown upper bound has been $2\\pi n \\log_2 n + O(n)$, achieved by F\\\"uredi in\n1990. In this paper, we examine two properties that any convex polygon must\nsatisfy and use them to prove several new facts related to the question posed\nby Erd\\H{o}s and Moser. In particular, we improve on F\\\"uredi's result, and\ninstead obtain a bound of $n \\log_2 n + O(n)$; we exhibit a class of `cycles'\nformed by unit distances that are forbidden in convex polygons; and we provide\na lower bound that shows the limitations of our methods. The second result\naddresses a question asked by Fishburn and Reeds regarding the possible\nconfigurations of vertices that form a convex polygon.\n", "versions": [{"version": "v1", "created": "Sun, 12 Sep 2010 05:43:33 GMT"}, {"version": "v2", "created": "Mon, 11 Nov 2013 20:44:47 GMT"}, {"version": "v3", "created": "Tue, 21 Oct 2014 01:17:12 GMT"}], "update_date": "2014-12-10", "authors_parsed": [["Aggarwal", "Amol", ""]]}, {"id": "1009.2218", "submitter": "Amol Aggarwal", "authors": "Amol Aggarwal", "title": "On Isosceles Triangles and Related Problems in a Convex Polygon", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given any convex $n$-gon, in this article, we: (i) prove that its vertices\ncan form at most $n^2/2 + \\Theta(n\\log n)$ isosceles trianges with two sides of\nunit length and show that this bound is optimal in the first order, (ii)\nconjecture that its vertices can form at most $3n^2/4 + o(n^2)$ isosceles\ntriangles and prove this conjecture for a special group of convex $n$-gons,\n(iii) prove that its vertices can form at most $\\lfloor n/k \\rfloor$ regular\n$k$-gons for any integer $k\\ge 4$ and that this bound is optimal, and (iv)\nprovide a short proof that the sum of all the distances between its vertices is\nat least $(n-1)/2$ and at most $\\lfloor n/2 \\rfloor \\lceil n/2 \\rceil(1/2)$ as\nlong as the convex $n$-gon has unit perimeter.\n", "versions": [{"version": "v1", "created": "Sun, 12 Sep 2010 05:56:03 GMT"}, {"version": "v2", "created": "Wed, 15 Sep 2010 05:06:19 GMT"}], "update_date": "2010-09-16", "authors_parsed": [["Aggarwal", "Amol", ""]]}, {"id": "1009.2252", "submitter": "Masud Hasan", "authors": "Masud Hasan, Mohammad Monoar Hossain, Alejandro L\\'opez-Ortiz, Sabrina\n  Nusrat, Saad Altaful Quader and Nabila Rahman", "title": "Some New Equiprojective Polyhedra", "comments": "10 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A convex polyhedron $P$ is $k$-equiprojective if all of its orthogonal\nprojections, i.e., shadows, except those parallel to the faces of $P$ are\n$k$-gon for some fixed value of $k$. Since 1968, it is an open problem to\nconstruct all equiprojective polyhedra. Recently, Hasan and Lubiw [CGTA\n40(2):148-155, 2008] have given a characterization of equiprojective polyhedra.\nBased on their characterization, in this paper we discover some new\nequiprojective polyhedra by cutting and gluing existing polyhedra.\n", "versions": [{"version": "v1", "created": "Sun, 12 Sep 2010 17:32:19 GMT"}], "update_date": "2010-09-14", "authors_parsed": [["Hasan", "Masud", ""], ["Hossain", "Mohammad Monoar", ""], ["López-Ortiz", "Alejandro", ""], ["Nusrat", "Sabrina", ""], ["Quader", "Saad Altaful", ""], ["Rahman", "Nabila", ""]]}, {"id": "1009.2384", "submitter": "Boris Bukh", "authors": "Boris Bukh", "title": "Radon partitions in convexity spaces", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CG math.MG", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Tverberg's theorem asserts that every (k-1)(d+1)+1 points in R^d can be\npartitioned into k parts, so that the convex hulls of the parts have a common\nintersection. Calder and Eckhoff asked whether there is a purely combinatorial\ndeduction of Tverberg's theorem from the special case k=2. We dash the hopes of\na purely combinatorial deduction, but show that the case k=2 does imply that\nevery set of O(k^2 log^2 k) points admits a Tverberg partition into k parts.\n", "versions": [{"version": "v1", "created": "Mon, 13 Sep 2010 13:13:54 GMT"}], "update_date": "2010-09-14", "authors_parsed": [["Bukh", "Boris", ""]]}, {"id": "1009.2521", "submitter": "Haitao Wang", "authors": "Danny Z. Chen and Haitao Wang", "title": "An Improved Algorithm for Reconstructing a Simple Polygon from the\n  Visibility Angles", "comments": "12 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the following problem of reconstructing a simple\npolygon: Given a cyclically ordered vertex sequence of an unknown simple\npolygon P of n vertices and, for each vertex v of P, the sequence of angles\ndefined by all the visible vertices of v in P, reconstruct the polygon P (up to\nsimilarity). An O(n^3 log n) time algorithm has been proposed for this problem.\nWe present an improved algorithm with running time O(n^2), based on new\nobservations on the geometric structures of the problem. Since the input size\n(i.e., the total number of input visibility angles) is O(n^2) in the worst\ncase, our algorithm is worst-case optimal.\n", "versions": [{"version": "v1", "created": "Mon, 13 Sep 2010 20:58:34 GMT"}], "update_date": "2010-09-15", "authors_parsed": [["Chen", "Danny Z.", ""], ["Wang", "Haitao", ""]]}, {"id": "1009.3006", "submitter": "Jean-Lou De Carufel", "authors": "Prosenjit Bose and Jean-Lou De Carufel", "title": "Minimum-Area Enclosing Triangle with a Fixed Angle", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a set S of n points in the plane and a fixed angle 0 < omega < pi, we\nshow how to find in O(n log n) time all triangles of minimum area with one\nangle omega that enclose S. We prove that in general, the solution cannot be\nwritten without cubic roots. We also prove an Omega(n log n) lower bound for\nthis problem in the algebraic computation tree model. If the input is a convex\nn-gon, our algorithm takes Theta(n) time.\n", "versions": [{"version": "v1", "created": "Wed, 15 Sep 2010 19:45:35 GMT"}, {"version": "v2", "created": "Thu, 30 May 2013 15:41:10 GMT"}], "update_date": "2013-05-31", "authors_parsed": [["Bose", "Prosenjit", ""], ["De Carufel", "Jean-Lou", ""]]}, {"id": "1009.3469", "submitter": "Sandor P. Fekete", "authors": "Erin Chambers, Alejandro Erickson, S\\'andor Fekete, Jonathan Lenchner,\n  Jeff Sember, Venkatesh Srinivasan, Ulrike Stege, Svetlana Stolpner,\n  Christophe Weibel, and Sue Whitesides", "title": "Connectivity graphs of uncertainty regions", "comments": "29 pages, 15 figures, full version of extended abstract that appeared\n  in ISAAC 2010. (Modification: polished and greatly revised version.)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study connectivity relations among points, where the precise location of\neach input point lies in a region of uncertainty. We distinguish two\nfundamental scenarios under which uncertainty arises. In the favorable\nBest-Case Uncertainty (BU), each input point can be chosen from a given set to\nyield the best possible objective value. In the unfavorable Worst-Case\nUncertainty (WU), the input set has worst possible objective value among all\npossible point locations, which are uncertain due, for example, to imprecise\ndata. We consider these notions of uncertainty for the bottleneck spanning tree\nproblem, giving rise to the following Best-Case Connectivity with Uncertainty\n(BCU) problem: Given a family of geometric regions, choose one point per\nregion, such that the longest edge length of an associated geometric spanning\ntree is minimized. We show that this problem is NP-hard even for very simple\nscenarios in which the regions are line segments or squares. On the other hand,\nwe give an exact solution for the case in which there are n+k regions, where k\nof the regions are line segments and n of the regions are fixed points. We then\ngive approximation algorithms for cases where the regions are either all line\nsegments or all unit discs. We also provide approximation methods for the\ncorresponding Worst-Case Connectivity with Uncertainty (WCU) problem: Given a\nset of uncertainty regions, find the minimal distance r such that for any\nchoice of points, one per region, there is a spanning tree among the points\nwith edge length at most r.\n", "versions": [{"version": "v1", "created": "Fri, 17 Sep 2010 17:11:06 GMT"}, {"version": "v2", "created": "Tue, 21 Sep 2010 12:34:06 GMT"}, {"version": "v3", "created": "Wed, 3 Aug 2016 12:59:44 GMT"}, {"version": "v4", "created": "Sat, 31 Dec 2016 18:45:23 GMT"}], "update_date": "2017-01-03", "authors_parsed": [["Chambers", "Erin", ""], ["Erickson", "Alejandro", ""], ["Fekete", "Sándor", ""], ["Lenchner", "Jonathan", ""], ["Sember", "Jeff", ""], ["Srinivasan", "Venkatesh", ""], ["Stege", "Ulrike", ""], ["Stolpner", "Svetlana", ""], ["Weibel", "Christophe", ""], ["Whitesides", "Sue", ""]]}, {"id": "1009.3527", "submitter": "Darren Strash", "authors": "Michael T. Goodrich and Darren Strash", "title": "Priority Range Trees", "comments": "12 pages, 3 figures. To appear at 21st International Symposium on\n  Algorithms and Computation (ISAAC 2010)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe a data structure, called a priority range tree, which\naccommodates fast orthogonal range reporting queries on prioritized points. Let\n$S$ be a set of $n$ points in the plane, where each point $p$ in $S$ is\nassigned a weight $w(p)$ that is polynomial in $n$, and define the rank of $p$\nto be $r(p)=\\lfloor \\log w(p) \\rfloor$. Then the priority range tree can be\nused to report all points in a three- or four-sided query range $R$ with rank\nat least $\\lfloor \\log w \\rfloor$ in time $O(\\log W/w + k)$, and report $k$\nhighest-rank points in $R$ in time $O(\\log\\log n + \\log W/w' + k)$, where\n$W=\\sum_{p\\in S}{w(p)}$, $w'$ is the smallest weight of any point reported, and\n$k$ is the output size. All times assume the standard RAM model of computation.\nIf the query range of interest is three sided, then the priority range tree\noccupies $O(n)$ space, otherwise $O(n\\log n)$ space is used to answer\nfour-sided queries. These queries are motivated by the Weber--Fechner Law,\nwhich states that humans perceive and interpret data on a logarithmic scale.\n", "versions": [{"version": "v1", "created": "Sat, 18 Sep 2010 01:00:33 GMT"}], "update_date": "2010-09-21", "authors_parsed": [["Goodrich", "Michael T.", ""], ["Strash", "Darren", ""]]}, {"id": "1009.4375", "submitter": "Zeev Dvir", "authors": "Boaz Barak, Zeev Dvir, Avi Wigderson, Amir Yehudayoff", "title": "Rank Bounds for Design Matrices with Applications to Combinatorial\n  Geometry and Locally Correctable Codes", "comments": "31 pages. Added high dimensional SG theorem. Extended abstract to\n  appear in STOC 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CC cs.CG math.MG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A (q,k,t)-design matrix is an m x n matrix whose pattern of zeros/non-zeros\nsatisfies the following design-like condition: each row has at most q\nnon-zeros, each column has at least k non-zeros and the supports of every two\ncolumns intersect in at most t rows. We prove that the rank of any\n(q,k,t)-design matrix over a field of characteristic zero (or sufficiently\nlarge finite characteristic) is at least n - (qtn/2k)^2 . Using this result we\nderive the following applications:\n  (1) Impossibility results for 2-query LCCs over the complex numbers: A\n2-query locally correctable code (LCC) is an error correcting code in which\nevery codeword coordinate can be recovered, probabilistically, by reading at\nmost two other code positions. Such codes have numerous applications and\nconstructions (with exponential encoding length) are known over finite fields\nof small characteristic. We show that infinite families of such linear 2-query\nLCCs do not exist over the complex numbers.\n  (2) Generalization of results in combinatorial geometry: We prove a\nquantitative analog of the Sylvester-Gallai theorem: Let $v_1,...,v_m$ be a set\nof points in $\\C^d$ such that for every $i \\in [m]$ there exists at least\n$\\delta m$ values of $j \\in [m]$ such that the line through $v_i,v_j$ contains\na third point in the set. We show that the dimension of $\\{v_1,...,v_m \\}$ is\nat most $O(1/\\delta^2)$. Our results generalize to the high dimensional case\n(replacing lines with planes, etc.) and to the case where the points are\ncolored (as in the Motzkin-Rabin Theorem).\n", "versions": [{"version": "v1", "created": "Wed, 22 Sep 2010 14:50:25 GMT"}, {"version": "v2", "created": "Thu, 10 Mar 2011 15:06:30 GMT"}], "update_date": "2011-03-11", "authors_parsed": [["Barak", "Boaz", ""], ["Dvir", "Zeev", ""], ["Wigderson", "Avi", ""], ["Yehudayoff", "Amir", ""]]}, {"id": "1009.4641", "submitter": "D\\\"om\\\"ot\\\"or P\\'alv\\\"olgyi", "authors": "D\\\"om\\\"ot\\\"or P\\'alv\\\"olgyi", "title": "Decomposition of Geometric Set Systems and Graphs", "comments": "This is my PhD thesis", "journal-ref": null, "doi": null, "report-no": "EPFL TH\\`ESE N{\\deg} 4821 (2010)", "categories": "math.CO cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study two decomposition problems in combinatorial geometry. The first part\ndeals with the decomposition of multiple coverings of the plane. We say that a\nplanar set is cover-decomposable if there is a constant m such that any m-fold\ncovering of the plane with its translates is decomposable into two disjoint\ncoverings of the whole plane. Pach conjectured that every convex set is\ncover-decomposable. We verify his conjecture for polygons. Moreover, if m is\nlarge enough, we prove that any m-fold covering can even be decomposed into k\ncoverings. Then we show that the situation is exactly the opposite in 3\ndimensions, for any polyhedron and any $m$ we construct an m-fold covering of\nthe space that is not decomposable. We also give constructions that show that\nconcave polygons are usually not cover-decomposable. We start the first part\nwith a detailed survey of all results on the cover-decomposability of polygons.\n  The second part investigates another geometric partition problem, related to\nplanar representation of graphs. The slope number of a graph G is the smallest\nnumber s with the property that G has a straight-line drawing with edges of at\nmost s distinct slopes and with no bends. We examine the slope number of\nbounded degree graphs. Our main results are that if the maximum degree is at\nleast 5, then the slope number tends to infinity as the number of vertices\ngrows but every graph with maximum degree at most 3 can be embedded with only\nfive slopes. We also prove that such an embedding exists for the related notion\ncalled slope parameter. Finally, we study the planar slope number, defined only\nfor planar graphs as the smallest number s with the property that the graph has\na straight-line drawing in the plane without any crossings such that the edges\nare segments of only s distinct slopes. We show that the planar slope number of\nplanar graphs with bounded degree is bounded.\n", "versions": [{"version": "v1", "created": "Thu, 23 Sep 2010 15:45:05 GMT"}, {"version": "v2", "created": "Fri, 24 Sep 2010 07:21:55 GMT"}], "update_date": "2010-09-27", "authors_parsed": [["Pálvölgyi", "Dömötör", ""]]}, {"id": "1009.5344", "submitter": "Vincent Pilaud", "authors": "Vincent Pilaud and Michel Pocchiola", "title": "Multitriangulations, pseudotriangulations and primitive sorting networks", "comments": "60 pages, 40 figures; minor corrections and improvements of\n  presentation", "journal-ref": "Discrete Comput. Geom., 48(1):142-191, 2012", "doi": "10.1007/s00454-012-9408-6", "report-no": null, "categories": "math.CO cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the set of all pseudoline arrangements with contact points which\ncover a given support. We define a natural notion of flip between these\narrangements and study the graph of these flips. In particular, we provide an\nenumeration algorithm for arrangements with a given support, based on the\nproperties of certain greedy pseudoline arrangements and on their connection\nwith sorting networks. Both the running time per arrangement and the working\nspace of our algorithm are polynomial.\n  As the motivation for this work, we provide in this paper a new\ninterpretation of both pseudotriangulations and multitriangulations in terms of\npseudoline arrangements on specific supports. This interpretation explains\ntheir common properties and leads to a natural definition of\nmultipseudotriangulations, which generalizes both. We study elementary\nproperties of multipseudotriangulations and compare them to iterations of\npseudotriangulations.\n", "versions": [{"version": "v1", "created": "Mon, 27 Sep 2010 17:56:30 GMT"}, {"version": "v2", "created": "Sun, 11 Mar 2012 09:34:20 GMT"}], "update_date": "2012-06-14", "authors_parsed": [["Pilaud", "Vincent", ""], ["Pocchiola", "Michel", ""]]}, {"id": "1009.5628", "submitter": "Sandor P. Fekete", "authors": "Erik D. Demaine, Sandor P. Fekete, Guenter Rote, Nils Schweer, Daria\n  Schymura, Mariano Zelke", "title": "Integer Point Sets Minimizing Average Pairwise L1-Distance: What is the\n  Optimal Shape of a Town?", "comments": "26 pages, 6 figures, to appear in Computational Geometry: Theory and\n  Applications", "journal-ref": "Computational Geometry, Theory and Applications 44 (2011), 82-94", "doi": "10.1016/j.comgeo.2010.09.004", "report-no": null, "categories": "cs.CG cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An n-town, for a natural number n, is a group of n buildings, each occupying\na distinct position on a 2-dimensional integer grid. If we measure the distance\nbetween two buildings along the axis-parallel street grid, then an n-town has\noptimal shape if the sum of all pairwise Manhattan distances is minimized. This\nproblem has been studied for cities, i.e., the limiting case of very large n.\nFor cities, it is known that the optimal shape can be described by a\ndifferential equation, for which no closed-form is known. We show that optimal\nn-towns can be computed in O(n^7.5) time. This is also practically useful, as\nit allows us to compute optimal solutions up to n=80.\n", "versions": [{"version": "v1", "created": "Tue, 28 Sep 2010 16:31:35 GMT"}], "update_date": "2017-11-20", "authors_parsed": [["Demaine", "Erik D.", ""], ["Fekete", "Sandor P.", ""], ["Rote", "Guenter", ""], ["Schweer", "Nils", ""], ["Schymura", "Daria", ""], ["Zelke", "Mariano", ""]]}, {"id": "1009.6215", "submitter": "Bjoern Andres", "authors": "Bjoern Andres, Ullrich Koethe, Thorben Kroeger, Fred A. Hamprecht", "title": "How to Extract the Geometry and Topology from Very Large 3D\n  Segmentations", "comments": "C++ source code, free command line tools and MATLAB mex files are\n  avilable from http://hci.iwr.uni-heidelberg.de/software.php", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CG cs.CV cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Segmentation is often an essential intermediate step in image analysis. A\nvolume segmentation characterizes the underlying volume image in terms of\ngeometric information--segments, faces between segments, curves in which\nseveral faces meet--as well as a topology on these objects. Existing algorithms\nencode this information in designated data structures, but require that these\ndata structures fit entirely in Random Access Memory (RAM). Today, 3D images\nwith several billion voxels are acquired, e.g. in structural neurobiology.\nSince these large volumes can no longer be processed with existing methods, we\npresent a new algorithm which performs geometry and topology extraction with a\nruntime linear in the number of voxels and log-linear in the number of faces\nand curves. The parallelizable algorithm proceeds in a block-wise fashion and\nconstructs a consistent representation of the entire volume image on the hard\ndrive, making the structure of very large volume segmentations accessible to\nimage analysis. The parallelized C++ source code, free command line tools and\nMATLAB mex files are avilable from\nhttp://hci.iwr.uni-heidelberg.de/software.php\n", "versions": [{"version": "v1", "created": "Thu, 30 Sep 2010 18:24:09 GMT"}], "update_date": "2010-10-01", "authors_parsed": [["Andres", "Bjoern", ""], ["Koethe", "Ullrich", ""], ["Kroeger", "Thorben", ""], ["Hamprecht", "Fred A.", ""]]}]