[{"id": "1604.00045", "submitter": "Wajdi Dhifli Wajdi DHIFLI", "authors": "Wajdi Dhifli, Abdoulaye Banir\\'e Diallo", "title": "PGR: A Graph Repository of Protein 3D-Structures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Graph theory and graph mining constitute rich fields of computational\ntechniques to study the structures, topologies and properties of graphs. These\ntechniques constitute a good asset in bioinformatics if there exist efficient\nmethods for transforming biological data into graphs. In this paper, we present\nProtein Graph Repository (PGR), a novel database of protein 3D-structures\ntransformed into graphs allowing the use of the large repertoire of graph\ntheory techniques in protein mining. This repository contains graph\nrepresentations of all currently known protein 3D-structures described in the\nProtein Data Bank (PDB). PGR also provides an efficient online converter of\nprotein 3D-structures into graphs, biological and graph-based description,\npre-computed protein graph attributes and statistics, visualization of each\nprotein graph, as well as graph-based protein similarity search tool. Such\nrepository presents an enrichment of existing online databases that will help\nbridging the gap between graph mining and protein structure analysis. PGR data\nand features are unique and not included in any other protein database. The\nrepository is available at http://wjdi.bioinfo.uqam.ca/.\n", "versions": [{"version": "v1", "created": "Mon, 25 Jan 2016 02:37:08 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Dhifli", "Wajdi", ""], ["Diallo", "Abdoulaye Baniré", ""]]}, {"id": "1604.00360", "submitter": "Walter Hehl", "authors": "Walter Hehl", "title": "A General World Model with Poiesis: Poppers Three Worlds updated with\n  Software", "comments": "9 pages. 1 Figure of a world model with physics, software and Geist,\n  Book published 2016 (in German) by Springer, Heidelberg, with the general\n  fundamentals of Software for philosophy", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the famous Three Worlds of Karl Popper as template, the paper rigorously\nintroduces the concept of software to define the counterpart of the physical\nsubworld. Digesting the scientific-technical view of biology and neurology on a\nhigh level, results in an updated Three Worlds scheme consistent with an\ninformation technical view. Chance and mathematics complete the world model.\nSome simple examples illustrate the move from Poppers view of the world with\nphysics, psyche and World 3, to a new extended model with physics, extended\nsoftware (which we call Poiesis), and Geist (the notion which embodies spirit,\nmind and soul).\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 19:07:40 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Hehl", "Walter", ""]]}, {"id": "1604.00818", "submitter": "Samiya Shimly", "authors": "Samiya Shimly, Samaneh Movassaghi and David Smith", "title": "Cooperative communications for sleep monitoring in wireless body area\n  networks", "comments": "2 pages, 3 figures, Electronics Letters", "journal-ref": "Electronics Letters, 52, (8), 2016, 2 pp", "doi": "10.1049/el.2015.3008", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the performance of cooperative receive diversity, for\nthe wireless body area network (WBAN) radio channel, compliant with the IEEE\n802.15.6 Standard, in the case of monitoring a sleeping person. Extensive WBAN\nmeasurements near the 2.4 GHz ISM band were used. Up to 7 dB and 20%\nimprovement for two-hop communications with the use of relays are empirically\ndemonstrated with respect to outage probability and outage duration, with\n3-branch cooperative selection combining and 3-branch cooperative\nswitch-and-examine combining.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 11:34:33 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Shimly", "Samiya", ""], ["Movassaghi", "Samaneh", ""], ["Smith", "David", ""]]}, {"id": "1604.01344", "submitter": "Joaqu\\'in Ezpeleta", "authors": "Joaqu\\'in Ezpeleta, Flavia J. Krsticevic, Pilar Bulacio and Elizabeth\n  Tapia", "title": "Designing robust watermark barcodes for multiplex long-read sequencing", "comments": "Paper accepted at the RECOMB-Seq 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A method for designing sequencing barcodes that can withstand a large number\nof insertion, deletion and substitution errors and are suitable for use in\nmultiplex single-molecule real-time sequencing is presented. The manuscript\nfocuses on the design of barcodes for full-length single-pass reads, impaired\nby challenging error rates in the order of 11%. To the authors' knowledge, this\nis the first method to specifically address this problem without requiring\nupstream quality improvement. The proposed barcodes can multiplex hundreds or\nthousands of samples while achieving sample misassignment probabilities as low\nas $10^{-7}$, and are designed to be compatible with chemical constraints\nimposed by the sequencing process. Software for constructing watermark barcode\nsets and demultiplexing barcoded reads, together with example sets of barcodes\nand synthetic barcoded reads, are freely available at\nwww.cifasis-conicet.gov.ar/ezpeleta/NS-watermark.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2016 17:39:03 GMT"}], "update_date": "2016-04-06", "authors_parsed": [["Ezpeleta", "Joaquín", ""], ["Krsticevic", "Flavia J.", ""], ["Bulacio", "Pilar", ""], ["Tapia", "Elizabeth", ""]]}, {"id": "1604.04044", "submitter": "Jaydip Sen", "authors": "Jaydip Sen and Tamal Datta Chaudhuri", "title": "A Framework for Predictive Analysis of Stock Market Indices : A Study of\n  the Indian Auto Sector", "comments": "19 Pages, 2 Figures, 8 Tables. in Calcutta Business School (CBS)\n  Journal of Management Practices, Volume 2, Number 2, December 2015 Edition,\n  pp 1 -19. ISBN: 2349-5073", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Analysis and prediction of stock market time series data has attracted\nconsiderable interest from the research community over the last decade. Rapid\ndevelopment and evolution of sophisticated algorithms for statistical analysis\nof time series data, and availability of high-performance hardware has made it\npossible to process and analyze high volume stock market time series data\neffectively, in real-time. Among many other important characteristics and\nbehavior of such data, forecasting is an area which has witnessed considerable\nfocus. In this work, we have used time series of the index values of the Auto\nsector in India during January 2010 to December 2015 for a deeper understanding\nof the behavior of its three constituent components, e.g., the trend, the\nseasonal component, and the random component. Based on this structural\nanalysis, we have also designed five approaches for forecasting and also\ncomputed their accuracy in prediction using suitably chosen training and test\ndata sets. Extensive results are presented to demonstrate the effectiveness of\nour proposed decomposition approaches of time series and the efficiency of our\nforecasting techniques, even in presence of a random component and a sharply\nchanging trend component in the time-series.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 06:39:31 GMT"}], "update_date": "2016-05-12", "authors_parsed": [["Sen", "Jaydip", ""], ["Chaudhuri", "Tamal Datta", ""]]}, {"id": "1604.05570", "submitter": "Xingpeng Li", "authors": "Xingpeng Li, Pranavamoorthy Balasubramanian, Mostafa Sahraei-Ardakani,\n  Mojdeh Abdi-Khorsand, Kory W. Hedman, Robin Podmore", "title": "Real-Time Contingency Analysis with Corrective Transmission Switching -\n  Part I: Methodology", "comments": "8 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Transmission switching (TS) has gained significant attention recently.\nHowever, barriers still remain and must be overcome before the technology can\nbe adopted by the industry. The state of the art challenges include AC\nfeasibility and performance, computational complexity, the ability to handle\nlarge-scale real power systems, and dynamic stability. This two-part paper\ninvestigates these challenges by developing an AC TS-based real-time\ncontingency analysis (RTCA) tool that can handle large-scale systems within a\nreasonable time. The tool proposes multiple corrective switching actions, after\ndetection of a contingency with potential violations. To reduce the\ncomputational complexity, three heuristic algorithms are proposed to generate a\nsmall set of candidates for switching. Parallel computing is implemented to\nfurther speed up the solution time. Furthermore, stability analysis is\nperformed to check for dynamic stability of proposed TS solutions. Part I of\nthe paper presents a comprehensive literature review and the methodology. The\npromising results, tested on the Tennessee Valley Authority (TVA) system and\nactual energy management system (EMS) snapshots from Pennsylvania New Jersey\nMaryland (PJM) and the Electric Reliability Council of Texas (ERCOT), are\npresented in Part II. It is concluded that RTCA with corrective TS\nsignificantly reduces potential post-contingency violations and is ripe for\nindustry adoption.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 19:30:20 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Li", "Xingpeng", ""], ["Balasubramanian", "Pranavamoorthy", ""], ["Sahraei-Ardakani", "Mostafa", ""], ["Abdi-Khorsand", "Mojdeh", ""], ["Hedman", "Kory W.", ""], ["Podmore", "Robin", ""]]}, {"id": "1604.05571", "submitter": "Xingpeng Li", "authors": "Xingpeng Li, Mostafa Sahraei-Ardakani, Pranavamoorthy Balasubramanian,\n  Mojdeh Abdi-Khorsand, Kory W. Hedman, Robin Podmore", "title": "Real-Time Contingency Analysis with Corrective Transmission Switching -\n  Part II: Results and Discussion", "comments": "8 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the performance of an AC transmission switching (TS)\nbased real-time contingency analysis (RTCA) tool that is introduced in Part I\nof this paper. The approach quickly proposes high quality corrective switching\nactions for relief of potential post-contingency network violations. The\napproach is confirmed by testing it on actual EMS snapshots of two large-scale\nsystems, the Electric Reliability Council of Texas (ERCOT) and the Pennsylvania\nNew Jersey Maryland (PJM) Interconnection; the approach is also tested on data\nprovided by the Tennessee Valley Authority (TVA). The results show that the\ntool effectively reduces post-contingency violations. Fast heuristics are used\nalong with parallel computing to reduce the computational difficulty of the\nproblem. The tool is able to handle the PJM system in about five minutes with a\nstandard desktop computer. Time-domain simulations are performed to check\nsystem stability with corrective transmission switching (CTS). In conclusion,\nthe paper shows that corrective switching is ripe for industry adoption. CTS\ncan provide significant reliability benefits that can be translated into\nsignificant cost savings.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 19:43:56 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Li", "Xingpeng", ""], ["Sahraei-Ardakani", "Mostafa", ""], ["Balasubramanian", "Pranavamoorthy", ""], ["Abdi-Khorsand", "Mojdeh", ""], ["Hedman", "Kory W.", ""], ["Podmore", "Robin", ""]]}, {"id": "1604.06815", "submitter": "Christian M\\\"uller", "authors": "Jacob Bien, Irina Gaynanova, Johannes Lederer, Christian M\\\"uller", "title": "Non-convex Global Minimization and False Discovery Rate Control for the\n  TREX", "comments": null, "journal-ref": "Journal of Computational and Graphical Statistics 2017, Vol. 27,\n  No. 1, 23-33", "doi": "10.1080/10618600.2017.1341414", "report-no": null, "categories": "stat.ML cs.OH stat.CO stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The TREX is a recently introduced method for performing sparse\nhigh-dimensional regression. Despite its statistical promise as an alternative\nto the lasso, square-root lasso, and scaled lasso, the TREX is computationally\nchallenging in that it requires solving a non-convex optimization problem. This\npaper shows a remarkable result: despite the non-convexity of the TREX problem,\nthere exists a polynomial-time algorithm that is guaranteed to find the global\nminimum. This result adds the TREX to a very short list of non-convex\noptimization problems that can be globally optimized (principal components\nanalysis being a famous example). After deriving and developing this new\napproach, we demonstrate that (i) the ability of the preexisting TREX heuristic\nto reach the global minimum is strongly dependent on the difficulty of the\nunderlying statistical problem, (ii) the new polynomial-time algorithm for TREX\npermits a novel variable ranking and selection scheme, (iii) this scheme can be\nincorporated into a rule that controls the false discovery rate (FDR) of\nincluded features in the model. To achieve this last aim, we provide an\nextension of the results of Barber & Candes (2015) to establish that the\nknockoff filter framework can be applied to the TREX. This investigation thus\nprovides both a rare case study of a heuristic for non-convex optimization and\na novel way of exploiting non-convexity for statistical inference.\n", "versions": [{"version": "v1", "created": "Fri, 22 Apr 2016 20:28:55 GMT"}, {"version": "v2", "created": "Tue, 20 Sep 2016 20:07:35 GMT"}], "update_date": "2021-04-01", "authors_parsed": [["Bien", "Jacob", ""], ["Gaynanova", "Irina", ""], ["Lederer", "Johannes", ""], ["Müller", "Christian", ""]]}]