[{"id": "0908.0828", "submitter": "Andrew Adamatzky", "authors": "Genaro J. Martinez, Andrew Adamatzky, Harold V. McIntosh", "title": "Localization dynamics in a binary two-dimensional cellular automaton:\n  the Diffusion Rule", "comments": "Accepted to Journal of Cellular Automata", "journal-ref": null, "doi": "10.1007/978-1-84996-217-9_16", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a two-dimensional cellular automaton (CA), called Diffusion Rule\n(DR), which exhibits diffusion-like dynamics of propagating patterns. In\ncomputational experiments we discover a wide range of mobile and stationary\nlocalizations (gliders, oscillators, glider guns, puffer trains, etc), analyze\nspatio-temporal dynamics of collisions between localizations, and discuss\npossible applications in unconventional computing.\n", "versions": [{"version": "v1", "created": "Thu, 6 Aug 2009 09:33:34 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Martinez", "Genaro J.", ""], ["Adamatzky", "Andrew", ""], ["McIntosh", "Harold V.", ""]]}, {"id": "0908.0853", "submitter": "Andrew Adamatzky", "authors": "Andrew Adamatzky, Genaro Martinez, Liang Zhang, Andrew Wuensche", "title": "Operating binary strings using gliders and eaters in reaction-diffusion\n  cellular automaton", "comments": null, "journal-ref": "Mathematical and Computer Modelling, Volume 52, Issues 1-2, July\n  2010, Pages 177-190", "doi": "10.1016/j.mcm.2010.02.006", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study transformations of 2-, 4- and 6-bit numbers in interactions between\ntraveling and stationary localizations in the Spiral Rule reaction-diffusion\ncellular automaton. The Spiral Rule automaton is a hexagonal ternary-state\ntwo-dimensional cellular automaton -- a finite-state machine imitation of an\nactivator-inhibitor reaction-diffusion system. The activator is self-inhibited\nin certain concentrations. The inhibitor dissociates in the absence of the\nactivator. The Spiral Rule cellular automaton has rich spatio-temporal dynamics\nof traveling (glider) and stationary (eater) patterns. When a glider brushes an\neater the eater may slightly change its configuration, which is updated once\nmore every next hit. We encode binary strings in the states of eaters and\nsequences of gliders. We study what types of binary compositions of binary\nstrings are implementable by sequences of gliders brushing an eater. The models\ndeveloped will be used in future laboratory designs of reaction-diffusion\nchemical computers.\n", "versions": [{"version": "v1", "created": "Thu, 6 Aug 2009 12:42:05 GMT"}], "update_date": "2010-11-23", "authors_parsed": [["Adamatzky", "Andrew", ""], ["Martinez", "Genaro", ""], ["Zhang", "Liang", ""], ["Wuensche", "Andrew", ""]]}, {"id": "0908.2083", "submitter": "Janusz Brzozowski", "authors": "J. Brzozowski, G. Jir\\'askov\\'a, B. Li", "title": "Quotient complexity of ideal languages", "comments": "24 pages, 9 .eepic figures, 2 tables, use llncs.cls", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the state complexity of regular operations in the class of ideal\nlanguages. A language L over an alphabet Sigma is a right (left) ideal if it\nsatisfies L = L Sigma* (L = Sigma* L). It is a two-sided ideal if L = Sigma* L\nSigma *, and an all-sided ideal if it is the shuffle of Sigma* with L. We\nprefer the term \"quotient complexity\" instead of \"state complexity\", and we use\nderivatives to calculate upper bounds on quotient complexity, whenever it is\nconvenient. We find tight upper bounds on the quotient complexity of each type\nof ideal language in terms of the complexity of an arbitrary generator and of\nits minimal generator, the complexity of the minimal generator, and also on the\noperations union, intersection, set difference, symmetric difference,\nconcatenation, star and reversal of ideal languages.\n", "versions": [{"version": "v1", "created": "Fri, 14 Aug 2009 15:24:15 GMT"}], "update_date": "2009-08-17", "authors_parsed": [["Brzozowski", "J.", ""], ["Jirásková", "G.", ""], ["Li", "B.", ""]]}, {"id": "0908.3315", "submitter": "Nelma Moreira", "authors": "Marco Almeida, Nelma Moreira, and Rog\\'erio Reis", "title": "Exact generation of acyclic deterministic finite automata", "comments": "DCFS'08", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a canonical representation for trim acyclic deterministic finite\nautomata (Adfa) with n states over an alphabet of k symbols. Using this normal\nform, we present a backtracking algorithm for the exact generation of Adfas.\nThis algorithm is a non trivial adaptation of the algorithm for the exact\ngeneration of minimal acyclic deterministic finite automata, presented by\nAlmeida et al.\n", "versions": [{"version": "v1", "created": "Sun, 23 Aug 2009 16:59:49 GMT"}], "update_date": "2009-08-25", "authors_parsed": [["Almeida", "Marco", ""], ["Moreira", "Nelma", ""], ["Reis", "Rogério", ""]]}, {"id": "0908.3784", "submitter": "Alexandr Kazda", "authors": "Jarkko Kari, Alexandr Kazda, Paula Steinby", "title": "On Continuous Weighted Finite Automata", "comments": "41 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the continuity of the \\omega-functions and real functions\ndefined by weighted finite automata (WFA). We concentrate on the case of\naverage preserving WFA. We show that every continuous \\omega-function definable\nby some WFA can be defined by an average preserving WFA and then characterize\nminimal average preserving WFA whose \\omega-function or \\omega-function and\nreal function are continuous.\n  We obtain several algorithmic reductions for WFA-related decision problems.\nIn particular, we show that deciding whether the \\omega-function and real\nfunction of an average preserving WFA are both continuous is computationally\nequivalent to deciding stability of a set of matrices.\n  We also present a method for constructing WFA that compute continuous real\nfunctions.\n", "versions": [{"version": "v1", "created": "Wed, 26 Aug 2009 18:07:50 GMT"}], "update_date": "2009-08-27", "authors_parsed": [["Kari", "Jarkko", ""], ["Kazda", "Alexandr", ""], ["Steinby", "Paula", ""]]}]