[{"id": "1310.1709", "submitter": "Olivier Mullier", "authors": "Mullier Olivier, \\'Eric Goubault, Michel Kieffer, Sylvie Putot", "title": "General inner approximation of vector-valued functions", "comments": "26 pages, 17 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper addresses the problem of evaluating a subset of the range of a\nvector-valued function. It is based on a work by Gold- sztejn and Jaulin which\nprovides methods based on interval analysis to address this problem when the\ndimension of the domain and co-domain of the function are equal. This paper\nextends this result to vector-valued functions with domain and co-domain of\ndifferent dimensions. This ex- tension requires the knowledge of the rank of\nthe Jacobian function on the whole domain. This leads to the sub-problem of\nextracting an in- terval sub-matrix of maximum rank from a given interval\nmatrix. Three different techniques leading to approximate solutions of this\nextraction are proposed and compared.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2013 09:15:54 GMT"}], "update_date": "2013-10-08", "authors_parsed": [["Olivier", "Mullier", ""], ["Goubault", "Éric", ""], ["Kieffer", "Michel", ""], ["Putot", "Sylvie", ""]]}, {"id": "1310.1847", "submitter": "Loc Tran Vinh", "authors": "H. Nguyen-Xuan, Loc V. Tran, Chien H. Thai, S. Kulasegaram, S.P.A.\n  Bordas", "title": "Isogeometric finite element analysis of functionally graded plates using\n  a refined plate theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose in this paper a novel inverse tangent transverse shear deformation\nformulation for functionally graded material (FGM) plates. The isogeometric\nfinite element analysis (IGA) of static, free vibration and buckling problems\nof FGM plates is then addressed using a refined plate theory (RPT). The RPT\nenables us to describe the non-linear distribution of shear stresses through\nthe plate thickness without any requirement of shear correction factors (SCF).\nIGA utilizes basis functions, namely B-splines or non-uniform rational\nB-splines (NURBS), which achieve easily the smoothness of any arbitrary order.\nIt hence satisfies the C1 requirement of the RPT model. The present method\napproximates the displacement field of four degrees of freedom per each control\npoint and retains the computational efficiency while ensuring the high accuracy\nin solution.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2013 16:19:34 GMT"}], "update_date": "2013-10-08", "authors_parsed": [["Nguyen-Xuan", "H.", ""], ["Tran", "Loc V.", ""], ["Thai", "Chien H.", ""], ["Kulasegaram", "S.", ""], ["Bordas", "S. P. A.", ""]]}, {"id": "1310.1906", "submitter": "Sayyed Ali Hossayni", "authors": "K. Parand, Sayyed A. Hossayni, J.A. Rad", "title": "The application of the exact operational matrices for solving the\n  Emden-Fowler equations, arising in astrophysics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The objective of this paper is to apply the well-known exact operational\nmatrices (EOMs) idea for solving the Emden-Fowler equations, illustrating the\nsuperiority of EOMs versus ordinary operational matrices (OOMs). Up to now, a\nfew studies have been conducted on EOMs and the differential equations solved\nby them do not have high-degree nonlinearity and the reported results are not\nregarded as appropriate criteria for the excellence of the new method. So, we\nchose Emden-Fowler type differential equations and solved them by this method.\nTo confirm the accuracy of the new method and to show the preeminence of EOMs\nversus OOMs, the norm1 of the residual and error function of both methods are\nevaluated for multiple $m$ values, where $m$ is the degree of the Bernstein\npolynomials. We reported the results in form of plots to illustrate the error\nconvergence of both methods to zero and also to show the primacy of the new\nmethod versus OOMs. The obtained results have demonstrated the increased\naccuracy of the new method.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2013 19:51:54 GMT"}, {"version": "v2", "created": "Wed, 1 Jan 2014 07:42:52 GMT"}], "update_date": "2014-01-03", "authors_parsed": [["Parand", "K.", ""], ["Hossayni", "Sayyed A.", ""], ["Rad", "J. A.", ""]]}, {"id": "1310.3422", "submitter": "Sayyed Ali Hossayni", "authors": "K. Parand, Saeed Zafarvahedian, Sayyed A. Hossayni", "title": "GPU-Acceleration of Parallel Unconditionally Stable Group Explicit\n  Finite Difference Method", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Graphics Processing Units (GPUs) are high performance co-processors\noriginally intended to improve the use and quality of computer graphics\napplications. Once, researchers and practitioners noticed the potential of\nusing GPU for general purposes, GPUs applications have been extended from\ngraphics applications to other fields. The main objective of this paper is to\nevaluate the impact of using GPU in solution of the transient diffusion type\nequation by parallel and stable group explicit finite difference method and\nencourage the researchers in this field to immigrate from implementing their\nalgorithms in CPU to the GPU emerging world. For comparing them, we implemented\nthe method in both GPU and CPU (multi-core) programming context. Moreover, we\nproposed an optimal synchronization arrangement for the implementation\npseudo-code. Also, the interrelation of GPU parallel programming and\ninitializing the algorithm variables were discussed, taking advantage of\nnumerical experiences. The GPU-approach results are faster than those obtained\nfrom a much expensive parallel 8-thread CPU-based programming. The GPU used in\nthis paper, is an ordinary old laptop GPU (GT 335M, launched at 2010) and is\naccessible for everyone and the newer generations of GPU (as discussed in\npaper) have even more performance priority over the similar-price GPUs. Then,\nthe results are expected to encourage the entire research society to take\nadvantage of GPUs and improve the time efficiency of their studies.\n", "versions": [{"version": "v1", "created": "Sat, 12 Oct 2013 20:55:35 GMT"}, {"version": "v2", "created": "Sun, 13 Apr 2014 16:51:56 GMT"}, {"version": "v3", "created": "Sun, 10 Jul 2016 14:12:29 GMT"}], "update_date": "2016-07-12", "authors_parsed": [["Parand", "K.", ""], ["Zafarvahedian", "Saeed", ""], ["Hossayni", "Sayyed A.", ""]]}, {"id": "1310.3556", "submitter": "Abhisek Kundu", "authors": "Abhisek Kundu, Srinivas Nambirajan, Petros Drineas", "title": "Identifying Influential Entries in a Matrix", "comments": "There is a bug in the proof of Lemma 5, which we are currently\n  working to fix", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For any matrix A in R^(m x n) of rank \\rho, we present a probability\ndistribution over the entries of A (the element-wise leverage scores of\nequation (2)) that reveals the most influential entries in the matrix. From a\ntheoretical perspective, we prove that sampling at most s = O ((m + n) \\rho^2\nln (m + n)) entries of the matrix (see eqn. (3) for the precise value of s)\nwith respect to these scores and solving the nuclear norm minimization problem\non the sampled entries, reconstructs A exactly. To the best of our knowledge,\nthese are the strongest theoretical guarantees on matrix completion without any\nincoherence assumptions on the matrix A. From an experimental perspective, we\nshow that entries corresponding to high element-wise leverage scores reveal\nstructural properties of the data matrix that are of interest to domain\nscientists.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2013 03:49:02 GMT"}, {"version": "v2", "created": "Sat, 14 Dec 2013 12:13:32 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["Kundu", "Abhisek", ""], ["Nambirajan", "Srinivas", ""], ["Drineas", "Petros", ""]]}, {"id": "1310.3564", "submitter": "Satoshi Hasegawa", "authors": "Satoshi Hasegawa, Hajime Anada, Shuya Kanagawa", "title": "Pursuit Fractal Analysis of Time-Series Data", "comments": "5pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this study, we present a method to measure changes over time of fractal\ndimension. We confirmed that our method can calculate the fractal dimension\nwith the same precision as conventional methods, and tracking performance of\nour method is higher than that of the conventional methods.\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2013 04:57:34 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["Hasegawa", "Satoshi", ""], ["Anada", "Hajime", ""], ["Kanagawa", "Shuya", ""]]}, {"id": "1310.4046", "submitter": "Petr Vabishchevich N.", "authors": "Petr N. Vabishchevich", "title": "Explicit schemes for parabolic and hyperbolic equations", "comments": "12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Standard explicit schemes for parabolic equations are not very convenient for\ncomputing practice due to the fact that they have strong restrictions on a time\nstep. More promising explicit schemes are associated with explicit-implicit\nsplitting of the problem operator (Saul'yev asymmetric schemes, explicit\nalternating direction (ADE) schemes, group explicit method). These schemes\nbelong to the class of unconditionally stable schemes, but they demonstrate bad\napproximation properties. These explicit schemes are treated as schemes of the\nalternating triangle method and can be considered as factorized schemes where\nthe problem operator is splitted into the sum of two operators that are adjoint\nto each other. Here we propose a multilevel modification of the alternating\ntriangle method, which demonstrates better properties in terms of accuracy. We\nalso consider explicit schemes of the alternating triangle method for the\nnumerical solution of boundary value problems for hyperbolic equations of\nsecond order. The study is based on the general theory of stability\n(well-posedness) for operator-difference schemes.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2013 13:20:52 GMT"}], "update_date": "2013-10-16", "authors_parsed": [["Vabishchevich", "Petr N.", ""]]}, {"id": "1310.4288", "submitter": "Ababu Teklemariam Tiruneh", "authors": "Ababu Teklemariam Tiruneh", "title": "Higher Order Aitken Extrapolation with Application to Converging and\n  Diverging Gauss-Seidel Iterations", "comments": "32 pages ; 8 figures ; 9 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Aitken extrapolation normally applied to convergent fixed point iteration is\nextended to extrapolate the solution of a divergent iteration. In addition,\nhigher order Aitken extrapolation is introduced that enables successive\ndecomposition of high Eigen values of the iteration matrix to enable\nconvergence. While extrapolation of a convergent fixed point iteration using a\ngeometric series sum is a known form of Aitken acceleration, it is shown in\nthis paper that the same formula can be used to estimate the solution of sets\nof linear equations from diverging Gauss Seidel iterations. In both convergent\nand divergent iterations, the ratios of differences among the consecutive\nvalues of iteration eventually form a convergent or divergent series with a\nfactor equal to the largest Eigen value of the iteration matrix. Higher order\nAitken extrapolation is shown to eliminate the influence of dominant Eigen\nvalues of the iteration matrix in successive order until the iteration is\ndetermined by the lowest possible Eigen value. For the convergent part of the\nGauss Seidel iteration, further acceleration is made possible by coupling of\nthe extrapolation technique with the successive over relaxation method.\nApplication examples from both convergent and divergent iterations have been\nprovided. Coupling of the extrapolation with the successive over relaxation\ntechnique is also illustrated for a steady state two dimensional heat flow\nproblem which was solved using MATLAB programming.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2013 07:46:42 GMT"}], "update_date": "2013-10-17", "authors_parsed": [["Tiruneh", "Ababu Teklemariam", ""]]}, {"id": "1310.4734", "submitter": "David \\v{S}afr\\'anek", "authors": "Lubos Brim and Milan Ceska and Sven Drazan and David Safranek", "title": "On Robustness Analysis of Stochastic Biochemical Systems by\n  Probabilistic Model Checking", "comments": "43 pages, 15 figures, technical report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.CE cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This report proposes a novel framework for a rigorous robustness analysis of\nstochastic biochemical systems. The technique is based on probabilistic model\nchecking. We adapt the general definition of robustness introduced by Kitano to\nthe class of stochastic systems modelled as continuous time Markov Chains in\norder to extensively analyse and compare robustness of biological models with\nuncertain parameters. The framework utilises novel computational methods that\nenable to effectively evaluate the robustness of models with respect to\nquantitative temporal properties and parameters such as reaction rate constants\nand initial conditions.\n  The framework is applied to gene regulation as an example of a central\nbiological mechanism where intrinsic and extrinsic stochasticity plays crucial\nrole due to low numbers of DNA and RNA molecules. Using our methods we have\nobtained a comprehensive and precise analysis of stochastic dynamics under\nparameter uncertainty. Furthermore, we apply our framework to compare several\nvariants of two-component signalling networks from the perspective of\nrobustness with respect to intrinsic noise caused by low populations of\nsignalling components. We succeeded to extend previous studies performed on\ndeterministic models (ODE) and show that stochasticity may significantly affect\nobtained predictions. Our case studies demonstrate that the framework can\nprovide deeper insight into the role of key parameters in maintaining the\nsystem functionality and thus it significantly contributes to formal methods in\ncomputational systems biology.\n", "versions": [{"version": "v1", "created": "Thu, 17 Oct 2013 15:00:14 GMT"}], "update_date": "2013-10-18", "authors_parsed": [["Brim", "Lubos", ""], ["Ceska", "Milan", ""], ["Drazan", "Sven", ""], ["Safranek", "David", ""]]}, {"id": "1310.4807", "submitter": "Sheng-Gwo Chen", "authors": "Sheng-Gwo Chen, Mei-Hsiu Chi and Jyh-Yang Wu", "title": "High-order algorithms for solving eigenproblems over discrete surfaces", "comments": "29pages, 19figures, 2tables. arXiv admin note: text overlap with\n  arXiv:1004.3486", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA math.NA physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The eigenvalue problem of the Laplace-Beltrami operators on curved surfaces\nplays an essential role in the convergence analysis of the numerical\nsimulations of some important geometric partial differential equations which\ninvolve this operator. In this note we shall combine the local tangential\nlifting (LTL) method with the configuration equation to develop a new effective\nand convergent algorithm to solve the eigenvalue problems of the\nLaplace-Beltrami operators acting on functions over discrete surfaces. The\nconvergence rates of our algorithms of discrete Laplace-Beltrami operators over\nsurfaces is $O(r^n)$, $n \\geq 1$, where $r$ represents the size of the mesh of\ndiscretization of the surface. The problem of high-order accuracies will also\nbe discussed and used to compute geometric invariants of the underlying\nsurfaces. Some convergence tests and eigenvalue computations on the sphere,\ntori and a dumbbell are presented.\n", "versions": [{"version": "v1", "created": "Wed, 16 Oct 2013 08:25:55 GMT"}], "update_date": "2013-10-18", "authors_parsed": [["Chen", "Sheng-Gwo", ""], ["Chi", "Mei-Hsiu", ""], ["Wu", "Jyh-Yang", ""]]}, {"id": "1310.5035", "submitter": "Zhouchen Lin", "authors": "Zhouchen Lin, Risheng Liu, Huan Li", "title": "Linearized Alternating Direction Method with Parallel Splitting and\n  Adaptive Penalty for Separable Convex Programs in Machine Learning", "comments": "Preliminary version published on Asian Conference on Machine Learning\n  2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA cs.LG math.OC stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many problems in machine learning and other fields can be (re)for-mulated as\nlinearly constrained separable convex programs. In most of the cases, there are\nmultiple blocks of variables. However, the traditional alternating direction\nmethod (ADM) and its linearized version (LADM, obtained by linearizing the\nquadratic penalty term) are for the two-block case and cannot be naively\ngeneralized to solve the multi-block case. So there is great demand on\nextending the ADM based methods for the multi-block case. In this paper, we\npropose LADM with parallel splitting and adaptive penalty (LADMPSAP) to solve\nmulti-block separable convex programs efficiently. When all the component\nobjective functions have bounded subgradients, we obtain convergence results\nthat are stronger than those of ADM and LADM, e.g., allowing the penalty\nparameter to be unbounded and proving the sufficient and necessary conditions}\nfor global convergence. We further propose a simple optimality measure and\nreveal the convergence rate of LADMPSAP in an ergodic sense. For programs with\nextra convex set constraints, with refined parameter estimation we devise a\npractical version of LADMPSAP for faster convergence. Finally, we generalize\nLADMPSAP to handle programs with more difficult objective functions by\nlinearizing part of the objective function as well. LADMPSAP is particularly\nsuitable for sparse representation and low-rank recovery problems because its\nsubproblems have closed form solutions and the sparsity and low-rankness of the\niterates can be preserved during the iteration. It is also highly\nparallelizable and hence fits for parallel or distributed computing. Numerical\nexperiments testify to the advantages of LADMPSAP in speed and numerical\naccuracy.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2013 14:31:08 GMT"}, {"version": "v2", "created": "Thu, 29 May 2014 02:14:13 GMT"}], "update_date": "2014-05-30", "authors_parsed": [["Lin", "Zhouchen", ""], ["Liu", "Risheng", ""], ["Li", "Huan", ""]]}, {"id": "1310.5207", "submitter": "Varun Shankar", "authors": "Varun Shankar, Grady B. Wright, Aaron L. Fogelson and Robert M. Kirby", "title": "A Radial Basis Function (RBF)-Finite Difference Method for the\n  Simulation of Reaction-Diffusion Equations on Stationary Platelets within the\n  Augmented Forcing Method", "comments": "27 pages, 7 figures, 9 tables", "journal-ref": "International Journal for Numerical Methods in Fluids, Volume 75,\n  1,1-22, 2014", "doi": "10.1002/fld.3880", "report-no": null, "categories": "math.NA cs.CE cs.NA q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a computational method for solving the coupled problem of chemical\ntransport in a fluid (blood) with binding/unbinding of the chemical to/from\ncellular (platelet) surfaces in contact with the fluid, and with transport of\nthe chemical on the cellular surfaces. The overall framework is the Augmented\nForcing Point Method (AFM) (\\emph{L. Yao and A.L. Fogelson, Simulations of\nchemical transport and reaction in a suspension of cells I: An augmented\nforcing point method for the stationary case, IJNMF (2012) 69, 1736-52.}) for\nsolving fluid-phase transport in a region outside of a collection of cells\nsuspended in the fluid. We introduce a novel Radial Basis Function-Finite\nDifference (RBF-FD) method to solve reaction-diffusion equations on the surface\nof each of a collection of 2D stationary platelets suspended in blood.\nParametric RBFs are used to represent the geometry of the platelets and give\naccurate geometric information needed for the RBF-FD method. Symmetric\nHermite-RBF interpolants are used for enforcing the boundary conditions on the\nfluid-phase chemical concentration, and their use removes a significant\nlimitation of the original AFM. The efficacy of the new methods are shown\nthrough a series of numerical experiments; in particular, second order\nconvergence for the coupled problem is demonstrated.\n", "versions": [{"version": "v1", "created": "Sat, 19 Oct 2013 07:50:24 GMT"}, {"version": "v2", "created": "Mon, 21 Sep 2015 20:04:56 GMT"}], "update_date": "2015-09-23", "authors_parsed": [["Shankar", "Varun", ""], ["Wright", "Grady B.", ""], ["Fogelson", "Aaron L.", ""], ["Kirby", "Robert M.", ""]]}, {"id": "1310.5573", "submitter": "Adrian Sandu", "authors": "Adrian Sandu and Michael Guenther", "title": "A class of generalized additive Runge-Kutta methods", "comments": null, "journal-ref": null, "doi": null, "report-no": "Computational Science Laboratory CSL-TR-5/2013", "categories": "cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work generalizes the additively partitioned Runge-Kutta methods by\nallowing for different stage values as arguments of different components of the\nright hand side. An order conditions theory is developed for the new family of\ngeneralized additive methods, and stability and monotonicity investigations are\ncarried out. The paper discusses the construction and properties of\nimplicit-explicit and implicit-implicit,methods in the new framework. The new\nfamily, named GARK, introduces additional flexibility when compared to\ntraditional partitioned Runge-Kutta methods, and therefore offers additional\nopportunities for the development of flexible solvers for systems with multiple\nscales, or driven by multiple physical processes.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2013 14:44:22 GMT"}], "update_date": "2013-10-22", "authors_parsed": [["Sandu", "Adrian", ""], ["Guenther", "Michael", ""]]}, {"id": "1310.6055", "submitter": "Adrian Sandu", "authors": "Michael Guenther and Adrian Sandu", "title": "Multirate generalized additive Runge Kutta methods", "comments": null, "journal-ref": null, "doi": null, "report-no": "Computational Science Laboratory Technical Report CSL-TR-6/2013", "categories": "cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work constructs a new class of multirate schemes based on the recently\ndeveloped generalized additive Runge-Kutta (GARK) methods (Sandu and Guenther,\n2013). Multirate schemes use different step sizes for different components and\nfor different partitions of the right-hand side based on the local activity\nlevels. We show that the new multirate GARK family includes many well-known\nmultirate schemes as special cases. The order conditions theory follows\ndirectly from the GARK accuracy theory. Nonlinear stability and monotonicity\ninvestigations show that these properties are inherited from the base schemes\nprovided that additional coupling conditions hold.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2013 20:49:26 GMT"}], "update_date": "2013-10-24", "authors_parsed": [["Guenther", "Michael", ""], ["Sandu", "Adrian", ""]]}, {"id": "1310.7202", "submitter": "Gil Shabat", "authors": "Gil Shabat, Yaniv Shmueli, Yariv Aizenbud, Amir Averbuch", "title": "Randomized LU Decomposition", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a fast randomized algorithm that computes a low rank LU\ndecomposition. Our algorithm uses random projections type techniques to\nefficiently compute a low rank approximation of large matrices. The randomized\nLU algorithm can be parallelized and further accelerated by using sparse random\nmatrices in its projection step. Several different error bounds are proven for\nthe algorithm approximations. To prove these bounds, recent results from random\nmatrix theory related to subgaussian matrices are used. As an application, we\nalso show how the algorithm can be utilized to solve problems such as the\nrank-deficient least squares problem. Numerical examples, which illustrate the\nperformance of the algorithm and compare it to other decomposition methods, are\npresented.\n", "versions": [{"version": "v1", "created": "Sun, 27 Oct 2013 14:55:29 GMT"}, {"version": "v2", "created": "Wed, 30 Oct 2013 08:28:50 GMT"}, {"version": "v3", "created": "Tue, 17 Mar 2015 16:20:57 GMT"}, {"version": "v4", "created": "Sat, 30 Jan 2016 09:57:12 GMT"}], "update_date": "2016-02-02", "authors_parsed": [["Shabat", "Gil", ""], ["Shmueli", "Yaniv", ""], ["Aizenbud", "Yariv", ""], ["Averbuch", "Amir", ""]]}, {"id": "1310.7215", "submitter": "Dmytro Iatsenko", "authors": "Dmytro Iatsenko, Peter V. E. McClintock, Aneta Stefanovska", "title": "Linear and synchrosqueezed time-frequency representations revisited.\n  Part I: Overview, standards of use, related issues and algorithms", "comments": "45 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Time-frequency representations (TFRs) of signals, such as the windowed\nFourier transform (WFT), wavelet transform (WT) and their synchrosqueezed\nvariants (SWFT, SWT), provide powerful analysis tools. However, there are many\nimportant issues related to the practical use of TFRs that need to be\nclarified. Here we present a thorough review of these TFRs, summarizing all\ntheoretical, practical and numerical aspects of their use, reconsidering some\nconventions and introducing new concepts and procedures. The purposes of this\nwork are: (i) to provide a consistent overview of the computation, properties,\nand use of the (S)WFT/(S)WT methods; (ii) to establish general standards\nrelated to their use, both theoretical and practical; and (iii) to provide\nclean and optimized algorithms and MatLab codes, appropriate for any window or\nwavelet.\n", "versions": [{"version": "v1", "created": "Sun, 27 Oct 2013 17:12:10 GMT"}, {"version": "v2", "created": "Sun, 25 May 2014 23:37:00 GMT"}], "update_date": "2014-05-27", "authors_parsed": [["Iatsenko", "Dmytro", ""], ["McClintock", "Peter V. E.", ""], ["Stefanovska", "Aneta", ""]]}, {"id": "1310.7274", "submitter": "Dmytro Iatsenko", "authors": "Dmytro Iatsenko, Peter V. E. McClintock, Aneta Stefanovska", "title": "Linear and synchrosqueezed time-frequency representations revisited.\n  Part II: Resolution, reconstruction and concentration", "comments": "39 pages, 28 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Having reviewed the aspects of the linear and synchrosqueezed time-frequency\nrepresentations (TFRs) needed for their understanding and correct use in Part I\nof this review, we now consider three more subtle issues that are nonetheless\nof crucial importance for effective application of these methods. (i) What\neffect do the window/wavelet parameters have on the resultant TFR, and how can\nthey most appropriately be chosen? (ii) What are the errors inherent in the two\nreconstruction methods (direct and ridge) and which of them is the better?\n(iii) What are the advantages and drawbacks associated with synchrosqueezing?\nTo answer these questions, we perform a detailed numerical and theoretical\nstudy of the TFRs under consideration. We consider the relevant estimates in\nthe presence of the complications that arise in practical applications\nincluding interference between components, amplitude modulation, frequency\nmodulation, and noise. Taken together, the results provide an in-depth\nunderstanding of the issues in question.\n", "versions": [{"version": "v1", "created": "Sun, 27 Oct 2013 23:30:24 GMT"}, {"version": "v2", "created": "Mon, 26 May 2014 00:54:34 GMT"}], "update_date": "2014-05-27", "authors_parsed": [["Iatsenko", "Dmytro", ""], ["McClintock", "Peter V. E.", ""], ["Stefanovska", "Aneta", ""]]}, {"id": "1310.7552", "submitter": "Yuxin Chen", "authors": "Yuxin Chen and Yonina C. Eldar and Andrea J. Goldsmith", "title": "An Algorithm for Exact Super-resolution and Phase Retrieval", "comments": "accepted to IEEE ICASSP 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NA math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore a fundamental problem of super-resolving a signal of interest from\na few measurements of its low-pass magnitudes. We propose a 2-stage tractable\nalgorithm that, in the absence of noise, admits perfect super-resolution of an\n$r$-sparse signal from $2r^2-2r+2$ low-pass magnitude measurements. The spike\nlocations of the signal can assume any value over a continuous disk, without\nincreasing the required sample size. The proposed algorithm first employs a\nconventional super-resolution algorithm (e.g. the matrix pencil approach) to\nrecover unlabeled sets of signal correlation coefficients, and then applies a\nsimple sorting algorithm to disentangle and retrieve the true parameters in a\ndeterministic manner. Our approach can be adapted to multi-dimensional spike\nmodels and random Fourier sampling by replacing its first step with other\nharmonic retrieval algorithms.\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2013 19:46:14 GMT"}, {"version": "v2", "created": "Fri, 7 Mar 2014 18:18:30 GMT"}], "update_date": "2014-03-10", "authors_parsed": [["Chen", "Yuxin", ""], ["Eldar", "Yonina C.", ""], ["Goldsmith", "Andrea J.", ""]]}, {"id": "1310.7697", "submitter": "Anne Auger", "authors": "Anne Auger (TAO), Nikolaus Hansen (TAO)", "title": "Linear Convergence of Comparison-based Step-size Adaptive Randomized\n  Search via Stability of Markov Chains", "comments": "SIAM Journal on Optimization, Society for Industrial and Applied\n  Mathematics, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider comparison-based adaptive stochastic algorithms\nfor solving numerical optimisation problems. We consider a specific subclass of\nalgorithms that we call comparison-based step-size adaptive randomized search\n(CB-SARS), where the state variables at a given iteration are a vector of the\nsearch space and a positive parameter, the step-size, typically controlling the\noverall standard deviation of the underlying search distribution.We investigate\nthe linear convergence of CB-SARS on\\emph{scaling-invariant} objective\nfunctions. Scaling-invariantfunctions preserve the ordering of points with\nrespect to their functionvalue when the points are scaled with the same\npositive parameter (thescaling is done w.r.t. a fixed reference point). This\nclass offunctions includes norms composed with strictly increasing functions\naswell as many non quasi-convex and non-continuousfunctions. On\nscaling-invariant functions, we show the existence of ahomogeneous Markov\nchain, as a consequence of natural invarianceproperties of CB-SARS (essentially\nscale-invariance and invariance tostrictly increasing transformation of the\nobjective function). We thenderive sufficient conditions for \\emph{global\nlinear convergence} ofCB-SARS, expressed in terms of different stability\nconditions of thenormalised homogeneous Markov chain (irreducibility,\npositivity, Harrisrecurrence, geometric ergodicity) and thus define a general\nmethodologyfor proving global linear convergence of CB-SARS algorithms\nonscaling-invariant functions. As a by-product we provide aconnexion between\ncomparison-based adaptive stochasticalgorithms and Markov chain Monte Carlo\nalgorithms.\n", "versions": [{"version": "v1", "created": "Tue, 29 Oct 2013 06:54:29 GMT"}, {"version": "v2", "created": "Fri, 1 Nov 2013 16:54:50 GMT"}, {"version": "v3", "created": "Fri, 25 Apr 2014 14:27:45 GMT"}, {"version": "v4", "created": "Mon, 12 May 2014 14:11:34 GMT"}, {"version": "v5", "created": "Mon, 4 Jan 2016 10:15:24 GMT"}, {"version": "v6", "created": "Thu, 2 Jun 2016 15:55:57 GMT"}], "update_date": "2016-06-03", "authors_parsed": [["Auger", "Anne", "", "TAO"], ["Hansen", "Nikolaus", "", "TAO"]]}, {"id": "1310.7708", "submitter": "Tomoaki Okayama", "authors": "Tomoaki Okayama", "title": "Theoretical analysis of a Sinc-Nystr\\\"om method for Volterra\n  integro-differential equations and its improvement", "comments": "Keywords: Sinc numerical method, initial value problem, convergence\n  analysis, tanh transformation, double-exponential transformation", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A Sinc-Nystr\\\"om method for Volterra integro-differential equations was\ndeveloped by Zarebnia in 2010. The method is quite efficient in the sense that\nexponential convergence can be obtained even if the given problem has endpoint\nsingularity. However, its exponential convergence has not been proved\ntheoretically. In addition, to implement the method, the regularity of the\nsolution is required, although the solution is an unknown function in practice.\nThis paper reinforces the method by presenting two theoretical results: 1) the\nregularity of the solution is analyzed, and 2) its convergence rate is\nrigorously analyzed. Moreover, this paper improves the method so that a much\nhigher convergence rate can be attained, and theoretical results similar to\nthose listed above are provided. Numerical comparisons are also provided.\n", "versions": [{"version": "v1", "created": "Tue, 29 Oct 2013 08:32:32 GMT"}, {"version": "v2", "created": "Wed, 21 May 2014 23:57:11 GMT"}, {"version": "v3", "created": "Fri, 18 Nov 2016 05:37:33 GMT"}, {"version": "v4", "created": "Mon, 27 Mar 2017 06:53:03 GMT"}, {"version": "v5", "created": "Wed, 19 Jul 2017 09:17:00 GMT"}, {"version": "v6", "created": "Mon, 2 Oct 2017 07:45:09 GMT"}], "update_date": "2017-10-03", "authors_parsed": [["Okayama", "Tomoaki", ""]]}, {"id": "1310.8121", "submitter": "Aubrey Jaffer", "authors": "Aubrey Jaffer", "title": "Easy Accurate Reading and Writing of Floating-Point Numbers", "comments": "8 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Presented here are algorithms for converting between (decimal)\nscientific-notation and (binary) IEEE-754 double-precision floating-point\nnumbers. By employing a rounding integer quotient operation these algorithms\nare much simpler than those previously published. The values are stable under\nrepeated conversions between the formats. Unlike Java-1.8, the scientific\nrepresentations generated use only the minimum number of mantissa digits needed\nto convert back to the original binary values.\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2013 00:01:26 GMT"}, {"version": "v2", "created": "Sat, 17 May 2014 00:26:24 GMT"}, {"version": "v3", "created": "Wed, 21 May 2014 03:01:37 GMT"}, {"version": "v4", "created": "Sat, 24 May 2014 02:33:09 GMT"}, {"version": "v5", "created": "Sun, 4 Jan 2015 03:59:03 GMT"}, {"version": "v6", "created": "Fri, 9 Jan 2015 03:26:06 GMT"}, {"version": "v7", "created": "Tue, 7 Aug 2018 13:35:22 GMT"}], "update_date": "2018-08-08", "authors_parsed": [["Jaffer", "Aubrey", ""]]}, {"id": "1310.8397", "submitter": "Anne Auger", "authors": "Anne Auger (INRIA Saclay - Ile de France), Nikolaus Hansen (INRIA\n  Saclay - Ile de France)", "title": "Linear Convergence on Positively Homogeneous Functions of a Comparison\n  Based Step-Size Adaptive Randomized Search: the (1+1) ES with Generalized\n  One-fifth Success Rule", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the context of unconstraint numerical optimization, this paper\ninvestigates the global linear convergence of a simple probabilistic\nderivative-free optimization algorithm (DFO). The algorithm samples a candidate\nsolution from a standard multivariate normal distribution scaled by a step-size\nand centered in the current solution. This solution is accepted if it has a\nbetter objective function value than the current one. Crucial to the algorithm\nis the adaptation of the step-size that is done in order to maintain a certain\nprobability of success. The algorithm, already proposed in the 60's, is a\ngeneralization of the well-known Rechenberg's $(1+1)$ Evolution Strategy (ES)\nwith one-fifth success rule which was also proposed by Devroye under the name\ncompound random search or by Schumer and Steiglitz under the name step-size\nadaptive random search. In addition to be derivative-free, the algorithm is\nfunction-value-free: it exploits the objective function only through\ncomparisons. It belongs to the class of comparison-based step-size adaptive\nrandomized search (CB-SARS). For the convergence analysis, we follow the\nmethodology developed in a companion paper for investigating linear convergence\nof CB-SARS: by exploiting invariance properties of the algorithm, we turn the\nstudy of global linear convergence on scaling-invariant functions into the\nstudy of the stability of an underlying normalized Markov chain (MC). We hence\nprove global linear convergence by studying the stability (irreducibility,\nrecurrence, positivity, geometric ergodicity) of the normalized MC associated\nto the $(1+1)$-ES. More precisely, we prove that starting from any initial\nsolution and any step-size, linear convergence with probability one and in\nexpectation occurs. Our proof holds on unimodal functions that are the\ncomposite of strictly increasing functions by positively homogeneous functions\nwith degree $\\alpha$ (assumed also to be continuously differentiable). This\nfunction class includes composite of norm functions but also non-quasi convex\nfunctions. Because of the composition by a strictly increasing function, it\nincludes non continuous functions. We find that a sufficient condition for\nglobal linear convergence is the step-size increase on linear functions, a\ncondition typically satisfied for standard parameter choices. While introduced\nmore than 40 years ago, we provide here the first proof of global linear\nconvergence for the $(1+1)$-ES with generalized one-fifth success rule and the\nfirst proof of linear convergence for a CB-SARS on such a class of functions\nthat includes non-quasi convex and non-continuous functions. Our proof also\nholds on functions where linear convergence of some CB-SARS was previously\nproven, namely convex-quadratic functions (including the well-know sphere\nfunction).\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 06:38:56 GMT"}], "update_date": "2013-11-01", "authors_parsed": [["Auger", "Anne", "", "INRIA Saclay - Ile de France"], ["Hansen", "Nikolaus", "", "INRIA\n  Saclay - Ile de France"]]}, {"id": "1310.8455", "submitter": "Georg Regensburger", "authors": "Anja Korporal, Georg Regensburger", "title": "Composing and Factoring Generalized Green's Operators and Ordinary\n  Boundary Problems", "comments": "19 pages", "journal-ref": "AADIOS 2012, LNCS 8372, pp. 116-134, 2014", "doi": "10.1007/978-3-642-54479-8_5", "report-no": null, "categories": "cs.SC cs.MS cs.NA math.CA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider solution operators of linear ordinary boundary problems with \"too\nmany\" boundary conditions, which are not always solvable. These generalized\nGreen's operators are a certain kind of generalized inverses of differential\noperators. We answer the question when the product of two generalized Green's\noperators is again a generalized Green's operator for the product of the\ncorresponding differential operators and which boundary problem it solves.\nMoreover, we show that---provided a factorization of the underlying\ndifferential operator---a generalized boundary problem can be factored into\nlower order problems corresponding to a factorization of the respective Green's\noperators. We illustrate our results by examples using the Maple package\nIntDiffOp, where the presented algorithms are implemented.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 10:56:22 GMT"}], "update_date": "2014-06-27", "authors_parsed": [["Korporal", "Anja", ""], ["Regensburger", "Georg", ""]]}, {"id": "1310.8573", "submitter": "Benjamin Ricaud", "authors": "Benjamin Ricaud and Guillaume Stempfel and Bruno Torr\\'esani and\n  Christoph Wiesmeyr and H\\'el\\`ene Lachambre and Darian Onchis", "title": "An optimally concentrated Gabor transform for localized time-frequency\n  components", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gabor analysis is one of the most common instances of time-frequency signal\nanalysis. Choosing a suitable window for the Gabor transform of a signal is\noften a challenge for practical applications, in particular in audio signal\nprocessing. Many time-frequency (TF) patterns of different shapes may be\npresent in a signal and they can not all be sparsely represented in the same\nspectrogram. We propose several algorithms, which provide optimal windows for a\nuser-selected TF pattern with respect to different concentration criteria. We\nbase our optimization algorithm on $l^p$-norms as measure of TF spreading. For\na given number of sampling points in the TF plane we also propose optimal\nlattices to be used with the obtained windows. We illustrate the potentiality\nof the method on selected numerical examples.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 16:25:25 GMT"}, {"version": "v2", "created": "Tue, 12 Nov 2013 09:48:46 GMT"}], "update_date": "2013-11-13", "authors_parsed": [["Ricaud", "Benjamin", ""], ["Stempfel", "Guillaume", ""], ["Torrésani", "Bruno", ""], ["Wiesmeyr", "Christoph", ""], ["Lachambre", "Hélène", ""], ["Onchis", "Darian", ""]]}]