[{"id": "0803.0398", "submitter": "Andrea Baronchelli", "authors": "Andrea Baronchelli, Vittorio Loreto, Luc Steels", "title": "In-depth analysis of the Naming Game dynamics: the homogeneous mixing\n  case", "comments": "30 pages, 19 figures (few in reduced definition). In press in IJMPC", "journal-ref": "Int. J. Mod. Phys. C 19, 785 (2008)", "doi": "10.1142/S0129183108012522", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Language emergence and evolution has recently gained growing attention\nthrough multi-agent models and mathematical frameworks to study their behavior.\nHere we investigate further the Naming Game, a model able to account for the\nemergence of a shared vocabulary of form-meaning associations through\nsocial/cultural learning. Due to the simplicity of both the structure of the\nagents and their interaction rules, the dynamics of this model can be analyzed\nin great detail using numerical simulations and analytical arguments. This\npaper first reviews some existing results and then presents a new overall\nunderstanding.\n", "versions": [{"version": "v1", "created": "Tue, 4 Mar 2008 13:35:28 GMT"}], "update_date": "2008-07-21", "authors_parsed": [["Baronchelli", "Andrea", ""], ["Loreto", "Vittorio", ""], ["Steels", "Luc", ""]]}, {"id": "0803.1596", "submitter": "Uwe Aickelin", "authors": "Helen Celia, Christopher Clegg, Mark Robinson, Peer-Olaf Siebers, Uwe\n  Aickelin and Christine Sprigg", "title": "Using Intelligent Agents to understand organisational behaviour", "comments": null, "journal-ref": "Proceedings of the British Psychology Society Annual Conference,\n  Occupational Psychology Division (BPS 2007), Bristol, UK 2007", "doi": null, "report-no": null, "categories": "cs.NE cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces two ongoing research projects which seek to apply\ncomputer modelling techniques in order to simulate human behaviour within\norganisations. Previous research in other disciplines has suggested that\ncomplex social behaviours are governed by relatively simple rules which, when\nidentified, can be used to accurately model such processes using computer\ntechnology. The broad objective of our research is to develop a similar\ncapability within organisational psychology.\n", "versions": [{"version": "v1", "created": "Tue, 11 Mar 2008 14:19:33 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Celia", "Helen", ""], ["Clegg", "Christopher", ""], ["Robinson", "Mark", ""], ["Siebers", "Peer-Olaf", ""], ["Aickelin", "Uwe", ""], ["Sprigg", "Christine", ""]]}, {"id": "0803.1604", "submitter": "Uwe Aickelin", "authors": "Peer-Olaf Siebers, Uwe Aickelin, Helen Celia and Christopher Clegg", "title": "Using Intelligent Agents to Understand Management Practices and Retail\n  Productivity", "comments": null, "journal-ref": "Proceedings of the Winter Simulation Conference (WSC 2007), pp\n  2212-2220, Washington, USA 2007", "doi": null, "report-no": null, "categories": "cs.NE cs.CE cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intelligent agents offer a new and exciting way of understanding the world of\nwork. In this paper we apply agent-based modeling and simulation to investigate\na set of problems in a retail context. Specifically, we are working to\nunderstand the relationship between human resource management practices and\nretail productivity. Despite the fact we are working within a relatively novel\nand complex domain, it is clear that intelligent agents could offer potential\nfor fostering sustainable organizational capabilities in the future. The\nproject is still at an early stage. So far we have conducted a case study in a\nUK department store to collect data and capture impressions about operations\nand actors within departments. Furthermore, based on our case study we have\nbuilt and tested our first version of a retail branch simulator which we will\npresent in this paper.\n", "versions": [{"version": "v1", "created": "Tue, 11 Mar 2008 14:55:58 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Siebers", "Peer-Olaf", ""], ["Aickelin", "Uwe", ""], ["Celia", "Helen", ""], ["Clegg", "Christopher", ""]]}, {"id": "0803.1621", "submitter": "Uwe Aickelin", "authors": "Peer-Olaf Siebers, Uwe Aickelin, Helen Celia and Christopher Clegg", "title": "An Agent-Based Simulation of In-Store Customer Experiences", "comments": null, "journal-ref": "Operational Research Society 4th Simulation Workshop (SW08), in\n  print, pp, Worcestershire, UK 2008", "doi": null, "report-no": null, "categories": "cs.NE cs.CE cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Agent-based modelling and simulation offers a new and exciting way of\nunderstanding the world of work. In this paper we describe the development of\nan agent-based simulation model, designed to help to understand the\nrelationship between human resource management practices and retail\nproductivity. We report on the current development of our simulation model\nwhich includes new features concerning the evolution of customers over time. To\ntest some of these features we have conducted a series of experiments dealing\nwith customer pool sizes, standard and noise reduction modes, and the spread of\nthe word of mouth. Our multi-disciplinary research team draws upon expertise\nfrom work psychologists and computer scientists. Despite the fact we are\nworking within a relatively novel and complex domain, it is clear that\nintelligent agents offer potential for fostering sustainable organisational\ncapabilities in the future.\n", "versions": [{"version": "v1", "created": "Tue, 11 Mar 2008 16:11:34 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Siebers", "Peer-Olaf", ""], ["Aickelin", "Uwe", ""], ["Celia", "Helen", ""], ["Clegg", "Christopher", ""]]}, {"id": "0803.2306", "submitter": "Valentin Goranko", "authors": "Valentin Goranko and Dmitry Shkatov", "title": "Tableau-based decision procedures for logics of strategic ability in\n  multi-agent systems", "comments": "To appear in ACM Transactions on Computational Logic. 48 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LO cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an incremental tableau-based decision procedures for the\n  Alternating-time temporal logic ATL and some of its variants.\n  While running within the theoretically established complexity upper bound, we\nclaim that our tableau is practically more efficient in the average case than\nother decision procedures for ATL known so far. Besides, the ease of its\nadaptation to variants of ATL demonstrates the flexibility of the proposed\nprocedure.\n", "versions": [{"version": "v1", "created": "Sat, 15 Mar 2008 16:22:53 GMT"}, {"version": "v2", "created": "Tue, 9 Sep 2008 10:53:22 GMT"}], "update_date": "2008-09-09", "authors_parsed": [["Goranko", "Valentin", ""], ["Shkatov", "Dmitry", ""]]}, {"id": "0803.3905", "submitter": "Uwe Aickelin", "authors": "Peer-Olaf Siebers and Uwe Aickelin", "title": "Introduction to Multi-Agent Simulation", "comments": null, "journal-ref": "Encyclopaedia of Decision Making and Decision Support\n  Technologies, 554-564, 2008", "doi": null, "report-no": null, "categories": "cs.NE cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When designing systems that are complex, dynamic and stochastic in nature,\nsimulation is generally recognised as one of the best design support\ntechnologies, and a valuable aid in the strategic and tactical decision making\nprocess. A simulation model consists of a set of rules that define how a system\nchanges over time, given its current state. Unlike analytical models, a\nsimulation model is not solved but is run and the changes of system states can\nbe observed at any point in time. This provides an insight into system dynamics\nrather than just predicting the output of a system based on specific inputs.\nSimulation is not a decision making tool but a decision support tool, allowing\nbetter informed decisions to be made. Due to the complexity of the real world,\na simulation model can only be an approximation of the target system. The\nessence of the art of simulation modelling is abstraction and simplification.\nOnly those characteristics that are important for the study and analysis of the\ntarget system should be included in the simulation model.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2008 12:38:17 GMT"}], "update_date": "2013-05-30", "authors_parsed": [["Siebers", "Peer-Olaf", ""], ["Aickelin", "Uwe", ""]]}, {"id": "0803.3912", "submitter": "Uwe Aickelin", "authors": "Uwe Aickelin and Dipankar Dasgupta", "title": "Artificial Immune Systems Tutorial", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The biological immune system is a robust, complex, adaptive system that\ndefends the body from foreign pathogens. It is able to categorize all cells (or\nmolecules) within the body as self-cells or non-self cells. It does this with\nthe help of a distributed task force that has the intelligence to take action\nfrom a local and also a global perspective using its network of chemical\nmessengers for communication. There are two major branches of the immune\nsystem. The innate immune system is an unchanging mechanism that detects and\ndestroys certain invading organisms, whilst the adaptive immune system responds\nto previously unknown foreign cells and builds a response to them that can\nremain in the body over a long period of time. This remarkable information\nprocessing biological system has caught the attention of computer science in\nrecent years. A novel computational intelligence technique, inspired by\nimmunology, has emerged, called Artificial Immune Systems. Several concepts\nfrom the immune have been extracted and applied for solution to real world\nscience and engineering problems. In this tutorial, we briefly describe the\nimmune system metaphors that are relevant to existing Artificial Immune Systems\nmethods. We will then show illustrative real-world problems suitable for\nArtificial Immune Systems and give a step-by-step algorithm walkthrough for one\nsuch problem. A comparison of the Artificial Immune Systems to other well-known\nalgorithms, areas for future work, tips & tricks and a list of resources will\nround this tutorial off. It should be noted that as Artificial Immune Systems\nis still a young and evolving field, there is not yet a fixed algorithm\ntemplate and hence actual implementations might differ somewhat from time to\ntime and from those examples given here.\n", "versions": [{"version": "v1", "created": "Thu, 27 Mar 2008 12:55:59 GMT"}], "update_date": "2010-07-05", "authors_parsed": [["Aickelin", "Uwe", ""], ["Dasgupta", "Dipankar", ""]]}]