[{"id": "1207.0559", "submitter": "EPTCS", "authors": "Herbert Wiklicky, Mieke Massink", "title": "Proceedings 10th Workshop on Quantitative Aspects of Programming\n  Languages and Systems", "comments": "EPTCS 85, 2012", "journal-ref": null, "doi": "10.4204/EPTCS.85", "report-no": null, "categories": "cs.PL cs.LO cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This volume contains the proceedings of the Tenth Workshop on Quantitative\nAspects of Programming Languages (QAPL 2012), held in Tallin, Estonia, on March\n31 and April 1, 2012. QAPL 2012 is a satellite event of the European Joint\nConferences on Theory and Practice of Software (ETAPS 2012). The workshop theme\nis on quantitative aspects of computation. These aspects are related to the use\nof physical quantities (storage space, time, bandwidth, etc.) as well as\nmathematical quantities (e.g. probability and measures for reliability,\nsecurity and trust), and play an important (sometimes essential) role in\ncharacterising the behavior and determining the properties of systems. Such\nquantities are central to the definition of both the model of systems\n(architecture, language design, semantics) and the methodologies and tools for\nthe analysis and verification of the systems properties. The aim of this\nworkshop is to discuss the explicit use of quantitative information such as\ntime and probabilities either directly in the model or as a tool for the\nanalysis of systems.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2012 01:24:57 GMT"}], "update_date": "2012-07-04", "authors_parsed": [["Wiklicky", "Herbert", ""], ["Massink", "Mieke", ""]]}, {"id": "1207.0873", "submitter": "EPTCS", "authors": "Luca Bortolussi (University of Trieste), Vashti Galpin (University of\n  Edinburgh), Jane Hillston (University of Edinburgh)", "title": "Hybrid performance modelling of opportunistic networks", "comments": "In Proceedings QAPL 2012, arXiv:1207.0559", "journal-ref": "EPTCS 85, 2012, pp. 106-121", "doi": "10.4204/EPTCS.85.8", "report-no": null, "categories": "cs.SY cs.LO cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate the modelling of opportunistic networks using the process\nalgebra stochastic HYPE. Network traffic is modelled as continuous flows,\ncontact between nodes in the network is modelled stochastically, and\ninstantaneous decisions are modelled as discrete events. Our model describes a\nnetwork of stationary video sensors with a mobile ferry which collects data\nfrom the sensors and delivers it to the base station. We consider different\nmobility models and different buffer sizes for the ferries. This case study\nillustrates the flexibility and expressive power of stochastic HYPE. We also\ndiscuss the software that enables us to describe stochastic HYPE models and\nsimulate them.\n", "versions": [{"version": "v1", "created": "Wed, 4 Jul 2012 01:25:04 GMT"}], "update_date": "2012-07-05", "authors_parsed": [["Bortolussi", "Luca", "", "University of Trieste"], ["Galpin", "Vashti", "", "University of\n  Edinburgh"], ["Hillston", "Jane", "", "University of Edinburgh"]]}, {"id": "1207.1469", "submitter": "Jun Wang", "authors": "Jun Wang, Jianshu Chen, Danijela Cabric", "title": "Cramer-Rao Bounds for Joint RSS/DoA-Based Primary-User Localization in\n  Cognitive Radio Networks", "comments": "20 pages, 11 figures, 1 table, submitted to IEEE Transactions on\n  Wireless Communications", "journal-ref": null, "doi": "10.1109/TWC.2013.012513.120966", "report-no": null, "categories": "cs.PF cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Knowledge about the location of licensed primary-users (PU) could enable\nseveral key features in cognitive radio (CR) networks including improved\nspatio-temporal sensing, intelligent location-aware routing, as well as aiding\nspectrum policy enforcement. In this paper we consider the achievable accuracy\nof PU localization algorithms that jointly utilize received-signal-strength\n(RSS) and direction-of-arrival (DoA) measurements by evaluating the Cramer-Rao\nBound (CRB). Previous works evaluate the CRB for RSS-only and DoA-only\nlocalization algorithms separately and assume DoA estimation error variance is\na fixed constant or rather independent of RSS. We derive the CRB for joint\nRSS/DoA-based PU localization algorithms based on the mathematical model of DoA\nestimation error variance as a function of RSS, for a given CR placement. The\nbound is compared with practical localization algorithms and the impact of\nseveral key parameters, such as number of nodes, number of antennas and\nsamples, channel shadowing variance and correlation distance, on the achievable\naccuracy are thoroughly analyzed and discussed. We also derive the closed-form\nasymptotic CRB for uniform random CR placement, and perform theoretical and\nnumerical studies on the required number of CRs such that the asymptotic CRB\ntightly approximates the numerical integration of the CRB for a given\nplacement.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2012 21:47:33 GMT"}], "update_date": "2016-11-18", "authors_parsed": [["Wang", "Jun", ""], ["Chen", "Jianshu", ""], ["Cabric", "Danijela", ""]]}, {"id": "1207.1746", "submitter": "Mauro Bianco", "authors": "Mauro Bianco, Ugo Varetto", "title": "A Generic Library for Stencil Computations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MS cs.DC cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this era of diverse and heterogeneous computer architectures, the\nprogrammability issues, such as productivity and portable efficiency, are\ncrucial to software development and algorithm design. One way to approach the\nproblem is to step away from traditional sequential programming languages and\nmove toward domain specific programming environments to balance between\nexpressivity and efficiency. In order to demonstrate this principle, we\ndeveloped a domain specific C++ generic library for stencil computations, like\nPDE solvers. The library features high level constructs to specify computation\nand allows the development of parallel stencil computations with very limited\neffort. The high abstraction constructs (like do_all and do_reduce) make the\nprogram shorter and cleaner with increased contextual information for better\nperformance exploitation. The results show good performance from Windows\nmulticores, to HPC clusters and machines with accelerators, like GPUs.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jul 2012 23:30:06 GMT"}], "update_date": "2012-07-10", "authors_parsed": [["Bianco", "Mauro", ""], ["Varetto", "Ugo", ""]]}, {"id": "1207.3868", "submitter": "Md. Hasnat Kabir Dr", "authors": "Saleh Masum, M. Hasnat Kabir, Md. Matiqul Islam, Rifat Ara Shams and\n  Shaikh Enayet Ullah", "title": "Impact of Different Spreading Codes Using FEC on DWT Based MC-CDMA\n  System", "comments": "10 Pages; International Journal of Mobile Network Communications &\n  Telematics (IJMNCT) Vol.2, No.3, June 2012", "journal-ref": null, "doi": "10.5121/ijmnct.2012.2301", "report-no": null, "categories": "cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The effect of different spreading codes in DWT based MC-CDMA wireless\ncommunication system is investigated. In this paper, we present the Bit Error\nRate (BER) performance of different spreading codes (Walsh-Hadamard code,\nOrthogonal gold code and Golay complementary sequences) using Forward Error\nCorrection (FEC) of the proposed system. The data is analyzed and is compared\namong different spreading codes in both coded and uncoded cases. It is found\nvia computer simulation that the performance of the proposed coded system is\nmuch better than that of the uncoded system irrespective of the spreading codes\nand all the spreading codes show approximately similar nature for both coded\nand uncoded in all modulation schemes.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2012 03:46:43 GMT"}], "update_date": "2012-07-18", "authors_parsed": [["Masum", "Saleh", ""], ["Kabir", "M. Hasnat", ""], ["Islam", "Md. Matiqul", ""], ["Shams", "Rifat Ara", ""], ["Ullah", "Shaikh Enayet", ""]]}, {"id": "1207.3869", "submitter": "Chathuranga Widanapathirana", "authors": "Chathuranga Widanapathirana, Y. Ahmet \\c{S}ekercio\\v{g}lu, Milosh V.\n  Ivanovich, Paul G. Fitzpatrick, and Jonathan C. Li", "title": "Automated Inference System for End-To-End Diagnosis of Network\n  Performance Issues in Client-Terminal Devices", "comments": "arXiv admin note: substantial text overlap with arXiv:1207.3560", "journal-ref": "International Journal of Computer Networks & Communications\n  (IJCNC) 2012; ISSN: 0975-2293/(e)0974-9322", "doi": "10.5121/ijcnc.2012.4303", "report-no": null, "categories": "cs.NI cs.AI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional network diagnosis methods of Client-Terminal Device (CTD)\nproblems tend to be laborintensive, time consuming, and contribute to increased\ncustomer dissatisfaction. In this paper, we propose an automated solution for\nrapidly diagnose the root causes of network performance issues in CTD. Based on\na new intelligent inference technique, we create the Intelligent Automated\nClient Diagnostic (IACD) system, which only relies on collection of\nTransmission Control Protocol (TCP) packet traces. Using soft-margin Support\nVector Machine (SVM) classifiers, the system (i) distinguishes link problems\nfrom client problems and (ii) identifies characteristics unique to the specific\nfault to report the root cause. The modular design of the system enables\nsupport for new access link and fault types. Experimental evaluation\ndemonstrated the capability of the IACD system to distinguish between faulty\nand healthy links and to diagnose the client faults with 98% accuracy. The\nsystem can perform fault diagnosis independent of the user's specific TCP\nimplementation, enabling diagnosis of diverse range of client devices\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2012 03:51:57 GMT"}], "update_date": "2012-07-18", "authors_parsed": [["Widanapathirana", "Chathuranga", ""], ["Şekercioǧlu", "Y. Ahmet", ""], ["Ivanovich", "Milosh V.", ""], ["Fitzpatrick", "Paul G.", ""], ["Li", "Jonathan C.", ""]]}, {"id": "1207.3871", "submitter": "Md. Hasnat Kabir Dr", "authors": "Md. Matiqul Islam, M. Hasnat Kabir and Sk. Enayet Ullah", "title": "Performance Analysis of Wavelet Based MC-CDMA System with Implementation\n  of Various Antenna Diversity Schemes", "comments": null, "journal-ref": "International Journal of Research and Reviews in Computer Science\n  (IJRRCS) Vol. 2, No. 2, April 2011, 271-274", "doi": null, "report-no": null, "categories": "cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The impact of using wavelet based technique on the performance of a MC-CDMA\nwireless communication system has been investigated. The system under proposed\nstudy incorporates Walsh Hadamard codes to discriminate the message signal for\nindividual user. A computer program written in Mathlab source code is developed\nand this simulation study is made with implementation of various antenna\ndiversity schemes and fading (Rayleigh and Rician) channel. Computer simulation\nresults demonstrate that the proposed wavelet based MC-CDMA system outperforms\nin Alamouti (two transmit antenna and one receive antenna) under AWGN and\nRician channel.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2012 03:57:58 GMT"}], "update_date": "2012-07-18", "authors_parsed": [["Islam", "Md. Matiqul", ""], ["Kabir", "M. Hasnat", ""], ["Ullah", "Sk. Enayet", ""]]}, {"id": "1207.3875", "submitter": "Md. Hasnat Kabir Dr", "authors": "Md. Golam Rashed, M. Hasnat Kabir, Md. Selim Reza, Md. Matiqul Islam,\n  Rifat Ara Shams, Saleh Masum, Sheikh Enayet Ullah", "title": "Transmission of Voice Signal: BER Performance Analysis of Different FEC\n  Schemes Based OFDM System over Various Channels", "comments": "12 Pages", "journal-ref": "International Journal of Advanced Science and Technology, Vol. 34,\n  September 2011, 89-100", "doi": null, "report-no": null, "categories": "cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we investigate the impact of Forward Error Correction (FEC)\ncodes namely Cyclic Redundancy Code and Convolution Code on the performance of\nOFDM wireless communication system for speech signal transmission over both\nAWGN and fading (Rayleigh and Rician) channels in term of Bit Error\nProbability. The simulation has been done in conjunction with QPSK digital\nmodulation and compared with uncoded resultstal modulation. In the fading\nchannels, it is found via computer simulation that the performance of the\nConvolution interleaved based OFDM systems outperform than that of CRC\ninterleaved OFDM system as well as uncoded OFDM channels.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2012 04:12:31 GMT"}], "update_date": "2012-07-18", "authors_parsed": [["Rashed", "Md. Golam", ""], ["Kabir", "M. Hasnat", ""], ["Reza", "Md. Selim", ""], ["Islam", "Md. Matiqul", ""], ["Shams", "Rifat Ara", ""], ["Masum", "Saleh", ""], ["Ullah", "Sheikh Enayet", ""]]}, {"id": "1207.3876", "submitter": "Md. Hasnat Kabir Dr", "authors": "Md. Golam Rashed, M. Hasnat Kabir, Muhammad Sajjadur Rahim, Shaikh\n  Enayet Ullah", "title": "Cluster Based Hierarchical Routing Protocol for Wireless Sensor Network", "comments": "International Journal of Computer and Network Security(IJCNS), Vol.\n  2, No. 5, May 2010", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The efficient use of energy source in a sensor node is most desirable\ncriteria for prolong the life time of wireless sensor network. In this paper,\nwe propose a two layer hierarchical routing protocol called Cluster Based\nHierarchical Routing Protocol (CBHRP). We introduce a new concept called\nhead-set, consists of one active cluster head and some other associate cluster\nheads within a cluster. The head-set members are responsible for control and\nmanagement of the network. Results show that this protocol reduces energy\nconsumption quite significantly and prolongs the life time of sensor network as\ncompared to LEACH.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2012 04:17:19 GMT"}], "update_date": "2012-07-18", "authors_parsed": [["Rashed", "Md. Golam", ""], ["Kabir", "M. Hasnat", ""], ["Rahim", "Muhammad Sajjadur", ""], ["Ullah", "Shaikh Enayet", ""]]}, {"id": "1207.3882", "submitter": "Md. Hasnat Kabir Dr", "authors": "Md. Golam Rashed, M. Hasnat Kabir, Shaikh Enayet Ullah", "title": "WEP: An Energy Efficient Protocol for Cluster Based Heterogeneous\n  Wireless Sensor Network", "comments": "7 Pages", "journal-ref": "International Journal of Distributed and Parallel Systems (IJDPS)\n  Vol.2, No.2, March 2011, 54-60", "doi": "10.5121/ijdps.2011.2205", "report-no": null, "categories": "cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an energy-efficient routing protocol in order to enhance the\nstability period of wireless sensor networks. This protocol is called weighted\nelection protocol (WEP). It introduces a scheme to combine clustering strategy\nwith chain routing algorithm for satisfy both energy and stable period\nconstrains under heterogeneous environment in WSNs. Simulation results show\nthat new one performs better than LEACH, SEP and HEARP in terms of stability\nperiod and network lifetime. It is also found that longer stability period\nstrongly depend on higher values of extra energy during its heterogeneous\nsettings.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2012 05:25:56 GMT"}], "update_date": "2012-07-18", "authors_parsed": [["Rashed", "Md. Golam", ""], ["Kabir", "M. Hasnat", ""], ["Ullah", "Shaikh Enayet", ""]]}, {"id": "1207.3884", "submitter": "Md. Hasnat Kabir Dr", "authors": "Rifat Ara Shams, M. Hasnat Kabir, Sheikh Enayet Ullah", "title": "Effect of Interleaved FEC Code on Wavelet Based MC-CDMA System with\n  Alamouti STBC in Different Modulation Schemes", "comments": null, "journal-ref": "International Journal of Computer Science, Engineering and\n  Information Technology (IJCSEIT), Vol.2, No.1, February 2012, 23-33", "doi": "10.5121/ijcseit.2012.2103", "report-no": null, "categories": "cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the impact of Forward Error Correction (FEC) code namely\nTrellis code with interleaver on the performance of wavelet based MC-CDMA\nwireless communication system with the implementation of Alamouti antenna\ndiversity scheme has been investigated in terms of Bit Error Rate (BER) as a\nfunction of Signal-to-Noise Ratio (SNR) per bit. Simulation of the system under\nproposed study has been done in M-ary modulation schemes (MPSK, MQAM and DPSK)\nover AWGN and Rayleigh fading channel incorporating Walsh Hadamard code as\northogonal spreading code to discriminate the message signal for individual\nuser. It is observed via computer simulation that the performance of the\ninterleaved coded based proposed system outperforms than that of the uncoded\nsystem in all modulation schemes over Rayleigh fading channel.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jul 2012 05:34:09 GMT"}], "update_date": "2012-07-18", "authors_parsed": [["Shams", "Rifat Ara", ""], ["Kabir", "M. Hasnat", ""], ["Ullah", "Sheikh Enayet", ""]]}, {"id": "1207.5217", "submitter": "Elmar Peise", "authors": "Elmar Peise (1) ((1) AICES, RWTH Aachen)", "title": "Hierarchical Performance Modeling for Ranking Dense Linear Algebra\n  Algorithms", "comments": "Master's Thesis", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A large class of dense linear algebra operations, such as LU decomposition or\ninversion of a triangular matrix, are usually performed by blocked algorithms.\nFor one such operation, typically, not only one but many algorithmic variants\nexist; depending on computing architecture, libraries and problem size, each\nvariant attains a different performances. We propose methods and tools to rank\nthe algorithmic variants according to their performance for a given scenario\nwithout executing them.\n  For this purpose, we identify the routines upon which the algorithms are\nbuilt. A first tool - the Sampler - measures the performance of these routines.\nUsing the Sampler, a second tool models their performance. The generated models\nare then used to predict the performance of the considered algorithms. For a\ngiven scenario, these predictions allow us to correctly rank the algorithms\naccording to their performance without executing them. With the help of the\nsame tools, algorithmic parameters such as block-size can be optimally tuned.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jul 2012 12:04:53 GMT"}, {"version": "v2", "created": "Mon, 13 Aug 2012 10:33:05 GMT"}, {"version": "v3", "created": "Mon, 27 Aug 2012 13:38:10 GMT"}], "update_date": "2012-08-28", "authors_parsed": [["Peise", "Elmar", "", "AICES, RWTH Aachen"]]}, {"id": "1207.6295", "submitter": "Kai Wang", "authors": "Kai Wang, Minghong Lin, Florin Ciucu, Adam Wierman, Chuang Lin", "title": "Characterizing the Impact of the Workload on the Value of Dynamic\n  Resizing in Data Centers", "comments": "24 pages, 27 fugures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Energy consumption imposes a significant cost for data centers; yet much of\nthat energy is used to maintain excess service capacity during periods of\npredictably low load. Resultantly, there has recently been interest in\ndeveloping designs that allow the service capacity to be dynamically resized to\nmatch the current workload. However, there is still much debate about the value\nof such approaches in real settings. In this paper, we show that the value of\ndynamic resizing is highly dependent on statistics of the workload process. In\nparticular, both slow time-scale non-stationarities of the workload (e.g., the\npeak-to-mean ratio) and the fast time-scale stochasticity (e.g., the burstiness\nof arrivals) play key roles. To illustrate the impact of these factors, we\ncombine optimization-based modeling of the slow time-scale with stochastic\nmodeling of the fast time scale. Within this framework, we provide both\nanalytic and numerical results characterizing when dynamic resizing does (and\ndoes not) provide benefits.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jul 2012 15:17:06 GMT"}, {"version": "v2", "created": "Sun, 11 May 2014 06:32:57 GMT"}], "update_date": "2014-05-13", "authors_parsed": [["Wang", "Kai", ""], ["Lin", "Minghong", ""], ["Ciucu", "Florin", ""], ["Wierman", "Adam", ""], ["Lin", "Chuang", ""]]}]