[{"id": "0710.3892", "submitter": "Gordan Zitkovic", "authors": "Thaleia Zariphopoulou and Gordan Zitkovic", "title": "Maturity-independent risk measures", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.OC math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The new notion of maturity-independent risk measures is introduced and\ncontrasted with the existing risk measurement concepts. It is shown, by means\nof two examples, one set on a finite probability space and the other in a\ndiffusion framework, that, surprisingly, some of the widely utilized risk\nmeasures cannot be used to build maturity-independent counterparts. We\nconstruct a large class of maturity-independent risk measures and give\nrepresentative examples in both continuous- and discrete-time financial models.\n", "versions": [{"version": "v1", "created": "Sat, 20 Oct 2007 23:32:43 GMT"}, {"version": "v2", "created": "Mon, 4 Aug 2008 17:14:02 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Zariphopoulou", "Thaleia", ""], ["Zitkovic", "Gordan", ""]]}, {"id": "0710.3959", "submitter": "Xiaolin Luo Dr", "authors": "Xiaolin Luo and Pavel V. Shevchenko", "title": "The t copula with Multiple Parameters of Degrees of Freedom: Bivariate\n  Characteristics and Application to Risk Management", "comments": null, "journal-ref": "Quantitative Finance. Volume 10, Issue 9. November 2010. 1039-1054", "doi": "10.1080/14697680903085544", "report-no": "CMIS #2593", "categories": "math.PR q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The t copula is often used in risk management as it allows for modelling tail\ndependence between risks and it is simple to simulate and calibrate. However,\nthe use of a standard t copula is often criticized due to its restriction of\nhaving a single parameter for the degrees of freedom (dof) that may limit its\ncapability to model the tail dependence structure in a multivariate case. To\novercome this problem, grouped t copula was proposed recently, where risks are\ngrouped a priori in such a way that each group has a standard t copula with its\nspecific dof parameter. In this paper we propose the use of a grouped t copula,\nwhere each group consists of one risk factor only, so that a priori grouping is\nnot required. The copula characteristics in the bivariate case are studied. We\nexplain simulation and calibration procedures, including a simulation study on\nfinite sample properties of the maximum likelihood estimators and Kendall's tau\napproximation. This new copula can be significantly different from the standard\nt copula in terms of risk measures such as tail dependence, value at risk and\nexpected shortfall.\n  Keywords: grouped t copula, tail dependence, risk management.\n", "versions": [{"version": "v1", "created": "Mon, 22 Oct 2007 00:32:45 GMT"}, {"version": "v2", "created": "Fri, 20 Mar 2009 01:23:14 GMT"}, {"version": "v3", "created": "Tue, 16 Feb 2010 00:30:52 GMT"}], "update_date": "2010-11-11", "authors_parsed": [["Luo", "Xiaolin", ""], ["Shevchenko", "Pavel V.", ""]]}, {"id": "0710.4106", "submitter": "Claudia Ravanelli Dr.", "authors": "Nicole El Karoui and Claudia Ravanelli", "title": "Cash Sub-additive Risk Measures and Interest Rate Ambiguity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.PR", "license": null, "abstract": "  A new class of risk measures called cash sub-additive risk measures is\nintroduced to assess the risk of future financial, nonfinancial and insurance\npositions. The debated cash additive axiom is relaxed into the cash sub\nadditive axiom to preserve the original difference between the numeraire of the\ncurrent reserve amounts and future positions. Consequently, cash sub-additive\nrisk measures can model stochastic and/or ambiguous interest rates or\ndefaultable contingent claims. Practical examples are presented and in such\ncontexts cash additive risk measures cannot be used. Several representations of\nthe cash sub-additive risk measures are provided. The new risk measures are\ncharacterized by penalty functions defined on a set of sub-linear probability\nmeasures and can be represented using penalty functions associated with cash\nadditive risk measures defined on some extended spaces. The issue of the\noptimal risk transfer is studied in the new framework using inf-convolution\ntechniques. Examples of dynamic cash sub-additive risk measures are provided\nvia BSDEs where the generator can locally depend on the level of the cash\nsub-additive risk measure.\n", "versions": [{"version": "v1", "created": "Mon, 22 Oct 2007 17:03:37 GMT"}], "update_date": "2008-12-02", "authors_parsed": [["Karoui", "Nicole El", ""], ["Ravanelli", "Claudia", ""]]}]