[{"id": "1304.0490", "submitter": "Alois Pichler", "authors": "Alois Pichler", "title": "Premiums And Reserves, Adjusted By Distortions", "comments": "arXiv admin note: substantial text overlap with arXiv:1209.3570", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The net-premium principle is considered to be the most genuine and fair\npremium principle in actuarial applications. However, an insurance company,\napplying the net-premium principle, goes bankrupt with probability one in the\nlong run, even if the company covers its entire costs by collecting the\nrespective fees from its customers. It is therefore an intrinsic necessity for\nthe insurance industry to apply premium principles, which guarantee at least\nfurther existence of the company itself; otherwise, the company naturally could\nnot insure its clients to cover their potential, future claims. Beside this\nintriguing fact the underlying loss distribution typically is not known\nprecisely. Hence alternative premium principles have been developed. A simple\nprinciple, ensuring risk-adjusted credibility premiums, is the distorted\npremium principle. This principle is convenient in insurance companies, as the\nactuary does not have to change his or her tools to compute the premiums or\nreserves. This paper addresses the distorted premium principle from various\nangles. First, dual characterizations are developed. Next, distorted premiums\nare typically computed by under-weighting or ignoring low, but over-weighting\nhigh losses. It is demonstrated here that there is an alternative, opposite\npoint of view, which consists in leaving the probability measure unchanged, but\nincreasing the outcomes instead. It turns out that this new point of view is\nnatural in actuarial practice, as it can be used for premium calculations, as\nwell as to determine the reserves of subsequent years in a time consistent way.\n", "versions": [{"version": "v1", "created": "Mon, 1 Apr 2013 22:05:28 GMT"}], "update_date": "2013-04-03", "authors_parsed": [["Pichler", "Alois", ""]]}, {"id": "1304.1420", "submitter": "Konstantinos Spiliopoulos", "authors": "Konstantinos Spiliopoulos, Justin A. Sirignano, Kay Giesecke", "title": "Fluctuation Analysis for the Loss From Default", "comments": null, "journal-ref": "Stochastic Processes and their Applications, Volume 124, Issue 7,\n  2014, pp. 2322-2362", "doi": null, "report-no": null, "categories": "math.PR q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the fluctuation of the loss from default around its large\nportfolio limit in a class of reduced-form models of correlated firm-by-firm\ndefault timing. We prove a weak convergence result for the fluctuation process\nand use it for developing a conditionally Gaussian approximation to the loss\ndistribution. Numerical results illustrate the accuracy and computational\nefficiency of the approximation.\n", "versions": [{"version": "v1", "created": "Thu, 4 Apr 2013 16:27:25 GMT"}, {"version": "v2", "created": "Wed, 29 May 2013 00:07:25 GMT"}, {"version": "v3", "created": "Fri, 25 Oct 2013 16:07:37 GMT"}, {"version": "v4", "created": "Wed, 18 Feb 2015 21:33:25 GMT"}], "update_date": "2015-02-20", "authors_parsed": [["Spiliopoulos", "Konstantinos", ""], ["Sirignano", "Justin A.", ""], ["Giesecke", "Kay", ""]]}, {"id": "1304.1940", "submitter": "Lingjiong Zhu", "authors": "Lingjiong Zhu", "title": "Ruin Probabilities for Risk Processes with Non-Stationary Arrivals and\n  Subexponential Claims", "comments": "15 pages", "journal-ref": "Insurance: Mathematics and Economics 2013, Volume 53, Issue 3,\n  544-550", "doi": null, "report-no": null, "categories": "q-fin.RM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we obtain the finite-horizon and infinite-horizon ruin\nprobability asymptotics for risk processes with claims of subexponential tails\nfor non-stationary arrival processes that satisfy a large deviation principle.\nAs a result, the arrival process can be dependent, non-stationary and\nnon-renewal. We give three examples of non-stationary and non-renewal point\nprocesses: Hawkes process, Cox process with shot noise intensity and\nself-correcting point process. We also show some aggregate claims results for\nthese three examples.\n", "versions": [{"version": "v1", "created": "Sat, 6 Apr 2013 21:56:33 GMT"}, {"version": "v2", "created": "Sat, 10 Aug 2013 14:00:48 GMT"}, {"version": "v3", "created": "Tue, 14 Oct 2014 22:35:11 GMT"}], "update_date": "2014-10-16", "authors_parsed": [["Zhu", "Lingjiong", ""]]}, {"id": "1304.2942", "submitter": "Damiano  Brigo", "authors": "Damiano Brigo, Giuseppe Di Graziano", "title": "Optimal execution comparison across risks and dynamics, with solutions\n  for displaced diffusions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.TR q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We solve a version of the optimal trade execution problem when the mid asset\nprice follows a displaced diffusion. Optimal strategies in the adapted class\nunder various risk criteria, namely value-at-risk, expected shortfall and a new\ncriterion called \"squared asset expectation\" (SAE), related to a version of the\ncost variance measure, are derived and compared. It is well known that\ndisplaced diffusions (DD) exhibit dynamics which are in-between arithmetic\nBrownian motions (ABM) and geometric Brownian motions (GBM) depending of the\nchoice of the shift parameter. Furthermore, DD allows for changes in the\nsupport of the mid asset price distribution, allowing one to include a minimum\npermitted value for the mid price, either positive or negative. We study the\ndependence of the optimal solution on the choice of the risk aversion\ncriterion. Optimal solutions across criteria and asset dynamics are comparable\nalthough differences are not negligible for high levels of risk aversion and\nlow market impact assets. This is illustrated with numerical examples.\n", "versions": [{"version": "v1", "created": "Wed, 10 Apr 2013 12:56:50 GMT"}, {"version": "v2", "created": "Thu, 8 Aug 2013 16:46:00 GMT"}, {"version": "v3", "created": "Fri, 9 May 2014 14:13:15 GMT"}], "update_date": "2014-05-12", "authors_parsed": [["Brigo", "Damiano", ""], ["Di Graziano", "Giuseppe", ""]]}, {"id": "1304.3814", "submitter": "Hwai-Chung Ho", "authors": "Hongwei Chuang, Hwai-Chung Ho", "title": "Measuring the default risk of sovereign debt from the perspective of\n  network", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2013.01.004", "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, there has been a growing interest in network research, especially\nin these fields of biology, computer science, and sociology. It is natural to\naddress complex financial issues such as the European sovereign debt crisis\nfrom the perspective of network. In this article, we construct a network model\naccording to the debt--credit relations instead of using the conventional\nmethodology to measure the default risk. Based on the model, a risk index is\nexamined using the quarterly report of consolidated foreign claims from the\nBank for International Settlements (BIS) and debt/GDP ratios among these\nreporting countries. The empirical results show that this index can help the\nregulators and practitioners not only to determine the status of\ninterconnectivity but also to point out the degree of the sovereign debt\ndefault risk. Our approach sheds new light on the investigation of quantifying\nthe systemic risk.\n", "versions": [{"version": "v1", "created": "Sat, 13 Apr 2013 15:06:57 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Chuang", "Hongwei", ""], ["Ho", "Hwai-Chung", ""]]}, {"id": "1304.4853", "submitter": "Anthony Reveillac", "authors": "Irina Penner, Anthony Reveillac (CEREMADE)", "title": "Risk measures for processes and BSDEs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper analyzes risk assessment for cash flows in continuous time using\nthe notion of convex risk measures for processes. By combining a decomposition\nresult for optional measures, and a dual representation of a convex risk\nmeasure for bounded \\cd processes, we show that this framework provides a\nsystematic approach to the both issues of model ambiguity, and uncertainty\nabout the time value of money. We also establish a link between risk measures\nfor processes and BSDEs.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2013 15:12:32 GMT"}], "update_date": "2013-04-18", "authors_parsed": [["Penner", "Irina", "", "CEREMADE"], ["Reveillac", "Anthony", "", "CEREMADE"]]}, {"id": "1304.5065", "submitter": "Rama  Cont", "authors": "Rama Cont and Thomas Kokholm", "title": "Central Clearing of OTC Derivatives: bilateral vs multilateral netting", "comments": null, "journal-ref": "Statistics and Risk Modeling, Vol 31, No. 1, 3-22, March 2014", "doi": "10.1515/strm-2013-1161", "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the impact of central clearing of over-the-counter (OTC)\ntransactions on counterparty exposures in a market with OTC transactions across\nseveral asset classes with heterogeneous characteristics. The impact of\nintroducing a central counterparty (CCP) on expected interdealer exposure is\ndetermined by the tradeoff between multilateral netting across dealers on one\nhand and bilateral netting across asset classes on the other hand. We find this\ntradeoff to be sensitive to assumptions on heterogeneity of asset classes in\nterms of `riskyness' of the asset class as well as correlation of exposures\nacross asset classes. In particular, while an analysis assuming independent,\nhomogeneous exposures suggests that central clearing is efficient only if one\nhas an unrealistically high number of participants, the opposite conclusion is\nreached if differences in riskyness and correlation across asset classes are\nrealistically taken into account. We argue that empirically plausible\nspecifications of model parameters lead to the conclusion that central clearing\ndoes reduce interdealer exposures: the gain from multilateral netting in a CCP\noverweighs the loss of netting across asset classes in bilateral netting\nagreements. When a CCP exists for interest rate derivatives, adding a CCP for\ncredit derivatives is shown to decrease overall exposures. These findings are\nshown to be robust to the statistical assumptions of the model as well as the\nchoice of risk measure used to quantify exposures.\n", "versions": [{"version": "v1", "created": "Thu, 18 Apr 2013 09:55:38 GMT"}], "update_date": "2014-03-13", "authors_parsed": [["Cont", "Rama", ""], ["Kokholm", "Thomas", ""]]}, {"id": "1304.7882", "submitter": "Qian Zhao", "authors": "Qian Zhao, Jiaqin Wei, Rongming Wang", "title": "Mean-Variance Asset-Liability Management with State-Dependent Risk\n  Aversion", "comments": "12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we consider the asset-liability management under the\nmean-variance criterion. The financial market consists of a risk-free bond and\na stock whose price process is modeled by a geometric Brownian motion. The\nliability of the investor is uncontrollable and is modeled by another geometric\nBrownian motion. We consider a specific state-dependent risk aversion which\ndepends on a power function of the liability. By solving a flow of FBSDEs with\nbivariate state process, we obtain the equilibrium strategy among all the\nopen-loop controls for this time-inconsistent control problem. It shows that\nthe equilibrium strategy is a feedback control of the liability.\n", "versions": [{"version": "v1", "created": "Tue, 30 Apr 2013 05:27:44 GMT"}], "update_date": "2013-05-01", "authors_parsed": [["Zhao", "Qian", ""], ["Wei", "Jiaqin", ""], ["Wang", "Rongming", ""]]}, {"id": "1304.7934", "submitter": "Keita Owari", "authors": "Keita Owari", "title": "Maximum Lebesgue Extension of Monotone Convex Functions", "comments": "To Appear in Journal of Functional Analysis, 32 pages", "journal-ref": "Journal of Functional Analysis, 266, issue 6, 2014, pp. 3572-3611", "doi": "10.1016/j.jfa.2014.01.002", "report-no": null, "categories": "math.FA math.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a monotone convex function on the space of essentially bounded random\nvariables with the Lebesgue property (order continuity), we consider its\nextension preserving the Lebesgue property to as big solid vector space of\nrandom variables as possible. We show that there exists a maximum such\nextension, with explicit construction, where the maximum domain of extension is\nobtained as a (possibly proper) subspace of a natural Orlicz-type space,\ncharacterized by a certain uniform integrability property. As an application,\nwe provide a characterization of the Lebesgue property of monotone convex\nfunction on arbitrary solid spaces of random variables in terms of uniform\nintegrability and a \"nice\" dual representation of the function.\n", "versions": [{"version": "v1", "created": "Tue, 30 Apr 2013 09:48:24 GMT"}, {"version": "v2", "created": "Sun, 19 Jan 2014 17:55:29 GMT"}], "update_date": "2014-02-20", "authors_parsed": [["Owari", "Keita", ""]]}]