[{"id": "1312.0283", "submitter": "Zhenyu Cui", "authors": "Zhenyu Cui", "title": "Stochastic areas of diffusions and applications in risk theory", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.PR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In this paper we study the stochastic area swept by a regular\ntime-homogeneous diffusion till a stopping time. This unifies some recent\nliterature in this area. Through stochastic time change we establish a link\nbetween the stochastic area and the stopping time of another associated\ntime-homogeneous diffusion. Then we characterize the Laplace transform of the\nstochastic area in terms of the eigenfunctions of the associated diffusion. We\nalso explicitly obtain the integer moments of the stochastic area in terms of\nscale and speed densities of the associated diffusion. Specifically we study in\ndetail three stopping times: the first passage time to a constant level, the\nfirst drawdown time and the Azema-Yor stopping time. We also study the total\noccupation area of the diffusion below a constant level. We show applications\nof the results to a new structural model of default (Yildirim 2006), the Omega\nrisk model of bankruptcy in risk analysis (Gerber, Shiu and Yang 2012), and a\ndiffusion risk model with surplus-dependent tax (Albrecher and Hipp 2007, Li,\nTang and Zhou 2013).\n", "versions": [{"version": "v1", "created": "Sun, 1 Dec 2013 23:03:41 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Cui", "Zhenyu", ""]]}, {"id": "1312.0424", "submitter": "Rodrigo S. Targino", "authors": "Rodrigo S. Targino, Gareth W. Peters, Georgy Sofronov, Pavel V.\n  Shevchenko", "title": "Optimal insurance purchase strategies via optimal multiple stopping\n  times", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.ST stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study a class of insurance products where the policy holder\nhas the option to insure $k$ of its annual Operational Risk losses in a horizon\nof $T$ years. This involves a choice of $k$ out of $T$ years in which to apply\nthe insurance policy coverage by making claims against losses in the given\nyear. The insurance product structure presented can accommodate any kind of\nannual mitigation, but we present three basic generic insurance policy\nstructures that can be combined to create more complex types of coverage.\nFollowing the Loss Distributional Approach (LDA) with Poisson distributed\nannual loss frequencies and Inverse-Gaussian loss severities we are able to\ncharacterize in closed form analytical expressions for the multiple optimal\ndecision strategy that minimizes the expected Operational Risk loss over the\nnext $T$ years. For the cases where the combination of insurance policies and\nLDA model does not lead to closed form expressions for the multiple optimal\ndecision rules, we also develop a principled class of closed form\napproximations to the optimal decision rule. These approximations are developed\nbased on a class of orthogonal Askey polynomial series basis expansion\nrepresentations of the annual loss compound process distribution and functions\nof this annual loss.\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 11:32:55 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Targino", "Rodrigo S.", ""], ["Peters", "Gareth W.", ""], ["Sofronov", "Georgy", ""], ["Shevchenko", "Pavel V.", ""]]}, {"id": "1312.0506", "submitter": "Marie Kratz", "authors": "Marc Busse, Michel Dacorogna, Marie Kratz", "title": "The impact of systemic risk on the diversification benefits of a risk\n  portfolio", "comments": "17 pages, 5 tableaux", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Risk diversification is the basis of insurance and investment. It is thus\ncrucial to study the effects that could limit it. One of them is the existence\nof systemic risk that affects all the policies at the same time. We introduce\nhere a probabilistic approach to examine the consequences of its presence on\nthe risk loading of the premium of a portfolio of insurance policies. This\napproach could be easily generalized for investment risk. We see that, even\nwith a small probability of occurrence, systemic risk can reduce dramatically\nthe diversification benefits. It is clearly revealed via a non-diversifiable\nterm that appears in the analytical expression of the variance of our models.\nWe propose two ways of introducing it and discuss their advantages and\nlimitations. By using both VaR and TVaR to compute the loading, we see that\nonly the latter captures the full effect of systemic risk when its probability\nto occur is low\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 16:30:09 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Busse", "Marc", ""], ["Dacorogna", "Michel", ""], ["Kratz", "Marie", ""]]}, {"id": "1312.1006", "submitter": "Igor Cialenco", "authors": "Tomasz R. Bielecki, Igor Cialenco, Marcin Pitera", "title": "Dynamic Limit Growth Indices in Discrete Time", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a new class of mappings, called Dynamic Limit Growth Indices, that\nare designed to measure the long-run performance of a financial portfolio in\ndiscrete time setup. We study various important properties for this new class\nof measures, and in particular, we provide necessary and sufficient condition\nfor a Dynamic Limit Growth Index to be a dynamic assessment index. We also\nestablish their connection with classical dynamic acceptability indices, and we\nshow how to construct examples of Dynamic Limit Growth Indices using dynamic\nrisk measures and dynamic certainty equivalents. Finally, we propose a new\ndefinition of time consistency, suitable for these indices, and we study time\nconsistency for the most notable representative of this class -- the dynamic\nanalog of risk sensitive criterion.\n", "versions": [{"version": "v1", "created": "Wed, 4 Dec 2013 02:24:40 GMT"}, {"version": "v2", "created": "Mon, 21 Jul 2014 02:22:20 GMT"}], "update_date": "2014-07-22", "authors_parsed": [["Bielecki", "Tomasz R.", ""], ["Cialenco", "Igor", ""], ["Pitera", "Marcin", ""]]}, {"id": "1312.1645", "submitter": "Dirk Tasche", "authors": "Susanne Emmer, Marie Kratz, Dirk Tasche", "title": "What is the best risk measure in practice? A comparison of standard\n  measures", "comments": "27 pages, 1 table", "journal-ref": "Journal of Risk 18(2), 31-60, 2015", "doi": null, "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Expected Shortfall (ES) has been widely accepted as a risk measure that is\nconceptually superior to Value-at-Risk (VaR). At the same time, however, it has\nbeen criticised for issues relating to backtesting. In particular, ES has been\nfound not to be elicitable which means that backtesting for ES is less\nstraightforward than, e.g., backtesting for VaR. Expectiles have been suggested\nas potentially better alternatives to both ES and VaR. In this paper, we\nrevisit commonly accepted desirable properties of risk measures like coherence,\ncomonotonic additivity, robustness and elicitability. We check VaR, ES and\nExpectiles with regard to whether or not they enjoy these properties, with\nparticular emphasis on Expectiles. We also consider their impact on capital\nallocation, an important issue in risk management. We find that, despite the\ncaveats that apply to the estimation and backtesting of ES, it can be\nconsidered a good risk measure. As a consequence, there is no sufficient\nevidence to justify an all-inclusive replacement of ES by Expectiles in\napplications. For backtesting ES, we propose an empirical approach that\nconsists in replacing ES by a set of four quantiles, which should allow to make\nuse of backtesting methods for VaR.\n  Keywords: Backtesting; capital allocation; coherence; diversification;\nelicitability; expected shortfall; expectile; forecasts; probability integral\ntransform (PIT); risk measure; risk management; robustness; value-at-risk\n", "versions": [{"version": "v1", "created": "Thu, 5 Dec 2013 18:54:12 GMT"}, {"version": "v2", "created": "Fri, 13 Dec 2013 10:26:21 GMT"}, {"version": "v3", "created": "Sun, 30 Nov 2014 19:39:21 GMT"}, {"version": "v4", "created": "Tue, 28 Apr 2015 19:36:25 GMT"}], "update_date": "2015-11-20", "authors_parsed": [["Emmer", "Susanne", ""], ["Kratz", "Marie", ""], ["Tasche", "Dirk", ""]]}, {"id": "1312.5073", "submitter": "Anne Balter", "authors": "Anne Balter, Antoon Pelsser, Peter Schotman", "title": "Extrapolating the term structure of interest rates with parameter\n  uncertainty", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PR q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pricing extremely long-dated liabilities market consistently deals with the\ndecline in liquidity of financial instruments on long maturities. The aim is to\nquantify the uncertainty of rates up to maturities of a century. We assume that\nthe interest rates follow the affine mean-reverting Vasicek model. We model\nparameter uncertainty by Bayesian distributions over the parameters. The\ncross-sectional and time series parameters are obtained via the restricted\nbivariate VAR(1) model. The empirical example shows extremely low confidence in\nlong term extrapolations due to the accumulated effect of the mean-reversion`s\nbehaviour close to the unit root.\n", "versions": [{"version": "v1", "created": "Wed, 18 Dec 2013 09:28:06 GMT"}], "update_date": "2013-12-19", "authors_parsed": [["Balter", "Anne", ""], ["Pelsser", "Antoon", ""], ["Schotman", "Peter", ""]]}, {"id": "1312.5271", "submitter": "Michel Fliess", "authors": "Michel Fliess (LIX, AL.I.E.N.), C\\'edric Join (AL.I.E.N., CRAN, INRIA\n  Lille - Nord Europe)", "title": "Systematic and multifactor risk models revisited", "comments": "First Paris Financial Management Conference, Paris : France (2013)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM cs.CE math.LO q-fin.CP stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Systematic and multifactor risk models are revisited via methods which were\nalready successfully developed in signal processing and in automatic control.\nThe results, which bypass the usual criticisms on those risk modeling, are\nillustrated by several successful computer experiments.\n", "versions": [{"version": "v1", "created": "Wed, 18 Dec 2013 19:21:24 GMT"}], "update_date": "2013-12-19", "authors_parsed": [["Fliess", "Michel", "", "LIX, AL.I.E.N."], ["Join", "Cédric", "", "AL.I.E.N., CRAN, INRIA\n  Lille - Nord Europe"]]}, {"id": "1312.6804", "submitter": "Teruyoshi Kobayashi", "authors": "Teruyoshi Kobayashi", "title": "A model of financial contagion with variable asset returns may be\n  replaced with a simple threshold model of cascades", "comments": "8 pages, including 2 figures", "journal-ref": "Economics Letters 124, 113-116, 2014", "doi": "10.1016/j.econlet.2014.05.003", "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I show the equivalence between a model of financial contagion and the\nthreshold model of global cascades proposed by Watts (2002). The model\nfinancial network comprises banks that hold risky external assets as well as\ninterbank assets. It is shown that a simple threshold model can replicate the\nsize and the frequency of financial contagion without using information about\nindividual balance sheets. Keywords: financial network, cascades, financial\ncontagion, systemic risk.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 12:17:12 GMT"}, {"version": "v2", "created": "Thu, 24 Apr 2014 05:13:30 GMT"}], "update_date": "2014-06-11", "authors_parsed": [["Kobayashi", "Teruyoshi", ""]]}, {"id": "1312.6841", "submitter": "Zhong-liang Tuo", "authors": "Zhongliang Tuo", "title": "Hedging Against the Interest-rate Risk by Measuring the Yield-curve\n  Movement", "comments": "12 pages, 2 tables, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.GN q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By adopting the polynomial interpolation method, we propose an approach to\nhedge against the interest-rate risk of the default-free bonds by measuring the\nnonparallel movement of the yield-curve, such as the translation, the rotation\nand the twist. The empirical analysis shows that our hedging strategies are\ncomparable to traditional duration-convexity strategy, or even better when we\nhave more suitable hedging instruments on hand. The article shows that this\nstrategy is flexible and robust to cope with the interest-rate risk and can\nhelp fine-tune a position as time changes.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 15:18:10 GMT"}], "update_date": "2016-11-25", "authors_parsed": [["Tuo", "Zhongliang", ""]]}, {"id": "1312.7346", "submitter": "Godfrey Charles-Cadogan", "authors": "Godfrey Charles-Cadogan and John A. Cole", "title": "Bankruptcy Risk Induced by Career Concerns of Regulators", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a model in which a regulator employs mechanism design to embed\nher human capital beta signal(s) in a firm's capital structure, in order to\nenhance the value of her post career change indexed executive stock option\ncontract with the firm. We prove that the agency cost of this revolving door\nbehavior increases the firm's financial leverage, bankruptcy risk, and affects\nestimation of firm value at risk (VaR).\n", "versions": [{"version": "v1", "created": "Fri, 27 Dec 2013 13:00:45 GMT"}], "update_date": "2013-12-31", "authors_parsed": [["Charles-Cadogan", "Godfrey", ""], ["Cole", "John A.", ""]]}]