[{"id": "1401.1639", "submitter": "Frank Riedel", "authors": "Qian Lin and Frank Riedel", "title": "Optimal consumption and portfolio choice with ambiguity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider optimal consumption and portfolio choice in the presence of\nKnightian uncertainty in continuous-time. We embed the problem into the new\nframework of stochastic calculus for such settings, dealing in particular with\nthe issue of non-equivalent multiple priors. We solve the problem completely by\nidentifying the worst--case measure. Our setup also allows to consider interest\nrate uncertainty; we show that under some robust parameter constellations, the\ninvestor optimally puts all his wealth into the asset market, and does not save\nor borrow at all.\n", "versions": [{"version": "v1", "created": "Wed, 8 Jan 2014 10:04:00 GMT"}], "update_date": "2014-01-09", "authors_parsed": [["Lin", "Qian", ""], ["Riedel", "Frank", ""]]}, {"id": "1401.2314", "submitter": "Masaaki Fujii", "authors": "Masaaki Fujii, Akihiko Takahashi", "title": "Optimal Hedging for Fund & Insurance Managers with Partially Observable\n  Investment Flows", "comments": "Revised version. Forthcoming in Quantitative Finance", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.CP q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  All the financial practitioners are working in incomplete markets full of\nunhedgeable risk-factors. Making the situation worse, they are only equipped\nwith the imperfect information on the relevant processes. In addition to the\nmarket risk, fund and insurance managers have to be prepared for sudden and\npossibly contagious changes in the investment flows from their clients so that\nthey can avoid the over- as well as under-hedging. In this work, the prices of\nsecurities, the occurrences of insured events and (possibly a network of) the\ninvestment flows are used to infer their drifts and intensities by a stochastic\nfiltering technique. We utilize the inferred information to provide the optimal\nhedging strategy based on the mean-variance (or quadratic) risk criterion. A\nBSDE approach allows a systematic derivation of the optimal strategy, which is\nshown to be implementable by a set of simple ODEs and the standard Monte Carlo\nsimulation. The presented framework may also be useful for manufactures and\nenergy firms to install an efficient overlay of dynamic hedging by financial\nderivatives to minimize the costs.\n", "versions": [{"version": "v1", "created": "Fri, 10 Jan 2014 12:47:30 GMT"}, {"version": "v2", "created": "Sat, 26 Jul 2014 05:38:22 GMT"}], "update_date": "2014-07-29", "authors_parsed": [["Fujii", "Masaaki", ""], ["Takahashi", "Akihiko", ""]]}, {"id": "1401.2524", "submitter": "Nassim N. Taleb", "authors": "Nassim Nicholas Taleb", "title": "Four Points Beginner Risk Managers Should Learn from Jeff Holman's\n  Mistakes in the Discussion of Antifragile", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using Jeff Holman's comments in Quantitative Finance to illustrate 4 critical\nerrors students should learn to avoid: 1) Mistaking tails (4th moment) for\nvolatility (2nd moment), 2) Missing Jensen's Inequality, 3) Analyzing the\nhedging wihout the underlying, 4) The necessity of a numeraire in finance.\n", "versions": [{"version": "v1", "created": "Sat, 11 Jan 2014 11:44:39 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Taleb", "Nassim Nicholas", ""]]}, {"id": "1401.3121", "submitter": "Cosimo Munari", "authors": "Pablo Koch-Medina, Cosimo Munari", "title": "Law-invariant risk measures: extension properties and qualitative\n  robustness", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We characterize when a convex risk measure associated to a law-invariant\nacceptance set in $L^\\infty$ can be extended to $L^p$, $1\\leq p<\\infty$,\npreserving finiteness and continuity. This problem is strongly connected to the\nstatistical robustness of the corresponding risk measures. Special attention is\npaid to concrete examples including risk measures based on expected utility,\nmax-correlation risk measures, and distortion risk measures.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2014 10:05:28 GMT"}], "update_date": "2014-01-15", "authors_parsed": [["Koch-Medina", "Pablo", ""], ["Munari", "Cosimo", ""]]}, {"id": "1401.3133", "submitter": "Cosimo Munari", "authors": "Pablo Koch-Medina, Santiago Moreno-Bromberg, Cosimo Munari", "title": "Capital adequacy tests and limited liability of financial institutions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The theory of acceptance sets and their associated risk measures plays a key\nrole in the design of capital adequacy tests. The objective of this paper is to\ninvestigate, in the context of bounded financial positions, the class of\nsurplus-invariant acceptance sets. These are characterized by the fact that\nacceptability does not depend on the positive part, or surplus, of a capital\nposition. We argue that surplus invariance is a reasonable requirement from a\nregulatory perspective, because it focuses on the interests of liability\nholders of a financial institution. We provide a dual characterization of\nsurplus-invariant, convex acceptance sets, and show that the combination of\nsurplus invariance and coherence leads to a narrow range of capital adequacy\ntests, essentially limited to scenario-based tests. Finally, we emphasize the\nadvantages of dealing with surplus-invariant acceptance sets as the primary\nobject rather than directly with risk measures, such as loss-based and\nexcess-invariant risk measures, which have been recently studied by Cont,\nDeguest, and He (2013) and by Staum (2013), respectively.\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2014 10:46:56 GMT"}, {"version": "v2", "created": "Mon, 3 Feb 2014 22:05:15 GMT"}], "update_date": "2014-02-05", "authors_parsed": [["Koch-Medina", "Pablo", ""], ["Moreno-Bromberg", "Santiago", ""], ["Munari", "Cosimo", ""]]}, {"id": "1401.3167", "submitter": "Alexander Schied", "authors": "Volker Kr\\\"atschmer, Alexander Schied, Henryk Z\\\"ahle", "title": "Quasi-Hadamard differentiability of general risk functionals and its\n  application", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST q-fin.RM stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We apply a suitable modification of the functional delta method to\nstatistical functionals that arise from law-invariant coherent risk measures.\nTo this end we establish differentiability of the statistical functional in a\nrelaxed Hadamard sense, namely with respect to a suitably chosen norm and in\nthe directions of a specifically chosen \"tangent space\". We show that this\nnotion of quasi-Hadamard differentiability yields both strong laws and limit\ntheorems for the asymptotic distribution of the plug-in estimators. Our results\ncan be regarded as a contribution to the statistics and numerics of risk\nmeasurement and as a case study for possible refinements of the functional\ndelta method through fine-tuning the underlying notion of differentiability\n", "versions": [{"version": "v1", "created": "Tue, 14 Jan 2014 12:45:42 GMT"}, {"version": "v2", "created": "Mon, 16 Feb 2015 21:53:12 GMT"}], "update_date": "2015-02-18", "authors_parsed": [["Krätschmer", "Volker", ""], ["Schied", "Alexander", ""], ["Zähle", "Henryk", ""]]}, {"id": "1401.3589", "submitter": "Bj\\\"orn L\\\"ofdahl", "authors": "Boualem Djehiche and Bj\\\"orn L\\\"ofdahl", "title": "Risk aggregation and stochastic claims reserving in disability insurance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a large, homogeneous portfolio of life or disability annuity\npolicies. The policies are assumed to be independent conditional on an external\nstochastic process representing the economic-demographic environment. Using a\nconditional law of large numbers, we establish the connection between claims\nreserving and risk aggregation for large portfolios. Further, we derive a\npartial differential equation for moments of present values. Moreover, we show\nhow statistical multi-factor intensity models can be approximated by one-factor\nmodels, which allows for solving the PDEs very efficiently. Finally, we give a\nnumerical example where moments of present values of disability annuities are\ncomputed using finite difference methods and Monte Carlo simulations.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 13:57:05 GMT"}, {"version": "v2", "created": "Tue, 26 Aug 2014 11:11:45 GMT"}], "update_date": "2014-08-27", "authors_parsed": [["Djehiche", "Boualem", ""], ["Löfdahl", "Björn", ""]]}, {"id": "1401.4787", "submitter": "Xianhua Peng", "authors": "Steven Kou and Xianhua Peng", "title": "On the Measurement of Economic Tail Risk", "comments": "51 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.ST stat.AP stat.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper attempts to provide a decision-theoretic foundation for the\nmeasurement of economic tail risk, which is not only closely related to utility\ntheory but also relevant to statistical model uncertainty. The main result is\nthat the only risk measures that satisfy a set of economic axioms for the\nChoquet expected utility and the statistical property of elicitability (i.e.\nthere exists an objective function such that minimizing the expected objective\nfunction yields the risk measure) are the mean functional and the median\nshortfall, which is the median of tail loss distribution. Elicitability is\nimportant for backtesting. We also extend the result to address model\nuncertainty by incorporating multiple scenarios. As an application, we argue\nthat median shortfall is a better alternative than expected shortfall for\nsetting capital requirements in Basel Accords.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2014 03:55:15 GMT"}, {"version": "v2", "created": "Tue, 11 Feb 2014 12:49:48 GMT"}, {"version": "v3", "created": "Sun, 16 Aug 2015 14:48:15 GMT"}], "update_date": "2015-08-18", "authors_parsed": [["Kou", "Steven", ""], ["Peng", "Xianhua", ""]]}, {"id": "1401.5314", "submitter": "Henrik Jeldtoft Jensen", "authors": "Eduardo Viegas, Stuart P. Cockburn, Henrik Jeldtoft Jensen, Geoffrey\n  B. West", "title": "Why free markets die: An evolutionary perspective", "comments": "13 pages and 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.GN q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Company mergers and acquisitions are often perceived to act as catalysts for\ncorporate growth in free markets systems: it is conventional wisdom that those\nactivities lead to better and more efficient markets. However, the broad\nadoption of this perception into corporate strategy is prone to result in a\nless diverse and more unstable environment, dominated by either very large or\nvery small niche entities. We show here that ancestry, i.e. the cumulative\nhistory of mergers, is the key characteristic that encapsulates the diverse\nrange of drivers behind mergers and acquisitions, across a range of industries\nand geographies. A long-term growth analysis reveals that entities which have\nbeen party to fewer mergers tend to grow faster than more highly acquisitive\nbusinesses.\n", "versions": [{"version": "v1", "created": "Tue, 21 Jan 2014 13:33:01 GMT"}], "update_date": "2014-01-22", "authors_parsed": [["Viegas", "Eduardo", ""], ["Cockburn", "Stuart P.", ""], ["Jensen", "Henrik Jeldtoft", ""], ["West", "Geoffrey B.", ""]]}, {"id": "1401.6408", "submitter": "Mauro Bernardi", "authors": "M. Bernardi, L. Petrella", "title": "Interconnected risk contributions: an heavy-tail approach to analyse US\n  financial sectors", "comments": "arXiv admin note: text overlap with arXiv:1312.6407", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider a multivariate model-based approach to measure the\ndynamic evolution of tail risk interdependence among US banks, financial\nservices and insurance sectors. To deeply investigate the risk contribution of\ninsurers we consider separately life and non-life companies. To achieve this\ngoal we apply the multivariate student-t Markov Switching model and the\nMultiple-CoVaR (CoES) risk measures introduced in Bernardi et. al. (2013b) to\naccount for both the known stylised characteristics of the data and the\ncontemporaneous joint distress events affecting financial sectors. Our\nempirical investigation finds that banks appear to be the major source of risk\nfor all the remaining sectors, followed by the financial services and the\ninsurance sectors, showing that insurance sector significantly contributes as\nwell to the overall risk. Moreover, we find that the role of each sector in\ncontributing to other sectors distress evolves over time accordingly to the\ncurrent predominant financial condition, implying different interconnection\nstrength.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2014 17:34:26 GMT"}, {"version": "v2", "created": "Wed, 16 Apr 2014 13:31:56 GMT"}], "update_date": "2014-04-17", "authors_parsed": [["Bernardi", "M.", ""], ["Petrella", "L.", ""]]}, {"id": "1401.8026", "submitter": "Sebastian Poledna", "authors": "Sebastian Poledna and Stefan Thurner", "title": "Elimination of systemic risk in financial networks by means of a\n  systemic risk transaction tax", "comments": "18 pages, 7 figures", "journal-ref": "Quantitative Finance 16 1469-7696 2016", "doi": "10.1080/14697688.2016.1156146", "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Financial markets are exposed to systemic risk (SR), the risk that a major\nfraction of the system ceases to function, and collapses. It has recently\nbecome possible to quantify SR in terms of underlying financial networks where\nnodes represent financial institutions, and links capture the size and maturity\nof assets (loans), liabilities, and other obligations, such as derivatives. We\ndemonstrate that it is possible to quantify the share of SR that individual\nliabilities within a financial network contribute to the overall SR. We use\nempirical data of nationwide interbank liabilities to show that the marginal\ncontribution to overall SR of liabilities for a given size varies by a factor\nof a thousand. We propose a tax on individual transactions that is proportional\nto their marginal contribution to overall SR. If a transaction does not\nincrease SR it is tax-free. With an agent-based model (CRISIS macro-financial\nmodel) we demonstrate that the proposed \"Systemic Risk Tax\" (SRT) leads to a\nself-organised restructuring of financial networks that are practically free of\nSR. The SRT can be seen as an insurance for the public against costs arising\nfrom cascading failure. ABM predictions are shown to be in remarkable agreement\nwith the empirical data and can be used to understand the relation of credit\nrisk and SR.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2014 23:21:54 GMT"}, {"version": "v2", "created": "Mon, 10 Feb 2014 15:36:03 GMT"}, {"version": "v3", "created": "Wed, 17 Feb 2016 11:14:24 GMT"}], "update_date": "2016-10-03", "authors_parsed": [["Poledna", "Sebastian", ""], ["Thurner", "Stefan", ""]]}]