[{"id": "1502.00882", "submitter": "Mallenahalli Naresh Kumar Prof. Dr.", "authors": "M. Naresh Kumar and V. Sree Hari Rao", "title": "A New Methodology for Estimating Internal Credit Risk and Bankruptcy\n  Prediction under Basel II Regime", "comments": "14 pages, 1 figure in Computational Economics, 2014", "journal-ref": null, "doi": "10.1007/s10614-014-9452-9", "report-no": null, "categories": "q-fin.EC q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Credit estimation and bankruptcy prediction methods have been utilizing\nAltman's $z$ score method for the last several years. It is reported in many\nstudies that $z$ score is sensitive to changes in accounting figures.\nResearches have proposed different variations to conventional $z$ score that\ncan improve the prediction accuracy. In this paper we develop a new\nmultivariate non-linear model for computing the $z$ score. In addition we\ndevelop a new credit risk index by fitting a Pearson type-III distribution to\nthe transformed financial ratios. The results from our study have shown that\nthe new $z$ score can predict the bankruptcy with an accuracy of $98.6\\%$ as\ncompared to $93.5\\%$ by the Altman's $z$ score. Also, the discriminate analysis\nrevealed that the new transformed financial ratios could predict the bankruptcy\nprobability with an accuracy of $93.0\\%$ as compared to $87.4\\%$ using the\nweights of Altman's $z$ score.\n", "versions": [{"version": "v1", "created": "Tue, 3 Feb 2015 15:09:07 GMT"}], "update_date": "2015-02-04", "authors_parsed": [["Kumar", "M. Naresh", ""], ["Rao", "V. Sree Hari", ""]]}, {"id": "1502.00908", "submitter": "Ra\\'ul Torres D\\'iaz", "authors": "Ra\\'ul Torres, Rosa E. Lillo and Henry Laniado", "title": "A Directional Multivariate Value at Risk", "comments": "30 pages, 9 figures", "journal-ref": "Insurance: Mathematics and Economics, Volume 65, November 2015,\n  Pages 111-123", "doi": "10.1016/j.insmatheco.2015.09.002", "report-no": null, "categories": "q-fin.RM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In economics, insurance and finance, value at risk (VaR) is a widely used\nmeasure of the risk of loss on a specific portfolio of financial assets. For a\ngiven portfolio, time horizon, and probability $\\alpha$, the $100\\alpha\\%$ VaR\nis defined as a threshold loss value, such that the probability that the loss\non the portfolio over the given time horizon exceeds this value is $\\alpha$.\nThat is to say, it is a quantile of the distribution of the losses, which has\nboth good analytic properties and easy interpretation as a risk measure.\nHowever, its extension to the multivariate framework is not unique because a\nunique definition of multivariate quantile does not exist. In the current\nliterature, the multivariate quantiles are related to a specific partial order\nconsidered in $\\mathbb{R}^{n}$, or to a property of the univariate quantile\nthat is desirable to be extended to $\\mathbb{R}^{n}$. In this work, we\nintroduce a multivariate value at risk as a vector-valued directional risk\nmeasure, based on a directional multivariate quantile, which has recently been\nintroduced in the literature. The directional approach allows the manager to\nconsider external information or risk preferences in her/his analysis. We have\nderived some properties of the risk measure and we have compared the univariate\n\\textit{VaR} over the marginals with the components of the directional\nmultivariate VaR. We have also analyzed the relationship between some families\nof copulas, for which it is possible to obtain closed forms of the multivariate\nVaR that we propose. Finally, comparisons with other alternative multivariate\nVaR given in the literature, are provided in terms of robustness.\n", "versions": [{"version": "v1", "created": "Tue, 3 Feb 2015 16:10:35 GMT"}], "update_date": "2018-03-15", "authors_parsed": [["Torres", "Raúl", ""], ["Lillo", "Rosa E.", ""], ["Laniado", "Henry", ""]]}, {"id": "1502.01918", "submitter": "Sabrina Mulinacci", "authors": "Umberto Cherubini and Sabrina Mulinacci", "title": "Systemic Risk with Exchangeable Contagion: Application to the European\n  Banking System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model and an estimation technique to distinguish systemic risk\nand contagion in credit risk. The main idea is to assume, for a set of $d$\nobligors, a set of $d$ idiosyncratic shocks and a shock that triggers the\ndefault of all them. All shocks are assumed to be linked by a dependence\nrelationship, that in this paper is assumed to be exchangeable and Archimedean.\nThis approach is able to encompass both systemic risk and contagion, with the\nMarshall-Olkin pure systemic risk model and the Archimedean contagion model as\nextreme cases. Moreover, we show that assuming an affine structure for the\nintensities of idiosyncratic and systemic shocks and a Gumbel copula, the\napproach delivers a complete multivariate distribution with exponential\nmarginal distributions. The model can be estimated by applying a moment\nmatching procedure to the bivariate marginals. We also provide an easy visual\ncheck of the good specification of the model. The model is applied to a\nselected sample of banks for 8 European countries, assuming a common shock for\nevery country. The model is found to be well specified for 4 of the 8\ncountries. We also provide the theoretical extension of the model to the\nnon-exchangeable case and we suggest possible avenues of research for the\nestimation.\n", "versions": [{"version": "v1", "created": "Fri, 6 Feb 2015 15:12:28 GMT"}], "update_date": "2015-02-09", "authors_parsed": [["Cherubini", "Umberto", ""], ["Mulinacci", "Sabrina", ""]]}, {"id": "1502.03252", "submitter": "Cosimo Munari", "authors": "Pablo Koch-Medina, Cosimo Munari, Mario Sikic", "title": "Diversification, protection of liability holders and regulatory\n  arbitrage", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Any solvency regime for financial institutions should be aligned with the\nfundamental objectives of regulation: protecting liability holders and securing\nthe stability of the financial system. The first objective leads to consider\nsurplus-invariant capital adequacy tests, i.e. tests that do not depend on the\nsurplus of a financial institution. We provide a complete characterization of\nclosed, convex, surplus-invariant capital adequacy tests that highlights an\ninherent tension between surplus-invariance and the desire to give credit for\ndiversification. The second objective leads to requiring consistency of capital\nadequacy tests across jurisdictions. Of particular importance in this respect\nare capital adequacy tests that remain invariant under a change of\nnum\\'{e}raire. We establish an intimate link between surplus- and num\\'{e}raire\ninvariant tests.\n", "versions": [{"version": "v1", "created": "Wed, 11 Feb 2015 10:36:02 GMT"}, {"version": "v2", "created": "Mon, 29 Jun 2015 13:29:35 GMT"}, {"version": "v3", "created": "Mon, 4 Apr 2016 09:26:22 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Koch-Medina", "Pablo", ""], ["Munari", "Cosimo", ""], ["Sikic", "Mario", ""]]}, {"id": "1502.06217", "submitter": "Fabio Caccioli", "authors": "Imre Kondor, Fabio Caccioli, G\\'abor Papp, Matteo Marsili", "title": "Contour map of estimation error for Expected Shortfall", "comments": "5 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.PM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The contour map of estimation error of Expected Shortfall (ES) is\nconstructed. It allows one to quantitatively determine the sample size (the\nlength of the time series) required by the optimization under ES of large\ninstitutional portfolios for a given size of the portfolio, at a given\nconfidence level and a given estimation error.\n", "versions": [{"version": "v1", "created": "Sun, 22 Feb 2015 12:23:08 GMT"}], "update_date": "2015-02-24", "authors_parsed": [["Kondor", "Imre", ""], ["Caccioli", "Fabio", ""], ["Papp", "Gábor", ""], ["Marsili", "Matteo", ""]]}, {"id": "1502.06984", "submitter": "Jordi Molins", "authors": "J. Molins and E. Vives", "title": "Model risk on credit risk", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops the Jungle model in a credit portfolio framework. The\nJungle model is able to model credit contagion, produce doubly-peaked\nprobability distributions for the total default loss and endogenously generate\nquasi phase transitions, potentially leading to systemic credit events which\nhappen unexpectedly and without an underlying single cause. We show the Jungle\nmodel provides the optimal probability distribution for credit losses, under\nsome reasonable empirical constraints. The Dandelion model, a particular case\nof the Jungle model, is presented, motivated and exactly solved. The Dandelion\nmodel provides an explicit example of doubly-peaked probability distribution\nfor the credit losses. The Diamond model, another instance of the Jungle model,\nexperiences the so called quasi phase transitions; in particular, both the U.S.\nsubprime and the European sovereign crises are shown to be potential examples\nof quasi phase transitions. We argue the three known sources of default\nclustering (contagion, macroeconomic risk factors and frailty) can be\nunderstood under the unifying framework of contagion. We suggest how the Jungle\nmodel is able to explain a series of empirical stylized facts in credit\nportfolios, hard to reconcile by some standard credit portfolio models. We show\nthe Jungle model can handle inhomogeneous portfolios with state-dependent\nrecovery rates. We look at model risk in a credit risk framework under the\nJungle model, especially in relation to systemic risks posed by doubly-peaked\ndistributions and quasi phase transitions.\n", "versions": [{"version": "v1", "created": "Tue, 17 Feb 2015 06:06:52 GMT"}, {"version": "v2", "created": "Fri, 24 Jul 2015 17:17:32 GMT"}, {"version": "v3", "created": "Tue, 1 Dec 2015 13:15:02 GMT"}], "update_date": "2015-12-02", "authors_parsed": [["Molins", "J.", ""], ["Vives", "E.", ""]]}, {"id": "1502.07961", "submitter": "Zachary Feinstein", "authors": "Zachary Feinstein, Birgit Rudloff, Stefan Weber", "title": "Measures of Systemic Risk", "comments": "35 pages, 11 figures", "journal-ref": "SIAM Journal on Financial Mathematics 8 (1), 672-708 (2017)", "doi": "10.1137/16M1066087", "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Systemic risk refers to the risk that the financial system is susceptible to\nfailures due to the characteristics of the system itself. The tremendous cost\nof systemic risk requires the design and implementation of tools for the\nefficient macroprudential regulation of financial institutions. The current\npaper proposes a novel approach to measuring systemic risk.\n  Key to our construction is a rigorous derivation of systemic risk measures\nfrom the structure of the underlying system and the objectives of a financial\nregulator. The suggested systemic risk measures express systemic risk in terms\nof capital endowments of the financial firms. Their definition requires two\ningredients: a cash flow or value model that assigns to the capital allocations\nof the entities in the system a relevant stochastic outcome; and an\nacceptability criterion, i.e. a set of random outcomes that are acceptable to a\nregulatory authority. Systemic risk is measured by the set of allocations of\nadditional capital that lead to acceptable outcomes. We explain the conceptual\nframework and the definition of systemic risk measures, provide an algorithm\nfor their computation, and illustrate their application in numerical case\nstudies.\n  Many systemic risk measures in the literature can be viewed as the minimal\namount of capital that is needed to make the system acceptable after\naggregating individual risks, hence quantify the costs of a bail-out. In\ncontrast, our approach emphasizes operational systemic risk measures that\ninclude both ex post bailout costs as well as ex ante capital requirements and\nmay be used to prevent systemic crises.\n", "versions": [{"version": "v1", "created": "Fri, 27 Feb 2015 16:39:12 GMT"}, {"version": "v2", "created": "Wed, 29 Apr 2015 13:36:53 GMT"}, {"version": "v3", "created": "Tue, 15 Mar 2016 21:14:38 GMT"}, {"version": "v4", "created": "Thu, 17 Mar 2016 14:09:18 GMT"}, {"version": "v5", "created": "Thu, 13 Oct 2016 22:20:27 GMT"}], "update_date": "2021-04-06", "authors_parsed": [["Feinstein", "Zachary", ""], ["Rudloff", "Birgit", ""], ["Weber", "Stefan", ""]]}]