[{"id": "1504.00640", "submitter": "Freddy Delbaen", "authors": "Freddy Delbaen", "title": "Remark on the Paper \"Entropic Value-at-Risk: A New Coherent Risk\n  Measure\" by Amir Ahmadi-Javid, J. Opt. Theory and Appl., 155\n  (2001),1105--1123", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper mentioned in the title introduces the entropic value at risk. I\ngive some extra comments and using the general theory make a relation with some\ncommonotone risk measures.\n", "versions": [{"version": "v1", "created": "Wed, 1 Apr 2015 07:06:03 GMT"}], "update_date": "2015-04-03", "authors_parsed": [["Delbaen", "Freddy", ""]]}, {"id": "1504.01857", "submitter": "Marco Bardoscia", "authors": "Marco Bardoscia, Stefano Battiston, Fabio Caccioli, Guido Caldarelli", "title": "DebtRank: A microscopic foundation for shock propagation", "comments": "10 pages, 2 figures", "journal-ref": "PLoS ONE 10(6): e0130406 (2015)", "doi": "10.1371/journal.pone.0130406", "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The DebtRank algorithm has been increasingly investigated as a method to\nestimate the impact of shocks in financial networks, as it overcomes the\nlimitations of the traditional default-cascade approaches. Here we formulate a\ndynamical \"microscopic\" theory of instability for financial networks by\niterating balance sheet identities of individual banks and by assuming a simple\nrule for the transfer of shocks from borrowers to lenders. By doing so, we\ngeneralise the DebtRank formulation, both providing an interpretation of the\neffective dynamics in terms of basic accounting principles and preventing the\nunderestimation of losses on certain network topologies. Depending on the\nstructure of the interbank leverage matrix the dynamics is either stable, in\nwhich case the asymptotic state can be computed analytically, or unstable,\nmeaning that at least one bank will default. We apply this framework to a\ndataset of the top listed European banks in the period 2008 - 2013. We find\nthat network effects can generate an amplification of exogenous shocks of a\nfactor ranging between three (in normal periods) and six (during the crisis)\nwhen we stress the system with a 0.5% shock on external (i.e. non-interbank)\nassets for all banks.\n", "versions": [{"version": "v1", "created": "Wed, 8 Apr 2015 07:57:16 GMT"}, {"version": "v2", "created": "Thu, 4 Jun 2015 14:41:11 GMT"}], "update_date": "2018-11-21", "authors_parsed": [["Bardoscia", "Marco", ""], ["Battiston", "Stefano", ""], ["Caccioli", "Fabio", ""], ["Caldarelli", "Guido", ""]]}, {"id": "1504.02896", "submitter": "Marco Bianchetti", "authors": "Marco Bianchetti, Sergei Kucherenko, Stefano Scoleri", "title": "Pricing and Risk Management with High-Dimensional Quasi Monte Carlo and\n  Global Sensitivity Analysis", "comments": "43 pages, 21 figures, 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.CP q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We review and apply Quasi Monte Carlo (QMC) and Global Sensitivity Analysis\n(GSA) techniques to pricing and risk management (greeks) of representative\nfinancial instruments of increasing complexity. We compare QMC vs standard\nMonte Carlo (MC) results in great detail, using high-dimensional Sobol' low\ndiscrepancy sequences, different discretization methods, and specific analyses\nof convergence, performance, speed up, stability, and error optimization for\nfinite differences greeks. We find that our QMC outperforms MC in most cases,\nincluding the highest-dimensional simulations and greeks calculations, showing\nfaster and more stable convergence to exact or almost exact results. Using GSA,\nwe are able to fully explain our findings in terms of reduced effective\ndimension of our QMC simulation, allowed in most cases, but not always, by\nBrownian bridge discretization. We conclude that, beyond pricing, QMC is a very\npromising technique also for computing risk figures, greeks in particular, as\nit allows to reduce the computational effort of high-dimensional Monte Carlo\nsimulations typical of modern risk management.\n", "versions": [{"version": "v1", "created": "Sat, 11 Apr 2015 16:53:43 GMT"}], "update_date": "2015-04-14", "authors_parsed": [["Bianchetti", "Marco", ""], ["Kucherenko", "Sergei", ""], ["Scoleri", "Stefano", ""]]}, {"id": "1504.03733", "submitter": "Leopoldo Catania", "authors": "Mauro Bernardi and Leopoldo Catania", "title": "Switching-GAS Copula Models With Application to Systemic Risk", "comments": "59 pages, 60 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent financial disasters have emphasised the need to accurately predict\nextreme financial losses and their consequences for the institutions belonging\nto a given financial market. The ability of econometric models to predict\nextreme events strongly relies on their flexibility to account for the highly\nnonlinear and asymmetric dependence observed in financial returns. We develop a\nnew class of flexible Copula models where the evolution of the dependence\nparameters follow a Markov-Switching Generalised Autoregressive Score (SGASC)\ndynamics. Maximum Likelihood estimation is consistently performed using the\nInference Functions for Margins (IFM) approach and a version of the\nExpectation-Maximisation (EM) algorithm specifically tailored to this class of\nmodels. The SGASC models are then used to estimate the Conditional\nValue-at-Risk (CoVaR), which is defined as the VaR of a given asset conditional\non another asset (or portfolio) being in financial distress, and the\nConditional Expected Shortfall (CoES). Our empirical investigation shows that\nthe proposed SGASC models are able to explain and predict the systemic risk\ncontribution of several European countries. Moreover, we also find that the\nSGASC models outperform competitors using several CoVaR backtesting procedures.\n", "versions": [{"version": "v1", "created": "Tue, 14 Apr 2015 21:43:23 GMT"}, {"version": "v2", "created": "Fri, 18 Dec 2015 17:50:06 GMT"}, {"version": "v3", "created": "Thu, 21 Jan 2016 16:34:01 GMT"}], "update_date": "2016-01-22", "authors_parsed": [["Bernardi", "Mauro", ""], ["Catania", "Leopoldo", ""]]}, {"id": "1504.04774", "submitter": "Jianing Zhang", "authors": "Claudia Kl\\\"uppelberg, Jianing Zhang", "title": "Time-consistency of risk measures with GARCH volatilities and their\n  estimation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we study time-consistent risk measures for returns that are\ngiven by a GARCH(1,1) model. We present a construction of risk measures based\non their static counterparts that overcomes the lack of time-consistency. We\nthen study in detail our construction for the risk measures Value-at-Risk (VaR)\nand Average Value-at-Risk (AVaR). While in the VaR case we can derive an\nanalytical formula for its time-consistent counterpart, in the AVaR case we\nderive lower and upper bounds to its time-consistent version. Furthermore, we\nincorporate techniques from Extreme Value Theory (EVT) to allow for a more\ntail-geared statistical analysis of the corresponding risk measures. We\nconclude with an application of our results to a data set of stock prices.\n", "versions": [{"version": "v1", "created": "Sat, 18 Apr 2015 22:57:22 GMT"}, {"version": "v2", "created": "Mon, 1 Feb 2016 09:50:46 GMT"}], "update_date": "2016-02-02", "authors_parsed": [["Klüppelberg", "Claudia", ""], ["Zhang", "Jianing", ""]]}, {"id": "1504.05737", "submitter": "Marko Jusup", "authors": "Joung-Hun Lee, Marko Jusup, Boris Podobnik, Yoh Iwasa", "title": "Agent-based mapping of credit risk for sustainable microfinance", "comments": "9 pages, 5 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0126447", "report-no": null, "categories": "q-fin.RM physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Inspired by recent ideas on how the analysis of complex financial risks can\nbenefit from analogies with independent research areas, we propose an\nunorthodox framework for mapping microfinance credit risk---a major obstacle to\nthe sustainability of lenders outreaching to the poor. Specifically, using the\nelements of network theory, we constructed an agent-based model that obeys the\nstylised rules of microfinance industry. We found that in a deteriorating\neconomic environment confounded with adverse selection, a form of latent moral\nhazard may cause a regime shift from a high to a low loan repayment\nprobability. An after-the-fact recovery, when possible, required the economic\nenvironment to improve beyond that which led to the shift in the first place.\nThese findings suggest a small set of measurable quantities for mapping\nmicrofinance credit risk and, consequently, for balancing the requirements to\nreasonably price loans and to operate on a fully self-financed basis. We\nillustrate how the proposed mapping works using a 10-year monthly data set from\none of the best-known microfinance representatives, Grameen Bank in Bangladesh.\nFinally, we discuss an entirely new perspective for managing microfinance\ncredit risk based on enticing spontaneous cooperation by building social\ncapital.\n", "versions": [{"version": "v1", "created": "Wed, 22 Apr 2015 11:26:03 GMT"}], "update_date": "2018-11-21", "authors_parsed": [["Lee", "Joung-Hun", ""], ["Jusup", "Marko", ""], ["Podobnik", "Boris", ""], ["Iwasa", "Yoh", ""]]}, {"id": "1504.06094", "submitter": "Miryana Grigorova", "authors": "Miryana Grigorova, Peter Imkeller, Elias Offen, Youssef Ouknine,\n  Marie-Claire Quenez (LPMA)", "title": "Reflected BSDEs when the obstacle is not right-continuous and optimal\n  stopping", "comments": null, "journal-ref": "The Annals of Applied Probability : an official journal of the\n  institute of mathematical statistics, The Institute of Mathematical\n  Statistics, 2017", "doi": null, "report-no": null, "categories": "math.PR q-fin.CP q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the first part of the paper, we study reflected backward stochastic\ndifferential equations (RBSDEs) with lower obstacle which is assumed to be\nright upper-semicontinuous but not necessarily right-continuous. We prove\nexistence and uniqueness of the solutions to such RBSDEs in appropriate Banach\nspaces. The result is established by using some tools from the general theory\nof processes such as Mertens decomposition of optional strong (but not\nnecessarily right-continuous) supermartingales, some tools from optimal\nstopping theory, as well as an appropriate generalization of It{\\^o}'s formula\ndue to Gal'chouk and Lenglart. In the second part of the paper, we provide some\nlinks between the RBSDE studied in the first part and an optimal stopping\nproblem in which the risk of a financial position $\\xi$ is assessed by an\n$f$-conditional expectation $\\mathcal{E}^f(\\cdot)$ (where $f$ is a Lipschitz\ndriver). We characterize the \"value function\" of the problem in terms of the\nsolution to our RBSDE. Under an additional assumption of left\nupper-semicontinuity on $\\xi$, we show the existence of an optimal stopping\ntime. We also provide a generalization of Mertens decomposition to the case of\nstrong $\\mathcal{E}^f$-supermartingales.\n", "versions": [{"version": "v1", "created": "Thu, 23 Apr 2015 09:13:44 GMT"}, {"version": "v2", "created": "Wed, 10 May 2017 12:14:30 GMT"}], "update_date": "2017-05-11", "authors_parsed": [["Grigorova", "Miryana", "", "LPMA"], ["Imkeller", "Peter", "", "LPMA"], ["Offen", "Elias", "", "LPMA"], ["Ouknine", "Youssef", "", "LPMA"], ["Quenez", "Marie-Claire", "", "LPMA"]]}, {"id": "1504.07152", "submitter": "Aki-Hiro Sato", "authors": "Aki-Hiro Sato, Paolo Tasca, Takashi Isogai", "title": "Dynamic Interaction Between Asset Prices and Bank Behavior: A Systemic\n  Risk Perspective", "comments": "26 pages, 35 figures, 21st Computing in Economics and Finance\n  (CEF2015)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.CP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Systemic risk in banking systems remains a crucial issue that it has not been\ncompletely understood. In our toy model, banks are exposed to two sources of\nrisks, namely, market risk from their investments in assets external to the\nbanking system and credit risk from their lending in the interbank market. By\nand large, both risks increase during severe financial turmoil. Under this\nscenario, the paper shows the conditions under which both the individual and\nthe systemic default tend to coincide.\n", "versions": [{"version": "v1", "created": "Mon, 27 Apr 2015 16:34:59 GMT"}, {"version": "v2", "created": "Tue, 2 Jun 2015 12:57:14 GMT"}, {"version": "v3", "created": "Sat, 18 Feb 2017 00:39:29 GMT"}], "update_date": "2017-02-24", "authors_parsed": [["Sato", "Aki-Hiro", ""], ["Tasca", "Paolo", ""], ["Isogai", "Takashi", ""]]}, {"id": "1504.07805", "submitter": "Vivien Brunel", "authors": "Vivien Brunel", "title": "Operational risk modeled analytically II: the consequences of\n  classification invariance", "comments": "7 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most of the banks' operational risk internal models are based on loss pooling\nin risk and business line categories. The parameters and outputs of operational\nrisk models are sensitive to the pooling of the data and the choice of the risk\nclassification. In a simple model, we establish the link between the number of\nrisk cells and the model parameters by requiring invariance of the bank's loss\ndistribution upon a change in classification. We provide details on the impact\nof this requirement on the domain of attraction of the loss distribution, on\ndiversification effects and on cell risk correlations.\n", "versions": [{"version": "v1", "created": "Wed, 29 Apr 2015 10:53:07 GMT"}, {"version": "v2", "created": "Mon, 11 May 2015 15:36:01 GMT"}], "update_date": "2015-05-12", "authors_parsed": [["Brunel", "Vivien", ""]]}]