[{"id": "1602.00125", "submitter": "Wei-Xing Zhou", "authors": "Rui-Qi Han (ECUST), Wen-Jie Xie (ECUST), Xiong Xiong (TJU), Wei Zhang\n  (TJU), Wei-Xing Zhou (ECUST)", "title": "Market correlation structure changes around the Great Crash", "comments": "6 pages including 5 figures", "journal-ref": "Fluctuation and Noise Letters 16 (2), 1750018 (2017)", "doi": "10.1142/S0219477517500183", "report-no": null, "categories": "q-fin.ST q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We perform a comparative analysis of the Chinese stock market around the\noccurrence of the 2008 crisis based on the random matrix analysis of\nhigh-frequency stock returns of 1228 stocks listed on the Shanghai and Shenzhen\nstock exchanges. Both raw correlation matrix and partial correlation matrix\nwith respect to the market index in two time periods of one year are\ninvestigated. We find that the Chinese stocks have stronger average correlation\nand partial correlation in 2008 than in 2007 and the average partial\ncorrelation is significantly weaker than the average correlation in each\nperiod. Accordingly, the largest eigenvalue of the correlation matrix is\nremarkably greater than that of the partial correlation matrix in each period.\nMoreover, each largest eigenvalue and its eigenvector reflect an evident market\neffect, while other deviating eigenvalues do not. We find no evidence that\ndeviating eigenvalues contain industrial sectorial information. Surprisingly,\nthe eigenvectors of the second largest eigenvalues in 2007 and of the third\nlargest eigenvalues in 2008 are able to distinguish the stocks from the two\nexchanges. We also find that the component magnitudes of the some largest\neigenvectors are proportional to the stocks' capitalizations.\n", "versions": [{"version": "v1", "created": "Sat, 30 Jan 2016 14:44:56 GMT"}], "update_date": "2017-04-19", "authors_parsed": [["Han", "Rui-Qi", "", "ECUST"], ["Xie", "Wen-Jie", "", "ECUST"], ["Xiong", "Xiong", "", "TJU"], ["Zhang", "Wei", "", "TJU"], ["Zhou", "Wei-Xing", "", "ECUST"]]}, {"id": "1602.00865", "submitter": "Johannes Rauch", "authors": "Johannes Rauch, Carol Alexander", "title": "Tail Risk Premia for Long-Term Equity Investors", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PR q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use the P&L on a particular class of swaps, representing variance and\nhigher moments for log returns, as estimators in our empirical study on the\nS&P500 that investigates the factors determining variance and higher-moment\nrisk premia. This class is the discretisation invariant sub-class of swaps with\nNeuberger's aggregating characteristics. Besides the market excess return,\nmomentum is the dominant driver for both skewness and kurtosis risk premia,\nwhich exhibit a highly significant negative correlation. By contrast, the\nvariance risk premium responds positively to size and negatively to growth, and\nthe correlation between variance and tail risk premia is relatively low\ncompared with previous research, particularly at high sampling frequencies.\nThese findings extend prior research on determinants of these risk premia.\nFurthermore, our meticulous data-construction methodology avoids unwanted\nartefacts which distort results.\n", "versions": [{"version": "v1", "created": "Tue, 2 Feb 2016 10:27:14 GMT"}], "update_date": "2016-02-03", "authors_parsed": [["Rauch", "Johannes", ""], ["Alexander", "Carol", ""]]}, {"id": "1602.03505", "submitter": "Sebastian Poledna", "authors": "Sebastian Poledna, Olaf Bochmann and Stefan Thurner", "title": "Basel III capital surcharges for G-SIBs fail to control systemic risk\n  and can cause pro-cyclical side effects", "comments": "12 pages, 3 figures. arXiv admin note: text overlap with\n  arXiv:1401.8026", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In addition to constraining bilateral exposures of financial institutions,\nthere are essentially two options for future financial regulation of systemic\nrisk (SR): First, financial regulation could attempt to reduce the financial\nfragility of global or domestic systemically important financial institutions\n(G-SIBs or D-SIBs), as for instance proposed in Basel III. Second, future\nfinancial regulation could attempt strengthening the financial system as a\nwhole. This can be achieved by re-shaping the topology of financial networks.\nWe use an agent-based model (ABM) of a financial system and the real economy to\nstudy and compare the consequences of these two options. By conducting three\n\"computer experiments\" with the ABM we find that re-shaping financial networks\nis more effective and efficient than reducing leverage. Capital surcharges for\nG-SIBs can reduce SR, but must be larger than those specified in Basel III in\norder to have a measurable impact. This can cause a loss of efficiency. Basel\nIII capital surcharges for G-SIBs can have pro-cyclical side effects.\n", "versions": [{"version": "v1", "created": "Wed, 10 Feb 2016 20:29:15 GMT"}], "update_date": "2016-02-18", "authors_parsed": [["Poledna", "Sebastian", ""], ["Bochmann", "Olaf", ""], ["Thurner", "Stefan", ""]]}, {"id": "1602.04902", "submitter": "Zurab Kakushadze", "authors": "Zura Kakushadze and Willie Yu", "title": "Multifactor Risk Models and Heterotic CAPM", "comments": "49 pages; one reference updated; to appear in The Journal of\n  Investment Strategies. arXiv admin note: substantial text overlap with\n  arXiv:1508.04883", "journal-ref": "The Journal of Investment Strategies 5(4) (2016) 1-49", "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a complete algorithm and source code for constructing general\nmultifactor risk models (for equities) via any combination of style factors,\nprincipal components (betas) and/or industry factors. For short horizons we\nemploy the Russian-doll risk model construction to obtain a nonsingular factor\ncovariance matrix. This generalizes the heterotic risk model construction to\ninclude arbitrary non-industry risk factors as well as industry risk factors\nwith generic \"weights\". The aim of sharing our proprietary know-how with the\ninvestment community is to encourage organic risk model building. The\npresentation is intended to be essentially self-contained and pedagogical. So,\nstop wasting money and complaining, start building risk models and enjoy!\n", "versions": [{"version": "v1", "created": "Tue, 16 Feb 2016 04:04:53 GMT"}, {"version": "v2", "created": "Fri, 18 Mar 2016 17:37:15 GMT"}], "update_date": "2016-09-12", "authors_parsed": [["Kakushadze", "Zura", ""], ["Yu", "Willie", ""]]}, {"id": "1602.05477", "submitter": "Cosimo Munari", "authors": "Pablo Koch-Medina, Cosimo Munari, Gregor Svindland", "title": "Which eligible assets are compatible with comonotonic capital\n  requirements?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Within the context of capital adequacy, we study comonotonicity of risk\nmeasures in terms of the primitives of the theory: acceptance sets and\neligible, or reference, assets. We show that comonotonicity cannot be\ncharacterized by the properties of the acceptance set alone and heavily depends\non the choice of the eligible asset. In fact, in many important cases,\ncomonotonicity is only compatible with risk-free eligible assets. The\nincompatibility with risky eligible assets is systematic whenever the\nacceptability criterion is based on Value at Risk or any convex distortion risk\nmeasure such as Expected Shortfall. These findings qualify and arguably call\nfor a critical appraisal of the meaning and the role of comonotonicity within a\ncapital adequacy context.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2016 16:35:23 GMT"}, {"version": "v2", "created": "Fri, 20 May 2016 12:10:03 GMT"}, {"version": "v3", "created": "Mon, 2 Jan 2017 16:04:48 GMT"}, {"version": "v4", "created": "Fri, 18 Aug 2017 09:57:54 GMT"}, {"version": "v5", "created": "Wed, 20 Jan 2021 08:03:42 GMT"}], "update_date": "2021-01-21", "authors_parsed": [["Koch-Medina", "Pablo", ""], ["Munari", "Cosimo", ""], ["Svindland", "Gregor", ""]]}, {"id": "1602.05749", "submitter": "Stavros Stavroyiannis", "authors": "Stavros Stavroyiannis", "title": "Value-at-Risk and backtesting with the APARCH model and the standardized\n  Pearson type IV distribution", "comments": "21 pages, 3 figures, 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine the efficiency of the Asymmetric Power ARCH (APARCH) model in the\ncase where the residuals follow the standardized Pearson type IV distribution.\nThe model is tested with a variety of loss functions and the efficiency is\nexamined via application of several statistical tests and risk measures. The\nresults indicate that the APARCH model with the standardized Pearson type IV\ndistribution is accurate, within the general financial risk modeling\nperspective, providing the financial analyst with an additional skewed\ndistribution for incorporation in the risk management tools.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2016 10:34:29 GMT"}], "update_date": "2016-02-19", "authors_parsed": [["Stavroyiannis", "Stavros", ""]]}, {"id": "1602.05883", "submitter": "Marco Bardoscia", "authors": "Marco Bardoscia, Stefano Battiston, Fabio Caccioli, Guido Caldarelli", "title": "Pathways towards instability in financial networks", "comments": "9 pages, 3 figures. Supplementary Material: 12 pages, 5 figures", "journal-ref": "Nature Communications 8, 14416 (2017)", "doi": "10.1038/ncomms14416", "report-no": null, "categories": "q-fin.RM physics.soc-ph q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Following the financial crisis of 2007-2008, a deep analogy between the\norigins of instability in financial systems and complex ecosystems has been\npointed out: in both cases, topological features of network structures\ninfluence how easily distress can spread within the system. However, in\nfinancial network models, the details of how financial institutions interact\ntypically play a decisive role, and a general understanding of precisely how\nnetwork topology creates instability remains lacking. Here we show how\nprocesses that are widely believed to stabilise the financial system, i.e.\nmarket integration and diversification, can actually drive it towards\ninstability, as they contribute to create cyclical structures which tend to\namplify financial distress, thereby undermining systemic stability and making\nlarge crises more likely. This result holds irrespective of the details of how\ninstitutions interact, showing that policy-relevant analysis of the factors\naffecting financial stability can be carried out while abstracting away from\nsuch details.\n", "versions": [{"version": "v1", "created": "Thu, 18 Feb 2016 17:33:53 GMT"}, {"version": "v2", "created": "Sat, 25 Feb 2017 12:25:22 GMT"}], "update_date": "2017-02-28", "authors_parsed": [["Bardoscia", "Marco", ""], ["Battiston", "Stefano", ""], ["Caccioli", "Fabio", ""], ["Caldarelli", "Guido", ""]]}, {"id": "1602.06585", "submitter": "Tore Opsahl", "authors": "Tore Opsahl and William Newton", "title": "Credit risk and companies' inter-organizational networks: Assessing\n  impact of suppliers and buyers on CDS spreads", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Companies do not operate in a vacuum. As companies move towards an\nincreasingly specialized production function and their reach is becoming truly\nglobal, their aptitude in managing and shaping their inter-organizational\nnetwork is a determining factor in measuring their health. Current models of\ncompany financial health often lack variables explaining the\ninter-organizational network, and as such, assume that (1) all networks are the\nsame and (2) the performance of partners do not impact companies. This paper\naims to be a first step in the direction of removing these assumptions.\nSpecifically, the impact is illustrated by examining the effects of customer\nand supplier concentrations and partners' credit risk on credit-default swap\n(CDS) spreads while controlling for credit risk and size. We rely upon\nsupply-chain data from Bloomberg that provides insight into companies'\nrelationships. The empirical results show that a well diversified customer\nnetwork lowers CDS spread, while having stable partners with low default\nprobabilities increase spreads. The latter result suggests that successful\ncompanies do not focus on building a stable eco-system around themselves, but\ninstead focus on their own profit maximization at the cost of the financial\nhealth of their suppliers' and customers'. At a more general level, the results\nindicate the importance of considering the inter-organizational networks, and\nhighlight the value of including network variables in credit risk models.\n", "versions": [{"version": "v1", "created": "Sun, 21 Feb 2016 21:28:15 GMT"}], "update_date": "2016-02-24", "authors_parsed": [["Opsahl", "Tore", ""], ["Newton", "William", ""]]}, {"id": "1602.07599", "submitter": "Jacopo Corbetta", "authors": "Jacopo Corbetta and Ilaria Peri", "title": "Backtesting Lambda Value at Risk", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.ST", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new risk measure, the lambda value at risk (Lambda VaR), has been recently\nproposed from a theoretical point of view as a generalization of the value at\nrisk (VaR). The Lambda VaR appears attractive for its potential ability to\nsolve several problems of the VaR. In this paper we propose three nonparametric\nbacktesting methodologies for the Lambda VaR which exploit different features.\nTwo of these tests directly assess the correctness of the level of coverage\npredicted by the model. One of these tests is bilateral and provides an\nasymptotic result. A third test assess the accuracy of the Lambda VaR that\ndepends on the choice of the P&L distribution. However, this test requires the\nstorage of more information. Finally, we perform a backtesting exercise and we\ncompare our results with the ones from Hitaj and Peri (2015)\n", "versions": [{"version": "v1", "created": "Wed, 24 Feb 2016 17:06:25 GMT"}, {"version": "v2", "created": "Sun, 12 Jun 2016 13:52:36 GMT"}, {"version": "v3", "created": "Fri, 10 Feb 2017 12:57:34 GMT"}, {"version": "v4", "created": "Fri, 2 Jun 2017 14:17:58 GMT"}], "update_date": "2017-06-05", "authors_parsed": [["Corbetta", "Jacopo", ""], ["Peri", "Ilaria", ""]]}, {"id": "1602.08070", "submitter": "Zurab Kakushadze", "authors": "Zura Kakushadze and Willie Yu", "title": "Statistical Risk Models", "comments": "44 pages; a trivial typo corrected, references updated; to appear in\n  The Journal of Investment Strategies. arXiv admin note: text overlap with\n  arXiv:1602.04902, arXiv:1508.04883, arXiv:1604.08743", "journal-ref": "The Journal of Investment Strategies 6(2) (2017) 1-40", "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give complete algorithms and source code for constructing statistical risk\nmodels, including methods for fixing the number of risk factors. One such\nmethod is based on eRank (effective rank) and yields results similar to (and\nfurther validates) the method set forth in an earlier paper by one of us. We\nalso give a complete algorithm and source code for computing eigenvectors and\neigenvalues of a sample covariance matrix which requires i) no costly\niterations and ii) the number of operations linear in the number of returns.\nThe presentation is intended to be pedagogical and oriented toward practical\napplications.\n", "versions": [{"version": "v1", "created": "Thu, 25 Feb 2016 20:25:42 GMT"}, {"version": "v2", "created": "Tue, 19 Jul 2016 03:05:07 GMT"}, {"version": "v3", "created": "Wed, 25 Jan 2017 18:51:42 GMT"}], "update_date": "2017-03-14", "authors_parsed": [["Kakushadze", "Zura", ""], ["Yu", "Willie", ""]]}]