[{"id": "2001.00529", "submitter": "Marcel Br\\\"autigam", "authors": "Marcel Br\\\"autigam and Marie Kratz", "title": "The Impact of the Choice of Risk and Dispersion Measure on\n  Procyclicality", "comments": "41 pages, 4 Figures, 2 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Procyclicality of historical risk measure estimation means that one tends to\nover-estimate future risk when present realized volatility is high and vice\nversa under-estimate future risk when the realized volatility is low. Out of it\ndifferent questions arise, relevant for applications and theory: What are the\nfactors which affect the degree of procyclicality? More specifically, how does\nthe choice of risk measure affect this? How does this behaviour vary with the\nchoice of realized volatility estimator? How do different underlying model\nassumptions influence the pro-cyclical effect? In this paper we consider three\ndifferent well-known risk measures (Value-at-Risk, Expected Shortfall,\nExpectile), the r-th absolute centred sample moment, for any integer $r>0$, as\nrealized volatility estimator (this includes the sample variance and the sample\nmean absolute deviation around the sample mean) and two models (either an iid\nmodel or an augmented GARCH($p$,$q$) model). We show that the strength of\nprocyclicality depends on these three factors, the choice of risk measure, the\nrealized volatility estimator and the model considered. But, no matter the\nchoices, the procyclicality will always be present.\n", "versions": [{"version": "v1", "created": "Thu, 2 Jan 2020 17:28:31 GMT"}], "update_date": "2020-01-03", "authors_parsed": [["Bräutigam", "Marcel", ""], ["Kratz", "Marie", ""]]}, {"id": "2001.08374", "submitter": "Zhengkun Li", "authors": "Zhengkun Li, Minh-Ngoc Tran, Chao Wang, Richard Gerlach and Junbin Gao", "title": "A Bayesian Long Short-Term Memory Model for Value at Risk and Expected\n  Shortfall Joint Forecasting", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.LG q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Value-at-Risk (VaR) and Expected Shortfall (ES) are widely used in the\nfinancial sector to measure the market risk and manage the extreme market\nmovement. The recent link between the quantile score function and the\nAsymmetric Laplace density has led to a flexible likelihood-based framework for\njoint modelling of VaR and ES. It is of high interest in financial applications\nto be able to capture the underlying joint dynamics of these two quantities. We\naddress this problem by developing a hybrid model that is based on the\nAsymmetric Laplace quasi-likelihood and employs the Long Short-Term Memory\n(LSTM) time series modelling technique from Machine Learning to capture\nefficiently the underlying dynamics of VaR and ES. We refer to this model as\nLSTM-AL. We adopt the adaptive Markov chain Monte Carlo (MCMC) algorithm for\nBayesian inference in the LSTM-AL model. Empirical results show that the\nproposed LSTM-AL model can improve the VaR and ES forecasting accuracy over a\nrange of well-established competing models.\n", "versions": [{"version": "v1", "created": "Thu, 23 Jan 2020 05:13:36 GMT"}, {"version": "v2", "created": "Thu, 13 May 2021 01:19:08 GMT"}], "update_date": "2021-05-14", "authors_parsed": [["Li", "Zhengkun", ""], ["Tran", "Minh-Ngoc", ""], ["Wang", "Chao", ""], ["Gerlach", "Richard", ""], ["Gao", "Junbin", ""]]}, {"id": "2001.08911", "submitter": "Sebastien Valeyre", "authors": "Sebastien Valeyre", "title": "Refined model of the covariance/correlation matrix between securities", "comments": "Universit\\'e Paris 13, Phd dissertation, May 2019, in French", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.PM q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new methodology has been introduced to clean the correlation matrix of\nsingle stocks returns based on a constrained principal component analysis using\nfinancial data. Portfolios were introduced, namely \"Fundamental Maximum\nVariance Portfolios\", to capture in an optimal way the risks defined by\nfinancial criteria (\"Book\", \"Capitalization\", etc.). The constrained\neigenvectors of the correlation matrix, which are the linear combination of\nthese portfolios, are then analyzed. Thanks to this methodology, several\nstylized patterns of the matrix were identified: i) the increase of the first\neigenvalue with a time scale from 1 minute to several months seems to follow\nthe same law for all the significant eigenvalues with 2 regimes; ii) a\nuniversal law seems to govern the weights of all the \"Maximum variance\"\nportfolios, so according to that law, the optimal weights should be\nproportional to the ranking based on the financial studied criteria; iii) the\nvolatility of the volatility of the \"Maximum Variance\" portfolios, which are\nnot orthogonal, could be enough to explain a large part of the diffusion of the\ncorrelation matrix; iv) the leverage effect (increase of the first eigenvalue\nwith the decline of the stock market) occurs only for the first mode and cannot\nbe generalized for other factors of risk. The leverage effect on the beta,\nwhich is the sensitivity of stocks with the market mode, makes variable the\nweights of the first eigenvector.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2020 08:34:47 GMT"}], "update_date": "2020-01-27", "authors_parsed": [["Valeyre", "Sebastien", ""]]}, {"id": "2001.10108", "submitter": "A. Max Reppen", "authors": "Julio Backhoff Veraguas and A. Max Reppen and Ludovic Tangpi", "title": "Stochastic control of optimized certainty equivalents", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimized certainty equivalents (OCEs) is a family of risk measures widely\nused by both practitioners and academics. This is mostly due to its\ntractability and the fact that it encompasses important examples, including\nentropic risk measures and average value at risk.\n  In this work we consider stochastic optimal control problems where the\nobjective criterion is given by an OCE risk measure, or put in other words, a\nrisk minimization problem for controlled diffusions. A major difficulty arises\nsince OCEs are often time inconsistent. Nevertheless, via an enlargement of\nstate space we achieve a substitute of sorts for time consistency in fair\ngenerality. This allows us to derive a dynamic programming principle and thus\nrecover central results of (risk-neutral) stochastic control theory. In\nparticular, we show that the value of our risk minimization problem can be\ncharacterized via the viscosity solution of a Hamilton--Jacobi--Bellman--Issacs\nequation. We further establish the uniqueness of the latter under suitable\ntechnical conditions.\n", "versions": [{"version": "v1", "created": "Mon, 27 Jan 2020 22:36:33 GMT"}], "update_date": "2020-01-29", "authors_parsed": [["Veraguas", "Julio Backhoff", ""], ["Reppen", "A. Max", ""], ["Tangpi", "Ludovic", ""]]}, {"id": "2001.10488", "submitter": "Nassim Nicholas Taleb", "authors": "Nassim Nicholas Taleb", "title": "Statistical Consequences of Fat Tails: Real World Preasymptotics,\n  Epistemology, and Applications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.OT q-fin.RM stat.AP stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The monograph investigates the misapplication of conventional statistical\ntechniques to fat tailed distributions and looks for remedies, when possible.\n  Switching from thin tailed to fat tailed distributions requires more than\n\"changing the color of the dress\". Traditional asymptotics deal mainly with\neither n=1 or $n=\\infty$, and the real world is in between, under of the \"laws\nof the medium numbers\" --which vary widely across specific distributions. Both\nthe law of large numbers and the generalized central limit mechanisms operate\nin highly idiosyncratic ways outside the standard Gaussian or Levy-Stable\nbasins of convergence.\n  A few examples:\n  + The sample mean is rarely in line with the population mean, with effect on\n\"naive empiricism\", but can be sometimes be estimated via parametric methods.\n  + The \"empirical distribution\" is rarely empirical.\n  + Parameter uncertainty has compounding effects on statistical metrics.\n  + Dimension reduction (principal components) fails.\n  + Inequality estimators (GINI or quantile contributions) are not additive and\nproduce wrong results.\n  + Many \"biases\" found in psychology become entirely rational under more\nsophisticated probability distributions\n  + Most of the failures of financial economics, econometrics, and behavioral\neconomics can be attributed to using the wrong distributions.\n  This book, the first volume of the Technical Incerto, weaves a narrative\naround published journal articles.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2020 14:45:55 GMT"}, {"version": "v2", "created": "Tue, 22 Sep 2020 18:12:31 GMT"}], "update_date": "2020-09-24", "authors_parsed": [["Taleb", "Nassim Nicholas", ""]]}, {"id": "2001.11249", "submitter": "Kevin Kurt", "authors": "R\\\"udiger Frey, Kevin Kurt, Camilla Damian", "title": "How Safe are European Safe Bonds? An Analysis from the Perspective of\n  Modern Portfolio Credit Risk Models", "comments": "32 pages", "journal-ref": null, "doi": "10.1016/j.jbankfin.2020.105939", "report-no": null, "categories": "q-fin.PR q-fin.MF q-fin.RM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several proposals for the reform of the euro area advocate the creation of a\nmarket in synthetic securities backed by portfolios of sovereign bonds. Most\ndebated are the so-called European Safe Bonds or ESBies proposed by\nBrunnermeier, Langfield, Pagano,Reis, Van Nieuwerburgh and Vayanos (2017). The\npotential benefits of ESBies and other bond-backed securities hinge on the\nassertion that these products are really safe. In this paper we provide a\ncomprehensive quantitative study of the risks associated with ESBies and\nrelated products, using an affine credit risk model with regime switching as\nvehicle for our analysis. We discuss a recent proposal of Standard and Poors\nfor the rating of ESBies, we analyse the impact of model parameters and\nattachment points on the size and the volatility of the credit spread of ESBies\nand we consider several approaches to assess the market risk of ESBies.\nMoreover, we compare ESBies to synthetic securities created by pooling the\nsenior tranche of national bonds as suggested by Leandro and Zettelmeyer(2019).\nThe paper concludes with a brief discussion of the policy implications from our\nanalysis.\n", "versions": [{"version": "v1", "created": "Thu, 30 Jan 2020 10:51:59 GMT"}, {"version": "v2", "created": "Sat, 11 Jul 2020 10:47:19 GMT"}], "update_date": "2020-09-01", "authors_parsed": [["Frey", "Rüdiger", ""], ["Kurt", "Kevin", ""], ["Damian", "Camilla", ""]]}, {"id": "2001.11891", "submitter": "Natalie Packham", "authors": "N. Packham", "title": "Structured climate financing: valuation of CDOs on inhomogeneous asset\n  pools", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.RM q-fin.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, a number of structured funds have emerged as public-private\npartnerships with the intent of promoting investment in renewable energy in\nemerging markets. These funds seek to attract institutional investors by\ntranching the asset pool and issuing senior notes with a high credit quality.\nFinancing of renewable energy (RE) projects is achieved via two channels: small\nRE projects are financed indirectly through local banks that draw loans from\nthe fund's assets, whereas large RE projects are directly financed from the\nfund. In a bottom-up Gaussian copula framework, we examine the diversification\nproperties and RE exposure of the senior tranche. To this end, we introduce the\nLH++ model, which combines a homogeneous infinitely granular loan portfolio\nwith a finite number of large loans. Using expected tranche percentage notional\n(which takes a similar role as the default probability of a loan), tranche\nprices and tranche sensitivities in RE loans, we analyse the risk profile of\nthe senior tranche. We show how the mix of indirect and direct RE investments\nin the asset pool affects the sensitivity of the senior tranche to RE\ninvestments and how to balance a desired sensitivity with a target credit\nquality and target tranche size.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2020 15:13:58 GMT"}], "update_date": "2020-02-03", "authors_parsed": [["Packham", "N.", ""]]}]