[{"id": "0806.0186", "submitter": "Ping Ao", "authors": "P Ao", "title": "Stochastic Dynamical Structure (SDS) of Nonequilibrium Processes in the\n  Absence of Detailed Balance. IV: Emerging of Stochastic Dynamical Equalities\n  and Steady State Thermodynamics from Darwinian Dynamics", "comments": "latex, 49 pages", "journal-ref": "Emerging of Stochastic Dynamical Equalities and Steady State\n  Thermodynamics. P. Ao, Communications in Theoretical Physics 49 (2008)\n  1073-1090", "doi": "10.1088/0253-6102/49/5/01", "report-no": null, "categories": "cond-mat.other cond-mat.stat-mech math.DS nlin.AO q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This is the fourth paper, the last one, on solution to the problem of absence\nof detailed balance in nonequilibrium processes. It is an approach based on\nanother known universal dynamics: The evolutionary dynamics first conceived by\nDarwin and Wallace, referring to as Darwinian dynamics in the present paper,\nhas been found to be universally valid in biology; The statistical mechanics\nand thermodynamics, while enormously successful in physics, have been in an\nawkward situation of wanting a consistent dynamical understanding; Here we\npresent from a formal point of view an exploration of the connection between\nthermodynamics and Darwinian dynamics and a few related topics. We first show\nthat the stochasticity in Darwinian dynamics implies the existence temperature,\nhence the canonical distribution of Boltzmann-Gibbs type. In term of relative\nentropy the Second Law of thermodynamics is dynamically demonstrated without\ndetailed balance condition, and is valid regardless of size of the system. In\nparticular, the dynamical component responsible for breaking detailed balance\ncondition does not contribute to the change of the relative entropy. Two types\nof stochastic dynamical equalities of current interest are explicitly discussed\nin the present approach: One is based on Feynman-Kac formula and another is a\ngeneralization of Einstein relation. Both are directly accessible to\nexperimental tests. Our demonstration indicates that Darwinian dynamics\nrepresents logically a simple and straightforward starting point for\nstatistical mechanics and thermodynamics and is complementary to and consistent\nwith conservative dynamics that dominates the physical sciences. Present\nexploration suggests the existence of a unified stochastic dynamical framework\nboth near and far from equilibrium.\n", "versions": [{"version": "v1", "created": "Sun, 1 Jun 2008 23:29:57 GMT"}], "update_date": "2008-06-03", "authors_parsed": [["Ao", "P", ""]]}, {"id": "0806.0263", "submitter": "Francisco Fernandez Dr.", "authors": "Francisco M. Fernandez", "title": "On Some Perturbation Approaches to Population Dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math-ph math.MP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the Adomian decomposition method, the time--series expansion,\nthe homotopy--perturbation method, and the variational--iteration method\ncompletely fail to provide a reasonable description of the dynamics of the\nsimplest prey--predator system.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jun 2008 12:21:31 GMT"}], "update_date": "2008-06-14", "authors_parsed": [["Fernandez", "Francisco M.", ""]]}, {"id": "0806.0691", "submitter": "Vladimir Ivancevic", "authors": "Tijana T. Ivancevic", "title": "Ricci Flow and Entropy Model for Avascular Tumor Growth and Decay\n  Control", "comments": "24 pages, 2 figures, Latex, revised", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Prediction and control of cancer invasion is a vital problem in medical\nscience. This paper proposes a modern geometric Ricci-flow and entropy based\nmodel for control of avascular multicellular tumor spheroid growth and decay.\nAs a tumor growth/decay control tool, a monoclonal antibody therapy is\nproposed.\n  Keywords: avascular tumor growth and decay, multicellular tumor spheroid,\nRicci flow and entropy, nonlinear heat equation, monoclonal antibody cancer\ntherapy\n", "versions": [{"version": "v1", "created": "Wed, 4 Jun 2008 14:51:38 GMT"}, {"version": "v2", "created": "Thu, 5 Jun 2008 07:06:09 GMT"}, {"version": "v3", "created": "Tue, 10 Jun 2008 01:53:22 GMT"}, {"version": "v4", "created": "Sun, 31 Aug 2008 05:20:28 GMT"}], "update_date": "2008-08-31", "authors_parsed": [["Ivancevic", "Tijana T.", ""]]}, {"id": "0806.0979", "submitter": "Peter Klimek", "authors": "Peter Klimek, Stefan Thurner, Rudolf Hanel", "title": "Pruning the Tree of Life: k-core Percolation as Selection Mechanism", "comments": "6 pages, 3 eps figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model for evolution aiming to reproduce statistical features of\nfossil data, in particular the distributions of extinction events, the\ndistribution of species per genus and the distribution of lifetimes, all of\nwhich are known to be of power law type. The model incorporates both\nspecies-species interactions and ancestral relationships. The main novelty of\nthis work is to show the feasibility of k-core percolation as a selection\nmechanism. We give theoretical predictions for the observable distributions,\nconfirm their validity by computer simulation and report good agreement with\nthe fossil data. A key feature of the proposed model is a co-evolving fitness\nlandscape determined by the topology of the underlying species interactions,\necological niches emerge naturally. The predicted distributions are independent\nof the rate of speciation, i.e. whether one adopts an gradualist or punctuated\nview of evolution.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2008 14:27:34 GMT"}], "update_date": "2008-06-06", "authors_parsed": [["Klimek", "Peter", ""], ["Thurner", "Stefan", ""], ["Hanel", "Rudolf", ""]]}, {"id": "0806.1186", "submitter": "Denis Boyer", "authors": "Denis Boyer", "title": "Intricate dynamics of a deterministic walk confined in a strip", "comments": "6 pages, 5 figures", "journal-ref": null, "doi": "10.1209/0295-5075/83/20001", "report-no": null, "categories": "cond-mat.dis-nn cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the dynamics of a deterministic walk confined in a narrow\ntwo-dimensional space randomly filled with point-like targets. At each step,\nthe walker visits the nearest target not previously visited. Complex dynamics\nis observed at some intermediate values of the domain width, when, while\ndrifting, the walk performs long intermittent backward excursions. As the width\nis increased, evidence of a transition from ballistic motion to a weakly\nnon-ergodic regime is shown, characterized by sudden inversions of the drift\nvelocity with a probability slowly decaying with time, as $1/t$ at leading\norder. Excursion durations, first-passage times and the dynamics of unvisited\ntargets follow power-law distributions. For parameter values below this scaling\nregime, precursory patterns in the form of \"wild\" outliers are observed, in\nclose relation with the presence of log-oscillations in the probability\ndistributions. We discuss the connections between this model and several\nevolving biological systems.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jun 2008 15:17:50 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Boyer", "Denis", ""]]}, {"id": "0806.1267", "submitter": "Francois Bonneton", "authors": "Fran\\c{c}ois Bonneton (CGMC), Dominique Zelus (LBMC), Thomas Iwema\n  (CGMC), Marc Robinson-Rechavi (LBMC), Vincent Laudet (LBMC)", "title": "Rapid divergence of the ecdysone receptor in Diptera and Lepidoptera\n  suggests coevolution between ECR and USP-RXR", "comments": null, "journal-ref": "Molecular Biology and Evolution 4, 20 (2003) 541-553", "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ecdysteroid hormones are major regulators in reproduction and development of\ninsects, including larval molts and metamorphosis. The functional ecdysone\nreceptor is a heterodimer of ECR (NR1H1) and USP-RXR (NR2B4), which is the\northologue of vertebrate retinoid X receptors (RXR alpha, beta, gamma). Both\nproteins belong to the superfamily of nuclear hormone receptors,\nligand-dependent transcription factors that share two conserved domains: the\nDNA-binding domain (DBD) and the ligand-binding domain (LBD). In order to gain\nfurther insight into the evolution of metamorphosis and gene regulation by\necdysone in arthropods, we performed a phylogenetic analysis of both partners\nof the heterodimer ECR/USP-RXR. Overall, 38 USP-RXR and 19 ECR protein\nsequences, from 33 species, have been used for this analysis. Interestingly,\nsequence alignments and structural comparisons reveal high divergence rates,\nfor both ECR and USP-RXR, specifically among Diptera and Lepidoptera. The most\nimpressive differences affect the ligand-binding domain of USP-RXR. In\naddition, ECR sequences show variability in other domains, namely the\nDNA-binding and the carboxy-terminal F domains. Our data provide the first\nevidence that ECR and USP-RXR may have coevolved during holometabolous insect\ndiversification, leading to a functional divergence of the ecdysone receptor.\nThese results have general implications on fundamental aspects of insect\ndevelopment, evolution of nuclear receptors, and the design of specific\ninsecticides.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jun 2008 06:24:12 GMT"}], "update_date": "2008-12-18", "authors_parsed": [["Bonneton", "François", "", "CGMC"], ["Zelus", "Dominique", "", "LBMC"], ["Iwema", "Thomas", "", "CGMC"], ["Robinson-Rechavi", "Marc", "", "LBMC"], ["Laudet", "Vincent", "", "LBMC"]]}, {"id": "0806.1287", "submitter": "Alan McKane", "authors": "Carlos A. Lugo, Alan J. McKane", "title": "Quasi-cycles in a spatial predator-prey model", "comments": "18 pages, 4 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.78.051911", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that spatial models of simple predator-prey interactions predict that\npredator and prey numbers oscillate in time and space. These oscillations are\nnot seen in the deterministic versions of the models, but are due to stochastic\nfluctuations about the time-independent solutions of the deterministic\nequations which are amplified due to the existence of a resonance. We calculate\nthe power spectra of the fluctuations analytically and show that they agree\nwell with results obtained from stochastic simulations. This work extends the\nanalysis of these quasi-cycles from that previously developed for well-mixed\nsystems to spatial systems, and shows that the ideas and methods used for\nnon-spatial models naturally generalize to the spatial case.\n", "versions": [{"version": "v1", "created": "Sat, 7 Jun 2008 16:19:31 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Lugo", "Carlos A.", ""], ["McKane", "Alan J.", ""]]}, {"id": "0806.1378", "submitter": "David Bryant", "authors": "David Bryant", "title": "Hadamard Phylogenetic Methods and the n-taxon process", "comments": "20 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Hadamard transform of \\cite{Hendy89a, Hendy89} provides a way to work\nwith stochastic models for sequence evolution without having to deal with the\ncomplications of tree space and the graphical structure of trees. Here we\ndemonstrate that the transform can be expressed in terms of the familiar\n$\\bP[\\bt] = e^{\\bQ[\\bt]}$ formula for Markov chains. The key idea is to study\nthe evolution of vectors of states, one vector entry for each taxa; we call\nthis the $n$-taxon process. We derive transition probabilities for the process.\nSignificantly, the findings show that tree-based models are indeed in the\nfamily of (multi-variate) exponential distributions.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jun 2008 07:06:04 GMT"}], "update_date": "2008-06-10", "authors_parsed": [["Bryant", "David", ""]]}, {"id": "0806.1649", "submitter": "Carlos Roca P.", "authors": "Carlos P. Roca, Jos\\'e A. Cuesta, and Angel S\\'anchez", "title": "Effect of spatial structure on the evolution of cooperation", "comments": "Final version, 20 pages, 14 figures", "journal-ref": "Phys. Rev. E 80, 046106 (2009)", "doi": "10.1103/PhysRevE.80.046106", "report-no": null, "categories": "q-bio.PE cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spatial structure is known to have an impact on the evolution of cooperation,\nand so it has been intensively studied during recent years. Previous work has\nshown the relevance of some features, such as the synchronicity of the\nupdating, the clustering of the network or the influence of the update rule.\nThis has been done, however, for concrete settings with particular games,\nnetworks and update rules, with the consequence that some contradictions have\narisen and a general understanding of these topics is missing in the broader\ncontext of the space of 2x2 games. To address this issue, we have performed a\nsystematic and exhaustive simulation in the different degrees of freedom of the\nproblem. In some cases, we generalize previous knowledge to the broader context\nof our study and explain the apparent contradictions. In other cases, however,\nour conclusions refute what seems to be established opinions in the field, as\nfor example the robustness of the effect of spatial structure against changes\nin the update rule, or offer new insights into the subject, e.g. the relation\nbetween the intensity of selection and the asymmetry between the effects on\ngames with mixed equilibria.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 15:01:55 GMT"}, {"version": "v2", "created": "Fri, 4 Jul 2008 19:29:19 GMT"}, {"version": "v3", "created": "Thu, 30 Apr 2009 11:36:19 GMT"}, {"version": "v4", "created": "Sat, 7 Nov 2009 18:57:01 GMT"}], "update_date": "2009-11-07", "authors_parsed": [["Roca", "Carlos P.", ""], ["Cuesta", "José A.", ""], ["Sánchez", "Angel", ""]]}, {"id": "0806.1685", "submitter": "Vladislav Volman", "authors": "Vladislav Volman and Herbert Levine", "title": "Activity-dependent stochastic resonance in recurrent neuronal networks", "comments": "4 pages, 4 figures, published in Physical Review E", "journal-ref": null, "doi": "10.1103/PhysRevE.77.060903", "report-no": null, "categories": "q-bio.NC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use a biophysical model of a local neuronal circuit to study the\nimplications of synaptic plasticity for the detection of weak sensory stimuli.\nNetworks with fast plastic coupling show behavior consistent with stochastic\nresonance. Addition of an additional slow coupling that accounts for the\nasynchronous release of neurotransmitter results in qualitatively different\nproperties of signal detection, and also leads to the appearance of transient\npost-stimulus bistability. Our results suggest testable hypothesis with regard\nto the self-organization and dynamics of local neuronal circuits.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2008 15:04:03 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Volman", "Vladislav", ""], ["Levine", "Herbert", ""]]}, {"id": "0806.1872", "submitter": "Sebastian Risau-Gusman", "authors": "Sebastian Risau-Gusman, Damian H. Zanette", "title": "Contact switching as a control strategy for epidemic outbreaks", "comments": "21 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the effects of switching social contacts as a strategy to control\nepidemic outbreaks. Connections between susceptible and infective individuals\ncan be broken by either individual, and then reconnected to a randomly chosen\nmember of the population. It is assumed that the reconnecting individual has no\nprevious information on the epidemiological condition of the new contact. We\nshow that reconnection can completely suppress the disease, both by continuous\nand discontinuous transitions between the endemic and the infection-free\nstates. For diseases with an asymptomatic phase, we analyze the conditions for\nthe suppression of the disease, and show that, even when these conditions are\nnot met, the increase of the endemic infection level is usually rather small.\nWe conclude that, within some simple epidemiological models, contact switching\nis a quite robust and effective control strategy. This suggests that it may\nalso be an efficient method in more complex situations.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jun 2008 13:36:59 GMT"}], "update_date": "2008-06-12", "authors_parsed": [["Risau-Gusman", "Sebastian", ""], ["Zanette", "Damian H.", ""]]}, {"id": "0806.2035", "submitter": "Francesc Rossell\\'o", "authors": "Gabriel Cardona, Merce Llabres, Francesc Rossello, Gabriel Valiente", "title": "Nodal distances for rooted phylogenetic trees", "comments": "26 pages, Supplementary Material available at\n  http://bioinfo.uib.es/~recerca/phylotrees/nodal/", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CE cs.DM", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Dissimilarity measures for (possibly weighted) phylogenetic trees based on\nthe comparison of their vectors of path lengths between pairs of taxa, have\nbeen present in the systematics literature since the early seventies. But, as\nfar as rooted phylogenetic trees goes, these vectors can only separate\nnon-weighted binary trees, and therefore these dissimilarity measures are\nmetrics only on this class. In this paper we overcome this problem, by\nsplitting in a suitable way each path length between two taxa into two lengths.\nWe prove that the resulting splitted path lengths matrices single out arbitrary\nrooted phylogenetic trees with nested taxa and arcs weighted in the set of\npositive real numbers. This allows the definition of metrics on this general\nclass by comparing these matrices by means of metrics in spaces of real-valued\n$n\\times n$ matrices. We conclude this paper by establishing some basic facts\nabout the metrics for non-weighted phylogenetic trees defined in this way using\n$L^p$ metrics on these spaces of matrices.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jun 2008 10:17:02 GMT"}], "update_date": "2008-07-06", "authors_parsed": [["Cardona", "Gabriel", ""], ["Llabres", "Merce", ""], ["Rossello", "Francesc", ""], ["Valiente", "Gabriel", ""]]}, {"id": "0806.2069", "submitter": "Daniel Silvestre", "authors": "Daniel A. M. M. Silvestre, Jose F. Fontanari", "title": "The information capacity of hypercycles", "comments": "4 pages, 1 figure, submitted to J. Theor. Biol", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hypercycles are information integration systems which are thought to overcome\nthe information crisis of prebiotic evolution by ensuring the coexistence of\nseveral short templates. For imperfect template replication, we derive a simple\nexpression for the maximum number of distinct templates $n_m$ that can coexist\nin a hypercycle and show that it is a decreasing function of the length $L$ of\nthe templates. In the case of high replication accuracy we find that the\nproduct $n_m L$ tends to a constant value, limiting thus the information\ncontent of the hypercycle. Template coexistence is achieved either as a\nstationary equilibrium (stable fixed point) or a stable periodic orbit in which\nthe total concentration of functional templates is nonzero. For the hypercycle\nsystem studied here we find numerical evidence that the existence of an\nunstable fixed point is a necessary condition for the presence of periodic\norbits.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jun 2008 13:17:51 GMT"}], "update_date": "2008-06-13", "authors_parsed": [["Silvestre", "Daniel A. M. M.", ""], ["Fontanari", "Jose F.", ""]]}, {"id": "0806.2181", "submitter": "Lee Altenberg", "authors": "Lee Altenberg", "title": "The Evolutionary Reduction Principle for Linear Variation in Genetic\n  Transmission", "comments": "22 pages, 1 figure", "journal-ref": "Bulletin of Mathematical Biology, Volume 71, Number 5, 1264-1284\n  (2009)", "doi": "10.1007/s11538-009-9401-2", "report-no": null, "categories": "q-bio.PE math.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evolution of genetic systems has been analyzed through the use of\nmodifier gene models, in which a neutral gene is posited to control the\ntransmission of other genes under selection. Analysis of modifier gene models\nhas found the manifestations of an \"evolutionary reduction principle\": in a\npopulation near equilibrium, a new modifier allele that scales equally all\ntransition probabilities between different genotypes under selection can invade\nif and only if it reduces the transition probabilities. Analytical results on\nthe reduction principle have always required some set of constraints for\ntractability: limitations to one or two selected loci, two alleles per locus,\nspecific selection regimes or weak selection, specific genetic processes being\nmodified, extreme or infinitesimal effects of the modifier allele, or tight\nlinkage between modifier and selected loci. Here, I prove the reduction\nprinciple in the absence of any of these constraints, confirming a twenty-year\nold conjecture. The proof is obtained by a wider application of Karlin's\nTheorem 5.2 (1982) and its extension to ML-matrices, substochastic matrices,\nand reducible matrices.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jun 2008 03:56:42 GMT"}], "update_date": "2013-02-04", "authors_parsed": [["Altenberg", "Lee", ""]]}, {"id": "0806.2308", "submitter": "Fernando Peruani", "authors": "Fernando Peruani and Gustavo J. Sibona", "title": "Dynamics and Steady States in excitable mobile agent systems", "comments": null, "journal-ref": "Phys. Rev. Lett. 100, 168103 (2008)", "doi": "10.1103/PhysRevLett.100.168103", "report-no": null, "categories": "q-bio.PE q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the spreading of excitations in 2D systems of mobile agents where\nthe excitation is transmitted when a quiescent agent keeps contact with an\nexcited one during a non-vanishing time. We show that the steady states\nstrongly depend on the spatial agent dynamics. Moreover, the coupling between\nexposition time ($\\omega$) and agent-agent contact rate (CR) becomes crucial to\nunderstand the excitation dynamics, which exhibits three regimes with CR: no\nexcitation for low CR, an excited regime in which the number of quiescent\nagents (S) is inversely proportional to CR, and for high CR, a novel third\nregime, model dependent, here S scales with an exponent $\\xi -1$, with $\\xi$\nbeing the scaling exponent of $\\omega$ with CR.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jun 2008 18:44:52 GMT"}, {"version": "v2", "created": "Mon, 16 Jun 2008 09:28:19 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Peruani", "Fernando", ""], ["Sibona", "Gustavo J.", ""]]}, {"id": "0806.2331", "submitter": "Raj Chakrabarti", "authors": "Raj Chakrabarti, Herschel Rabitz, George McLendon", "title": "Optimal Control of Evolutionary Dynamics", "comments": "Extends \"Mutagenic evidence for the optimal control of evolutionary\n  dynamics\" (accepted, Physical Review Letters)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Elucidating the fitness measures optimized during the evolution of complex\nbiological systems is a major challenge in evolutionary theory. We present\nexperimental evidence and an analytical framework demonstrating how biochemical\nnetworks exploit optimal control strategies in their evolutionary dynamics.\nOptimal control theory explains a striking pattern of extremization in the\nredox potentials of electron transport proteins, assuming only that their\nfitness measure is a control objective functional with bounded controls.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jun 2008 20:55:45 GMT"}], "update_date": "2008-06-17", "authors_parsed": [["Chakrabarti", "Raj", ""], ["Rabitz", "Herschel", ""], ["McLendon", "George", ""]]}, {"id": "0806.2394", "submitter": "Randen Patterson", "authors": "Kyung Dae Ko (1,4), Yoojin Hong (2,4), Gue Su Chang (1,4), Gaurav\n  Bhardwaj (1), Damian B. van Rossum (1,3), and Randen L. Patterson (1,3), ((1)\n  Department of Biology, The Pennsylvania State University, (2) Department of\n  Computer Science and Engineering, The Pennsylvania State University, (3)\n  Center for Computational Proteomics, The Pennsylvania State University)", "title": "Phylogenetic Profiles as a Unified Framework for Measuring Protein\n  Structure, Function and Evolution", "comments": "21 Pages, 10 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The sequence of amino acids in a protein is believed to determine its native\nstate structure, which in turn is related to the functionality of the protein.\nIn addition, information pertaining to evolutionary relationships is contained\nin homologous sequences. One powerful method for inferring these sequence\nattributes is through comparison of a query sequence with reference sequences\nthat contain significant homology and whose structure, function, and/or\nevolutionary relationships are already known. In spite of decades of concerted\nwork, there is no simple framework for deducing structure, function, and\nevolutionary (SF&E) relationships directly from sequence information alone,\nespecially when the pair-wise identity is less than a threshold figure ~25%\n[1,2]. However, recent research has shown that sequence identity as low as 8%\nis sufficient to yield common structure/function relationships and sequence\nidentities as large as 88% may yet result in distinct structure and function\n[3,4]. Starting with a basic premise that protein sequence encodes information\nabout SF&E, one might ask how one could tease out these measures in an unbiased\nmanner. Here we present a unified framework for inferring SF&E from sequence\ninformation using a knowledge-based approach which generates phylogenetic\nprofiles in an unbiased manner. We illustrate the power of phylogenetic\nprofiles generated using the Gestalt Domain Detection Algorithm Basic Local\nAlignment Tool (GDDA-BLAST) to derive structural domains, functional\nannotation, and evolutionary relationships for a host of ion-channels and human\nproteins of unknown function. These data are in excellent accord with published\ndata and new experiments. Our results suggest that there is a wealth of\npreviously unexplored information in protein sequence.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jun 2008 18:27:28 GMT"}], "update_date": "2008-06-17", "authors_parsed": [["Ko", "Kyung Dae", ""], ["Hong", "Yoojin", ""], ["Chang", "Gue Su", ""], ["Bhardwaj", "Gaurav", ""], ["van Rossum", "Damian B.", ""], ["Patterson", "Randen L.", ""]]}, {"id": "0806.2500", "submitter": "Mike Steel Prof.", "authors": "Mareike Fischer, Mike Steel", "title": "Sequence length bounds for resolving a deep phylogenetic divergence", "comments": "13 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In evolutionary biology, genetic sequences carry with them a trace of the\nunderlying tree that describes their evolution from a common ancestral\nsequence. The question of how many sequence sites are required to recover this\nevolutionary relationship accurately depends on the model of sequence\nevolution, the substitution rate, divergence times and the method used to infer\nphylogenetic history. A particularly challenging problem for phylogenetic\nmethods arises when a rapid divergence event occurred in the distant past. We\nanalyse an idealised form of this problem in which the terminal edges of a\nsymmetric four--taxon tree are some factor ($p$) times the length of the\ninterior edge. We determine an order $p^2$ lower bound on the growth rate for\nthe sequence length required to resolve the tree (independent of any particular\nbranch length). We also show that this rate of sequence length growth can be\nachieved by existing methods (including the simple `maximum parsimony' method),\nand compare these order $p^2$ bounds with an order $p$ growth rate for a model\nthat describes low-homoplasy evolution. In the final section, we provide a\ngeneric bound on the sequence length requirement for a more general class of\nMarkov processes.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 06:10:30 GMT"}], "update_date": "2008-06-17", "authors_parsed": [["Fischer", "Mareike", ""], ["Steel", "Mike", ""]]}, {"id": "0806.2636", "submitter": "Tibor Antal", "authors": "Tibor Antal, Hisashi Ohtsuki, John Wakeley, Peter D. Taylor, Martin A.\n  Nowak", "title": "Evolutionary game dynamics in phenotype space", "comments": "version 2: minor changes; equivalent to final published version", "journal-ref": "PNAS 106, 8597 (2009)", "doi": "10.1073/pnas.0902528106", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary dynamics can be studied in well-mixed or structured populations.\nPopulation structure typically arises from the heterogeneous distribution of\nindividuals in physical space or on social networks. Here we introduce a new\ntype of space to evolutionary game dynamics: phenotype space. The population is\nwell-mixed in the sense that everyone is equally likely to interact with\neveryone else, but the behavioral strategies depend on distance in phenotype\nspace. Individuals might behave differently towards those who look similar or\ndissimilar. Individuals mutate to nearby phenotypes. We study the `phenotypic\nspace walk' of populations. We present analytic calculations that bring\ntogether ideas from coalescence theory and evolutionary game dynamics. As a\nparticular example, we investigate the evolution of cooperation in phenotype\nspace. We obtain a precise condition for natural selection to favor cooperators\nover defectors: for a one-dimensional phenotype space and large population size\nthe critical benefit-to-cost ratio is given by b/c=1+2/sqrt{3}. We derive the\nfundamental condition for any evolutionary game and explore higher dimensional\nphenotype spaces.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2008 18:17:03 GMT"}, {"version": "v2", "created": "Sat, 2 May 2009 15:31:22 GMT"}], "update_date": "2009-06-04", "authors_parsed": [["Antal", "Tibor", ""], ["Ohtsuki", "Hisashi", ""], ["Wakeley", "John", ""], ["Taylor", "Peter D.", ""], ["Nowak", "Martin A.", ""]]}, {"id": "0806.3424", "submitter": "Daniela Visetti", "authors": "D. Breda, D. Visetti", "title": "Existence, multiplicity and stability of endemic states for an\n  age-structured S-I epidemic model", "comments": "changed content, i.e. added well-posedness, stability change and Hopf\n  bifurcation", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study an S--I type epidemic model in an age-structured population, with\nmortality due to the disease. A threshold quantity is found that controls the\nstability of the disease-free equilibrium and guarantees the existence of an\nendemic equilibrium. We obtain conditions on the age-dependence of the\nsusceptibility to infection that imply the uniqueness of the endemic\nequilibrium. An example with two endemic equilibria is shown. Finally, we\nanalyse numerically how the stability of the endemic equilibrium is affected by\nextra-mortality and by the possible periodicities induced by the demographic\nage-structure.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2008 16:49:16 GMT"}, {"version": "v2", "created": "Thu, 25 Feb 2010 09:35:27 GMT"}], "update_date": "2010-02-25", "authors_parsed": [["Breda", "D.", ""], ["Visetti", "D.", ""]]}, {"id": "0806.3591", "submitter": "Pascal Cr\\'epey", "authors": "Pascal Cr\\'epey and Marc Barth\\'elemy", "title": "Detecting Robust Patterns in the Spread of Epidemics: A Case Study of\n  Influenza in the United States and France", "comments": "8 pages, 7 figures, 3 tables", "journal-ref": "Am J Epidemiol. 2007 Dec 1;166(11):1244-51. Epub 2007 Oct 15", "doi": "10.1093/aje/kwm266", "report-no": null, "categories": "q-bio.PE physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, the authors develop a method of detecting correlations between\nepidemic patterns in different regions that are due to human movement and\nintroduce a null model in which the travel-induced correlations are cancelled.\nThey apply this method to the well-documented cases of seasonal influenza\noutbreaks in the United States and France. In the United States (using data for\n1972-2002), the authors observed strong short-range correlations between\nseveral states and their immediate neighbors, as well as robust long-range\nspreading patterns resulting from large domestic air-traffic flows. The\nstability of these results over time allowed the authors to draw conclusions\nabout the possible impact of travel restrictions on epidemic spread. The\nauthors also applied this method to the case of France (1984-2004) and found\nthat on the regional scale, there was no transportation mode that clearly\ndominated disease spread. The simplicity and robustness of this method suggest\nthat it could be a useful tool for detecting transmission channels in the\nspread of epidemics.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jun 2008 21:17:55 GMT"}], "update_date": "2008-06-24", "authors_parsed": [["Crépey", "Pascal", ""], ["Barthélemy", "Marc", ""]]}, {"id": "0806.3772", "submitter": "Eugene Shakhnovich", "authors": "Konstantin B. Zeldovich and Eugene I. Shakhnovich", "title": "Emergence of mutationally robust proteins in a microscopic model of\n  evolution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ability to absorb mutations while retaining structure and function, or\nmutational robustness, is a remarkable property of natural proteins. In this\nLetter, we use a computational model of organismic evolution [Zeldovich et al,\nPLOS Comp Biol 3(7):e139 (2007)], which explicitly couples protein physics and\npopulation dynamics, to study mutational robustness of evolved model proteins.\nWe find that dominant protein structures which evolved in the simulations are\nhighly designable ones, in accord with some of the earlier observations. Next,\nwe compare evolved sequences with the ones designed to fold into the same\ndominant structures and having the same thermodynamic stability, and find that\nevolved sequences are more robust against point mutations, being less likely to\nbe destabilized upon them. These results point to sequence evolution as an\nimportant method of protein engineering if mutational robustness of the\nartificially developed proteins is desired. On the biological side, mutational\nrobustness of proteins appears to be a natural consequence of the\nmutation-selection evolutionary process.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2008 20:59:00 GMT"}], "update_date": "2008-06-25", "authors_parsed": [["Zeldovich", "Konstantin B.", ""], ["Shakhnovich", "Eugene I.", ""]]}, {"id": "0806.4276", "submitter": "Alessandro Pluchino", "authors": "Alessandro Pluchino, Andrea Rapisarda and Vito Latora", "title": "Communities recognition in the Chesapeake Bay ecosystem by dynamical\n  clustering algorithms based on different oscillators systems", "comments": "8 pages, 7 figures, Proceedings of the International Workshop on\n  \"Ecological Complex Systems: Stochastic Dynamics and Patterns\", 22-26 July\n  2007 - Terrasini (Palermo), Italy", "journal-ref": null, "doi": "10.1140/epjb/e2008-00292-8", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech physics.bio-ph physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have recently introduced an efficient method for the detection and\nidentification of modules in complex networks, based on the de-synchronization\nproperties (dynamical clustering) of phase oscillators. In this paper we apply\nthe dynamical clustering tecnique to the identification of communities of\nmarine organisms living in the Chesapeake Bay food web. We show that our\nalgorithm is able to perform a very reliable classification of the real\ncommunities existing in this ecosystem by using different kinds of dynamical\noscillators. We compare also our results with those of other methods for the\ndetection of community structures in complex networks.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jun 2008 10:17:13 GMT"}, {"version": "v2", "created": "Thu, 3 Jul 2008 17:01:05 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Pluchino", "Alessandro", ""], ["Rapisarda", "Andrea", ""], ["Latora", "Vito", ""]]}, {"id": "0806.4449", "submitter": "Renaud Jolivet", "authors": "Renaud Jolivet, Michel Antoniazza, Catherine Strehler-Perrin and\n  Antoine Gander", "title": "Impact of road mitigation measures on amphibian populations: A\n  stage-class population mathematical model", "comments": "18 pages, 3 figures, 2 tables and 4 supplementary figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  It is now well established that amphibians are suffering widespread decline\nand extinctions. Among other causes, urbanization is responsible for habitat\nreduction, habitat fragmentation and massive road kills. In this context, it is\nurgent to develop and assess appropriate conservation measures. Using yearly\ncensuses of migrating adults of two anuran species at one location in\nSwitzerland, we examined the impact of a road mitigation measure - permanent\nunder-road tunnels with guiding trenches - along a road separating wintering\nforests from breeding wetlands. We observe that the adult migrating populations\ndo not exhibit any long-term trend but undergo a transient increase a few years\nafter the installation of the road mitigation measure. Using additional\ndatasets like climatic data and censuses obtained in a control area, we show\nthat the observed pattern of migrating populations cannot be explained by any\nother data at our disposal. We then checked as a working hypothesis whether the\ninstallation of under-road tunnels could explain the observed transient or not.\nTo this end, we use a simple population model and show that the road mitigation\nmeasure together with competition for resources can successfully explain the\nexperimental observations. We conclude by discussing the requirements for\nfurther assessment of this hypothesis as well as consequences for conservation\nplanners.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2008 08:15:59 GMT"}], "update_date": "2009-09-29", "authors_parsed": [["Jolivet", "Renaud", ""], ["Antoniazza", "Michel", ""], ["Strehler-Perrin", "Catherine", ""], ["Gander", "Antoine", ""]]}, {"id": "0806.4576", "submitter": "Nico  Stollenwerk", "authors": "Maira Aguiar, Nico Stollenwerk, Bob W. Kooi", "title": "Torus bifurcations, isolas and chaotic attractors in a simple dengue\n  model with ADE and temporary cross immunity", "comments": "13 pages, 4 fugures; proceedings of CMMSE 2008, ISBN\n  978-84-612-1982-7", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyse an epidemiological model of competing strains of pathogens and\nhence differences in transmission for first versus secondary infection due to\ninteraction of the strains with previously aquired immunities, as has been\ndescribed for dengue fever (in dengue known as antibody dependent enhancement,\nADE). Such models show a rich variety of dynamics through bifurcations up to\ndeterministic chaos. Including temporary cross-immunity even enlarges the\nparameter range of such chaotic attractors, and also gives rise to various\ncoexisting attractors, which are difficult to identify by standard numerical\nbifurcation programs using continuation methods. A combination of techniques,\nincluding classical bifurcation plots and Lyapunov exponent spectra has to be\napplied in comparison to get further insight into such dynamical structures.\nHere we present for the first time multi-parameter studies in a range of\nbiologically plausible values for dengue. The multi-strain interaction with the\nimmune system is expected to also have implications for the epidemiology of\nother diseases.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2008 18:40:23 GMT"}], "update_date": "2008-06-30", "authors_parsed": [["Aguiar", "Maira", ""], ["Stollenwerk", "Nico", ""], ["Kooi", "Bob W.", ""]]}]