[{"id": "0906.0251", "submitter": "Arto Annila", "authors": "Peter Wurtz and Arto Annila", "title": "Roots of diversity relations", "comments": "10, 3 figures", "journal-ref": "Journal of Biophysics 2008, Article ID 654672", "doi": "10.1155/2008/654672", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The species-area relationship is one of the central generalizations in\necology however its origin has remained a puzzle. Since ecosystems are\nunderstood as energy transduction systems, the regularities in species richness\nare considered to result from ubiquitous imperatives in energy transduction.\n  From a thermodynamic point of view, organisms are transduction mechanisms\nthat distribute an influx of energy down along the steepest gradients to the\necosystem's diverse repositories of chemical energy, i.e., populations of\nspecies. Transduction machineries, i.e. ecosystems assembled from numerous\nspecies, may emerge and evolve toward high efficiency on large areas that hold\nmore matter than small ones. This results in the well-known logistic-like\nrelationship between the area and the number of species. The species-area\nrelationship is understood, in terms of thermodynamics, to be the skewed\ncumulative curve of chemical energy distribution that is commonly known as the\nspecies-abundance relationship.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2009 10:22:08 GMT"}], "update_date": "2009-06-02", "authors_parsed": [["Wurtz", "Peter", ""], ["Annila", "Arto", ""]]}, {"id": "0906.0254", "submitter": "Arto Annila", "authors": "Salla Jaakkola, Vivek Sharma, Arto Annila", "title": "Cause of Chirality Consensus", "comments": "8 pages, 2 figures", "journal-ref": "Current Chemical Biology, 2008, 2, 153-158", "doi": "10.2174/187231308784220536", "report-no": null, "categories": "q-bio.PE q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological macromolecules, proteins and nucleic acids are composed\nexclusively of chirally pure monomers. The chirality consensus appears vital\nfor life and it has even been considered as a prerequisite of life. However the\nprimary cause for the ubiquitous handedness has remained obscure. We propose\nthat the chirality consensus is a kinetic consequence that follows from the\nprinciple of increasing entropy, i.e. the 2nd law of thermodynamics. Entropy\nincreases when an open system evolves by decreasing gradients in free energy\nwith more and more efficient mechanisms of energy transduction. The rate of\nentropy increase is the universal fitness criterion of natural selection that\nfavors diverse functional molecules and drives the system to the chirality\nconsensus to attain and maintain high-entropy non-equilibrium states.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2009 10:30:35 GMT"}], "update_date": "2009-06-02", "authors_parsed": [["Jaakkola", "Salla", ""], ["Sharma", "Vivek", ""], ["Annila", "Arto", ""]]}, {"id": "0906.0381", "submitter": "Thilo Gross", "authors": "Thilo Gross and Ulrike Feudel", "title": "Local dynamical equivalence of certain food webs", "comments": "20 pages, 5 figures", "journal-ref": "Ocean Dynamics 59 (2), 417-427, 2009", "doi": "10.1007/s10236-008-0165-2", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important challenge in theoretical ecology is to find good, coarse-grained\nrepresentations of complex food webs. Here we use the approach of generalized\nmodeling to show that it may be possible to formulate a coarse-graining\nalgorithm that conserves the local dynamics of the model exactly. We show\nexamples of food webs with a different number of species that have exactly\nidentical local bifurcation diagrams. Based on these observations, we formulate\na conjecture governing which populations of complex food webs can be grouped\ntogether into a single variable without changing the local dynamics. As an\nillustration we use this conjecture to show that chaotic regions generically\nexist in the parameter space of a class of food webs with more than three\ntrophic levels. While our conjecture is at present only applicable to\nrelatively special cases we believe that its applicability could be greatly\nextended if a more sophisticated mapping of parameters were used in the model\nreduction.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jun 2009 14:57:57 GMT"}], "update_date": "2009-06-03", "authors_parsed": [["Gross", "Thilo", ""], ["Feudel", "Ulrike", ""]]}, {"id": "0906.0390", "submitter": "Eugene Shakhnovich", "authors": "Peiqiu Chen, Eugene I. Shakhnovich", "title": "Thermal Adaptation in Viruses and Bacteria", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.BM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A previously established multiscale population genetics model states that\nfitness can be inferred from the physical properties of proteins under the\nphysiological assumption that a loss of stability by any protein confers the\nlethal phenotype to an organism. Here we develop this model further by positing\nthat replication rate (fitness) of a bacterial or viral strain directly depends\non the copy number of folded proteins which determine its replication rate.\nUsing this model, and both numerical and analytical approaches, we studied the\nadaptation process of bacteria and viruses at varied environmental\ntemperatures. We found that a broad distribution of protein stabilities\nobserved in the model and in experiment is the key determinant of thermal\nresponse for viruses and bacteria. Our results explain most of the earlier\nexperimental observations: striking asymmetry of thermal response curves, the\nabsence of evolutionary trade-off which was expected but not found in\nexperiments, correlation between denaturation temperature for several protein\nfamilies and the Optimal Growth Temperature (OGT) of their host organisms, and\nproximity of bacterial or viral OGTs to their evolutionary temperatures. Our\ntheory quantitatively and with high accuracy described thermal response curves\nfor 35 bacterial species using, for each species, only two adjustable\nparameters, the number of replication rate determining genes and energy barrier\nfor metabolic reactions.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2009 22:47:50 GMT"}], "update_date": "2009-06-03", "authors_parsed": [["Chen", "Peiqiu", ""], ["Shakhnovich", "Eugene I.", ""]]}, {"id": "0906.0917", "submitter": "Marcos Amaku", "authors": "M. Amaku, F. A. B. Coutinho, R. S. Azevedo, M. N. Burattini, L. F.\n  Lopez, E. Massad", "title": "Vaccination against rubella: Analysis of the temporal evolution of the\n  age-dependent force of infection and the effects of different contact\n  patterns", "comments": "12 pages, 11 figures", "journal-ref": "Physical Review E 67, 051907 (2003)", "doi": "10.1103/PhysRevE.67.051907", "report-no": null, "categories": "q-bio.OT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we analyze the temporal evolution of the age-dependent force\nof infection and incidence of rubella, after the introduction of a very\nspecific vaccination programme in a previously nonvaccinated population where\nrubella was in endemic steady state. We deduce an integral equation for the\nage-dependent force of infection, which depends on a number of parameters that\ncan be estimated from the force of infection in steady state prior to the\nvaccination program. We present the results of our simulations, which are\ncompared with observed data. We also examine the influence of contact patterns\namong members of a community on the age-dependent intensity of transmission of\nrubella and on the results of vaccination strategies. As an example of the\ntheory proposed, we calculate the effects of vaccination strategies for four\ncommunities from Caieiras (Brazil), Huixquilucan (Mexico), Finland and the\nUnited Kingdom. The results for each community differ considerably according to\nthe distinct intensity and pattern of transmission in the absence of\nvaccination. We conclude that this simple vaccination program is not very\nefficient (very slow) in the goal of eradicating the disease. This gives\nsupport to a mixed strategy, proposed by Massad et al., accepted and\nimplemented by the government of the State of Sao Paulo, Brazil.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2009 14:23:55 GMT"}], "update_date": "2009-06-05", "authors_parsed": [["Amaku", "M.", ""], ["Coutinho", "F. A. B.", ""], ["Azevedo", "R. S.", ""], ["Burattini", "M. N.", ""], ["Lopez", "L. F.", ""], ["Massad", "E.", ""]]}, {"id": "0906.0976", "submitter": "David A. Kessler", "authors": "David A. Kessler, Nadav M. Shnerb", "title": "Globally coupled chaotic maps and demographic stochasticity", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevE.81.036111", "report-no": null, "categories": "nlin.CD q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The affect of demographic stochasticity of a system of globally coupled\nchaotic maps is considered. A two-step model is studied, where the intra-patch\nchaotic dynamics is followed by a migration step that coupled all patches; the\nequilibrium number of agents on each site, $N$, controls the strength of the\ndiscreteness-induced fluctuations. For small $N$ (large fluctuations) a\nperiod-doubling cascade appears as the coupling (migration) increases. As $N$\ngrows an extremely slow dynamic emerges, leading to a flow along a\none-dimensional family of almost period 2 solutions. This manifold become a\ntrue solutions in the deterministic limit. The degeneracy between different\nattractors that characterizes the clustering phase of the deterministic system\nis thus the $N \\to \\infty$ limit of the slow dynamics manifold.\n", "versions": [{"version": "v1", "created": "Thu, 4 Jun 2009 20:34:30 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Kessler", "David A.", ""], ["Shnerb", "Nadav M.", ""]]}, {"id": "0906.1166", "submitter": "Francesc Rossell\\'o", "authors": "Gabriel Cardona, Merce Llabres, Francesc Rossello, Gabriel Valiente", "title": "Comparison of Galled Trees", "comments": "36 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CE cs.DM q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Galled trees, directed acyclic graphs that model evolutionary histories with\nisolated hybridization events, have become very popular due to both their\nbiological significance and the existence of polynomial time algorithms for\ntheir reconstruction. In this paper we establish to which extent several\ndistance measures for the comparison of evolutionary networks are metrics for\ngalled trees, and hence when they can be safely used to evaluate galled tree\nreconstruction methods.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jun 2009 16:55:47 GMT"}], "update_date": "2009-06-08", "authors_parsed": [["Cardona", "Gabriel", ""], ["Llabres", "Merce", ""], ["Rossello", "Francesc", ""], ["Valiente", "Gabriel", ""]]}, {"id": "0906.1676", "submitter": "Jozsef Farkas", "authors": "Jozsef Z. Farkas and Peter Hinow", "title": "Structured and unstructured continuous models for Wolbachia infections", "comments": "24 pages, 6 figures, revised and expanded", "journal-ref": "Bulletin of Mathematical Biology 72 (2010), p. 2067-2088", "doi": "10.1007/s11538-010-9528-1", "report-no": null, "categories": "math.CA math.AP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce and investigate a series of models for an infection of a\ndiplodiploid host species by the bacterial endosymbiont \\textit{Wolbachia}. The\ncontinuous models are characterized by partial vertical transmission,\ncytoplasmic incompatibility and fitness costs associated with the infection. A\nparticular aspect of interest is competitions between mutually incompatible\nstrains. We further introduce an age-structured model that takes into account\ndifferent fertility and mortality rates at different stages of the life cycle\nof the individuals. With only a few parameters, the ordinary differential\nequation models exhibit already interesting dynamics and can be used to predict\ncriteria under which a strain of bacteria is able to invade a population.\nInterestingly, but not surprisingly, the age-structured model shows significant\ndifferences concerning the existence and stability of equilibrium solutions\ncompared to the unstructured model.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jun 2009 09:50:28 GMT"}, {"version": "v2", "created": "Wed, 10 Jun 2009 18:07:11 GMT"}, {"version": "v3", "created": "Wed, 9 Dec 2009 20:14:21 GMT"}, {"version": "v4", "created": "Thu, 18 Feb 2010 16:39:50 GMT"}], "update_date": "2019-03-25", "authors_parsed": [["Farkas", "Jozsef Z.", ""], ["Hinow", "Peter", ""]]}, {"id": "0906.1678", "submitter": "Ellen Baake", "authors": "Ute von Wangenheim, Ellen Baake, Michael Baake", "title": "Single--crossover recombination in discrete time", "comments": "J. Math. Biol., in press", "journal-ref": "J. Math. Biol. 60 (2010), 727-760", "doi": null, "report-no": null, "categories": "q-bio.PE math.DS q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modelling the process of recombination leads to a large coupled nonlinear\ndynamical system. Here, we consider a particular case of recombination in {\\em\ndiscrete} time, allowing only for {\\em single crossovers}. While the analogous\ndynamics in {\\em continuous} time admits a closed solution, this no longer\nworks for discrete time. A more general model (i.e. without the restriction to\nsingle crossovers) has been studied before and was solved algorithmically by\nmeans of Haldane linearisation. Using the special formalism introduced by Baake\nand Baake (2003), we obtain further insight into the single-crossover dynamics\nand the particular difficulties that arise in discrete time. We then transform\nthe equations to a solvable system in a two-step procedure: linearisation\nfollowed by diagonalisation. Still, the coefficients of the second step must be\ndetermined in a recursive manner, but once this is done for a given system,\nthey allow for an explicit solution valid for all times.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jun 2009 09:52:12 GMT"}], "update_date": "2011-01-12", "authors_parsed": [["von Wangenheim", "Ute", ""], ["Baake", "Ellen", ""], ["Baake", "Michael", ""]]}, {"id": "0906.2180", "submitter": "Jozsef Farkas", "authors": "Jozsef Z. Farkas", "title": "Size-structured populations: immigration, (bi)stability and the net\n  growth rate", "comments": "to appear in Journal of Applied Mathematics and Computing", "journal-ref": "Journal of Applied Mathematics and Computing 35 (2011) 617-633", "doi": "10.1007/s12190-010-0382-y", "report-no": null, "categories": "math.AP math.SP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a class of physiologically structured population models, a first\norder nonlinear partial differential equation equipped with a nonlocal boundary\ncondition, with a constant external inflow of individuals. We prove that the\nlinearised system is governed by a quasicontraction semigroup. We also\nestablish that linear stability of equilibrium solutions is governed by a\ngeneralized net reproduction function. In a special case of the model\ningredients we discuss the nonlinear dynamics of the system when the spectral\nbound of the linearised operator equals zero, i.e. when linearisation does not\ndecide stability. This allows us to demonstrate, through a concrete example,\nhow immigration might be beneficial to the population. In particular, we show\nthat from a nonlinearly unstable positive equilibrium a linearly stable and\nunstable pair of equilibria bifurcates. In fact, the linearised system exhibits\nbistability, for a certain range of values of the external inflow, induced\npotentially by All\\'{e}e-effect.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jun 2009 18:53:14 GMT"}, {"version": "v2", "created": "Sat, 5 Dec 2009 17:45:05 GMT"}], "update_date": "2019-03-25", "authors_parsed": [["Farkas", "Jozsef Z.", ""]]}, {"id": "0906.2293", "submitter": "Rick Durrett", "authors": "Rick Durrett", "title": "Coexistence in stochastic spatial models", "comments": "Published in at http://dx.doi.org/10.1214/08-AAP590 the Annals of\n  Applied Probability (http://www.imstat.org/aap/) by the Institute of\n  Mathematical Statistics (http://www.imstat.org)", "journal-ref": "Annals of Applied Probability 2009, Vol. 19, No. 2, 477-496", "doi": "10.1214/08-AAP590", "report-no": "IMS-AAP-AAP590", "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper I will review twenty years of work on the question: When is\nthere coexistence in stochastic spatial models? The answer, announced in\nDurrett and Levin [Theor. Pop. Biol. 46 (1994) 363--394], and that we explain\nin this paper is that this can be determined by examining the mean-field ODE.\nThere are a number of rigorous results in support of this picture, but we will\nstate nine challenging and important open problems, most of which date from the\n1990's.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jun 2009 10:40:31 GMT"}], "update_date": "2009-06-15", "authors_parsed": [["Durrett", "Rick", ""]]}, {"id": "0906.2470", "submitter": "Francesc Rossell\\'o", "authors": "Arnau Mir, Francesc Rossello", "title": "The mean value of the squared path-difference distance for rooted\n  phylogenetic trees", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.DM math.CA q-bio.QM", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The path-difference metric is one of the oldest distances for the comparison\nof fully resolved phylogenetic trees, but its statistical properties are still\nquite unknown. In this paper we compute the mean value of the square of the\npath-difference metric between two fully resolved rooted phylogenetic trees\nwith $n$ leaves, under the uniform distribution. This complements previous work\nby Steel and Penny, who computed this mean value for fully resolved unrooted\nphylogenetic trees.\n", "versions": [{"version": "v1", "created": "Sat, 13 Jun 2009 11:33:28 GMT"}], "update_date": "2009-06-16", "authors_parsed": [["Mir", "Arnau", ""], ["Rossello", "Francesc", ""]]}, {"id": "0906.2777", "submitter": "Adrian Melott", "authors": "Andrew C. Overholt, Adrian L. Melott (University of Kansas), and\n  Martin K. Pohl (Iowa State University)", "title": "Testing the link between terrestrial climate change and Galactic spiral\n  arm transit", "comments": "Accepted for publication in ApJ Letters. Moderate revisions with\n  clarification, no change in conclusions", "journal-ref": "Astrophys.J.705:L101-L103,2009", "doi": "10.1088/0004-637X/705/2/L101", "report-no": null, "categories": "astro-ph.GA astro-ph.EP physics.ao-ph physics.geo-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We re-examine past suggestions of a close link between terrestrial climate\nchange and the Sun's transit of spiral arms in its path through the Milky Way\ngalaxy. These links produced concrete fits, deriving the unknown spiral pattern\nspeed from terrestrial climate correlations. We test these fits against new\ndata on spiral structure based on CO data that does not make simplifying\nassumptions about symmetry and circular rotation. If we compare the times of\nthese transits to changes in the climate of Earth, not only do the claimed\ncorrelations disappear, but also we find that they cannot be resurrected for\nany reasonable pattern speed.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jun 2009 19:59:50 GMT"}, {"version": "v2", "created": "Wed, 16 Sep 2009 20:23:52 GMT"}], "update_date": "2011-02-11", "authors_parsed": [["Overholt", "Andrew C.", "", "University of Kansas"], ["Melott", "Adrian L.", "", "University of Kansas"], ["Pohl", "Martin K.", "", "Iowa State University"]]}, {"id": "0906.3106", "submitter": "Louxin Zhang", "authors": "Louxin Zhang, Jian Shen, Jialiang Yang, Guoliang Li", "title": "Analyzing the Accuracy of the Fitch Method for Reconstructing Ancestral\n  States on Ultrametric Phylogenies", "comments": "14pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recurrence formulas are presented for studying the accuracy of the Fitch\nmethod for reconstructing the ancestral states in a given phylogenetic tree. As\ntheir applications, we analyze the convergence of the accuracy of\nreconstructing the root state in a complete binary tree of $2^n$ as $n$ goes to\ninfinity and also give a lower bound on the accuracy of reconstructing the root\nstate in an ultrametric tree.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2009 08:32:43 GMT"}], "update_date": "2009-06-18", "authors_parsed": [["Zhang", "Louxin", ""], ["Shen", "Jian", ""], ["Yang", "Jialiang", ""], ["Li", "Guoliang", ""]]}, {"id": "0906.3319", "submitter": "Joanna Pressley", "authors": "Erika M. C. D'Agata, Glenn F. Webb, and Joanna Pressley", "title": "Rapid emergence of co-colonization with community-acquired and\n  hospital-acquired methicillin-resistant Staphylococcus aureus strains in the\n  hospital setting", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.OT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Community-acquired methicillin-resistant Staphylococcus aureus\n(CA-MRSA), a novel strain of MRSA, has recently emerged and rapidly spread in\nthe community. Invasion into the hospital setting with replacement of the\nhospital-acquired MRSA (HA-MRSA) has also been documented. Co-colonization with\nboth CA-MRSA and HA-MRSA would have important clinical implications given\ndifferences in antimicrobial susceptibility profiles and the potential for\nexchange of genetic information.\n  Methods: A deterministic mathematical model was developed to characterize the\ntransmission dynamics of HA-MRSA and CA-MRSA in the hospital setting and to\nquantify the emergence of co-colonization with both strains.\n  Results: The model analysis shows that the state of co-colonization becomes\nendemic over time and that there is no competitive exclusion of either strain.\nIncreasing the length of stay or rate of hospital entry among patients\ncolonized with CA-MRSA leads to a rapid increase in the co-colonized state.\nCompared to MRSA decolonization strategy, improving hand hygiene compliance has\nthe greatest impact on decreasing the prevalence of HA-MRSA, CA-MRSA and the\nco-colonized state.\n  Conclusions: The model predicts that with the expanding community reservoir\nof CA-MRSA, the majority of hospitalized patients will become colonized with\nboth CA-MRSA and HA-MRSA.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jun 2009 22:09:52 GMT"}, {"version": "v2", "created": "Fri, 19 Jun 2009 19:24:54 GMT"}], "update_date": "2009-06-19", "authors_parsed": [["D'Agata", "Erika M. C.", ""], ["Webb", "Glenn F.", ""], ["Pressley", "Joanna", ""]]}, {"id": "0906.3391", "submitter": "David Hochberg", "authors": "David Hochberg (Centro de Astrobiologia (CSIC-INTA), Madrid, Spain)", "title": "Mirror symmetry breaking and restoration: the role of noise and chiral\n  bias", "comments": "4 pages, 3 figures, to appear in the Physical Review Letters", "journal-ref": "Physical Review Letters 102, 248101 (2009)", "doi": "10.1103/PhysRevLett.102.248101", "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The nonequilibrium effective potential is computed for the Frank model of\nspontaneous mirror symmetry breaking (SMSB) in chemistry in which external\nnoise is introduced to account for random environmental effects. When these\nfluctuations exceed a critical magnitude, mirror symmetry is restored. The\ncompetition between ambient noise and the chiral bias due to physical fields\nand polarized radiation can be explored with this potential.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2009 09:42:08 GMT"}], "update_date": "2009-06-29", "authors_parsed": [["Hochberg", "David", "", "Centro de Astrobiologia"]]}, {"id": "0906.3507", "submitter": "Steven Frank", "authors": "Steven A. Frank", "title": "The common patterns of nature", "comments": "Published version freely available at DOI listed here", "journal-ref": "Journal of Evolutionary Biology 22:1563-1585 (2009)", "doi": "10.1111/j.1420-9101.2009.01775.x", "report-no": null, "categories": "q-bio.QM physics.data-an q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We typically observe large-scale outcomes that arise from the interactions of\nmany hidden, small-scale processes. Examples include age of disease onset,\nrates of amino acid substitutions, and composition of ecological communities.\nThe macroscopic patterns in each problem often vary around a characteristic\nshape that can be generated by neutral processes. A neutral generative model\nassumes that each microscopic process follows unbiased stochastic fluctuations:\nrandom connections of network nodes; amino acid substitutions with no effect on\nfitness; species that arise or disappear from communities randomly. These\nneutral generative models often match common patterns of nature. In this paper,\nI present the theoretical background by which we can understand why these\nneutral generative models are so successful. I show how the classic patterns\nsuch as Poisson and Gaussian arise. Each classic pattern was often discovered\nby a simple neutral generative model. The neutral patterns share a special\ncharacteristic: they describe the patterns of nature that follow from simple\nconstraints on information. For example, any aggregation of processes that\npreserves information only about the mean and variance attracts to the Gaussian\npattern; any aggregation that preserves information only about the mean\nattracts to the exponential pattern; any aggregation that preserves information\nonly about the geometric mean attracts to the power law pattern. I present an\ninformational framework of the common patterns of nature based on the method of\nmaximum entropy. This framework shows that each neutral generative model is a\nspecial case that helps to discover a particular set of informational\nconstraints; those informational constraints define a much wider domain of\nnon-neutral generative processes that attract to the same neutral pattern.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2009 19:10:38 GMT"}], "update_date": "2009-07-19", "authors_parsed": [["Frank", "Steven A.", ""]]}, {"id": "0906.3672", "submitter": "Philipp Altrock", "authors": "Philipp M. Altrock and Arne Traulsen", "title": "Deterministic evolutionary game dynamics in finite populations", "comments": "11 pages, 7 figures", "journal-ref": "Phys. Rev. E 80, 011909 (2009)", "doi": "10.1103/PhysRevE.80.011909", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary game dynamics describes the spreading of successful strategies\nin a population of reproducing individuals. Typically, the microscopic\ndefinition of strategy spreading is stochastic, such that the dynamics becomes\ndeterministic only in infinitely large populations. Here, we introduce a new\nmicroscopic birth--death process that has a fully deterministic strong\nselection limit in well--mixed populations of any size. Additionally, under\nweak selection, from this new process the frequency dependent Moran process is\nrecovered. This makes it a natural extension of the usual evolutionary dynamics\nunder weak selection. We find simple expressions for the fixation probabilities\nand average fixation times of the new process in evolutionary games with two\nplayers and two strategies. For cyclic games with two players and three\nstrategies, we show that the resulting deterministic dynamics crucially depends\non the initial condition in a non--trivial way.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jun 2009 13:57:23 GMT"}, {"version": "v2", "created": "Thu, 8 Jul 2010 11:07:03 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Altrock", "Philipp M.", ""], ["Traulsen", "Arne", ""]]}, {"id": "0906.4324", "submitter": "Philippe Gambette", "authors": "Philippe Gambette, Katharina T. Huber", "title": "A Note on Encodings of Phylogenetic Networks of Bounded Level", "comments": null, "journal-ref": null, "doi": "10.1007/s00285-011-0456-y", "report-no": null, "categories": "math.CO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Driven by the need for better models that allow one to shed light into the\nquestion how life's diversity has evolved, phylogenetic networks have now\njoined phylogenetic trees in the center of phylogenetics research. Like\nphylogenetic trees, such networks canonically induce collections of\nphylogenetic trees, clusters, and triplets, respectively. Thus it is not\nsurprising that many network approaches aim to reconstruct a phylogenetic\nnetwork from such collections. Related to the well-studied perfect phylogeny\nproblem, the following question is of fundamental importance in this context:\nWhen does one of the above collections encode (i.e. uniquely describe) the\nnetwork that induces it? In this note, we present a complete answer to this\nquestion for the special case of a level-1 (phylogenetic) network by\ncharacterizing those level-1 networks for which an encoding in terms of one (or\nequivalently all) of the above collections exists. Given that this type of\nnetwork forms the first layer of the rich hierarchy of level-k networks, k a\nnon-negative integer, it is natural to wonder whether our arguments could be\nextended to members of that hierarchy for higher values for k. By giving\nexamples, we show that this is not the case.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jun 2009 17:57:15 GMT"}], "update_date": "2016-10-04", "authors_parsed": [["Gambette", "Philippe", ""], ["Huber", "Katharina T.", ""]]}, {"id": "0906.4875", "submitter": "Mike Steel Prof.", "authors": "Mike Steel and Michael J. Sanderson", "title": "Characterizing phylogenetically decisive taxon coverage", "comments": "6 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Increasingly, biologists are constructing evolutionary trees on large numbers\nof overlapping sets of taxa, and then combining them into a `supertree' that\nclassifies all the taxa. In this paper, we ask how much coverage of the total\nset of taxa is required by these subsets in order to ensure we have enough\ninformation to reconstruct the supertree uniquely. We describe two results - a\ncombinatorial characterization of the covering subsets to ensure that at most\none supertree can be constructed from the smaller trees (whatever trees these\nmay be) and a more liberal analysis that asks only that the supertree is highly\nlikely to be uniquely specified by the tree structure on the covering subsets.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jun 2009 08:39:35 GMT"}], "update_date": "2009-06-29", "authors_parsed": [["Steel", "Mike", ""], ["Sanderson", "Michael J.", ""]]}, {"id": "0906.4986", "submitter": "Artem Novozhilov S", "authors": "Georgy P Karev, Artem S Novozhilov, and Faina S Berezovskaya", "title": "On the asymptotic behavior of the solutions to the replicator equation", "comments": "23 pages, 1 figure, several small changes are added, together with\n  the new title", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Selection systems and the corresponding replicator equations model the\nevolution of replicators with a high level of abstraction. In this paper we\napply novel methods of analysis of selection systems to the replicator\nequations. To be suitable for the suggested algorithm the interaction matrix of\nthe replicator equation should be transformed; in particular the standard\nsingular value decomposition allows us to rewrite the replicator equation in a\nconvenient form. The original $n$-dimensional problem is reduced to the\nanalysis of asymptotic behavior of the solutions to the so-called escort\nsystem, which in some important cases can be of significantly smaller dimension\nthan the original system. The Newton diagram methods are applied to study the\nasymptotic behavior of the solutions to the escort system, when interaction\nmatrix has rank 1 or 2. A general replicator equation with the interaction\nmatrix of rank 1 is fully analyzed; the conditions are provided when the\nasymptotic state is a polymorphic equilibrium. As an example of the system with\nthe interaction matrix of rank 2 we consider the problem from [Adams, M.R. and\nSornborger, A.T., J Math Biol, 54:357-384, 2007], for which we show, for\narbitrary dimension of the system and under some suitable conditions, that\ngenerically one globally stable equilibrium exits on the 1-skeleton of the\nsimplex.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jun 2009 17:49:22 GMT"}, {"version": "v2", "created": "Mon, 15 Mar 2010 07:24:04 GMT"}], "update_date": "2010-03-16", "authors_parsed": [["Karev", "Georgy P", ""], ["Novozhilov", "Artem S", ""], ["Berezovskaya", "Faina S", ""]]}, {"id": "0906.5535", "submitter": "Thomas Butler", "authors": "Thomas Butler and Nigel Goldenfeld", "title": "Robust ecological pattern formation induced by demographic noise", "comments": "Revised version. Supporting simulation at:\n  http://guava.physics.uiuc.edu/~tom/Netlogo/", "journal-ref": null, "doi": "10.1103/PhysRevE.80.030902", "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate that demographic noise can induce persistent spatial pattern\nformation and temporal oscillations in the Levin-Segel predator-prey model for\nplankton-herbivore population dynamics. Although the model exhibits a Turing\ninstability in mean field theory, demographic noise greatly enlarges the region\nof parameter space where pattern formation occurs. To distinguish between\npatterns generated by fluctuations and those present at the mean field level in\nreal ecosystems, we calculate the power spectrum in the noise-driven case and\npredict the presence of fat tails not present in the mean field case. These\nresults may account for the prevalence of large-scale ecological patterns,\nbeyond that expected from traditional non-stochastic approaches.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2009 14:12:21 GMT"}, {"version": "v2", "created": "Tue, 30 Jun 2009 20:54:34 GMT"}, {"version": "v3", "created": "Wed, 29 Jul 2009 00:31:02 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Butler", "Thomas", ""], ["Goldenfeld", "Nigel", ""]]}, {"id": "0906.5550", "submitter": "Baruch Meerson", "authors": "Baruch Meerson and Pavel V. Sasorov", "title": "WKB theory of epidemic fade-out in stochastic populations", "comments": "4 pages, 4 figures", "journal-ref": "Phys. Rev. E 80, 041130 (2009)", "doi": "10.1103/PhysRevE.80.041130", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastic effects may cause fade-out of an infectious disease in a\npopulation immediately after an epidemic outbreak. We develop WKB theory to\ndetermine the most probable path of the system toward epidemic fade-out and to\nevaluate the fade-out probability. The most probable path is an instanton-like\norbit in the phase space of the underlying Hamiltonian flow.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jun 2009 14:49:00 GMT"}, {"version": "v2", "created": "Wed, 16 Sep 2009 12:33:53 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Meerson", "Baruch", ""], ["Sasorov", "Pavel V.", ""]]}]