[{"id": "0912.0041", "submitter": "Mike Steel Prof.", "authors": "Mike Steel", "title": "Can we avoid 'SIN' in the house of 'No Common Mechanism'?", "comments": "33 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In 'no common mechanism' (NCM) models of character evolution, each character\ncan evolve on a phylogenetic tree under a partially or totally separate process\n(e.g. with its own branch lengths).\n  In such cases, the usual conditions that suffice to establish the statistical\nconsistency of tree reconstruction by methods such as maximum likelihood (ML)\nbreak down, suggesting that such methods may be prone to statistical\ninconsistency (SIN). In this paper we ask whether we can avoid SIN for tree\ntopology reconstruction when adopting such models, either by using ML or any\nother method that could be devised. We prove that it is possible to avoid SIN\nfor certain NCM models, but not for others, and the results depend delicately\non the tree reconstruction method employed. We also describe the biological\nrelevance of some recent mathematical results for the more usual 'common\nmechanism' setting. Our results are not intended to justify NCM, rather to set\nin place a framework within which such questions can be formally addressed.\n", "versions": [{"version": "v1", "created": "Mon, 30 Nov 2009 23:58:38 GMT"}], "update_date": "2009-12-02", "authors_parsed": [["Steel", "Mike", ""]]}, {"id": "0912.0157", "submitter": "Mauro Mobilia", "authors": "Mauro Mobilia and Michael Assaf", "title": "Fixation in Evolutionary Games under Non-Vanishing Selection", "comments": "4 figures, to appear in EPL (Europhysics Letters)", "journal-ref": "EPL Vol. 91, 10002 (2010)", "doi": "10.1209/0295-5075/91/10002", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech nlin.AO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the most striking effect of fluctuations in evolutionary game theory\nis the possibility for mutants to fixate (take over) an entire population.\nHere, we generalize a recent WKB-based theory to study fixation in evolutionary\ngames under non-vanishing selection, and investigate the relation between\nselection intensity w and demographic (random) fluctuations. This allows the\naccurate treatment of large fluctuations and yields the probability and mean\ntimes of fixation beyond the weak selection limit. The power of the theory is\ndemonstrated on prototypical models of cooperation dilemmas with multiple\nabsorbing states. Our predictions compare excellently with numerical\nsimulations and, for finite w, significantly improve over those of the\nFokker-Planck approximation.\n", "versions": [{"version": "v1", "created": "Tue, 1 Dec 2009 13:55:05 GMT"}, {"version": "v2", "created": "Thu, 4 Feb 2010 18:47:15 GMT"}, {"version": "v3", "created": "Mon, 21 Jun 2010 19:16:29 GMT"}], "update_date": "2010-08-27", "authors_parsed": [["Mobilia", "Mauro", ""], ["Assaf", "Michael", ""]]}, {"id": "0912.1250", "submitter": "Marcelo F C Gomes", "authors": "S. Goncalves, G. Abramson and M. F. C. Gomes", "title": "Oscillations in SIRS model with distributed delays", "comments": "18 pages, 12 figures", "journal-ref": "Eur. Phys. J. B 81 (2011) 363-371", "doi": "10.1140/epjb/e2011-20054-9", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ubiquity of oscillations in epidemics presents a long standing challenge\nfor the formulation of epidemic models. Whether they are external and\nseasonally driven, or arise from the intrinsic dynamics is an open problem. It\nis known that fixed time delays destabilize the steady state solution of the\nstandard SIRS model, giving rise to stable oscillations for certain parameters\nvalues. In this contribution, starting from the classical SIRS model, we make a\ngeneral treatment of the recovery and loss of immunity terms. We present\noscillation diagrams (amplitude and period) in terms of the parameters of the\nmodel, showing how oscillations can be destabilized by the shape of the\ndistributions of the two characteristic (infectious and immune) times. The\nformulation is made in terms of delay equation which are both numerical\nintegrated and linearized. Results from simulation are included showing where\nthey support the linear analysis and explaining why not where they do not.\nConsiderations and comparison with real diseases are presented along.\n", "versions": [{"version": "v1", "created": "Mon, 7 Dec 2009 14:25:42 GMT"}, {"version": "v2", "created": "Thu, 10 Dec 2009 11:34:00 GMT"}, {"version": "v3", "created": "Thu, 30 Sep 2010 20:52:03 GMT"}], "update_date": "2011-09-06", "authors_parsed": [["Goncalves", "S.", ""], ["Abramson", "G.", ""], ["Gomes", "M. F. C.", ""]]}, {"id": "0912.1390", "submitter": "Xiao-Pu Han", "authors": "Xiao-Pu Han, Bing-Hong Wang, Chang-Song Zhou, Tao Zhou, Jun-Fang Zhu", "title": "Scaling in the global spreading patterns of pandemic Influenza A (H1N1)\n  and the role of control: empirical statistics and modeling", "comments": "19figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph physics.data-an q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: The pandemic of influenza A (H1N1) is a serious on-going global\npublic crisis. Understanding its spreading dynamics is of fundamental\nimportance for both public health and scientific researches. Recent studies\nhave focused mainly on evaluation and prediction of on-going spreading, which\nstrongly depends on detailed information about the structure of social\ncontacts, human traveling patterns and biological activity of virus, etc.\n  Methodology/Principal Findings: In this work we analyzed the distributions of\nconfirmed cases of influenza A (H1N1) in different levels and find the Zipf's\nlaw and Heaps' law. Similar scaling properties were also observed for severe\nacute respiratory syndrome (SARS) and bird cases of H5N1. We also found a\nhierarchical spreading pattern from countries with larger population and GDP to\ncountries with smaller ones. We proposed a model that considers generic control\neffects on both the local growth and transregional transmission, without the\nneed of the above mentioned detailed information. We studied in detail the\nimpact of control effects and heterogeneity on the spreading dynamics in the\nmodel and showed that they are responsible for the scaling and hierarchical\nspreading properties observed in empirical data.\n  Conclusions/Significance: Our analysis and modeling showed that although\nstrict control measures for interregional travelers could delay the outbreak in\nthe regions without local cases, the focus should be turned to local prevention\nafter the outbreak of local cases. Target control on a few regions with the\nlargest number of active interregional travelers can efficiently prevent the\nspreading. This work provided not only a deeper understanding of the generic\nmechanisms underlying the spread of infectious diseases, but also some\npractical guidelines for decision makers to adopt suitable control strategies.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2009 02:37:12 GMT"}, {"version": "v2", "created": "Thu, 13 Jan 2011 01:59:09 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Han", "Xiao-Pu", ""], ["Wang", "Bing-Hong", ""], ["Zhou", "Chang-Song", ""], ["Zhou", "Tao", ""], ["Zhu", "Jun-Fang", ""]]}, {"id": "0912.1627", "submitter": "Tibor Antal", "authors": "Ivana Bozic, Tibor Antal, Hisashi Ohtsuki, Hannah Carter, Dewey Kim,\n  Sining Chen, Rachel Karchin, Kenneth W. Kinzler, Bert Vogelstein, and Martin\n  A. Nowak", "title": "Accumulation of driver and passenger mutations during tumor progression", "comments": null, "journal-ref": "PNAS 107, 18545 (2010)", "doi": "10.1073/pnas.1010978107", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Major efforts to sequence cancer genomes are now occurring throughout the\nworld. Though the emerging data from these studies are illuminating, their\nreconciliation with epidemiologic and clinical observations poses a major\nchallenge. In the current study, we provide a novel mathematical model that\nbegins to address this challenge. We model tumors as a discrete time branching\nprocess that starts with a single driver mutation and proceeds as each new\ndriver mutation leads to a slightly increased rate of clonal expansion. Using\nthe model, we observe tremendous variation in the rate of tumor development -\nproviding an understanding of the heterogeneity in tumor sizes and development\ntimes that have been observed by epidemiologists and clinicians. Furthermore,\nthe model provides a simple formula for the number of driver mutations as a\nfunction of the total number of mutations in the tumor. Finally, when applied\nto recent experimental data, the model allows us to calculate, for the first\ntime, the actual selective advantage provided by typical somatic mutations in\nhuman tumors in situ. This selective advantage is surprisingly small, 0.005 +-\n0.0005, and has major implications for experimental cancer research.\n", "versions": [{"version": "v1", "created": "Tue, 8 Dec 2009 22:33:58 GMT"}], "update_date": "2010-11-18", "authors_parsed": [["Bozic", "Ivana", ""], ["Antal", "Tibor", ""], ["Ohtsuki", "Hisashi", ""], ["Carter", "Hannah", ""], ["Kim", "Dewey", ""], ["Chen", "Sining", ""], ["Karchin", "Rachel", ""], ["Kinzler", "Kenneth W.", ""], ["Vogelstein", "Bert", ""], ["Nowak", "Martin A.", ""]]}, {"id": "0912.1957", "submitter": "Marta Casanellas", "authors": "Marta Casanellas, Jesus Fernandez-Sanchez", "title": "Relevant phylogenetic invariants of evolutionary models", "comments": "31 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AG q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently there have been several attempts to provide a whole set of\ngenerators of the ideal of the algebraic variety associated to a phylogenetic\ntree evolving under an algebraic model. These algebraic varieties have been\nproven to be useful in phylogenetics. In this paper we prove that, for\nphylogenetic reconstruction purposes, it is enough to consider generators\ncoming from the edges of the tree, the so-called edge invariants. This is the\nalgebraic analogous to Buneman's Splits Equivalence Theorem. The interest of\nthis result relies on its potential applications in phylogenetics for the\nwidely used evolutionary models such as Jukes-Cantor, Kimura 2 and 3\nparameters, and General Markov models.\n", "versions": [{"version": "v1", "created": "Thu, 10 Dec 2009 10:28:09 GMT"}], "update_date": "2009-12-11", "authors_parsed": [["Casanellas", "Marta", ""], ["Fernandez-Sanchez", "Jesus", ""]]}, {"id": "0912.2241", "submitter": "Stefan Grosskinsky", "authors": "Adnan Ali and Stefan Grosskinsky", "title": "Pattern formation through genetic drift at expanding population fronts", "comments": "17 pages with 9 figures", "journal-ref": "Adv. Compl. Sys. 13(3), 349-366 (2010)", "doi": "10.1142/S0219525910002578", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the nature of genetic drift acting at the leading edge of\nrange expansions, building on recent results in [Hallatschek et al., Proc.\\\nNatl.\\ Acad.\\ Sci., \\textbf{104}(50): 19926 - 19930 (2007)]. A well mixed\npopulation of two fluorescently labeled microbial species is grown in a\ncircular geometry. As the population expands, a coarsening process driven by\ngenetic drift gives rise to sectoring patterns with fractal boundaries, which\nshow a non-trivial asymptotic distribution. Using simplified lattice based\nMonte Carlo simulations as a generic caricature of the above experiment, we\npresent detailed numerical results to establish a model for sector boundaries\nas time changed Brownian motions. This is used to derive a general one-to-one\nmapping of sector statistics between circular and linear geometries, which\nleads to a full understanding of the sectoring patterns in terms of\nannihilating diffusions.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 14:36:28 GMT"}, {"version": "v2", "created": "Fri, 13 Aug 2010 12:52:35 GMT"}], "update_date": "2010-08-16", "authors_parsed": [["Ali", "Adnan", ""], ["Grosskinsky", "Stefan", ""]]}, {"id": "0912.2326", "submitter": "Junhyong Kim", "authors": "Sheng Guo (1,2), Li-San Wang (1,3), Junhyong Kim (1,2, 4) ((1) Penn\n  Center for Bioinformatics, (2) Genomics and Computational Biology Graduate\n  Group, (3) Institute on Aging, (4) Penn Genome Frontiers Institute)", "title": "Large-scale simulation of RNA macroevolution by an energy-dependent\n  fitness model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Simulated nucleotide sequences are widely used in theoretical and empirical\nmolecular evolution studies. Conventional simulators generally use fixed\nparameter time-homogeneous Markov model for sequence evolution. In this work,\nwe use the folding free energy of the secondary structure of an RNA as a proxy\nfor its phenotypic fitness, and simulate RNA macroevolution by a\nmutation-selection population genetics model. Because the two-step process is\nconditioned on an RNA and its mutant ensemble, we no longer have a global\nsubstitution matrix, nor do we explicitly assume any for this inhomogeneous\nstochastic process. After introducing the base model of RNA evolution, we\noutline the heuristic implementation algorithm and several model improvements.\nWe then discuss the calibration of the model parameters and demonstrate that in\nphylogeny reconstruction with both the parsimony method and the likelihood\nmethod, the sequences generated by our simulator, rnasim, have greater\nstatistical complexity than those by two standard simulators, ROSE and Seq-Gen,\nand are close to empirical sequences.\n", "versions": [{"version": "v1", "created": "Fri, 11 Dec 2009 19:47:19 GMT"}], "update_date": "2009-12-14", "authors_parsed": [["Guo", "Sheng", ""], ["Wang", "Li-San", ""], ["Kim", "Junhyong", ""]]}, {"id": "0912.2531", "submitter": "Richard A Neher", "authors": "Richard A. Neher and Boris I. Shraiman", "title": "Competition between recombination and epistasis can cause a transition\n  from allele to genotype selection", "comments": "Supplementary Material available on PNAS website", "journal-ref": "Proc Natl Acad Sci USA, vol. 106 pp. 6866-6871, 2009", "doi": "10.1073/pnas.0812560106", "report-no": "KITP 09-122", "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biochemical and regulatory interactions central to biological networks are\nexpected to cause extensive genetic interactions or epistasis affecting the\nheritability of complex traits and the distribution of genotypes in\npopulations. However, the inference of epistasis from the observed\nphenotype-genotype correlation is impeded by statistical difficulties, while\nthe theoretical understanding of the effects of epistasis remains limited, in\nturn limiting our ability to interpret data. Of particular interest is the\nbiologically relevant situation of numerous interacting genetic loci with small\nindividual contributions to fitness. Here, we present a computational model of\nselection dynamics involving many epistatic loci in a recombining population.\nWe demonstrate that a large number of polymorphic interacting loci can, despite\nfrequent recombination, exhibit cooperative behavior that locks alleles into\nfavorable genotypes leading to a population consisting of a set of competing\nclones. When the recombination rate exceeds a certain critical value that\ndepends on the strength of epistasis, this \"genotype selection\" regime\ndisappears in an abrupt transition, giving way to \"allele selection\"-the regime\nwhere different loci are only weakly correlated as expected in sexually\nreproducing populations. We show that large populations attain highest fitness\nat a recombination rate just below critical. Clustering of interacting sets of\ngenes on a chromosome leads to the emergence of an intermediate regime, where\nblocks of cooperating alleles lock into genetic modules. These haplotype blocks\ndisappear in a second transition to pure allele selection. Our results\ndemonstrate that the collective effect of many weak epistatic interactions can\nhave dramatic effects on the population structure.\n", "versions": [{"version": "v1", "created": "Sun, 13 Dec 2009 19:26:37 GMT"}], "update_date": "2009-12-15", "authors_parsed": [["Neher", "Richard A.", ""], ["Shraiman", "Boris I.", ""]]}, {"id": "0912.2536", "submitter": "Richard A Neher", "authors": "Richard A. Neher and Thomas Leitner", "title": "Recombination rate and selection strength in HIV intra-patient evolution", "comments": "to appear in PLoS Computational Biology", "journal-ref": "PLoS Comput Biol, 2010, 6(1): e1000660", "doi": "10.1371/journal.pcbi.1000660", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evolutionary dynamics of HIV during the chronic phase of infection is\ndriven by the host immune response and by selective pressures exerted through\ndrug treatment. To understand and model the evolution of HIV quantitatively,\nthe parameters governing genetic diversification and the strength of selection\nneed to be known. While mutation rates can be measured in single replication\ncycles, the relevant effective recombination rate depends on the probability of\ncoinfection of a cell with more than one virus and can only be inferred from\npopulation data. However, most population genetic estimators for recombination\nrates assume absence of selection and are hence of limited applicability to\nHIV, since positive and purifying selection are important in HIV evolution.\nHere, we estimate the rate of recombination and the distribution of selection\ncoefficients from time-resolved sequence data tracking the evolution of HIV\nwithin single patients. By examining temporal changes in the genetic\ncomposition of the population, we estimate the effective recombination to be\nr=1.4e-5 recombinations per site and generation. Furthermore, we provide\nevidence that selection coefficients of at least 15% of the observed\nnon-synonymous polymorphisms exceed 0.8% per generation. These results provide\na basis for a more detailed understanding of the evolution of HIV. A\nparticularly interesting case is evolution in response to drug treatment, where\nrecombination can facilitate the rapid acquisition of multiple resistance\nmutations. With the methods developed here, more precise and more detailed\nstudies will be possible, as soon as data with higher time resolution and\ngreater sample sizes is available.\n", "versions": [{"version": "v1", "created": "Sun, 13 Dec 2009 19:54:54 GMT"}], "update_date": "2012-08-01", "authors_parsed": [["Neher", "Richard A.", ""], ["Leitner", "Thomas", ""]]}, {"id": "0912.2563", "submitter": "Karthik Narayanaswami", "authors": "Karthik Narayanaswami", "title": "A Model-Based Approach to Predicting Predator-Prey & Friend-Foe\n  Relationships in Ant Colonies", "comments": "Graduate work done in Fall 2005 at the BORG Lab, College of\n  Computing, Georgia Institute of Technology, under the advisement of Professor\n  Tucker Balch", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CV q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding predator-prey relationships among insects is a challenging task\nin the domain of insect-colony research. This is due to several factors\ninvolved, such as determining whether a particular behavior is the result of a\npredator-prey interaction, a friend-foe interaction or another kind of\ninteraction. In this paper, we analyze a series of predator-prey and friend-foe\ninteractions in two colonies of carpenter ants to better understand and predict\nsuch behavior. Using the data gathered, we have also come up with a preliminary\nmodel for predicting such behavior under the specific conditions the experiment\nwas conducted in. In this paper, we present the results of our data analysis as\nwell as an overview of the processes involved.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2009 01:53:25 GMT"}], "update_date": "2009-12-15", "authors_parsed": [["Narayanaswami", "Karthik", ""]]}, {"id": "0912.2577", "submitter": "Sebastian Roch", "authors": "Alexandr Andoni and Constantinos Daskalakis and Avinatan Hassidim and\n  Sebastien Roch", "title": "Global Alignment of Molecular Sequences via Ancestral State\n  Reconstruction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR cs.DS math.ST q-bio.PE q-bio.QM stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Molecular phylogenetic techniques do not generally account for such common\nevolutionary events as site insertions and deletions (known as indels). Instead\ntree building algorithms and ancestral state inference procedures typically\nrely on substitution-only models of sequence evolution. In practice these\nmethods are extended beyond this simplified setting with the use of heuristics\nthat produce global alignments of the input sequences--an important problem\nwhich has no rigorous model-based solution. In this paper we consider a new\nversion of the multiple sequence alignment in the context of stochastic indel\nmodels. More precisely, we introduce the following {\\em trace reconstruction\nproblem on a tree} (TRPT): a binary sequence is broadcast through a tree\nchannel where we allow substitutions, deletions, and insertions; we seek to\nreconstruct the original sequence from the sequences received at the leaves of\nthe tree. We give a recursive procedure for this problem with strong\nreconstruction guarantees at low mutation rates, providing also an alignment of\nthe sequences at the leaves of the tree. The TRPT problem without indels has\nbeen studied in previous work (Mossel 2004, Daskalakis et al. 2006) as a\nbootstrapping step towards obtaining optimal phylogenetic reconstruction\nmethods. The present work sets up a framework for extending these works to\nevolutionary models with indels.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2009 05:37:42 GMT"}], "update_date": "2011-09-07", "authors_parsed": [["Andoni", "Alexandr", ""], ["Daskalakis", "Constantinos", ""], ["Hassidim", "Avinatan", ""], ["Roch", "Sebastien", ""]]}, {"id": "0912.2774", "submitter": "Lee Worden", "authors": "Lee Worden, Louis W. Botsford, Alan Hastings, Matthew D. Holland", "title": "Frequency responses of age-structured populations: Pacific salmon as an\n  example", "comments": "much revised: the version accepted by Theoretical Population Biology", "journal-ref": null, "doi": "10.1016/j.tpb.2010.07.004", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Increasing evidence of the effects of changing climate on physical ocean\nconditions and long-term changes in fish populations adds to the need to\nunderstand the effects of stochastic forcing on marine populations. Cohort\nresonance is of particular interest because it involves selective sensitivity\nto specific time scales of environmental variability, including that of mean\nage of reproduction, and, more importantly, very low frequencies (i.e.,\ntrends). We present an age-structured model for two Pacific salmon species with\nenvironmental variability in survival rate and in individual growth rate, hence\nspawning age distribution. We use computed frequency response curves and\nanalysis of the linearized dynamics to obtain two main results. First, the\nfrequency response of the population is affected by the life history stage at\nwhich variability affects the population; varying growth rate tends to excite\nperiodic resonance in age structure, while varying survival tends to excite\nlow-frequency fluctuation with more effect on total population size. Second,\ndecreasing adult survival strengthens the cohort resonance effect at all\nfrequencies, a finding that addresses the question of how fishing and climate\nchange will interact.\n", "versions": [{"version": "v1", "created": "Mon, 14 Dec 2009 23:31:11 GMT"}, {"version": "v2", "created": "Tue, 10 Aug 2010 02:17:45 GMT"}], "update_date": "2010-08-11", "authors_parsed": [["Worden", "Lee", ""], ["Botsford", "Louis W.", ""], ["Hastings", "Alan", ""], ["Holland", "Matthew D.", ""]]}, {"id": "0912.3225", "submitter": "Max Souza", "authors": "Fabio A. C. C. Chalub, Max O. Souza", "title": "The SIR epidemic model from a PDE point of view", "comments": null, "journal-ref": "Math. Comp. Modelling, 53 (7-8), 1568--1574 (2011)", "doi": "10.1016/j.mcm.2010.05.036", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a derivation of the classical SIR model through a mean-field\napproximation from a discrete version of SIR. We then obtain a hyperbolic\nforward Kolmogorov equation, and show that its projected characteristics\nrecover the standard SIR model. Moreover, we show that the long time limit of\nthe evolution will be a Dirac measure. The exact position will depend on the\nwell-know $R_0$ parameter, and it will be supported on the corresponding stable\nSIR equilibrium.\n", "versions": [{"version": "v1", "created": "Wed, 16 Dec 2009 18:55:29 GMT"}], "update_date": "2013-01-21", "authors_parsed": [["Chalub", "Fabio A. C. C.", ""], ["Souza", "Max O.", ""]]}, {"id": "0912.3351", "submitter": "Baruch Meerson", "authors": "Michael Khasin, Baruch Meerson and Pavel V. Sasorov", "title": "Time-resolved extinction rates of stochastic populations", "comments": "8 pages, 4 figures", "journal-ref": "Phys. Rev. E 81, 031126 (2010)", "doi": "10.1103/PhysRevE.81.031126", "report-no": null, "categories": "cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Extinction of a long-lived isolated stochastic population can be described as\nan exponentially slow decay of quasi-stationary probability distribution of the\npopulation size. We address extinction of a population in a two-population\nsystem in the case when the population turnover -- renewal and removal -- is\nmuch slower than all other processes. In this case there is a time scale\nseparation in the system which enables one to introduce a short-time\nquasi-stationary extinction rate W_1 and a long-time quasi-stationary\nextinction rate W_2, and develop a time-dependent theory of the transition\nbetween the two rates. It is shown that W_1 and W_2 coincide with the\nextinction rates when the population turnover is absent, and present but very\nslow, respectively. The exponentially large disparity between the two rates\nreflects fragility of the extinction rate in the population dynamics without\nturnover.\n", "versions": [{"version": "v1", "created": "Thu, 17 Dec 2009 09:43:36 GMT"}, {"version": "v2", "created": "Wed, 10 Mar 2010 15:31:30 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Khasin", "Michael", ""], ["Meerson", "Baruch", ""], ["Sasorov", "Pavel V.", ""]]}, {"id": "0912.4189", "submitter": "Christel Kamp", "authors": "Christel Kamp", "title": "Untangling the interplay between epidemic spreading and transmission\n  network dynamic", "comments": "16 pages, 3 figures", "journal-ref": "PLoS Comput Biol 6(11): e1000984 (2010)", "doi": "10.1371/journal.pcbi.1000984", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Epidemic spreading of infectious diseases is ubiquitous and has often\nconsiderable impact on public health and economic wealth. The large variability\nin spatio-temporal patterns of epidemics prohibits simple interventions and\ndemands for a detailed analysis of each epidemic with respect to its infectious\nagent and the corresponding routes of transmission. To facilitate this\nanalysis, a mathematical framework is introduced which links epidemic patterns\nto the topology and dynamics of the underlying transmission network. The\nevolution both in disease prevalence and transmission network topology are\nderived from a closed set of partial differential equations for infections\nwithout recovery which are in excellent agreement with complementarily\nconducted agent based simulations. The mutual influence between the epidemic\nprocess and its transmission network is shown by several case studies on HIV\nepidemics in synthetic populations. They reveal context dependent key processes\nwhich drive the epidemic and which in turn can be exploited for targeted\nintervention strategies. The mathematical framework provides a capable toolbox\nto analyze epidemics from first principles. This allows for fast in silico\nmodeling - and manipulation - of epidemics which is especially powerful if\ncomplemented with adequate empirical data for parametrization.\n", "versions": [{"version": "v1", "created": "Mon, 21 Dec 2009 16:08:36 GMT"}], "update_date": "2010-11-25", "authors_parsed": [["Kamp", "Christel", ""]]}, {"id": "0912.4472", "submitter": "John Rhodes", "authors": "Elizabeth S. Allman, James H. Degnan, John A. Rhodes", "title": "Identifying the Rooted Species Tree from the Distribution of Unrooted\n  Gene Trees under the Coalescent", "comments": "Additional material extends results to polytomous species trees", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Gene trees are evolutionary trees representing the ancestry of genes sampled\nfrom multiple populations. Species trees represent populations of individuals\n-- each with many genes -- splitting into new populations or species. The\ncoalescent process, which models ancestry of gene copies within populations, is\noften used to model the probability distribution of gene trees given a fixed\nspecies tree. This multispecies coalescent model provides a framework for\nphylogeneticists to infer species trees from gene trees using maximum\nlikelihood or Bayesian approaches. Because the coalescent models a branching\nprocess over time, all trees are typically assumed to be rooted in this\nsetting. Often, however, gene trees inferred by traditional phylogenetic\nmethods are unrooted.\n  We investigate probabilities of unrooted gene trees under the multispecies\ncoalescent model. We show that when there are 4 species with one gene sampled\nper species, the distribution of unrooted gene tree topologies identifies the\nunrooted species tree topology and some, but not all, information in the\nspecies tree edges (branch lengths). The location of the root on the species\ntree is not identifiable in this situation. However, for 5 or more species with\none gene sampled per species, we show that the distribution of unrooted gene\ntree topologies identifies the rooted species tree topology and all its\ninternal branch lengths. The length of any pendent branch leading to a leaf of\nthe species tree is also identifiable for any species from which more than one\ngene is sampled.\n", "versions": [{"version": "v1", "created": "Tue, 22 Dec 2009 18:00:39 GMT"}, {"version": "v2", "created": "Thu, 29 Jul 2010 18:07:14 GMT"}], "update_date": "2010-07-30", "authors_parsed": [["Allman", "Elizabeth S.", ""], ["Degnan", "James H.", ""], ["Rhodes", "John A.", ""]]}, {"id": "0912.4502", "submitter": "Steven Kelk", "authors": "Leo van Iersel and Steven Kelk", "title": "A short note on the tractability of constructing phylogenetic networks\n  from clusters", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In [2] it was proven that the Cass algorithm is a polynomial-time algorithm\nfor constructing level<=2 networks from clusters. Here we demonstrate, for each\nk>=0, a polynomial-time algorithm for constructing level-k phylogenetic\nnetworks from clusters. Unlike Cass the algorithm scheme given here is only of\ntheoretical interest. It does, however, strengthen the hope that efficient\npolynomial-time algorithms (and perhaps fixed parameter tractable algorithms)\nexist for this problem.\n", "versions": [{"version": "v1", "created": "Tue, 22 Dec 2009 20:29:29 GMT"}], "update_date": "2009-12-23", "authors_parsed": [["van Iersel", "Leo", ""], ["Kelk", "Steven", ""]]}, {"id": "0912.4662", "submitter": "Gergely R\\\"ost", "authors": "Di\\'ana Knipl, Gergely R\\\"ost", "title": "Modelling the strategies for age specific vaccination scheduling during\n  influenza pandemic outbreaks", "comments": null, "journal-ref": "Mathematical Biosciences and Engineering (MBE) Pages: 123 - 139,\n  Volume: 8 , Issue: 1 , January 2011", "doi": "10.3934/mbe.2011.8.123", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Finding optimal policies to reduce the morbidity and mortality of the ongoing\npandemic is a top public health priority. Using a compartmental model with age\nstructure and vaccination status, we examined the effect of age specific\nscheduling of vaccination during a pandemic influenza outbreak, when there is a\nrace between the vaccination campaign and the dynamics of the pandemic. Our\nresults agree with some recent studies on that age specificity is paramount to\nvaccination planning. However, little is known about the effectiveness of such\ncontrol measures when they are applied during the outbreak. Comparing five\npossible strategies, we found that age specific scheduling can have a huge\nimpact on the outcome of the epidemic. For the best scheme, the attack rates\nwere up to 10% lower than for other strategies. We demonstrate the importance\nof early start of the vaccination campaign, since ten days delay may increase\nthe attack rate by up to 6%. Taking into account the delay between developing\nimmunity and vaccination is a key factor in evaluating the impact of\nvaccination campaigns. We provide a general framework which will be useful for\nthe next pandemic waves as well.\n", "versions": [{"version": "v1", "created": "Wed, 23 Dec 2009 15:26:25 GMT"}, {"version": "v2", "created": "Sat, 20 Mar 2010 23:21:46 GMT"}, {"version": "v3", "created": "Tue, 28 Feb 2012 16:45:08 GMT"}], "update_date": "2012-02-29", "authors_parsed": [["Knipl", "Diána", ""], ["Röst", "Gergely", ""]]}, {"id": "0912.4714", "submitter": "Emmanuel Tannenbaum", "authors": "Eran Itan and Emmanuel Tannenbaum", "title": "Semiconservative quasispecies equations for polysomic genomes: The\n  general case", "comments": "16 pages, 3 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.81.061915", "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper develops a formulation of the quasispecies equations appropriate\nfor polysomic, semiconservatively replicating genomes. This paper is an\nextension of previous work on the subject, which considered the case of haploid\ngenomes. Here, we develop a more general formulation of the quasispecies\nequations that is applicable to diploid and even polyploid genomes.\nInterestingly, with an appropriate classification of population fractions, we\nobtain a system of equations that is formally identical to the haploid case. As\nwith the work for haploid genomes, we consider both random and immortal DNA\nstrand chromosome segregation mechanisms. However, in contrast to the haploid\ncase, we have found that an analytical solution for the mean fitness is\nconsiderably more difficult to obtain for the polyploid case. Accordingly,\nwhereas for the haploid case we obtained expressions for the mean fitness for\nthe case of an analogue of the single-fitness-peak landscape for arbitrary\nlesion repair probabilities (thereby allowing for non-complementary genomes),\nhere we solve for the mean fitness for the restricted case of perfect lesion\nrepair.\n", "versions": [{"version": "v1", "created": "Wed, 23 Dec 2009 19:13:10 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Itan", "Eran", ""], ["Tannenbaum", "Emmanuel", ""]]}, {"id": "0912.4726", "submitter": "Eugene Shakhnovich", "authors": "Muyoung Heo and Eugene Shakhnovich", "title": "Interplay between pleiotropy and secondary selection determines rise and\n  fall of mutators in stress response", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1000710", "report-no": null, "categories": "q-bio.BM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dramatic rise of mutators has been found to accompany adaptation of bacteria\nin response to many kinds of stress. Two views on the evolutionary origin of\nthis phenomenon emerged: the pleiotropic hypothesis positing that it is a\nbyproduct of environmental stress or other specific stress response mechanisms\nand the second order selection which states that mutators hitchhike to fixation\nwith unrelated beneficial alleles. Conventional population genetics models\ncould not fully resolve this controversy because they are based on certain\nassumptions about fitness landscape. Here we address this problem using a\nmicroscopic multiscale model, which couples physically realistic molecular\ndescriptions of proteins and their interactions with population genetics of\ncarrier organisms without assuming any a priori fitness landscape. We found\nthat both pleiotropy and second order selection play a crucial role at\ndifferent stages of adaptation: the supply of mutators is provided through\ndestabilization of error correction complexes or fluctuations of production\nlevels of prototypic mismatch repair proteins (pleiotropic effects), while rise\nand fixation of mutators occur when there is a sufficient supply of beneficial\nmutations in replication-controlling genes. This general mechanism assures a\nrobust and reliable adaptation of organisms to unforeseen challenges. This\nstudy highlights physical principles underlying physical biological mechanisms\nof stress response and adaptation.\n", "versions": [{"version": "v1", "created": "Wed, 23 Dec 2009 20:43:19 GMT"}], "update_date": "2015-05-14", "authors_parsed": [["Heo", "Muyoung", ""], ["Shakhnovich", "Eugene", ""]]}, {"id": "0912.4960", "submitter": "Emmanuel Tannenbaum", "authors": "Nathaniel Wagner, Emmanuel Tannenbaum, and Gonen Ashkenasy", "title": "Second-Order Catalytic Quasispecies Yields First-Order Phase Transition", "comments": "11 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The quasispecies model describes processes related to the origin of life and\nviral evolutionary dynamics. We discuss how the error catastrophe that reflects\nthe transition from localized to delocalized quasispecies population is\naffected by catalytic replication of different reaction orders. Specifically,\nwe find that 2nd order mechanisms lead to 1st order discontinuous phase\ntransitions in the viable population fraction, and conclude that the \"higher\"\nthe interaction the \"lower\" the transition. We discuss potential implications\nfor understanding the replication of highly mutating RNA viruses.\n", "versions": [{"version": "v1", "created": "Fri, 25 Dec 2009 10:22:57 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Wagner", "Nathaniel", ""], ["Tannenbaum", "Emmanuel", ""], ["Ashkenasy", "Gonen", ""]]}, {"id": "0912.5179", "submitter": "Mauro Mobilia", "authors": "Mauro Mobilia", "title": "Oscillatory Dynamics in Rock-Paper-Scissors Games with Mutations", "comments": "25 pages, 9 figures. To appear in the Journal of Theoretical Biology", "journal-ref": "J. Theor. Biol. 264, 1-10 (2010)", "doi": "10.1016/j.jtbi.2010.01.008", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech nlin.AO physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the oscillatory dynamics in the generic three-species\nrock-paper-scissors games with mutations. In the mean-field limit, different\nbehaviors are found: (a) for high mutation rate, there is a stable interior\nfixed point with coexistence of all species; (b) for low mutation rates, there\nis a region of the parameter space characterized by a limit cycle resulting\nfrom a Hopf bifurcation; (c) in the absence of mutations, there is a region\nwhere heteroclinic cycles yield oscillations of large amplitude (not robust\nagainst noise). After a discussion on the main properties of the mean-field\ndynamics, we investigate the stochastic version of the model within an\nindividual-based formulation. Demographic fluctuations are therefore naturally\naccounted and their effects are studied using a diffusion theory complemented\nby numerical simulations. It is thus shown that persistent erratic oscillations\n(quasi-cycles) of large amplitude emerge from a noise-induced resonance\nphenomenon. We also analytically and numerically compute the average escape\ntime necessary to reach a (quasi-)cycle on which the system oscillates at a\ngiven amplitude.\n", "versions": [{"version": "v1", "created": "Mon, 28 Dec 2009 15:07:55 GMT"}, {"version": "v2", "created": "Tue, 26 Jan 2010 14:00:03 GMT"}], "update_date": "2010-03-17", "authors_parsed": [["Mobilia", "Mauro", ""]]}, {"id": "0912.5288", "submitter": "Peter Waddell", "authors": "Peter J. Waddell and Ariful Azad", "title": "Resampling Residuals: Robust Estimators of Error and Fit for\n  Evolutionary Trees and Phylogenomics", "comments": "29 pages, including 11 figures and 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Phylogenomics, even more so than traditional phylogenetics, needs to\nrepresent the uncertainty in evolutionary trees due to systematic error. Here\nwe illustrate the analysis of genome-scale alignments of yeast, using robust\nmeasures of the additivity of the fit of distances to tree when using flexi\nWeighted Least Squares. A variety of DNA and protein distances are used. We\nexplore the nature of the residuals, standardize them, and then create\nreplicate data sets by resampling these residuals. Under the model, the results\nare shown to be very similar to the conventional sequence bootstrap. With real\ndata they show up uncertainty in the tree that is either due to underestimating\nthe stochastic error (hence massively overestimating the effective sequence\nlength) and/or systematic error. The methods are extended to the very fast BME\ncriterion with similarly promising results.\n", "versions": [{"version": "v1", "created": "Tue, 29 Dec 2009 10:41:11 GMT"}], "update_date": "2009-12-31", "authors_parsed": [["Waddell", "Peter J.", ""], ["Azad", "Ariful", ""]]}]