[{"id": "1104.0021", "submitter": "Stuart Borrett Stuart Borrett", "authors": "Stuart R. Borrett, Andria K. Salas", "title": "Evidence for Resource Homogenization in 50 Trophic Ecosystem Networks", "comments": "10 pages, 3 figures, 1 table", "journal-ref": "Borrett, S.R., A.K. Salas. 2010. Evidence for resource\n  homogenization in 50 trophic ecosystem networks. Ecological Modelling 221:\n  1710-1716", "doi": "10.1016/j.ecolmodel.2010.04.004", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Connectivity patterns of ecological elements are often the core concern of\necologists working at multiple levels of organization (e.g., populations,\necosystems, and landscapes) because these patterns often reflect the forces\nshaping the system's development as well as constraining their operation. One\nreason these patterns of direct connections are critical is that they establish\nthe pathways through which elements influence each other indirectly. Here, we\ntested a hypothesized consequence of connectivity in ecosystems: the\nhomogenization of resource distributions in flow networks. Specifically, we\ntested the generality of the systems ecology hypothesis of resource\nhomogenization in 50 empirically derived trophic ecosystem models representing\n35 distinct ecosystems. We applied Ecological Network Analysis to calculate\nresource homogenization for these models. We further evaluated the robustness\nof our results in two ways. First, we verified the close correspondence between\nthe input- and output-oriented homogenization values to ensure that our results\nwere not biased by our decision to focus on the output orientation. Second, we\nconducted a Monte Carlo based uncertainty analysis to determine the robustness\nof our results to +/-5% error introduced into the original flow matrices for\neach model. Our results show that resource homogenization occurs universally in\nthe 50 ecosystem models tested. We confirm that our results are not biased by\nusing the output-oriented homogenization values because there is a significant\nlinear regression between the input and output oriented homogenization (r^2 =\n0.38, p < 0.001). Finally, we found that our results are robust to +/-5% error\nin the flow matrices. In conclusion, we found strong support for the resource\nhomogenization hypothesis in 50 empirically derived ecosystem models.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2011 20:16:04 GMT"}], "update_date": "2011-04-04", "authors_parsed": [["Borrett", "Stuart R.", ""], ["Salas", "Andria K.", ""]]}, {"id": "1104.0025", "submitter": "Chris Adami", "authors": "Christoph Adami, Jifeng Qian, Matthew Rupp, and Arend Hintze", "title": "Information content of colored motifs in complex networks", "comments": "21 pages, 8 figures, to appear in Artificial Life", "journal-ref": "Artificial Life 17 (2011) 375-390", "doi": "10.1162/artl_a_00045", "report-no": null, "categories": "q-bio.QM cs.IT math.IT nlin.AO q-bio.MN q-bio.NC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study complex networks in which the nodes of the network are tagged with\ndifferent colors depending on the functionality of the nodes (colored graphs),\nusing information theory applied to the distribution of motifs in such\nnetworks. We find that colored motifs can be viewed as the building blocks of\nthe networks (much more so than the uncolored structural motifs can be) and\nthat the relative frequency with which these motifs appear in the network can\nbe used to define the information content of the network. This information is\ndefined in such a way that a network with random coloration (but keeping the\nrelative number of nodes with different colors the same) has zero color\ninformation content. Thus, colored motif information captures the\nexceptionality of coloring in the motifs that is maintained via selection. We\nstudy the motif information content of the C. elegans brain as well as the\nevolution of colored motif information in networks that reflect the interaction\nbetween instructions in genomes of digital life organisms. While we find that\ncolored motif information appears to capture essential functionality in the C.\nelegans brain (where the color assignment of nodes is straightforward) it is\nnot obvious whether the colored motif information content always increases\nduring evolution, as would be expected from a measure that captures network\ncomplexity. For a single choice of color assignment of instructions in the\ndigital life form Avida, we find rather that colored motif information content\nincreases or decreases during evolution, depending on how the genomes are\norganized, and therefore could be an interesting tool to dissect genomic\nrearrangements.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2011 20:35:44 GMT"}], "update_date": "2011-11-08", "authors_parsed": [["Adami", "Christoph", ""], ["Qian", "Jifeng", ""], ["Rupp", "Matthew", ""], ["Hintze", "Arend", ""]]}, {"id": "1104.0174", "submitter": "Matteo Convertino", "authors": "M. Convertino, J.F. Donoghue, M.L. Chu-Agor, G. A. Kiker, R.\n  Munoz-Carpena, R.A. Fischer, I. Linkov", "title": "Anthropogenic Renourishment Feedback on Shorebirds: a Multispecies\n  Bayesian Perspective", "comments": "in press; Journal of Ecological Engineering 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.OT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper the realized niche of the Snowy Plover (Charadrius\nalexandrinus), a primarily resident Florida shorebird, is described as a\nfunction of the scenopoetic and bionomic variables at the nest-, landscape-,\nand regional-scale. We identified some pos- sible geomorphological controls\nthat influence nest-site selection and survival using data collected along the\nFlorida Gulf coast. In particular we focused on the effects of beach\nreplenishment interventions on the Snowy Plover (SP), and on the migratory\nPiping Plover (PP) (Charadrius melodus) and Red Knot (RK) (Calidris canutus).\nTo quantify the relationship between past renourishment projects and shorebird\nspecies we used a Monte Carlo procedure to sample from the posterior\ndistribution of the binomial probabilities that a region is not a nesting or a\nwintering ground conditional on the occurrence of a beach replenishment\nintervention in the same and the previous year. The results indicate that it\nwas 2.3, 3.1, and 0.8 times more likely that a region was not a wintering\nground following a year with a renourishment intervention for the SP, PP and RK\nrespectively. For the SP it was 2.5. times more likely that a region was not a\nbreeding ground after a renourishment event. Through a maximum entropy\nprinciple model we observed small differences in the habitat use of the SP\nduring the breeding and the wintering season. However the habitats where RK was\nobserved ap- peared quite different. Maintaining and creating optimal suitable\nhabitats for SP characterized by sparse low vegetation in the foredunes areas,\nand uneven/low-slope beach surfaces, is the proposed conservation scenario to\nconvert anthropic beach restorations and SP populations into a positive\nfeedback without impacting other threatened shorebird species.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2011 13:57:06 GMT"}], "update_date": "2011-04-04", "authors_parsed": [["Convertino", "M.", ""], ["Donoghue", "J. F.", ""], ["Chu-Agor", "M. L.", ""], ["Kiker", "G. A.", ""], ["Munoz-Carpena", "R.", ""], ["Fischer", "R. A.", ""], ["Linkov", "I.", ""]]}, {"id": "1104.0343", "submitter": "William Lee", "authors": "Andrei Korobeinikov, William T. Lee", "title": "Global asymptotic properties for a Leslie-Gower food chain model", "comments": "5 Pages, 1 figure. Keywords: Leslie-Gower model, Lyapunov function,\n  global stability", "journal-ref": "Mathematical Biosciences and Engineering 6:585-590 (2009)", "doi": "10.3934/mbe.2009.6.585", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study global asymptotic properties of a continuous time Leslie-Gower food\nchain model. We construct a Lyapunov function which enables us to establish\nglobal asymptotic stability of the unique coexisting equilibrium state.\n", "versions": [{"version": "v1", "created": "Sat, 2 Apr 2011 23:38:50 GMT"}], "update_date": "2011-04-05", "authors_parsed": [["Korobeinikov", "Andrei", ""], ["Lee", "William T.", ""]]}, {"id": "1104.0366", "submitter": "Segun Goh", "authors": "Segun Goh, H. W. Kwon, M. Y. Choi, and Jean-Yves Fortin", "title": "Emergence of skew distributions in controlled growth processes", "comments": "9 pages, 3 figures", "journal-ref": "Physical Review E 82, 061115 (2010)", "doi": "10.1103/PhysRevE.82.061115", "report-no": null, "categories": "cond-mat.stat-mech math-ph math.MP physics.data-an q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Starting from a master equation, we derive the evolution equation for the\nsize distribution of elements in an evolving system, where each element can\ngrow, divide into two, and produce new elements. We then probe general\nsolutions of the evolution quation, to obtain such skew distributions as\npower-law, log-normal, and Weibull distributions, depending on the growth or\ndivision and production. Specifically, repeated production of elements of\nuniform size leads to power-law distributions, whereas production of elements\nwith the size distributed according to the current distribution as well as no\nproduction of new elements results in log-normal distributions. Finally,\ndivision into two, or binary fission, bears Weibull distributions. Numerical\nsimulations are also carried out, confirming the validity of the obtained\nsolutions.\n", "versions": [{"version": "v1", "created": "Sun, 3 Apr 2011 09:23:51 GMT"}], "update_date": "2011-04-05", "authors_parsed": [["Goh", "Segun", ""], ["Kwon", "H. W.", ""], ["Choi", "M. Y.", ""], ["Fortin", "Jean-Yves", ""]]}, {"id": "1104.0529", "submitter": "Richard A. Blythe", "authors": "Richard A Blythe", "title": "Random copying in space", "comments": "26 pages, 11 figures. Based on invited talk at AHRC CECD Conference\n  on \"Cultural Evolution in Spatially Structured Populations\" at UCL, September\n  2010. To appear in ACS - Advances in Complex Systems", "journal-ref": "ACS - Advances in Complex Systems (2012) 15 1150012", "doi": "10.1142/S0219525911003396", "report-no": null, "categories": "physics.soc-ph cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Random copying is a simple model for population dynamics in the absence of\nselection, and has been applied to both biological and cultural evolution. In\nthis work, we investigate the effect that spatial structure has on the\ndynamics. We focus in particular on how a measure of the diversity in the\npopulation changes over time. We show that even when the vast majority of a\npopulation's history may be well-described by a spatially-unstructured model,\nspatial structure may nevertheless affect the expected level of diversity seen\nat a local scale. We demonstrate this phenomenon explicitly by examining the\nrandom copying process on small-world networks, and use our results to comment\non the use of simple random-copying models in an empirical context.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2011 11:31:25 GMT"}], "update_date": "2015-05-26", "authors_parsed": [["Blythe", "Richard A", ""]]}, {"id": "1104.0727", "submitter": "Joseph Heled", "authors": "Joseph Heled", "title": "Average Sequence dissimilarity under simple multi-species coalescent", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show how to analytically derive the average sequence dissimilarity (ASD)\nwithin and between species under a simplified multi-species coalescent setup.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2011 04:19:00 GMT"}], "update_date": "2011-04-06", "authors_parsed": [["Heled", "Joseph", ""]]}, {"id": "1104.1905", "submitter": "Carsten Lemmen", "authors": "Carsten Lemmen and Detlef Gronenborn and Kai W. Wirtz", "title": "A simulation of the Neolithic transition in Western Eurasia", "comments": "Accepted Author Manuscript version accepted for publication in\n  Journal of Archaeological Science. A definitive version will be subsequently\n  published in the Journal of Archaological Science", "journal-ref": "Journal of Archaeological Science Vol 38 (12), pp. 3459-3470, 2011", "doi": "10.1016/j.jas.2011.08.008", "report-no": null, "categories": "cs.MA q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Farming and herding were introduced to Europe from the Near East and\nAnatolia; there are, however, considerable arguments about the mechanisms of\nthis transition. Were it people who moved and outplaced the indigenous hunter-\ngatherer groups or admixed with them? Or was it just material and information\nthat moved-the Neolithic Package-consisting of domesticated plants and animals\nand the knowledge of its use? The latter process is commonly referred to as\ncultural diffusion and the former as demic diffusion. Despite continuous and\npartly combined efforts by archaeologists, anthropologists, linguists,\npaleontologists and geneticists a final resolution of the debate has not yet\nbeen reached. In the present contribution we interpret results from the Global\nLand Use and technological Evolution Simulator (GLUES), a mathematical model\nfor regional sociocultural development embedded in the western Eurasian\ngeoenvironmental context during the Holocene. We demonstrate that the model is\nable to realistically hindcast the expansion speed and the inhomogeneous\nspace-time evolution of the transition to agropastoralism in Europe. GLUES, in\ncontrast to models that do not resolve endogenous sociocultural dynamics, also\ndescribes and explains how and why the Neolithic advanced in stages. In the\nmodel analysis, we uncouple the mechanisms of migration and information\nexchange. We find that (1) an indigenous form of agropastoralism could well\nhave arisen in certain Mediterranean landscapes, but not in Northern and\nCentral Europe, where it depended on imported technology and material, (2) both\ndemic diffusion by migration or cultural diffusion by trade may explain the\nwestern European transition equally well, (3) [...]\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2011 11:15:04 GMT"}, {"version": "v2", "created": "Fri, 12 Aug 2011 08:14:41 GMT"}], "update_date": "2011-11-08", "authors_parsed": [["Lemmen", "Carsten", ""], ["Gronenborn", "Detlef", ""], ["Wirtz", "Kai W.", ""]]}, {"id": "1104.1930", "submitter": "Lennart Hilbert", "authors": "Lennart Hilbert", "title": "Shifting gears: Thermodynamics of genetic information storage suggest\n  stress-dependence of mutation rate, which can accelerate adaptation", "comments": "15 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Acceleration of adaptation dynamics by stress-induced\nhypermutation has been found experimentally. Evolved evolvability is a\nprominent explanation. We investigate a more generally applicable explanation\nby a physical constraint. Methods and Results: A generic thermodynamical\nanalysis of genetic information storage obviates physical constraints on the\nintegrity of genetic information. The capability to employ metabolic resources\nis found as a major determinant of mutation probability in stored genetic\ninformation. Incorporation into a non-recombinant, asexual adaptation toy model\npredicts cases of markedly accelerated adaptation, driven by a transient\nincrease of mutation rate. No change in the mutation rate as a genetic trait is\nrequired. The mutation rate of one and the same genotype varies dependent on\nstress level. Implications: Stress-dependent mutation rates are physically\nnecessary and challenge a condition-independent genotype to mutation rate\nmapping. This holds implications for evolutionary theory and pathogen and\ncancer evolution.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2011 12:47:30 GMT"}], "update_date": "2011-04-12", "authors_parsed": [["Hilbert", "Lennart", ""]]}, {"id": "1104.2464", "submitter": "Kirill Korolev S", "authors": "K. S. Korolev and David R. Nelson", "title": "Competition and cooperation in one-dimensional stepping stone models", "comments": "8 pages, 4 figures", "journal-ref": null, "doi": "10.1103/PhysRevLett.107.088103", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperative mutualism is a major force driving evolution and sustaining\necosystems. Although the importance of spatial degrees of freedom and number\nfluctuations is well-known, their effects on mutualism are not fully\nunderstood. With range expansions of microbes in mind, we show that, even when\nmutualism confers a distinct selective advantage, it persists only in\npopulations with high density and frequent migrations. When these parameters\nare reduced, mutualism is generically lost via a directed percolation process,\nwith a phase diagram strongly influenced by an exceptional DP2 transition.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2011 12:15:48 GMT"}, {"version": "v2", "created": "Sun, 17 Apr 2011 21:06:01 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Korolev", "K. S.", ""], ["Nelson", "David R.", ""]]}, {"id": "1104.2562", "submitter": "Mareike Fischer", "authors": "Mareike Fischer", "title": "Mathematical aspects of phylogenetic groves", "comments": "17 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.DS math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The inference of new information on the relatedness of species by\nphylogenetic trees based on DNA data is one of the main challenges of modern\nbiology. But despite all technological advances, DNA sequencing is still a\ntime-consuming and costly process. Therefore, decision criteria would be\ndesirable to decide a priori which data might contribute new information to the\nsupertree which is not explicitly displayed by any input tree. A new concept,\nso-called groves, to identify taxon sets with the potential to construct such\ninformative supertrees was suggested by An\\'e et al. in 2009. But the important\nconjecture that maximal groves can easily be identified in a database remained\nunproved and was published on the Isaac Newton Institute's list of open\nphylogenetic problems. In this paper, we show that the conjecture does not\ngenerally hold, but also introduce a new concept, namely 2-overlap groves,\nwhich overcomes this problem.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2011 17:58:47 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Fischer", "Mareike", ""]]}, {"id": "1104.2854", "submitter": "Harold P. de Vladar", "authors": "Harold P. de Vladar and Nick H. Barton", "title": "The contribution of statistical physics to evolutionary biology", "comments": "18 pages, 3 figures, glossary. Accepted in Trend in Ecology and\n  Evolution (to appear in print in August 2011)", "journal-ref": null, "doi": "10.1016/j.tree.2011.04.002", "report-no": null, "categories": "q-bio.PE nlin.AO nlin.PS q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary biology shares many concepts with statistical physics: both deal\nwith populations, whether of molecules or organisms, and both seek to simplify\nevolution in very many dimensions. Often, methodologies have undergone parallel\nand independent development, as with stochastic methods in population genetics.\nWe discuss aspects of population genetics that have embraced methods from\nphysics: amongst others, non-equilibrium statistical mechanics, travelling\nwaves, and Monte-Carlo methods have been used to study polygenic evolution,\nrates of adaptation, and range expansions. These applications indicate that\nevolutionary biology can further benefit from interactions with other areas of\nstatistical physics, for example, by following the distribution of paths taken\nby a population through time.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2011 18:14:50 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["de Vladar", "Harold P.", ""], ["Barton", "Nick H.", ""]]}, {"id": "1104.3001", "submitter": "Peter Hinow", "authors": "Jozsef Z. Farkas, Peter Hinow and Jan Engelst\\\"adter", "title": "Pathogen evolution in switching environments: a hybrid dynamical system\n  approach", "comments": "15 pages, 4 figures", "journal-ref": "Mathematical Biosciences 240 (2012), p. 70-75", "doi": "10.1016/j.mbs.2012.06.004", "report-no": null, "categories": "math.CA q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a hybrid dynamical system approach to model the evolution of a\npathogen that experiences different selective pressures according to a\nstochastic process. In every environment, the evolution of the pathogen is\ndescribed by a version of the Fisher-Haldane-Wright equation while the\nswitching between environments follows a Markov jump process. We investigate\nhow the qualitative behavior of a simple single-host deterministic system\nchanges when the stochastic switching process is added. In particular, we study\nthe stability in probability of monomorphic equilibria. We prove that in a\n\"constantly\" fluctuating environment, the genotype with the highest mean\nfitness is asymptotically stable in probability. However, if the probability of\nhost switching depends on the genotype composition of the population,\npolymorphism can be stably maintained.\n  This is a corrected version of the paper that appeared in Mathematical\nBiosciences 240 (2012), p. 70-75. A corrigendum has appeared in the same\njournal.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2011 09:59:56 GMT"}, {"version": "v2", "created": "Sat, 16 Jun 2012 14:30:53 GMT"}, {"version": "v3", "created": "Mon, 10 Dec 2012 16:56:57 GMT"}], "update_date": "2019-03-25", "authors_parsed": [["Farkas", "Jozsef Z.", ""], ["Hinow", "Peter", ""], ["Engelstädter", "Jan", ""]]}, {"id": "1104.3152", "submitter": "Christopher Marriott", "authors": "Chris Marriott and Carlos Gershenson", "title": "Polyethism in a colony of artificial ants", "comments": "8 pages, 4 figures, submitted to ECAL 11", "journal-ref": "Advances in Artificial Life, ECAL 2011: Proceedings of the\n  Eleventh European Conference on the Synthesis and Simulation of Living\n  Systems, pp. 498-505, 2011", "doi": null, "report-no": "C3 Report 2011.03", "categories": "cs.AI nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We explore self-organizing strategies for role assignment in a foraging task\ncarried out by a colony of artificial agents. Our strategies are inspired by\nvarious mechanisms of division of labor (polyethism) observed in eusocial\ninsects like ants, termites, or bees. Specifically we instantiate models of\ncaste polyethism and age or temporal polyethism to evaluated the benefits to\nforaging in a dynamic environment. Our experiment is directly related to the\nexploration/exploitation trade of in machine learning.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2011 20:24:54 GMT"}], "update_date": "2011-09-06", "authors_parsed": [["Marriott", "Chris", ""], ["Gershenson", "Carlos", ""]]}, {"id": "1104.3549", "submitter": "Stephen Proulx", "authors": "Stephen R Proulx", "title": "The rate of multi-step evolution in Moran and Wright-Fisher populations", "comments": "Originally submitted to TPB, 1/6/2011. Revision submitted 1/18/2011.\n  This is the second revised version accepted 7/12/2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several groups have recently modeled evolutionary transitions from an\nancestral allele to a beneficial allele separated by one or more intervening\nmutants. The beneficial allele can become fixed if a succession of intermediate\nmutants are fixed or alternatively if successive mutants arise while the\nprevious intermediate mutant is still segregating. This latter process has been\ntermed stochastic tunneling. Previous work has focused on the Moran model of\npopulation genetics. I use elementary methods of analyzing stochastic processes\nto derive the probability of tunneling in the limit of large population size\nfor both Moran and Wright-Fisher populations. I also show how to efficiently\nobtain numerical results for finite populations. These results show that the\nprobability of stochastic tunneling is twice as large under the Wright-Fisher\nmodel as it is under the Moran model.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2011 17:54:01 GMT"}, {"version": "v2", "created": "Wed, 13 Jul 2011 17:00:25 GMT"}], "update_date": "2011-07-14", "authors_parsed": [["Proulx", "Stephen R", ""]]}, {"id": "1104.3805", "submitter": "Joel Zylberberg", "authors": "Joel Zylberberg and Michael R. DeWeese", "title": "How shoud prey animals respond to uncertain threats?", "comments": "5 figures, 10 pages of text", "journal-ref": "Frontiers in Computational Neuroscience (2011) 5:20", "doi": "10.3389/fncom.2011.00020", "report-no": null, "categories": "q-bio.PE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A prey animal surveying its environment must decide whether there is a\ndangerous predator present or not. If there is, it may flee. Flight has an\nassociated cost, so the animal should not flee if there is no danger. However,\nthe prey animal cannot know the state of its environment with certainty, and is\nthus bound to make some errors. We formulate a probabilistic automaton model of\na prey animal's life and use it to compute the optimal escape decision\nstrategy, subject to the animal's uncertainty. The uncertainty is a major\nfactor in determining the decision strategy: only in the presence of\nuncertainty do economic factors (like mating opportunities lost due to flight)\ninfluence the decision. We performed computer simulations and found that\n\\emph{in silico} populations of animals subject to predation evolve to display\nthe strategies predicted by our model, confirming our choice of objective\nfunction for our analytic calculations. To the best of our knowledge, this is\nthe first theoretical study of escape decisions to incorporate the effects of\nuncertainty, and to demonstrate the correctness of the objective function used\nin the model.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2011 17:12:50 GMT"}], "update_date": "2011-04-20", "authors_parsed": [["Zylberberg", "Joel", ""], ["DeWeese", "Michael R.", ""]]}, {"id": "1104.4102", "submitter": "Luis Ariel Pugnaloni", "authors": "Dami\\'an H. Zanette", "title": "SIR epidemics in monogamous populations with recombination", "comments": "7 pages, 3 figures", "journal-ref": "Pap. Phys. 3, 030001 (2011)", "doi": "10.4279/PIP.030001", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We study the propagation of an SIR (susceptible-infectious-recovered) disease\nover an agent population which, at any instant, is fully divided into couples\nof agents. Couples are occasionally allowed to exchange their members. This\nprocess of couple recombination can compensate the instantaneous disconnection\nof the interaction pattern and thus allow for the propagation of the infection.\nWe study the incidence of the disease as a function of its infectivity and of\nthe recombination rate of couples, thus characterizing the interplay between\nthe epidemic dynamics and the evolution of the population's interaction\npattern.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2011 19:07:57 GMT"}], "update_date": "2011-04-21", "authors_parsed": [["Zanette", "Damián H.", ""]]}, {"id": "1104.4266", "submitter": "Michel De Lara", "authors": "Michel De Lara (CERMICS), Eladio Ocana Anaya (IMCA), Ricardo\n  Oliveros--Ramos, Jorge Tam", "title": "Ecosystem Viable Yields", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.SY q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The World Summit on Sustainable Development (Johannesburg, 2002) encouraged\nthe application of the ecosystem approach by 2010. However, at the same Summit,\nthe signatory States undertook to restore and exploit their stocks at maximum\nsustainable yield (MSY), a concept and practice without ecosystemic dimension,\nsince MSY is computed species by species, on the basis of a monospecific model.\nAcknowledging this gap, we propose a definition of \"ecosystem viable yields\"\n(EVY) as yields compatible i) with guaranteed biological safety levels for all\ntime and ii) with an ecosystem dynamics. To the difference of MSY, this notion\nis not based on equilibrium, but on viability theory, which offers advantages\nfor robustness. For a generic class of multispecies models with harvesting, we\nprovide explicit expressions for the EVY. We apply our approach to the\nanchovy--hake couple in the Peruvian upwelling ecosystem.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2011 13:53:16 GMT"}, {"version": "v2", "created": "Wed, 30 Nov 2011 16:17:41 GMT"}], "update_date": "2011-12-01", "authors_parsed": [["De Lara", "Michel", "", "CERMICS"], ["Anaya", "Eladio Ocana", "", "IMCA"], ["Oliveros--Ramos", "Ricardo", ""], ["Tam", "Jorge", ""]]}, {"id": "1104.4355", "submitter": "Charles Li", "authors": "Z. C. Feng and Y. Charles Li", "title": "A Resolution of the Paradox of Enrichment", "comments": "submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math-ph math.AP math.DS math.MP nlin.CD", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paradox of enrichment was observed by M. Rosenzweig in a class of\npredator-prey models. Two of the parameters in the models are crucial for the\nparadox. These two parameters are the prey's carrying capacity and prey's\nhalf-saturation for predation. Intuitively, increasing the carrying capacity\ndue to enrichment of the prey's environment should lead to a more stable\npredator-prey system. Analytically, it turns out that increasing the carrying\ncapacity always leads to an unstable predator-prey system that is susceptible\nto extinction from environmental random perturbations. This is the so-called\nparadox of enrichment. Our resolution here rests upon a closer investigation on\na dimensionless number $H$ formed from the carrying capacity and the prey's\nhalf-saturation. By recasting the models into dimensionless forms, the models\nare in fact governed by a few dimensionless numbers including $H$. The effects\nof the two parameters: carrying capacity and half-saturation are incorporated\ninto the number $H$. In fact, increasing the carrying capacity is equivalent\n(i.e. has the same effect on $H$) to decreasing the half-saturation which\nimplies more aggressive predation. Since there is no paradox between more\naggressive predation and instability of the predator-prey system, the paradox\nof enrichment is resolved.\n  We also further explore spatially dependent models for which the phase space\nis infinite dimensional. The spatially independent limit cycle which is\ngenerated by a Hopf bifurcation from an unstable steady state, is linearly\nstable in the infinite dimensional phase space. Numerical simulations indicate\nthat the basin of attraction of the limit cycle is riddled. This shows that\nspatial perturbations can sometimes (neither always nor never) remove the\nparadox of enrichment near the limit cycle!\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2011 20:38:35 GMT"}, {"version": "v2", "created": "Mon, 11 Mar 2013 19:32:00 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Feng", "Z. C.", ""], ["Li", "Y. Charles", ""]]}, {"id": "1104.4426", "submitter": "Maurizio Serva", "authors": "Maurizio Serva", "title": "Phylogeny and geometry of languages from normalized Levenshtein distance", "comments": "Review paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The idea that the distance among pairs of languages can be evaluated from\nlexical differences seems to have its roots in the work of the French explorer\nDumont D'Urville. He collected comparative words lists of various languages\nduring his voyages aboard the Astrolabe from 1826 to 1829 and, in his work\nabout the geographical division of the Pacific, he proposed a method to measure\nthe degree of relation between languages.\n  The method used by the modern lexicostatistics, developed by Morris Swadesh\nin the 1950s, measures distances from the percentage of shared cognates, which\nare words with a common historical origin. The weak point of this method is\nthat subjective judgment plays a relevant role.\n  Recently, we have proposed a new automated method which is motivated by the\nanalogy with genetics. The new approach avoids any subjectivity and results can\nbe easily replicated by other scholars. The distance between two languages is\ndefined by considering a renormalized Levenshtein distance between pair of\nwords with the same meaning and averaging on the words contained in a list. The\nrenormalization, which takes into account the length of the words, plays a\ncrucial role, and no sensible results can be found without it.\n  In this paper we give a short review of our automated method and we\nillustrate it by considering the cluster of Malagasy dialects. We show that it\nsheds new light on their kinship relation and also that it furnishes a lot of\nnew information concerning the modalities of the settlement of Madagascar.\n", "versions": [{"version": "v1", "created": "Fri, 22 Apr 2011 12:20:56 GMT"}, {"version": "v2", "created": "Thu, 28 Apr 2011 18:07:21 GMT"}, {"version": "v3", "created": "Fri, 29 Apr 2011 06:26:36 GMT"}], "update_date": "2011-07-21", "authors_parsed": [["Serva", "Maurizio", ""]]}, {"id": "1104.4532", "submitter": "Markus Brede", "authors": "M. Brede", "title": "Playing against the fittest: A simple strategy that promotes the\n  emergence of cooperation", "comments": "6 pages, 5 figures, in press", "journal-ref": "Europhysics Letters, 2011", "doi": "10.1209/0295-5075/94/30003", "report-no": null, "categories": "cs.GT physics.bio-ph physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the emergence and sustainability of cooperation is a\nfundamental problem in evolutionary biology and is frequently studied by the\nframework of evolutionary game theory. A very powerful mechanism to promote\ncooperation is network reciprocity, where the interaction patterns and\nopportunities for strategy spread of agents are constrained to limited sets of\npermanent interactions partners. Cooperation survives because it is possible\nfor close-knit communities of cooperation to be shielded from invasion by\ndefectors. Here we show that parameter ranges in which cooperation can survive\nare strongly expanded if game play on networks is skewed towards more frequent\ninteractions with more successful neighbours. In particular, if agents\nexclusively select neighbors for game play that are more successful than\nthemselves, cooperation can even dominate in situations in which it would die\nout if interaction neighbours were chosen without a bias or with a preference\nfor less successful opponents. We demonstrate that the \"selecting fitter\nneighbours\" strategy is evolutionarily stable. Moreover, it will emerge as the\ndominant strategy out of an initially random population of agents.\n", "versions": [{"version": "v1", "created": "Sat, 23 Apr 2011 05:33:04 GMT"}], "update_date": "2015-05-27", "authors_parsed": [["Brede", "M.", ""]]}, {"id": "1104.4568", "submitter": "Raul Rabadan", "authors": "Carlos Xavier Hernandez, Joseph Chan, Hossein Khiabanian, Raul Rabadan", "title": "Understanding the Origins of a Pandemic Virus", "comments": "13 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": "ac:129992", "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the origin of infectious diseases provides scientifically based\nrationales for implementing public health measures that may help to avoid or\nmitigate future epidemics. The recent ancestors of a pandemic virus provide\ninvaluable information about the set of minimal genomic alterations that\ntransformed a zoonotic agent into a full human pandemic. Since the first\nconfirmed cases of the H1N1 pandemic virus in the spring of 2009, several\nhypotheses about the strain's origins have been proposed. However, how, where,\nand when it first infected humans is still far from clear. The only way to\npiece together this epidemiological puzzle relies on the collective effort of\nthe international scientific community to increase genomic sequencing of\ninfluenza isolates, especially ones collected in the months prior to the origin\nof the pandemic.\n", "versions": [{"version": "v1", "created": "Sat, 23 Apr 2011 15:58:43 GMT"}], "update_date": "2011-04-26", "authors_parsed": [["Hernandez", "Carlos Xavier", ""], ["Chan", "Joseph", ""], ["Khiabanian", "Hossein", ""], ["Rabadan", "Raul", ""]]}, {"id": "1104.4720", "submitter": "Hadi Poormohammadi", "authors": "Ruzbeh Tusserkani and Changiz Eslahchi and Hadi Poormohammadi and Azin\n  Azadi", "title": "TripNet: A Method for Constructing Phylogenetic Networks from Triplets", "comments": "12 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE q-bio.PE q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We present TripNet, a method for constructing phylogenetic networks from\ntriplets. We will present the motivations behind our approach and its\ntheoretical and empirical justification. To demonstrate the accuracy and\nefficiency of TripNet, we performed two simulations and also applied the method\nto five published data sets: Kreitman's data, a set of triplets from real yeast\ndata obtained from the Fungal Biodiversity Center in Utrecht, a collection of\n110 highly recombinant Salmonella multi-locus sequence typing sequences, and\nnrDNA ITS and cpDNA JSA sequence data of New Zealand alpine buttercups of\nRanunculus sect. Pseudadonis. Finally, we compare our results with those\nalready obtained by other authors using alternative methods. TripNet, data\nsets, and supplementary files are freely available for download at\n(www.bioinf.cs.ipm.ir/softwares/tripnet).\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2011 13:44:25 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Tusserkani", "Ruzbeh", ""], ["Eslahchi", "Changiz", ""], ["Poormohammadi", "Hadi", ""], ["Azadi", "Azin", ""]]}, {"id": "1104.4775", "submitter": "Maria Fabiana Laguna", "authors": "Mar\\'ia Fabiana Laguna and Sebasti\\'an Risau-Gusman", "title": "Of lice and math: using models to understand and control populations of\n  head lice", "comments": "manuscript of 23 pages and 13 figures, also a supporting file of 13\n  pages and 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we use detailed data about the biology of the head louse\n(pediculus humanus capitis) to build a model of the evolution of head lice\ncolonies. Using theory and computer simulations, we show that the model can be\nused to assess the impact of the various strategies usually applied to\neradicate head lice, both conscious (treatments) and unconscious (grooming). In\nthe case of treatments, we study the difference in performance that arises when\nthey are applied in systematic and non-systematic ways. Using some reasonable\nsimplifying assumptions (as random mixing of human groups and the same mobility\nfor all life stages of head lice other than eggs) we model the contagion of\npediculosis using only one additional parameter. It is shown that this\nparameter can be tuned to obtain collective infestations whose variables are\ncompatible with what is given in the literature on real infestations. We\nanalyze two scenarios: one where group members begin treatment when a similar\nnumber of lice are present in each head, and another where there is one\nindividual who starts treatment with a much larger threshold ('superspreader').\nFor both cases we assess the impact of several collective strategies of\ntreatment.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2011 19:05:36 GMT"}, {"version": "v2", "created": "Thu, 28 Apr 2011 15:00:14 GMT"}], "update_date": "2015-03-19", "authors_parsed": [["Laguna", "María Fabiana", ""], ["Risau-Gusman", "Sebastián", ""]]}, {"id": "1104.4913", "submitter": "Andr\\'es D. Medus", "authors": "A. D. Medus and C. O. Dorso", "title": "Diseases spreading through individual based models with realistic\n  mobility patterns", "comments": "19 pages, 7 figures, submitted to PRE", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.bio-ph physics.data-an q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The individual-based models constitute a set of widely implemented tools to\nanalyze the incidence of individuals heterogeneities in the spread of an\ninfectious disease. In this work we focus our attention on human contacts\nheterogeneities through two of the main individual-based models: mobile agents\nand complex networks models. We introduce a novel mobile agents model in which\nindividuals make displacements with sizes according to a truncated power-law\ndistribution based on empirical evidence about human mobility. Besides, we\npresent a procedure to obtain an equivalent weighted contact network from the\nprevious mobile agents model, where the weights of the links are interpreted as\ncontact probabilities. From the topological analysis of the equivalent contact\nnetworks we show that small world characteristics are related with truncated\npower-law distribution for agent displacements. Finally, we show the\nequivalence between both approaches through some numerical experiments for the\nspread of an infectious disease.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2011 11:45:03 GMT"}], "update_date": "2011-04-27", "authors_parsed": [["Medus", "A. D.", ""], ["Dorso", "C. O.", ""]]}, {"id": "1104.5024", "submitter": "Konstantin Klemm", "authors": "Konstantin Klemm, Anita Mehta, Peter F. Stadler", "title": "Landscape encodings enhance optimization", "comments": "8 pages, 3 figures", "journal-ref": "PLoS One 7, e34780 (2012)", "doi": "10.1371/journal.pone.0034780", "report-no": null, "categories": "cond-mat.dis-nn cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hard combinatorial optimization problems deal with the search for the minimum\ncost solutions (ground states) of discrete systems under strong constraints. A\ntransformation of state variables may enhance computational tractability. It\nhas been argued that these state encodings are to be chosen invertible to\nretain the original size of the state space. Here we show how redundant\nnon-invertible encodings enhance optimization by enriching the density of\nlow-energy states. In addition, smooth landscapes may be established on encoded\nstate spaces to guide local search dynamics towards the ground state.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2011 20:01:53 GMT"}, {"version": "v2", "created": "Tue, 10 Apr 2012 16:55:06 GMT"}], "update_date": "2012-04-11", "authors_parsed": [["Klemm", "Konstantin", ""], ["Mehta", "Anita", ""], ["Stadler", "Peter F.", ""]]}, {"id": "1104.5044", "submitter": "Mike Steel Prof.", "authors": "Vincent Moulton and Mike Steel", "title": "The 'Butterfly effect' in Cayley graphs, and its relevance for\n  evolutionary genomics", "comments": "17 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.DM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Suppose a finite set $X$ is repeatedly transformed by a sequence of\npermutations of a certain type acting on an initial element $x$ to produce a\nfinal state $y$. We investigate how 'different' the resulting state $y'$ to $y$\ncan be if a slight change is made to the sequence, either by deleting one\npermutation, or replacing it with another. Here the 'difference' between $y$\nand $y'$ might be measured by the minimum number of permutations of the\npermitted type required to transform $y$ to $y'$, or by some other metric. We\ndiscuss this first in the general setting of sensitivity to perturbation of\nwalks in Cayley graphs of groups with a specified set of generators. We then\ninvestigate some permutation groups and generators arising in computational\ngenomics, and the statistical implications of the findings.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2011 22:59:13 GMT"}], "update_date": "2011-04-28", "authors_parsed": [["Moulton", "Vincent", ""], ["Steel", "Mike", ""]]}, {"id": "1104.5112", "submitter": "Ganna Rozhnova", "authors": "Ganna Rozhnova, Ana Nunes", "title": "Modeling the long term dynamics of pre-vaccination pertussis", "comments": "paper (31 pages, 11 figures, 1 table) and supplementary material (19\n  pages, 5 figures, 2 tables)", "journal-ref": "Journal of the Royal Society Interface 9, 2959-2970 (2012)", "doi": "10.1098/rsif.2012.0432", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech physics.bio-ph physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamics of strongly immunizing childhood infections is still not well\nunderstood. Although reports of successful modeling of several incidence data\nrecords can be found in the literature, the key determinants of the observed\ntemporal patterns have not been clearly identified. In particular, different\nmodels of immunity waning and degree of protection applied to disease and\nvaccine induced immunity have been debated in the literature on pertussis. Here\nwe study the effect of disease acquired immunity on the long term patterns of\npertussis prevalence. We compare five minimal models, all of which are\nstochastic, seasonally forced, well-mixed models of infection based on\nsusceptible-infective-recovered dynamics in a closed population. These models\nreflect different assumptions about the immune response of naive hosts, namely\ntotal permanent immunity, immunity waning, immunity waning together with\nimmunity boosting, reinfection of recovered, and repeat infection after partial\nimmunity waning. The power spectra of the output prevalence time series\ncharacterize the long term dynamics of the models. For epidemiological\nparameters consistent with published data for pertussis, the power spectra show\nquantitative and even qualitative differences that can be used to test their\nassumptions by comparison with ensembles of several decades long\npre-vaccination data records. We illustrate this strategy on two publicly\navailable historical data sets.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2011 10:55:52 GMT"}, {"version": "v2", "created": "Sat, 25 Feb 2012 20:23:35 GMT"}, {"version": "v3", "created": "Thu, 17 May 2012 18:55:44 GMT"}, {"version": "v4", "created": "Wed, 18 Jul 2012 10:18:08 GMT"}], "update_date": "2012-10-09", "authors_parsed": [["Rozhnova", "Ganna", ""], ["Nunes", "Ana", ""]]}, {"id": "1104.5147", "submitter": "Mauro Mobilia", "authors": "Mauro Mobilia", "title": "Fixation and Polarization in a Three-Species Opinion Dynamics Model", "comments": "6 pages in EPL format, 3 color figures (6 panels). Minor\n  modifications. To appear in EPL (Europhysics Letters)", "journal-ref": "EPL (Europhysics Letters) Vol. 95, 50002 (2011)", "doi": "10.1209/0295-5075/95/50002", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.SI nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by the dynamics of cultural change and diversity, we generalize the\nthree-species constrained voter model on a complete graph introduced in [J.\nPhys. A 37, 8479 (2004)]. In this opinion dynamics model, a population of size\nN is composed of \"leftists\" and \"rightists\" that interact with \"centrists\": a\nleftist and centrist can both become leftists with rate (1+q)/2 or centrists\nwith rate (1-q)/2 (and similarly for rightists and centrists), where q denotes\nthe bias towards extremism (q>0) or centrism (q<0). This system admits three\nabsorbing fixed points and a \"polarization\" line along which a frozen mixture\nof leftists and rightists coexist. In the realm of Fokker-Planck equation, and\nusing a mapping onto a population genetics model, we compute the fixation\nprobability of ending in every absorbing state and the mean times for these\nevents. We therefore show, especially in the limit of weak bias and large\npopulation size when |q|~1/N and N>>1, how fluctuations alter the mean field\npredictions: polarization is likely when q>0, but there is always a finite\nprobability to reach a consensus; the opposite happens when q<0. Our findings\nare corroborated by stochastic simulations.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2011 13:56:19 GMT"}, {"version": "v2", "created": "Mon, 11 Jul 2011 15:45:00 GMT"}], "update_date": "2011-08-11", "authors_parsed": [["Mobilia", "Mauro", ""]]}, {"id": "1104.5583", "submitter": "Sarada  Seetharaman", "authors": "Kavita Jain and Sarada Seetharaman", "title": "Multiple adaptive substitutions during evolution in novel environments", "comments": null, "journal-ref": "Genetics 189, no. 3 1029-1043 (2011)", "doi": null, "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an asexual population under strong selection-weak mutation\nconditions evolving on rugged fitness landscapes with many local fitness peaks.\nUnlike the previous studies in which the initial fitness of the population is\nassumed to be high, here we start the adaptation process with a low fitness\ncorresponding to a population in a stressful novel environment. For generic\nfitness distributions, using an analytic argument we find that the average\nnumber of steps to a local optimum varies logarithmically with the genotype\nsequence length and increases as the correlations amongst genotypic fitnesses\nincrease. When the fitnesses are exponentially or uniformly distributed, using\nan evolution equation for the distribution of population fitness, we\nanalytically calculate the fitness distribution of fixed beneficial mutations\nand the walk length distribution.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2011 09:45:18 GMT"}, {"version": "v2", "created": "Fri, 2 Sep 2011 11:50:52 GMT"}], "update_date": "2011-11-18", "authors_parsed": [["Jain", "Kavita", ""], ["Seetharaman", "Sarada", ""]]}]