[{"id": "1301.0004", "submitter": "Ignacio Gallo", "authors": "Ignacio Gallo", "title": "Population genetics of gene function", "comments": "30 pages, 6 figures", "journal-ref": null, "doi": "10.1007/s11538-013-9841-6", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper shows that differentiating the lifetimes of two phenotypes\nindependently from their fertility can lead to a qualitative change in the\nequilibrium of a population: since survival and reproduction are distinct\nfunctional aspects of an organism, this observation contributes to extend the\npopulation-genetical characterisation of biological function. To support this\nstatement a mathematical relation is derived to link the lifetime ratio\nT_1/T_2, which parametrizes the different survival ability of two phenotypes,\nwith population variables that quantify the amount of neutral variation\nunderlying a population's phenotypic distribution.\n", "versions": [{"version": "v1", "created": "Sun, 30 Dec 2012 08:05:19 GMT"}, {"version": "v2", "created": "Mon, 21 Jan 2013 17:29:26 GMT"}, {"version": "v3", "created": "Tue, 22 Jan 2013 15:13:07 GMT"}, {"version": "v4", "created": "Thu, 24 Jan 2013 06:24:43 GMT"}, {"version": "v5", "created": "Sat, 16 Feb 2013 17:56:43 GMT"}, {"version": "v6", "created": "Tue, 21 May 2013 09:20:38 GMT"}], "update_date": "2013-05-22", "authors_parsed": [["Gallo", "Ignacio", ""]]}, {"id": "1301.0170", "submitter": "Yutaka Hori", "authors": "Yutaka Hori and Shinji Hara", "title": "Noise-Induced Spatial Pattern Formation in Stochastic Reaction-Diffusion\n  Systems", "comments": null, "journal-ref": "Proceedings of IEEE Conference on Decision and Control, pp.\n  1053-1058, 2012", "doi": "10.1109/CDC.2012.6426152", "report-no": null, "categories": "q-bio.QM cs.SY q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is concerned with stochastic reaction-diffusion kinetics governed\nby the reaction-diffusion master equation. Specifically, the primary goal of\nthis paper is to provide a mechanistic basis of Turing pattern formation that\nis induced by intrinsic noise. To this end, we first derive an approximate\nreaction-diffusion system by using linear noise approximation. We show that the\napproximated system has a certain structure that is associated with a coupled\ndynamic multi-agent system. This observation then helps us derive an efficient\ncomputation tool to examine the spatial power spectrum of the intrinsic noise.\nWe numerically demonstrate that the result is quite effective to analyze\nnoise-induced Turing pattern. Finally, we illustrate the theoretical mechanism\nbehind the noise-induced pattern formation with a H2 norm interpretation of the\nmulti-agent system.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jan 2013 05:38:34 GMT"}], "update_date": "2015-04-23", "authors_parsed": [["Hori", "Yutaka", ""], ["Hara", "Shinji", ""]]}, {"id": "1301.0310", "submitter": "Attila Szolnoki", "authors": "Gyorgy Szabo, Attila Szolnoki, Lilla Czako", "title": "Coexistence of fraternity and egoism for spatial social dilemmas", "comments": "8 two-column pages, 6 figures; accepted for publication in J. Theor.\n  Biol", "journal-ref": "J. Theor. Biol. 317 (2013) 126-132", "doi": null, "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have studied an evolutionary game with spatially arranged players who can\nchoose one of the two strategies (named cooperation and defection for social\ndilemmas) when playing with their neighbors. In addition to the application of\nthe usual strategies in the present model the players are also characterized by\none of the two extreme personal features representing the egoist or fraternal\nbehavior. During the evolution each player can modify both her own strategy\nand/or personal feature via a myopic update process in order to improve her\nutility. The results of numerical simulations and stability analysis are\nsummarized in phase diagrams representing a wide scale of spatially ordered\ndistribution of strategies and personal features when varying the payoff\nparameters. In most of the cases only two of the four possible options prevail\nand may form sublattice ordered spatial structure. The evolutionary advantage\nof the fraternal attitude is demonstrated within a large range of payoff\nparameters including the region of prisoner's dilemma where egoist defectors\nand fraternal cooperators form a role-separating chessboard-like pattern.\n", "versions": [{"version": "v1", "created": "Wed, 2 Jan 2013 20:59:00 GMT"}], "update_date": "2013-01-03", "authors_parsed": [["Szabo", "Gyorgy", ""], ["Szolnoki", "Attila", ""], ["Czako", "Lilla", ""]]}, {"id": "1301.0960", "submitter": "Amy Maxmen", "authors": "Amy Maxmen", "title": "Sea Spider development: How the encysting Anoplodactylus eroticus\n  matures from a buoyant nymph to a grounded adult", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to understand how animals evolved over time, biologists must learn\nhow their body parts form during their development. The following is a detailed\ndescription of how one species of sea spider transforms from a hatchling to an\n8-legged adult. Pycnogonids, or sea spiders, comprise a primitive lineage of\narthropods. As such, they hold potential to reveal insights into arthropod\nevolution. Recent phylogenetic analyses have supported their position as either\nbasal chelicerates or as a separate, fifth major lineage of extant arthropods.\nDisagreements concerning pycnogonid relations to other arthropods is partly a\nproduct of too few primary observations of pycnogonid anatomy and development.\nThis investigation of post-embryonic development of the pycnogonid\nAnoplodactylus eroticus employs multiple techniques of anatomical observation,\nincluding Nomarski optics, scanning electron microscopy and fluorescence\nmicroscopy, in order to thoroughly document the life cycle.\n  After the second post-embryonic stage, larvae of A. eroticus burrow within a\nhydroid and undergo morphogenesis. Larvae emerge from the hydroid and\nsimultaneously molt into the juvenile stage. Over the course of post-embryonic\ndevelopment there are eight stages preceding the mature adult. All structures,\nexcept for the anteriormost appendages, the chelifores, undergo some degree of\ntransformation. Chelifores are present prior to hatching and remain mobile over\nthe course of development. Some larger issues important to arthropod evolution\nare addressed, such as the equivalent of a germband and labrum in pycnogonids.\nPost-embryonic development of A. eroticus provides an example counteracting\nprevious reports of anamorphic development and a four-segmented head in the\npycnogonid ground pattern, findings that were extrapolated to fit the ground\npattern of Arthropoda.\n", "versions": [{"version": "v1", "created": "Sun, 6 Jan 2013 02:29:53 GMT"}], "update_date": "2013-01-08", "authors_parsed": [["Maxmen", "Amy", ""]]}, {"id": "1301.1077", "submitter": "Christos Skiadas H", "authors": "Christos H Skiadas and Charilaos Skiadas", "title": "A Quantitative Method for Estimating the Human Development Stages by\n  Based on the Health State Function Theory and the Resulting Deterioration\n  Process", "comments": "19 pages, 9 figures, 8 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Health State Function theory is applied to find a quantitative estimate\nof the Human Development Stages by defining and calculating the specific age\ngroups and subgroups. Early and late adolescence stages, first, second and\nthird stages of adult development are estimated along with the early, middle\nand old age groups and subgroups. We briefly present the first exit time theory\nused to find the health state function of a population and then we give the\ndetails of the new theoretical approach with the appropriate applications to\nsupport and validate the theoretical assumptions. Our approach is useful for\npeople working in several scientific fields and especially in medicine,\nbiology, anthropology, psychology, gerontology, probability and statistics. The\nresults are connected with the speed and acceleration of the deterioration of\nthe human organism during age as a consequence of the changes in the first,\nsecond and third differences of the Health State Function and of the\nDeterioration Function.\n  Keywords: Human development stages, Deterioration, Deterioration function,\nHuman Mortality Database, HMD, World Health Organization, WHO, Quantitative\nmethods, Health State Function, Erikson's stages of psychosocial development,\nPiaget method, Sullivan method, Disability stages, Light disability, Moderate\ndisability, Severe disability stage, Old ages, Critical ages.\n", "versions": [{"version": "v1", "created": "Sun, 6 Jan 2013 23:42:59 GMT"}], "update_date": "2013-01-08", "authors_parsed": [["Skiadas", "Christos H", ""], ["Skiadas", "Charilaos", ""]]}, {"id": "1301.1093", "submitter": "Avikar Periwal", "authors": "Avikar Periwal", "title": "Live Young, Die Later: Senescence in the Penna Model of Aging", "comments": "5 pages, 7 figures", "journal-ref": "Phys. Rev. E 88, 052702 (2013)", "doi": "10.1103/PhysRevE.88.052702", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cellular senescence is thought to play a major role in age-related diseases,\nwhich cause nearly 67% of all human deaths worldwide. Recent research in mice\nshowed that exercising mice had higher levels of telomerase, an enzyme that\nhelps maintain telomere length, than non-exercising mice. A commonly used model\nfor biological aging was proposed by Penna. I propose two modifications of the\nPenna model that incorporate senescence and find analytical steady state\nsolutions following Coe, Mao and Cates. I find that models corresponding to\ndelayed senescence have younger populations that live longer.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2013 01:56:36 GMT"}, {"version": "v2", "created": "Fri, 18 Jan 2013 15:41:16 GMT"}], "update_date": "2013-11-13", "authors_parsed": [["Periwal", "Avikar", ""]]}, {"id": "1301.1111", "submitter": "Jeffrey Shaman", "authors": "Jeffrey Shaman, Alicia Karspeck and Marc Lipsitch", "title": "Week 52 Influenza Forecast for the 2012-2013 U.S. Season", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This document is another installment in a series of near real-time weekly\ninfluenza forecasts made during the 2012-2013 influenza season. Here we present\nsome of the results of forecasts initiated following assimilation of\nobservations for Week 52 (i.e. the forecast begins December 30, 2012) for\nmunicipalities in the United States. The forecasts were made on January 4,\n2013. Results from forecasts initiated the five previous weeks (Weeks 47-51)\nare also presented.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2013 04:37:46 GMT"}], "update_date": "2013-01-08", "authors_parsed": [["Shaman", "Jeffrey", ""], ["Karspeck", "Alicia", ""], ["Lipsitch", "Marc", ""]]}, {"id": "1301.1305", "submitter": "Forrest Crawford", "authors": "Forrest W. Crawford and Marc A. Suchard", "title": "Birth-death processes", "comments": "This review replaces an earlier version that focused exclusively on\n  integrals of birth-death processes", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ME q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many important stochastic counting models can be written as general\nbirth-death processes (BDPs). BDPs are continuous-time Markov chains on the\nnon-negative integers and can be used to easily parameterize a rich variety of\nprobability distributions. Although the theoretical properties of general BDPs\nare well understood, traditionally statistical work on BDPs has been limited to\nthe simple linear (Kendall) process, which arises in ecology and evolutionary\napplications. Aside from a few simple cases, it remains impossible to find\nanalytic expressions for the likelihood of a discretely-observed BDP, and\ncomputational difficulties have hindered development of tools for statistical\ninference. But the gap between BDP theory and practical methods for estimation\nhas narrowed in recent years. There are now robust methods for evaluating\nlikelihoods for realizations of BDPs: finite-time transition, first passage,\nequilibrium probabilities, and distributions of summary statistics that arise\ncommonly in applications. Recent work has also exploited the connection between\ncontinuously- and discretely-observed BDPs to derive EM algorithms for maximum\nlikelihood estimation. Likelihood-based inference for previously intractable\nBDPs is much easier than previously thought and regression approaches analogous\nto Poisson regression are straightforward to derive. In this review, we outline\nthe basic mathematical theory for BDPs and demonstrate new tools for\nstatistical inference using data from BDPs. We give six examples of BDPs and\nderive EM algorithms to fit their parameters by maximum likelihood. We show how\nto compute the distribution of integral summary statistics and give an example\napplication to the total cost of an epidemic. Finally, we suggest future\ndirections for innovation in this important class of stochastic processes.\n", "versions": [{"version": "v1", "created": "Mon, 7 Jan 2013 19:08:06 GMT"}, {"version": "v2", "created": "Fri, 25 Jul 2014 18:46:52 GMT"}], "update_date": "2014-07-28", "authors_parsed": [["Crawford", "Forrest W.", ""], ["Suchard", "Marc A.", ""]]}, {"id": "1301.1426", "submitter": "David A. Kessler", "authors": "Shlomit Weisman, Nadav M. Shnerb, David A. Kessler", "title": "Evolutionarily Stable Density-Dependent Dispersal", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An ab-initio numerical study of the density-dependent, evolutionary stable\ndispersal strategy is presented. The simulations are based on a simple\ndiscretei generation island model with four processes: reproduction, dispersal,\ncompetition and local catastrophe. We do not impose any a priori constraints on\nthe dispersal schedule, allowing the entire schedule to evolve. We find that\nthe system converges at long times to a unique nontrivial dispersal schedule\nsuch that the dispersal probability is a monotonically increasing function of\nthe density. We have explored the dependence of the selected dispersal strategy\non the various system parameters: mean number of offspring, site carrying\ncapacity, dispersal cost and system size. A few general scaling laws are seen\nto emerge from the data.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2013 06:53:30 GMT"}], "update_date": "2013-01-09", "authors_parsed": [["Weisman", "Shlomit", ""], ["Shnerb", "Nadav M.", ""], ["Kessler", "David A.", ""]]}, {"id": "1301.1439", "submitter": "Sarada Seetharaman", "authors": "Sarada Seetharaman and Kavita Jain", "title": "Adaptive walks and distribution of beneficial fitness effects", "comments": "Accepted in Evolution", "journal-ref": "Evolution 68, 965 (2014)", "doi": null, "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the adaptation dynamics of a maladapted asexual population on rugged\nfitness landscapes with many local fitness peaks. The distribution of\nbeneficial fitness effects is assumed to belong to one of the three extreme\nvalue domains, viz. Weibull, Gumbel and Fr{\\'e}chet. We work in the strong\nselection-weak mutation regime in which beneficial mutations fix sequentially,\nand the population performs an uphill walk on the fitness landscape until a\nlocal fitness peak is reached. A striking prediction of our analysis is that\nthe fitness difference between successive steps follows a pattern of\ndiminishing returns in the Weibull domain and accelerating returns in the\nFr{\\'e}chet domain, as the initial fitness of the population is increased.\nThese trends are found to be robust with respect to fitness correlations. We\nbelieve that this result can be exploited in experiments to determine the\nextreme value domain of the distribution of beneficial fitness effects. Our\nwork here differs significantly from the previous ones that assume the\nselection coefficient to be small. On taking large effect mutations into\naccount, we find that the length of the walk shows different qualitative trends\nfrom those derived using small selection coefficient approximation.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2013 08:14:26 GMT"}, {"version": "v2", "created": "Tue, 29 Oct 2013 06:04:54 GMT"}], "update_date": "2016-01-13", "authors_parsed": [["Seetharaman", "Sarada", ""], ["Jain", "Kavita", ""]]}, {"id": "1301.1569", "submitter": "Jacopo Grilli", "authors": "Samir Suweis, Jacopo Grilli and Amos Maritan", "title": "Effects of Mixing Interaction Types on Ecological Community Stability", "comments": "12 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last years, a remarkable theoretical effort has been made in order to\nunderstand stability and complexity in ecological communities. The non-random\nstructures of real ecological interaction networks has been recognized as one\nkey ingredient contributing to the coexistence between high complexity and\nstability in real ecosystems. However most of the theoretical studies have\nconsidered communities with only one interaction type (either antagonistic,\ncompetitive, or mutualistic). Recently it has been proposed a theoretical\nanalysis on multiple interaction types in ecological systems, concluding that:\na) Mixture of antagonistic and mutualistic interactions stabilize the system\nwith respect to the less realistic case of only one interaction type; b)\nComplexity, measured in terms of the number of interactions and the number of\nspecies, increases stability in systems with different types of interactions.\nBy introducing new theoretical investigations and analyzing 21 empirical data\nsets representing mutualistic plant-pollinator networks, we show that that\nconclusions are incorrect. We will prove that the positive complexity-stability\neffect observed in systems with different kind of interactions is a mere\nconsequence of a rescaling of the interaction strengths, and thus unrelated to\nthe mixing of interaction types.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2013 15:48:50 GMT"}], "update_date": "2013-01-09", "authors_parsed": [["Suweis", "Samir", ""], ["Grilli", "Jacopo", ""], ["Maritan", "Amos", ""]]}, {"id": "1301.1710", "submitter": "Vilhelm Verendel", "authors": "Kristian Lindgren, Vilhelm Verendel", "title": "Evolutionary Exploration of the Finitely Repeated Prisoners'\n  Dilemma--The Effect of Out-of-Equilibrium Play", "comments": null, "journal-ref": "Games 2013, 4(1):1-20", "doi": "10.3390/g4010001", "report-no": null, "categories": "q-bio.PE cs.GT", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The finitely repeated Prisoners' Dilemma is a good illustration of the\ndiscrepancy between the strategic behaviour suggested by a game-theoretic\nanalysis and the behaviour often observed among human players, where\ncooperation is maintained through most of the game. A game-theoretic reasoning\nbased on backward induction eliminates strategies step by step until defection\nfrom the first round is the only remaining choice, reflecting the Nash\nequilibrium of the game. We investigate the Nash equilibrium solution for two\ndifferent sets of strategies in an evolutionary context, using\nreplicator-mutation dynamics. The first set consists of conditional\ncooperators, up to a certain round, while the second set in addition to these\ncontains two strategy types that react differently on the first round action:\nThe \"Convincer\" strategies insist with two rounds of initial cooperation,\ntrying to establish more cooperative play in the game, while the \"Follower\"\nstrategies, although being first round defectors, have the capability to\nrespond to an invite in the first round. For both of these strategy sets,\niterated elimination of strategies shows that the only Nash equilibria are\ngiven by defection from the first round. We show that the evolutionary dynamics\nof the first set is always characterised by a stable fixed point, corresponding\nto the Nash equilibrium, if the mutation rate is sufficiently small (but still\npositive). The second strategy set is numerically investigated, and we find\nthat there are regions of parameter space where fixed points become unstable\nand the dynamics exhibits cycles of different strategy compositions. The\nresults indicate that, even in the limit of very small mutation rate, the\nreplicator-mutation dynamics does not necessarily bring the system with\nConvincers and Followers to the fixed point corresponding to the Nash\nequilibrium of the game.\n", "versions": [{"version": "v1", "created": "Tue, 8 Jan 2013 22:20:43 GMT"}], "update_date": "2013-01-10", "authors_parsed": [["Lindgren", "Kristian", ""], ["Verendel", "Vilhelm", ""]]}, {"id": "1301.1729", "submitter": "Aylwyn Scally", "authors": "Aylwyn Scally, Bryndis Yngvadottir, Yali Xue, Qasim Ayub, Richard\n  Durbin, Chris Tyler-Smith", "title": "A genome-wide survey of genetic variation in gorillas using reduced\n  representation sequencing", "comments": "18 pages, 9 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0065066", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  All non-human great apes are endangered in the wild, and it is therefore\nimportant to gain an understanding of their demography and genetic diversity.\nTo date, however, genetic studies within these species have largely been\nconfined to mitochondrial DNA and a small number of other loci. Here, we\npresent a genome-wide survey of genetic variation in gorillas using a reduced\nrepresentation sequencing approach, focusing on the two lowland subspecies. We\nidentify 3,274,491 polymorphic sites in 14 individuals: 12 western lowland\ngorillas (Gorilla gorilla gorilla) and 2 eastern lowland gorillas (Gorilla\nberingei graueri). We find that the two species are genetically distinct, based\non levels of heterozygosity and patterns of allele sharing. Focusing on the\nwestern lowland population, we observe evidence for population substructure,\nand a deficit of rare genetic variants suggesting a recent episode of\npopulation contraction. In western lowland gorillas, there is an elevation of\nvariation towards telomeres and centromeres on the chromosomal scale. On a\nfiner scale, we find substantial variation in genetic diversity, including a\nmarked reduction close to the major histocompatibility locus, perhaps\nindicative of recent strong selection there. These findings suggest that\ndespite their maintaining an overall level of genetic diversity equal to or\ngreater than that of humans, population decline, perhaps associated with\ndisease, has been a significant factor in recent and long-term pressures on\nwild gorilla populations.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jan 2013 00:44:37 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Scally", "Aylwyn", ""], ["Yngvadottir", "Bryndis", ""], ["Xue", "Yali", ""], ["Ayub", "Qasim", ""], ["Durbin", "Richard", ""], ["Tyler-Smith", "Chris", ""]]}, {"id": "1301.1923", "submitter": "Joachim Krug", "authors": "Johannes Neidhart, Ivan G. Szendro and Joachim Krug", "title": "Exact Results for Amplitude Spectra of Fitness Landscapes", "comments": "13 pages, 5 figures; revised and final version", "journal-ref": "J. Theor. Biol. 332 (2013) 218-227", "doi": "10.1016/j.jtbi.2013.05.002", "report-no": null, "categories": "q-bio.PE cond-mat.dis-nn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Starting from fitness correlation functions, we calculate exact expressions\nfor the amplitude spectra of fitness landscapes as defined by P.F. Stadler [J.\nMath. Chem. 20, 1 (1996)] for common landscape models, including Kauffman's\nNK-model, rough Mount Fuji landscapes and general linear superpositions of such\nlandscapes. We further show that correlations decaying exponentially with the\nHamming distance yield exponentially decaying spectra similar to those reported\nrecently for a model of molecular signal transduction. Finally, we compare our\nresults for the model systems to the spectra of various experimentally measured\nfitness landscapes. We claim that our analytical results should be helpful when\ntrying to interpret empirical data and guide the search for improved fitness\nlandscape models.\n", "versions": [{"version": "v1", "created": "Wed, 9 Jan 2013 16:54:34 GMT"}, {"version": "v2", "created": "Mon, 15 Jul 2013 15:11:58 GMT"}], "update_date": "2013-07-16", "authors_parsed": [["Neidhart", "Johannes", ""], ["Szendro", "Ivan G.", ""], ["Krug", "Joachim", ""]]}, {"id": "1301.2247", "submitter": "Matjaz Perc", "authors": "Matjaz Perc, Jes\\'us G\\'omez-Garde\\~nes, Attila Szolnoki, Luis M.\n  Flor\\'ia, Yamir Moreno", "title": "Evolutionary dynamics of group interactions on structured populations: A\n  review", "comments": "17 two-column pages, 13 figures; accepted for publication in Journal\n  of the Royal Society Interface", "journal-ref": "J. R. Soc. Interface 10 (2013) 20120997", "doi": "10.1098/rsif.2012.0997", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.SI nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interactions among living organisms, from bacteria colonies to human\nsocieties, are inherently more complex than interactions among particles and\nnonliving matter. Group interactions are a particularly important and\nwidespread class, representative of which is the public goods game. In\naddition, methods of statistical physics have proven valuable for studying\npattern formation, equilibrium selection, and self-organisation in evolutionary\ngames. Here we review recent advances in the study of evolutionary dynamics of\ngroup interactions on structured populations, including lattices, complex\nnetworks and coevolutionary models. We also compare these results with those\nobtained on well-mixed populations. The review particularly highlights that the\nstudy of the dynamics of group interactions, like several other important\nequilibrium and non-equilibrium dynamical processes in biological, economical\nand social sciences, benefits from the synergy between statistical physics,\nnetwork science and evolutionary game theory.\n", "versions": [{"version": "v1", "created": "Thu, 10 Jan 2013 20:56:00 GMT"}], "update_date": "2013-01-11", "authors_parsed": [["Perc", "Matjaz", ""], ["Gómez-Gardeñes", "Jesús", ""], ["Szolnoki", "Attila", ""], ["Floría", "Luis M.", ""], ["Moreno", "Yamir", ""]]}, {"id": "1301.2533", "submitter": "Paulo Shakarian", "authors": "Paulo Shakarian, Patrick Roos, Geoffrey Moores", "title": "A Novel Analytical Method for Evolutionary Graph Theory Problems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI q-bio.PE", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Evolutionary graph theory studies the evolutionary dynamics of populations\nstructured on graphs. A central problem is determining the probability that a\nsmall number of mutants overtake a population. Currently, Monte Carlo\nsimulations are used for estimating such fixation probabilities on general\ndirected graphs, since no good analytical methods exist. In this paper, we\nintroduce a novel deterministic framework for computing fixation probabilities\nfor strongly connected, directed, weighted evolutionary graphs under neutral\ndrift. We show how this framework can also be used to calculate the expected\nnumber of mutants at a given time step (even if we relax the assumption that\nthe graph is strongly connected), how it can extend to other related models\n(e.g. voter model), how our framework can provide non-trivial bounds for\nfixation probability in the case of an advantageous mutant, and how it can be\nused to find a non-trivial lower bound on the mean time to fixation. We provide\nvarious experimental results determining fixation probabilities and expected\nnumber of mutants on different graphs. Among these, we show that our method\nconsistently outperforms Monte Carlo simulations in speed by several orders of\nmagnitude. Finally we show how our approach can provide insight into synaptic\ncompetition in neurology.\n", "versions": [{"version": "v1", "created": "Fri, 11 Jan 2013 16:23:19 GMT"}], "update_date": "2013-01-14", "authors_parsed": [["Shakarian", "Paulo", ""], ["Roos", "Patrick", ""], ["Moores", "Geoffrey", ""]]}, {"id": "1301.2791", "submitter": "Alvaro Sanchez", "authors": "Alvaro Sanchez, Jeff Gore", "title": "Feedback between population and evolutionary dynamics determines the\n  fate of social microbial populations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evolutionary spread of cheater strategies can destabilize populations\nengaging in cooperative behaviors, thus demonstrating that evolutionary changes\ncan have profound implications for populations dynamics. At the same time, the\nrelative fitness of cooperative traits often depends upon population density,\nthus leading to the potential for bidirectional coupling between population\ndensity and the evolution of a cooperative trait. Despite the potential\nimportance of these eco evolutionary feedback loops, they have not yet been\ndemonstrated experimentally in social species and their ecological implications\nare poorly understood. Here, we demonstrate the presence of a strong feedback\nloop between population dynamics and the evolutionary dynamics of a social\nmicrobial gene, SUC2, in laboratory yeast populations whose cooperative growth\nis mediated by the SUC2 gene. We directly visualize eco evolutionary\ntrajectories of hundreds of populations over fifty generations, allowing us to\ncharacterize the phase space describing the interplay of evolution and ecology\nin this system. Small populations collapse despite continual evolution towards\nincreased cooperative allele frequencies; large populations with a sufficient\nnumber of cooperators spiral to a stable state of coexistence between\ncooperator and cheater strategies. The presence of cheaters does not\nsignificantly affect the equilibrium population density, but it does reduce the\nresilience of the population as well as its ability to adapt to a rapidly\ndeteriorating environment. Our results demonstrate the potential ecological\nimportance of coupling between evolutionary dynamics and the population\ndynamics of cooperatively growing organisms, particularly in microbes.\n", "versions": [{"version": "v1", "created": "Sun, 13 Jan 2013 16:45:21 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Sanchez", "Alvaro", ""], ["Gore", "Jeff", ""]]}, {"id": "1301.2908", "submitter": "Arno Siri-J\\'egousse", "authors": "Fabian Freund and Arno Siri-J\\'egousse", "title": "Minimal clade size in the Bolthausen-Sznitman coalescent", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article shows the asymptotics of distribution and moments of the size\n$X_n$ of the minimal clade of a randomly chosen individual in a\nBolthausen-Sznitman $n$-coalescent for $n\\to\\infty$. The Bolthausen-Sznitman\n$n$-coalescent is a Markov process taking states in the set of partitions of\n$\\left\\{1,\\ldots,n\\right\\}$, where $1,\\ldots,n$ are referred to as individuals.\nThe minimal clade of an individual is the equivalence class the individual is\nin at the time of the first coalescence event this individual participates\nin.\\\\ The main tool used is the connection of the Bolthausen-Sznitman\n$n$-coalescent with random recursive trees introduced by Goldschmidt and Martin\n(see \\cite{goldschmidtmartin}). This connection shows that $X_n-1$ is\ndistributed as the number $M_n$ of all individuals not in the equivalence class\nof individual 1 shortly before the time of the last coalescence event. Both\nfunctionals are distributed like the size $RT_{n-1}$ of an uniformly chosen\ntable in a standard Chinese restaurant process with $n-1$ customers.We give\nexact formulae for these distributions.\\\\ Using the asymptotics of $M_n$ shown\nby Goldschmidt and Martin in \\cite{goldschmidtmartin}, we see $(\\log\nn)^{-1}\\log X_n$ converges in distribution to the uniform distribution on [0,1]\nfor $n\\to\\infty$.\\\\ We provide the complimentary information that $\\frac{\\log\nn}{n^k}E(X_n^k)\\to \\frac{1}{k}$ for $n\\to\\infty$, which is also true for $M_n$\nand $RT_n$.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jan 2013 10:26:45 GMT"}, {"version": "v2", "created": "Wed, 6 Mar 2013 17:08:39 GMT"}], "update_date": "2013-03-07", "authors_parsed": [["Freund", "Fabian", ""], ["Siri-Jégousse", "Arno", ""]]}, {"id": "1301.2979", "submitter": "Yannis Drossinos", "authors": "Marguerite Robinson, Yannis Drossinos, Nikolaos I. Stilianakis", "title": "Indirect transmission and the effect of seasonal pathogen inactivation\n  on infectious disease periodicity", "comments": "36 pages, 10 figures, to appear in Epidemics", "journal-ref": "Epidemics 5, 111-121 (2013)", "doi": "10.1016/j.epidem.2013.01.001", "report-no": null, "categories": "q-bio.PE physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The annual occurrence of many infectious diseases remains a constant burden\nto public health systems. The seasonal patterns in respiratory disease\nincidence observed in temperate regions have been attributed to the impact of\nenvironmental conditions on pathogen survival. A model describing the\ntransmission of an infectious disease by means of a pathogenic state capable of\nsurviving in an environmental reservoir outside of its host organism is\npresented in this paper. The ratio of pathogen lifespan to the duration of the\ninfectious disease state is found to be a critical parameter in determining\ndisease dynamics. The introduction of a seasonally forced pathogen inactivation\nrate identifies a time delay between peak pathogen survival and peak disease\nincidence. The delay is dependent on specific disease parameters and, for\ninfluenza, decreases with increasing reproduction number. The observed seasonal\noscillations are found to have a period identical to that of the seasonally\nforced inactivation rate and which is independent of the duration of infection\nacquired immunity\n", "versions": [{"version": "v1", "created": "Mon, 14 Jan 2013 14:06:24 GMT"}], "update_date": "2013-11-13", "authors_parsed": [["Robinson", "Marguerite", ""], ["Drossinos", "Yannis", ""], ["Stilianakis", "Nikolaos I.", ""]]}, {"id": "1301.3109", "submitter": "Philipp Messer", "authors": "Philipp W. Messer", "title": "SLiM: Simulating Evolution with Selection and Linkage", "comments": "SLiM is a C++ command line program freely available under the GNU GPL\n  license from http://www.stanford.edu/~messer/software. A comprehensive\n  documentation for SLiM can be downloaded from the program website", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  SLiM is an efficient forward population genetic simulation designed for\nstudying the effects of linkage and selection on a chromosome-wide scale. The\nprogram can incorporate complex scenarios of demography and population\nsubstructure, various models for selection and dominance of new mutations,\narbitrary gene and chromosomal structure, and user-defined recombination maps.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jan 2013 20:17:07 GMT"}], "update_date": "2013-01-15", "authors_parsed": [["Messer", "Philipp W.", ""]]}, {"id": "1301.3110", "submitter": "Jeffrey Shaman", "authors": "Jeffrey Shaman, Alicia Karspeck and Marc Lipsitch", "title": "Week 1 Influenza Forecast for the 2012-2013 U.S. Season", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This is part of a series of weekly influenza forecasts made during the\n2012-2013 influenza season. Here we present results of forecasts initiated\nfollowing assimilation of observations for Week 1 (i.e. the forecast begins\nJanuary 6, 2013) for municipalities in the United States. These forecasts were\nperformed on January 11, 2013. Results from forecasts initiated the six\nprevious weeks (Weeks 47-52) are also presented. The accuracy of these\npredictions will not be known for certain until the conclusion of the current\ninfluenza season; however, at the moment a number of the forecasted peaks\nappear to be inaccurate. This inaccuracy may be due to the virulence of\ninfluenza this season, which appears to be sending more influenza-infected\npersons to seek medical attention and inflates ILI levels (and possibly the\nproportion testing influenza positive) relative to years with milder flu\nstrains. New forecasts that adjust, or scale, for this difference and match the\ntwo focus cities that appear to have already peaked are identified. These new\nforecasts will be used, in addition to the previously scaled forms, to make\ninfluenza predictions for the remainder of the season.\n", "versions": [{"version": "v1", "created": "Mon, 14 Jan 2013 20:18:47 GMT"}, {"version": "v2", "created": "Sun, 20 Jan 2013 01:57:53 GMT"}], "update_date": "2013-01-22", "authors_parsed": [["Shaman", "Jeffrey", ""], ["Karspeck", "Alicia", ""], ["Lipsitch", "Marc", ""]]}, {"id": "1301.3238", "submitter": "Zhijian Wang", "authors": "Bin Xu and Hai-Jun Zhou and Zhijian Wang", "title": "Cycle frequency in standard Rock-Paper-Scissors games: Evidence from\n  experimental economics", "comments": "7 Page, 3 figure; Keyword: Rock-Paper-Scissors game; cycle; social\n  state; population dynamics; evolutionary trajectory", "journal-ref": "Physica A: Statistical Mechanics and its Applications, Volume 392,\n  Issue 20, 15 October 2013, Pages 4997-5005", "doi": "10.1016/j.physa.2013.06.039", "report-no": null, "categories": "nlin.AO physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Rock-Paper-Scissors (RPS) game is a widely used model system in game\ntheory. Evolutionary game theory predicts the existence of persistent cycles in\nthe evolutionary trajectories of the RPS game, but experimental evidence has\nremained to be rather weak. In this work we performed laboratory experiments on\nthe RPS game and analyzed the social-state evolutionary trajectories of twelve\npopulations of N=6 players. We found strong evidence supporting the existence\nof persistent cycles. The mean cycling frequency was measured to be $0.029 \\pm\n0.009$ period per experimental round. Our experimental observations can be\nquantitatively explained by a simple non-equilibrium model, namely the\ndiscrete-time logit dynamical process with a noise parameter. Our work\ntherefore favors the evolutionary game theory over the classical game theory\nfor describing the dynamical behavior of the RPS game.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jan 2013 06:53:41 GMT"}, {"version": "v2", "created": "Tue, 7 May 2013 14:59:54 GMT"}, {"version": "v3", "created": "Mon, 12 Aug 2013 12:36:01 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["Xu", "Bin", ""], ["Zhou", "Hai-Jun", ""], ["Wang", "Zhijian", ""]]}, {"id": "1301.3325", "submitter": "David Lawrie", "authors": "David S. Lawrie, Philipp W. Messer, Ruth Hershberg, and Dmitri A.\n  Petrov", "title": "Strong Purifying Selection at Synonymous Sites in D. melanogaster", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pgen.1003527", "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Synonymous sites are generally assumed to be subject to weak selective\nconstraint. For this reason, they are often neglected as a possible source of\nimportant functional variation. We use site frequency spectra from deep\npopulation sequencing data to show that, contrary to this expectation, 22% of\nfour-fold synonymous (4D) sites in D. melanogaster evolve under very strong\nselective constraint while few, if any, appear to be under weak constraint.\nLinking polymorphism with divergence data, we further find that the fraction of\nsynonymous sites exposed to strong purifying selection is higher for those\npositions that show slower evolution on the Drosophila phylogeny. The function\nunderlying the inferred strong constraint appears to be separate from splicing\nenhancers, nucleosome positioning, and the translational optimization\ngenerating canonical codon bias. The fraction of synonymous sites under strong\nconstraint within a gene correlates well with gene expression, particularly in\nthe mid-late embryo, pupae, and adult developmental stages. Genes enriched in\nstrongly constrained synonymous sites tend to be particularly functionally\nimportant and are often involved in key developmental pathways. Given that the\nobserved widespread constraint acting on synonymous sites is likely not limited\nto Drosophila, the role of synonymous sites in genetic disease and adaptation\nshould be reevaluated.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jan 2013 12:49:27 GMT"}], "update_date": "2013-06-14", "authors_parsed": [["Lawrie", "David S.", ""], ["Messer", "Philipp W.", ""], ["Hershberg", "Ruth", ""], ["Petrov", "Dmitri A.", ""]]}, {"id": "1301.3422", "submitter": "Albert Erives", "authors": "Albert Erives and Jan Fassler", "title": "Metabolic and Chaperone Gene Loss Marks the Origin of Animals: Evidence\n  for Hsp104 and Hsp78 Sharing Mitochondrial Clients", "comments": "This is a reformatted version from the recent official publication in\n  PLoS ONE (2015). This version differs substantially from first three arXiV\n  versions. This version uses a fixed-width font for DNA sequences as was done\n  in the earlier arXiv versions but which is missing in the official PLoS ONE\n  publication. The title has also been shortened slightly from the official\n  publication", "journal-ref": "PLoS ONE 10(2): e0117192 (2015)", "doi": "10.1371/journal.pone.0117192", "report-no": null, "categories": "q-bio.GN q-bio.BM q-bio.PE q-bio.TO", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The evolution of animals involved acquisition of an emergent gene repertoire\nfor gastrulation. Whether loss of genes also co-evolved with this developmental\nreprogramming has not yet been addressed. Here, we identify twenty-four genetic\nfunctions that are retained in fungi and choanoflagellates but undetectable in\nanimals. These lost genes encode: (i) sixteen distinct biosynthetic functions;\n(ii) the two ancestral eukaryotic ClpB disaggregases, Hsp78 and Hsp104, which\nfunction in the mitochondria and cytosol, respectively; and (iii) six other\nassorted functions. We present computational and experimental data that are\nconsistent with a joint function for the differentially localized ClpB\ndisaggregases, and with the possibility of a shared client/chaperone\nrelationship between the mitochondrial Fe/S homoaconitase encoded by the lost\nLYS4 gene and the two ClpBs. Our analyses lead to the hypothesis that the\nevolution of gastrulation-based multicellularity in animals led to efficient\nextraction of nutrients from dietary sources, loss of natural selection for\nmaintenance of energetically expensive biosynthetic pathways, and subsequent\nloss of their attendant ClpB chaperones.\n", "versions": [{"version": "v1", "created": "Tue, 15 Jan 2013 17:22:23 GMT"}, {"version": "v2", "created": "Wed, 6 Feb 2013 18:07:25 GMT"}, {"version": "v3", "created": "Sun, 6 Oct 2013 22:56:18 GMT"}, {"version": "v4", "created": "Sat, 28 Feb 2015 01:12:01 GMT"}], "update_date": "2015-03-03", "authors_parsed": [["Erives", "Albert", ""], ["Fassler", "Jan", ""]]}, {"id": "1301.3651", "submitter": "Rudolf Philippe Rohr", "authors": "Rudolf P. Rohr, Miguel A. Fortuna, Bartolo Luque, and Jordi Bascompte", "title": "Nestedness in mutualistic networks", "comments": "2 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  James et al. (2012) presented simulations that apparently falsify the\nanalytical result by Bastolla et al. (2009), who showed that nested mutualistic\ninteractions decrease interspecific competition and increase biodiversity in\nmodel ecosystems. This contradiction, however, mainly stems from the incorrect\napplication of formulas derived for fully connected networks to empirical,\nsparse networks.\n", "versions": [{"version": "v1", "created": "Wed, 16 Jan 2013 10:56:13 GMT"}], "update_date": "2013-01-17", "authors_parsed": [["Rohr", "Rudolf P.", ""], ["Fortuna", "Miguel A.", ""], ["Luque", "Bartolo", ""], ["Bascompte", "Jordi", ""]]}, {"id": "1301.3981", "submitter": "Armita Nourmohammad", "authors": "Armita Nourmohammad, Stephan Schiffels, Michael Laessig", "title": "Evolution of molecular phenotypes under stabilizing selection", "comments": null, "journal-ref": "J. Stat. Mech. (2013) P01012", "doi": "10.1088/1742-5468/2013/01/P01012", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Molecular phenotypes are important links between genomic information and\norganismic functions, fitness, and evolution. Complex phenotypes, which are\nalso called quantitative traits, often depend on multiple genomic loci. Their\nevolution builds on genome evolution in a complicated way, which involves\nselection, genetic drift, mutations and recombination. Here we develop a\ncoarse-grained evolutionary statistics for phenotypes, which decouples from\ndetails of the underlying genotypes. We derive approximate evolution equations\nfor the distribution of phenotype values within and across populations. This\ndynamics covers evolutionary processes at high and low recombination rates,\nthat is, it applies to sexual and asexual populations. In a fitness landscape\nwith a single optimal phenotype value, the phenotypic diversity within\npopulations and the divergence between populations reach evolutionary\nequilibria, which describe stabilizing selection. We compute the equilibrium\ndistributions of both quantities analytically and we show that the ratio of\nmean divergence and diversity depends on the strength of selection in a\nuniversal way: it is largely independent of the phenotype's genomic encoding\nand of the recombination rate. This establishes a new method for the inference\nof selection on molecular phenotypes beyond the genome level. We discuss the\nimplications of our findings for the predictability of evolutionary processes.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jan 2013 04:51:07 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Nourmohammad", "Armita", ""], ["Schiffels", "Stephan", ""], ["Laessig", "Michael", ""]]}, {"id": "1301.4193", "submitter": "Jacob Scott", "authors": "Daniel Nichol, Peter Jeavons, Robert Bonomo, Philip K. Maini, Jerome\n  L. Paul, Robert A. Gatenby, Alexander R.A. Anderson and Jacob G. Scott", "title": "A Markov chain model of evolution in asexually reproducing populations:\n  insight and analytical tractability in the evolutionary process", "comments": "12 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evolutionary process has been modelled in many ways using both stochastic\nand deterministic models. We develop an algebraic model of evolution in a\npopulation of asexually reproducing organisms in which we represent a\nstochastic walk in phenotype space, constrained to the edges of an underlying\ngraph representing the genotype, with a time-homogeneous Markov Chain. We show\nits equivalence to a more standard, explicit stochastic model and show the\nalgebraic model's superiority in computational efficiency. Because of this\nincrease in efficiency, we offer the ability to simulate the evolution of much\nlarger populations in more realistic genotype spaces. Further, we show how the\nalgebraic properties of the Markov Chain model can give insight into the\nevolutionary process and allow for analysis using familiar linear algebraic\nmethods.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jan 2013 19:25:29 GMT"}], "update_date": "2013-01-18", "authors_parsed": [["Nichol", "Daniel", ""], ["Jeavons", "Peter", ""], ["Bonomo", "Robert", ""], ["Maini", "Philip K.", ""], ["Paul", "Jerome L.", ""], ["Gatenby", "Robert A.", ""], ["Anderson", "Alexander R. A.", ""], ["Scott", "Jacob G.", ""]]}, {"id": "1301.4276", "submitter": "Sonal Singhal", "authors": "Sonal Singhal and Craig Moritz", "title": "Reproductive isolation between phylogeographic lineages scales with\n  divergence", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Phylogeographic studies frequently reveal multiple morphologically-cryptic\nlineages within species. What is yet unclear is whether such lineages represent\nnascent species or evolutionary ephemera. To address this question, we compare\nfive contact zones, each of which occurs between eco-morphologically cryptic\nlineages of rainforest skinks from the rainforests of the Australian Wet\nTropics. Although the contacts likely formed concurrently in response to\nHolocene expansion from glacial refugia, we estimate that the divergence times\n(t) of the lineage-pairs range from 3.1 to 11.5 Myr. Multilocus analyses of the\ncontact zones yielded estimates of reproductive isolation that are tightly\ncorrelated with divergence time and, for longer-diverged lineages (t > 5 Myr),\nsubstantial. These results show that phylogeographic splits of increasing depth\ncan represent stages along the speciation continuum, even in the absence of\novert change in ecologically relevant morphology.\n", "versions": [{"version": "v1", "created": "Thu, 17 Jan 2013 23:54:31 GMT"}], "update_date": "2013-01-21", "authors_parsed": [["Singhal", "Sonal", ""], ["Moritz", "Craig", ""]]}, {"id": "1301.4299", "submitter": "Alexander Tchourbanov Y", "authors": "Alexander Churbanov and Levon Abrahamyan", "title": "Preventing common hereditary disorders through time-separated twinning", "comments": "Supporting web site http://prevmed.big.ac.cn contains more\n  information. Poster on the project is available at\n  http://f1000.com/posters/browse/summary/1092806", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biomedical advances have led to a relaxation of natural selection in the\nhuman population in developed countries. In the absence of strong purifying\nselection, spontaneous and frequently deleterious mutations tend to accumulate\nin the human genome and gradually increase the genetic load; that is, the\nfrequency of potentially lethal genes in the gene pool. Gradual increase in\nincidence of many hereditary disorders suggests deleterious impact of the\ngenetic load on human well being. Many complex diseases such as type 1 and 2\ndiabetes, autism, bipolar disorder, allergies, Alzheimer disease, and some\ncancers show significantly higher concordance in monozygotic (MZ) twins than in\ndizygotic twins (DZ) or parent-child pairs, suggesting their etiology is\nstrongly influenced by genetics. Preventing these diseases based on genetic\ndata alone is frequently impossible. We hypothesize that the incidence of\ncomplex diseases could be significantly reduced in the future through a\nstrategy based on time-separated twinning. This strategy involves the\ncollection and fertilization of human oocytes followed by several rounds of\nartificial twinning. If preimplantation genetic screening (PGS) reports no\naneuploidy or known Mendelian disorders, one of the MZ siblings would be\nimplanted and the remaining embryos cryoconserved. Once the health of the adult\nMZ sibling(s) is established, subsequent parenthood with the cryoconserved\ntwins could substantially lower the incidence of hereditary disorders with\nMendelian or complex etiology. The proposed method of artificial twinning has\nthe potential to alleviate suffering and reduce the negative social impact\ninduced by dysgenic effects associated with known and unknown genetic factors.\nTime-separated twinning has the capacity to prevent further accumulation of the\ngenetic load and to provide source of isogenic embryonic stem cells for future\nregenerative therapies.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jan 2013 05:25:47 GMT"}], "update_date": "2013-01-21", "authors_parsed": [["Churbanov", "Alexander", ""], ["Abrahamyan", "Levon", ""]]}, {"id": "1301.4511", "submitter": "Wlodek Bryc", "authors": "Katarzyna Bryc, Wlodek Bryc, Jack W. Silverstein", "title": "Separation of the largest eigenvalues in eigenanalysis of genotype data\n  from discrete subpopulations", "comments": "Corrected typos in Section 3.1 (M=120, N=2500) and proof of Lemma 2", "journal-ref": "Theoretical Population Biology 89 (2013) 34-43", "doi": "10.1016/j.tpb.2013.08.004", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a mathematical model, and the corresponding mathematical analysis,\nthat justifies and quantifies the use of principal component analysis of\nbiallelic genetic marker data for a set of individuals to detect the number of\nsubpopulations represented in the data. We indicate that the power of the\ntechnique relies more on the number of individuals genotyped than on the number\nof markers.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jan 2013 21:59:10 GMT"}, {"version": "v2", "created": "Wed, 18 Oct 2017 14:58:15 GMT"}], "update_date": "2017-10-19", "authors_parsed": [["Bryc", "Katarzyna", ""], ["Bryc", "Wlodek", ""], ["Silverstein", "Jack W.", ""]]}, {"id": "1301.4516", "submitter": "Carlo Artieri Ph.D.", "authors": "Carlo G. Artieri and Hunter B. Fraser", "title": "Transcript length mediates developmental timing of gene expression\n  across Drosophila", "comments": "31 pages, 5 figures, 1 table, 1 supplemental document, 5 supplemental\n  figures, 3 supplemental tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The time required to transcribe genes with long primary transcripts may limit\ntheir ability to be expressed in cells with short mitotic cycles, a phenomenon\ntermed intron delay. As such short cycles are a hallmark of the earliest stages\nof insect development, we used Drosophila developmental timecourse expression\ndata to test whether intron delay affects gene expression genome-wide, and to\ndetermine its consequences for the evolution of gene structure. We find that\nlong zygotically expressed, but not maternally deposited, genes show\nsubstantial delay in expression relative to their shorter counterparts and that\nthis delay persists over a substantial portion of the ~24 hours of\nembryogenesis. Patterns of RNA-seq coverage from the 5' and 3' ends of\ntranscripts show that this delay is consistent with their inability to\nterminate transcription, but not with transcriptional initiation-based\nregulatory control. Highly expressed zygotic genes are subject to purifying\nselection to maintain compact transcribed regions, allowing conservation of\nembryonic expression patterns across the Drosophila phylogeny. We propose that\nintron delay is an underappreciated physical mechanism affecting both patterns\nof expression as well as gene structure of many genes across Drosophila.\n", "versions": [{"version": "v1", "created": "Fri, 18 Jan 2013 22:47:40 GMT"}], "update_date": "2015-03-13", "authors_parsed": [["Artieri", "Carlo G.", ""], ["Fraser", "Hunter B.", ""]]}, {"id": "1301.4640", "submitter": "Francesc Rossell\\'o", "authors": "Gabriel Cardona, Arnau Mir, Francesc Rossello, Lucia Rotger, David\n  Sanchez", "title": "Cophenetic metrics for phylogenetic trees, after Sokal and Rohlf", "comments": "The \"authors' cut\" of a paper published in BMC Bioinformatics 14:3\n  (2013). 46 pages", "journal-ref": "BMC Bioinformatics 14:3 (2013)", "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Phylogenetic tree comparison metrics are an important tool in the study of\nevolution, and hence the definition of such metrics is an interesting problem\nin phylogenetics. In a paper in Taxon fifty years ago, Sokal and Rohlf proposed\nto measure quantitatively the difference between a pair of phylogenetic trees\nby first encoding them by means of their half-matrices of cophenetic values,\nand then comparing these matrices. This idea has been used several times since\nthen to define dissimilarity measures between phylogenetic trees but, to our\nknowledge, no proper metric on weighted phylogenetic trees with nested taxa\nbased on this idea has been formally defined and studied yet. Actually, the\ncophenetic values of pairs of different taxa alone are not enough to single out\nphylogenetic trees with weighted arcs or nested taxa. In this paper we define a\nfamily of cophenetic metrics that compare phylogenetic trees on a same set of\ntaxa by encoding them by means of their vectors of cophenetic values of pairs\nof taxa and depths of single taxa, and then computing the $L^p$ norm of the\ndifference of the corresponding vectors. Then, we study, either analytically or\nnumerically, some of their basic properties: neighbors, diameter, distribution,\nand their rank correlation with each other and with other metrics.\n", "versions": [{"version": "v1", "created": "Sun, 20 Jan 2013 09:07:58 GMT"}], "update_date": "2013-01-22", "authors_parsed": [["Cardona", "Gabriel", ""], ["Mir", "Arnau", ""], ["Rossello", "Francesc", ""], ["Rotger", "Lucia", ""], ["Sanchez", "David", ""]]}, {"id": "1301.4969", "submitter": "Lee Altenberg", "authors": "Lee Altenberg", "title": "On the Ordering of Spectral Radius Product r(A) r(AD) Versus r(A^2 D)\n  and Related Applications", "comments": "27 pages, 35 references; v2: additions and revisions; v3: correction\n  of an omitted term", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.SP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For a nonnegative matrix A and real diagonal matrix D, two known inequalities\non the spectral radius, r(A^2 D^2) >= r(AD)^2 and r(A) r(A D^2) >= r(AD)^2,\nleave open the question of what determines the order of r(A^2 D^2) with respect\nto r(A) r(A D^2). This is a special case of a broad class of problems that\narise repeatedly in ecological and evolutionary dynamics. Here, sufficient\nconditions are found on A that determine orders in either direction. For a\ndiagonally symmetrizable nonnegative matrix A with all positive eigenvalues and\nnonnegative D, r(A^2 D) <= r(A) r(AD). The reverse holds if all of the\neigenvalues of A are negative besides the Perron root. This is a particular\ncase of the more general result that r(A [(1-m) r(B) I + m B] D) is monotonic\nin m when all non-Perron eigenvalues of A have the same sign --- decreasing for\npositive signs and increasing for negative signs, for symmetrizable nonnegative\nA and B that commute. Commuting matrices include the Kronecker products A, B in\n{\\otimes_{i=1}^L M_i^{t_i}}, t_i in {0, 1, 2, ...}, which comprise a class of\napplication for these results. This machinery allows analysis of the sign of\nd/d m_j r({\\otimes_{i=1}^L[(1-m_i) r(A_i) I_i + m_i A_i]}D). The eigenvalue\nsign conditions also provide lower or upper bounds to the harmonic mean of the\nexpected sojourn times of Markov chains. These inequalities appear in the\nasymptotic growth rates of viral quasispecies, models for the evolution of\ndispersal in random environments, and the evolution of site-specific mutation\nrates over the entire genome.\n", "versions": [{"version": "v1", "created": "Mon, 21 Jan 2013 19:24:42 GMT"}, {"version": "v2", "created": "Wed, 17 Apr 2013 01:13:31 GMT"}, {"version": "v3", "created": "Fri, 19 Apr 2013 01:57:58 GMT"}], "update_date": "2013-04-22", "authors_parsed": [["Altenberg", "Lee", ""]]}, {"id": "1301.5054", "submitter": "Alexandre Bouchard-C\\^ot\\'e", "authors": "Alexandre Bouchard-C\\^ot\\'e", "title": "A Note on Probabilistic Models over Strings: the Linear Algebra Approach", "comments": "17 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.FL stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Probabilistic models over strings have played a key role in developing\nmethods allowing indels to be treated as phylogenetically informative events.\nThere is an extensive literature on using automata and transducers on\nphylogenies to do inference on these probabilistic models, in which an\nimportant theoretical question in the field is the complexity of computing the\nnormalization of a class of string-valued graphical models. This question has\nbeen investigated using tools from combinatorics, dynamic programming, and\ngraph theory, and has practical applications in Bayesian phylogenetics. In this\nwork, we revisit this theoretical question from a different point of view,\nbased on linear algebra. The main contribution is a new proof of a known result\non the complexity of inference on TKF91, a well-known probabilistic model over\nstrings. Our proof uses a different approach based on classical linear algebra\nresults, and is in some cases easier to extend to other models. The proving\nmethod also has consequences on the implementation and complexity of inference\nalgorithms.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jan 2013 01:46:25 GMT"}, {"version": "v2", "created": "Thu, 11 Jul 2013 23:54:48 GMT"}], "update_date": "2013-07-15", "authors_parsed": [["Bouchard-Côté", "Alexandre", ""]]}, {"id": "1301.5131", "submitter": "Francesc Rossell\\'o", "authors": "Gabriel Cardona, Arnau Mir, Francesc Rossello", "title": "The expected value of the squared euclidean cophenetic metric under the\n  Yule and the uniform models", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.DM math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The cophenetic metrics $d_{\\varphi,p}$, for $p\\in {0}\\cup[1,\\infty[$, are a\nrecent addition to the kit of available distances for the comparison of\nphylogenetic trees. Based on a fifty years old idea of Sokal and Rohlf, these\nmetrics compare phylogenetic trees on a same set of taxa by encoding them by\nmeans of their vectors of cophenetic values of pairs of taxa and depths of\nsingle taxa, and then computing the $L^p$ norm of the difference of the\ncorresponding vectors. In this paper we compute the expected value of the\nsquare of $d_{\\varphi,2}$ on the space of fully resolved rooted phylogenetic\ntrees with $n$ leaves, under the Yule and the uniform probability\ndistributions.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jan 2013 10:38:01 GMT"}], "update_date": "2013-01-23", "authors_parsed": [["Cardona", "Gabriel", ""], ["Mir", "Arnau", ""], ["Rossello", "Francesc", ""]]}, {"id": "1301.5357", "submitter": "Steven Frank", "authors": "Steven A. Frank", "title": "Natural selection. VI. Partitioning the information in fitness and\n  characters by path analysis", "comments": null, "journal-ref": "Journal of Evolutionary Biology 26:457-471 (2013)", "doi": "10.1111/jeb.12066", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Three steps aid in the analysis of selection. First, describe phenotypes by\ntheir component causes. Components include genes, maternal effects, symbionts,\nand any other predictors of phenotype that are of interest. Second, describe\nfitness by its component causes, such as an individual's phenotype, its\nneighbors' phenotypes, resource availability, and so on. Third, put the\npredictors of phenotype and fitness into an exact equation for evolutionary\nchange, providing a complete expression of selection and other evolutionary\nprocesses. The complete expression separates the distinct causal roles of the\nvarious hypothesized components of phenotypes and fitness. Traditionally, those\ncomponents are given by the covariance, variance, and regression terms of\nevolutionary models. I show how to interpret those statistical expressions with\nrespect to information theory. The resulting interpretation allows one to read\nthe fundamental equations of selection and evolution as sentences that express\nhow various causes lead to the accumulation of information by selection and the\ndecay of information by other evolutionary processes. The interpretation in\nterms of information leads to a deeper understanding of selection and\nheritability, and a clearer sense of how to formulate causal hypotheses about\nevolutionary process. Kin selection appears as a particular type of causal\nanalysis that partitions social effects into meaningful components.\n", "versions": [{"version": "v1", "created": "Tue, 22 Jan 2013 22:31:47 GMT"}], "update_date": "2013-02-14", "authors_parsed": [["Frank", "Steven A.", ""]]}, {"id": "1301.5465", "submitter": "Ricardo Martinez-Garcia", "authors": "Ricardo Mart\\'inez-Garc\\'ia, Justin M. Calabrese, Thomas Mueller, Kirk\n  Olson and Crist\\'obal L\\'opez", "title": "Optimizing the search for resources by sharing information: Mongolian\n  gazelles as a case study", "comments": "5 pages, 3 figures", "journal-ref": "Physical Review Letters 110, 248106 (1-5) (2013)", "doi": "10.1103/PhysRevLett.110.248106", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the relationship between communication and search efficiency\nin a biological context by proposing a model of Brownian searchers with\nlong-range pairwise interaction. After a general study of the properties of the\nmodel, we show an application to the particular case of acoustic communication\namong Mongolian gazelle, for which data are available, searching for good\nhabitat areas. Using Monte Carlo simulations and density equations, our results\npoint out that the search is optimal (i.e. the mean first hitting time among\nsearchers is minimum) at intermediate scales of communication, showing that\nboth an excess and a lack of information may worsen it.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2013 11:02:48 GMT"}, {"version": "v2", "created": "Fri, 10 May 2013 09:21:21 GMT"}, {"version": "v3", "created": "Thu, 20 Jun 2013 09:09:50 GMT"}], "update_date": "2013-06-21", "authors_parsed": [["Martínez-García", "Ricardo", ""], ["Calabrese", "Justin M.", ""], ["Mueller", "Thomas", ""], ["Olson", "Kirk", ""], ["López", "Cristóbal", ""]]}, {"id": "1301.5512", "submitter": "Amaury Lambert", "authors": "Amaury Lambert and H\\'el\\`ene Morlon and Rampal S. Etienne", "title": "The reconstructed tree in the lineage-based model of protracted\n  speciation", "comments": "27 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A popular line of research in evolutionary biology is the use of\ntime-calibrated phylogenies for the inference of diversification processes.\nThis requires computing the likelihood of a given ultrametric tree as the\nreconstructed tree produced by a given model of diversification. Etienne &\nRosindell (2012) proposed a lineage-based model of diversification, called\nprotracted speciation, where species remain incipient during a random duration\nbefore turning good species, and showed that this can explain the slowdown in\nlineage accumulation observed in real phylogenies. However, they were unable to\nprovide a general likelihood formula. Here, we present a likelihood formula for\nprotracted speciation models, where rates at which species turn good or become\nextinct can depend both on their age and on time. Our only restrictive\nassumption is that speciation rate does not depend on species status.\n  Our likelihood formula utilizes a new technique, based on the contour of the\nphylogenetic tree and first developed in Lambert (2010). We consider the\nreconstructed trees spanned by all extant species, by all good extant species,\nor by all representative species, which are either good extant species or\nincipient species representative of some good extinct species. Specifically, we\nprove that each of these trees is a coalescent point process, that is, a\nplanar, ultrametric tree where the coalescence times between two consecutive\ntips are independent, identically distributed random variables. We characterize\nthe common distribution of these coalescence times in some, biologically\nmeaningful, special cases for which the likelihood reduces to an elegant\nanalytical formula or becomes numerically tractable.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2013 14:29:24 GMT"}], "update_date": "2013-01-24", "authors_parsed": [["Lambert", "Amaury", ""], ["Morlon", "Hélène", ""], ["Etienne", "Rampal S.", ""]]}, {"id": "1301.5527", "submitter": "David A. Kessler", "authors": "Shlomit Weisman, David A. Kessler", "title": "Coexistence in an inhomogeneous environment", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0062699", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine the two-dimensional extension of the model of Kessler and Sander\nof competition between two species identical except for dispersion rates. In\nthis class of models, the spatial inhomogeneity of reproduction rates gives\nrise to an implicit cost of dispersal, due to the tendency to leave favorable\nlocations. Then, as in the Hamilton-May model with its explicit dispersal cost,\nthe tradeoff between dispersal case and the beneficial role of dispersal in\nlimiting fluctuations, leads to an advantage of one dispersal rate over\nanother, and the eventual extinction of the disadvantaged species. In two\ndimensions we find that while the competition leads to the elimination of one\nspecies at high and low population density, at intermediate densities the two\nspecies can coexist essentially indefinitely. This is a new phenomenon not\npresent in either the one-dimensional form of the Kessler-Sander model nor in\nthe totally connected Hamilton-May model, and points to the importance of\ngeometry in the question of dispersal.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2013 15:09:33 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Weisman", "Shlomit", ""], ["Kessler", "David A.", ""]]}, {"id": "1301.5656", "submitter": "Kristina Crona", "authors": "Christiane P. Goulart, Mentar Mahmudi, Kristina A. Crona, Stephen D.\n  Jacobs, Marcelo Kallmann, Barry G. Hall, Devin C. Greene, Miriam Barlow", "title": "Designing antibiotic cycling strategies by determining and understanding\n  local adaptive landscapes", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0056040", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evolution of antibiotic resistance among bacteria threatens our continued\nability to treat infectious diseases. The need for sustainable strategies to\ncure bacterial infections has never been greater. So far, all attempts to\nrestore susceptibility after resistance has arisen have been unsuccessful,\nincluding restrictions on prescribing [1] and antibiotic cycling [2,3]. Part of\nthe problem may be that those efforts have implemented different classes of\nunrelated antibiotics, and relied on removal of resistance by random loss of\nresistance genes from bacterial populations (drift). Here, we show that\nalternating structurally similar antibiotics can restore susceptibility to\nantibiotics after resistance has evolved. We found that the resistance\nphenotypes conferred by variant alleles of the resistance gene encoding the TEM\n{\\beta}-lactamase (blaTEM) varied greatly among 15 different {\\beta}-lactam\nantibiotics. We captured those differences by characterizing complete adaptive\nlandscapes for the resistance alleles blaTEM-50 and blaTEM-85, each of which\ndiffers from its ancestor blaTEM-1 by four mutations. We identified pathways\nthrough those landscapes where selection for increased resistance moved in a\nrepeating cycle among a limited set of alleles as antibiotics were alternated.\nOur results showed that susceptibility to antibiotics can be sustainably\nrenewed by cycling structurally similar antibiotics. We anticipate that these\nresults may provide a conceptual framework for managing antibiotic resistance.\nThis approach may also guide sustainable cycling of the drugs used to treat\nmalaria and HIV.\n", "versions": [{"version": "v1", "created": "Wed, 23 Jan 2013 21:53:45 GMT"}], "update_date": "2015-06-12", "authors_parsed": [["Goulart", "Christiane P.", ""], ["Mahmudi", "Mentar", ""], ["Crona", "Kristina A.", ""], ["Jacobs", "Stephen D.", ""], ["Kallmann", "Marcelo", ""], ["Hall", "Barry G.", ""], ["Greene", "Devin C.", ""], ["Barlow", "Miriam", ""]]}, {"id": "1301.5683", "submitter": "Burkhard Schipper", "authors": "Peter Duersch, Joerg Oechssler, Burkhard C. Schipper", "title": "When is tit-for-tat unbeatable?", "comments": "arXiv admin note: text overlap with arXiv:1003.4274", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We characterize the class of symmetric two-player games in which tit-for-tat\ncannot be beaten even by very sophisticated opponents in a repeated game. It\nturns out to be the class of exact potential games. More generally, there is a\nclass of simple imitation rules that includes tit-for-tat but also\nimitate-the-best and imitate-if-better. Every decision rule in this class is\nessentially unbeatable in exact potential games. Our results apply to many\ninteresting games including all symmetric 2x2 games, and standard examples of\nCournot duopoly, price competition, public goods games, common pool resource\ngames, and minimum effort coordination games.\n", "versions": [{"version": "v1", "created": "Thu, 24 Jan 2013 01:33:55 GMT"}], "update_date": "2013-01-25", "authors_parsed": [["Duersch", "Peter", ""], ["Oechssler", "Joerg", ""], ["Schipper", "Burkhard C.", ""]]}, {"id": "1301.5899", "submitter": "Stephen Tennenbaum", "authors": "Stephen Tennenbaum, Caroline Freitag, and Svetlana Roudenko", "title": "Modeling the Influence of Environment and Intervention on Cholera in\n  Haiti", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a simple model with two infective classes in order to model the\ncholera epidemic in Haiti. We include the impact of environmental events\n(rainfall, temperature and tidal range) on the epidemic in the Artibonite and\nOuest regions by introducing terms in the transmission rate that vary with\nenvironmental conditions. We fit the model on weekly data from the beginning of\nthe epidemic until December 2013, including the vaccination programs that were\nrecently undertaken in the Ouest and Artibonite regions. We then modified these\nprojections excluding vaccination to assess the programs' effectiveness. Using\nreal-time daily rainfall, we found lag times between precipitation events and\nnew cases that range from 3.4 to 8.4 weeks in Artibonite and 5.1 to 7.4 in\nOuest. In addition, it appears that, in the Ouest region, tidal influences play\na significant role in the dynamics of the disease. Intervention efforts of all\ntypes have reduced case numbers in both regions; however, persistent outbreaks\ncontinue. In Ouest, where the population at risk seems particularly besieged\nand the overall population is larger, vaccination efforts seem to be taking\nhold more slowly than in Artibonite, where a smaller core population was\nvaccinated. The models including the vaccination programs predicted that a year\nand six months later, the mean number of cases in Artibonite would be reduced\nby about two thousand cases, and in Ouest by twenty four hundred cases below\nthat predicted by the models without vaccination. We also found that\nvaccination is best when done in the early spring, and as early as possible in\nthe epidemic. Comparing vaccination between the first spring and the second,\nthere is a drop of about 40% in the case reduction due to the vaccine and about\n10% per year after that.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jan 2013 17:00:27 GMT"}, {"version": "v2", "created": "Sun, 21 Apr 2013 04:12:06 GMT"}, {"version": "v3", "created": "Fri, 7 Jun 2013 03:03:40 GMT"}, {"version": "v4", "created": "Thu, 13 Jun 2013 17:21:17 GMT"}, {"version": "v5", "created": "Tue, 16 Sep 2014 21:16:46 GMT"}], "update_date": "2014-09-18", "authors_parsed": [["Tennenbaum", "Stephen", ""], ["Freitag", "Caroline", ""], ["Roudenko", "Svetlana", ""]]}, {"id": "1301.5947", "submitter": "Dominik Wodarz", "authors": "Dominik Wodarz", "title": "Evolutionary Dynamics of Giant Viruses and their Virophages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Giant viruses contain large genomes, encode many proteins atypical for\nviruses, replicate in large viral factories, and tend to infect protists. The\ngiant virus replication factories can in turn be infected by so called\nvirophages, which are smaller viruses that negatively impact giant virus\nreplication. An example are Mimiviruses that infect the protist Acanthamoeba\nand that are themselves infected by the virophage Sputnik. This paper examines\nthe evolutionary dynamics of this system, using mathematical models. While the\nmodels suggest that the virophage population will evolve to increasing degrees\nof giant virus inhibition, it further suggests that this renders the virophage\npopulation prone to extinction due to dynamic instabilities over wide parameter\nranges. Implications and conditions required to avoid extinction are discussed.\nAnother interesting result is that virophage presence can fundamentally alter\nthe evolutionary course of the giant virus. While the giant virus is predicted\nto evolve towards increasing its basic reproductive ratio in the absence of the\nvirophage, the opposite is true its presence. Therefore, virophages can not\nonly benefit the host population directly by inhibiting the giant viruses, but\nalso indirectly by causing giant viruses to evolve towards weaker phenotypes.\nExperimental tests for this model are suggested.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jan 2013 02:02:57 GMT"}], "update_date": "2013-01-28", "authors_parsed": [["Wodarz", "Dominik", ""]]}, {"id": "1301.5992", "submitter": "Jose A. Cuesta", "authors": "Luis A. Martinez-Vaquero and Jos\\'e A. Cuesta", "title": "Evolutionary stability and resistance to cheating in an indirect\n  reciprocity model based on reputation", "comments": "9 pages, 2 figures, uses RevTeX4.1", "journal-ref": null, "doi": "10.1103/PhysRevE.87.052810", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Indirect reciprocity is one of the main mechanisms to explain the emergence\nand sustainment of altruism in societies. The standard approach to indirect\nreciprocity are reputation models. These are games in which players base their\ndecisions on their opponent's reputation gained in past interactions with other\nplayers (moral assessment). The combination of actions and moral assessment\nleads to a large diversity of strategies, thus determining the stability of any\nof them against invasions by all the others is a difficult task. We use a\nvariant of a previously introduced reputation-based model that let us\nsystematically analyze all these invasions and determine which ones are\nsuccessful. Accordingly we are able to identify the third-order strategies\n(those which, apart from the action, judge considering both the reputation of\nthe donor and that of the recipient) that are evolutionarily stable. Our\nresults reveal that if a strategy resists the invasion of any other one sharing\nits same moral assessment, it can resist the invasion of any other strategy.\nHowever, if actions are not always witnessed, cheaters (i.e., individuals with\na probability of defecting regardless of the opponent's reputation) have a\nchance to defeat the stable strategies for some choices of the probabilities of\ncheating and of being witnessed. Remarkably, by analyzing this issue with\nadaptive dynamics we find that whether a honest population resists the invasion\nof cheaters is determined by a Hamilton-like rule---with the probability that\nthe cheat is discovered playing the role of the relatedness parameter.\n", "versions": [{"version": "v1", "created": "Fri, 25 Jan 2013 09:09:58 GMT"}, {"version": "v2", "created": "Tue, 5 Feb 2013 13:54:27 GMT"}, {"version": "v3", "created": "Sat, 4 May 2013 17:11:32 GMT"}], "update_date": "2013-05-29", "authors_parsed": [["Martinez-Vaquero", "Luis A.", ""], ["Cuesta", "José A.", ""]]}, {"id": "1301.6237", "submitter": "Jerome Coville", "authors": "Jerome Coville (BIOSP), Frederic Fabre", "title": "Convergence to the Equilibrium in a Lotka-Volterra Ode Competition\n  System with Mutations", "comments": "Minor corrections", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.AP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we are investigating the long time behaviour of the solution of\na mutation competition model of Lotka-Volterra's type. Our main motivation\ncomes from the analysis of the Lotka-Volterra's competition system with\nmutation which simulates the demo-genetic dynamics of diverse virus in their\nhost : $$ \\frac{dv_{i}(t)}{dt}=v_i\\[r_i-\\frac{1}{K}\\Psi_i(v)\\]+\\sum_{j=1}^{N}\n\\mu_{ij}(v_j-v_i). $$ In a first part we analyse the case where the competition\nterms $\\Psi_i$ are independent of the virus type $i$. In this situation and\nunder some rather general assumptions on the functions $\\Psi_i$, the\ncoefficients $r_i$ and the mutation matrix $\\mu_{ij}$ we prove the existence of\na unique positive globally stable stationary solution i.e. the solution\nattracts the trajectory initiated from any nonnegative initial datum. Moreover\nthe unique steady state $\\bar v$ is strictly positive in the sense that $\\bar\nv_i>0$ for all $i$. These results are in sharp contrast with the behaviour of\nLotka-Volterra without mutation term where it is known that multiple non\nnegative stationary solutions exist and an exclusion principle occurs (i.e For\nall $i\\neq i_0, \\bar v_{i}=0$ and $\\bar v_{i_0}>0$). Then we explore a typical\nexample that has been proposed to explain some experimental data. For such\nparticular models we characterise the speed of convergence to the equilibrium.\nIn a second part, under some additional assumption, we prove the existence of a\npositive steady state for the full system and we analyse the long term\ndynamics. The proofs mainly rely on the construction of a relative entropy\nwhich plays the role of a Lyapunov functional.\n", "versions": [{"version": "v1", "created": "Sat, 26 Jan 2013 11:17:55 GMT"}, {"version": "v2", "created": "Thu, 7 Mar 2013 13:45:04 GMT"}], "update_date": "2013-03-08", "authors_parsed": [["Coville", "Jerome", "", "BIOSP"], ["Fabre", "Frederic", ""]]}, {"id": "1301.6375", "submitter": "Dervis Vural", "authors": "Dervis Can Vural, Greg Morrison, L. Mahadevan", "title": "Increased Network Interdependency Leads to Aging", "comments": "11 pages, 10 figures, Preprint", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although species longevity is subject to a diverse range of selective forces,\nthe mortality curves of a wide variety of organisms are rather similar. We\nargue that aging and its universal characteristics may have evolved by means of\na gradual increase in the systemic interdependence between a large collection\nof biochemical or mechanical components. Modeling the organism as a dependency\nnetwork which we create using a constructive evolutionary process, we age it by\nallowing nodes to be broken or repaired according to a probabilistic algorithm\nthat accounts for random failures/repairs and dependencies. Our simulations\nshow that the network slowly accumulates damage and then catastrophically\ncollapses. We use our simulations to fit experimental data for the time\ndependent mortality rates of a variety of multicellular organisms and even\ncomplex machines such as automobiles. Our study suggests that aging is an\nemergent finite-size effect in networks with dynamical dependencies and that\nthe qualitative and quantitative features of aging are not sensitively\ndependent on the details of system structure.\n", "versions": [{"version": "v1", "created": "Sun, 27 Jan 2013 16:58:31 GMT"}, {"version": "v2", "created": "Tue, 29 Jan 2013 16:57:31 GMT"}, {"version": "v3", "created": "Thu, 31 Jan 2013 14:15:07 GMT"}], "update_date": "2013-02-01", "authors_parsed": [["Vural", "Dervis Can", ""], ["Morrison", "Greg", ""], ["Mahadevan", "L.", ""]]}, {"id": "1301.6470", "submitter": "Mike Steel Prof.", "authors": "Elliott Sober and Mike Steel", "title": "Time and Knowability in Evolutionary Processes", "comments": "22 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Historical sciences like evolutionary biology reconstruct past events by\nusing the traces that the past has bequeathed to the present. The Markov Chain\nConvergence Theorem and the Data Processing Inequality describe how the mutual\ninformation between present and past is affected by how much time there is in\nbetween. These two results are very general; they pertain to any process, not\njust to the biological processes that occur in evolution. To study the\nspecifically biological question of how the present state of a lineage provides\ninformation about its evolutionary past, we use a Moran process framework and\nconsider how the kind of evolutionary process (drift, and selection of various\nkinds) at work in a lineage affects the epistemological relation of present to\npast.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2013 08:23:42 GMT"}, {"version": "v2", "created": "Fri, 1 Feb 2013 02:19:31 GMT"}], "update_date": "2013-02-04", "authors_parsed": [["Sober", "Elliott", ""], ["Steel", "Mike", ""]]}, {"id": "1301.6547", "submitter": "Peter Pfaffelhuber", "authors": "Franz Baumdicker, Peter Pfaffelhuber", "title": "The infinitely many genes model with horizontal gene transfer", "comments": "31 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The genome of bacterial species is much more flexible than that of\neukaryotes. Moreover, the distributed genome hypothesis for bacteria states\nthat the total number of genes present in a bacterial population is greater\nthan the genome of every single individual. The pangenome, i.e. the set of all\ngenes of a bacterial species (or a sample), comprises the core genes which are\npresent in all living individuals, and accessory genes, which are carried only\nby some individuals. In order to use accessory genes for adaptation to\nenvironmental forces, genes can be transferred horizontally between\nindividuals. Here, we extend the infinitely many genes model from Baumdicker,\nHess and Pfaffelhuber (2010) for horizontal gene transfer. We take a\ngenealogical view and give a construction -- called the Ancestral Gene Transfer\nGraph -- of the joint genealogy of all genes in the pangenome. As application,\nwe compute moments of several statistics (e.g. the number of differences\nbetween two individuals and the gene frequency spectrum) under the infinitely\nmany genes model with horizontal gene transfer.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2013 14:05:20 GMT"}, {"version": "v2", "created": "Thu, 20 Nov 2014 23:14:20 GMT"}], "update_date": "2014-11-24", "authors_parsed": [["Baumdicker", "Franz", ""], ["Pfaffelhuber", "Peter", ""]]}, {"id": "1301.6561", "submitter": "Alexey Mikaberidze", "authors": "Alexey Mikaberidze, Bruce A. McDonald, Sebastian Bonhoeffer", "title": "Can high risk fungicides be used in mixtures without selecting for\n  fungicide resistance?", "comments": "51 pages, 6 figures, accepted for publication in Phytopathology", "journal-ref": null, "doi": "10.1094/PHYTO-07-13-0204-R", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fungicide mixtures produced by the agrochemical industry often contain\nlow-risk fungicides, to which fungal pathogens are fully sensitive, together\nwith high-risk fungicides known to be prone to fungicide resistance. Can these\nmixtures provide adequate disease control while minimizing the risk for the\ndevelopment of resistance? We present a population dynamics model to address\nthis question. We found that the fitness cost of resistance is a crucial\nparameter to determine the outcome of competition between the sensitive and\nresistant pathogen strains and to assess the usefulness of a mixture. If\nfitness costs are absent, then the use of the high-risk fungicide in a mixture\nselects for resistance and the fungicide eventually becomes nonfunctional. If\nthere is a cost of resistance, then an optimal ratio of fungicides in the\nmixture can be found, at which selection for resistance is expected to vanish\nand the level of disease control can be optimized.\n", "versions": [{"version": "v1", "created": "Mon, 28 Jan 2013 14:42:46 GMT"}, {"version": "v2", "created": "Fri, 20 Sep 2013 08:59:21 GMT"}], "update_date": "2013-09-23", "authors_parsed": [["Mikaberidze", "Alexey", ""], ["McDonald", "Bruce A.", ""], ["Bonhoeffer", "Sebastian", ""]]}, {"id": "1301.6841", "submitter": "Michael Deem", "authors": "Jeong-Man Park and Michael W. Deem", "title": "On the Universality of the Energy Response Function in the Long-Range\n  Spin Glass Model with Sparse, Modular Couplings", "comments": "22 pages, 5 figures, calculation improved", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider energy relaxation of the long-range spin glass model with sparse\ncouplings, the so-called dilute Sherrington-Kirkpatrick (SK) model, starting\nfrom a random initial state. We consider the effect that modularity of the\ncoupling matrix has on this relaxation dynamics. In the absence of finite size\neffects, the relaxation dynamics appears independent of modularity. For finite\nsizes, a more modular system reaches a less favorable energy at long times. For\nsmall sizes, a more modular system also has a less favorable energy at short\ntimes. For large sizes, modularity appears to lead to slightly more favorable\nenergies at intermediate times. We discuss these results in the context of\nevolutionary theory, where horizontal gene transfer, absent in the Glauber\nequilibration dynamics of the SK model studied here, endows modular organisms\nwith larger response functions at short times.\n", "versions": [{"version": "v1", "created": "Tue, 29 Jan 2013 06:48:51 GMT"}, {"version": "v2", "created": "Sun, 25 Aug 2013 17:36:23 GMT"}, {"version": "v3", "created": "Mon, 20 Jan 2014 20:17:06 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Park", "Jeong-Man", ""], ["Deem", "Michael W.", ""]]}, {"id": "1301.7277", "submitter": "Samuel Ocko", "authors": "Samuel A. Ocko, L. Mahadevan", "title": "Collective thermoregulation in bee clusters", "comments": "19 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Swarming is an essential part of honeybee behaviour, wherein thousands of\nbees cling onto each other to form a dense cluster that may be exposed to the\nenvironment for several days. This cluster has the ability to maintain its core\ntemperature actively without a central controller, and raises the question of\nhow this is achieved. We suggest that the swarm cluster is akin to an active\nporous structure whose functional requirement is to adjust to outside\nconditions by varying its porosity to control its core temperature. Using a\ncontinuum model that takes the form of a set of advection-diffusion equations\nfor heat transfer in a mobile porous medium, we show that the equalization of\nan effective \"behavioural pressure\", which propagates information about the\nambient temperature through variations in density, leads to effective\nthermoregulation. Our model extends and generalizes previous models by focusing\nthe question of mechanism on the form and role of the behavioural pressure, and\nallows us to explain the vertical asymmetry of the cluster (as a consequence of\nbuoyancy driven flows), the ability of the cluster to overpack at low ambient\ntemperatures without breaking up at high ambient temperatures, and the relative\ninsensitivity to large variations in the ambient temperature. Finally, our\ntheory makes testable hypotheses for how the cluster bee density should respond\nto externally imposed temperature inhomogeneities, and suggests strategies for\nbiomimetic thermoregulation.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2013 16:32:05 GMT"}, {"version": "v2", "created": "Wed, 6 Nov 2013 20:05:59 GMT"}], "update_date": "2013-11-07", "authors_parsed": [["Ocko", "Samuel A.", ""], ["Mahadevan", "L.", ""]]}, {"id": "1301.7332", "submitter": "Dominik Wodarz", "authors": "Dominik Wodarz and Natalia L. Komarova", "title": "Calculating effective gun policies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Following recent shootings in the USA, a debate has erupted, one side\nfavoring stricter gun control, the other promoting protection through more\nweapons. We provide a scientific foundation to inform this debate, based on\nmathematical, epidemiological models that quantify the dependence of\nfirearm-related death rates of people on gun policies. We assume a shooter\nattacking a single individual or a crowd. Two strategies can minimize deaths in\nthe model, depending on parameters: either a ban of private firearms\npossession, or a policy allowing the general population to carry guns. In\nparticular, the outcome depends on the fraction of offenders that illegally\npossess a gun, on the degree of protection provided by gun ownership, and on\nthe fraction of the population who take up their right to own a gun and carry\nit with them when attacked, parameters that can be estimated from statistical\ndata. With the measured parameters, the model suggests that if the gun law is\nenforced at a level similar to that in the United Kingdom, gun-related deaths\nare minimized if private possession of firearms is banned. If such a policy is\nnot practical or possible due to constitutional or cultural constraints, the\nmodel and parameter estimation indicate that a partial reduction in firearm\navailability can lead to a reduction in gun-induced death rates, even if they\nare not minimized. Most importantly, our analysis identifies the crucial\nparameters that determine which policy reduces the death rates, providing\nguidance for future statistical studies that will be necessary for more refined\nquantitative predictions.\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2013 19:19:11 GMT"}, {"version": "v2", "created": "Fri, 1 Feb 2013 00:07:38 GMT"}, {"version": "v3", "created": "Mon, 11 Feb 2013 18:04:26 GMT"}], "update_date": "2013-02-12", "authors_parsed": [["Wodarz", "Dominik", ""], ["Komarova", "Natalia L.", ""]]}, {"id": "1301.7334", "submitter": "Alessandro Riga", "authors": "Alessandro Riga and Maria Giovanna Belcastro and Jacopo Moggi-Cecchi", "title": "Environmental Influence on Dental Morphology", "comments": "21 pages, 4 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Development is a complex phenomenon where the forming phenotype interacts\nwith genetic and environmental inputs. Teeth are an important model for\ndevelopmental studies and their development has been thoroughly investigated.\nHowever, despite of a large literature on the genetics of dental development,\nno studies have focused yet on the environmental influences on dental\nmorphology. Here, we aim to test whether and to what extent the environment\nplays a role in producing morphological variation in human teeth. We selected a\nsample of modern human skulls and we used dental enamel hypoplasia as an\nenvironmental stress marker in order to identify two groups with different\nstress level, referred to as SG (\"stressed\" group) and NSG (\"non-stressed\"\ngroup). We collected data on the occurrence and the relative development of 15\nmorphological traits (5 for each molar) on upper molars using a standard\nmethodology commonly used in dental anthropology (ASU-DAS system) and then we\ncompared the frequencies of the traits in the two groups. Overall, the results\nsuggest that: (i) stressors like malnutrition and/or systemic diseases have a\nsignificant effect on upper molar morphology; (ii) stress generates a\ndevelopmental response which increases the morphological variability of the SG;\n(iii) the increase of variability is directional, since individuals belonging\nto the SG have increased cusps dimensions and number. These results are\nconsistent with the expectations of the morphodynamic model of dental\ndevelopment (Jernvall, 1995).\n", "versions": [{"version": "v1", "created": "Wed, 30 Jan 2013 19:20:42 GMT"}, {"version": "v2", "created": "Fri, 8 Mar 2013 17:34:30 GMT"}], "update_date": "2013-03-11", "authors_parsed": [["Riga", "Alessandro", ""], ["Belcastro", "Maria Giovanna", ""], ["Moggi-Cecchi", "Jacopo", ""]]}, {"id": "1301.7682", "submitter": "Anatolij Gelimson", "authors": "Anatolij Gelimson, Jonas Cremer, Erwin Frey", "title": "Mobility, fitness collection, and the breakdown of cooperation", "comments": "9 pages, 6 figures", "journal-ref": "Phys. Rev. E 87 (2013) 042711", "doi": "10.1103/PhysRevE.87.042711", "report-no": null, "categories": "q-bio.PE physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The spatial arrangement of individuals is thought to overcome the dilemma of\ncooperation: When cooperators engage in clusters they might share the benefit\nof cooperation while being more protected against non-cooperating individuals,\nwhich benefit from cooperation but save the cost of cooperation. This is\nparadigmatically shown by the spatial prisoner's dilemma model. Here, we study\nthis model in one and two spatial dimensions, but explicitly take into account\nthat in biological setups fitness collection and selection are separated\nprocesses occurring mostly on vastly different time scales. This separation is\nparticularly important to understand the impact of mobility on the evolution of\ncooperation. We find that even small diffusive mobility strongly restricts\ncooperation since it enables non-cooperative individuals to invade cooperative\nclusters. Thus, in most biological scenarios, where the mobility of competing\nindividuals is an irrefutable fact, the spatial prisoner's dilemma alone cannot\nexplain stable cooperation but additional mechanisms are necessary for spatial\nstructure to promote the evolution of cooperation. The breakdown of cooperation\nis analyzed in detail. We confirm the existence of a phase transition, here\ncontrolled by mobility and costs, which distinguishes between purely\ncooperative and non-cooperative absorbing states. While in one dimension the\nmodel is in the class of the Voter Model, it belongs to the Directed\nPercolation (DP) universality class in two dimensions.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2013 16:58:40 GMT"}, {"version": "v2", "created": "Fri, 1 Feb 2013 09:33:06 GMT"}, {"version": "v3", "created": "Tue, 16 Apr 2013 21:25:13 GMT"}], "update_date": "2013-04-18", "authors_parsed": [["Gelimson", "Anatolij", ""], ["Cremer", "Jonas", ""], ["Frey", "Erwin", ""]]}, {"id": "1301.7697", "submitter": "George Constable", "authors": "George W A Constable, Alan J McKane and Tim Rogers", "title": "Stochastic dynamics on slow manifolds", "comments": "21 pages, 4 figures", "journal-ref": "J. Phys. A: Math. Theor. 46 (2013) 295002", "doi": "10.1088/1751-8113/46/29/295002", "report-no": null, "categories": "cond-mat.stat-mech nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The theory of slow manifolds is an important tool in the study of\ndeterministic dynamical systems, giving a practical method by which to reduce\nthe number of relevant degrees of freedom in a model, thereby often resulting\nin a considerable simplification. In this article we demonstrate how the same\nbasic methodology may also be applied to stochastic dynamical systems, by\nexamining the behaviour of trajectories conditioned on the event that they do\nnot depart the slow manifold. We apply the method to two models: one from\necology and one from epidemiology, achieving a reduction in model dimension and\nillustrating the high quality of the analytical approximations.\n", "versions": [{"version": "v1", "created": "Thu, 31 Jan 2013 17:29:36 GMT"}, {"version": "v2", "created": "Fri, 28 Jun 2013 09:47:17 GMT"}], "update_date": "2013-07-01", "authors_parsed": [["Constable", "George W A", ""], ["McKane", "Alan J", ""], ["Rogers", "Tim", ""]]}]