[{"id": "1304.0118", "submitter": "David Kleinhans", "authors": "Lisa Sundqvist, Kevin Keenan, Martin Zackrisson, Paulo Prod\\\"ohl, and\n  David Kleinhans", "title": "Directional genetic differentiation and asymmetric migration", "comments": "25 pages, 8 (+3) figures, 1 table", "journal-ref": "Ecology and Evolution 6(11), pages 3461-3475, 2016", "doi": "10.1002/ece3.2096", "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the population structure and patterns of gene flow within\nspecies is of fundamental importance to the study of evolution. In the fields\nof population and evolutionary genetics, measures of genetic differentiation\nare commonly used to gather this information. One potential caveat is that\nthese measures assume gene flow to be symmetric. However, asymmetric gene flow\nis common in nature, especially in systems driven by physical processes such as\nwind or water currents. Since information about levels of asymmetric gene flow\namong populations is essential for the correct interpretation of the\ndistribution of contemporary genetic diversity within species, this should not\nbe overlooked. To obtain information on asymmetric migration patterns from\ngenetic data, complex models based on maximum likelihood or Bayesian approaches\ngenerally need to be employed, often at great computational cost. Here, a new\nsimpler and more efficient approach for understanding gene flow patterns is\npresented. This approach allows the estimation of directional components of\ngenetic divergence between pairs of populations at low computational effort,\nusing any of the classical or modern measures of genetic differentiation. These\ndirectional measures of genetic differentiation can further be used to\ncalculate directional relative migration and to detect asymmetries in gene flow\npatterns. This can be done in a user-friendly web application called\ndivMigrate-online introduced in this paper. Using simulated data sets with\nknown gene flow regimes, we demonstrate that the method is capable of resolving\ncomplex migration patterns under a range of study designs.\n", "versions": [{"version": "v1", "created": "Sat, 30 Mar 2013 15:30:17 GMT"}, {"version": "v2", "created": "Mon, 19 Aug 2013 04:52:02 GMT"}, {"version": "v3", "created": "Mon, 26 Sep 2016 13:56:51 GMT"}], "update_date": "2016-09-27", "authors_parsed": [["Sundqvist", "Lisa", ""], ["Keenan", "Kevin", ""], ["Zackrisson", "Martin", ""], ["Prodöhl", "Paulo", ""], ["Kleinhans", "David", ""]]}, {"id": "1304.0132", "submitter": "Shampa Ghosh", "authors": "Shampa M. Ghosh, Nicholas D. Testa, Alexander W. Shingleton", "title": "Temperature Size Rule is mediated by thermal plasticity of critical size\n  in Drosophila melanogaster", "comments": "Accepted in Proceedings of Royal Society B: Biological Sciences", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most ectotherms show an inverse relationship between developmental\ntemperature and body size, a phenomenon known as the temperature size rule\n(TSR). Several competing hypotheses have been proposed to explain its\noccurrence. According to one set of views, the TSR results from inevitable\nbiophysical effects of temperature on the rates of growth and differentiation,\nwhereas other views suggest the TSR is an adaptation that can be achieved by a\ndiversity of mechanisms in different taxa. Our data reveal that the fruit fly,\nDrosophila melanogaster, obeys the TSR using a novel mechanism: reduction of\ncritical size at higher temperatures. In holometabolous insects, attainment of\ncritical size initiates the hormonal cascade that terminates growth, and hence,\nDrosophila larvae appear to instigate the signal to stop growth at a smaller\nsize at higher temperatures. This is in contrast to findings from another\nholometabolous insect, Manduca sexta, in which the TSR results from the effect\nof temperature on the rate and duration of growth. This contrast suggests that\nthere is no single mechanism that accounts for the TSR. Instead, the TSR\nappears to be an adaptation that is achieved at a proximate level through\ndifferent mechanisms in different taxa.\n", "versions": [{"version": "v1", "created": "Sat, 30 Mar 2013 19:43:20 GMT"}], "update_date": "2013-04-02", "authors_parsed": [["Ghosh", "Shampa M.", ""], ["Testa", "Nicholas D.", ""], ["Shingleton", "Alexander W.", ""]]}, {"id": "1304.0632", "submitter": "Chiara Poletto Miss", "authors": "Andrea Apolloni, Chiara Poletto, Vittoria Colizza", "title": "Age-specific contacts and travel patterns in the spatial spread of 2009\n  H1N1 influenza pandemic", "comments": "40 pages, 7 figures", "journal-ref": "BMC Infectious Diseases 2013, 13:176", "doi": "10.1186/1471-2334-13-176", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Confirmed cases during the early stage of the 2009 H1N1 pdm in various\ncountries showed an age shift between importations and local transmission\ncases, with adults mainly responsible for seeding unaffected regions and\nchildren most frequently driving community outbreaks. We introduce a multi-host\nstochastic metapopulation model with two age classes to analytically address\nthe role of a heterogeneously mixing population and its associated\nnon-homogeneous travel behaviors on the risk of a major epidemic. We inform the\nmodel with statistics on demography, mixing and travel behavior for Europe and\nMexico, and calibrate it to the 2009 H1N1 pdm early outbreak. We varied model\nparameters to explore the invasion conditions under different scenarios. We\nderive the expression for the global invasion potential of the epidemic that\ndepends on disease transmissibility, transportation network and mobility\nfeatures, demographic profile and mixing pattern. Highly assortative mixing\nfavor the spatial containment of the epidemic, this effect being contrasted by\nan increase in the social activity of adults vs. children. Heterogeneity of the\nmobility network topology and traffic flows strongly favor the disease\ninvasion, as also a larger fraction of children traveling. Variations in the\ndemography and mixing habits across countries lead to heterogeneous outbreak\nsituations. Results are compatible with the H1N1 spatial spread observed. The\nwork illustrates the importance of age-dependent mixing profiles and mobility\nfeatures in the study of the conditions for the spatial invasion of an emerging\ninfluenza pandemic. Its results allow the immediate assessment of the risk of a\nmajor epidemic for a specific scenario upon availability of data, and the\nevaluation of the effectiveness of public health interventions targeting\nspecific age groups, their interactions and mobility behaviors.\n", "versions": [{"version": "v1", "created": "Tue, 2 Apr 2013 13:56:06 GMT"}], "update_date": "2013-04-18", "authors_parsed": [["Apolloni", "Andrea", ""], ["Poletto", "Chiara", ""], ["Colizza", "Vittoria", ""]]}, {"id": "1304.0965", "submitter": "Claudio Borile", "authors": "Claudio Borile, Amos Maritan, Miguel A. Mu\\~noz", "title": "The effect of quenched disorder in neutral theories", "comments": "20 pages, 5 figures, to appear in JSTAT", "journal-ref": "Journal of Statistical Mechanics: Theory and Experiment 2013 (04),\n  P04032", "doi": "10.1088/1742-5468/2013/04/P04032", "report-no": null, "categories": "cond-mat.stat-mech cond-mat.dis-nn q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study systems with two symmetric absorbing states, such as the voter model\nand variations of it, which have been broadly used as minimal neutral models in\ngenetics, population ecology, sociology, etc. We analyze the effects of a key\ningredient ineluctably present in most real applications: random-field-like\nquenched disorder. In accord with simulations and previous findings,\ncoexistence between the two competing states/opinions turns out to be strongly\nfavored by disorder in the standard voter model; actually, a disorder-induced\nphase transition is generated for any finite system size in the presence of an\narbitrary small spontaneous-inversion rate (preventing absorbing states from\nbeing stable). For non-linear versions of the voter model a general theory (by\nAlHammal et al.) explains that the spontaneous breaking of the up/down symmetry\nand an absorbing state phase transition can occur either together or\nseparately, giving raise to two different scenarios. Here, we show that he\npresence of quenched disorder in non-linear voter models does not allow the\nseparation of the up-down (Ising-like) symmetry breaking from the\nactive-to-absorbing phase transition in low-dimensional systems: both phenomena\ncan occur only simultaneously, as a consequence of the well-known Imry-Ma\nargument generalized to these non-equilibrium problems. When the two phenomena\noccur at unison, resulting into a genuinely non-equilibrium (\"Generalized\nVoter\") transition, the Imry-Ma argument is violated and the symmetry can be\nspontaneously broken even in low dimensions.\n", "versions": [{"version": "v1", "created": "Wed, 3 Apr 2013 14:23:03 GMT"}], "update_date": "2013-06-28", "authors_parsed": [["Borile", "Claudio", ""], ["Maritan", "Amos", ""], ["Muñoz", "Miguel A.", ""]]}, {"id": "1304.1164", "submitter": "Nikolay Vitanov k", "authors": "Nikolay K. Vitanov, Zlatinka I. Dimitrova, Kaloyan N. Vitanov", "title": "Waves and distributions connected to systems of interacting populations", "comments": "28 pages, 4 figurea", "journal-ref": null, "doi": null, "report-no": null, "categories": "math-ph math.MP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss two cases that can be connected to the dynamics of interacting\npopulations: (I.) density waves for the case or negligible random fluctuations\nof the populations densities, and (II.) probability distributions connected to\nthe model equations for of spatially averaged populations densities for the\ncase of significant random fluctuations of the independent quantity that can be\nassociated with the population density. For the case (I.) we consider model\nequations containing polynomial nonlinearities. Such nonlinearities can arise\nas a consequence of interaction among the populations (for the case of large\npopulation densities) or as a result of a Taylor series expansion (for the case\nof small density of interacting populations). In the both cases we can apply\nthe modified method of simplest equation to obtain exact traveling-wave\nsolutions connected to migration of population members. Such solutions are\nobtained for systems consisting of 1 or 3 populations respectively. For the\ncase (II.) we discuss model equations of the Fokker-Planck kind for the\nevolution of the statistical distributions of population densities. We derive\nseveral stationary distributions for the population density and calculate the\nexpected exit time connected to the extinction of the studied population.\n", "versions": [{"version": "v1", "created": "Tue, 2 Apr 2013 17:15:46 GMT"}], "update_date": "2013-04-05", "authors_parsed": [["Vitanov", "Nikolay K.", ""], ["Dimitrova", "Zlatinka I.", ""], ["Vitanov", "Kaloyan N.", ""]]}, {"id": "1304.1409", "submitter": "Maxim Koroteev", "authors": "M.V. Koroteev, J. Miller", "title": "Fragmentation dynamics of DNA sequence duplications", "comments": "5 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math-ph math.MP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by empirical observations of algebraic duplicated sequence length\ndistributions in a broad range of natural genomes, we analytically formulate\nand solve a class of simple discrete duplication/substitution models that\ngenerate steady-states sharing this property. Continuum equations are derived\nfor arbitrary time-independent duplication length source distribution, a limit\nthat we show can be mapped directly onto certain fragmentation models that have\nbeen intensively studied by physicists in recent years. Quantitative agreement\nwith simulation is demonstrated. These models account for the algebraic form\nand exponent of naturally occuring duplication length distributions without the\nneed for fine-tuning of parameters.\n", "versions": [{"version": "v1", "created": "Thu, 4 Apr 2013 15:49:31 GMT"}, {"version": "v2", "created": "Mon, 28 Oct 2013 03:29:03 GMT"}, {"version": "v3", "created": "Tue, 29 Oct 2013 01:34:47 GMT"}], "update_date": "2013-10-30", "authors_parsed": [["Koroteev", "M. V.", ""], ["Miller", "J.", ""]]}, {"id": "1304.1437", "submitter": "Wojciech Ganczarek", "authors": "Wojciech Ganczarek", "title": "Tenement house model", "comments": "8 pages, 8 figures", "journal-ref": "Central European Journal of Physics 11 (12) 1662 (2013)", "doi": "10.2478/s11534-012-0154-4", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most of the common used models of epidemic spreading allow contaminating many\nneighbors of a particular node in the network. They are usually analyzed by\ndifferential equations on probability vectors. We propose a model of epidemic\nspreading, which restricts to at most one contamination per time step and\nanalyze it by discrete approach, working on vectors of possible states of the\nsystem. Theoretical predictions of epidemic treshold, stationary state and time\nneeded to reach it are given and appear to be perfectly consistent with\ncomputer simulations. We also point ou that the model appears to be well suited\nto mimic epidemic spreading within student communes.\n", "versions": [{"version": "v1", "created": "Thu, 4 Apr 2013 17:23:00 GMT"}, {"version": "v2", "created": "Mon, 22 Apr 2013 10:22:47 GMT"}], "update_date": "2018-02-14", "authors_parsed": [["Ganczarek", "Wojciech", ""]]}, {"id": "1304.1601", "submitter": "Su Do Yi", "authors": "Su Do Yi, Beom Jun Kim, and Petter Minnhagen", "title": "Allometric Exponent and Randomness", "comments": "10 pages, 3 figures", "journal-ref": "2013 New J. Phys. 15 043001", "doi": "10.1088/1367-2630/15/4/043001", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An allometric height-mass exponent $\\gamma$ gives an approximative power-law\nrelation $< M> \\propto H^\\gamma$ between the average mass $< M>$ and the height\n$H$, for a sample of individuals. The individuals in the present study are\nhumans but could be any biological organism. The sampling can be for a specific\nage of the individuals or for an age-interval. The body-mass index (BMI) is\noften used for practical purposes when characterizing humans and it is based on\nthe allometric exponent $\\gamma=2$. It is here shown that the actual value of\n$\\gamma$ is to large extent determined by the degree of correlation between\nmass and height within the sample studied: no correlation between mass and\nheight means $\\gamma=0$, whereas if there was a precise relation between mass\nand height such that all individuals had the same shape and density then\n$\\gamma=3$. The connection is demonstrated by showing that the value of\n$\\gamma$ can be obtained directly from three numbers characterizing the spreads\nof the relevant random Gaussian statistical distributions: the spread of the\nheight and mass distributions together with the spread of the mass distribution\nfor the average height. Possible implications for allometric relations in\ngeneral are discussed.\n", "versions": [{"version": "v1", "created": "Fri, 5 Apr 2013 02:39:58 GMT"}], "update_date": "2013-04-08", "authors_parsed": [["Yi", "Su Do", ""], ["Kim", "Beom Jun", ""], ["Minnhagen", "Petter", ""]]}, {"id": "1304.1746", "submitter": "Thomas Grund", "authors": "Thomas Grund, Christian Waloszek, Dirk Helbing", "title": "How Natural Selection Can Create Both Self- and Other-Regarding\n  Preferences, and Networked Minds", "comments": null, "journal-ref": "Scientific Reports, 2013, 3, 1480", "doi": "10.1038/srep01480", "report-no": null, "categories": "physics.soc-ph nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Biological competition is widely believed to result in the evolution of\nselfish preferences. The related concept of the `homo economicus' is at the\ncore of mainstream economics. However, there is also experimental and empirical\nevidence for other-regarding preferences. Here we present a theory that\nexplains both, self-regarding and other-regarding preferences. Assuming\nconditions promoting non-cooperative behaviour, we demonstrate that\nintergenerational migration determines whether evolutionary competition results\nin a `homo economicus' (showing self-regarding preferences) or a `homo\nsocialis' (having other-regarding preferences). Our model assumes spatially\ninteracting agents playing prisoner's dilemmas, who inherit a trait determining\n`friendliness', but mutations tend to undermine it. Reproduction is ruled by\nfitness-based selection without a cultural modification of reproduction rates.\nOur model calls for a complementary economic theory for `networked minds' (the\n`homo socialis') and lays the foundations for an evolutionarily grounded theory\nof other-regarding agents, explaining individually different utility functions\nas well as conditional cooperation.\n", "versions": [{"version": "v1", "created": "Fri, 5 Apr 2013 15:34:13 GMT"}], "update_date": "2013-04-08", "authors_parsed": [["Grund", "Thomas", ""], ["Waloszek", "Christian", ""], ["Helbing", "Dirk", ""]]}, {"id": "1304.1816", "submitter": "Leah B. Shaw", "authors": "Maxim S. Shkarayev and Leah B. Shaw", "title": "Asymptotically inspired moment-closure approximation for adaptive\n  networks", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevE.88.052804", "report-no": null, "categories": "cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adaptive social networks, in which nodes and network structure co-evolve, are\noften described using a mean-field system of equations for the density of node\nand link types. These equations constitute an open system due to dependence on\nhigher order topological structures. We propose a new approach to moment\nclosure based on the analytical description of the system in an asymptotic\nregime. We apply the proposed approach to two examples of adaptive networks:\nrecruitment to a cause model and adaptive epidemic model. We show a good\nagreement between the improved mean-field prediction and simulations of the\nfull network system.\n", "versions": [{"version": "v1", "created": "Fri, 5 Apr 2013 20:27:39 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Shkarayev", "Maxim S.", ""], ["Shaw", "Leah B.", ""]]}, {"id": "1304.1834", "submitter": "Yongtao  Guan", "authors": "Yongtao Guan", "title": "Detecting the structure of haplotypes, local ancestry and excessive\n  local European ancestry in Mexicans", "comments": "28 pages, 12 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a two-layer hidden Markov model to detect structure of haplotypes\nfor unrelated individuals. This allows modeling two scales of linkage\ndisequilibrium (one within a group of haplotypes and one between groups),\nthereby taking advantage of rich haplotype information to infer local ancestry\nfor admixed individuals. Our method outperforms competing state-of-art methods,\nparticularly for regions of small ancestral track lengths. Applying our method\nto Mexican samples in HapMap3, we found five coding regions, ranging from $0.3\n-1.3$ megabase (Mb) in lengths, that exhibit excessive European ancestry\n(average dosage > 1.6). A particular interesting region of 1.1Mb (with average\ndosage 1.95) locates on Chromosome 2p23 that harbors two genes, PXDN and MYT1L,\nboth of which are associated with autism and schizophrenia. In light of the low\nprevalence of autism in Hispanics, this region warrants special attention. We\nconfirmed our findings using Mexican samples from the 1000 genomes project. A\nsoftware package implementing methods described in the paper is freely\navailable at \\url{http://bcm.edu/cnrc/mcmcmc}\n", "versions": [{"version": "v1", "created": "Fri, 5 Apr 2013 23:24:42 GMT"}], "update_date": "2013-04-09", "authors_parsed": [["Guan", "Yongtao", ""]]}, {"id": "1304.1844", "submitter": "James Lee", "authors": "James J. Lee and Carson C. Chow", "title": "The causal meaning of Fisher's average effect", "comments": null, "journal-ref": "Genetics Research 92 (2013) 89-109", "doi": "10.1017/S0016672313000074", "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  In order to formulate the Fundamental Theorem of Natural Selection, Fisher\ndefined the average excess and average effect of a gene substitution. Finding\nthese notions to be somewhat opaque, some authors have recommended\nreformulating Fisher's ideas in terms of covariance and regression, which are\nclassical concepts of statistics. We argue that Fisher intended his two\naverages to express a distinction between correlation and causation. On this\nview the average effect is a specific weighted average of the actual phenotypic\nchanges that result from physically changing the allelic states of homologous\ngenes. We show that the statistical and causal conceptions of the average\neffect, perceived as inconsistent by Falconer, can be reconciled if certain\nrelationships between the genotype frequencies and non-additive residuals are\nconserved. There are certain theory-internal considerations favoring Fisher's\noriginal formulation in terms of causality; for example, the frequency-weighted\nmean of the average effects equaling zero at each locus becomes a derivable\nconsequence rather than an arbitrary constraint. More broadly, Fisher's\ndistinction between correlation and causation is of critical importance to\ngene-trait mapping studies and the foundations of evolutionary biology.\n", "versions": [{"version": "v1", "created": "Sat, 6 Apr 2013 02:42:08 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Lee", "James J.", ""], ["Chow", "Carson C.", ""]]}, {"id": "1304.1862", "submitter": "Sebastian Schreiber", "authors": "Gregory Roth and Sebastian J. Schreiber", "title": "Persistence in fluctuating environments for interacting structured\n  populations", "comments": "41 pages, 3 figures; Accepted for publication in Journal of\n  Mathematical Biology", "journal-ref": "Journal of Mathematical Biology November 2014, Volume 69, Issue 5,\n  pp 1267-1317", "doi": "10.1007/s00285-013-0739-6", "report-no": null, "categories": "q-bio.PE math.DS math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Individuals within any species exhibit differences in size, developmental\nstate, or spatial location. These differences coupled with environmental\nfluctuations in demographic rates can have subtle effects on population\npersistence and species coexistence. To understand these effects, we provide a\ngeneral theory for coexistence of structured, interacting species living in a\nstochastic environment. The theory is applicable to nonlinear, multi species\nmatrix models with stochastically varying parameters. The theory relies on\nlong-term growth rates of species corresponding to the dominant Lyapunov\nexponents of random matrix products. Our coexistence criterion requires that a\nconvex combination of these long-term growth rates is positive with probability\none whenever one or more species are at low density. When this condition holds,\nthe community is stochastically persistent: the fraction of time that a species\ndensity goes below $\\delta>0$ approaches zero as $\\delta$ approaches zero.\nApplications to predator-prey interactions in an autocorrelated environment, a\nstochastic LPA model, and spatial lottery models are provided. These\napplications demonstrate that positive autocorrelations in temporal\nfluctuations can disrupt predator-prey coexistence, fluctuations in\nlog-fecundity can facilitate persistence in structured populations, and\nlong-lived, relatively sedentary competing populations are likely to coexist in\nspatially and temporally heterogenous environments.\n", "versions": [{"version": "v1", "created": "Sat, 6 Apr 2013 07:32:18 GMT"}, {"version": "v2", "created": "Sat, 2 Nov 2013 01:46:55 GMT"}], "update_date": "2015-12-16", "authors_parsed": [["Roth", "Gregory", ""], ["Schreiber", "Sebastian J.", ""]]}, {"id": "1304.1985", "submitter": "Jiankui He", "authors": "Jiankui He, Luwen Ning, Yin Tong", "title": "Origins and evolutionary genomics of the novel 2013 avian-origin H7N9\n  influenza A virus in China: Early findings", "comments": "8 pages, 5 figures, 2 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In March and early April 2013, a new avian-origin influenza A (H7N9) virus\n(A-OIV) emerged in the eastern China. During the first week of April, the 18\ninfection cases have been confirmed and 6 people have died since March. This\nvirus has caused global concern as a potential pandemic threat. Here we use\nevolutionary analysis to reconstruct the origins and early development of the\nA-OIV viruses. We found that A-OIV was derived from a reassortment of three\navian flu virus strains, and substantial mutations have been detected. Our\nresults highlight the need for systematic surveillance of influenza in birds,\nand provide evidence that the mixing of new genetic elements in avian can\nresult in the emergence of viruses with pandemic potential in humans.\n", "versions": [{"version": "v1", "created": "Sun, 7 Apr 2013 11:42:46 GMT"}, {"version": "v2", "created": "Tue, 9 Apr 2013 13:31:28 GMT"}], "update_date": "2013-04-10", "authors_parsed": [["He", "Jiankui", ""], ["Ning", "Luwen", ""], ["Tong", "Yin", ""]]}, {"id": "1304.2174", "submitter": "Alessandro Fontana", "authors": "Alessandro Fontana", "title": "Epigenetic Tracking: a Model for Multicellular Biology", "comments": "20 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Epigenetic Tracking is a mathematical model of biological cells, originally\nconceived to study embryonic development. Computer simulations proved the\ncapacity of the model to generate complex 3-dimensional cellular structures,\nand the potential to reproduce the complexity typical of living beings. The\nmost distinctive feature of this model is the presence in the body of a\nhomogeneous distribution of stem cells, which are dinamically and continuously\ncreated during development from non-stem cells and reside in niches. Embryonic\nstem cells orchestrate early developmental events, adult stem cells direct late\ndevelopmental and regeneration events, ageing stem cells cause ageing and\ncancer stem cells are responsible for cancer growth. The conceptual backbone\nprovided by Epigenetic Tracking brings together a wide range of biological\nphenomena: for this reason, we think it can be proposed as a general model for\nmulticellular biology. Despite, or perhaps due to its theoretical origin, the\nmodel allowed us to make predictions relevant to very diverse fields of\nbiology, such as transposable elements, and cancer-related patterns of gene\nmutations. This paper contains a summary of the model and its implications.\n", "versions": [{"version": "v1", "created": "Mon, 8 Apr 2013 11:51:56 GMT"}, {"version": "v2", "created": "Tue, 10 Sep 2013 11:39:53 GMT"}, {"version": "v3", "created": "Sun, 2 Nov 2014 16:52:12 GMT"}, {"version": "v4", "created": "Sat, 4 Jul 2015 13:53:46 GMT"}], "update_date": "2015-07-07", "authors_parsed": [["Fontana", "Alessandro", ""]]}, {"id": "1304.2289", "submitter": "Thierry Mora", "authors": "Thierry Mora and Aleksandra M. Walczak", "title": "The effect of phenotypic selection on stochastic gene expression", "comments": null, "journal-ref": "J. Phys. Chem. B 117(42) 13194-13205 (2013)", "doi": "10.1021/jp403231f", "report-no": null, "categories": "q-bio.MN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Genetically identical cells in the same population can take on phenotypically\nvariable states, leading to differentiated responses to external signals, such\nas nutrients and drug-induced stress. Many models and experiments have focused\non a description based on discrete phenotypic states. Here we consider the\neffects of selection acting on a single trait, which we explicitly link to the\nvariable number of proteins expressed by a gene. Considering different\nregulatory models for the gene under selection, we calculate the steady-state\ndistribution of expression levels and show how the population adapts its\nexpression to enhance its fitness. We quantitatively relate the overall fitness\nof the population to the heritability of expression levels, and their diversity\nwithin the population. We show how selection can increase or decrease the\nvariability in the population, alter the stability of bimodal states, and\nimpact the switching rates between metastable attractors.\n", "versions": [{"version": "v1", "created": "Mon, 8 Apr 2013 18:16:50 GMT"}, {"version": "v2", "created": "Mon, 24 Jun 2013 20:33:49 GMT"}], "update_date": "2015-04-28", "authors_parsed": [["Mora", "Thierry", ""], ["Walczak", "Aleksandra M.", ""]]}, {"id": "1304.2301", "submitter": "Luis Jover", "authors": "Luis F. Jover, Michael H. Cortez, Joshua S. Weitz", "title": "Mechanisms of Multi-strain Coexistence in Host-Phage Systems with Nested\n  Infection Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bacteria and their viruses (\"bacteriophages\") coexist in natural environments\nforming complex infection networks. Recent empirical findings suggest that\nphage-bacteria infection networks often possess a nested structure such that\nthere is a hierarchical relationship among who can infect whom. Here we\nconsider how nested infection networks may affect phage and bacteria dynamics\nusing a multi-type Lotka-Volterra framework with cross-infection. Analysis of\nsimilar models have, in the past, assumed simpler interaction structures as a\nfirst step towards tractability. We solve the proposed model, finding trade-off\nconditions on the life-history traits of both bacteria and viruses that allow\ncoexistence in communities with nested infection networks. First, we find that\nbacterial growth rate should decrease with increasing defense against\ninfection. Second, we find that the efficiency of viral infection should\ndecrease with host range. Next, we establish a relationship between relative\ndensities and the curvature of life history trade-offs. We compare and contrast\nthe current findings to the \"Kill-the-Winner\" model of multi-species\nphage-bacteria communities. Finally, we discuss a suite of testable hypotheses\nstemming from the current model concerning relationships between infection\nrange, life history traits and coexistence in complex phage-bacteria\ncommunities.\n", "versions": [{"version": "v1", "created": "Mon, 8 Apr 2013 18:32:56 GMT"}], "update_date": "2013-04-09", "authors_parsed": [["Jover", "Luis F.", ""], ["Cortez", "Michael H.", ""], ["Weitz", "Joshua S.", ""]]}, {"id": "1304.2324", "submitter": "Jesus Martinez-Linares", "authors": "Jesus Martinez-Linares", "title": "Phase Space Formulation of Population Dynamics in Ecology", "comments": "4 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math-ph math.MP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A phase space theory for population dynamics in Ecology is presented. This\ntheory applies for a certain class of dynamical systems, that will be called\nM-systems, for which a conserved quantity, the M-function, can be defined in\nphase space. This M-function is the generator of time displacements and\ncontains all the dynamical information of the system. In this sense the\nM-function plays the role of the hamiltonian function for mechanical systems.\nIn analogy with Hamilton theory we derive equations of motion as derivatives\nover the resource function in phase space. A M-bracket is defined which allows\none to perform a geometrical approach in analogy to Poisson bracket of\nhamiltonian systems. We show that the equations of motion can be derived from a\nvariational principle over a functional J of the trajectories. This functional\nplays for M-systems the same role than the action S for hamiltonian systems.\nFinally, three important systems in population dynamics, namely,\nLotka-Volterra, self-feeding and logistic evolution, are shown to be M-systems.\n", "versions": [{"version": "v1", "created": "Mon, 8 Apr 2013 19:23:20 GMT"}], "update_date": "2013-04-09", "authors_parsed": [["Martinez-Linares", "Jesus", ""]]}, {"id": "1304.2616", "submitter": "Jonathan Tennant", "authors": "Jonathan Tennant", "title": "Osteology of a Near-Complete Skeleton of Tenontosaurus tilletti\n  (Dinosauria: Ornithopoda) from the Cloverly Formation, Montana, USA", "comments": "Also uploaded to Figshare\n  (http://dx.doi.org/10.6084/m9.figshare.638693); Masters Thesis", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The character diagnosis of Tenontosaurus tilletti has been revised and\nredefined into a more robust and quantifiable state. Significant emphasis is\nplaced on constructing phylogenetic definition in such a method, as it prevents\nocclusion of true character states by alleviating potential individual\ninterpretational bias. Previous placement within the Iguanodontia is refuted\nbased on the lack of character affinity with the defining synapomorphies of the\nclade. The clade Hypsilophodontidae (=Hypsilophodontia), along with\nIguanodontia, however is deemed to be in critical need of refinement to account\nfor recent discoveries and re-classifications of certain euornithopods. Several\nof the synapomorphies are out-dated and deemed redundant in favour of a more\nquantifiable approach. Re- definition of these clades is critical if the\ncurrent state of basal euornithopodan relationships is to be resolved.\nPhylogenetic studies must be approached from a multidisciplinary perspective;\nintegration of tectonostratigraphical, ontogenetic, palaeoecological, and\nbiomechanical data with sets of well-defined primary homologies are essential\nin increasing phylogenetic resolution and generating stratigraphically feasible\nancestor-descendant relationships. Material attributed to Tenontosaurus\ntilletti is in need of strict re-analysis; the significant quantity of\nspecimens attributed to this species is potentially the result of poor\nstratigraphic constraints and the vast spatiotemporal span occupied. Future\nrevision of this material is expected to reveal temporal variations on the\nspecies -level inherently linked to environmental evolution, as well as\npossibly provide clues to sexual dimorphism in contemporaneous, yet\nmorphologically distinct tenontosaurs.\n", "versions": [{"version": "v1", "created": "Tue, 9 Apr 2013 14:40:33 GMT"}], "update_date": "2013-04-10", "authors_parsed": [["Tennant", "Jonathan", ""]]}, {"id": "1304.2624", "submitter": "Dominic Russell", "authors": "D I Russell and R A Blythe", "title": "Macroscopically-observable probability currents in finite populations", "comments": "26 pages, To appear in J. Stat. Mech", "journal-ref": "J. Stat. Mech.: Theor. Exp. (2013) P06008", "doi": "10.1088/1742-5468/2013/06/P06008", "report-no": null, "categories": "cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In finite-size population models, one can derive Fokker-Planck equations to\ndescribe the fluctuations of the species numbers about the deterministic\nbehaviour. In the steady state of populations comprising two or more species,\nit is permissible for a probability current to flow. In such a case, the system\ndoes not relax to equilibrium but instead reaches a non-equilibrium steady\nstate. In a two-species model, these currents form cycles (e.g., ellipses) in\nprobability space. We investigate the conditions under which such currents are\nsolely responsible for macroscopically-observable cycles in population\nabundances. We find that this can be achieved when the deterministic limit\nyields a circular neutrally-stable manifold. We further discuss the efficacy of\none-dimensional approximation to the diffusion on the manifold, and obtain\nestimates for the macroscopically-observable current around this manifold by\nappealing to Kramers' escape rate theory.\n", "versions": [{"version": "v1", "created": "Tue, 9 Apr 2013 14:59:10 GMT"}, {"version": "v2", "created": "Thu, 16 May 2013 08:51:44 GMT"}], "update_date": "2015-05-26", "authors_parsed": [["Russell", "D I", ""], ["Blythe", "R A", ""]]}, {"id": "1304.2635", "submitter": "Antonio Marco", "authors": "Antonio Marco, Maria Ninova, Matthew Ronshaugen, Sam Griffiths-Jones", "title": "Clusters of microRNAs emerge by new hairpins in existing transcripts", "comments": "3 figures, 2 tables; Nucleic Acids Research; Published online June\n  17, 2013", "journal-ref": null, "doi": "10.1093/nar/gkt534", "report-no": null, "categories": "q-bio.GN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Genetic linkage may result in the expression of multiple products from a\npolycistronic transcript, under the control of a single promoter. In animals,\nprotein-coding polycistronic transcripts are rare. However, microRNAs are\nfrequently clustered in the genomes of animals, and these clusters are often\ntranscribed as a single unit. The evolution of microRNA clusters has been the\nsubject of much speculation, and a selective advantage of clusters of\nfunctionally related microRNAs is often proposed. However, the origin of\nmicroRNA clusters has not been so far explored. Here we study the evolution of\nmicroRNA clusters in Drosophila melanogaster. We observed that the majority of\nmicroRNA clusters arose by the de novo formation of new microRNA-like hairpins\nin existing microRNA transcripts. Some clusters also emerged by tandem\nduplication of a single microRNA. Comparative genomics show that these clusters\nare unlikely to split or undergo rearrangements. We did not find any instances\nof clusters appearing by rearrangement of pre-existing microRNA genes. We\npropose a model for microRNA cluster evolution in which selection over one of\nthe microRNAs in the cluster interferes with the evolution of the other linked\nmicroRNAs. Our analysis suggests that the study of microRNAs and small RNAs\nmust consider linkage associations.\n", "versions": [{"version": "v1", "created": "Tue, 9 Apr 2013 15:27:27 GMT"}, {"version": "v2", "created": "Tue, 18 Jun 2013 11:34:11 GMT"}], "update_date": "2013-06-19", "authors_parsed": [["Marco", "Antonio", ""], ["Ninova", "Maria", ""], ["Ronshaugen", "Matthew", ""], ["Griffiths-Jones", "Sam", ""]]}, {"id": "1304.2823", "submitter": "David Green", "authors": "David Green, Chris Mason", "title": "The Maintenance of Sex: Ronald Fisher meets the Red Queen", "comments": "41 pages, 7 figures, final submission", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sex in higher diploids carries a two-fold cost of males that should reduce\nits fitness relative to cloning and result in its extinction. Instead, sex is\nwidespread and it is clonal species that face early obsolescence. One possible\nreason is that sex is an adaptation to resist ubiquitous parasites, which\nevolve rapidly and potentially antagonistically. We use a heuristic approach to\nmodel mutation-selection in finite populations where a parasitic haploid mounts\na negative frequency-dependent attack on a diploid host. The host evolves\nreflexively to reduce parasitic load. Both host and parasite populations\ngenerate novel alleles by mutation and have access to large allele spaces. Sex\noutcompetes cloning by two overlapping mechanisms. First, sexual diploids adopt\nadvantageous homozygous mutations more rapidly than clonal diploids under\nconditions of lag load. This rate advantage can offset the lesser fecundity of\nsex. Second, a relative advantage to sex emerges under host mutation rates that\nare fast enough to retain fitness in a rapidly mutating parasite environment\nand increase host polymorphism. Clonal polymorphic populations\ndisproportionately experience interference with selection at high mutation\nrates, both between and within loci. This slows clonal population adaptation to\na changing parasite environment and reduces clonal population fitness relative\nto sex. The interference increases markedly with the number of loci under\nindependent selection. Rates of parasite mutation exist that not only allow sex\nto survive despite the two-fold cost of males but which enable sexual and\nclonal populations to have equal fitness and co-exist. Since all higher\norganisms carry parasitic loads, the model is of general applicability.\n", "versions": [{"version": "v1", "created": "Wed, 10 Apr 2013 01:23:23 GMT"}, {"version": "v2", "created": "Tue, 23 Apr 2013 04:53:54 GMT"}], "update_date": "2013-04-24", "authors_parsed": [["Green", "David", ""], ["Mason", "Chris", ""]]}, {"id": "1304.2935", "submitter": "Bertrand Roehner", "authors": "Lei Wang, Yijuan Xu, Zengru Di, Bertrand M. Roehner", "title": "How does group interaction and its severance affect life expectancy?", "comments": "28 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The phenomenon of apoptosis observed in cell cultures consists in the fact\nthat unless cells permanently receive a \"Stay alive\" signal from their\nneighbors, they are bound to die. A natural question is whether manifestations\nof this apoptosis paradigm can also be observed in other organizations of\nliving organisms. In this paper we report results from a two-year long campaign\nof experiments on three species of ants and one species of (tephritid) fruit\nflies. In these experiments individuals were separated from their colony and\nkept in isolation either alone or in groups of 10 individuals. The overall\nconclusion is that \"singles\" have a shorter life expectancy than individuals in\nthe groups of 10. This observation holds for ants as well as for fruit flies.\nThe paper also provides compelling evidence of a similar effect in married\nversus unmarried (i.e. single, widowed or divorced) people. A natural question\nconcerns the dynamic of the transition between the two regimes. Observation\nsuggests an abrupt (rather than smooth) transition and this conclusion seems to\nhold for ants, fruit flies and humans as well. We call it a shock transition.\nIn addition, for red fire ants Solenopsis invicta, it was observed that\nindividuals in groups of 10 that also comprise one queen, die much faster than\nthose in similar groups without queens. The paper also examines the\ncorresponding survivorship curves from the perspective of the standard\nclassification into 3 types. The survivorship curves of ants (whether single or\nin groups of 10) are found to be of type II whereas those of the fruit fly\nBactrocera dorsalis are rather of type III. In this connection it is recalled\nthat the survivorship curve of the fruit fly Drosophila melanogaster is of type\nI, i.e. of same type as for humans.\n", "versions": [{"version": "v1", "created": "Tue, 9 Apr 2013 17:36:40 GMT"}], "update_date": "2013-04-11", "authors_parsed": [["Wang", "Lei", ""], ["Xu", "Yijuan", ""], ["Di", "Zengru", ""], ["Roehner", "Bertrand M.", ""]]}, {"id": "1304.2955", "submitter": "Arindam RoyChoudhury", "authors": "Arindam RoyChoudhury", "title": "Change in Recessive Lethal Alleles Frequency in Inbred Populations", "comments": "9 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a population practicing consanguineous marriage, rare recessive lethal\nalleles (RRLA) have higher chances of affecting phenotypes. As inbreeding\ncauses more homozygosity and subsequently more deaths, the loss of individuals\nwith RRLA decreases the frequency of these alleles. Although this phenomenon is\nwell studied in general, here some hitherto unstudied cases are presented. An\nanalytical formula for the RRLA frequency is presented for infinite monoecious\npopulation practicing several different types of inbreeding. In finite diecious\npopulations, it is found that more severe inbreeding leads to quicker RRLA\nlosses, making the upcoming generations healthier. A population of size 10,000\npracticing 30% half-sib marriages loses more than 95% of its RRLA in 100\ngenerations; a population practicing 30% cousin marriages loses about 75% of\nits RRLA. Our findings also suggest that given enough resources to grow, a\nsmall inbred population will be able to rebound while losing the RRLA.\n", "versions": [{"version": "v1", "created": "Wed, 10 Apr 2013 13:39:06 GMT"}], "update_date": "2013-04-11", "authors_parsed": [["RoyChoudhury", "Arindam", ""]]}, {"id": "1304.3008", "submitter": "Lloyd Sanders Mr", "authors": "Lloyd P. Sanders and Bo S\\\"oderberg and Dirk Brockmann and Tobias\n  Ambj\\\"ornsson", "title": "Perturbative solution to the SIS epidemic on networks", "comments": "Revised. 11 pages, 4 figures, 2 Tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Herein we provide a closed form perturbative solution to a general $M$-node\nnetwork SIS model using the transport rates between nodes as a perturbation\nparameter. We separate the dynamics into a short-time regime and a\nmedium/long-time regime. We solve the short-time dynamics of the system and\nprovide a limit before which our explicit, analytical result of the first-order\nperturbation for the medium/long-time regime is to be employed. These stitched\ncalculations provide an approximation to the full temporal dynamics for rather\ngeneral initial conditions.\n  To further corroborate our results, we solve the mean-field equations\nnumerically for an infectious SIS outbreak in New Zealand (NZ, \\emph{Aotearoa})\nrecomposed into 23 subpopulations where the virus is spread to different\nsubpopulations via (documented) air traffic data, and the country is\ninternationally quarantined. We demonstrate that our analytical predictions\ncompare well to the numerical solution.\n", "versions": [{"version": "v1", "created": "Wed, 10 Apr 2013 16:00:41 GMT"}, {"version": "v2", "created": "Sat, 20 Jul 2013 17:36:04 GMT"}, {"version": "v3", "created": "Wed, 21 Aug 2013 09:17:57 GMT"}], "update_date": "2013-08-22", "authors_parsed": [["Sanders", "Lloyd P.", ""], ["Söderberg", "Bo", ""], ["Brockmann", "Dirk", ""], ["Ambjörnsson", "Tobias", ""]]}, {"id": "1304.3218", "submitter": "Carsten Dormann", "authors": "Carsten F. Dormann and Rouven Strauss", "title": "Detecting modules in quantitative bipartite networks: the QuaBiMo\n  algorithm", "comments": "19 pages, 10 figures, 4 tables", "journal-ref": "Methods in Ecology and Evolution 5 (2014) 90-98", "doi": "10.1111/2041-210X.12139", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ecological networks are often composed of different sub-communities (often\nreferred to as modules). Identifying such modules has the potential to develop\na better understanding of the assembly of ecological communities and to\ninvestigate functional overlap or specialisation. The most informative form of\nnetworks are quantitative or weighted networks. Here we introduce an algorithm\nto identify modules in quantitative bipartite (or two-mode) networks. It is\nbased on the hierarchical random graphs concept of Clauset et al. (2008 Nature\n453: 98-101) and is extended to include quantitative information and adapted to\nwork with bipartite graphs. We define the algorithm, which we call QuaBiMo,\nsketch its performance on simulated data and illustrate its potential\nusefulness with a case study.\n", "versions": [{"version": "v1", "created": "Thu, 11 Apr 2013 07:04:20 GMT"}], "update_date": "2014-03-14", "authors_parsed": [["Dormann", "Carsten F.", ""], ["Strauss", "Rouven", ""]]}, {"id": "1304.3351", "submitter": "Fan Zhang", "authors": "Fan Zhang, Ruoyan Chen, Dongbing Liu, Xiaotian Yao, Guoqing Li, Yabin\n  Jin, Chang Yu, Yingrui Li and Lachlan Coin", "title": "YHap: software for probabilistic assignment of Y haplogroups from\n  population re-sequencing data", "comments": "2 pages 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Y haplogroup analyses are an important component of genealogical\nreconstruction, population genetic analyses, medical genetics and forensics.\nThese fields are increasingly moving towards use of low-coverage, high\nthroughput sequencing. However, there is as yet no software available for using\nsequence data to assign Y haplogroup groups probabilistically, such that the\nposterior probability of assignment fully reflects the information present in\nthe data, and borrows information across all samples sequenced from a\npopulation. YHap addresses this problem.\n", "versions": [{"version": "v1", "created": "Thu, 11 Apr 2013 16:01:38 GMT"}, {"version": "v2", "created": "Fri, 10 May 2013 09:49:20 GMT"}], "update_date": "2013-05-13", "authors_parsed": [["Zhang", "Fan", ""], ["Chen", "Ruoyan", ""], ["Liu", "Dongbing", ""], ["Yao", "Xiaotian", ""], ["Li", "Guoqing", ""], ["Jin", "Yabin", ""], ["Yu", "Chang", ""], ["Li", "Yingrui", ""], ["Coin", "Lachlan", ""]]}, {"id": "1304.3546", "submitter": "Anandarup Bhadra", "authors": "Anandarup Bhadra, Debottam Bhattacharjee, Manabi Paul and Anindita\n  Bhadra", "title": "The Meat of the Matter: A thumb rule for scavenging dogs?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Animals that scavenge in and around human localities need to utilize a broad\nrange of resources. Preference for any one kind of food, under such\ncircumstances, might be inefficient. Indian free-ranging dogs, Canis lupus\nfamiliaris are scavengers that are heavily dependent on humans for sustaining\ntheir omnivorous diet. The current study suggests that because of evolutionary\nload, these dogs, which are descendants of the decidedly carnivorous gray wolf,\nstill retain a preference for meat though they live on carbohydrate-rich\nresources. The plasticity in their diet probably fosters efficient scavenging\nin a competitive environment, while a thumb rule for preferentially acquiring\nspecific nutrients enables them to sequester proteins from the\ncarbohydrate-rich environment.\n", "versions": [{"version": "v1", "created": "Fri, 12 Apr 2013 06:30:33 GMT"}], "update_date": "2013-04-15", "authors_parsed": [["Bhadra", "Anandarup", ""], ["Bhattacharjee", "Debottam", ""], ["Paul", "Manabi", ""], ["Bhadra", "Anindita", ""]]}, {"id": "1304.3637", "submitter": "Trevor Bedford", "authors": "Trevor Bedford, Marc A. Suchard, Philippe Lemey, Gytis Dudas, Victoria\n  Gregory, Alan J. Hay, John W. McCauley, Colin A. Russell, Derek J. Smith,\n  Andrew Rambaut", "title": "Integrating influenza antigenic dynamics with molecular evolution", "comments": "32 pages, 13 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Influenza viruses undergo continual antigenic evolution allowing mutant\nviruses to evade host immunity acquired to previous virus strains. Antigenic\nphenotype is often assessed through pairwise measurement of cross-reactivity\nbetween influenza strains using the hemagglutination inhibition (HI) assay.\nHere, we extend previous approaches to antigenic cartography, and\nsimultaneously characterize antigenic and genetic evolution by modeling the\ndiffusion of antigenic phenotype over a shared virus phylogeny. Using HI data\nfrom influenza lineages A/H3N2, A/H1N1, B/Victoria and B/Yamagata, we determine\npatterns of antigenic drift across viral lineages, showing that A/H3N2 evolves\nfaster and in a more punctuated fashion than other influenza lineages. We also\nshow that year-to-year antigenic drift appears to drive incidence patterns\nwithin each influenza lineage. This work makes possible substantial future\nadvances in investigating the dynamics of influenza and other\nantigenically-variable pathogens by providing a model that intimately combines\nmolecular and antigenic evolution.\n", "versions": [{"version": "v1", "created": "Fri, 12 Apr 2013 14:00:27 GMT"}, {"version": "v2", "created": "Fri, 20 Dec 2013 01:05:38 GMT"}], "update_date": "2013-12-23", "authors_parsed": [["Bedford", "Trevor", ""], ["Suchard", "Marc A.", ""], ["Lemey", "Philippe", ""], ["Dudas", "Gytis", ""], ["Gregory", "Victoria", ""], ["Hay", "Alan J.", ""], ["McCauley", "John W.", ""], ["Russell", "Colin A.", ""], ["Smith", "Derek J.", ""], ["Rambaut", "Andrew", ""]]}, {"id": "1304.3681", "submitter": "Michael Manhart", "authors": "Michael Manhart and Alexandre V. Morozov", "title": "A path-based approach to random walks on networks characterizes how\n  proteins evolve new function", "comments": "9 pages, 7 figures", "journal-ref": "Phys Rev Lett 111:088102, 2013", "doi": "10.1103/PhysRevLett.111.088102", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a path-based approach to continuous-time random walks on networks\nwith arbitrarily weighted edges. We describe an efficient numerical algorithm\nfor calculating statistical properties of the stochastic path ensemble. After\ndemonstrating our approach on two reaction rate problems, we present a\nbiophysical model that describes how proteins evolve new functions while\nmaintaining thermodynamic stability. We use our methodology to characterize\ndynamics of evolutionary adaptation, reproducing several key features observed\nin directed evolution experiments. We find that proteins generally fall into\ntwo qualitatively different regimes of adaptation depending on their binding\nand folding energetics.\n", "versions": [{"version": "v1", "created": "Fri, 12 Apr 2013 16:54:35 GMT"}], "update_date": "2014-08-19", "authors_parsed": [["Manhart", "Michael", ""], ["Morozov", "Alexandre V.", ""]]}, {"id": "1304.3691", "submitter": "Arindam RoyChoudhury", "authors": "Arindam RoyChoudhury", "title": "Identifiability of a Coalescent-based Population Tree Model", "comments": "11 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Identifiability of evolutionary tree models has been a recent topic of\ndiscussion and some models have been shown to be non-identifiable. A\ncoalescent-based rooted population tree model, originally proposed by Nielsen\net al. 1998 [2], has been used by many authors in the last few years and is a\nsimple tool to accurately model the changes in allele frequencies in the tree.\nHowever, the identifiability of this model has never been proven. Here we prove\nthis model to be identifiable by showing that the model parameters can be\nexpressed as functions of the probability distributions of subsamples. This a\nstep toward proving the consistency of the maximum likelihood estimator of the\npopulation tree based on this model.\n", "versions": [{"version": "v1", "created": "Fri, 12 Apr 2013 17:30:13 GMT"}], "update_date": "2013-04-15", "authors_parsed": [["RoyChoudhury", "Arindam", ""]]}, {"id": "1304.3720", "submitter": "Brian Williams Dr", "authors": "Brian G. Williams and Eleanor Gouws", "title": "R0 and the elimination of HIV in Africa: Will 90-90-90 be sufficient?", "comments": "We have updated the previous version for two reasons. First, we have\n  given a better approximation for the estimation of R0 from epidemic doubling\n  times. Second, we have added comments on the new UNAIDS '90-90-90' strategy\n  which puts the results into a broader context", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Joint United Nations Programme on HIV and AIDS (UNAIDS) has set a new\n90-90-90 global target for the coverage of anti-retroviral therapy (ART) to be\nreached by 2020. This would mean that 90% of all people infected with HIV know\ntheir status, 90% of them are on ART and 90% of them will have full viral load\nsuppression. Here we first estimate the case reproduction number, R0, for\ncountries in sub-Saharan Africa and for India using data on the rate at which\nthe prevalence of HIV increased at the start of the epidemic and the life\nexpectancy of people living with HIV who are not on ART. R0 determines the\nmagnitude of the control problem, that is to say, the extent to which\ntransmission must be reduced to eliminate HIV. We show that in sub-Saharan\nAfrica the median value of R0 is 4.6 and in all but five countries R0 is less\nthan 6.3. If the 90-90-90 target is reached, 73% of all those living with HIV\nwill have full viral load suppression. If this is maintained it should\nguarantee elimination in 70% of all countries in sub-Saharan Africa and will\nreduce R0 to less than 2 in the remaining 12 countries, making elimination easy\nto achieve by increasing the availability of other high impact methods of\nprevention.\n", "versions": [{"version": "v1", "created": "Fri, 12 Apr 2013 15:48:41 GMT"}, {"version": "v2", "created": "Mon, 14 Jul 2014 15:00:51 GMT"}], "update_date": "2014-07-15", "authors_parsed": [["Williams", "Brian G.", ""], ["Gouws", "Eleanor", ""]]}, {"id": "1304.3738", "submitter": "Bj{\\o}rn {\\O}stman", "authors": "Bj{\\o}rn {\\O}stman", "title": "Effects of Epistasis and Pleiotropy on Fitness Landscapes", "comments": "10 pages, 6 figures. To appear in \"Origin of Life and Evolutionary\n  Mechanisms\" (P. Pontarotti, ed.). Evolutionary Biology: 16th Meeting 2012,\n  Springer-Verlag", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The factors that influence genetic architecture shape the structure of the\nfitness landscape, and therefore play a large role in the evolutionary\ndynamics. Here the NK model is used to investigate how epistasis and pleiotropy\n-- key components of genetic architecture -- affect the structure of the\nfitness landscape, and how they affect the ability of evolving populations to\nadapt despite the difficulty of crossing valleys present in rugged landscapes.\nPopulations are seen to make use of epistatic interactions and pleiotropy to\nattain higher fitness, and are not inhibited by the fact that valleys have to\nbe crossed to reach peaks of higher fitness.\n", "versions": [{"version": "v1", "created": "Fri, 12 Apr 2013 21:42:46 GMT"}], "update_date": "2013-04-16", "authors_parsed": [["Østman", "Bjørn", ""]]}, {"id": "1304.4170", "submitter": "S. Rajasekar", "authors": "C. Jeevarathinam, S. Rajasekar, Miguel A.F. Sanjuan", "title": "Vibrational resonance in groundwater-dependent plant ecosystems", "comments": "35 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.CD q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We report the phenomenon of vibrational resonance in a single species and a\ntwo species models of groundwater-dependent plant ecosystems with a biharmonic\noscillation (with two widely different frequencies \\omega and \\Omega, \\Omega >>\n\\omega) of the water table depth. In these two systems, the response amplitude\nof the species biomass shows multiple resonances with different mechanisms. The\nresonance occurs at both low- and high-frequencies of the biharmonic force. In\nthe single species bistable system, the resonance occurs at discrete values of\nthe amplitude g of the high-frequency component of the water table.\nFurthermore, the best synchronization of biomass and its carrying capacity with\nthe biharmonic force occurs at the resonance. In the two species excitable and\ntime-delay model, the response amplitude (Q) profile shows several plateau\nregions of resonance, where the period of evolution of the species biomass\nremains the same and the value of Q is inversely proportional to it. The\nresponse amplitude is highly sensitive to the time-delay parameter \\tau and\nshows two distinct sequences of resonance intervals with a decreasing amplitude\nwith \\tau.\n", "versions": [{"version": "v1", "created": "Mon, 15 Apr 2013 17:05:49 GMT"}], "update_date": "2013-04-16", "authors_parsed": [["Jeevarathinam", "C.", ""], ["Rajasekar", "S.", ""], ["Sanjuan", "Miguel A. F.", ""]]}, {"id": "1304.4310", "submitter": "Jason Hindes", "authors": "Jason Hindes, Sarabjeet Singh, Christopher R. Myers, and David J.\n  Schneider", "title": "Epidemic fronts in complex networks with metapopulation structure", "comments": "9 pages, 5 figures, updated references", "journal-ref": null, "doi": "10.1103/PhysRevE.88.012809", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Infection dynamics have been studied extensively on complex networks,\nyielding insight into the effects of heterogeneity in contact patterns on\ndisease spread. Somewhat separately, metapopulations have provided a paradigm\nfor modeling systems with spatially extended and \"patchy\" organization. In this\npaper we expand on the use of multitype networks for combining these paradigms,\nsuch that simple contagion models can include complexity in the agent\ninteractions and multiscale structure. We first present a generalization of the\nVolz-Miller mean-field approximation for Susceptible-Infected-Recovered (SIR)\ndynamics on multitype networks. We then use this technique to study the special\ncase of epidemic fronts propagating on a one-dimensional lattice of\ninterconnected networks - representing a simple chain of coupled population\ncenters - as a necessary first step in understanding how macro-scale disease\nspread depends on micro-scale topology. Using the formalism of front\npropagation into unstable states, we derive the effective transport\ncoefficients of the linear spreading: asymptotic speed, characteristic\nwavelength, and diffusion coefficient for the leading edge of the pulled\nfronts, and analyze their dependence on the underlying graph structure. We also\nderive the epidemic threshold for the system and study the front profile for\nvarious network configurations. To our knowledge, this is the first such\napplication of front propagation concepts to random network models.\n", "versions": [{"version": "v1", "created": "Tue, 16 Apr 2013 02:15:32 GMT"}, {"version": "v2", "created": "Sat, 20 Apr 2013 18:04:08 GMT"}], "update_date": "2013-08-09", "authors_parsed": [["Hindes", "Jason", ""], ["Singh", "Sarabjeet", ""], ["Myers", "Christopher R.", ""], ["Schneider", "David J.", ""]]}, {"id": "1304.4337", "submitter": "Song Xu", "authors": "Song Xu and Shuyun Jiao and Pengyao Jiang and Ping Ao", "title": "Two-timescale evolution on a singular landscape", "comments": "arXiv admin note: text overlap with arXiv:1108.1484", "journal-ref": null, "doi": "10.1103/PhysRevE.89.012724", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Under the effect of strong genetic drift, it is highly probable to observe\ngene fixation or gene loss in a population, shown by infinite peaks on a\ncoherently constructed potential energy landscape. It is then important to ask\nwhat such singular peaks imply, with or without the effects of other biological\nfactors. We studied the stochastic escape time from the infinite potential\npeaks in the Wright-Fisher model, where the typical two-scale diffusion\ndynamics was observed via computer simulations. We numerically found the\naverage escape time for all the bi-stable cases and analytically approximated\nthe results under weak mutations and selections by calculating the mean first\npassage time (MFPT) in singular potential peak. Our results showed that\nKramers' classical escape formula can be extended to the models with\nnon-Gaussian probability distributions, overcoming constraints in previous\nmethods. The constructed landscape provides a global and coherent description\nfor system's evolutionary dynamics, allowing new biological results to be\ngenerated.\n", "versions": [{"version": "v1", "created": "Tue, 16 Apr 2013 06:10:28 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Xu", "Song", ""], ["Jiao", "Shuyun", ""], ["Jiang", "Pengyao", ""], ["Ao", "Ping", ""]]}, {"id": "1304.4515", "submitter": "Ewan Birney", "authors": "Mikhail Spivakov, Thomas O. Auer, Ravindra Peravali, Ian Dunham, Dirk\n  Dolle, Asao Fujiyama, Atsushi Toyoda, Tomoyuki Aizu, Yohei Minakuchi, Felix\n  Loosli, Kiyoshi Naruse, Ewan Birney, Joachim Wittbrodt", "title": "Genomic and phenotypic characterisation of a wild Medaka population:\n  Establishing an isogenic population genetic resource in fish", "comments": "5 figures, 30 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background Oryzias latipes (Medaka) has been established as a vertebrate\ngenetic model for over a century, and has recently been rediscovered outside\nits native Japan. The power of new sequencing methods now makes it possible to\nreinvigorate Medaka genetics, in particular by establishing a near-isogenic\npanel derived from a single wild population. Results Here we characterise the\ngenomes of wild Medaka catches obtained from a single Southern Japanese\npopulation in Kiyosu as a precursor for the establishment of a near isogenic\npanel of wild lines. The population is free of significant detrimental\npopulation structure, and has advantageous linkage disequilibrium properties\nsuitable for establishment of the proposed panel. Analysis of morphometric\ntraits in five representative inbred strains suggests phenotypic mapping will\nbe feasible in the panel. In addition high throughput genome sequencing of\nthese Medaka strains confirms their evolutionary relationships on lines of\ngeographic separation and provides further evidence that there has been little\nsignificant interbreeding between the Southern and Northern Medaka population\nsince the Southern/Northern population split. The sequence data suggest that\nthe Southern Japanese Medaka existed as a larger older population which went\nthrough a relatively recent bottleneck around 10,000 years ago. In addition we\ndetect patterns of recent positive selection in the Southern population.\nConclusions These data indicate that the genetic structure of the Kiyosu Medaka\nsamples are suitable for the establishment of a vertebrate near isogenic panel\nand therefore inbreeding of 200 lines based on this population has commenced.\nProgress of this project can be tracked at\nhttp://www.ebi.ac.uk/birney-srv/medaka-ref-panel\n", "versions": [{"version": "v1", "created": "Tue, 16 Apr 2013 16:40:59 GMT"}, {"version": "v2", "created": "Tue, 19 Nov 2013 15:19:40 GMT"}], "update_date": "2013-11-20", "authors_parsed": [["Spivakov", "Mikhail", ""], ["Auer", "Thomas O.", ""], ["Peravali", "Ravindra", ""], ["Dunham", "Ian", ""], ["Dolle", "Dirk", ""], ["Fujiyama", "Asao", ""], ["Toyoda", "Atsushi", ""], ["Aizu", "Tomoyuki", ""], ["Minakuchi", "Yohei", ""], ["Loosli", "Felix", ""], ["Naruse", "Kiyoshi", ""], ["Birney", "Ewan", ""], ["Wittbrodt", "Joachim", ""]]}, {"id": "1304.4573", "submitter": "Russell Dickson", "authors": "Russell J. Dickson and Gregory B. Gloor", "title": "The MIp Toolset: an efficient algorithm for calculating Mutual\n  Information in protein alignments", "comments": "8 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.BM q-bio.GN q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Coevolution within a protein family is often predicted using\nstatistics that measure the degree of covariation between positions in the\nprotein sequence. Mutual Information is a measure of dependence between two\nrandom variables that has been used extensively to predict intra-protein\ncoevolution.\n  Results: Here we provide an algorithm for the efficient calculation of Mutual\nInformation within a protein family. The algorithm uses linked lists which are\ndirectly accessed by a pointer array. The linked list allows efficient storage\nof sparse count data caused by protein conservation. The direct access array of\npointers prevents the linked list from being traversed each time it is\nmodified.\n  Conclusions: This algorithm is implemented in the software MIpToolset, but\ncould also be easily implemented in other Mutual Information based standalone\nsoftware or web servers. The current implementation in the MIpToolset has been\ncritical in large-scale protein family analysis and real-time coevolution\ncalculations during alignment editing and curation.\n  The MIpToolset is available at: https://sourceforge.net/projects/miptoolset/\n", "versions": [{"version": "v1", "created": "Tue, 16 Apr 2013 19:40:38 GMT"}], "update_date": "2013-04-17", "authors_parsed": [["Dickson", "Russell J.", ""], ["Gloor", "Gregory B.", ""]]}, {"id": "1304.4673", "submitter": "Anindita Bhadra", "authors": "Sreejani Sen Majumder, Anandarup Bhadra, Arjun Ghosh, Soumitra Mitra,\n  Debottam Bhattacharjee, Jit Chatterjee, Anjan K. Nandi and Anindita Bhadra", "title": "To be or not to be social: Foraging associations of free-ranging dogs in\n  an urban ecosystem", "comments": null, "journal-ref": null, "doi": "10.1007/s10211-013-0158-0", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Canids display a wide diversity of social systems, from solitary to pairs to\npacks, and hence they have been extensively used as model systems to understand\nsocial dynamics in natural systems. Among canids, the dog can show various\nlevels of social organization due to the influence of humans on their lives.\nThough the dog is known as man's best friend and has been studied extensively\nas a pet, studies on the natural history, ecology and behaviour of dogs in a\nnatural habitat are rare. Here we report results of an extensive\npopulation-level study conducted through one-time censuses in urban India to\nunderstand the ecoethology of free-ranging dogs. We built a model to test if\nthe observed groups could have been formed through random associations while\nforaging. Our modeling results suggest that the dogs, like all efficient\nscavengers, tend to forage singly but also form random uncorrelated groups. A\ncloser inspection of the group compositions however reveals that the foraging\nassociations are non-random events. The tendency of adults to associate with\nthe opposite sex in the mating season and of juveniles to stay close to adults\nin the non-mating season drives the population towards aggregation, in spite of\nthe apparently random nature of the group size distribution. Hence we conclude\nthat to be or not to be social is a matter of choice for the free-ranging dogs,\nand not a matter of chance.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2013 03:18:15 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Majumder", "Sreejani Sen", ""], ["Bhadra", "Anandarup", ""], ["Ghosh", "Arjun", ""], ["Mitra", "Soumitra", ""], ["Bhattacharjee", "Debottam", ""], ["Chatterjee", "Jit", ""], ["Nandi", "Anjan K.", ""], ["Bhadra", "Anindita", ""]]}, {"id": "1304.4763", "submitter": "Thomas House", "authors": "Matthew Graham and Thomas House", "title": "Dynamics of Stochastic Epidemics on Heterogeneous Networks", "comments": "22 pages, 3 figures", "journal-ref": null, "doi": "10.1007/s00285-013-0679-1", "report-no": null, "categories": "q-bio.PE math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Epidemic models currently play a central role in our attempts to understand\nand control infectious diseases. Here, we derive a model for the diffusion\nlimit of stochastic susceptible-infectious-removed (SIR) epidemic dynamics on a\nheterogeneous network. Using this, we consider analytically the early\nasymptotic exponential growth phase of such epidemics, showing how the higher\norder moments of the network degree distribution enter into the stochastic\nbehaviour of the epidemic. We find that the first three moments of the network\ndegree distribution are needed to specify the variance in disease prevalence\nfully, meaning that the skewness of the degree distribution affects the\nvariance of the prevalence of infection. We compare these asymptotic results to\nsimulation and find a close agreement for city-sized populations.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2013 10:47:02 GMT"}], "update_date": "2013-09-30", "authors_parsed": [["Graham", "Matthew", ""], ["House", "Thomas", ""]]}, {"id": "1304.4856", "submitter": "Ulrike Ober", "authors": "Ulrike Ober, Alexander Malinowski, Martin Schlather, Henner Simianer", "title": "The Expected Linkage Disequilibrium in Finite Populations Revisited", "comments": "32 pages, 11 Figures, formatting edits compared to v1 (pdf-links)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The expected level of linkage disequilibrium (LD) in a finite ideal\npopulation at equilibrium is of relevance for many applications in population\nand quantitative genetics. Several recursion formulae have been proposed during\nthe last decades, whose derivations mostly contain heuristic parts and\ntherefore remain mathematically questionable. We propose a more justifiable\napproach, including an alternative recursion formula for the expected LD. Since\nthe exact formula depends on the distribution of allele frequencies in a very\ncomplicated manner, we suggest an approximate solution and analyze its validity\nextensively in a simulation study. Compared to the widely used formula of Sved,\nthe proposed formula performs better for all parameter constellations\nconsidered. We then analyze the expected LD at equilibrium using the theory on\ndiscrete-time Markov chains based on the linear recursion formula, with\nequilibrium being defined as the steady-state of the chain, which finally leads\nto a formula for the effective population size N_e. An additional analysis\nconsiders the effect of non-exactness of a recursion formula on the\nsteady-state, demonstrating that the resulting error in expected LD can be\nsubstantial. In an application to the HapMap data of two human populations we\nillustrate the dependency of the N_e-estimate on the distribution of minor\nallele frequencies (MAFs), showing that the estimated N_e can vary by up to 30%\nwhen a uniform instead of a skewed distribution of MAFs is taken as a basis to\nselect SNPs for the analyses. Our analyses provide new insights into the\nmathematical complexity of the problem studied.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2013 15:15:38 GMT"}, {"version": "v2", "created": "Thu, 18 Apr 2013 11:15:17 GMT"}], "update_date": "2013-04-19", "authors_parsed": [["Ober", "Ulrike", ""], ["Malinowski", "Alexander", ""], ["Schlather", "Martin", ""], ["Simianer", "Henner", ""]]}, {"id": "1304.4928", "submitter": "Matjaz Perc", "authors": "Luo-Luo Jiang, Matjaz Perc, Attila Szolnoki", "title": "If cooperation is likely punish mildly: Insights from economic\n  experiments based on the snowdrift game", "comments": "15 pages, 6 figures; accepted for publication in PLoS ONE", "journal-ref": "PLoS ONE 8 (2013) e64677", "doi": "10.1371/journal.pone.0064677", "report-no": null, "categories": "q-bio.PE cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Punishment may deter antisocial behavior. Yet to punish is costly, and the\ncosts often do not offset the gains that are due to elevated levels of\ncooperation. However, the effectiveness of punishment depends not only on how\ncostly it is, but also on the circumstances defining the social dilemma. Using\nthe snowdrift game as the basis, we have conducted a series of economic\nexperiments to determine whether severe punishment is more effective than mild\npunishment. We have observed that severe punishment is not necessarily more\neffective, even if the cost of punishment is identical in both cases. The\nbenefits of severe punishment become evident only under extremely adverse\nconditions, when to cooperate is highly improbable in the absence of sanctions.\nIf cooperation is likely, mild punishment is not less effective and leads to\nhigher average payoffs, and is thus the much preferred alternative. Presented\nresults suggest that the positive effects of punishment stem not only from\nimposed fines, but may also have a psychological background. Small fines can do\nwonders in motivating us to chose cooperation over defection, but without the\nparalyzing effect that may be brought about by large fines. The later should be\nutilized only when absolutely necessary.\n", "versions": [{"version": "v1", "created": "Wed, 17 Apr 2013 19:55:53 GMT"}], "update_date": "2013-06-04", "authors_parsed": [["Jiang", "Luo-Luo", ""], ["Perc", "Matjaz", ""], ["Szolnoki", "Attila", ""]]}, {"id": "1304.5090", "submitter": "Margareta Segerst{\\aa}hl", "authors": "Margareta Segerst{\\aa}hl", "title": "Formal Model of Living Organisms", "comments": "Submitted to the 12th European Conference on Artificial Life (Ecal\n  2013), manuscript revised before final extended submission deadline", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A modeling formalism is proposed for the description and study of living and\nlife-like systems. It provides an abstract conceptual model framework for real\nlife and evolution of biological organisms. It is proposed, that this model\nformalism provides a novel system view and immediately applicable conceptual\ntools for understanding complex life and evolution. The modeling principle is\nvery generic suggesting that it can be directly applied also to the study of\nengineered and artificial systems.\n", "versions": [{"version": "v1", "created": "Thu, 18 Apr 2013 11:29:14 GMT"}, {"version": "v2", "created": "Thu, 13 Jun 2013 11:41:20 GMT"}], "update_date": "2013-06-14", "authors_parsed": [["Segerståhl", "Margareta", ""]]}, {"id": "1304.5412", "submitter": "Eric Lewitus", "authors": "Eric Lewitus, Iva Kelava, Alex T. Kalinka, Pavel Tomancak, and Wieland\n  B Huttner", "title": "An Adaptive Threshold in Mammalian Neocortical Evolution", "comments": "Currently under review; 38 pages, 5 Figures, 13 Supplementary\n  Figures, 2 Tables", "journal-ref": "PLoS Biol 12(11): e1002000, 2014", "doi": "10.1371/journal.pbio.1002000", "report-no": null, "categories": "q-bio.PE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Expansion of the neocortex is a hallmark of human evolution. However, it\nremains an open question what adaptive mechanisms facilitated its expansion.\nHere we show, using gyrencephaly index (GI) and other physiological and\nlife-history data for 102 mammalian species, that gyrencephaly is an ancestral\nmammalian trait. We provide evidence that the evolution of a highly folded\nneocortex, as observed in humans, requires the traversal of a threshold of 10^9\nneurons, and that species above and below the threshold exhibit a bimodal\ndistribution of physiological and life-history traits, establishing two\nphenotypic groups. We identify, using discrete mathematical models,\nproliferative divisions of progenitors in the basal compartment of the\ndeveloping neocortex as evolutionarily necessary and sufficient for generating\na fourteen-fold increase in daily prenatal neuron production and thus traversal\nof the neuronal threshold. We demonstrate that length of neurogenic period,\nrather than any novel progenitor-type, is sufficient to distinguish cortical\nneuron number between species within the same phenotypic group.\n", "versions": [{"version": "v1", "created": "Fri, 19 Apr 2013 13:28:06 GMT"}, {"version": "v2", "created": "Tue, 1 Oct 2013 15:25:41 GMT"}], "update_date": "2015-08-26", "authors_parsed": [["Lewitus", "Eric", ""], ["Kelava", "Iva", ""], ["Kalinka", "Alex T.", ""], ["Tomancak", "Pavel", ""], ["Huttner", "Wieland B", ""]]}, {"id": "1304.5471", "submitter": "Mansoor Saburov", "authors": "Nasir Ganikhodjaev, Mansoor Saburov, and Uygun Jamilov", "title": "Mendelian and Non-Mendelian Quadratic Operators", "comments": "The paper is 14 pages and will appear in Appl. Math. Inf. Sci. 7, No.\n  5, 1721-1729 (2013)", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we attempt to provide mathematical models of Mendelian and\nNon-Mendelian inheritances of the bisexual population system having Fisher's\n{\\textbf{1:1}} principle. In our model, we always assume that distributions of\nthe same phenotype of female and male populations are equal. We study the\nevolution of a Mendelian trait. As an application of a non-Mendelian\ninheritance, we construct a quadratic stochastic operator that describes\ntransmission of {\\textbf{ABO}} and Rh blood groups.\n", "versions": [{"version": "v1", "created": "Fri, 19 Apr 2013 16:32:21 GMT"}], "update_date": "2013-04-22", "authors_parsed": [["Ganikhodjaev", "Nasir", ""], ["Saburov", "Mansoor", ""], ["Jamilov", "Uygun", ""]]}, {"id": "1304.5486", "submitter": "Joshua Schraiber", "authors": "Joshua G. Schraiber, Yulia Mostovoy, Tiffany Y. Hsu, Rachel B. Brem", "title": "Inferring evolutionary histories of pathway regulation from\n  transcriptional profiling data", "comments": "30 pages, 12 figures, 2 tables, contact authors for supplementary\n  tables", "journal-ref": "PLoS Computational Biology 9, 2013, e1003255", "doi": "10.1371/journal.pcbi.1003255", "report-no": null, "categories": "q-bio.PE q-bio.GN q-bio.QM", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  One of the outstanding challenges in comparative genomics is to interpret the\nevolutionary importance of regulatory variation between species. Rigorous\nmolecular evolution-based methods to infer evidence for natural selection from\nexpression data are at a premium in the field, and to date, phylogenetic\napproaches have not been well-suited to address the question in the small sets\nof taxa profiled in standard surveys of gene expression. We have developed a\nstrategy to infer evolutionary histories from expression profiles by analyzing\nsuites of genes of common function. In a manner conceptually similar to\nmolecular evolution models in which the evolutionary rates of DNA sequence at\nmultiple loci follow a gamma distribution, we modeled expression of the genes\nof an \\emph{a priori}-defined pathway with rates drawn from an inverse gamma\ndistribution. We then developed a fitting strategy to infer the parameters of\nthis distribution from expression measurements, and to identify gene groups\nwhose expression patterns were consistent with evolutionary constraint or rapid\nevolution in particular species. Simulations confirmed the power and accuracy\nof our inference method. As an experimental testbed for our approach, we\ngenerated and analyzed transcriptional profiles of four \\emph{Saccharomyces}\nyeasts. The results revealed pathways with signatures of constrained and\naccelerated regulatory evolution in individual yeasts and across the phylogeny,\nhighlighting the prevalence of pathway-level expression change during the\ndivergence of yeast species. We anticipate that our pathway-based phylogenetic\napproach will be of broad utility in the search to understand the evolutionary\nrelevance of regulatory change.\n", "versions": [{"version": "v1", "created": "Fri, 19 Apr 2013 17:35:23 GMT"}, {"version": "v2", "created": "Thu, 25 Jul 2013 22:04:06 GMT"}], "update_date": "2013-10-16", "authors_parsed": [["Schraiber", "Joshua G.", ""], ["Mostovoy", "Yulia", ""], ["Hsu", "Tiffany Y.", ""], ["Brem", "Rachel B.", ""]]}, {"id": "1304.5519", "submitter": "Krzysztof Argasinski", "authors": "Krzysztof Argasinski", "title": "The Dynamics of Sex Ratio Evolution: From the Gene Perspective to\n  Multilevel Selection", "comments": "3 figures", "journal-ref": "Argasinski K (2013) The Dynamics of Sex Ratio Evolution: From the\n  Gene Perspective to Multilevel Selection. PLoS ONE 8(4): e60405.\n  doi:10.1371/journal.pone.0060405", "doi": "10.1371/journal.pone.0060405", "report-no": null, "categories": "q-bio.PE math.CA nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The new dynamical game theoretic model of sex ratio evolution emphasizes the\nrole of males as passive carriers of sex ratio genes. This shows inconsistency\nbetween population genetic models of sex ratio evolution and classical\nstrategic models. In this work a novel technique of change of coordinates will\nbe applied to the new model. This will reveal new aspects of the modelled\nphenomenon which cannot be shown or proven in the original formulation. The\nunderlying goal is to describe the dynamics of selection of particular genes in\nthe entire population, instead of in the same sex subpopulation, as in the\nprevious paper and earlier population genetics approaches. This allows for\nanalytical derivation of the unbiased strategic model from the model with\nrigorous non-simplified genetics. In effect, an alternative system of\nreplicator equations is derived. It contains two subsystems: the first\ndescribes changes in gene frequencies (this is an alternative unbiased\nformalization of the Fisher-Dusing argument), whereas the second describes\nchanges in the sex ratios in subpopulations of carriers of genes for each\nstrategy. An intriguing analytical result of this work is that fitness of a\ngene depends on the current sex ratio in the subpopulation of its carriers, not\non the encoded individual strategy. Thus, the argument of the gene fitness\nfunction is not constant but is determined by the trajectory of the sex ratio\namong carriers of that gene. This aspect of the modelled phenomenon cannot be\nrevealed by the static analysis. Dynamics of the sex ratio among gene carriers\nis driven by a dynamic \"tug of war\" between female carriers expressing the\nencoded strategic trait value and random partners of male carriers expressing\nthe average population strategy (a primary sex ratio). This mechanism can be\ncalled \"double level selection\". Therefore, gene interest perspective leads to\nmulti-level selection.\n", "versions": [{"version": "v1", "created": "Fri, 19 Apr 2013 19:50:56 GMT"}, {"version": "v2", "created": "Sun, 2 Mar 2014 23:00:13 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Argasinski", "Krzysztof", ""]]}, {"id": "1304.5603", "submitter": "Zi-Niu  Wu", "authors": "W.B. Wang, Z.N. Wu, Z.M. Cao, R.F. Hu", "title": "Modelling the spreading rate of controlled communicable epidemics\n  through an entropy-based thermodynamic model", "comments": "12 pages, 13 figures", "journal-ref": "SCIENCE CHINA Physics,Mechanics & Astronomy 2013", "doi": "10.1007/s11433-013-5321-0", "report-no": null, "categories": "physics.med-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A model based on a thermodynamic approach is proposed for predicting the\ndynamics of communicable epidemics in a city, when the epidemic is governed by\ncontrolling efforts of multiple scales so that an entropy is associated with\nthe system. All the epidemic details are factored into a single parameter that\nis determined by maximizing the rate of entropy production. Despite the\nsimplicity of the final model, it predicts the number of hospitalized cases\nwith a reasonable accuracy, using the data of SARS of the year 2003, once the\ninflexion point characterizing the effect of multiple controlling efforts is\nknown. This model is supposed to be of potential usefulness since epidemics\nsuch as avian influenza like H7H9 in China this year have the risk to become\ncommunicable among human beings.\n", "versions": [{"version": "v1", "created": "Sat, 20 Apr 2013 08:38:41 GMT"}], "update_date": "2013-10-01", "authors_parsed": [["Wang", "W. B.", ""], ["Wu", "Z. N.", ""], ["Cao", "Z. M.", ""], ["Hu", "R. F.", ""]]}, {"id": "1304.5664", "submitter": "Chaitanya Gokhale", "authors": "Chaitanya S. Gokhale, Arne Traulsen", "title": "Mutualism and evolutionary multiplayer games: revisiting the Red King", "comments": null, "journal-ref": "Gokhale CS, Traulsen A. Mutualism and evolutionary multiplayer\n  games: revisiting the Red King. Proceedings of the Royal Society B:\n  Biological Sciences. 2012 Oct 11; 279 (1747):4611-6", "doi": "10.1098/rspb.2012.1697", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coevolution of two species is typically thought to favour the evolution of\nfaster evolutionary rates helping a species keep ahead in the Red Queen race,\nwhere `it takes all the running you can do to stay where you are'. In contrast,\nif species are in a mutualistic relationship, it was proposed that the Red King\neffect may act, where it can be beneficial to evolve slower than the\nmutualistic species. The Red King hypothesis proposes that the species which\nevolves slower can gain a larger share of the benefits. However, the\ninteractions between the two species may involve multiple individuals. To\nanalyse such a situation, we resort to evolutionary multiplayer games. Even in\nsituations where evolving slower is beneficial in a two-player setting, faster\nevolution may be favoured in a multiplayer setting. The underlying features of\nmultiplayer games can be crucial for the distribution of benefits. They also\nsuggest a link between the evolution of the rate of evolution and group size.\n", "versions": [{"version": "v1", "created": "Sat, 20 Apr 2013 19:51:11 GMT"}], "update_date": "2013-04-23", "authors_parsed": [["Gokhale", "Chaitanya S.", ""], ["Traulsen", "Arne", ""]]}, {"id": "1304.5814", "submitter": "Mike Steel Prof.", "authors": "Andreas Sand and Mike Steel", "title": "The standard lateral gene transfer model is statistically consistent for\n  pectinate four-taxon trees", "comments": "20 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary events such as incomplete lineage sorting and lateral gene\ntransfer constitute major problems for inferring species trees from gene trees,\nas they can sometimes lead to gene trees which conflict with the underlying\nspecies tree. One particularly simple and efficient way to infer species trees\nfrom gene trees under such conditions is to combine three-taxon analyses for\nseveral genes using a majority vote approach. For incomplete lineage sorting\nthis method is known to be statistically consistent, however, in the case of\nlateral gene transfer it is known that a zone of inconsistency does exist for a\nspecific four-taxon tree topology. In this paper we analyze all remaining\nfour-taxon topologies and show that no other inconsistencies exist.\n", "versions": [{"version": "v1", "created": "Mon, 22 Apr 2013 00:24:54 GMT"}], "update_date": "2013-04-23", "authors_parsed": [["Sand", "Andreas", ""], ["Steel", "Mike", ""]]}, {"id": "1304.5848", "submitter": "James Dowty", "authors": "James G. Dowty, Graham B. Byrnes and Dorota M. Gertig", "title": "The time-evolution of DCIS size distributions with applications to\n  breast cancer growth and progression", "comments": "12 pages, 2 figures and 1 table. To appear in Mathematical Medicine\n  and Biology", "journal-ref": null, "doi": "10.1093/imammb/dqt014", "report-no": null, "categories": "q-bio.PE q-bio.QM q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ductal carcinoma {\\em in situ} (DCIS) lesions are non-invasive tumours of the\nbreast which are thought to precede most invasive breast cancers (IBC). As\nindividual DCIS lesions are initiated, grow and invade (i.e. become IBC) the\nsize distribution of the DCIS lesions present in a given human population will\nevolve. We derive a differential equation governing this evolution and show,\nfor given assumptions about growth and invasion, that there is a unique\ndistribution which does not vary with time. Further, we show that any initial\ndistribution converges to this stationary distribution exponentially quickly.\nIt is therefore reasonable to assume that the stationary distribution is equal\nto the true DCIS size distribution, at least for human populations which are\nrelatively stable with respect to the determinants of breast cancer. Based on\nthis assumption and the size data of 110 DCIS lesions detected in a\nmammographic screening program between 1993 and 2000, we produce maximum\nlikelihood estimates for certain growth and invasion parameters. Assuming that\nDCIS size is proportional to a positive power $p$ of the time since tumour\ninitiation we estimate $p$ to be 0.50 with a 95% confidence interval of $(0.35,\n0.71)$. Therefore we estimate that DCIS lesions follow a square-root growth law\nand hence that they grow rapidly when small and relatively slowly when large.\nOur approach and results should be useful for other mathematical studies of\ncancer, especially those investigating biological mechanisms of invasion.\n", "versions": [{"version": "v1", "created": "Mon, 22 Apr 2013 06:15:56 GMT"}, {"version": "v2", "created": "Tue, 25 Jun 2013 05:52:58 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Dowty", "James G.", ""], ["Byrnes", "Graham B.", ""], ["Gertig", "Dorota M.", ""]]}, {"id": "1304.5875", "submitter": "Filippo Disanto", "authors": "Filippo Disanto, Anna Schlizio, Thomas Wiehe", "title": "Yule-generated trees constrained by node imbalance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Yule process generates a class of binary trees which is fundamental to\npopulation genetic models and other applications in evolutionary biology. In\nthis paper, we introduce a family of sub-classes of ranked trees, called\nOmega-trees, which are characterized by imbalance of internal nodes. The degree\nof imbalance is defined by an integer 0 <= w. For caterpillars, the extreme\ncase of unbalanced trees, w = 0. Under models of neutral evolution, for\ninstance the Yule model, trees with small w are unlikely to occur by chance.\nIndeed, imbalance can be a signature of permanent selection pressure, such as\nobservable in the genealogies of certain pathogens. From a mathematical point\nof view it is interesting to observe that the space of Omega-trees maintains\nseveral statistical invariants although it is drastically reduced in size\ncompared to the space of unconstrained Yule trees. Using generating functions,\nwe study here some basic combinatorial properties of Omega-trees. We focus on\nthe distribution of the number of subtrees with two leaves. We show that\nexpectation and variance of this distribution match those for unconstrained\ntrees already for very small values of w.\n", "versions": [{"version": "v1", "created": "Mon, 22 Apr 2013 08:54:50 GMT"}, {"version": "v2", "created": "Tue, 13 Aug 2013 09:41:48 GMT"}], "update_date": "2013-08-14", "authors_parsed": [["Disanto", "Filippo", ""], ["Schlizio", "Anna", ""], ["Wiehe", "Thomas", ""]]}, {"id": "1304.5956", "submitter": "Renato Vieira dos Santos", "authors": "Renato Vieira dos Santos and Ronald Dickman", "title": "Survival of the Scarcer in Space", "comments": "19 pages, 11 figures. In Journal of Statistical Mechanics 2013", "journal-ref": null, "doi": "10.1088/1742-5468/2013/07/P07004", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dynamics leading to extinction or coexistence of competing species is of\ngreat interest in ecology and related fields. Recently a model of intra- and\ninterspecific competition between two species was proposed by Gabel et al.\n[Phys. Rev. E 87 (2013) 010101], in which the scarcer species (i.e., with\nsmaller stationary population size) can be more resistant to extinction when it\nholds a competitive advantage; the latter study considered populations without\nspatial variation. Here we verify this phenomenon in populations distributed in\nspace. We extend the model of Gabel et al. to a d-dimensional lattice, and\nstudy its population dynamics both analytically and numerically. Survival of\nthe scarcer in space is verified for situations in which the more competitive\nspecies is closer to the threshold for extinction than is the less competitive\nspecies, when considered in isolation. The conditions for survival of the\nscarcer species, as obtained applying renormalization group analysis and Monte\nCarlo simulation, differ in detail from those found in the spatially\nhomogeneous case. Simulations highlight the speed of invasion waves in\ndetermining the survival times of the competing species.\n", "versions": [{"version": "v1", "created": "Fri, 12 Apr 2013 22:43:57 GMT"}, {"version": "v2", "created": "Wed, 3 Jul 2013 20:32:12 GMT"}], "update_date": "2015-06-15", "authors_parsed": [["Santos", "Renato Vieira dos", ""], ["Dickman", "Ronald", ""]]}, {"id": "1304.6098", "submitter": "Melissa Wilson Sayres", "authors": "Melissa A. Wilson Sayres", "title": "Timing of ancient human Y lineage depends on the mutation rate: A\n  comment on Mendez et al", "comments": "5 pages, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mendez et al. recently report the identification of a Y chromosome lineage\nfrom an African American that is an outgroup to all other known Y haplotypes,\nand report a time to most recent common ancestor, TMRCA, for human Y lineages\nthat is substantially longer than any previous estimate. The identification of\na novel Y haplotype is always exciting, and this haplotype, in particular, is\nunique in its basal position on the Y haplotype tree. However, at 338 (237-581)\nthousand years ago, kya, the extremely ancient TMRCA reported by Mendez et al.\nis inconsistent with the known human fossil record (which estimate the age of\nanatomically modern humans at 195 +- 5 kya), with estimates from mtDNA (176.6\n+- 11.3 kya, and 204.9 (116.8-295.7) kya) and with population genetic theory.\nThe inflated TMRCA can quite easily be attributed to the extremely low Y\nchromosome mutation rate used by the authors.\n", "versions": [{"version": "v1", "created": "Mon, 22 Apr 2013 20:26:19 GMT"}], "update_date": "2013-04-24", "authors_parsed": [["Sayres", "Melissa A. Wilson", ""]]}, {"id": "1304.6226", "submitter": "Massimo Cencini Dr.", "authors": "Simone Pigolotti and Massimo Cencini", "title": "Species abundances and lifetimes: from neutral to niche-stabilized\n  communities", "comments": "10 pages, 5 figures (typos corrected and derivation of main results\n  polished)", "journal-ref": "Journal of Theoretical Biology 338, 1--8 (2013)", "doi": "10.1016/j.jtbi.2013.08.024", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a stochastic community model able to interpolate from a neutral\nregime to a niche partitioned regime upon varying a single parameter tuning the\nintensity of niche stabilization, namely the difference between intraspecific\nand interspecific competition. By means of a self-consistent approach, we\nobtain an analytical expression for the species abundance distribution, in\nexcellent agreement with stochastic simulations of the model. In the neutral\nlimit, the Fisher log-series is recovered, while upon increasing the\nstabilization strength the species abundance distribution develops a maximum\nfor species at intermediate abundances, corresponding to the emergence of a\ncarrying capacity. Numerical studies of species extinction-time distribution\nshow that niche-stabilization strongly affects also the dynamical properties of\nthe system by increasing the average species lifetimes, while suppressing their\nfluctuations. The results are discussed in view of the niche-neutral debate and\nof their potential relevance to field data.\n", "versions": [{"version": "v1", "created": "Tue, 23 Apr 2013 10:46:05 GMT"}, {"version": "v2", "created": "Mon, 16 Sep 2013 14:09:35 GMT"}], "update_date": "2013-09-17", "authors_parsed": [["Pigolotti", "Simone", ""], ["Cencini", "Massimo", ""]]}, {"id": "1304.6319", "submitter": "Thomas Adams", "authors": "Thomas P. Adams, Dmitry Aleynik, Michael Burrows", "title": "Larval dispersal of intertidal organisms and the influence of coastline\n  geography", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The dispersal stages of organisms with sessile adults must be able to select\nhabitats with suitable conditions for establishment and survival, and must also\nbe able to reach those locations. For marine planktonic larvae, movement due to\ncurrents is often orders of magnitude greater than movement due to swimming\nbehaviour, so transport is largely passive.\n  Current patterns are determined by the interaction of geography with tidal\nforces, modified by meteorological conditions. These linkages impose an\narea-specific focus to connectivity studies. Yet, how geographical features and\nmeteorological forcing combine to produce specific current patterns and\nresultant connectivity among populations remains unclear.\n  In this study, we followed tracks of generic particles driven by modelled\nhydrodynamic currents to investigate how connectivity between evenly spaced\nhabitat sites varies in relation to coastal topography. Larvae released from\nregions of high current velocity, open coastline and low local habitat\navailability travelled furthest but were less likely to disperse successfully.\nExtensive natal habitat in the vicinity of a site generally had a positive\nimpact on the number of larvae arriving, as did low current velocities.\nHowever, relationships between numbers of arriving larvae and local\ngeographical indices were complex, particularly at longer larval durations.\n  Local geography alone explained up to 50% of the variance in success of\nlarvae released and around 10% of the variation in the number of larvae\narriving at each site, but coastline properties fall short of predicting\ndispersal measures for particular locations. The study shows that\nmeteorological variation and broad scale current patterns interact strongly\nwith local geography to determine connectivity in coastal areas.\n", "versions": [{"version": "v1", "created": "Tue, 23 Apr 2013 15:23:04 GMT"}, {"version": "v2", "created": "Mon, 1 Jul 2013 11:23:55 GMT"}], "update_date": "2013-07-02", "authors_parsed": [["Adams", "Thomas P.", ""], ["Aleynik", "Dmitry", ""], ["Burrows", "Michael", ""]]}, {"id": "1304.6375", "submitter": "Andrea Baronchelli", "authors": "Andrea Baronchelli, Nick Chater, Morten H. Christiansen, Romualdo\n  Pastor-Satorras", "title": "Evolution in a Changing Environment", "comments": null, "journal-ref": "PLoS ONE 8(1): e52742 (2013)", "doi": "10.1371/journal.pone.0052742", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a simple model for genetic adaptation to a changing environment,\ndescribing a fitness landscape characterized by two maxima. One is associated\nwith \"specialist\" individuals that are adapted to the environment; this maximum\nmoves over time as the environment changes. The other maximum is static, and\nrepresents \"generalist\" individuals not affected by environmental changes. The\nrest of the landscape is occupied by \"maladapted\" individuals. Our analysis\nconsiders the evolution of these three subpopulations. Our main result is that,\nin presence of a sufficiently stable environmental feature, as in the case of\nan unchanging aspect of a physical habitat, specialists can dominate the\npopulation. By contrast, rapidly changing environmental features, such as\nlanguage or cultural habits, are a moving target for the genes; here,\ngeneralists dominate, because the best evolutionary strategy is to adopt\nneutral alleles not specialized for any specific environment. The model we\npropose is based on simple assumptions about evolutionary dynamics and\ndescribes all possible scenarios in a non-trivial phase diagram. The approach\nprovides a general framework to address such fundamental issues as the Baldwin\neffect, the biological basis for language, or the ecological consequences of a\nrapid climate change.\n", "versions": [{"version": "v1", "created": "Tue, 23 Apr 2013 18:46:23 GMT"}], "update_date": "2013-04-24", "authors_parsed": [["Baronchelli", "Andrea", ""], ["Chater", "Nick", ""], ["Christiansen", "Morten H.", ""], ["Pastor-Satorras", "Romualdo", ""]]}, {"id": "1304.6394", "submitter": "Alain Barrat", "authors": "Anna Machens, Francesco Gesualdo, Caterina Rizzo, Alberto E Tozzi,\n  Alain Barrat, Ciro Cattuto", "title": "An infectious disease model on empirical networks of human contact:\n  bridging the gap between dynamic network data and contact matrices", "comments": null, "journal-ref": "BMC Infectious Diseases 13:185 (2013)", "doi": "10.1186/1471-2334-13-185", "report-no": null, "categories": "q-bio.PE physics.comp-ph physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The integration of empirical data in computational frameworks to model the\nspread of infectious diseases poses challenges that are becoming pressing with\nthe increasing availability of high-resolution information on human mobility\nand contacts. This deluge of data has the potential to revolutionize the\ncomputational efforts aimed at simulating scenarios and designing containment\nstrategies. However, the integration of detailed data sources yields models\nthat are less transparent and general. Hence, given a specific disease model,\nit is crucial to assess which representations of the raw data strike the best\nbalance between simplicity and detail. We consider high-resolution data on the\nface-to-face interactions of individuals in a hospital ward, obtained by using\nwearable proximity sensors. We simulate the spread of a disease in this\ncommunity by using an SEIR model on top of different mathematical\nrepresentations of the contact patterns. We show that a contact matrix that\nonly contains average contact durations fails to reproduce the size of the\nepidemic obtained with the high-resolution contact data and also to identify\nthe most at-risk classes. We introduce a contact matrix of probability\ndistributions that takes into account the heterogeneity of contact durations\nbetween (and within) classes of individuals, and we show that this\nrepresentation yields a good approximation of the epidemic spreading properties\nobtained by using the high-resolution data. Our results mark a step towards the\ndefinition of synopses of high-resolution dynamic contact networks, providing a\ncompact representation of contact patterns that can correctly inform\ncomputational models designed to discover risk groups and evaluate containment\npolicies. We show that this novel kind of representation can preserve in\nsimulation quantitative features of the epidemics that are crucial for their\nstudy and management.\n", "versions": [{"version": "v1", "created": "Tue, 23 Apr 2013 19:55:32 GMT"}], "update_date": "2013-04-24", "authors_parsed": [["Machens", "Anna", ""], ["Gesualdo", "Francesco", ""], ["Rizzo", "Caterina", ""], ["Tozzi", "Alberto E", ""], ["Barrat", "Alain", ""], ["Cattuto", "Ciro", ""]]}, {"id": "1304.6623", "submitter": "Flora Bacelar Dra.", "authors": "Flora S. Bacelar, Justin M. Calabrese, Em\\'ilio Hern\\'andez-Garc\\'ia", "title": "Exploring the tug of war between positive and negative interactions\n  among savanna trees: Competition, dispersal, and protection from fire", "comments": null, "journal-ref": null, "doi": "10.1016/j.ecocom.2013.11.007", "report-no": null, "categories": "q-bio.PE nlin.CG physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Savannas are characterized by a discontinuous tree layer superimposed on a\ncontinuous layer of grass. Identifying the mechanisms that facilitate this\ntree-grass coexistence has remained a persistent challenge in ecology and is\nknown as the \"savanna problem\". In this work, we propose a model that combines\na previous savanna model (Calabrese et al., 2010), which includes competitive\ninteractions among trees and dispersal, with the Drossel-Schwabl forest fire\nmodel, therefore representing fire in a spatially explicit manner. The model is\nused to explore how the pattern of fire-spread, coupled with an explicit,\nfire-vulnerable tree life stage, affects tree density and spatial pattern. Tree\ndensity depends strongly on both fire frequency and tree-tree competition\nalthough the fire frequency, which induces indirect interactions between trees\nand between trees and grass, appears to be the crucial factor controlling the\ntree-extinction transition in which the savanna becomes grassland. Depending on\nparameters, adult trees may arrange in different regular or clumped patterns,\nthe later of two different types (compact or open). Cluster-size distributions\nhave fat tails but clean power-law behavior is only attained in specific cases.\n", "versions": [{"version": "v1", "created": "Wed, 24 Apr 2013 15:16:33 GMT"}], "update_date": "2014-01-30", "authors_parsed": [["Bacelar", "Flora S.", ""], ["Calabrese", "Justin M.", ""], ["Hernández-García", "Emílio", ""]]}, {"id": "1304.7205", "submitter": "Alexander Stewart", "authors": "Alexander J. Stewart and Joshua B. Plotkin", "title": "From extortion to generosity, the evolution of zero-determinant\n  strategies in the prisoner's dilemma", "comments": null, "journal-ref": "PNAS September 17, 2013 vol. 110 no. 38 15348-15353", "doi": "10.1073/pnas.1306246110", "report-no": null, "categories": "q-bio.PE math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent work has revealed a new class of \"zero-determinant\" (ZD) strategies\nfor iterated, two-player games. ZD strategies allow a player to unilaterally\nenforce a linear relationship between her score and her opponent's score, and\nthus achieve an unusual degree of control over both players' long-term payoffs.\nAlthough originally conceived in the context of classical, two-player game\ntheory, ZD strategies also have consequences in evolving populations of\nplayers. Here we explore the evolutionary prospects for ZD strategies in the\nIterated Prisoner's Dilemma (IPD). Several recent studies have focused on the\nevolution of \"extortion strategies\" - a subset of zero-determinant strategies -\nand found them to be unsuccessful in populations. Nevertheless, we identify a\ndifferent subset of ZD strategies, called \"generous ZD strategies\", that\nforgive defecting opponents, but nonetheless dominate in evolving populations.\nFor all but the smallest population sizes, generous ZD strategies are not only\nrobust to being replaced by other strategies, but they also can selectively\nreplace any non-cooperative ZD strategy. Generous strategies can be generalized\nbeyond the space of ZD strategies, and they remain robust to invasion. When\nevolution occurs on the full set of all IPD strategies, selection\ndisproportionately favors these generous strategies. In some regimes, generous\nstrategies outperform even the most successful of the well-known Iterated\nPrisoner's Dilemma strategies, including win-stay-lose-shift.\n", "versions": [{"version": "v1", "created": "Fri, 26 Apr 2013 15:37:49 GMT"}, {"version": "v2", "created": "Fri, 3 May 2013 21:40:15 GMT"}, {"version": "v3", "created": "Fri, 27 Dec 2013 14:01:24 GMT"}], "update_date": "2013-12-30", "authors_parsed": [["Stewart", "Alexander J.", ""], ["Plotkin", "Joshua B.", ""]]}, {"id": "1304.7670", "submitter": "Timothy Sackton", "authors": "Timothy B. Sackton, Russell B. Corbett-Detig, Javaregowda Nagaraju, R.\n  Lakshmi Vaishna, Kallare P. Arunkumar, and Daniel L. Hartl", "title": "Positive selection drives faster-Z evolution in silkmoths", "comments": "19 pages, 3 figures; revised results, discussion, and methods from\n  previous version", "journal-ref": null, "doi": "10.1111/evo.12449", "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Genes linked to X or Z chromosomes, which are hemizygous in the heterogametic\nsex, are predicted to evolve at different rates than those on autosomes. This\nfaster-X effect can arise either as a consequence of hemizygosity, which leads\nto more efficient selection for recessive beneficial mutations in the\nheterogametic sex, or as a consequence of reduced effective population size of\nthe hemizygous chromosome, which leads to increased fixation of weakly\ndeleterious mutations due to random genetic drift. Empirical results to date\nhave suggested that, while the overall pattern across taxa is complicated, in\ngeneral systems with male-heterogamy show a faster-X effect primarily\nattributable to more efficient selection while the only female-heterogamy taxon\nstudied to date (birds) shows a faster-Z effect primarily attributable to\nincreased drift. In order to test the generality of the faster-Z pattern seen\nin birds, we sequenced the genome of the Lepidopteran insect Bombyx huttoni, a\nclose outgroup of the domesticated silkmoth Bombyx mori. We show that silkmoths\nexperience faster-Z evolution, but unlike in birds, the faster-Z effect appears\nto be attributable to more efficient positive selection in females. These\nresults suggest that female-heterogamy alone is unlikely to be sufficient to\nexplain the reduced efficacy of selection on the bird Z chromosome. Instead, it\nis likely that a combination of patterns of dosage compensation and overall\neffective population size, among other factors, influence patterns of faster-Z\nevolution.\n", "versions": [{"version": "v1", "created": "Mon, 29 Apr 2013 14:26:02 GMT"}, {"version": "v2", "created": "Thu, 29 Aug 2013 05:56:43 GMT"}], "update_date": "2014-06-10", "authors_parsed": [["Sackton", "Timothy B.", ""], ["Corbett-Detig", "Russell B.", ""], ["Nagaraju", "Javaregowda", ""], ["Vaishna", "R. Lakshmi", ""], ["Arunkumar", "Kallare P.", ""], ["Hartl", "Daniel L.", ""]]}, {"id": "1304.7715", "submitter": "Troy Day", "authors": "Nathan S. McClure and Troy Day", "title": "Slowing evolution is more effective than enhancing drug development for\n  managing resistance", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Drug resistance is a serious public health problem that threatens to thwart\nour ability to treat many infectious diseases. Repeatedly, the introduction of\nnew drugs has been followed by the evolution of resistance. In principle there\nare two ways to address this problem: (i) enhancing drug development, and (ii)\nslowing drug resistance. We present data and a modeling approach based on\nqueueing theory that explores how interventions aimed at these two facets\naffect the ability of the entire drug supply system to provide service.\nAnalytical and simulation-based results show that, all else equal, slowing the\nevolution of drug resistance is more effective at ensuring an adequate supply\nof effective drugs than is enhancing the rate at which new drugs are developed.\nThis lends support to the idea that evolution management is not only a\nsignificant component of the solution to the problem of drug resistance, but\nmay in fact be the most important component.\n", "versions": [{"version": "v1", "created": "Mon, 29 Apr 2013 17:06:37 GMT"}, {"version": "v2", "created": "Wed, 10 Jul 2013 13:20:52 GMT"}], "update_date": "2013-07-11", "authors_parsed": [["McClure", "Nathan S.", ""], ["Day", "Troy", ""]]}, {"id": "1304.7919", "submitter": "Krzysztof Bartoszek", "authors": "Krzysztof Bartoszek and Michal Krzeminski", "title": "Critical case stochastic phylogenetic tree model via the Laplace\n  transform", "comments": "To appear in Demonstratio Mathematica", "journal-ref": "Demonstratio Mathematica 2014, Vol. 47(2), 474-481", "doi": null, "report-no": null, "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Birth-and-death models are now a common mathematical tool to describe\nbranching patterns observed in real-world phylogenetic trees. Liggett and\nSchinazi (2009) is one such example. The authors propose a simple\nbirth-and-death model that is compatible with phylogenetic trees of both\ninfluenza and HIV, depending on the birth rate parameter. An interesting\nspecial case of this model is the critical case where the birth rate equals the\ndeath rate. This is a non-trivial situation and to study its asymptotic\nbehaviour we employed the Laplace transform. With this we correct the proof of\nLiggett and Schinazi (2009) in the critical case.\n", "versions": [{"version": "v1", "created": "Tue, 30 Apr 2013 08:58:32 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Bartoszek", "Krzysztof", ""], ["Krzeminski", "Michal", ""]]}, {"id": "1304.8104", "submitter": "Leonid Yaroslavsky", "authors": "Leonid Yaroslavsky", "title": "The amazing dynamics of stochastic pattern formation and growth models\n  inspired by the Conway's Game of Life", "comments": "41 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.CG q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several modifications of the famous mathematical Game of Life are introduced\nby making Game of Life rules stochastic and mutual influence of cells in their\n8-neighborhood on a rectangular lattice spatially non-uniform. Results are\nreported of experimental investigation of evolutionary dynamics of the\nintroduced models. A number of new phenomena in the evolutionary dynamics of\nthe models and collective behavior of patterns they generate are revealed,\ndescribed and illustrated: formation of maze-like patterns as fixed points of\nthe models, \"self-controlled growth\", \"eternal life\" in a bounded space and\n\"coherent shrinkage\".\n", "versions": [{"version": "v1", "created": "Sun, 28 Apr 2013 07:20:32 GMT"}], "update_date": "2013-05-01", "authors_parsed": [["Yaroslavsky", "Leonid", ""]]}]