[{"id": "1307.0202", "submitter": "Delfim F. M. Torres", "authors": "Helena Sofia Rodrigues, M. Teresa T. Monteiro, Delfim F. M. Torres", "title": "Sensitivity Analysis in a Dengue Epidemiological Model", "comments": "Submitted 14-June-2013; accepted, after a minor revision,\n  30-June-2013; Conference Papers in Mathematics, Volume 2013, Article ID\n  721406, http://dx.doi.org/10.1155/2013/721406", "journal-ref": "Conference Papers in Mathematics, Vol. 2013, Art. ID 721406, 7\n  pages, 2013", "doi": "10.1155/2013/721406", "report-no": null, "categories": "q-bio.PE math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Epidemiological models may give some basic guidelines for public health\npractitioners, allowing to analyze issues that can influence the strategies to\nprevent and fight a disease. To be used in decision-making, however, a\nmathematical model must be carefully parameterized and validated with\nepidemiological and entomological data. Here a SIR (S for susceptible, I for\ninfectious, R for recovered individuals) and ASI (A for the aquatic phase of\nthe mosquito, S for susceptible and I for infectious mosquitoes)\nepidemiological model describing a dengue disease is presented, as well as the\nassociated basic reproduction number. A sensitivity analysis of the\nepidemiological model is performed in order to determine the relative\nimportance of the model parameters to the disease transmission.\n", "versions": [{"version": "v1", "created": "Sun, 30 Jun 2013 13:47:55 GMT"}], "update_date": "2013-08-15", "authors_parsed": [["Rodrigues", "Helena Sofia", ""], ["Monteiro", "M. Teresa T.", ""], ["Torres", "Delfim F. M.", ""]]}, {"id": "1307.0337", "submitter": "Thomas Wiehe", "authors": "Marina Rafajlovi\\'c (1), Alexander Klassmann (2), Anders Eriksson (3),\n  Thomas Wiehe (2), Bernhard Mehlig (1) ((1) Department of Physics, University\n  of Gothenburg, Sweden, (2) Institut f\\\"ur Genetik, Universit\\\"at zu K\\\"oln,\n  Germany, (3) Department of Zoology, University of Cambridge, U.K.)", "title": "Demography-adjusted tests of neutrality based on genome-wide SNP data", "comments": "7 Figures. Supplemental material with 8 Tables and 7 Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tests of the neutral evolution hypothesis are usually built on the standard\nnull model which assumes that mutations are neutral and population size remains\nconstant over time. However, it is unclear how such tests are affected if the\nlast assumption is dropped. Here, we extend the unifying framework for tests\nbased on the site frequency spectrum, introduced by Achaz and Ferretti, to\npopulations of varying size. A key ingredient is to specify the first two\nmoments of the frequency spectrum. We show that these moments can be determined\nanalytically if a population has experienced two instantaneous size changes in\nthe past. We apply our method to data from ten human populations gathered in\nthe 1000 genomes project, estimate their demographies and define\ndemography-adjusted versions of Tajima's $D$, Fay & Wu's $H$, and Zeng's $E$.\nThe adjusted test statistics facilitate the direct comparison between\npopulations and they show that most of the differences among populations seen\nin the original tests can be explained by demography. We carried out whole\ngenome screens for deviation from neutrality and identified candidate regions\nof recent positive selection. We provide track files with values of the\nadjusted and original tests for upload to the UCSC genome browser.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jul 2013 11:39:05 GMT"}], "update_date": "2013-07-02", "authors_parsed": [["Rafajlović", "Marina", ""], ["Klassmann", "Alexander", ""], ["Eriksson", "Anders", ""], ["Wiehe", "Thomas", ""], ["Mehlig", "Bernhard", ""]]}, {"id": "1307.0343", "submitter": "Bernard Ycart", "authors": "Sana Louhichi and Bernard Ycart", "title": "Exponential growth of bifurcating processes with ancestral dependence", "comments": "25 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Branching processes are classical growth models in cell kinetics. In their\nconstruction, it is usually assumed that cell lifetimes are independent random\nvariables, which has been proved false in experiments. Models of dependent\nlifetimes are considered here, in particular bifurcating Markov chains. Under\nhypotheses of stationarity and multiplicative ergodicity, the corresponding\nbranching process is proved to have the same type of asymptotics as its classic\ncounterpart in the i.i.d. supercritical case: the cell population grows\nexponentially, the growth rate being related to the exponent of multiplicative\nergodicity, in a similar way as to the Laplace transform of lifetimes in the\ni.i.d. case. An identifiable model for which the multiplicative ergodicity\ncoefficients and the growth rate can be explicitly computed is proposed.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jul 2013 12:22:54 GMT"}], "update_date": "2013-07-02", "authors_parsed": [["Louhichi", "Sana", ""], ["Ycart", "Bernard", ""]]}, {"id": "1307.0516", "submitter": "Simon DeDeo", "authors": "Paul L. Hooper, Simon DeDeo, Ann E. Caldwell Hooper, Michael Gurven\n  and Hillard S. Kaplan", "title": "Dynamical Structure of a Traditional Amazonian Social Network", "comments": "24 pages, 6 figures, 1 table; expanded results and discussion\n  sections; matches published version", "journal-ref": "Entropy 2013, 15, 4932-4955", "doi": "10.3390/e15114932", "report-no": null, "categories": "cs.SI nlin.AO physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reciprocity is a vital feature of social networks, but relatively little is\nknown about its temporal structure or the mechanisms underlying its persistence\nin real world behavior. In pursuit of these two questions, we study the\nstationary and dynamical signals of reciprocity in a network of manioc beer\n(Spanish: chicha; Tsimane': shocdye') drinking events in a Tsimane' village in\nlowland Bolivia. At the stationary level, our analysis reveals that social\nexchange within the community is heterogeneously patterned according to kinship\nand spatial proximity. A positive relationship between the frequencies at which\ntwo families host each other, controlling for kinship and proximity, provides\nevidence for stationary reciprocity. Our analysis of the dynamical structure of\nthis network presents a novel method for the study of conditional, or\nnon-stationary, reciprocity effects. We find evidence that short-timescale\nreciprocity (within three days) is present among non- and distant-kin pairs;\nconversely, we find that levels of cooperation among close kin can be accounted\nfor on the stationary hypothesis alone.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jul 2013 20:07:53 GMT"}, {"version": "v2", "created": "Sun, 17 Nov 2013 20:41:39 GMT"}], "update_date": "2013-11-19", "authors_parsed": [["Hooper", "Paul L.", ""], ["DeDeo", "Simon", ""], ["Hooper", "Ann E. Caldwell", ""], ["Gurven", "Michael", ""], ["Kaplan", "Hillard S.", ""]]}, {"id": "1307.0607", "submitter": "Branislav Brutovsky", "authors": "B. Brutovsky, D. Horvath", "title": "Structure of Intratumor Heterogeneity: Is Cancer Hedging Its Bets?", "comments": "10 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Development of resistance limits transferability of most anticancer therapies\ninto curative treatment and understanding mechanisms beyond it remains a big\nchallenge. Many high resolution experimental observations show enormous\nintratumor heterogeneity at molecular, genetic and cellular levels which is\nmade responsible for emerging resistance to therapy. Therefore, researchers\nsearch techniques to influence development of intratumor heterogeneity, which\nrequires understanding its role within the context of integrative, logically\nconsistent, framework, such as evolutionary theory. Although it is agreed that\nintratumor heterogeneity increases probability of the emergence of therapy\nresistant clones, more instructive role of its structure in the process of\ncancer dynamics and metastasis is needed. In the paper, intratumor\nheterogeneity is viewed as a product of two, in general stochastic, processes,\nevolutionary optimization and changing environment, respectively. In\nevolutionary theory, common risk-diversifying strategy displayed by isogenic\npopulations in unpredictably changing environments is bet-hedging. We suggest,\nthat the structure of intratumor heterogeneity is evolutionary trait evolving\nto maximize the clonal fitness in changing (or uncertain) environment and that\nits structure corresponds to bet-hedging strategy. We advocate our view by\nreviewing and combining important cancer relevant concepts.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jul 2013 07:46:50 GMT"}], "update_date": "2013-07-03", "authors_parsed": [["Brutovsky", "B.", ""], ["Horvath", "D.", ""]]}, {"id": "1307.0737", "submitter": "Daniel B. Weissman", "authors": "D. B. Weissman and O. Hallatschek", "title": "The rate of adaptation in large sexual populations with linear\n  chromosomes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In large populations, multiple beneficial mutations may be simultaneously\nspreading. In asexual populations, these mutations must either arise on the\nsame background or compete against each other. In sexual populations,\nrecombination can bring together beneficial alleles from different backgrounds,\nbut tightly linked alleles may still greatly interfere with each other. We show\nfor well-mixed populations that when this interference is strong, the genome\ncan be seen as consisting of many effectively asexual stretches linked\ntogether. The rate at which beneficial alleles fix is thus roughly proportional\nto the rate of recombination, and depends only logarithmically on the mutation\nsupply and the strength of selection. Our scaling arguments also allow to\npredict, with reasonable accuracy, the distribution of effects of fixed\nmutations when new mutations have broadly-distributed effects. We focus on the\nregime in which crossovers occur more frequently than beneficial mutations, as\nis likely to be the case for many natural populations.\n", "versions": [{"version": "v1", "created": "Tue, 2 Jul 2013 15:57:59 GMT"}, {"version": "v2", "created": "Sat, 14 Dec 2013 04:52:05 GMT"}, {"version": "v3", "created": "Wed, 18 Dec 2013 05:57:09 GMT"}], "update_date": "2013-12-19", "authors_parsed": [["Weissman", "D. B.", ""], ["Hallatschek", "O.", ""]]}, {"id": "1307.0968", "submitter": "Jose A. Cuesta", "authors": "Susanna Manrubia and Jos\\'e A. Cuesta", "title": "Evolution on neutral networks accelerates the ticking rate of the\n  molecular clock", "comments": "31 pages, 4 figures", "journal-ref": "Journal of the Royal Society Interface 102, 20141010 (2015)", "doi": "10.1098/rsif.2014.1010", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large sets of genotypes give rise to the same phenotype because phenotypic\nexpression is highly redundant. Accordingly, a population can accept mutations\nwithout altering its phenotype, as long as thegenotype mutates into another one\non the same set. By linking every pair of genotypes that are mutually\naccessible through mutation, genotypes organize themselves into neutral\nnetworks (NN). These networks are known to be heterogeneous and assortative,\nand these properties affect the evolutionary dynamics of the population. By\nstudying the dynamics of populations on NN with arbitrary topology we analyze\nthe effect of assortativity, of NN (phenotype) fitness, and of network size. We\nfind that the probability that the population leaves the network is smaller the\nlonger the time spent on it. This progressive \"phenotypic entrapment\" entails a\nsystematic increase in the overdispersion of the process with time and an\nacceleration in the fixation rate of neutral mutations. We also quantify the\nvariation of these effects with the size of the phenotype and with its fitness\nrelative to that of neighbouring alternatives.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jul 2013 11:15:09 GMT"}, {"version": "v2", "created": "Wed, 24 Sep 2014 20:47:30 GMT"}], "update_date": "2015-02-18", "authors_parsed": [["Manrubia", "Susanna", ""], ["Cuesta", "José A.", ""]]}, {"id": "1307.1163", "submitter": "Simone Severini", "authors": "Harry Buhrman, Peter van der Gulik, Simone Severini, David Speijer", "title": "A mathematical model of kinetoplastid mitochondrial gene scrambling\n  advantage", "comments": "22 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We model and discuss advantages of pan-editing, the complex way of expressing\nmitochondrial genes in kinetoplastids. The rapid spread and preservation of\npan-editing seems to be due to its concomitant fragment dispersal. Such\ndispersal prevents losing temporarily non expressed mitochondrial genes upon\nintense intraspecific competition, by linking non expressed fragments to parts\nwhich are still needed. We mathematically modelled protection against gene\nloss, due to the absence of selection, by this kind of fragment association.\nThis gives ranges of values for parameters like scrambling extent, population\nsize, and number of generations still retaining full genomes despite limited\nselection. Values obtained seem consistent with those observed. We find a\nquasi-linear correlation between dispersal and number of generations after\nwhich populations lose genes, showing that pan-editing can be selected to\neffectively limit gene loss under relaxed selective pressure.\n", "versions": [{"version": "v1", "created": "Wed, 3 Jul 2013 21:22:55 GMT"}], "update_date": "2013-07-05", "authors_parsed": [["Buhrman", "Harry", ""], ["van der Gulik", "Peter", ""], ["Severini", "Simone", ""], ["Speijer", "David", ""]]}, {"id": "1307.1586", "submitter": "Blaise Li", "authors": "Blaise Li", "title": "Evaluating strategies of phylogenetic analyses by the coherence of their\n  results", "comments": "6 pages, 3 figures, accepted for publication in Comptes Rendus\n  Palevol, based on a work presented at the \"Journ\\'ees d'automne 2012 de la\n  Soci\\'et\\'e Fran\\c{c}aise de Syst\\'ematique\"\n  (http://www.normalesup.org/~bli/Papers/SFS_2012_BL.pdf)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I propose an approach to identify, among several strategies of phylogenetic\nanalysis, those producing the most accurate results. This approach is based on\nthe hypothesis that the more a result is reproduced from independent data, the\nmore it reflects the historical signal common to the analysed data. Under this\nhypothesis, the capacity of an analytical strategy to extract historical signal\nshould correlate positively with the coherence of the obtained results. I apply\nthis approach to a series of analyses on empirical data, basing the coherence\nmeasure on the Robinson-Foulds distances between the obtained trees. At first\napproximation, the analytical strategies most suitable for the data produce the\nmost coherent results. However, risks of false positives and false negatives\nare identified, which are difficult to rule out.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jul 2013 11:36:40 GMT"}], "update_date": "2013-07-08", "authors_parsed": [["Li", "Blaise", ""]]}, {"id": "1307.1670", "submitter": "Dario Madeo", "authors": "Dario Madeo and Chiara Mocenni", "title": "A New Mathematical Model for Evolutionary Games on Finite Networks of\n  Players", "comments": "26 pages, 7 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS cs.GT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new mathematical model for evolutionary games on graphs is proposed to\nextend the classical replicator equation to finite populations of players\norganized on a network with generic topology. Classical results from game\ntheory, evolutionary game theory and graph theory are used. More specifically,\neach player is placed in a vertex of the graph and he is seen as an infinite\npopulation of replicators which replicate within the vertex. At each time\ninstant, a game is played by two replicators belonging to different connected\nvertices, and the outcome of the game influences their ability of producing\noffspring. Then, the behavior of a vertex player is determined by the\ndistribution of strategies used by the internal replicators. Under suitable\nhypotheses, the proposed model is equivalent to the classical replicator\nequation. Extended simulations are performed to show the dynamical behavior of\nthe solutions and the potentialities of the developed model.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jul 2013 17:25:19 GMT"}], "update_date": "2013-07-08", "authors_parsed": [["Madeo", "Dario", ""], ["Mocenni", "Chiara", ""]]}, {"id": "1307.1736", "submitter": "Sandro Meloni", "authors": "Chiara Poletto, Sandro Meloni, Vittoria Colizza, Yamir Moreno and\n  Alessandro Vespignani", "title": "Host mobility drives pathogen competition in spatially structured\n  populations", "comments": "23 pages, 8 figures, 1 table. Final version to appear in PLoS Comp.\n  Bio", "journal-ref": "PLoS Comput Biol 9(8): e1003169 (2013)", "doi": "10.1371/journal.pcbi.1003169", "report-no": null, "categories": "q-bio.PE physics.bio-ph physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Interactions among multiple infectious agents are increasingly recognized as\na fundamental issue in the understanding of key questions in public health,\nregarding pathogen emergence, maintenance, and evolution. The full description\nof host-multipathogen systems is however challenged by the multiplicity of\nfactors affecting the interaction dynamics and the resulting competition that\nmay occur at different scales, from the within-host scale to the spatial\nstructure and mobility of the host population. Here we study the dynamics of\ntwo competing pathogens in a structured host population and assess the impact\nof the mobility pattern of hosts on the pathogen competition. We model the\nspatial structure of the host population in terms of a metapopulation network\nand focus on two strains imported locally in the system and having the same\ntransmission potential but different infectious periods. We find different\nscenarios leading to competitive success of either one of the strain or to the\ncodominance of both strains in the system. The dominance of the strain\ncharacterized by the shorter or longer infectious period depends exclusively on\nthe structure of the population and on the the mobility of hosts across\npatches. The proposed modeling framework allows the integration of other\nrelevant epidemiological, environmental and demographic factors opening the\npath to further mathematical and computational studies of the dynamics of\nmultipathogen systems.\n", "versions": [{"version": "v1", "created": "Fri, 5 Jul 2013 23:04:36 GMT"}], "update_date": "2013-08-21", "authors_parsed": [["Poletto", "Chiara", ""], ["Meloni", "Sandro", ""], ["Colizza", "Vittoria", ""], ["Moreno", "Yamir", ""], ["Vespignani", "Alessandro", ""]]}, {"id": "1307.1884", "submitter": "Adrian Melott", "authors": "Adrian L. Melott (Kansas) and Richard K. Bambach (Simithsonian)", "title": "Do Periodicities in Extinction -- with Possible Astronomical Connections\n  -- Survive a Revision of the Geological Timescale?", "comments": "13 pages, 2 figures. Accepted for publication in Astrophysical\n  Journal", "journal-ref": "ApJ 773, 6 (2013)", "doi": "10.1088/0004-637X/773/1/6", "report-no": null, "categories": "astro-ph.EP astro-ph.GA physics.bio-ph physics.geo-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A major revision of the geological timescale was published in 2012. We\nre-examine our past finding of a 27 Myr periodicity in marine extinction rates\nby re-assigning dates to the extinction data used previously. We find that the\nspectral power at this period is somewhat increased, and persists at a narrow\nbandwidth, which supports our previous contention that the Nemesis hypothesis\nis untenable as an explanation for the periodicity that was first noted by Raup\nand Sepkoski in the 1980s. We enumerate a number of problems in a recent study\ncomparing extinction rates with time series models.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jul 2013 16:44:47 GMT"}], "update_date": "2013-07-22", "authors_parsed": [["Melott", "Adrian L.", "", "Kansas"], ["Bambach", "Richard K.", "", "Simithsonian"]]}, {"id": "1307.1917", "submitter": "Pratha Sah", "authors": "Pratha Sah, Sutirth Dey", "title": "Stabilizing spatially structured populations through Adaptive Limiter\n  Control", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0105861", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stabilizing the dynamics of complex, non-linear systems is a major concern\nacross several scientific disciplines including ecology and conservation\nbiology. Unfortunately, most methods proposed to reduce the fluctuations in\nchaotic systems are not applicable for real, biological populations. This is\nbecause such methods typically require detailed knowledge of system specific\nparameters and the ability to manipulate them in real time; conditions often\nnot met by most real populations. Moreover, real populations are often noisy\nand extinction-prone, which can sometimes render such methods ineffective. Here\nwe investigate a control strategy, which works by perturbing the population\nsize, and is robust to reasonable amounts of noise and extinction probability.\nThis strategy, called the Adaptive Limiter Control (ALC), has been previously\nshown to increase constancy and persistence of laboratory populations and\nmetapopulations of Drosophila melanogaster. Here we present a detailed\nnumerical investigation of the effects of ALC on the fluctuations and\npersistence of metapopulations. We show that at high migration rates,\napplication of ALC does not require a priori information about the population\ngrowth rates. We also show that ALC can stabilize metapopulations even when\napplied to as low as one-tenth of the total number of subpopulations. Moreover,\nALC is effective even when the subpopulations have high extinction rates:\nconditions under which one other control algorithm has previously failed to\nattain stability. Importantly, ALC not only reduces the fluctuation in\nmetapopulation sizes, but also the global extinction probability. Finally, the\nmethod is robust to moderate levels of noise in the dynamics and the carrying\ncapacity of the environment. These results, coupled with our earlier empirical\nfindings, establish ALC to be a strong candidate for stabilizing real\nbiological metapopulations.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jul 2013 21:09:23 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Sah", "Pratha", ""], ["Dey", "Sutirth", ""]]}, {"id": "1307.1918", "submitter": "Kristina Crona", "authors": "Devin Greene and Kristina Crona", "title": "The Changing Geometry of a Fitness Landscape Along an Adaptive Walk", "comments": "29 pages, 7 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1003520", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It has recently been noted that the relative prevalence of the various kinds\nof epistasis varies along an adaptive walk. This has been explained as a result\nof mean regression in NK model fitness landscapes. Here we show that this\nphenomenon occurs quite generally in fitness landscapes. We propose a simple\nand general explanation for this phenomemon, confirming the role of mean\nregression. We provide support for this explanation with simulations, and\ndiscuss the empirical relevance of our findings.\n", "versions": [{"version": "v1", "created": "Sun, 7 Jul 2013 21:09:55 GMT"}, {"version": "v2", "created": "Tue, 9 Jul 2013 00:40:08 GMT"}, {"version": "v3", "created": "Sat, 14 Dec 2013 16:03:14 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Greene", "Devin", ""], ["Crona", "Kristina", ""]]}, {"id": "1307.2404", "submitter": "P. Grassberger", "authors": "Li Chen, Fakhteh Ghanbarnejad, Weiran Cai, and Peter Grassberger", "title": "Outbreaks of coinfections: the critical role of cooperativity", "comments": "5 pages, including 5 figures", "journal-ref": "EPL 104 (2013) 50001", "doi": "10.1209/0295-5075/104/50001", "report-no": null, "categories": "q-bio.PE cond-mat.dis-nn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modeling epidemic dynamics plays an important role in studying how diseases\nspread, predicting their future course, and designing strategies to control\nthem. In this letter, we introduce a model of SIR\n(susceptible-infected-removed) type which explicitly incorporates the effect of\n{\\it cooperative coinfection}. More precisely, each individual can get infected\nby two different diseases, and an individual already infected with one disease\nhas an increased probability to get infected by the other. Depending on the\namount of this increase, we observe different threshold scenarios. Apart from\nthe standard continuous phase transition for single disease outbreaks, we\nobserve continuous transitions where both diseases must coexist, but also\ndiscontinuous transitions are observed, where a finite fraction of the\npopulation is already affected by both diseases at the threshold. All our\nresults are obtained in a mean field model using rate equations, but we argue\nthat they should hold also in more general frameworks.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jul 2013 11:19:21 GMT"}, {"version": "v2", "created": "Mon, 16 Dec 2013 15:17:53 GMT"}], "update_date": "2013-12-17", "authors_parsed": [["Chen", "Li", ""], ["Ghanbarnejad", "Fakhteh", ""], ["Cai", "Weiran", ""], ["Grassberger", "Peter", ""]]}, {"id": "1307.2446", "submitter": "R\\'obert Juh\\'asz", "authors": "R\\'obert Juh\\'asz", "title": "Extinction transition in stochastic population dynamics in a random,\n  convective environment", "comments": "23 pages, 11 figures, typo corrected", "journal-ref": "J. Stat. Mech. (2013) P10023", "doi": "10.1088/1742-5468/2013/10/P10023", "report-no": null, "categories": "cond-mat.dis-nn cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by modeling the dynamics of a population living in a flowing medium\nwhere the environmental factors are random in space, we have studied an\nasymmetric variant of the one-dimensional contact process, where the quenched\nrandom reproduction rates are systematically greater in one direction than in\nthe opposite one. The spatial disorder turns out to be a relevant perturbation\nbut, according to results of Monte Carlo simulations, the behavior of the model\nat the extinction transition is different from the (infinite randomness)\ncritical behavior of the disordered, symmetric contact process. Depending on\nthe strength $a$ of the asymmetry, the critical population drifts either with a\nfinite velocity or with an asymptotically vanishing velocity as $x(t)\\sim\nt^{\\mu(a)}$, where $\\mu(a)<1$. Dynamical quantities are non-self-averaging at\nthe extinction transition; the survival probability, for instance, shows\nmultiscaling, i.e. it is characterized by a broad spectrum of effective\nexponents. For a sufficiently weak asymmetry, a Griffiths phase appears below\nthe extinction transition, where the survival probability decays as a\nnon-universal power of the time while, above the transition, another extended\nphase emerges, where the front of the population advances anomalously with a\ndiffusion exponent continuously varying with the control parameter.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jul 2013 13:28:03 GMT"}, {"version": "v2", "created": "Thu, 24 Oct 2013 12:34:21 GMT"}, {"version": "v3", "created": "Thu, 15 Jan 2015 13:15:03 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Juhász", "Róbert", ""]]}, {"id": "1307.2461", "submitter": "Martin Kapun PhD", "authors": "Martin Kapun, Hester van Schalkwyk, Bryant McAllister, Thomas Flatt\n  and Christian Schl\\\"otterer", "title": "Inference of chromosomal inversion dynamics from Pool-Seq data in\n  natural and laboratory populations of Drosophila melanogaster", "comments": "31 pages, 4 main figures, 1 main table, 7 supporting figures, 11\n  supporting tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sequencing of pools of individuals (Pool-Seq) represents a reliable and cost-\neffective approach for estimating genome-wide SNP and transposable element\ninsertion frequencies. However, Pool-Seq does not provide direct information on\nhaplotypes so that for example obtaining inversion frequencies has not been\npossible until now. Here, we have developed a new set of diagnostic marker SNPs\nfor 7 cosmopolitan inversions in Drosophila melanogaster that can be used to\ninfer inversion frequencies from Pool-Seq data. We applied our novel marker set\nto Pool-Seq data from an experimental evolution study and from North American\nand Australian latitudinal clines. In the experimental evolution data, we find\nevidence that positive selection has driven the frequencies of In(3R)C and\nIn(3R)Mo to increase over time. In the clinal data, we confirm the existence of\nfrequency clines for In(2L)t, In(3L)P and In(3R)Payne in both North America and\nAustralia and detect a previously unknown latitudinal cline for In(3R)Mo in\nNorth America. The inversion markers developed here provide a versatile and\nrobust tool for characterizing inversion frequencies and their dynamics in\nPool- Seq data from diverse D. melanogaster populations.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jul 2013 14:04:06 GMT"}], "update_date": "2013-07-10", "authors_parsed": [["Kapun", "Martin", ""], ["van Schalkwyk", "Hester", ""], ["McAllister", "Bryant", ""], ["Flatt", "Thomas", ""], ["Schlötterer", "Christian", ""]]}, {"id": "1307.2506", "submitter": "Song Xu", "authors": "Song Xu, Xinan Wang, Shuyun Jiao", "title": "Landscape construction in non-gradient dynamics: A case from evolution", "comments": "arXiv admin note: text overlap with arXiv:q-bio/0605020 by other\n  authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Adaptive landscape has been a fundamental concept in many branches of modern\nbiology since Wright's first proposition in 1932. Meanwhile, the general\nexistence of landscape remains controversial. The causes include the mixed uses\nof different landscape definitions with their own different aims and\nadvantages. Sometimes the difficulty and the impossibility of the landscape\nconstruction for complex models are also equated. To clarify these confusions,\nbased on a recent formulation of Wright's theory, the current authors construct\ngeneralized adaptive landscape in a two-loci population model with non-gradient\ndynamics, where the conventional gradient landscape does not exist. On the\ngeneralized landscape, a population moves along an evolutionary trajectory\nwhich always increases or conserves adaptiveness but does not necessarily\nfollow the steepest gradient direction. Comparisons of different aspects of\nvarious landscapes lead to a conclusion that the generalized landscape is a\npossible direction to continue the exploration of Wright's theory for complex\ndynamics.\n", "versions": [{"version": "v1", "created": "Tue, 9 Jul 2013 16:10:01 GMT"}, {"version": "v2", "created": "Mon, 21 Oct 2013 23:36:52 GMT"}, {"version": "v3", "created": "Fri, 6 Jun 2014 19:56:25 GMT"}, {"version": "v4", "created": "Wed, 9 Dec 2015 17:31:26 GMT"}], "update_date": "2015-12-10", "authors_parsed": [["Xu", "Song", ""], ["Wang", "Xinan", ""], ["Jiao", "Shuyun", ""]]}, {"id": "1307.2911", "submitter": "Ignacio Gallo", "authors": "Ignacio Gallo", "title": "Reproduction and ferromagnetism", "comments": "13 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I present a stochastic population model that combines cooperative\ninteractions of the type often used in physics with the process of reproduction\nand death familiar to biology, and I refer to reasons why such interlocking may\nbe of interest to both fields.\n", "versions": [{"version": "v1", "created": "Wed, 10 Jul 2013 20:09:38 GMT"}, {"version": "v2", "created": "Sat, 20 Jul 2013 15:14:45 GMT"}], "update_date": "2013-07-23", "authors_parsed": [["Gallo", "Ignacio", ""]]}, {"id": "1307.3097", "submitter": "Michel Pleimling", "authors": "Ben Intoy and Michel Pleimling", "title": "Extinction in four species cyclic competition", "comments": "18 pages, 13 figures, submitted to J. Stat. Mech", "journal-ref": "J. Stat. Mech (2013) P08011", "doi": "10.1088/1742-5468/2013/08/P08011", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When four species compete stochastically in a cyclic way, the formation of\ntwo teams of mutually neutral partners is observed. In this paper we study\nthrough numerical simulations the extinction processes that can take place in\nthis system both in the well mixed case as well as on different types of\nlattices. The different routes to extinction are revealed by the probability\ndistribution of the domination time, i.e. the time needed for one team to fully\noccupy the system. If swapping is allowed between neutral partners, then the\nprobability distribution is dominated by very long-lived states where a few\nvery large domains persist, each domain being occupied by a mix of individuals\nfrom species that form one of the teams. Many aspects of the possible\nextinction scenarios are lost when only considering averaged quantities as for\nexample the mean domination time.\n", "versions": [{"version": "v1", "created": "Thu, 11 Jul 2013 13:23:36 GMT"}], "update_date": "2013-11-14", "authors_parsed": [["Intoy", "Ben", ""], ["Pleimling", "Michel", ""]]}, {"id": "1307.3434", "submitter": "Jacob Kuriyan", "authors": "Jacob Kuriyan, Nathaniel Cobb", "title": "Forecasts of Cancer and Chronic Patients: Big Data Metrics of Population\n  Health", "comments": "26 pages, 6 figures and 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chronic diseases and cancer account for over 75 percent of healthcare costs\nin the US. Increased prevention services and improved primary care are thought\nto decrease costs. Current models for detecting changes in the health of\npopulations are cumbersome and expensive, and are not sensitive in the short\nterm. In this paper we model population health as a dynamical system to predict\nthe time evolution of the new diagnosis of chronic diseases and cancer. This\nprovides a reliable forecasting tool and a means of measuring short-term\nchanges in the health status of the population resulting from preventive care\nprograms. Twelve month forecasts of cancer and chronic populations were\naccurate with errors lying between 3 percent and 6 percent. We confirmed what\nother studies have demonstrated that diabetes patients are at increased cancer\nrisk but, interestingly, we also discovered that all of the studied chronic\nconditions increased cancer risk just as diabetes did, and by a similar amount.\nThe model(i)yields a new metric for measuring performance of preventive and\nclinical care programs that can provide timely feedback for quality improvement\nprograms;(ii)helps understand \"savings\" in the context of preventive care\nprograms and explains how they can be calculated in the short term, even though\nthey materialize only in the long term and(iii)provides an analytic tool and\nmetrics to infer correlations and derive insights on the effect of changes in\nsocio-economic factors affecting population health on improving health and\nlowering costs of populations.\n", "versions": [{"version": "v1", "created": "Fri, 12 Jul 2013 12:25:24 GMT"}], "update_date": "2013-07-15", "authors_parsed": [["Kuriyan", "Jacob", ""], ["Cobb", "Nathaniel", ""]]}, {"id": "1307.3755", "submitter": "Nikesh Dattani", "authors": "Lila Kari (1), Kathleen A. Hill (2), Abu Sadat Sayem (1), Nathaniel\n  Bryans (3), Katelyn Davis (2), Nikesh S. Dattani (4), ((1) Department of\n  Computer Science, University of Western Ontario, Canada, (2) Department of\n  Biology, University of Western Ontario, Canada, (3) Microsoft Corporation,\n  (4) Department of Chemistry, Oxford University, UK)", "title": "Map of Life: Measuring and Visualizing Species' Relatedness with\n  \"Molecular Distance Maps\"", "comments": "13 pages, 8 figures. Funded by: NSERC/CRSNG (Natural Science &\n  Engineering Research Council of Canada / Conseil de recherches en sciences\n  naturelles et en g\\'enie du Canada), and the Oxford University Press.\n  Acknowledgements: Ronghai Tu, Tao Tao, Steffen Kopecki, Andre Lachance,\n  Jeremy McNeil, Greg Thorn, Oxford University Mathematical Institute", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN cs.CV q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a novel combination of methods that (i) portrays quantitative\ncharacteristics of a DNA sequence as an image, (ii) computes distances between\nthese images, and (iii) uses these distances to output a map wherein each\nsequence is a point in a common Euclidean space. In the resulting \"Molecular\nDistance Map\" each point signifies a DNA sequence, and the geometric distance\nbetween any two points reflects the degree of relatedness between the\ncorresponding sequences and species.\n  Molecular Distance Maps present compelling visual representations of\nrelationships between species and could be used for taxonomic clarifications,\nfor species identification, and for studies of evolutionary history. One of the\nadvantages of this method is its general applicability since, as sequence\nalignment is not required, the DNA sequences chosen for comparison can be\ncompletely different regions in different genomes. In fact, this method can be\nused to compare any two DNA sequences. For example, in our dataset of 3,176\nmitochondrial DNA sequences, it correctly finds the mtDNA sequences most\nclosely related to that of the anatomically modern human (the Neanderthal, the\nDenisovan, and the chimp), and it finds that the sequence most different from\nit belongs to a cucumber. Furthermore, our method can be used to compare real\nsequences to artificial, computer-generated, DNA sequences. For example, it is\nused to determine that the distances between a Homo sapiens sapiens mtDNA and\nartificial sequences of the same length and same trinucleotide frequencies can\nbe larger than the distance between the same human mtDNA and the mtDNA of a\nfruit-fly.\n  We demonstrate this method's promising potential for taxonomical\nclarifications by applying it to a diverse variety of cases that have been\nhistorically controversial, such as the genus Polypterus, the family Tarsiidae,\nand the vast (super)kingdom Protista.\n", "versions": [{"version": "v1", "created": "Sun, 14 Jul 2013 17:16:57 GMT"}], "update_date": "2013-07-16", "authors_parsed": [["Kari", "Lila", ""], ["Hill", "Kathleen A.", ""], ["Sayem", "Abu Sadat", ""], ["Bryans", "Nathaniel", ""], ["Davis", "Katelyn", ""], ["Dattani", "Nikesh S.", ""]]}, {"id": "1307.4036", "submitter": "Henrique Oliveira Prof Dr", "authors": "Jo\\~ao Alves, Ant\\'onio Bravo and Henrique Oliveira", "title": "Population Dynamics with Infinite Leslie Matrices", "comments": "12 Pages", "journal-ref": null, "doi": "10.1080/10236198.2014.915967", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Infinite Leslie matrices, introduced by Demetrius forty years ago are\nmathematical models of age-structured populations defined by a countable\ninfinite number of age classes. This article is concerned with determining\nsolutions of the discrete dynamical system in finite time. We address this\nproblem by appealing to the concept of kneading matrices and kneading\ndeterminants. Our analysis is applicable not only to populations models, but to\nmodels of self-reproducing machines and self-reproducing computer programs. The\ndynamics of theses systems can also be described in terms of infinite Leslie\nmatrices.uation.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jul 2013 18:12:50 GMT"}, {"version": "v2", "created": "Wed, 31 Jul 2013 11:59:07 GMT"}, {"version": "v3", "created": "Sun, 3 Nov 2013 23:47:44 GMT"}, {"version": "v4", "created": "Sat, 7 Mar 2015 10:33:49 GMT"}], "update_date": "2015-03-10", "authors_parsed": [["Alves", "João", ""], ["Bravo", "António", ""], ["Oliveira", "Henrique", ""]]}, {"id": "1307.4103", "submitter": "Alexey Yanchukov", "authors": "Alexey Yanchukov and Stephen R. Proulx", "title": "Migration-selection balance at multiple loci and selection on dominance\n  and recombination", "comments": "includes 6 figures and a Supporting Information. Mathematica notebook\n  where the numerical results were obtained is available upon request", "journal-ref": null, "doi": "10.1371/journal.pone.0088651", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A steady influx of a single deleterious multilocus genotype will impose\ngenetic load on the resident population and leave multiple descendants carrying\nvarious numbers of the foreign alleles. Provided that the foreign types are\nrare at equilibrium, and that all immigrant genes will eventually be eliminated\nby selection, the population structure can be inferred explicitly from the\ndeterministic branching process taking place within a single immigrant lineage.\nUnless the migration and recombination rates were high, this simple method was\na very close approximation to the simulated migration-selection balance with\nall possible multilocus genotypes considered.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jul 2013 21:06:44 GMT"}, {"version": "v2", "created": "Thu, 1 Aug 2013 02:02:43 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Yanchukov", "Alexey", ""], ["Proulx", "Stephen R.", ""]]}, {"id": "1307.4118", "submitter": "Yaniv Brandvain", "authors": "Yaniv Brandvain, Tanja Slotte, Khaled Hazzouri, Stephen Wright and\n  Graham Coop", "title": "Genomic identification of founding haplotypes reveals the history of the\n  selfing species Capsella rubella", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The shift from outcrossing to self-fertilization is among the most common\ntransitions in plants. Until recently, however, a genome-wide view of this\ntransition has been obscured by a dearth of appropriate data and the lack of\nappropriate population genomic methods to interpret such data. Here, we present\nnovel analyses detailing the origin of the selfing species, Capsella rubella,\nwhich recently split from its outcrossing sister, Capsella grandiflora. Due to\nthe recency of the split, most variation within C. rubella is found within C.\ngrandiflora. We can therefore identify genomic regions where two C. rubella\nindividuals have inherited the same or different segments of ancestral\ndiversity (i.e. founding haplotypes) present in C. rubella's founder(s). Based\non this analysis, we show that C. rubella was founded by multiple individuals\ndrawn from a diverse ancestral population closely related to extant C.\ngrandiflora, that drift and selection have rapidly homogenized most of this\nancestral variation since C. rubella's founding, and that little novel\nvariation has accumulated within this time. Despite the extensive loss of\nancestral variation, the approximately 25% of the genome for which two C.\nrubella individuals have inherited different founding haplotypes makes up\nroughly 90% of the genetic variation between them. To extend these findings, we\ndevelop a coalescent model that utilizes the inferred frequency of founding\nhaplotypes and variation within founding haplotypes to estimate that C. rubella\nwas founded by a potentially large number of individuals 50-100 kya, and has\nsubsequently experienced a 20X reduction in its effective population size. As\npopulation genomic data from an increasing number of outcrossing/selfing pairs\nare generated, analyses like this here will facilitate a fine-scaled view of\nthe evolutionary and demographic impact of the transition to\nself-fertilization.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jul 2013 22:18:00 GMT"}], "update_date": "2013-07-17", "authors_parsed": [["Brandvain", "Yaniv", ""], ["Slotte", "Tanja", ""], ["Hazzouri", "Khaled", ""], ["Wright", "Stephen", ""], ["Coop", "Graham", ""]]}, {"id": "1307.4137", "submitter": "Michael DeGiorgio", "authors": "Michael DeGiorgio, Kirk E. Lohmueller, Rasmus Nielsen", "title": "A model-based approach for identifying signatures of balancing selection\n  in genetic data", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While much effort has focused on detecting positive and negative directional\nselection in the human genome, relatively little work has been devoted to\nbalancing selection. This lack of attention is likely due to the paucity of\nsophisticated methods for identifying sites under balancing selection. Here we\ndevelop two composite likelihood ratio tests for detecting balancing selection.\nUsing simulations, we show that these methods outperform competing methods\nunder a variety of assumptions and demographic models. We apply the new methods\nto whole-genome human data, and find a number of previously-identified loci\nwith strong evidence of balancing selection, including several HLA genes.\nAdditionally, we find evidence for many novel candidates, the strongest of\nwhich is FANK1, an imprinted gene that suppresses apoptosis, is expressed\nduring meiosis in males, and displays marginal signs of segregation distortion.\nWe hypothesize that balancing selection acts on this locus to stabilize the\nsegregation distortion and negative fitness effects of the distorter allele.\nThus, our methods are able to reproduce many previously-hypothesized signals of\nbalancing selection, as well as discover novel interesting candidates.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 00:55:29 GMT"}], "update_date": "2013-07-17", "authors_parsed": [["DeGiorgio", "Michael", ""], ["Lohmueller", "Kirk E.", ""], ["Nielsen", "Rasmus", ""]]}, {"id": "1307.4141", "submitter": "Naoki Masuda Dr.", "authors": "Naoki Masuda", "title": "Evolution via imitation among like-minded individuals", "comments": "3 figures", "journal-ref": "Journal of Theoretical Biology, 349, 100-108 (2014)", "doi": "10.1016/j.jtbi.2014.02.003", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In social situations with which evolutionary game is concerned, individuals\nare considered to be heterogeneous in various aspects. In particular, they may\ndifferently perceive the same outcome of the game owing to heterogeneity in\nidiosyncratic preferences, fighting abilities, and positions in a social\nnetwork. In such a population, an individual may imitate successful and similar\nothers, where similarity refers to that in the idiosyncratic fitness function.\nI propose an evolutionary game model with two subpopulations on the basis of\nmultipopulation replicator dynamics to describe such a situation. In the\nproposed model, pairs of players are involved in a two-person game as a\nwell-mixed population, and imitation occurs within subpopulations in each of\nwhich players have the same payoff matrix. It is shown that the model does not\nallow any internal equilibrium such that the dynamics differs from that of\nother related models such as the bimatrix game. In particular, even a slight\ndifference in the payoff matrix in the two subpopulations can make the opposite\nstrategies to be stably selected in the two subpopulations in the snowdrift and\ncoordination games.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 01:20:47 GMT"}, {"version": "v2", "created": "Thu, 6 Mar 2014 17:20:32 GMT"}], "update_date": "2014-03-07", "authors_parsed": [["Masuda", "Naoki", ""]]}, {"id": "1307.4266", "submitter": "Coryn Bailer-Jones", "authors": "C.A.L. Bailer-Jones, F. Feng (Max Planck Institute for Astronomy,\n  Heidelberg)", "title": "Evidence for periodicities in the extinction record? Response to Melott\n  & Bambach [arXiv:1307.1884]", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "astro-ph.EP astro-ph.GA physics.bio-ph physics.geo-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a recent paper, we applied time series analysis methods to study the\npossible influence of the solar motion through the Galaxy on terrestrial\nextinction (Feng & Bailer-Jones 2013). We drew conclusions about the relative\nprobabilities of how well different models explain the geological extinction\nrecord. We found no strong evidence for either a periodicity in the extinction\nrecord or for a link between the solar orbit and this extinction record. In\nresponse to this, Melott & Bambach (2013) dedicate the majority of their\narticle to criticizing our analysis. Their main objection is to evidence-based\nmodel comparison. Here we deal with their criticisms one by one, and show that\nthey are largely misplaced, leaving our conclusions unaffected. The bottom line\nis that although one can get a periodic model at some period to fit the\nextinction data, there are other models which explain the data better.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 13:16:28 GMT"}], "update_date": "2013-07-17", "authors_parsed": [["Bailer-Jones", "C. A. L.", "", "Max Planck Institute for Astronomy,\n  Heidelberg"], ["Feng", "F.", "", "Max Planck Institute for Astronomy,\n  Heidelberg"]]}, {"id": "1307.4325", "submitter": "Jorge Hidalgo", "authors": "Jorge Hidalgo, Jacopo Grilli, Samir Suweis, Miguel A. Munoz, Jayanth\n  R. Banavar and Amos Maritan", "title": "Information-based fitness and the emergence of criticality in living\n  systems", "comments": "Main text: 9 pages, 3 figures. Supplementary Information: 22 pages,\n  14 figures, 3 videos", "journal-ref": "Proc. Natl. Acad. Sci. USA 111(28), 10095-10100 (2014)", "doi": "10.1073/pnas.1319166111", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Empirical evidence suggesting that living systems might operate in the\nvicinity of critical points, at the borderline between order and disorder, has\nproliferated in recent years, with examples ranging from spontaneous brain\nactivity to flock dynamics. However, a well-founded theory for understanding\nhow and why interacting living systems could dynamically tune themselves to be\npoised in the vicinity of a critical point is lacking. Here we employ tools\nfrom statistical mechanics and information theory to show that complex adaptive\nor evolutionary systems can be much more efficient in coping with diverse\nheterogeneous environmental conditions when operating at criticality.\nAnalytical as well as computational evolutionary and adaptive models vividly\nillustrate that a community of such systems dynamically self-tunes close to a\ncritical state as the complexity of the environment increases while they remain\nnon-critical for simple and predictable environments. A more robust convergence\nto criticality emerges in co-evolutionary and co-adaptive set-ups in which\nindividuals aim to represent other agents in the community with fidelity,\nthereby creating a collective critical ensemble and providing the best possible\ntrade-off between accuracy and flexibility. Our approach provides a\nparsimonious and general mechanism for the emergence of critical-like behavior\nin living systems needing to cope with complex environments or trying to\nefficiently coordinate themselves as an ensemble.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 16:14:18 GMT"}, {"version": "v2", "created": "Thu, 24 Jul 2014 15:54:46 GMT"}], "update_date": "2014-07-25", "authors_parsed": [["Hidalgo", "Jorge", ""], ["Grilli", "Jacopo", ""], ["Suweis", "Samir", ""], ["Munoz", "Miguel A.", ""], ["Banavar", "Jayanth R.", ""], ["Maritan", "Amos", ""]]}, {"id": "1307.4327", "submitter": "Ulrich Dobramysl", "authors": "Ulrich Dobramysl, Uwe C. Tauber", "title": "Environmental vs demographic variability in stochastic predator-prey\n  models", "comments": "28 pages, 10 figures, Proceedings paper of the STATPHYS 25 conference", "journal-ref": "J. Stat. Mech. (2013) P10001", "doi": "10.1088/1742-5468/2013/10/P10001", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In contrast to the neutral population cycles of the deterministic mean-field\nLotka--Volterra rate equations, including spatial structure and stochastic\nnoise in models for predator-prey interactions yields complex spatio-temporal\nstructures associated with long-lived erratic population oscillations.\nEnvironmental variability in the form of quenched spatial randomness in the\npredation rates results in more localized activity patches. Population\nfluctuations in rare favorable regions in turn cause a remarkable increase in\nthe asymptotic densities of both predators and prey. Very intriguing features\nare found when variable interaction rates are affixed to individual particles\nrather than lattice sites. Stochastic dynamics with demographic variability in\nconjunction with inheritable predation efficiencies generate non-trivial time\nevolution for the predation rate distributions, yet with overall essentially\nneutral optimization.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 16:16:22 GMT"}], "update_date": "2013-10-16", "authors_parsed": [["Dobramysl", "Ulrich", ""], ["Tauber", "Uwe C.", ""]]}, {"id": "1307.4362", "submitter": "Robert J. Gooding", "authors": "Benoit M. Cyrenne and R. J. Gooding", "title": "Incorporating the Hayflick Limit into a model of Telomere Dynamics", "comments": null, "journal-ref": null, "doi": "10.1016/j.physa.2014.10.047", "report-no": null, "categories": "physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A model of telomere dynamics is proposed and examined. Our model, which\nextends a previously introduced two-compartment model that incorporates stem\ncells as progenitors of new cells, imposes the Hayflick Limit, the maximum\nnumber of cell divisions that are possible. This new model leads to cell\npopulations for which the average telomere length is not necessarily a\nmonotonically decreasing function of time, in contrast to previously published\nmodels. We provide a phase diagram indicating where such results would be\nexpected. In addition, qualitatively different results are obtained for the\nevolution of the total cell population. Last, in comparison to available\nleukocyte baboon data, this new model is shown to provide a better fit to\nbiological data.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 18:19:58 GMT"}], "update_date": "2018-05-15", "authors_parsed": [["Cyrenne", "Benoit M.", ""], ["Gooding", "R. J.", ""]]}, {"id": "1307.4375", "submitter": "Mauro Mobilia", "authors": "Mauro Mobilia", "title": "Evolutionary games with facilitators: When does selection favor\n  cooperation?", "comments": "12 pages, 5 figures. Version to be published (special issue on\n  \"collective behavior and evolutionary games\")", "journal-ref": "Chaos, Solitons & Fractals 56, 113 (2013)", "doi": "10.1016/j.chaos.2013.07.011", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech nlin.AO physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the combined influence of selection and random fluctuations on the\nevolutionary dynamics of two-strategy (\"cooperation\" and \"defection\") games in\npopulations comprising cooperation facilitators. The latter are individuals\nthat support cooperation by enhancing the reproductive potential of cooperators\nrelative to the fitness of defectors. By computing the fixation probability of\na single cooperator in finite and well-mixed populations that include a fixed\nnumber of facilitators, and by using mean field analysis, we determine when\nselection promotes cooperation in the important classes of prisoner's dilemma,\nsnowdrift and stag-hunt games. In particular, we identify the circumstances\nunder which selection favors the replacement and invasion of defection by\ncooperation. Our findings, corroborated by stochastic simulations, show that\nthe spread of cooperation can be promoted through various scenarios when the\ndensity of facilitators exceeds a critical value whose dependence on the\npopulation size and selection strength is analyzed. We also determine under\nwhich conditions cooperation is more likely to replace defection than vice\nversa.\n  Keywords: Evolutionary games; dynamics of cooperation; social dilemmas;\nfixation; population dynamics.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 18:50:31 GMT"}, {"version": "v2", "created": "Sat, 17 Aug 2013 15:46:32 GMT"}], "update_date": "2013-11-13", "authors_parsed": [["Mobilia", "Mauro", ""]]}, {"id": "1307.4415", "submitter": "Carl Boettiger", "authors": "Carl Boettiger and Alan Hastings", "title": "No early warning signals for stochastic transitions: insights from large\n  deviation theory", "comments": null, "journal-ref": "2013. Proceedings of the Royal Society B: Biological Sciences 280,\n  20131372-20131372", "doi": "10.1098/rspb.2013.1372", "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  A reply to Drake (2013) \"Early warning signals of stochastic switching\"\nhttp://dx.doi.org/10.1098/rspb.2013.0686\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 20:11:28 GMT"}], "update_date": "2013-07-18", "authors_parsed": [["Boettiger", "Carl", ""], ["Hastings", "Alan", ""]]}, {"id": "1307.4417", "submitter": "Von Bing Yap", "authors": "Von Bing Yap", "title": "Re-imagining the Hardy-Weinberg Law", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Under random mating, a progeny's alleles are independently sampled from the\nparental gene pools. Here is a new proof which avoids the usual algebraic\ncomplexity, based on a restated Mendel's First Law. Another simplified proof\nalong the old approach led to the discovery that allelic independence can hold\nunder random mating and fertility selection. The theoretical existence and\nnumber of such selection coefficients are established.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 20:28:06 GMT"}, {"version": "v2", "created": "Tue, 10 Sep 2013 14:41:14 GMT"}, {"version": "v3", "created": "Wed, 16 Dec 2015 04:34:13 GMT"}], "update_date": "2015-12-17", "authors_parsed": [["Yap", "Von Bing", ""]]}, {"id": "1307.4628", "submitter": "Sarabjeet Singh", "authors": "Sarabjeet Singh, David J. Schneider and Christopher R. Myers", "title": "The structure of infectious disease outbreaks across the animal-human\n  interface", "comments": "18 pages (8 main text + 10 Appendix), 15 figures in total, currently\n  submitted to a journal for review", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the enormous relevance of zoonotic infections to world- wide public\nhealth, and despite much effort in modeling individual zoonoses, a fundamental\nunderstanding of the disease dynamics and the nature of outbreaks arising in\nsuch systems is still lacking. We introduce a simple stochastic model of\nsusceptible-infected- recovered dynamics in a coupled animal-human\nmetapopulation, and solve analytically for several important properties of the\ncou- pled outbreaks. At early timescales, we solve for the probability and time\nof spillover, and the disease prevalence in the animal population at spillover\nas a function of model parameters. At long times, we characterize the\ndistribution of outbreak sizes and the critical threshold for a large human\noutbreak, both of which show a strong dependence on the basic reproduction\nnumber in the animal population. The coupling of animal and human infection\ndynamics has several crucial implications, most importantly al- lowing for the\npossibility of large human outbreaks even when human-to-human transmission is\nsubcritical.\n", "versions": [{"version": "v1", "created": "Tue, 16 Jul 2013 16:05:33 GMT"}], "update_date": "2013-07-18", "authors_parsed": [["Singh", "Sarabjeet", ""], ["Schneider", "David J.", ""], ["Myers", "Christopher R.", ""]]}, {"id": "1307.4789", "submitter": "Wes Maciejewski", "authors": "Wes Maciejewski", "title": "Reproductive Value in Graph-structured Populations", "comments": null, "journal-ref": "Journal of Theoretical Biology, (2014), vol.340, pp.285-293", "doi": "10.1016/j.jtbi.2013.09.032", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary graph theory has grown to be an area of intense study. Despite\nthe amount of interest in the field, it seems to have grown separate from other\nsubfields of population genetics and evolution. In the current work I introduce\nthe concept of Fisher's (1930) reproductive value into the study of evolution\non graphs. Reproductive value is a measure of the expected genetic contribution\nof an individual to a distant future generation. In a heterogeneous\ngraph-structured population, differences in the number of connections among\nindividuals translates into differences in the expected number of offspring,\neven if all individuals have the same fecundity. These differences are\naccounted for by reproductive value. The introduction of reproductive value\npermits the calculation of the fixation probability of a mutant in a neutral\nevolutionary process in any graph-structured population for either the moran\nbirth-death or death-birth process.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jul 2013 20:56:44 GMT"}], "update_date": "2014-07-30", "authors_parsed": [["Maciejewski", "Wes", ""]]}, {"id": "1307.4954", "submitter": "Robert Kofler", "authors": "Robert Kofler and Christian Schl\\\"otterer", "title": "Guidelines for the design of evolve and resequencing studies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Standing genetic variation provides a rich reservoir of potentially useful\nmutations facilitating the adaptation to novel environments. Experimental\nevolution studies have demonstrated that rapid and strong phenotypic responses\nto selection can also be obtained in the laboratory. When combined with the\nNext Generation Sequencing technology, these experiments promise to identify\nthe individual loci contributing to adaption. Nevertheless, until now, very\nlittle is known about the design of such evolve and resequencing (E&R) studies.\nHere, we use forward simulations of entire genomes to evaluate different\nexperimental designs that aim to maximize the power to detect selected\nvariants. We show that low linkage disequilibrium in the starting population,\npopulation size, duration of the experiment and the number of replicates are\nthe key factors in determining the power and accuracy of E&R studies.\nFurthermore, replication of E&R is more important for detecting the targets of\nselection than increasing the population size. Using an optimized design\nbeneficial loci with a selective advantage as low as s=0.005 can be identified\nat the nucleotide level. Even when a large number of loci are selected\nsimultaneously, up to 56% can be reliably detected without incurring large\nnumbers of false positives. Our computer simulations suggest that, with an\nadequate experimental design, E&R studies are a powerful tool to identify\nadaptive mutations from standing genetic variation and thereby provide an\nexcellent means to analyze the trajectories of selected alleles in evolving\npopulations.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jul 2013 14:16:16 GMT"}], "update_date": "2013-07-19", "authors_parsed": [["Kofler", "Robert", ""], ["Schlötterer", "Christian", ""]]}, {"id": "1307.5050", "submitter": "Guy Katriel", "authors": "Guy Katriel", "title": "Existence of periodic solutions for the periodically forced SIR model", "comments": null, "journal-ref": "Neliniini Kolyvannya (Nonlinear Oscillations) 16 (2013), 359-366,\n  Journal of Mathemarical Sciences 201 (2014) 335-342", "doi": "10.1007/s10958-014-1993-x", "report-no": null, "categories": "q-bio.PE math.DS nlin.CD", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove that the seasonally-forced SIR model with a T-periodic forcing has a\nperiodic solution with period T whenever the basic reproductive number R0>1.\nThe proof uses the Leray-Schauder degree theory. We also describe some\nnumerical results in which we compute the T-periodic solution, where in order\nto obtain the T-periodic solution when the behavior of the system is\nsubharmonic or chaotic, we use a Galerkin scheme.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jul 2013 19:17:28 GMT"}], "update_date": "2014-08-12", "authors_parsed": [["Katriel", "Guy", ""]]}, {"id": "1307.5147", "submitter": "Mike Steel Prof.", "authors": "Mike Steel", "title": "An Arrow-type result for inferring a species tree from gene trees", "comments": "5 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The reconstruction of a central tendency `species tree' from a large number\nof conflicting gene trees is a central problem in systematic biology. Moreover,\nit becomes particularly problematic when taxon coverage is patchy, so that not\nall taxa are present in every gene tree. Here, we list four desirable\nproperties that a method for estimating a species tree from gene trees should\nhave. We show that while these can be achieved when taxon coverage is complete\n(by the Adams consensus method), they cannot all be satisfied in the more\ngeneral setting of partial taxon coverage.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jul 2013 07:47:32 GMT"}], "update_date": "2013-07-22", "authors_parsed": [["Steel", "Mike", ""]]}, {"id": "1307.5300", "submitter": "Yoshiharu Maeno", "authors": "Yoshiharu Maeno", "title": "Detecting a trend change in cross-border epidemic transmission", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A method for detecting a trend change in cross-border epidemic transmission\nis developed for a standard epidemiological SIR compartment model and a\nmeta-population network model. The method is applicable to investigating the\nefficacy of the implemented public health intervention in managing infectious\ntravelers across borders from a time series of the number of new cases reported\nin multiple geographical regions. It is found that the change point of the\nprobability of travel movements was one week after the WHO worldwide alert on\nthe SARS outbreak in 2003. The alert was effective in managing infectious\ntravelers. On the other hand, it is found that the probability of travel\nmovements did not change at all for the flu pandemic in 2009. The pandemic did\nnot affect potential travelers despite the WHO alert.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jul 2013 08:38:27 GMT"}, {"version": "v2", "created": "Thu, 21 Nov 2013 14:59:41 GMT"}, {"version": "v3", "created": "Mon, 29 Jun 2015 01:55:13 GMT"}, {"version": "v4", "created": "Tue, 30 Jun 2015 02:28:22 GMT"}, {"version": "v5", "created": "Wed, 14 Oct 2015 07:05:50 GMT"}], "update_date": "2015-10-15", "authors_parsed": [["Maeno", "Yoshiharu", ""]]}, {"id": "1307.5335", "submitter": "Blake Stacey", "authors": "M.A.M. de Aguiar, E. Rauch, B.C. Stacey, Y. Bar-Yam", "title": "Mean Field Approximation to a Spatial Host-Pathogen Model", "comments": "7 pages (1 of errata), 1 figure; original paper by MdA, ER and YB;\n  errata by MdA, BCS and YB. v2: additional misprints corrected and docketed", "journal-ref": "Physical Review E 67, 047102 (2003)", "doi": "10.1103/PhysRevE.67.047102", "report-no": null, "categories": "q-bio.PE nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the mean field approximation to a simple spatial host-pathogen model\nthat has been shown to display interesting evolutionary properties. We show\nthat previous derivations of the mean field equations for this model are\nactually only low-density approximations to the true mean field limit. We\nderive the correct equations and the corresponding equations including\npair-correlations. The process of invasion by a mutant type of pathogen is also\ndiscussed. [This article was published as Physical Review E 67, 047102 (2003).\nErrata for the published version are corrected here and explicitly listed at\nthe end of this document.]\n", "versions": [{"version": "v1", "created": "Fri, 19 Jul 2013 20:47:19 GMT"}, {"version": "v2", "created": "Tue, 27 Aug 2013 05:25:19 GMT"}], "update_date": "2013-08-28", "authors_parsed": [["de Aguiar", "M. A. M.", ""], ["Rauch", "E.", ""], ["Stacey", "B. C.", ""], ["Bar-Yam", "Y.", ""]]}, {"id": "1307.5364", "submitter": "Dominique Gravel", "authors": "Claire Jacquet, Charlotte Moritz, Lyne Morissette, Pierre Legagneux,\n  Fran\\c{c}ois Massol, Phillippe Archambault, Dominique Gravel", "title": "No complexity-stability relationship in natural communities", "comments": "Main text: 9 pages, 4 figures. Supplementary Information: 14 pages, 3\n  figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We performed a stability analysis of 119 quantitative food webs which were\ncompiled using a standard methodology to build Ecopath mass-balance models. Our\nanalysis reveals that classic descriptors of complexity do not affect stability\nin natural food webs. Food web structure, which is non-random in real\ncommunities, reflects another form of complexity that we found influences\ndramatically the stability of real communities. We conclude that the occurrence\nof complex communities in nature is possible owing to their trophic structure.\n", "versions": [{"version": "v1", "created": "Sat, 20 Jul 2013 01:51:27 GMT"}], "update_date": "2013-07-23", "authors_parsed": [["Jacquet", "Claire", ""], ["Moritz", "Charlotte", ""], ["Morissette", "Lyne", ""], ["Legagneux", "Pierre", ""], ["Massol", "François", ""], ["Archambault", "Phillippe", ""], ["Gravel", "Dominique", ""]]}, {"id": "1307.5563", "submitter": "William Bialek", "authors": "William Bialek, Andrea Cavagna, Irene Giardina, Thierry Mora, Oliver\n  Pohl, Edmondo Silvestri, Massimiliano Viale, and Aleksandra Walczak", "title": "Social interactions dominate speed control in driving natural flocks\n  toward criticality", "comments": null, "journal-ref": null, "doi": "10.1073/pnas.1324045111", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flocks of birds exhibit a remarkable degree of coordination and collective\nresponse. It is not just that thousands of individuals fly, on average, in the\nsame direction and at the same speed, but that even the fluctuations around the\nmean velocity are correlated over long distances. Quantitative measurements on\nflocks of starlings, in particular, show that these fluctuations are\nscale-free, with effective correlation lengths proportional to the linear size\nof the flock. Here we construct models for the joint distribution of velocities\nin the flock that reproduce the observed local correlations between individuals\nand their neighbors, as well as the variance of flight speeds across\nindividuals, but otherwise have as little structure as possible. These\nminimally structured, or maximum entropy models provide quantitative,\nparameter-free predictions for the spread of correlations throughout the flock,\nand these are in excellent agreement with the data. These models are\nmathematically equivalent to statistical physics models for ordering in\nmagnets, and the correct prediction of scale-free correlations arises because\nthe parameters - completely determined by the data - are in the critical\nregime. In biological terms, criticality allows the flock to achieve maximal\ncorrelation across long distances with limited speed fluctuations.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jul 2013 20:02:40 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Bialek", "William", ""], ["Cavagna", "Andrea", ""], ["Giardina", "Irene", ""], ["Mora", "Thierry", ""], ["Pohl", "Oliver", ""], ["Silvestri", "Edmondo", ""], ["Viale", "Massimiliano", ""], ["Walczak", "Aleksandra", ""]]}, {"id": "1307.5574", "submitter": "Jeremy Sumner", "authors": "Peter D Jarvis and Jeremy G Sumner", "title": "Matrix group structure and Markov invariants in the strand symmetric\n  phylogenetic substitution model", "comments": "v2: Major revision now includes explicit forms for quadratic and\n  cubic Markov invariants", "journal-ref": "J Mathematical Biology (Online First, Dec 2015)", "doi": "10.1007/s00285-015-0951-7", "report-no": null, "categories": "q-bio.PE math.RT math.ST q-bio.QM stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the continuous-time presentation of the strand symmetric\nphylogenetic substitution model (in which rate parameters are unchanged under\nnucleotide permutations given by Watson-Crick base conjugation). Algebraic\nanalysis of the model's underlying structure as a matrix group leads to a\nchange of basis where the rate generator matrix is given by a two-part block\ndecomposition. We apply representation theoretic techniques and, for any\n(fixed) number of phylogenetic taxa $L$ and polynomial degree $D$ of interest,\nprovide the means to classify and enumerate the associated Markov invariants.\nIn particular, in the quadratic and cubic cases we prove there are precisely\n1/3$(3^L+(-1)^L)$ and $6^{L-1}$ linearly independent Markov invariants,\nrespectively. Additionally, we give the explicit polynomial forms of the Markov\ninvariants for (i) the quadratic case with any number of taxa $L$, and (ii) the\ncubic case in the special case of a three-taxa phylogenetic tree. We close by\nshowing our results are of practical interest since the quadratic Markov\ninvariants provide independent estimates of phylogenetic distances based on (i)\nsubstitution rates within Watson-Crick conjugate pairs, and (ii) substitution\nrates across conjugate base pairs.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jul 2013 00:51:40 GMT"}, {"version": "v2", "created": "Tue, 28 Oct 2014 05:55:19 GMT"}], "update_date": "2016-02-11", "authors_parsed": [["Jarvis", "Peter D", ""], ["Sumner", "Jeremy G", ""]]}, {"id": "1307.5631", "submitter": "Stefania Melillo", "authors": "A. Attanasi, A. Cavagna, L. Del Castello, I. Giardina, S. Melillo, L.\n  Parisi, O. Pohl, B. Rossaro, E. Shen, E. Silvestri, M. Viale", "title": "Collective behaviour without collective order in wild swarms of midges", "comments": "The original version has been split into two parts. This first part\n  focuses on order vs. correlation. The second part, about finite-size scaling,\n  will be included in a separate paper. 15 pages, 6 figures, 1 table, 5 videos", "journal-ref": null, "doi": "10.1371/journal.pcbi.1003697", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Collective behaviour is a widespread phenomenon in biology, cutting through a\nhuge span of scales, from cell colonies up to bird flocks and fish schools. The\nmost prominent trait of collective behaviour is the emergence of global order:\nindividuals synchronize their states, giving the stunning impression that the\ngroup behaves as one. In many biological systems, though, it is unclear whether\nglobal order is present. A paradigmatic case is that of insect swarms, whose\nerratic movements seem to suggest that group formation is a mere epiphenomenon\nof the independent interaction of each individual with an external landmark. In\nthese cases, whether or not the group behaves truly collectively is debated.\nHere, we experimentally study swarms of midges in the field and measure how\nmuch the change of direction of one midge affects that of other individuals. We\ndiscover that, despite the lack of collective order, swarms display very strong\ncorrelations, totally incompatible with models of noninteracting particles. We\nfind that correlation increases sharply with the swarm's density, indicating\nthat the interaction between midges is based on a metric perception mechanism.\nBy means of numerical simulations we demonstrate that such growing correlation\nis typical of a system close to an ordering transition. Our findings suggest\nthat correlation, rather than order, is the true hallmark of collective\nbehaviour in biological systems.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jul 2013 09:37:11 GMT"}, {"version": "v2", "created": "Tue, 15 Apr 2014 13:55:27 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Attanasi", "A.", ""], ["Cavagna", "A.", ""], ["Del Castello", "L.", ""], ["Giardina", "I.", ""], ["Melillo", "S.", ""], ["Parisi", "L.", ""], ["Pohl", "O.", ""], ["Rossaro", "B.", ""], ["Shen", "E.", ""], ["Silvestri", "E.", ""], ["Viale", "M.", ""]]}, {"id": "1307.5747", "submitter": "Charles Perretti", "authors": "Charles T. Perretti, Stephan B. Munch, George Sugihara", "title": "Reply to Hartig et al. [arXiv:1305.3544]: The \"true model\" myth", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have shown that commonly used model-fitting methods fail when the\nunderlying ecological system is chaotic. Importantly, Hartig & Dormann\n[arXiv:1305.3544] suggest an alternative method that is able to overcome this\nproblem for the logistic model when the \"true model\" is known. This is\nencouraging, however the more relevant test is of the method when the \"true\nmodel\" is unknown, as it always is for real ecosystems. By making a small\nmodification to the \"true model,\" we find that the suggested method provides\ninaccurate forecasts and severely biased estimates of the ecological dynamics.\nIn contrast, a model-free approach is able to provide accurate forecasts and a\nuseful foundation for ecological understanding without the burdensome\nassumption of a \"true model.\"\n", "versions": [{"version": "v1", "created": "Mon, 22 Jul 2013 15:38:05 GMT"}], "update_date": "2013-07-23", "authors_parsed": [["Perretti", "Charles T.", ""], ["Munch", "Stephan B.", ""], ["Sugihara", "George", ""]]}, {"id": "1307.5908", "submitter": "Ruth Davidson", "authors": "Ruth Davidson and Seth Sullivant", "title": "Distance-based phylogenetic methods around a polytomy", "comments": "21 pages, 9 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.CO q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Distance-based phylogenetic algorithms attempt to solve the NP-hard least\nsquares phylogeny problem by mapping an arbitrary dissimilarity map\nrepresenting biological data to a tree metric. The set of all dissimilarity\nmaps is a Euclidean space properly containing the space of all tree metrics as\na polyhedral fan. Outputs of distance-based tree reconstruction algorithms such\nas UPGMA and Neighbor-Joining are points in the maximal cones in the fan. Tree\nmetrics with polytomies lie at the intersections of maximal cones.\n  A phylogenetic algorithm divides the space of all dissimilarity maps into\nregions based upon which combinatorial tree is reconstructed by the algorithm.\nComparison of phylogenetic methods can be done by comparing the geometry of\nthese regions. We use polyhedral geometry to compare the local nature of the\nsubdivisions induced by least squares phylogeny, UPGMA, and Neighbor-Joining.\nOur results suggest that in some circumstances, UPGMA and Neighbor-Joining\npoorly match least squares phylogeny when the true tree has a polytomy.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jul 2013 23:23:07 GMT"}], "update_date": "2013-07-24", "authors_parsed": [["Davidson", "Ruth", ""], ["Sullivant", "Seth", ""]]}, {"id": "1307.6043", "submitter": "Valentina Agoni", "authors": "Valentina Agoni", "title": "New outcomes in mutation rates analysis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The GC-content is very variable in different genome regions and species but\nalthough many hypothesis we still do not know the reason why. Here we show that\na relationship exists with the mutation rate, in particular we noticed a new\nrecurrence in the amino acids coding table. Moreover we analyze recombination\nfrequency taking into account Single Nucleotide Polymorphisms hourglass\ndistribution.\n", "versions": [{"version": "v1", "created": "Sun, 21 Jul 2013 07:37:39 GMT"}], "update_date": "2013-07-24", "authors_parsed": [["Agoni", "Valentina", ""]]}, {"id": "1307.6071", "submitter": "Yong-Jung Kim", "authors": "Changwook Yoon and Yong-Jung Kim", "title": "Bacterial chemotaxis without gradient-sensing", "comments": "19 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Models for chemotaxis are based on gradient sensing of individual organisms.\nThe key contribution of Keller and Segel is showing that erratic movements of\nindividuals may result in an accurate chemotaxis phenomenon as a group. In this\npaper we provide another option to understand chemotactic behavior when\nindividuals do not sense the gradient of chemical concentration by any means.\nWe show that, if individuals increase their motility to find food when they are\nhungry, an accurate chemotactic behavior may obtained without sensing the\ngradient. Such a random dispersal has been suggested by Cho and Kim and is\ncalled starvation driven diffusion. This model is surprisingly similar to the\noriginal derivation of Keller-Segel model. A comprehensive picture of traveling\nband and front solutions is provided with numerical simulations.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jul 2013 13:35:37 GMT"}, {"version": "v2", "created": "Mon, 29 Jul 2013 23:18:35 GMT"}], "update_date": "2013-07-31", "authors_parsed": [["Yoon", "Changwook", ""], ["Kim", "Yong-Jung", ""]]}, {"id": "1307.6086", "submitter": "Xiao-Pu Han", "authors": "Ya-Nan Pan, Jing-Jing Lou, Xiao-Pu Han", "title": "Outbreak Patterns of the Novel Avian Influenza (H7N9)", "comments": "13 pages, 3 figures", "journal-ref": null, "doi": "10.1016/j.physa.2014.01.040", "report-no": null, "categories": "physics.soc-ph physics.data-an q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The attack of novel avian influenza (H7N9) in east China caused a serious\nhealth crisis and public panic. In this paper, we empirically analyze the onset\npatterns of human cases of the novel avian influenza and observe several\nspatial and temporal properties that are similar to other infective diseases.\nMore deeply, using the empirical analysis and modeling studies, we find that\nthe spatio-temporal network that connects the cities with human cases along the\norder of outbreak timing emerges two-section-power-law edge-length\ndistribution, indicating the picture that several islands with higher and\nheterogeneous risk straggle in east China. The proposed method is applicable to\nthe analysis on the spreading situation in early stage of disease outbreak\nusing quite limited dataset.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jul 2013 14:01:54 GMT"}, {"version": "v2", "created": "Sun, 28 Jul 2013 12:27:29 GMT"}, {"version": "v3", "created": "Thu, 19 Dec 2013 04:28:13 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Pan", "Ya-Nan", ""], ["Lou", "Jing-Jing", ""], ["Han", "Xiao-Pu", ""]]}, {"id": "1307.6177", "submitter": "Jose Fontanari", "authors": "Jose F. Fontanari and Maurizio Serva", "title": "Nonlinear group survival in Kimura's model for the evolution of altruism", "comments": null, "journal-ref": "Mathematical Biosciences 249 (2014), 18-26", "doi": "10.1016/j.mbs.2014.01.003", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Establishing the conditions that guarantee the spreading or the sustenance of\naltruistic traits in a population is the main goal of intergroup selection\nmodels. Of particular interest is the balance of the parameters associated to\ngroup size, migration and group survival against the selective advantage of the\nnon-altruistic individuals. Here we use Kimura's diffusion model of intergroup\nselection to determine those conditions in the case the group survival\nprobability is a nonlinear non-decreasing function of the proportion of\naltruists in a group. In the case this function is linear, there are two\npossible steady states which correspond to the non-altruistic and the\naltruistic phases. At the discontinuous transition line separating these phases\nthere is a non-ergodic coexistence phase. For a continuous concave survival\nfunction, we find an ergodic coexistence phase that occupies a finite region of\nthe parameter space in between the altruistic and the non-altruistic phases,\nand is separated from these phases by continuous transition lines. For a convex\nsurvival function, the coexistence phase disappears altogether but a bistable\nphase appears for which the choice of the initial condition determines whether\nthe evolutionary dynamics leads to the altruistic or the non-altruistic steady\nstate.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jul 2013 18:01:11 GMT"}, {"version": "v2", "created": "Fri, 24 Jan 2014 11:08:39 GMT"}], "update_date": "2014-02-17", "authors_parsed": [["Fontanari", "Jose F.", ""], ["Serva", "Maurizio", ""]]}, {"id": "1307.6436", "submitter": "Petter Holme", "authors": "Petter Holme, Fredrik Liljeros", "title": "Birth and death of links control disease spreading in empirical contact\n  networks", "comments": null, "journal-ref": "Scientific Reports 4, 4999 (2014)", "doi": "10.1038/srep04999", "report-no": null, "categories": "q-bio.PE cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate what structural aspects of a collection of twelve empirical\ntemporal networks of human contacts are important to disease spreading. We scan\nthe entire parameter spaces of the two canonical models of infectious disease\nepidemiology -- the Susceptible-Infectious-Susceptible (SIS) and\nSusceptible-Infectious-Removed (SIR) models. The results from these simulations\nare compared to reference data where we eliminate structures in the interevent\nintervals, the time to the first contact in the data, or the time from the last\ncontact to the end of the sampling. The picture we find is that the birth and\ndeath of links, and the total number of contacts over a link, are essential to\npredict outbreaks. On the other hand, the exact times of contacts between the\nbeginning and end, or the interevent interval distribution, do not matter much.\nIn other words, a simplified picture of these empirical data sets that suffices\nfor epidemiological purposes is that links are born, is active with some\nintensity, and die.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jul 2013 14:43:49 GMT"}, {"version": "v2", "created": "Sat, 24 May 2014 01:17:39 GMT"}], "update_date": "2014-05-27", "authors_parsed": [["Holme", "Petter", ""], ["Liljeros", "Fredrik", ""]]}, {"id": "1307.6594", "submitter": "Lawrence Uricchio", "authors": "Lawrence H. Uricchio, Ryan D. Hernandez", "title": "Robust forward simulations of recurrent hitchhiking", "comments": null, "journal-ref": "Genetics May 2014 197:221-236", "doi": "10.1534/genetics.113.156935", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary forces shape patterns of genetic diversity within populations\nand contribute to phenotypic variation. In particular, recurrent positive\nselection has attracted significant interest in both theoretical and empirical\nstudies. However, most existing theoretical models of recurrent positive\nselection cannot easily incorporate realistic confounding effects such as\ninterference between selected sites, arbitrary selection schemes, and\ncomplicated demographic processes. It is possible to quantify the effects of\narbitrarily complex evolutionary models by performing forward population\ngenetic simulations, but forward simulations can be computationally prohibitive\nfor large population sizes ($> 10^5$). A common approach for overcoming these\ncomputational limitations is rescaling of the most computationally expensive\nparameters, especially population size. Here, we show that ad hoc approaches to\nparameter rescaling under the recurrent hitchhiking model do not always provide\nsufficiently accurate dynamics, potentially skewing patterns of diversity in\nsimulated DNA sequences. We derive an extension of the recurrent hitchhiking\nmodel that is appropriate for strong selection in small population sizes, and\nuse it to develop a method for parameter rescaling that provides the best\npossible computational performance for a given error tolerance. We perform a\ndetailed theoretical analysis of the robustness of rescaling across the\nparameter space. Finally, we apply our rescaling algorithms to parameters that\nwere previously inferred for Drosophila, and discuss practical considerations\nsuch as interference between selected sites.\n", "versions": [{"version": "v1", "created": "Wed, 24 Jul 2013 21:40:45 GMT"}, {"version": "v2", "created": "Wed, 7 May 2014 21:41:11 GMT"}], "update_date": "2014-05-09", "authors_parsed": [["Uricchio", "Lawrence H.", ""], ["Hernandez", "Ryan D.", ""]]}, {"id": "1307.6692", "submitter": "Stephane Legendre", "authors": "Fran\\c{c}ois Bienvenu, Lloyd Demetrius, St\\'ephane Legendre", "title": "A General Formula for the Generation Time", "comments": "13 pages, 3 figures", "journal-ref": "The American Naturalist, 185(6), 834-843 (2015)", "doi": "10.1086/681104", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that the generation time -- a notion usually described in a\nbiological context -- can be defined in a general way as a return time in a\nconveniently constructed finite Markov chain. The simple formula we obtain\nagrees with previous results derived for structured populations projected in\ndiscrete time, and allows to define the generation time of any process\ndescribed by a weighted directed graph whose matrix is primitive.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jul 2013 10:41:28 GMT"}, {"version": "v2", "created": "Mon, 9 Sep 2013 13:09:13 GMT"}, {"version": "v3", "created": "Mon, 7 Oct 2013 10:11:02 GMT"}], "update_date": "2018-03-20", "authors_parsed": [["Bienvenu", "François", ""], ["Demetrius", "Lloyd", ""], ["Legendre", "Stéphane", ""]]}, {"id": "1307.6729", "submitter": "Aurelien Tellier", "authors": "Aurelien Tellier, Stefany Moreno-Gamez and Wolfgang Stephan", "title": "Speed of adaptation and genomic footprints of host-parasite coevolution\n  under arms race and trench warfare dynamics", "comments": "Supplementary Information available upon request", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Coevolution is expected to follow two alternative dynamics, often called\ntrench warfare and arms races in plant-pathogen systems. Trench warfare\nsituations are stable cycles of allele frequencies at the coevolving loci of\nboth host and parasite, and it is predicted that the loci will show molecular\nevolutionary signatures of balancing selection, while arms races involve\nsuccessive selective sweeps at the interacting loci. We study a haploid\ngene-for-gene model that includes mutation and genetic drift due to finite\npopulation size. We study the outcomes under different coevolutionary\nparameters to quantify the frequency of fixation of alleles, i.e. occurrence of\nan arms race dynamics. We find that contrary to the conventional wisdom, trench\nwarfare situations do not imply larger numbers of coevolutionary cycles per\nunit time than arms races. Therefore, one cannot infer the nature of the\ndynamics in such systems based on the speed of coevolution estimated from cycle\ntimes. We subsequently perform coalescent simulations to generate sequences at\nthe host and parasite loci. We ask whether the signatures expected under\nbalancing selection or selective sweeps (unexpectedly high or low diversity,\nand high or low Tajima D values, respectively) are likely to be observable in\ngenomic data. Genomic footprints of recurrent selective sweeps are often found,\nwhereas trench warfare yields signatures of balancing selection only in\nparasite sequences, and only in a limited parameter space with high effective\npopulation sizes and long-term selection. Therefore, the existence of a\ndeterministic polymorphic equilibrium does not imply long-term trench warfare\nnecessary for the signature of balancing selection to be observed in the\ncoevolving genes sequence. Our results suggest that to search for signatures of\ncoevolution via population genomics, it is best to study pathogen rather than\nhost genomes.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jul 2013 13:07:58 GMT"}, {"version": "v2", "created": "Thu, 19 Sep 2013 10:15:44 GMT"}], "update_date": "2013-09-20", "authors_parsed": [["Tellier", "Aurelien", ""], ["Moreno-Gamez", "Stefany", ""], ["Stephan", "Wolfgang", ""]]}, {"id": "1307.6914", "submitter": "Artem Kaznatcheev", "authors": "Artem Kaznatcheev, Jacob G. Scott, David Basanta", "title": "Edge effects in game theoretic dynamics of spatially structured tumours", "comments": "14 pages, 3 figures; restructured abstract, added histology to fig.\n  1, added fig. 3, discussion of EMT introduced and cancer biology expanded", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Analysing tumour architecture for metastatic potential usually\nfocuses on phenotypic differences due to cellular morphology or specific\ngenetic mutations, but often ignore the cell's position within the\nheterogeneous substructure. Similar disregard for local neighborhood structure\nis common in mathematical models.\n  Methods: We view the dynamics of disease progression as an evolutionary game\nbetween cellular phenotypes. A typical assumption in this modeling paradigm is\nthat the probability of a given phenotypic strategy interacting with another\ndepends exclusively on the abundance of those strategies without regard local\nheterogeneities. We address this limitation by using the Ohtsuki-Nowak\ntransform to introduce spatial structure to the go vs. grow game.\n  Results: We show that spatial structure can promote the invasive (go)\nstrategy. By considering the change in neighbourhood size at a static boundary\n-- such as a blood-vessel, organ capsule, or basement membrane -- we show an\nedge effect that allows a tumour without invasive phenotypes in the bulk to\nhave a polyclonal boundary with invasive cells. We present an example of this\npromotion of invasive (EMT positive) cells in a metastatic colony of prostate\nadenocarcinoma in bone marrow.\n  Interpretation: Pathologic analyses that do not distinguish between cells in\nthe bulk and cells at a static edge of a tumour can underestimate the number of\ninvasive cells. We expect our approach to extend to other evolutionary game\nmodels where interaction neighborhoods change at fixed system boundaries.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jul 2013 03:12:34 GMT"}, {"version": "v2", "created": "Fri, 10 Jan 2014 19:36:48 GMT"}, {"version": "v3", "created": "Wed, 21 Jan 2015 21:10:00 GMT"}], "update_date": "2015-01-23", "authors_parsed": [["Kaznatcheev", "Artem", ""], ["Scott", "Jacob G.", ""], ["Basanta", "David", ""]]}, {"id": "1307.7055", "submitter": "Nikolay Vitanov k", "authors": "Nikolay K. Vitanov and Zlatinka I. Dimitrova", "title": "On the dynamics of interacting populations in presence of state\n  dependent fluctuations", "comments": "13 pages, no figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We discuss several models of the dynamics of interacting populations. The\nmodels are constructed by nonlinear differential equations and have two sets of\nparameters: growth rates and coefficients of interaction between populations.\nWe assume that the parameters depend on the densities of the populations. In\naddition the parameters can be influenced by different factors of the\nenvironment. This influence is modelled by noise terms in the equations for the\ngrowth rates and interaction coefficients. Thus the model differential\nequations become stochastic. In some particular cases these equations can be\nreduced to a Foker-Plancnk equation for the probability density function of the\ndensities of the interacting populations.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jul 2013 14:52:44 GMT"}], "update_date": "2013-07-29", "authors_parsed": [["Vitanov", "Nikolay K.", ""], ["Dimitrova", "Zlatinka I.", ""]]}, {"id": "1307.7313", "submitter": "Jeffrey Ross-Ibarra", "authors": "Justin P. Gerke, Jode W. Edwards, Katherine E. Guill, Jeffrey\n  Ross-Ibarra, Michael D. McMullen", "title": "The genomic impacts of drift and selection for hybrid performance in\n  maize", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Modern maize breeding relies upon selection in inbreeding populations to\nimprove the performance of cross-population hybrids. The United States\nDepartment of Agriculture - Agricultural Research Service reciprocal recurrent\nselection experiment between the Iowa Stiff Stalk Synthetic (BSSS) and the Iowa\nCorn Borer Synthetic No. 1 (BSCB1) populations represents one of the longest\nstanding models of selection for hybrid performance. To investigate the genomic\nimpact of this selection program, we used the Illumina MaizeSNP50 high-density\nSNP array to determine genotypes of progenitor lines and over 600 individuals\nacross multiple cycles of selection. Consistent with previous research (Messmer\net al., 1991; Labate et al., 1997; Hagdorn et al., 2003; Hinze et al., 2005),\nwe found that genetic diversity within each population steadily decreases, with\na corresponding increase in population structure. High marker density also\nenabled the first view of haplotype ancestry, fixation and recombination within\nthis historic maize experiment. Extensive regions of haplotype fixation within\neach population are visible in the pericentromeric regions, where large blocks\ntrace back to single founder inbreds. Simulation attributes most of the\nobserved reduction in genetic diversity to genetic drift. Signatures of\nselection were difficult to observe in the background of this strong genetic\ndrift, but heterozygosity in each population has fallen more than expected.\nRegions of haplotype fixation represent the most likely targets of selection,\nbut as observed in other germplasm selected for hybrid performance (Feng et\nal., 2006), there is no overlap between the most likely targets of selection in\nthe two populations. We discuss how this pattern is likely to occur during\nselection for hybrid performance, and how it poses challenges for dissecting\nthe impacts of modern breeding and selection on the maize genome.\n", "versions": [{"version": "v1", "created": "Sat, 27 Jul 2013 21:41:17 GMT"}], "update_date": "2015-06-29", "authors_parsed": [["Gerke", "Justin P.", ""], ["Edwards", "Jode W.", ""], ["Guill", "Katherine E.", ""], ["Ross-Ibarra", "Jeffrey", ""], ["McMullen", "Michael D.", ""]]}, {"id": "1307.7678", "submitter": "Jeffrey Ross-Ibarra", "authors": "Amanda J. Waters, Paul Bilinski, Steve R. Eichten, Matthew W. Vaughn,\n  Jeffrey Ross-Ibarra, Mary Gehring, Nathan M. Springer", "title": "Comprehensive analysis of imprinted genes in maize reveals limited\n  conservation with other species and allelic variation for imprinting", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In plants, a subset of genes exhibit imprinting in endosperm tissue such that\nexpression is primarily from the maternal or paternal allele. Imprinting may\narise as a consequence of mechanisms for silencing of transposons during\nreproduction, and in some cases imprinted expression of particular genes may\nprovide a selective advantage such that it is conserved across species.\nSeparate mechanisms for the origin of imprinted expression patterns and\nmaintenance of these patterns may result in substantial variation in the\ntargets of imprinting in different species. Here we present deep sequencing of\nRNAs isolated from reciprocal crosses of four diverse maize genotypes,\nproviding a comprehensive analysis of imprinting in maize that allows\nevaluation of imprinting at more than 95% of endosperm-expressed genes. We find\nthat over 500 genes exhibit statistically significant parent-of-origin effects\nin maize endosperm tissue, but focused our analyses on a subset of these genes\nthat had >90% expression from the maternal allele (69 genes) or from the\npaternal allele (108 genes) in at least one reciprocal cross. Over 10% of\nimprinted genes show evidence of allelic variation for imprinting. A comparison\nof imprinting in maize and rice reveals that only 13% of genes with syntenic\northologs in both species exhibit conserved imprinting. Genes that exhibit\nconserved imprinting in maize relative to rice have elevated dN/dS ratios\ncompared to other imprinted genes, suggesting a history of more rapid\nevolution. Together, these data suggest that imprinting only has functional\nrelevance at a subset of loci that currently exhibit imprinting in maize.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jul 2013 18:40:25 GMT"}], "update_date": "2013-07-30", "authors_parsed": [["Waters", "Amanda J.", ""], ["Bilinski", "Paul", ""], ["Eichten", "Steve R.", ""], ["Vaughn", "Matthew W.", ""], ["Ross-Ibarra", "Jeffrey", ""], ["Gehring", "Mary", ""], ["Springer", "Nathan M.", ""]]}, {"id": "1307.7737", "submitter": "Istvan Kiss Z", "authors": "Istvan Z. Kiss, Charles G. Morris, Fanni S\\'elley, P\\'eter L. Simon\n  and Robert R. Wilkinson", "title": "Exact deterministic representation of Markovian SIR epidemics on\n  networks with and without loops", "comments": "7 postscript figures and 3 tikz figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR math.DS q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a previous paper Sharkey et al. [13] proved the exactness of closures at\nthe level of triples for Markovian SIR (susceptible-infected-removed) dynamics\non tree-like networks. This resulted in a deterministic representation of the\nepidemic dynamics on the network that can be numerically evaluated. In this\npaper, we extend this modelling framework to certain classes of networks\nexhibiting loops. We show that closures where the loops are kept intact are\nexact, and lead to a simplified and numerically solvable system of ODEs\n(ordinary-differential-equations). The findings of the paper lead us to a\ngeneralisation of closures that are based on partitioning the network around\nnodes that are cut-vertices (i.e. the removal of such a node leads to the\nnetwork breaking down into at least two disjointed components or subnetworks).\nExploiting this structural property of the network yields some natural\nclosures, where the evolution of a particular state can typically be exactly\ngiven in terms of the corresponding or projected sates on the subnetworks and\nthe cut-vertex. A byproduct of this analysis is an alternative probabilistic\nproof of the exactness of the closures for tree-like networks presented in\nSharkey et al. [13]. In this paper we also elaborate on how the main result can\nbe applied to more realistic networks, for which we write down the ODEs\nexplicitly and compare output from these to results from simulation.\nFurthermore, we give a general, recipe-like method of how to apply the\nreduction by closures technique for arbitrary networks, and give an upper bound\non the maximum number of equations needed for an exact representation.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jul 2013 20:49:15 GMT"}], "update_date": "2013-07-31", "authors_parsed": [["Kiss", "Istvan Z.", ""], ["Morris", "Charles G.", ""], ["Sélley", "Fanni", ""], ["Simon", "Péter L.", ""], ["Wilkinson", "Robert R.", ""]]}, {"id": "1307.7756", "submitter": "Joshua Schraiber", "authors": "Joshua G. Schraiber", "title": "A path integral formulation of the Wright-Fisher process with genic\n  selection", "comments": "22 pages, 3 figures", "journal-ref": "Theoretical Population Biology 92, 2013, pp 30-35", "doi": "10.1016/j.tpb.2013.11.002", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Wright-Fisher process with selection is an important tool in population\ngenetics theory. Traditional analysis of this process relies on the diffusion\napproximation. The diffusion approximation is usually studied in a partial\ndifferential equations framework. In this paper, I introduce a path integral\nformalism to study the Wright-Fisher process with selection and use that\nformalism to obtain a simple perturbation series to approximate the transition\ndensity. The perturbation series can be understood in terms of Feynman\ndiagrams, which have a simple probabilistic interpretation in terms of\nselective events. The perturbation series proves to be an accurate\napproximation of the transition density for weak selection and is shown to be\narbitrarily accurate for any selection coefficient.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jul 2013 22:18:08 GMT"}], "update_date": "2013-12-30", "authors_parsed": [["Schraiber", "Joshua G.", ""]]}, {"id": "1307.7759", "submitter": "Jeremy Berg", "authors": "Jeremy J. Berg and Graham Coop", "title": "The Population Genetic Signature of Polygenic Local Adaptation", "comments": "42 pages including 8 figures and 3 tables; supplementary figures and\n  tables not included on this upload, but are mostly unchanged from v1", "journal-ref": null, "doi": "10.1371/journal.pgen.1004412", "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Adaptation in response to selection on polygenic phenotypes may occur via\nsubtle allele frequencies shifts at many loci. Current population genomic\ntechniques are not well posed to identify such signals. In the past decade,\ndetailed knowledge about the specific loci underlying polygenic traits has\nbegun to emerge from genome-wide association studies (GWAS). Here we combine\nthis knowledge from GWAS with robust population genetic modeling to identify\ntraits that may have been influenced by local adaptation. We exploit the fact\nthat GWAS provide an estimate of the additive effect size of many loci to\nestimate the mean additive genetic value for a given phenotype across many\npopulations as simple weighted sums of allele frequencies. We first describe a\ngeneral model of neutral genetic value drift for an arbitrary number of\npopulations with an arbitrary relatedness structure. Based on this model we\ndevelop methods for detecting unusually strong correlations between genetic\nvalues and specific environmental variables, as well as a generalization of\n$Q_{ST}/F_{ST}$ comparisons to test for over-dispersion of genetic values among\npopulations. Finally we lay out a framework to identify the individual\npopulations or groups of populations that contribute to the signal of\noverdispersion. These tests have considerably greater power than their single\nlocus equivalents due to the fact that they look for positive covariance\nbetween like effect alleles, and also significantly outperform methods that do\nnot account for population structure. We apply our tests to the Human Genome\nDiversity Panel (HGDP) dataset using GWAS data for height, skin pigmentation,\ntype 2 diabetes, body mass index, and two inflammatory bowel disease datasets.\nThis analysis uncovers a number of putative signals of local adaptation, and we\ndiscuss the biological interpretation and caveats of these results.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jul 2013 22:29:58 GMT"}, {"version": "v2", "created": "Thu, 6 Feb 2014 19:01:21 GMT"}], "update_date": "2014-08-19", "authors_parsed": [["Berg", "Jeremy J.", ""], ["Coop", "Graham", ""]]}, {"id": "1307.7831", "submitter": "Aaron Darling", "authors": "Nicolas Wieseke, Matthias Bernt, and Martin Middendorf", "title": "Unifying Parsimonious Tree Reconciliation", "comments": "Peer-reviewed and presented as part of the 13th Workshop on\n  Algorithms in Bioinformatics (WABI2013)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM cs.CE cs.DS q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolution is a process that is influenced by various environmental factors,\ne.g. the interactions between different species, genes, and biogeographical\nproperties. Hence, it is interesting to study the combined evolutionary history\nof multiple species, their genes, and the environment they live in. A common\napproach to address this research problem is to describe each individual\nevolution as a phylogenetic tree and construct a tree reconciliation which is\nparsimonious with respect to a given event model. Unfortunately, most of the\nprevious approaches are designed only either for host-parasite systems, for\ngene tree/species tree reconciliation, or biogeography. Hence, a method is\ndesirable, which addresses the general problem of mapping phylogenetic trees\nand covering all varieties of coevolving systems, including e.g., predator-prey\nand symbiotic relationships. To overcome this gap, we introduce a generalized\ncophylogenetic event model considering the combinatorial complete set of local\ncoevolutionary events. We give a dynamic programming based heuristic for\nsolving the maximum parsimony reconciliation problem in time O(n^2), for two\nphylogenies each with at most n leaves. Furthermore, we present an exact\nbranch-and-bound algorithm which uses the results from the dynamic programming\nheuristic for discarding partial reconciliations. The approach has been\nimplemented as a Java application which is freely available from\nhttp://pacosy.informatik.uni-leipzig.de/coresym.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jul 2013 05:47:27 GMT"}], "update_date": "2013-08-02", "authors_parsed": [["Wieseke", "Nicolas", ""], ["Bernt", "Matthias", ""], ["Middendorf", "Martin", ""]]}, {"id": "1307.7903", "submitter": "Satoru Morita", "authors": "Satoru Morita and Jin Yoshimura", "title": "Analytical solution of stochastic model of risk-spreading with global\n  coupling", "comments": "4 pages, 2 figures", "journal-ref": "Phys. Rev. E 88, 052809 (2013)", "doi": "10.1103/PhysRevE.88.052809", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a stochastic matrix model to understand the mechanics of\nrisk-spreading (or bet-hedging) by dispersion. Such model has been mostly dealt\nnumerically except for well-mixed case, so far. Here, we present an analytical\nresult, which shows that optimal dispersion leads to Zipf's law. Moreover, we\nfound that the arithmetic ensemble average of the total growth rate converges\nto the geometric one, because the sample size is finite.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jul 2013 11:02:56 GMT"}, {"version": "v2", "created": "Tue, 19 Nov 2013 03:27:57 GMT"}], "update_date": "2015-11-12", "authors_parsed": [["Morita", "Satoru", ""], ["Yoshimura", "Jin", ""]]}, {"id": "1307.8014", "submitter": "Joseph Pickrell", "authors": "Joseph K. Pickrell, Nick Patterson, Po-Ru Loh, Mark Lipson, Bonnie\n  Berger, Mark Stoneking, Brigitte Pakendorf, David Reich", "title": "Ancient west Eurasian ancestry in southern and eastern Africa", "comments": "Added additional simulations, some additional discussion", "journal-ref": "Proc Natl Acad Sci U S A. 2014 Feb 18;111(7):2632-7", "doi": "10.1073/pnas.1313787111", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The history of southern Africa involved interactions between indigenous\nhunter-gatherers and a range of populations that moved into the region. Here we\nuse genome-wide genetic data to show that there are at least two admixture\nevents in the history of Khoisan populations (southern African hunter-gatherers\nand pastoralists who speak non-Bantu languages with click consonants). One\ninvolved populations related to Niger-Congo-speaking African populations, and\nthe other introduced ancestry most closely related to west Eurasian (European\nor Middle Eastern) populations. We date this latter admixture event to\napproximately 900-1,800 years ago, and show that it had the largest demographic\nimpact in Khoisan populations that speak Khoe-Kwadi languages. A similar signal\nof west Eurasian ancestry is present throughout eastern Africa. In particular,\nwe also find evidence for two admixture events in the history of Kenyan,\nTanzanian, and Ethiopian populations, the earlier of which involved populations\nrelated to west Eurasians and which we date to approximately 2,700 - 3,300\nyears ago. We reconstruct the allele frequencies of the putative west Eurasian\npopulation in eastern Africa, and show that this population is a good proxy for\nthe west Eurasian ancestry in southern Africa. The most parsimonious\nexplanation for these findings is that west Eurasian ancestry entered southern\nAfrica indirectly through eastern Africa.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jul 2013 15:25:48 GMT"}, {"version": "v2", "created": "Mon, 21 Oct 2013 20:03:52 GMT"}], "update_date": "2014-04-24", "authors_parsed": [["Pickrell", "Joseph K.", ""], ["Patterson", "Nick", ""], ["Loh", "Po-Ru", ""], ["Lipson", "Mark", ""], ["Berger", "Bonnie", ""], ["Stoneking", "Mark", ""], ["Pakendorf", "Brigitte", ""], ["Reich", "David", ""]]}, {"id": "1307.8064", "submitter": "Michael Courtney", "authors": "Michael W. Courtney and Joshua M. Courtney", "title": "Predictions Wrong Again on Dead Zone Area -- Gulf of Mexico Gaining\n  Resistance to Nutrient Loading", "comments": "5 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mississippi River nutrient loads and water stratification on the\nLouisiana-Texas shelf contribute to an annually recurring, short-lived hypoxic\nbottom layer in areas of the northern Gulf of Mexico comprising less than 2% of\nthe total Gulf of Mexico bottom area. This paper observes that the NOAA and\nLUMCON have now published errant predictions of possible record size areas of\ntemporary bottom water hypoxia (\"dead zones\") three times since 2005, in 2008,\n2011, and 2013 and that the LUMCON predictions of the area of hypoxic bottom\nwater average 31% higher than the actual measured hypoxic areas from 2006 to\n2014. These systematically high predictions depend on the assumption that the\nsusceptibility of the Gulf of Mexico to forming hypoxic areas in response to\nnutrient loading has been relatively constant since 2001, though the\nsusceptibility has been occasionally adjusted upward in different models. It\nhas been previously suggested that tropical storms in a given year that occur\non the Louisiana-Texas shelf between the peak nutrient loading in spring and\nformation of the hypoxic zone in summer can mitigate the size of the hypoxic\nzone that year through mixing of stratified well oxygenated lighter and warmer\nsurface layers and oxygen depleted heavier and cooler bottom layers. This paper\nsuggests several reasons why the Louisiana-Texas shelf may be systematically\ngrowing less susceptible to a given level of nutrient loading over time so that\npredictions based on the measured area of temporary bottom water hypoxia prior\nto 2006 tend to be too big in recent years.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jul 2013 17:45:16 GMT"}, {"version": "v2", "created": "Tue, 24 Feb 2015 06:13:39 GMT"}], "update_date": "2015-02-25", "authors_parsed": [["Courtney", "Michael W.", ""], ["Courtney", "Joshua M.", ""]]}, {"id": "1307.8143", "submitter": "Sivan Leviyang", "authors": "Sivan Leviyang", "title": "Constructing Lower-Bounds for CTL Escape Rates in Early HIV and SIV\n  Infection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intrahost simian immunodeficiency virus (SIV) evolution is marked by repeated\nviral escape from cytotoxic T-lymphocyte (CTLs) response. Typically, the first\nsuch CTL escape occurs in a matter of days, starting around the time of peak\nviral load. Many authors have developed methods to quantify the strength of CTL\nresponse by measuring the rate at which CTL escape occurs, but such methods\nusually depend on sampling at two or more timepoints, while many datasets\ncapture the dynamics of the first CTL escape at only a single timepoint. Here,\nwe develop inference methods for CTL escape rates applicable to single\ntimepoint datasets. Through a model of early infection dynamics, we construct\nconfidence intervals for escape rates, but since early infection dynamics are\nnot completely understood, we also develop a one-sided confidence interval\nserving as a lower bound for escape rates over a collection of early infection\nmodels. We apply our methods to two SIV datasets, using our lower bounds and\nexisting methods to show that escape rates are relatively high during the\ninitial days of the first CTL escape and then drop to lower levels as the\nescape proceeds. We also compare escape in the lymph nodes and the rectal\nmucosa, showing that escape in the lymph nodes is initially faster, but as the\nfirst escape proceeds, the rate of escape in the lymph nodes drops below the\nrate seen in the rectal mucosa.\n", "versions": [{"version": "v1", "created": "Tue, 30 Jul 2013 20:51:55 GMT"}], "update_date": "2013-08-01", "authors_parsed": [["Leviyang", "Sivan", ""]]}, {"id": "1307.8252", "submitter": "Simone Pigolotti", "authors": "Simone Pigolotti and Roberto Benzi", "title": "Selective advantage of diffusing faster", "comments": "8 pages, 5 figures (Main Text + Supplementary Information). Accepted\n  version", "journal-ref": "Phys. Rev. Lett. 112, 188102 (2014)", "doi": "10.1103/PhysRevLett.112.188102", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech nlin.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a stochastic spatial model of biological competition in which two\nspecies have the same birth and death rates, but different diffusion constants.\nIn the absence of this difference, the model can be considered as an\noff-lattice version of the Voter model and presents similar coarsening\nproperties. We show that even a relative difference in diffusivity on the order\nof a few percent may lead to a strong bias in the coarsening process favoring\nthe more agile species. We theoretically quantify this selective advantage and\npresent analytical formulas for the average growth of the fastest species and\nits fixation probability.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jul 2013 08:50:12 GMT"}, {"version": "v2", "created": "Fri, 16 May 2014 09:45:02 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Pigolotti", "Simone", ""], ["Benzi", "Roberto", ""]]}, {"id": "1307.8263", "submitter": "Laurent Frantz", "authors": "Konrad Lohse and Laurent A.F. Frantz", "title": "Maximum likelihood evidence for Neandertal admixture in Eurasian\n  populations from three genomes", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although there has been much interest in estimating divergence and admixture\nfrom genomic data, it has proven difficult to distinguish gene flow after\ndivergence from alternative histories involving structure in the ancestral\npopulation. The lack of a formal test to distinguish these scenarios has\nsparked recent controversy about the possibility of interbreeding between\nNeandertals and modern humans in Eurasia. We derive the probability of\nmutational configurations in non-recombining sequence blocks under alternative\nhistories of divergence with admixture and ancestral structure. Dividing the\ngenome into short blocks makes it possible to compute maximum likelihood\nestimates of parameters under both models. We apply this method to triplets of\nhuman Neandertal genomes and quantify the relative support for models of\nlong-term population structure in the ancestral African popuation and admixture\nfrom Neandertals into Eurasian populations after their expansion out of Africa.\nOur analysis allows us -- for the first time -- to formally reject a history of\nancestral population structure and instead reveals strong support for admixture\nfrom Neandertals into Eurasian populations at a higher rate (3.4%-7.9%) than\nsuggested previously.\n", "versions": [{"version": "v1", "created": "Wed, 31 Jul 2013 10:01:53 GMT"}], "update_date": "2013-08-01", "authors_parsed": [["Lohse", "Konrad", ""], ["Frantz", "Laurent A. F.", ""]]}]