[{"id": "1308.0091", "submitter": "Yun S. Song", "authors": "Anand Bhaskar, Andrew G. Clark, Yun S. Song", "title": "Distortion of genealogical properties when the sample is very large", "comments": "27 pages, 2 tables, 14 figures", "journal-ref": "Proc. Natl. Acad. Sci. U.S.A., Vol. 111, No. 6 (2014) 2385-2390", "doi": "10.1073/pnas.1322709111", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Study sample sizes in human genetics are growing rapidly, and in due course\nit will become routine to analyze samples with hundreds of thousands if not\nmillions of individuals. In addition to posing computational challenges, such\nlarge sample sizes call for carefully re-examining the theoretical foundation\nunderlying commonly-used analytical tools. Here, we study the accuracy of the\ncoalescent, a central model for studying the ancestry of a sample of\nindividuals. The coalescent arises as a limit of a large class of random mating\nmodels and it is an accurate approximation to the original model provided that\nthe population size is sufficiently larger than the sample size. We develop a\nmethod for performing exact computation in the discrete-time Wright-Fisher\n(DTWF) model and compare several key genealogical quantities of interest with\nthe coalescent predictions. For realistic demographic scenarios, we find that\nthere are a significant number of multiple- and simultaneous-merger events\nunder the DTWF model, which are absent in the coalescent by construction.\nFurthermore, for large sample sizes, there are noticeable differences in the\nexpected number of rare variants between the coalescent and the DTWF model. To\nbalance the tradeoff between accuracy and computational efficiency, we propose\na hybrid algorithm that utilizes the DTWF model for the recent past and the\ncoalescent for the more distant past. Our results demonstrate that the hybrid\nmethod with only a handful of generations of the DTWF model leads to a\nfrequency spectrum that is quite close to the prediction of the full DTWF\nmodel.\n", "versions": [{"version": "v1", "created": "Thu, 1 Aug 2013 04:26:11 GMT"}], "update_date": "2015-06-24", "authors_parsed": [["Bhaskar", "Anand", ""], ["Clark", "Andrew G.", ""], ["Song", "Yun S.", ""]]}, {"id": "1308.0170", "submitter": "Reto Burri", "authors": "Marta Promerov\\'a, Reto Burri, Luca Fumagalli", "title": "PCR-based isolation of multigene families: Lessons from the avian MHC\n  class IIB", "comments": "24 pages, 2 Tables, 2 Figures", "journal-ref": null, "doi": "10.1111/1755-0998.12234", "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The amount of sequence data available today highly facilitates the access to\ngenes from many gene families. Universal primers amplifying the desired genes\nover a range of species are readily obtained by aligning conserved gene\nregions, and laborious gene isolation procedures can often be replaced by\nquicker PCR-based approaches. However, in case of multigene families, PCR-based\napproaches bear the risk of incomplete isolation of family members. This\nproblem is most prominent in gene families with highly variable and thus\nunpredictable number of gene copies among species, such as in the major\nhistocompatibility complex (MHC). In the present study we (i) report new\nprimers for the isolation of the MHC class IIB (MHCIIB) gene family in birds,\nand (ii) share our experience with isolating MHCIIB genes from an unprecedented\nnumber of avian species from all over the avian phylogeny. We report important\nand usually underappreciated problems encountered during PCR-based multigene\nfamily isolation, and provide a collection of measures that may help to\nsignificantly improve the chance of successfully isolating complete multigene\nfamilies using PCR-based approaches.\n", "versions": [{"version": "v1", "created": "Thu, 1 Aug 2013 12:23:30 GMT"}], "update_date": "2014-06-17", "authors_parsed": [["Promerová", "Marta", ""], ["Burri", "Reto", ""], ["Fumagalli", "Luca", ""]]}, {"id": "1308.0278", "submitter": "Anne-Florence Bitbol", "authors": "Anne-Florence Bitbol and David J. Schwab", "title": "Quantifying the role of population subdivision in evolution on rugged\n  fitness landscapes", "comments": "27 pages, 4 figures, published version", "journal-ref": "PLoS Computational Biology 10(8): e1003778 (2014)", "doi": "10.1371/journal.pcbi.1003778", "report-no": null, "categories": "q-bio.PE physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Natural selection drives populations towards higher fitness, but crossing\nfitness valleys or plateaus may facilitate progress up a rugged fitness\nlandscape involving epistasis. We investigate quantitatively the effect of\nsubdividing an asexual population on the time it takes to cross a fitness\nvalley or plateau. We focus on a generic and minimal model that includes only\npopulation subdivision into equivalent demes connected by global migration, and\ndoes not require significant size changes of the demes, environmental\nheterogeneity or specific geographic structure. We determine the optimal\nspeedup of valley or plateau crossing that can be gained by subdivision, if the\nprocess is driven by the deme that crosses fastest. We show that isolated demes\nhave to be in the sequential fixation regime for subdivision to significantly\naccelerate crossing. Using Markov chain theory, we obtain analytical\nexpressions for the conditions under which optimal speedup is achieved: valley\nor plateau crossing by the subdivided population is then as fast as that of its\nfastest deme. We verify our analytical predictions through stochastic\nsimulations. We demonstrate that subdivision can substantially accelerate the\ncrossing of fitness valleys and plateaus in a wide range of parameters\nextending beyond the optimal window. We study the effect of varying the degree\nof subdivision of a population, and investigate the trade-off between the\nmagnitude of the optimal speedup and the width of the parameter range over\nwhich it occurs. Our results also hold for weakly beneficial intermediate\nmutations. We extend our work to the case of a population connected by\nmigration to one or several smaller islands. Our results demonstrate that\nsubdivision with migration alone can significantly accelerate the crossing of\nfitness valleys and plateaus, and shed light onto the quantitative conditions\nnecessary for this to occur.\n", "versions": [{"version": "v1", "created": "Thu, 1 Aug 2013 17:43:58 GMT"}, {"version": "v2", "created": "Mon, 5 Aug 2013 18:10:04 GMT"}, {"version": "v3", "created": "Thu, 14 Aug 2014 21:30:13 GMT"}], "update_date": "2014-08-18", "authors_parsed": [["Bitbol", "Anne-Florence", ""], ["Schwab", "David J.", ""]]}, {"id": "1308.0380", "submitter": "Jeffrey Ross-Ibarra", "authors": "Sofiane Mezmouk, Jeffrey Ross-Ibarra", "title": "The pattern and distribution of deleterious mutations in maize", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most non-synonymous mutations are thought to be deleterious because of their\neffect on protein sequence. These polymorphisms are expected to be removed or\nkept at low frequency by the action of natural selection, and rare deleterious\nvariants have been implicated as a possible explanation for the \"missing\nheritability\" seen in many studies of complex traits. Nonetheless, the effect\nof positive selection on linked sites or drift in small or inbred populations\nmay also impact the evolution of deleterious alleles. Here, we made use of\ngenome-wide genotyping data to characterize deleterious variants in a large\npanel of maize inbred lines. We show that, in spite of small effective\npopulation sizes and inbreeding, most putatively deleterious SNPs are indeed at\nlow frequencies within individual genetic groups. We find that genes showing\nassociations with a number of complex traits are enriched for deleterious\nvariants. Together these data are consistent with the dominance model of\nheterosis, in which complementation of numerous low frequency, weak deleterious\nvariants contribute to hybrid vigor.\n", "versions": [{"version": "v1", "created": "Fri, 2 Aug 2013 00:28:14 GMT"}], "update_date": "2013-08-05", "authors_parsed": [["Mezmouk", "Sofiane", ""], ["Ross-Ibarra", "Jeffrey", ""]]}, {"id": "1308.0623", "submitter": "Tsvi Tlusty", "authors": "Rami Pugatch, Naama Barkai, Tsvi Tlusty", "title": "Asymptotic Cellular Growth Rate as the Effective Information Utilization\n  Rate", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the average asymptotic growth rate of cells in randomly fluctuating\nenvironments, with multiple viable phenotypes per environment. We show that any\ninformation processing strategy has an asymptotic growth rate, which is the sum\nof: (i) the maximal growth rate at the worst possible distribution of\nenvironments, (ii) relative information between the actual distribution of\nenvironments to the worst one, and (iii) information utilization rate, which is\nthe information rate of the sensory devices minus the \"information dissipation\nrate\", the amount of information not utilized by the cell for growth. In\nnon-stationary environments, we find that the optimal phenotypic switching\ntimes equally partition the information dissipation rate between consecutive\nswitching intervals.\n", "versions": [{"version": "v1", "created": "Fri, 2 Aug 2013 21:42:36 GMT"}, {"version": "v2", "created": "Fri, 20 Dec 2013 16:39:40 GMT"}, {"version": "v3", "created": "Wed, 12 Mar 2014 19:37:16 GMT"}], "update_date": "2014-03-13", "authors_parsed": [["Pugatch", "Rami", ""], ["Barkai", "Naama", ""], ["Tlusty", "Tsvi", ""]]}, {"id": "1308.0655", "submitter": "Daniel McGlinn", "authors": "Daniel J. McGlinn, Xiao Xiao, Ethan P. White", "title": "An empirical evaluation of four variants of a universal species-area\n  relationship", "comments": "main text: 20 pages, 2 tables, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Maximum Entropy Theory of Ecology (METE) predicts a universal\nspecies-area relationship (SAR) that can be fully characterized using only the\ntotal abundance (N) and species richness (S) at a single spatial scale. This\ntheory has shown promise for characterizing scale dependence in the SAR.\nHowever, there are currently four different approaches to applying METE to\npredict the SAR and it is unclear which approach should be used due to a lack\nof empirical evaluation. Specifically, METE can be applied recursively or a\nnon-recursively and can use either a theoretical or observed species-abundance\ndistribution (SAD). We compared the four different combinations of approaches\nusing empirical data from 16 datasets containing over 1000 species and 300,000\nindividual trees and herbs. In general, METE accurately downscaled the SAR\n(R^2> 0.94), but the recursive approach consistently under-predicted richness,\nand METEs accuracy did not depend strongly on using the observed or predicted\nSAD. This suggests that best approach to scaling diversity using METE is to use\na combination of non-recursive scaling and the theoretical abundance\ndistribution, which allows predictions to be made across a broad range of\nspatial scales with only knowledge of the species richness and total abundance\nat a single scale.\n", "versions": [{"version": "v1", "created": "Sat, 3 Aug 2013 03:15:48 GMT"}, {"version": "v2", "created": "Fri, 8 Nov 2013 23:08:15 GMT"}], "update_date": "2013-11-12", "authors_parsed": [["McGlinn", "Daniel J.", ""], ["Xiao", "Xiao", ""], ["White", "Ethan P.", ""]]}, {"id": "1308.0668", "submitter": "David Lusseau", "authors": "David Lusseau", "title": "Quantum-like perception entanglement leads to advantageous collective\n  decisions", "comments": "8 pages, 3 figures, paper presented at the XXXIII International\n  Ethological Congress, 8 August 2013, Newcastle-upon-Tyne, UK", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social animals have to make collective decisions on a daily basis. In most\ninstances, these decisions are taken by consensus, when the group does what the\nmajority of individuals want. Individuals have to base these decisions on the\ninformation they perceive from their socioecological landscape. The perception\nmechanisms they use can influence the cost of collective decisions. Here I show\nthat when group-living individuals perceive their environment concurrently for\nthe same decisions, a quantum-like perception entanglement process can confer\nless costly collective decisions than when individuals collect their\ninformation independently. This highlights a mechanism that can help explain\nwhat may seem to be irrational group-living behavior and opens avenues to\ndevelop empirical tests for quantum decision theory.\n", "versions": [{"version": "v1", "created": "Sat, 3 Aug 2013 07:54:08 GMT"}], "update_date": "2013-08-06", "authors_parsed": [["Lusseau", "David", ""]]}, {"id": "1308.0695", "submitter": "Liane Gabora", "authors": "Liane Gabora", "title": "Reply to Commentaries on 'An Evolutionary Framework for Cultural Change:\n  Selectionism versus Communal Exchange'", "comments": "8 pages; this is a reply to commentaries on q-bio.PE/0773336", "journal-ref": "Physics of Life Reviews, 10(2), 162-167 (2013)", "doi": "10.1016/j.plrev.2013.05.007", "report-no": null, "categories": "q-bio.PE nlin.AO q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The commentators have brought a wealth of new perspectives to the question of\nhow culture evolves. Each of their diverse disciplines--ranging from psychology\nto biology to anthropology to economics to engineering--has a valuable\ncontribution to make to our understanding of this complex, multifaceted topic.\nThough the vast majority of their comments were supportive of my approach, it\nis natural that a reply such as this focus on points where my views differ from\nthat of the commentators. ... I conclude by saying that I am grateful to the\ncommentators for their diverse perspectives and insights, their overall support\nfor the project, and provocative ideas for where to go from here. Clearly there\nare many fascinating avenues to explore as we move forward on our quest to\nunderstand how culture evolves.\n", "versions": [{"version": "v1", "created": "Sat, 3 Aug 2013 13:44:11 GMT"}, {"version": "v2", "created": "Sun, 30 Jun 2019 01:56:10 GMT"}], "update_date": "2019-07-02", "authors_parsed": [["Gabora", "Liane", ""]]}, {"id": "1308.0718", "submitter": "Ling  Xue Ms", "authors": "Ling Xue and Caterina Scoglio", "title": "The network-level reproduction number and extinction threshold for\n  vector-borne diseases", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The reproduction number of deterministic models is an essential quantity to\npredict whether an epidemic will spread or die out. Thresholds for disease\nextinction contribute crucial knowledge on disease control, elimination, and\nmitigation of infectious diseases. Relationships between the basic reproduction\nnumbers of two network-based ordinary differential equation vector-host models,\nand extinction thresholds of corresponding continuous-time Markov chain models\nare derived under some assumptions. Numerical simulation results for malaria\nand Rift Valley fever transmission on heterogeneous networks are in agreement\nwith analytical results without any assumptions, reinforcing the relationships\nmay always exist and proposing a mathematical problem of proving their\nexistences in general. Moreover, numerical simulations show that the\nreproduction number is not monotonically increasing or decreasing with the\nextinction threshold. Key parameters in predicting uncertainty of extinction\nthresholds are identified using Latin Hypercube Sampling/Partial Rank\nCorrelation Coefficient. Consistent trends of extinction probability observed\nthrough numerical simulations provide novel insights into mitigation strategies\nto increase the disease extinction probability. Research findings may improve\nunderstandings of thresholds for disease persistence in order to control\nvector-borne diseases.\n", "versions": [{"version": "v1", "created": "Sat, 3 Aug 2013 16:43:23 GMT"}, {"version": "v2", "created": "Tue, 6 Aug 2013 21:23:45 GMT"}], "update_date": "2013-08-08", "authors_parsed": [["Xue", "Ling", ""], ["Scoglio", "Caterina", ""]]}, {"id": "1308.0726", "submitter": "Jesse Shore", "authors": "Jesse Shore, Catherine J. Chu and Matt T. Bianchi", "title": "Power Laws and Fragility in Flow Networks", "comments": "Social Networks, 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.SI nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  What makes economic and ecological networks so unlike other highly skewed\nnetworks in their tendency toward turbulence and collapse? Here, we explore the\nconsequences of a defining feature of these networks: their nodes are tied\ntogether by flow. We show that flow networks tend to the power law degree\ndistribution (PLDD) due to a self-reinforcing process involving position within\nthe global network structure, and thus present the first random graph model for\nPLDDs that does not depend on a rich-get-richer function of nodal degree. We\nalso show that in contrast to non-flow networks, PLDD flow networks are\ndramatically more vulnerable to catastrophic failure than non-PLDD flow\nnetworks, a finding with potential explanatory power in our age of resource-\nand financial-interdependence and turbulence.\n", "versions": [{"version": "v1", "created": "Sat, 3 Aug 2013 17:18:47 GMT"}], "update_date": "2013-08-06", "authors_parsed": [["Shore", "Jesse", ""], ["Chu", "Catherine J.", ""], ["Bianchi", "Matt T.", ""]]}, {"id": "1308.0731", "submitter": "Xiao Xiao", "authors": "Xiao Xiao, Daniel J. McGlinn, and Ethan P. White", "title": "A strong test of the Maximum Entropy Theory of Ecology", "comments": "Main text: 24 pages, 2 figures, 1 table. Appendices: 82 pages, 5\n  appendices, 5 figures, 2 tables", "journal-ref": null, "doi": "10.1086/679576", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Maximum Entropy Theory of Ecology (METE) is a unified theory of\nbiodiversity that predicts a large number of macroecological patterns using\nonly information on the species richness, total abundance, and total metabolic\nrate of the community. We evaluated four major predictions of METE\nsimultaneously at an unprecedented scale using data from 60 globally\ndistributed forest communities including over 300,000 individuals and nearly\n2000 species. METE successfully captured 96% and 89% of the variation in the\nspecies abundance distribution and the individual size distribution, but\nperformed poorly when characterizing the size-density relationship and\nintraspecific distribution of individual size. Specifically, METE predicted a\nnegative correlation between size and species abundance, which is weak in\nnatural communities. By evaluating multiple predictions with large quantities\nof data, our study not only identifies a mismatch between abundance and body\nsize in METE, but also demonstrates the importance of conducting strong tests\nof ecological theories.\n", "versions": [{"version": "v1", "created": "Sat, 3 Aug 2013 19:18:08 GMT"}, {"version": "v2", "created": "Fri, 6 Dec 2013 23:30:51 GMT"}], "update_date": "2015-01-23", "authors_parsed": [["Xiao", "Xiao", ""], ["McGlinn", "Daniel J.", ""], ["White", "Ethan P.", ""]]}, {"id": "1308.0798", "submitter": "John Herrick", "authors": "John Herrick and Bianca Sclavi", "title": "Lineage specific reductions in genome size in salamanders are associated\n  with increased rates of mutation", "comments": "16 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Very low levels of genetic diversity have been reported in vertebrates with\nlarge genomes, notably salamanders and lungfish [1-3]. Interpreting differences\nin heterozygosity, which reflects genetic diversity in a population, is\ncomplicated because levels of heterozygosity vary widely between conspecific\npopulations, and correlate with many different physiological and demographic\nvariables such as body size and effective population size. Here we return to\nthe question of genetic variability in salamanders and report on the\nrelationship between evolutionary rates and genome sizes in five different\nsalamander families. We found that rates of evolution are exceptionally low in\nsalamanders as a group. Evolutionary rates are as low as those reported for\ncartilaginous fish, which have the slowest rates recorded so far in vertebrates\n[4]. We also found that, independent of life history, salamanders with the\nsmallest genomes (14 pg) are evolving at rates two to three times faster than\nsalamanders with the largest genomes (>50 pg). After accounting for\nevolutionary duration, we conclude that more recently evolved species have\ncorrespondingly smaller genomes compared to older taxa and concomitantly higher\nrates of mutation and evolution.\n", "versions": [{"version": "v1", "created": "Sun, 4 Aug 2013 12:08:32 GMT"}, {"version": "v2", "created": "Tue, 3 Sep 2013 21:50:45 GMT"}], "update_date": "2013-09-05", "authors_parsed": [["Herrick", "John", ""], ["Sclavi", "Bianca", ""]]}, {"id": "1308.0962", "submitter": "Sona John", "authors": "Sona John and Kavita Jain", "title": "Effect of drift, selection and recombination on the equilibrium\n  frequency of deleterious mutations", "comments": "Revised version, accepted in Journal of Theoretical Biology", "journal-ref": "J. theor. Biol. 365, 238-246 (2015)", "doi": null, "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the stationary state of a population evolving under the action of\nrandom genetic drift, selection and recombination in which both deleterious and\nreverse beneficial mutations can occur. We find that the equilibrium fraction\nof deleterious mutations decreases as the population size is increased. We\ncalculate exactly the steady state frequency in a nonrecombining population\nwhen population size is infinite and for a neutral finite population, and\nobtain bounds on the fraction of deleterious mutations. We also find that for\nsmall and very large populations, the number of deleterious mutations depends\nweakly on recombination, but for moderately large populations, recombination\nalleviates the effect of deleterious mutations. An analytical argument shows\nthat recombination decreases disadvantageous mutations appreciably when\nbeneficial mutations are rare as is the case in adapting microbial populations,\nwhereas it has a moderate effect on codon bias where the mutation rates between\nthe preferred and unpreferred codons are comparable.\n", "versions": [{"version": "v1", "created": "Mon, 5 Aug 2013 12:53:19 GMT"}, {"version": "v2", "created": "Thu, 23 Oct 2014 15:09:24 GMT"}, {"version": "v3", "created": "Tue, 17 Feb 2015 11:35:29 GMT"}, {"version": "v4", "created": "Tue, 24 Feb 2015 06:38:45 GMT"}], "update_date": "2016-01-13", "authors_parsed": [["John", "Sona", ""], ["Jain", "Kavita", ""]]}, {"id": "1308.0964", "submitter": "Jeromos Vukov", "authors": "Jeromos Vukov, Attila Szolnoki, Gy\\\"orgy Szab\\'o", "title": "Diverging fluctuations in a spatial five-species cyclic dominance game", "comments": "accepted for publication in Physical Review E", "journal-ref": "Physical Review E 88, 022123 (2013)", "doi": "10.1103/PhysRevE.88.022123", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A five-species predator-prey model is studied on a square lattice where each\nspecies has two prey and two predators on the analogy to the\nRock-Paper-Scissors-Lizard-Spock game. The evolution of the spatial\ndistribution of species is governed by site exchange and invasion between the\nneighboring predator-prey pairs, where the cyclic symmetry can be characterized\nby two different invasion rates. The mean-field analysis has indicated periodic\noscillations in the species densities with a frequency becoming zero for a\nspecific ratio of invasion rates. When varying the ratio of invasion rates, the\nappearance of this zero-eigenvalue mode is accompanied by neutrality between\nthe species associations. Monte Carlo simulations of the spatial system reveal\ndiverging fluctuations at a specific invasion rate, which can be related to the\nvanishing dominance between all pairs of species associations.\n", "versions": [{"version": "v1", "created": "Mon, 5 Aug 2013 12:54:39 GMT"}], "update_date": "2013-08-19", "authors_parsed": [["Vukov", "Jeromos", ""], ["Szolnoki", "Attila", ""], ["Szabó", "György", ""]]}, {"id": "1308.1289", "submitter": "Tanja Stadler", "authors": "Amaury Lambert and Tanja Stadler", "title": "Macro-evolutionary models and coalescent point processes: The shape and\n  probability of reconstructed phylogenies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Forward-time models of diversification (i.e., speciation and extinction)\nproduce phylogenetic trees that grow \"vertically\" as time goes by. Pruning the\nextinct lineages out of such trees leads to natural models for reconstructed\ntrees (i.e., phylogenies of extant species). Alternatively, reconstructed trees\ncan be modelled by coalescent point processes (CPP), where trees grow\n\"horizontally\" by the sequential addition of vertical edges. Each new edge\nstarts at some random speciation time and ends at the present time; speciation\ntimes are drawn from the same distribution independently. CPP lead to extremely\nfast computation of tree likelihoods and simulation of reconstructed trees.\nTheir topology always follows the uniform distribution on ranked tree shapes\n(URT). We characterize which forward-time models lead to URT reconstructed\ntrees and among these, which lead to CPP reconstructed trees. We show that for\nany \"asymmetric\" diversification model in which speciation rates only depend on\ntime and extinction rates only depend on time and on a non-heritable trait\n(e.g., age), the reconstructed tree is CPP, even if extant species are\nincompletely sampled. If rates additionally depend on the number of species,\nthe reconstructed tree is (only) URT (but not CPP). We characterize the common\ndistribution of speciation times in the CPP description, and discuss incomplete\nspecies sampling as well as three special model cases in detail: 1) extinction\nrate does not depend on a trait; 2) rates do not depend on time; 3) mass\nextinctions may happen additionally at certain points in the past.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 14:50:57 GMT"}], "update_date": "2013-08-07", "authors_parsed": [["Lambert", "Amaury", ""], ["Stadler", "Tanja", ""]]}, {"id": "1308.1319", "submitter": "Richard A Neher", "authors": "Taylor A. Kessinger, Alan S. Perelson, Richard A. Neher", "title": "Inferring HIV escape rates from multi-locus genotype data", "comments": null, "journal-ref": "Front. Immunol. 4:252. 2013", "doi": "10.3389/fimmu.2013.00252", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cytotoxic T-lymphocytes (CTLs) recognize viral protein fragments displayed by\nmajor histocompatibility complex (MHC) molecules on the surface of virally\ninfected cells and generate an anti-viral response that can kill the infected\ncells. Virus variants whose protein fragments are not efficiently presented on\ninfected cells or whose fragments are presented but not recognized by CTLs\ntherefore have a competitive advantage and spread rapidly through the\npopulation. We present a method that allows a more robust estimation of these\nescape rates from serially sampled sequence data. The proposed method accounts\nfor competition between multiple escapes by explicitly modeling the\naccumulation of escape mutations and the stochastic effects of rare multiple\nmutants. Applying our method to serially sampled HIV sequence data, we estimate\nrates of HIV escape that are substantially larger than those previously\nreported. The method can be extended to complex escapes that require\ncompensatory mutations. We expect our method to be applicable in other contexts\nsuch as cancer evolution where time series data is also available.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 15:50:27 GMT"}], "update_date": "2014-03-25", "authors_parsed": [["Kessinger", "Taylor A.", ""], ["Perelson", "Alan S.", ""], ["Neher", "Richard A.", ""]]}, {"id": "1308.1446", "submitter": "Kimberly Schlesinger", "authors": "Kimberly J. Schlesinger, Sean P. Stromberg, and Jean M. Carlson", "title": "Coevolutionary immune system dynamics driving pathogen speciation", "comments": "main article: 16 pages, 5 figures; supporting information: 3 pages", "journal-ref": "PLoS ONE 9(7): e102821", "doi": "10.1371/journal.pone.0102821", "report-no": null, "categories": "q-bio.PE physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce and analyze a within-host dynamical model of the coevolution\nbetween rapidly mutating pathogens and the adaptive immune response. Pathogen\nmutation and a homeostatic constraint on lymphocytes both play a role in\nallowing the development of chronic infection, rather than quick pathogen\nclearance. The dynamics of these chronic infections display emergent structure,\nincluding branching patterns corresponding to asexual pathogen speciation,\nwhich is fundamentally driven by the coevolutionary interaction. Over time,\ncontinued branching creates an increasingly fragile immune system, and leads to\nthe eventual catastrophic loss of immune control.\n", "versions": [{"version": "v1", "created": "Tue, 6 Aug 2013 23:35:00 GMT"}, {"version": "v2", "created": "Thu, 29 Aug 2013 20:42:32 GMT"}, {"version": "v3", "created": "Mon, 4 Aug 2014 23:40:20 GMT"}], "update_date": "2014-08-06", "authors_parsed": [["Schlesinger", "Kimberly J.", ""], ["Stromberg", "Sean P.", ""], ["Carlson", "Jean M.", ""]]}, {"id": "1308.1451", "submitter": "Hunter Fraser", "authors": "Justin D. Smith, Kimberly F. McManus, and Hunter B. Fraser", "title": "A novel test for selection on cis-regulatory elements reveals positive\n  and negative selection acting on mammalian transcriptional enhancers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Measuring natural selection on genomic elements involved in the\ncis-regulation of gene expression -- such as transcriptional enhancers and\npromoters -- is critical for understanding the evolution of genomes, yet it\nremains a major challenge. Many studies have attempted to detect positive or\nnegative selection in these noncoding elements by searching for those with the\nfastest or slowest rates of evolution, but this can be problematic. Here we\nintroduce a new approach to this issue, and demonstrate its utility on three\nmammalian transcriptional enhancers. Using results from saturation mutagenesis\nstudies of these enhancers, we classified all possible point mutations as\nup-regulating, down-regulating, or silent, and determined which of these\nmutations have occurred on each branch of a phylogeny. Applying a framework\nanalogous to Ka/Ks in protein-coding genes, we measured the strength of\nselection on up-regulating and down-regulating mutations, in specific branches\nas well as entire phylogenies. We discovered distinct modes of selection acting\non different enhancers: while all three have experienced negative selection\nagainst down-regulating mutations, the selection pressures on up-regulating\nmutations vary. In one case we detected positive selection for up-regulation,\nwhile the other two had no detectable selection on up-regulating mutations. Our\nmethodology is applicable to the growing number of saturation mutagenesis data\nsets, and provides a detailed picture of the mode and strength of natural\nselection acting on cis-regulatory elements.\n", "versions": [{"version": "v1", "created": "Wed, 7 Aug 2013 00:24:39 GMT"}], "update_date": "2013-08-08", "authors_parsed": [["Smith", "Justin D.", ""], ["McManus", "Kimberly F.", ""], ["Fraser", "Hunter B.", ""]]}, {"id": "1308.1453", "submitter": "Hunter Fraser", "authors": "Jessica Chang, Yiqi Zhou, Xiaoli Hu, Lucia Lam, Cameron Henry, Erin M.\n  Green, Ryosuke Kita, Michael S. Kobor, and Hunter B. Fraser", "title": "The molecular mechanism of a cis-regulatory adaptation in yeast", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite recent advances in our ability to detect adaptive evolution involving\nthe cis-regulation of gene expression, our knowledge of the molecular\nmechanisms underlying these adaptations has lagged far behind. Across all model\norganisms the causal mutations have been discovered for only a handful of gene\nexpression adaptations, and even for these, mechanistic details (e.g. the\ntrans-regulatory factors involved) have not been determined. We previously\nreported a polygenic gene expression adaptation involving down-regulation of\nthe ergosterol biosynthesis pathway in the budding yeast Saccharomyces\ncerevisiae. Here we investigate the molecular mechanism of a cis-acting\nmutation affecting a member of this pathway, ERG28. We show that the causal\nmutation is a two-base deletion in the promoter of ERG28 that strongly reduces\nthe binding of two transcription factors, Sok2 and Mot3, thus abolishing their\nregulation of ERG28. This down-regulation increases resistance to a widely used\nantifungal drug targeting ergosterol, similar to mutations disrupting this\npathway in clinical yeast isolates. The identification of the causal genetic\nvariant revealed that the selection likely occurred after the deletion was\nalready present at high frequency in the population, rather than when it was a\nnew mutation. These results provide a detailed view of the molecular mechanism\nof a cis-regulatory adaptation, and underscore the importance of this view to\nour understanding of evolution at the molecular level.\n", "versions": [{"version": "v1", "created": "Wed, 7 Aug 2013 00:42:01 GMT"}], "update_date": "2013-08-08", "authors_parsed": [["Chang", "Jessica", ""], ["Zhou", "Yiqi", ""], ["Hu", "Xiaoli", ""], ["Lam", "Lucia", ""], ["Henry", "Cameron", ""], ["Green", "Erin M.", ""], ["Kita", "Ryosuke", ""], ["Kobor", "Michael S.", ""], ["Fraser", "Hunter B.", ""]]}, {"id": "1308.1564", "submitter": "Tibor Antal", "authors": "Tibor Antal, P. L. Krapivsky, M. A. Nowak", "title": "Spatial evolution of tumors with successive driver mutations", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the spatial evolutionary dynamics of solid tumors as they obtain\nadditional driver mutations. We start with a cancer clone that expands\nuniformly in three dimensions giving rise to a spherical shape. We assume that\ncell division occurs on the surface of the growing tumor. Each cell division\nhas a chance to give rise to a mutation that activates an additional driver\ngene. The resulting clone has an enhanced growth rate, which generates a local\nensemble of faster growing cells, thereby distorting the spherical shape of the\ntumor. We derive analytic formulas for the geometric boundary that separates\nthe original cancer clone from the new mutant as well as the expanding frontier\nof the new mutant. The total number of original cancer cells converges to a\nconstant as time goes to infinity, because this clone becomes enveloped by\nmutants. We derive formulas for the abundance and diversity of additional\ndriver mutations as function of time. Our model is semi-deterministic: the\nspatial growth of the various cancer clones follows deterministic equations,\nbut the arrival of a new mutant is a stochastic event.\n", "versions": [{"version": "v1", "created": "Wed, 7 Aug 2013 13:19:26 GMT"}], "update_date": "2013-08-08", "authors_parsed": [["Antal", "Tibor", ""], ["Krapivsky", "P. L.", ""], ["Nowak", "M. A.", ""]]}, {"id": "1308.1646", "submitter": "Sergei Maslov", "authors": "Sergei Maslov and Kim Sneppen", "title": "Well-temperate phage: optimal bet-hedging against local environmental\n  collapses", "comments": "26 pages, 3 figures", "journal-ref": "Scientific Reports 5, Article number: 10523 (2015)", "doi": "10.1038/srep10523", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Upon infection of their bacterial hosts temperate phages must chose between\nlysogenic and lytic developmental strategies. Here we apply the game-theoretic\nbet-hedging strategy introduced by Kelly to derive the optimal lysogenic\nfraction of the total population of phages as a function of frequency and\nintensity of environmental downturns affecting the lytic subpopulation.\n\"Well-temperate\" phage from our title is characterized by the best long-term\npopulation growth rate. We show that it is realized when the lysogenization\nfrequency is approximately equal to the probability of lytic population\ncollapse. We further predict the existence of sharp boundaries in system's\nenvironmental, ecological, and biophysical parameters separating the regions\nwhere this temperate strategy is optimal from those dominated by purely\nvirulent or} dormant (purely lysogenic) strategies. We show that the virulent\nstrategy works best for phages with large diversity of hosts, and access to\nmultiple independent environments reachable by diffusion. Conversely,\nprogressively more temperate or even dormant strategies are favored in the\nenvironments, that are subject to frequent and severe temporal downturns.\n", "versions": [{"version": "v1", "created": "Wed, 7 Aug 2013 17:48:17 GMT"}, {"version": "v2", "created": "Mon, 2 Mar 2015 14:18:10 GMT"}, {"version": "v3", "created": "Tue, 14 Jul 2015 19:15:34 GMT"}], "update_date": "2015-07-15", "authors_parsed": [["Maslov", "Sergei", ""], ["Sneppen", "Kim", ""]]}, {"id": "1308.1810", "submitter": "Ricardo Martinez-Garcia", "authors": "Ricardo Martinez-Garcia, Justin M. Calabrese, Emilio Hernandez-Garcia\n  and Cristobal Lopez", "title": "Vegetation pattern formation in semiarid systems without facilitative\n  mechanisms", "comments": "21 pages, 3 figures", "journal-ref": "Geophysical Research Letters, 40, 6143-6147 (2013)", "doi": "10.1002/2013GL058797", "report-no": null, "categories": "q-bio.PE cond-mat.other nlin.PS physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regular vegetation patterns in semiarid ecosystems are believed to arise from\nthe interplay between long-range competition and facilitation processes acting\nat smaller distances. We show that, under rather general conditions, long-range\ncompetition alone may be enough to shape these patterns. To this end we propose\na simple, general model for the dynamics of vegetation, which includes only\nlong-range competition between plants. Competition is introduced through a\nnonlocal term, where the kernel function quantifies the intensity of the\ninteraction. We recover the full spectrum of spatial structures typical of\nvegetation models that also account for facilitation in addition to\ncompetition.\n", "versions": [{"version": "v1", "created": "Thu, 8 Aug 2013 10:26:45 GMT"}, {"version": "v2", "created": "Wed, 20 Nov 2013 14:57:12 GMT"}, {"version": "v3", "created": "Thu, 21 Nov 2013 10:51:17 GMT"}, {"version": "v4", "created": "Wed, 23 Jul 2014 13:12:34 GMT"}], "update_date": "2014-07-24", "authors_parsed": [["Martinez-Garcia", "Ricardo", ""], ["Calabrese", "Justin M.", ""], ["Hernandez-Garcia", "Emilio", ""], ["Lopez", "Cristobal", ""]]}, {"id": "1308.1938", "submitter": "Kenneth Pienta", "authors": "Kenneth J. Pienta, Bruce Robertson, Donald S. Coffey, Russell S.\n  Taichman", "title": "The Cancer Diaspora: Metastasis beyond the seed and soil hypothesis", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.TO q-bio.CB q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Do cancer cells escape their confinement of their original habitat in the\nprimary tumor or are they forced out by ecological changes in their home niche?\nDescribing metastasis in terms of a simple one-way migration of cells from the\nprimary to target organs is an insufficient concept to cover the nuances of\ncancer spread. A diaspora is the scattering of people away from an established\nhomeland. To date, diaspora has been a uniquely human term utilized by social\nscientists, however, the application of the diaspora concept to metastasis may\nyield new biological insights as well as therapeutic paradigms. The diaspora\nparadigm takes into account and models several variables: the quality of the\nprimary tumor microenvironment, the fitness of individual cancer cell migrants\nas well as migrant populations, the rate of bidirectional migration of cancer\nand host cells between cancer sites, and the quality of the target\nmicroenvironments to establish metastatic sites. Ecological scientific\nprinciples can be applied to the cancer diaspora to develop new therapeutic\nstrategies. For example, ecological traps, habitats that lead to the extinction\nof a species, can be developed to attract cancer cells to a place where they\ncan be better exposed to treatments or to cells of the immune system for\nimproved antigen presentation. Merging the social science concept of diaspora\nwith ecological and population sciences concepts can inform the cancer field to\nunderstand the biology of tumorigenesis and metastasis and inspire new ideas\nfor therapy.\n", "versions": [{"version": "v1", "created": "Thu, 8 Aug 2013 19:14:09 GMT"}], "update_date": "2013-08-09", "authors_parsed": [["Pienta", "Kenneth J.", ""], ["Robertson", "Bruce", ""], ["Coffey", "Donald S.", ""], ["Taichman", "Russell S.", ""]]}, {"id": "1308.1947", "submitter": "Matjaz Perc", "authors": "Zhen Wang, Attila Szolnoki, Matjaz Perc", "title": "Interdependent network reciprocity in evolutionary games", "comments": "7 two-column pages, 6 figures; accepted for publication in Scientific\n  Reports", "journal-ref": "Sci. Rep. 3 (2013) 1183", "doi": "10.1038/srep01183", "report-no": null, "categories": "physics.soc-ph cs.GT cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Besides the structure of interactions within networks, also the interactions\nbetween networks are of the outmost importance. We therefore study the outcome\nof the public goods game on two interdependent networks that are connected by\nmeans of a utility function, which determines how payoffs on both networks\njointly influence the success of players in each individual network. We show\nthat an unbiased coupling allows the spontaneous emergence of interdependent\nnetwork reciprocity, which is capable to maintain healthy levels of public\ncooperation even in extremely adverse conditions. The mechanism, however,\nrequires simultaneous formation of correlated cooperator clusters on both\nnetworks. If this does not emerge or if the coordination process is disturbed,\nnetwork reciprocity fails, resulting in the total collapse of cooperation.\nNetwork interdependence can thus be exploited effectively to promote\ncooperation past the limits imposed by isolated networks, but only if the\ncoordination between the interdependent networks is not disturbed.\n", "versions": [{"version": "v1", "created": "Thu, 8 Aug 2013 19:55:03 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["Wang", "Zhen", ""], ["Szolnoki", "Attila", ""], ["Perc", "Matjaz", ""]]}, {"id": "1308.1984", "submitter": "Alan Rogers", "authors": "Alan R. Rogers", "title": "How Population Growth Affects Linkage Disequilibrium", "comments": null, "journal-ref": null, "doi": "10.1534/genetics.114.166454", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Linkage disequilibrium (LD) is often summarized using the \"LD curve,\" which\nrelates the LD between pairs of sites to the distance that separates them along\nthe chromosome. This paper shows how the LD curve responds to changes in\npopulation size. An expansion of population size generates an LD curve that\ndeclines steeply, especially if that expansion has followed a bottleneck. A\nreduction in size generates an LD curve that is high but relatively flat. In\nEuropean data, the curve is steep, suggesting a history of population\nexpansion.\n  These conclusions emerge from the study of $\\sigma_d^2$, a measure of LD that\nhas never played a central role. It has been seen merely as an approximation to\nanother measure, $r^2$. Yet $\\sigma_d^2$ has different dynamical behavior and\nprovides deeper time depth. Furthermore, it is easily estimated from data and\ncan be predicted from population history using a fast, deterministic algorithm.\n", "versions": [{"version": "v1", "created": "Thu, 8 Aug 2013 21:39:13 GMT"}, {"version": "v2", "created": "Sun, 10 Nov 2013 22:30:45 GMT"}], "update_date": "2014-06-10", "authors_parsed": [["Rogers", "Alan R.", ""]]}, {"id": "1308.2009", "submitter": "Lucas Valdez D.", "authors": "L. D. Valdez, C. Buono, P. A. Macri and L. A. Braunstein", "title": "Social distancing strategies against disease spreading", "comments": "to be published in \"Perspectives and Challenges in Statistical\n  Physics and Complex Systems for the Next Decade\", Word Scientific Press", "journal-ref": null, "doi": "10.1142/S0218348X13500199", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recurrent infectious diseases and their increasing impact on the society\nhas promoted the study of strategies to slow down the epidemic spreading. In\nthis review we outline the applications of percolation theory to describe\nstrategies against epidemic spreading on complex networks. We give a general\noutlook of the relation between link percolation and the\nsusceptible-infected-recovered model, and introduce the node void percolation\nprocess to describe the dilution of the network composed by healthy individual,\n$i.e$, the network that sustain the functionality of a society. Then, we survey\ntwo strategies: the quenched disorder strategy where an heterogeneous\ndistribution of contact intensities is induced in society, and the intermittent\nsocial distancing strategy where health individuals are persuaded to avoid\ncontact with their neighbors for intermittent periods of time. Using\npercolation tools, we show that both strategies may halt the epidemic\nspreading. Finally, we discuss the role of the transmissibility, $i.e$, the\neffective probability to transmit a disease, on the performance of the\nstrategies to slow down the epidemic spreading.\n", "versions": [{"version": "v1", "created": "Fri, 9 Aug 2013 01:21:01 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Valdez", "L. D.", ""], ["Buono", "C.", ""], ["Macri", "P. A.", ""], ["Braunstein", "L. A.", ""]]}, {"id": "1308.2135", "submitter": "Chris Nasrallah Ph.D.", "authors": "Chris A. Nasrallah", "title": "The dynamics of alternative pathways to compensatory substitution", "comments": "17 pages, 9 figures, 1 table. Accepted to RECOMB Comparative Genomics\n  Meeting 2013, to be published in BMC Bioinformatics", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The role of epistatic interactions among loci is a central question in\nevolutionary biology and is increasingly relevant in the genomic age. While the\npopulation genetics of compensatory substitution have received considerable\nattention, most studies have focused on the case when natural selection is very\nstrong against deleterious intermediates. In the biologically-plausible\nscenario of weak to moderate selection there exist two alternate pathways for\ncompensatory substitution. In one pathway, a deleterious mutation becomes fixed\nprior to occurrence of the compensatory mutation. In the other, the two loci\nare simultaneously polymorphic. The rates of compensatory substitution along\nthese two pathways and their relative probabilities are functions of the\npopulation size, selection strength, mutation rate, and recombination rate. In\nthis paper these rates and path probabilities are derived analytically and\nverified using population genetic simulations. The expected time durations of\nthese two paths are similar when selection is moderate, but not when selection\nis weak. The effect of recombination on the dynamics of the substitution\nprocess are explored using simulation. Using the derived rates, a phylogenetic\nsubstitution model of the compensatory evolution process is presented that\ncould be used for inference of population genetic parameters from interspecific\ndata.\n", "versions": [{"version": "v1", "created": "Fri, 9 Aug 2013 14:29:16 GMT"}], "update_date": "2013-08-12", "authors_parsed": [["Nasrallah", "Chris A.", ""]]}, {"id": "1308.2190", "submitter": "Matthew Jastrebski", "authors": "Matthew Jastrebski, Joan Ponce, Daniel Burkow, Oyita Udiani, Dr. Leon\n  Arriola", "title": "Ticks, Deer, Mice, and a Touch of Sensitivity: A Recipe for Controlling\n  Lyme Disease", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Borrelia burgdorferi sensu stricto is a bacterial spirochete prevalent in the\nNortheastern United States that causes Lyme disease. Lyme disease is the most\ncommon arthropod-borne disease in the United States; affecting mice, deer,\nhumans and other mammals. The disease is spread by Ixodes Scapularis, a species\nof tick whose primary food source are deer and mice. Reducing the population of\nticks feeding on both large and small mammals below some critical threshold can\ndecrease the prevalence of Lyme disease among humans. A simplified,\nsix-dimensional Susceptible-Infected, SI, model is used to capture the\nmice-deer-tick dynamics while considering the impact of varying\npopulation-specific death rates on infected population size. We analyzed the\nstability of the models two equilibria, the unstable disease free equilibrium\nand the endemic equilibrium. Static forward sensitivity analysis is conducted\non the basic reproduction number and the endemic equilibrium. A dynamic\napproach was explored to observe change in the sensitivity of the death rates\nover time. These analyses were conducted to determine the efficacy of changing\ndeath rates in order to reduce prevalence of Lyme disease.\n", "versions": [{"version": "v1", "created": "Fri, 26 Jul 2013 20:53:28 GMT"}], "update_date": "2013-08-12", "authors_parsed": [["Jastrebski", "Matthew", ""], ["Ponce", "Joan", ""], ["Burkow", "Daniel", ""], ["Udiani", "Oyita", ""], ["Arriola", "Dr. Leon", ""]]}, {"id": "1308.2273", "submitter": "Naoki Masuda Dr.", "authors": "Yohei Nakajima and Naoki Masuda", "title": "Evolutionary dynamics in finite populations with zealots", "comments": "1 table, 4 figures", "journal-ref": "Journal of Mathematical Biology, 70, 465-484 (2015)", "doi": "10.1007/s00285-014-0770-2", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate evolutionary dynamics of two-strategy matrix games with\nzealots in finite populations. Zealots are assumed to take either strategy\nregardless of the fitness. When the strategy selected by the zealots is the\nsame, the fixation of the strategy selected by the zealots is a trivial\noutcome. We study fixation time in this scenario. We show that the fixation\ntime is divided into three main regimes, in one of which the fixation time is\nshort, and in the other two the fixation time is exponentially long in terms of\nthe population size. Different from the case without zealots, there is a\nthreshold selection intensity below which the fixation is fast for an arbitrary\npayoff matrix. We illustrate our results with examples of various social\ndilemma games.\n", "versions": [{"version": "v1", "created": "Sat, 10 Aug 2013 03:59:11 GMT"}, {"version": "v2", "created": "Thu, 17 Mar 2016 10:41:31 GMT"}], "update_date": "2016-03-18", "authors_parsed": [["Nakajima", "Yohei", ""], ["Masuda", "Naoki", ""]]}, {"id": "1308.2430", "submitter": "Trevor Hefley", "authors": "Trevor Hefley, Andrew Tyre, David Baasch, Erin Blankenship", "title": "Nondetection sampling bias in marked presence-only data", "comments": "Published in Ecology and Evolution", "journal-ref": null, "doi": "10.1002/ece3.887", "report-no": null, "categories": "q-bio.PE stat.AP", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  1. Species distribution models (SDM) are tools used to determine\nenvironmental features that influence the geographic distribution of species'\nabundance and have been used to analyze presence-only records. Analysis of\npresence-only records may require correction for nondetection sampling bias to\nyield reliable conclusions. In addition, individuals of some species of animals\nmay be highly aggregated and standard SDMs ignore environmental features that\nmay influence aggregation behavior. 2. We contend that nondetection sampling\nbias can be treated as missing data. Statistical theory and corrective methods\nare well developed for missing data, but have been ignored in the literature on\nSDMs. We developed a marked inhomogeneous Poisson point process model that\naccounted for nondetection and aggregation behavior in animals and tested our\nmethods on simulated data. 3. Correcting for nondetection sampling bias\nrequires estimates of the probability of detection which must be obtained from\nauxiliary data, as presence-only data do not contain information about the\ndetection mechanism. Weighted likelihood methods can be used to correct for\nnondetection if estimates of the probability of detection are available. We\nused an inhomogeneous Poisson point process model to model group abundance, a\nzero-truncated generalized linear model to model group size, and combined these\ntwo models to describe the distribution of abundance. Our methods performed\nwell on simulated data when nondetection was accounted for and poorly when\ndetection was ignored. 4. We recommend researchers consider the effects of\nnondetection sampling bias when modeling species distributions using\npresence-only data. If information about the detection process is available, we\nrecommend researchers explore the effects of nondetection and, when warranted,\ncorrect the bias using our methods.\n", "versions": [{"version": "v1", "created": "Sun, 11 Aug 2013 21:26:35 GMT"}, {"version": "v2", "created": "Wed, 4 Dec 2013 05:51:20 GMT"}], "update_date": "2013-12-05", "authors_parsed": [["Hefley", "Trevor", ""], ["Tyre", "Andrew", ""], ["Baasch", "David", ""], ["Blankenship", "Erin", ""]]}, {"id": "1308.2532", "submitter": "Marcel Mohr", "authors": "Marcel Mohr, Maria Vittoria Barbarossa, Christina Kuttler", "title": "Predator-Prey Interactions, Age Structures and Delay Equations", "comments": null, "journal-ref": "Mathematical Modelling of Natural Phenomena 9(1): pp 92-107 (2014)", "doi": "10.1051/mmnp/20149107", "report-no": null, "categories": "q-bio.PE math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A general framework for age-structured predator-prey systems is introduced.\nIndividuals are distinguished into two classes, juveniles and adults, and\nseveral possible interactions are considered. The initial system of partial\ndifferential equations is reduced to a system of (neutral) delay differential\nequations with one or two delays. Thanks to this approach, physically correct\nmodels for predator-prey with delay are provided. Previous models are\nconsidered and analysed in view of the above results. A Rosenzweig-MacArthur\nmodel with delay is presented as an example.\n", "versions": [{"version": "v1", "created": "Mon, 12 Aug 2013 11:52:38 GMT"}], "update_date": "2014-11-13", "authors_parsed": [["Mohr", "Marcel", ""], ["Barbarossa", "Maria Vittoria", ""], ["Kuttler", "Christina", ""]]}, {"id": "1308.2537", "submitter": "Katharina Huber", "authors": "Katharina T. Huber and George Kettleborough", "title": "Distinguished minimal toplogical lassos", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A classical result in distance based tree-reconstruction characterizes when\nfor a distance $D$ on some finite set $X$ there exist a uniquely determined\ndendrogram on $X$ (essentially a rooted tree $T=(V,E)$ with leaf set $X$ and no\ndegree two vertices but possibly the root and an edge weighting $\\omega:E\\to\n\\mathbb R_{\\geq 0}$) such that the distance $D_{(T,\\omega)}$ induced by\n$(T,\\omega)$ on $X$ is $D$. Moreover, algorithms that quickly reconstruct\n$(T,\\omega)$ from $D$ in this case are known. However in many areas where\ndendrograms are being constructed such as Computational Biology not all\ndistances on $X$ are always available implying that the sought after dendrogram\nneed not be uniquely determined anymore by the available distances with regards\nto topology of the underlying tree, edge-weighting, or both. To better\nunderstand the structural properties a set $\\cL\\subseteq {X\\choose 2}$ has to\nsatisfy to overcome this problem, various types of lassos have been introduced.\nHere, we focus on the question of when a lasso uniquely determines the topology\nof a dendrogram's underlying tree, that is, it is a topological lasso for that\ntree. We show that any set-inclusion minimal topological lasso for such a tree\n$T$ can be transformed into a 'distinguished' minimal topological lasso $\\cL$\nfor $T$, that is, the graph $(X,\\cL)$ is a claw-free block graph. Furthermore,\nwe characterize such lassos in terms of the novel concept of a cluster marker\nmap for $T$ and present results concerning the heritability of such lassos in\nthe context of the subtree and supertree problems.\n", "versions": [{"version": "v1", "created": "Mon, 12 Aug 2013 12:05:03 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["Huber", "Katharina T.", ""], ["Kettleborough", "George", ""]]}, {"id": "1308.2576", "submitter": "Lars Roemheld", "authors": "Lars Roemheld", "title": "Evolutionary Extortion and Mischief: Zero Determinant strategies in\n  iterated 2x2 games", "comments": "Bachelor thesis at Heidelberg University", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the mechanisms, implications, and potential applications\nof the recently discovered class of Zero Determinant (ZD) strategies in\niterated 2x2 games. These strategies were reported to successfully extort pure\neconomic maximizers, and to mischievously determine the set of feasible\nlong-term payoffs in iterated Prisoners' Dilemma by enforcing linear\nconstraints on both players' expected average scores.\n  These results are generalized for all symmetric 2x2 games and a general\nBattle of the Sexes, exemplified by four common games. Additionally, a\ncomparison to conventional strategies is made and typical ZD gameplay\nsimulations are analyzed along with convergence speeds. Several response\nstrategies are discussed, including a glance on how time preferences change\nprevious results. Furthermore, a possibility of retaliation is presented: when\nmaximin scores exceed the minimum symmetric payoff, it is possible to extort\nthe extortioner.\n  Finally, a summary of findings from evolutionary game theory shows that\nmischief is limited by its own malice. Nevertheless, this does not challenge\nthe result that mindless economic maximization is subject to extortion: the\nstudy of ZD strategies reveals exciting new perspectives and opportunities in\ngame theory, both evolutionary and classic.\n", "versions": [{"version": "v1", "created": "Mon, 12 Aug 2013 14:24:49 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["Roemheld", "Lars", ""]]}, {"id": "1308.2969", "submitter": "Charles Fisher", "authors": "Charles K. Fisher, Pankaj Mehta", "title": "A phase transition between the niche and neutral regimes in ecology", "comments": null, "journal-ref": null, "doi": "10.1073/pnas.1405637111", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An ongoing debate in ecology concerns the impacts of ecological drift and\nselection on community assembly. Here, we show that there is a sharp phase\ntransition in diverse ecological communities between a selection dominated\nregime (the niche phase) and a drift dominated regime (the neutral phase).\nSimulations and analytic arguments show that the niche phase is favored in\ncommunities with large population sizes and relatively constant environments,\nwhereas the neutral phase is favored in communities with small population sizes\nand fluctuating environments. Our results demonstrate how apparently neutral\npopulations may arise even in communities inhabited by species with varying\ntraits.\n", "versions": [{"version": "v1", "created": "Tue, 13 Aug 2013 20:01:39 GMT"}, {"version": "v2", "created": "Fri, 28 Mar 2014 17:17:52 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Fisher", "Charles K.", ""], ["Mehta", "Pankaj", ""]]}, {"id": "1308.3025", "submitter": "Tatsuya Sasaki", "authors": "Satoshi Uchida and Tatsuya Sasaki", "title": "Effect of assessment error and private information on stern-judging in\n  indirect reciprocity", "comments": "18 pages and 2 figures", "journal-ref": "Chaos, Solitons & Fractals, 56,175-180 (2013)", "doi": "10.1016/j.chaos.2013.08.006", "report-no": null, "categories": "physics.soc-ph cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stern-judging is one of the best-known assessment rules in indirect\nreciprocity. Indirect reciprocity is a fundamental mechanism for the evolution\nof cooperation. It relies on mutual monitoring and assessments, i.e.,\nindividuals judge, following their own assessment rules, whether other\nindividuals are \"good\" or \"bad\" according to information on their past\nbehaviors. Among many assessment rules, stern-judging is known to provide\nstable cooperation in a population, as observed when all members in the\npopulation know all about others' behaviors (public information case) and when\nthe members never commit an assessment error. In this paper, the effect of\nassessment error and private information on stern-judging is investigated. By\nanalyzing the image matrix, which describes who is good in the eyes of whom in\nthe population, we analytically show that private information and assessment\nerror cause the collapse of stern-judging: all individuals assess other\nindividuals as \"good\" at random with a probability of 1/2.\n", "versions": [{"version": "v1", "created": "Wed, 14 Aug 2013 04:22:37 GMT"}], "update_date": "2013-09-05", "authors_parsed": [["Uchida", "Satoshi", ""], ["Sasaki", "Tatsuya", ""]]}, {"id": "1308.3114", "submitter": "Florian Hartig", "authors": "Florian Hartig, Tamara M\\\"unkem\\\"uller, Karin Johst and Ulf Dieckmann", "title": "On the sympatric evolution and evolutionary stability of coexistence by\n  relative nonlinearity of competition", "comments": "PLOS ONE, in press", "journal-ref": null, "doi": "10.1371/journal.pone.0094454", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  If two species exhibit different nonlinear responses to a single shared\nresource, and if each species modifies the resource dynamics such that this\nfavors its competitor, they may stably coexist. This coexistence mechanism,\nknown as relative nonlinearity of competition, is well understood\ntheoretically, but less is known about its evolutionary properties and its\nprevalence in real communities. We address this challenge by using adaptive\ndynamics theory and individual-based simulations to compare community\nstabilization and evolutionary stability of species that coexist by relative\nnonlinearity. In our analysis, evolution operates on the species'\ndensity-compensation strategies, and we consider a trade-off between population\ngrowth rates at high and low resource availability. We confirm previous\nfindings that, irrespective of the particular model of density dependence,\nthere are many combinations of overcompensating and undercompensating\ndensity-compensation strategies that allow stable coexistence by relative\nnonlinearity. However, our analysis also shows that most of these strategy\ncombinations are not evolutionarily stable and will be outcompeted by an\nintermediate density-compensation strategy. Only very specific trade-offs lead\nto evolutionarily stable coexistence by relative nonlinearity. As we find no\nreason why these particular trade-offs should be common in nature, we conclude\nthat the sympatric evolution and evolutionary stability of relative\nnonlinearity, while possible in principle, seems rather unlikely. We speculate\nthat this may, at least in part, explain why empirical demonstrations of this\ncoexistence mechanism are rare, noting, however, that the difficulty to detect\nrelative nonlinearity in the field [...]\n", "versions": [{"version": "v1", "created": "Wed, 14 Aug 2013 13:23:05 GMT"}, {"version": "v2", "created": "Mon, 21 Apr 2014 18:20:15 GMT"}, {"version": "v3", "created": "Sun, 3 Aug 2014 12:30:05 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Hartig", "Florian", ""], ["Münkemüller", "Tamara", ""], ["Johst", "Karin", ""], ["Dieckmann", "Ulf", ""]]}, {"id": "1308.3361", "submitter": "Anders Johansson", "authors": "Lara Gosc\\'e, David A W Barton, Anders Johansson", "title": "Analytical Modelling of the Spread of Disease in Confined and Crowded\n  Spaces", "comments": null, "journal-ref": "Gosc\\'e, L., Barton, D. A. W., and Anders Johansson (2014)\n  Analytical modelling of the spread of disease in confined and crowded spaces,\n  Scientific Reports 4, 4856", "doi": "10.1038/srep04856", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Since 1927, until recently, models describing the spread of disease have\nmostly been of the SIR-compartmental type, based on the assumption that\npopulations are homogeneous and well-mixed. The focus of these models have\ntypically been on large-scale analysis of scenarios such as cities, nations or\neven world scale. SIR models are appealing because of their simplicity, but\ntheir parameters, especially the transmission rate, are complex and depend on a\nnumber of factors, which makes it hard to predict how a change of a single\nenvironmental, demographic, or epidemiological factor will affect the\npopulation. Therefore, in this contribution we start to unpick the\ntransmission-rate parameter. Analysing the implications that arise when taking\ncrowd behaviour explicitly into account, we show how both the rate of infection\nas well as the walking speed depend on the local crowd density around an\ninfected individual. The combined effect is that the rate of infection at a\npopulation scale has an analytically tractable non-linear dependency on crowd\ndensity. We model the spread of a hypothetical disease in a corridor and\ncompare our new model with a typical compartmental model, which highlights the\nregime in which current models may not produce credible results.\n", "versions": [{"version": "v1", "created": "Thu, 15 Aug 2013 11:11:41 GMT"}, {"version": "v2", "created": "Mon, 21 Jul 2014 21:03:48 GMT"}], "update_date": "2014-07-23", "authors_parsed": [["Goscé", "Lara", ""], ["Barton", "David A W", ""], ["Johansson", "Anders", ""]]}, {"id": "1308.3485", "submitter": "Matjaz Perc", "authors": "Attila Szolnoki, Matjaz Perc", "title": "Information sharing promotes prosocial behaviour", "comments": "14 pages, 7 figures; accepted for publication in New Journal of\n  Physics", "journal-ref": "New J. Phys. 15 (2013) 053010", "doi": "10.1088/1367-2630/15/5/053010", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  More often than not, bad decisions are bad regardless of where and when they\nare made. Information sharing might thus be utilized to mitigate them. Here we\nshow that sharing the information about strategy choice between players\nresiding on two different networks reinforces the evolution of cooperation. In\nevolutionary games the strategy reflects the action of each individual that\nwarrants the highest utility in a competitive setting. We therefore assume that\nidentical strategies on the two networks reinforce themselves by lessening\ntheir propensity to change. Besides network reciprocity working in favour of\ncooperation on each individual network, we observe the spontaneous emerge of\ncorrelated behaviour between the two networks, which further deters defection.\nIf information is shared not just between individuals but also between groups,\nthe positive effect is even stronger, and this despite the fact that\ninformation sharing is implemented without any assumptions with regards to\ncontent.\n", "versions": [{"version": "v1", "created": "Thu, 15 Aug 2013 19:55:31 GMT"}], "update_date": "2013-08-16", "authors_parsed": [["Szolnoki", "Attila", ""], ["Perc", "Matjaz", ""]]}, {"id": "1308.3584", "submitter": "Serguei Saavedra", "authors": "Serguei Saavedra, Rudolf P. Rohr, Vasilis Dakos, Jordi Bascompte", "title": "Estimating the tolerance of species to the effects of global\n  environmental change", "comments": "Nature Communications 4, Article number: 2350, (2013)", "journal-ref": null, "doi": "10.1038/ncomms3350", "report-no": null, "categories": "q-bio.PE physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Global environmental change is affecting species distribution and their\ninteractions with other species. In particular, the main drivers of\nenvironmental change strongly affect the strength of interspecific interactions\nwith considerable consequences to biodiversity. However, extrapolating the\neffects observed on pair-wise interactions to entire ecological networks is\nchallenging. Here we propose a framework to estimate the tolerance to changes\nin the strength of mutualistic interaction that species in mutualistic networks\ncan sustain before becoming extinct. We identify the scenarios where generalist\nspecies can be the least tolerant. We show that the least tolerant species\nacross different scenarios do not appear to have uniquely common\ncharacteristics. Species tolerance is extremely sensitive to the direction of\nchange in the strength of mutualistic interaction, as well as to the observed\nmutualistic trade-offs between the number of partners and the strength of the\ninteractions.\n", "versions": [{"version": "v1", "created": "Fri, 16 Aug 2013 09:33:41 GMT"}], "update_date": "2013-08-19", "authors_parsed": [["Saavedra", "Serguei", ""], ["Rohr", "Rudolf P.", ""], ["Dakos", "Vasilis", ""], ["Bascompte", "Jordi", ""]]}, {"id": "1308.3616", "submitter": "Reginald Smith", "authors": "Reginald D. Smith", "title": "Complexity in animal communication: Estimating the size of N-Gram\n  structures", "comments": "17 pages, 4 figures, 4 tables; accepted and to appear in Entropy", "journal-ref": "Entropy 2014, 16(1), 526-542", "doi": "10.3390/e16010526", "report-no": null, "categories": "q-bio.PE cs.IT math.IT q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, new techniques that allow conditional entropy to estimate the\ncombinatorics of symbols are applied to animal communication studies to\nestimate the communication's repertoire size. By using the conditional entropy\nestimates at multiple orders, the paper estimates the total repertoire sizes\nfor animal communication across bottlenose dolphins, humpback whales, and\nseveral species of birds for N-grams length one to three. In addition to\ndiscussing the impact of this method on studies of animal communication\ncomplexity, the reliability of these estimates is compared to other methods\nthrough simulation. While entropy does undercount the total repertoire size due\nto rare N-grams, it gives a more accurate picture of the most frequently used\nrepertoire than just repertoire size alone.\n", "versions": [{"version": "v1", "created": "Thu, 15 Aug 2013 02:44:55 GMT"}, {"version": "v2", "created": "Mon, 16 Dec 2013 09:34:55 GMT"}], "update_date": "2014-01-17", "authors_parsed": [["Smith", "Reginald D.", ""]]}, {"id": "1308.3978", "submitter": "Loic Chaumont", "authors": "Romain Bourget, Lo\\\"ic Chaumont, Natalia Sapoukhina", "title": "Timing of Pathogen Adaptation to a Multicomponent Treatment", "comments": "3 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0071926", "report-no": null, "categories": "q-bio.PE math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The sustainable use of multicomponent treatments such as combination\ntherapies, combination vaccines/chemicals, and plants carrying multigenic\nresistance requires an understanding of how their population-wide deployment\naffects the speed of the pathogen adaptation. Here, we develop a stochastic\nmodel describing the emergence of a mutant pathogen and its dynamics in a\nheterogeneous host population split into various types by the management\nstrategy. Based on a multi-type Markov birth and death process, the model can\nbe used to provide a basic understanding of how the life-cycle parameters of\nthe pathogen population, and the controllable parameters of a management\nstrategy affect the speed at which a pathogen adapts to a multicomponent\ntreatment. Our results reveal the importance of coupling stochastic mutation\nand migration processes, and illustrate how their stochasticity can alter our\nview of the principles of managing pathogen adaptive dynamics at the population\nlevel. In particular, we identify the growth and migration rates that allow\npathogens to adapt to a multicomponent treatment even if it is deployed on only\nsmall proportions of the host. In contrast to the accepted view, our model\nsuggests that treatment durability should not systematically be identified with\nmutation cost. We show also that associating a multicomponent treatment with\ndefeated monocomponent treatments can be more durable than associating it with\nintermediate treatments including only some of the components. We conclude that\nthe explicit modelling of stochastic processes underlying evolutionary dynamics\ncould help to elucidate the principles of the sustainable use of multicomponent\ntreatments in population-wide management strategies intended to impede the\nevolution of harmful populations.\n", "versions": [{"version": "v1", "created": "Mon, 19 Aug 2013 10:42:00 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Bourget", "Romain", ""], ["Chaumont", "Loïc", ""], ["Sapoukhina", "Natalia", ""]]}, {"id": "1308.4098", "submitter": "Todd J Vision", "authors": "Lex E. Flagel, John H. Willis and Todd J. Vision", "title": "The standing pool of genomic structural variation in a natural\n  population of Mimulus guttatus", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Major unresolved questions in evolutionary genetics include determining the\ncontributions of different mutational sources to the total pool of genetic\nvariation in a species, and understanding how these different forms of genetic\nvariation interact with natural selection. Recent work has shown that\nstructural variants (insertions, deletions, inversions and transpositions) are\na major source of genetic variation, often out-numbering single nucleotide\nvariants in terms of total bases affected. Despite the near ubiquity of\nstructural variants, major questions about their interaction with natural\nselection remain. For example, how does the allele frequency spectrum of\nstructural variants differ when compared to single nucleotide variants? How\noften do structural variants affect genes, and what are the consequences? To\nbegin to address these questions, we have systematically identified and\ncharacterized a large set submicroscopic insertion and deletion (indel)\nvariants (between 1 kb to 200 kb in length) among ten individuals from a single\nnatural population of the plant species Mimulus guttatus. After extensive\ncomputational filtering, we focused on a set of 4,142 high-confidence indels\nthat showed an experimental validation rate of 73%. All but one of these indels\nwere < 200 kb. While the largest were generally at lower frequencies in the\npopulation, a surprising number of large indels are at intermediate\nfrequencies. While indels overlapping with genes were much rarer than expected\nby chance, nearly 600 genes were affected by an indel. NBS-LRR defense response\ngenes were the most enriched among the gene families affected. Most indels\nassociated with genes were rare and appeared to be under purifying selection,\nthough we do find four high-frequency derived insertion alleles that show\nsignatures of recent positive selection.\n", "versions": [{"version": "v1", "created": "Mon, 19 Aug 2013 18:55:59 GMT"}], "update_date": "2013-08-20", "authors_parsed": [["Flagel", "Lex E.", ""], ["Willis", "John H.", ""], ["Vision", "Todd J.", ""]]}, {"id": "1308.4102", "submitter": "Inti  Pedroso", "authors": "Inti Pedroso", "title": "Gene and Gene-Set Analysis for Genome-Wide Association Studies", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.MN q-bio.NC q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Genome-wide association studies (GWAS) have identified hundreds of loci at\nvery stringent levels of statistical significance across many different human\ntraits. However, it is now clear that very large samples (n~10^4-10^5) are\nneeded to find the majority of genetic variants underlying risk for most human\ndiseases. Therefore, the field has engaged itself in a race to increase study\nsample sizes with some studies yielding very successful results but also\nstudies which provide little or no new insights. This project started early on\nin this new wave of studies and I decided to use an alternative approach that\nuses prior biological knowledge to improve both interpretation and power of\nGWAS. The project aimed to a) implement and develop new gene-based methods to\nderive gene-level statistics to use GWAS in well established system biology\ntools; b) use of these gene-level statistics in networks and gene-set analyses\nof GWAS data; c) mine GWAS of neuropsychiatric disorders using gene, gene-sets\nand integrative biology analyses with gene-expression studies; and d) explore\nthe ability of these methods to improve the analysis GWAS on disease\nsub-phenotypes which usually suffer of very small sample sizes.\n", "versions": [{"version": "v1", "created": "Mon, 19 Aug 2013 19:20:12 GMT"}], "update_date": "2013-08-20", "authors_parsed": [["Pedroso", "Inti", ""]]}, {"id": "1308.4256", "submitter": "Johannes Reiter", "authors": "Benjamin M. Zagorsky, Johannes G. Reiter, Krishnendu Chatterjee,\n  Martin A. Nowak", "title": "Forgiver triumphs in alternating Prisoner's Dilemma", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0080814", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperative behavior, where one individual incurs a cost to help another, is\na wide spread phenomenon. Here we study direct reciprocity in the context of\nthe alternating Prisoner's Dilemma. We consider all strategies that can be\nimplemented by one and two-state automata. We calculate the payoff matrix of\nall pairwise encounters in the presence of noise. We explore deterministic\nselection dynamics with and without mutation. Using different error rates and\npayoff values, we observe convergence to a small number of distinct equilibria.\nTwo of them are uncooperative strict Nash equilibria representing always-defect\n(ALLD) and Grim. The third equilibrium is mixed and represents a cooperative\nalliance of several strategies, dominated by a strategy which we call Forgiver.\nForgiver cooperates whenever the opponent has cooperated; it defects once when\nthe opponent has defected, but subsequently Forgiver attempts to re-establish\ncooperation even if the opponent has defected again. Forgiver is not an\nevolutionarily stable strategy, but the alliance, which it rules, is\nasymptotically stable. For a wide range of parameter values the most commonly\nobserved outcome is convergence to the mixed equilibrium, dominated by\nForgiver. Our results show that although forgiving might incur a short-term\nloss it can lead to a long-term gain. Forgiveness facilitates stable\ncooperation in the presence of exploitation and noise.\n", "versions": [{"version": "v1", "created": "Tue, 20 Aug 2013 08:47:57 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Zagorsky", "Benjamin M.", ""], ["Reiter", "Johannes G.", ""], ["Chatterjee", "Krishnendu", ""], ["Nowak", "Martin A.", ""]]}, {"id": "1308.4342", "submitter": "Andrew Bordner", "authors": "Andrew J. Bordner and Hans D. Mittelmann", "title": "A new formulation of protein evolutionary models that account for\n  structural constraints", "comments": "31 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the importance of a thermodynamically stable structure with a\nconserved fold for protein function, almost all evolutionary models neglect\nsite-site correlations that arise from physical interactions between\nneighboring amino acid sites. This is mainly due to the difficulty in\nformulating a computationally tractable model since rate matrices can no longer\nbe used. Here we introduce a general framework, based on factor graphs, for\nconstructing probabilistic models of protein evolution with site\ninterdependence. Conveniently, efficient approximate inference algorithms, like\nBelief Propagation, can be used to calculate likelihoods for these models. We\nfit an amino acid substitution model of this type that accounts for both\nsolvent accessibility and site-site correlations. Comparisons of the new model\nwith rate matrix models and a model accounting only for solvent accessibility\ndemonstrate that it better fits the sequence data. We also examine evolution\nwithin a family of homohexameric enzymes and find that site-site correlations\nbetween most contacting subunits contribute to a higher likelihood. In\naddition, we show that the new substitution model has a similar mathematical\nform to the one introduced in (Rodrigue et al. 2005), although with different\nparameter interpretations and values. We also perform a statistical analysis of\nthe effects of amino acids at neighboring sites on substitution probabilities\nand find a significant perturbation of most probabilities, further supporting\nthe significant role of site-site interactions in protein evolution and\nmotivating the development of new evolutionary models like the one described\nhere. Finally, we discuss possible extensions and applications of the new\nsubstitution models.\n", "versions": [{"version": "v1", "created": "Tue, 20 Aug 2013 16:11:26 GMT"}, {"version": "v2", "created": "Mon, 2 Dec 2013 21:31:23 GMT"}], "update_date": "2013-12-04", "authors_parsed": [["Bordner", "Andrew J.", ""], ["Mittelmann", "Hans D.", ""]]}, {"id": "1308.4398", "submitter": "Matjaz Perc", "authors": "Matjaz Perc, Karsten Donnay, Dirk Helbing", "title": "Understanding recurrent crime as system-immanent collective behavior", "comments": "9 two-column pages, 5 figures; accepted for publication in PLoS ONE", "journal-ref": "PLoS ONE 8 (2013) e76063", "doi": "10.1371/journal.pone.0076063", "report-no": null, "categories": "physics.soc-ph cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Containing the spreading of crime is a major challenge for society. Yet,\nsince thousands of years, no effective strategy has been found to overcome\ncrime. To the contrary, empirical evidence shows that crime is recurrent, a\nfact that is not captured well by rational choice theories of crime. According\nto these, strong enough punishment should prevent crime from happening. To gain\na better understanding of the relationship between crime and punishment, we\nconsider that the latter requires prior discovery of illicit behavior and study\na spatial version of the inspection game. Simulations reveal the spontaneous\nemergence of cyclic dominance between ''criminals'', ''inspectors'', and\n''ordinary people'' as a consequence of spatial interactions. Such cycles\ndominate the evolutionary process, in particular when the temptation to commit\ncrime or the cost of inspection are low or moderate. Yet, there are also\ncritical parameter values beyond which cycles cease to exist and the population\nis dominated either by a stable mixture of criminals and inspectors or one of\nthese two strategies alone. Both continuous and discontinuous phase transitions\nto different final states are possible, indicating that successful strategies\nto contain crime can be very much counter-intuitive and complex. Our results\ndemonstrate that spatial interactions are crucial for the evolutionary outcome\nof the inspection game, and they also reveal why criminal behavior is likely to\nbe recurrent rather than evolving towards an equilibrium with monotonous\nparameter dependencies.\n", "versions": [{"version": "v1", "created": "Tue, 20 Aug 2013 19:55:03 GMT"}], "update_date": "2013-09-02", "authors_parsed": [["Perc", "Matjaz", ""], ["Donnay", "Karsten", ""], ["Helbing", "Dirk", ""]]}, {"id": "1308.4589", "submitter": "Marta Sarzynska", "authors": "Marta Sarzynska, Oyita Udiani, Na Zhang", "title": "A study of gravity-linked metapopulation models for the spatial spread\n  of dengue fever", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metapopulation (multipatch) models are widely used to study the patterns of\nspatial spread of epidemics. In this paper we study the impact of inter-patch\nconnection weights on the predictions of these models. We contrast arbitrary,\nuniform link weights with link weights predicted using a gravity model based on\npatch populations and distance. In a synthetic system with one large driver\ncity and many small follower cities, we show that under uniform link weights,\nepidemics in the follower regions are perfectly synchronized. In contrast,\ngravity-based links allow a more realistic, less synchronized distribution of\nepidemic peaks in the follower regions. We then fit a three-patch\nmetapopulation model to regional dengue fever data from Peru -- a country\nexperiencing yearly, spatially defined epidemics. We use data for 2002-2008\n(studying the seasonal disease patterns in the country and the yearly\nreinfection patterns from jungle to the coast) and 2000-2001 (one large\nepidemic of a new disease strain across the country). We present numerical\nresults.\n", "versions": [{"version": "v1", "created": "Tue, 20 Aug 2013 10:46:35 GMT"}, {"version": "v2", "created": "Fri, 23 Aug 2013 13:59:01 GMT"}], "update_date": "2013-08-26", "authors_parsed": [["Sarzynska", "Marta", ""], ["Udiani", "Oyita", ""], ["Zhang", "Na", ""]]}, {"id": "1308.4780", "submitter": "Richard A. Blythe", "authors": "Thomas C. Scott-Phillips and Richard A. Blythe", "title": "Why is combinatorial communication rare in the natural world, and why is\n  language an exception to this trend?", "comments": "33 page pdf, including supplementary information and one figure. To\n  appear in J Roy Soc Int", "journal-ref": "J. Roy. Soc. Interface (2013) 10 20130520", "doi": "10.1098/rsif.2013.0520", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a combinatorial communication system, some signals consist of the\ncombinations of other signals. Such systems are more efficient than equivalent,\nnon-combinatorial systems, yet despite this they are rare in nature. Why?\nPrevious explanations have focused on the adaptive limits of combinatorial\ncommunication, or on its purported cognitive difficulties, but neither of these\nexplains the full distribution of combinatorial communication in the natural\nworld. Here we present a nonlinear dynamical model of the emergence of\ncombinatorial communication that, unlike previous models, considers how\ninitially non-communicative behaviour evolves to take on a communicative\nfunction. We derive three basic principles about the emergence of combinatorial\ncommunication. We hence show that the interdependence of signals and responses\nplaces significant constraints on the historical pathways by which\ncombinatorial signals might emerge, to the extent that anything other than the\nmost simple form of combinatorial communication is extremely unlikely. We also\nargue that these constraints can be bypassed if individuals have the\nsocio-cognitive capacity to engage in ostensive communication. Humans, but\nprobably no other species, have this ability. This may explain why language,\nwhich is massively combinatorial, is such an extreme exception to nature's\ngeneral trend for non-combinatorial communication.\n", "versions": [{"version": "v1", "created": "Thu, 22 Aug 2013 07:29:31 GMT"}], "update_date": "2015-05-26", "authors_parsed": [["Scott-Phillips", "Thomas C.", ""], ["Blythe", "Richard A.", ""]]}, {"id": "1308.4807", "submitter": "Samir Suweis Dr.", "authors": "Samir Suweis, Filippo Simini, Jayanth R. Banavar, Amos Maritan", "title": "Emergence of structural and dynamical properties of ecological\n  mutualistic networks", "comments": "10 pages, 4 figures", "journal-ref": "Nature, 500 (449), 2013", "doi": "10.1038/nature12438", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mutualistic networks are formed when the interactions between two classes of\nspecies are mutually beneficial. They are important examples of cooperation\nshaped by evolution. Mutualism between animals and plants plays a key role in\nthe organization of ecological communities. Such networks in ecology have\ngenerically evolved a nested architecture independent of species composition\nand latitude - specialists interact with proper subsets of the nodes with whom\ngeneralists interact. Despite sustained efforts to explain observed network\nstructure on the basis of community-level stability or persistence, such\ncorrelative studies have reached minimal consensus. Here we demonstrate that\nnested interaction networks could emerge as a consequence of an optimization\nprinciple aimed at maximizing the species abundance in mutualistic communities.\nUsing analytical and numerical approaches, we show that because of the\nmutualistic interactions, an increase in abundance of a given species results\nin a corresponding increase in the total number of individuals in the\ncommunity, as also the nestedness of the interaction matrix. Indeed, the\nspecies abundances and the nestedness of the interaction matrix are correlated\nby an amount that depends on the strength of the mutualistic interactions.\nNestedness and the observed spontaneous emergence of generalist and specialist\nspecies occur for several dynamical implementations of the variational\nprinciple under stationary conditions. Optimized networks, while remaining\nstable, tend to be less resilient than their counterparts with randomly\nassigned interactions. In particular, we analytically show that the abundance\nof the rarest species is directly linked to the resilience of the community.\nOur work provides a unifying framework for studying the emergent structural and\ndynamical properties of ecological mutualistic networks.\n", "versions": [{"version": "v1", "created": "Thu, 22 Aug 2013 09:43:22 GMT"}], "update_date": "2013-08-23", "authors_parsed": [["Suweis", "Samir", ""], ["Simini", "Filippo", ""], ["Banavar", "Jayanth R.", ""], ["Maritan", "Amos", ""]]}, {"id": "1308.4917", "submitter": "Chad M. Topaz", "authors": "Christa Nilsen, John Paige, Olivia Warner, Benjamin Mayhew, Ryan\n  Sutley, Matthew Lam, Andrew J. Bernoff, and Chad M. Topaz", "title": "Social aggregation in pea aphids: Experimental measurement and\n  stochastic modeling", "comments": "19 pages, 6 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0083343", "report-no": null, "categories": "q-bio.QM nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An ongoing challenge in the mathematical modeling of biological aggregations\nis to strengthen the connection between models and biological data by\nquantifying the rules that individuals follow. We model aggregation of the pea\naphid, Acyrthosiphon pisum. Specifically, we conduct experiments to track the\nmotion of aphids walking in a featureless circular arena in order to deduce\nindividual-level rules. We observe that each aphid transitions stochastically\nbetween a moving and a stationary state. Moving aphids follow a correlated\nrandom walk. The probabilities of motion state transitions, as well as the\nrandom walk parameters, depend strongly on distance to an aphid's nearest\nneighbor. For large nearest neighbor distances, when an aphid is essentially\nisolated, its motion is ballistic with aphids moving faster, turning less, and\nbeing less likely to stop. In contrast, for short nearest neighbor distances,\naphids move more slowly, turn more, and are more likely to become stationary;\nthis behavior constitutes an aggregation mechanism. From the experimental data,\nwe estimate the state transition probabilities and correlated random walk\nparameters as a function of nearest neighbor distance. With the\nindividual-level model established, we assess whether it reproduces the\nmacroscopic patterns of movement at the group level. To do so, we consider\nthree distributions, namely distance to nearest neighbor, angle to nearest\nneighbor, and percentage of population moving at any given time. For each of\nthese three distributions, we compare our experimental data to the output of\nnumerical simulations of our nearest neighbor model, and of a control model in\nwhich aphids do not interact socially. Our stochastic, social nearest neighbor\nmodel reproduces salient features of the experimental data that are not\ncaptured by the control.\n", "versions": [{"version": "v1", "created": "Fri, 16 Aug 2013 19:18:25 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Nilsen", "Christa", ""], ["Paige", "John", ""], ["Warner", "Olivia", ""], ["Mayhew", "Benjamin", ""], ["Sutley", "Ryan", ""], ["Lam", "Matthew", ""], ["Bernoff", "Andrew J.", ""], ["Topaz", "Chad M.", ""]]}, {"id": "1308.4951", "submitter": "David Enard", "authors": "David Enard, Philipp W. Messer, Dmitri Petrov", "title": "Genome wide signals of pervasive positive selection in human evolution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The role of positive selection in human evolution remains controversial. On\nthe one hand, scans for positive selection have identified hundreds of\ncandidate loci and the genome-wide patterns of polymorphism show signatures\nconsistent with frequent positive selection. On the other hand, recent studies\nhave argued that many of the candidate loci are false positives and that most\napparent genome-wide signatures of adaptation are in fact due to reduction of\nneutral diversity by linked recurrent deleterious mutations, known as\nbackground selection. Here we analyze human polymorphism data from the 1,000\nGenomes project (Abecasis et al. 2012) and detect signatures of pervasive\npositive selection once we correct for the effects of background selection. We\nshow that levels of neutral polymorphism are lower near amino acid\nsubstitutions, with the strongest reduction observed specifically near\nfunctionally consequential amino acid substitutions. Furthermore, amino acid\nsubstitutions are associated with signatures of recent adaptation that should\nnot be generated by background selection, such as the presence of unusually\nlong and frequent haplotypes and specific distortions in the site frequency\nspectrum. We use forward simulations to show that the observed signatures\nrequire a high rate of strongly adaptive substitutions in the vicinity of the\namino acid changes. We further demonstrate that the observed signatures of\npositive selection correlate more strongly with the presence of regulatory\nsequences, as predicted by ENCODE (Gerstein et al. 2012), than the positions of\namino acid substitutions. Our results establish that adaptation was frequent in\nhuman evolution and provide support for the hypothesis of King and Wilson (King\nand Wilson 1975) that adaptive divergence is primarily driven by regulatory\nchanges.\n", "versions": [{"version": "v1", "created": "Thu, 22 Aug 2013 18:38:52 GMT"}], "update_date": "2013-08-23", "authors_parsed": [["Enard", "David", ""], ["Messer", "Philipp W.", ""], ["Petrov", "Dmitri", ""]]}, {"id": "1308.4969", "submitter": "Matjaz Perc", "authors": "Zhen Wang, Attila Szolnoki, Matjaz Perc", "title": "Optimal interdependence between networks for the evolution of\n  cooperation", "comments": "8 two-column pages, 7 figures; accepted for publication in Scientific\n  Reports", "journal-ref": "Sci. Rep. 3 (2013) 2470", "doi": "10.1038/srep02470", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent research has identified interactions between networks as crucial for\nthe outcome of evolutionary games taking place on them. While the consensus is\nthat interdependence does promote cooperation by means of organizational\ncomplexity and enhanced reciprocity that is out of reach on isolated networks,\nwe here address the question just how much interdependence there should be.\nIntuitively, one might assume the more the better. However, we show that in\nfact only an intermediate density of sufficiently strong interactions between\nnetworks warrants an optimal resolution of social dilemmas. This is due to an\nintricate interplay between the heterogeneity that causes an asymmetric\nstrategy flow because of the additional links between the networks, and the\nindependent formation of cooperative patterns on each individual network.\nPresented results are robust to variations of the strategy updating rule, the\ntopology of interdependent networks, and the governing social dilemma, thus\nsuggesting a high degree of universality.\n", "versions": [{"version": "v1", "created": "Thu, 22 Aug 2013 19:56:14 GMT"}], "update_date": "2013-08-23", "authors_parsed": [["Wang", "Zhen", ""], ["Szolnoki", "Attila", ""], ["Perc", "Matjaz", ""]]}, {"id": "1308.5094", "submitter": "Artem Kaznatcheev", "authors": "Artem Kaznatcheev", "title": "Complexity of evolutionary equilibria in static fitness landscapes", "comments": "14 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A fitness landscape is a genetic space -- with two genotypes adjacent if they\ndiffer in a single locus -- and a fitness function. Evolutionary dynamics\nproduce a flow on this landscape from lower fitness to higher; reaching\nequilibrium only if a local fitness peak is found. I use computational\ncomplexity to question the common assumption that evolution on static fitness\nlandscapes can quickly reach a local fitness peak. I do this by showing that\nthe popular NK model of rugged fitness landscapes is PLS-complete for K >= 2;\nthe reduction from Weighted 2SAT is a bijection on adaptive walks, so there are\nNK fitness landscapes where every adaptive path from some vertices is of\nexponential length. Alternatively -- under the standard complexity theoretic\nassumption that there are problems in PLS not solvable in polynomial time --\nthis means that there are no evolutionary dynamics (known, or to be discovered,\nand not necessarily following adaptive paths) that can converge to a local\nfitness peak on all NK landscapes with K = 2. Applying results from the\nanalysis of simplex algorithms, I show that there exist single-peaked\nlandscapes with no reciprocal sign epistasis where the expected length of an\nadaptive path following strong selection weak mutation dynamics is\n$e^{O(n^{1/3})}$ even though an adaptive path to the optimum of length less\nthan n is available from every vertex. The technical results are written to be\naccessible to mathematical biologists without a computer science background,\nand the biological literature is summarized for the convenience of\nnon-biologists with the aim to open a constructive dialogue between the two\ndisciplines.\n", "versions": [{"version": "v1", "created": "Fri, 23 Aug 2013 10:59:15 GMT"}], "update_date": "2013-08-26", "authors_parsed": [["Kaznatcheev", "Artem", ""]]}, {"id": "1308.5140", "submitter": "Denise K\\\"uhnert", "authors": "Denise K\\\"uhnert, Tanja Stadler, Timothy G. Vaughan, Alexei J.\n  Drummond", "title": "Simultaneous reconstruction of evolutionary history and epidemiological\n  dynamics from viral sequences with the birth-death SIR model", "comments": "Journal link:\n  http://rsif.royalsocietypublishing.org/content/11/94/20131106.full", "journal-ref": "J. R. Soc. Interface 2014 11, 20131106, published 26 February 2014", "doi": "10.1098/rsif.2013.1106", "report-no": null, "categories": "q-bio.PE math.PR stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The evolution of RNA viruses such as HIV, Hepatitis C and Influenza virus\noccurs so rapidly that the viruses' genomes contain information on past\necological dynamics. Hence, we develop a phylodynamic method that enables the\njoint estimation of epidemiological parameters and phylogenetic history. Based\non a compartmental susceptible-infected-removed (SIR) model, this method\nprovides separate information on incidence and prevalence of infections.\nDetailed information on the interaction of host population dynamics and\nevolutionary history can inform decisions on how to contain or entirely avoid\ndisease outbreaks.\n  We apply our Birth-Death SIR method (BDSIR) to two viral data sets. First,\nfive human immunodeficiency virus type 1 clusters sampled in the United Kingdom\nbetween 1999 and 2003 are analyzed. The estimated basic reproduction ratios\nrange from 1.9 to 3.2 among the clusters. All clusters show a decline in the\ngrowth rate of the local epidemic in the middle or end of the 90's.\n  The analysis of a hepatitis C virus (HCV) genotype 2c data set shows that the\nlocal epidemic in the C\\'ordoban city Cruz del Eje originated around 1906\n(median), coinciding with an immigration wave from Europe to central Argentina\nthat dates from 1880--1920. The estimated time of epidemic peak is around 1970.\n", "versions": [{"version": "v1", "created": "Fri, 23 Aug 2013 14:41:24 GMT"}, {"version": "v2", "created": "Fri, 21 Mar 2014 13:27:15 GMT"}], "update_date": "2014-03-24", "authors_parsed": [["Kühnert", "Denise", ""], ["Stadler", "Tanja", ""], ["Vaughan", "Timothy G.", ""], ["Drummond", "Alexei J.", ""]]}, {"id": "1308.5254", "submitter": "Daniel Larremore", "authors": "Daniel B. Larremore, Aaron Clauset, Caroline O. Buckee", "title": "A network approach to analyzing highly recombinant malaria parasite\n  genes", "comments": "19 pages, 8 figures, 6 supplemental figures, 4 supplemental texts. To\n  appear in PLoS Computational Biology", "journal-ref": "PLoS Comput Biol 9(10): e1003268, 2013", "doi": "10.1371/journal.pcbi.1003268", "report-no": null, "categories": "q-bio.GN physics.data-an q-bio.MN q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The var genes of the human malaria parasite Plasmodium falciparum present a\nchallenge to population geneticists due to their extreme diversity, which is\ngenerated by high rates of recombination. These genes encode a primary antigen\nprotein called PfEMP1, which is expressed on the surface of infected red blood\ncells and elicits protective immune responses. Var gene sequences are\ncharacterized by pronounced mosaicism, precluding the use of traditional\nphylogenetic tools that require bifurcating tree-like evolutionary\nrelationships. We present a new method that identifies highly variable regions\n(HVRs), and then maps each HVR to a complex network in which each sequence is a\nnode and two nodes are linked if they share an exact match of significant\nlength. Here, networks of var genes that recombine freely are expected to have\na uniformly random structure, but constraints on recombination will produce\nnetwork communities that we identify using a stochastic block model. We\nvalidate this method on synthetic data, showing that it correctly recovers\npopulations of constrained recombination, before applying it to the Duffy\nBinding Like-{\\alpha} (DBL{\\alpha}) domain of var genes. We find nine HVRs\nwhose network communities map in distinctive ways to known DBL{\\alpha}\nclassifications and clinical phenotypes. We show that the recombinational\nconstraints of some HVRs are correlated, while others are independent. These\nfindings suggest that this micromodular structuring facilitates independent\nevolutionary trajectories of neighboring mosaic regions, allowing the parasite\nto retain protein function while generating enormous sequence diversity. Our\napproach therefore offers a rigorous method for analyzing evolutionary\nconstraints in var genes, and is also flexible enough to be easily applied more\ngenerally to any highly recombinant sequences.\n", "versions": [{"version": "v1", "created": "Fri, 23 Aug 2013 22:02:58 GMT"}], "update_date": "2013-10-22", "authors_parsed": [["Larremore", "Daniel B.", ""], ["Clauset", "Aaron", ""], ["Buckee", "Caroline O.", ""]]}, {"id": "1308.5342", "submitter": "Michael Harvey", "authors": "Brian Tilston Smith, Michael G. Harvey, Brant C. Faircloth, Travis C.\n  Glenn, Robb T. Brumfield", "title": "Target capture and massively parallel sequencing of ultraconserved\n  elements (UCEs) for comparative studies at shallow evolutionary time scales", "comments": "53 pages, 2 tables, 4 figures, 5 supplemental tables, 11 supplemental\n  figures", "journal-ref": "(2014) Systematic Biology 63: 83-95", "doi": "10.1093/sysbio/syt061", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Comparative genetic studies of non-model organisms are transforming rapidly\ndue to major advances in sequencing technology. A limiting factor in these\nstudies has been the identification and screening of orthologous loci across an\nevolutionarily distant set of taxa. Here, we evaluate the efficacy of genomic\nmarkers targeting ultraconserved DNA elements (UCEs) for analyses at shallow\nevolutionary timescales. Using sequence capture and massively parallel\nsequencing to generate UCE data for five co-distributed Neotropical rainforest\nbird species, we recovered 776-1,516 UCE loci across the five species. Across\nspecies, 53-77 percent of the loci were polymorphic, containing between 2.0 and\n3.2 variable sites per polymorphic locus, on average. We performed species tree\nconstruction, coalescent modeling, and species delimitation, and we found that\nthe five co-distributed species exhibited discordant phylogeographic histories.\nWe also found that species trees and divergence times estimated from UCEs were\nsimilar to those obtained from mtDNA. The species that inhabit the understory\nhad older divergence times across barriers, contained a higher number of\ncryptic species, and exhibited larger effective population sizes relative to\nspecies inhabiting the canopy. Because orthologous UCEs can be obtained from a\nwide array of taxa, are polymorphic at shallow evolutionary time scales, and\ncan be generated rapidly at low cost, they are effective genetic markers for\nstudies investigating evolutionary patterns and processes at shallow time\nscales.\n", "versions": [{"version": "v1", "created": "Sat, 24 Aug 2013 14:56:21 GMT"}], "update_date": "2017-03-28", "authors_parsed": [["Smith", "Brian Tilston", ""], ["Harvey", "Michael G.", ""], ["Faircloth", "Brant C.", ""], ["Glenn", "Travis C.", ""], ["Brumfield", "Robb T.", ""]]}, {"id": "1308.5358", "submitter": "Mason A. Porter", "authors": "Jasvir K. Grewal, Cameron L. Hall, Mason A. Porter, and Marian S.\n  Dawkins", "title": "Formation of Dominance Relationships via Strategy Updating in an\n  Asymmetric Hawk-Dove Game", "comments": "20 pages, 3 figures (some with multiple parts)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.DS nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a model to describe the development of dominance relations between\nsocial animals as they use past experiences to inform future interactions.\nUsing the game-theoretic framework of a Hawk-Dove game with asymmetric\nresource-holding potentials (RHPs), we derive a simple model that describes the\nsocial interactions of animals that compete for resources. We then consider a\ngame-playing strategy in which animals acquire information about their RHP\nasymmetry from the results of their previous contests and subsequently use\ntheir asymmetry assessment to inform their behavior in future contests. We\nexamine how directly incorporating the fact that animals have incomplete\ninformation in their interactions can lead to outcomes that differ from what\nwould be expected if one considers the situation as a static game in which the\nanimals have perfect information about the asymmetry size. We thereby obtain\nresults that are consistent with observations of dominance-hierarchy formation\nin social animals. We also discuss how increased interactions between animals\ncan speed up the asymmetry assessment process and how this can explain why\naggression can sometimes decrease as the number of interactions between animals\nincreases over time.\n", "versions": [{"version": "v1", "created": "Sat, 24 Aug 2013 19:54:42 GMT"}], "update_date": "2013-08-27", "authors_parsed": [["Grewal", "Jasvir K.", ""], ["Hall", "Cameron L.", ""], ["Porter", "Mason A.", ""], ["Dawkins", "Marian S.", ""]]}, {"id": "1308.5365", "submitter": "Shweta Bansal", "authors": "Eric Mooring and Shweta Bansal", "title": "Increasing Herd Immunity with Influenza Revaccination", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Seasonal influenza is a significant public health concern in the United\nStates and globally. While influenza vaccines are the single most effective\nintervention to reduce influenza morbidity and mortality, there is considerable\ndebate surrounding the merits and consequences of repeated seasonal\nvaccination. Here, we describe a two-season influenza epidemic contact network\nmodel and use it to demonstrate that increasing the level of continuity in\nvaccination across seasons reduces the burden on public health. We show that\nrevaccination reduces the influenza attack rate not only because it reduces the\noverall number of susceptible individuals, but also because it better protects\nhighly-connected individuals, who would otherwise make a disproportionately\nlarge contribution to influenza transmission. Our work thus contributes a\npopulation-level perspective to debates about the merits of repeated influenza\nvaccination and advocates for public health policy to incorporate individual\nvaccine histories.\n", "versions": [{"version": "v1", "created": "Sat, 24 Aug 2013 22:40:07 GMT"}, {"version": "v2", "created": "Tue, 6 Jan 2015 02:13:01 GMT"}], "update_date": "2015-01-07", "authors_parsed": [["Mooring", "Eric", ""], ["Bansal", "Shweta", ""]]}, {"id": "1308.5430", "submitter": "Toni Gossmann", "authors": "Toni I. Gossmann, David Waxman and Adam Eyre-Walker", "title": "Fluctuating selection models and McDonald-Kreitman type analyses", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0084540", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is likely that the strength of selection acting upon a mutation varies\nthrough time due to changes in the environment. However, most population\ngenetic theory assumes that the strength of selection remains constant. Here we\ninvestigate the consequences of fluctuating selection pressures on the\nquantification of adaptive evolution using McDonald-Kreitman (MK) style\napproaches. In agreement with previous work, we show that fluctuating selection\ncan generate evidence of adaptive evolution even when the expected strength of\nselection on a mutation is zero. However, we also find that the mutations,\nwhich contribute to both polymorphism and divergence tend, on average, to be\npositively selected during their lifetime, under fluctuating selection models.\nThis is because mutations that fluctuate, by chance, to positive selected\nvalues, tend to reach higher frequencies in the population than those that\nfluctuate towards negative values. Hence the evidence of positive adaptive\nevolution detected under a fluctuating selection model by MK type approaches is\ngenuine since fixed mutations tend to be advantageous on average during their\nlifetime. Never-the-less we show that methods tend to underestimate the rate of\nadaptive evolution when selection fluctuates.\n", "versions": [{"version": "v1", "created": "Sun, 25 Aug 2013 18:00:15 GMT"}], "update_date": "2014-03-05", "authors_parsed": [["Gossmann", "Toni I.", ""], ["Waxman", "David", ""], ["Eyre-Walker", "Adam", ""]]}, {"id": "1308.5631", "submitter": "Artem Novozhilov S", "authors": "Artem S. Novozhilov, Vladimir P. Posvyanskii, and Alexander S. Bratus", "title": "Replicator equations and space", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A reaction--diffusion replicator equation is studied. A novel method to apply\nthe principle of global regulation is used to write down the model with\nexplicit spatial structure. Properties of stationary solutions together with\ntheir stability are analyzed analytically, and relationships between stability\nof the rest points of the non-distributed replicator equation and distributed\nsystem are shown. A numerical example is given to show that the spatial\nvariable in this particular model promotes the system's permanence.\n", "versions": [{"version": "v1", "created": "Mon, 26 Aug 2013 16:23:37 GMT"}, {"version": "v2", "created": "Tue, 27 Aug 2013 00:55:05 GMT"}], "update_date": "2013-08-28", "authors_parsed": [["Novozhilov", "Artem S.", ""], ["Posvyanskii", "Vladimir P.", ""], ["Bratus", "Alexander S.", ""]]}, {"id": "1308.5676", "submitter": "Segei Taraskin", "authors": "Sergei Taraskin and Francisco J. P\\'erez-Reche", "title": "Effects of variable neighbourhood on spreading processes", "comments": null, "journal-ref": "Phys. Rev. E 88, 062815 (2013)", "doi": "10.1103/PhysRevE.88.062815", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A theoretical framework for the description of Susceptible-Infected-Removed\n(SIR) spreading processes with synergistic transmission of infection on a\nlattice is developed. The model incorporates explicitly the effects of a\ntime-dependent environment on the transmission of infection between hosts.\nExact solution of the model shows that time-dependence of the neighbourhood of\nrecipient hosts is a key factor for synergistic spreading processes. It is\ndemonstrated that the higher the connectivity of a lattice, the more prominent\nis the effect of synergy on spread.\n", "versions": [{"version": "v1", "created": "Mon, 26 Aug 2013 14:55:07 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Taraskin", "Sergei", ""], ["Pérez-Reche", "Francisco J.", ""]]}, {"id": "1308.5678", "submitter": "Marcos Amaku", "authors": "Raul Ossada, Jos\\'e H. H. Grisi-Filho, Fernando Ferreira and Marcos\n  Amaku", "title": "Modeling the Dynamics of Infectious Diseases in Different Scale-Free\n  Networks with the Same Degree Distribution", "comments": "13 pages, 7 figures", "journal-ref": "Advanced Studies in Theoretical Physics, Vol. 7, 2013, no. 16, 759\n  - 771", "doi": null, "report-no": null, "categories": "q-bio.PE cs.SI physics.soc-ph", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The transmission dynamics of some infectious diseases is related to the\ncontact structure between individuals in a network. We used five algorithms to\ngenerate contact networks with different topological structure but with the\nsame scale-free degree distribution. We simulated the spread of acute and\nchronic infectious diseases on these networks, using SI (Susceptible -\nInfected) and SIS (Susceptible - Infected - Susceptible) epidemic models. In\nthe simulations, our objective was to observe the effects of the topological\nstructure of the networks on the dynamics and prevalence of the simulated\ndiseases. We found that the dynamics of spread of an infectious disease on\ndifferent networks with the same degree distribution may be considerably\ndifferent.\n", "versions": [{"version": "v1", "created": "Mon, 26 Aug 2013 18:26:06 GMT"}], "update_date": "2013-08-28", "authors_parsed": [["Ossada", "Raul", ""], ["Grisi-Filho", "José H. H.", ""], ["Ferreira", "Fernando", ""], ["Amaku", "Marcos", ""]]}, {"id": "1308.6028", "submitter": "Caterina La Porta AM", "authors": "Caterina A. M. La Porta, Stefano Zapperi, James P. Sethna", "title": "Senescent Cells in Growing Tumors: Population Dynamics and Cancer Stem\n  Cells", "comments": null, "journal-ref": "PLoS Comput Biol 8(1): e1002316, 2012", "doi": "10.1371/journal.pcbi.1002316", "report-no": null, "categories": "q-bio.TO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Tumors are defined by their intense proliferation, but sometimes cancer cells\nturn senescent and stop replicating. In the stochastic cancer model in which\nall cells are tumorigenic, senescence is seen as the result of random\nmutations, suggesting that it could represent a barrier to tumor growth. In the\nhierarchical cancer model a subset of the cells, the cancer stem cells, divide\nindefinitely while other cells eventually turn senescent. Here we formulate\ncancer growth in mathematical terms and obtain predictions for the evolution of\nsenescence. We perform experiments in human melanoma cells which are compatible\nwith the hierarchical model and show that senescence is a reversible process\ncontrolled by survivin. We conclude that enhancing senescence is unlikely to\nprovide a useful therapeutic strategy to fight cancer, unless the cancer stem\ncells are specifically targeted\n", "versions": [{"version": "v1", "created": "Wed, 28 Aug 2013 02:10:26 GMT"}], "update_date": "2013-08-29", "authors_parsed": [["La Porta", "Caterina A. M.", ""], ["Zapperi", "Stefano", ""], ["Sethna", "James P.", ""]]}, {"id": "1308.6031", "submitter": "Caterina La Porta AM", "authors": "C.A.M. La Porta, S Zapperi", "title": "Do cancer cells undergo phenotypic switching? The case for imperfect\n  cancer stem cell markers", "comments": null, "journal-ref": "Scientific Reports | 2 : 441, 2012", "doi": "10.1038/srep00441", "report-no": null, "categories": "q-bio.PE q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The identification of cancer stem cells in vivo and in vitro relies on\nspecific surface markers that should allow to sort cancer cells in\nphenotypically distinct subpopulations. Experiments report that sorted cancer\ncell populations after some time tend to express again all the original\nmarkers, leading to the hypothesis of phenotypic switching, according to which\ncancer cells can transform stochastically into cancer stem cells. Here we\nexplore an alternative explanation based on the hypothesis that markers are not\nperfect and are thus unable to identify all cancer stem cells. Our analysis is\nbased on a mathematical model for cancer cell proliferation that takes into\naccount phenotypic switching, imperfect markers and error in the sorting\nprocess. Our conclusion is that the observation of reversible expression of\nsurface markers after sorting does not provide sufficient evidence in support\nof phenotypic switching.\n", "versions": [{"version": "v1", "created": "Wed, 28 Aug 2013 02:18:02 GMT"}], "update_date": "2013-08-29", "authors_parsed": [["La Porta", "C. A. M.", ""], ["Zapperi", "S", ""]]}, {"id": "1308.6101", "submitter": "Peter Ashcroft", "authors": "Peter Ashcroft and Tobias Galla", "title": "Pattern formation in individual-based systems with time-varying\n  parameters", "comments": "16 pages, 9 figures. Published version. Corrected missing appendix\n  link from previous version", "journal-ref": "Phys. Rev. E 88, 062104 (2013)", "doi": "10.1103/PhysRevE.88.062104", "report-no": null, "categories": "cond-mat.stat-mech nlin.PS q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the patterns generated in finite-time sweeps across\nsymmetry-breaking bifurcations in individual-based models. Similar to the\nwell-known Kibble-Zurek scenario of defect formation, large-scale patterns are\ngenerated when model parameters are varied slowly, whereas fast sweeps produce\na large number of small domains. The symmetry breaking is triggered by\nintrinsic noise, originating from the discrete dynamics at the micro-level.\nBased on a linear-noise approximation, we calculate the characteristic length\nscale of these patterns. We demonstrate the applicability of this approach in a\nsimple model of opinion dynamics, a model in evolutionary game theory with a\ntime-dependent fitness structure, and a model of cell differentiation. Our\ntheoretical estimates are confirmed in simulations. In further numerical work,\nwe observe a similar phenomenon when the symmetry-breaking bifurcation is\ntriggered by population growth.\n", "versions": [{"version": "v1", "created": "Wed, 28 Aug 2013 09:11:30 GMT"}, {"version": "v2", "created": "Mon, 2 Dec 2013 15:35:36 GMT"}, {"version": "v3", "created": "Tue, 3 Dec 2013 16:36:00 GMT"}], "update_date": "2013-12-04", "authors_parsed": [["Ashcroft", "Peter", ""], ["Galla", "Tobias", ""]]}, {"id": "1308.6151", "submitter": "Holger Teismann", "authors": "Michael Deveau, Richard Karsten, Holger Teismann", "title": "The modellers' encounter with ecological theory. Or, what is this thing\n  called `growth rate'?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The attempt to determine the population growth rate from field data reveals\nseveral ambiguities in its definition(s), which seem to throw into question the\nvery concept itself. However, an alternative point of view is proposed that not\nonly preserves the identity of the concept, but also helps discriminate between\ncompeting models for capturing the data.\n", "versions": [{"version": "v1", "created": "Wed, 28 Aug 2013 13:42:47 GMT"}], "update_date": "2013-08-29", "authors_parsed": [["Deveau", "Michael", ""], ["Karsten", "Richard", ""], ["Teismann", "Holger", ""]]}, {"id": "1308.6210", "submitter": "Ron Nielsen", "authors": "Ron W. Nielsen aka Jan Nurzynski", "title": "Hyperbolic Illusion of the Mid-Holocene Turning Point", "comments": "13 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using the growth of population in Australia in the past 10,000 years it is\nillustrated here how an illusion created by hyperbolic distributions may lead\neasily to incorrect conclusions. Contrary to the published claim, there was no\nchange in the mechanism of growth of the ancient human population in Australia\naround 5000 years before present (BP). Data for the number of rock-shelter\nsites, interpreted as reflecting the growth of human population, are analysed.\nThey are shown to be monotonically increasing with time without any sign of\nintensification in the past 10,000 years. The growth of human population in\nAustralia is in excellent agreement with the similar pattern describing the\ngrowth of the world population.\n", "versions": [{"version": "v1", "created": "Mon, 26 Aug 2013 09:12:51 GMT"}, {"version": "v2", "created": "Thu, 17 Oct 2013 01:56:25 GMT"}, {"version": "v3", "created": "Fri, 25 Oct 2013 02:13:08 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Nurzynski", "Ron W. Nielsen aka Jan", ""]]}, {"id": "1308.6243", "submitter": "Antonino Staiano", "authors": "Francesco Camastra, Angelo Ciaramella, Antonino Staiano", "title": "Comment on Increased mortality is predicted of Inachis io larvae caused\n  by Bt-maize pollen in European farmland, Ecological Modelling, 2013", "comments": "5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this comment, we analyze the mathematical model by Holst et al that\nestimates the increased mortality of Inachis io larvae caused by Bt-maize\npollen in European farmaland. In particular, we focus our attention on the part\nof Holst et al's work that models the Bt-maize pollen loss on plant leaves by a\ndifferential equation. We provide the exact solution of the differential\nequation, showing that the behaviour of the solution, when the time goes to\ninfinity, is different from what claimed in Holst et al's work.\n", "versions": [{"version": "v1", "created": "Wed, 28 Aug 2013 18:30:00 GMT"}, {"version": "v2", "created": "Thu, 29 Aug 2013 05:55:43 GMT"}], "update_date": "2013-08-30", "authors_parsed": [["Camastra", "Francesco", ""], ["Ciaramella", "Angelo", ""], ["Staiano", "Antonino", ""]]}, {"id": "1308.6367", "submitter": "Ralph Brinks", "authors": "Ralph Brinks", "title": "Partial differential equation about the prevalence of a chronic disease\n  in the presence of duration dependency", "comments": "10 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The illness-death model of a chronic disease consists of the states 'Normal',\n'Disease' and 'Death'. In general, the transition rates between the states\ndepend on three time scales: calendar time, age and duration of the chronic\ndisease. Previous works have shown that the age-specific prevalence of the\nchronic disease can be described by differential equations if the duration is\nnegligible. This article derives a partial differential equation (PDE) in the\npresence of duration dependency. As an important application, the PDE allows\nthe calculation of the age-specific incidence from cross-sectional surveys.\n", "versions": [{"version": "v1", "created": "Thu, 29 Aug 2013 05:18:44 GMT"}], "update_date": "2013-08-30", "authors_parsed": [["Brinks", "Ralph", ""]]}, {"id": "1308.6480", "submitter": "Adam Eyre-Walker", "authors": "Ying Chen Eyre-Walker and Adam Eyre-Walker", "title": "The role of mutation rate variation and genetic diversity in the\n  architecture of human disease", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0090166", "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We have investigated the role that the mutation rate and the structure of\ngenetic variation at a locus play in determining whether a gene is involved in\ndisease. We predict that the mutation rate and its genetic diversity should be\nhigher in genes associated with disease, unless all genes that could cause\ndisease have already been identified. Consistent with our predictions we find\nthat genes associated with Mendelian and complex disease are substantially\nlonger than non-disease genes. However, we find that both Mendelian and complex\ndisease genes are found in regions of the genome with relatively low mutation\nrates, as inferred from intron divergence between humans and chimpanzees.\nComplex disease gene are predicted to have higher rates of non-synonymous\nmutation than non-disease genes, but the opposite pattern is found in Mendelian\ndisease genes. Finally, we find that disease genes are in regions of\nsignificantly elevated genetic diversity, even when variation in the rate of\nmutation is controlled for. The effect is small nevertheless. Our results\nsuggest that variation in the genic mutation rate and the genetic architecture\nof the locus play a minor role in determining whether a gene is associated with\ndisease.\n", "versions": [{"version": "v1", "created": "Thu, 29 Aug 2013 14:21:26 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Eyre-Walker", "Ying Chen", ""], ["Eyre-Walker", "Adam", ""]]}, {"id": "1308.6534", "submitter": "David Wick", "authors": "W. David Wick", "title": "Stopping the SuperSpreader Epidemic: the lessons from SARS (with,\n  perhaps, applications to MERS)", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  I discuss the so-called SuperSpreader epidemic, for which SARS is the\ncanonical examples (and, perhaps, MERS will be another). I use simulation by an\nagent-based model as well as the mathematics of multi-type branching-processes\nto illustrate how the SS epidemic differs from the more familiar uniform\nepidemic (e.g., caused by influenza). The conclusions may surprise the reader:\n(a) The SS epidemic must be described by at least two numbers, such as the mean\nreproductive number (of \"secondary\" cases caused by a \"primary case\"), R0, and\nthe variance of same, call it V0; (b) Even if R0 > 1, if V0 >> R0 the\nprobability that an infection-chain caused by one primary case goes extinct\nwithout intervention may be close to one (e.g., 0.97); (c) The SS epidemic may\nhave a long \"kindling period\" in which sporadic cases appear (transmitted from\nsome unknown host) and generate a cluster of cases, but the chains peter out,\nperhaps generating a false sense of security that a pandemic will not occur;\n(d) Interventions such as isolation (or contact-tracing and secondary case\nisolation) may prove efficacious even without driving R0 below one; (e) The\nefficacy of such interventions diminishes, but slowly, with increasing V0 at\nfixed R0. From these considerations, I argue that the SS epidemic has dynamics\nsufficiently distinct from the uniform case that efficacious public-health\ninterventions can be designed even in the absence of a vaccine or other form of\ntreatment.\n", "versions": [{"version": "v1", "created": "Thu, 29 Aug 2013 17:44:47 GMT"}], "update_date": "2013-08-30", "authors_parsed": [["Wick", "W. David", ""]]}, {"id": "1308.6808", "submitter": "Alexandra Jilkine", "authors": "Alexandra Jilkine, Ryan N. Gutenkunst", "title": "Effect of Dedifferentiation on Time to Mutation Acquisition in Stem\n  Cell-Driven Cancers", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pcbi.1003481", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Accumulating evidence suggests that many tumors have a hierarchical\norganization, with the bulk of the tumor composed of relatively differentiated\nshort-lived progenitor cells that are maintained by a small population of\nundifferentiated long-lived cancer stem cells. It is unclear, however, whether\ncancer stem cells originate from normal stem cells or from dedifferentiated\nprogenitor cells. To address this, we mathematically modeled the effect of\ndedifferentiation on carcinogenesis. We considered a hybrid\nstochastic-deterministic model of mutation accumulation in both stem cells and\nprogenitors, including dedifferentiation of progenitor cells to a stem\ncell-like state. We performed exact computer simulations of the emergence of\ntumor subpopulations with two mutations, and we derived semi-analytical\nestimates for the waiting time distribution to fixation. Our results suggest\nthat dedifferentiation may play an important role in carcinogenesis, depending\non how stem cell homeostasis is maintained. If the stem cell population size is\nheld strictly constant (due to all divisions being asymmetric), we found that\ndedifferentiation acts like a positive selective force in the stem cell\npopulation and thus speeds carcinogenesis. If the stem cell population size is\nallowed to vary stochastically with density-dependent reproduction rates\n(allowing both symmetric and asymmetric divisions), we found that\ndedifferentiation beyond a critical threshold leads to exponential growth of\nthe stem cell population. Thus, dedifferentiation may play a crucial role, the\ncommon modeling assumption of constant stem cell population size may not be\nadequate, and further progress in understanding carcinogenesis demands a more\ndetailed mechanistic understanding of stem cell homeostasis.\n", "versions": [{"version": "v1", "created": "Fri, 30 Aug 2013 17:50:45 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Jilkine", "Alexandra", ""], ["Gutenkunst", "Ryan N.", ""]]}, {"id": "1308.6830", "submitter": "Golan Bel", "authors": "Golan Bel and Yosef Ashkenazy", "title": "The effects of psammophilous plants on sand dune dynamics", "comments": null, "journal-ref": null, "doi": "10.1002/2014JF003170", "report-no": null, "categories": "physics.bio-ph nlin.CD q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Psammophilous plants are special plants that flourish in sand moving\nenvironments. There are two main mechanisms by which the wind affects these\nplants: (i) sand drift exposes roots and covers branches--the exposed roots\nturn into new plants and the covered branches turn into new roots; both\nmechanisms result in an enhanced growth rate of the psammophilous plant cover\nof the dunes; (ii) strong winds, often associated with sand movement, tear\nbranches and seed them in nearby locations, resulting in new plants and an\nenhanced growth rate of the psammophilous plant cover of the dunes. Despite\ntheir important role in dune dynamics, to our knowledge, psammophilous plants\nhave never been incorporated into mathematical models of sand dunes. Here, we\nattempt to model the effects of these plants on sand dune dynamics. We\nconstruct a set of three ordinary differential equations for the fractions of\nsurface cover of regular vegetation, biogenic soil crust and psammophilous\nplants. The latter reach their optimal growth under (i) specific sand drift or\n(ii) specific wind power. We show that psammophilous plants enrich the sand\ndune dynamics. Depending on the climatological conditions, it is possible to\nobtain one, two, or three steady dune states. The activity of the dunes can be\nassociated with the surface cover--bare dunes are active, and dunes with\nsignificant cover of vegetation, biogenic soil crust, or psammophilous plants\nare fixed. Our model shows that under suitable precipitation rates and wind\npower, the dynamics of the different cover types is in accordance with the\ncommon view that dunes are initially stabilized by psammophilous plants that\nreduce sand activity, thus enhancing the growth of regular vegetation that\neventually dominates the cover of the dunes and determines their activity.\n", "versions": [{"version": "v1", "created": "Fri, 30 Aug 2013 19:45:13 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Bel", "Golan", ""], ["Ashkenazy", "Yosef", ""]]}]