[{"id": "1312.0226", "submitter": "Olivier Rivoire", "authors": "Olivier Rivoire and Stanislas Leibler", "title": "A Model for the Generation and Transmission of Variations in Evolution", "comments": null, "journal-ref": null, "doi": "10.1073/pnas.1323901111", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The inheritance of characteristics induced by the environment has often been\nopposed to the theory of evolution by natural selection. Yet, while evolution\nby natural selection requires new heritable traits to be produced and\ntransmitted, it does not prescribe, per se, the mechanisms by which this is\noperated. The mechanisms of inheritance are not, however, unconstrained, since\nthey are themselves subject to natural selection. We introduce a general,\nanalytically solvable mathematical model to compare the adaptive value of\ndifferent schemes of inheritance. Our model allows for variations to be\ninherited, randomly produced, or environmentally induced, and, irrespectively,\nto be either transmitted or not during reproduction. The adaptation of the\ndifferent schemes for processing variations is quantified for a range of\nfluctuating environments, following an approach that links quantitative\ngenetics with stochastic control theory.\n", "versions": [{"version": "v1", "created": "Sun, 1 Dec 2013 14:15:32 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Rivoire", "Olivier", ""], ["Leibler", "Stanislas", ""]]}, {"id": "1312.0353", "submitter": "Sutirth Dey", "authors": "Sudipta Tung, Abhishek Mishra and Sutirth Dey", "title": "A Comparison of Six Methods for Stabilizing Population Dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the last two decades, several methods have been proposed for stabilizing\nthe dynamics of biological populations. However, these methods have typically\nbeen evaluated using different population dynamics models and in the context of\nvery different concepts of stability, which makes it difficult to compare their\nrelative efficiencies. Moreover, since the dynamics of populations are\ndependent on the life-history of the species and its environment, it is\nconceivable that the stabilizing effects of control methods would also be\naffected by such factors, a complication that has typically not been\ninvestigated. In this study we compare six different control methods with\nrespect to their efficiency at inducing a common level of enhancement (50%\nincrease) for two kinds of stability (constancy and persistence) under four\ndifferent life history/ environment combinations. Since these methods have been\nanalytically studied elsewhere, we focus on an intuitive understanding of\nrealistic simulations incorporating noise, extinction probability and lattice\neffect. We show that for these six methods, even when the magnitude of\nstabilization attained is the same, other aspects of the dynamics like\npopulation size distribution can be very different. Consequently, correlated\naspects of stability, like the amount of persistence for a given degree of\nconstancy stability (and vice versa) or the corresponding effective population\nsize (a measure of resistance to genetic drift) vary widely among the methods.\nMoreover, the number of organisms needed to be added or removed to attain\nsimilar levels of stabilization also varies for these methods, a fact that has\neconomic implications. Finally, we compare the relative efficiency of these\nmethods through a composite index of various stability related measures. We\nfind that restocking to a constant lower threshold seems to be the optimal\nmethod under most conditions.\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 07:01:43 GMT"}], "update_date": "2013-12-03", "authors_parsed": [["Tung", "Sudipta", ""], ["Mishra", "Abhishek", ""], ["Dey", "Sutirth", ""]]}, {"id": "1312.0556", "submitter": "Sandeep Venkataram", "authors": "Sandeep Venkataram, Diamantis Sellis and Dmitri A Petrov", "title": "Ploidy and the Predictability of Evolution in Fishers Geometric Model", "comments": "Withdrawn. Please see submission at biorxiv at\n  http://biorxiv.org/content/early/2013/12/02/001016", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Predicting adaptive evolutionary trajectories is a primary goal of\nevolutionary biology. One can differentiate between forward and backward\npredictability, where forward predictability measures the likelihood of the\nsame adaptive trajectory occurring in independent evolutions and backward\npredictability measures the likelihood of a particular adaptive path given the\nknowledge of starting and final states. Recent studies have attempted to\nmeasure both forward and backward predictability using experimental evolution\nin asexual haploid microorganisms. Similar experiments in diploid organisms\nhave not been conducted. Here we simulate adaptive walks using Fisher's\nGeometric Model in haploids and diploids and find that adaptive walks in\ndiploids are less forward- and more backward-predictable than adaptive walks in\nhaploids. We argue that the difference is due to the ability of diploids in our\nsimulations to generate transiently stable polymorphisms and to allow adaptive\nmutations of larger phenotypic effect. As stable polymorphisms can be generated\nin both haploid and diploid natural populations through a number of mechanisms,\nwe argue that inferences based on experiments in which adaptive walks proceed\nthrough succession of monomorphic states might miss many of the key features of\nadaptation.\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 19:23:50 GMT"}, {"version": "v2", "created": "Wed, 4 Dec 2013 22:00:18 GMT"}], "update_date": "2013-12-06", "authors_parsed": [["Venkataram", "Sandeep", ""], ["Sellis", "Diamantis", ""], ["Petrov", "Dmitri A", ""]]}, {"id": "1312.0573", "submitter": "Meesoon Ha", "authors": "Kihong Chung, Yongjoo Baek, Daniel Kim, Meesoon Ha, and Hawoong Jeong", "title": "Generalized epidemic process on modular networks", "comments": "8 pages, 8 figures (9 eps files); published version", "journal-ref": "PRE v89, 052811 (2014)", "doi": "10.1103/PhysRevE.89.052811", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social reinforcement and modular structure are two salient features observed\nin the spreading of behavior through social contacts. In order to investigate\nthe interplay between these two features, we study the generalized epidemic\nprocess on modular networks with equal-sized finite communities and adjustable\nmodularity. Using the analytical approach originally applied to clique-based\nrandom networks, we show that the system exhibits a bond-percolation type\ncontinuous phase transition for weak social reinforcement, whereas a\ndiscontinuous phase transition occurs for sufficiently strong social\nreinforcement. Our findings are numerically verified using the finite-size\nscaling analysis and the crossings of the bimodality coefficient.\n", "versions": [{"version": "v1", "created": "Fri, 29 Nov 2013 05:02:24 GMT"}, {"version": "v2", "created": "Thu, 27 Mar 2014 15:11:39 GMT"}, {"version": "v3", "created": "Thu, 22 May 2014 11:50:06 GMT"}], "update_date": "2014-05-23", "authors_parsed": [["Chung", "Kihong", ""], ["Baek", "Yongjoo", ""], ["Kim", "Daniel", ""], ["Ha", "Meesoon", ""], ["Jeong", "Hawoong", ""]]}, {"id": "1312.0594", "submitter": "Marcos Capistran  Dr", "authors": "Yendry N. Arguedas-Flatts, Marcos A. Capistr\\'an, J. Andr\\'es\n  Christen, Daniel E. Noyola", "title": "An analysis of the interaction between influenza and respiratory\n  syncytial virus based on acute respiratory infection records", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Under the hypothesis that both influenza and respiratory syncytial virus\n(RSV) are the two leading causes of acute respiratory infections (ARI), in this\npaper we have used a standard two-pathogen epidemic model as a regressor to\nexplain, on a yearly basis, high season ARI data in terms of the contact rates\nand initial conditions of the mathematical model. The rationale is that ARI\nhigh season is a transient regime of a noisy system, e.g., the system is driven\naway from equilibrium every year by fluctuations in variables such as humidity,\ntemperature, viral mutations and human behavior. Using the value of the\nreplacement number as a phenotypic trait associated to fitness, we provide\nevidence that influenza and RSV coexists throughout the ARI high season through\nsuperinfection.\n", "versions": [{"version": "v1", "created": "Sat, 30 Nov 2013 00:13:36 GMT"}], "update_date": "2013-12-04", "authors_parsed": [["Arguedas-Flatts", "Yendry N.", ""], ["Capistrán", "Marcos A.", ""], ["Christen", "J. Andrés", ""], ["Noyola", "Daniel E.", ""]]}, {"id": "1312.0688", "submitter": "Michael Manhart", "authors": "Allan Haldane, Michael Manhart, and Alexandre V. Morozov", "title": "Biophysical Fitness Landscapes for Transcription Factor Binding Sites", "comments": null, "journal-ref": "PLoS Comput Biol 10:e1003683, 2014", "doi": "10.1371/journal.pcbi.1003683", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary trajectories and phenotypic states available to cell populations\nare ultimately dictated by intermolecular interactions between DNA, RNA,\nproteins, and other molecular species. Here we study how evolution of gene\nregulation in a single-cell eukaryote S. cerevisiae is affected by the\ninteractions between transcription factors (TFs) and their cognate genomic\nsites. Our study is informed by high-throughput in vitro measurements of TF-DNA\nbinding interactions and by a comprehensive collection of genomic binding\nsites. Using an evolutionary model for monomorphic populations evolving on a\nfitness landscape, we infer fitness as a function of TF-DNA binding energy for\na collection of 12 yeast TFs, and show that the shape of the predicted fitness\nfunctions is in broad agreement with a simple thermodynamic model of two-state\nTF-DNA binding. However, the effective temperature of the model is not always\nequal to the physical temperature, indicating selection pressures in addition\nto biophysical constraints caused by TF-DNA interactions. We find little\nstatistical support for the fitness landscape in which each position in the\nbinding site evolves independently, showing that epistasis is common in\nevolution of gene regulation. Finally, by correlating TF-DNA binding energies\nwith biological properties of the sites or the genes they regulate, we are able\nto rule out several scenarios of site-specific selection, under which binding\nsites of the same TF would experience a spectrum of selection pressures\ndepending on their position in the genome. These findings argue for the\nexistence of universal fitness landscapes which shape evolution of all sites\nfor a given TF, and whose properties are determined in part by the physics of\nprotein-DNA interactions.\n", "versions": [{"version": "v1", "created": "Tue, 3 Dec 2013 03:23:25 GMT"}], "update_date": "2014-08-19", "authors_parsed": [["Haldane", "Allan", ""], ["Manhart", "Michael", ""], ["Morozov", "Alexandre V.", ""]]}, {"id": "1312.0691", "submitter": "Wu Zhi-Xi", "authors": "Chao-Ran Cai, Zhi-Xi wu, and Jian-Yue Guan", "title": "Behavior of susceptible-vaccinated--infected--recovered epidemics with\n  diversity in the infection rate of the individuals", "comments": "9 pages, many figures", "journal-ref": "Phys. Rev. E 88, 062805 (2013)", "doi": "10.1103/PhysRevE.88.062805", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a susceptible-vaccinated--infected--recovered (SVIR)\nepidemic-spreading model with diversity of infection rate of the individuals.\nBy means of analytical arguments as well as extensive computer simulations, we\ndemonstrate that the heterogeneity in infection rate can either impede or\naccelerate the epidemic spreading, which depends on the amount of vaccinated\nindividuals introduced in the population as well as the contact pattern among\nthe individuals. Remarkably, as long as the individuals with different\ncapability of acquiring the disease interact with unequal frequency, there\nalways exist a cross point for the fraction of vaccinated, below which the\ndiversity of infection rate hinders the epidemic spreading and above which\nexpedites it. The overall results are robust to the SVIR dynamics defined on\ndifferent population models; the possible applications of the results are\ndiscussed.\n", "versions": [{"version": "v1", "created": "Tue, 3 Dec 2013 03:58:25 GMT"}, {"version": "v2", "created": "Wed, 4 Dec 2013 02:37:31 GMT"}], "update_date": "2013-12-05", "authors_parsed": [["Cai", "Chao-Ran", ""], ["wu", "Zhi-Xi", ""], ["Guan", "Jian-Yue", ""]]}, {"id": "1312.0851", "submitter": "Jane Elith", "authors": "Jane Elith", "title": "Predicting distributions of invasive species", "comments": "28 pages, this manuscript will later be published as a book chapter", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This chapter aims to inform a practitioner about current methods for\npredicting potential distributions of invasive species. It mostly addresses\nsingle species models, covering the conceptual bases, touching on mechanistic\nmodels, and then focusing on methods using species distribution records and\nenvironmental data to predict distributions. The commentary in this last\nsection is oriented towards key issues that arise in fitting, and predicting\nwith, these models (which include CLIMEX, MaxEnt and other regression methods).\nIn other words, it is more about the process of thinking about the data and the\nmodelling problem (which is a challenging one) than it is about one technique\nversus another. The discussion helps clarify the necessary steps and expertise\nfor predicting distributions. Some researchers are optimistic that correlative\nmodels will predict with high precision; while that may be true for some\nspecies at some scales of evaluation, I believe that the issues discussed in\nthis chapter show that substantial errors are reasonably likely. I am hopeful\nthat ongoing developments will produce models better suited to the task and\ntools to help practitioners to better understand predictions and their\nuncertainties.\n", "versions": [{"version": "v1", "created": "Mon, 2 Dec 2013 04:09:06 GMT"}, {"version": "v2", "created": "Thu, 30 Jul 2015 06:08:22 GMT"}], "update_date": "2015-07-31", "authors_parsed": [["Elith", "Jane", ""]]}, {"id": "1312.1255", "submitter": "Steven Kelk", "authors": "Leo van Iersel, Steven Kelk, Nela Lekic, Leen Stougie", "title": "A short note on exponential-time algorithms for hybridization number", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this short note we prove that, given two (not necessarily binary) rooted\nphylogenetic trees T_1, T_2 on the same set of taxa X, where |X|=n, the\nhybridization number of T_1 and T_2 can be computed in time O^{*}(2^n) i.e.\nO(2^{n} poly(n)). The result also means that a Maximum Acyclic Agreement Forest\n(MAAF) can be computed within the same time bound.\n", "versions": [{"version": "v1", "created": "Wed, 4 Dec 2013 17:37:37 GMT"}], "update_date": "2013-12-05", "authors_parsed": [["van Iersel", "Leo", ""], ["Kelk", "Steven", ""], ["Lekic", "Nela", ""], ["Stougie", "Leen", ""]]}, {"id": "1312.1395", "submitter": "Kelley Harris", "authors": "Kelley Harris and Rasmus Nielsen", "title": "Error-prone polymerase activity causes multinucleotide mutations in\n  humans", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  About 2% of human genetic polymorphisms have been hypothesized to arise via\nmultinucleotide mutations (MNMs), complex events that generate SNPs at multiple\nsites in a single generation. MNMs have the potential to accelerate the pace at\nwhich single genes evolve and to confound studies of demography and selection\nthat assume all SNPs arise independently. In this paper, we examine clustered\nmutations that are segregating in a set of 1,092 human genomes, demonstrating\nthat MNMs become enriched as large numbers of individuals are sampled. We\nleverage the size of the dataset to deduce new information about the allelic\nspectrum of MNMs, estimating the percentage of linked SNP pairs that were\ngenerated by simultaneous mutation as a function of the distance between the\naffected sites and showing that MNMs exhibit a high percentage of transversions\nrelative to transitions. These findings are reproducible in data from multiple\nsequencing platforms. Among tandem mutations that occur simultaneously at\nadjacent sites, we find an especially skewed distribution of ancestral and\nderived dinucleotides, with $\\textrm{GC}\\to \\textrm{AA}$, $\\textrm{GA}\\to\n\\textrm{TT}$ and their reverse complements making up 36% of the total. These\nsame mutations dominate the spectrum of tandem mutations produced by the\nupregulation of low-fidelity Polymerase $\\zeta$ in mutator strains of S.\ncerevisiae that have impaired DNA excision repair machinery. This suggests that\nlow-fidelity DNA replication by Pol $\\zeta$ is at least partly responsible for\nthe MNMs that are segregating in the human population, and that useful\ninformation about the biochemistry of MNM can be extracted from ordinary\npopulation genomic data. We incorporate our findings into a mathematical model\nof the multinucleotide mutation process that can be used to correct\nphylogenetic and population genetic methods for the presence of MNMs.\n", "versions": [{"version": "v1", "created": "Thu, 5 Dec 2013 00:36:20 GMT"}, {"version": "v2", "created": "Tue, 29 Apr 2014 18:56:09 GMT"}], "update_date": "2014-04-30", "authors_parsed": [["Harris", "Kelley", ""], ["Nielsen", "Rasmus", ""]]}, {"id": "1312.1673", "submitter": "David McCandlish", "authors": "David M. McCandlish, Charles L. Epstein, and Joshua B. Plotkin", "title": "Formal properties of the probability of fixation: identities,\n  inequalities and approximations", "comments": "Minor edits; added appendix", "journal-ref": "Theoretical Population Biology, 99: 98-113 (2015)", "doi": "10.1016/j.tpb.2014.11.004", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The formula for the probability of fixation of a new mutation is widely used\nin theoretical population genetics and molecular evolution. Here we derive a\nseries of identities, inequalities and approximations for the exact probability\nof fixation of a new mutation under the Moran process (equivalent results hold\nfor the approximate probability of fixation for the Wright-Fisher process after\nan appropriate change of variables). We show that the behavior of the logarithm\nof the probability of fixation is particularly simple when the selection\ncoefficient is measured as a difference of Malthusian fitnesses, and we exploit\nthis simplicity to derive several inequalities and approximations. We also\npresent a comprehensive comparison of both existing and new approximations for\nthe probability of fixation, highlighting in particular approximations that\nresult in a reversible Markov chain when used to model the dynamics of\nevolution under weak mutation.\n", "versions": [{"version": "v1", "created": "Thu, 5 Dec 2013 20:27:01 GMT"}, {"version": "v2", "created": "Tue, 28 Jan 2014 20:13:47 GMT"}, {"version": "v3", "created": "Wed, 26 Feb 2014 19:48:58 GMT"}, {"version": "v4", "created": "Thu, 10 Apr 2014 22:00:44 GMT"}], "update_date": "2015-03-10", "authors_parsed": [["McCandlish", "David M.", ""], ["Epstein", "Charles L.", ""], ["Plotkin", "Joshua B.", ""]]}, {"id": "1312.1859", "submitter": "Dionisio Bazeia", "authors": "P.P. Avelino, D. Bazeia, L. Losano, J. Menezes, B.F. Oliveira", "title": "Interfaces with internal structures in generalized rock-paper-scissors\n  models", "comments": "7 pages, 9 figures; new version, to appear in PRE", "journal-ref": "Phys. Rev. E 89 (2014) 042710", "doi": "10.1103/PhysRevE.89.042710", "report-no": null, "categories": "physics.bio-ph nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work we investigate the development of stable dynamical structures\nalong interfaces separating domains belonging to enemy partnerships, in the\ncontext of cyclic predator-prey models with an even number of species $N \\ge\n8$. We use both stochastic and field theory simulations in one and two spatial\ndimensions, as well as analytical arguments, to describe the association at the\ninterfaces of mutually neutral individuals belonging to enemy partnerships and\nto probe their role in the development of the dynamical structures at the\ninterfaces. We identify an interesting behaviour associated to the symmetric or\nasymmetric evolution of the interface profiles depending on whether $N/2$ is\nodd or even, respectively. We also show that the macroscopic evolution of the\ninterface network is not very sensitive internal structure of the interfaces.\nAlthough this work focus on cyclic predator prey-models with an even number of\nspecies, we argue that the results are expected to be quite generic in the\ncontext of spatial stochastic May-Leonard models.\n", "versions": [{"version": "v1", "created": "Fri, 6 Dec 2013 13:40:16 GMT"}, {"version": "v2", "created": "Wed, 9 Apr 2014 15:39:06 GMT"}], "update_date": "2014-04-22", "authors_parsed": [["Avelino", "P. P.", ""], ["Bazeia", "D.", ""], ["Losano", "L.", ""], ["Menezes", "J.", ""], ["Oliveira", "B. F.", ""]]}, {"id": "1312.1983", "submitter": "Andrew Wan", "authors": "Adi Livnat and Christos Papadimitriou and Aviad Rubinstein and Gregory\n  Valiant and Andrew Wan", "title": "Satisfiability and Evolution", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that, if truth assignments on $n$ variables reproduce through\nrecombination so that satisfaction of a particular Boolean function confers a\nsmall evolutionary advantage, then a polynomially large population over\npolynomially many generations (polynomial in $n$ and the inverse of the initial\nsatisfaction probability) will end up almost certainly consisting exclusively\nof satisfying truth assignments. We argue that this theorem sheds light on the\nproblem of novelty in Evolution.\n", "versions": [{"version": "v1", "created": "Fri, 6 Dec 2013 19:59:41 GMT"}, {"version": "v2", "created": "Sat, 21 Dec 2013 18:48:23 GMT"}, {"version": "v3", "created": "Mon, 11 Aug 2014 23:35:24 GMT"}], "update_date": "2014-08-13", "authors_parsed": [["Livnat", "Adi", ""], ["Papadimitriou", "Christos", ""], ["Rubinstein", "Aviad", ""], ["Valiant", "Gregory", ""], ["Wan", "Andrew", ""]]}, {"id": "1312.2041", "submitter": "John Storey", "authors": "Wei Hao, Minsun Song, and John D. Storey", "title": "Probabilistic models of genetic variation in structured populations\n  applied to global human studies", "comments": "Wei Hao and Minsun Song contributed equally to this work", "journal-ref": null, "doi": "10.1093/bioinformatics/btv641", "report-no": null, "categories": "q-bio.PE q-bio.GN q-bio.QM stat.AP stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern population genetics studies typically involve genome-wide genotyping\nof individuals from a diverse network of ancestries. An important, unsolved\nproblem is how to formulate and estimate probabilistic models of observed\ngenotypes that allow for complex population structure. We formulate two general\nprobabilistic models, and we propose computationally efficient algorithms to\nestimate them. First, we show how principal component analysis (PCA) can be\nutilized to estimate a general model that includes the well-known\nPritchard-Stephens-Donnelly mixed-membership model as a special case. Noting\nsome drawbacks of this approach, we introduce a new \"logistic factor analysis\"\n(LFA) framework that seeks to directly model the logit transformation of\nprobabilities underlying observed genotypes in terms of latent variables that\ncapture population structure. We demonstrate these advances on data from the\nhuman genome diversity panel and 1000 genomes project, where we are able to\nidentify SNPs that are highly differentiated with respect to structure while\nmaking minimal modeling assumptions.\n", "versions": [{"version": "v1", "created": "Sat, 7 Dec 2013 00:14:17 GMT"}, {"version": "v2", "created": "Wed, 4 Mar 2015 03:41:05 GMT"}], "update_date": "2017-01-10", "authors_parsed": [["Hao", "Wei", ""], ["Song", "Minsun", ""], ["Storey", "John D.", ""]]}, {"id": "1312.2120", "submitter": "Xi Huo", "authors": "Xi Huo", "title": "Modeling of Contact Tracing in Epidemic Populations Structured by\n  Disease Age", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an age-structured epidemic model with two basic public health\ninterventions: (i) identifying and isolating symptomatic cases, and (ii)\ntracing and quarantine of the contacts of identified infectives. The dynamics\nof the infected population are modeled by a nonlinear infection-age-dependent\npartial differential equation, which is coupled with an ordinary differential\nequation that describes the dynamics of the susceptible population. Theoretical\nresults about global existence and uniqueness of positive solutions are proved.\nWe also present two practical applications of our model: (1) we assess public\nhealth guidelines about emergency preparedness and response in the event of a\nsmallpox bioterrorist attack; (2) we simulate the 2003 SARS outbreak in Taiwan\nand estimate the number of cases avoided by contact tracing. Our model can be\napplied as a rational basis for decision makers to guide interventions and\ndeploy public health resources in future epidemics.\n", "versions": [{"version": "v1", "created": "Sat, 7 Dec 2013 18:02:46 GMT"}, {"version": "v2", "created": "Tue, 11 Mar 2014 20:46:37 GMT"}], "update_date": "2014-03-13", "authors_parsed": [["Huo", "Xi", ""]]}, {"id": "1312.2386", "submitter": "Sebastian H\\\"ohna", "authors": "Sebastian H\\\"ohna, Tracy A. Heath, Bastien Boussau, Michael J. Landis,\n  Fredrik Ronquist and John P. Huelsenbeck", "title": "Probabilistic Graphical Model Representation in Phylogenetics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent years have seen a rapid expansion of the model space explored in\nstatistical phylogenetics, emphasizing the need for new approaches to\nstatistical model representation and software development. Clear communication\nand representation of the chosen model is crucial for: (1) reproducibility of\nan analysis, (2) model development and (3) software design. Moreover, a\nunified, clear and understandable framework for model representation lowers the\nbarrier for beginners and non-specialists to grasp complex phylogenetic models,\nincluding their assumptions and parameter/variable dependencies.\n  Graphical modeling is a unifying framework that has gained in popularity in\nthe statistical literature in recent years. The core idea is to break complex\nmodels into conditionally independent distributions. The strength lies in the\ncomprehensibility, flexibility, and adaptability of this formalism, and the\nlarge body of computational work based on it. Graphical models are well-suited\nto teach statistical models, to facilitate communication among phylogeneticists\nand in the development of generic software for simulation and statistical\ninference.\n  Here, we provide an introduction to graphical models for phylogeneticists and\nextend the standard graphical model representation to the realm of\nphylogenetics. We introduce a new graphical model component, tree plates, to\ncapture the changing structure of the subgraph corresponding to a phylogenetic\ntree. We describe a range of phylogenetic models using the graphical model\nframework and introduce modules to simplify the representation of standard\ncomponents in large and complex models. Phylogenetic model graphs can be\nreadily used in simulation, maximum likelihood inference, and Bayesian\ninference using, for example, Metropolis-Hastings or Gibbs sampling of the\nposterior distribution.\n", "versions": [{"version": "v1", "created": "Mon, 9 Dec 2013 11:17:55 GMT"}], "update_date": "2013-12-10", "authors_parsed": [["Höhna", "Sebastian", ""], ["Heath", "Tracy A.", ""], ["Boussau", "Bastien", ""], ["Landis", "Michael J.", ""], ["Ronquist", "Fredrik", ""], ["Huelsenbeck", "John P.", ""]]}, {"id": "1312.2392", "submitter": "Sebastian H\\\"ohna", "authors": "Sebastian H\\\"ohna", "title": "The time-dependent reconstructed evolutionary process with a key-role\n  for mass-extinction events", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The homogeneous reconstructed evolutionary process is a birth-death process\nwithout observed extinct lineages. Each species evolves independently with the\nsame diversification rates (speciation rate $\\lambda(t)$ and extinction rate\n$\\mu(t)$) that may change over time. The process is commonly applied to model\nspecies diversification where the data are reconstructed phylogenies, e.g.,\ntrees reconstructed from present-day molecular data, and used to infer\ndiversification rates.\n  In the present paper I develop the general probability density of a\nreconstructed tree under any time-dependent birth-death process. I elaborate on\nhow to adapt this probability density if conditioned on survival of one or two\ninitial lineages, or having sampled $n$ species and show how to transform\nbetween the probability density of a reconstructed and the probability density\nof the speciation times.\n  I demonstrate the use of the general time-dependent probability density\nfunctions by deriving the probability density of a reconstructed tree under a\nbirth-death-shift model with explicit mass-extinction events. I enrich this\ncompendium by providing and discussing several special cases, including: the\npure birth process, the pure death process, the birth-death process and the\ncritical branching process. Thus, I provide here most of the commonly used\nbirth-death models in a unified framework (e.g., same condition and same data)\nwith common notation.\n", "versions": [{"version": "v1", "created": "Mon, 9 Dec 2013 11:32:59 GMT"}, {"version": "v2", "created": "Thu, 30 Jan 2014 15:29:39 GMT"}, {"version": "v3", "created": "Tue, 11 Feb 2014 15:46:44 GMT"}], "update_date": "2014-02-12", "authors_parsed": [["Höhna", "Sebastian", ""]]}, {"id": "1312.2411", "submitter": "Timur Sadykov", "authors": "Timur Sadykov", "title": "Human blood genotypes dynamics", "comments": "7 pages, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a complete closed form description of the evolution of human blood\ngenotypes frequencies (in the ABO and Rh classification) after any (finite or\ninfinite) number of generations and for any initial distribution.\n", "versions": [{"version": "v1", "created": "Mon, 9 Dec 2013 12:39:48 GMT"}, {"version": "v2", "created": "Thu, 27 Nov 2014 15:01:51 GMT"}], "update_date": "2014-12-01", "authors_parsed": [["Sadykov", "Timur", ""]]}, {"id": "1312.2565", "submitter": "Charanpal Dhanjal", "authors": "Charanpal Dhanjal (LTCI), St\\'ephan Cl\\'emen\\c{c}on (LTCI)", "title": "An SIR Graph Growth Model for the Epidemics of Communicable Diseases", "comments": "A few minor corrections and tidy of references. arXiv admin note:\n  text overlap with arXiv:0810.0896 by other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP q-bio.PE stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is the main purpose of this paper to introduce a graph-valued stochastic\nprocess in order to model the spread of a communicable infectious disease. The\nmajor novelty of the SIR model we promote lies in the fact that the social\nnetwork on which the epidemics is taking place is not specified in advance but\nevolves through time, accounting for the temporal evolution of the interactions\ninvolving infective individuals. Without assuming the existence of a fixed\nunderlying network model, the stochastic process introduced describes, in a\nflexible and realistic manner, epidemic spread in non-uniformly mixing and\npossibly heterogeneous populations. It is shown how to fit such a\n(parametrised) model by means of Approximate Bayesian Computation methods based\non graph-valued statistics. The concepts and statistical methods described in\nthis paper are finally applied to a real epidemic dataset, related to the\nspread of HIV in Cuba in presence of a contact tracing system, which permits\none to reconstruct partly the evolution of the graph of sexual partners\ndiagnosed HIV positive between 1986 and 2006.\n", "versions": [{"version": "v1", "created": "Mon, 9 Dec 2013 20:19:36 GMT"}, {"version": "v2", "created": "Wed, 5 Feb 2014 14:27:44 GMT"}], "update_date": "2014-02-06", "authors_parsed": [["Dhanjal", "Charanpal", "", "LTCI"], ["Clémençon", "Stéphan", "", "LTCI"]]}, {"id": "1312.2675", "submitter": "Gaurav Bhatia", "authors": "Gaurav Bhatia, Arti Tandon, Melinda C. Aldrich, Christine B.\n  Ambrosone, Christopher Amos, Elisa V. Bandera, Sonja I. Berndt, Leslie\n  Bernstein, William J. Blot, Cathryn H. Bock, Neil Caporaso, Graham Casey,\n  Sandra L. Deming, W. Ryan Diver, Susan M. Gapstur, Elizabeth M. Gillanders,\n  Curtis C. Harris, Brian E. Henderson, Sue A. Ingles, William Isaacs, Esther\n  M. John, Rick A. Kittles, Emma Larkin, Lorna H. McNeill, Robert C. Millikan,\n  Adam Murphy, Christine Neslund-Dudas, Sarah Nyante, Michael F. Press, Jorge\n  L. Rodriguez-Gil, Benjamin A. Rybicki, Ann G. Schwartz, Lisa B. Signorello,\n  Margaret Spitz, Sara S. Strom, Margaret A. Tucker, John K. Wiencke, John S.\n  Witte, Xifeng Wu, Yuko Yamamura, Krista A. Zanetti, Wei Zheng, Regina G.\n  Ziegler, Stephen J. Chanock, Christopher A. Haiman, David Reich, and Alkes L.\n  Price", "title": "Genome-wide scan of 29,141 African Americans finds no evidence of\n  selection since admixture", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We scanned through the genomes of 29,141 African Americans, searching for\nloci where the average proportion of African ancestry deviates significantly\nfrom the genome-wide average. We failed to find any genome-wide significant\ndeviations, and conclude that any selection in African Americans since\nadmixture is sufficiently weak that it falls below the threshold of our power\nto detect it using a large sample size. These results stand in contrast to the\nfindings of a recent study of selection in African Americans. That study, which\nhad 15 times fewer samples, reported six loci with significant deviations. We\nshow that the discrepancy is likely due to insufficient correction for multiple\nhypothesis testing in the previous study. The same study reported 14 loci that\nshowed greater population differentiation between African Americans and\nNigerian Yoruba than would be expected in the absence of natural selection.\nFour such loci were previously shown to be genome-wide significant and likely\nto be affected by selection, but we show that most of the 10 additional loci\nare likely to be false positives. Additionally, the most parsimonious\nexplanation for the loci that have significant evidence of unusual\ndifferentiation in frequency between Nigerians and Africans Americans is\nselection in Africa prior to their forced migration to the Americas.\n", "versions": [{"version": "v1", "created": "Tue, 10 Dec 2013 05:40:58 GMT"}], "update_date": "2013-12-11", "authors_parsed": [["Bhatia", "Gaurav", ""], ["Tandon", "Arti", ""], ["Aldrich", "Melinda C.", ""], ["Ambrosone", "Christine B.", ""], ["Amos", "Christopher", ""], ["Bandera", "Elisa V.", ""], ["Berndt", "Sonja I.", ""], ["Bernstein", "Leslie", ""], ["Blot", "William J.", ""], ["Bock", "Cathryn H.", ""], ["Caporaso", "Neil", ""], ["Casey", "Graham", ""], ["Deming", "Sandra L.", ""], ["Diver", "W. Ryan", ""], ["Gapstur", "Susan M.", ""], ["Gillanders", "Elizabeth M.", ""], ["Harris", "Curtis C.", ""], ["Henderson", "Brian E.", ""], ["Ingles", "Sue A.", ""], ["Isaacs", "William", ""], ["John", "Esther M.", ""], ["Kittles", "Rick A.", ""], ["Larkin", "Emma", ""], ["McNeill", "Lorna H.", ""], ["Millikan", "Robert C.", ""], ["Murphy", "Adam", ""], ["Neslund-Dudas", "Christine", ""], ["Nyante", "Sarah", ""], ["Press", "Michael F.", ""], ["Rodriguez-Gil", "Jorge L.", ""], ["Rybicki", "Benjamin A.", ""], ["Schwartz", "Ann G.", ""], ["Signorello", "Lisa B.", ""], ["Spitz", "Margaret", ""], ["Strom", "Sara S.", ""], ["Tucker", "Margaret A.", ""], ["Wiencke", "John K.", ""], ["Witte", "John S.", ""], ["Wu", "Xifeng", ""], ["Yamamura", "Yuko", ""], ["Zanetti", "Krista A.", ""], ["Zheng", "Wei", ""], ["Ziegler", "Regina G.", ""], ["Chanock", "Stephen J.", ""], ["Haiman", "Christopher A.", ""], ["Reich", "David", ""], ["Price", "Alkes L.", ""]]}, {"id": "1312.2755", "submitter": "Joseba Dalmau", "authors": "Rapha\\\"el Cerf and Joseba Dalmau", "title": "The distribution of the quasispecies for a Moran model on the sharp peak\n  landscape", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the Moran model on the sharp peak landscape, in the asymptotic\nregime studied in [3], where a quasispecies is formed. We find explicitly the\ndistribution of this quasispecies.\n", "versions": [{"version": "v1", "created": "Tue, 10 Dec 2013 11:10:26 GMT"}], "update_date": "2013-12-11", "authors_parsed": [["Cerf", "Raphaël", ""], ["Dalmau", "Joseba", ""]]}, {"id": "1312.2827", "submitter": "Christian Althaus Ph.D.", "authors": "Nicola Low, Janneke C.M. Heijne, Sereina A. Herzog, Christian L.\n  Althaus", "title": "Re-infection by untreated partners of people treated for Chlamydia\n  trachomatis and Neisseria gonorrhoeae: mathematical modelling study", "comments": "Short report, 1 figure", "journal-ref": "Sex Transm Infect. 2014 May;90(3):254-6", "doi": "10.1136/sextrans-2013-051279", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objectives: Re-infection after treatment for Chlamydia trachomatis or\nNeisseria gonorrhoeae reduces the effect of control interventions. We explored\nthe impact of delays in partner treatment on the expected probability of\nre-infection of index cases using a mathematical model. Methods: We used\npreviously reported parameter distributions to calculate the probability that\nindex cases would be re-infected by their untreated partners. We then assumed\ndifferent delays between index case and partner treatment to calculate the\nprobabilities of re-infection. Results: In the absence of partner treatment,\nthe medians of the expected re-infection probabilities are 19.4% (interquartile\nrange (IQR) 9.2-31.6%) for chlamydia and 12.5% (IQR 5.6-22.2%) for gonorrhoea.\nIf all current partners receive treatment three days after the index case, the\nexpected re-infection probabilities are 4.2% (IQR 2.1-6.9%) for chlamydia and\n5.5% (IQR 2.6-9.5%) for gonorrhoea. Conclusions: Quicker partner referral and\ntreatment can substantially reduce re-infection rates for chlamydia and\ngonorrhoea. The formula we used to calculate re-infection rates can be used to\ninform the design of randomised controlled trials of novel partner notification\ntechnologies like accelerated partner therapy.\n", "versions": [{"version": "v1", "created": "Tue, 10 Dec 2013 15:10:13 GMT"}], "update_date": "2014-08-20", "authors_parsed": [["Low", "Nicola", ""], ["Heijne", "Janneke C. M.", ""], ["Herzog", "Sereina A.", ""], ["Althaus", "Christian L.", ""]]}, {"id": "1312.2942", "submitter": "Wes Maciejewski", "authors": "Wes Maciejewski, Feng Fu, and Christoph Hauert", "title": "Evolutionary Game Dynamics in Populations with Heterogeneous Structures", "comments": null, "journal-ref": "PLOS Comp. Biol. 10 (4) e1003567 (2014)", "doi": "10.1371/journal.pcbi.1003567", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Evolutionary graph theory is a well established framework for modelling the\nevolution of social behaviours in structured populations. An emerging consensus\nin this field is that graphs that exhibit heterogeneity in the number of\nconnections between individuals are more conducive to the spread of cooperative\nbehaviours. In this article we show that such a conclusion largely depends on\nthe individual-level interactions that take place. In particular, averaging\npayoffs garnered through game interactions rather than accumulating the payoffs\ncan altogether remove the cooperative advantage of heterogeneous graphs while\nsuch a difference does not affect the outcome on homogeneous structures. In\naddition, the rate at which game interactions occur can alter the evolutionary\noutcome. Less interactions allow heterogeneous graphs to support more\ncooperation than homogeneous graphs, while higher rates of interactions make\nhomogeneous and heterogeneous graphs virtually indistinguishable in their\nability to support cooperation. Most importantly, we show that common measures\nof evolutionary advantage used in homogeneous populations, such as a comparison\nof the fixation probability of a rare mutant to that of the resident type, are\nno longer valid in heterogeneous populations. Heterogeneity causes a bias in\nwhere mutations occur in the population which affects the mutant's fixation\nprobability. We derive the appropriate measures for heterogeneous populations\nthat account for this bias.\n", "versions": [{"version": "v1", "created": "Tue, 10 Dec 2013 20:46:39 GMT"}], "update_date": "2018-11-20", "authors_parsed": [["Maciejewski", "Wes", ""], ["Fu", "Feng", ""], ["Hauert", "Christoph", ""]]}, {"id": "1312.3028", "submitter": "Daniel Balick", "authors": "Daniel J. Balick, Ron Do, David Reich, and Shamil R. Sunyaev", "title": "Response to a population bottleneck can be used to infer recessive\n  selection", "comments": "35 pages including supplement, 7 figures including supplement", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Here we present the first genome wide statistical test for recessive\nselection. This test uses explicitly non-equilibrium demographic differences\nbetween populations to infer the mode of selection. By analyzing the transient\nresponse to a population bottleneck and subsequent re-expansion, we\nqualitatively distinguish between alleles under additive and recessive\nselection. We analyze the response of the average number of deleterious\nmutations per haploid individual and describe time dependence of this quantity.\nWe introduce a statistic, $B_R$, to compare the number of mutations in\ndifferent populations and detail its functional dependence on the strength of\nselection and the intensity of the population bottleneck. This test can be used\nto detect the predominant mode of selection on the genome wide or regional\nlevel, as well as among a sufficiently large set of medically or functionally\nrelevant alleles.\n", "versions": [{"version": "v1", "created": "Wed, 11 Dec 2013 03:22:54 GMT"}, {"version": "v2", "created": "Fri, 21 Mar 2014 04:05:00 GMT"}], "update_date": "2014-03-24", "authors_parsed": [["Balick", "Daniel J.", ""], ["Do", "Ron", ""], ["Reich", "David", ""], ["Sunyaev", "Shamil R.", ""]]}, {"id": "1312.3112", "submitter": "Antonio Marco", "authors": "Antonio Marco", "title": "Sex-biased expression of microRNAs in Drosophila melanogaster", "comments": "25 pages, including 4 figures", "journal-ref": "Marco A (2014) Open Biology 4, 140024", "doi": "10.1098/rsob.140024", "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most animals have separate sexes. The differential expression of gene\nproducts, in particular that of gene regulators, is underlying sexual\ndimorphism. Analyses of sex-biased expression have focused mostly in protein\ncoding genes. Several lines of evidence indicate that microRNAs, a class of\nmajor gene regulators, are likely to have a significant role in sexual\ndimorphism. This role has not been systematically explored so far. Here I study\nthe sex-biased expression pattern of microRNAs in the model species Drosophila\nmelanogaster. As with protein coding genes, sex biased microRNAs are associated\nwith the reproductive function. Strikingly, contrary to protein-coding genes,\nmale biased microRNAs are enriched in the X chromosome whilst female microRNAs\nare mostly autosomal. I propose that the chromosomal distribution is a\nconsequence of high rates of de novo emergence, and a preference of new\nmicroRNAs to be expressed in the testis. I also suggest that demasculinization\nof the X chromosome may not affect microRNAs. Interestingly, female biased\nmicroRNAs are often encoded within protein coding genes that are also expressed\nin females. MicroRNAs with sex-biased expression do not preferentially target\nsex-biased gene transcripts. These results strongly suggest that the sex-biased\nexpression of microRNAs is mainly a consequence of high rates of microRNA\nemergence in the X (male bias) or hitch-hiked expression by host genes (female\nbias).\n", "versions": [{"version": "v1", "created": "Wed, 11 Dec 2013 11:06:48 GMT"}, {"version": "v2", "created": "Tue, 11 Feb 2014 11:40:46 GMT"}], "update_date": "2014-04-03", "authors_parsed": [["Marco", "Antonio", ""]]}, {"id": "1312.3206", "submitter": "Joel Adamson", "authors": "Joel James Adamson", "title": "Evolution of female choice and age-dependent male traits with paternal\n  germ-line mutation", "comments": "10 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Several studies question the adaptive value of female preferences for older\nmales. Theory and evidence show that older males carry more deleterious\nmutations in their sperm than younger males carry. These mutations are not\nvisible to females choosing mates. Germ-line mutations could oppose preferences\nfor \"good genes.\" Choosy females run the risk that offspring of older males\nwill be no more attractive or healthy than offspring of younger males.\nGerm-line mutations could pose a particular problem when females can only judge\nmale trait size, rather than assessing age directly. I ask whether or not\nfemales will prefer extreme traits, despite reduced offspring survival due to\nage-dependent mutation. I use a quantitative genetic model to examine the\nevolution of female preferences, an age-dependent male trait, and overall\nhealth (\"condition\"). My dynamical equation includes mutation bias that depends\non the generation time of the population. I focus on the case where females\nform preferences for older males because male trait size depends on male age.\nMy findings agree with good genes theory. Females at equilibrium always select\nabove-average males. The trait size preferred by females directly correlates\nwith the direct costs of the preference. Direct costs can accentuate the\nequilibrium preference at a higher rate than mutational parameters. Females can\nalways offset direct costs by mating with older, more ornamented males.\nAge-dependent mutation in condition maintains genetic variation in condition\nand thereby maintains the selective value of female preferences. Rather than\neliminating female preferences, germ-line mutations provide an essential\ningredient in sexual selection.\n", "versions": [{"version": "v1", "created": "Wed, 11 Dec 2013 15:20:04 GMT"}], "update_date": "2013-12-12", "authors_parsed": [["Adamson", "Joel James", ""]]}, {"id": "1312.3260", "submitter": "James Lindesay", "authors": "James Lindesay, Tshela E. Mason, William Hercules, and Georgia M.\n  Dunston", "title": "The Foundations of Genodynamics: The Development of Metrics for\n  Genomic-Environmental Interactions", "comments": "22 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Single nucleotide polymorphisms (SNPs) represent an important type of dynamic\nsites within the human genome. These common variants often locally correlate\ninto more complex multi-SNP haploblocks that are maintained throughout\ngenerations in a stable population. The information encoded in the structure of\ncommon SNPs and SNP haploblock variation can be characterized through a\nnormalized information content (NIC) metric. Such an intrinsic measure allows\ndisparate regions of individual genomes and the genomes of various populations\nto be quantitatively compared in a meaningful way.\n  Using our defined measures of genomic information, the interplay of\nmaintained statistical variations due to the environmental baths within which\nstable populations exist can be interrogated. We develop the analogous\n\"thermodynamics\" characterizing the state variables for genomic populations\nthat are stable under stochastic environmental stresses. Since living systems\nhave not been found to develop in the absence of environmental influences, we\nfocus on describing the analogous genomic free energy measures in this\ndevelopment.\n  The intensive parameter describing how an environment drives genomic\ndiversity is found to depend inversely upon the NIC of the genome of a stable\npopulation within that environment. Once this environmental potential has been\ndetermined from the whole genome of a population, additive state variables can\nbe directly related to the probabilities of the occurrence of given viable SNP\nbased units (alleles) within that genome. This formulation allows the\ndetermination of both population averaged state variables as well as the\ngenomic energies of individual alleles and their combinations. The\ndetermination of individual allelic potentials then should allow the\nparameterization of specific environmental influences upon shared alleles\nacross populations in varying environments.\n", "versions": [{"version": "v1", "created": "Wed, 11 Dec 2013 17:51:56 GMT"}], "update_date": "2013-12-12", "authors_parsed": [["Lindesay", "James", ""], ["Mason", "Tshela E.", ""], ["Hercules", "William", ""], ["Dunston", "Georgia M.", ""]]}, {"id": "1312.3283", "submitter": "Thomas Van Boeckel Dr", "authors": "Thomas P. Van Boeckel, Michael J. Tildesley, Catherine Linard, Jos\\'e\n  Halloy, Matt J. Keeling, Marius Gilbert", "title": "The Nosoi commute: a spatial perspective on the rise of BSL-4\n  laboratories in cities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent H5N1 influenza research has revived the debate on the storage and\nmanipulation of potentially harmful pathogens. In the last two decades, new\nhigh biosafety (BSL-4) laboratories entered into operation, raising strong\nconcerns from the public. The probability of an accidental release of a\npathogen from a BSL-4 laboratory is extremely low, but the corresponding risk\n-- defined as the probability of occurrence multiplied by its impact -- could\nbe significant depending on the pathogen specificities and the population\npotentially affected. A list of BSL-4 laboratories throughout the world, with\ntheir location and date of first activity, was established from publicly\navailable sources. This database was used to estimate the total population\nliving within a daily commuting distance of BSL-4 laboratories, and to quantify\nhow this figure changed over time. We show that from 1990 to present, the\npopulation living within the commuting belt of BSL-4 laboratories increased by\na factor of 4 to reach up to 1.8% of the world population, owing to an increase\nin the number of facilities and their installation in cities. Europe is\ncurrently hosting the largest population living in the direct vicinity of BSL-4\nlaboratories, while the recent building of new facilities in Asia suggests that\nan important increase of the population living close to BSL-4 laboratories will\nbe observed in the next decades. We discuss the potential implications in term\nof global risk, and call for better pathogen-specific quantitative assessment\nof the risk of outbreaks resulting from the accidental release of potentially\npandemic pathogens\n", "versions": [{"version": "v1", "created": "Wed, 11 Dec 2013 19:15:46 GMT"}, {"version": "v2", "created": "Fri, 13 Dec 2013 16:22:06 GMT"}], "update_date": "2013-12-16", "authors_parsed": [["Van Boeckel", "Thomas P.", ""], ["Tildesley", "Michael J.", ""], ["Linard", "Catherine", ""], ["Halloy", "José", ""], ["Keeling", "Matt J.", ""], ["Gilbert", "Marius", ""]]}, {"id": "1312.3445", "submitter": "Namiko Mitarai", "authors": "Filippo Botta and Namiko Mitarai", "title": "Disturbance accelerates the transition from low- to high- diversity\n  state in a model ecosystem", "comments": "8 pages, 8 figures. Typos corrected", "journal-ref": "Phys. Rev. E vol 89, 022704 (2014)", "doi": "10.1103/PhysRevE.89.022704", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The effect of disturbance on a model ecosystem of sessile and mutually\ncompetitive species [Mathiesen et al. Phys. Rev. Lett. 107, 188101 (2011);\nMitarai et al. Phys. Rev. E 86, 011929 (2012) ] is studied. The disturbance\nstochastically removes individuals from the system, and the created empty sites\nare re-colonized by neighbouring species. We show that the stable\nhigh-diversity state, maintained by occasional cyclic species interactions that\ncreate isolated patches of meta-populations, is robust against small\ndisturbance. We further demonstrate that finite disturbance can accelerate the\ntransition from the low- to high-diversity state by helping creation of small\npatches through diffusion of boundaries between species with stand-off\nrelation.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 11:12:45 GMT"}, {"version": "v2", "created": "Mon, 17 Feb 2014 15:13:34 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Botta", "Filippo", ""], ["Mitarai", "Namiko", ""]]}, {"id": "1312.3447", "submitter": "Rub\\'en J. Requejo", "authors": "Rub\\'en J. Requejo-Mart\\'inez", "title": "Evolutionary game theory and the tower of Babel of cooperation:\n  Altruism, free-riding, parasitism and the structure of the interactions in a\n  world with finite resources", "comments": "38 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.bio-ph physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The study of the evolution of cooperative behaviours --which provide benefits\nto others-- and altruism --which provides benefits to others at a cost to\noneself-- has been on the core of the evolutionary game theoretical framework\nsince its foundation. The fast development of the theory during the last years\nhas improved our knowledge of the issue, but carried attached a diversification\nof concepts which affected communication between scientists. Furthermore, the\nmain root of conflict in the struggle for life identified by Darwin, the\nlimited amount of resources present in any ecosystem, which is assumed to keep\na constant population size in most game theoretical studies, has only recently\nbeen taken into account as explicitly influencing the evolutionary process.\nThis review concerns about both issues, the conceptual diversification during\nthe last years and the new results of the resource dependent models. In\nextenso: After a historical introduction, a review of the most important\nconcepts is carried out. Then it is shown that pairwise interactions and\nadditive fitness determine prisoner's dilemmas (PDs) or harmony games, that two\naltruists interacting together may determine a PD, and that the interaction\nenvironment of the most cooperative and less selfish individual in any\npopulation is always a PD. After that, it is shown that in addition to\naltruists versus free-riders, the combination of free-riders and parasites\ndetermines a fundamentally different PD. Computer simulations are then carried\nout to show that random exploration of parasitism, free-riding and altruism\nenables coexistence of the three strategies without the need of reciprocating,\npunishing or rewarding strategies. To finish, the problem of the limitation of\nresources is reviewed, showing that...\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 11:14:40 GMT"}], "update_date": "2013-12-13", "authors_parsed": [["Requejo-Martínez", "Rubén J.", ""]]}, {"id": "1312.3450", "submitter": "Rub\\'en J. Requejo", "authors": "R. J. Requejo and J. Camacho", "title": "Scarcity may promote cooperation in populations of simple agents", "comments": "5 pages, 2 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.87.022819", "report-no": null, "categories": "physics.bio-ph physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the study of the evolution of cooperation, resource limitations are\nusually assumed just to provide a finite population size. Recently, however, it\nhas been pointed out that resource limitation may also generate dynamical\npayoffs able to modify the original structure of the games. Here we study\nanalytically a phase transition from a homogeneous population of defectors when\nresources are abundant to the survival of unconditional cooperators when\nresources reduce below a threshold. To this end, we introduce a model of simple\nagents, with no memory or ability of recognition, interacting in well-mixed\npopulations. The result might shed light on the role played by resource\nconstraints on the origin of multicellularity.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 11:27:35 GMT"}], "update_date": "2013-12-13", "authors_parsed": [["Requejo", "R. J.", ""], ["Camacho", "J.", ""]]}, {"id": "1312.3583", "submitter": "Salvador Pueyo", "authors": "Salvador Pueyo", "title": "Idiosyncrasy as an explanation for power laws in nature", "comments": "To be published in Trends in Mathematics. 6 pages, 0 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Complex systems theory pays much attention to simple mechanisms producing\nnontrivial patterns, especially power laws. However, power laws with exponent\nclose to one also result from complex mixtures of mechanisms that, in\nisolation, would not necessarily give this type of distribution. Probably, both\npaths to the power law are relevant in nature. The second gives a plausible\nexplanation for some instances of power laws emerging in extremely complex\nsystems, such as ecosystems.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 18:39:51 GMT"}], "update_date": "2013-12-13", "authors_parsed": [["Pueyo", "Salvador", ""]]}, {"id": "1312.3647", "submitter": "Mihalis Kavousanakis", "authors": "I Aviziotis and M Kavousanakis and I Bitsanis and A Boudouvis", "title": "Coarse-grained analysis of stochastically simulated cell populations\n  with a positive feedback genetic network architecture", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Among the different computational approaches modelling the dynamics of\nisogenic cell populations, discrete stochastic models can describe with\nsufficient accuracy the evolution of small size populations. However, for a\nsystematic and efficient study of their long-time behaviour over a wide range\nof parameter values, the performance of solely direct temporal simulations\nrequires significantly high computational time. In addition, when the dynamics\nof the cell populations exhibit non-trivial bistable behaviour, such an\nanalysis becomes a prohibitive task, since a large ensemble of initial states\nneed to be tested for the quest of possibly co-existing steady state solutions.\nIn this work, we study cell populations which carry the {\\it lac} operon\nnetwork exhibiting solution multiplicity over a wide range of extracellular\nconditions (inducer concentration). By adopting ideas from the so-called\n``equation-free'' methodology, we perform systems-level analysis, which\nincludes numerical tasks such as the computation of {\\it coarse} steady state\nsolutions, {\\it coarse} bifurcation analysis, as well as {\\it coarse} stability\nanalysis. Dynamically stable and unstable macroscopic (population level) steady\nstate solutions are computed by means of bifurcation analysis utilising short\nbursts of fine-scale simulations, and the range of bistability is determined\nfor different sizes of cell populations. The results are compared with the\ndeterministic cell population balance (CPB) model, which is valid for large\npopulations, and we demonstrate the increased effect of stochasticity in small\nsize populations with asymmetric partitioning mechanisms.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 21:05:46 GMT"}], "update_date": "2013-12-16", "authors_parsed": [["Aviziotis", "I", ""], ["Kavousanakis", "M", ""], ["Bitsanis", "I", ""], ["Boudouvis", "A", ""]]}, {"id": "1312.3670", "submitter": "Stephen Pankavich", "authors": "Stephen Pankavich", "title": "The Effects of Latent Infection on the Dynamics of HIV", "comments": null, "journal-ref": "Differential Equations and Dynamical Systems, 3, 2016", "doi": "10.1007/s12591-014-0234-6", "report-no": null, "categories": "math.DS q-bio.CB q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One way in which the human immunodeficiency virus (HIV-1) replicates within a\nhost is by infecting activated CD4+ T-cells, which then produce additional\ncopies of the virus. Even with the introduction of antiretroviral drug therapy,\nwhich has been very successful over the past decade, a large obstacle to the\ncomplete eradication of the virus is the presence of viral reservoirs in the\nform of latently infected CD4+ T-cells. We consider a model of HIV infection\nthat describes T-cell and viral interactions, as well as, the production and\nactivation of latently infected T-cells. Upon determining equilibrium states of\nthe latent cell model, the local and global asymptotic behavior of solutions is\nexamined, and the basic reproduction number of the system is computed to be\nstrictly less than that of the corresponding three-component model, which omits\nthe effects of latent infection. In particular, this implies that a wider\nvariety of parameter values will lead to viral eradication as $t \\to \\infty$\ndue to the appearance of latent CD4+ T-cells. With this realization we discuss\npossible alternative notions for eradication and persistence of infection other\nthan traditional tools. These results are further illustrated by a number of\nnumerical simulations.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 23:03:48 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Pankavich", "Stephen", ""]]}, {"id": "1312.3671", "submitter": "Stephen Pankavich", "authors": "Eric Jones, Peter Roemer, Mrinal Raghupathi, and Stephen Pankavich", "title": "Analysis and Simulation of the Three-Component Model of HIV Dynamics", "comments": null, "journal-ref": "SIAM Undergraduate Research Online 7 (2014) 89-106", "doi": null, "report-no": null, "categories": "math.CA q-bio.CB q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical modeling of biological systems is crucial to effectively and\nefficiently developing treatments for medical conditions that plague humanity.\nOften, systems of ordinary differential equations are a traditional tool used\nto describe the spread of disease within the body. We consider the dynamics of\nthe Human Immunodeficiency Virus (HIV) in vivo during the initial stage of\ninfection. In particular, we examine the well-known three-component model and\nprove the existence, uniqueness, and boundedness of solutions. Furthermore, we\nprove that solutions remain biologically meaningful, i.e., are positivity\npreserving, and perform a thorough, local stability analysis for the\nequilibrium states of the system. Finally, we incorporate random coefficients\nwithin the model and obtain numerical results to predict the probability of\ninfection given the transmission of the virus to a new individual.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 23:14:48 GMT"}], "update_date": "2015-09-01", "authors_parsed": [["Jones", "Eric", ""], ["Roemer", "Peter", ""], ["Raghupathi", "Mrinal", ""], ["Pankavich", "Stephen", ""]]}, {"id": "1312.3838", "submitter": "Marcelo N. Kuperman", "authors": "Marcelo N. Kuperman", "title": "Invited review: Epidemics on social networks", "comments": "17 pages, 13 figures", "journal-ref": "Papers in Physics 5, 050003 (2010)", "doi": "10.4279/PIP.050003", "report-no": null, "categories": "nlin.AO cs.SI physics.soc-ph q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Since its first formulations almost a century ago, mathematical models for\ndisease spreading contributed to understand, evaluate and control the epidemic\nprocesses.They promoted a dramatic change in how epidemiologists thought of the\npropagation of infectious diseases.In the last decade, when the traditional\nepidemiological models seemed to be exhausted, new types of models were\ndeveloped.These new models incorporated concepts from graph theory to describe\nand model the underlying social structure.Many of these works merely produced a\nmore detailed extension of the previous results, but some others triggered a\ncompletely new paradigm in the mathematical study of epidemic processes. In\nthis review, we will introduce the basic concepts of epidemiology, epidemic\nmodeling and networks, to finally provide a brief description of the most\nrelevant results in the field.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 18:44:12 GMT"}], "update_date": "2013-12-16", "authors_parsed": [["Kuperman", "Marcelo N.", ""]]}, {"id": "1312.3861", "submitter": "Weihong Xu", "authors": "Weihong Xu, Yanling Zhang, Guangming Xie", "title": "Environment-dependent payoffs in finite populations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In constant-payoff finite population games, when selection is weak and\npopulation size is large, the one-third law serves as the condition for a\nstrategy to be advantageous. We generalize the result to the case where payoff\nmatrices are environment-dependent and provide a more general law. In this way\nwe model feedback from the environment and show its impact on the dynamics.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 04:22:52 GMT"}], "update_date": "2013-12-16", "authors_parsed": [["Xu", "Weihong", ""], ["Zhang", "Yanling", ""], ["Xie", "Guangming", ""]]}, {"id": "1312.3926", "submitter": "Nicholas Dulvy", "authors": "Nicholas K. Dulvy, Sarah L. Fowler, John A. Musick, Rachel D.\n  Cavanagh, Peter M. Kyne, Lucy R. Harrison, John K. Carlson, Lindsay N. K.\n  Davidson, Sonja V. Fordham, Malcolm P. Francis, Caroline M. Pollock, Colin A.\n  Simpfendorfer, George H. Burgess, Kent E. Carpenter, Leonard J. V. Compagno,\n  David A. Ebert, Claudine Gibson, Michelle R. Heupel, Suzanne R. Livingstone,\n  Jonnell C. Sanciangco, John D. Stevens, Sarah Valenti, William T. White", "title": "Extinction risk and conservation of the world's sharks and rays", "comments": "Accepted for publication in eLIFE on 5th December 2013. 83 pages, 9\n  tables, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The rapid expansion of human activities threatens ocean-wide biodiversity\nloss. Numerous marine animal populations have declined, yet it remains unclear\nwhether these trends are symptomatic of a chronic accumulation of global marine\nextinction risk. We present the first systematic analysis of threat for a\nglobally-distributed lineage of 1,041 chondrichthyan fishes - sharks, rays, and\nchimaeras. We estimate that one-quarter are threatened according to IUCN Red\nList criteria due to overfishing (targeted and incidental). Large-bodied,\nshallow-water species are at greatest risk and five out of the seven most\nthreatened families are rays. Overall chondrichthyan extinction risk is\nsubstantially higher than for most other vertebrates, and only one-third of\nspecies are considered safe. Population depletion has occurred throughout the\nworld's ice-free waters, but is particularly prevalent in the Indo-Pacific\nBiodiversity Triangle and Mediterranean Sea. Improved management of fisheries\nand trade is urgently needed to avoid extinctions and promote population\nrecovery.\n", "versions": [{"version": "v1", "created": "Thu, 12 Dec 2013 18:03:52 GMT"}], "update_date": "2013-12-16", "authors_parsed": [["Dulvy", "Nicholas K.", ""], ["Fowler", "Sarah L.", ""], ["Musick", "John A.", ""], ["Cavanagh", "Rachel D.", ""], ["Kyne", "Peter M.", ""], ["Harrison", "Lucy R.", ""], ["Carlson", "John K.", ""], ["Davidson", "Lindsay N. K.", ""], ["Fordham", "Sonja V.", ""], ["Francis", "Malcolm P.", ""], ["Pollock", "Caroline M.", ""], ["Simpfendorfer", "Colin A.", ""], ["Burgess", "George H.", ""], ["Carpenter", "Kent E.", ""], ["Compagno", "Leonard J. V.", ""], ["Ebert", "David A.", ""], ["Gibson", "Claudine", ""], ["Heupel", "Michelle R.", ""], ["Livingstone", "Suzanne R.", ""], ["Sanciangco", "Jonnell C.", ""], ["Stevens", "John D.", ""], ["Valenti", "Sarah", ""], ["White", "William T.", ""]]}, {"id": "1312.4152", "submitter": "Tom\\'as Revilla", "authors": "Tom\\'as A. Revilla", "title": "Numerical responses in resource-based mutualisms: a time scale approach", "comments": null, "journal-ref": "Journal of Theoretical Biology. Vol. 378, pp. 39-46 (2015)", "doi": "10.1016/j.jtbi.2015.04.012 10.1016/j.jtbi.2015.04.012\n  10.1016/j.jtbi.2015.04.012 10.1016/j.jtbi.2015.04.012", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In mutualisms where there is exchange of resources for resources, or\nresources for services, the resources are typically short lived compared with\nthe lives of the organisms that produce and make use of them. This fact allows\na separation of time scales, by which the numerical response of one species\nwith respect to the abundance of another can be derived mechanistically. These\nresponses can account for intra-specific competition, due to the partition of\nthe resources provided by mutualists, in this way connecting competition theory\nand mutualism at a microscopic level. It is also possible to derive saturating\nresponses in the case of species that provide resources but expect a service in\nreturn (e.g. pollination, seed dispersal) instead of food or nutrients. In both\nsituations, competition and saturation have the same underlying cause, which is\nthat the generation of resources occur at a finite velocity per individual of\nthe providing species, but their depletion happens much faster due to the\nacceleration in growth rates that characterizes mutualism. The resulting models\ncan display all the basic features seen in many models of facultative and\nobligate mutualisms, and they can be generalized from species pairs to larger\ncommunities. The parameters of the numerical responses can be related with\nquantities that can be in principle measured, and that can be related by\ntrade-offs, which can be useful for studying the evolution of mutualisms.\n  Abstract Keywords: mutualism, resources, services, steady-state, functional\nand numerical response\n", "versions": [{"version": "v1", "created": "Sun, 15 Dec 2013 14:48:09 GMT"}, {"version": "v2", "created": "Wed, 20 Jul 2016 14:18:17 GMT"}], "update_date": "2016-07-21", "authors_parsed": [["Revilla", "Tomás A.", ""]]}, {"id": "1312.4644", "submitter": "Maroussia Favre", "authors": "Maroussia Favre and Didier Sornette", "title": "A generic model of dyadic social relationships", "comments": null, "journal-ref": "PLoS ONE 2015 10(3): e0120882", "doi": "10.1371/journal.pone.0120882", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a model of dyadic social interactions and establish its\ncorrespondence with relational models theory (RMT), a theory of human social\nrelationships. RMT posits four elementary models of relationships governing\nhuman interactions, singly or in combination: Communal Sharing, Authority\nRanking, Equality Matching, and Market Pricing. To these are added the limiting\ncases of asocial and null interactions, whereby people do not coordinate with\nreference to any shared principle. Our model is rooted in the observation that\neach individual in a dyadic interaction can do either the same thing as the\nother individual, a different thing or nothing at all. To represent these three\npossibilities, we consider two individuals that can each act in one out of\nthree ways toward the other: perform a social action X or Y, or alternatively\ndo nothing. We demonstrate that the relationships generated by this model\naggregate into six exhaustive and disjoint categories. We propose that four of\nthese categories match the four relational models, while the remaining two\ncorrespond to the asocial and null interactions defined in RMT. We generalize\nour results to the presence of N social actions. We infer that the four\nrelational models form an exhaustive set of all possible dyadic relationships\nbased on social coordination. Hence, we contribute to RMT by offering an answer\nto the question of why there could exist just four relational models. In\naddition, we discuss how to use our representation to analyze data sets of\ndyadic social interactions, and how social actions may be valued and matched by\nthe agents.\n", "versions": [{"version": "v1", "created": "Tue, 17 Dec 2013 05:19:57 GMT"}, {"version": "v2", "created": "Mon, 3 Mar 2014 16:38:06 GMT"}, {"version": "v3", "created": "Wed, 8 Apr 2015 08:58:41 GMT"}], "update_date": "2016-12-13", "authors_parsed": [["Favre", "Maroussia", ""], ["Sornette", "Didier", ""]]}, {"id": "1312.4699", "submitter": "Filip Bielejec", "authors": "Filip Bielejec and Philippe Lemey and Luiz Max Carvalho and Guy Baele\n  and Andrew Rambaut and Marc A. Suchard", "title": "piBUSS: a parallel BEAST/BEAGLE utility for sequence simulation under\n  complex evolutionary scenarios", "comments": "13 pages, 2 figures, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Background: Simulated nucleotide or amino acid sequences are frequently used\nto assess the performance of phylogenetic reconstruction methods. BEAST, a\nBayesian statistical framework that focuses on reconstructing time-calibrated\nmolecular evolutionary processes, supports a wide array of evolutionary models,\nbut lacked matching machinery for simulation of character evolution along\nphylogenies.\n  Results: We present a flexible Monte Carlo simulation tool, called piBUSS,\nthat employs the BEAGLE high performance library for phylogenetic computations\nwithin BEAST to rapidly generate large sequence alignments under complex\nevolutionary models. piBUSS sports a user-friendly graphical user interface\n(GUI) that allows combining a rich array of models across an arbitrary number\nof partitions. A command-line interface mirrors the options available through\nthe GUI and facilitates scripting in large-scale simulation studies. Analogous\nto BEAST model and analysis setup, more advanced simulation options are\nsupported through an extensible markup language (XML) specification, which in\naddition to generating sequence output, also allows users to combine simulation\nand analysis in a single BEAST run.\n  Conclusions: piBUSS offers a unique combination of flexibility and\nease-of-use for sequence simulation under realistic evolutionary scenarios.\nThrough different interfaces, piBUSS supports simulation studies ranging from\nmodest endeavors for illustrative purposes to complex and large-scale\nassessments of evolutionary inference procedures. The software aims at\nimplementing new models and data types that are continuously being developed as\npart of BEAST/BEAGLE.\n", "versions": [{"version": "v1", "created": "Tue, 17 Dec 2013 09:43:17 GMT"}], "update_date": "2013-12-18", "authors_parsed": [["Bielejec", "Filip", ""], ["Lemey", "Philippe", ""], ["Carvalho", "Luiz Max", ""], ["Baele", "Guy", ""], ["Rambaut", "Andrew", ""], ["Suchard", "Marc A.", ""]]}, {"id": "1312.5403", "submitter": "Boleslaw Szymanski", "authors": "Konrad R. Fialkowski", "title": "Lack of water and endurance running could have caused the exponential\n  growth in human brain: Point of no return model", "comments": "arXiv admin note: text overlap with arXiv:1309.5614", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Growth in brain volume is one of the most spectacular changes in the hominid\nlineage. The anthropological community agrees on that point. No consensus,\nhowever, has been reached on selection pressures contributing to that growth.\nIn that respect Martin (1984) can be invoked. In his review of size\nrelationships among primates he stated that despite the relationship between\nbrain size, body size and feeding behavior no single interpretation could be\nprovided that revealed the causality of such relationship.\n  This paper deals with one specific aspect of hominid brain growth; the fact\nthat for most of the hominid period, growth in brain volume was exponential in\ncharacter. To the best of our knowledge, no attempt has been made to identify a\nselection mechanism that can facilitate just the exponential features of that\ngrowth (as distinct from any of its other characteristics). It is broadly\naccepted that the dynamics of this growth were peculiar. Growth was very fast,\nor even rapid in the evolutionary scale of time. The most profound evidence of\nthat opinion was expressed by Haldane that this dramatic increase in brain size\nwas the most rapid evolutionary change known to him.\n", "versions": [{"version": "v1", "created": "Thu, 19 Dec 2013 04:26:05 GMT"}], "update_date": "2013-12-20", "authors_parsed": [["Fialkowski", "Konrad R.", ""]]}, {"id": "1312.5528", "submitter": "Juan A. Bonachela", "authors": "Juan A. Bonachela and Simon A. Levin", "title": "Evolutionary comparison between viral lysis rate and latent period", "comments": "to appear in J. Theor. Biol", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Marine viruses shape the structure of the microbial community. They are,\nthus, a key determinant of the most important biogeochemical cycles in the\nplanet. Therefore, a correct description of the ecological and evolutionary\nbehavior of these viruses is essential to make reliable predictions about their\nrole in marine ecosystems. The infection cycle, for example, is indistinctly\nmodeled in two very different ways. In one representation, the process is\ndescribed including explicitly a fixed delay between infection and offspring\nrelease. In the other, the offspring are released at exponentially distributed\ntimes according to a fixed release rate. By considering obvious quantitative\ndifferences pointed out in the past, the latter description is widely used as a\nsimplification of the former. However, it is still unclear how the dichotomy\n\"delay versus rate description\" affects long-term predictions of host-virus\ninteraction models. Here, we study the ecological and evolutionary implications\nof using one or the other approaches, applied to marine microbes. To this end,\nwe use mathematical and eco-evolutionary computational analysis. We show that\nthe rate model exhibits improved competitive abilities from both ecological and\nevolutionary perspectives in steady environments. However, rate-based\ndescriptions can fail to describe properly long-term microbe-virus\ninteractions. Moreover, additional information about trade-offs between\nlife-history traits is needed in order to choose the most reliable\nrepresentation for oceanic bacteriophage dynamics. This result affects deeply\nmost of the marine ecosystem models that include viruses, especially when used\nto answer evolutionary questions.\n", "versions": [{"version": "v1", "created": "Thu, 19 Dec 2013 13:08:41 GMT"}], "update_date": "2013-12-20", "authors_parsed": [["Bonachela", "Juan A.", ""], ["Levin", "Simon A.", ""]]}, {"id": "1312.5670", "submitter": "Tim Vines", "authors": "Timothy Vines, Arianne Albert, Rose Andrew, Florence Debarr\\'e, Dan\n  Bock, Michelle Franklin, Kimberley Gilbert, Jean-S\\'ebastien Moore,\n  S\\'ebastien Renaut, Diana J. Rennison", "title": "The availability of research data declines rapidly with article age", "comments": "14 pages, 2 figures", "journal-ref": null, "doi": "10.1016/j.cub.2013.11.014", "report-no": null, "categories": "cs.DL physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Policies ensuring that research data are available on public archives are\nincreasingly being implemented at the government [1], funding agency [2-4], and\njournal [5,6] level. These policies are predicated on the idea that authors are\npoor stewards of their data, particularly over the long term [7], and indeed\nmany studies have found that authors are often unable or unwilling to share\ntheir data [8-11]. However, there are no systematic estimates of how the\navailability of research data changes with time since publication. We therefore\nrequested datasets from a relatively homogenous set of 516 articles published\nbetween 2 and 22 years ago, and found that availability of the data was\nstrongly affected by article age. For papers where the authors gave the status\nof their data, the odds of a dataset being extant fell by 17% per year. In\naddition, the odds that we could find a working email address for the first,\nlast or corresponding author fell by 7% per year. Our results reinforce the\nnotion that, in the long term, research data cannot be reliably preserved by\nindividual researchers, and further demonstrate the urgent need for policies\nmandating data sharing via public archives.\n", "versions": [{"version": "v1", "created": "Thu, 19 Dec 2013 17:57:53 GMT"}], "update_date": "2013-12-20", "authors_parsed": [["Vines", "Timothy", ""], ["Albert", "Arianne", ""], ["Andrew", "Rose", ""], ["Debarré", "Florence", ""], ["Bock", "Dan", ""], ["Franklin", "Michelle", ""], ["Gilbert", "Kimberley", ""], ["Moore", "Jean-Sébastien", ""], ["Renaut", "Sébastien", ""], ["Rennison", "Diana J.", ""]]}, {"id": "1312.5678", "submitter": "Igor Kortchemski", "authors": "Igor Kortchemski", "title": "A predator-prey SIR type dynamics on large complete graphs with three\n  phase transitions", "comments": "31 pages, 4 figures. V3: To appear in Stoch. Proc. Appl", "journal-ref": "Stochastic Process. Appl. 125 (2015), no. 3, 886-917", "doi": null, "report-no": null, "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are interested in a variation of the SIR (Susceptible/Infected/Recovered)\ndynamics on the complete graph, in which infected individuals may only spread\nto neighboring susceptible individuals at fixed rate $\\lambda>0$ while\nrecovered individuals may only spread to neighboring infected individuals at\nfixed rate $1$. This is also a variant of the so-called chase-escape process\nintroduced by Kordzakhia and then Bordenave & Ganesan. Our work is the first\nstudy of this dynamics on complete graphs. Starting with one infected and one\nrecovered individuals on the complete graph with $N+2$ vertices, and stopping\nthe process when one type of individuals disappears, we study the asymptotic\nbehavior of the probability that the infection spreads to the whole graph as\n$N\\rightarrow\\infty$ and show that for $\\lambda\\in (0,1)$ (resp. for\n$\\lambda>1$), the infection dies out (resp. does not die out) with probability\ntending to one as $N\\rightarrow\\infty$, and that the probability that the\ninfection dies out tends to $1/2$ for $\\lambda=1$. We also establish limit\ntheorems concerning the asymptotic state of the system in all regimes and show\nthat two additional phase transitions occur in the subcritical phase\n$\\lambda\\in (0,1)$: at $\\lambda=1/2$ the behavior of the expected number of\nremaining infected individuals changes, while at $\\lambda=(\\sqrt {5}-1)/2$ the\nbehavior of the expected number of remaining recovered individuals changes. We\nalso study the outbreak sizes of the infection, and show that the outbreak\nsizes are small if $\\lambda \\in(0,1/2]$, exhibit a power-law behavior for\n$1/2<\\lambda<1$, and are pandemic for $\\lambda\\geq 1$. Our method relies on\ndifferent couplings: we first couple the dynamics with two independent Yule\nprocesses by using an Athreya-Karlin embedding, and then we couple the Yule\nprocesses with Poisson processes thanks to Kendall's representation of Yule\nprocesses.\n", "versions": [{"version": "v1", "created": "Thu, 19 Dec 2013 18:11:16 GMT"}, {"version": "v2", "created": "Mon, 13 Jan 2014 16:15:25 GMT"}, {"version": "v3", "created": "Fri, 3 Oct 2014 09:01:25 GMT"}], "update_date": "2018-02-19", "authors_parsed": [["Kortchemski", "Igor", ""]]}, {"id": "1312.5983", "submitter": "Behrouz Touri", "authors": "Michael J. Fox, Behrouz Touri, Jeff S. Shamma", "title": "Dynamics in atomic signaling games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study an atomic signaling game under stochastic evolutionary dynamics.\nThere is a finite number of players who repeatedly update from a finite number\nof available languages/signaling strategies. Players imitate the most fit\nagents with high probability or mutate with low probability. We analyze the\nlong-run distribution of states and show that, for sufficiently small mutation\nprobability, its support is limited to efficient communication systems. We find\nthat this behavior is insensitive to the particular choice of evolutionary\ndynamic, a property that is due to the game having a potential structure with a\npotential function corresponding to average fitness. Consequently, the model\nsupports conclusions similar to those found in the literature on language\ncompetition. That is, we show that efficient languages eventually predominate\nthe society while reproducing the empirical phenomenon of linguistic drift. The\nemergence of efficiency in the atomic case can be contrasted with results for\nnon-atomic signaling games that establish the non-negligible possibility of\nconvergence, under replicator dynamics, to states of unbounded efficiency loss.\n", "versions": [{"version": "v1", "created": "Fri, 20 Dec 2013 15:18:33 GMT"}], "update_date": "2013-12-23", "authors_parsed": [["Fox", "Michael J.", ""], ["Touri", "Behrouz", ""], ["Shamma", "Jeff S.", ""]]}, {"id": "1312.6185", "submitter": "James Boedicker", "authors": "James Q. Boedicker, Hernan G. Garcia, Stephanie Johnson and Rob\n  Phillips", "title": "DNA sequence-dependent mechanics and protein-assisted bending in\n  repressor-mediated loop formation", "comments": "27 pages, 8 figures", "journal-ref": "James Q Boedicker et al 2013 Phys. Biol. 10 066005", "doi": "10.1088/1478-3975/10/6/066005", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the chief informational molecule of life, DNA is subject to extensive\nphysical manipulations. The energy required to deform double-helical DNA\ndepends on sequence, and this mechanical code of DNA influences gene\nregulation, such as through nucleosome positioning. Here we examine the\nsequence-dependent flexibility of DNA in bacterial transcription\nfactor-mediated looping, a context for which the role of sequence remains\npoorly understood. Using a suite of synthetic constructs repressed by the Lac\nrepressor and two well-known sequences that show large flexibility differences\nin vitro, we make precise statistical mechanical predictions as to how DNA\nsequence influences loop formation and test these predictions using in vivo\ntranscription and in vitro single-molecule assays. Surprisingly,\nsequence-dependent flexibility does not affect in vivo gene regulation. By\ntheoretically and experimentally quantifying the relative contributions of\nsequence and the DNA-bending protein HU to DNA mechanical properties, we reveal\nthat bending by HU dominates DNA mechanics and masks intrinsic\nsequence-dependent flexibility. Such a quantitative understanding of how\nmechanical regulatory information is encoded in the genome will be a key step\ntowards a predictive understanding of gene regulation at single-base pair\nresolution.\n", "versions": [{"version": "v1", "created": "Sat, 21 Dec 2013 00:54:31 GMT"}], "update_date": "2013-12-24", "authors_parsed": [["Boedicker", "James Q.", ""], ["Garcia", "Hernan G.", ""], ["Johnson", "Stephanie", ""], ["Phillips", "Rob", ""]]}, {"id": "1312.6321", "submitter": "Bradford Taylor", "authors": "Bradford P. Taylor, Michael H. Cortez, and Joshua S. Weitz", "title": "The virus of my virus is my friend: ecological effects of virophage with\n  alternative modes of coinfection", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Virophages are viruses that rely on the replication machinery of other\nviruses to reproduce within eukaryotic hosts. Two different modes of\ncoinfection have been posited based on experimental observation. In one mode,\nthe virophage and virus enter the host independently. In the other mode, the\nvirophage adheres to the virus so both virophage and virus enter the host\ntogether. Here we ask: what are the ecological effects of these different modes\nof coinfection? In particular, what ecological effects are common to both\ninfection modes, and what are the differences particular to each mode? We\ndevelop a pair of biophysically motivated ODE models of viral-host population\ndynamics, corresponding to dynamics arising from each mode of infection. We\nfind both modes of coinfection allow for the coexistence of the virophage,\nvirus, and host either at a stable fixed point or through cyclical dynamics. In\nboth models, virophage tend to be the most abundant population and their\npresence always reduces the viral abundance and increases the host abundance.\nHowever, we do find qualitative differences between models. For example, via\nextensive sampling of biologically relevant parameter space, we only observe\nbistability when the virophage and virus enter the host together. We discuss\nhow such differences may be leveraged to help identify modes of infection in\nnatural environments from population level data.\n", "versions": [{"version": "v1", "created": "Sat, 21 Dec 2013 23:42:37 GMT"}, {"version": "v2", "created": "Mon, 12 May 2014 16:32:19 GMT"}], "update_date": "2014-05-13", "authors_parsed": [["Taylor", "Bradford P.", ""], ["Cortez", "Michael H.", ""], ["Weitz", "Joshua S.", ""]]}, {"id": "1312.6333", "submitter": "Alastair Jamieson-Lane", "authors": "Alastair Jamieson-Lane and Christoph Hauert", "title": "Fixation probabilities on superstars, revisited and revised", "comments": "29 pages, 4 figures, Major Revision", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Population structures can be crucial determinants of evolutionary processes.\nFor the Moran process on graphs certain structures suppress selective pressure,\nwhile others amplify it (Lieberman et al. 2005 Nature 433 312-316).\nEvolutionary amplifiers suppress random drift and enhance selection. Recently,\nsome results for the most powerful known evolutionary amplifier, the superstar,\nhave been invalidated by a counter example (D\\'iaz et al. 2013 Proc. R. Soc. A\n469 20130193). Here we correct the original proof and derive improved upper and\nlower bounds, which indicate that the fixation probability remains close to\n$1-1/(r^4 H)$ for population size $N\\to\\infty$ and structural parameter\n$H\\gg1$. This correction resolves the differences between the two\naforementioned papers. We also confirm that in the limit $N,H\\to\\infty$\nsuperstars remain capable of eliminating random drift and hence of providing\narbitrarily strong selective advantages to any beneficial mutation. In\naddition, we investigate the robustness of amplification in superstars and find\nthat it appears to be a fragile phenomenon with respect to changes in the\nselection or mutation processes.\n", "versions": [{"version": "v1", "created": "Sun, 22 Dec 2013 02:48:40 GMT"}, {"version": "v2", "created": "Fri, 8 Aug 2014 21:09:04 GMT"}], "update_date": "2014-08-12", "authors_parsed": [["Jamieson-Lane", "Alastair", ""], ["Hauert", "Christoph", ""]]}, {"id": "1312.6450", "submitter": "Sean Anderson", "authors": "Sean C. Anderson, Cole C. Monnahan, Kelli F. Johnson, Kotaro Ono, and\n  Juan L. Valero", "title": "ss3sim: An R package for fisheries stock assessment simulation with\n  Stock Synthesis", "comments": "Accepted at PLOS ONE; corrected the example code", "journal-ref": null, "doi": "10.1371/journal.pone.0092725", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Simulation testing is an important approach to evaluating fishery stock\nassessment methods. In the last decade, the fisheries stock assessment modeling\nframework Stock Synthesis (SS3) has become widely used around the world.\nHowever, there lacks a generalized and scriptable framework for SS3 simulation\ntesting. Here, we introduce ss3sim, an R package that facilitates reproducible,\nflexible, and rapid end-to-end simulation testing with SS3. ss3sim requires an\nexisting SS3 model configuration along with plain-text control files describing\nalternative population dynamics, fishery properties, sampling scenarios, and\nassessment approaches. ss3sim then generates an underlying 'truth' from a\nspecified operating model, samples from that truth, modifies and runs an\nestimation model, and synthesizes the results. The simulations can be run in\nparallel, reducing runtime, and the source code is free to be modified under an\nopen-source MIT license. ss3sim is designed to explore structural differences\nbetween the underlying truth and assumptions of an estimation model, or between\nmultiple estimation model configurations. For example, ss3sim can be used to\nanswer questions about model misspecification, retrospective patterns, and the\nrelative importance of different types of fisheries data. We demonstrate the\nsoftware with an example, discuss how ss3sim complements other simulation\nsoftware, and outline specific research questions that ss3sim could address.\n", "versions": [{"version": "v1", "created": "Mon, 23 Dec 2013 01:05:57 GMT"}, {"version": "v2", "created": "Thu, 6 Feb 2014 18:38:46 GMT"}, {"version": "v3", "created": "Wed, 26 Feb 2014 19:55:13 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Anderson", "Sean C.", ""], ["Monnahan", "Cole C.", ""], ["Johnson", "Kelli F.", ""], ["Ono", "Kotaro", ""], ["Valero", "Juan L.", ""]]}, {"id": "1312.6522", "submitter": "Atahualpa Kraemer", "authors": "Sol\\'orzano Kraemer M\\'onica Morayma and Kraemer Atahualpa S. and\n  Stebner Frauke", "title": "Variations of arthropod biodiversity due to human intervention and\n  climatic variations study of a protected and a non-protected area in a\n  tropical forest", "comments": "This paper has been withdrawn by the authors because the data used\n  for this research have been obtained with other aim and conclusions could be\n  not reliable", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The diversity of the arthropod fauna from the pacific coast in southern\nMexico was investigated in order to study and compare the biodiversity of two\ndifferent regions. One is located within the Biosphere reserve \"La encrucijada\"\nand the second one on the edges of this reserve at a non-protected region. Both\nregions are also ecologically different in terms of humidity and temperature.\nTo collect the material seven different trap methods were used, arthropods were\nclassified at order level, Diptera also at family level and of the Diptera\nfamily Psychodidae, genera were also identified. Twenty-eight orders have been\nidentified, showing some regional differences in composition and abundance. As\na general conclusion we observe that no big statistical differences can be\nobserved at order or family level (only Diptera) between the protected area and\nthe non-protected area. This difference shows an unexpected greater diversity\nin the non-protected area. At genus level (only Psychodidae) however, the\ndiversity of moth flies was slightly greater in the preserved area. We conclude\nthat climatic variations are probably playing an important role at low\nsystematic level (order and family) and that human intervention (e.g.\nagriculture) becomes more important at genus level.\n", "versions": [{"version": "v1", "created": "Mon, 23 Dec 2013 11:26:01 GMT"}, {"version": "v2", "created": "Wed, 30 Apr 2014 23:13:21 GMT"}], "update_date": "2014-05-02", "authors_parsed": [["Morayma", "Solórzano Kraemer Mónica", ""], ["S.", "Kraemer Atahualpa", ""], ["Frauke", "Stebner", ""]]}, {"id": "1312.6639", "submitter": "Iosif Lazaridis", "authors": "Iosif Lazaridis, Nick Patterson, Alissa Mittnik, Gabriel Renaud,\n  Swapan Mallick, Karola Kirsanow, Peter H. Sudmant, Joshua G. Schraiber, Sergi\n  Castellano, Mark Lipson, Bonnie Berger, Christos Economou, Ruth Bollongino,\n  Qiaomei Fu, Kirsten I. Bos, Susanne Nordenfelt, Heng Li, Cesare de Filippo,\n  Kay Pr\\\"ufer, Susanna Sawyer, Cosimo Posth, Wolfgang Haak, Fredrik Hallgren,\n  Elin Fornander, Nadin Rohland, Dominique Delsate, Michael Francken,\n  Jean-Michel Guinet, Joachim Wahl, George Ayodo, Hamza A. Babiker, Graciela\n  Bailliet, Elena Balanovska, Oleg Balanovsky, Ramiro Barrantes, Gabriel\n  Bedoya, Haim Ben-Ami, Judit Bene, Fouad Berrada, Claudio M. Bravi, Francesca\n  Brisighelli, George Busby, Francesco Cali, Mikhail Churnosov, David E. C.\n  Cole, Daniel Corach, Larissa Damba, George van Driem, Stanislav Dryomov,\n  Jean-Michel Dugoujon, Sardana A. Fedorova, Irene Gallego Romero, Marina\n  Gubina, Michael Hammer, Brenna Henn, Tor Hervig, Ugur Hodoglugil, Aashish R.\n  Jha, Sena Karachanak-Yankova, Rita Khusainova, Elza Khusnutdinova, Rick\n  Kittles, Toomas Kivisild, William Klitz, Vaidutis Ku\\v{c}inskas, Alena\n  Kushniarevich, Leila Laredj, Sergey Litvinov, Theologos Loukidis, Robert W.\n  Mahley, B\\'ela Melegh, Ene Metspalu, Julio Molina, Joanna Mountain, Klemetti\n  N\\\"akk\\\"al\\\"aj\\\"arvi, Desislava Nesheva, Thomas Nyambo, Ludmila Osipova,\n  J\\\"uri Parik, Fedor Platonov, Olga Posukh, Valentino Romano, Francisco\n  Rothhammer, Igor Rudan, Ruslan Ruizbakiev, Hovhannes Sahakyan, Antti\n  Sajantila, Antonio Salas, Elena B. Starikovskaya, Ayele Tarekegn, Draga\n  Toncheva, Shahlo Turdikulova, Ingrida Uktveryte, Olga Utevska, Ren\\'e\n  Vasquez, Mercedes Villena, Mikhail Voevoda, Cheryl Winkler, Levon\n  Yepiskoposyan, Pierre Zalloua, Tatijana Zemunik, Alan Cooper, Cristian\n  Capelli, Mark G. Thomas, Andres Ruiz-Linares, Sarah A. Tishkoff, Lalji Singh,\n  Kumarasamy Thangaraj, Richard Villems, David Comas, Rem Sukernik, Mait\n  Metspalu, Matthias Meyer, Evan E. Eichler, Joachim Burger, Montgomery\n  Slatkin, Svante P\\\"a\\\"abo, Janet Kelso, David Reich, Johannes Krause", "title": "Ancient human genomes suggest three ancestral populations for\n  present-day Europeans", "comments": null, "journal-ref": null, "doi": "10.1038/nature13673", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We sequenced genomes from a $\\sim$7,000 year old early farmer from Stuttgart\nin Germany, an $\\sim$8,000 year old hunter-gatherer from Luxembourg, and seven\n$\\sim$8,000 year old hunter-gatherers from southern Sweden. We analyzed these\ndata together with other ancient genomes and 2,345 contemporary humans to show\nthat the great majority of present-day Europeans derive from at least three\nhighly differentiated populations: West European Hunter-Gatherers (WHG), who\ncontributed ancestry to all Europeans but not to Near Easterners; Ancient North\nEurasians (ANE), who were most closely related to Upper Paleolithic Siberians\nand contributed to both Europeans and Near Easterners; and Early European\nFarmers (EEF), who were mainly of Near Eastern origin but also harbored\nWHG-related ancestry. We model these populations' deep relationships and show\nthat EEF had $\\sim$44% ancestry from a \"Basal Eurasian\" lineage that split\nprior to the diversification of all other non-African lineages.\n", "versions": [{"version": "v1", "created": "Mon, 23 Dec 2013 18:47:50 GMT"}, {"version": "v2", "created": "Wed, 2 Apr 2014 02:53:33 GMT"}], "update_date": "2015-06-18", "authors_parsed": [["Lazaridis", "Iosif", ""], ["Patterson", "Nick", ""], ["Mittnik", "Alissa", ""], ["Renaud", "Gabriel", ""], ["Mallick", "Swapan", ""], ["Kirsanow", "Karola", ""], ["Sudmant", "Peter H.", ""], ["Schraiber", "Joshua G.", ""], ["Castellano", "Sergi", ""], ["Lipson", "Mark", ""], ["Berger", "Bonnie", ""], ["Economou", "Christos", ""], ["Bollongino", "Ruth", ""], ["Fu", "Qiaomei", ""], ["Bos", "Kirsten I.", ""], ["Nordenfelt", "Susanne", ""], ["Li", "Heng", ""], ["de Filippo", "Cesare", ""], ["Prüfer", "Kay", ""], ["Sawyer", "Susanna", ""], ["Posth", "Cosimo", ""], ["Haak", "Wolfgang", ""], ["Hallgren", "Fredrik", ""], ["Fornander", "Elin", ""], ["Rohland", "Nadin", ""], ["Delsate", "Dominique", ""], ["Francken", "Michael", ""], ["Guinet", "Jean-Michel", ""], ["Wahl", "Joachim", ""], ["Ayodo", "George", ""], ["Babiker", "Hamza A.", ""], ["Bailliet", "Graciela", ""], ["Balanovska", "Elena", ""], ["Balanovsky", "Oleg", ""], ["Barrantes", "Ramiro", ""], ["Bedoya", "Gabriel", ""], ["Ben-Ami", "Haim", ""], ["Bene", "Judit", ""], ["Berrada", "Fouad", ""], ["Bravi", "Claudio M.", ""], ["Brisighelli", "Francesca", ""], ["Busby", "George", ""], ["Cali", "Francesco", ""], ["Churnosov", "Mikhail", ""], ["Cole", "David E. C.", ""], ["Corach", "Daniel", ""], ["Damba", "Larissa", ""], ["van Driem", "George", ""], ["Dryomov", "Stanislav", ""], ["Dugoujon", "Jean-Michel", ""], ["Fedorova", "Sardana A.", ""], ["Romero", "Irene Gallego", ""], ["Gubina", "Marina", ""], ["Hammer", "Michael", ""], ["Henn", "Brenna", ""], ["Hervig", "Tor", ""], ["Hodoglugil", "Ugur", ""], ["Jha", "Aashish R.", ""], ["Karachanak-Yankova", "Sena", ""], ["Khusainova", "Rita", ""], ["Khusnutdinova", "Elza", ""], ["Kittles", "Rick", ""], ["Kivisild", "Toomas", ""], ["Klitz", "William", ""], ["Kučinskas", "Vaidutis", ""], ["Kushniarevich", "Alena", ""], ["Laredj", "Leila", ""], ["Litvinov", "Sergey", ""], ["Loukidis", "Theologos", ""], ["Mahley", "Robert W.", ""], ["Melegh", "Béla", ""], ["Metspalu", "Ene", ""], ["Molina", "Julio", ""], ["Mountain", "Joanna", ""], ["Näkkäläjärvi", "Klemetti", ""], ["Nesheva", "Desislava", ""], ["Nyambo", "Thomas", ""], ["Osipova", "Ludmila", ""], ["Parik", "Jüri", ""], ["Platonov", "Fedor", ""], ["Posukh", "Olga", ""], ["Romano", "Valentino", ""], ["Rothhammer", "Francisco", ""], ["Rudan", "Igor", ""], ["Ruizbakiev", "Ruslan", ""], ["Sahakyan", "Hovhannes", ""], ["Sajantila", "Antti", ""], ["Salas", "Antonio", ""], ["Starikovskaya", "Elena B.", ""], ["Tarekegn", "Ayele", ""], ["Toncheva", "Draga", ""], ["Turdikulova", "Shahlo", ""], ["Uktveryte", "Ingrida", ""], ["Utevska", "Olga", ""], ["Vasquez", "René", ""], ["Villena", "Mercedes", ""], ["Voevoda", "Mikhail", ""], ["Winkler", "Cheryl", ""], ["Yepiskoposyan", "Levon", ""], ["Zalloua", "Pierre", ""], ["Zemunik", "Tatijana", ""], ["Cooper", "Alan", ""], ["Capelli", "Cristian", ""], ["Thomas", "Mark G.", ""], ["Ruiz-Linares", "Andres", ""], ["Tishkoff", "Sarah A.", ""], ["Singh", "Lalji", ""], ["Thangaraj", "Kumarasamy", ""], ["Villems", "Richard", ""], ["Comas", "David", ""], ["Sukernik", "Rem", ""], ["Metspalu", "Mait", ""], ["Meyer", "Matthias", ""], ["Eichler", "Evan E.", ""], ["Burger", "Joachim", ""], ["Slatkin", "Montgomery", ""], ["Pääbo", "Svante", ""], ["Kelso", "Janet", ""], ["Reich", "David", ""], ["Krause", "Johannes", ""]]}, {"id": "1312.6879", "submitter": "Min Yue", "authors": "Min Yue, Huanchun Chen", "title": "Zoonoses Frontier: Veterinarian, Producer, Processor and Beyond", "comments": "16 pages with 1 figure. science 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As many emerging and re-emerging infectious diseases are associated with food\nanimals, the relationship between available healthy food sources and population\nhealth and social stability has become evident. A recent example of the\nimportance of this relationship was observed during the current flu pandemic.\nThis recent pandemic brought attention to novel target groups of susceptible\npeople at the interface of the animal and human populations. Veterinarians,\nproducers and processors are uniquely exposed to emerging zoonoses. Therefore\nthese individuals may serve as key sentinels and allow efficient evaluation of\nthe effectiveness of zoonoses prophylaxis and control, including evaluation of\nthe cost-effectiveness in the broader view. We also suggest some valuable\napproaches for rapid diagnosis of emerging and re-emerging infectious diseases\nand supportive systemic research which may address related ethical questions.\nWe also highly recommend more research investigations characterizing this\nhuman/animal zoonosis interface, a potentially productive target for emerging\ndisease diagnosis and control.\n", "versions": [{"version": "v1", "created": "Tue, 24 Dec 2013 19:42:25 GMT"}], "update_date": "2013-12-25", "authors_parsed": [["Yue", "Min", ""], ["Chen", "Huanchun", ""]]}, {"id": "1312.7010", "submitter": "Afshin Montakhab", "authors": "Pouya Manshour, Afshin Montakhab", "title": "Contagion spreading on complex networks with local deterministic\n  dynamics", "comments": "18 pages, 6 figures, to appear", "journal-ref": "Commun Nonlinear Sci Numer Simulat 19 (2014) 2414-2422 (ELSEVIER)", "doi": "10.1016/j.cnsns.2013.12.015", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Typically, contagion strength is modeled by a transmission rate $\\lambda$,\nwhereby all nodes in a network are treated uniformly in a mean-field\napproximation. However, local agents react differently to the same contagion\nbased on their local characteristics. Following our recent work [EPL\n\\textbf{99}, 58002 (2012)], we investigate contagion spreading models with\nlocal dynamics on complex networks. We therefore quantify contagions by their\nquality, $0 \\leq \\alpha \\leq 1$, and follow their spreading as their\ntransmission condition (fitness) is evaluated by local agents. We choose\nvarious deterministic local rules. Initial spreading with exponential\nquality-dependent time scales is followed by a stationary state with a\nprevalence depending on the quality of the contagion. We also observe various\ninteresting phenomena, for example, high prevalence without the participation\nof the hubs. This is in sharp contrast with the general belief that hubs play a\ncentral role in a typical spreading process. We further study the role of\nnetwork topology in various models and find that as long as small-world effect\nexists, the underlying topology does not contribute to the final stationary\nstate but only affects the initial spreading velocity.\n", "versions": [{"version": "v1", "created": "Wed, 25 Dec 2013 19:43:42 GMT"}], "update_date": "2014-01-28", "authors_parsed": [["Manshour", "Pouya", ""], ["Montakhab", "Afshin", ""]]}, {"id": "1312.7111", "submitter": "Michael Tress", "authors": "Iakes Ezkurdia, David Juan, Jose Manuel Rodriguez, Adam Frankish, Mark\n  Diekhans, Jennifer Harrow, Jesus Vazquez, Alfonso Valencia, Michael L. Tress", "title": "The shrinking human protein coding complement: are there now fewer than\n  20,000 genes?", "comments": "Main article 34 pages, 1 1/2 spaced, five figures, one table.\n  Supplementary info, 13 pages, 10 figures Update no 1: Version 4: small change\n  in numbers between version 1 and 2 was because we removed the pseudoautosomal\n  genes. The number 11,838 in version 2 is a typo", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.GN q-bio.MN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Determining the full complement of protein-coding genes is a key goal of\ngenome annotation. The most powerful approach for confirming protein coding\npotential is the detection of cellular protein expression through peptide mass\nspectrometry experiments. Here we map the peptides detected in 7 large-scale\nproteomics studies to almost 60% of the protein coding genes in the GENCODE\nannotation the human genome. We find that conservation across vertebrate\nspecies and the age of the gene family are key indicators of whether a peptide\nwill be detected in proteomics experiments. We find peptides for most highly\nconserved genes and for practically all genes that evolved before bilateria. At\nthe same time there is almost no evidence of protein expression for genes that\nhave appeared since primates, or for genes that do not have any protein-like\nfeatures or cross-species conservation. We identify 19 non-protein-like\nfeatures such as weak conservation, no protein features or ambiguous\nannotations in major databases that are indicators of low peptide detection\nrates. We use these features to describe a set of 2,001 genes that are\npotentially non-coding, and show that many of these genes behave more like\nnon-coding genes than protein-coding genes. We detect peptides for just 3% of\nthese genes. We suggest that many of these 2,001 genes do not code for proteins\nunder normal circumstances and that they should not be included in the human\nprotein coding gene catalogue. These potential non-coding genes will be revised\nas part of the ongoing human genome annotation effort.\n", "versions": [{"version": "v1", "created": "Thu, 26 Dec 2013 14:22:23 GMT"}, {"version": "v2", "created": "Wed, 1 Jan 2014 21:20:56 GMT"}, {"version": "v3", "created": "Thu, 23 Jan 2014 12:59:37 GMT"}, {"version": "v4", "created": "Tue, 11 Feb 2014 19:23:44 GMT"}], "update_date": "2014-02-12", "authors_parsed": [["Ezkurdia", "Iakes", ""], ["Juan", "David", ""], ["Rodriguez", "Jose Manuel", ""], ["Frankish", "Adam", ""], ["Diekhans", "Mark", ""], ["Harrow", "Jennifer", ""], ["Vazquez", "Jesus", ""], ["Valencia", "Alfonso", ""], ["Tress", "Michael L.", ""]]}, {"id": "1312.7331", "submitter": "Ziv Williams", "authors": "Ziv M Williams", "title": "Trans-generational effect of trained aversive and appetitive experiences\n  in Drosophila", "comments": "11 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Associative learning allows animals to rapidly adapt to changes in the\nenvironment. Whether and what aspects of such acquired traits may be\ntransmittable across generations remains unclear. Using prolonged olfactory\ntraining and subsequent two-forced choice testing in Drosophila melanogaster,\nit is observed that certain aspects of learned behavior were transmitted from\nparents to offspring. Offspring of parents exposed to distinct odors during\nboth aversive and appetitive conditioning displayed a heightened sensitivity to\nthose same odors. The conditioned responses associated with those odors,\nhowever, were not transmitted to the offspring as they displayed a constitutive\npreference to the parent-exposed stimuli irrespective of whether they were\nassociated with aversive or appetitive training. Moreover, the degree to which\nthe offspring preferred the conditioned stimuli markedly varied from\nodor-to-odor. These findings suggest that heightened sensitivities to certain\nsalient stimuli in the environment, but not their associated conditioned\nbehaviors, may be transmittable from parents to offspring. Such\ntrans-generational adaptations may influence animal traits over short\nevolutionary time-scales.\n", "versions": [{"version": "v1", "created": "Fri, 27 Dec 2013 20:22:23 GMT"}], "update_date": "2013-12-30", "authors_parsed": [["Williams", "Ziv M", ""]]}, {"id": "1312.7337", "submitter": "Jagdish Ramakrishnan", "authors": "Hamidreza Badri, Jagdish Ramakrishnan, and Kevin Leder", "title": "Minimizing Metastatic Risk in Radiotherapy Fractionation Schedules", "comments": "12 pages, 3 figures, 2 tables", "journal-ref": "Physics in Medicine and Biology, 2015", "doi": "10.1088/0031-9155/60/22/N405", "report-no": null, "categories": "q-bio.TO physics.med-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metastasis is the process by which cells from a primary tumor disperse and\nform new tumors at distant anatomical locations. The treatment and prevention\nof metastatic cancer remains an extremely challenging problem. This work\nintroduces a novel biologically motivated objective function to the radiation\noptimization community that takes into account metastatic risk instead of the\nstatus of the primary tumor. In this work, we consider the problem of\ndeveloping fractionated irradiation schedules that minimize production of\nmetastatic cancer cells while keeping normal tissue damage below an acceptable\nlevel. A dynamic programming framework is utilized to determine the optimal\nfractionation scheme. We evaluated our approach on a breast cancer case using\nthe heart and the lung as organs-at-risk (OAR). For small tumor $\\alpha/\\beta$\nvalues, hypo-fractionated schedules were optimal, which is consistent with\nstandard models. However, for relatively larger $\\alpha/\\beta$ values, we found\nthe type of schedule depended on various parameters such as the time when\nmetastatic risk was evaluated, the $\\alpha/\\beta$ values of the OARs, and the\nnormal tissue sparing factors. Interestingly, in contrast to standard models,\nhypo-fractionated and semi-hypo-fractionated schedules (large initial doses\nwith doses tapering off with time) were suggested even with large tumor\n$\\alpha$/$\\beta$ values. Numerical results indicate potential for significant\nreduction in metastatic risk.\n", "versions": [{"version": "v1", "created": "Fri, 27 Dec 2013 20:54:45 GMT"}, {"version": "v2", "created": "Mon, 6 Jul 2015 04:44:01 GMT"}, {"version": "v3", "created": "Tue, 17 Nov 2015 06:30:31 GMT"}], "update_date": "2015-11-18", "authors_parsed": [["Badri", "Hamidreza", ""], ["Ramakrishnan", "Jagdish", ""], ["Leder", "Kevin", ""]]}, {"id": "1312.7653", "submitter": "Anastasia Kalinina", "authors": "Sergey Pirogov, Aleksandre Rybko, Anastasia Kalinina, Mikhail Gelfand", "title": "Recombination processes and non-linear Markov chains", "comments": "modified Intro", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bacteria are known to exchange genetic information by horizontal gene\ntransfer. Since the frequency of homologous recombination depends on the\nsimilarity of recombining segments, several studies examined whether this could\nlead to the emergence of subspecies. Most of them used simulations of fixed\nsize Wright-Fisher populations, in which the genetic drift should be taken into\naccount. Here, we use non-linear Markov chains to describe a bacterial\npopulation evolving under mutation and recombination processes. We consider a\npopulation as a space of genomes and a probability measure on it. Thus, the\ngenetic drift is not assumed. We prove that under these conditions the\nemergence of subspecies is impossible, so the genetic drift is a necessary\ndriving force of bacterial speciation.\n", "versions": [{"version": "v1", "created": "Mon, 30 Dec 2013 09:03:45 GMT"}, {"version": "v2", "created": "Sat, 20 Dec 2014 14:59:59 GMT"}, {"version": "v3", "created": "Mon, 8 Jun 2015 07:06:37 GMT"}], "update_date": "2015-06-09", "authors_parsed": [["Pirogov", "Sergey", ""], ["Rybko", "Aleksandre", ""], ["Kalinina", "Anastasia", ""], ["Gelfand", "Mikhail", ""]]}, {"id": "1312.7749", "submitter": "Peter Waddell", "authors": "Peter J. Waddell", "title": "Happy New Year Homo erectus? More evidence for interbreeding with\n  archaics predating the modern human/Neanderthal split", "comments": "29 pages, 10 figures, 6 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A range of a priori hypotheses about the evolution of modern and archaic\ngenomes are further evaluated and tested. In addition to the well-known\nsplits/introgressions involving Neanderthal genes into out-of- Africa people,\nor Denisovan genes into Oceanians, a further series of archaic splits and\nhypotheses proposed in Waddell et al. (2011) are considered in detail. These\ninclude signals of Denisovans with something markedly more archaic and possibly\nsomething more archaic into Papuans as well. These are compared and contrasted\nwith some well-advertised introgressions such as Denisovan genes across East\nAsia, archaic genes into San or non-tree mixing between Oceanians, East Asians\nand Europeans. The general result is that these less appreciated and surprising\narchaic splits have just as much or more support in genome sequence data.\nFurther, evaluation confirms the hypothesis that archaic genes are much rarer\non modern X chromosomes, and may even be near totally absent, suggesting strong\nselection against their introgression. Modeling of relative split weights\nallows an inference of the proportion of the genome the Denisovan seems to have\ngotten from an older archaic, and the best estimate is around 2%. Using a mix\nof quantitative and qualitative morphological data and novel phylogenetic\nmethods, robust support is found for multiple distinct middle Pleistocene\nlineages. Of these, fossil hominids such as SH5, Petralona, and Dali, in\nparticular, look like prime candidates for contributing pre-Neanderthal/Modern\narchaic genes to Denisovans, while the Jinniu-Shan fossil looks like the best\ncandidate for a close relative of the Denisovan. That the Papuans might have\nreceived some truly archaic genes appears a good possibility and they might\neven be from Homo erectus.\n", "versions": [{"version": "v1", "created": "Mon, 30 Dec 2013 15:53:42 GMT"}], "update_date": "2013-12-31", "authors_parsed": [["Waddell", "Peter J.", ""]]}]