[{"id": "1412.0199", "submitter": "Axel G. Rossberg", "authors": "Adrian Farcas and Axel G. Rossberg", "title": "Maximum sustainable yield from interacting fish stocks in an uncertain\n  world: two policy choices and underlying trade-offs", "comments": "21 pages, 1 figure, 2 tables, plus supplementary material\n  (substantial textual revision of v5)", "journal-ref": null, "doi": "10.1093/icesjms/fsw113", "report-no": null, "categories": "q-bio.PE nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The case of fisheries management illustrates how the inherent structural\ninstability of ecosystems can have deep-running policy implications. We\ncontrast ten types of management plans to achieve maximum sustainable yields\n(MSY) from multiple stocks and compare their effectiveness based on a\nmanagement strategy evaluation (MSE) that uses complex food webs in its\noperating model. Plans that target specific stock sizes ($B_{\\text{MSY}}$)\nconsistently led to higher yields than plans targeting specific fishing\npressures ($F_{\\text{MSY}}$). A new self-optimising control rule, introduced\nhere for its robustness to structural instability, led to intermediate yields.\nMost plans outperformed single-species management plans with pressure targets\nset without considering multispecies interactions. However, more refined plans\nto \"maximise the yield from each stock separately\", in the sense of a Nash\nequilibrium, produced total yields comparable to plans aiming to maximise total\nharvested biomass, and were more robust to structural instability. Our analyses\nhighlight trade-offs between yields, amenability to negotiations, pressures on\nbiodiversity, and continuity with current approaches in the European context.\nBased on these results, we recommend directions for developments of EU\nfisheries policy.\n", "versions": [{"version": "v1", "created": "Sun, 30 Nov 2014 09:50:08 GMT"}, {"version": "v2", "created": "Thu, 11 Dec 2014 16:43:28 GMT"}, {"version": "v3", "created": "Mon, 12 Jan 2015 10:03:37 GMT"}, {"version": "v4", "created": "Sat, 26 Dec 2015 16:50:55 GMT"}, {"version": "v5", "created": "Fri, 29 Apr 2016 20:35:30 GMT"}, {"version": "v6", "created": "Tue, 31 May 2016 08:04:02 GMT"}], "update_date": "2016-10-04", "authors_parsed": [["Farcas", "Adrian", ""], ["Rossberg", "Axel G.", ""]]}, {"id": "1412.0528", "submitter": "Delfim F. M. Torres", "authors": "Roman Denysiuk, Cristiana J. Silva, Delfim F. M. Torres", "title": "Multiobjective approach to optimal control for a tuberculosis model", "comments": "This is a preprint of a paper whose final and definite form will be\n  published in Optimization Methods and Software, ISSN 1055-6788 (Print),\n  1029-4937 (Online). Submitted 09-May-2014; revised 19-Oct-2014; accepted\n  30-Nov-2014. arXiv admin note: text overlap with arXiv:1305.2145", "journal-ref": "Optim. Methods Softw. 30 (2015), no. 5, 893--910", "doi": "10.1080/10556788.2014.994704", "report-no": null, "categories": "math.OC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical modelling can help to explain the nature and dynamics of\ninfection transmissions, as well as support a policy for implementing those\nstrategies that are most likely to bring public health and economic benefits.\nThe paper addresses the application of optimal control strategies in a\ntuberculosis model. The model consists of a system of ordinary differential\nequations, which considers reinfection and post-exposure interventions. We\npropose a multiobjective optimization approach to find optimal control\nstrategies for the minimization of active infectious and persistent latent\nindividuals, as well as the cost associated to the implementation of the\ncontrol strategies. Optimal control strategies are investigated for different\nvalues of the model parameters. The obtained numerical results cover a whole\nrange of the optimal control strategies, providing valuable information about\nthe tuberculosis dynamics and showing the usefulness of the proposed approach.\n", "versions": [{"version": "v1", "created": "Mon, 1 Dec 2014 16:20:52 GMT"}], "update_date": "2015-09-01", "authors_parsed": [["Denysiuk", "Roman", ""], ["Silva", "Cristiana J.", ""], ["Torres", "Delfim F. M.", ""]]}, {"id": "1412.0709", "submitter": "Cameron Smith", "authors": "Cameron Smith, Raymond S. Puzio, Aviv Bergman", "title": "Hierarchical Network Structure Promotes Dynamical Robustness", "comments": "23 pages, 9 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE nlin.CD physics.data-an q-bio.MN", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The relationship between network topology and system dynamics has significant\nimplications for unifying our understanding of the interplay among metabolic,\ngene-regulatory, and ecosystem network architecures. Here we analyze the\nstability and robustness of a large class of dynamics on such networks. We\ndetermine the probability distribution of robustness as a function of network\ntopology and show that robustness is classified by the number of links between\nmodules of the network. We also demonstrate that permutation of these modules\nis a fundamental symmetry of dynamical robustness. Analysis of these findings\nleads to the conclusion that the most robust systems have the most hierarchical\nstructure. This relationship provides a means by which evolutionary selection\nfor a purely dynamical phenomenon may shape network architectures across scales\nof the biological hierarchy.\n", "versions": [{"version": "v1", "created": "Mon, 1 Dec 2014 22:24:44 GMT"}, {"version": "v2", "created": "Tue, 16 Jun 2015 04:46:06 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Smith", "Cameron", ""], ["Puzio", "Raymond S.", ""], ["Bergman", "Aviv", ""]]}, {"id": "1412.0719", "submitter": "Ross McVinish", "authors": "R. McVinish, P.K. Pollett and Y.S. Chan", "title": "A metapopulation model with Markovian landscape dynamics", "comments": "This manuscript version is made available under the CC-BY-NC-ND 4.0\n  license http://creativecommons.org/licenses/by-nc-nd/4.0/", "journal-ref": "Theoretical Population Biology (2016) 112, 80-96", "doi": "10.1016/j.tpb.2016.08.005", "report-no": null, "categories": "math.PR q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a variant of Hanski's incidence function model that allows habitat\npatch characteristics to vary over time following a Markov process. The widely\nstudied case where patches are classified as either suitable or unsuitable is\nincluded as a special case. For large metapopulations, we determine a recursion\nfor the probability that a given habitat patch is occupied. This recursion\nenables us to clarify the role of landscape dynamics in the survival of a\nmetapopulation. In particular, we show that landscape dynamics affects the\npersistence and equilibrium level of the metapopulation primarily through its\neffect on the distribution of a local population's life span.\n", "versions": [{"version": "v1", "created": "Mon, 1 Dec 2014 22:55:30 GMT"}, {"version": "v2", "created": "Tue, 13 Sep 2016 23:36:59 GMT"}], "update_date": "2016-09-15", "authors_parsed": [["McVinish", "R.", ""], ["Pollett", "P. K.", ""], ["Chan", "Y. S.", ""]]}, {"id": "1412.0780", "submitter": "Zahra Aminzare", "authors": "Jana L. Gevertz, Zahra Aminzare, Kerri-Ann Norton, Judith\n  Perez-Velazquez, Alexandria Volkening, Katarzyna A. Rejniak", "title": "Emergence of Anti-Cancer Drug Resistance: Exploring the Importance of\n  the Microenvironmental Niche via a Spatial Model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Practically, all chemotherapeutic agents lead to drug resistance. Clinically,\nit is a challenge to determine whether resistance arises prior to, or as a\nresult of, cancer therapy. Further, a number of different intracellular and\nmicroenvironmental factors have been correlated with the emergence of drug\nresistance. With the goal of better understanding drug resistance and its\nconnection with the tumor microenvironment, we have developed a hybrid\ndiscrete-continuous mathematical model. In this model, cancer cells described\nthrough a particle-spring approach respond to dynamically changing oxygen and\nDNA damaging drug concentrations described through partial differential\nequations. We thoroughly explored the behavior of our self-calibrated model\nunder the following common conditions: a fixed layout of the vasculature, an\nidentical initial configuration of cancer cells, the same mechanism of drug\naction, and one mechanism of cellular response to the drug. We considered one\nset of simulations in which drug resistance existed prior to the start of\ntreatment, and another set in which drug resistance is acquired in response to\ntreatment. This allows us to compare how both kinds of resistance influence the\nspatial and temporal dynamics of the developing tumor, and its clonal\ndiversity. We show that both pre-existing and acquired resistance can give rise\nto three biologically distinct parameter regimes: successful tumor eradication,\nreduced effectiveness of drug during the course of treatment (resistance), and\ncomplete treatment failure.\n", "versions": [{"version": "v1", "created": "Tue, 2 Dec 2014 04:17:38 GMT"}], "update_date": "2014-12-03", "authors_parsed": [["Gevertz", "Jana L.", ""], ["Aminzare", "Zahra", ""], ["Norton", "Kerri-Ann", ""], ["Perez-Velazquez", "Judith", ""], ["Volkening", "Alexandria", ""], ["Rejniak", "Katarzyna A.", ""]]}, {"id": "1412.0968", "submitter": "Aaron King", "authors": "Aaron A. King, Matthieu Domenech de Cell\\`es, Felicia M. G. Magpantay,\n  and Pejman Rohani", "title": "Avoidable errors in the modeling of outbreaks of emerging pathogens,\n  with special reference to Ebola", "comments": "40 pages, 11 figures, 2 tables. Published by Proceedings of the Royal\n  Society of London, Series. Published online 1 April 2015", "journal-ref": "Proceedings of the Royal Society of London. Series B 282:\n  20150347, 2015", "doi": "10.1098/rspb.2015.0347", "report-no": null, "categories": "q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As an emergent infectious disease outbreak unfolds, public health response is\nreliant on information on key epidemiological quantities, such as transmission\npotential and serial interval. Increasingly, transmission models fit to\nincidence data are used to estimate these parameters and guide policy. Some\nwidely-used modeling practices lead to potentially large errors in parameter\nestimates and, consequently, errors in model-based forecasts. Even more\nworryingly, in such situations, confidence in parameter estimates and forecasts\ncan itself be far over-estimated, leading to the potential for large errors\nthat mask their own presence. Fortunately, straightforward and computationally\ninexpensive alternatives exist that avoid these problems. Here, we first use a\nsimulation study to demonstrate potential pitfalls of the standard practice of\nfitting deterministic models to cumulative incidence data. Next, we demonstrate\nan alternative based on stochastic models fit to raw data from an early phase\nof 2014 West Africa Ebola Virus Disease outbreak. We show not only that bias is\nthereby reduced, but that uncertainty in estimates and forecasts is better\nquantified and that, critically, lack of model fit is more readily diagnosed.\nWe conclude with a short list of principles to guide the modeling response to\nfuture infectious disease outbreaks.\n", "versions": [{"version": "v1", "created": "Tue, 2 Dec 2014 16:39:42 GMT"}, {"version": "v2", "created": "Fri, 13 Feb 2015 17:57:15 GMT"}, {"version": "v3", "created": "Mon, 16 Feb 2015 02:12:31 GMT"}, {"version": "v4", "created": "Tue, 3 Mar 2015 21:19:02 GMT"}, {"version": "v5", "created": "Wed, 1 Apr 2015 12:07:35 GMT"}], "update_date": "2015-06-29", "authors_parsed": [["King", "Aaron A.", ""], ["de Cellès", "Matthieu Domenech", ""], ["Magpantay", "Felicia M. G.", ""], ["Rohani", "Pejman", ""]]}, {"id": "1412.1006", "submitter": "Ivan Sudakov", "authors": "I. Sudakov, S.A. Vakulenko, D. Kirievskaya, K.M. Golden", "title": "Large ecosystems in transition: bifurcations and mass extinction", "comments": null, "journal-ref": "Ecological Complexity, 2017", "doi": "10.1016/j.ecocom.2017.01.002", "report-no": null, "categories": "q-bio.PE nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a model of multispecies populations surviving on distributed\nresources. System dynamics are investigated under changes in abiotic factors\nsuch as the climate, as parameterized through environmental temperature. In\nparticular, we introduce a feedback between species abundances and resources\nvia abiotic factors. This model is apparently the first of its kind to include\na feedback mechanism coupling climate and population dynamics. Moreover, we\ntake into account self-limitation effects. The model explains the coexistence\nof many species, yet also displays the possibility of catastrophic\nbifurcations, where all species become extinct under the influence of abiotic\nfactors. We show that as these factors change there are different regimes of\necosystem behavior, including a possibly chaotic regime when abiotic influences\nare sufficiently strong.\n", "versions": [{"version": "v1", "created": "Tue, 2 Dec 2014 18:31:07 GMT"}, {"version": "v2", "created": "Tue, 24 Feb 2015 02:43:36 GMT"}, {"version": "v3", "created": "Sun, 8 Jan 2017 06:36:25 GMT"}], "update_date": "2017-10-25", "authors_parsed": [["Sudakov", "I.", ""], ["Vakulenko", "S. A.", ""], ["Kirievskaya", "D.", ""], ["Golden", "K. M.", ""]]}, {"id": "1412.1025", "submitter": "Nico Franz", "authors": "Nico M. Franz, Naomi M. Pier, DeAnn M. Reeder, Mingmin Chen, Shizhuo\n  Yu, Parisa Kianmajd, Shawn Bowers, Bertram Ludaescher", "title": "Taxonomic Provenance: Two Influential Primate Classifications Logically\n  Aligned", "comments": "Partial manuscript; figures down-sampled", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Classification standards such as the Mammal Species of the World (MSW) aim to\nunify name usages at the global scale, but may nevertheless experience\nsignificant levels of taxonomic change from one edition to the next. This\ncircumstance challenges the biodiversity and phylogenetic data communities to\ndevelop more granular identifiers to track taxonomic congruence and\nincongruence in ways that both humans and machines can process, i.e., to\nlogically represent taxonomic provenance across multiple classification\nhierarchies. Here we show that reasoning over taxonomic provenance is feasible\nfor two classifications of primates corresponding to the second and third MSW\neditions. Our approach entails three main components: (1) individuation of name\nusages as taxonomic concepts, (2) articulation of concepts via human-asserted\nRegion Connection Calculus (RCC-5) relationships, and (3) the use of an Answer\nSet Programming toolkit to infer and visualize logically consistent alignments\nof these taxonomic input constraints. Our use case entails the Primates sec.\nGroves (1993; MSW2 - 317 taxonomic concepts; 233 at the species level) and\nPrimates sec. Groves (2005; MSW3 - 483 taxonomic concepts; 376 at the species\nlevel). Using 402 concept-to-concept input articulations, the reasoning process\nyields a single, consistent alignment, and infers 153,111 Maximally Informative\nRelations that constitute a comprehensive provenance resolution map for every\nconcept pair in the Primates sec. MSW2/MSW3. The entire alignment and various\npartitions facilitate quantitative analyses of name/meaning dissociation,\nrevealing that approximately one in three paired name usages across treatments\nis not reliable - in the sense of the same name identifying congruent taxonomic\nmeanings. We conclude with an optimistic outlook for logic-based provenance\ntools in next-generation biodiversity and phylogeny data platforms.\n", "versions": [{"version": "v1", "created": "Tue, 2 Dec 2014 19:08:25 GMT"}, {"version": "v2", "created": "Tue, 9 Dec 2014 16:19:06 GMT"}], "update_date": "2014-12-12", "authors_parsed": [["Franz", "Nico M.", ""], ["Pier", "Naomi M.", ""], ["Reeder", "DeAnn M.", ""], ["Chen", "Mingmin", ""], ["Yu", "Shizhuo", ""], ["Kianmajd", "Parisa", ""], ["Bowers", "Shawn", ""], ["Ludaescher", "Bertram", ""]]}, {"id": "1412.1066", "submitter": "Jorge Hidalgo", "authors": "Jorge Hidalgo, Simone Pigolotti and Miguel A. Munoz", "title": "Stochasticity enhances the gaining of bet-hedging strategies in\n  contact-process-like dynamics", "comments": "10 pages, 8 figures", "journal-ref": "Physical Review E 91, 032114 (2015)", "doi": "10.1103/PhysRevE.91.032114", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In biology and ecology, individuals or communities of individuals living in\nunpredictable environments often alternate between different evolutionary\nstrategies to spread and reduce risks. Such behavior is commonly referred to as\n\"bet-hedging.\" Long-term survival probabilities and population sizes can be\nmuch enhanced by exploiting such hybrid strategies. Here, we study the simplest\npossible birth-death stochastic model in which individuals can choose among a\npoor but safe strategy, a better but risky alternative, or a combination of\nboth. We show analytically and computationally that the benefits derived from\nbet-hedging strategies are much stronger for higher environmental variabilities\n(large external noise) and/or for small spatial dimensions (large intrinsic\nnoise). These circumstances are typically encountered by living systems, thus\nproviding us with a possible justification for the ubiquitousness of\nbet-hedging in nature.\n", "versions": [{"version": "v1", "created": "Mon, 1 Dec 2014 16:45:58 GMT"}, {"version": "v2", "created": "Tue, 10 Mar 2015 18:51:41 GMT"}], "update_date": "2015-03-11", "authors_parsed": [["Hidalgo", "Jorge", ""], ["Pigolotti", "Simone", ""], ["Munoz", "Miguel A.", ""]]}, {"id": "1412.1243", "submitter": "Willy Rodr\\'iguez", "authors": "Olivier Mazet, Willy Rodr\\'iguez, Loun\\`es Chikhi", "title": "Demographic inference using genetic data from a single individual:\n  separating population size variation from population structure", "comments": "40 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The rapid development of sequencing technologies represents new opportunities\nfor population genetics research. It is expected that genomic data will\nincrease our ability to reconstruct the history of populations. While this\nincrease in genetic information will likely help biologists and anthropologists\nto reconstruct the demographic history of populations, it also represents new\nchallenges. Recent work has shown that structured populations generate signals\nof population size change. As a consequence it is often difficult to determine\nwhether demographic events such as expansions or contractions (bottlenecks)\ninferred from genetic data are real or due to the fact that populations are\nstructured in nature. Given that few inferential methods allow us to account\nfor that structure, and that genomic data will necessarily increase the\nprecision of parameter estimates, it is important to develop new approaches. In\nthe present study we analyse two demographic models. The first is a model of\ninstantaneous population size change whereas the second is the classical\nsymmetric island model. We (i) re-derive the distribution of coalescence times\nunder the two models for a sample of size two, (ii) use a maximum likelihood\napproach to estimate the parameters of these models (iii) validate this\nestimation procedure under a wide array of parameter combinations, (iv)\nimplement and validate a model choice procedure by using a Kolmogorov-Smirnov\ntest. Altogether we show that it is possible to estimate parameters under\nseveral models and perform efficient model choice using genetic data from a\nsingle diploid individual.\n", "versions": [{"version": "v1", "created": "Wed, 3 Dec 2014 09:28:29 GMT"}], "update_date": "2014-12-04", "authors_parsed": [["Mazet", "Olivier", ""], ["Rodríguez", "Willy", ""], ["Chikhi", "Lounès", ""]]}, {"id": "1412.1285", "submitter": "Steven Frank", "authors": "Steven A. Frank", "title": "The inductive theory of natural selection: summary and synthesis", "comments": "Version 2: Changed title. Noted that condensed and simplified version\n  of this manuscript will be published as book chapter with original title \"The\n  inductive theory of natural selection.\" See footnote on title page of pdf", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.NE physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The theory of natural selection has two forms. Deductive theory describes how\npopulations change over time. One starts with an initial population and some\nrules for change. From those assumptions, one calculates the future state of\nthe population. Deductive theory predicts how populations adapt to\nenvironmental challenge. Inductive theory describes the causes of change in\npopulations. One starts with a given amount of change. One then assigns\ndifferent parts of the total change to particular causes. Inductive theory\nanalyzes alternative causal models for how populations have adapted to\nenvironmental challenge. This chapter emphasizes the inductive analysis of\ncause.\n", "versions": [{"version": "v1", "created": "Wed, 3 Dec 2014 11:49:52 GMT"}, {"version": "v2", "created": "Sat, 12 Nov 2016 23:21:25 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Frank", "Steven A.", ""]]}, {"id": "1412.1449", "submitter": "Bernard Ycart", "authors": "Agn\\`es Hamon (LJK), Marie Tosolini (CRCT), Bernard Ycart (LJK), Pont\n  Fr\\'ed\\'eric (CRCT), Jean-Jacques Fourni\\'e (CRCT)", "title": "Simultaneous growth of two cancer cell lines evidences variability in\n  growth rates", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cancer cells co-cultured in vitro reveal unexpected differential growth rates\nthat classical exponential growth models cannot account for. Two\nnon-interacting cell lines were grown in the same culture, and counts of each\nspecies were recorded at periodic times. The relative growth of population\nratios was found to depend on the initial proportion, in contradiction with the\ntraditional exponential growth model. The proposed explanation is the\nvariability of growth rates for clones inside the same cell line. This leads to\na log-quadratic growth model that provides both a theoretical explanation to\nthe phenomenon that was observed, and a better fit to our growth data.\n", "versions": [{"version": "v1", "created": "Tue, 7 Oct 2014 05:50:54 GMT"}], "update_date": "2014-12-04", "authors_parsed": [["Hamon", "Agnès", "", "LJK"], ["Tosolini", "Marie", "", "CRCT"], ["Ycart", "Bernard", "", "LJK"], ["Frédéric", "Pont", "", "CRCT"], ["Fournié", "Jean-Jacques", "", "CRCT"]]}, {"id": "1412.1525", "submitter": "Jeremy Sumner", "authors": "Michael D. Woodhams, Jes\\'us Fern\\'andez-S\\'anchez, and Jeremy G.\n  Sumner", "title": "A new hierarchy of phylogenetic models consistent with heterogeneous\n  substitution rates", "comments": "20 pages. Supplementary files available via email", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When the process underlying DNA substitutions varies across evolutionary\nhistory, the standard Markov models underlying standard phylogenetic methods\nare mathematically inconsistent. The most prominent example is the general time\nreversible model (GTR) together with some, but not all, of its submodels. To\nrectify this deficiency, Lie Markov models have been developed as the class of\nmodels that are consistent in the face of a changing process of DNA\nsubstitutions. Some well-known models in popular use are within this class, but\nare either overly simplistic (e.g. the Kimura two-parameter model) or overly\ncomplex (the general Markov model). On a diverse set of biological data sets,\nwe test a hierarchy of Lie Markov models spanning the full range of parameter\nrichness. Compared against the benchmark of the ever-popular GTR model, we find\nthat as a whole the Lie Markov models perform remarkably well, with the best\nperforming models having eight parameters and the ability to recognise the\ndistinction between purines and pyrimidines.\n", "versions": [{"version": "v1", "created": "Thu, 4 Dec 2014 00:43:03 GMT"}], "update_date": "2014-12-05", "authors_parsed": [["Woodhams", "Michael D.", ""], ["Fernández-Sánchez", "Jesús", ""], ["Sumner", "Jeremy G.", ""]]}, {"id": "1412.1579", "submitter": "Musa Mammadov", "authors": "Robin J. Evans and Musa Mammadov", "title": "Dynamics of Ebola epidemics in West Africa 2014", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the dynamics of Ebola virus transmission in West\nAfrica during 2014. The reproduction numbers for the total period of epidemic\nand for different consequent time intervals are estimated based on a newly\nsuggested linear model. It contains one major variable - the average time of\ninfectiousness (time from onset to hospitalization) that is considered as a\nparameter for controlling the future dynamics of epidemics.\n  Numerical implementations are carried out on data collected from three\ncountries Guinea, Sierra Leone and Liberia as well as the total data collected\nworldwide. Predictions are provided by considering different scenarios\ninvolving the average times of infectiousness for the next few months and the\nend of the current epidemic is estimated according to each scenario.\n", "versions": [{"version": "v1", "created": "Thu, 4 Dec 2014 08:05:47 GMT"}, {"version": "v2", "created": "Tue, 9 Dec 2014 04:13:47 GMT"}], "update_date": "2014-12-10", "authors_parsed": [["Evans", "Robin J.", ""], ["Mammadov", "Musa", ""]]}, {"id": "1412.1640", "submitter": "Bur\\c{c}in Danac{\\i}", "authors": "Bur\\c{c}in Danac{\\i} and Ay\\c{s}e Erzan", "title": "Metanetworks of artificially evolved regulatory networks", "comments": "15 pages, 27 figures", "journal-ref": null, "doi": "10.1088/1742-5468/2016/04/043501", "report-no": null, "categories": "physics.bio-ph physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study metanetworks arising in genotype and phenotype spaces, in the\ncontext of a model population of Boolean graphs evolved under selection for\nshort dynamical attractors. We define the adjacency matrix of a graph as its\ngenotype, which gets mutated in the course of evolution, while its phenotype is\nits set of dynamical attractors. Metanetworks in the genotype and phenotype\nspaces are formed, respectively, by genetic proximity and by phenotypic\nsimilarity, the latter weighted by the sizes of the basins of attraction of the\nshared attractors. We find that populations of evolved networks form giant\nclusters in genotype space, have Poissonian degree distributions but exhibit\nhierarchically organized $\\kappa$-core decompositions. Nevertheless, at large\nscales, they form tree-like expander graphs. Random populations of Boolean\ngraphs are typically so far removed from each other genetically that they\ncannot form a metanetwork. In phenotype space, the metanetworks of evolved\npopulations are super robust both under the elimination of weak connections and\nrandom removal of nodes.\n", "versions": [{"version": "v1", "created": "Thu, 4 Dec 2014 12:21:17 GMT"}, {"version": "v2", "created": "Fri, 19 Jun 2015 11:51:10 GMT"}], "update_date": "2016-09-06", "authors_parsed": [["Danacı", "Burçin", ""], ["Erzan", "Ayşe", ""]]}, {"id": "1412.1729", "submitter": "Jorge Pe\\~na", "authors": "Jorge Pe\\~na, Georg N\\\"oldeke, Laurent Lehmann", "title": "Relatedness and synergies of kind and scale in the evolution of helping", "comments": "38 pages, 2 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Relatedness and synergy affect the selection pressure on cooperation and\naltruism. Although early work investigated the effect of these factors\nindependently of each other, recent efforts have been aimed at exploring their\ninterplay. Here, we contribute to this ongoing synthesis in two distinct but\ncomplementary ways. First, we integrate models of $n$-player matrix games into\nthe direct fitness approach of inclusive fitness theory, hence providing a\nframework to consider synergistic social interactions between relatives in\nfamily and spatially structured populations. Second, we illustrate the\nusefulness of this framework by delineating three distinct types of helping\ntraits (\"whole-group\", \"nonexpresser-only\" and \"expresser-only\"), which are\ncharacterized by different synergies of kind (arising from differential fitness\neffects on individuals expressing or not expressing helping) and can be\nsubjected to different synergies of scale (arising from economies or\ndiseconomies of scale). We find that relatedness and synergies of kind and\nscale can interact to generate nontrivial evolutionary dynamics, such as cases\nof bistable coexistence featuring both a stable equilibrium with a positive\nlevel of helping and an unstable helping threshold. This broadens the\nqualitative effects of relatedness (or spatial structure) on the evolution of\nhelping.\n", "versions": [{"version": "v1", "created": "Thu, 4 Dec 2014 17:00:49 GMT"}], "update_date": "2014-12-05", "authors_parsed": [["Peña", "Jorge", ""], ["Nöldeke", "Georg", ""], ["Lehmann", "Laurent", ""]]}, {"id": "1412.1875", "submitter": "Jeremy England", "authors": "Nikolai Perunov, Robert Marsland, and Jeremy England", "title": "Statistical Physics of Adaptation", "comments": "23 preprint pages, 4 figures", "journal-ref": "Phys. Rev. X 6, 021036 (2016)", "doi": "10.1103/PhysRevX.6.021036", "report-no": null, "categories": "physics.bio-ph cond-mat.stat-mech q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  All living things exhibit adaptations that enable them to survive and\nreproduce in the natural environment that they inhabit. From a biological\nstandpoint, it has long been understood that adaptation comes from natural\nselection, whereby maladapted individuals do not pass their traits effectively\nto future generations. However, we may also consider the phenomenon of\nadaptation from the standpoint of physics, and ask whether it is possible to\ndelineate what the difference is in terms of physical properties between\nsomething that is well-adapted to its surrounding environment, and something\nthat is not. In this work, we undertake to address this question from a\ntheoretical standpoint. Building on past fundamental results in\nfar-from-equilibrium statistical mechanics, we demonstrate a generalization of\nthe Helmholtz free energy for the finite-time stochastic evolution of driven\nNewtonian matter. By analyzing this expression term by term, we are able to\nargue for a general tendency in driven many-particle systems towards\nself-organization into states formed through exceptionally reliable absorption\nand dissipation of work energy from the surrounding environment. Subsequently,\nwe illustrate the mechanism of this general tendency towards physical\nadaptation by analyzing the process of random hopping in driven energy\nlandscapes.\n", "versions": [{"version": "v1", "created": "Fri, 5 Dec 2014 01:46:11 GMT"}], "update_date": "2016-06-22", "authors_parsed": [["Perunov", "Nikolai", ""], ["Marsland", "Robert", ""], ["England", "Jeremy", ""]]}, {"id": "1412.2110", "submitter": "Amit Chattopadhyay", "authors": "Amit K. Chattopadhyay and Subhasish Bandyopadhyay", "title": "Seasonal variations of EPG Levels in gastro-intestinal parasitic\n  infection in a southeast asian controlled locale: a statistical analysis", "comments": "9 pages, 12 figures", "journal-ref": "SpringerPlus 2013, 2:205", "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a data based statistical study on the effects of seasonal\nvariations in the growth rates of the gastro-intestinal (GI) parasitic\ninfection in livestock. The alluded growth rate is estimated through the\nvariation in the number of eggs per gram (EPG) of faeces in animals. In\naccordance with earlier studies, our analysis too shows that rainfall is the\ndominant variable in determining EPG infection rates compared to other\nmacro-parameters like temperature and humidity. Our statistical analysis\nclearly indicates an oscillatory dependence of EPG levels on rainfall\nfluctuations. Monsoon recorded the highest infection with a comparative\nincrease of at least 2.5 times compared to the next most infected period\n(summer). A least square fit of the EPG versus rainfall data indicates an\napproach towards a super diffusive (i. e. root mean square displacement growing\nfaster than the square root of the elapsed time as obtained for simple\ndiffusion) infection growth pattern regime for low rainfall regimes\n(technically defined as zeroth level dependence) that gets remarkably augmented\nfor large rainfall zones. Our analysis further indicates that for low\nfluctuations in temperature (true on the bulk data), EPG level saturates beyond\na critical value of the rainfall, a threshold that is expected to indicate the\nonset of the nonlinear regime. The probability density functions (PDFs) of the\nEPG data show oscillatory behavior in the large rainfall regime (greater than\n500 mm), the frequency of oscillation, once again, being determined by the\nambient wetness (rainfall, and humidity). Data recorded over three pilot\nprojects spanning three measures of rainfall and humidity bear testimony to the\nuniversality of this statistical argument.\n", "versions": [{"version": "v1", "created": "Wed, 3 Dec 2014 23:15:52 GMT"}], "update_date": "2014-12-08", "authors_parsed": [["Chattopadhyay", "Amit K.", ""], ["Bandyopadhyay", "Subhasish", ""]]}, {"id": "1412.2311", "submitter": "Genki Ichinose", "authors": "Genki Ichinose and Hiroki Sayama", "title": "Invasion of cooperation in scale-free networks: Accumulated vs. average\n  payoffs", "comments": "9 pages, 4 figures", "journal-ref": "Artificial Life 23, pp. 25-33, 2017", "doi": "10.1162/ARTL_a_00220", "report-no": null, "categories": "physics.soc-ph nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well known that cooperation cannot be an evolutionary stable strategy\nfor a non-iterative game in a well-mixed population. In contrast, structured\npopulations favor cooperation since cooperators can benefit each other by\nforming local clusters. Previous studies have shown that scale-free networks\nstrongly promote cooperation. However, little is known about the invasion\nmechanism of cooperation in scale-free networks. To study microscopic and\nmacroscopic behaviors of cooperators' invasion, we conducted computational\nexperiments of the evolution of cooperation in scale-free networks where,\nstarting from all defectors, cooperators can spontaneously emerge by mutation.\nSince the evolutionary dynamics are influenced by the definition of fitness, we\ntested two commonly adopted fitness functions: accumulated payoff and average\npayoff. Simulation results show that cooperation is strongly enhanced with the\naccumulated payoff fitness compared to the average payoff fitness. However, the\ndifference between the two functions decreases as the average degree increases.\nAs the average degree increases, cooperation decreases with the accumulated\npayoff fitness, while it increases with the average payoff fitness. Moreover,\nwith the average payoff fitness, low-degree nodes play a more important role in\nspreading cooperative strategies compared to the case of the accumulated payoff\nfitness.\n", "versions": [{"version": "v1", "created": "Sun, 7 Dec 2014 03:30:30 GMT"}, {"version": "v2", "created": "Wed, 5 Apr 2017 12:29:56 GMT"}], "update_date": "2017-04-07", "authors_parsed": [["Ichinose", "Genki", ""], ["Sayama", "Hiroki", ""]]}, {"id": "1412.2447", "submitter": "David Krakauer", "authors": "David Krakauer, Nils Bertschinger, Eckehard Olbrich, Nihat Ay, Jessica\n  C. Flack", "title": "The Information Theory of Individuality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider biological individuality in terms of information theoretic and\ngraphical principles. Our purpose is to extract through an algorithmic\ndecomposition system-environment boundaries supporting individuality. We infer\nor detect evolved individuals rather than assume that they exist. Given a set\nof consistent measurements over time, we discover a coarse-grained or quantized\ndescription on a system, inducing partitions (which can be nested). Legitimate\nindividual partitions will propagate information from the past into the future,\nwhereas spurious aggregations will not. Individuals are therefore defined in\nterms of ongoing, bounded information processing units rather than lists of\nstatic features or conventional replication-based definitions which tend to\nfail in the case of cultural change. One virtue of this approach is that it\ncould expand the scope of what we consider adaptive or biological phenomena,\nparticularly in the microscopic and macroscopic regimes of molecular and social\nphenomena.\n", "versions": [{"version": "v1", "created": "Mon, 8 Dec 2014 04:53:00 GMT"}], "update_date": "2014-12-09", "authors_parsed": [["Krakauer", "David", ""], ["Bertschinger", "Nils", ""], ["Olbrich", "Eckehard", ""], ["Ay", "Nihat", ""], ["Flack", "Jessica C.", ""]]}, {"id": "1412.2592", "submitter": "Tommaso Biancalani", "authors": "Tommaso Biancalani, Lee DeVille and Nigel Goldenfeld", "title": "A framework for analyzing ecological trait-based models in\n  multi-dimensional niche spaces", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevE.91.052107", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech math.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop an theoretical approach for predicting biodiversity in\nmulti-dimensional niche spaces, arising due to ecological drivers such as\ncompetitive exclusion. The novelty of our approach relies on the fact that\necological niches are described by sequences of strings, which allows us to\ndescribe multiple traits. We define the mathematical framework for analyzing\npattern forming instabilities in these models, showing surprisingly that the\nanalytic linear theory predicts the asymptotically long time population\ndistributions of niches in the model. We propose a test for identifying\necological drivers in biodiversity distributions, based on representing\necosystem data by means of a certain transform introduced in the theory.\n", "versions": [{"version": "v1", "created": "Mon, 8 Dec 2014 14:51:26 GMT"}, {"version": "v2", "created": "Fri, 27 Feb 2015 04:19:09 GMT"}], "update_date": "2015-06-11", "authors_parsed": [["Biancalani", "Tommaso", ""], ["DeVille", "Lee", ""], ["Goldenfeld", "Nigel", ""]]}, {"id": "1412.3305", "submitter": "Damian H. Zanette", "authors": "Octavio Cabrera, Dami\\'an H. Zanette", "title": "Avoiding extinction by migration: The case of the head louse", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The possibility of spreading by migration, colonizing new spatial domains\nsuitable for development and reproduction, can substantially relieve a\nbiological population from the risk of extinction. By means of a realistic\ncomputational model based on empirical data, we study this phenomenon for the\nhuman head louse, Pediculus humanus capitis. In particular, we show that a lice\ncolony infesting a single isolated host is prone to extinction by stochastic\npopulation fluctuations within an interval of several months, while migration\nover a relatively small group of hosts in contact with each other is enough to\ninsure the prevalence of the infestation for indefinitely long periods. We\ncharacterize the interplay of the size of the host group with the host-to-host\ncontagion probability, which controls a transition between extinction of the\nlice population and a situation where the infestation is endemic.\n", "versions": [{"version": "v1", "created": "Wed, 10 Dec 2014 13:53:49 GMT"}], "update_date": "2014-12-11", "authors_parsed": [["Cabrera", "Octavio", ""], ["Zanette", "Damián H.", ""]]}, {"id": "1412.3574", "submitter": "Lixin Zhong", "authors": "Li-Xin Zhong, Wen-Juan Xu, Rong-Da Chen, Tian Qiu, Chen-Yang Zhong", "title": "Coupled effects of local movement and global interaction on contagion", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By incorporating segregated spatial domain and individual-based linkage into\nthe SIS (susceptible-infected-susceptible) model, we investigate the coupled\neffects of random walk and intragroup interaction on contagion. Compared with\nthe situation where only local movement or individual-based linkage exists, the\ncoexistence of them leads to a wider spread of infectious disease. The roles of\nnarrowing segregated spatial domain and reducing mobility in epidemic control\nare checked, these two measures are found to be conducive to curbing the spread\nof infectious disease. Considering heterogeneous time scales between local\nmovement and global interaction, a log-log relation between the change in the\nnumber of infected individuals and the timescale $\\tau$ is found. A theoretical\nanalysis indicates that the evolutionary dynamics in the present model is\nrelated to the encounter probability and the encounter time. A functional\nrelation between the epidemic threshold and the ratio of shortcuts, and a\nfunctional relation between the encounter time and the timescale $\\tau$ are\nfound.\n", "versions": [{"version": "v1", "created": "Thu, 11 Dec 2014 08:54:11 GMT"}, {"version": "v2", "created": "Mon, 4 May 2015 04:05:00 GMT"}], "update_date": "2015-05-05", "authors_parsed": [["Zhong", "Li-Xin", ""], ["Xu", "Wen-Juan", ""], ["Chen", "Rong-Da", ""], ["Qiu", "Tian", ""], ["Zhong", "Chen-Yang", ""]]}, {"id": "1412.3857", "submitter": "Eric Forgoston", "authors": "Garrett Nieddu, Lora Billings, Eric Forgoston", "title": "Analysis and control of pre-extinction dynamics in stochastic\n  populations", "comments": "17 pages, 9 figures. Final version to appear in Bulletin of\n  Mathematical Biology", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a stochastic population model where the intrinsic or demographic\nnoise causes cycling between states before the population eventually goes\nextinct. A master equation approach coupled with a WKB\n(Wentzel-Kramers-Brillouin) approximation is used to construct the optimal path\nto extinction. In addition, a probabilistic argument is used to understand the\npre-extinction dynamics and approximate the mean time to extinction. Analytical\nresults agree well with numerical Monte Carlo simulations. A control method is\nimplemented to decrease the mean time to extinction. Analytical results\nquantify the effectiveness of the control and agree well with numerical\nsimulations.\n", "versions": [{"version": "v1", "created": "Thu, 11 Dec 2014 23:05:11 GMT"}], "update_date": "2014-12-16", "authors_parsed": [["Nieddu", "Garrett", ""], ["Billings", "Lora", ""], ["Forgoston", "Eric", ""]]}, {"id": "1412.3893", "submitter": "Ian Ochs", "authors": "Ian E. Ochs and Michael M. Desai", "title": "The competition between simple and complex evolutionary trajectories in\n  asexual populations", "comments": "8 pages, 3 figures", "journal-ref": "BMC Evolutionary Biology 2015, 15:55", "doi": "10.1186/s12862-015-0334-0", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  On rugged fitness landscapes where sign epistasis is common, adaptation can\noften involve either individually beneficial \"uphill\" mutations or more complex\nmutational trajectories involving fitness valleys or plateaus. The dynamics of\nthe evolutionary process determine the probability that evolution will take any\nspecific path among a variety of competing possible trajectories. Understanding\nthis evolutionary choice is essential if we are to understand the outcomes and\npredictability of adaptation on rugged landscapes. We present a simple model to\nanalyze the probability that evolution will eschew immediately uphill paths in\nfavor of crossing fitness valleys or plateaus that lead to higher fitness but\nless accessible genotypes. We calculate how this probability depends on the\npopulation size, mutation rates, and relevant selection pressures, and compare\nour analytical results to Wright-Fisher simulations. We find that the\nprobability of valley crossing depends nonmonotonically on population size:\nintermediate size populations are most likely to follow a \"greedy\" strategy of\nacquiring immediately beneficial mutations even if they lead to evolutionary\ndead ends, while larger and smaller populations are more likely to cross\nfitness valleys to reach distant advantageous genotypes. We explicitly identify\nthe boundaries between these different regimes in terms of the relevant\nevolutionary parameters. Above a certain threshold population size, we show\nthat the degree of evolutionary \"foresight\" depends only on a single simple\ncombination of the relevant parameters.\n", "versions": [{"version": "v1", "created": "Fri, 12 Dec 2014 05:35:40 GMT"}], "update_date": "2015-10-06", "authors_parsed": [["Ochs", "Ian E.", ""], ["Desai", "Michael M.", ""]]}, {"id": "1412.4069", "submitter": "Christopher Lester", "authors": "Christopher Lester, Ruth E. Baker, Michael B. Giles, Christian A.\n  Yates", "title": "Extending the multi-level method for the simulation of stochastic\n  biological systems", "comments": "38 pages", "journal-ref": null, "doi": "10.1007/s11538-016-0178-9", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The multi-level method for discrete state systems, first introduced by\nAnderson and Higham [Multiscale Model. Simul. 10:146--179, 2012], is a highly\nefficient simulation technique that can be used to elucidate statistical\ncharacteristics of biochemical reaction networks. A single point estimator is\nproduced in a cost-effective manner by combining a number of estimators of\ndiffering accuracy in a telescoping sum, and, as such, the method has the\npotential to revolutionise the field of stochastic simulation. The first term\nin the sum is calculated using an approximate simulation algorithm, and can be\ncalculated quickly but is of significant bias. Subsequent terms successively\ncorrect this bias by combining estimators from approximate stochastic\nsimulations algorithms of increasing accuracy, until a desired level of\naccuracy is reached.\n  In this paper we present several refinements of the multi-level method which\nrender it easier to understand and implement, and also more efficient. Given\nthe substantial and complex nature of the multi-level method, the first part of\nthis work (Sections 2 - 5) is written as a tutorial, with the aim of providing\na practical guide to its use. The second part (Sections 6 - 8) takes on a form\nakin to a research article, thereby providing the means for a deft\nimplementation of the technique, and concludes with a discussion of a number of\nopen problems.\n", "versions": [{"version": "v1", "created": "Fri, 12 Dec 2014 17:54:10 GMT"}, {"version": "v2", "created": "Mon, 29 Jun 2015 18:13:55 GMT"}, {"version": "v3", "created": "Thu, 19 May 2016 19:25:54 GMT"}], "update_date": "2016-09-06", "authors_parsed": [["Lester", "Christopher", ""], ["Baker", "Ruth E.", ""], ["Giles", "Michael B.", ""], ["Yates", "Christian A.", ""]]}, {"id": "1412.4076", "submitter": "Mareike Fischer", "authors": "Steven Kelk and Mareike Fischer", "title": "On the complexity of computing MP distance between binary phylogenetic\n  trees", "comments": "37 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.CE cs.DS math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Within the field of phylogenetics there is great interest in distance\nmeasures to quantify the dissimilarity of two trees. Recently, a new distance\nmeasure has been proposed: the Maximum Parsimony (MP) distance. This is based\non the difference of the parsimony scores of a single character on both trees\nunder consideration, and the goal is to find the character which maximizes this\ndifference. Here we show that computation of MP distance on two \\emph{binary}\nphylogenetic trees is NP-hard. This is a highly nontrivial extension of an\nearlier NP-hardness proof for two multifurcating phylogenetic trees, and it is\nparticularly relevant given the prominence of binary trees in the phylogenetics\nliterature. As a corollary to the main hardness result we show that computation\nof MP distance is also hard on binary trees if the number of states available\nis bounded. In fact, via a different reduction we show that it is hard even if\nonly two states are available. Finally, as a first response to this hardness we\ngive a simple Integer Linear Program (ILP) formulation which is capable of\ncomputing the MP distance exactly for small trees (and for larger trees when\nonly a small number of character states are available) and which is used to\ncomputationally verify several auxiliary results required by the hardness\nproofs.\n", "versions": [{"version": "v1", "created": "Fri, 12 Dec 2014 18:24:35 GMT"}, {"version": "v2", "created": "Sun, 18 Jan 2015 09:54:03 GMT"}], "update_date": "2015-01-20", "authors_parsed": [["Kelk", "Steven", ""], ["Fischer", "Mareike", ""]]}, {"id": "1412.4113", "submitter": "Matjaz Perc", "authors": "Attila Szolnoki, Matjaz Perc", "title": "Conformity enhances network reciprocity in evolutionary social dilemmas", "comments": "8 two-column pages, 5 figures; accepted for publication in Journal of\n  the Royal Society Interface", "journal-ref": "J. R. Soc. Interface 12 (2015) 20141299", "doi": "10.1098/rsif.2014.1299", "report-no": null, "categories": "physics.soc-ph cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The pursuit of highest payoffs in evolutionary social dilemmas is risky and\nsometimes inferior to conformity. Choosing the most common strategy within the\ninteraction range is safer because it ensures that the payoff of an individual\nwill not be much lower than average. Herding instincts and crowd behavior in\nhumans and social animals also compel to conformity on their own right.\nMotivated by these facts, we here study the impact of conformity on the\nevolution of cooperation in social dilemmas. We show that an appropriate\nfraction of conformists within the population introduces an effective surface\ntension around cooperative clusters and ensures smooth interfaces between\ndifferent strategy domains. Payoff-driven players brake the symmetry in favor\nof cooperation and enable an expansion of clusters past the boundaries imposed\nby traditional network reciprocity. This mechanism works even under the most\ntesting conditions, and it is robust against variations of the interaction\nnetwork as long as degree-normalized payoffs are applied. Conformity may thus\nbe beneficial for the resolution of social dilemmas.\n", "versions": [{"version": "v1", "created": "Fri, 12 Dec 2014 20:50:33 GMT"}], "update_date": "2014-12-23", "authors_parsed": [["Szolnoki", "Attila", ""], ["Perc", "Matjaz", ""]]}, {"id": "1412.4312", "submitter": "Stephen Hedges", "authors": "S. Blair Hedges, Julie Marin, Michael Suleski, Madeline Paymer, and\n  Sudhir Kumar", "title": "Tree of life reveals clock-like speciation and diversification", "comments": "17 pages, 6 figures, submitted to journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Genomic data are rapidly resolving the tree of living species calibrated to\ntime, the timetree of life, which will provide a framework for research in\ndiverse fields of science. Previous analyses of taxonomically restricted\ntimetrees have found a decline in the rate of diversification in many groups of\norganisms, often attributed to ecological interactions among species. Here we\nhave synthesized a global timetree of life from 2,274 studies representing\n50,632 species and examined the pattern and rate of diversification as well as\nthe timing of speciation. We found that species diversity has been mostly\nexpanding overall and in many smaller groups of species, and that the rate of\ndiversification in eukaryotes has been mostly constant. We also identified, and\navoided, potential biases that may have influenced previous analyses of\ndiversification including low levels of taxon sampling, small clade size, and\nthe inclusion of stem branches in clade analyses. We found consistency in\ntime-to-speciation among plants and animals, approximately two million years,\nas measured by intervals of crown and stem species times. Together, this\nclock-like change at different levels suggests that speciation and\ndiversification are processes dominated by random events and that adaptive\nchange is largely a separate process.\n", "versions": [{"version": "v1", "created": "Sun, 14 Dec 2014 04:47:40 GMT"}], "update_date": "2014-12-16", "authors_parsed": [["Hedges", "S. Blair", ""], ["Marin", "Julie", ""], ["Suleski", "Michael", ""], ["Paymer", "Madeline", ""], ["Kumar", "Sudhir", ""]]}, {"id": "1412.4701", "submitter": "Aristides Moustakas", "authors": "Aristides Moustakas", "title": "Fire acting as an increasing spatial autocorrelation force: Implications\n  for pattern formation and ecological facilitation", "comments": "To appear in Ecological Complexity (in press)", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Fire is an indissoluble component of ecosystems, however quantifying the\neffects of fire on vegetation is challenging task as fire lies outside the\ntypical experimental design attributes. A recent simulation study showed that\nunder increased fire regimes positive tree-tree interactions were recorded\n(Bacelar et al., 2014). Data from experimental burning plots in an African\nsavanna, the Kruger National Park, were collected across unburnt and annual\nburn plots. Indices of aggregation and spatial autocorrelation of the\ndistribution of trees between different fire regimes were explored. Results\nshow that the distribution of trees under fire were more clumped and exhibited\nhigher spatial autocorrelation than in unburnt plots: In burnt plots spatial\nautocorrelation values were positive at finer scales and negative at coarser\nscales potentially indicating co-existence of facilitation and competition\nwithin the same ecosystem depending on the scale. The pattern derived here\nprovides inference for (a) fire acting as an increasing aggregation & spatial\nautocorrelation force (b) tree survival under fire regimes is potentially\nfacilitated by forming patches of trees (c) scale-dependent facilitation and\ncompetition coexisting within the same ecosystem with finer scale facilitation\nand coarser scale competition.\n", "versions": [{"version": "v1", "created": "Mon, 15 Dec 2014 17:53:34 GMT"}], "update_date": "2014-12-16", "authors_parsed": [["Moustakas", "Aristides", ""]]}, {"id": "1412.4875", "submitter": "Petter Holme", "authors": "Petter Holme, Taro Takaguchi", "title": "Time evolution of predictability of epidemics on networks", "comments": null, "journal-ref": "Phys. Rev. E 91, 042811 (2015)", "doi": "10.1103/PhysRevE.91.042811", "report-no": null, "categories": "q-bio.PE cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Epidemic outbreaks of new pathogens, or known pathogens in new populations,\ncause a great deal of fear because they are hard to predict. For theoretical\nmodels of disease spreading, on the other hand, quantities characterizing the\noutbreak converge to deterministic functions of time. Our goal in this paper is\nto shed some light on this apparent discrepancy. We measure the diversity of\n(and, thus, the predictability of) outbreak sizes and extinction times as\nfunctions of time given different scenarios of the amount of information\navailable. Under the assumption of perfect information -- i.e., knowing the\nstate of each individual with respect to the disease -- the predictability\ndecreases exponentially, or faster, with time. The decay is slowest for\nintermediate values of the per-contact transmission probability. With a weaker\nassumption on the information available, assuming that we know only the\nfraction of currently infectious, recovered, or susceptible individuals, the\npredictability also decreases exponentially most of the time. There are,\nhowever, some peculiar regions in this scenario where the predictability\ndecreases. In other words, to predict its final size with a given accuracy, we\nwould need increasingly more information about the outbreak.\n", "versions": [{"version": "v1", "created": "Tue, 16 Dec 2014 04:55:20 GMT"}, {"version": "v2", "created": "Tue, 5 May 2015 12:34:23 GMT"}], "update_date": "2015-05-20", "authors_parsed": [["Holme", "Petter", ""], ["Takaguchi", "Taro", ""]]}, {"id": "1412.5026", "submitter": "Marco Formentin", "authors": "Andrea Giometto, Marco Formentin, Andrea Rinaldo, Joel E. Cohen and\n  Amos Maritan", "title": "Sample and population exponents of generalized Taylor's law", "comments": "41 pages, 10 figures, 6 tables", "journal-ref": null, "doi": "10.1073/pnas.1505882112", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Taylor's law (TL) states that the variance $V$ of a non-negative random\nvariable is a power function of its mean $M$, i.e. $V=a M^b$. The ubiquitous\nempirical verification of TL, typically displaying sample exponents $b \\simeq\n2$, suggests a context-independent mechanism. However, theoretical studies of\npopulation dynamics predict a broad range of values of $b$. Here, we explain\nthis apparent contradiction by using large deviations theory to derive a\ngeneralized TL in terms of sample and populations exponents $b_{jk}$ for the\nscaling of the $k$-th vs the $j$-th cumulant (conventional TL is recovered for\n$b=b_{12}$), with the sample exponent found to depend predictably on the number\nof observed samples. Thus, for finite numbers of observations one observes\nsample exponents $b_{jk}\\simeq k/j$ (thus $b\\simeq2$) independently of\npopulation exponents. Empirical analyses on two datasets support our\ntheoretical results.\n", "versions": [{"version": "v1", "created": "Tue, 16 Dec 2014 14:56:32 GMT"}], "update_date": "2016-02-17", "authors_parsed": [["Giometto", "Andrea", ""], ["Formentin", "Marco", ""], ["Rinaldo", "Andrea", ""], ["Cohen", "Joel E.", ""], ["Maritan", "Amos", ""]]}, {"id": "1412.5454", "submitter": "Md Shamsuzzoha Bayzid", "authors": "Md. Shamsuzzoha Bayzid, Siavash Mirarab, Bastien Boussau, Tandy Warnow", "title": "Weighted Statistical Binning: enabling statistically consistent\n  genome-scale phylogenetic analyses", "comments": "(1) In Press, PLoS ONE", "journal-ref": null, "doi": "10.1371/journal.pone.0129183", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Because biological processes can make different loci have different\nevolutionary histories, species tree estimation requires multiple loci from\nacross the genome. While many processes can result in discord between gene\ntrees and species trees, incomplete lineage sorting (ILS), modeled by the\nmulti-species coalescent, is considered to be a dominant cause for gene tree\nheterogeneity. Coalescent-based methods have been developed to estimate species\ntrees, many of which operate by combining estimated gene trees, and so are\ncalled summary methods. Because summary methods are generally fast, they have\nbecome very popular techniques for estimating species trees from multiple loci.\nHowever, recent studies have established that summary methods can have reduced\naccuracy in the presence of gene tree estimation error, and also that many\nbiological datasets have substantial gene tree estimation error, so that\nsummary methods may not be highly accurate on biologically realistic\nconditions. Mirarab et al. (Science 2014) presented the statistical binning\ntechnique to improve gene tree estimation in multi-locus analyses, and showed\nthat it improved the accuracy of MP-EST, one of the most popular\ncoalescent-based summary methods. Statistical binning, which uses a simple\nstatistical test for combinability and then uses the larger sets of genes to\nre-calculate gene trees, has good empirical performance, but using statistical\nbinning within a phylogenomics pipeline does not have the desirable property of\nbeing statistically consistent. We show that weighting the recalculated gene\ntrees by the bin sizes makes statistical binning statistically consistent under\nthe multispecies coalescent, and maintains the good empirical performance.\nThus, \"weighted statistical binning\" enables highly accurate genome-scale\nspecies tree estimation, and is also statistical consistent under the\nmulti-species coalescent model.\n", "versions": [{"version": "v1", "created": "Wed, 17 Dec 2014 16:02:17 GMT"}, {"version": "v2", "created": "Fri, 9 Jan 2015 14:45:22 GMT"}, {"version": "v3", "created": "Wed, 15 Apr 2015 21:10:06 GMT"}, {"version": "v4", "created": "Wed, 3 Jun 2015 19:36:03 GMT"}], "update_date": "2018-03-13", "authors_parsed": [["Bayzid", "Md. Shamsuzzoha", ""], ["Mirarab", "Siavash", ""], ["Boussau", "Bastien", ""], ["Warnow", "Tandy", ""]]}, {"id": "1412.5480", "submitter": "Sandro Meloni", "authors": "Chiara Poletto, Sandro Meloni, Ashleigh Van Metre, Vittoria Colizza,\n  Yamir Moreno, Alessandro Vespignani", "title": "Characterising two-pathogen competition in spatially structured\n  environments", "comments": "30 pages, 6 figures, 1 table. Final version accepted for publication\n  in Scientific Reports", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE physics.bio-ph physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Different pathogens spreading in the same host population often generate\ncomplex co-circulation dynamics because of the many possible interactions\nbetween the pathogens and the host immune system, the host life cycle, and the\nspace structure of the population. Here we focus on the competition between two\nacute infections and we address the role of host mobility and cross-immunity in\nshaping possible dominance/co-dominance regimes. Host mobility is modelled as a\nnetwork of traveling flows connecting nodes of a metapopulation, and the\ntwo-pathogen dynamics is simulated with a stochastic mechanistic approach.\nResults depict a complex scenario where, according to the relation among the\nepidemiological parameters of the two pathogens, mobility can either be\nnon-influential for the competition dynamics or play a critical role in\nselecting the dominant pathogen. The characterisation of the parameter space\ncan be explained in terms of the trade-off between pathogen's spreading\nvelocity and its ability to diffuse in a sparse environment. Variations in the\ncross-immunity level induce a transition between presence and absence of\ncompetition. The present study disentangles the role of the relevant biological\nand ecological factors in the competition dynamics, and provides relevant\ninsights into the spatial ecology of infectious diseases.\n", "versions": [{"version": "v1", "created": "Wed, 17 Dec 2014 17:01:55 GMT"}], "update_date": "2014-12-18", "authors_parsed": [["Poletto", "Chiara", ""], ["Meloni", "Sandro", ""], ["Van Metre", "Ashleigh", ""], ["Colizza", "Vittoria", ""], ["Moreno", "Yamir", ""], ["Vespignani", "Alessandro", ""]]}, {"id": "1412.5773", "submitter": "Kotaro Konno", "authors": "Kotaro Konno", "title": "A general parameterized mathematical food web model that predicts a\n  stable green world in the terrestrial ecosystem", "comments": "68 pages, 2 figure, 3 Tables", "journal-ref": "Ecological Monographs 2016, Vol 86, Issue 2, 190-204", "doi": "10.1890/15-1420", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Terrestrial ecosystems are generally green and only a small part (<10%) of\nthe plant matter is consumed by herbivores annually,but the reason has been\nunclear due to the lack of food web models for predicting the absolute\nherbivore biomass in physical units. Here, I present a simple parameterized\nmathematical food web model that can predict the biomass density of herbivores\nh (kg protein/m3) and carnivores c from ecological factors such as the\nnutritive values of plants np (kg protein/m3), herbivores nh, and carnivores\nnc, searching efficiency (volume) of carnivores S (/day), eating efficiency\n(speed) of herbivores eh (/day) and carnivores ec, respiratory decrease in\nherbivore and carnivore biomasses, dh (/day) and dc, absorption efficiency of\nherbivores and carnivores h (ratio) and c, and probabilities of carnivores\npreying on herbivores or carnivores, Phc (ratio) and Pcc.The model predicts a\nstable equilibrium with low herbivore biomass h sufficient to keep the world\ngreen if the food web consists of the three trophic levels, plants, herbivores\nand carnivores; intraguild predation of carnivores exists; np<nh,nc; S>>eh, and\nPhc>Pcc >0,which are well-realized in above-ground terrestrial ecosystems where\nplant-rich \"green world\" is common. The h and c calculated from our model\nshowed good agreement with those from empirical observations in forests, where\nboth h and c are ca. 100 mg (fresh biomass/m2), and in savannahs. The model\npredicts that the nutritive values and digestibility of plants are positively\ncorrelated with h and the intensity of herbivory, which theoretically explains\nthe out-door defensive effects of the anti-nutritive or quantitative defenses\n(e.g., tannins, protease inhibitors) of plants, and predicts that c and c/h are\npositively correlated with the relative growth rate of herbivores. The present\nmodel introduced parameterized realities into food web theory.\n", "versions": [{"version": "v1", "created": "Thu, 18 Dec 2014 09:29:41 GMT"}, {"version": "v2", "created": "Tue, 4 Aug 2015 06:53:30 GMT"}], "update_date": "2016-05-24", "authors_parsed": [["Konno", "Kotaro", ""]]}, {"id": "1412.6077", "submitter": "Jiawei Li", "authors": "Jiawei Li, Graham Kendall", "title": "On Nash Equilibrium and Evolutionarily Stable States that Are Not\n  Characterised by the Folk Theorem", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0136032", "report-no": null, "categories": "cs.GT q-bio.PE", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In evolutionary game theory, evolutionarily stable states are characterised\nby the folk theorem because exact solutions to the replicator equation are\ndifficult to obtain. It is generally assumed that the folk theorem, which is\nthe fundamental theory for non-cooperative games, defines all Nash equilibria\nin infinitely repeated games. Here, we prove that Nash equilibria that are not\ncharacterised by the folk theorem do exist. By adopting specific reactive\nstrategies, a group of players can be better off by coordinating their actions\nin repeated games. We call it a type-k equilibrium when a group of k players\ncoordinate their actions and they have no incentive to deviate from their\nstrategies simultaneously. The existence and stability of the type-k\nequilibrium in general games is discussed. This study shows that the sets of\nNash equilibria and evolutionarily stable states have greater cardinality than\nclassic game theory has predicted in many repeated games.\n", "versions": [{"version": "v1", "created": "Tue, 2 Dec 2014 14:34:44 GMT"}, {"version": "v2", "created": "Fri, 21 Aug 2015 10:33:17 GMT"}, {"version": "v3", "created": "Mon, 7 Sep 2015 14:30:04 GMT"}], "update_date": "2015-09-08", "authors_parsed": [["Li", "Jiawei", ""], ["Kendall", "Graham", ""]]}, {"id": "1412.6274", "submitter": "Shi Yan", "authors": "Shi Yan, Harumasa Tachibana, Lan-Hai Wei, Ge Yu, Shao-Qing Wen,\n  Chuan-Chao Wang", "title": "Y Chromosome of Aisin Gioro, the Imperial House of Qing Dynasty", "comments": "11 pages, 3 figures, 2 tables. Submitted on 2014.12.19, in advance to\n  acception by a journal. A parallel Chinese version is also available", "journal-ref": "Journal of Human Genetics, (2 April 2015)", "doi": "10.1038/jhg.2015.28", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  House of Aisin Gioro is the imperial family of the last dynasty in Chinese\nhistory - Qing Dynasty (1644 - 1911). Aisin Gioro family originated from\nJurchen tribes and developed the Manchu people before they conquered China. By\ninvestigating the Y chromosomal short tandem repeats (STRs) of 7 modern male\nindividuals who claim belonging to Aisin Gioro family (in which 3 have full\nrecords of pedigree), we found that 3 of them (in which 2 keep full pedigree,\nwhose most recent common ancestor is Nurgaci) shows very close relationship (1\n- 2 steps of difference in 17 STR) and the haplotype is rare. We therefore\nconclude that this haplotype is the Y chromosome of the House of Aisin Gioro.\nFurther tests of single nucleotide polymorphisms (SNPs) indicates that they\nbelong to Haplogroup C3b2b1*-M401(xF5483), although their Y-STR results are\ndistant to the \"star cluster\", which also belongs to the same haplogroup. This\nstudy forms the base for the pedigree research of the imperial family of Qing\nDynasty by means of genetics.\n", "versions": [{"version": "v1", "created": "Fri, 19 Dec 2014 10:27:22 GMT"}], "update_date": "2015-04-27", "authors_parsed": [["Yan", "Shi", ""], ["Tachibana", "Harumasa", ""], ["Wei", "Lan-Hai", ""], ["Yu", "Ge", ""], ["Wen", "Shao-Qing", ""], ["Wang", "Chuan-Chao", ""]]}, {"id": "1412.6297", "submitter": "Claudio Borile", "authors": "Claudio Borile, Daniel Molina-Garcia, Amos Maritan and Miguel A.\n  Mu\\~noz", "title": "Coexistence in neutral theories: interplay of criticality and mild local\n  preferences", "comments": "Accepted for publication in Journal of Statistical Mechanics: Theory\n  and Experiment", "journal-ref": null, "doi": "10.1088/1742-5468/2015/01/P01030", "report-no": null, "categories": "cond-mat.stat-mech cond-mat.dis-nn q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Neutral theories have played a crucial and revolutionary role in fields such\nas population genetics and biogeography. These theories are critical by\ndefinition, in the sense that the overall growth rate of each single\nallele/species/type vanishes. Thus each species in a neutral model sits at the\nedge between invasion and extinction, allowing for the coexistence of\nsymmetric/neutral types. However, in finite systems, mono-dominated states are\nineludibly reached in relatively short times owing to demographic fluctuations,\nthus leaving us with an unsatisfactory framework to rationalize\nempirically-observed long-term coexistence. Here, we scrutinize the effect of\nheterogeneity in quasi-neutral theories, in which there can be a local mild\npreference for some of the competing species at some sites, even if the overall\nspecies symmetry is maintained. As we show here, mild biases at a small\nfraction of locations suffice to induce overall robust and durable species\ncoexistence, even in regions arbitrarily far apart from the biased locations.\nThis result stems from the long-range nature of the underlying critical bulk\ndynamics and has a number of implications, for example, in conservation ecology\nas it suggests that constructing local specific \"sanctuaries\" for different\ncompeting species can result in global enhancement of biodiversity, even in\nregions arbitrarily distant from the protected refuges.\n", "versions": [{"version": "v1", "created": "Fri, 19 Dec 2014 11:36:03 GMT"}], "update_date": "2015-06-23", "authors_parsed": [["Borile", "Claudio", ""], ["Molina-Garcia", "Daniel", ""], ["Maritan", "Amos", ""], ["Muñoz", "Miguel A.", ""]]}, {"id": "1412.6474", "submitter": "George Constable Dr", "authors": "George W. A. Constable and Alan J. McKane", "title": "Stationary solutions for metapopulation Moran models with mutation and\n  selection", "comments": "16 pages, 8 figures", "journal-ref": "Phys. Rev. E 91, 032711, 2015", "doi": "10.1103/PhysRevE.91.032711", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We construct an individual-based metapopulation model of population genetics\nfeaturing migration, mutation, selection and genetic drift. In the case of a\nsingle `island', the model reduces to the Moran model. Using the diffusion\napproximation and timescale separation arguments, an effective one-variable\ndescription of the model is developed. The effective description bears\nsimilarities to the well-mixed Moran model with effective parameters which\ndepend on the network structure and island sizes, and is amenable to analysis.\nPredictions from the reduced theory match the results from stochastic\nsimulations across a range of parameters. The nature of the fast-variable\nelimination technique we adopt is further studied by applying it to a linear\nsystem, where it provides a precise description of the slow-dynamics in the\nlimit of large timescale separation.\n", "versions": [{"version": "v1", "created": "Fri, 19 Dec 2014 18:32:54 GMT"}, {"version": "v2", "created": "Tue, 14 Apr 2015 23:29:15 GMT"}], "update_date": "2015-04-16", "authors_parsed": [["Constable", "George W. A.", ""], ["McKane", "Alan J.", ""]]}, {"id": "1412.6688", "submitter": "Thiparat Chotibut", "authors": "Thiparat Chotibut, David R. Nelson", "title": "Evolutionary Dynamics with Fluctuating Population Sizes and Strong\n  Mutualism", "comments": "Updated Version, Published in Phys. Rev. E 92, 022718 on 20 August\n  2015", "journal-ref": "Phys. Rev. E 92, 022718 (2015)", "doi": "10.1103/PhysRevE.92.022718", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Game theory ideas provide a useful framework for studying evolutionary\ndynamics in a well-mixed environment. This approach, however, typically\nenforces a strictly fixed overall population size, deemphasizing natural growth\nprocesses. We study a competitive Lotka-Volterra model, with number\nfluctuations, that accounts for natural population growth and encompasses\ninteraction scenarios typical of evolutionary games. We show that, in an\nappropriate limit, the model describes standard evolutionary games with both\ngenetic drift and overall population size fluctuations. However, there are also\nregimes where a varying population size can strongly influence the evolutionary\ndynamics. We focus on the strong mutualism scenario and demonstrate that\nstandard evolutionary game theory fails to describe our simulation results. We\nthen analytically and numerically determine fixation probabilities as well as\nmean fixation times using matched asymptotic expansions, taking into account\nthe population size degree of freedom. These results elucidate the interplay\nbetween population dynamics and evolutionary dynamics in well-mixed systems.\n", "versions": [{"version": "v1", "created": "Sat, 20 Dec 2014 19:57:53 GMT"}, {"version": "v2", "created": "Mon, 29 Aug 2016 17:08:52 GMT"}], "update_date": "2016-08-30", "authors_parsed": [["Chotibut", "Thiparat", ""], ["Nelson", "David R.", ""]]}, {"id": "1412.6691", "submitter": "Alan Rogers", "authors": "Alan R. Rogers and Ryan J. Bohlender", "title": "Bias in Estimators of Archaic Admixture", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article evaluates bias in one class of methods used to estimate archaic\nadmixture in modern humans. These methods study the pattern of allele sharing\namong modern and archaic genomes. They are sensitive to \"ghost\" admixture,\nwhich occurs when a population receives archaic DNA from sources not\nacknowledged by the statistical model. The effect of ghost admixture depends on\ntwo factors: branch-length bias and population-size bias. Branch-length bias\noccurs because a given amount of admixture has a larger effect if the two\npopulations have been separated for a long time. Population-size bias occurs\nbecause differences in population size distort branch lengths in the gene\ngenealogy. In the absence of ghost admixture, these effects are small. They\nbecome important, however, in the presence of ghost admixture. Estimators\ndiffer in the pattern of response. Increasing a given parameter may inflate one\nestimator but deflate another. For this reason, comparisons among estimators\nare informative. Using such comparisons, this article supports previous\nfindings that the archaic population was small and that Europeans received\nlittle gene flow from archaic populations other than Neanderthals. It also\nidentifies an inconsistency in estimates of archaic admixture into Melanesia.\n", "versions": [{"version": "v1", "created": "Sat, 20 Dec 2014 20:39:12 GMT"}], "update_date": "2014-12-23", "authors_parsed": [["Rogers", "Alan R.", ""], ["Bohlender", "Ryan J.", ""]]}, {"id": "1412.6779", "submitter": "Willem Kruijer", "authors": "Willem Kruijer, Martin Boer, Marcos Malosetti, Padraic J. Flood, Bas\n  Engel, Rik Kooke, Joost Keurentjes, Fred van Eeuwijk", "title": "Marker-based estimation of heritability in immortal populations", "comments": "6 figures. Contains all the supplementary information (p. 30-54)", "journal-ref": "Genetics (2015), Vol. 199(2), p. 379-398", "doi": "10.1534/genetics.114.167916", "report-no": null, "categories": "stat.AP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heritability is a central parameter in quantitative genetics, both from an\nevolutionary and a breeding perspective. For plant traits heritability is\ntraditionally estimated by comparing within and between genotype variability.\nThis approach estimates broad-sense heritability, and does not account for\ndifferent genetic relatedness. With the availability of high-density markers\nthere is growing interest in marker based estimates of narrow-sense\nheritability, using mixed models in which genetic relatedness is estimated from\ngenetic markers. Such estimates have received much attention in human genetics\nbut are rarely reported for plant traits. A major obstacle is that current\nmethodology and software assume a single phenotypic value per genotype, hence\nrequiring genotypic means. An alternative that we propose here, is to use mixed\nmodels at individual plant or plot level. Using statistical arguments,\nsimulations and real data we investigate the feasibility of both approaches,\nand how these affect genomic prediction with G-BLUP and genome-wide association\nstudies. Heritability estimates obtained from genotypic means had very large\nstandard errors and were sometimes biologically unrealistic. Mixed models at\nindividual plant or plot level produced more realistic estimates, and for\nsimulated traits standard errors were up to 13 times smaller. Genomic\nprediction was also improved by using these mixed models, with up to a 49%\nincrease in accuracy. For GWAS on simulated traits, the use of individual plant\ndata gave almost no increase in power. The new methodology is applicable to any\ncomplex trait where multiple replicates of individual genotypes can be scored.\nThis includes important agronomic crops, as well as bacteria and fungi.\n", "versions": [{"version": "v1", "created": "Sun, 21 Dec 2014 13:15:23 GMT"}, {"version": "v2", "created": "Mon, 16 Feb 2015 11:39:29 GMT"}], "update_date": "2015-02-17", "authors_parsed": [["Kruijer", "Willem", ""], ["Boer", "Martin", ""], ["Malosetti", "Marcos", ""], ["Flood", "Padraic J.", ""], ["Engel", "Bas", ""], ["Kooke", "Rik", ""], ["Keurentjes", "Joost", ""], ["van Eeuwijk", "Fred", ""]]}, {"id": "1412.6975", "submitter": "Stefania Melillo", "authors": "A.Attanasi, A.Cavagna, L.Del Castello, I.Giardina, S.Melillo,\n  L.Parisi, O.Pohl, B.Rossaro, E.Shen, E.Silvestri, M.Viale", "title": "Finite-size scaling as a way to probe near-criticality in natural swarms", "comments": "Selected for Viewpoint in Physics; PRL Editor's Suggestion", "journal-ref": "Phys.Rev.Lett. 113, 238102 (2014)", "doi": "10.1103/PhysRevLett.113.238102", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Collective behaviour in biological systems is often accompanied by strong\ncorrelations. The question has therefore arisen of whether correlation is\namplified by the vicinity to some critical point in the parameters space.\nBiological systems, though, are typically quite far from the thermodynamic\nlimit, so that the value of the control parameter at which correlation and\nsusceptibility peak depend on size. Hence, a system would need to readjust its\ncontrol parameter according to its size in order to be maximally correlated.\nThis readjustment, though, has never been observed experimentally. By gathering\nthree-dimensional data on swarms of midges in the field we find that swarms\ntune their control parameter and size so as to maintain a scaling behaviour of\nthe correlation function. As a consequence, correlation length and\nsusceptibility scale with the system's size and swarms exhibit a near-maximal\ndegree of correlation at all sizes.\n", "versions": [{"version": "v1", "created": "Mon, 22 Dec 2014 13:39:01 GMT"}], "update_date": "2014-12-23", "authors_parsed": [["Attanasi", "A.", ""], ["Cavagna", "A.", ""], ["Del Castello", "L.", ""], ["Giardina", "I.", ""], ["Melillo", "S.", ""], ["Parisi", "L.", ""], ["Pohl", "O.", ""], ["Rossaro", "B.", ""], ["Shen", "E.", ""], ["Silvestri", "E.", ""], ["Viale", "M.", ""]]}, {"id": "1412.7082", "submitter": "Daniel Rabosky", "authors": "Daniel L. Rabosky and Emma E. Goldberg", "title": "Model Inadequacy and Mistaken Inferences of Trait-Dependent Speciation", "comments": "7 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Species richness varies widely across the tree of life, and there is great\ninterest in identifying ecological, geographic, and other factors that affect\nrates of species proliferation. Recent methods for explicitly modeling the\nrelationships among character states, speciation rates, and extinction rates on\nphylogenetic trees- BiSSE, QuaSSE, GeoSSE, and related models - have been\nwidely used to test hypotheses about character state-dependent diversification\nrates. Here, we document the disconcerting ease with which neutral traits are\ninferred to have statistically significant associations with speciation rate.\nWe first demonstrate this unfortunate effect for a known model assumption\nviolation: shifts in speciation rate associated with a character not included\nin the model. We further show that for many empirical phylogenies, characters\nsimulated in the absence of state-dependent diversification exhibit an even\nhigher Type I error rate, indicating that the method is susceptible to\nadditional, unknown model inadequacies. For traits that evolve slowly, the root\ncause appears to be a statistical framework that does not require replicated\nshifts in character state and diversification. However, spurious associations\nbetween character state and speciation rate arise even for traits that lack\nphylogenetic signal, suggesting that phylogenetic pseudoreplication alone\ncannot fully explain the problem. The surprising severity of this phenomenon\nsuggests that many trait-diversification relationships reported in the\nliterature may not be real. More generally, we highlight the need for\ndiagnosing and understanding the consequences of model inadequacy in\nphylogenetic comparative methods.\n", "versions": [{"version": "v1", "created": "Mon, 22 Dec 2014 18:28:40 GMT"}], "update_date": "2014-12-23", "authors_parsed": [["Rabosky", "Daniel L.", ""], ["Goldberg", "Emma E.", ""]]}, {"id": "1412.7187", "submitter": "Rajita Menon", "authors": "Rajita Menon and Kirill S. Korolev", "title": "Public good diffusion limits microbial mutualism", "comments": "12 pages, 4 figures", "journal-ref": "Phys. Rev. Lett. 114, (2015) 168102", "doi": "10.1103/PhysRevLett.114.168102", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Standard game theory cannot describe microbial interactions mediated by\ndiffusible molecules. Nevertheless, we show that one can still model microbial\ndynamics using game theory with parameters renormalized by diffusion. Contrary\nto expectations, greater sharing of metabolites reduces the strength of\ncooperation and leads to species extinction via a nonequilibrium phase\ntransition. We report analytic results for the critical diffusivity and the\nlength scale of species intermixing. We also show that fitness nonlinearities\nsuppress mutualism and favor the species producing slower nutrients.\n", "versions": [{"version": "v1", "created": "Mon, 22 Dec 2014 22:22:33 GMT"}, {"version": "v2", "created": "Thu, 5 Mar 2015 00:35:56 GMT"}, {"version": "v3", "created": "Mon, 4 May 2015 22:07:28 GMT"}, {"version": "v4", "created": "Sat, 23 May 2015 23:57:47 GMT"}], "update_date": "2015-05-26", "authors_parsed": [["Menon", "Rajita", ""], ["Korolev", "Kirill S.", ""]]}, {"id": "1412.7519", "submitter": "Helene Montanie", "authors": "H\\'el\\`ene Montani\\'e (LIENSs), Pascaline Ory (LIENSs), Francis\n  Orvain, Daniel Delmas, Christine Dupuy (LIENSs)", "title": "Microbial interactions in marine water amended by eroded benthic\n  biofilm: A case study from an intertidal mudflat", "comments": null, "journal-ref": "Journal of Sea Research, Elsevier, 2014, 92, pp.74 - 85", "doi": "10.1016/j.seares.2013.11.011", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In shallow macrotidal ecosystems with large intertidal mudflats, the\nsediment-water coupling plays a crucial role in structuring the pelagic\nmicrobial food web functioning, since inorganic and organic matter and\nmicrobial components (viruses and microbes) of the microphytobenthic biofilm\ncan be suspended toward the water column. Two experimental bioassays were\nconducted in March and July 2008 to investigate the importance of biofilm input\nfor the pelagic Microbial and Viral Loops. Pelagic inocula (<0.6$\\mu$ and\n<10$\\mu$ filtrates) were diluted either with \\textless{}30kDa-ultrafiltered\nseawater or with this ultrafiltrate enriched with the respective\nsize-fractionated benthic biofilm or with \\textless{}30kDa-benthic compounds\n(BC). The kinetics of heterotrophic nanoflagellates (HNF), bacteria and viruses\nwere assessed together with bacterial and viral genomic fingerprints, bacterial\nenzymatic activities and viral life strategies. The experimental design allowed\nus to evaluate the effect of BC modulated by those of benthic size-fractionated\nmicroorganisms (virus+bacteria, +HNF). BC presented (1) in March, a positive\neffect on viruses and bacteria weakened by pelagic HNF. Benthic microorganisms\nconsolidated this negative effect and sustained the viral production together\nwith a relatively diverse and uneven bacterial assemblage structure; (2) in\nJuly, no direct impact on viruses but a positive effect on bacteria modulated\nby HNF, which indirectly enhanced viral multiplication. Both effects were\nintensified by benthic microorganisms and bacterial assemblage structure became\nmore even. HNF indirectly profited from BC more in March than in July. The\nMicrobial Loop would be stimulated by biofilm during periods of high resources\n(March) and the Viral Loop during periods of depleted resources (July).\n", "versions": [{"version": "v1", "created": "Tue, 23 Dec 2014 20:50:46 GMT"}], "update_date": "2014-12-24", "authors_parsed": [["Montanié", "Hélène", "", "LIENSs"], ["Ory", "Pascaline", "", "LIENSs"], ["Orvain", "Francis", "", "LIENSs"], ["Delmas", "Daniel", "", "LIENSs"], ["Dupuy", "Christine", "", "LIENSs"]]}, {"id": "1412.7560", "submitter": "Franck Jabot", "authors": "Franck Jabot, Guillaume Lagarrigues, Beno\\^it Courbaud, Nicolas\n  Dumoulin", "title": "A comparison of emulation methods for Approximate Bayesian Computation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.PE stat.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Approximate Bayesian Computation (ABC) is a family of statistical inference\ntechniques, which is increasingly used in biology and other scientific fields.\nIts main benefit is to be applicable to models for which the computation of the\nmodel likelihood is intractable. The basic idea of ABC is to empirically\napproximate the model likelihood by using intensive realizations of model runs.\nDue to computing time limitations, ABC has thus been mainly applied to models\nthat are relatively quick to simulate. We here aim at briefly introducing the\nfield of statistical emulation of computer code outputs and to demonstrate its\npotential for ABC applications. Emulation consists in replacing the costly to\nsimulate model by another (quick to simulate) statistical model called emulator\nor meta-model. This emulator is fitted to a small number of outputs of the\noriginal model, and is subsequently used as a surrogate during the inference\nprocedure. In this contribution, we first detail the principles of model\nemulation, with a special reference to the ABC context in which the description\nof the stochasticity of model realizations is as important as the description\nof the trends linking model parameters and outputs. We then compare several\nemulation strategies in an ABC context, using as case study a stochastic\necological model of community dynamics. We finally describe a novel\nemulation-based sequential ABC algorithm which is shown to decrease computing\ntime by a factor of two on the studied example, compared to previous sequential\nABC algorithms. Routines to perform emulation-based ABC were made available\nwithin the R package EasyABC.\n", "versions": [{"version": "v1", "created": "Tue, 16 Dec 2014 08:18:48 GMT"}], "update_date": "2014-12-25", "authors_parsed": [["Jabot", "Franck", ""], ["Lagarrigues", "Guillaume", ""], ["Courbaud", "Benoît", ""], ["Dumoulin", "Nicolas", ""]]}, {"id": "1412.8081", "submitter": "Carl Boettiger", "authors": "Carl Boettiger, Marc Mangel, Stephan Munch", "title": "Avoiding tipping points in fisheries management through Gaussian Process\n  Dynamic Programming", "comments": "2015 Proceedings of the Royal Society B: Biological Sciences", "journal-ref": null, "doi": "10.1098/rspb-2014-1631", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Model uncertainty and limited data are fundamental challenges to robust\nmanagement of human intervention in a natural system. These challenges are\nacutely highlighted by concerns that many ecological systems may contain\ntipping points, such as Allee population sizes. Before a collapse, we do not\nknow where the tipping points lie, if they exist at all. Hence, we know neither\na complete model of the system dynamics nor do we have access to data in some\nlarge region of state-space where such a tipping point might exist. We\nillustrate how a Bayesian Non-Parametric (BNP) approach using a Gaussian\nProcess (GP) prior provides a flexible representation of this inherent\nuncertainty. We embed GPs in a Stochastic Dynamic Programming (SDP) framework\nin order to make robust management predictions with both model uncertainty and\nlimited data. We use simulations to evaluate this approach as compared with the\nstandard approach of using model selection to choose from a set of candidate\nmodels. We find that model selection erroneously favors models without tipping\npoints -- leading to harvest policies that guarantee extinction. The GPDP\nperforms nearly as well as the true model and significantly outperforms\nstandard approaches. We illustrate this using examples of simulated\nsingle-species dynamics, where the standard model selection approach should be\nmost effective, and find that it still fails to account for uncertainty\nappropriately and leads to population crashes, while management based on the\nGPDP does not, since it does not underestimate the uncertainty outside of the\nobserved data.\n", "versions": [{"version": "v1", "created": "Sat, 27 Dec 2014 21:08:13 GMT"}], "update_date": "2014-12-30", "authors_parsed": [["Boettiger", "Carl", ""], ["Mangel", "Marc", ""], ["Munch", "Stephan", ""]]}, {"id": "1412.8654", "submitter": "William Bialek", "authors": "Michele Castellana, William Bialek, Andrea Cavagna, and Irene Giardina", "title": "Entropic forces in a non-equilibrium system: Flocks of birds", "comments": null, "journal-ref": "Phys. Rev. E 93, 052416 (2016)", "doi": "10.1103/PhysRevE.93.052416", "report-no": null, "categories": "cond-mat.stat-mech physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When birds come together to form a flock, the distribution of their\nindividual velocities narrows around the mean velocity of the flock. We argue\nthat, in a broad class of models for the joint distribution of positions and\nvelocities, this narrowing generates an entropic force that opposes the\ncohesion of the flock. The strength of this force depends strongly on the\nnature of the interactions among birds: if birds are coupled to a fixed number\nof neighbors, the entropic forces are weak, while if they couple to all other\nbirds within a fixed distance, the entropic forces are sufficient to tear a\nflock apart. Similar entropic forces should occur in other non-equilibrium\nsystems. For the joint distribution of protein structures and amino-acid\nsequences, these forces favor the occurrence of \"highly designable\" structures.\n", "versions": [{"version": "v1", "created": "Tue, 30 Dec 2014 15:25:50 GMT"}], "update_date": "2016-06-01", "authors_parsed": [["Castellana", "Michele", ""], ["Bialek", "William", ""], ["Cavagna", "Andrea", ""], ["Giardina", "Irene", ""]]}]