[{"id": "1604.00051", "submitter": "Martine Barons Dr", "authors": "Aihua Xia, Richard M. Huggins, Martine J. Barons, Louis Guillot", "title": "A marked renewal process model for the size of a honey bee colony", "comments": "32 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.ST q-bio.PE stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many areas of agriculture rely on honey bees to provide pollination services\nand any decline in honey bee numbers can impact on global food security. In\norder to understand the dynamics of honey bee colonies we present a discrete\ntime marked renewal process model for the size of a colony. We demonstrate that\nunder mild conditions this attains a stationary distribution that depends on\nthe distribution of the numbers of eggs per batch, the probability an egg\nhatches and the distributions of the times between batches and bee lifetime.\nThis allows an analytic examination of the effect of changing these quantities.\nWe then extend this model to cyclic annual effects where for example the\nnumbers of eggs per batch and {the probability an egg hatches} may vary over\nthe year.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2016 20:55:21 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Xia", "Aihua", ""], ["Huggins", "Richard M.", ""], ["Barons", "Martine J.", ""], ["Guillot", "Louis", ""]]}, {"id": "1604.00055", "submitter": "Erik Gjesfjeld", "authors": "Erik Gjesfjeld, Jonathan Chang, Daniele Silvestro, Christopher Kelty\n  and Michael Alfaro", "title": "Competition and extinction explain the evolution of diversity in\n  American automobiles", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph q-bio.PE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  One of the most remarkable aspects of our species is that while we show\nsurprisingly little genetic diversity, we demonstrate astonishing amounts of\ncultural diversity. Perhaps most impressive is the diversity of our\ntechnologies, broadly defined as all the physical objects we produce and the\nskills we use to produce them. Despite considerable focus on the evolution of\ntechnology by social scientists and philosophers, there have been few attempts\nto systematically quantify technological diversity and therefore the dynamics\nof technological change remain poorly understood. Here we show a novel Bayesian\nmodel for examining technological diversification adopted from paleontological\nanalysis of occurrence data. We use this framework to estimate the tempo of\ndiversification in American car and truck models produced between 1896 and 2014\nand to test the relative importance of competition and extrinsic factors in\nshaping changes in macroevolutionary rates. Our results identify a four-fold\ndecrease in the origination and extinction rates of car models and a negative\nnet diversification rate over the last thirty years. We also demonstrate that\ncompetition played a more significant role in car model diversification than\neither changes in oil prices or gross domestic product. Together our analyses\nprovide a set of tools that can enhance current research on technological and\ncultural evolution by providing a flexible and quantitative framework for\nexploring the dynamics of diversification.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2016 21:26:17 GMT"}, {"version": "v2", "created": "Tue, 12 Apr 2016 15:11:06 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Gjesfjeld", "Erik", ""], ["Chang", "Jonathan", ""], ["Silvestro", "Daniele", ""], ["Kelty", "Christopher", ""], ["Alfaro", "Michael", ""]]}, {"id": "1604.00487", "submitter": "Thierry Mora", "authors": "Thierry Mora, Aleksandra Walczak", "title": "Quantifying lymphocyte receptor diversity", "comments": null, "journal-ref": "Systems Immunology, (ed. J. Das, C. Jayaprakash), Chapter 11\n  (2018)", "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.GN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To recognize pathogens, B and T lymphocytes are endowed with a wide\nrepertoire of receptors generated stochastically by V(D)J recombination.\nMeasuring and estimating the diversity of these receptors is of great\nimportance for understanding adaptive immunity. In this chapter we review\nrecent modeling approaches for analyzing receptor diversity from\nhigh-throughput sequencing data. We first clarify the various existing notions\nof diversity, with its many competing mathematical indices, and the different\nbiological levels at which it can be evaluated. We then describe inference\nmethods for characterizing the statistical diversity of receptors at different\nstages of their history: generation, selection and somatic evolution. We\ndiscuss the intrinsic difficulty of estimating the diversity of receptors\nrealized in a given individual from incomplete samples. Finally, we emphasize\nthe limitations of diversity defined at the level of receptor sequences, and\nadvocate the more relevant notion of functional diversity relative to the set\nof recognized antigens.\n", "versions": [{"version": "v1", "created": "Sat, 2 Apr 2016 11:01:07 GMT"}], "update_date": "2020-11-20", "authors_parsed": [["Mora", "Thierry", ""], ["Walczak", "Aleksandra", ""]]}, {"id": "1604.00507", "submitter": "Georgy Karev", "authors": "Georgy P. Karev and Irina G. Kareva", "title": "Mathematical Modeling of Extinction of Inhomogeneous Populations", "comments": "39 pages, 9 figures, submitted to BMB", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mathematical models of population extinction have a variety of applications\nin such areas as ecology, paleontology and conservation biology. Here we\npropose and investigate two types of sub-exponential models of population\nextinction.The results of performed analysis show that the principle of minimum\nof information loss is the underlying law for the evolution of a broad class of\nmodels of population extinction. Finally, we propose a possible application of\nthis modeling framework to mechanisms underlying time perception.\n", "versions": [{"version": "v1", "created": "Sat, 2 Apr 2016 14:14:13 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Karev", "Georgy P.", ""], ["Kareva", "Irina G.", ""]]}, {"id": "1604.00832", "submitter": "Henry Tuckwell", "authors": "Henry C. Tuckwell", "title": "Density independent population growth with random survival", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A simplified model for the growth of a population is studied in which random\neffects arise because reproducing individuals have a certain probability of\nsurviving until the next breeding season and hence contributing to the next\ngeneration. The resulting Markov chain is that of a branching process with a\nknown generating function. For parameter values leading to non-extinction, an\napproximating diffusion process is obtained for the population size.\n  Results are obtained for the number of offspring $r_h$ and the initial\npopulation size $N_0$ required to guarantee a given probabilty of survival. For\nlarge probabilities of survival, increasing the initial population size from\n$N_0=1$ to $N_0=2$ gives a very large decrease in required fecundity but\nfurther increases in $N_0$ lead to much smaller decreases in $r_h$. For small\nprobabilities (< 0.2) of survival the decreases in required fecundity when\n$N_0$ changes from 1 to 2 are very small. The calculations have relevance to\nthe survival of populations derived from colonizing individuals which could be\nany of a variety of organisms.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 12:22:30 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Tuckwell", "Henry C.", ""]]}, {"id": "1604.00976", "submitter": "Yaneer Bar-Yam", "authors": "Yaneer Bar-Yam", "title": "From Big Data To Important Information", "comments": "24 pages, 7 figures (Complexity, in press), New England Complex\n  Systems Institute Report 04-01-2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph nlin.AO q-bio.PE q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in science are being sought in newly available opportunities to\ncollect massive quantities of data about complex systems. While key advances\nare being made in detailed mapping of systems, how to relate this data to\nsolving many of the challenges facing humanity is unclear. The questions we\noften wish to address require identifying the impact of interventions on the\nsystem and that impact is not apparent in the detailed data that is available.\nHere we review key concepts and motivate a general framework for building\nlarger scale views of complex systems and for characterizing the importance of\ninformation in physical, biological and social systems. We provide examples of\nits application to evolutionary biology with relevance to ecology,\nbiodiversity, pandemics, and human lifespan, and in the context of social\nsystems with relevance to ethnic violence, global food prices, and stock market\npanic. Framing scientific inquiry as an effort to determine what is important\nand unimportant is a means for advancing our understanding and addressing many\npractical concerns, such as economic development or treating disease.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 18:31:43 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Bar-Yam", "Yaneer", ""]]}, {"id": "1604.01674", "submitter": "Sean Robinson", "authors": "C. Brandon Ogbunugafor and Sean P. Robinson", "title": "OFFl models: novel schema for dynamical modeling of biological systems", "comments": "23 pages, 6 figures. Revised to match published version in PLoS ONE", "journal-ref": "PLoS ONE 11(6): e0156844 (2016)", "doi": "10.1371/journal.pone.0156844", "report-no": null, "categories": "q-bio.QM q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Flow diagrams are a common tool used to help build and interpret models of\ndynamical systems, often in biological contexts such as consumer-resource\nmodels and similar compartmental models. Typically, their usage is intuitive\nand informal. Here, we present a formalized version of flow diagrams as a kind\nof weighted directed graph which follow a strict grammar, which translate into\na system of ordinary differential equations (ODEs) by a single unambiguous\nrule, and which have an equivalent representation as a relational database. (We\nabbreviate this schema of \"ODEs and formalized flow diagrams\" as OFFl.) Drawing\na diagram within this strict grammar encourages a mental discipline on the part\nof the modeler in which all dynamical processes of a system are thought of as\ninteractions between dynamical species that draw parcels from one or more\nsource species and deposit them into target species according to a set of\ntransformation rules. From these rules, the net rate of change for each species\ncan be derived. The modeling schema can therefore be understood as both an\nepistemic and practical heuristic for modeling, serving both as an\norganizational framework for the model building process and as a mechanism for\nderiving ODEs. All steps of the schema beyond the initial scientific\n(intuitive, creative) abstraction of natural observations into model variables\nare algorithmic and easily carried out by a computer, thus enabling the future\ndevelopment of a dedicated software implementation. Such tools would empower\nthe modeler to consider significantly more complex models than practical\nlimitations might have otherwise proscribed, since the modeling framework\nitself manages that complexity on the modeler's behalf. In this report, we\ndescribe the chief motivations for OFFl, outline its implementation, and\nutilize a range of classic examples from ecology and epidemiology to showcase\nits features.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 16:04:03 GMT"}, {"version": "v2", "created": "Wed, 8 Jun 2016 20:09:27 GMT"}], "update_date": "2016-06-10", "authors_parsed": [["Ogbunugafor", "C. Brandon", ""], ["Robinson", "Sean P.", ""]]}, {"id": "1604.01816", "submitter": "Brian Thomas", "authors": "Patrick J. Neale (SERC) and Brian C. Thomas (Washburn Univ.)", "title": "Solar irradiance changes and phytoplankton productivity in Earth's ocean\n  following astrophysical ionizing radiation events", "comments": "in Astrobiology, Vol. 16, Num. 4, 2016", "journal-ref": null, "doi": "10.1089/ast.2015.1360", "report-no": null, "categories": "astro-ph.EP astro-ph.HE physics.ao-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Two atmospheric responses to simulated astrophysical ionizing radiation\nevents significant to life on Earth are production of odd-nitrogen species,\nespecially NO2, and subsequent depletion of stratospheric ozone. Ozone\ndepletion increases incident short-wavelength ultraviolet radiation (UVB,\n280-315 nm) and longer ( > 600 nm) wavelengths of photosynthetically available\nradiation (PAR, 400 -700 nm). On the other hand, the NO2 haze decreases\natmospheric transmission in the long-wavelength UVA (315-400 nm) and short\nwavelength PAR. Here we use the results of previous simulations of incident\nspectral irradiance following an ionizing radiation event to predict changes in\nTerran productivity focusing on photosynthesis of marine phytoplankton. The\nprediction is based on a spectral model of photosynthetic response developed\nfor the dominant genera in central regions of the ocean (Synechococcus and\nProchlorococcus), and remote-sensing based observations of spectral water\ntransparency, temperature, wind speed and mixed layer depth. Predicted\nproductivity declined after a simulated ionizing event, but the effect\nintegrated over the water column was small. For integrations taking into\naccount the full depth range of PAR transmission (down to 0.1% of utilizable\nPAR), the decrease was at most 2-3% (depending on strain), with larger effects\n(5-7%) for integrations just to the depth of the surface mixed layer. The\ndeeper integrations were most affected by the decreased utilizable PAR at depth\ndue to the NO2 haze, whereas shallower integrations were most affected by the\nincreased surface UV.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 21:38:19 GMT"}], "update_date": "2016-04-08", "authors_parsed": [["Neale", "Patrick J.", "", "SERC"], ["Thomas", "Brian C.", "", "Washburn Univ."]]}, {"id": "1604.02096", "submitter": "Yoav Kallus", "authors": "Andrew Berdahl, Christa Brelsford, Caterina De Bacco, Marion Dumas,\n  Vanessa Ferdinand, Joshua A. Grochow, Laurent H\\'ebert-Dufresne, Yoav Kallus,\n  Christopher P. Kempes, Artemy Kolchinsky, Daniel B. Larremore, Eric Libby,\n  Eleanor A. Power, Caitlin A. Stern, Brendan Tracey (Santa Fe Institute\n  Postdocs)", "title": "Dynamics of beneficial epidemics", "comments": "The original version of this paper [v1] was produced, from conception\n  of idea, to execution, to writing, by a team in just 72 hours (see Appendix\n  of [v1]). This is a revised version", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.MA cs.SI nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pathogens can spread epidemically through populations. Beneficial contagions,\nsuch as viruses that enhance host survival or technological innovations that\nimprove quality of life, also have the potential to spread epidemically. How do\nthe dynamics of beneficial biological and social epidemics differ from those of\ndetrimental epidemics? We investigate this question using three theoretical\napproaches. First, in the context of population genetics, we show that a\nhorizontally-transmissible element that increases fitness, such as viral DNA,\nspreads superexponentially through a population, more quickly than a beneficial\nmutation. Second, in the context of behavioral epidemiology, we show that\ninfections that cause increased connectivity lead to superexponential fixation\nin the population. Third, in the context of dynamic social networks, we find\nthat preferences for increased global infection accelerate spread and produce\nsuperexponential fixation, but preferences for local assortativity halt\nepidemics by disconnecting the infected from the susceptible. We conclude that\nthe dynamics of beneficial biological and social epidemics are characterized by\nthe rapid spread of beneficial elements, which is facilitated in biological\nsystems by horizontal transmission and in social systems by active spreading\nbehavior of infected individuals.\n", "versions": [{"version": "v1", "created": "Thu, 7 Apr 2016 18:13:24 GMT"}, {"version": "v2", "created": "Fri, 17 Feb 2017 21:40:55 GMT"}], "update_date": "2017-02-21", "authors_parsed": [["Berdahl", "Andrew", "", "Santa Fe Institute\n  Postdocs"], ["Brelsford", "Christa", "", "Santa Fe Institute\n  Postdocs"], ["De Bacco", "Caterina", "", "Santa Fe Institute\n  Postdocs"], ["Dumas", "Marion", "", "Santa Fe Institute\n  Postdocs"], ["Ferdinand", "Vanessa", "", "Santa Fe Institute\n  Postdocs"], ["Grochow", "Joshua A.", "", "Santa Fe Institute\n  Postdocs"], ["Hébert-Dufresne", "Laurent", "", "Santa Fe Institute\n  Postdocs"], ["Kallus", "Yoav", "", "Santa Fe Institute\n  Postdocs"], ["Kempes", "Christopher P.", "", "Santa Fe Institute\n  Postdocs"], ["Kolchinsky", "Artemy", "", "Santa Fe Institute\n  Postdocs"], ["Larremore", "Daniel B.", "", "Santa Fe Institute\n  Postdocs"], ["Libby", "Eric", "", "Santa Fe Institute\n  Postdocs"], ["Power", "Eleanor A.", "", "Santa Fe Institute\n  Postdocs"], ["Stern", "Caitlin A.", "", "Santa Fe Institute\n  Postdocs"], ["Tracey", "Brendan", "", "Santa Fe Institute\n  Postdocs"]]}, {"id": "1604.02454", "submitter": "Sergio Estay", "authors": "Daniela N. Lopez, Patricio A. Camus, Nelson Valdivia and Sergio A.\n  Estay", "title": "High temporal variability in the occurrence of consumer-resource\n  interactions in ecological networks", "comments": "21 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ecological networks are theoretical abstractions that represent ecological\ncommunities. These networks are usually defined as static entities, in which\nthe occurrence of a particular interaction between species is considered fixed\ndespite the intrinsic dynamics of ecological systems. However, empirical\nanalysis of the temporal variation of trophic interactions is constrained by\nthe lack of data with high spatial, temporal, and taxonomic resolution. Here,\nwe evaluate the spatiotemporal variability of multiple consumer-resource\ninteractions of large marine networks. The tropic interactions of all of the\nanalyzed networks had low temporal persistence, which was well described by a\ncommon exponential decay in the rank-frequency relationship of\nconsumer-resource interactions. This common pattern of low temporal persistence\nwas evident despite the dissimilarities of environmental conditions among\nsites. Between-site rank correlations of frequency of occurrence of\ninteractions ranged from 0.59 to 0.73. After removing the interactions with\n<50% frequency, the between-site correlations decreased to values between 0.60\nand 0.28, indicating that low-frequency interactions accounted for the apparent\nsimilarities between sites. Our results showed that the communities studied\nwere characterized by few persistent interactions and a large number of\ntransient trophic interactions. We suggest that consumer-resource temporal\nasynchrony in addition to varying local environmental conditions and\nopportunistic foraging could be among the mechanisms generating the observed\nrank-frequency relationship of trophic interactions. Therefore, our results\nquestion the analysis of ecological communities as static and persistent\nnatural entities and stress the need for strengthening the analysis of temporal\nvariability in ecological networks and long-term studies.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2016 19:20:42 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Lopez", "Daniela N.", ""], ["Camus", "Patricio A.", ""], ["Valdivia", "Nelson", ""], ["Estay", "Sergio A.", ""]]}, {"id": "1604.02630", "submitter": "Hui Yang", "authors": "Hui Yang, Tim Rogers, Thilo Gross", "title": "Network Inoculation: Heteroclinics and phase transitions in an epidemic\n  model", "comments": "26 pages, 11 figures", "journal-ref": null, "doi": "10.1063/1.4961249", "report-no": null, "categories": "physics.soc-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In epidemiological modelling, dynamics on networks, and in particular\nadaptive and heterogeneous networks have recently received much interest. Here\nwe present a detailed analysis of a previously proposed model that combines\nheterogeneity in the individuals with adaptive rewiring of the network\nstructure in response to a disease. We show that in this model qualitative\nchanges in the dynamics occur in two phase transitions. In a macroscopic\ndescription one of these corresponds to a local bifurcation whereas the other\none corresponds to a non-local heteroclinic bifurcation. This model thus\nprovides a rare example of a system where a phase transition is caused by a\nnon-local bifurcation, while both micro- and macro-level dynamics are\naccessible to mathematical analysis. The bifurcation points mark the onset of a\nbehaviour that we call network inoculation. In the respective parameter region\nexposure of the system to a pathogen will lead to an outbreak that collapses,\nbut leaves the network in a configuration where the disease cannot reinvade,\ndespite every agent returning to the susceptible class. We argue that this\nbehaviour and the associated phase transitions can be expected to occur in a\nwide class of models of sufficient complexity.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 03:01:13 GMT"}], "update_date": "2016-09-21", "authors_parsed": [["Yang", "Hui", ""], ["Rogers", "Tim", ""], ["Gross", "Thilo", ""]]}, {"id": "1604.02733", "submitter": "Thibaud Taillefumier", "authors": "Thibaud Taillefumier, Anna Posfai, Yigal Meir and Ned S. Wingreen", "title": "Bacterial cartels at steady supply", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metagenomics has revealed hundreds of bacterial species in almost all\nmicrobiota. In a few well-studied cases, bacterial communities have been\nobserved to coordinate their metabolic fluxes. In principle, bacteria can\ndivide tasks to reap the benefits of specialization, as in human economies.\nHowever, the benefits and stability of an economy of bacterial specialists are\nfar from obvious. Here, we physically model the population dynamics of bacteria\nthat compete for steadily supplied resources. Importantly, we explicitly model\nthe metabolic fluxes yielding cellular biomass production under the constraint\nof a limited enzyme budget. In our framework, we find that population dynamics\ngenerally leads to the coexistence of different metabolic types, which satisfy\nan extended competitive exclusion principle (even allowing for adaptive\nmutation). We establish that these consortia act as cartels, whereby population\ndynamics pins down resource concentrations at values for which no other\nstrategy can invade. Finally, we propose that at steady supply, cartels of\ncompeting strategies automatically yield maximum biomass, thereby achieving a\ncollective optimum.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 21:01:53 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Taillefumier", "Thibaud", ""], ["Posfai", "Anna", ""], ["Meir", "Yigal", ""], ["Wingreen", "Ned S.", ""]]}, {"id": "1604.03558", "submitter": "Sandra K\\\"onig", "authors": "Sandra K\\\"onig", "title": "Error Propagation Through a Network With Non-Uniform Failure", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.AP cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A central concern of network operators is to estimate the probability of an\nincident that affects a significant part and thus may yield to a breakdown. We\nanswer this question by modeling how a failure of either a node or an edge will\naffect the rest of the network using percolation theory. Our model is general\nin the sense that it only needs two inputs: the topology of the network and the\nchances of failure of its components. These chances may vary to represent\ndifferent types of edges having different tendencies to fail. We illustrate the\napproach by an example, for which we can even obtain closed form expressions\nfor the likelihood of an outbreak remaining bounded or spreading unlimitedly.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2016 12:52:10 GMT"}, {"version": "v2", "created": "Wed, 21 Feb 2018 08:57:50 GMT"}], "update_date": "2018-02-22", "authors_parsed": [["König", "Sandra", ""]]}, {"id": "1604.03676", "submitter": "Sona John", "authors": "Kavita Jain and Sona John", "title": "Deterministic evolution of an asexual population under the action of\n  beneficial and deleterious mutations on additive fitness landscapes", "comments": "To appear in Theoretical Population Biology", "journal-ref": "Theo. Pop. Biol. 112, 117-125 (2016)", "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a continuous time model for the frequency distribution of an\ninfinitely large asexual population in which both beneficial and deleterious\nmutations occur and the fitness is additive. When beneficial mutations are\nignored, the exact solution for the frequency distribution is known to be a\nPoisson distribution. Here we include beneficial mutations and obtain exact\nexpressions for the frequency distribution at all times using an eigenfunction\nexpansion method. We find that the stationary distribution is non-Poissonian\nand related to the Bessel function of the first kind. We also provide suitable\napproximations for the stationary distribution and the time to relax to the\nsteady state. Our exact results, especially at mutation-selection equilibrium,\ncan be useful in developing semi-deterministic approaches to understand\nstochastic evolution.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 07:10:31 GMT"}, {"version": "v2", "created": "Wed, 31 Aug 2016 12:49:15 GMT"}], "update_date": "2016-10-27", "authors_parsed": [["Jain", "Kavita", ""], ["John", "Sona", ""]]}, {"id": "1604.03731", "submitter": "Xiao-Long Peng", "authors": "Xiao-Long Peng, Xin-Jian Xu, Michael Small, Xinchu Fu, Zhen Jin", "title": "Prevention of infectious diseases by public vaccination and individual\n  protection", "comments": "36 pages, 12 figures, 2 tables, Springer-tex (SVJour3 document class)", "journal-ref": "Journal of Mathematical Biology, 73(6), 1561-1594 (2016)", "doi": "10.1007/s00285-016-1007-3", "report-no": null, "categories": "physics.soc-ph cs.SI nlin.AO physics.bio-ph q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the face of serious infectious diseases, governments endeavour to\nimplement containment measures such as public vaccination at a macroscopic\nlevel. Meanwhile, individuals tend to protect themselves by avoiding contacts\nwith infections at a microscopic level. However, a comprehensive understanding\nof how such combined strategy influences epidemic dynamics is still lacking. We\nstudy a susceptible-infected-susceptible epidemic model with imperfect\nvaccination on dynamic contact networks, where the macroscopic intervention is\nrepresented by random vaccination of the population and the microscopic\nprotection is characterised by susceptible individuals rewiring contacts from\ninfective neighbours. In particular, the model is formulated both in\npopulations without and then with demographic effects. Using the pairwise\napproximation and the probability generating function approach, we investigate\nboth dynamics of the epidemic and the underlying network. For populations\nwithout demography, the emerging degree correlations, bistable states, and\noscillations demonstrate the combined effects of the public vaccination program\nand individual protective behavior. Compared to either strategy in isolation,\nthe combination of public vaccination and individual protection is more\neffective in preventing and controlling the spread of infectious diseases by\nincreasing both the invasion threshold and the persistence threshold. For\npopulations with additional demographic factors, the integration between\nvaccination intervention and individual rewiring may promote epidemic spreading\ndue to the birth effect. Moreover, the degree distributions of both networks in\nthe steady state is closely related to the degree distribution of newborns,\nwhich leads to uncorrelated connectivity. All the results demonstrate the\nimportance of both local protection and global intervention, as well as the\ndemographic effects.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 12:23:11 GMT"}, {"version": "v2", "created": "Thu, 21 Apr 2016 01:14:56 GMT"}], "update_date": "2016-10-20", "authors_parsed": [["Peng", "Xiao-Long", ""], ["Xu", "Xin-Jian", ""], ["Small", "Michael", ""], ["Fu", "Xinchu", ""], ["Jin", "Zhen", ""]]}, {"id": "1604.04008", "submitter": "Daozhou Gao", "authors": "Daozhou Gao, Yijun Lou, Daihai He, Travis C. Porco, Yang Kuang,\n  Gerardo Chowell, Shigui Ruan", "title": "Prevention and control of Zika fever as a mosquito-borne and sexually\n  transmitted disease", "comments": null, "journal-ref": "Scientific Reports, 2016 6: 28070", "doi": "10.1038/srep28070", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ongoing Zika virus (ZIKV) epidemic poses a major global public health\nemergency. It is known that ZIKV is spread by \\textit{Aedes} mosquitoes, recent\nstudies show that ZIKV can also be transmitted via sexual contact and cases of\nsexually transmitted ZIKV have been confirmed in the U.S., France, and Italy.\nHow sexual transmission affects the spread and control of ZIKV infection is not\nwell-understood. We presented a mathematical model to investigate the impact of\nmosquito-borne and sexual transmission on spread and control of ZIKV and used\nthe model to fit the ZIKV data in Brazil, Colombia, and El Salvador. Based on\nthe estimated parameter values, we calculated the median and confidence\ninterval of the basic reproduction number R0=2.055 (95% CI: 0.523-6.300), in\nwhich the distribution of the percentage of contribution by sexual transmission\nis 3.044 (95% CI: 0.123-45.73). Our study indicates that R0 is most sensitive\nto the biting rate and mortality rate of mosquitoes while sexual transmission\nincreases the risk of infection and epidemic size and prolongs the outbreak. In\norder to prevent and control the transmission of ZIKV, it must be treated as\nnot only a mosquito-borne disease but also a sexually transmitted disease.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 01:34:19 GMT"}], "update_date": "2016-07-08", "authors_parsed": [["Gao", "Daozhou", ""], ["Lou", "Yijun", ""], ["He", "Daihai", ""], ["Porco", "Travis C.", ""], ["Kuang", "Yang", ""], ["Chowell", "Gerardo", ""], ["Ruan", "Shigui", ""]]}, {"id": "1604.04145", "submitter": "Paul Jenkins", "authors": "Robert C. Griffiths, Paul A. Jenkins, and Sabin Lessard", "title": "A coalescent dual process for a Wright-Fisher diffusion with\n  recombination and its application to haplotype partitioning", "comments": "This version corrects typographical errors in equations (25), (26),\n  (27), (B.3), (B.4). 39 pages, 3 figures", "journal-ref": "Theoretical Population Biology, 112: 126-138 (2016)", "doi": "10.1016/j.tpb.2016.08.007", "report-no": null, "categories": "q-bio.PE math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Duality plays an important role in population genetics. It can relate results\nfrom forwards-in-time models of allele frequency evolution with those of\nbackwards-in-time genealogical models; a well known example is the duality\nbetween the Wright-Fisher diffusion for genetic drift and its genealogical\ncounterpart, the coalescent. There have been a number of articles extending\nthis relationship to include other evolutionary processes such as mutation and\nselection, but little has been explored for models also incorporating crossover\nrecombination. Here, we derive from first principles a new genealogical process\nwhich is dual to a Wright-Fisher diffusion model of drift, mutation, and\nrecombination. Our approach is based on expressing a putative duality\nrelationship between two models via their infinitesimal generators, and then\nseeking an appropriate test function to ensure the validity of the duality\nequation. This approach is quite general, and we use it to find dualities for\nseveral important variants, including both a discrete L-locus model of a gene\nand a continuous model in which mutation and recombination events are scattered\nalong the gene according to continuous distributions. As an application of our\nresults, we derive a series expansion for the transition function of the\ndiffusion. Finally, we study in further detail the case in which mutation is\nabsent. Then the dual process describes the dispersal of ancestral genetic\nmaterial across the ancestors of a sample. The stationary distribution of this\nprocess is of particular interest; we show how duality relates this\ndistribution to haplotype fixation probabilities. We develop an efficient\nmethod for computing such probabilities in multilocus models.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 13:17:06 GMT"}, {"version": "v2", "created": "Fri, 26 Aug 2016 08:44:50 GMT"}, {"version": "v3", "created": "Fri, 28 Jun 2019 14:27:26 GMT"}, {"version": "v4", "created": "Thu, 8 Aug 2019 09:05:10 GMT"}], "update_date": "2019-08-09", "authors_parsed": [["Griffiths", "Robert C.", ""], ["Jenkins", "Paul A.", ""], ["Lessard", "Sabin", ""]]}, {"id": "1604.04214", "submitter": "Liane Gabora", "authors": "Liane Gabora and Stuart Kauffman", "title": "Toward an Evolutionary-Predictive Foundation for Creativity", "comments": "13 pages; 1 figure", "journal-ref": "Psychonomic Bulletin & Review, 23(2), 632-639", "doi": null, "report-no": null, "categories": "q-bio.NC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dietrich and Haider (2014) justify their integrative framework for creativity\nfounded on evolutionary theory and prediction research on the grounds that\n\"theories and approaches guiding empirical research on creativity have not been\nsupported by the neuroimaging evidence\". Although this justification is\ncontroversial, the general direction holds promise. This commentary clarifies\npoints of disagreement and unresolved issues, and addresses mis-applications of\nevolutionary theory that lead the authors to adopt a Darwinian (versus\nLamarckian) approach. To say that creativity is Darwinian is not to say that it\nconsists of variation plus selection---in the everyday sense of the term---as\nthe authors imply; it is to say that evolution is occurring because selection\nis affecting the distribution of randomly generated heritable variation across\ngenerations. In creative thought the distribution of variants is not key, i.e.,\none is not inclined toward idea A because 60% of one's candidate ideas are\nvariants of A while only 40% are variants of B; one is inclined toward\nwhichever seems best. The authors concede that creative variation is partly\ndirected; however, the greater the extent to which variants are generated\nnon-randomly, the greater the extent to which the distribution of variants can\nreflect not selection but the initial generation bias. Since each thought in a\ncreative process can alter the selective criteria against which the next is\nevaluated, there is no demarcation into generations as assumed in a Darwinian\nmodel. We address the authors' claim that reduced variability and individuality\nare more characteristic of Lamarckism than Darwinian evolution, and note that a\nLamarckian approach to creativity has addressed the challenge of modeling the\nemergent features associated with insight.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 16:47:13 GMT"}], "update_date": "2016-04-15", "authors_parsed": [["Gabora", "Liane", ""], ["Kauffman", "Stuart", ""]]}, {"id": "1604.04270", "submitter": "Attila Szolnoki", "authors": "Attila Szolnoki, Matjaz Perc", "title": "Collective influence in evolutionary social dilemmas", "comments": "6 pages, 5 figures; accepted for publication in Europhysics Letters", "journal-ref": "EPL 113 (2016) 58004", "doi": "10.1209/0295-5075/113/58004", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.GT q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When evolutionary games are contested in structured populations, the degree\nof each player in the network plays an important role. If they exist, hubs\noften determine the fate of the population in remarkable ways. Recent research\nbased on optimal percolation in random networks has shown, however, that the\ndegree is neither the sole nor the best predictor of influence in complex\nnetworks. Low-degree nodes may also be optimal influencers if they are\nhierarchically linked to hubs. Taking this into account leads to the formalism\nof collective influence in complex networks, which as we show here, has\nfar-reaching implications for the favorable resolution of social dilemmas. In\nparticular, there exists an optimal hierarchical depth for the determination of\ncollective influence that we use to describe the potency of players for passing\ntheir strategies, which depends on the strength of the social dilemma.\nInterestingly, the degree, which corresponds to the baseline depth zero, is\noptimal only when the temptation to defect is small. Our research reveals that\nevolutionary success stories are related to spreading processes which are\nrooted in favorable hierarchical structures that extend beyond local\nneighborhoods.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 19:36:14 GMT"}], "update_date": "2016-04-15", "authors_parsed": [["Szolnoki", "Attila", ""], ["Perc", "Matjaz", ""]]}, {"id": "1604.04466", "submitter": "Alain Barrat", "authors": "Julie Fournet and Alain Barrat", "title": "Epidemic risk from friendship network data: an equivalence with a\n  non-uniform sampling of contact networks", "comments": null, "journal-ref": "Sci. Rep. 6:24593 (2016)", "doi": "10.1038/srep24593", "report-no": null, "categories": "physics.soc-ph cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Contacts between individuals play an important role in determining how\ninfectious diseases spread. Various methods to gather data on such contacts\nco-exist, from surveys to wearable sensors. Comparisons of data obtained by\ndifferent methods in the same context are however scarce, in particular with\nrespect to their use in data-driven models of spreading processes. Here, we use\na combined data set describing contacts registered by sensors and friendship\nrelations in the same population to address this issue in a case study. We\ninvestigate if the use of the friendship network is equivalent to a sampling\nprocedure performed on the sensor contact network with respect to the outcome\nof simulations of spreading processes: such an equivalence might indeed give\nhints on ways to compensate for the incompleteness of contact data deduced from\nsurveys. We show that this is indeed the case for these data, for a\nspecifically designed sampling procedure, in which respondents report their\nneighbors with a probability depending on their contact time. We study the\nimpact of this specific sampling procedure on several data sets, discuss\nlimitations of our approach and its possible applications in the use of data\nsets of various origins in data-driven simulations of epidemic processes.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 12:48:17 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Fournet", "Julie", ""], ["Barrat", "Alain", ""]]}, {"id": "1604.04496", "submitter": "Daniel Sousa", "authors": "Daniel Sousa and Christopher Small", "title": "Spatial Structure and Scaling of Agricultural Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Considering agricultural landscapes as networks can provide information about\nspatial connectivity relevant for a wide range of applications including\npollination, pest management, and ecology. Global agricultural networks are\nwell-described by power law rank-size distributions. However, regional analyses\ncapture only a subset of the total global network. Most analyses are regional.\nIn this paper, we seek to address the following questions: Does the globally\nobserved scale-free property of agricultural networks hold over smaller spatial\ndomains? Can similar properties be observed at kilometer to meter scales? We\nanalyze 9 intensively cultivated Landsat scenes on 5 continents with a wide\nrange of vegetation distributions. We find that networks of vegetation fraction\nwithin the domain of each of these Landsat scenes exhibit substantial\nvariability - but still possess similar scaling properties to the global\ndistribution of agriculture. We also find similar results using a 39 km2 IKONOS\nimage. To illustrate an application of spatial network analysis, we show an\nexample of network disruption. We compare two networks with similar rank-size\ndistributions that behave differently when nodes are progressively removed. We\nsuggest that treating agricultural land cover as spatial networks can provide a\nstraightforward way of characterizing the connectivity of complex spatial\ndistributions of agriculture across a wide range of landscapes and at spatial\nscales relevant for practical agricultural applications.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 13:36:48 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Sousa", "Daniel", ""], ["Small", "Christopher", ""]]}, {"id": "1604.04553", "submitter": "Pieter Trapman", "authors": "Pieter Trapman, Frank Ball, Jean-St\\'ephane Dhersin, Viet Chi Tran,\n  Jacco Wallinga and Tom Britton", "title": "Inferring $R_0$ in emerging epidemics - the effect of common population\n  structure is small", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When controlling an emerging outbreak of an infectious disease it is\nessential to know the key epidemiological parameters, such as the basic\nreproduction number $R_0$ and the control effort required to prevent a large\noutbreak. These parameters are estimated from the observed incidence of new\ncases and information about the infectious contact structures of the population\nin which the disease spreads. However, the relevant infectious contact\nstructures for new, emerging infections are often unknown or hard to obtain.\nHere we show that for many common true underlying heterogeneous contact\nstructures, the simplification to neglect such structures and instead assume\nthat all contacts are made homogeneously in the whole population, results in\nconservative estimates for $R_0$ and the required control effort. This means\nthat robust control policies can be planned during the early stages of an\noutbreak, using such conservative estimates of the required control effort.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 16:06:53 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Trapman", "Pieter", ""], ["Ball", "Frank", ""], ["Dhersin", "Jean-Stéphane", ""], ["Tran", "Viet Chi", ""], ["Wallinga", "Jacco", ""], ["Britton", "Tom", ""]]}, {"id": "1604.04588", "submitter": "Stephen Pankavich", "authors": "Tyson Loudon and Stephen Pankavich", "title": "Mathematical Analysis and Dynamic Active Subspaces for a Long term model\n  of HIV", "comments": "26 pages, 17 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, a long-term model of HIV infection dynamics was developed to\ndescribe the entire time course of the disease. It consists of a large system\nof ODEs with many parameters, and is expensive to simulate. In the current\npaper, this model is analyzed by determining all infection-free steady states\nand studying the local stability properties of the unique biologically-relevant\nequilibrium. Active subspace methods are then used to perform a global\nsensitivity analysis and study the dependence of an infected individual's\nT-cell count on the parameter space. Building on these results, a\nglobal-in-time approximation of the T-cell count is created by constructing\ndynamic active subspaces and reduced order models are generated, thereby\nallowing for inexpensive computation.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 18:13:48 GMT"}, {"version": "v2", "created": "Mon, 18 Apr 2016 20:35:33 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Loudon", "Tyson", ""], ["Pankavich", "Stephen", ""]]}, {"id": "1604.04883", "submitter": "Steven Frank", "authors": "Steven A. Frank", "title": "The invariances of power law size distributions", "comments": "Added appendix discussing the lognormal distribution, updated to\n  match version 2 of published version at F1000Research", "journal-ref": "F1000Research 2016, 5:2074", "doi": "10.12688/f1000research.9452.2", "report-no": null, "categories": "q-bio.PE math.PR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Size varies. Small things are typically more frequent than large things. The\nlogarithm of frequency often declines linearly with the logarithm of size. That\npower law relation forms one of the common patterns of nature. Why does the\ncomplexity of nature reduce to such a simple pattern? Why do things as\ndifferent as tree size and enzyme rate follow similarly simple patterns? Here I\nanalyze such patterns by their invariant properties. For example, a common\npattern should not change when adding a constant value to all observations.\nThat shift is essentially the renumbering of the points on a ruler without\nchanging the metric information provided by the ruler. A ruler is shift\ninvariant only when its scale is properly calibrated to the pattern being\nmeasured. Stretch invariance corresponds to the conservation of the total\namount of something, such as the total biomass and consequently the average\nsize. Rotational invariance corresponds to pattern that does not depend on the\norder in which underlying processes occur, for example, a scale that additively\ncombines the component processes leading to observed values. I use tree size as\nan example to illustrate how the key invariances shape pattern. A simple\ninterpretation of common pattern follows. That simple interpretation connects\nthe normal distribution to a wide variety of other common patterns through the\ntransformations of scale set by the fundamental invariances.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 15:23:53 GMT"}, {"version": "v2", "created": "Thu, 25 Aug 2016 20:23:55 GMT"}, {"version": "v3", "created": "Mon, 7 Nov 2016 18:34:25 GMT"}], "update_date": "2016-11-08", "authors_parsed": [["Frank", "Steven A.", ""]]}, {"id": "1604.04913", "submitter": "Kevin Leder", "authors": "Qie He, Junfeng Zhu, David Dingli, Jasmine Foo, Kevin Leder", "title": "Optimized Treatment Schedules for Chronic Myeloid Leukemia", "comments": "26 pages, 7 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1005129", "report-no": null, "categories": "q-bio.TO math.OC q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Over the past decade, several targeted therapies (e.g. imatinib, dasatinib,\nnilotinib) have been developed to treat Chronic Myeloid Leukemia (CML). Despite\nan initial response to therapy, drug resistance remains a problem for some CML\npatients. Recent studies have shown that resistance mutations that preexist\ntreatment can be detected in a substan- tial number of patients, and that this\nmay be associated with eventual treatment failure. One proposed method to\nextend treatment efficacy is to use a combination of multiple targeted\ntherapies. However, the design of such combination therapies (timing, sequence,\netc.) remains an open challenge. In this work we mathematically model the\ndynamics of CML response to combination therapy and analyze the impact of\ncombination treatment schedules on treatment efficacy in patients with\npreexisting resistance. We then propose an optimization problem to find the\nbest schedule of multiple therapies based on the evolution of CML according to\nour ordinary differential equation model. This resulting optimiza- tion problem\nis nontrivial due to the presence of ordinary different equation constraints\nand integer variables. Our model also incorporates realistic drug toxicity\nconstraints by tracking the dynamics of patient neutrophil counts in response\nto therapy. Using realis- tic parameter estimates, we determine optimal\ncombination strategies that maximize time until treatment failure.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 19:16:17 GMT"}], "update_date": "2017-02-08", "authors_parsed": [["He", "Qie", ""], ["Zhu", "Junfeng", ""], ["Dingli", "David", ""], ["Foo", "Jasmine", ""], ["Leder", "Kevin", ""]]}, {"id": "1604.04935", "submitter": "Kasthuri Kannan", "authors": "Kasthuri Kannan and Adriana Heguy", "title": "Why Mutant Allele Frequencies in Oncogenes Peak Around 0.40 and Rapidly\n  Decrease?", "comments": "Main article 6 pages. Contains Abstract, Main Article, 1\n  Supplementary Figure, 1 Supplementary Method. Supplementary Table\n  (Supplementary Table 1) and MATLAB code available upon request", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The mutant allele frequencies in oncogenes peak around 0.40 and rapidly\ndecrease. In this article, we explain why this is the case. Invoking a key\nresult from mathematical analysis in our model, namely, the inverse function\ntheorem, we estimate the selection pressures of the mutations as a function of\ngermline allele frequencies. Under complete dominance of oncogenic mutations,\nthis selection function is expected to be linearly correlated with the\ndistribution of the mutant alleles. We demonstrate that this is the case by\ninvestigating the allele frequencies of mutations in oncogenes across various\ncancer types, validating our model for mean effective selection. Consistent\nwith the population genetics model of fitness, the selection function fits a\ngamma distribution curve that accurately describes the trend of the mutant\nallele frequencies. While existing equations for selection explain evolution at\nlow allele frequencies, our equations are general formulas for natural\nselection under complete dominance operating at all frequencies. We show that\nselection exhibits linear behavior at all times, favoring dominant alleles with\nrespect to the change in recessive allele frequency. Also, these equations\nshow, selection behaves like power-law against the recessive alleles at low\ndominant allele frequency.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 22:29:12 GMT"}, {"version": "v2", "created": "Mon, 25 Apr 2016 15:14:45 GMT"}], "update_date": "2016-04-26", "authors_parsed": [["Kannan", "Kasthuri", ""], ["Heguy", "Adriana", ""]]}, {"id": "1604.04936", "submitter": "Michael D Nicholson", "authors": "Michael D. Nicholson and Tibor Antal", "title": "Universal asymptotic clone size distribution for general population\n  growth", "comments": "22 pages, 4 figures. To appear in the Bulletin of Mathematical\n  Biology doi:10.1007/s11538-016-0221-x", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Deterministically growing (wild-type) populations which seed stochastically\ndeveloping mutant clones have found an expanding number of applications from\nmicrobial populations to cancer. The special case of exponential wild-type\npopulation growth, usually termed the Luria-Delbr\\\"uck or Lea-Coulson model, is\noften assumed but seldom realistic. In this article we generalise this model to\ndifferent types of wild-type population growth, with mutants evolving as a\nbirth-death branching process. Our focus is on the size distribution of clones\n- that is the number of progeny of a founder mutant - which can be mapped to\nthe total number of mutants. Exact expressions are derived for exponential,\npower-law and logistic population growth. Additionally for a large class of\npopulation growth we prove that the long time limit of the clone size\ndistribution has a general two-parameter form, whose tail decays as a\npower-law. Considering metastases in cancer as the mutant clones, upon\nanalysing a data-set of their size distribution, we indeed find that a\npower-law tail is more likely than an exponential one.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 22:35:25 GMT"}, {"version": "v2", "created": "Wed, 26 Oct 2016 13:59:14 GMT"}], "update_date": "2016-10-27", "authors_parsed": [["Nicholson", "Michael D.", ""], ["Antal", "Tibor", ""]]}, {"id": "1604.05364", "submitter": "John Rhodes", "authors": "Elizabeth S. Allman, James H. Degnan, John A. Rhodes", "title": "Species tree inference from gene splits by Unrooted STAR methods", "comments": "7 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.ST stat.TH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The $\\text{NJ}_{st}$ method was proposed by Liu and Yu to infer a species\ntree topology from unrooted topological gene trees. While its statistical\nconsistency under the multispecies coalescent model was established only for a\n4-taxon tree, simulations demonstrated its good performance on gene trees\ninferred from sequences for many taxa. Here we prove the statistical\nconsistency of the method for an arbitrarily large species tree. Our approach\nconnects $\\text{NJ}_{st}$ to a generalization of the STAR method of Liu, Pearl\nand Edwards, and a previous theoretical analysis of it. We further show\n$\\text{NJ}_{st}$ utilizes only the distribution of splits in the gene trees,\nand not their individual topologies. Finally, we discuss how multiple samples\nper taxon per gene should be handled for statistical consistency.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 22:20:33 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Allman", "Elizabeth S.", ""], ["Degnan", "James H.", ""], ["Rhodes", "John A.", ""]]}, {"id": "1604.06121", "submitter": "Chathika Gunaratne", "authors": "Chathika Gunaratne, Mustafa Ilhan Akbas, Ivan Garibay, Ozlem Ozmen", "title": "Evaluation of Zika Vector Control Strategies Using Agent-Based Modeling", "comments": "14 pages, 6 figures, 1 table, conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Aedes Aegypti is the vector of several deadly diseases, including Zika.\nEffective and sustainable vector control measures must be deployed to keep A.\naegypti numbers under control. The distribution of A. Aegypti is subject to\nspatial and climatic constraints. Using agent-based modeling, we model the\npopulation dynamics of A. aegypti subjected to the spatial and climatic\nconstraints of a neighborhood in the Key West. Satellite imagery was used to\nidentify vegetation, houses (CO2 zones) both critical to the mosquito\nlifecycle. The model replicates the seasonal fluctuation of adult population\nsampled through field studies and approximates the population at a high of 986\n(95% CI: [979, 993]) females and 1031 (95% CI: [1024, 1039]) males in the fall\nand a low of 316 (95% CI: [313, 319]) females and 333 (95% CI: [330, 336])\nmales during the winter. We then simulate two biological vector control\nstrategies: 1) Wolbachia infection and 2) Release of Insects carrying a\nDominant Lethal gene (RIDL). Our results support the probability of sustained\nWolbachia infection within the population for two years after the year of\nrelease. egies, our approach provides a realistic simulation environment\nconsisting of male and female Aedes aegypti, breeding spots, vegetation and CO2\nsources.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 20:52:41 GMT"}, {"version": "v2", "created": "Thu, 4 Aug 2016 18:11:18 GMT"}], "update_date": "2016-08-05", "authors_parsed": [["Gunaratne", "Chathika", ""], ["Akbas", "Mustafa Ilhan", ""], ["Garibay", "Ivan", ""], ["Ozmen", "Ozlem", ""]]}, {"id": "1604.06132", "submitter": "Ekkehard Beck", "authors": "Ekkehard Beck, Benjamin Armbruster", "title": "Optimal timing of cross-sectional network samples in longitudinal\n  network studies", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE stat.ME", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When choosing the timing of cross-sectional network snapshots in longitudinal\nsocial network studies, the effect on the precision of parameter estimates\ngenerally plays a minor role. Often the timing is opportunistic or determined\nby a variety of considerations such as organizational constraints, funding, and\navailability of study participants. Theory to guide the timing of network\nsnapshots is also missing. We use a statistical framework to relate the timing\nto the precision of the parameter estimates, specifically, the sum of the\nrelative widths of their confidence intervals. We illustrate this\ncomputationally using the STERGM suite of the statnet package to estimate the\nparameters of the network dynamics. Analytically, we derive simple\napproximations for the optimal timing when the parameters correspond to the\nrates for different network events. We find that the optimal time depends the\nmost on the network processes with short expected durations and few expected\nevents such as the dissolution of ties. We apply our approximations to a simple\nexample of a dynamic network with formation and dissolution of iid ties.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 22:16:26 GMT"}], "update_date": "2016-04-22", "authors_parsed": [["Beck", "Ekkehard", ""], ["Armbruster", "Benjamin", ""]]}, {"id": "1604.06299", "submitter": "Christoph Adami", "authors": "Thomas LaBar and Christoph Adami", "title": "Different evolutionary paths to complexity for small and large\n  populations of digital organisms", "comments": "22 pages, 5 figures, 7 Supporting Figures and 1 Supporting Table", "journal-ref": "PLoS Computational Biology 12 (2016) e1005066", "doi": "10.1371/journal.pcbi.1005066", "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A major aim of evolutionary biology is to explain the respective roles of\nadaptive versus non-adaptive changes in the evolution of complexity. While\nselection is certainly responsible for the spread and maintenance of complex\nphenotypes, this does not automatically imply that strong selection enhances\nthe chance for the emergence of novel traits, that is, the origination of\ncomplexity. Population size is one parameter that alters the relative\nimportance of adaptive and non-adaptive processes: as population size\ndecreases, selection weakens and genetic drift grows in importance. Because of\nthis relationship, many theories invoke a role for population size in the\nevolution of complexity. Such theories are difficult to test empirically\nbecause of the time required for the evolution of complexity in biological\npopulations. Here, we used digital experimental evolution to test whether large\nor small asexual populations tend to evolve greater complexity. We find that\nboth small and large---but not intermediate-sized---populations are favored to\nevolve larger genomes, which provides the opportunity for subsequent increases\nin phenotypic complexity. However, small and large populations followed\ndifferent evolutionary paths towards these novel traits. Small populations\nevolved larger genomes by fixing slightly deleterious insertions, while large\npopulations fixed rare beneficial insertions that increased genome size. These\nresults demonstrate that genetic drift can lead to the evolution of complexity\nin small populations and that purifying selection is not powerful enough to\nprevent the evolution of complexity in large populations.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 13:36:33 GMT"}], "update_date": "2017-01-17", "authors_parsed": [["LaBar", "Thomas", ""], ["Adami", "Christoph", ""]]}, {"id": "1604.06300", "submitter": "Serge Sheremet'ev", "authors": "Serge Sheremet'ev, Xenia Chebotareva", "title": "Current and Cretaceous-Cenozoic diversification of Angiosperms", "comments": "51 pp with 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cretaceous-Cenozoic history of angiosperms led to the a certain character of\nthe distribution of taxa of different levels (the number of species and genera\nin families, species/genera ratio in families, the number of species in the\ngenera). In most cases, these distributions are satisfactorily described by a\npower law (Pareto distribution). In logarithmic coordinates power function is a\nstraight line. Empirical curves repeat this line is good enough, but on the\nright side of the graph (at low volumes taxa), there is a marked deviation of\ntheoretical from the empirical curves. This suggests that the small volumes of\ntaxa should be greater for full compliance with the theoretical curves.\nModeling ratios among genera and species in families showed that only in the\ncase of dynamic extinction factor observed satisfactory agreement between\nobserved and calculated the number of species in a wide range of iterations.\nThis suggested that there was a differential extinction of species during the\nevolution of angiosperms. This implies that the rate of extinction had to be\nminimal in genera with a large number of species. On the contrary, extinction\nrates may be increased by orders of magnitude with a decrease in the number of\nspecies. As a result, large genera became getting bigger and small genera\nbecome less. The species frequencies of distribution in the genera varied\naccording to a power law. The initial divergence of taxa volume, which led to\ntheir further division into large and small, could be caused by the emergence\nand expansion of herbs with their functional and adaptive capabilities.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 13:37:11 GMT"}], "update_date": "2016-04-22", "authors_parsed": [["Sheremet'ev", "Serge", ""], ["Chebotareva", "Xenia", ""]]}, {"id": "1604.06358", "submitter": "Diala Abu Awad", "authors": "Diala Abu Awad and Viet-Chi Tran and Sylvain Billiard", "title": "Perennial life-histories and demographic advantages may play\n  contradictory roles in the evolution of plant mating systems", "comments": "28 pages, 5 figures, 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When predicting the fate and consequences of recurring deleterious mutations\nin self-fertilising populations most models developed make the assumption that\npopulations have discrete non-overlapping generations. This makes them\nbiologically irrelevant when considering perennial species with over-lapping\ngenerations and where mating occurs independently of the age group. Previous\nmodels studying the effect of perennial life-histories on the genetic\nproperties of populations in the presence of self-fertilisation have done so\nconsidering age-dependent selection and have found that, contrary to empirical\nobservations, perennial populations should exhibit lower levels of inbreeding\ndepression. Here we propose a simple deterministic model in continuous time\nwith selection at different fitness traits and feedback between population\nfitness and size. We find that a perennial life-history can result in high\nlevels of inbreeding depression in spite of inbreeding, due to higher\nfrequencies of heterozygous individuals at the adult stage. We also propose\nthat there may be demographic advantages for self-fertilisation that are\nindependent of reproductive success.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 15:33:30 GMT"}], "update_date": "2016-04-22", "authors_parsed": [["Awad", "Diala Abu", ""], ["Tran", "Viet-Chi", ""], ["Billiard", "Sylvain", ""]]}, {"id": "1604.06438", "submitter": "Matjaz Perc", "authors": "Attila Szolnoki, Matjaz Perc", "title": "Leaders should not be conformists in evolutionary social dilemmas", "comments": "7 two-column pages, 4 figures; accepted for publication in Scientific\n  Reports [related work available at arXiv:1412.4113]", "journal-ref": "Sci. Rep. 6 (2016) 23633", "doi": "10.1038/srep23633", "report-no": null, "categories": "physics.soc-ph cs.SI q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The most common assumption in evolutionary game theory is that players should\nadopt a strategy that warrants the highest payoff. However, recent studies\nindicate that the spatial selection for cooperation is enhanced if an\nappropriate fraction of the population chooses the most common rather than the\nmost profitable strategy within the interaction range. Such conformity might be\ndue to herding instincts or crowd behavior in humans and social animals. In a\nheterogeneous population where individuals differ in their degree, collective\ninfluence, or other traits, an unanswered question remains who should conform.\nSelecting conformists randomly is the simplest choice, but it is neither a\nrealistic nor the optimal one. We show that, regardless of the source of\nheterogeneity and game parametrization, socially the most favorable outcomes\nemerge if the masses conform. On the other hand, forcing leaders to conform\nsignificantly hinders the constructive interplay between heterogeneity and\ncoordination, leading to evolutionary outcomes that are worse still than if\nconformists were chosen randomly. We conclude that leaders must be able to\ncreate a following for network reciprocity to be optimally augmented by\nconformity. In the opposite case, when leaders are castrated and made to\nfollow, the failure of coordination impairs the evolution of cooperation.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 19:39:24 GMT"}, {"version": "v2", "created": "Tue, 17 May 2016 09:27:26 GMT"}], "update_date": "2016-05-18", "authors_parsed": [["Szolnoki", "Attila", ""], ["Perc", "Matjaz", ""]]}, {"id": "1604.06500", "submitter": "Pierre Degond", "authors": "Pierre Degond, Maximilian Engel", "title": "Numerical approximation of a coagulation-Fragmentation Model for Animal\n  Group Size Statistics", "comments": null, "journal-ref": null, "doi": "10.3934/nhm.2017009", "report-no": null, "categories": "math-ph math.MP q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study numerically a coagulation-fragmentation model derived by Niwa and\nfurther elaborated by Degond et al., where a unique equilibrium distribution of\ngroup sizes is shown to exist in both cases of continuous and discrete group\nsize distributions. We provide a numerical investigation of these equilibria\nusing three different methods to approximate the equilibrium: a recursive\nalgorithm based on the work of Ma et. al., a Newton method and the resolution\nof the time-dependent problem. All three schemes are validated by showing that\nthey approximate the predicted small and large size asymptotic behaviour of the\nequilibrium accurately. The recursive algorithm is used to investigate the\ntransition from discrete to continuous size distributions and the time\nevolution scheme is exploited to show uniform convergence to equilibrium in\ntime and to determine convergence rates.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 21:43:06 GMT"}, {"version": "v2", "created": "Sat, 2 Jul 2016 18:37:07 GMT"}], "update_date": "2018-06-25", "authors_parsed": [["Degond", "Pierre", ""], ["Engel", "Maximilian", ""]]}, {"id": "1604.06713", "submitter": "Luca Ferretti", "authors": "Luca Ferretti, Alexander Klassmann, Emanuele Raineri, Thomas Wiehe,\n  Sebastian E. Ramos-Onsins, Guillaume Achaz", "title": "The expected neutral frequency spectrum of linked sites", "comments": "26 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present an exact, closed expression for the expected neutral Site\nFrequency Spectrum for two neutral sites, 2-SFS, without recombination. This\nspectrum is the immediate extension of the well known single site $\\theta/f$\nneutral SFS. Similar formulae are also provided for the case of the expected\nSFS of sites that are linked to a focal neutral mutation of known frequency.\nFormulae for finite samples are obtained by coalescent methods and remarkably\nsimple expressions are derived for the SFS of a large population, which are\nalso solutions of the multi-allelic Kolmogorov equations. Besides the general\ninterest of these new spectra, they relate to interesting biological cases such\nas structural variants and introgressions. As an example, we present the\nexpected neutral frequency spectrum of regions with a chromosomal inversion.\n", "versions": [{"version": "v1", "created": "Fri, 22 Apr 2016 15:28:33 GMT"}, {"version": "v2", "created": "Mon, 9 Jan 2017 19:22:48 GMT"}], "update_date": "2017-01-11", "authors_parsed": [["Ferretti", "Luca", ""], ["Klassmann", "Alexander", ""], ["Raineri", "Emanuele", ""], ["Wiehe", "Thomas", ""], ["Ramos-Onsins", "Sebastian E.", ""], ["Achaz", "Guillaume", ""]]}, {"id": "1604.06938", "submitter": "Tatsuya Sasaki", "authors": "Tatsuya Sasaki, Isamu Okada, Yutaka Nakai", "title": "Indirect reciprocity can overcome free-rider problems on costly moral\n  assessment", "comments": "19 pages (incl. supplementary materials), 1 table, and 1 figure", "journal-ref": "Biology Letters 12: 20160341 (published 6 July 2016)", "doi": "10.1098/rsbl.2016.0341", "report-no": null, "categories": "q-bio.PE physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Indirect reciprocity is one of the major mechanisms of the evolution of\ncooperation. Because constant monitoring and accurate evaluation in moral\nassessments tend to be costly, indirect reciprocity can be exploited by cost\nevaders. A recent study crucially showed that a cooperative state achieved by\nindirect reciprocators is easily destabilized by cost evaders in the case with\nno supportive mechanism. Here, we present a simple and widely applicable\nsolution that considers pre-assessment of cost evaders. In the pre-assessment,\nthose who fail to pay for costly assessment systems are assigned a nasty image\nthat leads to being rejected by discriminators. We demonstrate that considering\nthe pre-assessment can crucially stabilize reciprocal cooperation for a broad\nrange of indirect reciprocity models. In particular for the most leading social\nnorms we analyse the conditions under which a prosocial state becomes locally\nstable.\n", "versions": [{"version": "v1", "created": "Sat, 23 Apr 2016 19:11:41 GMT"}, {"version": "v2", "created": "Wed, 6 Jul 2016 11:34:03 GMT"}], "update_date": "2016-07-07", "authors_parsed": [["Sasaki", "Tatsuya", ""], ["Okada", "Isamu", ""], ["Nakai", "Yutaka", ""]]}, {"id": "1604.07108", "submitter": "Christopher Marriott", "authors": "Chris Marriott and Jobran Chebib", "title": "Modeling the Evolution of Gene-Culture Divergence", "comments": "8 pages, ALIFE 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.MA q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a model for evolving agents using both genetic and cultural\ninheritance mechanisms. Within each agent our model maintains two distinct\ninformation stores we call the genome and the memome. Processes of adaptation\nare modeled as evolutionary processes at each level of adaptation\n(phylogenetic, ontogenetic, sociogenetic). We review relevant competing models\nand we show how our model improves on previous attempts to model genetic and\ncultural evolutionary processes. In particular we argue our model can achieve\ndivergent gene-culture co-evolution.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2016 02:18:45 GMT"}], "update_date": "2016-04-26", "authors_parsed": [["Marriott", "Chris", ""], ["Chebib", "Jobran", ""]]}, {"id": "1604.07109", "submitter": "Christopher Marriott", "authors": "Chris Marriott and Jobran Chebib", "title": "Finding a Mate With Eusocial Skills", "comments": "8 pages, ALIFE 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Sexual reproductive behavior has a necessary social coordination component as\nwilling and capable partners must both be in the right place at the right time.\nIt has recently been demonstrated that many social organizations that support\nsexual reproduction can evolve in the absence of social coordination between\nagents (e.g. herding, assortative mating, and natal philopatry). In this paper\nwe explore these results by including social transfer mechanisms to our agents\nand contrasting their reproductive behavior with a control group without social\ntransfer mechanisms. We conclude that similar behaviors emerge in our social\nlearning agents as those that emerged in the non-social learning agents. Social\nlearners were more inclined towards natal philopatry. Social learners also\nevolved a culture of eusociality including reproductive division of labor.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2016 02:22:03 GMT"}], "update_date": "2016-04-26", "authors_parsed": [["Marriott", "Chris", ""], ["Chebib", "Jobran", ""]]}, {"id": "1604.07110", "submitter": "Christopher Marriott", "authors": "Chris Marriott and Jobran Chebib", "title": "Divergent Cumulative Cultural Evolution", "comments": "8 pages, ALIFE 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Divergent cumulative cultural evolution occurs when the cultural evolutionary\ntrajectory diverges from the biological evolutionary trajectory. We consider\nthe conditions under which divergent cumulative cultural evolution can occur.\nWe hypothesize that two conditions are necessary. First that genetic and\ncultural information are stored separately in the agent. Second cultural\ninformation must be transferred horizontally between agents of different\ngenerations. We implement a model with these properties and show evidence of\ndivergent cultural evolution under both cooperative and competitive selection\npressures.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2016 02:24:57 GMT"}], "update_date": "2016-04-26", "authors_parsed": [["Marriott", "Chris", ""], ["Chebib", "Jobran", ""]]}, {"id": "1604.07637", "submitter": "Pedro Manrique", "authors": "Pedro D. Manrique, Chen Xu, Pak Ming Hui and Neil F. Johnson", "title": "Atypical viral dynamics from transport through popular places", "comments": "14 pages, 16 figures", "journal-ref": null, "doi": "10.1103/PhysRevE.94.022304", "report-no": null, "categories": "q-bio.PE cond-mat.stat-mech physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The flux of visitors through popular places undoubtedly influences viral\nspreading -- from H1N1 and Zika viruses spreading through physical spaces such\nas airports, to rumors and ideas spreading though online spaces such as\nchatrooms and social media. However there is a lack of understanding of the\ntypes of viral dynamics that can result. Here we present a minimal dynamical\nmodel which focuses on the time-dependent interplay between the {\\em mobility\nthrough} and the {\\em occupancy of} such spaces. Our generic model permits\nanalytic analysis while producing a rich diversity of infection profiles in\nterms of their shapes, durations, and intensities. The general features of\nthese theoretical profiles compare well to real-world data of recent social\ncontagion phenomena.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 12:01:30 GMT"}, {"version": "v2", "created": "Sat, 6 Aug 2016 12:47:24 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Manrique", "Pedro D.", ""], ["Xu", "Chen", ""], ["Hui", "Pak Ming", ""], ["Johnson", "Neil F.", ""]]}, {"id": "1604.08007", "submitter": "Linfei Nie Dr.", "authors": "Lin-Fei Nie and Jing-Yun Shen", "title": "A state-dependent vector control for a West Nile Virus model from\n  mosquitoes to birds", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel West Nile Virus model looking upon the infected birds\nas monitoring threshold, for the mosquitoes and birds with impulsive state\nfeedback control is considered. We obtain sufficient conditions of the global\nasymptotical stability of the system without impulsive state feedback control\nvia comprehensively qualitative analysis. By using the Poincar\\'e map, we\nobtain that the system with impulsive state feedback control has a positive\nperiodic solution of order-1 or order-2 which is asymptotical stability due to\nthe analogue of Poincar\\'e criterion, theory of differential inequalities,\ndifferential equation geometry and so on. What's more, sufficient conditions\nfor existence and stability of the order one periodic solution are given by the\nexistence and uniqueness of the limit. Our results show that the control\nmeasure is effective and feasible by means of numerical simulations.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2016 10:14:24 GMT"}], "update_date": "2016-04-28", "authors_parsed": [["Nie", "Lin-Fei", ""], ["Shen", "Jing-Yun", ""]]}, {"id": "1604.08696", "submitter": "Henry Tuckwell", "authors": "Henry C. Tuckwell", "title": "Gompertzian population growth under some deterministic and stochastic\n  jump schedules", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many cell populations, exemplified by certain tumors, grow approximately\naccording to a Gompertzian growth model which has a slower approach to an upper\nlimit than that of logistic growth. Certain populations of animals and other\norganisms have also recently been analyzed with the Gompertz model. This\narticle addresses the question of how long it takes to reduce the population\nfrom one level to a lower one under a schedule of sudden decrements, each of\nwhich removes a given fraction of the cell mass or population. A deterministic\nperiodic schedule is first examined and yields exact results for the\neradication or extinction time which is defined as that required to reduce the\nnumber of cells to less than unity. The decrements in cell mass at each hit\ncould correspond to an approximation to reduction of a tumor by external beam\nradiation therapy. The effects of variations in magnitude of successive\ndecrements, the time interval between them, the initial population size and the\nintrinsic growth rate are calculated and results presented graphically.\n  With a schedule governed by a Poisson process, the number of organisms or\ncells satisfies a stochastic differential equation whose solution sample paths\nhave downward jumps as random times. The moments of the exit time then satisfy\na system of recurrent differential-difference equations. A simple\ntransformation results in a simpler system which has been studied both\nanalytically and numerically in the context of interspike intervals of a model\nneuron. Results are presented for the mean eradication time for various\nfrequencies and magnitudes of hits and for various eventual and initial\npopulation sizes. The standard deviation of the eradication time is also\ninvestigated.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 06:06:21 GMT"}], "update_date": "2016-05-02", "authors_parsed": [["Tuckwell", "Henry C.", ""]]}, {"id": "1604.08921", "submitter": "Artur Fassoni", "authors": "Artur C. Fassoni and Hyun M. Yang", "title": "An ecological resilience perspective on cancer: insights from a toy\n  model", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE math.DS q-bio.TO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we propose an ecological resilience point of view on cancer.\nThis view is based on the analysis of a simple ODE model for the interactions\nbetween cancer and normal cells. The model presents two regimes for tumor\ngrowth. In the first, cancer arises due to three reasons: a partial corruption\nof the functions that avoid the growth of mutated cells, an aggressive\nphenotype of tumor cells and exposure to external carcinogenic factors. In this\ncase, treatments may be effective if they drive the system to the basin of\nattraction of the cancer cure state. In the second regime, cancer arises\nbecause the repair system is intrinsically corrupted. In this case, the\ncomplete cure is not possible since the cancer cure state is no more stable,\nbut tumor recurrence may be delayed if treatment is prolongued. We review three\nindicators of the resilience of a stable equilibrium, related with size and\nshape of its basin of attraction: latitude, precariousness and resistance. A\nnovel method to calculate these indicators is proposed. This method is simpler\nand more efficient than those currently used, and may be easily applied to\nother population dynamics models. We apply this method to the model and\ninvestigate how these indicators behave with parameters changes. Finally, we\npresent some simulations to illustrate how the resilience analysis can be\napplied to validated models in order to obtain indicators for personalized\ncancer treatments.\n  Keywords: Tumor growth; Chemotherapy; Basins of Attraction; Regime shifts;\nCritical transitions\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 17:43:41 GMT"}, {"version": "v2", "created": "Wed, 31 Aug 2016 19:37:47 GMT"}], "update_date": "2016-09-01", "authors_parsed": [["Fassoni", "Artur C.", ""], ["Yang", "Hyun M.", ""]]}]