[{"id": "1604.02096", "submitter": "Yoav Kallus", "authors": "Andrew Berdahl, Christa Brelsford, Caterina De Bacco, Marion Dumas,\n  Vanessa Ferdinand, Joshua A. Grochow, Laurent H\\'ebert-Dufresne, Yoav Kallus,\n  Christopher P. Kempes, Artemy Kolchinsky, Daniel B. Larremore, Eric Libby,\n  Eleanor A. Power, Caitlin A. Stern, Brendan Tracey (Santa Fe Institute\n  Postdocs)", "title": "Dynamics of beneficial epidemics", "comments": "The original version of this paper [v1] was produced, from conception\n  of idea, to execution, to writing, by a team in just 72 hours (see Appendix\n  of [v1]). This is a revised version", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.MA cs.SI nlin.AO q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pathogens can spread epidemically through populations. Beneficial contagions,\nsuch as viruses that enhance host survival or technological innovations that\nimprove quality of life, also have the potential to spread epidemically. How do\nthe dynamics of beneficial biological and social epidemics differ from those of\ndetrimental epidemics? We investigate this question using three theoretical\napproaches. First, in the context of population genetics, we show that a\nhorizontally-transmissible element that increases fitness, such as viral DNA,\nspreads superexponentially through a population, more quickly than a beneficial\nmutation. Second, in the context of behavioral epidemiology, we show that\ninfections that cause increased connectivity lead to superexponential fixation\nin the population. Third, in the context of dynamic social networks, we find\nthat preferences for increased global infection accelerate spread and produce\nsuperexponential fixation, but preferences for local assortativity halt\nepidemics by disconnecting the infected from the susceptible. We conclude that\nthe dynamics of beneficial biological and social epidemics are characterized by\nthe rapid spread of beneficial elements, which is facilitated in biological\nsystems by horizontal transmission and in social systems by active spreading\nbehavior of infected individuals.\n", "versions": [{"version": "v1", "created": "Thu, 7 Apr 2016 18:13:24 GMT"}, {"version": "v2", "created": "Fri, 17 Feb 2017 21:40:55 GMT"}], "update_date": "2017-02-21", "authors_parsed": [["Berdahl", "Andrew", "", "Santa Fe Institute\n  Postdocs"], ["Brelsford", "Christa", "", "Santa Fe Institute\n  Postdocs"], ["De Bacco", "Caterina", "", "Santa Fe Institute\n  Postdocs"], ["Dumas", "Marion", "", "Santa Fe Institute\n  Postdocs"], ["Ferdinand", "Vanessa", "", "Santa Fe Institute\n  Postdocs"], ["Grochow", "Joshua A.", "", "Santa Fe Institute\n  Postdocs"], ["Hébert-Dufresne", "Laurent", "", "Santa Fe Institute\n  Postdocs"], ["Kallus", "Yoav", "", "Santa Fe Institute\n  Postdocs"], ["Kempes", "Christopher P.", "", "Santa Fe Institute\n  Postdocs"], ["Kolchinsky", "Artemy", "", "Santa Fe Institute\n  Postdocs"], ["Larremore", "Daniel B.", "", "Santa Fe Institute\n  Postdocs"], ["Libby", "Eric", "", "Santa Fe Institute\n  Postdocs"], ["Power", "Eleanor A.", "", "Santa Fe Institute\n  Postdocs"], ["Stern", "Caitlin A.", "", "Santa Fe Institute\n  Postdocs"], ["Tracey", "Brendan", "", "Santa Fe Institute\n  Postdocs"]]}, {"id": "1604.02704", "submitter": "Javier Enciso", "authors": "Javier Enciso, Juan Vargas and Pablo Mart\\'inez", "title": "Modeling and Simulation of Passenger Traffic in a National Airport", "comments": "8 pages, submitted to LACCEI 2016", "journal-ref": null, "doi": "10.18687/laccei2016.1.1.217", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optimal operation of a country's air transport infrastructure plays a major\nrole in the economic development of nations. Due to the increasing use of air\ntransportation in today's world, flights' boarding times have become a concern\nfor both airlines and airports, thus the importance of knowing beforehand how\nchanges in flights demand parameters and physical airport layout will affect\npassengers flow and boarding times. This paper presents a pedestrian modeling\nstudy in which a national airport passenger flow was analyzed. The study was\nconducted at Vanguardia National Airport in Villavicencio, Meta, Colombia.\nDifferent effects of structural changes are shown and provide judging elements\nfor decision makers regarding passenger traffic in airport design.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 15:25:23 GMT"}], "update_date": "2018-06-14", "authors_parsed": [["Enciso", "Javier", ""], ["Vargas", "Juan", ""], ["Martínez", "Pablo", ""]]}, {"id": "1604.03458", "submitter": "Jakub Mare\\v{c}ek", "authors": "Jonathan Epperlein and Jakub Marecek", "title": "Resource Allocation with Population Dynamics", "comments": null, "journal-ref": null, "doi": "10.1109/ALLERTON.2017.8262886", "report-no": null, "categories": "math.OC cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many analyses of resource-allocation problems employ simplistic models of the\npopulation. Using the example of a resource-allocation problem of Marecek et\nal. [arXiv:1406.7639], we introduce rather a general behavioural model, where\nthe evolution of a heterogeneous population of agents is governed by a Markov\nchain. Still, we are able to show that the distribution of agents across\nresources converges in distribution, for suitable means of information\nprovision, under certain assumptions. The model and proof techniques may have\nwider applicability.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 15:53:25 GMT"}], "update_date": "2018-02-20", "authors_parsed": [["Epperlein", "Jonathan", ""], ["Marecek", "Jakub", ""]]}, {"id": "1604.03632", "submitter": "Nicholas Mattei", "authors": "Haris Aziz, Omer Lev, Nicholas Mattei, Jeffrey S. Rosenschein, and\n  Toby Walsh", "title": "Strategyproof Peer Selection using Randomization, Partitioning, and\n  Apportionment", "comments": "1 Figure, Source Code available at\n  https://github.com/nmattei/peerselection", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Peer reviews, evaluations, and selections are a fundamental aspect of modern\nscience. Funding bodies the world over employ experts to review and select the\nbest proposals from those submitted for funding. The problem of peer selection,\nhowever, is much more general: a professional society may want to give a subset\nof its members awards based on the opinions of all members; an instructor for a\nMassive Open Online Course (MOOC) or an online course may want to crowdsource\ngrading; or a marketing company may select ideas from group brainstorming\nsessions based on peer evaluation.\n  We make three fundamental contributions to the study of peer selection, a\nspecific type of group decision-making problem, studied in computer science,\neconomics, and political science. First, we propose a novel mechanism that is\nstrategyproof, i.e., agents cannot benefit by reporting insincere valuations.\nSecond, we demonstrate the effectiveness of our mechanism by a comprehensive\nsimulation-based comparison with a suite of mechanisms found in the literature.\nFinally, our mechanism employs a randomized rounding technique that is of\nindependent interest, as it solves the apportionment problem that arises in\nvarious settings where discrete resources such as parliamentary representation\nslots need to be divided proportionally.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 02:28:15 GMT"}, {"version": "v2", "created": "Fri, 29 Sep 2017 13:44:12 GMT"}, {"version": "v3", "created": "Thu, 25 Apr 2019 20:14:19 GMT"}, {"version": "v4", "created": "Tue, 30 Apr 2019 17:53:38 GMT"}], "update_date": "2019-05-01", "authors_parsed": [["Aziz", "Haris", ""], ["Lev", "Omer", ""], ["Mattei", "Nicholas", ""], ["Rosenschein", "Jeffrey S.", ""], ["Walsh", "Toby", ""]]}, {"id": "1604.03747", "submitter": "Sundong Kim", "authors": "Sundong Kim, Jin-Jae Lee", "title": "Behavior of Self-Motivated Agents in Complex Networks", "comments": "14 pages, Format: Winter Simulation Conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traditional evolutionary game theory describes how certain strategy spreads\nthroughout the system where individual player imitates the most successful\nstrategy among its neighborhood. Accordingly, player doesn't have own authority\nto change their state. However in the human society, peoples do not just follow\nstrategies of other people, they choose their own strategy. In order to see the\ndecision of each agent in timely basis and differentiate between network\nstructures, we conducted multi-agent based modeling and simulation. In this\npaper, agent can decide its own strategy by payoff comparison and we name this\nagent as \"Self-motivated agent\". To explain the behavior of self-motivated\nagent, prisoner's dilemma game with cooperator, defector, loner and punisher\nare considered as an illustrative example. We performed simulation by\ndifferentiating participation rate, mutation rate and the degree of network,\nand found the special coexisting conditions.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 12:56:27 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Kim", "Sundong", ""], ["Lee", "Jin-Jae", ""]]}, {"id": "1604.04180", "submitter": "Pasquale Grippa", "authors": "Pasquale Grippa, Doris A. Behrens, Christian Bettstetter, and\n  Friederike Wall", "title": "Job Selection in a Network of Autonomous UAVs for Delivery of Goods", "comments": null, "journal-ref": null, "doi": "10.15607/RSS.2017.XIII.018", "report-no": null, "categories": "cs.MA cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article analyzes two classes of job selection policies that control how\na network of autonomous aerial vehicles delivers goods from depots to\ncustomers. Customer requests (jobs) occur according to a spatio-temporal\nstochastic process not known by the system. If job selection uses a policy in\nwhich the first job (FJ) is served first, the system may collapse to\ninstability by removing just one vehicle. Policies that serve the nearest job\n(NJ) first show such threshold behavior only in some settings and can be\nimplemented in a distributed manner. The timing of job selection has\nsignificant impact on delivery time and stability for NJ while it has no impact\nfor FJ. Based on these findings we introduce a methodological approach for\ndecision-making support to set up and operate such a system, taking into\naccount the trade-off between monetary cost and service quality. In particular,\nwe compute a lower bound for the infrastructure expenditure required to achieve\na certain expected delivery time. The approach includes three time horizons:\nlong-term decisions on the number of depots to deploy in the service area,\nmid-term decisions on the number of vehicles to use, and short-term decisions\non the policy to operate the vehicles.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 15:09:49 GMT"}, {"version": "v2", "created": "Fri, 26 May 2017 09:23:13 GMT"}], "update_date": "2018-09-05", "authors_parsed": [["Grippa", "Pasquale", ""], ["Behrens", "Doris A.", ""], ["Bettstetter", "Christian", ""], ["Wall", "Friederike", ""]]}, {"id": "1604.04359", "submitter": "Palash Dey", "authors": "Palash Dey, Neeldhara Misra, Y. Narahari", "title": "Complexity of Manipulation with Partial Information in Voting", "comments": "Appeared in IJCAI 2016. Fixed some typos", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.CC cs.CY cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Coalitional Manipulation problem has been studied extensively in the\nliterature for many voting rules. However, most studies have focused on the\ncomplete information setting, wherein the manipulators know the votes of the\nnon-manipulators. While this assumption is reasonable for purposes of showing\nintractability, it is unrealistic for algorithmic considerations. In most\nreal-world scenarios, it is impractical for the manipulators to have accurate\nknowledge of all the other votes. In this paper, we investigate manipulation\nwith incomplete information. In our framework, the manipulators know a partial\norder for each voter that is consistent with the true preference of that voter.\nIn this setting, we formulate three natural computational notions of\nmanipulation, namely weak, opportunistic, and strong manipulation. We say that\nan extension of a partial order is if there exists a manipulative vote for that\nextension.\n  1. Weak Manipulation (WM): the manipulators seek to vote in a way that makes\ntheir preferred candidate win in at least one extension of the partial votes of\nthe non-manipulators.\n  2. Opportunistic Manipulation (OM): the manipulators seek to vote in a way\nthat makes their preferred candidate win in every viable extension of the\npartial votes of the non-manipulators.\n  3. Strong Manipulation (SM): the manipulators seek to vote in a way that\nmakes their preferred candidate win in every extension of the partial votes of\nthe non-manipulators.\n  We consider several scenarios for which the traditional manipulation problems\nare easy (for instance, Borda with a single manipulator). For many of them, the\ncorresponding manipulative questions that we propose turn out to be\ncomputationally intractable. Our hardness results often hold even when very\nlittle information is missing, or in other words, even when the instances are\nquite close to the complete information setting.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 05:55:07 GMT"}, {"version": "v2", "created": "Thu, 13 Jul 2017 03:30:09 GMT"}], "update_date": "2017-07-14", "authors_parsed": [["Dey", "Palash", ""], ["Misra", "Neeldhara", ""], ["Narahari", "Y.", ""]]}, {"id": "1604.04403", "submitter": "Palash Dey", "authors": "Palash Dey and Neeldhara Misra", "title": "Elicitation for Preferences Single Peaked on Trees", "comments": "To appear in IJCAI 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.CC cs.DS cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In multiagent systems, we often have a set of agents each of which have a\npreference ordering over a set of items and one would like to know these\npreference orderings for various tasks, for example, data analysis, preference\naggregation, voting etc. However, we often have a large number of items which\nmakes it impractical to ask the agents for their complete preference ordering.\nIn such scenarios, we usually elicit these agents' preferences by asking (a\nhopefully small number of) comparison queries --- asking an agent to compare\ntwo items. Prior works on preference elicitation focus on unrestricted domain\nand the domain of single peaked preferences and show that the preferences in\nsingle peaked domain can be elicited by much less number of queries compared to\nunrestricted domain. We extend this line of research and study preference\nelicitation for single peaked preferences on trees which is a strict superset\nof the domain of single peaked preferences. We show that the query complexity\ncrucially depends on the number of leaves, the path cover number, and the\ndistance from path of the underlying single peaked tree, whereas the other\nnatural parameters like maximum degree, diameter, pathwidth do not play any\ndirect role in determining query complexity. We then investigate the query\ncomplexity for finding a weak Condorcet winner for preferences single peaked on\na tree and show that this task has much less query complexity than preference\nelicitation. Here again we observe that the number of leaves in the underlying\nsingle peaked tree and the path cover number of the tree influence the query\ncomplexity of the problem.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 08:40:39 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Dey", "Palash", ""], ["Misra", "Neeldhara", ""]]}, {"id": "1604.04725", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Reyhan Aydogan, Vicente Julian and Catholijn\n  Jonker", "title": "Unanimously acceptable agreements for negotiation teams in unpredictable\n  domains", "comments": "Electronic Commerce Research and Applications, 2014", "journal-ref": null, "doi": "10.1016/j.elerap.2014.05.002", "report-no": null, "categories": "cs.MA cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A negotiation team is a set of agents with common and possibly also\nconflicting preferences that forms one of the parties of a negotiation. A\nnegotiation team is involved in two decision making processes simultaneously, a\nnegotiation with the opponents, and an intra-team process to decide on the\nmoves to make in the negotiation. This article focuses on negotiation team\ndecision making for circumstances that require unanimity of team decisions.\nExisting agent-based approaches only guarantee unanimity in teams negotiating\nin domains exclusively composed of predictable and compatible issues. This\narticle presents a model for negotiation teams that guarantees unanimous team\ndecisions in domains consisting of predictable and compatible, and also\nunpredictable issues. Moreover, the article explores the influence of using\nopponent, and team member models in the proposing strategies that team members\nuse. Experimental results show that the team benefits if team members employ\nBayesian learning to model their teammates' preferences.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 11:01:44 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Aydogan", "Reyhan", ""], ["Julian", "Vicente", ""], ["Jonker", "Catholijn", ""]]}, {"id": "1604.04727", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Vicente Julian, Vicente Botti and Ana\n  Garcia-Fornes", "title": "Tasks for agent-based negotiation teams: Analysis, review, and\n  challenges", "comments": "Engineering Applications of Artificial Intelligence, 2013", "journal-ref": null, "doi": "10.1016/j.engappai.2013.07.006", "report-no": null, "categories": "cs.MA cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An agent-based negotiation team is a group of interdependent agents that join\ntogether as a single negotiation party due to their shared interests in the\nnegotiation at hand. The reasons to employ an agent-based negotiation team may\nvary: (i) more computation and parallelization capabilities, (ii) unite agents\nwith different expertise and skills whose joint work makes it possible to\ntackle complex negotiation domains, (iii) the necessity to represent different\nstakeholders or different preferences in the same party (e.g., organizations,\ncountries, and married couple). The topic of agent-based negotiation teams has\nbeen recently introduced in multi-agent research. Therefore, it is necessary to\nidentify good practices, challenges, and related research that may help in\nadvancing the state-of-the-art in agent-based negotiation teams. For that\nreason, in this article we review the tasks to be carried out by agent-based\nnegotiation teams. Each task is analyzed and related with current advances in\ndifferent research areas. The analysis aims to identify special challenges that\nmay arise due to the particularities of agent-based negotiation teams.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 11:37:50 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Julian", "Vicente", ""], ["Botti", "Vicente", ""], ["Garcia-Fornes", "Ana", ""]]}, {"id": "1604.04728", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Vicente Julian, Vicente Botti and Ana\n  Garcia-Fornes", "title": "Reaching Unanimous Agreements Within Agent-Based Negotiation Teams With\n  Linear and Monotonic Utility Functions", "comments": "IEEE Transactions on Systems, Man, and Cybernetics, Part B\n  (Cybernetics), 2012", "journal-ref": null, "doi": "10.1109/TSMCB.2011.2177658", "report-no": null, "categories": "cs.MA cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, an agent-based negotiation model for negotiation teams that\nnegotiate a deal with an opponent is presented. Agent-based negotiation teams\nare groups of agents that join together as a single negotiation party because\nthey share an interest that is related to the negotiation process. The model\nrelies on a trusted mediator that coordinates and helps team members in the\ndecisions that they have to take during the negotiation process: which offer is\nsent to the opponent, and whether the offers received from the opponent are\naccepted. The main strength of the proposed negotiation model is the fact that\nit guarantees unanimity within team decisions since decisions report a utility\nto team members that is greater than or equal to their aspiration levels at\neach negotiation round. This work analyzes how unanimous decisions are taken\nwithin the team and the robustness of the model against different types of\nmanipulations. An empirical evaluation is also performed to study the impact of\nthe different parameters of the model.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 11:42:38 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Julian", "Vicente", ""], ["Botti", "Vicente", ""], ["Garcia-Fornes", "Ana", ""]]}, {"id": "1604.04730", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Soledad Valero, Vicente Julian, Vicente Botti\n  and Ana Garcia-Fornes", "title": "Evolutionary-aided negotiation model for bilateral bargaining in Ambient\n  Intelligence domains with complex utility functions", "comments": "Information Sciences, 2013", "journal-ref": null, "doi": "10.1016/j.ins.2010.11.018", "report-no": null, "categories": "cs.MA cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ambient Intelligence aims to offer personalized services and easier ways of\ninteraction between people and systems. Since several users and systems may\ncoexist in these environments, it is quite possible that entities with opposing\npreferences need to cooperate to reach their respective goals. Automated\nnegotiation is pointed as one of the mechanisms that may provide a solution to\nthis kind of problems. In this article, a multi-issue bilateral bargaining\nmodel for Ambient Intelligence domains is presented where it is assumed that\nagents have computational bounded resources and do not know their opponents'\npreferences. The main goal of this work is to provide negotiation models that\nobtain efficient agreements while maintaining the computational cost low. A\nniching genetic algorithm is used before the negotiation process to sample\none's own utility function (self-sampling). During the negotiation process,\ngenetic operators are applied over the opponent's and one's own offers in order\nto sample new offers that are interesting for both parties. Results show that\nthe proposed model is capable of outperforming similarity heuristics which only\nsample before the negotiation process and of obtaining similar results to\nsimilarity heuristics which have access to all of the possible offers.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 11:53:46 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Valero", "Soledad", ""], ["Julian", "Vicente", ""], ["Botti", "Vicente", ""], ["Garcia-Fornes", "Ana", ""]]}, {"id": "1604.04736", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Reyhan Aydogan, Vicente Julian and Catholijn\n  Jonker", "title": "Intra-Team Strategies for Teams Negotiating Against Competitor,\n  Matchers, and Conceders", "comments": "Novel Insights in Agent-based Complex Automated Negotiation, 2014", "journal-ref": null, "doi": "10.1007/978-4-431-54758-7_1", "report-no": null, "categories": "cs.MA cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Under some circumstances, a group of individuals may need to negotiate\ntogether as a negotiation team against another party. Unlike bilateral\nnegotiation between two individuals, this type of negotiations entails to adopt\nan intra-team strategy for negotiation teams in order to make team decisions\nand accordingly negotiate with the opponent. It is crucial to be able to\nnegotiate successfully with heterogeneous opponents since opponents'\nnegotiation strategy and behavior may vary in an open environment. While one\nopponent might collaborate and concede over time, another may not be inclined\nto concede. This paper analyzes the performance of recently proposed intra-team\nstrategies for negotiation teams against different categories of opponents:\ncompetitors, matchers, and conceders. Furthermore, it provides an extension of\nthe negotiation tool Genius for negotiation teams in bilateral settings.\nConsequently, this work facilitates research in negotiation teams.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 12:11:02 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Aydogan", "Reyhan", ""], ["Julian", "Vicente", ""], ["Jonker", "Catholijn", ""]]}, {"id": "1604.04737", "submitter": "Victor Sanchez-Anguix Dr.", "authors": "Victor Sanchez-Anguix, Vicente Julian, Vicente Botti and Ana\n  Garcia-Fornes", "title": "Studying the impact of negotiation environments on negotiation teams'\n  performance", "comments": "Information Sciences, 2013", "journal-ref": null, "doi": "10.1016/j.ins.2012.07.017", "report-no": null, "categories": "cs.MA cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we study the impact of the negotiation environment on the\nperformance of several intra-team strategies (team dynamics) for agent-based\nnegotiation teams that negotiate with an opponent. An agent-based negotiation\nteam is a group of agents that joins together as a party because they share\ncommon interests in the negotiation at hand. It is experimentally shown how\nnegotiation environment conditions like the deadline of both parties, the\nconcession speed of the opponent, similarity among team members, and team size\naffect performance metrics like the minimum utility of team members, the\naverage utility of team members, and the number of negotiation rounds. Our goal\nis identifying which intra-team strategies work better in different\nenvironmental conditions in order to provide useful knowledge for team members\nto select appropriate intra-team strategies according to environmental\nconditions.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 12:13:02 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Sanchez-Anguix", "Victor", ""], ["Julian", "Vicente", ""], ["Botti", "Vicente", ""], ["Garcia-Fornes", "Ana", ""]]}, {"id": "1604.04809", "submitter": "Dominik Wojtczak", "authors": "Sunil Simon and Dominik Wojtczak", "title": "Efficient Local Search in Coordination Games on Graphs", "comments": "Extended version of a paper accepted to IJCAI16", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study strategic games on weighted directed graphs, where the payoff of a\nplayer is defined as the sum of the weights on the edges from players who chose\nthe same strategy augmented by a fixed non-negative bonus for picking a given\nstrategy. These games capture the idea of coordination in the absence of\nglobally common strategies. Prior work shows that the problem of determining\nthe existence of a pure Nash equilibrium for these games is NP-complete already\nfor graphs with all weights equal to one and no bonuses. However, for several\nclasses of graphs (e.g. DAGs and cliques) pure Nash equilibria or even strong\nequilibria always exist and can be found by simply following a particular\nimprovement or coalition-improvement path, respectively. In this paper we\nidentify several natural classes of graphs for which a finite improvement or\ncoalition-improvement path of polynomial length always exists, and, as a\nconsequence, a Nash equilibrium or strong equilibrium in them can be found in\npolynomial time. We also argue that these results are optimal in the sense that\nin natural generalisations of these classes of graphs, a pure Nash equilibrium\nmay not even exist.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 23:07:59 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Simon", "Sunil", ""], ["Wojtczak", "Dominik", ""]]}, {"id": "1604.05086", "submitter": "Ji Ruan", "authors": "Xiaowei Huang, Ji Ruan, Qingliang Chen and Kaile Su", "title": "Normative Multiagent Systems: A Dynamic Generalization", "comments": "26 pages. A conference version of this work is accepted by the 25th\n  International Joint Conference on Artificial Intelligence (IJCAI-16)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CC cs.LO cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social norms are powerful formalism in coordinating autonomous agents'\nbehaviour to achieve certain objectives. In this paper, we propose a dynamic\nnormative system to enable the reasoning of the changes of norms under\ndifferent circumstances, which cannot be done in the existing static normative\nsystems. We study two important problems (norm synthesis and norm recognition)\nrelated to the autonomy of the entire system and the agents, and characterise\nthe computational complexities of solving these problems.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 11:07:02 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Huang", "Xiaowei", ""], ["Ruan", "Ji", ""], ["Chen", "Qingliang", ""], ["Su", "Kaile", ""]]}, {"id": "1604.05194", "submitter": "Palash Dey", "authors": "Palash Dey and Neeldhara Misra", "title": "Preference Elicitation For Single Crossing Domain", "comments": "To appear in IJCAI 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.AI cs.DS cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Eliciting the preferences of a set of agents over a set of alternatives is a\nproblem of fundamental importance in social choice theory. Prior work on this\nproblem has studied the query complexity of preference elicitation for the\nunrestricted domain and for the domain of single peaked preferences. In this\npaper, we consider the domain of single crossing preference profiles and study\nthe query complexity of preference elicitation under various settings. We\nconsider two distinct situations: when an ordering of the voters with respect\nto which the profile is single crossing is known versus when it is unknown. We\nalso consider different access models: when the votes can be accessed at\nrandom, as opposed to when they are coming in a pre-defined sequence. In the\nsequential access model, we distinguish two cases when the ordering is known:\nthe first is that sequence in which the votes appear is also a single-crossing\norder, versus when it is not.\n  The main contribution of our work is to provide polynomial time algorithms\nwith low query complexity for preference elicitation in all the above six\ncases. Further, we show that the query complexities of our algorithms are\noptimal up to constant factors for all but one of the above six cases. We then\npresent preference elicitation algorithms for profiles which are close to being\nsingle crossing under various notions of closeness, for example, single\ncrossing width, minimum number of candidates | voters whose deletion makes a\nprofile single crossing.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 08:47:18 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Dey", "Palash", ""], ["Misra", "Neeldhara", ""]]}, {"id": "1604.05243", "submitter": "Yun Kuen Cheung", "authors": "Yun Kuen Cheung", "title": "Better Strategyproof Mechanisms without Payments or Prior --- An\n  Analytic Approach", "comments": "14 pages. This is the full version of and IJCAI 2016 conference paper\n  of the same title", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We revisit the problem of designing strategyproof mechanisms for allocating\ndivisible items among two agents who have linear utilities, where payments are\ndisallowed and there is no prior information on the agents' preferences. The\nobjective is to design strategyproof mechanisms which are competitive against\nthe most efficient (but not strategyproof) mechanism.\n  For the case with two items:\n  (1) We provide a set of sufficient conditions for strategyproofness.\n  (2) We use an analytic approach to derive strategyproof mechanisms which are\nmore competitive than all prior strategyproof mechanisms.\n  (3) We improve the linear-program-based proof of Guo and Conitzer to show new\nupper bounds on competitive ratios.\n  (4) We provide the first \"mathematical\" upper bound proof.\n  For the cases with any number of items:\n  (1) We build on the Partial Allocation mechanisms introduced by Cole et al.\nto design a strategyproof mechanism which is 0.67776-competitive, breaking the\n2/3 barrier.\n  (2) We propose a new subclass of strategyproof mechanisms called\nDynamical-Increasing-Price mechanisms, where each agent purchases the items\nusing virtual money, and the prices of the items depend on other agents'\npreferences.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 17:09:19 GMT"}, {"version": "v2", "created": "Wed, 12 Apr 2017 07:44:03 GMT"}], "update_date": "2017-04-13", "authors_parsed": [["Cheung", "Yun Kuen", ""]]}, {"id": "1604.05455", "submitter": "Yang Chao", "authors": "Chao Yang, Zhi-Hong Guan, Ming Chi, Gui-Lin Zheng", "title": "A hybrid approach for cooperative output regulation with sampled\n  compensator", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.MA", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This work investigates the cooperative output regulation problem of linear\nmulti-agent systems with hybrid sampled data control. Due to the limited data\nsensing and communication, in many practical situations, only sampled data are\navailable for the cooperation of multi-agent systems. To overcome this problem,\na distributed hybrid controller is presented for the cooperative output\nregulation, and cooperative output regulation is achieved by well designed\nstate feedback law. Then it proposed a method for the designing of sampled data\ncontroller to solve the cooperative output regulation problem with continuous\nlinear systems and discrete-time communication data. Finally, numerical\nsimulation example for cooperative tracking and a simulation example for\noptimal control of micro-grids are proposed to illustrate the result of the\nsampled data control law.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 07:24:02 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Yang", "Chao", ""], ["Guan", "Zhi-Hong", ""], ["Chi", "Ming", ""], ["Zheng", "Gui-Lin", ""]]}, {"id": "1604.05577", "submitter": "Nadeem Akhtar", "authors": "Nadeem Akhtar, Malik M. Saad Missen", "title": "Contribution to the Formal Specification and Verification of a\n  Multi-Agent Robotic System", "comments": "arXiv admin note: text overlap with arXiv:1501.05120", "journal-ref": "European Journal of Scientific Research, ISSN 1450-216X /\n  1450-202X Vol.117 No.1 January, 2014, pp. 35-55", "doi": null, "report-no": null, "categories": "cs.SE cs.AI cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is important to have multi-agent robotic system specifications that ensure\ncorrectness properties of safety and liveness. As these systems have\nconcurrency, and often have dynamic environment, the formal specification and\nverification of these systems along with step-wise refinement from abstract to\nconcrete concepts play a major role in system correctness. Formal verification\nis used for exhaustive investigation of the system space thus ensuring that\nundetected failures in the behavior are excluded. We construct the system\nincrementally from subcomponents, based on software architecture. The challenge\nis to develop a safe multi-agent robotic system, more specifically to ensure\nthe correctness properties of safety and liveness. Formal specifications based\non model-checking are flexible, have a concrete syntax, and play vital role in\ncorrectness of a multi-agent robotic system. To formally verify safety and\nliveness of such systems is important because they have high concurrency and in\nmost of the cases have dynamic environment. We have considered a case-study of\na multi-agent robotic system for the transport of stock between storehouses to\nexemplify our formal approach. Our proposed development approach allows for\nformal verification during specification definition. The development process\nhas been classified in to four major phases of requirement specifications,\nverification specifications, architecture specifications and implementation.\n", "versions": [{"version": "v1", "created": "Fri, 2 Oct 2015 13:53:35 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Akhtar", "Nadeem", ""], ["Missen", "Malik M. Saad", ""]]}, {"id": "1604.05942", "submitter": "Arash Tavakoli", "authors": "Arash Tavakoli, Haig Nalbandian, Nora Ayanian", "title": "Multiplayer Games for Learning Multirobot Coordination Algorithms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.RO cs.AI cs.HC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Humans have an impressive ability to solve complex coordination problems in a\nfully distributed manner. This ability, if learned as a set of distributed\nmultirobot coordination strategies, can enable programming large groups of\nrobots to collaborate towards complex coordination objectives in a way similar\nto humans. Such strategies would offer robustness, adaptability,\nfault-tolerance, and, importantly, distributed decision-making. To that end, we\nhave designed a networked gaming platform to investigate human group behavior,\nspecifically in solving complex collaborative coordinated tasks. Through this\nplatform, we are able to limit the communication, sensing, and actuation\ncapabilities provided to the players. With the aim of learning coordination\nalgorithms for robots in mind, we define these capabilities to mimic those of a\nsimple ground robot.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 13:12:45 GMT"}], "update_date": "2016-04-21", "authors_parsed": [["Tavakoli", "Arash", ""], ["Nalbandian", "Haig", ""], ["Ayanian", "Nora", ""]]}, {"id": "1604.06121", "submitter": "Chathika Gunaratne", "authors": "Chathika Gunaratne, Mustafa Ilhan Akbas, Ivan Garibay, Ozlem Ozmen", "title": "Evaluation of Zika Vector Control Strategies Using Agent-Based Modeling", "comments": "14 pages, 6 figures, 1 table, conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Aedes Aegypti is the vector of several deadly diseases, including Zika.\nEffective and sustainable vector control measures must be deployed to keep A.\naegypti numbers under control. The distribution of A. Aegypti is subject to\nspatial and climatic constraints. Using agent-based modeling, we model the\npopulation dynamics of A. aegypti subjected to the spatial and climatic\nconstraints of a neighborhood in the Key West. Satellite imagery was used to\nidentify vegetation, houses (CO2 zones) both critical to the mosquito\nlifecycle. The model replicates the seasonal fluctuation of adult population\nsampled through field studies and approximates the population at a high of 986\n(95% CI: [979, 993]) females and 1031 (95% CI: [1024, 1039]) males in the fall\nand a low of 316 (95% CI: [313, 319]) females and 333 (95% CI: [330, 336])\nmales during the winter. We then simulate two biological vector control\nstrategies: 1) Wolbachia infection and 2) Release of Insects carrying a\nDominant Lethal gene (RIDL). Our results support the probability of sustained\nWolbachia infection within the population for two years after the year of\nrelease. egies, our approach provides a realistic simulation environment\nconsisting of male and female Aedes aegypti, breeding spots, vegetation and CO2\nsources.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 20:52:41 GMT"}, {"version": "v2", "created": "Thu, 4 Aug 2016 18:11:18 GMT"}], "update_date": "2016-08-05", "authors_parsed": [["Gunaratne", "Chathika", ""], ["Akbas", "Mustafa Ilhan", ""], ["Garibay", "Ivan", ""], ["Ozmen", "Ozlem", ""]]}, {"id": "1604.07108", "submitter": "Christopher Marriott", "authors": "Chris Marriott and Jobran Chebib", "title": "Modeling the Evolution of Gene-Culture Divergence", "comments": "8 pages, ALIFE 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE cs.MA q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a model for evolving agents using both genetic and cultural\ninheritance mechanisms. Within each agent our model maintains two distinct\ninformation stores we call the genome and the memome. Processes of adaptation\nare modeled as evolutionary processes at each level of adaptation\n(phylogenetic, ontogenetic, sociogenetic). We review relevant competing models\nand we show how our model improves on previous attempts to model genetic and\ncultural evolutionary processes. In particular we argue our model can achieve\ndivergent gene-culture co-evolution.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2016 02:18:45 GMT"}], "update_date": "2016-04-26", "authors_parsed": [["Marriott", "Chris", ""], ["Chebib", "Jobran", ""]]}, {"id": "1604.08191", "submitter": "Zack Fitzsimmons", "authors": "Zack Fitzsimmons and Edith Hemaspaandra", "title": "Modeling Single-Peakedness for Votes with Ties", "comments": "A shorter version of this paper will appear in STAIRS 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Single-peakedness is one of the most important and well-known domain\nrestrictions on preferences. The computational study of single-peaked\nelectorates has largely been restricted to elections with tie-free votes, and\nrecent work that studies the computational complexity of manipulative attacks\nfor single-peaked elections for votes with ties has been restricted to\nnonstandard models of single-peaked preferences for top orders. We study the\ncomputational complexity of manipulation for votes with ties for the standard\nmodel of single-peaked preferences and for single-plateaued preferences. We\nshow that these models avoid the anomalous complexity behavior exhibited by the\nother models. We also state a surprising result on the relation between the\nsocietal axis and the complexity of manipulation for single-peaked preferences.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2016 19:28:00 GMT"}, {"version": "v2", "created": "Sat, 18 Jun 2016 17:21:39 GMT"}], "update_date": "2016-06-21", "authors_parsed": [["Fitzsimmons", "Zack", ""], ["Hemaspaandra", "Edith", ""]]}, {"id": "1604.08226", "submitter": "Pavel Hrab\\'ak", "authors": "Pavel Hrab\\'ak and Marek Buk\\'a\\v{c}ek", "title": "Influence of Agents Heterogeneity in Cellular Model of Evacuation", "comments": "Submitted to Journal of Computational Science", "journal-ref": "Journal of Computational Science, Volume 21, July 2017, Pages\n  486-493", "doi": "10.1016/j.jocs.2016.08.002", "report-no": null, "categories": "cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The influence of agents heterogeneity on the microscopic characteristics of\npedestrian flow is studied via an evacuation simulation tool based on the\nFloor-Field model. The heterogeneity is introduced in agents velocity,\naggressiveness, and sensitivity to occupation. The simulation results are\ncompared to data gathered during an original experiment. The comparison shows\nthat the heterogeneity in aggressiveness and sensitivity occupation enables to\nreproduce some microscopic aspects. The heterogeneity in velocity seems to be\nredundant.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2016 20:22:27 GMT"}], "update_date": "2018-01-08", "authors_parsed": [["Hrabák", "Pavel", ""], ["Bukáček", "Marek", ""]]}, {"id": "1604.08381", "submitter": "Hanbaek Lyu", "authors": "Hanbaek Lyu", "title": "Global synchronization of pulse-coupled oscillators on trees", "comments": "41 pages, 21 figures, preprint. Definition of the adaptive 4-coupling\n  is presented as a pesudocode. Simulation of the adaptive 4-coupling modulo\n  $M=64$ is added in Figure 1, SIAM Journal on Applied Dynamical Systems, 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.MA math.DS nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider a distributed network on a finite simple graph $G=(V,E)$ with\ndiameter $d$ and maximum degree $\\Delta$, where each node has a phase\noscillator revolving on $S^{1}=\\mathbb{R}/\\mathbb{Z}$ with unit speed.\nPulse-coupling is a class of distributed time evolution rule for such networked\nphase oscillators inspired by biological oscillators, which depends only upon\nevent-triggered local pulse communications. In this paper, we propose a novel\ninhibitory pulse-coupling and prove that arbitrary phase configuration on $G$\nsynchronizes by time $51d$ if $G$ is a tree and $\\Delta \\le 3$. We extend this\npulse-coupling by letting each oscillator throttle the input according to an\nauxiliary state variable. We show that the resulting adaptive pulse-coupling\nsynchronizes arbitrary initial configuration on $G$ by time $83d$ if $G$ is a\ntree. As an application, we obtain a universal randomized distributed clock\nsynchronization algorithm, which uses $O(\\log \\Delta)$ memory per node and\nconverges on any $G$ with expected worst case running time of\n$O(|V|+(d^{5}+\\Delta^{2})\\log |V|)$.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 11:49:06 GMT"}, {"version": "v2", "created": "Fri, 17 Feb 2017 03:47:13 GMT"}, {"version": "v3", "created": "Wed, 22 Feb 2017 06:29:06 GMT"}, {"version": "v4", "created": "Wed, 23 Aug 2017 06:22:20 GMT"}, {"version": "v5", "created": "Sat, 23 Sep 2017 01:09:50 GMT"}, {"version": "v6", "created": "Sat, 16 Dec 2017 04:19:55 GMT"}], "update_date": "2018-01-25", "authors_parsed": [["Lyu", "Hanbaek", ""]]}]