[{"id": "1903.00222", "submitter": "Jan Philipp W\\\"achter", "authors": "Daniele D'Angeli, Dominik Francoeur, Emanuele Rodaro, Jan Philipp\n  W\\\"achter", "title": "Infinite Automaton Semigroups and Groups Have Infinite Orbits", "comments": "This matches the published version. Compared to v1, the paper has\n  mostly been re-written and some results have been removed. Almost all of them\n  can be found in arXiv:2007.10273. There are no changes compared to v2", "journal-ref": "Journal of Algebra 553 (2020) 119-137", "doi": "10.1016/j.jalgebra.2020.02.014", "report-no": null, "categories": "cs.FL math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that an automaton group or semigroup is infinite if and only if it\nadmits an $\\omega$-word (i. e. a right-infinite word) with an infinite orbit,\nwhich solves an open problem communicated to us by Ievgen V. Bondarenko. In\nfact, we prove a generalization of this result, which can be applied to show\nthat finitely generated subgroups and subsemigroups as well as principal left\nideals of automaton semigroups are infinite if and only if there is an $\\omega$\n-word with an infinite orbit under their action. The proof also shows some\ninteresting connections between the automaton semigroup and its dual. Finally,\nour result is interesting from an algorithmic perspective as it allows for a\nreformulation of the finiteness problem for automaton groups and semigroups.\n", "versions": [{"version": "v1", "created": "Fri, 1 Mar 2019 09:26:23 GMT"}, {"version": "v2", "created": "Sat, 18 Jul 2020 09:27:37 GMT"}, {"version": "v3", "created": "Fri, 21 Aug 2020 07:00:40 GMT"}], "update_date": "2020-08-24", "authors_parsed": [["D'Angeli", "Daniele", ""], ["Francoeur", "Dominik", ""], ["Rodaro", "Emanuele", ""], ["Wächter", "Jan Philipp", ""]]}, {"id": "1903.00226", "submitter": "Wim Martens", "authors": "Wim Martens and Matthias Niewerth and Tina Trautner", "title": "A Trichotomy for Regular Trail Queries", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DB cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regular path queries (RPQs) are an essential component of graph query\nlanguages. Such queries consider a regular expression r and a directed\nedge-labeled graph G and search for paths in G for which the sequence of labels\nis in the language of r. In order to avoid having to consider infinitely many\npaths, some database engines restrict such paths to be trails, that is, they\nonly consider paths without repeated edges. In this paper we consider the\nevaluation problem for RPQs under trail semantics, in the case where the\nexpression is fixed. We show that, in this setting, there exists a trichotomy.\nMore precisely, the complexity of RPQ evaluation divides the regular languages\ninto the finite languages, the class Ttract (for which the problem is\ntractable), and the rest. Interestingly, the tractable class in the trichotomy\nis larger than for the trichotomy for simple paths, discovered by Bagan,\nBonifati, and Groz [PODS 2013]. In addition to this trichotomy result, we also\nstudy characterizations of the tractable class, its expressivity, the\nrecognition problem, closure properties, and show how the decision problem can\nbe extended to the enumeration problem, which is relevant to practice.\n", "versions": [{"version": "v1", "created": "Fri, 1 Mar 2019 09:50:53 GMT"}], "update_date": "2019-03-04", "authors_parsed": [["Martens", "Wim", ""], ["Niewerth", "Matthias", ""], ["Trautner", "Tina", ""]]}, {"id": "1903.00728", "submitter": "Reino Niskanen", "authors": "Pablo Barcelo, Chih-Duo Hong, Xuan-Bach Le, Anthony W. Lin, Reino\n  Niskanen", "title": "Monadic Decomposability of Regular Relations", "comments": "Full version of the paper accepted to ICALP 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Monadic decomposibility --- the ability to determine whether a formula in a\ngiven logical theory can be decomposed into a boolean combination of monadic\nformulas --- is a powerful tool for devising a decision procedure for a given\nlogical theory. In this paper, we revisit a classical decision problem in\nautomata theory: given a regular (a.k.a. synchronized rational) relation,\ndetermine whether it is recognizable, i.e., it has a monadic decomposition\n(that is, a representation as a boolean combination of cartesian products of\nregular languages). Regular relations are expressive formalisms which, using an\nappropriate string encoding, can capture relations definable in Presburger\nArithmetic. In fact, their expressive power coincide with relations definable\nin a universal automatic structure; equivalently, those definable by finite set\ninterpretations in WS1S (Weak Second Order Theory of One Successor).\nDetermining whether a regular relation admits a recognizable relation was known\nto be decidable (and in exponential time for binary relations), but its precise\ncomplexity still hitherto remains open. Our main contribution is to fully\nsettle the complexity of this decision problem by developing new techniques\nemploying infinite Ramsey theory. The complexity for DFA (resp. NFA)\nrepresentations of regular relations is shown to be NLOGSPACE-complete (resp.\n\\PSPACE-complete).\n", "versions": [{"version": "v1", "created": "Sat, 2 Mar 2019 16:16:32 GMT"}, {"version": "v2", "created": "Thu, 7 Mar 2019 13:42:25 GMT"}, {"version": "v3", "created": "Wed, 8 May 2019 09:09:44 GMT"}], "update_date": "2019-05-09", "authors_parsed": [["Barcelo", "Pablo", ""], ["Hong", "Chih-Duo", ""], ["Le", "Xuan-Bach", ""], ["Lin", "Anthony W.", ""], ["Niskanen", "Reino", ""]]}, {"id": "1903.01297", "submitter": "Ting Gan", "authors": "Ting Gan and Bican Xia and Bai Xue and Naijun Zhan and Liyun Dai", "title": "Nonlinear Craig Interpolant Generation", "comments": "32 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  Interpolation-based techniques have become popularized in recent years\nbecause of their inherently modular and local reasoning, which can scale up\nexisting formal verification techniques like theorem proving, model-checking,\nabstraction interpretation, and so on, while the scalability is the bottleneck\nof these techniques. Craig interpolant generation plays a central role in\ninterpolation-based techniques, and therefore has drawn increasing attentions.\nIn the literature, there are various works done on how to automatically\nsynthesize interpolants for decidable fragments of first-order logic, linear\narithmetic, array logic, equality logic with uninterpreted functions (EUF),\netc., and their combinations. But Craig interpolant generation for non-linear\ntheory and its combination with the aforementioned theories are still in\ninfancy, although some attempts have been done. In this paper, we first prove\nthat a polynomial interpolant of the form $h(\\mathbf{x})>0$ exists for two\nmutually contradictory polynomial formulas $\\phi(\\mathbf{x},\\mathbf{y})$ and\n$\\psi(\\mathbf{x},\\mathbf{z})$, with the form $f_1\\ge0\\wedge\\cdots\\wedge\nf_n\\ge0$, where $f_i$ are polynomials in $\\mathbf{x},\\mathbf{y}$ or\n$\\mathbf{x},\\mathbf{z}$, and the quadratic module generated by $f_i$ is\nArchimedean. Then, we show that synthesizing such interpolant can be reduced to\nsolving a semi-definite programming problem (${\\rm SDP}$). In addition, we\npropose a verification approach to assure the validity of the synthesized\ninterpolant and consequently avoid the unsoundness caused by numerical error in\n${\\rm SDP}$ solving. Finally, we discuss how to generalize our approach to\ngeneral semi-algebraic formulas.\n", "versions": [{"version": "v1", "created": "Mon, 4 Mar 2019 15:04:09 GMT"}, {"version": "v2", "created": "Tue, 5 Mar 2019 13:38:51 GMT"}, {"version": "v3", "created": "Mon, 11 May 2020 03:56:34 GMT"}], "update_date": "2020-05-12", "authors_parsed": [["Gan", "Ting", ""], ["Xia", "Bican", ""], ["Xue", "Bai", ""], ["Zhan", "Naijun", ""], ["Dai", "Liyun", ""]]}, {"id": "1903.02759", "submitter": "Marc Shapiro", "authors": "Sreeja Nair (DELYS), Gustavo Petri, Marc Shapiro (DELYS)", "title": "Invariant Safety for Distributed Applications", "comments": "Workshop on Principles and Practice of Consistency for Distributed\n  Data (PaPoC), Mar 2019, Dresden, Germany.\n  https://novasys.di.fct.unl.pt/conferences/papoc19/", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.DB cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a proof methodology for verifying the safety of data invariants of\nhighly-available distributed applications that replicate state. The proof is\n(1) modular: one can reason about each individual operation separately, and (2)\nsequential: one can reason about a distributed application as if it were\nsequential. We automate the methodology and illustrate the use of the tool with\na representative example.\n", "versions": [{"version": "v1", "created": "Thu, 7 Mar 2019 07:40:22 GMT"}], "update_date": "2019-03-08", "authors_parsed": [["Nair", "Sreeja", "", "DELYS"], ["Petri", "Gustavo", "", "DELYS"], ["Shapiro", "Marc", "", "DELYS"]]}, {"id": "1903.03001", "submitter": "Ian McQuillan", "authors": "Joey Eremondi, Oscar H. Ibarra, Ian McQuillan", "title": "On the Density of Context-Free and Counter Languages", "comments": null, "journal-ref": "International Journal of Foundations of Computer Science, 29(2),\n  233-250, 2018", "doi": "10.1142/S0129054118400051", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A language $L$ is said to be dense if every word in the universe is an infix\nof some word in $L$. This notion has been generalized from the infix operation\nto arbitrary word operations $\\varrho$ in place of the infix operation\n($\\varrho$-dense, with infix-dense being the standard notion of dense). It is\nshown here that it is decidable, for a language $L$ accepted by a one-way\nnondeterministic reversal-bounded pushdown automaton, whether $L$ is\ninfix-dense. However, it becomes undecidable for both deterministic pushdown\nautomata (with no reversal-bound), and for nondeterministic one-counter\nautomata. When examining suffix-density, it is undecidable for more restricted\nfamilies such as deterministic one-counter automata that make three reversals\non the counter, but it is decidable with less reversals. Other decidability\nresults are also presented on dense languages, and contrasted with a marked\nversion called $\\varrho$-marked-density. Also, new languages are demonstrated\nto be outside various deterministic language families after applying different\ndeletion operations from smaller families. Lastly, bounded-dense languages are\ndefined and examined.\n", "versions": [{"version": "v1", "created": "Thu, 7 Mar 2019 15:38:17 GMT"}], "update_date": "2019-03-08", "authors_parsed": [["Eremondi", "Joey", ""], ["Ibarra", "Oscar H.", ""], ["McQuillan", "Ian", ""]]}, {"id": "1903.03018", "submitter": "Ian McQuillan", "authors": "Oscar H. Ibarra and Ian McQuillan", "title": "On the Density of Languages Accepted by Turing Machines and Other\n  Machine Models", "comments": null, "journal-ref": "Journal of Automata, Languages and Combinatorics, 23, 189-199,\n  2018", "doi": "10.25596/jalc-2018-189", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A language is dense if the set of all infixes (or subwords) of the language\nis the set of all words. Here, it is shown that it is decidable whether the\nlanguage accepted by a nondeterministic Turing machine with a one-way read-only\ninput and a reversal-bounded read/write worktape (the read/write head changes\ndirection at most some fixed number of times) is dense. From this, it is\nimplied that it is also decidable for one-way reversal-bounded queue automata,\none-way reversal-bounded stack automata, and one-way reversal-bounded $k$-flip\npushdown automata (machines that can \"flip\" their pushdowns up to $k$ times).\nHowever, it is undecidable for deterministic Turing machines with two\n1-reversal-bounded worktapes (even when the two tapes are restricted to operate\nas 1-reversal-bounded pushdown stacks).\n", "versions": [{"version": "v1", "created": "Thu, 7 Mar 2019 16:10:24 GMT"}], "update_date": "2019-03-08", "authors_parsed": [["Ibarra", "Oscar H.", ""], ["McQuillan", "Ian", ""]]}, {"id": "1903.03504", "submitter": "Ian McQuillan", "authors": "Oscar H. Ibarra, Ian McQuillan, Bala Ravikumar", "title": "On counting functions and slenderness of languages", "comments": null, "journal-ref": null, "doi": "10.1016/j.tcs.2018.11.021", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study counting-regular languages -- these are languages $L$ for which\nthere is a regular language $L'$ such that the number of strings of length $n$\nin $L$ and $L'$ are the same for all $n$. We show that the languages accepted\nby unambiguous nondeterministic Turing machines with a one-way read-only input\ntape and a reversal-bounded worktape are counting-regular. Many one-way\nacceptors are a special case of this model, such as reversal-bounded\ndeterministic pushdown automata, reversal-bounded deterministic queue automata,\nand many others, and therefore all languages accepted by these models are\ncounting-regular. This result is the best possible in the sense that the claim\ndoes not hold for either $2$-ambiguous PDA's, unambiguous PDA's with no\nreversal-bound, and other models.\n  We also study closure properties of counting-regular languages, and we study\ndecidability problems in regards to counting-regularity. For example, it is\nshown that the counting-regularity of even some restricted subclasses of PDA's\nis undecidable. Lastly, $k$-slender languages -- where there are at most $k$\nwords of any length -- are also studied. Amongst other results, it is shown\nthat it is decidable whether a language in any semilinear full trio is\n$k$-slender.\n", "versions": [{"version": "v1", "created": "Fri, 8 Mar 2019 15:31:31 GMT"}], "update_date": "2019-03-11", "authors_parsed": [["Ibarra", "Oscar H.", ""], ["McQuillan", "Ian", ""], ["Ravikumar", "Bala", ""]]}, {"id": "1903.03518", "submitter": "Ian McQuillan", "authors": "Joey Eremondi, Oscar H. Ibarra, Ian McQuillan", "title": "Insertion Operations on Deterministic Reversal-Bounded Counter Machines", "comments": null, "journal-ref": null, "doi": "10.1016/j.jcss.2018.02.003", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several insertion operations are studied applied to languages accepted by\none-way and two-way deterministic reversal-bounded multicounter machines. These\noperations are defined by the ideals obtained from relations such as the\nprefix, infix, suffix, and outfix relations, as well as operations defined from\ninverses of a type of deterministic transducer with reversal-bounded counters\nattached. The question of whether the resulting languages can always be\naccepted by deterministic machines with the same number (or larger number) of\ninput-turns (resp., counters, counter-reversals, etc.) is investigated.\n", "versions": [{"version": "v1", "created": "Fri, 8 Mar 2019 15:46:04 GMT"}], "update_date": "2019-03-11", "authors_parsed": [["Eremondi", "Joey", ""], ["Ibarra", "Oscar H.", ""], ["McQuillan", "Ian", ""]]}, {"id": "1903.03680", "submitter": "Apostolos Syropoulos", "authors": "Apostolos Syropoulos", "title": "Fuzzy Bigraphs: An Exercise in Fuzzy Communicating Agents", "comments": "11 pages, 3 figures", "journal-ref": null, "doi": "10.1007/978-3-030-38565-1_13", "report-no": null, "categories": "cs.LO cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bigraphs and their algebra is a model of concurrency. Fuzzy bigraphs are a\ngeneralization of birgraphs intended to be a model of concurrency that\nincorporates vagueness. More specifically, this model assumes that agents are\nsimilar, communication is not perfect, and, in general, everything is or\nhappens to some degree.\n", "versions": [{"version": "v1", "created": "Tue, 5 Mar 2019 14:28:59 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Syropoulos", "Apostolos", ""]]}, {"id": "1903.03827", "submitter": "Juan Perez-Mercader", "authors": "Marta Duenas-Diez and Juan Perez-Mercader", "title": "Native Chemical Automata and the Thermodynamic Interpretation of Their\n  Experimental Accept/Reject Responses", "comments": "21 pages and 3 figures. To appear in \"The Energetics of Computing in\n  Life and Machines\", edited by David H. Wolpert, Chris Kempes, Joshua A.\n  Grochow, and Peter F. Stadler. Santa Fe: SFI Press, 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The theory of computation is based on abstract computing automata which can\nbe classified into a three-class hierarchy: Finite Automata (FA), Push-down\nAutomata (PDA) and the Turing Machines (TM). Each class corresponds to\ngrammar/language classes. The function of the automata consists on recognizing\nwords in a language generated by some grammar and expressed with letters from\nan alphabet. Such automata are, in principle, abstract entities and with\nsuitable combinations of them we can represent any computation, no matter how\ncomplex. Their physical implementations are possible in any information\ncarrying and recognition contexts and media, such as electrons in\nsemiconductors, certain biomolecules in biology or even non-biological\nmolecules. Here we describe and build non-biochemistry (inorganic chemistry)\nexamples of a FA, PDA and TM computations carried out by specific laboratory\nrealizations of the automata. For each of the three realizations we find a\nthermodynamic metric, based on enthalpy for the FA and PDA, and on the Gibbs\nfree energy for the TM, to both assess the results of computation and as a\nfirst step towards quantifying the energetic cost of such computations.\n", "versions": [{"version": "v1", "created": "Sat, 9 Mar 2019 17:12:14 GMT"}], "update_date": "2019-03-12", "authors_parsed": [["Duenas-Diez", "Marta", ""], ["Perez-Mercader", "Juan", ""]]}, {"id": "1903.04325", "submitter": "Pascal Vanier", "authors": "Ronnie Pavlov, Pascal Vanier (LACL)", "title": "The relationship between word complexity and computational complexity in\n  subshifts", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.CC cs.FL math.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove several results about the relationship between the word complexity\nfunction of a subshift and the set of Turing degrees of points of the subshift,\nwhich we call the Turing spectrum. Among other results, we show that a Turing\nspectrum can be realized via a subshift of linear complexity if and only if it\nconsists of the union of a finite set and a finite number of cones, that a\nTuring spectrum can be realized via a subshift of exponential complexity (i.e.\npositive entropy) if and only if it contains a cone, and that every Turing\nspectrum which either contains degree 0 or is a union of cones is realizable by\nsubshifts with a wide range of 'intermediate' complexity growth rates between\nlinear and exponential.\n", "versions": [{"version": "v1", "created": "Mon, 11 Mar 2019 14:34:13 GMT"}], "update_date": "2019-03-12", "authors_parsed": [["Pavlov", "Ronnie", "", "LACL"], ["Vanier", "Pascal", "", "LACL"]]}, {"id": "1903.05442", "submitter": "\\v{S}t\\v{e}p\\'an Holub", "authors": "Daniel Gabric, \\v{S}t\\v{e}p\\'an Holub, Jeffrey Shallit", "title": "Maximal State Complexity and Generalized de Bruijn Words", "comments": "Corrected and extended version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We compute the exact maximum state complexity for the language consisting of\n$m$ words of length $N$, and characterize languages achieving the maximum. We\nalso consider a special case, namely languages $C(w)$ consisting of the\nconjugates of a single word $w$. The words for which the maximum state\ncomplexity of $C(w)$ is achieved turn out to be a natural generalization of de\nBruijn words. We show that generalized de Bruijn words exist for each length\nand consider the number of them.\n", "versions": [{"version": "v1", "created": "Wed, 13 Mar 2019 12:20:37 GMT"}, {"version": "v2", "created": "Wed, 18 Dec 2019 17:06:43 GMT"}], "update_date": "2019-12-19", "authors_parsed": [["Gabric", "Daniel", ""], ["Holub", "Štěpán", ""], ["Shallit", "Jeffrey", ""]]}, {"id": "1903.05896", "submitter": "Markus Schmid", "authors": "Markus L. Schmid", "title": "Regular Expressions with Backreferences: Polynomial-Time Matching\n  Techniques", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Regular expressions with backreferences (regex, for short), as supported by\nmost modern libraries for regular expression matching, have an NP-complete\nmatching problem. We define a complexity parameter of regex, called active\nvariable degree, such that regex with this parameter bounded by a constant can\nbe matched in polynomial-time. Moreover, we formulate a novel type of\ndeterminism for regex (on an automaton-theoretic level), which yields the class\nof memory-deterministic regex that can be matched in time O(|w|p(|r|)) for a\npolynomial p (where r is the regex and w the word). Natural extensions of these\nconcepts lead to properties of regex that are intractable to check.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2019 10:22:09 GMT"}], "update_date": "2019-03-15", "authors_parsed": [["Schmid", "Markus L.", ""]]}, {"id": "1903.06011", "submitter": "Sukanta Das Dr.", "authors": "Kamalika Bhattacharjee, Sukanta Das", "title": "On Finite $1$-Dimensional Cellular Automata: Reversibility and\n  Semi-reversibility", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reversibility of a one-dimensional finite cellular automaton (CA) is\ndependent on lattice size. A finite CA can be reversible for a set of lattice\nsizes. On the other hand, reversibility of an infinite CA, which is decided by\nexploring the rule only, is different in its kind from that of finite CA. Can\nwe, however, link the reversibility of finite CA to that of infinite CA? In\norder to address this issue, we introduce a new notion, named\nsemi-reversibility. We classify the CAs into three types with respect to\nreversibility property -- reversible, semi-reversible and strictly\nirreversible. A tool, reachability tree, has been used to decide the\nreversibility class of any CA. Finally, relation among the existing cases of\nreversibility is established.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2019 14:08:46 GMT"}], "update_date": "2019-03-15", "authors_parsed": [["Bhattacharjee", "Kamalika", ""], ["Das", "Sukanta", ""]]}, {"id": "1903.06114", "submitter": "Emilie Charlier", "authors": "\\'Emilie Charlier, C\\'elia Cisternino and Adeline Massuir", "title": "State complexity of the multiples of the Thue-Morse set", "comments": "23 pages, 10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Thue-Morse set is the set of those nonnegative integers whose binary\nexpansions have an even number of $1$. We obtain an exact formula for the state\ncomplexity of the multiplication by a constant of the Thue-Morse set\n$\\mathcal{T}$ with respect with any base $b$ which is a power of $2$. Our proof\nis constructive and we are able to explicitly provide the minimal automaton of\nthe language of all $2^p$-expansions of the set of integers $m\\mathcal{T}$ for\nany positive integers $m$ and $p$.\n", "versions": [{"version": "v1", "created": "Sun, 10 Mar 2019 15:27:07 GMT"}], "update_date": "2019-03-15", "authors_parsed": [["Charlier", "Émilie", ""], ["Cisternino", "Célia", ""], ["Massuir", "Adeline", ""]]}, {"id": "1903.06195", "submitter": "Holger Petersen", "authors": "Holger Petersen", "title": "LIKE Patterns and Complexity", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the expressive power and complexity questions for the LIKE\noperator in SQL.\n", "versions": [{"version": "v1", "created": "Thu, 14 Mar 2019 18:06:05 GMT"}], "update_date": "2019-03-18", "authors_parsed": [["Petersen", "Holger", ""]]}, {"id": "1903.06997", "submitter": "Chris Grossack", "authors": "Chris Grossack", "title": "Extensions of Abelian Automata Groups", "comments": "2e: revised and resubmitted to IJAC", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  A theorem of Nekrashevych and Sidki shows the Mealy Automata structures one\ncan place on Z^m are parametrized by a family of matrices (called\n\"1/2-integral\") and a choice of residuation vector e in Z^m. While the impact\nof the chosen matrix is well understood, the impact of the residuation vector\non the resulting structure is seemingly sporadic. In this paper we characterize\nthe impact of the residuation vector e by recognizing an initial structure when\ne is the first standard basis vector. All other choices of e extend this\ninitial structure by adding \"fractional elements\" in a way we make precise.\n", "versions": [{"version": "v1", "created": "Sat, 16 Mar 2019 22:41:09 GMT"}, {"version": "v2", "created": "Wed, 19 Aug 2020 16:25:05 GMT"}], "update_date": "2020-08-20", "authors_parsed": [["Grossack", "Chris", ""]]}, {"id": "1903.07328", "submitter": "Masaki Waga", "authors": "Masaki Waga and \\'Etienne Andr\\'e", "title": "Online Parametric Timed Pattern Matching with Automata-Based Skipping", "comments": "Accepted to NFM 2019. arXiv admin note: text overlap with\n  arXiv:1812.08940", "journal-ref": "Lecture Notes in Computer Science, volume 11460, pages 371-389,\n  May 2019", "doi": "10.1007/978-3-030-20652-9_26", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Timed pattern matching has strong connections with monitoring real-time\nsystems. Given a log and a specification containing timing parameters (that can\ncapture uncertain or unknown constants), parametric timed pattern matching aims\nat exhibiting for which start and end dates, as well as which parameter\nvaluations, a specification holds on that log. This problem is notably close to\nrobustness. We propose here a new framework for parametric timed pattern\nmatching. Not only we dramatically improve the efficiency when compared to a\nprevious method based on parametric timed model checking, but we further\npropose optimizations based on skipping. Our algorithm is suitable for online\nmonitoring, and experiments show that it is fast enough to be applied at\nruntime.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2019 09:41:07 GMT"}], "update_date": "2019-07-31", "authors_parsed": [["Waga", "Masaki", ""], ["André", "Étienne", ""]]}, {"id": "1903.07477", "submitter": "Tomoyuki Yamakami", "authors": "Tomoyuki Yamakami", "title": "One-Way Topological Automata and the Tantalizing Effects of Their\n  Topological Features", "comments": "(10pt, A4, pp21) This is a complete and corrected version of an\n  extended abstract that appeared in the Proceedings of the 10th International\n  Workshop on Non-Classical Models of Automata and Applications (NCMA 2018),\n  August 21-22, 2018, Kosice, Slovakia, Osterreichische Computer Gesellschaft\n  (the Austrian Computer Society), pp. 197--214, 2018", "journal-ref": "(journal version) Journal of Automata, Languages and Combinatorics\n  25(2-3): 235-273 (2020)", "doi": "10.25596/jalc-2020-235", "report-no": null, "categories": "cs.FL cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We cast new light on the existing models of one-way deterministic topological\nautomata by introducing a fresh but general, convenient model, in which, as\neach input symbol is read, an interior system of an automaton, known as a\nconfiguration, continues to evolve in a topological space by applying\ncontinuous transition operators one by one. The acceptance and rejection of a\ngiven input are determined by observing the interior system after the input is\ncompletely processed. Such automata naturally generalize one-way finite\nautomata of various types, including deterministic, probabilistic, quantum, and\npushdown automata. We examine the strengths and weaknesses of the power of this\nnew automata model when recognizing formal languages. We investigate\ntantalizing effects of various topological features of our topological automata\nby analyzing their behaviors when different kinds of topological spaces and\ncontinuous maps, which are used respectively as configuration spaces and\ntransition operators, are provided to the automata. Finally, we present goals\nand directions of future studies on the topological features of topological\nautomata.\n", "versions": [{"version": "v1", "created": "Mon, 18 Mar 2019 14:35:24 GMT"}, {"version": "v2", "created": "Fri, 15 Nov 2019 12:05:09 GMT"}, {"version": "v3", "created": "Mon, 17 Aug 2020 15:12:47 GMT"}], "update_date": "2021-04-19", "authors_parsed": [["Yamakami", "Tomoyuki", ""]]}, {"id": "1903.07913", "submitter": "Antonio E. Porreca", "authors": "Alberto Dennunzio, Enrico Formenti, Luca Manzoni, Antonio E. Porreca", "title": "Complexity of the dynamics of reaction systems", "comments": "Preprint", "journal-ref": "Information and Computation, Volume 267, August 2019, Pages 96-109", "doi": "10.1016/j.ic.2019.03.006", "report-no": null, "categories": "cs.FL cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reaction systems are discrete dynamical systems inspired by bio-chemical\nprocesses, whose dynamical behaviour is expressed by set-theoretic operations\non finite sets. Reaction systems thus provide a description of bio-chemical\nphenomena that complements the more traditional approaches, for instance those\nbased on differential equations. A comprehensive list of decision problems\nabout the dynamical behavior of reaction systems (such as cycles and\nfixed/periodic points, attractors, and reachability) is provided along with the\ncorresponding computational complexity, which ranges from tractable problems to\nPSPACE-complete problems.\n", "versions": [{"version": "v1", "created": "Tue, 19 Mar 2019 10:11:11 GMT"}], "update_date": "2020-08-05", "authors_parsed": [["Dennunzio", "Alberto", ""], ["Formenti", "Enrico", ""], ["Manzoni", "Luca", ""], ["Porreca", "Antonio E.", ""]]}, {"id": "1903.08053", "submitter": "Henning Urbat", "authors": "Henning Urbat, Stefan Milius", "title": "Varieties of Data Languages", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  We establish an Eilenberg-type correspondence for data languages, i.e.\nlanguages over an infinite alphabet. More precisely, we prove that there is a\nbijective correspondence between varieties of languages recognized by\norbit-finite nominal monoids and pseudovarieties of such monoids. This is the\nfirst result of this kind for data languages. Our approach makes use of nominal\nStone duality and a recent category theoretic generalization of Birkhoff-type\nHSP theorems that we instantiate here for the category of nominal sets. In\naddition, we prove an axiomatic characterization of weak pseudovarieties as\nthose classes of orbit-finite monoids that can be specified by sequences of\nnominal equations, which provides a nominal version of a classical theorem of\nEilenberg and Sch\\\"utzenberger.\n", "versions": [{"version": "v1", "created": "Tue, 19 Mar 2019 15:32:17 GMT"}, {"version": "v2", "created": "Wed, 1 May 2019 16:59:28 GMT"}], "update_date": "2019-05-02", "authors_parsed": [["Urbat", "Henning", ""], ["Milius", "Stefan", ""]]}, {"id": "1903.09773", "submitter": "Karin Quaas", "authors": "Martin Fr\\\"anzle, Karin Quaas, Mahsa Shirmohammadi, James Worrell", "title": "Effective Definability of the Reachability Relation in Timed Automata", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We give a new proof of the result of Comon and Jurski that the binary\nreachability relation of a timed automaton is definable in linear arithmetic.\n", "versions": [{"version": "v1", "created": "Sat, 23 Mar 2019 06:53:26 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Fränzle", "Martin", ""], ["Quaas", "Karin", ""], ["Shirmohammadi", "Mahsa", ""], ["Worrell", "James", ""]]}, {"id": "1903.09905", "submitter": "Tim Smith", "authors": "Tim Smith", "title": "A Characterization of Morphic Words with Polynomial Growth", "comments": null, "journal-ref": "Discrete Mathematics & Theoretical Computer Science, vol. 22 no.\n  1, Automata, Logic and Semantics (February 6, 2020) dmtcs:6073", "doi": "10.23638/DMTCS-22-1-3", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A morphic word is obtained by iterating a morphism to generate an infinite\nword, and then applying a coding. We characterize morphic words with polynomial\ngrowth in terms of a new type of infinite word called a $\\textit{zigzag word}$.\nA zigzag word is represented by an initial string, followed by a finite list of\nterms, each of which repeats for each $n \\geq 1$ in one of three ways: it grows\nforward [$t(1)\\ t(2)\\ \\dotsm\\ t(n)]$, backward [$t(n)\\ \\dotsm\\ t(2)\\ t(1)$], or\njust occurs once [$t$]. Each term can recursively contain subterms with their\nown forward and backward repetitions. We show that an infinite word is morphic\nwith growth $\\Theta(n^k)$ iff it is a zigzag word of depth $k$. As corollaries,\nwe obtain that the morphic words with growth $O(n)$ are exactly the ultimately\nperiodic words, and the morphic words with growth $O(n^2)$ are exactly the\nmultilinear words.\n", "versions": [{"version": "v1", "created": "Sun, 24 Mar 2019 00:24:05 GMT"}, {"version": "v2", "created": "Thu, 31 Oct 2019 15:36:58 GMT"}, {"version": "v3", "created": "Sat, 1 Feb 2020 19:31:13 GMT"}, {"version": "v4", "created": "Tue, 4 Feb 2020 18:00:42 GMT"}], "update_date": "2020-08-25", "authors_parsed": [["Smith", "Tim", ""]]}, {"id": "1903.10428", "submitter": "Kumar Sankar Ray", "authors": "Debayan Ganguly, Kingshuk Chatterjee, Kumar Sankar Ray", "title": "Parallel communicating one-way reversible finite automata system", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we discuss the computational power of parallel communicating\nfinite automata system with 1-way reversible finite automaton as components. We\nshow that unlike the multi-head one way reversible finite automata model (where\nwe are still not sure whether it accepts all the regular languages) parallel\ncommunicating one-way reversible finite automata systems can accept all the\nregular languages. Moreover for every multi-head one way reversible finite\nautomaton there exist a parallel communicating one-way reversible finite\nautomata system which accepts the same language. We also make an interesting\nobservation that although the components of the system are reversible the\nsystem as a whole is not reversible. On the basis of which we conjecture that\nparallel communicating one-way reversible finite automata systems may accept\nlanguages not accepted by multi-head one way reversible finite automata.\n", "versions": [{"version": "v1", "created": "Fri, 15 Mar 2019 09:01:08 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Ganguly", "Debayan", ""], ["Chatterjee", "Kingshuk", ""], ["Ray", "Kumar Sankar", ""]]}, {"id": "1903.10493", "submitter": "Tara Brough", "authors": "Tara Brough, Alan J. Cain and Markus Pfeiffer", "title": "Context-free word problem semigroups", "comments": "19 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.GR cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies the classes of semigoups and monoids with context-free and\ndeterministic context-free word problem. First, some examples are exhibited to\nclarify the relationship between these classes and their connection with the\nnotions of word-hyperbolicity and automaticity. Second, a study is made of\nwhether these classes are closed under applying certain semigroup\nconstructions, including direct products and free products, or under regressing\nfrom the results of such constructions to the original semigroup(s) or\nmonoid(s).\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2019 17:51:05 GMT"}], "update_date": "2019-03-26", "authors_parsed": [["Brough", "Tara", ""], ["Cain", "Alan J.", ""], ["Pfeiffer", "Markus", ""]]}, {"id": "1903.10549", "submitter": "Mikhail Volkov", "authors": "Hanan Shabana and Mikhail V. Volkov", "title": "Using Sat solvers for synchronization issues in partial deterministic\n  automata", "comments": "15 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We approach the task of computing a carefully synchronizing word of minimum\nlength for a given partial deterministic automaton, encoding the problem as an\ninstance of SAT and invoking a SAT solver. Our experimental results demonstrate\nthat this approach gives satisfactory results for automata with up to 100\nstates even if very modest computational resources are used.\n", "versions": [{"version": "v1", "created": "Mon, 25 Mar 2019 18:48:13 GMT"}], "update_date": "2019-03-27", "authors_parsed": [["Shabana", "Hanan", ""], ["Volkov", "Mikhail V.", ""]]}, {"id": "1903.10740", "submitter": "Juraj Sebej", "authors": "Stavros Konstantinidis, Mitja Mastnak, Juraj Sebej", "title": "Partitioning a Symmetric Rational Relation into Two Asymmetric Rational\n  Relations", "comments": "19 pages, 4 figures. Submitted to the 24th International Conference\n  on Implementation and Application of Automata, July 22-25, 2019, Kosice,\n  Slovakia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of partitioning effectively a given symmetric (and\nirreflexive) rational relation R into two asymmetric rational relations. This\nproblem is motivated by a recent method of embedding an R-independent language\ninto one that is maximal R-independent, where the method requires to use an\nasymmetric partition of R. We solve the problem when R is realized by a\nzero-avoiding transducer (with some bound k): if the absolute value of the\ninput-output length discrepancy of a computation exceeds k then the length\ndiscrepancy of the computation cannot become zero. This class of relations\nproperly contains all recognizable, all left synchronous, and all right\nsynchronous relations. We leave the asymmetric partition problem open when R is\nnot realized by a zero-avoiding transducer. We also show examples of total\nwordorderings for which there is a relation R that cannot be partitioned into\ntwo asymmetric rational relations such that one of them is decreasing with\nrespect to the given word-ordering.\n", "versions": [{"version": "v1", "created": "Tue, 26 Mar 2019 08:58:25 GMT"}], "update_date": "2019-03-27", "authors_parsed": [["Konstantinidis", "Stavros", ""], ["Mastnak", "Mitja", ""], ["Sebej", "Juraj", ""]]}, {"id": "1903.11315", "submitter": "Thibault Godin", "authors": "Thibault Godin (IECL, IMAG)", "title": "Generic properties in some classes of automaton groups", "comments": null, "journal-ref": "25th International Workshop on Cellular Automata and Discrete\n  Complex Systems AUTOMATA 2019, Jun 2019, Guadalajara, Mexico", "doi": null, "report-no": null, "categories": "cs.FL cs.DM math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove, for various important classes of Mealy automata, that almost all\ngenerated groups have an element of infinite order. In certain cases, it also\nimplies other results such as exponential growth.\n", "versions": [{"version": "v1", "created": "Wed, 27 Mar 2019 09:49:51 GMT"}], "update_date": "2019-03-28", "authors_parsed": [["Godin", "Thibault", "", "IECL, IMAG"]]}, {"id": "1903.12620", "submitter": "Marcin Jurdzi\\'nski", "authors": "Laure Daviaud, Marcin Jurdzi\\'nski, Karoliina Lehtinen", "title": "Alternating Weak Automata from Universal Trees", "comments": null, "journal-ref": null, "doi": "10.4230/LIPIcs.CONCUR.2019.18", "report-no": null, "categories": "cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An improved translation from alternating parity automata on infinite words to\nalternating weak automata is given. The blow-up of the number of states is\nrelated to the size of the smallest universal ordered trees and hence it is\nquasi-polynomial, and only polynomial if the asymptotic number of priorities is\nlogarithmic in the number of states. This is an exponential improvement on the\ntranslation of Kupferman and Vardi (2001) and a quasi-polynomial improvement on\nthe translation of Boker and Lehtinen (2018). Any slightly better such\ntranslation would (if---like all presently known such translations---it is\nefficiently constructive) lead to algorithms for solving parity games that are\nasymptotically faster in the worst case than the current state of the art\n(Calude, Jain, Khoussainov, Li, and Stephan, 2017; Jurdzi\\'nski and Lazi\\'c,\n2017; and Fearnley, Jain, Schewe, Stephan, and Wojtczak, 2017), and hence it\nwould yield a significant breakthrough.\n", "versions": [{"version": "v1", "created": "Fri, 29 Mar 2019 17:11:43 GMT"}, {"version": "v2", "created": "Thu, 4 Jul 2019 16:53:22 GMT"}], "update_date": "2020-01-15", "authors_parsed": [["Daviaud", "Laure", ""], ["Jurdziński", "Marcin", ""], ["Lehtinen", "Karoliina", ""]]}]