[{"id": "1203.0050", "submitter": "Laszlo Vegh", "authors": "Georgios Piliouras, Tomas Valla, Laszlo A. Vegh", "title": "LP-based Covering Games with Low Price of Anarchy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new class of vertex cover and set cover games. The price of\nanarchy bounds match the best known constant factor approximation guarantees\nfor the centralized optimization problems for linear and also for submodular\ncosts -- in contrast to all previously studied covering games, where the price\nof anarchy cannot be bounded by a constant (e.g. [6, 7, 11, 5, 2]). In\nparticular, we describe a vertex cover game with a price of anarchy of 2. The\nrules of the games capture the structure of the linear programming relaxations\nof the underlying optimization problems, and our bounds are established by\nanalyzing these relaxations. Furthermore, for linear costs we exhibit linear\ntime best response dynamics that converge to these almost optimal Nash\nequilibria. These dynamics mimic the classical greedy approximation algorithm\nof Bar-Yehuda and Even [3].\n", "versions": [{"version": "v1", "created": "Wed, 29 Feb 2012 23:44:38 GMT"}], "update_date": "2012-03-02", "authors_parsed": [["Piliouras", "Georgios", ""], ["Valla", "Tomas", ""], ["Vegh", "Laszlo A.", ""]]}, {"id": "1203.0100", "submitter": "Egor Ianovski", "authors": "Egor Ianovski", "title": "Cake Cutting Mechanisms", "comments": "Honours dissertation", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We examine the history of cake cutting mechanisms and discuss the efficiency\nof their allocations. In the case of piecewise uniform preferences, we define a\ngame that in the presence of strategic agents has equilibria that are not\ndominated by the allocations of any mechanism. We identify that the equilibria\nof this game coincide with the allocations of an existing cake cutting\nmechanism.\n", "versions": [{"version": "v1", "created": "Thu, 1 Mar 2012 06:48:21 GMT"}, {"version": "v2", "created": "Sat, 7 Apr 2012 23:37:58 GMT"}], "update_date": "2012-04-10", "authors_parsed": [["Ianovski", "Egor", ""]]}, {"id": "1203.0353", "submitter": "Aaron Roth", "authors": "Aaron Roth and Grant Schoenebeck", "title": "Conducting Truthful Surveys, Cheaply", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of conducting a survey with the goal of obtaining an\nunbiased estimator of some population statistic when individuals have unknown\ncosts (drawn from a known prior) for participating in the survey. Individuals\nmust be compensated for their participation and are strategic agents, and so\nthe payment scheme must incentivize truthful behavior. We derive optimal\ntruthful mechanisms for this problem for the two goals of minimizing the\nvariance of the estimator given a fixed budget, and minimizing the expected\ncost of the survey given a fixed variance goal.\n", "versions": [{"version": "v1", "created": "Fri, 2 Mar 2012 02:58:04 GMT"}], "update_date": "2012-03-05", "authors_parsed": [["Roth", "Aaron", ""], ["Schoenebeck", "Grant", ""]]}, {"id": "1203.0411", "submitter": "Joerg Rothe", "authors": "Edith Hemaspaandra, Lane A. Hemaspaandra, and Joerg Rothe", "title": "The Complexity of Online Voter Control in Sequential Elections", "comments": "22 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Previous work on voter control, which refers to situations where a chair\nseeks to change the outcome of an election by deleting, adding, or partitioning\nvoters, takes for granted that the chair knows all the voters' preferences and\nthat all votes are cast simultaneously. However, elections are often held\nsequentially and the chair thus knows only the previously cast votes and not\nthe future ones, yet needs to decide instantaneously which control action to\ntake. We introduce a framework that models online voter control in sequential\nelections. We show that the related problems can be much harder than in the\nstandard (non-online) case: For certain election systems, even with efficient\nwinner problems, online control by deleting, adding, or partitioning voters is\nPSPACE-complete, even if there are only two candidates. In addition, we obtain\n(by a new characterization of coNP in terms of weight-bounded alternating\nTuring machines) completeness for coNP in the deleting/adding cases with a\nbounded deletion/addition limit, and we obtain completeness for NP in the\npartition cases with an additional restriction. We also show that for\nplurality, online control by deleting or adding voters is in P, and for\npartitioning voters is coNP-hard.\n", "versions": [{"version": "v1", "created": "Fri, 2 Mar 2012 10:33:02 GMT"}, {"version": "v2", "created": "Thu, 16 Jun 2016 23:35:33 GMT"}], "update_date": "2016-06-20", "authors_parsed": [["Hemaspaandra", "Edith", ""], ["Hemaspaandra", "Lane A.", ""], ["Rothe", "Joerg", ""]]}, {"id": "1203.0699", "submitter": "Joseph Y. Halpern", "authors": "Joseph Y. Halpern and Willemien Kets", "title": "Ambiguous Language and Differences in Beliefs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Standard models of multi-agent modal logic do not capture the fact that\ninformation is often ambiguous, and may be interpreted in different ways by\ndifferent agents. We propose a framework that can model this, and consider\ndifferent semantics that capture different assumptions about the agents'\nbeliefs regarding whether or not there is ambiguity. We consider the impact of\nambiguity on a seminal result in economics: Aumann's result saying that agents\nwith a common prior cannot agree to disagree. This result is known not to hold\nif agents do not have a common prior; we show that it also does not hold in the\npresence of ambiguity. We then consider the tradeoff between assuming a common\ninterpretation (i.e., no ambiguity) and a common prior (i.e., shared initial\nbeliefs).\n", "versions": [{"version": "v1", "created": "Sun, 4 Mar 2012 01:55:09 GMT"}], "update_date": "2012-03-06", "authors_parsed": [["Halpern", "Joseph Y.", ""], ["Kets", "Willemien", ""]]}, {"id": "1203.1107", "submitter": "Ian Wilkinson", "authors": "Dan Ladley (University of Leicester), Ian Wilkinson (University of\n  Sydney and University of Southern Denmark), Louise Young (University of\n  Western Sydney and University of Southern Denmark)", "title": "The Evolution of Cooperation in Business", "comments": "35 pages, 2 tables, 2 figures under review", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The development of cooperative relations within and between firms plays an\nimportant role in the successful implementation of business strategy. How to\nproduce such relations is less well understood. We build on work in relational\ncontract theory and the evolution of cooperation to examine the conditions\nunder which group based incentives outperform individual based incentives and\nhow they produce more cooperative behavior. Group interactions are modeled as\niterated games in which individuals learn optimal strategies under individual\nand group based reward mechanisms. The space of possible games is examined and\nit is found that, when individual and group interests are not aligned, group\nevaluation and reward systems lead to higher group performance and,\ncounter-intuitively, higher individual performance. Such groups include\nindividuals who, quite differently to free-riders, sacrifice their own\nperformance for the good of the group. We discuss the implications of these\nresults for the design of incentive systems.\n", "versions": [{"version": "v1", "created": "Tue, 6 Mar 2012 06:41:07 GMT"}], "update_date": "2012-03-07", "authors_parsed": [["Ladley", "Dan", "", "University of Leicester"], ["Wilkinson", "Ian", "", "University of\n  Sydney and University of Southern Denmark"], ["Young", "Louise", "", "University of\n  Western Sydney and University of Southern Denmark"]]}, {"id": "1203.1809", "submitter": "Krzysztof R. Apt", "authors": "Mingyu Guo, Evangelos Markakis, Krzysztof R. Apt, Vincent Conitzer", "title": "Undominated Groves Mechanisms", "comments": "34 pages. To appear in Journal of AI Research (JAIR)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The family of Groves mechanisms, which includes the well-known VCG mechanism\n(also known as the Clarke mechanism), is a family of efficient and\nstrategy-proof mechanisms. Unfortunately, the Groves mechanisms are generally\nnot budget balanced. That is, under such mechanisms, payments may flow into or\nout of the system of the agents, resulting in deficits or reduced utilities for\nthe agents. We consider the following problem: within the family of Groves\nmechanisms, we want to identify mechanisms that give the agents the highest\nutilities, under the constraint that these mechanisms must never incur\ndeficits.\n  We adopt a prior-free approach. We introduce two general measures for\ncomparing mechanisms in prior-free settings. We say that a non-deficit Groves\nmechanism $M$ {\\em individually dominates} another non-deficit Groves mechanism\n$M'$ if for every type profile, every agent's utility under $M$ is no less than\nthat under $M'$, and this holds with strict inequality for at least one type\nprofile and one agent. We say that a non-deficit Groves mechanism $M$ {\\em\ncollectively dominates} another non-deficit Groves mechanism $M'$ if for every\ntype profile, the agents' total utility under $M$ is no less than that under\n$M'$, and this holds with strict inequality for at least one type profile. The\nabove definitions induce two partial orders on non-deficit Groves mechanisms.\nWe study the maximal elements corresponding to these two partial orders, which\nwe call the {\\em individually undominated} mechanisms and the {\\em collectively\nundominated} mechanisms, respectively.\n", "versions": [{"version": "v1", "created": "Thu, 8 Mar 2012 14:20:07 GMT"}, {"version": "v2", "created": "Fri, 4 Jan 2013 13:59:31 GMT"}], "update_date": "2013-01-07", "authors_parsed": [["Guo", "Mingyu", ""], ["Markakis", "Evangelos", ""], ["Apt", "Krzysztof R.", ""], ["Conitzer", "Vincent", ""]]}, {"id": "1203.1866", "submitter": "St\\'ephane Le Roux", "authors": "St\\'ephane Le Roux", "title": "From winning strategy to Nash equilibrium", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.LO cs.FL cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Game theory is usually considered applied mathematics, but a few\ngame-theoretic results, such as Borel determinacy, were developed by\nmathematicians for mathematics in a broad sense. These results usually state\ndeterminacy, i.e. the existence of a winning strategy in games that involve two\nplayers and two outcomes saying who wins. In a multi-outcome setting, the\nnotion of winning strategy is irrelevant yet usually replaced faithfully with\nthe notion of (pure) Nash equilibrium. This article shows that every\ndeterminacy result over an arbitrary game structure, e.g. a tree, is\ntransferable into existence of multi-outcome (pure) Nash equilibrium over the\nsame game structure. The equilibrium-transfer theorem requires cardinal or\norder-theoretic conditions on the strategy sets and the preferences,\nrespectively, whereas counter-examples show that every requirement is relevant,\nalbeit possibly improvable. When the outcomes are finitely many, the proof\nprovides an algorithm computing a Nash equilibrium without significant\ncomplexity loss compared to the two-outcome case. As examples of application,\nthis article generalises Borel determinacy, positional determinacy of parity\ngames, and finite-memory determinacy of Muller games.\n", "versions": [{"version": "v1", "created": "Thu, 8 Mar 2012 17:54:43 GMT"}, {"version": "v2", "created": "Sat, 26 May 2012 14:32:25 GMT"}, {"version": "v3", "created": "Tue, 21 May 2013 09:04:57 GMT"}, {"version": "v4", "created": "Thu, 8 May 2014 12:52:20 GMT"}], "update_date": "2014-05-09", "authors_parsed": [["Roux", "Stéphane Le", ""]]}, {"id": "1203.1895", "submitter": "Alan Guo", "authors": "Greg Aloupis, Erik D. Demaine, Alan Guo, Giovanni Viglietta", "title": "Classic Nintendo Games are (Computationally) Hard", "comments": "36 pages, 36 figures. Fixed some typos. Added NP-hardness results\n  (with proofs and figures) for American SMB2 and Zelda 2", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We prove NP-hardness results for five of Nintendo's largest video game\nfranchises: Mario, Donkey Kong, Legend of Zelda, Metroid, and Pokemon. Our\nresults apply to generalized versions of Super Mario Bros. 1-3, The Lost\nLevels, and Super Mario World; Donkey Kong Country 1-3; all Legend of Zelda\ngames; all Metroid games; and all Pokemon role-playing games. In addition, we\nprove PSPACE-completeness of the Donkey Kong Country games and several Legend\nof Zelda games.\n", "versions": [{"version": "v1", "created": "Thu, 8 Mar 2012 19:37:20 GMT"}, {"version": "v2", "created": "Thu, 6 Feb 2014 18:24:15 GMT"}, {"version": "v3", "created": "Sun, 8 Feb 2015 19:45:26 GMT"}], "update_date": "2015-02-10", "authors_parsed": [["Aloupis", "Greg", ""], ["Demaine", "Erik D.", ""], ["Guo", "Alan", ""], ["Viglietta", "Giovanni", ""]]}, {"id": "1203.1940", "submitter": "Danupon Nanongkai", "authors": "Parinya Chalermsook, Shiva Kintali, Richard Lipton and Danupon\n  Nanongkai", "title": "Graph Pricing Problem on Bounded Treewidth, Bounded Genus and k-partite\n  graphs", "comments": "Preprint of the paper to appear in Chicago Journal of Theoretical\n  Computer Science", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Consider the following problem. A seller has infinite copies of $n$ products\nrepresented by nodes in a graph. There are $m$ consumers, each has a budget and\nwants to buy two products. Consumers are represented by weighted edges. Given\nthe prices of products, each consumer will buy both products she wants, at the\ngiven price, if she can afford to. Our objective is to help the seller price\nthe products to maximize her profit.\n  This problem is called {\\em graph vertex pricing} ({\\sf GVP}) problem and has\nresisted several recent attempts despite its current simple solution. This\nmotivates the study of this problem on special classes of graphs. In this\npaper, we study this problem on a large class of graphs such as graphs with\nbounded treewidth, bounded genus and $k$-partite graphs.\n  We show that there exists an {\\sf FPTAS} for {\\sf GVP} on graphs with bounded\ntreewidth. This result is also extended to an {\\sf FPTAS} for the more general\n{\\em single-minded pricing} problem. On bounded genus graphs we present a {\\sf\nPTAS} and show that {\\sf GVP} is {\\sf NP}-hard even on planar graphs.\n  We study the Sherali-Adams hierarchy applied to a natural Integer Program\nformulation that $(1+\\epsilon)$-approximates the optimal solution of {\\sf GVP}.\nSherali-Adams hierarchy has gained much interest recently as a possible\napproach to develop new approximation algorithms. We show that, when the input\ngraph has bounded treewidth or bounded genus, applying a constant number of\nrounds of Sherali-Adams hierarchy makes the integrality gap of this natural\n{\\sf LP} arbitrarily small, thus giving a $(1+\\epsilon)$-approximate solution\nto the original {\\sf GVP} instance.\n  On $k$-partite graphs, we present a constant-factor approximation algorithm.\nWe further improve the approximation factors for paths, cycles and graphs with\ndegree at most three.\n", "versions": [{"version": "v1", "created": "Thu, 8 Mar 2012 21:42:51 GMT"}, {"version": "v2", "created": "Tue, 12 Nov 2013 07:17:50 GMT"}], "update_date": "2013-11-13", "authors_parsed": [["Chalermsook", "Parinya", ""], ["Kintali", "Shiva", ""], ["Lipton", "Richard", ""], ["Nanongkai", "Danupon", ""]]}, {"id": "1203.2301", "submitter": "Valerio Capraro", "authors": "Valerio Capraro and Marco Scarsini", "title": "Existence of equilibria in countable games: an algebraic approach", "comments": null, "journal-ref": "Games and Economic Behavior 79 (2013) 163-180", "doi": "10.1016/j.geb.2013.01.010", "report-no": null, "categories": "cs.GT math.GR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Although mixed extensions of finite games always admit equilibria, this is\nnot the case for countable games, the best-known example being Wald's\npick-the-larger-integer game. Several authors have provided conditions for the\nexistence of equilibria in infinite games. These conditions are typically of\ntopological nature and are rarely applicable to countable games. Here we\nestablish an existence result for the equilibrium of countable games when the\nstrategy sets are a countable group and the payoffs are functions of the group\noperation. In order to obtain the existence of equilibria, finitely additive\nmixed strategies have to be allowed. This creates a problem of selection of a\nproduct measure of mixed strategies. We propose a family of such selections and\nprove existence of an equilibrium that does not depend on the selection. As a\nbyproduct we show that if finitely additive mixed strategies are allowed, then\nWald's game admits an equilibrium. We also prove existence of equilibria for\nnontrivial extensions of matching-pennies and rock-scissors-paper. Finally we\nextend the main results to uncountable games.\n", "versions": [{"version": "v1", "created": "Sun, 11 Mar 2012 01:45:08 GMT"}, {"version": "v2", "created": "Tue, 11 Sep 2012 04:06:10 GMT"}, {"version": "v3", "created": "Tue, 17 Sep 2013 05:42:11 GMT"}], "update_date": "2017-04-04", "authors_parsed": [["Capraro", "Valerio", ""], ["Scarsini", "Marco", ""]]}, {"id": "1203.2832", "submitter": "Marco Scarsini", "authors": "Ehud Lehrer and Marco Scarsini", "title": "On the Core of Dynamic Cooperative Games", "comments": "25 pages", "journal-ref": null, "doi": "10.1007/s13235-013-0078-7", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider dynamic cooperative games, where the worth of coalitions varies\nover time according to the history of allocations. When defining the core of a\ndynamic game, we allow the possibility for coalitions to deviate at any time\nand thereby to give rise to a new environment. A coalition that considers a\ndeviation needs to take the consequences into account because from the\ndeviation point on, the game is no longer played with the original set of\nplayers. The deviating coalition becomes the new grand coalition which, in\nturn, induces a new dynamic game. The stage games of the new dynamical game\ndepend on all previous allocation including those that have materialized from\nthe deviating time on.\n  We define three types of core solutions: fair core, stable core and credible\ncore. We characterize the first two in case where the instantaneous game\ndepends on the last allocation (rather than on the whole history of\nallocations) and the third in the general case. The analysis and the results\nresembles to a great extent the theory of non-cooperative dynamic games.\n", "versions": [{"version": "v1", "created": "Tue, 13 Mar 2012 15:11:35 GMT"}], "update_date": "2017-04-04", "authors_parsed": [["Lehrer", "Ehud", ""], ["Scarsini", "Marco", ""]]}, {"id": "1203.2973", "submitter": "Sigal Oren", "authors": "David Bindel, Jon Kleinberg and Sigal Oren", "title": "How Bad is Forming Your Own Opinion?", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The question of how people form their opinion has fascinated economists and\nsociologists for quite some time. In many of the models, a group of people in a\nsocial network, each holding a numerical opinion, arrive at a shared opinion\nthrough repeated averaging with their neighbors in the network. Motivated by\nthe observation that consensus is rarely reached in real opinion dynamics, we\nstudy a related sociological model in which individuals' intrinsic beliefs\ncounterbalance the averaging process and yield a diversity of opinions.\n  By interpreting the repeated averaging as best-response dynamics in an\nunderlying game with natural payoffs, and the limit of the process as an\nequilibrium, we are able to study the cost of disagreement in these models\nrelative to a social optimum. We provide a tight bound on the cost at\nequilibrium relative to the optimum; our analysis draws a connection between\nthese agreement models and extremal problems that lead to generalized\neigenvalues. We also consider a natural network design problem in this setting:\nwhich links can we add to the underlying network to reduce the cost of\ndisagreement at equilibrium?\n", "versions": [{"version": "v1", "created": "Tue, 13 Mar 2012 23:14:40 GMT"}], "update_date": "2012-03-15", "authors_parsed": [["Bindel", "David", ""], ["Kleinberg", "Jon", ""], ["Oren", "Sigal", ""]]}, {"id": "1203.3368", "submitter": "Dvir Falik", "authors": "Dvir Falik and Ehud Friedgut", "title": "Between Arrow and Gibbard-Satterthwaite; A representation theoretic\n  approach", "comments": "First appeared in FOCS'11", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.CO cs.CC cs.DM cs.GT math.RT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A central theme in social choice theory is that of impossibility theorems,\nsuch as Arrow's theorem and the Gibbard-Satterthwaite theorem, which state that\nunder certain natural constraints, social choice mechanisms are impossible to\nconstruct. In recent years, beginning in Kalai`01, much work has been done in\nfinding \\textit{robust} versions of these theorems, showing \"approximate\"\nimpossibility remains even when most, but not all, of the constraints are\nsatisfied. We study a spectrum of settings between the case where society\nchooses a single outcome (\\'a-la-Gibbard-Satterthwaite) and the choice of a\ncomplete order (as in Arrow's theorem). We use algebraic techniques,\nspecifically representation theory of the symmetric group, and also prove\nrobust versions of the theorems that we state. Our relaxations of the\nconstraints involve relaxing of a version of \"independence of irrelevant\nalternatives\", rather than relaxing the demand of a transitive outcome, as is\ndone in most other robustness results.\n", "versions": [{"version": "v1", "created": "Wed, 14 Mar 2012 11:11:36 GMT"}], "update_date": "2012-03-16", "authors_parsed": [["Falik", "Dvir", ""], ["Friedgut", "Ehud", ""]]}, {"id": "1203.3478", "submitter": "Stefano Ermon", "authors": "Stefano Ermon, Jon Conrad, Carla P. Gomes, Bart Selman", "title": "Playing games against nature: optimal policies for renewable resource\n  allocation", "comments": "Appears in Proceedings of the Twenty-Sixth Conference on Uncertainty\n  in Artificial Intelligence (UAI2010)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2010-PG-168-176", "categories": "cs.AI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we introduce a class of Markov decision processes that arise as\na natural model for many renewable resource allocation problems. Upon extending\nresults from the inventory control literature, we prove that they admit a\nclosed form solution and we show how to exploit this structure to speed up its\ncomputation. We consider the application of the proposed framework to several\nproblems arising in very different domains, and as part of the ongoing effort\nin the emerging field of Computational Sustainability we discuss in detail its\napplication to the Northern Pacific Halibut marine fishery. Our approach is\napplied to a model based on real world data, obtaining a policy with a\nguaranteed lower bound on the utility function that is structurally very\ndifferent from the one currently employed.\n", "versions": [{"version": "v1", "created": "Thu, 15 Mar 2012 11:17:56 GMT"}], "update_date": "2012-03-19", "authors_parsed": [["Ermon", "Stefano", ""], ["Conrad", "Jon", ""], ["Gomes", "Carla P.", ""], ["Selman", "Bart", ""]]}, {"id": "1203.3480", "submitter": "Xi Alice Gao", "authors": "Xi Alice Gao, Avi Pfeffer", "title": "Learning Game Representations from Data Using Rationality Constraints", "comments": "Appears in Proceedings of the Twenty-Sixth Conference on Uncertainty\n  in Artificial Intelligence (UAI2010)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2010-PG-185-192", "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  While game theory is widely used to model strategic interactions, a natural\nquestion is where do the game representations come from? One answer is to learn\nthe representations from data. If one wants to learn both the payoffs and the\nplayers' strategies, a naive approach is to learn them both directly from the\ndata. This approach ignores the fact the players might be playing reasonably\ngood strategies, so there is a connection between the strategies and the data.\nThe main contribution of this paper is to make this connection while learning.\nWe formulate the learning problem as a weighted constraint satisfaction\nproblem, including constraints both for the fit of the payoffs and strategies\nto the data and the fit of the strategies to the payoffs. We use quantal\nresponse equilibrium as our notion of rationality for quantifying the latter\nfit. Our results show that incorporating rationality constraints can improve\nlearning when the amount of data is limited.\n", "versions": [{"version": "v1", "created": "Thu, 15 Mar 2012 11:17:56 GMT"}], "update_date": "2012-03-19", "authors_parsed": [["Gao", "Xi Alice", ""], ["Pfeffer", "Avi", ""]]}, {"id": "1203.3498", "submitter": "Enrique Munoz de Cote", "authors": "Enrique Munoz de Cote, Archie C. Chapman, Adam M. Sykulski, Nicholas\n  R. Jennings", "title": "Automated Planning in Repeated Adversarial Games", "comments": "Appears in Proceedings of the Twenty-Sixth Conference on Uncertainty\n  in Artificial Intelligence (UAI2010)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2010-PG-376-383", "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Game theory's prescriptive power typically relies on full rationality and/or\nself-play interactions. In contrast, this work sets aside these fundamental\npremises and focuses instead on heterogeneous autonomous interactions between\ntwo or more agents. Specifically, we introduce a new and concise representation\nfor repeated adversarial (constant-sum) games that highlight the necessary\nfeatures that enable an automated planing agent to reason about how to score\nabove the game's Nash equilibrium, when facing heterogeneous adversaries. To\nthis end, we present TeamUP, a model-based RL algorithm designed for learning\nand planning such an abstraction. In essence, it is somewhat similar to R-max\nwith a cleverly engineered reward shaping that treats exploration as an\nadversarial optimization problem. In practice, it attempts to find an ally with\nwhich to tacitly collude (in more than two-player games) and then collaborates\non a joint plan of actions that can consistently score a high utility in\nadversarial repeated games. We use the inaugural Lemonade Stand Game Tournament\nto demonstrate the effectiveness of our approach, and find that TeamUP is the\nbest performing agent, demoting the Tournament's actual winning strategy into\nsecond place. In our experimental analysis, we show hat our strategy\nsuccessfully and consistently builds collaborations with many different\nheterogeneous (and sometimes very sophisticated) adversaries.\n", "versions": [{"version": "v1", "created": "Thu, 15 Mar 2012 11:17:56 GMT"}], "update_date": "2012-03-19", "authors_parsed": [["de Cote", "Enrique Munoz", ""], ["Chapman", "Archie C.", ""], ["Sykulski", "Adam M.", ""], ["Jennings", "Nicholas R.", ""]]}, {"id": "1203.3527", "submitter": "Jens Witkowski", "authors": "Jens Witkowski", "title": "Truthful Feedback for Sanctioning Reputation Mechanisms", "comments": "Appears in Proceedings of the Twenty-Sixth Conference on Uncertainty\n  in Artificial Intelligence (UAI2010)", "journal-ref": null, "doi": null, "report-no": "UAI-P-2010-PG-658-665", "categories": "cs.GT cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For product rating environments, similar to that of Amazon Reviews, it has\nbeen shown that the truthful elicitation of feedback is possible through\nmechanisms which pay buyer reports contingent on the reports of other buyers.\nWe study whether similar mechanisms can be designed for reputation mechanisms\nat online auction sites where the buyers' experiences are partially determined\nby a strategic seller. We show that this is impossible for the basic setting.\nHowever, introducing a small prior belief that the seller is a cooperative\ncommitment player leads to a payment scheme with a truthful perfect Bayesian\nequilibrium.\n", "versions": [{"version": "v1", "created": "Thu, 15 Mar 2012 11:17:56 GMT"}], "update_date": "2012-03-19", "authors_parsed": [["Witkowski", "Jens", ""]]}, {"id": "1203.3595", "submitter": "Niraj  Shakhakarmi", "authors": "Niraj Shakhakarmi", "title": "Secured Distributed Cognitive MAC and Complexity Reduction in Channel\n  Estimation for the Cross Layer based Cognitive Radio Networks", "comments": "10 pages, 14 figures", "journal-ref": "IJCSI International Journal of Computer Science Issues, Vol. 9,\n  Issue 1, No 1, January 2012, ISSN (Online): 1694-0814, www.IJCSI.org", "doi": null, "report-no": null, "categories": "cs.NI cs.ET cs.GT", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Secured opportunistic Medium Access Control (MAC) and complexity reduction in\nchannel estimation are proposed in the Cross layer design Cognitive Radio\nNetworks deploying the secured dynamic channel allocation from the endorsed\nchannel reservation. Channel Endorsement and Transmission policy is deployed to\noptimize the free channel selection as well as channel utilization to cognitive\nradio users. This strategy provide the secured and reliable link to secondary\nusers as well as the collision free link to primary users between the physical\nand MAC layers which yields the better network performance. On the other hand,\nComplexity Reduction in Minimum Mean Square Errror (CR-MMSE) and Maximum\nLikelihood (CR-ML) algorithm on Decision Directed Channel Estimation (DDCE) is\ndeployed significantly to achieve computational complexity as Least Square (LS)\nmethod. Rigorously, CR-MMSE in sample spaced channel impulse response (SS-CIR)\nis implemented by allowing the computationally inspired matrix inversion.\nRegarding CR-ML, Pilot Symbol Assisted Modulation (PSAM) with DDCE is\nimplemented such the pilot symbol sequence provides the significant performance\ngain in frequency correlation using the finite delay spread. It is found that\nCRMMSE demonstrates outstanding Symbol Error Rate (SER) performance over MMSE\nand LS, and CR-ML over MMSE and ML.\n", "versions": [{"version": "v1", "created": "Fri, 16 Mar 2012 01:05:19 GMT"}], "update_date": "2012-03-19", "authors_parsed": [["Shakhakarmi", "Niraj", ""]]}, {"id": "1203.3935", "submitter": "Hussein Saad", "authors": "Hussein Saad, Amr Mohamed and Tamer ElBatt", "title": "Distributed Cooperative Q-learning for Power Allocation in Cognitive\n  Femtocell Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a distributed reinforcement learning (RL) technique\ncalled distributed power control using Q-learning (DPC-Q) to manage the\ninterference caused by the femtocells on macro-users in the downlink. The DPC-Q\nleverages Q-Learning to identify the sub-optimal pattern of power allocation,\nwhich strives to maximize femtocell capacity, while guaranteeing macrocell\ncapacity level in an underlay cognitive setting. We propose two different\napproaches for the DPC-Q algorithm: namely, independent, and cooperative. In\nthe former, femtocells learn independently from each other while in the latter,\nfemtocells share some information during learning in order to enhance their\nperformance. Simulation results show that the independent approach is capable\nof mitigating the interference generated by the femtocells on macro-users.\nMoreover, the results show that cooperation enhances the performance of the\nfemtocells in terms of speed of convergence, fairness and aggregate femtocell\ncapacity.\n", "versions": [{"version": "v1", "created": "Sun, 18 Mar 2012 10:30:54 GMT"}], "update_date": "2012-03-20", "authors_parsed": [["Saad", "Hussein", ""], ["Mohamed", "Amr", ""], ["ElBatt", "Tamer", ""]]}, {"id": "1203.3967", "submitter": "Lena Schend", "authors": "Joerg Rothe and Lena Schend", "title": "Control Complexity in Bucklin, Fallback, and Plurality Voting: An\n  Experimental Approach", "comments": "Complete version with all results for plurality voting, 370 pages,\n  numerous figures, a short version appeared in the proceedings of the 11th\n  International Symposium on Experimental Algorithms (SEA-2012)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Walsh [Wal10, Wal09], Davies et al. [DKNW10, DKNW11], and Narodytska et al.\n[NWX11] studied various voting systems empirically and showed that they can\noften be manipulated effectively, despite their manipulation problems being\nNP-hard. Such an experimental approach is sorely missing for NP-hard control\nproblems, where control refers to attempts to tamper with the outcome of\nelections by adding/deleting/partitioning either voters or candidates. We\nexperimentally tackle NP-hard control problems for Bucklin and fallback voting.\nAmong natural voting systems with efficient winner determination, fallback\nvoting is currently known to display the broadest resistance to control in\nterms of NP-hardness, and Bucklin voting has been shown to behave almost as\nwell in terms of control resistance [ER10, EPR11, EFPR11]. We also investigate\ncontrol resistance experimentally for plurality voting, one of the first voting\nsystems analyzed with respect to electoral control [BTT92, HHR07]. Our findings\nindicate that NP-hard control problems can often be solved effectively in\npractice. Moreover, our experiments allow a more fine-grained analysis and\ncomparison-across various control scenarios, vote distribution models, and\nvoting systems-than merely stating NP-hardness for all these control problems.\n", "versions": [{"version": "v1", "created": "Sun, 18 Mar 2012 16:10:02 GMT"}, {"version": "v2", "created": "Mon, 20 Aug 2012 13:00:30 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Rothe", "Joerg", ""], ["Schend", "Lena", ""]]}, {"id": "1203.4324", "submitter": "Xiaohui Bei", "authors": "Xiaohui Bei, Wei Chen, Jialin Zhang", "title": "Distributed Consensus Resilient to Both Crash Failures and Strategic\n  Manipulations", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study distributed consensus in synchronous systems subject\nto both unexpected crash failures and strategic manipulations by rational\nagents in the system. We adapt the concept of collusion-resistant Nash\nequilibrium to model protocols that are resilient to both crash failures and\nstrategic manipulations of a group of colluding agents. For a system with $n$\ndistributed agents, we design a deterministic protocol that tolerates 2\ncolluding agents and a randomized protocol that tolerates $n - 1$ colluding\nagents, and both tolerate any number of failures. We also show that if\ncolluders are allowed an extra communication round after each synchronous\nround, there is no protocol that can tolerate even 2 colluding agents and 1\ncrash failure.\n", "versions": [{"version": "v1", "created": "Tue, 20 Mar 2012 06:38:03 GMT"}, {"version": "v2", "created": "Mon, 26 Mar 2012 06:59:56 GMT"}, {"version": "v3", "created": "Wed, 6 Jun 2012 11:26:54 GMT"}], "update_date": "2012-06-07", "authors_parsed": [["Bei", "Xiaohui", ""], ["Chen", "Wei", ""], ["Zhang", "Jialin", ""]]}, {"id": "1203.4455", "submitter": "Nick Gravin", "authors": "Xiaohui Bei, Ning Chen, Nick Gravin, Pinyan Lu", "title": "Budget Feasible Mechanism Design: From Prior-Free to Bayesian", "comments": "to appear in STOC 2012", "journal-ref": "Proceedings of STOC 2012", "doi": "10.1145/2213977.2214020", "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Budget feasible mechanism design studies procurement combinatorial auctions\nwhere the sellers have private costs to produce items, and the\nbuyer(auctioneer) aims to maximize a social valuation function on subsets of\nitems, under the budget constraint on the total payment. One of the most\nimportant questions in the field is \"which valuation domains admit truthful\nbudget feasible mechanisms with `small' approximations (compared to the social\noptimum)?\" Singer showed that additive and submodular functions have such\nconstant approximations. Recently, Dobzinski, Papadimitriou, and Singer gave an\nO(log^2 n)-approximation mechanism for subadditive functions; they also\nremarked that: \"A fundamental question is whether, regardless of computational\nconstraints, a constant-factor budget feasible mechanism exists for subadditive\nfunctions.\"\n  We address this question from two viewpoints: prior-free worst case analysis\nand Bayesian analysis. For the prior-free framework, we use an LP that\ndescribes the fractional cover of the valuation function; it is also connected\nto the concept of approximate core in cooperative game theory. We provide an\nO(I)-approximation mechanism for subadditive functions, via the worst case\nintegrality gap I of LP. This implies an O(log n)-approximation for subadditive\nvaluations, O(1)-approximation for XOS valuations, and for valuations with a\nconstant I. XOS valuations are an important class of functions that lie between\nsubmodular and subadditive classes. We give another polynomial time O(log\nn/loglog n) sub-logarithmic approximation mechanism for subadditive valuations.\n  For the Bayesian framework, we provide a constant approximation mechanism for\nall subadditive functions, using the above prior-free mechanism for XOS\nvaluations as a subroutine. Our mechanism allows correlations in the\ndistribution of private information and is universally truthful.\n", "versions": [{"version": "v1", "created": "Tue, 20 Mar 2012 14:52:32 GMT"}], "update_date": "2012-11-09", "authors_parsed": [["Bei", "Xiaohui", ""], ["Chen", "Ning", ""], ["Gravin", "Nick", ""], ["Lu", "Pinyan", ""]]}, {"id": "1203.4627", "submitter": "Vasilis Gkatzelis", "authors": "Richard Cole, Vasilis Gkatzelis, Gagan Goel", "title": "Truthfulness, Proportional Fairness, and Efficiency", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.DS cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How does one allocate a collection of resources to a set of strategic agents\nin a fair and efficient manner without using money? For in many scenarios it is\nnot feasible to use money to compensate agents for otherwise unsatisfactory\noutcomes. This paper studies this question, looking at both fairness and\nefficiency measures.\n  We employ the proportionally fair solution, which is a well-known fairness\nconcept for money-free settings. But although finding a proportionally fair\nsolution is computationally tractable, it cannot be implemented in a truthful\nfashion. Consequently, we seek approximate solutions. We give several truthful\nmechanisms which achieve proportional fairness in an approximate sense. We use\na strong notion of approximation, requiring the mechanism to give each agent a\ngood approximation of its proportionally fair utility. In particular, one of\nour mechanisms provides a better and better approximation factor as the minimum\ndemand for every good increases. A motivating example is provided by the\nmassive privatization auction in the Czech republic in the early 90s.\n  With regard to efficiency, prior work has shown a lower bound of 0.5 on the\napproximation factor of any swap-dictatorial mechanism approximating a social\nwelfare measure even for the two agents and multiple goods case. We surpass\nthis lower bound by designing a non-swap-dictatorial mechanism for this case.\nInterestingly, the new mechanism builds on the notion of proportional fairness.\n", "versions": [{"version": "v1", "created": "Tue, 20 Mar 2012 23:55:49 GMT"}, {"version": "v2", "created": "Fri, 6 Jul 2012 22:16:17 GMT"}], "update_date": "2012-07-10", "authors_parsed": [["Cole", "Richard", ""], ["Gkatzelis", "Vasilis", ""], ["Goel", "Gagan", ""]]}, {"id": "1203.5099", "submitter": "Saeed Alaei", "authors": "Saeed Alaei, Hu Fu, Nima Haghpanah, Jason Hartline, Azarakhsh Malekian", "title": "Bayesian Optimal Auctions via Multi- to Single-agent Reduction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study an abstract optimal auction problem for a single good or service.\nThis problem includes environments where agents have budgets, risk preferences,\nor multi-dimensional preferences over several possible configurations of the\ngood (furthermore, it allows an agent's budget and risk preference to be known\nonly privately to the agent). These are the main challenge areas for auction\ntheory. A single-agent problem is to optimize a given objective subject to a\nconstraint on the maximum probability with which each type is allocated,\na.k.a., an allocation rule. Our approach is a reduction from multi-agent\nmechanism design problem to collection of single-agent problems. We focus on\nmaximizing revenue, but our results can be applied to other objectives (e.g.,\nwelfare).\n  An optimal multi-agent mechanism can be computed by a linear/convex program\non interim allocation rules by simultaneously optimizing several single-agent\nmechanisms subject to joint feasibility of the allocation rules. For\nsingle-unit auctions, Border \\citeyearpar{B91} showed that the space of all\njointly feasible interim allocation rules for $n$ agents is a\n$\\NumTypes$-dimensional convex polytope which can be specified by $2^\\NumTypes$\nlinear constraints, where $\\NumTypes$ is the total number of all agents' types.\nConsequently, efficiently solving the mechanism design problem requires a\nseparation oracle for the feasibility conditions and also an algorithm for\nex-post implementation of the interim allocation rules. We show that the\npolytope of jointly feasible interim allocation rules is the projection of a\nhigher dimensional polytope which can be specified by only $O(\\NumTypes^2)$\nlinear constraints. Furthermore, our proof shows that finding a preimage of the\ninterim allocation rules in the higher dimensional polytope immediately gives\nan ex-post implementation.\n", "versions": [{"version": "v1", "created": "Thu, 22 Mar 2012 19:59:22 GMT"}], "update_date": "2012-03-23", "authors_parsed": [["Alaei", "Saeed", ""], ["Fu", "Hu", ""], ["Haghpanah", "Nima", ""], ["Hartline", "Jason", ""], ["Malekian", "Azarakhsh", ""]]}, {"id": "1203.5155", "submitter": "Vasilis Syrgkanis", "authors": "Vasilis Syrgkanis", "title": "Bayesian Games and the Smoothness Framework", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a general class of Bayesian Games where each players utility\ndepends on his type (possibly multidimensional) and on the strategy profile and\nwhere players' types are distributed independently. We show that if their full\ninformation version for any fixed instance of the type profile is a smooth game\nthen the Price of Anarchy bound implied by the smoothness property, carries\nover to the Bayes-Nash Price of Anarchy. We show how some proofs from the\nliterature (item bidding auctions, greedy auctions) can be cast as smoothness\nproofs or be simplified using smoothness. For first price item bidding with\nfractionally subadditive bidders we actually manage to improve by much the\nexisting result \\cite{Hassidim2011a} from 4 to $\\frac{e}{e-1}\\approx 1.58$.\nThis also shows a very interesting separation between first and second price\nitem bidding since second price item bidding has PoA at least 2 even under\ncomplete information. For a larger class of Bayesian Games where the strategy\nspace of a player also changes with his type we are able to show that a\nslightly stronger definition of smoothness also implies a Bayes-Nash PoA bound.\nWe show how weighted congestion games actually satisfy this stronger definition\nof smoothness. This allows us to show that the inefficiency bounds of weighted\ncongestion games known in the literature carry over to incomplete versions\nwhere the weights of the players are private information. We also show how an\nincomplete version of a natural class of monotone valid utility games, called\neffort market games are universally $(1,1)$-smooth. Hence, we show that\nincomplete versions of effort market games where the abilities of the players\nand their budgets are private information has Bayes-Nash PoA at most 2.\n", "versions": [{"version": "v1", "created": "Fri, 23 Mar 2012 02:24:35 GMT"}], "update_date": "2012-03-26", "authors_parsed": [["Syrgkanis", "Vasilis", ""]]}, {"id": "1203.5715", "submitter": "Carme \\`Alvarez", "authors": "Carme \\`Alvarez and Aleix Fern\\`andez", "title": "Network Formation: Heterogeneous Traffic, Bilateral Contracting and\n  Myopic Dynamics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study a network formation game where nodes wish to send traffic to other\nnodes. Nodes can contract bilaterally other nodes to form bidirectional links\nas well as nodes can break unilaterally contracts to eliminate the\ncorresponding links. Our model is an extension of the model considered in\nArcaute et al. The novelty is that we do no require the traffic to be uniform\nall-to-all. Each node specifies the amount of traffic that it wants to send to\nany other node. We characterize stable topologies under a static point of view\nand we also study the game under a myopic dynamics. We show its convergence to\nstable networks under some natural assumptions on the contracting functions.\nFinally we consider the efficiency of pairwise Nash topologies from a social\npoint of view and we show that the problem of deciding the existence stable\ntopologies of a given price is $\\NP$-complete.\n", "versions": [{"version": "v1", "created": "Mon, 26 Mar 2012 16:23:00 GMT"}], "update_date": "2012-03-27", "authors_parsed": [["Àlvarez", "Carme", ""], ["Fernàndez", "Aleix", ""]]}, {"id": "1203.5822", "submitter": "Cheng Wan", "authors": "Cheng Wan", "title": "Coalitions in nonatomic network congestion games", "comments": "22 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.SI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This work shows that the formation of a finite number of coalitions in a\nnonatomic network congestion game benefits everyone. At the equilibrium of the\ncomposite game played by coalitions and individuals, the average cost to each\ncoalition and the individuals' common cost are all lower than in the\ncorresponding nonatomic game (without coalitions). The individuals' cost is\nlower than the average cost to any coalition. Similarly, the average cost to a\ncoalition is lower than that to any larger coalition. Whenever some members of\na coalition become individuals, the individuals' payoff is increased. In the\ncase of a unique coalition, both the average cost to the coalition and the\nindividuals' cost are decreasing with respect to the size of the coalition. In\na sequence of composite games, if a finite number of coalitions are fixed,\nwhile the size of the remaining coalitions goes to zero, the equilibria of\nthese games converge to the equilibrium of a composite game played by the same\nfixed coalitions and the remaining individuals.\n", "versions": [{"version": "v1", "created": "Mon, 26 Mar 2012 21:22:23 GMT"}, {"version": "v2", "created": "Sat, 12 May 2012 10:28:56 GMT"}], "update_date": "2015-03-20", "authors_parsed": [["Wan", "Cheng", ""]]}, {"id": "1203.5945", "submitter": "Po-An Chen", "authors": "Po-An Chen, David Kempe", "title": "Bayesian Auctions with Friends and Foes", "comments": "This version was posted without enough prior discussion with my\n  collaborator. My collaborator would prefer it not to be posted at this time", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study auctions whose bidders are embedded in a social or economic network.\nAs a result, even bidders who do not win the auction themselves might derive\nutility from the auction, namely, when a friend wins. On the other hand, when\nan enemy or competitor wins, a bidder might derive negative utility. Such spite\nand altruism will alter the bidding strategies. A simple and natural model for\nbidders' utilities in these settings posits that the utility of a losing bidder\ni as a result of bidder j winning is a constant (positive or negative) fraction\nof bidder j's utility.\n", "versions": [{"version": "v1", "created": "Tue, 27 Mar 2012 12:03:18 GMT"}, {"version": "v2", "created": "Tue, 10 Apr 2012 06:40:18 GMT"}, {"version": "v3", "created": "Wed, 11 Apr 2012 07:13:48 GMT"}], "update_date": "2012-04-12", "authors_parsed": [["Chen", "Po-An", ""], ["Kempe", "David", ""]]}, {"id": "1203.6346", "submitter": "Robert Kleinberg", "authors": "Christina Brandt, Nicole Immorlica, Gautam Kamath, and Robert\n  Kleinberg", "title": "An Analysis of One-Dimensional Schelling Segregation", "comments": "24 pages, to appear in STOC 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the Schelling model of segregation in which a society of n\nindividuals live in a ring. Each individual is one of two races and is only\nsatisfied with his location so long as at least half his 2w nearest neighbors\nare of the same race as him. In the dynamics, randomly-chosen unhappy\nindividuals successively swap locations. We consider the average size of\nmonochromatic neighborhoods in the final stable state. Our analysis is the\nfirst rigorous analysis of the Schelling dynamics. We note that, in contrast to\nprior approximate analyses, the final state is nearly integrated: the average\nsize of monochromatic neighborhoods is independent of n and polynomial in w.\n", "versions": [{"version": "v1", "created": "Wed, 28 Mar 2012 19:30:51 GMT"}, {"version": "v2", "created": "Thu, 29 Mar 2012 15:04:47 GMT"}], "update_date": "2012-03-30", "authors_parsed": [["Brandt", "Christina", ""], ["Immorlica", "Nicole", ""], ["Kamath", "Gautam", ""], ["Kleinberg", "Robert", ""]]}, {"id": "1203.6610", "submitter": "Gleb Polevoy", "authors": "Gleb Polevoy (1), Rann Smorodinsky (1), Moshe Tennenholtz (1 and 2)\n  ((1) Industrial Engineering and Management, Technion, (2) Microsoft Research)", "title": "Signalling Competition and Social Welfare (Working Paper)", "comments": "15 pages, no figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider an environment where sellers compete over buyers. All sellers are\na-priori identical and strategically signal buyers about the product they sell.\nIn a setting motivated by on-line advertising in display ad exchanges, where\nfirms use second price auctions, a firm's strategy is a decision about its\nsignaling scheme for a stream of goods (e.g. user impressions), and a buyer's\nstrategy is a selection among the firms. In this setting, a single seller will\ntypically provide partial information and consequently a product may be\nallocated inefficiently. Intuitively, competition among sellers may induce\nsellers to provide more information in order to attract buyers and thus\nincrease efficiency. Surprisingly, we show that such a competition among firms\nmay yield significant loss in consumers' social welfare with respect to the\nmonopolistic setting. Although we also show that in some cases the competitive\nsetting yields gain in social welfare, we provide a tight bound on that gain,\nwhich is shown to be small in respect to the above possible loss.\n  Our model is tightly connected with the literature on bundling in auctions.\n", "versions": [{"version": "v1", "created": "Thu, 29 Mar 2012 17:58:33 GMT"}], "update_date": "2012-03-30", "authors_parsed": [["Polevoy", "Gleb", "", "Industrial Engineering and Management, Technion"], ["Smorodinsky", "Rann", "", "Industrial Engineering and Management, Technion"], ["Tennenholtz", "Moshe", "", "1 and 2"]]}, {"id": "1203.6749", "submitter": "Tadeusz Platkowski", "authors": "Tadeusz Platkowski and Jan Zakrzewski", "title": "Game Dynamics for Players with Social and Material Preferences", "comments": "24 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "nlin.AO cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the dynamics, existence and stability of the equilibrium states\nfor large populations of individuals who can play various types of\nnon--cooperative games. The players imitate the most attractive strategies, and\nthe choice is motivated not only by the material payoffs of the strategies, but\nalso by their popularity in the population. The parameter which determines the\nweights of both factors in the equilibrium states has the same analytical form\nfor all types of considered games, and is identified with the sensitivity to\nreinforcements parameter in the Hernstein's Matching Law. We prove theorems of\nexistence and uniqueness, and discuss examples of multiple locally stable\npolymorphic equilibria for the considered types of games.\n", "versions": [{"version": "v1", "created": "Fri, 30 Mar 2012 09:02:59 GMT"}], "update_date": "2012-04-02", "authors_parsed": [["Platkowski", "Tadeusz", ""], ["Zakrzewski", "Jan", ""]]}]