[{"id": "0901.1315", "submitter": "Enrique ter Horst A", "authors": "Abel Rodriguez and Henryk Gzyl and German Molina and Enrique ter Horst", "title": "Stochastic Volatility Models Including Open, Close, High and Low Prices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-fin.ST cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mounting empirical evidence suggests that the observed extreme prices within\na trading period can provide valuable information about the volatility of the\nprocess within that period. In this paper we define a class of stochastic\nvolatility models that uses opening and closing prices along with the minimum\nand maximum prices within a trading period to infer the dynamics underlying the\nvolatility process of asset prices and compares it with similar models that\nhave been previously presented in the literature. The paper also discusses\nsequential Monte Carlo algorithms to fit this class of models and illustrates\nits features using both a simulation study and data form the SP500 index.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jan 2009 21:08:29 GMT"}], "update_date": "2009-01-12", "authors_parsed": [["Rodriguez", "Abel", ""], ["Gzyl", "Henryk", ""], ["Molina", "German", ""], ["ter Horst", "Enrique", ""]]}, {"id": "0901.1945", "submitter": "Michel Fliess", "authors": "Michel Fliess (LIX, INRIA Saclay - Ile de France), C\\'edric Join\n  (INRIA Saclay - Ile de France, CRAN)", "title": "A mathematical proof of the existence of trends in financial time series", "comments": null, "journal-ref": "Systems Theory: Modelling, Analysis and Control (2009) 43-62", "doi": null, "report-no": null, "categories": "q-fin.ST cs.CE math.CA math.PR q-fin.CP stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We are settling a longstanding quarrel in quantitative finance by proving the\nexistence of trends in financial time series thanks to a theorem due to P.\nCartier and Y. Perrin, which is expressed in the language of nonstandard\nanalysis (Integration over finite sets, F. & M. Diener (Eds): Nonstandard\nAnalysis in Practice, Springer, 1995, pp. 195--204). Those trends, which might\ncoexist with some altered random walk paradigm and efficient market hypothesis,\nseem nevertheless difficult to reconcile with the celebrated Black-Scholes\nmodel. They are estimated via recent techniques stemming from control and\nsignal theory. Several quite convincing computer simulations on the forecast of\nvarious financial quantities are depicted. We conclude by discussing the r\\^ole\nof probability theory.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jan 2009 07:47:18 GMT"}], "update_date": "2009-06-01", "authors_parsed": [["Fliess", "Michel", "", "LIX, INRIA Saclay - Ile de France"], ["Join", "Cédric", "", "INRIA Saclay - Ile de France, CRAN"]]}, {"id": "0901.2665", "submitter": "Eric Polizzi", "authors": "Eric Polizzi", "title": "A Density Matrix-based Algorithm for Solving Eigenvalue Problems", "comments": "7 pages, 3 figures", "journal-ref": null, "doi": "10.1103/PhysRevB.79.115112", "report-no": null, "categories": "cs.CE cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A new numerical algorithm for solving the symmetric eigenvalue problem is\npresented. The technique deviates fundamentally from the traditional Krylov\nsubspace iteration based techniques (Arnoldi and Lanczos algorithms) or other\nDavidson-Jacobi techniques, and takes its inspiration from the contour\nintegration and density matrix representation in quantum mechanics. It will be\nshown that this new algorithm - named FEAST - exhibits high efficiency,\nrobustness, accuracy and scalability on parallel architectures. Examples from\nelectronic structure calculations of Carbon nanotubes (CNT) are presented, and\nnumerical performances and capabilities are discussed.\n", "versions": [{"version": "v1", "created": "Sat, 17 Jan 2009 23:36:23 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Polizzi", "Eric", ""]]}, {"id": "0901.2954", "submitter": "Kenichi Horie", "authors": "Kenichi Horie", "title": "An Upper Limit of AC Huffman Code Length in JPEG Compression", "comments": "US patent application 11/947936", "journal-ref": null, "doi": null, "report-no": "OIMC07P03556", "categories": "cs.IT cs.CC cs.CE cs.CV math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A strategy for computing upper code-length limits of AC Huffman codes for an\n8x8 block in JPEG Baseline coding is developed. The method is based on a\ngeometric interpretation of the DCT, and the calculated limits are as close as\n14% to the maximum code-lengths. The proposed strategy can be adapted to other\ntransform coding methods, e.g., MPEG 2 and 4 video compressions, to calculate\nclose upper code length limits for the respective processing blocks.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jan 2009 23:19:00 GMT"}], "update_date": "2009-01-21", "authors_parsed": [["Horie", "Kenichi", ""]]}]