[{"id": "0707.0397", "submitter": "Shijun Xiang jack-xiang", "authors": "Shijun Xiang and Jiwu Huang", "title": "Robust Audio Watermarking Against the D/A and A/D conversions", "comments": "Pages 29", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.MM", "license": null, "abstract": "  Audio watermarking has played an important role in multimedia security. In\nmany applications using audio watermarking, D/A and A/D conversions (denoted by\nDA/AD in this paper) are often involved. In previous works, however, the\nrobustness issue of audio watermarking against the DA/AD conversions has not\ndrawn sufficient attention yet. In our extensive investigation, it has been\nfound that the degradation of a watermarked audio signal caused by the DA/AD\nconversions manifests itself mainly in terms of wave magnitude distortion and\nlinear temporal scaling, making the watermark extraction failed. Accordingly, a\nDWT-based audio watermarking algorithm robust against the DA/AD conversions is\nproposed in this paper. To resist the magnitude distortion, the relative energy\nrelationships among different groups of the DWT coefficients in the\nlow-frequency sub-band are utilized in watermark embedding by adaptively\ncontrolling the embedding strength. Furthermore, the resynchronization is\ndesigned to cope with the linear temporal scaling. The time-frequency\nlocalization characteristics of DWT are exploited to save the computational\nload in the resynchronization. Consequently, the proposed audio watermarking\nalgorithm is robust against the DA/AD conversions, other common audio\nprocessing manipulations, and the attacks in StirMark Benchmark for Audio,\nwhich has been verified by experiments.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jul 2007 11:49:03 GMT"}], "update_date": "2007-07-04", "authors_parsed": [["Xiang", "Shijun", ""], ["Huang", "Jiwu", ""]]}, {"id": "0707.0802", "submitter": "Patricia Reynier", "authors": "Dinu Coltuc, Jean-Marc Chassery (GIPSA-lab)", "title": "Very fast watermarking by reversible contrast mapping", "comments": null, "journal-ref": "IEEE Signal Processing Letters 14, 4 (04/2007) pp 255-258", "doi": "10.1109/LSP.2006.884895", "report-no": null, "categories": "cs.MM cs.CR cs.CV cs.IT math.IT", "license": null, "abstract": "  Reversible contrast mapping (RCM) is a simple integer transform that applies\nto pairs of pixels. For some pairs of pixels, RCM is invertible, even if the\nleast significant bits (LSBs) of the transformed pixels are lost. The data\nspace occupied by the LSBs is suitable for data hiding. The embedded\ninformation bit-rates of the proposed spatial domain reversible watermarking\nscheme are close to the highest bit-rates reported so far. The scheme does not\nneed additional data compression, and, in terms of mathematical complexity, it\nappears to be the lowest complexity one proposed up to now. A very fast lookup\ntable implementation is proposed. Robustness against cropping can be ensured as\nwell.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jul 2007 15:11:24 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Coltuc", "Dinu", "", "GIPSA-lab"], ["Chassery", "Jean-Marc", "", "GIPSA-lab"]]}, {"id": "0707.2836", "submitter": "Inanc Inan", "authors": "Inanc Inan, Feyza Keceli, Ender Ayanoglu", "title": "Multimedia Capacity Analysis of the IEEE 802.11e Contention-based\n  Infrastructure Basic Service Set", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.MM math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We first propose a simple mathematical analysis framework for the Enhanced\nDistributed Channel Access (EDCA) function of the recently ratified IEEE\n802.11e standard. Our analysis considers the fact that the distributed random\naccess systems exhibit cyclic behavior. The proposed model is valid for\narbitrary assignments of AC-specific Arbitration Interframe Space (AIFS) values\nand Contention Window (CW) sizes and is the first that considers an arbitrary\ndistribution of active Access Categories (ACs) at the stations. Validating the\ntheoretical results via extensive simulations, we show that the proposed\nanalysis accurately captures the EDCA saturation performance. Next, we propose\na framework for multimedia capacity analysis of the EDCA function. We calculate\nan accurate station- and AC-specific queue utilization ratio by appropriately\nweighing the service time predictions of the cycle time model for different\nnumber of active stations. Based on the calculated queue utilization ratio, we\ndesign a simple model-based admission control scheme. We show that the proposed\ncall admission control algorithm maintains satisfactory user-perceived quality\nfor coexisting voice and video connections in an infrastructure BSS and does\nnot present over- or under-admission problems of previously proposed models in\nthe literature.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jul 2007 05:16:53 GMT"}, {"version": "v2", "created": "Mon, 30 Jul 2007 18:08:46 GMT"}, {"version": "v3", "created": "Tue, 12 Aug 2008 05:55:21 GMT"}], "update_date": "2008-08-12", "authors_parsed": [["Inan", "Inanc", ""], ["Keceli", "Feyza", ""], ["Ayanoglu", "Ender", ""]]}, {"id": "0707.3670", "submitter": "Xu Cheng", "authors": "Xu Cheng and Cameron Dale and Jiangchuan Liu", "title": "Understanding the Characteristics of Internet Short Video Sharing:\n  YouTube as a Case Study", "comments": "IEEE format, 9 pages, 16 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.MM", "license": null, "abstract": "  Established in 2005, YouTube has become the most successful Internet site\nproviding a new generation of short video sharing service. Today, YouTube alone\ncomprises approximately 20% of all HTTP traffic, or nearly 10% of all traffic\non the Internet. Understanding the features of YouTube and similar video\nsharing sites is thus crucial to their sustainable development and to network\ntraffic engineering. In this paper, using traces crawled in a 3-month period,\nwe present an in-depth and systematic measurement study on the characteristics\nof YouTube videos. We find that YouTube videos have noticeably different\nstatistics compared to traditional streaming videos, ranging from length and\naccess pattern, to their active life span, ratings, and comments. The series of\ndatasets also allows us to identify the growth trend of this fast evolving\nInternet site in various aspects, which has seldom been explored before. We\nalso look closely at the social networking aspect of YouTube, as this is a key\ndriving force toward its success. In particular, we find that the links to\nrelated videos generated by uploaders' choices form a small-world network. This\nsuggests that the videos have strong correlations with each other, and creates\nopportunities for developing novel caching or peer-to-peer distribution schemes\nto efficiently deliver videos to end users.\n", "versions": [{"version": "v1", "created": "Wed, 25 Jul 2007 05:39:44 GMT"}], "update_date": "2007-07-26", "authors_parsed": [["Cheng", "Xu", ""], ["Dale", "Cameron", ""], ["Liu", "Jiangchuan", ""]]}, {"id": "0707.4524", "submitter": "Shiguo Lian", "authors": "Shiguo Lian", "title": "Image Authentication Based on Neural Networks", "comments": "16 pages,10 figures, submitted", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.NE", "license": null, "abstract": "  Neural network has been attracting more and more researchers since the past\ndecades. The properties, such as parameter sensitivity, random similarity,\nlearning ability, etc., make it suitable for information protection, such as\ndata encryption, data authentication, intrusion detection, etc. In this paper,\nby investigating neural networks' properties, the low-cost authentication\nmethod based on neural networks is proposed and used to authenticate images or\nvideos. The authentication method can detect whether the images or videos are\nmodified maliciously. Firstly, this chapter introduces neural networks'\nproperties, such as parameter sensitivity, random similarity, diffusion\nproperty, confusion property, one-way property, etc. Secondly, the chapter\ngives an introduction to neural network based protection methods. Thirdly, an\nimage or video authentication scheme based on neural networks is presented, and\nits performances, including security, robustness and efficiency, are analyzed.\nFinally, conclusions are drawn, and some open issues in this field are\npresented.\n", "versions": [{"version": "v1", "created": "Tue, 31 Jul 2007 02:27:10 GMT"}], "update_date": "2007-08-01", "authors_parsed": [["Lian", "Shiguo", ""]]}]