[{"id": "1801.00005", "submitter": "Walter Schneider", "authors": "Walter Schneider", "title": "Analytical Inverter Delay Modeling Using Matlab's Curve Fitting Toolbox", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.AR", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  This paper presents a new analytical propagation delay model for deep\nsubmicron CMOS inverters. The model is inspired by the key observation that the\ninverter delay is a complicated function of several process parameters as well\nas load capacitance. These relationships are considered by fitting functions\nfor each parameter derived from the Curve Fitting Toolbox in Matlab. Compared\nto SPICE simulations based on the BSIM4 transistor model, the analytical delay\nmodel shows very good accuracy with an average error less than 2% over a wide\nrange of process parameters and output loads. Hence, the proposed model can be\nefficiently used for different technology nodes as well as statistical gate\ndelay characterisation.\n", "versions": [{"version": "v1", "created": "Fri, 29 Dec 2017 14:33:16 GMT"}], "update_date": "2018-01-03", "authors_parsed": [["Schneider", "Walter", ""]]}, {"id": "1801.02336", "submitter": "Esra'a Alkafaween", "authors": "Ahmad Abadleh, Eshraq Al-Hawari, Esra'a Alkafaween, Hamad Al-Sawalqah", "title": "Step Detection Algorithm For Accurate Distance Estimation Using Dynamic\n  Step Length", "comments": "this paper contains of 5 pages and 6 figures", "journal-ref": "In Mobile Data Management (MDM), 2017 18th IEEE International\n  Conference on, pp. 324-327. IEEE, 2017", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper, a new Smartphone sensor based algorithm is proposed to detect\naccurate distance estimation. The algorithm consists of two phases, the first\nphase is for detecting the peaks from the Smartphone accelerometer sensor. The\nother one is for detecting the step length which varies from step to step. The\nproposed algorithm is tested and implemented in real environment and it showed\npromising results. Unlike the conventional approaches, the error of the\nproposed algorithm is fixed and is not affected by the long distance.\n  Keywords distance estimation, peaks, step length, accelerometer.\n", "versions": [{"version": "v1", "created": "Mon, 8 Jan 2018 08:26:12 GMT"}], "update_date": "2018-01-09", "authors_parsed": [["Abadleh", "Ahmad", ""], ["Al-Hawari", "Eshraq", ""], ["Alkafaween", "Esra'a", ""], ["Al-Sawalqah", "Hamad", ""]]}, {"id": "1801.05611", "submitter": "Christos Liaskos K.", "authors": "Christos Liaskos, Ageliki Tsioliaridou, Sotiris Ioannidis", "title": "The Socket Store: An App Model for the Application-Network Interaction", "comments": null, "journal-ref": null, "doi": "10.1109/ISCC.2017.8024557", "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A developer of mobile or desktop applications is responsible for implementing\nthe network logic of his software. Nonetheless: i) Developers are not network\nspecialists, while pressure for emphasis on the visible application parts\nplaces the network logic out of the coding focus. Moreover, computer networks\nundergo evolution at paces that developers may not follow. ii) From the network\nresource provider point of view, marketing novel services and involving a broad\naudience is also challenge for the same reason. Moreover, the objectives of\nend-user networking logic are neither clear nor uniform. This constitutes the\ncentral optimization of network resources an additional challenge. As a\nsolution to these problems, we propose the Socket Store. The Store is a\nmarketplace containing end-user network logic in modular form. The Store\nmodules act as intelligent mediators between the end-user and the network\nresources. Each module has a clear, specialized objective, such as connecting\ntwo clients over the Internet while avoiding transit networks suspicious for\neavesdropping. The Store is populated and peer-reviewed by network specialists,\nwhose motive is the visibility, practical applicability and monetization\npotential of their work. A developer first purchases access to a given socket\nmodule. Subsequently, he incorporates it to his applications under development,\nobtaining state-of-the-art performance with trivial coding burden. A full Store\nprototype is implemented and a critical data streaming module is evaluated as a\ndriving case.\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 10:11:39 GMT"}], "update_date": "2018-01-18", "authors_parsed": [["Liaskos", "Christos", ""], ["Tsioliaridou", "Ageliki", ""], ["Ioannidis", "Sotiris", ""]]}, {"id": "1801.05741", "submitter": "R\\'emi Cura", "authors": "R\\'emi Cura, Julien Perret, Nicolas Paparoditis", "title": "StreetGen : In base city scale procedural generation of streets: road\n  network, road surface and street objects", "comments": "Paper extracted from thesis manuscript, is also an extension of\n  doi:10.5194/isprsannals-II-3-W5-409-201", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Streets are large, diverse, and used for several (and possibly conflicting)\ntransport modalities as well as social and cultural activities. Proper planning\nis essential and requires data. Manually fabricating data that represent\nstreets (street reconstruction) is error-prone and time consuming. Automatising\nstreet reconstruction is a challenge because of the diversity, size, and scale\nof the details (few centimetres for cornerstone) required. The state-of-the-art\nfocuses on roads (no context, no urban features) and is strongly determined by\neach application (simulation, visualisation, planning). We propose a unified\nframework that works on real Geographic Information System (GIS) data and uses\na strong, yet simple modelling hypothesis when possible to robustly model\nstreets at the city level or street level. Our method produces a coherent\nstreet-network model containing topological traffic information, road surface\nand street objects. We demonstrate the robustness and genericity of our method\nby reconstructing the entire city of Paris streets and exploring other similar\nreconstruction (airport driveway).\n", "versions": [{"version": "v1", "created": "Wed, 17 Jan 2018 16:33:28 GMT"}], "update_date": "2018-01-18", "authors_parsed": [["Cura", "Rémi", ""], ["Perret", "Julien", ""], ["Paparoditis", "Nicolas", ""]]}, {"id": "1801.06502", "submitter": "Zhihao Ding", "authors": "Zhihao Ding, Pinyi Ren, Qinghe Du", "title": "Mobility Based Routing Protocol with MAC Collision Improvement in\n  Vehicular Ad Hoc Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intelligent transportation system attracts a great deal of research attention\nbecause it helps enhance traffic safety, improve driving experiences, and\ntransportation efficiency. Vehicular Ad Hoc Network (VANET) supports wireless\nconnections among vehicles and offers information exchange, thus significantly\nfacilitating intelligent transportation systems. Since the vehicles move fast\nand often change lanes unpredictably, the network topology evolves rapidly in a\nrandom fashion, which imposes diverse challenges in routing protocol design\nover VANET. When it comes to the 5G era, the fulfilment of ultra low end-to-end\ndelay and ultra high reliability becomes more crucial than ever. In this paper,\nwe propose a novel routing protocol that incorporates mobility status and MAC\nlayer channel contention information. The proposed routing protocol determines\nnext hop by applying mobility information and MAC contention information which\ndiffers from existing greedy perimeter stateless routing (GPSR) protocol.\nSimulation results of the proposed routing protocol show its performance\nsuperiority over the existing approach.\n", "versions": [{"version": "v1", "created": "Fri, 19 Jan 2018 17:39:27 GMT"}], "update_date": "2018-01-22", "authors_parsed": [["Ding", "Zhihao", ""], ["Ren", "Pinyi", ""], ["Du", "Qinghe", ""]]}, {"id": "1801.07661", "submitter": "Christoph Rauch", "authors": "Diogo Po\\c{c}as and Jeffery Zucker", "title": "Approximability in the GPAC", "comments": null, "journal-ref": "Logical Methods in Computer Science, Volume 15, Issue 3 (August\n  29, 2019) lmcs:5727", "doi": "10.23638/LMCS-15(3:24)2019", "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Most of the physical processes arising in nature are modeled by either\nordinary or partial differential equations. From the point of view of analog\ncomputability, the existence of an effective way to obtain solutions of these\nsystems is essential. A pioneering model of analog computation is the General\nPurpose Analog Computer (GPAC), introduced by Shannon as a model of the\nDifferential Analyzer and improved by Pour-El, Lipshitz and Rubel, Costa and\nGra\\c{c}a and others. Its power is known to be characterized by the class of\ndifferentially algebraic functions, which includes the solutions of initial\nvalue problems for ordinary differential equations. We address one of the\nlimitations of this model, concerning the notion of approximability, a\ndesirable property in computation over continuous spaces that is however absent\nin the GPAC. In particular, the Shannon GPAC cannot be used to generate\nnon-differentially algebraic functions which can be approximately computed in\nother models of computation. We extend the class of data types using networks\nwith channels which carry information on a general complete metric space $X$;\nfor example $X=C(R,R)$, the class of continuous functions of one real (spatial)\nvariable. We consider the original modules in Shannon's construction\n(constants, adders, multipliers, integrators) and we add \\emph{(continuous or\ndiscrete) limit} modules which have one input and one output. We then define an\nL-GPAC to be a network built with $X$-stream channels and the above-mentioned\nmodules. This leads us to a framework in which the specifications of such\nanalog systems are given by fixed points of certain operators on continuous\ndata streams. We study these analog systems and their associated operators, and\nshow how some classically non-generable functions, such as the gamma function\nand the zeta function, can be captured with the L-GPAC.\n", "versions": [{"version": "v1", "created": "Mon, 15 Jan 2018 10:49:03 GMT"}, {"version": "v2", "created": "Tue, 15 Jan 2019 09:51:58 GMT"}, {"version": "v3", "created": "Wed, 28 Aug 2019 12:33:20 GMT"}], "update_date": "2019-10-23", "authors_parsed": [["Poças", "Diogo", ""], ["Zucker", "Jeffery", ""]]}, {"id": "1801.08444", "submitter": "Harun Siljak", "authors": "Harun Siljak, Abdulhamit Subasi and Belle R. Upadhyaya", "title": "Hardware implementation of auto-mutual information function for\n  condition monitoring", "comments": null, "journal-ref": null, "doi": "10.1016/j.compeleceng.2018.01.038", "report-no": null, "categories": "cs.OH eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study is aimed at showing applicability of mutual information, namely\nauto-mutual information function for condition monitoring in electrical motors,\nthrough age detection in accelerated motor aging. Vibration data collected in\nartificial induction motor experiment is used for verification of both the\noriginal auto-mutual information function algorithm and its hardware\nimplementation in Verilog, produced from an initial version made with Matlab\nHDL (Hardware Description Language) Coder. A conceptual model for industry and\neducation based on a field programmable logic array development board is\ndeveloped and demonstrated on the auto-mutual information function example,\nwhile suggesting other applications as well. It has also been shown that\nattractor reconstruction for the vibration data cannot be straightforward.\n", "versions": [{"version": "v1", "created": "Thu, 25 Jan 2018 15:15:02 GMT"}], "update_date": "2018-02-06", "authors_parsed": [["Siljak", "Harun", ""], ["Subasi", "Abdulhamit", ""], ["Upadhyaya", "Belle R.", ""]]}]