[{"id": "0901.0065", "submitter": "Alireza Avanaki", "authors": "Alireza Avanaki", "title": "Exact Histogram Specification Optimized for Structural Similarity", "comments": null, "journal-ref": null, "doi": "10.1007/s10043-009-0119-z", "report-no": null, "categories": "cs.CV cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An exact histogram specification (EHS) method modifies its input image to\nhave a specified histogram. Applications of EHS include image (contrast)\nenhancement (e.g., by histogram equalization) and histogram watermarking.\nPerforming EHS on an image, however, reduces its visual quality. Starting from\nthe output of a generic EHS method, we maximize the structural similarity index\n(SSIM) between the original image (before EHS) and the result of EHS\niteratively. Essential in this process is the computationally simple and\naccurate formula we derive for SSIM gradient. As it is based on gradient\nascent, the proposed EHS always converges. Experimental results confirm that\nwhile obtaining the histogram exactly as specified, the proposed method\ninvariably outperforms the existing methods in terms of visual quality of the\nresult. The computational complexity of the proposed method is shown to be of\nthe same order as that of the existing methods.\n  Index terms: histogram modification, histogram equalization, optimization for\nperceptual visual quality, structural similarity gradient ascent, histogram\nwatermarking, contrast enhancement.\n", "versions": [{"version": "v1", "created": "Wed, 31 Dec 2008 06:13:39 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Avanaki", "Alireza", ""]]}, {"id": "0901.1407", "submitter": "Bin Yan", "authors": "Bin Yan, Zheming Lu and Yinjing Guo", "title": "Condition for Energy Efficient Watermarking with Random Vector Model\n  without WSS Assumption", "comments": "10 pages, 2 figures, submitted to IEEE Signal Processing Letter for\n  review", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MM cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Energy efficient watermarking preserves the watermark energy after linear\nattack as much as possible. We consider in this letter non-stationary signal\nmodels and derive conditions for energy efficient watermarking under random\nvector model without WSS assumption. We find that the covariance matrix of the\nenergy efficient watermark should be proportional to host covariance matrix to\nbest resist the optimal linear removal attacks. In WSS process our result\nreduces to the well known power spectrum condition. Intuitive geometric\ninterpretation of the results are also discussed which in turn also provide\nmore simpler proof of the main results.\n", "versions": [{"version": "v1", "created": "Sun, 11 Jan 2009 02:25:17 GMT"}], "update_date": "2009-01-13", "authors_parsed": [["Yan", "Bin", ""], ["Lu", "Zheming", ""], ["Guo", "Yinjing", ""]]}]