[{"id": "1401.0765", "submitter": "Sparsh Mittal", "authors": "Sparsh Mittal", "title": "A Survey of Techniques For Improving Energy Efficiency in Embedded\n  Computing Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent technological advances have greatly improved the performance and\nfeatures of embedded systems. With the number of just mobile devices now\nreaching nearly equal to the population of earth, embedded systems have truly\nbecome ubiquitous. These trends, however, have also made the task of managing\ntheir power consumption extremely challenging. In recent years, several\ntechniques have been proposed to address this issue. In this paper, we survey\nthe techniques for managing power consumption of embedded systems. We discuss\nthe need of power management and provide a classification of the techniques on\nseveral important parameters to highlight their similarities and differences.\nThis paper is intended to help the researchers and application-developers in\ngaining insights into the working of power management techniques and designing\neven more efficient high-performance embedded systems of tomorrow.\n", "versions": [{"version": "v1", "created": "Sat, 4 Jan 2014 02:06:23 GMT"}], "update_date": "2014-01-07", "authors_parsed": [["Mittal", "Sparsh", ""]]}, {"id": "1401.1003", "submitter": "Nanditha Rao Ms", "authors": "Nanditha P. Rao, Shahbaz Sarik and Madhav P. Desai", "title": "On the likelihood of multiple bit upsets in logic circuits", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Soft errors have a significant impact on the circuit reliability at nanoscale\ntechnologies. At the architectural level, soft errors are commonly modeled by a\nprobabilistic bit-flip model. In developing such abstract fault models, an\nimportant issue to consider is the likelihood of multiple bit errors caused by\nparticle strikes. This likelihood has been studied to a great extent in\nmemories, but has not been understood to the same extent in logic circuits. In\nthis paper, we attempt to quantify the likelihood that a single transient event\ncan cause multiple bit errors in logic circuits consisting of combinational\ngates and flip-flops. In particular, we calculate the conditional probability\nof multiple bit-flips given that a single bit flips as a result of the\ntransient. To calculate this conditional probability, we use a Monte Carlo\ntechnique in which samples are generated using detailed post-layout circuit\nsimulations. Our experiments on the ISCAS'85 benchmarks and a few other\ncircuits indicate that, this conditional probability is quite significant and\ncan be as high as 0.31. Thus we conclude that multiple bit-flips must\nnecessarily be considered in order to obtain a realistic architectural fault\nmodel for soft errors.\n", "versions": [{"version": "v1", "created": "Mon, 6 Jan 2014 07:36:13 GMT"}], "update_date": "2014-01-07", "authors_parsed": [["Rao", "Nanditha P.", ""], ["Sarik", "Shahbaz", ""], ["Desai", "Madhav P.", ""]]}, {"id": "1401.2727", "submitter": "Rourab Paul", "authors": "Rourab Paul, Amlan Chakrabarti, Ranjan Ghosh", "title": "Hardware Implementation of four byte per clock RC4 algorithm", "comments": "This is an unpublished draft version", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the field of cryptography till date the 2-byte in 1-clock is the best\nknown RC4 hardware design [1], while 1-byte in 1-clock [2], and the 1-byte in 3\nclocks [3][4] are the best known implementation. The design algorithm in[2]\nconsiders two consecutive bytes together and processes them in 2 clocks. The\ndesign [1] is a pipelining architecture of [2]. The design of 1-byte in\n3-clocks is too much modular and clock hungry. In this paper considering the\nRC4 algorithm, as it is, a simpler RC4 hardware design providing higher\nthroughput is proposed in which 6 different architecture has been proposed. In\ndesign 1, 1-byte is processed in 1-clock, design 2 is a dynamic KSA-PRGA\narchitecture of Design 1. Design 3 can process 2 byte in a single clock, where\nas Design 4 is Dynamic KSA-PRGA architecture of Design 3. Design 5 and Design 6\nare parallelization architecture design 2 and design 4 which can compute 4 byte\nin a single clock. The maturity in terms of throughput, power consumption and\nresource usage, has been achieved from design 1 to design 6. The RC4 encryption\nand decryption designs are respectively embedded on two FPGA boards as\nco-processor hardware, the communication between the two boards performed using\nEthernet.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2014 06:57:21 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Paul", "Rourab", ""], ["Chakrabarti", "Amlan", ""], ["Ghosh", "Ranjan", ""]]}, {"id": "1401.2732", "submitter": "Rourab Paul", "authors": "Rourab Paul, Amlan Chakrabarti, Ranjan Ghosh", "title": "Fault Detection for RC4 Algorithm and its Implementation on FPGA\n  Platform", "comments": "Published Book Title: Elsevier Science and Technology, ICCN 2013,\n  Bangalore, Page(s): 224 - 232, Volume 3, DOI-03.elsevierst.2013.3.ICCN25,\n  ISBN :9789351071044", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In hardware implementation of a cryptographic algorithm, one may achieve\nleakage of secret information by creating scopes to introduce controlled faulty\nbit(s) even though the algorithm is mathematically a secured one. The technique\nis very effective in respect of crypto processors embedded in smart cards. In\nthis paper few fault detecting architectures for RC4 algorithm are designed and\nimplemented on Virtex5(ML505, LX110t) FPGA board. The results indicate that the\nproposed architectures can handle most of the faults without loss of throughput\nconsuming marginally additional hardware and power.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2014 07:19:52 GMT"}], "update_date": "2016-10-31", "authors_parsed": [["Paul", "Rourab", ""], ["Chakrabarti", "Amlan", ""], ["Ghosh", "Ranjan", ""]]}, {"id": "1401.2768", "submitter": "Hanumantha Raju MC", "authors": "M. C. Hanumantharaju and M. T. Gopalakrishna", "title": "Design of novel architectures and field programmable gate arrays\n  implementation of two dimensional gaussian surround function", "comments": "10 Pages, 14 figures (including authors photo), International\n  Conference on Image & Signal Processing (ICIP2013)", "journal-ref": "International Journal of Information Processing, ISSN : 0973-8215,\n  7(4), 66-75, 2013", "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  A new design and novel architecture suitable for FPGA/ASIC implementation of\na 2D Gaussian surround function for image processing application is presented\nin this paper. The proposed scheme results in enormous savings of memory\nnormally required for 2D Gaussian function implementation. In the present work,\nthe Gaussian symmetric characteristics which quickly falls off toward\nplus/minus infinity has been used in order to save the memory. The 2D Gaussian\nfunction implementation is presented for use in applications such as image\nenhancement, smoothing, edge detection and filtering etc. The FPGA\nimplementation of the proposed 2D Gaussian function is capable of processing\n(blurring, smoothing, and convolution) high resolution color pictures of size\nup to $1600\\times1200$ pixels at the real time video rate of 30 frames/sec. The\nGaussian design exploited here has been used in the core part of retinex based\ncolor image enhancement. Therefore, the design presented produces Gaussian\noutput with three different scales, namely, 16, 64 and 128. The design was\ncoded in Verilog, a popular hardware design language used in industries,\nconforming to RTL coding guidelines and fits onto a single chip with a gate\ncount utilization of 89,213 gates. Experimental results presented confirms that\nthe proposed method offers a new approach for development of large sized\nGaussian pyramid while reducing the on-chip memory utilization.\n", "versions": [{"version": "v1", "created": "Mon, 13 Jan 2014 09:52:08 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Hanumantharaju", "M. C.", ""], ["Gopalakrishna", "M. T.", ""]]}, {"id": "1401.3421", "submitter": "Rourab Paul", "authors": "Sruti Agarwal, Sangeet Saha, Rourab Paul, Amlan Chakrabarti", "title": "Performance Evaluation of ECC in Single and Multi Processor\n  Architectures on FPGA Based Embedded System", "comments": "Published Book Title: Elsevier Science and Technology, ICCN 2013,\n  Bangalore, Page(s): 140 - 147, Volume 3, 03.elsevierst.2013.3.ICCN16, ISBN\n  :9789351071044, Paper\n  link:-http://searchdl.org/index.php/book_series/view/917", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cryptographic algorithms are computationally costly and the challenge is more\nif we need to execute them in resource constrained embedded systems. Field\nProgrammable Gate Arrays (FPGAs) having programmable logic de- vices and\nprocessing cores, have proven to be highly feasible implementation platforms\nfor embedded systems providing lesser design time and reconfig- urability.\nDesign parameters like throughput, resource utilization and power requirements\nare the key issues. The popular Elliptic Curve Cryptography (ECC), which is\nsuperior over other public-key crypto-systems like RSA in many ways, such as\nproviding greater security for a smaller key size, is cho- sen in this work and\nthe possibilities of its implementation in FPGA based embedded systems for both\nsingle and dual processor core architectures in- volving task parallelization\nhave been explored. This exploration, which is first of its kind considering\nthe other existing works, is a needed activity for evaluating the best possible\narchitectural environment for ECC implementa- tion on FPGA (Virtex4 XC4VFX12,\nFF668, -10) based embedded platform.\n", "versions": [{"version": "v1", "created": "Wed, 15 Jan 2014 03:25:41 GMT"}], "update_date": "2014-02-20", "authors_parsed": [["Agarwal", "Sruti", ""], ["Saha", "Sangeet", ""], ["Paul", "Rourab", ""], ["Chakrabarti", "Amlan", ""]]}, {"id": "1401.4629", "submitter": "Moustafa Mohamed", "authors": "Moustafa Mohamed, Zheng Li, Xi Chen, Alan Mickelson", "title": "HERMES: A Hierarchical Broadcast-Based Silicon Photonic Interconnect for\n  Scalable Many-Core Systems", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Optical interconnection networks, as enabled by recent advances in silicon\nphotonic device and fabrication technology, have the potential to address\non-chip and off-chip communication bottlenecks in many-core systems. Although\nseveral designs have shown superior power efficiency and performance compared\nto electrical alternatives, these networks will not scale to the thousands of\ncores required in the future.\n  In this paper, we introduce Hermes, a hybrid network composed of an optimized\nbroadcast for power-efficient low-latency global-scale coordination and\ncircuit-switch sub-networks for high-throughput data delivery. This network\nwill scale for use in thousand core chip systems. At the physical level,\nSoI-based adiabatic coupler has been designed to provide low-loss and compact\noptical power splitting. Based on the adiabatic coupler, a topology based on\n2-ary folded butterfly is designed to provide linear power division in a\nthousand core layout with minimal cross-overs. To address the network agility\nand provide for efficient use of optical bandwidth, a flow control and routing\nmechanism is introduced to dynamically allocate bandwidth and provide fairness\nusage of network resources. At the system level, bloom filter-based filtering\nfor localization of communication are designed for reducing global traffic. In\naddition, a novel greedy-based data and workload migration are leveraged to\nincrease the locality of communication in a NUCA (non-uniform cache access)\narchitecture. First order analytic evaluation results have indicated that\nHermes is scalable to at least 1024 cores and offers significant performance\nimprovement and power savings over prior silicon photonic designs.\n", "versions": [{"version": "v1", "created": "Sun, 19 Jan 2014 03:20:40 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Mohamed", "Moustafa", ""], ["Li", "Zheng", ""], ["Chen", "Xi", ""], ["Mickelson", "Alan", ""]]}, {"id": "1401.4891", "submitter": "Ahmed Ben Achballah", "authors": "Ahmed Ben Achballah and Slim Ben Saoud", "title": "The Design of a Network-On-Chip Architecture Based On An Avionic\n  Protocol", "comments": "5 pages World Symposium on Computer Applications & Research WSCAR'\n  2014, 18-20 January, Sousse, Tunisia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  When the Network-On-Chip (NoC) paradigm was introduced, many researchers have\nproposed many novelistic NoC architectures, tools and design strategies. In\nthis paper we introduce a new approach in the field of designing\nNetwork-On-Chip (NoC). Our inspiration came from an avionic protocol which is\nthe AFDX protocol. The proposed NoC architecture is a switch centric\narchitecture, with exclusive shortcuts between hosts and utilizes the\nflexibility, the reliability and the performances offered by AFDX.\n", "versions": [{"version": "v1", "created": "Mon, 20 Jan 2014 13:20:58 GMT"}], "update_date": "2014-01-21", "authors_parsed": [["Achballah", "Ahmed Ben", ""], ["Saoud", "Slim Ben", ""]]}, {"id": "1401.6370", "submitter": "Haipeng Zhang Ph.D.", "authors": "Haipeng Zhang, Lingjun Kong, Xiuju Huang, Mengmeng Cao", "title": "Design of a High Speed XAUI Based on Dynamic Reconfigurable Transceiver\n  IP Core", "comments": "10 pages, 5 figures, 5 tables, 14 references", "journal-ref": "International Journal of Soft Computing And Software Engineering\n  (JSCSE) Vol.2,No.9, 2012 Published online: Sep 25, 2012", "doi": "10.7321/jscse.v2.n9.4", "report-no": null, "categories": "cs.AR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  By using the dynamic reconfigurable transceiver in high speed interface\ndesign, designer can solve critical technology problems such as ensuring signal\nintegrity conveniently, with lower error binary rate. In this paper, we\ndesigned a high speed XAUI (10Gbps Ethernet Attachment Unit Interface) to\ntransparently extend the physical reach of the XGMII. The following points are\nfocused: (1) IP (Intellectual Property) core usage. Altera Co. offers two\ntransceiver IP cores in Quartus II MegaWizard Plug-In Manager for XAUI design\nwhich is featured of dynamic reconfiguration performance, that is,\nALTGX_RECO?FIG instance and ALTGX instance, we can get various groups by\nchanging settings of the devices without power off. These two blocks can\naccomplish function of PCS (Physical Coding Sub-layer) and PMA (Physical Medium\nAttachment), however, with higher efficiency and reliability. (2) 1+1\nprotection. In our design, two ALTGX IP cores are used to work in parallel,\nwhich named XAUI0 and XAUI1. The former works as the main channel while the\nlatter redundant channel. When XAUI0 is out of service for some reasons, XAUI1\nwill start to work to keep the business. (3) RTL (Register Transfer Level)\ncoding with Verilog HDL and simulation. Create the ALTGX_RECO?FIG instance and\nALTGX instance, enable dynamic reconfiguration in the ALTGXB Megafunction, then\nconnect the ALTGX_RECO?FIG with the ALTGX instances. After RTL coding, the\ndesign was simulated on VCS simulator. The validated result indicates that the\npackets are transferred efficiently. FPGA makes high-speed optical\ncommunication system design simplified.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2014 15:14:52 GMT"}], "update_date": "2014-01-27", "authors_parsed": [["Zhang", "Haipeng", ""], ["Kong", "Lingjun", ""], ["Huang", "Xiuju", ""], ["Cao", "Mengmeng", ""]]}, {"id": "1401.6375", "submitter": "Haipeng Zhang Ph.D.", "authors": "Yixin Liu, Haipeng Zhang, Tao Feng", "title": "Design of an Encryption-Decryption Module Oriented for Internet\n  Information Security SOC Design", "comments": "11 pages, 5 figures, 4 tables, 14 references", "journal-ref": "International Journal of Soft Computing And Software Engineering\n  (JSCSE),Vol.2,No.7, 2012", "doi": "10.7321/jscse.v2.n7.3", "report-no": null, "categories": "cs.AR cs.CR", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In order to protect the security of network data, a high speed chip module\nfor encrypting and decrypting of network data packet is designed. The chip\nmodule is oriented for internet information security SOC (System on Chip)\ndesign. During the design process, AES (Advanced Encryption Standard) and 3DES\n(Data Encryption Standard) encryption algorithm are adopted to protect the\nsecurity of network data. The following points are focused: (1) The SOC (System\non Chip) design methodology based on IP (Intellectual Property) core is used.\nAES (Advanced Encryption Standard) and 3DES (Data Encryption Standard) IP\n(Intellectual Property) cores are embedded in the chip module, peripheral\ncontrol sub-modules are designed to control the encryption-decryption module,\nwhich is capable of shortening the design period of the chip module. (2) The\nimplementation of encryption-decryption with hardware was presented, which\nimproves the safety of data through the encryption-decryption chip and reduce\nthe load of CPU. (3) In our hardware solution, two AES (Advanced Encryption\nStandard) cores are used to work in parallel, which improves the speed of the\nencryption module. Moreover, the key length of AES (Advanced Encryption\nStandard) encryption algorithm is designed with three optional configurations\nat 128 bits, 256 bits and 192 bits respectively and six optional encryption\nalgorithm modes: CBC (Cipher Block Chaining) mode, ECB (Electronic Code Book)\nmode, GCM (Galois/Counter Mode) mode, XTS(cipherteXT Stealing) mode, CTR\n(CounTeR) mode and 3DES respectively, which adds the flexibility to its\napplications.\n", "versions": [{"version": "v1", "created": "Fri, 24 Jan 2014 15:29:06 GMT"}], "update_date": "2014-01-27", "authors_parsed": [["Liu", "Yixin", ""], ["Zhang", "Haipeng", ""], ["Feng", "Tao", ""]]}]