[{"id": "1310.0250", "submitter": "Patrick O. Glauner", "authors": "Patrick O. Glauner, Jan Iwaszkiewicz, Jean-Yves Le Meur and Tibor\n  Simko", "title": "Use of Solr and Xapian in the Invenio document repository software", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Invenio is a free comprehensive web-based document repository and digital\nlibrary software suite originally developed at CERN. It can serve a variety of\nuse cases from an institutional repository or digital library to a web journal.\nIn order to fully use full-text documents for efficient search and ranking,\nSolr was integrated into Invenio through a generic bridge. Solr indexes\nextracted full-texts and most relevant metadata. Consequently, Invenio takes\nadvantage of Solr's efficient search and word similarity ranking capabilities.\nIn this paper, we first give an overview of Invenio, its capabilities and\nfeatures. We then present our open source Solr integration as well as\nscalability challenges that arose for an Invenio-based multi-million record\nrepository: the CERN Document Server. We also compare our Solr adapter to an\nalternative Xapian adapter using the same generic bridge. Both integrations are\ndistributed with the Invenio package and ready to be used by the institutions\nusing or adopting Invenio.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2013 11:37:06 GMT"}], "update_date": "2013-10-02", "authors_parsed": [["Glauner", "Patrick O.", ""], ["Iwaszkiewicz", "Jan", ""], ["Meur", "Jean-Yves Le", ""], ["Simko", "Tibor", ""]]}, {"id": "1310.0737", "submitter": "Liane Gabora", "authors": "Tomas Veloz, Ilya Temkin, and Liane Gabora", "title": "A Conceptual Network-Based Approach to Inferring the Cultural\n  Evolutionary History of the Baltic Psaltery", "comments": "6 pages", "journal-ref": "(2012). Proceedings of the Annual Meeting of the Cognitive Science\n  Society (pp. 2487-2492). August 1-4, Sapporo Japan. Houston TX: Cognitive\n  Science Society", "doi": null, "report-no": null, "categories": "cs.DL q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The application of conventional phylogenetic techniques for inferring\ncultural history is problematic due to differences in the nature of information\ntransmission in biological and cultural realms. In culture, units of\ntransmission are not just measurable attributes, but communicable concepts.\nTherefore, relatedness amongst cultural elements often resides at the\nconceptual level not captured by traditional phylogenetic methods. This paper\ntakes a cognitively inspired approach to analyzing material cultural history.\nWe show that combining data for physical attributes of cultural artifacts with\nconceptual information can uncover cultural influences among different\nethnolinguistic groups, and reveal new patterns of cultural ancestry. Using the\nBaltic psaltery, a musical instrument with a well-documented ethnographic and\narchaeological record, we recovered a previously unacknowledged pattern of\nhistorical relationship that is more congruent with geographical distribution\nand temporal data than is obtained with other approaches.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2013 18:50:19 GMT"}, {"version": "v2", "created": "Fri, 5 Jul 2019 20:30:31 GMT"}], "update_date": "2019-07-09", "authors_parsed": [["Veloz", "Tomas", ""], ["Temkin", "Ilya", ""], ["Gabora", "Liane", ""]]}, {"id": "1310.1366", "submitter": "Eduardo Ara\\'ujo", "authors": "E. B. Ara\\'ujo, A. A. Moreira, V. Furtado, T. H. C. Pequeno, J. S.\n  Andrade Jr", "title": "Collaboration networks from a large CV database: dynamics, topology and\n  bonus impact", "comments": "8 pages, 8 figures", "journal-ref": null, "doi": "10.1371/journal.pone.0090537", "report-no": null, "categories": "physics.soc-ph cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding the dynamics of research production and collaboration may\nreveal better strategies for scientific careers, academic institutions and\nfunding agencies. Here we propose the use of a large and multidisciplinar\ndatabase of scientific curricula in Brazil, namely, the Lattes Platform, to\nstudy patterns of scientific production and collaboration. In this database,\ndetailed information about publications and researchers are made available by\nthemselves so that coauthorship is unambiguous and individuals can be evaluated\nby scientific productivity, geographical location and field of expertise. Our\nresults show that the collaboration network is growing exponentially for the\nlast three decades, with a distribution of number of collaborators per\nresearcher that approaches a power-law as the network gets older. Moreover,\nboth the distributions of number of collaborators and production per researcher\nobey power-law behaviors, regardless of the geographical location or field,\nsuggesting that the same universal mechanism might be responsible for network\ngrowth and productivity.We also show that the collaboration network under\ninvestigation displays a typical assortative mixing behavior, where teeming\nresearchers (i.e., with high degree) tend to collaborate with others alike.\nFinally, our analysis reveals that the distinctive collaboration profile of\nresearchers awarded with governmental scholarships suggests a strong bonus\nimpact on their productivity.\n", "versions": [{"version": "v1", "created": "Tue, 1 Oct 2013 16:15:46 GMT"}], "update_date": "2015-06-17", "authors_parsed": [["Araújo", "E. B.", ""], ["Moreira", "A. A.", ""], ["Furtado", "V.", ""], ["Pequeno", "T. H. C.", ""], ["Andrade", "J. S.", "Jr"]]}, {"id": "1310.1968", "submitter": "Jinyun Yan", "authors": "Graham Cormode, S. Muthukrishnan, Jinyun Yan", "title": "First Author Advantage: Citation Labeling in Research", "comments": "Computational Scientometrics: Theory and Applications at The 22nd\n  CIKM 2013", "journal-ref": null, "doi": "10.1145/2508497.2508500", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Citations among research papers, and the networks they form, are the primary\nobject of study in scientometrics. The act of making a citation reflects the\nciter's knowledge of the related literature, and of the work being cited. We\naim to gain insight into this process by studying citation keys: user-chosen\nlabels to identify a cited work. Our main observation is that the first listed\nauthor is disproportionately represented in such labels, implying a strong\nmental bias towards the first author.\n", "versions": [{"version": "v1", "created": "Mon, 7 Oct 2013 22:28:28 GMT"}], "update_date": "2013-10-09", "authors_parsed": [["Cormode", "Graham", ""], ["Muthukrishnan", "S.", ""], ["Yan", "Jinyun", ""]]}, {"id": "1310.2797", "submitter": "Josef Urban", "authors": "Cezary Kaliszyk and Josef Urban", "title": "Lemma Mining over HOL Light", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.DL cs.LG cs.LO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Large formal mathematical libraries consist of millions of atomic inference\nsteps that give rise to a corresponding number of proved statements (lemmas).\nAnalogously to the informal mathematical practice, only a tiny fraction of such\nstatements is named and re-used in later proofs by formal mathematicians. In\nthis work, we suggest and implement criteria defining the estimated usefulness\nof the HOL Light lemmas for proving further theorems. We use these criteria to\nmine the large inference graph of all lemmas in the core HOL Light library,\nadding thousands of the best lemmas to the pool of named statements that can be\nre-used in later proofs. The usefulness of the new lemmas is then evaluated by\ncomparing the performance of automated proving of the core HOL Light theorems\nwith and without such added lemmas.\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2013 12:53:04 GMT"}], "update_date": "2013-10-11", "authors_parsed": [["Kaliszyk", "Cezary", ""], ["Urban", "Josef", ""]]}, {"id": "1310.2805", "submitter": "Josef Urban", "authors": "Cezary Kaliszyk and Josef Urban", "title": "MizAR 40 for Mizar 40", "comments": null, "journal-ref": "J. Automated Reasoning 55(3): 245-256 (2015)", "doi": "10.1007/s10817-015-9330-8", "report-no": null, "categories": "cs.AI cs.DL cs.LG cs.LO cs.MS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As a present to Mizar on its 40th anniversary, we develop an AI/ATP system\nthat in 30 seconds of real time on a 14-CPU machine automatically proves 40% of\nthe theorems in the latest official version of the Mizar Mathematical Library\n(MML). This is a considerable improvement over previous performance of large-\ntheory AI/ATP methods measured on the whole MML. To achieve that, a large suite\nof AI/ATP methods is employed and further developed. We implement the most\nuseful methods efficiently, to scale them to the 150000 formulas in MML. This\nreduces the training times over the corpus to 1-3 seconds, allowing a simple\npractical deployment of the methods in the online automated reasoning service\nfor the Mizar users (MizAR).\n", "versions": [{"version": "v1", "created": "Thu, 10 Oct 2013 13:24:07 GMT"}], "update_date": "2017-04-13", "authors_parsed": [["Kaliszyk", "Cezary", ""], ["Urban", "Josef", ""]]}, {"id": "1310.3370", "submitter": "Max Kemman", "authors": "Max Kemman, Stef Scagliola, Franciska de Jong, Roeland Ordelman", "title": "Talking With Scholars: Developing a Research Environment for Oral\n  History Collections", "comments": "Demo paper for The 2nd International Workshop on Supporting Users\n  Exploration of Digital Libraries (Malta, 26th September, 2013)", "journal-ref": null, "doi": "10.1007/978-3-319-08425-1_22", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Scholars are yet to make optimal use of Oral History collections. For the\nuptake of digital research tools in the daily working practice of researchers,\npractices and conventions commonly adhered to in the subfields in the\nhumanities should be taken into account during development. To this end, in the\nOral History Today project a research tool for exploring Oral History\ncollections is developed in close collaboration with scholarly researchers.\nThis paper describes four stages of scholarly research and the first steps\nundertaken to incorporate requirements of these stages in a digital research\nenvironment.\n", "versions": [{"version": "v1", "created": "Sat, 12 Oct 2013 13:32:17 GMT"}, {"version": "v2", "created": "Fri, 29 Aug 2014 09:39:55 GMT"}], "update_date": "2014-09-01", "authors_parsed": [["Kemman", "Max", ""], ["Scagliola", "Stef", ""], ["de Jong", "Franciska", ""], ["Ordelman", "Roeland", ""]]}, {"id": "1310.3808", "submitter": "Philipp Mayr", "authors": "Howard D. White, Philipp Mayr", "title": "Pennants for Descriptors", "comments": "3 pages, 1 figure, paper presented at the NKOS workshop at TPDL 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a new technique (called pennants) for displaying the descriptors\nrelated to a descriptor across literatures, rather in a thesaurus. It has\ndefinite implications for online searching and browsing. Pennants, named for\nthe flag they resemble, are a form of algorithmic prediction. Their cognitive\nbase is in relevance theory (RT) from linguistic pragmatics (Sperber & Wilson\n1995).\n", "versions": [{"version": "v1", "created": "Mon, 14 Oct 2013 19:49:34 GMT"}], "update_date": "2013-10-15", "authors_parsed": [["White", "Howard D.", ""], ["Mayr", "Philipp", ""]]}, {"id": "1310.4156", "submitter": "Hong Sun", "authors": "Hong Sun, Jos De Roo, Marc Twagirumukiza, Giovanni Mels, Kristof\n  Depraetere, Boris De Vloed, Dirk Colaert", "title": "Validation Rules for Assessing and Improving SKOS Mapping Quality", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Simple Knowledge Organization System (SKOS) is popular for expressing\ncontrolled vocabularies, such as taxonomies, classifications, etc., for their\nuse in Semantic Web applications. Using SKOS, concepts can be linked to other\nconcepts and organized into hierarchies inside a single terminology system.\nMeanwhile, expressing mappings between concepts in different terminology\nsystems is also possible. This paper discusses potential quality issues in\nusing SKOS to express these terminology mappings. Problematic patterns are\ndefined and corresponding rules are developed to automatically detect\nsituations where the mappings either result in 'SKOS Vocabulary Hijacking' to\nthe source vocabularies or cause conflicts. An example of using the rules to\nvalidate sample mappings between two clinical terminologies is given. The\nvalidation rules, expressed in N3 format, are available as open source.\n", "versions": [{"version": "v1", "created": "Tue, 15 Oct 2013 19:28:04 GMT"}], "update_date": "2013-10-21", "authors_parsed": [["Sun", "Hong", ""], ["De Roo", "Jos", ""], ["Twagirumukiza", "Marc", ""], ["Mels", "Giovanni", ""], ["Depraetere", "Kristof", ""], ["De Vloed", "Boris", ""], ["Colaert", "Dirk", ""]]}, {"id": "1310.4900", "submitter": "Akira Otsuki", "authors": "Akira Otsuki and Masayoshi Kawamura", "title": "GV-Index:Scientific Contribution Rating Index That Takes into Account\n  the Growth Degree of Research Area and Variance Values of the Publication\n  Year of Cited Paper", "comments": "11 pages, 9 figures, 8 tables", "journal-ref": "International Journal of Data Mining & Knowledge Management\n  Process (IJDKP) Vol.3, No.5, September 2013", "doi": "10.5121/ijdkp.2013.3501", "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  There are a wide variety of scientific contribution rating indices including\nthe impact factor and h-index. These are used for quantitative analyses on\nresearch papers published in the past, and therefore unable to incorporate in\nthe assessment the growth, or deterioration, of the research area: whether the\nresearch area of a particular paper is in decline or conversely in a growing\ntrend. Other hand, the use of the conventional rating indices may result in\nhigher rates for papers that are hardly referenced nowadays in other papers\nalthough frequently cited in the past. This study proposes a new type of\nscientific contribution ranking index, \"Growing Degree of Research Area and\nVariance Values Index (GV-Index)\". The GV-Index is computed by a principal\ncomponent analysis based on an estimated value obtained by PageRank Algorithm,\nwhich takes into account the growing degree of the research area and its\nvariance. We also propose visualization system of a scientist's network using\nthe GV-Index.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2013 03:38:06 GMT"}], "update_date": "2013-10-21", "authors_parsed": [["Otsuki", "Akira", ""], ["Kawamura", "Masayoshi", ""]]}, {"id": "1310.4904", "submitter": "Akira Otsuki", "authors": "Akira Otsuki", "title": "Dynamic Extraction of Key Paper from the Cluster Using Variance Values\n  of Cited Literature", "comments": "12 pages, 8 figures, 3 tables", "journal-ref": "International Journal of Data Mining & Knowledge Management\n  Process (IJDKP) Vol.3, No.5, September 2013", "doi": "10.5121/ijdkp.2013.3506", "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  When looking into recent research trends in the field of academic landscape,\ncitation network analysis is common and automated clustering of many academic\npapers has been achieved by making good use of various techniques. However,\nspecifying the features of each area identified by automated clustering or\ndynamically extracted key papers in each research area has not yet been\nachieved. In this study, therefore, we propose a method for dynamically\nspecifying the key papers in each area identified by clustering. We will\ninvestigate variance values of the publication year of the cited literature and\ncalculate each cited paper's importance by applying the variance values to the\nPageRank algorithm.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2013 03:43:40 GMT"}], "update_date": "2013-10-21", "authors_parsed": [["Otsuki", "Akira", ""]]}, {"id": "1310.4909", "submitter": "Chinchu Jose", "authors": "M. Sudheep Elayidom, Chinchu Jose, Anitta Puthussery, Neenu K Sasi", "title": "Text Classification For Authorship Attribution Analysis", "comments": "10 pages", "journal-ref": "Advanced Computing: An International Journal (ACIJ), Vol.4, No.5,\n  September 2013", "doi": "10.5121/acij.2013.4501", "report-no": null, "categories": "cs.DL cs.CL cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Authorship attribution mainly deals with undecided authorship of literary\ntexts. Authorship attribution is useful in resolving issues like uncertain\nauthorship, recognize authorship of unknown texts, spot plagiarism so on.\nStatistical methods can be used to set apart the approach of an author\nnumerically. The basic methodologies that are made use in computational\nstylometry are word length, sentence length, vocabulary affluence, frequencies\netc. Each author has an inborn style of writing, which is particular to\nhimself. Statistical quantitative techniques can be used to differentiate the\napproach of an author in a numerical way. The problem can be broken down into\nthree sub problems as author identification, author characterization and\nsimilarity detection. The steps involved are pre-processing, extracting\nfeatures, classification and author identification. For this different\nclassifiers can be used. Here fuzzy learning classifier and SVM are used. After\nauthor identification the SVM was found to have more accuracy than Fuzzy\nclassifier. Later combined the classifiers to obtain a better accuracy when\ncompared to individual SVM and fuzzy classifier.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2013 04:18:09 GMT"}], "update_date": "2013-10-21", "authors_parsed": [["Elayidom", "M. Sudheep", ""], ["Jose", "Chinchu", ""], ["Puthussery", "Anitta", ""], ["Sasi", "Neenu K", ""]]}, {"id": "1310.4966", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff, F\\'elix de Moya-Aneg\\'on, and Vicente P.\n  Guerrero-Bote", "title": "Journal Maps, Interactive Overlays, and the Measurement of\n  Interdisciplinarity on the Basis of Scopus Data (1996-2012)", "comments": "accepted for publication in the Journal of the Association for\n  Information Science and Technology (JASIST)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Using Scopus data, we construct a global map of science based on aggregated\njournal-journal citations from 1996-2012 (N of journals = 20,554). This base\nmap enables users to overlay downloads from Scopus interactively. Using a\nsingle year (e.g., 2012), results can be compared with mappings based on the\nJournal Citation Reports at the Web-of-Science (N = 10,936). The Scopus maps\nare more detailed at both the local and global levels because of their greater\ncoverage, including, for example, the arts and humanities. The base maps can be\ninteractively overlaid with journal distributions in sets downloaded from\nScopus, for example, for the purpose of portfolio analysis. Rao-Stirling\ndiversity can be used as a measure of interdisciplinarity in the sets under\nstudy. Maps at the global and the local level, however, can be very different\nbecause of the different levels of aggregation involved. Two journals, for\nexample, can both belong to the humanities in the global map, but participate\nin different specialty structures locally. The base map and interactive tools\nare available online (with instructions) at\nhttp://www.leydesdorff.net/scopus_ovl.\n", "versions": [{"version": "v1", "created": "Fri, 18 Oct 2013 10:17:30 GMT"}, {"version": "v2", "created": "Mon, 21 Oct 2013 06:00:15 GMT"}, {"version": "v3", "created": "Sun, 12 Jan 2014 19:12:41 GMT"}], "update_date": "2014-01-14", "authors_parsed": [["Leydesdorff", "Loet", ""], ["de Moya-Anegón", "Félix", ""], ["Guerrero-Bote", "Vicente P.", ""]]}, {"id": "1310.5597", "submitter": "Francisco  Couto", "authors": "Francisco M Couto", "title": "CIDS country rankings: comparing documents and citations of USA, UK and\n  China top researchers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This technical report presents a bibliometric analysis of the top 30 cited\nresearchers from USA, UK and China. The analysis is based on Google Scholar\ndata using CIDS. The researchers were identified using their email suffix: edu,\nuk and cn. This na\\\"{i}ve approach was able to produce rankings consistent with\nthe SCImago country rankings using mininal resources in a fully automated way.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2013 15:22:44 GMT"}, {"version": "v2", "created": "Fri, 25 Oct 2013 13:30:44 GMT"}], "update_date": "2013-10-28", "authors_parsed": [["Couto", "Francisco M", ""]]}, {"id": "1310.5624", "submitter": "Young-Ho Eom", "authors": "Klaus M. Frahm and Young-Ho Eom and Dima L. Shepelyansky", "title": "Google matrix of the citation network of Physical Review", "comments": "25 pages. 17 figures. Published in Phys. Rev. E", "journal-ref": "Phys. Rev. E 89, 052814 (2014)", "doi": "10.1103/PhysRevE.89.052814", "report-no": null, "categories": "physics.soc-ph cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the statistical properties of spectrum and eigenstates of the Google\nmatrix of the citation network of Physical Review for the period 1893 - 2009.\nThe main fraction of complex eigenvalues with largest modulus is determined\nnumerically by different methods based on high precision computations with up\nto $p=16384$ binary digits that allows to resolve hard numerical problems for\nsmall eigenvalues. The nearly nilpotent matrix structure allows to obtain a\nsemi-analytical computation of eigenvalues. We find that the spectrum is\ncharacterized by the fractal Weyl law with a fractal dimension $d_f \\approx 1$.\nIt is found that the majority of eigenvectors are located in a localized phase.\nThe statistical distribution of articles in the PageRank-CheiRank plane is\nestablished providing a better understanding of information flows on the\nnetwork. The concept of ImpactRank is proposed to determine an influence domain\nof a given article. We also discuss the properties of random matrix models of\nPerron-Frobenius operators.\n", "versions": [{"version": "v1", "created": "Mon, 21 Oct 2013 16:16:40 GMT"}, {"version": "v2", "created": "Wed, 28 May 2014 16:08:18 GMT"}], "update_date": "2014-05-29", "authors_parsed": [["Frahm", "Klaus M.", ""], ["Eom", "Young-Ho", ""], ["Shepelyansky", "Dima L.", ""]]}, {"id": "1310.5777", "submitter": "Xianwen Wang", "authors": "Xianwen Wang, Lian Peng, Chunbo Zhang, Shenmeng Xu, Zhi Wang, Chuanli\n  Wang and Xianbing Wang", "title": "Exploring Scientists' Working Timetable: A Global Survey", "comments": null, "journal-ref": "Journal of Informetrics. 2013, 7(3):665-675", "doi": "10.1016/j.joi.2013.04.003", "report-no": null, "categories": "cs.DL cs.IR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In our previous study (Wang et al., 2012), we analyzed scientists' working\ntimetable of 3 countries, using realtime downloading data of scientific\nliteratures. In this paper, we make a through analysis about global scientists'\nworking habits. Top 30 countries/territories from Europe, Asia, Australia,\nNorth America, Latin America and Africa are selected as representatives and\nanalyzed in detail. Regional differences for scientists' working habits exists\nin different countries. Besides different working cultures, social factors\ncould affect scientists' research activities and working patterns.\nNevertheless, a common conclusion is that scientists today are often working\novertime. Although scientists may feel engaged and fulfilled about their hard\nworking, working too much still warns us to reconsider the work - life balance.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2013 02:00:01 GMT"}], "update_date": "2013-10-23", "authors_parsed": [["Wang", "Xianwen", ""], ["Peng", "Lian", ""], ["Zhang", "Chunbo", ""], ["Xu", "Shenmeng", ""], ["Wang", "Zhi", ""], ["Wang", "Chuanli", ""], ["Wang", "Xianbing", ""]]}, {"id": "1310.5812", "submitter": "Enrique Ordu\\~na-Malea", "authors": "Enrique Ordu\\~na-Malea and John J. Regazzi", "title": "U.S. academic libraries: understanding their web presence and their\n  relationship with economic indicators", "comments": null, "journal-ref": null, "doi": "10.1007/s11192-013-1001-0", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The main goal of this research is to analyze the web structure and\nperformance of units and services belonging to U.S. academic libraries in order\nto check their suitability for webometric studies. Our objectives include\nstudying their possible correlation with economic data and assessing their use\nfor complementary evaluation purposes. We conducted a survey of library\nhomepages, institutional repositories, digital collections, and online catalogs\n(a total of 374 URLs) belonging to the 100 U.S. universities with the highest\ntotal expenditures in academic libraries according to data provided by the\nNational Center for Education Statistics (NCES). Several data points were taken\nand analyzed, including web variables (page count, external links, and visits)\nand economic variables (total expenditures, expenditures on printed and\nelectronic books, and physical visits). The results indicate that the variety\nof URL syntaxes is wide, diverse and complex, which produces a\nmisrepresentation of academic library web resources and reduces the accuracy of\nweb analysis. On the other hand, institutional and web data indicators are not\nhighly correlated. Better results are obtained by correlating total library\nexpenditures with URL mentions measured by Google (r= 0.546) and visits\nmeasured by Compete (r= 0.573), respectively. Because correlation values\nobtained are not highly significant, we estimate such correlations will\nincrease if users can avoid linkage problems (due to the complexity of URLs)\nand gain direct access to log files (for more accurate data about visits).\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2013 06:49:53 GMT"}], "update_date": "2013-10-23", "authors_parsed": [["Orduña-Malea", "Enrique", ""], ["Regazzi", "John J.", ""]]}, {"id": "1310.5814", "submitter": "Enrique Ordu\\~na-Malea", "authors": "Enrique Ordu\\~na-Malea", "title": "Aggregation of the web performance of internal university units as a\n  method of quantitative analysis of a university system: the case of Spain", "comments": null, "journal-ref": "JASIST, 64(10), 2100-2114", "doi": "10.1002/asi.22912", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The aggregation of web performance (page count and visibility) of internal\nuniversity units could constitute a more precise indicator than the overall web\nperformance of the universities and, therefore, be of use in the design of\nuniversity web rankings. In order to test this hypothesis, a longitudinal\nanalysis of the internal units of the Spanish university system was conducted\nover the course of 2010. For the 13800 URLs identified, page count and\nvisibility was calculated using the Yahoo API. The internal values obtained\nwere aggregated by university and compared with the values obtained from the\nanalysis of the university general URLs. The results indicate that, although\nthe correlations between general and internal values are high, internal\nperformance is low in comparison to general performance, and that they give\nrise to different performance rankings. The conclusion is that the aggregation\nof unit performance is of limited use due to the low levels of internal\ndevelopment of the websites, and so its use is not recommended for the design\nof rankings. Despite this, the internal analysis enabled the detection of,\namongst other things, a low correlation between page count and visibility due\nto the widespread use of subdirectories and problems accessing certain content.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2013 06:56:07 GMT"}], "update_date": "2013-10-23", "authors_parsed": [["Orduña-Malea", "Enrique", ""]]}, {"id": "1310.5815", "submitter": "Enrique Ordu\\~na-Malea", "authors": "Enrique Orduna-Malea and Jose-Antonio Ontalba-Ruiperez", "title": "Selective linking from social platforms to university websites: a case\n  study of the Spanish academic system", "comments": null, "journal-ref": "Scientometrics Vol. 95, Issue 2, pp. 594-614 (2013)", "doi": "10.1007/s11192-012-0851-1", "report-no": null, "categories": "cs.DL cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mention indicators have frequently been used in Webometric studies because\nthey provide a powerful tool for determining the degree of visibility and\nimpact of web resources. Among mention indicators, hypertextual links were a\ncentral part of many studies until Yahoo discontinued the linkdomain command in\n2011. Selective links constitute a variant of external links where both the\nsource and target of the link can be selected. This paper intends to study the\ninfluence of social platforms (measured through the number of selective\nexternal links) on academic environments, in order to ascertain both the\npercentage that they constitute and whether some of them can be used as\nsubstitutes of total external links. For this purpose, 141 URLs belonging to 76\nSpanish universities were compiled in 2010 (before Yahoo! stopped their link\nservices), and the number of links from 13 selected social platforms to these\nuniversities were calculated. Results confirm a good correlation between total\nexternal links and links that come from social platforms, with the exception of\nsome applications (such as Digg and Technorati). For those universities with a\nhigher number of total external links, the high correlation is only maintained\non Delicious and Wikipedia, which can be utilized as substitutes of total\nexternal links in the context analyzed. Notwithstanding, the global percentage\nof links from social platforms constitute only a small fraction of total links,\nalthough a positive trend is detected, especially in services such as Twitter,\nYoutube, and Facebook.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2013 06:58:30 GMT"}], "update_date": "2013-10-23", "authors_parsed": [["Orduna-Malea", "Enrique", ""], ["Ontalba-Ruiperez", "Jose-Antonio", ""]]}, {"id": "1310.5816", "submitter": "Enrique Ordu\\~na-Malea", "authors": "Enrique Ordu\\~na-Malea and Jos\\'e-Antonio Ontalba-Ruip\\'erez", "title": "Proposal for a multilevel university cybermetric analysis model", "comments": null, "journal-ref": "Scientometrics, v. 95(3), pp.863-884", "doi": "10.1007/s11192-012-0868-5", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  University online seats have gradually become complex systems of dynamic\ninformation where all their institutions and services are linked and\npotentially accessible. These online seats now constitute a central node around\nwhich universities construct and document their main activities and services.\nThis information can be quantitative measured by cybermetric techniques in\norder to design university web rankings, taking the university as a global\nreference unit. However, previous research into web subunits shows that it is\npossible to carry out systemic web analyses, which open up the possibility of\ncarrying out studies which address university diversity, necessary for both\ndescribing the university in greater detail and for establishing comparable\nranking units. To address this issue, a multilevel university cybermetric\nanalysis model is proposed, based on parts (core and satellite), levels\n(institutional and external) and sublevels (contour and internal), providing a\ndeeper analysis of institutions. Finally the model is integrated into another\nwhich is independent of the technique used, and applied by analysing Harvard\nUniversity as an example of use.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2013 07:03:02 GMT"}], "update_date": "2013-10-23", "authors_parsed": [["Orduña-Malea", "Enrique", ""], ["Ontalba-Ruipérez", "José-Antonio", ""]]}, {"id": "1310.5892", "submitter": "Nicolas Robinson-Garcia", "authors": "Nicolas Robinson-Garcia and Clara Calero-Medina", "title": "What do university rankings by fields rank? Exploring discrepancies\n  between the organizational structure of universities and bibliometric\n  classifications", "comments": "Paper published in Scientometrics", "journal-ref": null, "doi": "10.1007/s11192-013-1157-7", "report-no": null, "categories": "cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  University rankings by fields are usually based on the research output of\nuniversities. However, research managers and rankings consumers expect to see\nin such fields a reflection of the structure of their own organizational\ninstitution. In this study we address such misinterpretation by developing the\nresearch profile of the organizational units of two Spanish universities:\nUniversity of Granada and Pompeu Fabra University. We use two classification\nsystems, the subject categories offered by Thomson Scientific which are\ncommonly used on bibliometric studies, and the 37 disciplines displayed by the\nSpanish I-UGR Rankings which are constructed from an aggregation of the former.\nWe also describe in detail problems encountered when working with address data\nfrom a top down approach and we show differences between universities\nstructures derived from the interdisciplinary organizational forms of new\nmanagerialism at universities. We conclude by highlighting that rankings by\nfields should clearly state the methodology for the construction of such\nfields. We indicate that the construction of research profiles may be a good\nsolution for universities for finding out levels of discrepancy between\norganizational units and subject fields.\n", "versions": [{"version": "v1", "created": "Tue, 22 Oct 2013 12:33:32 GMT"}], "update_date": "2013-10-23", "authors_parsed": [["Robinson-Garcia", "Nicolas", ""], ["Calero-Medina", "Clara", ""]]}, {"id": "1310.6162", "submitter": "Delgado Lopez-Cozar emilio", "authors": "Enrique Orduna-Malea and Emilio Delgado Lopez-Cozar", "title": "Google Scholar Metrics evolution: an analysis according to languages", "comments": "14 pages, 4 figures, 7 tables, This paper has been accepted for\n  publication in the Scientometrics", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  In November 2012 the Google Scholar Metrics (GSM) journal rankings were\nupdated, making it possible to compare bibliometric indicators in the 10\nlanguages indexed and their stability with the April 2012 version. The h-index\nand h 5 median of 1000 journals were analysed, comparing their averages,\nmaximum and minimum values and the correlation coefficient within rankings. The\nbibliometric figures grew significantly. In just seven and a half months the h\nindex of the journals increased by 15% and the median h-index by 17%. This\ngrowth was observed for all the bibliometric indicators analysed and for\npractically every journal. However, we found significant differences in growth\nrates depending on the language in which the journal is published. Moreover,\nthe journal rankings seem to be stable between April and November, reinforcing\nthe credibility of the data held by Google Scholar and the reliability of the\nGSM journal rankings, despite the uncontrolled growth of Google Scholar. Based\non the findings of this study we suggest, firstly, that Google should upgrade\nits rankings at least semiannually and, secondly, that the results should be\ndisplayed in each ranking proportionally to the number of journals indexed by\nlanguage\n", "versions": [{"version": "v1", "created": "Wed, 23 Oct 2013 09:30:11 GMT"}], "update_date": "2013-10-24", "authors_parsed": [["Orduna-Malea", "Enrique", ""], ["Lopez-Cozar", "Emilio Delgado", ""]]}, {"id": "1310.6555", "submitter": "Stian Soiland-Reyes", "authors": "Paolo Ciccarese, Stian Soiland-Reyes, Tim Clark", "title": "Web Annotation as a First Class Object", "comments": "This is authors' Accepted version as of 2013-08-09, reformatted as\n  HTML with Linked Data. For the final, published version, see IEEE Explore:\n  http://ieeexplore.ieee.org/xpl/articleDetails.jsp?arnumber=6682930", "journal-ref": "IEEE Internet Computing 2013; 17(6) 71-75", "doi": "10.1109/MIC.2013.123", "report-no": "uk-ac-man-scw:211608", "categories": "cs.DL cs.IR", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Scholars have made handwritten notes and comments in books and manuscripts\nfor centuries. Today's blogs and news sites typically invite users to express\ntheir opinions on the published content; URLs allow web resources to be shared\nwith accompanying annotations and comments using third-party services like\nTwitter or Facebook. These contributions have until recently been constrained\nwithin specific services, making them second-class citizens of the Web.\n  Web Annotations are now emerging as fully independent Linked Data in their\nown right, no longer restricted to plain textual comments in application silos.\nAnnotations can now range from bookmarks and comments, to fine-grained\nannotations of a selection of, for example, a section of a frame within a video\nstream. Technologies and standards now exist to create, publish, syndicate,\nmash-up and consume, finely targeted, semantically rich digital annotations on\npractically any content, as first-class Web citizens. This development is being\ndriven by the need for collaboration and annotation reuse amongst domain\nresearchers, computer scientists, scientific publishers, and scholarly content\ndatabases.\n", "versions": [{"version": "v1", "created": "Thu, 24 Oct 2013 10:40:14 GMT"}, {"version": "v2", "created": "Wed, 8 Jan 2014 13:54:11 GMT"}, {"version": "v3", "created": "Wed, 20 Mar 2019 02:02:00 GMT"}], "update_date": "2019-03-21", "authors_parsed": [["Ciccarese", "Paolo", ""], ["Soiland-Reyes", "Stian", ""], ["Clark", "Tim", ""]]}, {"id": "1310.7378", "submitter": "Delgado Lopez-Cozar emilio", "authors": "Rafael Repiso and Emilio Delgado Lopez-Cozar", "title": "H Index Communication Journals according to Google Scholar Metrics\n  (2008-2012)", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  The aim of this report is to present a ranking of Communication journals\ncovered in Google Scholar Metrics for the period 2008-2012. It corresponds to\nthe H Index update made last year for the period 2007-2011 (Delgado\nL\\'opez-C\\'ozar and Repiso 2013). Google Scholar Metrics doesnt currently allow\nto group and sort all journals belonging to a scientific discipline. In the\ncase of Communication, in the ten listings displayed by GSM we can only locate\n46 journals. Therefore, in an attempt to overcome this limitation, we have used\nthe diversity of search procedures allowed by GSM to identify the greatest\nnumber of scientific journals of Communication with H Index calculated by this\nbibliometric tool. The result is a ranking of 354 communication journals sorted\nby the same H Index, and mean as discriminating value. Journals are also\ngrouped by quartiles.\n", "versions": [{"version": "v1", "created": "Mon, 28 Oct 2013 11:19:11 GMT"}], "update_date": "2013-10-29", "authors_parsed": [["Repiso", "Rafael", ""], ["Lopez-Cozar", "Emilio Delgado", ""]]}, {"id": "1310.8220", "submitter": "Mark Newman", "authors": "M. E. J. Newman", "title": "Prediction of highly cited papers", "comments": "6 pages, 3 figures, 2 tables", "journal-ref": "Europhys. Lett. 105, 28002 (2014)", "doi": "10.1209/0295-5075/105/28002", "report-no": null, "categories": "physics.soc-ph cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In an article written five years ago [arXiv:0809.0522], we described a method\nfor predicting which scientific papers will be highly cited in the future, even\nif they are currently not highly cited. Applying the method to real citation\ndata we made predictions about papers we believed would end up being well\ncited. Here we revisit those predictions, five years on, to see how well we\ndid. Among the over 2000 papers in our original data set, we examine the fifty\nthat, by the measures of our previous study, were predicted to do best and we\nfind that they have indeed received substantially more citations in the\nintervening years than other papers, even after controlling for the number of\nprior citations. On average these top fifty papers have received 23 times as\nmany citations in the last five years as the average paper in the data set as a\nwhole, and 15 times as many as the average paper in a randomly drawn control\ngroup that started out with the same number of citations. Applying our\nprediction technique to current data, we also make new predictions of papers\nthat we believe will be well cited in the next few years.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2013 16:28:10 GMT"}], "update_date": "2014-02-06", "authors_parsed": [["Newman", "M. E. J.", ""]]}, {"id": "1310.8224", "submitter": "James Clough", "authors": "James R. Clough, Jamie Gollings, Tamar V. Loach, Tim S. Evans", "title": "Transitive Reduction of Citation Networks", "comments": "17 pages, 13 figures, data available", "journal-ref": "Journal of Complex Networks 3 (2015) 189-203", "doi": "10.1093/comnet/cnu039", "report-no": "Imperial/TP/13/TSE/3", "categories": "physics.soc-ph cs.DL cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In many complex networks the vertices are ordered in time, and edges\nrepresent causal connections. We propose methods of analysing such directed\nacyclic graphs taking into account the constraints of causality and\nhighlighting the causal structure. We illustrate our approach using citation\nnetworks formed from academic papers, patents, and US Supreme Court verdicts.\nWe show how transitive reduction reveals fundamental differences in the\ncitation practices of different areas, how it highlights particularly\ninteresting work, and how it can correct for the effect that the age of a\ndocument has on its citation count. Finally, we transitively reduce null models\nof citation networks with similar degree distributions and show the difference\nin degree distributions after transitive reduction to illustrate the lack of\ncausal structure in such models.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2013 16:32:45 GMT"}, {"version": "v2", "created": "Thu, 27 Mar 2014 19:46:17 GMT"}], "update_date": "2015-07-07", "authors_parsed": [["Clough", "James R.", ""], ["Gollings", "Jamie", ""], ["Loach", "Tamar V.", ""], ["Evans", "Tim S.", ""]]}, {"id": "1310.8226", "submitter": "Philipp Mayr", "authors": "Philipp Mayr, Andrea Scharnhorst, Birger Larsen, Philipp Schaer, Peter\n  Mutschke", "title": "Bibliometric-enhanced Information Retrieval", "comments": "6 pages, accepted workshop proposal for ECIR 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Bibliometric techniques are not yet widely used to enhance retrieval\nprocesses in digital libraries, although they offer value-added effects for\nusers. In this workshop we will explore how statistical modelling of\nscholarship, such as Bradfordizing or network analysis of coauthorship network,\ncan improve retrieval services for specific communities, as well as for large,\ncross-domain collections. This workshop aims to raise awareness of the missing\nlink between information retrieval (IR) and bibliometrics/scientometrics and to\ncreate a common ground for the incorporation of bibliometric-enhanced services\ninto retrieval at the digital library interface.\n", "versions": [{"version": "v1", "created": "Wed, 30 Oct 2013 16:38:03 GMT"}], "update_date": "2014-01-19", "authors_parsed": [["Mayr", "Philipp", ""], ["Scharnhorst", "Andrea", ""], ["Larsen", "Birger", ""], ["Schaer", "Philipp", ""], ["Mutschke", "Peter", ""]]}, {"id": "1310.8508", "submitter": "Taha Yasseri", "authors": "Anna Samoilenko and Taha Yasseri", "title": "The distorted mirror of Wikipedia: a quantitative analysis of Wikipedia\n  coverage of academics", "comments": "To appear in EPJ Data Science. To have the Additional Files and\n  Datasets e-mail the corresponding author", "journal-ref": "EPJ Data Science 2014, 3:1", "doi": "10.1140/epjds20", "report-no": null, "categories": "physics.soc-ph cs.CY cs.DL cs.SI physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Activity of modern scholarship creates online footprints galore. Along with\ntraditional metrics of research quality, such as citation counts, online images\nof researchers and institutions increasingly matter in evaluating academic\nimpact, decisions about grant allocation, and promotion. We examined 400\nbiographical Wikipedia articles on academics from four scientific fields to\ntest if being featured in the world's largest online encyclopedia is correlated\nwith higher academic notability (assessed through citation counts). We found no\nstatistically significant correlation between Wikipedia articles metrics\n(length, number of edits, number of incoming links from other articles, etc.)\nand academic notability of the mentioned researchers. We also did not find any\nevidence that the scientists with better WP representation are necessarily more\nprominent in their fields. In addition, we inspected the Wikipedia coverage of\nnotable scientists sampled from Thomson Reuters list of \"highly cited\nresearchers\". In each of the examined fields, Wikipedia failed in covering\nnotable scholars properly. Both findings imply that Wikipedia might be\nproducing an inaccurate image of academics on the front end of science. By\nshedding light on how public perception of academic progress is formed, this\nstudy alerts that a subjective element might have been introduced into the\nhitherto structured system of academic evaluation.\n", "versions": [{"version": "v1", "created": "Thu, 31 Oct 2013 14:07:35 GMT"}, {"version": "v2", "created": "Tue, 10 Dec 2013 15:11:32 GMT"}], "update_date": "2014-01-23", "authors_parsed": [["Samoilenko", "Anna", ""], ["Yasseri", "Taha", ""]]}]