[{"id": "1604.00060", "submitter": "Saber Mirzaei", "authors": "Saber Mirzaei, Sanaz Bahargam, Richard Skowyra, Assaf Kfoury and Azer\n  Bestavros", "title": "Using Alloy to Formally Model and Reason About an OpenFlow Network\n  Switch", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.FL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Openflow provides a standard interface for separating a network into a data\nplane and a programmatic control plane. This enables easy network\nreconfiguration, but introduces the potential for programming bugs to cause\nnetwork effects. To study OpenFlow switch behavior, we used Alloy to create a\nsoftware abstraction describing the internal state of a network and its\nOpenFlow switches. This work is an attempt to model the static and dynamic\nbehaviour a network built using OpenFlow switches.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2016 21:40:52 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Mirzaei", "Saber", ""], ["Bahargam", "Sanaz", ""], ["Skowyra", "Richard", ""], ["Kfoury", "Assaf", ""], ["Bestavros", "Azer", ""]]}, {"id": "1604.00074", "submitter": "Bruno Clerckx", "authors": "Bruno Clerckx and Ekaterina Bayguzina", "title": "Waveform Design for Wireless Power Transfer", "comments": "Accepted for publication in IEEE Trans. on Signal Processing", "journal-ref": null, "doi": "10.1109/TSP.2016.2601284", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Far-field Wireless Power Transfer (WPT) has attracted significant attention\nin recent years. Despite the rapid progress, the emphasis of the research\ncommunity in the last decade has remained largely concentrated on improving the\ndesign of energy harvester (so-called rectenna) and has left aside the effect\nof transmitter design. In this paper, we study the design of transmit waveform\nso as to enhance the DC power at the output of the rectenna. We derive a\ntractable model of the non-linearity of the rectenna and compare with a linear\nmodel conventionally used in the literature. We then use those models to design\nnovel multisine waveforms that are adaptive to the channel state information\n(CSI). Interestingly, while the linear model favours narrowband transmission\nwith all the power allocated to a single frequency, the non-linear model\nfavours a power allocation over multiple frequencies. Through realistic\nsimulations, waveforms designed based on the non-linear model are shown to\nprovide significant gains (in terms of harvested DC power) over those designed\nbased on the linear model and over non-adaptive waveforms. We also compute\nanalytically the theoretical scaling laws of the harvested energy for various\nwaveforms as a function of the number of sinewaves and transmit antennas. Those\nscaling laws highlight the benefits of CSI knowledge at the transmitter in WPT\nand of a WPT design based on a non-linear rectenna model over a linear model.\nResults also motivate the study of a promising architecture relying on\nlarge-scale multisine multi-antenna waveforms for WPT. As a final note, results\nstress the importance of modeling and accounting for the non-linearity of the\nrectenna in any system design involving wireless power.\n", "versions": [{"version": "v1", "created": "Thu, 31 Mar 2016 23:00:57 GMT"}, {"version": "v2", "created": "Tue, 9 Aug 2016 07:52:33 GMT"}], "update_date": "2016-11-03", "authors_parsed": [["Clerckx", "Bruno", ""], ["Bayguzina", "Ekaterina", ""]]}, {"id": "1604.00178", "submitter": "Mehmet Karaca", "authors": "Mehmet Karaca and Bjorn Landfeldt", "title": "Approaching Optimal Centralized Scheduling with CSMA-based Random Access\n  over Fading Channels", "comments": "accepted to IEEE Communications Letters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Carrier Sense Multiple Access (CSMA) based distributed algorithms can attain\nthe largest capacity region as the centralized Max-Weight policy does. Despite\ntheir capability of achieving throughput-optimality, these algorithms can\neither incur large delay and have large complexity or only operate over\nnon-fading channels. In this letter, by assuming arbitrary back-off time we\nfirst propose a fully distributed randomized algorithm whose performance can be\npushed to the performance of the centralized Max-Weight policy not only in\nterms of throughput but also in terms of delay for completely-connected\ninterference networks with fading channels. Then, inspired by the proposed\nalgorithm we introduce an implementable distributed algorithm for practical\nnetworks with a reservation scheme. We show that the proposed practical\nalgorithm can still achieve the performance of the centralized Max-Weight\npolicy.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 09:45:11 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Karaca", "Mehmet", ""], ["Landfeldt", "Bjorn", ""]]}, {"id": "1604.00204", "submitter": "Cornelius Diekmann", "authors": "Cornelius Diekmann, Stephan-A. Posselt, Heiko Niedermayer, Holger\n  Kinkelin, Oliver Hanka, Georg Carle", "title": "Verifying Security Policies using Host Attributes", "comments": "In FORTE - 34th IFIP International Conference on Formal Techniques\n  for Distributed Objects, Components and Systems, Berlin, Germany, June 2014", "journal-ref": "Formal Techniques for Distributed Objects, Components, and Systems\n  Volume 8461 of the series Lecture Notes in Computer Science, 2014, Springer", "doi": "10.1007/978-3-662-43613-4_9", "report-no": null, "categories": "cs.CR cs.NI cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  For the formal verification of a network security policy, it is crucial to\nexpress the verification goals. These formal goals, called security invariants,\nshould be easy to express for the end user. Focusing on access control and\ninformation flow security strategies, this work discovers and proves universal\ninsights about security invariants. This enables secure and convenient\nauto-completion of host attribute configurations. We demonstrate our results in\na civil aviation scenario. All results are machine-verified with the\nIsabelle/HOL theorem prover.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 11:08:26 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Diekmann", "Cornelius", ""], ["Posselt", "Stephan-A.", ""], ["Niedermayer", "Heiko", ""], ["Kinkelin", "Holger", ""], ["Hanka", "Oliver", ""], ["Carle", "Georg", ""]]}, {"id": "1604.00206", "submitter": "Cornelius Diekmann", "authors": "Cornelius Diekmann, Lars Hupel, Georg Carle", "title": "Semantics-Preserving Simplification of Real-World Firewall Rule Sets", "comments": "In 20th International Symposium on Formal Methods, June 2015", "journal-ref": "FM 2015: Formal Methods Volume 9109 of the series Lecture Notes in\n  Computer Science pp 195-212, Springer", "doi": "10.1007/978-3-319-19249-9_13", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The security provided by a firewall for a computer network almost completely\ndepends on the rules it enforces. For over a decade, it has been a well-known\nand unsolved problem that the quality of many firewall rule sets is\ninsufficient. Therefore, there are many tools to analyze them. However, we\nfound that none of the available tools could handle typical, real-world\niptables rulesets. This is due to the complex chain model used by iptables, but\nalso to the vast amount of possible match conditions that occur in real-world\nfirewalls, many of which are not understood by academic and open source tools.\n  In this paper, we provide algorithms to transform firewall rulesets. We\nreduce the execution model to a simple list model and use ternary logic to\nabstract over all unknown match conditions. These transformations enable\nexisting tools to understand real-world firewall rules, which we demonstrate on\nfour decently-sized rulesets. %After preparation with our algorithms, tools\ncould understand them. Using the Isabelle theorem prover, we formally show that\nall our algorithms preserve the firewall's filtering behavior.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 11:37:26 GMT"}], "update_date": "2016-04-06", "authors_parsed": [["Diekmann", "Cornelius", ""], ["Hupel", "Lars", ""], ["Carle", "Georg", ""]]}, {"id": "1604.00273", "submitter": "Cornelius Diekmann", "authors": "Cornelius Diekmann, Andreas Korsten, Georg Carle", "title": "Demonstrating topoS: Theorem-Prover-Based Synthesis of Secure Network\n  Configurations", "comments": "In 2nd International Workshop on Management of SDN and NFV Systems,\n  manSDN/NFV, Barcelona, Spain, November 2015", "journal-ref": null, "doi": "10.1109/CNSM.2015.7367384", "report-no": null, "categories": "cs.NI cs.CR cs.SE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In network management, when it comes to security breaches, human error\nconstitutes a dominant factor. We present our tool topoS which automatically\nsynthesizes low-level network configurations from high-level security goals.\nThe automation and a feedback loop help to prevent human errors. Except for a\nlast serialization step, topoS is formally verified with Isabelle/HOL, which\nprevents implementation errors. In a case study, we demonstrate topoS by\nexample. For the first time, the complete transition from high-level security\ngoals to both firewall and SDN configurations is presented.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 15:02:28 GMT"}], "update_date": "2016-04-04", "authors_parsed": [["Diekmann", "Cornelius", ""], ["Korsten", "Andreas", ""], ["Carle", "Georg", ""]]}, {"id": "1604.00381", "submitter": "Irem Bor Yaliniz", "authors": "Irem Bor-Yaliniz, Halim Yanikomeroglu", "title": "The New Frontier in RAN Heterogeneity: Multi-tier Drone-Cells", "comments": "Accepted for publication in IEEE Communications Magazine Special\n  Issue on 5G Radio Access Network Architecture and Technologies (November\n  2016)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In cellular networks, the locations of the radio access network (RAN)\nelements are determined mainly based on the long-term traffic behaviour.\nHowever, when the random and hard-to-predict spatio-temporal distribution of\nthe traffic (load,demand) does not fully match the fixed locations of the RAN\nelements (supply), some performance degradation becomes inevitable. The concept\nof multi-tier cells (heterogeneous networks, HetNets) has been introduced in 4G\nnetworks to alleviate this mismatch. However, as the traffic distribution\ndeviates more and more from the long-term average, even the HetNet architecture\nwill have difficulty in coping up with the erratic supply-demand mismatch,\nunless the RAN is grossly over-engineered (which is a financially non-viable\nsolution). In this article, we study the opportunistic utilization of\nlow-altitude unmanned aerial platforms equipped with base stations (BSs), i.e.,\ndrone-BSs, in 5G networks. In particular, we envisage a multi-tier drone-cell\nnetwork complementing the terrestrial HetNets. The variety of equipment, and\nnon-rigid placement options allow utilizing multitier drone-cell networks to\nserve diversified demands. Hence, drone-cells bring the supply to where the\ndemand is, which sets new frontiers for the heterogeneity in 5G networks. We\ninvestigate the advancements promised by drone-cells, and discuss the\nchallenges associated with their operation and management. We propose a\ndrone-cell management framework (DMF) benefiting from the synergy among\nsoftware defined networking (SDN), network functions virtualization (NFV), and\ncloud-computing. We demonstrate DMF mechanisms via a case study, and\nnumerically show that it can reduce the cost of utilizing drone-cells in\nmultitenancy cellular networks.\n", "versions": [{"version": "v1", "created": "Fri, 1 Apr 2016 19:46:15 GMT"}, {"version": "v2", "created": "Fri, 13 May 2016 03:12:35 GMT"}, {"version": "v3", "created": "Fri, 22 Jul 2016 09:28:33 GMT"}], "update_date": "2016-07-25", "authors_parsed": [["Bor-Yaliniz", "Irem", ""], ["Yanikomeroglu", "Halim", ""]]}, {"id": "1604.00389", "submitter": "Ayush Shah", "authors": "Ayush Shah, Ambar Pal, H. B. Acharya", "title": "The Internet of Things: Perspectives on Security from RFID and WSN", "comments": "Survey on pre-existing security issues that carry over into the\n  Internet of Things", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A massive current research effort focuses on combining pre-existing\n'Intranets' of Things into one Internet of Things. However, this unification is\nnot a panacea; it will expose new attack surfaces and vectors, just as it\nenables new applications. We therefore urgently need a model of security in the\nInternet of Things. In this regard, we note that IoT descends directly from\npre-existing research (in embedded Internet and pervasive intelligence), so\nthere exist several bodies of related work: security in RFID, sensor networks,\ncyber-physical systems, and so on. In this paper, we survey the existing\nliterature on RFID and WSN security, as a step to compiling all known attacks\nand defenses relevant to the Internet of Things.\n", "versions": [{"version": "v1", "created": "Sun, 3 Apr 2016 19:20:16 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Shah", "Ayush", ""], ["Pal", "Ambar", ""], ["Acharya", "H. B.", ""]]}, {"id": "1604.00446", "submitter": "Abhishek  Sinha", "authors": "Abhishek Sinha, Georgios Paschos, Eytan Modiano", "title": "Throughput-Optimal Multi-hop Broadcast Algorithms", "comments": "To appear in the proceedings of Mobihoc, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DS cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we design throughput-optimal dynamic broad- cast algorithms for\nmulti-hop networks with arbitrary topolo- gies. Most of the previous broadcast\nalgorithms route pack- ets along spanning trees, rooted at the source node. For\nlarge dynamic networks, computing and maintaining a set of spanning trees is\nnot efficient, as the network-topology may change frequently. In this paper we\ndesign a class of dynamic algorithms which makes packet-by-packet schedul- ing\nand routing decisions and thus obviates the need for maintaining any global\ntopological structures, such as span- ning trees. Our algorithms may be\nconveniently understood as a non-trivial generalization of the familiar\nback-pressure algorithm which makes unicast packet routing and schedul- ing\ndecisions, based on queue-length information, without maintaining end-to-end\npaths. However, in the broadcast problem, it is hard to define queuing\nstructures due to ab- sence of a work-conservation principle which results from\npacket duplications. We design and prove the optimality of a virtual-queue\nbased algorithm, where a virtual-queue is de- fined for subsets of vertices. We\nthen propose a multi-class broadcast policy which combines the above scheduling\nalgo- rithm with a class-based in-order packet delivery constraint, resulting\nin significant reduction in complexity. Finally, we evaluate performance of the\nproposed algorithms via exten- sive numerical simulations.\n", "versions": [{"version": "v1", "created": "Sat, 2 Apr 2016 00:54:11 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Sinha", "Abhishek", ""], ["Paschos", "Georgios", ""], ["Modiano", "Eytan", ""]]}, {"id": "1604.00513", "submitter": "Fabio D'Andreagiovanni", "authors": "Fabio D'Andreagiovanni, Ambros Gleixner", "title": "Towards an accurate solution of wireless network design problems", "comments": "This is the authors' final version of the paper published in: R.\n  Cerulli, S. Fujishige, A.R. Mahjoub (Eds.), Combinatorial Optimization - 4th\n  International Symposium, ISCO 2016, LNCS 9849, pp. 135-147, 2016, DOI:\n  10.1007/978-3-319-45587-7_12. The final publication is available at Springer\n  via http://dx.doi.org/10.1007/978-3-319-45587-7_12", "journal-ref": "Combinatorial Optimization - ISCO 2016, Springer LNCS volume 9849\n  (2016) 135-147", "doi": "10.1007/978-3-319-45587-7_12", "report-no": null, "categories": "math.OC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The optimal design of wireless networks has been widely studied in the\nliterature and many optimization models have been proposed over the years.\nHowever, most models directly include the signal-to-interference ratios\nrepresenting service coverage conditions. This leads to mixed-integer linear\nprograms with constraint matrices containing tiny coefficients that vary widely\nin their order of magnitude. These formulations are known to be challenging\neven for state-of-the-art solvers: the standard numerical precision supported\nby these solvers is usually not sufficient to reliably guarantee feasible\nsolutions. Service coverage errors are thus commonly present. Though these\nnumerical issues are known and become evident even for small-sized instances,\njust a very limited number of papers has tried to tackle them, by mainly\ninvestigating alternative non-compact formulations in which the sources of\nnumerical instabilities are eliminated. In this work, we explore a new approach\nby investigating how recent advances in exact solution algorithms for linear\nand mixed-integer programs over the rational numbers can be applied to analyze\nand tackle the numerical difficulties arising in wireless network design\nmodels.\n", "versions": [{"version": "v1", "created": "Sat, 2 Apr 2016 15:06:44 GMT"}, {"version": "v2", "created": "Thu, 27 Apr 2017 21:28:07 GMT"}], "update_date": "2017-05-01", "authors_parsed": [["D'Andreagiovanni", "Fabio", ""], ["Gleixner", "Ambros", ""]]}, {"id": "1604.00557", "submitter": "Mukhtiar Ali Unar", "authors": "Muhammad Saleh Shah, Asim Imdad Wagan, Mukhtiar Ali Unar", "title": "SAM: Support Vector Machine Based Active Queue Management", "comments": "8 pages, Mehran University Research Journal of Engineering and\n  Technology, Vol 33, No.1, January 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LG", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Recent years have seen an increasing interest in the design of AQM (Active\nQueue Management) controllers. The purpose of these controllers is to manage\nthe network congestion under varying loads, link delays and bandwidth. In this\npaper, a new AQM controller is proposed which is trained by using the SVM\n(Support Vector Machine) with the RBF (Radial Basis Function) kernal. The\nproposed controller is called the support vector based AQM (SAM) controller.\nThe performance of the proposed controller has been compared with three\nconventional AQM controllers, namely the Random Early Detection, Blue and\nProportional Plus Integral Controller. The preliminary simulation studies show\nthat the performance of the proposed controller is comparable to the\nconventional controllers. However, the proposed controller is more efficient in\ncontrolling the queue size than the conventional controllers.\n", "versions": [{"version": "v1", "created": "Sat, 2 Apr 2016 20:47:51 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Shah", "Muhammad Saleh", ""], ["Wagan", "Asim Imdad", ""], ["Unar", "Mukhtiar Ali", ""]]}, {"id": "1604.00565", "submitter": "Suresh Dahiya", "authors": "Suresh Dahiya", "title": "A Statistical Block Fading Channel Model for Multiuser Massive MIMO\n  System", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a statistical block fading channel model for multiuser\nmassive MIMO system. The proposed channel model is evolved from correlation\nbased stochastic channel model (CBSCM) but in addition to the properties of\nCBSCM, it has capability of capturing channel variations along time or\nfrequency and along space simultaneously. It has a simplified analytical\nexpression, still being able to simulate underlying physical phenomena which\notherwise need a complex geometry based stochastic channel model (GBSCM). The\nchannel model is verified with reported measurement data of channel for massive\nMIMO. Spatial determinism in channel, the basic cause of unfavorable\npropagation, is modeled into controlling parameters of channel model. Channel\nmodel uses only three controlling parameters; one parameter describes variation\nin channel along resource block (along time or frequency) and remaining two\nparameters describe spatial variation in channel. Modeling of simultaneous\nvariation along time and space belongs to a very common scenario where mobility\nof mobile terminal and angular power distribution at base station receiver, are\nkey parameters. Additionally, simulation results reveal the hidden advantages\nof spatial determinism in channel for multiuser massive MIMO.\n", "versions": [{"version": "v1", "created": "Fri, 4 Mar 2016 06:36:51 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Dahiya", "Suresh", ""]]}, {"id": "1604.00576", "submitter": "Abhishek  Sinha", "authors": "Abhishek Sinha, Leandros Tassiulas, Eytan Modiano", "title": "Throughput-Optimal Broadcast in Wireless Networks with Dynamic Topology", "comments": "To appear in the proceedings of Mobihoc, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.DS cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the problem of throughput-optimal broadcast- ing in time-varying\nwireless networks, whose underlying topology is restricted to Directed Acyclic\nGraphs (DAG). Previous broadcast algorithms route packets along spanning trees.\nIn large networks with time-varying connectivities, these trees are difficult\nto compute and maintain. In this paper we propose a new online\nthroughput-optimal broadcast algorithm which makes packet-by-packet scheduling\nand routing decisions, obviating the need for maintaining any global\ntopological structures, such as spanning-trees. Our algorithm relies on\nsystem-state information for making transmission decisions and hence, may be\nthought of as a generalization of the well-known back-pressure algorithm which\nmakes point-to-point unicast transmission decisions based on queue-length\ninformation, without requiring knowledge of end-to-end paths. Technically, the\nback-pressure algorithm is derived by stochastically stabilizing the\nnetwork-queues. However, because of packet-duplications associated with\nbroadcast, the work-conservation principle is violated and queuing processes\nare difficult to define in the broadcast problem. To address this fundamental\nissue, we identify certain state-variables which behave like virtual queues in\nthe broadcast setting. By stochastically stabilizing these virtual queues, we\ndevise a throughput-optimal broadcast policy. We also derive new\ncharacterizations of the broadcast-capacity of time-varying wireless DAGs and\nderive an efficient algorithm to compute the capacity exactly under certain\nassumptions of interference model, and a poly-time approximation algorithm for\ncomputing the capacity under less restrictive assumptions.\n", "versions": [{"version": "v1", "created": "Sun, 3 Apr 2016 00:09:19 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Sinha", "Abhishek", ""], ["Tassiulas", "Leandros", ""], ["Modiano", "Eytan", ""]]}, {"id": "1604.00588", "submitter": "Alireza Sadeghi", "authors": "Alireza Sadeghi, Michele Luvisotto, Farshad Lahouti, Stefano Vitturi,\n  Michele Zorzi", "title": "Statistical QoS Analysis of Full Duplex and Half Duplex Heterogeneous\n  Cellular Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, statistical Quality of Service provisioning in next generation\nheterogeneous mobile cellular networks is investigated. To this aim, any active\nentity of the cellular network is regarded as a queuing system, whose\nstatistical QoS requirements depend on the specific application. In this\ncontext, by quantifying the performance in terms of effective capacity, we\nintroduce a lower bound for the system performance that facilitates an\nefficient analysis. We exploit this analytical framework to give insights about\nthe possible improvement of the statistical QoS experienced by the users if the\ncurrent heterogeneous cellular network architecture migrates from a Half Duplex\nto a Full Duplex mode of operation. Numerical results and analysis are\nprovided, where the network is modeled as a Mat\\'ern point processes with a\nhard core distance. The results demonstrate the accuracy and computational\nefficiency of the proposed scheme, especially in large scale wireless systems.\n", "versions": [{"version": "v1", "created": "Sun, 3 Apr 2016 03:14:48 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Sadeghi", "Alireza", ""], ["Luvisotto", "Michele", ""], ["Lahouti", "Farshad", ""], ["Vitturi", "Stefano", ""], ["Zorzi", "Michele", ""]]}, {"id": "1604.00589", "submitter": "Fabr\\'icio Barros Gon\\c{c}alves", "authors": "F. B. Gon\\c{c}alves and F. M. G. Fran\\c{c}a and C. L. Amorim", "title": "RAdNet-VE: An Interest-Centric Mobile Ad Hoc Network for Vehicular\n  Environments", "comments": "24 pages, 12th IEEE International Conference on Wireless and Mobile\n  Computing, Networking and Communications (WiMob 2016)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.SY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  In this study, we propose a variation of the RAdNet for vehicular\nenvironments (RAdNet-VE). The proposed scheme extends the message header,\nmechanism for registering interest, and message forwarding mechanism of RAdNet.\nTo obtain results, we performed simulation experiments involving two use\nscenarios and communication protocols developed from the Veins framework. Based\non results obtained from these experiments, we compare the performance of\nRAdNet-VE against that of RAdNet, a basic content-centric network (CCN) using\nreactive data routing, (CCN$_R$), and a basic CCN using proactive data routing,\nCCN$_P$. These CCNs provide non-cacheable data services. Moreover, the\ncommunication radio standards adopted in the scenarios 1 and 2 were\nrespectively IEEE 802.11n and IEEE 802.11p. The results shown that the\nperformance of the RAdNet-VE was superior to than those of RAdNet, CCN$_R$ and\nCCN$_P$. In this sense, RAdNet-VE protocol (RVEP) presented low communication\nlatencies among nodes of just 20.4ms (scenario 1) and 2.87 ms (scenario 2). Our\nprotocol also presented high data delivery rates, i.e, 83.05\\% (scenario 1) and\n88.05\\% (scenario 2). Based on these and other results presented in this study,\nwe argue that RAdNet-VE is a feasible alternative to CCNs as\ninformation-centric network (ICN) model for VANET, because the RVEP satisfies\nall of the necessary communication requirements.\n", "versions": [{"version": "v1", "created": "Sun, 3 Apr 2016 03:32:55 GMT"}, {"version": "v10", "created": "Fri, 6 Jan 2017 19:29:20 GMT"}, {"version": "v2", "created": "Tue, 5 Apr 2016 21:06:16 GMT"}, {"version": "v3", "created": "Sat, 9 Apr 2016 23:54:20 GMT"}, {"version": "v4", "created": "Wed, 13 Apr 2016 15:12:14 GMT"}, {"version": "v5", "created": "Fri, 15 Apr 2016 20:29:49 GMT"}, {"version": "v6", "created": "Sat, 7 May 2016 16:19:34 GMT"}, {"version": "v7", "created": "Wed, 3 Aug 2016 16:50:40 GMT"}, {"version": "v8", "created": "Mon, 24 Oct 2016 22:16:13 GMT"}, {"version": "v9", "created": "Wed, 9 Nov 2016 04:08:34 GMT"}], "update_date": "2017-01-10", "authors_parsed": [["Gonçalves", "F. B.", ""], ["França", "F. M. G.", ""], ["Amorim", "C. L.", ""]]}, {"id": "1604.00636", "submitter": "Sebastian Sc", "authors": "Sebastian Schiessl and Farshad Naghibi and Hussein Al-Zubaidy and\n  Markus Fidler and James Gross", "title": "On the Delay Performance of Interference Channels", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A deep understanding of the queuing performance of wireless networks is\nessential for the advancement of future wireless communications. The stochastic\nnature of wireless channels in general gives rise to a time varying\ntransmission rate. In such an environment, interference is increasingly\nbecoming a key constraint. Obtaining an expressive model for offered service of\nsuch channels has major implications in the design and optimization of future\nnetworks. However, interference channels are not well-understood with respect\nto their higher layer performance. The particular difficulty for handling\ninterference channels arises from the superposition of random fading processes\nfor the signals of the transmitters involved (i.e., for the signal of interest\nand for the signals of the interferers). Starting from the distribution of the\nsignal-to-interference-plus-noise ratio (SINR), we derive a statistical\ncharacterization of the underlying service process in terms of its Mellin\ntransform. Then, we adapt a recent stochastic network calculus approach for\nfading channels to derive measures of the queuing performance of single- and\nmulti-hop wireless interference networks. Special cases of our solution include\nnoise-limited and interference-limited systems. A key finding of our analysis\nis that for a given average signal and average sum interference power, the\nperformance of interfered systems not only depends on the relative strength of\nthe sum interference with respect to the signal-of-interest power, but also on\nthe interference structure (i.e., the number of interferers) as well as the\nabsolute levels.\n", "versions": [{"version": "v1", "created": "Sun, 3 Apr 2016 13:52:56 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Schiessl", "Sebastian", ""], ["Naghibi", "Farshad", ""], ["Al-Zubaidy", "Hussein", ""], ["Fidler", "Markus", ""], ["Gross", "James", ""]]}, {"id": "1604.00736", "submitter": "Mohammad Abu Alsheikh", "authors": "Mohammad Abu Alsheikh, Shaowei Lin, Dusit Niyato, Hwee-Pink Tan", "title": "Rate-distortion Balanced Data Compression for Wireless Sensor Networks", "comments": "arXiv admin note: text overlap with arXiv:1408.2948", "journal-ref": "IEEE Sensors Journal, vol. 16, no. 12, pp. 5072-5083, June15, 2016", "doi": "10.1109/JSEN.2016.2550599", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a data compression algorithm with error bound guarantee\nfor wireless sensor networks (WSNs) using compressing neural networks. The\nproposed algorithm minimizes data congestion and reduces energy consumption by\nexploring spatio-temporal correlations among data samples. The adaptive\nrate-distortion feature balances the compressed data size (data rate) with the\nrequired error bound guarantee (distortion level). This compression relieves\nthe strain on energy and bandwidth resources while collecting WSN data within\ntolerable error margins, thereby increasing the scale of WSNs. The algorithm is\nevaluated using real-world datasets and compared with conventional methods for\ntemporal and spatial data compression. The experimental validation reveals that\nthe proposed algorithm outperforms several existing WSN data compression\nmethods in terms of compression efficiency and signal reconstruction. Moreover,\nan energy analysis shows that compressing the data can reduce the energy\nexpenditure, and hence expand the service lifespan by several folds.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 04:14:21 GMT"}], "update_date": "2016-08-16", "authors_parsed": [["Alsheikh", "Mohammad Abu", ""], ["Lin", "Shaowei", ""], ["Niyato", "Dusit", ""], ["Tan", "Hwee-Pink", ""]]}, {"id": "1604.00739", "submitter": "Qiaoni Han", "authors": "Bo Yang, Yanyan Shen, Qiaoni Han, Cailian Chen, Xinping Guan, and\n  Weidong Zhang", "title": "Energy Efficient Resource Allocation for Time-Varying OFDMA Relay\n  Systems with Hybrid Energy Supplies", "comments": "12 pages, 9 figures, IEEE System Journal", "journal-ref": null, "doi": "10.1109/JSYST.2016.2551319", "report-no": null, "categories": "cs.DC cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates the energy efficient resource allocation for\northogonal frequency division multiple access (OFDMA) relay systems, where the\nsystem is supplied by the conventional utility grid and a renewable energy\ngenerator equipped with a storage device. The optimal usage of radio resource\ndepends on the characteristics of the renewable energy generation and the\nmobile traffic, which exhibit both temporal and spatial diversities. Lyapunov\noptimization method is used to decompose the problem into the joint flow\ncontrol, radio resource allocation and energy management without knowing a\npriori knowledge of system statistics. It is proven that the proposed algorithm\ncan result in close-to-optimal performance with capacity limited data buffer\nand storage device. Simulation results show that the flexible tradeoff between\nthe system utility and the conventional energy consumption can be achieved.\nCompared with other schemes, the proposed algorithm demonstrates better\nperformance.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 04:33:29 GMT"}, {"version": "v2", "created": "Wed, 6 Apr 2016 01:27:39 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Yang", "Bo", ""], ["Shen", "Yanyan", ""], ["Han", "Qiaoni", ""], ["Chen", "Cailian", ""], ["Guan", "Xinping", ""], ["Zhang", "Weidong", ""]]}, {"id": "1604.00786", "submitter": "Alessio Zappone", "authors": "Stefano Buzzi, Chih-Lin I, Thierry E. Klein, H. Vincent Poor, Chenyang\n  Yang, Alessio Zappone", "title": "A Survey of Energy-Efficient Techniques for 5G Networks and Challenges\n  Ahead", "comments": "14 pages, 3 figures", "journal-ref": "IEEE Journal on Selected Areas in Communications, vol. 34, no. 4,\n  April 2016", "doi": "10.1109/JSAC.2016.2550338", "report-no": null, "categories": "cs.IT cs.NI math.IT math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  After about a decade of intense research, spurred by both economic and\noperational considerations, and by environmental concerns, energy efficiency\nhas now become a key pillar in the design of communication networks. With the\nadvent of the fifth generation of wireless networks, with millions more base\nstations and billions of connected devices, the need for energy-efficient\nsystem design and operation will be even more compelling. This survey provides\nan overview of energy-efficient wireless communications, reviews seminal and\nrecent contribution to the state-of-the-art, including the papers published in\nthis special issue, and discusses the most relevant research challenges to be\naddressed in the future.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 09:29:41 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Buzzi", "Stefano", ""], ["I", "Chih-Lin", ""], ["Klein", "Thierry E.", ""], ["Poor", "H. Vincent", ""], ["Yang", "Chenyang", ""], ["Zappone", "Alessio", ""]]}, {"id": "1604.00875", "submitter": "Yanling Yin", "authors": "Yanling Yin, Sumit Roy, Payman Arabshahi", "title": "A Modified CSMA/CA Protocol for OFDM Underwater Networks: Cross Layer\n  Design", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The underwater acoustic channel continues to present significant challenges\nto efficient throughput performance of underwater acoustic sensor networks\n(UASNs) in varying scenarios. As a result, cross-layer approaches that explore\njoint PHY/MAC strategies are worthy of further exploration. We consider a\nrecent high-speed OFDM modem and propose a new cross-layer solution based on\nmodified CSMA/CA, for a canonical star network topology with few nodes (the\nmost common scenario in UASNs). Some innovations to an adaptive OFDM PHY link\nare developed to jointly select the modulation, convolutional coding and\nfrequency diversity order (different transmission modes) for matching varying\nchannel conditions. Additionally, receiver logic that disambiguates the cause\nof packet loss between a) that caused by channel vs. b) that due to collisions\nis used to modify the ARQ/backoff logic for retransmissions with CSMA/CA random\naccess. Simulation results reveal that the cross-layer design can effectively\nincrease network throughput.\n", "versions": [{"version": "v1", "created": "Mon, 21 Mar 2016 05:53:56 GMT"}], "update_date": "2016-04-05", "authors_parsed": [["Yin", "Yanling", ""], ["Roy", "Sumit", ""], ["Arabshahi", "Payman", ""]]}, {"id": "1604.00894", "submitter": "Philippe Robert S.", "authors": "Christine Fricker, Fabrice Guillemin, Philippe Robert, Guilherme\n  Thompson", "title": "Allocation Schemes of Ressources with Downgrading", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider a server with large capacity delivering video files encoded in\nvarious resolutions. We assume that the system is under saturation in the sense\nthat the total demand exceeds the server capacity $C$. In such a case, requests\nmay be rejected. For the policies considered in this paper, instead of\nrejecting a video request, it is downgraded. When the occupancy of the server\nis above some value $C_0{<}C$, the server delivers the video at a minimal bit\nrate. The quantity $C_0$ is the bit rate adaptation threshold. For these\npolicies, request blocking is thus replaced by bit rate adaptation. Under the\nassumptions of Poisson request arrivals and exponential service times, we show\nthat, by rescaling the system, a process associated to the occupancy of the\nserver converges to some limiting process whose invariant distribution is\ncomputed by a Wiener-Hopf technique. This allows us to derive an asymptotic\nexpression of the key performance measure of such a policy, the equilibrium\nprobability that a request is transmitted without downgrading. Numerical\napplications of these results are presented.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 15:05:27 GMT"}, {"version": "v2", "created": "Mon, 27 Feb 2017 08:35:38 GMT"}], "update_date": "2017-02-28", "authors_parsed": [["Fricker", "Christine", ""], ["Guillemin", "Fabrice", ""], ["Robert", "Philippe", ""], ["Thompson", "Guilherme", ""]]}, {"id": "1604.00913", "submitter": "Ivar In 't Veen", "authors": "Ivar in 't Veen, Qingzhi Liu, Przemys{\\l}aw Pawe{\\l}czak, Aaron Parks\n  and Joshua R. Smith", "title": "BLISP: Enhancing Backscatter Radio with Active Radio for Computational\n  RFIDs", "comments": "Accepted to IEEE RFID 2016 (extended version)", "journal-ref": null, "doi": "10.1109/RFID.2016.7488010", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate the world's first hybrid radio platform which combines the\nstrengths of active radio (long range and robustness to interference) and\nComputational RFIDs (low power consumption). We evaluate the Wireless\nIdentification and Sensing Platform (WISP), an EPC C1G2 standard-based,\nComputational RFID backscatter radio, against Bluetooth Low Energy (BLE) and\nshow (theoretically and experimentally) that WISP in high channel attenuation\nconditions is less energy efficient per received byte than BLE. Exploiting this\nobservation we design a simple switching mechanisms that backs off to BLE when\nradio conditions for WISP are unfavorable. By a set of laboratory experiments,\nwe show that our proposed hybrid active/backscatter radio obtains higher\ngoodput than WISP and lower energy consumption than BLE as stand-alone\nplatforms, especially when WISP is in range of an RFID interrogator for the\nmajority of the time. Simultaneously, our proposed platform is as energy\nefficient as BLE when user is mostly out of RFID interrogator range.\n", "versions": [{"version": "v1", "created": "Mon, 14 Mar 2016 21:26:46 GMT"}, {"version": "v2", "created": "Sat, 23 Apr 2016 14:42:07 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Veen", "Ivar in 't", ""], ["Liu", "Qingzhi", ""], ["Pawełczak", "Przemysław", ""], ["Parks", "Aaron", ""], ["Smith", "Joshua R.", ""]]}, {"id": "1604.01062", "submitter": "Harsha Chenji", "authors": "Michael Atakora and Harsha Chenji", "title": "Optimal Multicasting in Hybrid RF/FSO DTNs", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The multi-copy routing paradigm in Delay Tolerant Networks (DTNs) implies\nthat increasing contact bandwidth leads to a decrease in data delivery delay\nand an improvement in throughput. With Hybrid Radio Frequency/Free Space\nOptical (RF/FSO) PHY layers, the high data rate FSO links can be used to\nincrease the contact bandwidth. However, due to the highly directional nature\nof FSO links, broadcasting is difficult. A naive broadcast strategy where the\nbeam divergence angle is increased to include many nodes in the broadcast set\nresults in low data rate, and does not always result in the minimum achievable\ndelay.\n  In this work we develop an optimal multicast algorithm for hybrid RF/FSO\nnetworks. We show that the problem is an abstraction of the minimum weight set\ncover problem which is known to be NP-hard. A computationally cheap greedy\nlocal optimum heuristic is proposed. A comprehensive evaluation using delay,\nthroughput and computation time as metrics is performed using various\nsolutions. These extensive evaluations show that our solution outperforms both\nnaive broadcast and multiple unicast, taking 95% less time as compared to the\nexact algorithm, while providing comparable performance.\n", "versions": [{"version": "v1", "created": "Mon, 4 Apr 2016 21:02:54 GMT"}], "update_date": "2016-04-06", "authors_parsed": [["Atakora", "Michael", ""], ["Chenji", "Harsha", ""]]}, {"id": "1604.01136", "submitter": "Xiaoke Wang", "authors": "Xiaoke Wang, Chuan Wu, Franck Le, Alex Liu, Zongpeng Li and Francis\n  Lau", "title": "Online VNF Scaling in Datacenters", "comments": "9 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network Function Virtualization (NFV) is a promising technology that promises\nto significantly reduce the operational costs of network services by deploying\nvirtualized network functions (VNFs) to commodity servers in place of dedicated\nhardware middleboxes. The VNFs are typically running on virtual machine\ninstances in a cloud infrastructure, where the virtualization technology\nenables dynamic provisioning of VNF instances, to process the fluctuating\ntraffic that needs to go through the network functions in a network service. In\nthis paper, we target dynamic provisioning of enterprise network services -\nexpressed as one or multiple service chains - in cloud datacenters, and design\nefficient online algorithms without requiring any information on future traffic\nrates. The key is to decide the number of instances of each VNF type to\nprovision at each time, taking into consideration the server resource\ncapacities and traffic rates between adjacent VNFs in a service chain. In the\ncase of a single service chain, we discover an elegant structure of the problem\nand design an efficient randomized algorithm achieving a e/(e-1) competitive\nratio. For multiple concurrent service chains, an online heuristic algorithm is\nproposed, which is O(1)-competitive. We demonstrate the effectiveness of our\nalgorithms using solid theoretical analysis and trace-driven simulations.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2016 05:17:13 GMT"}], "update_date": "2016-04-06", "authors_parsed": [["Wang", "Xiaoke", ""], ["Wu", "Chuan", ""], ["Le", "Franck", ""], ["Liu", "Alex", ""], ["Li", "Zongpeng", ""], ["Lau", "Francis", ""]]}, {"id": "1604.01275", "submitter": "Gabriel Martins Dias", "authors": "Gabriel Martins Dias, Boris Bellalta, Simon Oechsner", "title": "On the importance and feasibility of forecasting data in sensors", "comments": "30 pages and 12 figures. This paper has been submitted to the\n  Transactions on Mobile Computing journal", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The first generation of wireless sensor nodes have constrained energy\nresources and computational power, which discourages applications to process\nany task other than measuring and transmitting towards a central server.\nHowever, nowadays, sensor networks tend to be incorporated into the Internet of\nThings and the hardware evolution may change the old strategy of avoiding data\ncomputation in the sensor nodes. In this paper, we show the importance of\nreducing the number of transmissions in sensor networks and present the use of\nforecasting methods as a way of doing it. Experiments using real sensor data\nshow that state-of-the-art forecasting methods can be successfully implemented\nin the sensor nodes to keep the quality of their measurements and reduce up to\n30% of their transmissions, lowering the channel utilization. We conclude that\nthere is an old paradigm that is no longer the most beneficial, which is the\nstrategy of always transmitting a measurement when it differs by more than a\nthreshold from the last one transmitted. Adopting more complex forecasting\nmethods in the sensor nodes is the alternative to significantly reduce the\nnumber of transmissions without compromising the quality of their measurements,\nand therefore support the exponential growth of the Internet of Things.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2016 14:35:05 GMT"}], "update_date": "2016-04-06", "authors_parsed": [["Dias", "Gabriel Martins", ""], ["Bellalta", "Boris", ""], ["Oechsner", "Simon", ""]]}, {"id": "1604.01276", "submitter": "Travis Humble", "authors": "Venkat R. Dasari, Ronald J. Sadlier, Ryan Prout, Brian P. Williams,\n  and Travis S. Humble", "title": "Programmable Multi-Node Quantum Network Design and Simulation", "comments": "9 pages, scheduled for presentation at SPIE Quantum Information and\n  Computation IX", "journal-ref": "Proc. SPIE 9873, Quantum Information and Computation IX, 98730B\n  (2016)", "doi": "10.1117/12.2234697", "report-no": null, "categories": "quant-ph cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Software-defined networking offers a device-agnostic programmable framework\nto encode new network functions. Externally centralized control plane\nintelligence allows programmers to write network applications and to build\nfunctional network designs. OpenFlow is a key protocol widely adopted to build\nprogrammable networks because of its programmability, flexibility and ability\nto interconnect heterogeneous network devices. We simulate the functional\ntopology of a multi-node quantum network that uses programmable network\nprinciples to manage quantum metadata for protocols such as teleportation,\nsuperdense coding, and quantum key distribution. We first show how the OpenFlow\nprotocol can manage the quantum metadata needed to control the quantum channel.\nWe then use numerical simulation to demonstrate robust programmability of a\nquantum switch via the OpenFlow network controller while executing an\napplication of superdense coding. We describe the software framework\nimplemented to carry out these simulations and we discuss near-term efforts to\nrealize these applications.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2016 14:35:55 GMT"}], "update_date": "2016-05-25", "authors_parsed": [["Dasari", "Venkat R.", ""], ["Sadlier", "Ronald J.", ""], ["Prout", "Ryan", ""], ["Williams", "Brian P.", ""], ["Humble", "Travis S.", ""]]}, {"id": "1604.01303", "submitter": "Liang Wang", "authors": "Liang Wang, Mario Almeida, Jeremy Blackburn, Jon Crowcroft", "title": "C3PO: Computation Congestion Control (PrOactive) - an algorithm for\n  dynamic diffusion of ephemeral in-network services", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is an obvious trend that more and more data and computation are\nmigrating into networks nowadays. Combining mature virtualization technologies\nwith service-centric net- working, we are entering into an era where countless\nservices reside in an ISP network to provide low-latency access. Such services\nare often computation intensive and are dynamically created and destroyed on\ndemands everywhere in the network to perform various tasks. Consequently, these\nephemeral in-network services introduce a new type of congestion in the network\nwhich we refer to as \"computation congestion\". The service load need to be\neffectively distributed on different nodes in order to maintain the\nfuntionality and responsiveness of the network, which calls for a new design\nrather than reusing the centralised scheduler designed for cloud-based\nservices. In this paper, we study both passive and proactive control\nstrategies, based on the proactive control we further propose a fully\ndistributed solution which is low complexity, adaptive, and responsive to\nnetwork dynamics.\n", "versions": [{"version": "v1", "created": "Tue, 5 Apr 2016 15:38:51 GMT"}, {"version": "v2", "created": "Wed, 6 Apr 2016 09:07:04 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Wang", "Liang", ""], ["Almeida", "Mario", ""], ["Blackburn", "Jeremy", ""], ["Crowcroft", "Jon", ""]]}, {"id": "1604.01519", "submitter": "Deyu Zhang", "authors": "Deyu Zhang, Zhigang Chen Ju Ren, Ning Zhang, Mohamad Khattar Awad,\n  Haibo Zhou, Xuemin (Sherman) Shen", "title": "Energy Harvesting-Aided Spectrum Sensing and Data Transmission in\n  Heterogeneous Cognitive Radio Sensor Network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The incorporation of Cognitive Radio (CR) and Energy Harvesting (EH)\ncapabilities in wireless sensor networks enables spectrum and energy efficient\nheterogeneous cognitive radio sensor networks (HCRSNs). The new networking\nparadigm of HCRSNs consists of EH-enabled spectrum sensors and battery powered\ndata sensors. Spectrum sensors can cooperatively scan the licensed spectrum for\navailable channels, while data sensors monitor an area of interest and transmit\nsensed data to the sink over those channels. In this work, we propose a\nresource allocation solution for the HCRSN to achieve the sustainability of\nspectrum sensors and conserve energy of data sensors. The proposed solution is\nachieved by two algorithms that operate in tandem, a spectrum sensor scheduling\nalgorithm and a data sensor resource allocation algorithm. The spectrum sensor\nscheduling algorithm allocates channels to spectrum sensors such that the\naverage detected available time for the channels is maximized, while the EH\ndynamics are considered and PU transmissions are protected. The data sensor\nresource allocation algorithm allocates the transmission time, power and\nchannels such that the energy consumption of the data sensors is minimized.\nExtensive simulation results demonstrate that the energy consumption of the\ndata sensors can be significantly reduced while maintaining the sustainability\nof the spectrum sensors.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 07:40:58 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Zhang", "Deyu", "", "Sherman"], ["Ren", "Zhigang Chen Ju", "", "Sherman"], ["Zhang", "Ning", "", "Sherman"], ["Awad", "Mohamad Khattar", "", "Sherman"], ["Zhou", "Haibo", "", "Sherman"], ["Xuemin", "", "", "Sherman"], ["Shen", "", ""]]}, {"id": "1604.01675", "submitter": "Yuedong Xu", "authors": "Yuedong Xu, Zhujun Xiao, Hui Feng, Tao Yang, Bo Hu, Yipeng Zhou", "title": "Modeling QoE of Video Streaming in Wireless Networks with Large-Scale\n  Measurement of User Behavior", "comments": "16 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unraveling quality of experience (QoE) of video streaming is very challenging\nin bandwidth shared wireless networks. It is unclear how QoE metrics such as\nstarvation probability and buffering time interact with dynamics of streaming\ntraffic load. In this paper, we collect view records from one of the largest\nstreaming providers in China over two weeks and perform an in-depth measurement\nstudy on flow arrival and viewing time that shed light on the real traffic\npattern. Our most important observation is that the viewing time of streaming\nusers fits a hyper-exponential distribution quite well. This implies that all\nthe views can be categorized into two classes, short and long views with\nseparated time scales. We then map the measured traffic pattern to bandwidth\nshared cellular networks and propose an analytical framework to compute the\nclosed-form starvation probability on the basis of ordinary differential\nequations (ODEs). Our framework can be naturally extended to investigate\npractical issues including the progressive downloading and the finite video\nduration. Extensive trace-driven simulations validate the accuracy of our\nmodels. Our study reveals that the starvation metrics of the short and long\nviews possess different sensitivities to the scheduling priority at base\nstation. Hence, a better QoE tradeoff between the short and long views has a\npotential to be leveraged by offering them different scheduling weights. The\nflow differentiation involves tremendous technical and non-technical challenges\nbecause video content is owned by content providers but not the network\noperators and the viewing time of each session is unknown beforehand. To\novercome these difficulties, we propose an online Bayesian approach to infer\nthe viewing time of each incoming flow with the \"least\" information from\ncontent providers.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 16:04:38 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Xu", "Yuedong", ""], ["Xiao", "Zhujun", ""], ["Feng", "Hui", ""], ["Yang", "Tao", ""], ["Hu", "Bo", ""], ["Zhou", "Yipeng", ""]]}, {"id": "1604.01720", "submitter": "Eric Wengrowski", "authors": "Eric Wengrowski, Kristin Dana, Marco Gruteser, and Narayan Mandayam", "title": "Reading Between the Pixels: Photographic Steganography for Camera\n  Display Messaging", "comments": "16 pages with references 8 tables and figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.GR cs.MM cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We exploit human color metamers to send light-modulated messages less visible\nto the human eye, but recoverable by cameras. These messages are a key\ncomponent to camera-display messaging, such as handheld smartphones capturing\ninformation from electronic signage. Each color pixel in the display image is\nmodified by a particular color gradient vector. The challenge is to find the\ncolor gradient that maximizes camera response, while minimizing human response.\nThe mismatch in human spectral and camera sensitivity curves creates an\nopportunity for hidden messaging. Our approach does not require knowledge of\nthese sensitivity curves, instead we employ a data-driven method. We learn an\nellipsoidal partitioning of the six-dimensional space of colors and color\ngradients. This partitioning creates metamer sets defined by the base color at\nthe display pixel and the color gradient direction for message encoding. We\nsample from the resulting metamer sets to find color steps for each base color\nto embed a binary message into an arbitrary image with reduced visible\nartifacts. Unlike previous methods that rely on visually obtrusive intensity\nmodulation, we embed with color so that the message is more hidden. Ordinary\ndisplays and cameras are used without the need for expensive LEDs or high speed\ndevices. The primary contribution of this work is a framework to map the pixels\nin an arbitrary image to a metamer pair for steganographic photo messaging.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 18:43:18 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Wengrowski", "Eric", ""], ["Dana", "Kristin", ""], ["Gruteser", "Marco", ""], ["Mandayam", "Narayan", ""]]}, {"id": "1604.01739", "submitter": "Zheng Chang", "authors": "Zheng Chang, Zhenyu Zhou, Sheng Zhou, Tapani Ristaniemi, Zhisheng Niu", "title": "Towards Service-oriented 5G: Virtualizing the Networks for\n  Everything-as-a-Service", "comments": "18 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is widely acknowledged that the forthcoming 5G architecture will be highly\nheterogeneous and deployed with a high degree of density. These changes over\nthe current 4G bring many challenges on how to achieve an efficient operation\nfrom the network management perspective. In this article, we introduce a\nrevolutionary vision of the future 5G wireless networks, in which the network\nis no longer limited by hardware or even software. Specifically, by the idea of\nvirtualizing the wireless networks, which has recently gained increasing\nattention, we introduce the Everything-as-a-Service (XaaS) taxonomy to light\nthe way towards designing the service-oriented wireless networks. The concepts,\nchallenges along with the research opportunities for realizing XaaS in wireless\nnetworks are overviewed and discussed.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 19:22:24 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Chang", "Zheng", ""], ["Zhou", "Zhenyu", ""], ["Zhou", "Sheng", ""], ["Ristaniemi", "Tapani", ""], ["Niu", "Zhisheng", ""]]}, {"id": "1604.01741", "submitter": "Jean-Sebastien Gomez", "authors": "J S Gomez (Infres, LTCI), A Vergne (Infres), P Martins (Infres),\n  Laurent Decreusefond (LTCI), Wei Chen", "title": "Cournot-Nash Equilibria for Bandwidth Allocation under Base-Station\n  Cooperation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.GT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  -In this paper, a novel resource allocation scheme based on discrete\nCournot-Nash equilibria and optimal transport theory is proposed. The\noriginality of this framework lies in the joint optimization of downlink\nbandwidth allocation and cooperation between base stations. A tractable\nformalization is given in the form of a quadratic optimization problem. A low\ncomplexity approximate solution is derived and theoretically characterized.\nSimulations highlight the existence of an optimal working point, that maximizes\nuser satisfaction ratio and network load. The impact of the network deployment\non the optimum is numerically investigated, thanks to the $\\beta$-Ginibre\nmodel. Indeed, base stations are assumed to be drawn according to\n$\\beta$-Ginibre point processes. Numerical analysis shows that the network\nperformance increases with $\\beta$ going to one.\n", "versions": [{"version": "v1", "created": "Wed, 6 Apr 2016 19:29:17 GMT"}], "update_date": "2016-04-07", "authors_parsed": [["Gomez", "J S", "", "Infres, LTCI"], ["Vergne", "A", "", "Infres"], ["Martins", "P", "", "Infres"], ["Decreusefond", "Laurent", "", "LTCI"], ["Chen", "Wei", ""]]}, {"id": "1604.01851", "submitter": "Changkun Jiang", "authors": "Changkun Jiang, Lingjie Duan, and Jianwei Huang", "title": "Optimal Pricing and Admission Control for Heterogeneous Secondary Users", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper studies how to maximize a spectrum database operator's expected\nrevenue in sharing spectrum to secondary users, through joint pricing and\nadmission control of spectrum resources. A unique feature of our model is the\nconsideration of the stochastic and heterogeneous nature of secondary users'\ndemands. We formulate the problem as a stochastic dynamic programming problem,\nand present the optimal solutions under both static and dynamic pricing\nschemes. In the case of static pricing, the prices do not change with time,\nalthough the admission control policy can still be time-dependent. In this\ncase, we show that a stationary (time-independent) admission policy is in fact\noptimal under a wide range of system parameters. In the case of dynamic\npricing, we allow both prices and admission control policies to be\ntime-dependent. We show that the optimal dynamic pricing can improve the\noperator's revenue by more than 30% over the optimal static pricing, when\nsecondary users' demands for spectrum opportunities are highly elastic.\n", "versions": [{"version": "v1", "created": "Thu, 7 Apr 2016 02:34:15 GMT"}], "update_date": "2016-04-08", "authors_parsed": [["Jiang", "Changkun", ""], ["Duan", "Lingjie", ""], ["Huang", "Jianwei", ""]]}, {"id": "1604.02180", "submitter": "Stefan Schmid", "authors": "Matthias Rost and Stefan Schmid", "title": "Service Chain and Virtual Network Embeddings: Approximations using\n  Randomized Rounding", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The SDN and NFV paradigms enable novel network services which can be realized\nand embedded in a flexible and rapid manner. For example, SDN can be used to\nflexibly steer traffic from a source to a destination through a sequence of\nvirtualized middleboxes, in order to realize so-called service chains. The\nservice chain embedding problem consists of three tasks: admission control,\nfinding suitable locations to allocate the virtualized middleboxes and\ncomputing corresponding routing paths. This paper considers the offline batch\nembedding of multiple service chains. Concretely, we consider the objectives of\nmaximizing the profit by embedding an optimal subset of requests or minimizing\nthe costs when all requests need to be embedded. Interestingly, while the\nservice chain embedding problem has recently received much attention, so far,\nonly non- polynomial time algorithms (based on integer programming) as well as\nheuristics (which do not provide any formal guarantees) are known. This paper\npresents the first polynomial time service chain approximation algorithms both\nfor the case with admission and without admission control. Our algorithm is\nbased on a novel extension of the classic linear programming and randomized\nrounding technique, which may be of independent interest. In particular, we\nshow that our approach can also be extended to more complex service graphs,\ncontaining cycles or sub-chains, hence also providing new insights into the\nclassic virtual network embedding problem.\n", "versions": [{"version": "v1", "created": "Thu, 7 Apr 2016 21:28:31 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Rost", "Matthias", ""], ["Schmid", "Stefan", ""]]}, {"id": "1604.02223", "submitter": "Hong-Ning Dai Prof.", "authors": "Hong-Ning Dai, Raymond Chi-Wing Wong, Hao Wang", "title": "On Capacity and Delay of Multi-channel Wireless Networks with\n  Infrastructure Support", "comments": "accepted, IEEE Transactions on Vehicular Technology, 2016", "journal-ref": "IEEE Transactions on Vehicular Technology, 2017", "doi": "10.1109/TVT.2016.2553783", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a novel multi-channel network with infrastructure\nsupport, called an MC-IS network, which has not been studied in the literature.\nTo the best of our knowledge, we are the first to study such an MC-IS network.\nOur proposed MC-IS network has a number of advantages over three existing\nconventional networks, namely a single-channel wireless ad hoc network (called\nan SC-AH network), a multi-channel wireless ad hoc network (called an MC-AH\nnetwork) and a single-channel network with infrastructure support (called an\nSC-IS network). In particular, the network capacity of our proposed MC-IS\nnetwork is $\\sqrt{n \\log n}$ times higher than that of an SC-AH network and an\nMC-AH network and the same as that of an SC-IS network, where $n$ is the number\nof nodes in the network. The average delay of our MC-IS network is $\\sqrt{\\log\nn/n}$ times lower than that of an SC-AH network and an MC-AH network, and\n$\\min\\{C_I,m\\}$ times lower than the average delay of an SC-IS network, where\n$C_I$ and $m$ denote the number of channels dedicated for infrastructure\ncommunications and the number of interfaces mounted at each infrastructure\nnode, respectively. Our analysis on an MC-IS network equipped with\nomni-directional antennas only has been extended to an MC-IS network equipped\nwith directional antennas only, which are named as an MC-IS-DA network. We show\nthat an MC-IS-DA network has an even lower delay of $\\frac{c}{\\lfloor\n\\frac{2\\pi}{\\theta}\\rfloor \\cdot C_I}$ compared with an SC-IS network and our\nMC-IS network. For example, when $C_I=12$ and $\\theta=\\frac{\\pi}{12}$, an\nMC-IS-DA network can further reduce the delay by 24 times lower that of an\nMC-IS network and reduce the delay by 288 times lower than that of an SC-IS\nnetwork.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2016 04:04:26 GMT"}], "update_date": "2019-08-26", "authors_parsed": [["Dai", "Hong-Ning", ""], ["Wong", "Raymond Chi-Wing", ""], ["Wang", "Hao", ""]]}, {"id": "1604.02253", "submitter": "Erlend Magnus Viggen", "authors": "Tor Arne Reinen, Arne Lie, Finn Tore Knudsen", "title": "SensIs - Underwater acoustic network for ice-monitoring", "comments": "10 pages, 5 figures, 2 tables; part of the Proceedings of the 39th\n  Scandinavian Symposium on Physical Acoustics (arXiv:1604.01763)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI physics.ao-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Routing for low latency underwater acoustic network-communication is\ninvestigated. The application is monitoring of ice-threats to offshore\noperations in the Arctic - to provide warnings that enable operators to react\nto such threats. The scenario produces relatively high traffic load, and the\nnetwork should favour low delay and adequate reliability rather than energy\nusage minimization. The ICRP (Information-Carrying based Routing Protocol),\noriginally proposed by Wei Liang et al. in 2007, is chosen as basis. ICRP\nobtains unicast routing paths by sending data payload as broadcast packets when\nno route information is available. Thus, data can be delivered without the cost\nof reactive signalling latency. In this paper we explore the capabilities of a\nslightly enhanced/adapted ICRP, tailored to the ice monitoring application. By\nsimulations and experiments at sea it is demonstrated that the protocol\nperforms well and can manage the applications high traffic load - this provided\nthat the point-to-point links provide sufficient bit rates and capacity\nheadroom.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2016 07:25:47 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Reinen", "Tor Arne", ""], ["Lie", "Arne", ""], ["Knudsen", "Finn Tore", ""]]}, {"id": "1604.02322", "submitter": "Cornelius Diekmann", "authors": "Lothar Braun, Cornelius Diekmann, Nils Kammenhuber, Georg Carle", "title": "Adaptive Load-Aware Sampling for Network Monitoring on Multicore\n  Commodity Hardware", "comments": "In IFIP Networking 2013, New York, NY, May 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many current traffic monitoring systems employ deep packet inspection (DPI)\nin order to analyze network traffic. These systems include intrusion detection\nsystems, software for network traffic accounting, traffic classification, or\nsystems for monitoring service-level agreements. Traffic volumes and link\nspeeds of current enterprise and ISP networks transform the process of\ninspecting traffic payload into a challenging task. In this paper we propose a\nnovel adaptive sampling algorithm that selects the maximum number of packets\nfrom the network that the DPI system is able to consume. Our algorithm adapts\nits sampling rate according to the network traffic currently observed, and the\nnumber of packets that a monitoring application is able to process. It can be\nused in conjunction with current multicore-aware network traffic analysis\nsetups, which allow for exploiting current multi-core hardware. We show the\napplicability of our algorithm with live-tests on a heavily used 10G link with\nreal network monitoring tools.\n", "versions": [{"version": "v1", "created": "Fri, 8 Apr 2016 12:11:26 GMT"}], "update_date": "2016-04-11", "authors_parsed": [["Braun", "Lothar", ""], ["Diekmann", "Cornelius", ""], ["Kammenhuber", "Nils", ""], ["Carle", "Georg", ""]]}, {"id": "1604.02526", "submitter": "Hengky Susanto", "authors": "Hengky Susanto, ByungGuk Kim", "title": "Practical Recovery Solution for Information Loss in Real-Time Network\n  Environment", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Feedback mechanism based algorithms are frequently used to solve network\noptimization problems. These schemes involve users and network exchanging\ninformation (e.g. requests for bandwidth allocation and pricing) to achieve\nconvergence towards an optimal solution. However, in the implementation, these\nalgorithms do not guarantee that messages will be delivered to the destination\nwhen network congestion occurs. This in turn often results in packet drops,\nwhich may cause information loss, and this condition may lead to algorithm\nfailing to converge. To prevent this failure, we propose least square (LS)\nestimation algorithm to recover the missing information when packets are\ndropped from the network. The simulation results involving several scenarios\ndemonstrate that LS estimation can provide the convergence for feedback\nmechanism based algorithm.\n", "versions": [{"version": "v1", "created": "Sat, 9 Apr 2016 05:23:15 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Susanto", "Hengky", ""], ["Kim", "ByungGuk", ""]]}, {"id": "1604.02559", "submitter": "Vishal Sharma", "authors": "Vishal Sharma, Mehdi Bennis, Rajesh Kumar", "title": "UAV-Assisted Heterogeneous Networks for Capacity Enhancement", "comments": "4 Pages: Accepted in IEEE Communications Letters, 2016", "journal-ref": null, "doi": "10.1109/LCOMM.2016.2553103", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Modern day wireless networks have tremendously evolved driven by a sharp\nincrease in user demands, continuously requesting more data and services. This\nputs significant strain on infrastructure based macro cellular networks due to\nthe inefficiency in handling these traffic demands, cost effectively. A viable\nsolution is the use of unmanned aerial vehicles (UAVs) as intermediate aerial\nnodes between the macro and small cell tiers for improving coverage and\nboosting capacity. This letter investigates the problem of user demand based\nUAV assignment over geographical areas subject to high traffic demands. A\nneural based cost function approach is formulated in which UAVs are matched to\na particular geographical area. It is shown that leveraging multiple UAVs not\nonly provides long range connectivity but also better load balancing and\ntraffic offload. Simulation study demonstrate that the proposed approach yields\nsignificant improvements in terms of 5th percentile spectral efficiency up to\n38\\% and reduced delays up to 37.5\\% compared to a ground-based network\nbaseline without UAVs.\n", "versions": [{"version": "v1", "created": "Sat, 9 Apr 2016 12:47:59 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Sharma", "Vishal", ""], ["Bennis", "Mehdi", ""], ["Kumar", "Rajesh", ""]]}, {"id": "1604.02636", "submitter": "Hafiz Attaul Mustafa", "authors": "Hafiz Attaul Mustafa, Muhammad Ali Imran, Muhammad Zeeshan Shakir, Ali\n  Imran, and Rahim Tafazolli", "title": "Separation Framework: An Enabler for Cooperative and D2D Communication\n  for Future 5G Networks", "comments": "28 pages, 11 figures, IEEE Communications Surveys & Tutorials 2015", "journal-ref": null, "doi": "10.1109/COMST.2015.2459596", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Soaring capacity and coverage demands dictate that future cellular networks\nneed to soon migrate towards ultra-dense networks. However, network\ndensification comes with a host of challenges that include compromised energy\nefficiency, complex interference management, cumbersome mobility management,\nburdensome signaling overheads and higher backhaul costs. Interestingly, most\nof the problems, that beleaguer network densification, stem from legacy\nnetworks' one common feature i.e., tight coupling between the control and data\nplanes regardless of their degree of heterogeneity and cell density.\nConsequently, in wake of 5G, control and data planes separation architecture\n(SARC) has recently been conceived as a promising paradigm that has potential\nto address most of aforementioned challenges. In this article, we review\nvarious proposals that have been presented in literature so far to enable SARC.\nMore specifically, we analyze how and to what degree various SARC proposals\naddress the four main challenges in network densification namely: energy\nefficiency, system level capacity maximization, interference management and\nmobility management. We then focus on two salient features of future cellular\nnetworks that have not yet been adapted in legacy networks at wide scale and\nthus remain a hallmark of 5G, i.e., coordinated multipoint (CoMP), and\ndevice-to-device (D2D) communications. After providing necessary background on\nCoMP and D2D, we analyze how SARC can particularly act as a major enabler for\nCoMP and D2D in context of 5G. This article thus serves as both a tutorial as\nwell as an up to date survey on SARC, CoMP and D2D. Most importantly, the\narticle provides an extensive outlook of challenges and opportunities that lie\nat the crossroads of these three mutually entangled emerging technologies.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 04:54:32 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Mustafa", "Hafiz Attaul", ""], ["Imran", "Muhammad Ali", ""], ["Shakir", "Muhammad Zeeshan", ""], ["Imran", "Ali", ""], ["Tafazolli", "Rahim", ""]]}, {"id": "1604.02660", "submitter": "Xiaohu Ge", "authors": "Xiaohu Ge, Hui Cheng, Guoqiang Mao, Yang Yang, Song Tu", "title": "Vehicular Communications for 5G Cooperative Small Cell Networks", "comments": "13 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The cooperative transmission is an effective approach for vehicular\ncommunications to improve the wireless transmission capacity and reliability in\nthe fifth generation (5G) small cell networks. Based on distances between the\nvehicle and cooperative small cell BSs, the cooperative probability and the\ncoverage probability have been derived for 5G cooperative small cell networks\nwhere small cell base stations (BSs) follow Poisson point process\ndistributions. Furthermore, the vehicular handoff rate and the vehicular\noverhead ratio have been proposed to evaluate the vehicular mobility\nperformance in 5G cooperative small cell networks. To balance the vehicular\ncommunication capacity and the vehicular handoff ratio, an optimal vehicular\noverhead ratio can be achieved by adjusting the cooperative threshold of 5G\ncooperative small cell networks.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 09:51:18 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Ge", "Xiaohu", ""], ["Cheng", "Hui", ""], ["Mao", "Guoqiang", ""], ["Yang", "Yang", ""], ["Tu", "Song", ""]]}, {"id": "1604.02665", "submitter": "Xiaohu Ge", "authors": "Ran Zi, Xiaohu Ge, John Thompson, Cheng-Xiang Wang, Haichao Wang, Tao\n  Han", "title": "Energy Efficiency Optimization of 5G Radio Frequency Chain Systems", "comments": "16 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the massive multi-input multi-output (MIMO) antennas technology adopted\nfor the fifth generation (5G) wireless communication systems, a large number of\nradio frequency (RF) chains have to be employed for RF circuits. However, a\nlarge number of RF chains not only increase the cost of RF circuits but also\nconsume additional energy in 5G wireless communication systems. In this paper\nwe investigate energy and cost efficiency optimization solutions for 5G\nwireless communication systems with a large number of antennas and RF chains.\nAn energy efficiency optimization problem is formulated for 5G wireless\ncommunication systems using massive MIMO antennas and millimeter wave\ntechnology. Considering the nonconcave feature of the objective function, a\nsuboptimal iterative algorithm, i.e., the energy efficient hybrid precoding\n(EEHP) algorithm is developed for maximizing the energy efficiency of 5G\nwireless communication systems. To reduce the cost of RF circuits, the energy\nefficient hybrid precoding with the minimum number of RF chains (EEHP-MRFC)\nalgorithm is also proposed. Moreover, the critical number of antennas searching\n(CNAS) and user equipment number optimization (UENO) algorithms are further\ndeveloped to optimize the energy efficiency of 5G wireless communication\nsystems by the number of transmit antennas and UEs. Compared with the maximum\nenergy efficiency of conventional zero-forcing (ZF) precoding algorithm,\nnumerical results indicate that the maximum energy efficiency of the proposed\nEEHP and EEHP-MRFC algorithms are improved by 220% and 171%, respectively.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 10:07:14 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Zi", "Ran", ""], ["Ge", "Xiaohu", ""], ["Thompson", "John", ""], ["Wang", "Cheng-Xiang", ""], ["Wang", "Haichao", ""], ["Han", "Tao", ""]]}, {"id": "1604.02747", "submitter": "Trung Kien Vu", "authors": "Trung Kien Vu, Sungoh Kwon, and Sangchul Oh", "title": "Cooperative Interference Mitigation Algorithm in Heterogeneous Networks", "comments": "key words: eICIC, ABSF, Interference Mitigation, Small Cell, HetNets,\n  IEICE TRANSACTIONS on Communications, Copyright @2015 The Institute of\n  Electronics, Information and Communication Engineers", "journal-ref": null, "doi": "10.1587/transcom.E98.B.2238", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heterogeneous hetworks (HetNets) have been introduced as an emerging\ntechnology in order to meet the increasing demand for mobile data. HetNets are\na combination of multi-layer networks such as macrocells and small cells. In\nsuch networks, users may suffer significant cross-layer interference. To manage\nthis interference, the 3rd Generation Partnership Project (3GPP) has introduced\nenhanced Inter-Cell Interference Coordination (eICIC) techniques. Almost Blank\nSubFrame (ABSF) is one of the time-domain techniques used in eICIC solutions.\nWe propose a dynamically optimal Signal-to-Interference-and-Noise Ratio\n(SINR)-based ABSF framework to ensure macro user performance while maintaining\nsmall user performance. We also study cooperative mechanisms to help small\ncells collaborate efficiently in order to reduce mutual interference.\nSimulations show that our proposed scheme achieves good performance and\noutperforms the existing ABSF frameworks.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 22:12:53 GMT"}], "update_date": "2016-04-15", "authors_parsed": [["Vu", "Trung Kien", ""], ["Kwon", "Sungoh", ""], ["Oh", "Sangchul", ""]]}, {"id": "1604.02750", "submitter": "Trung Kien Vu", "authors": "Trung Kien Vu, Mehdi Bennis, Sumudu Samarakoon, Merouane Debbah, Matti\n  Latva-aho", "title": "Joint In-Band Backhauling and Interference Mitigation in 5G\n  Heterogeneous Networks", "comments": "22th European Wireless Conference, 2016, Best Paper Award", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we study the problem of joint inband backhauling and\ninterference mitigation in 5G heterogeneous networks (HetNets) in which a\nmassive multiple-input multipleoutput (MIMO) macro cell base station equipped\nwith a large number of antennas, overlaid with self-backhauled small cells is\nassumed. This problem is cast as a network utility maximization subject to\nwireless backhaul constraints. Due to the non-tractability of the problem, we\nfirst resort to random matrix theory to get a closed-form expression of the\nachievable rate and transmit power in the asymptotic regime, i.e., as the\nnumber of antennas and users grows large. Subsequently, leveraging the\nframework of stochastic optimization, the problem is decoupled into dynamic\nscheduling of macro cell users and backhaul provisioning of small cells as a\nfunction of interference and backhaul links. Via simulations, we evaluate the\nperformance gains of our proposed framework under different network\narchitectures and low/high frequency bands. Our proposed HetNet method achieves\nthe achievable average UE throughput of 1.7 Gbps as well as ensures 1 Gbps\ncell-edge UE throughput when serving 200 UEs per km2 at 28 GHz with 1 GHz\nbandwidth. In ultra-dense network, the UE throughput at 28 GHz achieves 62x\ngain as compared to 2.4 GHz.\n", "versions": [{"version": "v1", "created": "Sun, 10 Apr 2016 22:17:43 GMT"}, {"version": "v2", "created": "Mon, 30 May 2016 07:03:03 GMT"}, {"version": "v3", "created": "Thu, 3 Nov 2016 10:30:18 GMT"}, {"version": "v4", "created": "Tue, 23 May 2017 09:09:12 GMT"}], "update_date": "2017-05-24", "authors_parsed": [["Vu", "Trung Kien", ""], ["Bennis", "Mehdi", ""], ["Samarakoon", "Sumudu", ""], ["Debbah", "Merouane", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1604.02802", "submitter": "Bin Yang", "authors": "Bin Yang, Guoqiang Mao, Xiaohu Ge, Hsiao-Hwa Chen, Tao Han, Xuefei\n  Zhang", "title": "Coverage Analysis of Heterogeneous Cellular Networks in Urban Areas", "comments": "6 pages, 2 figures; Accepted by IEEE ICC 2016", "journal-ref": null, "doi": "10.1109/ICC.2016.7510819", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, a network model incorporating both line-of-sight (LOS) and\nnon-line-of-sight (NLOS) transmissions is proposed to investigate impacts of\nblockages in urban areas on heterogeneous network coverage performance. Results\nshow that co-existence of NLOS and LOS transmissions has a significant impact\non network performance. We find in urban areas, that deploying more BSs in\ndifferent tiers is better than merely deploying all BSs in the same tier in\nterms of coverage probability.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 06:03:46 GMT"}, {"version": "v2", "created": "Thu, 21 Apr 2016 03:58:37 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Yang", "Bin", ""], ["Mao", "Guoqiang", ""], ["Ge", "Xiaohu", ""], ["Chen", "Hsiao-Hwa", ""], ["Han", "Tao", ""], ["Zhang", "Xuefei", ""]]}, {"id": "1604.02838", "submitter": "Tomaso Erseghe", "authors": "Nicola Piovesan, Tomaso Erseghe", "title": "Cooperative Localization in WSNs: a Hybrid Convex/non-Convex Solution", "comments": "9 pages, 6 figures, submitted to IEEE Transactions on Signal and\n  Information Processing over Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose an efficient solution to peer-to-peer localization in a wireless\nsensor network which works in two stages. At the first stage the optimization\nproblem is relaxed into a convex problem, given in the form recently proposed\nby Soares, Xavier, and Gomes. The convex problem is efficiently solved in a\ndistributed way by an ADMM approach, which provides a significant improvement\nin speed with respect to the original solution. In the second stage, a soft\ntransition to the original, non-convex, non relaxed formulation is applied in\nsuch a way to force the solution towards a local minimum. The algorithm is\nbuilt in such a way to be fully distributed, and it is tested in meaningful\nsituations, showing its effectiveness in localization accuracy and speed of\nconvergence, as well as its inner robustness.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 08:45:16 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Piovesan", "Nicola", ""], ["Erseghe", "Tomaso", ""]]}, {"id": "1604.02847", "submitter": "Costin Raiciu", "authors": "Radu Stoenescu, Matei Popovici, Lorina Negreanu and Costin Raiciu", "title": "SymNet: scalable symbolic execution for modern networks", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present SymNet, a network static analysis tool based on symbolic\nexecution. SymNet quickly analyzes networks by injecting symbolic packets and\ntracing their path through the network. Our key novelty is SEFL, a language we\ndesigned for network processing that is symbolic-execution friendly.\n  SymNet is easy to use: we have developed parsers that automatically generate\nSEFL models from router and switch tables, firewall configurations and\narbitrary Click modular router configurations. Most of our models are exact and\nhave optimal branching factor. Finally, we built a testing tool that checks\nSEFL models conform to the real implementation. SymNet can check networks\ncontaining routers with hundreds of thousands of prefixes and NATs in seconds,\nwhile ensuring packet header memory-safety and capturing network functionality\nsuch as dynamic tunneling, stateful processing and encryption. We used SymNet\nto debug middlebox interactions documented in the literature, to check our\ndepartment's network and the Stanford backbone network. Results show that\nsymbolic execution is fast and more accurate than existing static analysis\ntools.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 09:08:24 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Stoenescu", "Radu", ""], ["Popovici", "Matei", ""], ["Negreanu", "Lorina", ""], ["Raiciu", "Costin", ""]]}, {"id": "1604.02907", "submitter": "Hossein Nourikhah", "authors": "Hossein Nourikhah, Mohammad Kazem Akbari, Mohammad Kalantari", "title": "Modeling and predicting measured response time of cloud-based web\n  services using long-memory time series", "comments": null, "journal-ref": "The Journal of Supercomputing, February 2015, Volume 71, Issue 2,\n  pp 673-696", "doi": "10.1007/s11227-014-1317-4", "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Predicting cloud performance from user's perspective is a complex task,\nbecause of several factors involved in providing the service to the consumer.\nIn this work, the response time of 10 real-world services is analyzed. We have\nobserved long memory in terms of the measured response time of the\nCPU-intensive services and statistically verified this observation using\nestimators of the Hurst exponent. Then, na\\\"ive, mean, autoregressive\nintegrated moving average (ARIMA) and autoregressive fractionally integrated\nmoving average (ARFIMA) methods are used to forecast the future values of\nquality of service (QoS) at runtime. Results of the cross-validation over the\n10 datasets show that the long-memory ARFIMA model provides the mean of 37.5 %\nand the maximum of 57.8 % reduction in the forecast error when compared to the\nshort-memory ARIMA model according to the standard error measure of mean\nabsolute percentage error. Our work implies that consideration of the\nlong-range dependence in QoS data can help to improve the selection of services\naccording to their possible future QoS values.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 12:07:20 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Nourikhah", "Hossein", ""], ["Akbari", "Mohammad Kazem", ""], ["Kalantari", "Mohammad", ""]]}, {"id": "1604.02971", "submitter": "Lin Wang", "authors": "Lin Wang, Lei Jiao, Mateusz Guzek, Dzmitry Kliazovich, Pascal Bouvry", "title": "Achieving Energy Efficiency in Cloud Brokering", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The proliferation of cloud providers has brought substantial interoperability\ncomplexity to the public cloud market, in which cloud brokering has been\nplaying an important role. However, energy-related issues for public clouds\nhave not been well addressed in the literature. In this paper, we claim that\nthe broker is also situated in a perfect position where necessary actions can\nbe taken to achieve energy efficiency for public cloud systems, particularly\nthrough job assignment and scheduling. We formulate the problem by a mixed\ninteger program and prove its NP-hardness. Based on the complexity analysis, we\nsimplify the problem by introducing admission control on jobs. In the sequel,\noptimal job assignment can be done straightforwardly and the problem is\ntransformed into improving job admission rate by scheduling on two coupled\nphases: data transfer and job execution. The two scheduling phases are further\ndecoupled and we develop efficient scheduling algorithm for each of them.\nExperimental results show that the proposed solution can achieve significant\nreduction on energy consumption with admission rates improved as well, even in\nlarge-scale public cloud systems.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 14:21:00 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Wang", "Lin", ""], ["Jiao", "Lei", ""], ["Guzek", "Mateusz", ""], ["Kliazovich", "Dzmitry", ""], ["Bouvry", "Pascal", ""]]}, {"id": "1604.02986", "submitter": "Paul Keeler Dr", "authors": "Paul Keeler and Nathan Ross and Aihua Xia and Bartlomiej Blaszczyszyn", "title": "Stronger wireless signals appear more Poisson", "comments": "7 pages with 1.5 line spacing", "journal-ref": "IEEE wireless communications letters, 2016", "doi": "10.1109/LWC.2016.2601913", "report-no": null, "categories": "cs.NI cs.IT math.IT math.PR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Keeler, Ross and Xia (2016) recently derived approximation and convergence\nresults, which imply that the point process formed from the signal strengths\nreceived by an observer in a wireless network under a general statistical\npropagation model can be modelled by an inhomogeneous Poisson point process on\nthe positive real line. The basic requirement for the results to apply is that\nthere must be a large number of transmitters with different locations and\nrandom propagation effects.The aim of this note is to apply some of the main\nresults of Keeler, Ross and Xia (2016) in a less general but more easily\napplicable form to illustrate how the results can be applied in practice. New\nresults are derived that show that it is the strongest signals, after being\nweakened by random propagation effects, that behave like a Poisson process,\nwhich supports recent experimental work.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 15:01:21 GMT"}, {"version": "v2", "created": "Wed, 13 Apr 2016 10:04:42 GMT"}, {"version": "v3", "created": "Mon, 20 Jun 2016 15:31:32 GMT"}], "update_date": "2016-11-09", "authors_parsed": [["Keeler", "Paul", ""], ["Ross", "Nathan", ""], ["Xia", "Aihua", ""], ["Blaszczyszyn", "Bartlomiej", ""]]}, {"id": "1604.03083", "submitter": "H\\\"useyin  Yi\\u{g}itler", "authors": "H\\\"useyin Yi\\u{g}itler, Riku J\\\"antti, Ossi Kaltiokallio, and Neal\n  Patwari", "title": "Detector Based Radio Tomographic Imaging", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.ET cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Received signal strength based radio tomographic imaging is a popular\ndevice-free indoor localization method which reconstructs the spatial loss\nfield of the environment using measurements from a dense wireless network.\nExisting methods solve an associated inverse problem using algebraic or\ncompressed sensing reconstruction algorithms. We propose an alternative imaging\nmethod that reconstructs spatial field of occupancy using a back-projection\nbased reconstruction algorithm. The introduced system has the following\nadvantages over the other imaging based methods: i.) significantly lower\ncomputational complexity such that no floating point multiplication is\nrequired; ii.) each link's measured data is compressed to a single bit,\nproviding improved scalability; iii.) physically significant and repeatable\nparameters. The proposed method is validated using measurement data. Results\nshow that the proposed method achieves the above advantages without loss of\naccuracy compared to the other available methods.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 19:48:04 GMT"}], "update_date": "2016-04-12", "authors_parsed": [["Yiğitler", "Hüseyin", ""], ["Jäntti", "Riku", ""], ["Kaltiokallio", "Ossi", ""], ["Patwari", "Neal", ""]]}, {"id": "1604.03175", "submitter": "Stratis Ioannidis", "authors": "Stratis Ioannidis, Edmund Yeh", "title": "Adaptive Caching Networks with Optimality Guarantees", "comments": "This is the extended version of: \"Adaptive Caching Networks with\n  Optimality Guarantees\", Stratis Ioannidis and Edmund Yeh, SIGMETRICS 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the problem of optimal content placement over a network of caches, a\nproblem naturally arising in several networking applications, including ICNs,\nCDNs, and P2P systems. Given a demand of content request rates and paths\nfollowed, we wish to determine the content placement that maximizes the\nexpected caching gain, i.e., the reduction of routing costs due to intermediate\ncaching. The offline version of this problem is NP-hard and, in general, the\ndemand and topology may be a priori unknown. Hence, a distributed, adaptive,\nconstant approximation content placement algorithm is desired. We show that\npath replication, a simple algorithm frequently encountered in literature, can\nbe arbitrarily suboptimal when combined with traditional eviction policies,\nlike LRU, LFU, or FIFO. We propose a distributed, adaptive algorithm that\nperforms stochastic gradient ascent on a concave relaxation of the expected\ncaching gain, and constructs a probabilistic content placement within 1-1/e\nfactor from the optimal, in expectation. Motivated by our analysis, we also\npropose a novel greedy eviction policy to be used with path replication, and\nshow through numerical evaluations that both algorithms significantly\noutperform path replication with traditional eviction policies over a broad\narray of network topologies.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 23:25:18 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Ioannidis", "Stratis", ""], ["Yeh", "Edmund", ""]]}, {"id": "1604.03183", "submitter": "Harpreet S. Dhillon", "authors": "Jeffrey G. Andrews, Abhishek K. Gupta, Harpreet S. Dhillon", "title": "A Primer on Cellular Network Analysis Using Stochastic Geometry", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This tutorial is intended as an accessible but rigorous first reference for\nsomeone interested in learning how to model and analyze cellular network\nperformance using stochastic geometry. In particular, we focus on computing the\nsignal-to-interference-plus-noise ratio (SINR) distribution, which can be\ncharacterized by the coverage probability (the SINR CCDF) or the outage\nprobability (its CDF). We model base stations (BSs) in the network as a\nrealization of a homogeneous Poisson point process of density $\\lambda$, and\ncompute the SINR for three main cases: the downlink, uplink, and finally the\nmulti-tier downlink, which is characterized by having $k$ tiers of BSs each\nwith a unique density $\\lambda_i$ and transmit power $p_i$. These three\nbaseline results have been extensively extended to many different scenarios,\nand we conclude with a brief summary of some of those extensions.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 00:23:36 GMT"}, {"version": "v2", "created": "Wed, 5 Oct 2016 17:59:41 GMT"}], "update_date": "2016-10-06", "authors_parsed": [["Andrews", "Jeffrey G.", ""], ["Gupta", "Abhishek K.", ""], ["Dhillon", "Harpreet S.", ""]]}, {"id": "1604.03217", "submitter": "Sabrina Nefti", "authors": "Sabrina Nefti, Maamar Sedrati", "title": "PSNR and Jitter Analysis of Routing Protocols for Video Streaming in\n  Sparse MANET Networks, using NS2 and the Evalvid Framework", "comments": "International Journal of Computer Science and Information Security,\n  published in Vol. 14 No. 3 MARCH 2016 International Journal of Computer\n  Science and Information Security", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in multimedia and ad-hoc networking have urged a wealth of research\nin multimedia delivery over ad-hoc networks. This comes as no surprise, as\nthose networks are versatile and beneficial to a plethora of applications where\nthe use of fully wired network has proved intricate if not impossible, such as\nprompt formation of networks during conferences, disaster relief in case of\nflood and earthquake, and also in war activities. It this paper, we aim to\ninvestigate the combined impact of network sparsity and network node density on\nthe Peak Signal Noise to Ratio (PSNR) and jitter performance of proactive and\nreactive routing protocols in ad-hoc networks. We also shed light onto the\ncombined effect of mobility and sparsity on the performance of these protocols.\nWe validate our results through the use of an integrated Simulator-Evaluator\nenvironment consisting of the Network Simulator NS2, and the Video Evaluation\nFramework Evalvid.\n", "versions": [{"version": "v1", "created": "Mon, 11 Apr 2016 09:07:01 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Nefti", "Sabrina", ""], ["Sedrati", "Maamar", ""]]}, {"id": "1604.03246", "submitter": "Hongliang Zhang", "authors": "Hongliang Zhang, Lingyang Song, and Zhu Han", "title": "Radio Resource Allocation for Device-to-Device Underlay Communication\n  Using Hypergraph Theory", "comments": "27 pages,10 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Device-to-Device (D2D) communication has been recognized as a promising\ntechnique to offload the traffic for the evolved Node B (eNB). However, the D2D\ntransmission as an underlay causes severe interference to both the cellular and\nother D2D links, which imposes a great technical challenge to radio resource\nallocation. Conventional graph based resource allocation methods typically\nconsider the interference between two user equipments (UEs), but they cannot\nmodel the interference from multiple UEs to completely characterize the\ninterference. In this paper, we study channel allocation using hypergraph\ntheory to coordinate the interference between D2D pairs and cellular UEs, where\nan arbitrary number of D2D pairs are allowed to share the uplink channels with\nthe cellular UEs. Hypergraph coloring is used to model the cumulative\ninterference from multiple D2D pairs, and thus, eliminate the mutual\ninterference. Simulation results show that the system capacity is significantly\nimproved using the proposed hypergraph method in comparison to the conventional\ngraph based one.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 04:49:06 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Zhang", "Hongliang", ""], ["Song", "Lingyang", ""], ["Han", "Zhu", ""]]}, {"id": "1604.03324", "submitter": "Duc-Tuyen Ta", "authors": "Duc-Tuyen Ta and Nhan Nguyen-Thanh and Patrick Maille and Phillippe\n  Ciblat and Van-Tam Nguyen", "title": "Mitigating selfish primary user emulation attacks in multi-channel\n  cognitive radio networks: A surveillance game", "comments": "6 pages; Globecom'16", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Primary User Emulation Attack (PUEA), in which attackers emulate primary user\nsignals causing restriction of secondary access on the attacked channels, is a\nserious security problem in Cognitive Radio Networks (CRNs). An user performing\na PUEA for selfishly occupying more channels is called a selfish PUEA attacker.\nNetwork managers could adopt a surveillance process on disallowed channels for\nidentifying illegal channel occupation of selfish PUEA attackers and hence\nmitigating selfish PUEA. Determining surveillance strategies, particularly in\nmulti-channel context, is necessary for ensuring network operation fairness. In\nthis paper, we formulate a game, called multi-channel surveillance game,\nbetween the selfish attack and the surveillance process in multi-channel CRNs.\nThe sequence-form representation method is adopted to determine the Nash\nEquilibrium (NE) of the game. We show that performing the obtained NE\nsurveillance strategy significantly mitigates selfish PUEA.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 09:47:12 GMT"}, {"version": "v2", "created": "Tue, 19 Apr 2016 13:33:38 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Ta", "Duc-Tuyen", ""], ["Nguyen-Thanh", "Nhan", ""], ["Maille", "Patrick", ""], ["Ciblat", "Phillippe", ""], ["Nguyen", "Van-Tam", ""]]}, {"id": "1604.03330", "submitter": "Trung Kien Vu", "authors": "Trung Kien Vu and Sungoh Kwon", "title": "Mobility-Assisted on-Demand Routing Algorithm for MANETs in the Presence\n  of Location Errors", "comments": "Special Issues on Recent Advances in Communications and Networking,\n  The Scientific World Journal, 11 figures", "journal-ref": null, "doi": "10.1155/2014/790103", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a mobility-assisted on-demand routing algorithm for mobile ad hoc\nnetworks in the presence of location errors. Location awareness enables mobile\nnodes to predict their mobility and enhances routing performance by estimating\nlink duration and selecting reliable routes. However, measured locations\nintrinsically include errors in measurement. Such errors degrade mobility\nprediction and have been ignored in previous work. To mitigate the impact of\nlocation errors on routing, we propose an on-demand routing algorithm taking\ninto account location errors. To that end, we adopt the Kalman filter to\nestimate accurate locations and consider route confidence in discovering\nroutes. Via simulations, we compare our algorithmand previous algorithms in\nvarious environments. Our proposed mobility prediction is robust to the\nlocation errors.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 10:19:08 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Vu", "Trung Kien", ""], ["Kwon", "Sungoh", ""]]}, {"id": "1604.03396", "submitter": "Onur \\c{C}a\\u{g}{\\i}r{\\i}c{\\i} M.Sc.", "authors": "Onur Cagirici", "title": "Avoiding the Flip Ambiguities in 2D Wireless Sensor Localization by\n  Using Unit Disk Graph Property", "comments": "11 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a range-based localization algorithm to localize a\nwireless sensor network (WSN) in 2D. A widely used algorithm to localize a WSN\nin 2D is trilateration, which runs in polynomial time. Trilateration uses three\ndistance measurements to localize a node. In some cases, the lack of\nconnectivity leads to a low percentage of localized nodes since a node's\nposition can be fixed using three distance measurements. We propose an\nalgorithm that finds the position of a node by using the absence of a distance\nmeasurement in addition to a third distance measurement. If two nodes are not\nable to sense each other, that means the distance between them is more than the\nsensing range. Therefore, our algorithm checks if the possible positions of an\nunlocalized node $u$ is inside the sensing range of a localized node $\\ell$\nthat is not the neighbor of $u$. In such case, we eliminate one of the possible\npositions.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 13:22:30 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Cagirici", "Onur", ""]]}, {"id": "1604.03435", "submitter": "Sergio Valcarcel Macua", "authors": "Sergio Valcarcel Macua, Santiago Zazo, Javier Zazo, Marina P\\'erez\n  Jim\\'enez, Iv\\'an P\\'erez-\\'Alvarez, Eugenio Jim\\'enez, Joaqu\\'in Hern\\'andez\n  Brito", "title": "Simulation of Underwater RF Wireless Sensor Networks using Castalia", "comments": "Underwater Communications and Networking 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We use real measurements of the underwater channel to simulate a whole\nunderwater RF wireless sensor networks, including propagation impairments\n(e.g., noise, interference), radio hardware (e.g., modulation scheme,\nbandwidth, transmit power), hardware limitations (e.g., clock drift,\ntransmission buffer) and complete MAC and routing protocols. The results should\nbe useful for designing centralized and distributed algorithms for applications\nlike monitoring, event detection, localization and aid to navigation. We also\nexplain the changes that have to be done to Castalia in order to perform the\nsimulations.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 15:07:34 GMT"}], "update_date": "2016-04-13", "authors_parsed": [["Macua", "Sergio Valcarcel", ""], ["Zazo", "Santiago", ""], ["Zazo", "Javier", ""], ["Jiménez", "Marina Pérez", ""], ["Pérez-Álvarez", "Iván", ""], ["Jiménez", "Eugenio", ""], ["Brito", "Joaquín Hernández", ""]]}, {"id": "1604.03608", "submitter": "Sergio Valcarcel Macua", "authors": "Javier Zazo, Santiago Zazo, Sergio Valcarcel Macua, Marina P\\'erez,\n  Iv\\'an P\\'erez-\\'Alvarez, Laura Cardona, Eduardo Quevedo", "title": "Cooperative Network Node Positioning Techniques Using Underwater Radio\n  Communications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze the problem of localization algorithms for underwater sensor\nnetworks. We first characterize the underwater channel for radio communications\nand adjust a linear model with measurements of real transmissions. We propose\nan algorithm where the sensor nodes collaboratively estimate their unknown\npositions in the network. In this setting, we assume low connectivity of the\nnodes, low data rates, and nonzero probability of lost packets in the\ntransmission. Finally, we consider the problem of a node estimating it's\nposition in underwater navigation. We also provide simulations illustrating the\nprevious proposals.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 22:28:08 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Zazo", "Javier", ""], ["Zazo", "Santiago", ""], ["Macua", "Sergio Valcarcel", ""], ["Pérez", "Marina", ""], ["Pérez-Álvarez", "Iván", ""], ["Cardona", "Laura", ""], ["Quevedo", "Eduardo", ""]]}, {"id": "1604.03633", "submitter": "Ramy Amer Dr", "authors": "Ramy Amer, Amr A. El-Sherif, Hanaa Ebrahim and Amr Mokhtar", "title": "Cooperation and Underlay Mode Selection in Cognitive Radio Network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this research, we proposes a new method for cooperation and underlay mode\nselection in cognitive radio networks. We characterize the maximum achievable\nthroughput of our proposed method of hybrid spectrum sharing. Hybrid spectrum\nsharing is assumed where the Secondary User (SU) can access the Primary User\n(PU) channel in two modes, underlay mode or cooperative mode with admission\ncontrol. In addition to access the channel in the overlay mode, secondary user\nis allowed to occupy the channel currently occupied by the primary user but\nwith small transmission power. Adding the underlay access modes attains more\nopportunities to the secondary user to transmit data. It is proposed that the\nsecondary user can only exploits the underlay access when the channel of the\nprimary user direct link is good or predicted to be in non-outage state.\nTherefore, the secondary user could switch between underlay spectrum sharing\nand cooperation with the primary user. Hybrid access is regulated through\nmonitoring the state of the primary link. By observing the simulation results,\nthe proposed model attains noticeable improvement in the system performance in\nterms of maximum secondary user throughput than the conventional cooperation\nand non-cooperation schemes.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 02:30:36 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Amer", "Ramy", ""], ["El-Sherif", "Amr A.", ""], ["Ebrahim", "Hanaa", ""], ["Mokhtar", "Amr", ""]]}, {"id": "1604.03764", "submitter": "Lin Gao", "authors": "Lin Gao, Lingjie Duan, and Jianwei Huang", "title": "Two-sided Matching Based Cooperative Spectrum Sharing", "comments": "This manuscript serves as the online technical report for the paper\n  with the same title published in IEEE Transactions on Mobile Computing, 2016", "journal-ref": null, "doi": "10.1109/TMC.2016.2557794", "report-no": null, "categories": "cs.GT cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Dynamic spectrum access (DSA) can effectively improve the spectrum efficiency\nand alleviate the spectrum scarcity, by allowing unlicensed secondary users\n(SUs) to access the licensed spectrum of primary users (PUs) opportunistically.\nCooperative spectrum sharing is a new promising paradigm to provide necessary\nincentives for both PUs and SUs in dynamic spectrum access. The key idea is\nthat SUs relay the traffic of PUs in exchange for the access time on the PUs'\nlicensed spectrum. In this paper, we formulate the cooperative spectrum sharing\nbetween multiple PUs and multiple SUs as a two-sided market, and study the\nmarket equilibrium under both complete and incomplete information. First, we\ncharacterize the sufficient and necessary conditions for the market\nequilibrium. We analytically show that there may exist multiple market\nequilibria, among which there is always a unique Pareto-optimal equilibrium for\nPUs (called PU-Optimal-EQ), in which every PU achieves a utility no worse than\nin any other equilibrium. Then, we show that under complete information, the\nunique Pareto-optimal equilibrium PU-Optimal-EQ can always be achieved despite\nthe competition among PUs; whereas, under incomplete information, the\nPU-Optimal-EQ may not be achieved due to the mis-representations of SUs (in\nreporting their private information). Regarding this, we further study the\nworse-case equilibrium for PUs, and characterize a Robust equilibrium for PUs\n(called PU-Robust-EQ), which provides every PU a guaranteed utility under all\npossible mis-representation behaviors of SUs. Numerical results show that in a\ntypical network where the number of PUs and SUs are different, the performance\ngap between PU-Optimal-EQ and PU-Robust-EQ is quite small (e.g., less than 10%\nin the simulations).\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 13:36:04 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Gao", "Lin", ""], ["Duan", "Lingjie", ""], ["Huang", "Jianwei", ""]]}, {"id": "1604.03823", "submitter": "Guilherme Thompson", "authors": "Fabrice Guillemin and Guilherme Thompson", "title": "Analysis of a trunk reservation policy in the framework of fog computing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze in this paper a system composed of two data centers with limited\ncapacity in terms of servers. When one request for a single server is blocked\nat the first data center, this request is forwarded to the second one. To\nprotect the single server requests originally assigned to the second data\ncenter, a trunk reservation policy is introduced (i.e., a redirected request is\naccepted only if there is a sufficient number of free servers at the second\ndata center). After rescaling the system by assuming that there are many\nservers in both data centers and high request arrival rates, we are led to\nanalyze a random walk in the quarter plane, which has the particularity of\nhaving non constant reflecting conditions on one boundary of the quarter plane.\nContrary to usual reflected random walks, to compute the stationary\ndistribution of the presented random walk, we have to determine three unknown\nfunctions, one polynomial and two infinite generating functions. We show that\nthe coefficients of the polynomial are solutions to a linear system. After\nsolving this linear system, we are able to compute the two other unknown\nfunctions and the blocking probabilities at both data centers. Numerical\nexperiments are eventually performed to estimate the gain achieved by the trunk\nreservation policy.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 15:14:08 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Guillemin", "Fabrice", ""], ["Thompson", "Guilherme", ""]]}, {"id": "1604.03867", "submitter": "Marek Sawerwain", "authors": "Marek Sawerwain and Joanna Wi\\'sniewska", "title": "Quantum network protocol for qudits with use of quantum repeaters and\n  Pauli Z-type operational errors", "comments": "10 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "quant-ph cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this chapter a quantum communication protocol with use of repeaters is\npresented. The protocol is constructed for qudits i.e. the generalized quantum\ninformation units. One-dit teleportation is based on the generalized Pauli-Z\n(phase-flip) gate's correction. This approach avoids using Pauli-X and Hadamard\ngates unlike in other known protocols based on quantum repeaters which were\nconstructed for qubits and qudits. It is also important to mention that the\nrepeaters based on teleportation protocol, described in this chapter, allow a\nmeasurement in the standard base (what simplifies the measurement process) and\nthe use of teleportation causes only Pauli-Z operational errors.\n", "versions": [{"version": "v1", "created": "Wed, 13 Apr 2016 17:04:04 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Sawerwain", "Marek", ""], ["Wiśniewska", "Joanna", ""]]}, {"id": "1604.03871", "submitter": "Maria Potop-Butucaru", "authors": "Silvia Bonomi (DIAG), Antonella Del Pozzo (NPA, DIAG), Maria\n  Potop-Butucaru (NPA), S\\'ebastien Tixeuil (NPA)", "title": "Approximate Agreement under Mobile Byzantine Faults", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we address Approximate Agreement problem in the Mobile\nByzantine faults model. Our contribution is threefold. First, we propose the\nthe first mapping from the existing variants of Mobile Byzantine models to the\nMixed-Mode faults model.This mapping further help us to prove the correctness\nof class MSR (Mean-Subsequence-Reduce) Approximate Agreement algorithms in the\nMobile Byzantine fault model, and is of independent interest. Secondly, we\nprove lower bounds for solving Approximate Agreement under all existing Mobile\nByzantine faults models. Interestingly, these lower bounds are different from\nthe static bounds. Finally, we propose matching upper bounds. Our paper is the\nfirst to link the Mobile Byzantine Faults models and the Mixed-Mode Faults\nmodels, and we advocate that a similar approach can be adopted in order to\nprove the correctness of other classical distributed building blocks (e.g.\nagreement, clock synchronization, interactive consistency etc) under Mobile\nByzantine Faults model.\n", "versions": [{"version": "v1", "created": "Tue, 12 Apr 2016 14:50:55 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Bonomi", "Silvia", "", "DIAG"], ["Del Pozzo", "Antonella", "", "NPA, DIAG"], ["Potop-Butucaru", "Maria", "", "NPA"], ["Tixeuil", "Sébastien", "", "NPA"]]}, {"id": "1604.03889", "submitter": "Pan Zhou Prof.", "authors": "Pan Zhou", "title": "Secure Communication through Wireless-Powered Friendly Jamming: Jointly\n  Online Optimization over Geography, Energy and Time", "comments": "arXiv admin note: substantial text overlap with arXiv:1504.06937 by\n  other authors", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exploring the interference-emitting friendly jammers to protect the sensitive\ncommunications in the presence of eavesdroppers has increasingly being\ninvestigated in literature. In parallel, scavenging energy from abient radio\nsignals for energy-constrained devices, namely \\emph{wireless energy\nharvesting} (WEH), has also drawn significant attention. Without relying on\nexternal energy supply, the wireless-powered friendly jammer by WEH from\nlegitimate wireless devices is an effective approach to prolong their lifetime\nand gain the flexibility in deployments. This paper studies the online\noptimization of the placement and WEH of a set of friendly jammers in a\ngeographic location with the energy-efficiency (EE) consideration. We adopt a\nsimple \"time switching\" protocol where power transfer and jammer-assisted\nsecure communications occur in different time blocks when WEH requests are\nlaunched. Our scheme has the following important advantages: 1) The proposed\nonline jammers placement and interfering power allocation to attack\neavesdroppers is the first distributed and scalable solutions within any\nspecified geographic region, 2) We model the WEH for jammers as a \\emph{JAM-NET\nlifetime maximization problem}, where online scheduling algorithms with\nheterogeneous energy demands of each jammer (from energy sources) are designed,\n3) Under our model, the problem of placing a minimum number of jammers with\ndistance-based power assignments is NP-hard, and near optimal PTAS\napproximation algorithms are provided, 4) When durations of the eavesdropping\nand legitimate communicating are available and the scenario is extended to the\nmulti-channels setting, our results are strengthened to see further improved EE\nand reduced number of jammers. Simulations back up our theory.\n", "versions": [{"version": "v1", "created": "Wed, 17 Feb 2016 03:33:45 GMT"}], "update_date": "2016-04-14", "authors_parsed": [["Zhou", "Pan", ""]]}, {"id": "1604.04009", "submitter": "Wayes Tushar", "authors": "Sanjana Kadaba Viswanath, Chau Yuen, Wayes Tushar, Wen-Tai Li,\n  Chao-Kai Wen, Kun Hu, Cheng Chen and Xiang Liu", "title": "System Design of Internet-of-Things for Residential Smart Grid", "comments": "10 pages, 6 figures, journal paper", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Internet-of-Things (IoTs) envisions to integrate, coordinate, communicate,\nand collaborate real-world objects in order to perform daily tasks in a more\nintelligent and efficient manner. To comprehend this vision, this paper studies\nthe design of a large scale IoT system for smart grid application, which\nconstitutes a large number of home users and has the requirement of fast\nresponse time. In particular, we focus on the messaging protocol of a universal\nIoT home gateway, where our cloud enabled system consists of a backend server,\nunified home gateway (UHG) at the end users, and user interface for mobile\ndevices. We discuss the features of such IoT system to support a large scale\ndeployment with a UHG and real-time residential smart grid applications. Based\non the requirements, we design an IoT system using the XMPP protocol, and\nimplemented in a testbed for energy management applications. To show the\neffectiveness of the designed testbed, we present some results using the\nproposed IoT architecture.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 01:38:19 GMT"}], "update_date": "2016-04-15", "authors_parsed": [["Viswanath", "Sanjana Kadaba", ""], ["Yuen", "Chau", ""], ["Tushar", "Wayes", ""], ["Li", "Wen-Tai", ""], ["Wen", "Chao-Kai", ""], ["Hu", "Kun", ""], ["Chen", "Cheng", ""], ["Liu", "Xiang", ""]]}, {"id": "1604.04158", "submitter": "Duo Han", "authors": "Han Duo, Wu Junfeng, Zhang Huanshui, Shi Ling", "title": "Optimal Sensor Scheduling for Multiple Linear Dynamical Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We consider the design of an optimal collision-free sensor schedule for a\nnumber of sensors which monitor different linear dynamical systems\ncorrespondingly. At each time, only one of all the sensors can send its local\nestimate to the remote estimator. A preliminary work for the two-sensor\nscheduling case has been studied in the literature. The generalization into\nmultiple-sensor scheduling case is shown to be nontrivial. We first find a\nnecessary condition of the optimal solution provided that the spectral radii of\nany two system matrices are not equal, which can significantly reduce the\nfeasible optimal solution space without loss of performance. By modelling a\nfinite-state Markov decision process (MDP) problem, we can numerically search\nan asymptotic periodic schedule which is proven to be optimal. From a practical\nviewpoint, the computational complexity is formidable for some special system\nmodels, e.g., the spectral radii of some certain system matrices are far from\nothers'. Some simple but effective suboptimal schedules for any systems are\nproposed. We also find a lower bound of the optimal cost, which enables us to\nquantify the performance gap between any suboptimal schedule and the optimal\none.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 13:57:38 GMT"}], "update_date": "2016-04-15", "authors_parsed": [["Duo", "Han", ""], ["Junfeng", "Wu", ""], ["Huanshui", "Zhang", ""], ["Ling", "Shi", ""]]}, {"id": "1604.04248", "submitter": "Emil Bj\\\"ornson", "authors": "Emil Bj\\\"ornson, Elisabeth de Carvalho, Jesper H. S{\\o}rensen, Erik G.\n  Larsson, Petar Popovski", "title": "A Random Access Protocol for Pilot Allocation in Crowded Massive MIMO\n  Systems", "comments": "To appear in IEEE Transactions on Wireless Communications, 16 pages,\n  10 figures. This is reproducible research with simulation code available at\n  https://github.com/emilbjornson/sucre-protocol", "journal-ref": null, "doi": "10.1109/TWC.2017.2660489", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Massive MIMO (multiple-input multiple-output) technology has great\npotential to manage the rapid growth of wireless data traffic. Massive MIMO\nachieves tremendous spectral efficiency by spatial multiplexing of many tens of\nuser equipments (UEs). These gains are only achieved in practice if many more\nUEs can connect efficiently to the network than today. As the number of UEs\nincreases, while each UE intermittently accesses the network, the random access\nfunctionality becomes essential to share the limited number of pilots among the\nUEs. In this paper, we revisit the random access problem in the Massive MIMO\ncontext and develop a reengineered protocol, termed strongest-user collision\nresolution (SUCRe). An accessing UE asks for a dedicated pilot by sending an\nuncoordinated random access pilot, with a risk that other UEs send the same\npilot. The favorable propagation of Massive MIMO channels is utilized to enable\ndistributed collision detection at each UE, thereby determining the strength of\nthe contenders' signals and deciding to repeat the pilot if the UE judges that\nits signal at the receiver is the strongest. The SUCRe protocol resolves the\nvast majority of all pilot collisions in crowded urban scenarios and continues\nto admit UEs efficiently in overloaded networks.\n", "versions": [{"version": "v1", "created": "Thu, 14 Apr 2016 18:18:55 GMT"}, {"version": "v2", "created": "Sat, 11 Feb 2017 08:15:59 GMT"}], "update_date": "2017-02-14", "authors_parsed": [["Björnson", "Emil", ""], ["de Carvalho", "Elisabeth", ""], ["Sørensen", "Jesper H.", ""], ["Larsson", "Erik G.", ""], ["Popovski", "Petar", ""]]}, {"id": "1604.04320", "submitter": "Aryan Azimzadeh", "authors": "Aryan Azimzadeh, Nasseh Tabrizi", "title": "A Dynamic Power Management Schema for Multi-Tier Data Centers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An issue of great concern as it relates to global warming is power\nconsumption and efficient use of computers especially in large data centers.\nData centers have an important role in IT infrastructures because of their huge\npower consumption.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 00:32:24 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Azimzadeh", "Aryan", ""], ["Tabrizi", "Nasseh", ""]]}, {"id": "1604.04457", "submitter": "Jean-Marc Kelif", "authors": "Jean-Marc Kelif and Marceau Coupechoux", "title": "A 3D Spatial Fluid Model for Wireless Networks", "comments": "7 pages, 14 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article we develop a three dimensional (3D) analytical model of\nwireless networks. We establish an analytical expression of the SINR (Signal to\nInterference plus Noise Ratio) of user equipments (UE), by using a 3D fluid\nmodel approach of the network. This model enables to evaluate in a simple way\nthe cumulative distribution function of the SINR, and therefore the\nperformance, the quality of service and the coverage of wireless networks, with\na high accuracy. The use of this 3D wireless network model, instead of a\nstandard two-dimensional one, in order to analyze wireless networks, is\nparticularly interesting. Indeed, this 3D model enables to establish more\naccurate performance and quality of services results than a 2D one.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 12:18:43 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Kelif", "Jean-Marc", ""], ["Coupechoux", "Marceau", ""]]}, {"id": "1604.04465", "submitter": "Stefan Schmid", "authors": "Liron Schiff and Stefan Schmid", "title": "PRI: Privacy Preserving Inspection of Encrypted Network Traffic", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Traffic inspection is a fundamental building block of many security solutions\ntoday. For example, to prevent the leakage or exfiltration of confidential\ninsider information, as well as to block malicious traffic from entering the\nnetwork, most enterprises today operate intrusion detection and prevention\nsystems that inspect traffic. However, the state-of-the-art inspection systems\ndo not reflect well the interests of the different involved autonomous roles.\nFor example, employees in an enterprise, or a company outsourcing its network\nmanagement to a specialized third party, may require that their traffic remains\nconfidential, even from the system administrator. Moreover, the rules used by\nthe intrusion detection system, or more generally the configuration of an\nonline or offline anomaly detection engine, may be provided by a third party,\ne.g., a security research firm, and can hence constitute a critical business\nasset which should be kept confidential. Today, it is often believed that\naccounting for these additional requirements is impossible, as they contradict\nefficiency and effectiveness. We in this paper explore a novel approach, called\nPrivacy Preserving Inspection (PRI), which provides a solution to this problem,\nby preserving privacy of traffic inspection and confidentiality of inspection\nrules and configurations, and e.g., also supports the flexible installation of\nadditional Data Leak Prevention (DLP) rules specific to the company.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 12:48:05 GMT"}], "update_date": "2016-04-18", "authors_parsed": [["Schiff", "Liron", ""], ["Schmid", "Stefan", ""]]}, {"id": "1604.04634", "submitter": "Marcel Caria", "authors": "Marcel Caria, Admela Jukan, Marco Hoffmann", "title": "SDN Partitioning: A Centralized Control Plane for Distributed Routing\n  Protocols", "comments": "14 pages, 12 figures", "journal-ref": null, "doi": "10.1109/TNSM.2016.2585759", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Hybrid IP networks that use both control paradigms - distributed and\ncentralized - promise the best of two worlds: programmability and agility of\nSDN, and reliability and fault tolerance of distributed routing protocols like\nOSPF. The common approaches follow a division of labor concept, where SDN\ncontrols prioritized traffic and OSPF assures care-free operation of best\neffort traffic. We propose SDN Partitioning, which establishes centralized\ncontrol over the distributed routing protocol by partitioning the topology into\nsub-domains with SDN-enabled border nodes, such that OSPF's routing updates\nhave to traverse SDN border nodes to reach neighboring sub-domains. This allows\nthe central controller to modify how sub-domains view one another, which in\nturn allows to steer inter-sub-domain traffic. The degree of dynamic control\nagainst simplicity of OSPF can be trade off by adjusting the size of the\nsub-domains. This paper explains the technical requirements, presents a novel\nscheme for balanced topology partitioning, and provides the models for common\nnetwork management tasks. Our performance evaluation shows that - already in\nits minimum configuration with two sub-domains - SDN Partitioning provides\nsignificant improvements in all respects compared to legacy routing protocols,\nwhereas smaller sub-domains provide network control capabilities comparable to\nfull SDN deployment.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 20:28:58 GMT"}], "update_date": "2016-10-27", "authors_parsed": [["Caria", "Marcel", ""], ["Jukan", "Admela", ""], ["Hoffmann", "Marco", ""]]}, {"id": "1604.04640", "submitter": "Anastasios Giovanidis", "authors": "Luis David Alvarez Corrales, Anastasios Giovanidis, Philippe Martins", "title": "Coverage Gains from the Static Cooperation of Mutually Nearest\n  Neighbours", "comments": "9 pages, double column, 7 figures, 12 subfigures in total, Conference\n  submission Extended Version", "journal-ref": "IEEE GLOBECOM, Dec. 2016, Washington D.C., USA", "doi": "10.1109/GLOCOM.2016.7841705", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cooperation in cellular networks has been recently suggested as a promising\nscheme to improve system performance. In this work, clusters are formed based\non the Mutually Nearest Neighbour relation, which defines which stations\ncooperate in pair and which do not. When node positions follow a Poisson Point\nProcess (PPP) the performance of the original clustering model can be\napproximated by another one, formed by the superposition of two PPPs (one for\nthe singles and one for the pairs) equipped with adequate marks. This allows to\nderive exact expressions for the network coverage probability under two\nuser-cluster association rules. Numerical evaluation shows coverage gains from\ndifferent signal cooperation schemes that can reach up to 15% compared to the\nstandard non-cooperative network coverage. The analysis is general and can be\napplied to any type of cooperation or coordination between pairs of\ntransmitting nodes.\n", "versions": [{"version": "v1", "created": "Fri, 15 Apr 2016 20:43:45 GMT"}], "update_date": "2017-02-08", "authors_parsed": [["Corrales", "Luis David Alvarez", ""], ["Giovanidis", "Anastasios", ""], ["Martins", "Philippe", ""]]}, {"id": "1604.04667", "submitter": "Varun Chandrasekaran", "authors": "Varun Chandrasekaran, Fareeha Amjad, Ashlesh Sharma, Lakshminarayanan\n  Subramanian", "title": "Secure Mobile Identities", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The unique identities of every mobile user (phone number,IMSI) and device\n(IMEI) are far from secure and are increasingly vulnerable to a variety of\nnetwork-level threats. The exceedingly high reliance on the weak SIM\nauthentication layer does not present any notion of end-to-end security for\nmobile users. We propose the design and implementation of Secure Mobile\nIdentities (SMI), a repetitive key-exchange protocol that uses this weak SIM\nauthentication as a foundation to enable mobile users to establish stronger\nidentity authenticity. The security guarantees of SMI are directly reliant on\nthe mobility of users and are further enhanced by external trusted entities\nproviding trusted location signatures (e.g. trusted GPS, NFC synchronization\npoints). In this paper, we demonstrate the efficacy of our protocol using an\nimplementation and analysis across standard mobility models.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 00:21:05 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Chandrasekaran", "Varun", ""], ["Amjad", "Fareeha", ""], ["Sharma", "Ashlesh", ""], ["Subramanian", "Lakshminarayanan", ""]]}, {"id": "1604.04699", "submitter": "Medhat Elsayed Mr.", "authors": "Medhat H. M. Elsayed and Amr Mohamed", "title": "Distributed interference management using Q-Learning in Cognitive\n  Femtocell networks: New USRP-based Implementation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Femtocell networks have become a promising solution in supporting high data\nrates for 5G systems, where cell densification is performed using the small\nfemtocells. However, femtocell networks have many challenges. One of the major\nchallenges of femtocell networks is the interference management problem, where\ndeployment of femtocells in the range of macro-cells may degrade the\nperformance of the macrocell. In this paper, we develop a new platform for\nstudying interference management in distributed femtocell networks using\nreinforcement learning approach. We design a complete MAC protocol to perform\ndistributed power allocation using Q-Learning algorithm, where both independent\nand cooperative learning approaches are applied across network nodes. The\nobjective of the Q-Learning algorithms is to maximize aggregate femtocells\ncapacity, while maintaining the QoS for the Macrocell users. Furthermore, we\npresent the realization of the algorithms using GNURadio and USRP platforms.\nPerformance evaluation are conducted in terms of macrocell capacity convergence\nto a target capacity and improvement of aggregate femtocells capacity.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 06:25:21 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Elsayed", "Medhat H. M.", ""], ["Mohamed", "Amr", ""]]}, {"id": "1604.04743", "submitter": "Margarita Gapeyenko", "authors": "Margarita Gapeyenko, Andrey Samuylov, Mikhail Gerasimenko, Dmitri\n  Moltchanov, Sarabjot Singh, Ehsan Aryafar, Shu-ping Yeh, Nageen Himayat,\n  Sergey Andreev, Yevgeni Koucheryavy", "title": "Analysis of Human-Body Blockage in Urban Millimeter-Wave Cellular\n  Communications", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of extremely high frequency (EHF) or millimeter-wave (mmWave) band\nhas attracted significant attention for the next generation wireless access\nnetworks. As demonstrated by recent measurements, mmWave frequencies render\nthemselves quite sensitive to \"blocking\" caused by obstacles like foliage,\nhumans, vehicles, etc. However, there is a dearth of analytical models for\ncharacterizing such blocking and the consequent effect on the signal\nreliability. In this paper, we propose a novel, general, and tractable model\nfor characterizing the blocking caused by humans (assuming them to be randomly\nlocated in the environment) to mmWave propagation as a function of system\nparameters like transmitter-receiver locations and dimensions, as well as\ndensity and dimensions of humans. Moreover, the proposed model is validated\nusing a ray-launcher tool. Utilizing the proposed model, the blockage\nprobability is shown to increase with human density and separation between the\ntransmitter-receiver pair. Furthermore, the developed analysis is shown to\ndemonstrate the existence of a transmitter antenna height that maximizes the\nreceived signal strength, which in turn is a function of the\ntransmitter-receiver distance and their dimensions.\n", "versions": [{"version": "v1", "created": "Sat, 16 Apr 2016 12:59:56 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Gapeyenko", "Margarita", ""], ["Samuylov", "Andrey", ""], ["Gerasimenko", "Mikhail", ""], ["Moltchanov", "Dmitri", ""], ["Singh", "Sarabjot", ""], ["Aryafar", "Ehsan", ""], ["Yeh", "Shu-ping", ""], ["Himayat", "Nageen", ""], ["Andreev", "Sergey", ""], ["Koucheryavy", "Yevgeni", ""]]}, {"id": "1604.04823", "submitter": "Mahmoud Elkhodr Dr", "authors": "Mahmoud Elkhodr, Seyed Shahrestani and Hon Cheung", "title": "A Middleware for the Internet of Things", "comments": "20 pages, International Journal of Computer Networks & Communications\n  (IJCNC) Vol.8, No.2, March 2016", "journal-ref": null, "doi": "10.5121/ijcnc.2016.8214", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things (IoT) connects everyday objects including a vast array\nof sensors, actuators, and smart devices, referred to as things to the\nInternet, in an intelligent and pervasive fashion. This connectivity gives rise\nto the possibility of using the tracking capabilities of things to impinge on\nthe location privacy of users. Most of the existing management and location\nprivacy protection solutions do not consider the low-cost and low-power\nrequirements of things, or, they do not account for the heterogeneity,\nscalability, or autonomy of communications supported in the IoT. Moreover,\nthese traditional solutions do not consider the case where a user wishes to\ncontrol the granularity of the disclosed information based on the context of\ntheir use (e.g. based on the time or the current location of the user). To fill\nthis gap, a middleware, referred to as the Internet of Things Management\nPlatform (IoT-MP) is proposed in this paper.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 03:36:42 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Elkhodr", "Mahmoud", ""], ["Shahrestani", "Seyed", ""], ["Cheung", "Hon", ""]]}, {"id": "1604.04824", "submitter": "Mahmoud Elkhodr Dr", "authors": "Mahmoud Elkhodr, Seyed Shahrestani and Hon Cheung", "title": "The Internet of Things: New Interoperability, Management and Security\n  Challenges", "comments": "18 pages, International Journal of Network Security & Its\n  Applications (IJNSA) Vol.8, No.2, March 2016", "journal-ref": null, "doi": "10.5121/ijnsa.2016.8206", "report-no": null, "categories": "cs.NI cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet of Things (IoT) brings connectivity to about every objects found\nin the physical space. It extends connectivity to everyday objects. From\nconnected fridges, cars and cities, the IoT creates opportunities in numerous\ndomains. However, this increase in connectivity creates many prominent\nchallenges. This paper provides a survey of some of the major issues\nchallenging the widespread adoption of the IoT. Particularly, it focuses on the\ninteroperability, management, security and privacy issues in the IoT. It is\nconcluded that there is a need to develop a multifaceted technology approach to\nIoT security, management, and privacy.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 03:42:01 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Elkhodr", "Mahmoud", ""], ["Shahrestani", "Seyed", ""], ["Cheung", "Hon", ""]]}, {"id": "1604.04855", "submitter": "Ashwin Ganesan", "authors": "Ashwin Ganesan", "title": "Fault tolerant supergraphs with automorphisms", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DM cs.NI math.CO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Given a graph $Y$ on $n$ vertices and a desired level of fault-tolerance $k$,\nan objective in fault-tolerant system design is to construct a supergraph $X$\non $n + k$ vertices such that the removal of any $k$ nodes from $X$ leaves a\ngraph containing $Y$. In order to reconfigure around faults when they occur, it\nis also required that any two subsets of $k$ nodes of $X$ are in the same orbit\nof the action of its automorphism group. In this paper, we prove that such a\nsupergraph must be the complete graph. This implies that it is very expensive\nto have an interconnection network which is $k$-fault-tolerant and which also\nsupports automorphic reconfiguration. Our work resolves an open problem in the\nliterature. The proof uses a result due to Cameron on $k$-homogeneous groups.\n", "versions": [{"version": "v1", "created": "Sun, 17 Apr 2016 09:42:38 GMT"}, {"version": "v2", "created": "Wed, 22 Mar 2017 08:43:40 GMT"}, {"version": "v3", "created": "Sun, 24 Sep 2017 16:47:55 GMT"}], "update_date": "2017-09-26", "authors_parsed": [["Ganesan", "Ashwin", ""]]}, {"id": "1604.04968", "submitter": "Xiaohu Ge", "authors": "Xiaohu Ge, Ran Zi, Haichao Wang, Jing Zhang, Minho Jo", "title": "Multi-user Massive MIMO Communication Systems Based on Irregular Antenna\n  Arrays", "comments": "15 pages, 8 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In practical mobile communication engineering applications, surfaces of\nantenna array deployment regions are usually uneven. Therefore, massive\nmulti-input-multi-output (MIMO) communication systems usually transmit wireless\nsignals by irregular antenna arrays. To evaluate the performance of irregular\nantenna arrays, the matrix correlation coefficient and ergodic received gain\nare defined for massive MIMO communication systems with mutual coupling\neffects. Furthermore, the lower bound of the ergodic achievable rate, symbol\nerror rate (SER) and average outage probability are firstly derived for\nmulti-user massive MIMO communication systems using irregular antenna arrays.\nAsymptotic results are also derived when the number of antennas approaches\ninfinity. Numerical results indicate that there exists a maximum achievable\nrate when the number of antennas keeps increasing in massive MIMO communication\nsystems using irregular antenna arrays. Moreover, the irregular antenna array\noutperforms the regular antenna array in the achievable rate of massive MIMO\ncommunication systems when the number of antennas is larger than or equal to a\ngiven threshold.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 03:07:26 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Ge", "Xiaohu", ""], ["Zi", "Ran", ""], ["Wang", "Haichao", ""], ["Zhang", "Jing", ""], ["Jo", "Minho", ""]]}, {"id": "1604.05048", "submitter": "Sandeep Kumar Singh", "authors": "Sandeep Kumar Singh, Wolfgang Bziuk, and Admela Jukan", "title": "Balancing Data Security and Blocking Performance with Spectrum\n  Randomization in Optical Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Data randomization or scrambling has been effectively used in various\napplications to improve the data security. In this paper, we use the idea of\ndata randomization to proactively randomize the spectrum (re)allocation to\nimprove connections' security. As it is well-known that random (re)allocation\nfragments the spectrum and thus increases blocking in elastic optical networks,\nwe analyze the tradeoff between system performance and security. To this end,\nin addition to spectrum randomization, we utilize an on-demand defragmentation\nscheme every time a request is blocked due to the spectrum fragmentation. We\nmodel the occupancy pattern of an elastic optical link (EOL) using a\nmulti-class continuous-time Markov chain (CTMC) under the random-fit spectrum\nallocation method. Numerical results show that although both the blocking and\nsecurity can be improved for a particular so-called randomization process (RP)\narrival rate, while with the increase in RP arrival rate the connections'\nsecurity improves at the cost of the increase in overall blocking.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 09:10:05 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Singh", "Sandeep Kumar", ""], ["Bziuk", "Wolfgang", ""], ["Jukan", "Admela", ""]]}, {"id": "1604.05095", "submitter": "Sandeep Kumar Singh", "authors": "Sandeep Kumar Singh, Wolfgang Bziuk, and Admela Jukan", "title": "Defragmentation-as-a-Service (DaaS): How beneficial is it?", "comments": null, "journal-ref": "Optical Fiber Communication (OFC) Conference 2016", "doi": "10.1364/OFC.2016.W2A.55", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We analyze Defragmentation-as-a-Service (DaaS) in elastic optical networks\nand show that the positive effect of defragmentation depends on the rate at\nwhich it is performed, load (or, call arrival rates) and the available\nresources.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 11:22:40 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Singh", "Sandeep Kumar", ""], ["Bziuk", "Wolfgang", ""], ["Jukan", "Admela", ""]]}, {"id": "1604.05107", "submitter": "Francisco Carpio", "authors": "Francisco Carpio, Anna Engelmann and Admela Jukan", "title": "DiffFlow: Differentiating Short and Long Flows for Load Balancing in\n  Data Center Networks", "comments": null, "journal-ref": null, "doi": "10.1109/GLOCOM.2016.7841733", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In current Data Center Networks (DCNs), Equal- Cost MultiPath (ECMP) is used\nas the de-facto routing protocol. However, ECMP does not differentiate between\nshort and long flows, the two main categories of flows depending on their\nduration (lifetime). This issue causes hot-spots in the network, affecting\nnegatively the Flow Completion Time (FCT) and the throughput, the two key\nperformance metrics in data center networks. Previous work on load balancing\nproposed solutions such as splitting long flows into short flows, using\nper-packet forwarding approaches, and isolating the paths of short and long\nflows. We propose DiffFlow, a new load balancing solution which detects long\nflows and forwards packets using Random Packet Spraying (RPS) with help of SDN,\nwhereas the flows with small duration are forwarded with ECMP by default. The\nuse of ECMP for short flows is reasonable, as it does not create the\nout-of-order problem; at the same time, RPS for long flows can efficiently help\nto load balancing the entire network, given that long flows represent most of\nthe traffic in DCNs. The results show that our DiffFlow solution outperforms\nboth the individual usage of either RPS or ECMP, while the overall throughput\nachieved is maintained at the level comparable to RPS.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 11:59:31 GMT"}], "update_date": "2020-02-03", "authors_parsed": [["Carpio", "Francisco", ""], ["Engelmann", "Anna", ""], ["Jukan", "Admela", ""]]}, {"id": "1604.05151", "submitter": "Waqas Bin Abbas", "authors": "Waqas Bin Abbas, Michele Zorzi", "title": "Towards an Appropriate Receiver Beamforming Scheme for Millimeter Wave\n  Communication: A Power Consumption Based Comparison", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  At millimeter wave (mmW) frequencies, beamforming and large antenna arrays\nare an essential requirement to combat the high path loss for mmW\ncommunication. Moreover, at these frequencies, very large bandwidths are\navailable to fulfill the data rate requirements of future wireless networks.\nHowever, utilization of these large bandwidths and of large antenna arrays can\nresult in a high power consumption which is an even bigger concern for mmW\nreceiver design. In a mmW receiver, the analog-to-digital converter (ADC) is\ngenerally considered as the most power consuming block. In this paper,\nprimarily focusing on the ADC power, we analyze and compare the total power\nconsumption of the complete analog chain for Analog, Digital and Hybrid\nbeamforming (ABF, DBF and HBF) based receiver design. We show how power\nconsumption of these beamforming schemes varies with a change in the number of\nantennas, the number of ADC bits (b) and the bandwidth (B). Moreover, we\ncompare low power (as in [1]) and high power (as in [2]) ADC models, and show\nthat for a certain range of number of antennas, b and B, DBF may actually have\na comparable and lower power consumption than ABF and HBF, respectively. In\naddition, we also show how the choice of an appropriate beamforming scheme\ndepends on the signal-to-noise ratio regime.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 13:55:08 GMT"}], "update_date": "2016-04-19", "authors_parsed": [["Abbas", "Waqas Bin", ""], ["Zorzi", "Michele", ""]]}, {"id": "1604.05255", "submitter": "Liangxiao Xin", "authors": "Liangxiao Xin (1), David Starobinski (1), Guevara Noubir (2) ((1)\n  Boston University, (2) Northeastern University)", "title": "Cascading Denial of Service Attacks on Wi-Fi Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We unveil the existence of a vulnerability in Wi-Fi, which allows an\nadversary to remotely launch a Denial-of-Service (DoS) attack that propagates\nboth in time and space. This vulnerability stems from a coupling effect induced\nby hidden nodes. Cascading DoS attacks can congest an entire network and do not\nrequire the adversary to violate any protocol. We demonstrate the feasibility\nof such attacks through experiments with real Wi-Fi cards, extensive ns-3\nsimulations, and theoretical analysis. The simulations show that the attack is\neffective both in networks operating under fixed and varying bit rates, as well\nas ad hoc and infrastructure modes. To gain insight into the root-causes of the\nattack, we model the network as a dynamical system and analyze its limiting\nbehavior. The model predicts that a phase transition (and hence a cascading\nattack) is possible when the retry limit parameter of Wi-Fi is greater or equal\nto 7, and explicitly characterizes the phase transition region in terms of the\nsystem parameters.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 17:23:50 GMT"}, {"version": "v2", "created": "Sat, 17 Mar 2018 17:21:51 GMT"}], "update_date": "2018-03-20", "authors_parsed": [["Xin", "Liangxiao", ""], ["Starobinski", "David", ""], ["Noubir", "Guevara", ""]]}, {"id": "1604.05341", "submitter": "Dmitri Nosovicki", "authors": "Dmitri Nosovicki", "title": "Metcalfe's Law Revisited", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rudimentary mathematical analysis of simple network models suggests\nbandwidth-independent saturation of network growth dynamics and hints at linear\ndecrease in information density of the data. However it strongly confirms\nMetcalfe's law as a measure of network utility and suggests it can play an\nimportant role in network calculations. This paper establishes mathematical\nnotion of network value and analyses two conflicting models of network. One,\ntraditional model, fails to manifest Metcalfe's law. Another model, one that\nobserves network in a wider context, both confirms Metcalfe's law and reveals\nits upper boundary.\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 20:21:58 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Nosovicki", "Dmitri", ""]]}, {"id": "1604.05355", "submitter": "Talal Ahmad", "authors": "Talal Ahmad, Alfred Afutu, Kessir Adjaho, Yaw Nyarko, Lakshminarayanan\n  Subramanian", "title": "Technical Report: Design, Implementation and Deployment of\n  Intermittency-aware Cellular Edge Services for Rural areas", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Rural areas continue to be plagued by limited data connectivity due to poor\nand unreliable power infrastructure, poor backhaul connectivity and lack of\neconomic incentives for telecom providers. These factors continue to be an\nimpediment to providing reliable, highly available and bandwidth intensive\nmobile services and applications to function well in such contexts. This paper\npresents the design, implementation and deployment of GreenLinks, a new\nground-up platform that enables intermittency-aware, reliable and available\ncellular services and application support in rural contexts under extreme\noperational environments with limited power and no existing cellular coverage.\nUnlike the conventional monolithic cellular network architecture, GreenLinks\nenables a distributed (and potentially disjoint) collection of open,\nprogrammable cellular base stations to offer a gamut of both conventional\ncellular services and new forms of distributed edge services. GreenLinks offers\nnew application primitives to support different types of intermittency-aware\ndistributed mobile edge services including P2P transactions, voice-based social\nmedia applications, and distributed mobile sensing applications. Using a\nparticipatory sensing white spaces approach, a GreenLinks base stati\n", "versions": [{"version": "v1", "created": "Mon, 18 Apr 2016 21:15:44 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Ahmad", "Talal", ""], ["Afutu", "Alfred", ""], ["Adjaho", "Kessir", ""], ["Nyarko", "Yaw", ""], ["Subramanian", "Lakshminarayanan", ""]]}, {"id": "1604.05430", "submitter": "Anatoliy Zinovyev", "authors": "Anatoliy Zinovyev, Brian L. Mark", "title": "Binary Multi-Level Routing Protocol for Mobile Ad Hoc Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Routing in mobile ad hoc networks (MANETs) presents a big challenge,\nespecially when support for a large number of nodes is needed. This paper\nextends the local visibility concept of the recent DHT-based URBAN_XOR routing\nprotocol, which aims to reduce routing table sizes while keeping efficiency\nhigh. Our main contribution is providing a guarantee that if any two nodes are\nconnected through other nodes, they are able to communicate with each other. We\npropose a new route acquisition method that aims to reduce the total amount of\noverhead traffic and improve convergence rate. In addition, we introduce an\nabstraction for describing the network structure that makes it easy to\nunderstand and analyze. Compared to existing approaches in ad hoc routing, the\nnew protocol supports the following features: scalability, guaranteed\nconnectivity assuming network convergence, absence of single points of failure,\nlow path-stretch, and mobility.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 04:38:06 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Zinovyev", "Anatoliy", ""], ["Mark", "Brian L.", ""]]}, {"id": "1604.05460", "submitter": "Sla{\\dj}ana Jo\\v{s}ilo", "authors": "Sla{\\dj}ana Jo\\v{s}ilo and Gy\\\"orgy D\\'an", "title": "Selfish Computation Offloading for Mobile Cloud Computing in Dense\n  Wireless Networks", "comments": "10 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Offloading computation to a mobile cloud is a promising solution to augment\nthe computation capabilities of mobile devices. In this paper we consider\nselfish mobile devices in a dense wireless network, in which individual mobile\ndevices can offload computations via multiple access points (APs) to a mobile\ncloud so as to minimize their computation costs, and we provide a game\ntheoretical analysis of the problem. We show that in the case of an elastic\ncloud, all improvement paths are finite, and thus a pure strategy Nash\nequilibrium exists and can be computed easily. In the case of a non-elastic\ncloud we show that improvement paths may cycle, yet we show that a pure Nash\nequilibrium exists and we provide an efficient algorithm for computing one.\nFurthermore, we provide an upper bound on the price of anarchy (PoA) of the\ngame. We use simulations to evaluate the time complexity of computing Nash\nequilibria and to provide insights into the PoA under realistic scenarios. Our\nresults show that the equilibrium cost may be close to optimal, and the cost\ndifference is due to too many mobile users offloading simultaneously.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 07:45:02 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Jošilo", "Slađana", ""], ["Dán", "György", ""]]}, {"id": "1604.05516", "submitter": "Debayani Ghosh", "authors": "Debayani Ghosh, Krishna Jagannathan and Gaurav Raina", "title": "Right buffer sizing matters: some dynamical and statistical studies on\n  Compound TCP", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.PF cs.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivated by recent concerns that queuing delays in the Internet are on the\nrise, we conduct a performance evaluation of Compound TCP (C-TCP) in two\ntopologies: a single bottleneck and a multi-bottleneck topology, under\ndifferent traffic scenarios. The first topology consists of a single bottleneck\nrouter, and the second consists of two distinct sets of TCP flows, regulated by\ntwo edge routers, feeding into a common core router. We focus on some dynamical\nand statistical properties of the underlying system. From a dynamical\nperspective, we develop fluid models in a regime wherein the number of flows is\nlarge, bandwidth-delay product is high, buffers are dimensioned small\n(independent of the bandwidth-delay product) and routers deploy a Drop-Tail\nqueue policy. A detailed local stability analysis for these models yields the\nfollowing key insight: smaller buffers favour stability. Additionally, we\nhighlight that larger buffers, in addition to increasing latency, are prone to\ninducing limit cycles in the system dynamics, via a Hopf bifurcation. These\nlimit cycles in turn cause synchronisation among the TCP flows, and also result\nin a loss of link utilisation. For the topologies considered, we also\nempirically analyse some statistical properties of the bottleneck queues. These\nstatistical analyses serve to validate an important modelling assumption: that\nin the regime considered, each bottleneck queue may be approximated as either\nan $M/M/1/B$ or an $M/D/1/B$ queue. This immediately makes the modelling\nperspective attractive and the analysis tractable. Finally, we show that\nsmaller buffers, in addition to ensuring stability and low latency, would also\nyield fairly good system performance, in terms of throughput and flow\ncompletion times.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 11:00:08 GMT"}, {"version": "v2", "created": "Thu, 28 Apr 2016 09:24:35 GMT"}, {"version": "v3", "created": "Sun, 28 May 2017 07:51:25 GMT"}, {"version": "v4", "created": "Wed, 24 Oct 2018 17:15:13 GMT"}, {"version": "v5", "created": "Mon, 24 Dec 2018 09:53:16 GMT"}], "update_date": "2018-12-27", "authors_parsed": [["Ghosh", "Debayani", ""], ["Jagannathan", "Krishna", ""], ["Raina", "Gaurav", ""]]}, {"id": "1604.05534", "submitter": "Marcel Caria", "authors": "Marcel Caria, Admela Jukan", "title": "Link Capacity Planning for Fault Tolerant Operation in Hybrid SDN/OSPF\n  Networks", "comments": "6 pages, 6 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Link capacity dimensioning is the periodic task where ISPs have to make\nprovisions for sudden traffic bursts and network failures to assure\nuninterrupted operations. This provision comes in the form of link working\ncapacities with noticeable amounts of headroom, i.e., spare capacities that are\nused in case of congestions or network failures. Distributed routing protocols\nlike OSPF provide convergence after network failures and have proven their\nreliable operation over decades, but require overprovisioning and headroom of\nover 50%. However, SDN has recently been proposed to either replace or work\ntogether with OSPF in routing Internet traffic. This paper addresses the\nquestion of how to robustly dimension the link capacities in emerging hybrid\nSDN/OSPF networks. We analyze the networks with various implementations of\nhybrid SDN/OSPF control planes, and show that our idea of SDN Partitioning\nrequires less amounts of spare capacity compared to legacy or other hybrid\nSDN/OSPF schemes, outperformed only by a full SDN deployment.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 12:03:11 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Caria", "Marcel", ""], ["Jukan", "Admela", ""]]}, {"id": "1604.05622", "submitter": "Mattia Rebato", "authors": "Mattia Rebato and Marco Mezzavilla and Sundeep Rangan and Federico\n  Boccardi and Michele Zorzi", "title": "Understanding Noise and Interference Regimes in 5G Millimeter-Wave\n  Cellular Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  With the severe spectrum shortage in conventional cellular bands,\nmillimeter-wave (mmWave) frequencies have been attracting growing attention for\nnext-generation micro- and picocellular wireless networks. A fundamental and\nopen question is whether mmWave cellular networks are likely to be noise- or\ninterference-limited. Identifying in which regime a network is operating is\ncritical for the design of MAC and physical-layer procedures and to provide\ninsights on how transmissions across cells should be coordinated to cope with\ninterference. This work uses the latest measurement-based statistical channel\nmodels to accurately assess the Interference-to-Noise Ratio (INR) in a wide\nrange of deployment scenarios. In addition to cell density, we also study\nantenna array size and antenna patterns, whose effects are critical in the\nmmWave regime. The channel models also account for blockage, line-of-sight and\nnon-line-of-sight regimes as well as local scattering, that significantly\naffect the level of spatial isolation.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 15:22:55 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Rebato", "Mattia", ""], ["Mezzavilla", "Marco", ""], ["Rangan", "Sundeep", ""], ["Boccardi", "Federico", ""], ["Zorzi", "Michele", ""]]}, {"id": "1604.05623", "submitter": "Marco Giordani", "authors": "Marco Giordani, Marco Mezzavilla, Aditya Dhananjay, Sundeep Rangan,\n  Michele Zorzi", "title": "Channel Dynamics and SNR Tracking in Millimeter Wave Cellular Systems", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The millimeter wave (mmWave) frequencies are likely to play a significant\nrole in fifth-generation (5G) cellular systems. A key challenge in developing\nsystems in these bands is the potential for rapid channel dynamics: since\nmmWave signals are blocked by many materials, small changes in the position or\norientation of the handset relative to objects in the environment can cause\nlarge swings in the channel quality. This paper addresses the issue of tracking\nthe signal to noise ratio (SNR), which is an essential procedure for rate\nprediction, handover and radio link failure detection. A simple method for\nestimating the SNR from periodic synchronization signals is considered. The\nmethod is then evaluated using real experiments in common blockage scenarios\ncombined with outdoor statistical models.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 15:22:57 GMT"}], "update_date": "2016-04-20", "authors_parsed": [["Giordani", "Marco", ""], ["Mezzavilla", "Marco", ""], ["Dhananjay", "Aditya", ""], ["Rangan", "Sundeep", ""], ["Zorzi", "Michele", ""]]}, {"id": "1604.05696", "submitter": "Zana Limani", "authors": "Zana Limani Fazliu, Carla-Fabiana Chiasserini, Gian Michele Dell'Aera", "title": "Downlink Transmit Power Setting in LTE HetNets with Carrier Aggregation", "comments": "Accepted in IEEE WoWMoM 2016", "journal-ref": null, "doi": "10.1109/WoWMoM.2016.7523513", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Carrier aggregation, which allows users to aggregate several component\ncarriers to obtain up to 100 MHz of band- width, is one of the central features\nenvisioned for next generation cellular networks. While this feature will\nenable support for higher data rates and improve quality of service, it may\nalso be employed as an effective interference mitigation technique, especially\nin multi-tier heterogeneous networks. Having in mind that the aggregated\ncomponent carriers may belong to different frequency bands and, hence, have\nvarying propagation profiles, we argue that it is not necessary, indeed even\nharmful, to transmit at maximum power at all carriers, at all times. Rather, by\nusing game theory, we design a distributed algorithm that lets eNodeBs and\nmicro base stations dynamically adjust the downlink transmit power for the\ndifferent component carriers. We compare our scheme to different power\nstrategies combined with popular interference mitigation techniques, in a\ntypical large-scale scenario, and show that our solution significantly\noutperforms the other strategies in terms of global network utility, power\nconsumption and user throughput.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 19:14:32 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Fazliu", "Zana Limani", ""], ["Chiasserini", "Carla-Fabiana", ""], ["Dell'Aera", "Gian Michele", ""]]}, {"id": "1604.05773", "submitter": "Trung Kien Vu", "authors": "Trung Kien Vu", "title": "Resource Allocation in Heterogeneous Networks: eICIC Approach", "comments": "14 figures, 46 pages, Master Thesis, submitted to Ulsan University\n  Library, June 2014, Korea", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Heterogeneous Networks (HetNets) are introduced by the 3GPP as an emerging\ntechnology to provide high network coverage and capacity. The HetNets are the\ncombination of multilayer networks such as macrocell, small cell (picocell and\nfemtocell) networks. In such networks, users may suffer significant cross-layer\ninterference. To manage the interference the 3GPP has introduced Enhanced\nInter-Cell Interference Coordination (eICIC) techniques, Almost Blank SubFrame\n(ABSF) is one of the time-domain technique in the eICIC solutions. In this\nthesis, we propose a dynamically optimal ABSF framework to enhance the small\ncell user downlink performance while maintains the macro user downlink\nperformance. We also study the mechanism to help the small cell base stations\ncooperate efficiently in order to reduce the mutual interference. Via numerical\nresults, our proposed scheme achieves a significant performance and outperforms\nthe existing ABSF frameworks in terms of user throughput and outage\nprobability.\n", "versions": [{"version": "v1", "created": "Tue, 19 Apr 2016 23:35:48 GMT"}, {"version": "v2", "created": "Thu, 28 Apr 2016 08:54:38 GMT"}], "update_date": "2016-04-29", "authors_parsed": [["Vu", "Trung Kien", ""]]}, {"id": "1604.05803", "submitter": "Yi Ren", "authors": "Yi Ren, Tuan Phung-Duc, Jyh-Cheng Chen", "title": "Design and Analysis of Dynamic Auto Scaling Algorithm (DASA) for 5G\n  Mobile Networks", "comments": "18 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network Function Virtualization (NFV) enables mobile operators to virtualize\ntheir network entities as Virtualized Network Functions (VNFs), offering\nfine-grained on-demand network capabilities. VNFs can be dynamically\nscale-in/out to meet the performance requirements for future 5G networks.\nHowever, designing an auto-scaling algorithm with low operation cost and low\nlatency while considering the capacity of legacy network equipment is a\nchallenge. In this paper, we propose a VNF Dynamic Auto Scaling Algorithm\n(DASA) considering the tradeoff between performance and operation cost. We also\ndevelop an analytical model to quantify the tradeoff and validate the analysis\nthrough extensive simulations. The system is modeled as a queueing model while\nlegacy network equipment is considered as a reserved block of servers. The VNF\ninstances are powered on and off according to the number of job requests. The\nresults show that the proposed DASA can significantly reduce operation cost\ngiven the latency upper-bound. Moreover, the models provide a quick way to\nevaluate the cost-performance tradeoff without wide deployment, which can save\ncost and time.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 03:46:30 GMT"}, {"version": "v2", "created": "Tue, 24 May 2016 03:23:53 GMT"}, {"version": "v3", "created": "Fri, 10 Feb 2017 04:47:33 GMT"}], "update_date": "2017-02-24", "authors_parsed": [["Ren", "Yi", ""], ["Phung-Duc", "Tuan", ""], ["Chen", "Jyh-Cheng", ""]]}, {"id": "1604.05811", "submitter": "Lizhao You", "authors": "Lizhao You, Soung Chang Liew, Lu Lu", "title": "Reliable Physical-layer Network Coding Supporting Real Applications", "comments": "17 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the first reliable physical-layer network coding (PNC)\nsystem that supports real TCP/IP applications for the two-way relay network\n(TWRN). Theoretically, PNC could boost the throughput of TWRN by a factor of 2\ncompared with traditional scheduling (TS) in the high signal-to-noise (SNR)\nregime. Although there have been many theoretical studies on PNC performance,\nthere have been relatively few experimental and implementation efforts. Our\nearlier PNC prototype, built in 2012, was an offline system that processed\nsignals offline. For a system that supports real applications, signals must be\nprocessed online in real-time. Our real-time reliable PNC prototype, referred\nto as RPNC, solves a number of key challenges to enable the support of real\nTCP/IP applications. The enabling components include: 1) a time-slotted system\nthat achieves us-level synchronization for the PNC system; 2) reduction of PNC\nsignal processing complexity to meet real-time constraints; 3) an ARQ design\ntailored for PNC to ensure reliable packet delivery; 4) an interface to the\napplication layer. We took on the challenge to implement all the above with\ngeneral-purpose processors in PC through an SDR platform rather than ASIC or\nFPGA. With all these components, we have successfully demonstrated image\nexchange with TCP and twoparty video conferencing with UDP over RPNC.\nExperimental results show that the achieved throughput approaches the PHYlayer\ndata rate at high SNR, demonstrating the high efficiency of the RPNC system.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 04:05:11 GMT"}], "update_date": "2016-04-21", "authors_parsed": [["You", "Lizhao", ""], ["Liew", "Soung Chang", ""], ["Lu", "Lu", ""]]}, {"id": "1604.05861", "submitter": "Paul Anthony Haigh", "authors": "Alejandro Aguado and Emilio Hugues-Salas and Paul Anthony Haigh and\n  Jaume Marhuenda and Alasdair B. Price and Philip Sibson and Jake E. Kennard\n  and Christopher Erven and John G. Rarity and Mark G. Thompson and Andrew Lord\n  and Reza Nejabati and Dimitra Simeonidou", "title": "First Experimental Demonstration of Secure NFV Orchestration over an\n  SDN-Controlled Optical Network with Time-Shared Quantum Key Distribution\n  Resources", "comments": "Submitted to ECOC 2016 conference", "journal-ref": null, "doi": "10.1109/JLT.2016.2646921", "report-no": null, "categories": "cs.CR cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We demonstrate, for the first time, a secure optical network architecture\nthat combines NFV orchestration and SDN control with quantum key distribution\n(QKD) technology. A novel time-shared QKD network design is presented as a\ncost-effective solution for practical networks.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 08:51:12 GMT"}, {"version": "v2", "created": "Thu, 21 Apr 2016 18:57:54 GMT"}], "update_date": "2017-04-26", "authors_parsed": [["Aguado", "Alejandro", ""], ["Hugues-Salas", "Emilio", ""], ["Haigh", "Paul Anthony", ""], ["Marhuenda", "Jaume", ""], ["Price", "Alasdair B.", ""], ["Sibson", "Philip", ""], ["Kennard", "Jake E.", ""], ["Erven", "Christopher", ""], ["Rarity", "John G.", ""], ["Thompson", "Mark G.", ""], ["Lord", "Andrew", ""], ["Nejabati", "Reza", ""], ["Simeonidou", "Dimitra", ""]]}, {"id": "1604.05925", "submitter": "Yehia Elkhatib PhD", "authors": "Yehia Elkhatib and Gareth Tyson and Geoff Coulson", "title": "Charting an Intent Driven Network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  The current strong divide between applications and the network control plane\nis desirable for many reasons; but a downside is that the network is kept in\nthe dark regarding the ultimate purposes and intentions of applications and, as\na result, is unable to optimize for these. An alternative approach, explored in\nthis paper, is for applications to declare to the network their abstract\nintents and assumptions; e.g. \"this is a Tweet\", or \"this application will run\nwithin a local domain\". Such an enriched semantic has the potential to enable\nthe network better to fulfill application intent, while also helping optimize\nnetwork resource usage across applications. We refer to this approach as\n'intent driven networking' (IDN), and we sketch an incrementally-deployable\ndesign to serve as a stepping stone towards a practical realization of the IDN\nconcept within today's Internet.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 12:52:17 GMT"}], "update_date": "2016-04-21", "authors_parsed": [["Elkhatib", "Yehia", ""], ["Tyson", "Gareth", ""], ["Coulson", "Geoff", ""]]}, {"id": "1604.05964", "submitter": "Sandeep Dhavane", "authors": "Sandeep Babasaheb Dhavane, Mohammed Zafar Ali Khan", "title": "Cloud Cognitive Radio HetNets with Limited Feedback", "comments": "equation no. 16 17 and 18 have flaws, result of which final outage\n  derivation is not converging", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  In this paper we propose a cloud based interweave cognitive radio HetNets\nwhich combines gain of cloud based radio that is increased rate for cell edge\nusers and better spectral efficiency of cognitive radio. Simulation results for\nlimited feedback shows approximately 100 % increase in rate for primary while\n300 % for secondary cell edge users with same outage in cloud over conventional\ncognitive radio network.\n", "versions": [{"version": "v1", "created": "Wed, 20 Apr 2016 13:59:55 GMT"}, {"version": "v2", "created": "Thu, 19 May 2016 15:39:40 GMT"}], "update_date": "2016-05-20", "authors_parsed": [["Dhavane", "Sandeep Babasaheb", ""], ["Khan", "Mohammed Zafar Ali", ""]]}, {"id": "1604.06151", "submitter": "Can Karakus", "authors": "Can Karakus, Suhas Diggavi", "title": "Enhancing Multiuser MIMO Through Opportunistic D2D Cooperation", "comments": "43 pages, 18 figures. Submitted for publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a cellular architecture that combines multiuser MIMO (MU-MIMO)\ndownlink with opportunistic use of unlicensed ISM bands to establish\ndevice-to-device (D2D) cooperation. The architecture consists of a\nphysical-layer cooperation scheme based on forming downlink virtual MIMO\nchannels through D2D relaying, and a novel resource allocation strategy for\nsuch D2D-enabled networks. We prove the approximate optimality of the\nphysical-layer scheme, and demonstrate that such cooperation boosts the\neffective SNR of the weakest user in the system, especially in the many-user\nregime, due to multiuser diversity. To harness this physical-layer scheme, we\nformulate the cooperative user scheduling and relay selection problem using the\nnetwork utility maximization framework. For such a cooperative network, we\npropose a novel utility metric that jointly captures fairness in throughput and\nthe cost of relaying in the system. We propose a joint user scheduling and\nrelay selection algorithm, which we prove to be asymptotically optimal. We\nstudy the architecture through system-level simulations over a wide range of\nscenarios. The highlight of these simulations is an approximately $6$x\nimprovement in data rate for cell-edge (bottom fifth-percentile) users (over\nthe state-of-the-art SU-MIMO) while still improving the overall throughput, and\ntaking into account various system constraints.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 00:57:30 GMT"}, {"version": "v2", "created": "Sun, 24 Apr 2016 21:49:06 GMT"}, {"version": "v3", "created": "Thu, 28 Apr 2016 00:38:17 GMT"}, {"version": "v4", "created": "Fri, 12 Aug 2016 03:08:15 GMT"}, {"version": "v5", "created": "Fri, 30 Sep 2016 20:51:52 GMT"}, {"version": "v6", "created": "Mon, 6 Mar 2017 22:06:22 GMT"}], "update_date": "2017-03-08", "authors_parsed": [["Karakus", "Can", ""], ["Diggavi", "Suhas", ""]]}, {"id": "1604.06196", "submitter": "Mingjie Feng", "authors": "Mingjie Feng and Shiwen Mao", "title": "Interference Management in Massive MIMO HetNets: A Nested Array Approach", "comments": null, "journal-ref": "Proc. IEEE GLOBECOM 2016, Washington DC, Dec. 2016, pp.1-6", "doi": "10.1109/GLOCOM.2016.7841911", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The nested array, which is implemented by nonuniform antenna placement, is an\neffective approach to achieve O(N^2) degrees of freedom (DoF) with an antenna\narray of N antennas. Such DoF refers to the number of directions of incoming\nsignals that can be resolved. With the increased number of DoF, an important\napplication of nested array is to nullify the interference signals from\nmultiple directions. In this paper, we apply nested array in a massive MIMO\nheterogeneous network (HetNet) for interference management. With nested array\nbased interference nulling, each base station (BS) can nullify a certain number\nof interference signals. A key design issue is to select the interference\nsources to be nullified at each BS. We formulate this problem as an integer\nprogramming problem. The objective is to maximize the sum rate of all users,\nsubject to BS DoF constraints. We propose an approximation scheme to solve this\nproblem and derive a performance upper bound. Simulation results show that the\nproposed scheme effectively improves the sum rate and achieves a near optimal\nperformance.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 07:10:52 GMT"}], "update_date": "2017-03-20", "authors_parsed": [["Feng", "Mingjie", ""], ["Mao", "Shiwen", ""]]}, {"id": "1604.06482", "submitter": "Jonathan Ling", "authors": "Jonathan Ling, Howard Huang, and Reinaldo Valenzuela", "title": "Wi-Fi Scaling and Performance in Dense Frequency Planned Networks", "comments": "Submitted to IEEE ICC 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The capacity scaling of a Wi-Fi network with fixed transmit power is\ninvestigated. The 802.11 MAC appears to impose a hard limit on the area\ncapacity by enforcing single transmissions in overlapped cell coverage areas.\nHowever due to the difficulty reading the packet header when transmissions\neither overlap or are faded, stations in different cells may lose\nsynchronization with each other. A large frequency planned network with full\npropagation impairments of fast and slow fading is simulated in NS-3 with an\nupgraded receiver model supporting packet capture. Downlink Wi-Fi performance\nis compared to an equivalent LTE network on the same cell centers. Results show\nthat Wi-Fi downlink throughput grows with densification limited by decreasing\nSINR and partially operational virtual carrier sense. LTE area capacity grows\nfaster as it is only constrained by SINR.\n", "versions": [{"version": "v1", "created": "Thu, 21 Apr 2016 20:26:12 GMT"}, {"version": "v2", "created": "Mon, 19 Dec 2016 16:42:02 GMT"}], "update_date": "2016-12-20", "authors_parsed": [["Ling", "Jonathan", ""], ["Huang", "Howard", ""], ["Valenzuela", "Reinaldo", ""]]}, {"id": "1604.06588", "submitter": "Jacek Kibilda", "authors": "Jacek Kibi{\\l}da, Nicholas J. Kaminski and Luiz A. DaSilva", "title": "Radio Access Network and Spectrum Sharing in Mobile Networks: A\n  Stochastic Geometry Perspective", "comments": "Accepted to IEEE Transactions on Wireless Communications", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Next generation mobile networks will rely ever more heavily on resource\nsharing. In this article we study the sharing of radio access network and\nspectrum among mobile operators. We assess the impact of sharing these two\ntypes of resources on the performance of spatially distributed mobile networks.\nWe apply stochastic geometry to observe the combined effect of, for example,\nthe level of spatial clustering among the deployed base stations, the shared\nnetwork size, or the coordination in shared spectrum use on network coverage\nand expected user data rate. We uncover some complex effects of mobile network\nresource sharing, which involve non-linearly scaling gains and performance\ntrade-offs related to the sharing scenario or the spatial clustering level.\n", "versions": [{"version": "v1", "created": "Fri, 22 Apr 2016 09:43:32 GMT"}, {"version": "v2", "created": "Mon, 6 Feb 2017 17:24:37 GMT"}], "update_date": "2017-02-07", "authors_parsed": [["Kibiłda", "Jacek", ""], ["Kaminski", "Nicholas J.", ""], ["DaSilva", "Luiz A.", ""]]}, {"id": "1604.06744", "submitter": "Bing Hu", "authors": "Bing Hu", "title": "Differential Reprogramming Based on Constructive Interference for\n  Wireless Sensor Network", "comments": "9 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  To improve the performance of reprogramming in wireless sensor network, we\npresent a novel reprogramming structure and constructive interference-based\ndissemination protocol (CIDP) to transmit the patch through out the network\nfast and reliability. CIDP disseminates the patch, which is divided into\nseveral packets, to the network exploiting constructive interference. We\nevaluate our implementation of CIDP using simulation under different number of\nnodes. Our results show that CIDP disseminates the patch less than 4\nmilliseconds. In general, the probability of a node receives the complete patch\nas high as 99.99%.\n", "versions": [{"version": "v1", "created": "Fri, 22 Apr 2016 16:48:36 GMT"}], "update_date": "2016-04-25", "authors_parsed": [["Hu", "Bing", ""]]}, {"id": "1604.06826", "submitter": "Lorenza Giupponi", "authors": "Lorenza Giupponi, Thomas Henderson, Biljana Bojovic, Marco Miozzo", "title": "Simulating LTE and Wi-Fi Coexistence in Unlicensed Spectrum with ns-3", "comments": "8 pages, pre-print", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The use of unlicensed spectrum for future LTE systems raises concerns about\nits impact on co-located Wi-Fi networks. We report herein on extensions to a\npopular network simulator, known as ns-3, to model such coexistence. To our\nknowledge, this simulator is novel in two important ways. First, it is\npresently the only freely available simulator for coexistence studies, and as\nopen source software, it offers new opportunities for reproducible research and\ncollaborative model development. Second, we are not aware of other simulators\nwith similar wireless models that allow full system studies to be conducted,\nsuch as performance evaluation of upper-layer protocols in a coexistence\nenvironment. We illustrate the value of a system simulator by describing a\nsimulation campaign for the indoor scenario designed by 3GPP RAN1 using new\nns-3 models for Release 13 LTE Listen Before Talk (LBT) techniques, intended\nfor fair coexistence with Wi-Fi. LBT models have been widely simulated at the\nlink and physical layer by many companies in 3GPP RAN1. We first show that we\nare able to tune the scenario to reproduce similar performance metrics to those\nreported in the literature. We then extend the simulations by adding TCP to the\nfile transfers and explore the different behaviour observed. Our initial study\nreveals that there remain many open questions about how LBT should be\nimplemented to achieve good coexistence properties, and that a broader scope of\nimplementation issues, traffic models, and fuller system models should be\nstudied further before drawing final conclusions on the LBT coexistence\nperformance.\n", "versions": [{"version": "v1", "created": "Fri, 22 Apr 2016 21:54:27 GMT"}, {"version": "v2", "created": "Fri, 1 Jul 2016 09:19:52 GMT"}], "update_date": "2016-07-04", "authors_parsed": [["Giupponi", "Lorenza", ""], ["Henderson", "Thomas", ""], ["Bojovic", "Biljana", ""], ["Miozzo", "Marco", ""]]}, {"id": "1604.07076", "submitter": "Gabriele D'Angelo", "authors": "Stefano Ferretti, Gabriele D'Angelo", "title": "Smart Shires: The Revenge of Countrysides (Extended Version)", "comments": "Proceedings of the IEEE Symposium on Computers and Communication\n  (ISCC 2016), Messina (Italy), 2016", "journal-ref": null, "doi": "10.1109/ISCC.2016.7543827", "report-no": null, "categories": "cs.CY cs.NI cs.PF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses the need to devise novel strategies to create smart\nservices specifically designed to non-metropolitan areas, i.e. countrysides.\nThese solutions must be viable, cheap an should take into consideration the\ndifferent nature of countrysides, that cannot afford the deployment of services\ndesigned for smart cities. These solutions would have an important social\nimpact for people leaving in these countrysides, and might slow down the\nconstant migration of citizens towards metropolis. In this work, we focus on\ncommunication technologies and practical technological/software distributed\narchitectures. An important aspect for the real deployment of these smart\nshires is their simulation. We show that priority-based broadcast schemes over\nad-hoc networks can represent an effective communication substrate to be used\nin a software middleware promoting the creation of applications for smart shire\nscenarios.\n", "versions": [{"version": "v1", "created": "Sun, 24 Apr 2016 19:36:56 GMT"}, {"version": "v2", "created": "Tue, 23 Aug 2016 19:34:02 GMT"}], "update_date": "2016-08-24", "authors_parsed": [["Ferretti", "Stefano", ""], ["D'Angelo", "Gabriele", ""]]}, {"id": "1604.07124", "submitter": "Farhad Akhoundi", "authors": "Farhad Akhoundi, Saeed Sharifi-Malvajerdi, Omid Poursaeed, Jawad A.\n  Salehi", "title": "Analytical Studies of Fragmented-Spectrum Multi-Level OFDM-CDMA\n  Technique in Cognitive Radio Networks", "comments": "6 pages and 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a multi-user resource allocation framework using\nfragmented-spectrum synchronous OFDM-CDMA modulation over a frequency-selective\nfading channel. In particular, given pre-existing communications in the\nspectrum where the system is operating, a channel sensing and estimation method\nis used to obtain information of subcarrier availability. Given this\ninformation, some real-valued multi-level orthogonal codes, which are\northogonal codes with values of $\\{\\pm1,\\pm2,\\pm3,\\pm4, ... \\}$, are provided\nfor emerging new users, i.e., cognitive radio users. Additionally, we have\nobtained a closed form expression for bit error rate of cognitive radio\nreceivers in terms of detection probability of primary users, CR users' sensing\ntime and CR users' signal to noise ratio. Moreover, simulation results obtained\nin this paper indicate the precision with which the analytical results have\nbeen obtained in modeling the aforementioned system.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2016 04:21:21 GMT"}], "update_date": "2016-04-26", "authors_parsed": [["Akhoundi", "Farhad", ""], ["Sharifi-Malvajerdi", "Saeed", ""], ["Poursaeed", "Omid", ""], ["Salehi", "Jawad A.", ""]]}, {"id": "1604.07179", "submitter": "Fatemeh Ghassemi", "authors": "Behnaz Yousefi, Fatemeh Ghassemi, Ramtin Khosravi", "title": "Modeling and Efficient Verification of Wireless Ad hoc Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.LO", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Wireless ad hoc networks, in particular mobile ad hoc networks (MANETs), are\ngrowing very fast as they make communication easier and more available.\nHowever, their protocols tend to be difficult to design due to topology\ndependent behavior of wireless communication, and their distributed and\nadaptive operations to topology dynamism. Therefore, it is desirable to have\nthem modeled and verified using formal methods. In this paper, we present an\nactor-based modeling language with the aim to model MANETs. We address main\nchallenges of modeling wireless ad hoc networks such as local broadcast,\nunderlying topology, and its changes, and discuss how they can be efficiently\nmodeled at the semantic level to make their verification amenable. The new\nframework abstracts the data link layer services by providing asynchronous\n(local) broadcast and unicast communication, while message delivery is in order\nand is guaranteed for connected receivers. We illustrate the applicability of\nour framework through two routing protocols, namely flooding and AODVv2-11, and\nshow how efficiently their state spaces can be reduced by the proposed\ntechniques. Furthermore, we demonstrate a loop formation scenario in AODV,\nfound by our analysis tool.\n", "versions": [{"version": "v1", "created": "Mon, 25 Apr 2016 09:38:14 GMT"}, {"version": "v2", "created": "Mon, 17 Apr 2017 07:45:56 GMT"}], "update_date": "2017-04-18", "authors_parsed": [["Yousefi", "Behnaz", ""], ["Ghassemi", "Fatemeh", ""], ["Khosravi", "Ramtin", ""]]}, {"id": "1604.07525", "submitter": "Yuyi Mao", "authors": "Juan Liu, Yuyi Mao, Jun Zhang, Khaled B. Letaief", "title": "Delay-Optimal Computation Task Scheduling for Mobile-Edge Computing\n  Systems", "comments": "8 pages, 3 figures, accepted to IEEE International Symposium on\n  Information Theory (ISIT), Barcelona, Spain, July 2016", "journal-ref": null, "doi": "10.1109/ISIT.2016.7541539", "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobile-edge computing (MEC) emerges as a promising paradigm to improve the\nquality of computation experience for mobile devices. Nevertheless, the design\nof computation task scheduling policies for MEC systems inevitably encounters a\nchallenging two-timescale stochastic optimization problem. Specifically, in the\nlarger timescale, whether to execute a task locally at the mobile device or to\noffload a task to the MEC server for cloud computing should be decided, while\nin the smaller timescale, the transmission policy for the task input data\nshould adapt to the channel side information. In this paper, we adopt a Markov\ndecision process approach to handle this problem, where the computation tasks\nare scheduled based on the queueing state of the task buffer, the execution\nstate of the local processing unit, as well as the state of the transmission\nunit. By analyzing the average delay of each task and the average power\nconsumption at the mobile device, we formulate a power-constrained delay\nminimization problem, and propose an efficient one-dimensional search algorithm\nto find the optimal task scheduling policy. Simulation results are provided to\ndemonstrate the capability of the proposed optimal stochastic task scheduling\npolicy in achieving a shorter average execution delay compared to the baseline\npolicies.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 05:31:31 GMT"}, {"version": "v2", "created": "Tue, 3 May 2016 02:24:57 GMT"}, {"version": "v3", "created": "Tue, 10 May 2016 05:38:17 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Liu", "Juan", ""], ["Mao", "Yuyi", ""], ["Zhang", "Jun", ""], ["Letaief", "Khaled B.", ""]]}, {"id": "1604.07539", "submitter": "Muhammad Yousefnezhad", "authors": "Saeid Aghaei Nezhad Firouzja, Muhammad Yousefnezhad, Masoud Samadi,\n  Mohd Fauzi Othman", "title": "A Wised Routing Protocols for Leo Satellite Networks", "comments": "The 10th Asian Control Conference (ASCC), Universiti Teknologi\n  Malaysia, Malaysia", "journal-ref": null, "doi": "10.1109/ASCC.2015.7244415", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This Study proposes a routing strategy of combining a packet scheduling with\ncongestion control policy that applied for LEO satellite network with high\nspeed and multiple traffic. It not only ensures the QoS of different traffic,\nbut also can avoid low priority traffic to be \"starve\" due to their weak\nresource competitiveness, thus it guarantees the throughput and performance of\nthe network. In the end, we set up a LEO satellite network simulation platform\nin OPNET to verify the effectiveness of the proposed algorithm.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 06:34:11 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Firouzja", "Saeid Aghaei Nezhad", ""], ["Yousefnezhad", "Muhammad", ""], ["Samadi", "Masoud", ""], ["Othman", "Mohd Fauzi", ""]]}, {"id": "1604.07572", "submitter": "Yuedong Xu", "authors": "Tong Zhen, Yuedong Xu, Tao Yang, Bo Hu", "title": "QoE-Aware Proactive Caching of Scalable Videos Over Small Cell Networks", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The explosion of mobile video traffic imposes tremendous challenges on\npresent cellular networks. To alleviate the pressure on backhaul links and to\nenhance the quality of experience (QoE) of video streaming service, small cell\nbase stations (SBS) with caching ability are introduced to assist the content\ndelivery. In this paper, we present the first study on the optimal caching\nstrategy of scalable video coding (SVC) streaming in small cell networks with\nthe consideration of channel diversity and video scalability. We formulate an\ninteger programming problem to maximize the average SVC QoE under the\nconstraint of cache size at each SBS. By establishing connections between QoE\nand caching state of each video, we simplify the proactive caching of SVC as a\nmultiple-choice knapsack problem (MCKP), and propose a low-complexity algorithm\nusing dynamic programming. Our proactive caching strategy reveals the\nstructural properties of cache allocation to each video based on their\npopularity profiles. Simulation results manifest that the SBSs with caching\nability can greatly improve the average QoE of SVC streaming service, and that\nour proposed caching strategy acquires significant performance gain compared\nwith other conventional caching policies.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 08:55:04 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Zhen", "Tong", ""], ["Xu", "Yuedong", ""], ["Yang", "Tao", ""], ["Hu", "Bo", ""]]}, {"id": "1604.07621", "submitter": "Danfeng Shan", "authors": "Danfeng Shan, Fengyuan Ren, Peng Cheng, Ran Shu", "title": "Micro-burst in Data Centers: Observations, Implications, and\n  Applications", "comments": "14 pages, 18 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Micro-burst traffic is not uncommon in data centers. It can cause packet\ndropping, which results in serious performance degradation (e.g., Incast\nproblem). However, current solutions that attempt to suppress micro-burst\ntraffic are extrinsic and ad hoc, since they lack the comprehensive and\nessential understanding of micro-burst's root cause and dynamic behavior. On\nthe other hand, traditional studies focus on traffic burstiness in a single\nflow, while in data centers micro-burst traffic could occur with highly fan-in\ncommunication pattern, and its dynamic behavior is still unclear. To this end,\nin this paper we re-examine the micro-burst traffic in typical data center\nscenarios. We find that evolution of micro-burst is determined by both TCP's\nself-clocking mechanism and bottleneck link. Besides, dynamic behaviors of\nmicro-burst under various scenarios can all be described by the slope of queue\nlength increasing. Our observations also implicate that conventional solutions\nlike absorbing and pacing are ineffective to mitigate micro-burst traffic.\nInstead, senders need to slow down as soon as possible. Inspired by the\nfindings and insights from experimental observations, we propose S-ECN policy,\nwhich is an ECN marking policy leveraging the slope of queue length increasing.\nTransport protocols utilizing S-ECN policy can suppress the sharp queue length\nincrement by over 50%, and reduce the 99th percentile of query completion time\nby ~20%.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 11:17:00 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Shan", "Danfeng", ""], ["Ren", "Fengyuan", ""], ["Cheng", "Peng", ""], ["Shu", "Ran", ""]]}, {"id": "1604.07679", "submitter": "Laurent Reynaud", "authors": "Laurent Reynaud (DANTE, IXXI, LIP), Isabelle Guerin-Lassous (DANTE,\n  IXXI, LIP)", "title": "Physics-Based Swarm Intelligence for Disaster Relief Communications", "comments": "in International Conference on Ad Hoc Networks and Wireless, Jul\n  2016, Lille, France", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study explores how a swarm of aerial mobile vehicles can provide network\nconnectivity and meet the stringent requirements of public protection and\ndisaster relief operations. In this context, we design a physics-based\ncontrolled mobility strategy, which we name the extended Virtual Force Protocol\n(VFPe), allowing self-propelled nodes, and in particular here unmanned aerial\nvehicles, to fly autonomously and cooperatively. In this way, ground devices\nscattered on the operation site may establish communications through the\nwireless multi-hop communication routes formed by the network of aerial nodes.\nWe further investigate through simulations the behavior of the VFPe protocol,\nnotably focusing on the way node location information is disseminated into the\nnetwork as well as on the impact of the number of exploration nodes on the\noverall network performance.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 13:55:26 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Reynaud", "Laurent", "", "DANTE, IXXI, LIP"], ["Guerin-Lassous", "Isabelle", "", "DANTE,\n  IXXI, LIP"]]}, {"id": "1604.07701", "submitter": "Gabriele D'Angelo", "authors": "Stefano Ferretti, Gabriele D'Angelo, Vittorio Ghini", "title": "Smart Multihoming in Smart Shires: Mobility and Communication Management\n  for Smart Services in Countrysides", "comments": "Proceedings of the IEEE Symposium on Computers and Communication\n  (ISCC 2016), Messina (Italy), 2016", "journal-ref": null, "doi": "10.1109/ISCC.2016.7543862", "report-no": null, "categories": "cs.NI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper discusses on the need to focus on effective and cheap\ncommunication solutions for the deployment of smart services in countrysides.\nWe present the main wireless technologies, software architectures and protocols\nthat need to be exploited, such as multihop, multipath communication and\nmobility support through multihoming. We present Always Best Packet Switching\n(ABPS), an operation mode to perform network handover in a seamless way without\nthe need to change the current network infrastructure and configuration. This\nis in accordance with the need of having cheap solutions that may work in a\nsmart shire scenario. A simulation assessment confirms the effectiveness of our\napproach.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 14:52:42 GMT"}, {"version": "v2", "created": "Tue, 23 Aug 2016 19:31:09 GMT"}], "update_date": "2016-08-24", "authors_parsed": [["Ferretti", "Stefano", ""], ["D'Angelo", "Gabriele", ""], ["Ghini", "Vittorio", ""]]}, {"id": "1604.07769", "submitter": "Dhanasekaran Balaji", "authors": "R. Malathi, Alagarsamy, V. Veeramani, RD. Balaji", "title": "An Appropriate Sensor Distribution Technique in Wireless Sensor Networks", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wireless Sensor Network (WSN) is pertinent to many applications with varied\nnetwork parameters. Sensor node placement in the application region whether it\nis indoor or outdoor is a major task as well as plays very remarkable role in\nthe network performance. Node placement is carried out according to the region\nwhere it is applied, either deterministic or non deterministic. Because of the\nneed for different sensing probability or detection probability, same approach\nof sensor placement may not be suited for all the applications. Some of the\napplications are well formed and give better performance with the uniform\ndistribution of sensors but few need intense distribution of nodes in\nparticular sensitive places especially those applications meant for intrusion\ndetection. An application which needs high level intrusion detection and a\nsuitable sensor distribution methodology, known as Half-Normal Distribution\n(Half-Gaussian) based deployment, have been set forth in this paper. We have\nalso discussed the theoretical comparison for detection probability with the\nuniform distribution in terms of number of sensor nodes.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 17:46:55 GMT"}], "update_date": "2016-04-27", "authors_parsed": [["Malathi", "R.", ""], ["Alagarsamy", "", ""], ["Veeramani", "V.", ""], ["Balaji", "RD.", ""]]}, {"id": "1604.07881", "submitter": "Ramanathan Subramanian", "authors": "Ramanathan Subramanian, Benjamin Drozdenko, Eric Doyle, Rameez Ahmed,\n  Miriam Leeser, and Kaushik R. Chowdhury", "title": "High-Level System Design of IEEE 802.11b Standard-Compliant Link Layer\n  for MATLAB-Based SDR", "comments": "19 pages, in press, IEEE Access Journal", "journal-ref": null, "doi": "10.1109/ACCESS.2016.2553671", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Software defined radio (SDR) allows unprecedented levels of flexibility by\ntransitioning the radio communication system from a rigid hardware platform to\na more user-controlled software paradigm. However, it can still be time\nconsuming to design and implement such SDRs as they typically require thorough\nknowledge of the operating environment and a careful tuning of the program. In\nthis work, our contribution is the design of a bidirectional transceiver that\nruns on the commonly used USRP platform and implemented in MATLAB using\nstandard tools like MATLAB Coder and MEX to speed up the processing steps. We\noutline strategies on how to create a state-action based design, wherein the\nsame node switches between transmitter and receiver functions. Our design\nallows optimal selection of the parameters towards meeting the timing\nrequirements set forth by various processing blocks associated with a DBPSK\nphysical layer and CSMA/CA/ACK MAC layer so that all operations remain\nfunctionally compliant with the IEEE 802.11b standard for the 1 Mbps\nspecification. The code base of the system is enabled through the\nCommunications System Toolbox and incorporates channel sensing and exponential\nrandom back-off for contention resolution. The current work provides an\nexperimental testbed that enables creation of new MAC protocols starting from\nthe fundamental IEEE 802.11b standard. Our design approach guarantees\nconsistent performance of the bi-directional link, and the three node\nexperimental results demonstrate the robustness of the system in mitigating\npacket collisions and enforcing fairness among nodes, making it a feasible\nframework in higher layer protocol design.\n", "versions": [{"version": "v1", "created": "Tue, 26 Apr 2016 22:53:05 GMT"}], "update_date": "2016-04-28", "authors_parsed": [["Subramanian", "Ramanathan", ""], ["Drozdenko", "Benjamin", ""], ["Doyle", "Eric", ""], ["Ahmed", "Rameez", ""], ["Leeser", "Miriam", ""], ["Chowdhury", "Kaushik R.", ""]]}, {"id": "1604.08243", "submitter": "Adisorn Lertsinsrubtavee", "authors": "Arjuna Sathiaseelan, Adisorn Lertsinsrubtavee, Adarsh Jagan S, Prakash\n  Baskaran and Jon Crowcroft", "title": "Cloudrone: Micro Clouds in the Sky", "comments": "6 pages, 11 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Recent years have witnessed several initiatives on enabling Internet access\nto the next three billion people. Access to the Internet necessarily translates\nto access to its services. This means that the goal of providing Internet\naccess requires ac- cess to its critical service infrastructure, which are\ncurrently hosted in the cloud. However, recent works have pointed out that the\ncurrent cloud centric nature of the Internet is a fundamental barrier for\nInternet access in rural/remote areas as well as in developing regions. It is\nimportant to explore (low cost) solutions such as micro cloud infrastructures\nthat can provide services at the edge of the network (potentially on demand),\nright near the users. In this paper, we present Cloudrone- a preliminary idea\nof deploying a lightweight micro cloud infrastructure in the sky using\nindigenously built low cost drones, single board computers and lightweight\nOperating System virtualization technologies. Our paper lays out the\npreliminary ideas on such a system that can be instantaneously deployed on\ndemand. We describe an initial design of the Cloudrone and provide a\npreliminary evaluation of the proposed system mainly focussed on the\nscalability issues of supporting multiple services and users.\n", "versions": [{"version": "v1", "created": "Wed, 27 Apr 2016 21:05:18 GMT"}], "update_date": "2016-04-29", "authors_parsed": [["Sathiaseelan", "Arjuna", ""], ["Lertsinsrubtavee", "Adisorn", ""], ["S", "Adarsh Jagan", ""], ["Baskaran", "Prakash", ""], ["Crowcroft", "Jon", ""]]}, {"id": "1604.08274", "submitter": "Dmitrii Chemodanov", "authors": "Dmitrii Chemodanov, Prasad Calyam, Flavio Esposito and Andrei Sukhov", "title": "A General Constrained Shortest Path Approach for Virtual Path Embedding", "comments": "Technical Report prepared for Camera-Ready paper to appear at IEEE\n  Conference on Local and Metropolitan Area Networks, 2016", "journal-ref": null, "doi": "10.1109/LANMAN.2016.7548863", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network virtualization has become a fundamental technology to deliver\nservices for emerging data-intensive applications in fields such as\nbioinformatics and retail analytics hosted at multi-data center scales. To\ncreate and maintain a successful virtual network service, the problem of\ngenerating a constrained path manifests both in the management plane with a\nphysical path creation (chains of virtual network functions or virtual link\nembedding) and in the data plane with on-demand path adaptation (traffic\nsteering with Service Level Objective (SLO) guarantees). In this paper, we\ndefine the virtual path embedding problem to subsume the virtual link embedding\nand the constrained traffic steering problems, and propose a new scheme to\nsolve it optimally. Specifically, we introduce a novel algorithm viz.,\n\"Neighborhood Method\" (NM) which provides an on-demand path with SLO guarantees\nwhile reducing expensive over provisioning. We show that by solving the Virtual\nPath Embedding problem in a set of diverse topology scenarios we gain up to 20%\nin network utilization, and up to 150% in energy efficiency, compared to the\nexisting path embedding solutions.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 00:26:58 GMT"}], "update_date": "2016-11-15", "authors_parsed": [["Chemodanov", "Dmitrii", ""], ["Calyam", "Prasad", ""], ["Esposito", "Flavio", ""], ["Sukhov", "Andrei", ""]]}, {"id": "1604.08357", "submitter": "Mauro Femminella", "authors": "Mauro Femminella, Gianluca Reali, Dario Valocchi", "title": "A signaling protocol for service function localization", "comments": "Accepted for publication in IEEE Communications Letters", "journal-ref": "IEEE Communications Letters, 2016", "doi": "10.1109/LCOMM.2016.2564960", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current proposals for combining service functions (SFs) do not address some\ncritical management issues, such as the discovery of SF instances close to IP\ndata paths. This information is crucial for deploying complex services both in\nlarge cloud networks, where SFs may be moved or replicated, and in the emerging\nfog/mobile edge computing systems. For this purpose, in this letter we propose\nthe distributed off-path signaling protocol (OSP). We show the protocol\nfunctions and demonstrate its scalability and effectiveness by experimental\nresults.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 09:35:32 GMT"}], "update_date": "2016-05-16", "authors_parsed": [["Femminella", "Mauro", ""], ["Reali", "Gianluca", ""], ["Valocchi", "Dario", ""]]}, {"id": "1604.08397", "submitter": "Timothy O'Shea", "authors": "Timothy J O'Shea, Kiran Karra", "title": "GNU Radio Signal Processing Models for Dynamic Multi-User Burst Modems", "comments": "in Software Radio Implementation Forum 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a modern method for implementing burst modems in GNU\nRadio. Since burst modems are widely used for multi-user channel access and\nsharing in non-broadcast radio systems, this capability is critical to the\ndevelopment of numerous waveforms in GNU Radio. We focus on making such systems\neasy to develop and adapt to wide classes of modems and computationally\nefficient at runtime. We use the GNU Radio Event Stream scheduler to\ndemonstrate concise implementations of burst PSK and FSK modems in GNU Radio\nand compare this with alternate approaches which have been attempted in GNU\nRadio.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 13:05:03 GMT"}], "update_date": "2016-04-29", "authors_parsed": [["O'Shea", "Timothy J", ""], ["Karra", "Kiran", ""]]}, {"id": "1604.08418", "submitter": "Nikolaos Pappas", "authors": "Nikolaos Pappas and Marios Kountouris and Anthony Ephremides and\n  Vangelis Angelakis", "title": "Stable Throughput Region of the Two-User Broadcast Channel", "comments": "Submitted for journal publication", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IT cs.NI math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider the two-user broadcast channel and we characterize\nits stable throughout region. We start the analysis by providing the stability\nregion for the general case without any specific considerations on transmission\nand reception mechanisms. We also provide conditions for the stable throughput\nregion to be convex. Subsequently, we consider the case where the transmitter\nuses superposition coding and we consider two special cases for the receivers.\nThe first one is when both receivers treat interference as noise. The second is\nwhen the user with a better channel uses successive decoding and the other\nreceiver treats interference as noise.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 13:57:48 GMT"}], "update_date": "2016-04-29", "authors_parsed": [["Pappas", "Nikolaos", ""], ["Kountouris", "Marios", ""], ["Ephremides", "Anthony", ""], ["Angelakis", "Vangelis", ""]]}, {"id": "1604.08552", "submitter": "Sameh Sorour", "authors": "Rabe Arshad, Hesham ElSawy, Sameh Sorour, Tareq Y. Al-Naffouri,\n  Mohamed-Slim Alouini", "title": "Handover Management in Dense Cellular Networks: A Stochastic Geometry\n  Approach", "comments": "7 pages, 7 figures, ICC 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cellular operators are continuously densifying their networks to cope with\nthe ever-increasing capacity demand. Furthermore, an extreme densification\nphase for cellular networks is foreseen to fulfill the ambitious fifth\ngeneration (5G) performance requirements. Network densification improves\nspectrum utilization and network capacity by shrinking base stations' (BSs)\nfootprints and reusing the same spectrum more frequently over the spatial\ndomain. However, network densification also increases the handover (HO) rate,\nwhich may diminish the capacity gains for mobile users due to HO delays. In\nhighly dense 5G cellular networks, HO delays may neutralize or even negate the\ngains offered by network densification. In this paper, we present an analytical\nparadigm, based on stochastic geometry, to quantify the effect of HO delay on\nthe average user rate in cellular networks. To this end, we propose a flexible\nhandover scheme to reduce HO delay in case of highly dense cellular networks.\nThis scheme allows skipping the HO procedure with some BSs along users'\ntrajectories. The performance evaluation and testing of this scheme for only\nsingle HO skipping shows considerable gains in many practical scenarios.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 18:44:12 GMT"}], "update_date": "2016-04-29", "authors_parsed": [["Arshad", "Rabe", ""], ["ElSawy", "Hesham", ""], ["Sorour", "Sameh", ""], ["Al-Naffouri", "Tareq Y.", ""], ["Alouini", "Mohamed-Slim", ""]]}, {"id": "1604.08618", "submitter": "Freddy C. Chua", "authors": "Freddy C. Chua, Julie Ward, Ying Zhang, Puneet Sharma, Bernardo A.\n  Huberman", "title": "Stringer: Balancing Latency and Resource Usage in Service Function Chain\n  Provisioning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network Functions Virtualization, or NFV, enables telecommunications\ninfrastructure providers to replace special-purpose networking equipment with\ncommodity servers running virtualized network functions (VNFs). A service\nprovider utilizing NFV technology faces the SFC provisioning problem of\nassigning VNF instances to nodes in the physical infrastructure (e.g., a\ndatacenter), and routing Service Function Chains (sequences of functions\nrequired by customers, a.k.a. SFCs) in the physical network. In doing so, the\nprovider must balance between various competing goals of performance and\nresource usage. We present an approach for SFC provisioning, consisting of\nthree elements. The first element is a fast, scalable round-robin heuristic.\nThe second element is a Mixed Integer Programming (MIP) based approach. The\nthird element is a queueing-theoretic model to estimate the average latency\nassociated with any SFC provisioning solution. Combined, these elements create\nan approach that generates a set of SFC provisioning solutions, reflecting\ndifferent tradeoffs between resource usage and performance.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 21:05:54 GMT"}, {"version": "v2", "created": "Thu, 9 Jun 2016 21:51:57 GMT"}], "update_date": "2016-06-13", "authors_parsed": [["Chua", "Freddy C.", ""], ["Ward", "Julie", ""], ["Zhang", "Ying", ""], ["Sharma", "Puneet", ""], ["Huberman", "Bernardo A.", ""]]}, {"id": "1604.08625", "submitter": "Victor Hugo Ba\\~nos Gonzalez", "authors": "Victor Ba\\~nos-Gonzalez, M. Shahwaiz Afaqui, Elena Lopez-Aguilera,\n  Eduard Garcia-Villegas", "title": "Throughput and range characterization of IEEE 802.11ah", "comments": "7 pages, 6 figures, 5 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The most essential part of Internet of Things (IoT) infrastructure is the\nwireless communication system that acts as a bridge for the delivery of data\nand control messages. However, the existing wireless technologies lack the\nability to support a huge amount of data exchange from many battery driven\ndevices spread over a wide area. In order to support the IoT paradigm, the IEEE\n802.11 standard committee is in process of introducing a new standard, called\nIEEE 802.11ah. This is one of the most promising and appealing standards, which\naims to bridge the gap between traditional mobile networks and the demands of\nthe IoT. In this paper, we first discuss the main PHY and MAC layer amendments\nproposed for IEEE 802.11ah. Furthermore, we investigate the operability of IEEE\n802.11ah as a backhaul link to connect devices over a long range. Additionally,\nwe compare the aforementioned standard with previous notable IEEE 802.11\namendments (i.e. IEEE 802.11n and IEEE 802.11ac) in terms of throughput (with\nand without frame aggregation) by utilizing the most robust modulation schemes.\nThe results show an improved performance of IEEE 802.11ah (in terms of power\nreceived at long range while experiencing different packet error rates) as\ncompared to previous IEEE 802.11 standards.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 21:42:06 GMT"}], "update_date": "2016-05-02", "authors_parsed": [["Baños-Gonzalez", "Victor", ""], ["Afaqui", "M. Shahwaiz", ""], ["Lopez-Aguilera", "Elena", ""], ["Garcia-Villegas", "Eduard", ""]]}, {"id": "1604.08632", "submitter": "Jeongho Jeon", "authors": "Hwan-Joon (Eddy) Kwon, Jeongho Jeon, Abhijeet Bhorkar, Qiaoyang Ye,\n  Hiroki Harada, Yu Jiang, Liu Liu, Satoshi Nagata, Boon Loong Ng, Thomas\n  Novlan, Jinyoung Oh, Wang Yi", "title": "Licensed-Assisted Access to Unlicensed Spectrum in LTE Release 13", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Exploiting the unlicensed spectrum is considered by 3GPP as one promising\nsolution to meet the ever-increasing traffic growth. As a result, one major\nenhancement for LTE in Release 13 has been to enable its operation in the\nunlicensed spectrum via Licensed-Assisted Access (LAA). In this article, we\nprovide an overview of the Release 13 LAA technology including motivation, use\ncases, LTE enhancements for enabling the unlicensed band operation, and the\ncoexistence evaluation results contributed by 3GPP participants.\n", "versions": [{"version": "v1", "created": "Thu, 28 Apr 2016 22:04:45 GMT"}], "update_date": "2016-05-02", "authors_parsed": [["Hwan-Joon", "", "", "Eddy"], ["Kwon", "", ""], ["Jeon", "Jeongho", ""], ["Bhorkar", "Abhijeet", ""], ["Ye", "Qiaoyang", ""], ["Harada", "Hiroki", ""], ["Jiang", "Yu", ""], ["Liu", "Liu", ""], ["Nagata", "Satoshi", ""], ["Ng", "Boon Loong", ""], ["Novlan", "Thomas", ""], ["Oh", "Jinyoung", ""], ["Yi", "Wang", ""]]}, {"id": "1604.08727", "submitter": "Muhammad Ikram Ashraf", "authors": "Muhammad Ikram Ashraf, Mehdi Bennis, Walid Saad and Marcos Katz", "title": "Exploring Social Networks for Optimized User Association in Wireless\n  Small Cell Networks with Device-to-Device Communications", "comments": "IEEE WCNC 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a novel social network aware approach for user\nassociation in wireless small cell networks. The proposed approach exploits\nsocial relationships between user equipments (UEs) and their physical proximity\nto optimize the network throughput. We formulate the problem as a matching game\nbetween UEs and their serving nodes (SNs). In our proposed game, the serving\nnode can be a small cell base station (SCBS) or an important node with\ndevice-to-device capabilities. In this game, the SCBSs and UEs maximize their\nrespective utility functions capturing both the spatial and social structures\nof the network. We show that the proposed game belongs to the class of matching\ngames with externalities. Subsequently, we propose a distributed algorithm\nusing which the SCBSs and UEs interact and reach a stable matching. We show the\nconvergence of the proposed algorithm and study the properties of the resulting\nmatching. Simulation results show that the proposed socially-aware user\nassociation approach can efficiently offload traffic while yielding a\nsignificant gain reaching up to 63% in terms of data rates as compared to the\nclassical (social-unaware) approach.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 08:17:22 GMT"}], "update_date": "2016-05-02", "authors_parsed": [["Ashraf", "Muhammad Ikram", ""], ["Bennis", "Mehdi", ""], ["Saad", "Walid", ""], ["Katz", "Marcos", ""]]}, {"id": "1604.08734", "submitter": "Petri Luoto", "authors": "Petri Luoto, Mehdi Bennis, Pekka Pirinen, Sumudu Samarakoon, Kari\n  Horneman, Matti Latva-aho", "title": "System Level Performance Evaluation of LTE-V2X Network", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT cs.PF math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Vehicles are among the fastest growing type of connected devices. Therefore,\nthere is a need for Vehicle-to-Everything (V2X) communication i.e. passing of\ninformation from a Vehicle-to-Vehicle (V2V) or Vehicle-to-Infrastructure (V2I)\nand vice versa. In this paper, the main focus is on the communication between\nvehicles and road side units (RSUs) commonly referred to as V2I communication\nin a multi-lane freeway scenario. Moreover, we analyze network related\nbottlenecks such as the maximum number of vehicles that can be supported when\ncoverage is provided by the Long Term Evolution Advanced (LTE-A) network. The\nperformance evaluation is assessed through extensive system-level simulations.\nResults show that new resource allocation and interference mitigation\ntechniques are needed in order to achieve the required high reliability\nrequirements, especially when network load is high.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 08:37:43 GMT"}], "update_date": "2016-05-02", "authors_parsed": [["Luoto", "Petri", ""], ["Bennis", "Mehdi", ""], ["Pirinen", "Pekka", ""], ["Samarakoon", "Sumudu", ""], ["Horneman", "Kari", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1604.08744", "submitter": "Sumudu Samarakoon Mr.", "authors": "Sumudu Samarakoon and Mehdi Bennis and Walid Saad and Matti Latva-aho", "title": "Enabling Relaying Over Heterogeneous Backhauls in the Uplink of Wireless\n  Femtocell Networks", "comments": "6 pages, 6 figures, 1 table, WiOpt12 (published)", "journal-ref": "pp. 75-80, May 2012", "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we develop novel two-tier interference management strategies\nthat enable macrocell users (MUEs) to improve their performance, with the help\nof open-access femtocells. To this end, we propose a rate-splitting technique\nusing which the MUEs optimize their uplink transmissions by dividing their\nsignals into two types: a coarse message that is intended for direct\ntransmission to the macrocell base station and a fine message that is decoded\nby a neighboring femtocell and subsequently relayed over a heterogeneous\n(wireless/wired) backhaul. For deploying the proposed technique, we formulate a\nnon-cooperative game between the MUEs in which each MUE can decide on its\nrelaying femtocell while maximizing a utility function that captures both the\nachieved throughput and the expected backhaul delay. Simulation results show\nthat the proposed approach yields up to 125% rate improvement and up to 2 times\ndelay reduction with wired backhaul and, 150% rate improvement and up to 10\ntimes delay reduction with wireless backhaul, relative to classical\ninterference management approaches, with no cross-tier cooperation.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 09:12:54 GMT"}], "update_date": "2016-05-02", "authors_parsed": [["Samarakoon", "Sumudu", ""], ["Bennis", "Mehdi", ""], ["Saad", "Walid", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1604.08756", "submitter": "Sumudu Samarakoon Mr.", "authors": "Sumudu Samarakoon and Mehdi Bennis and Walid Saad and Matti Latva-aho", "title": "Opportunistic Sleep Mode Strategies in Wireless Small Cell Networks", "comments": "5 pages, 6 figures, 1 table, ICC 2014 (published), pp. 2707-2712,\n  Jun. 2014. arXiv admin note: text overlap with arXiv:1604.08758", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The design of energy-efficient mechanisms is one of the key challenges in\nemerging wireless small cell networks. In this paper, a novel approach for\nopportunistically switching ON/OFF base stations to improve the energy\nefficiency in wireless small cell networks is proposed. The proposed approach\nenables the small cell base stations to optimize their downlink performance\nwhile balancing the load among each another, while satisfying their users'\nquality-of-service requirements. The problem is formulated as a noncooperative\ngame among the base stations that seek to minimize a cost function which\ncaptures the tradeoff between energy expenditure and load. To solve this game,\na distributed learning algorithm is proposed using which the base stations\nautonomously choose their optimal transmission strategies. Simulation results\nshow that the proposed approach yields significant performance gains in terms\nof reduced energy expenditures up to 23% and reduced load up to 40% compared to\nconventional approaches.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 10:00:33 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Samarakoon", "Sumudu", ""], ["Bennis", "Mehdi", ""], ["Saad", "Walid", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1604.08758", "submitter": "Sumudu Samarakoon Mr.", "authors": "Sumudu Samarakoon and Mehdi Bennis and Walid Saad and Matti Latva-aho", "title": "Dynamic Clustering and Sleep Mode Strategies for Small Cell Networks", "comments": "5 pages, 4 figures, 1 table, ISWCS 2014 (published), pp. 934-938,\n  Aug. 2014. arXiv admin note: text overlap with arXiv:1604.08756", "journal-ref": null, "doi": "10.1109/ISWCS.2014.6933487", "report-no": null, "categories": "cs.NI cs.IT math.IT", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a novel cluster-based approach for optimizing the energy\nefficiency of wireless small cell networks is proposed. A dynamic mechanism\nbased on the spectral clustering technique is proposed to dynamically form\nclusters of small cell base stations. Such clustering enables intra-cluster\ncoordination among the base stations for optimizing the downlink performance\nthrough load balancing, while satisfying users' quality-of-service\nrequirements. In the proposed approach, the clusters use an opportunistic base\nstation sleep-wake switching mechanism to strike a balance between delay and\nenergy consumption. The inter-cluster interference affects the performance of\nthe clusters and their choices of active or sleep state. Due to the lack of\ninter-cluster communications, the clusters have to compete with each other to\nmake decisions on improving the energy efficiency. This competition is\nformulated as a noncooperative game among the clusters that seek to minimize a\ncost function which captures the tradeoff between energy expenditure and load.\nTo solve this game, a distributed learning algorithm is proposed using which\nthe clusters autonomously choose their optimal transmission strategies.\nSimulation results show that the proposed approach yields significant\nperformance gains in terms of reduced energy expenditures up to 40% and reduced\nload up to 23% compared to conventional approaches.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 10:08:43 GMT"}], "update_date": "2016-05-03", "authors_parsed": [["Samarakoon", "Sumudu", ""], ["Bennis", "Mehdi", ""], ["Saad", "Walid", ""], ["Latva-aho", "Matti", ""]]}, {"id": "1604.08937", "submitter": "Sanjay Goyal", "authors": "Sanjay Goyal, Pei Liu, Shivendra Panwar", "title": "User Selection and Power Allocation in Full Duplex Multi-Cell Networks", "comments": "15 pages, to be published in IEEE Transactions on Vehicular\n  Technology, 2016. arXiv admin note: text overlap with arXiv:1412.8708", "journal-ref": null, "doi": "10.1109/TVT.2016.2580583", "report-no": null, "categories": "cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Full duplex (FD) communications has the potential to double the capacity of a\nhalf duplex (HD) system at the link level. However, in a cellular network, FD\noperation is not a straightforward extension of half duplex operations. The\nincreased interference due to a large number of simultaneous transmissions in\nFD operation and realtime traffic conditions limits the capacity improvement.\nRealizing the potential of FD requires careful coordination of resource\nallocation among the cells as well as within the cell. In this paper, we\npropose a distributed resource allocation, i.e., joint user selection and power\nallocation for a FD multi-cell system, assuming FD base stations (BSs) and HD\nuser equipment (UEs). Due to the complexity of finding the globally optimum\nsolution, a sub-optimal solution for UE selection, and a novel geometric\nprogramming based solution for power allocation, are proposed. The proposed\ndistributed approach converges quickly and performs almost as well as a\ncentralized solution, but with much lower signaling overhead. It provides a\nhybrid scheduling policy which allows FD operations whenever it is\nadvantageous, but otherwise defaults to HD operation. We focus on small cell\nsystems because they are more suitable for FD operation, given practical\nself-interference cancellation limits.With practical self-interference\ncancellation, it is shown that the proposed hybrid FD system achieves nearly\ntwo times throughput improvement for an indoor multi-cell scenario, and about\n65% improvement for an outdoor multi-cell scenario compared to the HD system.\n", "versions": [{"version": "v1", "created": "Fri, 29 Apr 2016 19:07:14 GMT"}, {"version": "v2", "created": "Sat, 11 Jun 2016 20:13:35 GMT"}], "update_date": "2016-11-17", "authors_parsed": [["Goyal", "Sanjay", ""], ["Liu", "Pei", ""], ["Panwar", "Shivendra", ""]]}]