[{"id": "1406.0295", "submitter": "Ovidiu-Andrei Schipor", "authors": "Stefan Gheorghe Pentiuc, Felicia Giza, Ovidiu Andrei Schipor", "title": "Mobile Agents for Distance Evaluation Procedures", "comments": "4 pages, 1 figure", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The growth of Internet has led to new approaches for distance education. The\nmain mechanisms involved in this process are distance learning and distance\nevaluation. Distance learning have multiple forms, from browsing and finding\ninformation when needed or collecting information onto ready-to-use packages,\nto interactive content where the learner is able to affect and control the\ncontent in some way. From the teacher's point of view, evaluation of learning\naims to determine whether the students have achieved the goals set for a\nparticular topic or course. Typically this is tested somehow and based on the\ntest results, evaluation is performed. This kind of method is always restricted\nto the test, however. Many times the students may actually learn something\ncompletely different from those that are tested. Furthermore, testing does not\nnecessarily take the students' individual needs into account. However, when\nproperly designed, the testing method is a practical and even fairly reliable\nway of evaluating learning.\n", "versions": [{"version": "v1", "created": "Mon, 2 Jun 2014 08:57:26 GMT"}], "update_date": "2014-06-03", "authors_parsed": [["Pentiuc", "Stefan Gheorghe", ""], ["Giza", "Felicia", ""], ["Schipor", "Ovidiu Andrei", ""]]}, {"id": "1406.0495", "submitter": "Ovidiu Andrei Schipor OA", "authors": "Stefan-Gheorghe Pentiuc, Ovidiu-Andrei Schipor, Mirela Danubianu,\n  Doina-Maria Schipor", "title": "Automatic Recognition of Dyslalia Affecting Pre-Scholars", "comments": "9 pages, 4 figures. arXiv admin note: text overlap with\n  arXiv:0912.3969", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This article describes the recognition part of a system that will be used for\npersonalized therapy of dyslalia affecting pre scholars. Dyslalia is a speech\ndisorder that affect pronunciation of one ore many sounds. The full system\ntargets interdisciplinary research (computer science, psychology, electronics)\n- having as main objective the development of methods, models, algorithms,\nSystem on Chip architectures with regards to the elaboration and implementation\nof a complete system addressing the therapy of dyslalia affecting pre scholars,\nin a personalized and user centered manner. The system addresses the number of\n10% of children with age between 4 and 7 that, according to the statistics,\npresent different variations of speech impairments. Although these impairments\ndo not create major difficulties concerning common communication, it has been\nnoticed that problems are likely to appear affecting negatively the child's\npersonality as well as his social environment.\n", "versions": [{"version": "v1", "created": "Thu, 29 May 2014 06:58:09 GMT"}], "update_date": "2014-06-03", "authors_parsed": [["Pentiuc", "Stefan-Gheorghe", ""], ["Schipor", "Ovidiu-Andrei", ""], ["Danubianu", "Mirela", ""], ["Schipor", "Doina-Maria", ""]]}, {"id": "1406.0574", "submitter": "Kyumin Lee", "authors": "Kyumin Lee, Steve Webb, Hancheng Ge", "title": "The Dark Side of Micro-Task Marketplaces: Characterizing Fiverr and\n  Automatically Detecting Crowdturfing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As human computation on crowdsourcing systems has become popular and powerful\nfor performing tasks, malicious users have started misusing these systems by\nposting malicious tasks, propagating manipulated contents, and targeting\npopular web services such as online social networks and search engines.\nRecently, these malicious users moved to Fiverr, a fast-growing micro-task\nmarketplace, where workers can post crowdturfing tasks (i.e., astroturfing\ncampaigns run by crowd workers) and malicious customers can purchase those\ntasks for only $5. In this paper, we present a comprehensive analysis of\nFiverr. First, we identify the most popular types of crowdturfing tasks found\nin this marketplace and conduct case studies for these crowdturfing tasks.\nThen, we build crowdturfing task detection classifiers to filter these tasks\nand prevent them from becoming active in the marketplace. Our experimental\nresults show that the proposed classification approach effectively detects\ncrowdturfing tasks, achieving 97.35% accuracy. Finally, we analyze the real\nworld impact of crowdturfing tasks by purchasing active Fiverr tasks and\nquantifying their impact on a target site. As part of this analysis, we show\nthat current security systems inadequately detect crowdsourced manipulation,\nwhich confirms the necessity of our proposed crowdturfing task detection\napproach.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jun 2014 04:26:51 GMT"}], "update_date": "2014-06-04", "authors_parsed": [["Lee", "Kyumin", ""], ["Webb", "Steve", ""], ["Ge", "Hancheng", ""]]}, {"id": "1406.0673", "submitter": "Gerardo I\\~niguez Gonz\\'alez", "authors": "Gerardo I\\~niguez, Tzipe Govezensky, Robin Dunbar, Kimmo Kaski, Rafael\n  A. Barrio", "title": "Effects of Deception in Social Networks", "comments": "19 pages, 3 figures; submitted for review", "journal-ref": "Proc. R. Soc. B 281 (1790), 20141195 (2014)", "doi": "10.1098/rspb.2014.1195", "report-no": null, "categories": "physics.soc-ph cs.CY cs.SI nlin.AO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Honesty plays a crucial role in any situation where organisms exchange\ninformation or resources. Dishonesty can thus be expected to have damaging\neffects on social coherence if agents cannot trust the information or goods\nthey receive. However, a distinction is often drawn between prosocial lies\n('white' lies) and antisocial lying (i.e. deception for personal gain), with\nthe former being considered much less destructive than the latter. We use an\nagent-based model to show that antisocial lying causes social networks to\nbecome increasingly fragmented. Antisocial dishonesty thus places strong\nconstraints on the size and cohesion of social communities, providing a major\nhurdle that organisms have to overcome (e.g. by evolving counter-deception\nstrategies) in order to evolve large, socially cohesive communities. In\ncontrast, 'white' lies can prove to be beneficial in smoothing the flow of\ninteractions and facilitating a larger, more integrated network. Our results\ndemonstrate that these group-level effects can arise as emergent properties of\ninteractions at the dyadic level. The balance between prosocial and antisocial\nlies may set constraints on the structure of social networks, and hence the\nshape of society as a whole.\n", "versions": [{"version": "v1", "created": "Tue, 3 Jun 2014 11:32:13 GMT"}], "update_date": "2015-09-15", "authors_parsed": [["Iñiguez", "Gerardo", ""], ["Govezensky", "Tzipe", ""], ["Dunbar", "Robin", ""], ["Kaski", "Kimmo", ""], ["Barrio", "Rafael A.", ""]]}, {"id": "1406.1335", "submitter": "Muhammad Imran", "authors": "Muhammad Moeen Uddin, Muhammad Imran, Hassan Sajjad", "title": "Understanding Types of Users on Twitter", "comments": "6 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  People use microblogging platforms like Twitter to involve with other users\nfor a wide range of interests and practices. Twitter profiles run by different\ntypes of users such as humans, bots, spammers, businesses and professionals.\nThis research work identifies six broad classes of Twitter users, and employs a\nsupervised machine learning approach which uses a comprehensive set of features\nto classify users into the identified classes. For this purpose, we exploit\nusers' profile and tweeting behavior information. We evaluate our approach by\nperforming 10-fold cross validation using manually annotated 716 different\nTwitter profiles. High classification accuracy (measured using AUC, and\nprecision, recall) reveals the significance of the proposed approach.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2014 10:52:12 GMT"}], "update_date": "2014-06-06", "authors_parsed": [["Uddin", "Muhammad Moeen", ""], ["Imran", "Muhammad", ""], ["Sajjad", "Hassan", ""]]}, {"id": "1406.1469", "submitter": "Rayed AlGhamdi", "authors": "Rayed AlGhamdi", "title": "Diffusion of the Adoption of Online Retailing in Saudi Arabia", "comments": "PhD thesis, 312 pages including appendices", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Despite the fact that Saudi Arabia is a leading producer of oil and natural\ngas, a member of G-20, has the largest and fastest growth of ICT marketplaces\nin the Arab region, and is very wealthy, online retailing activities are not\nprogressing at the same speed as its growing ICT marketplace. For this reason,\nthe attitudes of retailers in companies at different stages of e-commerce\nmaturity were investigated to determine what factors are causing this problem.\nThe data collection included two stages: first, interviews with 16 retailers\nand, then, based on the outcomes of the interviews, a quantitative study\ndesigned to test and further explore the qualitative interview findings with a\nsample of 153 retailers in companies at different stages of e-commerce\nmaturity. The results showed striking differences between retailers as a\nfunction of the stage of growth of their companies in regard to factors\nrelating to their perceptions of consumers and to organizational factors. At\nthe same time, the results showed agreement between retailers in companies at\ndifferent stages in relation to environmental factors. The investigation helped\nto identify the incentives and barriers for each stage of maturity and makes\nrecommendations of what could be done to help companies move from one stage to\nthe next.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2014 18:38:29 GMT"}], "update_date": "2014-06-06", "authors_parsed": [["AlGhamdi", "Rayed", ""]]}, {"id": "1406.1475", "submitter": "Rayed AlGhamdi", "authors": "Rayed AlGhamdi", "title": "Modeling CSFs of B2C E-commerce Systems Using the Enterprise\n  Architecture Approach", "comments": "Master Thesis, 80 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This study is to investigate the Critical Success Factors (CSFs) of the\nBusiness to Customer (B2C) e-commerce system. These factors should be\nconsidered comprehensively and expanded to all parties concerned to create and\nprovide the electronic service and ensure that the CSFs are satisfied. In order\nto give an organized and inclusive view of the CSFs, an enterprise architecture\nframework will be adopted to systemize this investigation.\n", "versions": [{"version": "v1", "created": "Thu, 5 Jun 2014 18:46:34 GMT"}], "update_date": "2014-06-06", "authors_parsed": [["AlGhamdi", "Rayed", ""]]}, {"id": "1406.1795", "submitter": "Remus Brad", "authors": "Nusrat Fatema and Remus Brad", "title": "Security Requirements, Counterattacks and Projects in Healthcare\n  Applications Using WSNs - A Review", "comments": null, "journal-ref": "International Journal of Computer Networking and Communication,\n  vol. 2 (2), pp. 1-9, May 2014", "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  Healthcare applications are well thought-out as interesting fields for WSN\nwhere patients can be examine using wireless medical sensor networks. Inside\nthe hospital or extensive care surroundings there is a tempting need for steady\nmonitoring of essential body functions and support for patient mobility. Recent\nresearch cantered on patient reliable communication, mobility, and\nenergy-efficient routing. Yet deploying new expertise in healthcare\napplications presents some understandable security concerns which are the\nimportant concern in the inclusive deployment of wireless patient monitoring\nsystems. This manuscript presents a survey of the security features, its\ncounter attacks in healthcare applications including some proposed projects\nwhich have been done recently.\n", "versions": [{"version": "v1", "created": "Fri, 6 Jun 2014 16:24:47 GMT"}], "update_date": "2014-06-10", "authors_parsed": [["Fatema", "Nusrat", ""], ["Brad", "Remus", ""]]}, {"id": "1406.2015", "submitter": "Kalyan Veeramachaneni", "authors": "Kalyan Veeramachaneni, Sherif Halawa, Franck Dernoncourt, Una-May\n  O'Reilly, Colin Taylor, Chuong Do", "title": "MOOCdb: Developing Standards and Systems to Support MOOC Data Science", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.CY cs.DB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a shared data model for enabling data science in Massive Open\nOnline Courses (MOOCs). The model captures students interactions with the\nonline platform. The data model is platform agnostic and is based on some basic\ncore actions that students take on an online learning platform. Students\nusually interact with the platform in four different modes: Observing,\nSubmitting, Collaborating and giving feedback. In observing mode students are\nsimply browsing the online platform, watching videos, reading material, reading\nbook or watching forums. In submitting mode, students submit information to the\nplatform. This includes submissions towards quizzes, homeworks, or any\nassessment modules. In collaborating mode students interact with other students\nor instructors on forums, collaboratively editing wiki or chatting on google\nhangout or other hangout venues. With this basic definitions of activities, and\na data model to store events pertaining to these activities, we then create a\ncommon terminology to map Coursera and edX data into this shared data model.\nThis shared data model called MOOCdb becomes the foundation for a number of\ncollaborative frameworks that enable progress in data science without the need\nto share the data.\n", "versions": [{"version": "v1", "created": "Sun, 8 Jun 2014 19:19:45 GMT"}], "update_date": "2014-06-10", "authors_parsed": [["Veeramachaneni", "Kalyan", ""], ["Halawa", "Sherif", ""], ["Dernoncourt", "Franck", ""], ["O'Reilly", "Una-May", ""], ["Taylor", "Colin", ""], ["Do", "Chuong", ""]]}, {"id": "1406.2180", "submitter": "Esteban Zapata Rojas", "authors": "Esteban Zapata Rojas", "title": "Selecting interesting zones at Aburr\\'a valley and St. Nicholas Valley's\n  using the identification method of Density-based Clustering and Improved\n  Nearest Neighbor applied on social networks", "comments": "9 pages that explain an interesting method to Clustering Social\n  Network's data, in Spanish", "journal-ref": "Zapata, E. (2015). Selecci\\'on de zonas de inter\\'es en el Valle\n  de Aburr\\'a y San Nicol\\'as con el m\\'etodo de identificaci\\'on de\n  cl\\'usteres basados en densidad y vecino cercano mejorado. Cuaderno Activa,\n  7, 27-39", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  More than ever, social networks have become an important place in the\ninteraction and behaviour of humans in the last decade. This valuable position\nmakes it imperative to analyze different aspects of everyday life and science\nin general. This paper illustrates the process of capturing and storing\ninformation, the application of density-based clustering and improved nearest\nneighbor, and a review of the results. The study also shows the elements used\nin the identification of areas of interest through clusters, circumferences and\ncoverage radii obtained for a demographic segmentation analysis of the\ninformation procured from Twitter, Flickr and the like. This results in more\nprofound conclusions about a predefined topic or theme. Finally, the need\narises to develop an application that makes all the defined process automatic,\nallowing final users interested in those topics to have access to it and get\nimportant results for their organizations or interest.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jun 2014 13:45:49 GMT"}, {"version": "v2", "created": "Tue, 15 Nov 2016 15:49:05 GMT"}], "update_date": "2016-11-16", "authors_parsed": [["Rojas", "Esteban Zapata", ""]]}, {"id": "1406.2222", "submitter": "Michelle Strout", "authors": "Timothy T. Lenczycki and Kelly Suto and Christina Williams and\n  Michelle Mills Strout", "title": "The Chemistry Between High School Students and Computer Science", "comments": "8 pages, 2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Computer science enrollments have started to rise again, but the percentage\nof women undergraduates in computer science is still low. Some studies indicate\nthis might be due to a lack of awareness of computer science at the high school\nlevel. We present our experiences running a 5-year, high school outreach\nprogram that introduces information about computer science within the context\nof required chemistry courses. We developed interactive worksheets using\nMolecular Workbench that help the students learn chemistry and computer science\nconcepts related to relevant events such as the gulf oil spill. Our evaluation\nof the effectiveness of this approach indicates that the students do become\nmore aware of computer science as a discipline, but system support issues in\nthe classroom can make the approach difficult for teachers and discouraging for\nthe students.\n", "versions": [{"version": "v1", "created": "Mon, 9 Jun 2014 15:44:41 GMT"}], "update_date": "2014-06-10", "authors_parsed": [["Lenczycki", "Timothy T.", ""], ["Suto", "Kelly", ""], ["Williams", "Christina", ""], ["Strout", "Michelle Mills", ""]]}, {"id": "1406.2398", "submitter": "Tehila Minkus", "authors": "Tehila Minkus and Nasir Memon", "title": "Leveraging Personalization To Facilitate Privacy", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online social networks have enabled new methods and modalities of\ncollaboration and sharing. These advances bring privacy concerns: online social\ndata is more accessible and persistent and simultaneously less contextualized\nthan traditional social interactions. To allay these concerns, many web\nservices allow users to configure their privacy settings based on a set of\nmultiple-choice questions.\n  We suggest a new paradigm for privacy options. Instead of suggesting the same\ndefaults to each user, services can leverage knowledge of users' traits to\nrecommend a machine-learned prediction of their privacy preferences for\nFacebook. As a case study, we build and evaluate MyPrivacy, a publicly\navailable web application that suggests personalized privacy settings. An\nevaluation with 199 users shows that users find the suggestions to be\nappropriate and private; furthermore, they express intent to implement the\nrecommendations made by MyPrivacy. This supports the proposal to put\npersonalization to work in online communities to promote privacy and security.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2014 01:00:54 GMT"}], "update_date": "2014-06-11", "authors_parsed": [["Minkus", "Tehila", ""], ["Memon", "Nasir", ""]]}, {"id": "1406.2516", "submitter": "Richard T. B. Ma", "authors": "Richard T. B. Ma", "title": "Subsidization Competition: Vitalizing the Neutral Internet", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NI cs.CY", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Unlike telephone operators, which pay termination fees to reach the users of\nanother network, Internet Content Providers (CPs) do not pay the Internet\nService Providers (ISPs) of users they reach. While the consequent cross\nsubsidization to CPs has nurtured content innovations at the edge of the\nInternet, it reduces the investment incentives for the access ISPs to expand\ncapacity. As potential charges for terminating CPs' traffic are criticized\nunder the net neutrality debate, we propose to allow CPs to voluntarily\nsubsidize the usagebased fees induced by their content traffic for end-users.\nWe model the regulated subsidization competition among CPs under a neutral\nnetwork and show how deregulation of subsidization could increase an access\nISP's utilization and revenue, strengthening its investment incentives.\nAlthough the competition might harm certain CPs, we find that the main cause\ncomes from high access prices rather than the existence of subsidization. Our\nresults suggest that subsidization competition will increase the\ncompetitiveness and welfare of the Internet content market; however, regulators\nmight need to regulate access prices if the access ISP market is not\ncompetitive enough. We envision that subsidization competition could become a\nviable model for the future Internet.\n", "versions": [{"version": "v1", "created": "Tue, 10 Jun 2014 11:47:40 GMT"}], "update_date": "2014-06-11", "authors_parsed": [["Ma", "Richard T. B.", ""]]}, {"id": "1406.2773", "submitter": "Soshya Joshi", "authors": "S Taruna, Pratibha Singh, Soshya Joshi", "title": "Green Computing In Developed And Developing Countries", "comments": null, "journal-ref": "International Journal in Foundations of Computer Science &\n  Technology (IJFCST), Vol.4, No.3, May 2014", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today e-waste are becoming a major problem for the developing countries.\nE-waste is defined something as a discarded parts of electronic devices which\ncontains most of the times, hazardous chemicals which is deadly for our\nenvironment, example is computer components. Green Computing is the study and\npractice of designing, using, disposing and manufacturing electronic components\nin an eco-friendly manner and Green Computing is one of the solution to tackle\nwith this hazardous e-waste problem which is an emerging concern towards the\nenvironment. The objective of this paper is to draw the attention towards the\nlack of awareness about green computing or we can say how green computing\npolicies is being ignored by developing countries and how developed countries\nare adopting green IT policies seriously. This paper also discusses the\nanalysis which has been done on how the amount of e-waste has been increased in\ndeveloping countries in past years\n", "versions": [{"version": "v1", "created": "Wed, 11 Jun 2014 04:30:43 GMT"}], "update_date": "2014-06-12", "authors_parsed": [["Taruna", "S", ""], ["Singh", "Pratibha", ""], ["Joshi", "Soshya", ""]]}, {"id": "1406.2863", "submitter": "Jose Teixeira", "authors": "Jose Teixeira and Reima Suomi", "title": "A Literature Review on Information Systems Supporting the Physical\n  Wellbeing of Elderly People", "comments": "As presented in the IADIS ICT2012 conference held in Lisbon,\n  Portugal, 21-23 July 2012, Proceedings of the IADIS International Conference\n  ICT, Society and Human Beings 2012, IADIS press, 2012", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/3.0/", "abstract": "  This paper reviews multi-disciplinary research on information systems\nsupporting the physical wellbeing of the elderly population. By taking a\nsystematic approach, it screens journals, conference proceedings and books on\nhow computer-based systems are used for improving both the health and wellbeing\nof the most senior individuals. By using different Internet-databases indexing\nacademic publications and a set of conceptual keywords the authors searched for\nand identified 62 major publications on the topic that were carefully reviewed.\nEach publication item was classified according different category sets and the\naggregated data was then analyzed from different socio-technological\nperspectives. Our findings suggest that research on the topic is very focused\non diseases over health and wellbeing, since most of the studied information\nsystems focused much more on the protective and curative medical procedures\nover other important dimensions such as prevention, education and health\npromotion. An overview on what and where the studied systems are used is\npresented and a new information systems research agenda is proposed.\n", "versions": [{"version": "v1", "created": "Wed, 11 Jun 2014 11:26:04 GMT"}], "update_date": "2014-06-12", "authors_parsed": [["Teixeira", "Jose", ""], ["Suomi", "Reima", ""]]}, {"id": "1406.3110", "submitter": "Lior Rokach", "authors": "Yuval Elovici, Lior Rokach", "title": "Reaction to New Security Threat Class", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Each new identified security threat class triggers new research and\ndevelopment efforts by the scientific and professional communities. In this\nstudy, we investigate the rate at which the scientific and professional\ncommunities react to new identified threat classes as it is reflected in the\nnumber of patents, scientific articles and professional publications over a\nlong period of time. The following threat classes were studied: Phishing; SQL\nInjection; BotNet; Distributed Denial of Service; and Advanced Persistent\nThreat. Our findings suggest that in most cases it takes a year for the\nscientific community and more than two years for industry to react to a new\nthreat class with patents. Since new products follow patents, it is reasonable\nto expect that there will be a window of approximately two to three years in\nwhich no effective product is available to cope with the new threat class.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jun 2014 03:36:38 GMT"}], "update_date": "2014-06-13", "authors_parsed": [["Elovici", "Yuval", ""], ["Rokach", "Lior", ""]]}, {"id": "1406.3121", "submitter": "Saraswati Mishra", "authors": "Saraswati Mishra, Shikha Dhankar and Kavita Choudhary", "title": "Impact of Internet Governance", "comments": "4 pages, 2 figures, Internation Journal of Computer Trends and\n  Technology- IJCTT, Vol 4, Issue 10,October 2013", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper represents the overview of the influence of internet governance in\nall the transactions, trading, business, social services, educational\nactivities, research etc. occurring through the internet. It is very essential\nto implement laws and regulations in the field wherever the transaction takes\nplace, either in the form of money, material or services. To avoid any kind of\nfraud and cheating and to establish a peaceful environment in physical as well\nas virtual word, it is essential to have some organization which assures safety\nand security. Here I-governance is the governing body that tries to take care\nof all those requirements.\n", "versions": [{"version": "v1", "created": "Thu, 12 Jun 2014 05:25:17 GMT"}], "update_date": "2014-06-13", "authors_parsed": [["Mishra", "Saraswati", ""], ["Dhankar", "Shikha", ""], ["Choudhary", "Kavita", ""]]}, {"id": "1406.3550", "submitter": "Saraswati Mishra", "authors": "Saraswati Mishra and Prabhjot Kaur", "title": "Energy efficient neighbor selection for flat wireless sensor networks", "comments": "7 pages, 5 figures, 1 table,WiMON 2014 conference proceedings, may\n  24-25", "journal-ref": null, "doi": "10.5121/csit.2014.4511", "report-no": null, "categories": "cs.NI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we have analyzed energy efficient neighbour selection\nalgorithms for routing in wireless sensor networks. Since energy saving or\nconsumption is an important aspect of wireless sensor networks, its precise\nusage is highly desirable both for the faithful performance of network and to\nincrease the network life time. For this work, we have considered a flat\nnetwork topology where every node has the same responsibility and capability.\nWe have compared two energy efficient algorithms and analyzed their\nperformances with increase in number of nodes, time rounds and node failures.\n", "versions": [{"version": "v1", "created": "Fri, 13 Jun 2014 14:39:43 GMT"}], "update_date": "2014-06-16", "authors_parsed": [["Mishra", "Saraswati", ""], ["Kaur", "Prabhjot", ""]]}, {"id": "1406.3682", "submitter": "Srishti Gupta", "authors": "Srishti Gupta, Ponnurangam Kumaraguru", "title": "Emerging Phishing Trends and Effectiveness of the Anti-Phishing Landing\n  Page", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Each month, more attacks are launched with the aim of making web users\nbelieve that they are communicating with a trusted entity which compels them to\nshare their personal, financial information. Phishing costs Internet users\nbillions of dollars every year. Researchers at Carnegie Mellon University (CMU)\ncreated an anti-phishing landing page supported by Anti-Phishing Working Group\n(APWG) with the aim to train users on how to prevent themselves from phishing\nattacks. It is used by financial institutions, phish site take down vendors,\ngovernment organizations, and online merchants. When a potential victim clicks\non a phishing link that has been taken down, he / she is redirected to the\nlanding page. In this paper, we present the comparative analysis on two\ndatasets that we obtained from APWG's landing page log files; one, from\nSeptember 7, 2008 - November 11, 2009, and other from January 1, 2014 - April\n30, 2014. We found that the landing page has been successful in training users\nagainst phishing. Forty six percent users clicked lesser number of phishing\nURLs from January 2014 to April 2014 which shows that training from the landing\npage helped users not to fall for phishing attacks. Our analysis shows that\nphishers have started to modify their techniques by creating more legitimate\nlooking URLs and buying large number of domains to increase their activity. We\nobserved that phishers are exploiting ICANN accredited registrars to launch\ntheir attacks even after strict surveillance. We saw that phishers are trying\nto exploit free subdomain registration services to carry out attacks. In this\npaper, we also compared the phishing e-mails used by phishers to lure victims\nin 2008 and 2014. We found that the phishing e-mails have changed considerably\nover time. Phishers have adopted new techniques like sending promotional\ne-mails and emotionally targeting users in clicking phishing URLs.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jun 2014 04:19:16 GMT"}], "update_date": "2014-06-17", "authors_parsed": [["Gupta", "Srishti", ""], ["Kumaraguru", "Ponnurangam", ""]]}, {"id": "1406.3692", "submitter": "Prateek Dewan", "authors": "Prateek Dewan and Anand Kashyap and Ponnurangam Kumaraguru", "title": "Analyzing Social and Stylometric Features to Identify Spear phishing\n  Emails", "comments": "Detection of spear phishing using social media features", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.LG cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Spear phishing is a complex targeted attack in which, an attacker harvests\ninformation about the victim prior to the attack. This information is then used\nto create sophisticated, genuine-looking attack vectors, drawing the victim to\ncompromise confidential information. What makes spear phishing different, and\nmore powerful than normal phishing, is this contextual information about the\nvictim. Online social media services can be one such source for gathering vital\ninformation about an individual. In this paper, we characterize and examine a\ntrue positive dataset of spear phishing, spam, and normal phishing emails from\nSymantec's enterprise email scanning service. We then present a model to detect\nspear phishing emails sent to employees of 14 international organizations, by\nusing social features extracted from LinkedIn. Our dataset consists of 4,742\ntargeted attack emails sent to 2,434 victims, and 9,353 non targeted attack\nemails sent to 5,912 non victims; and publicly available information from their\nLinkedIn profiles. We applied various machine learning algorithms to this\nlabeled data, and achieved an overall maximum accuracy of 97.76% in identifying\nspear phishing emails. We used a combination of social features from LinkedIn\nprofiles, and stylometric features extracted from email subjects, bodies, and\nattachments. However, we achieved a slightly better accuracy of 98.28% without\nthe social features. Our analysis revealed that social features extracted from\nLinkedIn do not help in identifying spear phishing emails. To the best of our\nknowledge, this is one of the first attempts to make use of a combination of\nstylometric features extracted from emails, and social features extracted from\nan online social network to detect targeted spear phishing emails.\n", "versions": [{"version": "v1", "created": "Sat, 14 Jun 2014 07:01:03 GMT"}], "update_date": "2014-06-17", "authors_parsed": [["Dewan", "Prateek", ""], ["Kashyap", "Anand", ""], ["Kumaraguru", "Ponnurangam", ""]]}, {"id": "1406.3848", "submitter": "Julie Dugdale", "authors": "Jaziar Radianti, Julie Dugdale (LIG), Jose J. Gonzalez,\n  Ole-Christoffer Granmo", "title": "Smartphone sensing platform for emergency management", "comments": "11th International Conference on Information Systems for Crisis\n  Response and Management ISCRAM2014 (2014)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.MA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasingly sophisticated sensors supported by modern smartphones open\nup novel research opportunities, such as mobile phone sensing. One of the most\nchallenging of these research areas is context-aware and activity recognition.\nThe SmartRescue project takes advantage of smartphone sensing, processing and\ncommunication capabilities to monitor hazards and track people in a disaster.\nThe goal is to help crisis managers and members of the public in early hazard\ndetection, prediction, and in devising risk-minimizing evacuation plans when\ndisaster strikes. In this paper we suggest a novel smartphone-based\ncommunication framework. It uses specific machine learning techniques that\nintelligently process sensor readings into useful information for the crisis\nresponders. Core to the framework is a content-based publish-subscribe\nmechanism that allows flexible sharing of sensor data and computation results.\nWe also evaluate a preliminary implementation of the platform, involving a\nsmartphone app that reads and shares mobile phone sensor data for activity\nrecognition.\n", "versions": [{"version": "v1", "created": "Sun, 15 Jun 2014 19:12:01 GMT"}], "update_date": "2014-06-17", "authors_parsed": [["Radianti", "Jaziar", "", "LIG"], ["Dugdale", "Julie", "", "LIG"], ["Gonzalez", "Jose J.", ""], ["Granmo", "Ole-Christoffer", ""]]}, {"id": "1406.4086", "submitter": "Leon Abdillah", "authors": "Leon Andretti Abdillah", "title": "Social media as political party campaign in Indonesia", "comments": "10 pages", "journal-ref": "Jurnal Ilmiah MATRIK, vol. 16, pp. 1-10, 2014", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social media as a trend in the Internet is now used as a medium for political\ncampaigns. Author explores the advantages and social media implementation of\nany political party in Indonesia legislative elections 2014. Author visited and\nanalyzed social media used by the contestants, such as: Facebook, and Twitter.\nAuthor collected data from social media until the end of April 2014. This\narticle discusses the use of social media by political parties and their\nfeatures. The results of this study indicate that social media are: 1)\neffective tool for current and future political campaigns, 2) reach the voters\nand supporters instantly, 3) used by Political parties to show their logo/icon,\nand 4) last but not least quick count results also show that political parties\nwhich using social media as part of their campaigns won the legislative\nelections.\n", "versions": [{"version": "v1", "created": "Mon, 16 Jun 2014 17:58:18 GMT"}], "update_date": "2014-06-17", "authors_parsed": [["Abdillah", "Leon Andretti", ""]]}, {"id": "1406.4400", "submitter": "Sebastian Grauwin", "authors": "S. Grauwin, S. Sobolevsky, S. Moritz, I. G\\'odor and C. Ratti", "title": "Towards a comparative science of cities: using mobile traffic records in\n  New York, London and Hong Kong", "comments": "24 pages, 9 figures, book chapter to be published in \"Computational\n  Approaches for Urban Environments\" (Springer Ed.), October 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CY cs.SI physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This chapter examines the possibility to analyze and compare human activities\nin an urban environment based on the detection of mobile phone usage patterns.\nThanks to an unprecedented collection of counter data recording the number of\ncalls, SMS, and data transfers resolved both in time and space, we confirm the\nconnection between temporal activity profile and land usage in three global\ncities: New York, London and Hong Kong. By comparing whole cities typical\npatterns, we provide insights on how cultural, technological and economical\nfactors shape human dynamics. At a more local scale, we use clustering analysis\nto identify locations with similar patterns within a city. Our research reveals\na universal structure of cities, with core financial centers all sharing\nsimilar activity patterns and commercial or residential areas with more\ncity-specific patterns. These findings hint that as the economy becomes more\nglobal, common patterns emerge in business areas of different cities across the\nglobe, while the impact of local conditions still remains recognizable on the\nlevel of routine people activity.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2014 15:18:13 GMT"}], "update_date": "2014-06-18", "authors_parsed": [["Grauwin", "S.", ""], ["Sobolevsky", "S.", ""], ["Moritz", "S.", ""], ["Gódor", "I.", ""], ["Ratti", "C.", ""]]}, {"id": "1406.4458", "submitter": "Jiwon Shin", "authors": "Jiwon Shin and Andrey Rusakov and Bertrand Meyer", "title": "Teaching Software Engineering through Robotics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.RO", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a newly-developed robotics programming course and reports\nthe initial results of software engineering education in robotics context.\nRobotics programming, as a multidisciplinary course, puts equal emphasis on\nsoftware engineering and robotics. It teaches students proper software\nengineering -- in particular, modularity and documentation -- by having them\nimplement four core robotics algorithms for an educational robot. To evaluate\nthe effect of software engineering education in robotics context, we analyze\npre- and post-class survey data and the four assignments our students completed\nfor the course. The analysis suggests that the students acquired an\nunderstanding of software engineering techniques and principles.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2014 18:08:43 GMT"}], "update_date": "2014-06-18", "authors_parsed": [["Shin", "Jiwon", ""], ["Rusakov", "Andrey", ""], ["Meyer", "Bertrand", ""]]}, {"id": "1406.4756", "submitter": "Sanjay Chakraborty", "authors": "Sanjay Chakraborty, N.K.Nagwani and Lopamudra Dey", "title": "Weather Forecasting using Incremental K-means Clustering", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Clustering is a powerful tool which has been used in several forecasting\nworks, such as time series forecasting, real time storm detection, flood\nforecasting and so on. In this paper, a generic methodology for weather\nforecasting is proposed by the help of incremental K-means clustering\nalgorithm. Weather forecasting plays an important role in day to day\napplications.Weather forecasting of this paper is done based on the incremental\nair pollution database of west Bengal in the years of 2009 and 2010. This paper\ngenerally uses typical K-means clustering on the main air pollution database\nand a list of weather category will be developed based on the maximum mean\nvalues of the clusters.Now when the new data are coming, the incremental\nK-means is used to group those data into those clusters whose weather category\nhas been already defined. Thus it builds up a strategy to predict the weather\nof the upcoming data of the upcoming days. This forecasting database is totally\nbased on the weather of west Bengal and this forecasting methodology is\ndeveloped to mitigating the impacts of air pollutions and launch focused\nmodeling computations for prediction and forecasts of weather events. Here\naccuracy of this approach is also measured.\n", "versions": [{"version": "v1", "created": "Wed, 18 Jun 2014 15:08:54 GMT"}], "update_date": "2014-06-19", "authors_parsed": [["Chakraborty", "Sanjay", ""], ["Nagwani", "N. K.", ""], ["Dey", "Lopamudra", ""]]}, {"id": "1406.4842", "submitter": "Adeel Akbar Memon", "authors": "A. A. Memon, C. Wang, M. R. Naeem, M. Tahir, M. Aamir", "title": "A New Web Based Student Annual Review Information System (SARIS) With\n  Student Success Prediction", "comments": "4 pages, 7 figures and 2 Tables", "journal-ref": "International Journal of Computer Trends and Technology (IJCTT)\n  V10(5):275-278 Apr 2014", "doi": "10.14445/22312803/IJCTT-V10P149", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we are proposing new web based Student Annual Review\nInformation System (SARIS) and prediction method for the success of scholar\nstudents to China Scholarship Council(CSC). The main objective of developing\nthis system is to save the cost of paper, to reduce the risk of data loss, to\ndecrease the processing time, to reduce the delay in finding for the successful\nstudents. The proposed system and prediction method is intended to be used by\nChina Scholarship Council; however SARIS and prediction method are quite\ngeneric and can be used by other scholarship agencies.\n", "versions": [{"version": "v1", "created": "Fri, 16 May 2014 14:50:53 GMT"}], "update_date": "2014-06-19", "authors_parsed": [["Memon", "A. A.", ""], ["Wang", "C.", ""], ["Naeem", "M. R.", ""], ["Tahir", "M.", ""], ["Aamir", "M.", ""]]}, {"id": "1406.4879", "submitter": "Ovidiu Andrei Schipor OA", "authors": "Ovidiu-Andrei Schipor, Titus-Marian Nestor", "title": "Automat Parsing of Audio Recordings. Testing Children with Dyslalia.\n  Theoretical Background", "comments": "6 pages, 3 figures, in Romanian", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present our researches regarding automat parsing of audio\nrecordings. These recordings are obtained from children with dyslalia and are\nnecessary for an accurate identification of speech problems. We develop the ADM\nalgorithm and we analyze the complexity of this solution. We utilize a digital\nvoice recorder in High Quality mode and with VCVA (Variable Control Voice\nActuator) activated. The record format is IMA-ADPCM, 16KHz and 4bits (16 bits\nPCM). A microphone was placed at 10 cm from mouth in order to minimize\nenvironment noise. A software set of classes (C#) was created for handling\naudio stream (read, conversion between different format, write). We also\npropose an original solution for placing markers in audio stream. These markers\nare needed for a correct parsing af full recoding.\n", "versions": [{"version": "v1", "created": "Thu, 29 May 2014 06:43:34 GMT"}], "update_date": "2014-06-20", "authors_parsed": [["Schipor", "Ovidiu-Andrei", ""], ["Nestor", "Titus-Marian", ""]]}, {"id": "1406.4881", "submitter": "Ovidiu Andrei Schipor OA", "authors": "Ovidiu-Andrei Schipor, Stefan-Gheorghe Pentiuc, Maria-Doina Schipor", "title": "Architecture of a Fuzzy Expert System Used for Dyslalic Children Therapy", "comments": "8 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we present architecture of a fuzzy expert system used for\ntherapy of dyslalic children. With fuzzy approach we can create a better model\nfor speech therapist decisions. A software interface was developed for\nvalidation of the system. The main objectives of this task are: personalized\ntherapy (the therapy must be in according with child's problems level, context\nand possibilities), speech therapist assistant (the expert system offer some\nsuggestion regarding what exercises are better for a specific moment and from a\nspecific child), (self) teaching (when system's conclusion is different that\nspeech therapist's conclusion the last one must have the knowledge base change\npossibility).\n", "versions": [{"version": "v1", "created": "Thu, 29 May 2014 06:54:22 GMT"}], "update_date": "2014-06-20", "authors_parsed": [["Schipor", "Ovidiu-Andrei", ""], ["Pentiuc", "Stefan-Gheorghe", ""], ["Schipor", "Maria-Doina", ""]]}, {"id": "1406.4944", "submitter": "Leon Abdillah", "authors": "Leon Andretti Abdillah", "title": "IT based social media impacts on Indonesian general legislative\n  elections 2014", "comments": "14 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The information technology applications in cyberspace (the internet) are\ncurrently dominated by social media. The author investigates and explores the\nadvantages of social media implementation of any political party in Indonesian\ngeneral legislative elections 2014. There are twelve national political parties\nparticipating in the election as contestants plus three local political parties\nin Aceh. In this research, author focus on national political parties only. The\nauthor visited, analyzed, and learnt the social media used by the contestants.\nThose social media are : 1) Facebook, 2) Twitter, and 3) YouTube. Author also\ncompares the popularity of political parties on social media with the results\nof a real count. Then Author can discuss : 1) the impact of social media on\npolitical parties, 2) social media as a brand of political parties, 3) social\nmedia as political presentation, and 4) social media as virtual society. The\nresults of this study indicate that Facebook is still a social media\napplication that received high attention by the voters on a campaign of\npolitical parties. Indonesian's legislative elections won by parties that are\nusing social media as part of their campaigns.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2014 04:30:29 GMT"}], "update_date": "2015-08-25", "authors_parsed": [["Abdillah", "Leon Andretti", ""]]}, {"id": "1406.4986", "submitter": "Thomas Joseph", "authors": "Thomas Joseph", "title": "Smart city analysis using spatial data and predicting the sustainability", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Smart city [1] planning is crucial as it should balance among resources and\nthe needs of the city .It allows to achieve good eco-friendly industries, there\nby supporting both the nature and the stake holders. Setting up an industry is\na difficult problem, because it should optimize the resources and allocating it\nin an effective manner. Weighted sum approach [2] uses the spatial data for\nfinding appropriate places to set up the industry based on the weight assigned\nto each constraint. The user can predict the possible places in the search\nspace, where the industry can be set with low time complexity using spatial\ndata. Diversity being introduced by using multipoint crossover and mutation\noperations. It will help to bring exploration in the search space, thereby\nbring the diversity factor into the solution space. The prediction approach\nwill help to avoid the human exploitation on nature for resources. This in turn\nhelps the investors to maximize the Return on Investment (ROI).\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2014 09:22:46 GMT"}], "update_date": "2014-06-20", "authors_parsed": [["Joseph", "Thomas", ""]]}, {"id": "1406.5020", "submitter": "Rasha Alcattan", "authors": "Rasha Fouad AlCattan", "title": "Integration of Cloud Computing and Web2.0 Collaboration Technologies in\n  E-Learning", "comments": "10 pages, 5 figures, Published with International Journal of Computer\n  Trends and Technology (IJCTT)", "journal-ref": "International Journal of Computer Trends and Technology (IJCTT)\n  V12(1):46-55, June 2014", "doi": null, "report-no": null, "categories": "cs.CY cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cloud computing technology is an emerging new computing paradigm for\ndelivering computing services. Although it still in its early stage, it has\nchanged the way how many applications are developed and accessed. This\ncomputing approach relies on a number of existing technologies, such as Web2.0,\nvirtualization, Service oriented architecture SOA, Web services,etc.Cloud\ncomputing is growing rapidly and becoming an adoptable technology for the\norganizations especially education institutes, with its dynamic scalability and\nusage of virtualized resources as a service through the Internet.Today,\neLearning is also becoming a very popular and powerful trend.However,in\ntraditional web based eLearning systems,building and maintenance are located\nonsite in institutions or enterprises, which cause lot of problems to appear\nsuch as lacking the support of underlying infrastructure, which can dynamically\nallocate the needed calculation and storage resources for eLearning systems.As\nthe need for e learning is increasing continuously and its necessary for\neLearning systems to keep pace with the right technology needed for development\nand improvement.However, todays technologies such as Web 2.0, Cloud, etc.enable\nto build more successful and effective educational environment,that provide\ncollaboration and interaction in eLearning environments.The challenge is to use\nand integrate these technologies in order to construct tools that allow the\nbest possible learning results.Cloud computing and Web 2.0 are two areas that\nare starting to strongly effect how the development,deployment and usage of\neLearning application.This paper presents the benefits of using cloud computing\nwith the integration of Web 2.0 collaboration technologies in eLearning\nenvironment.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2014 12:24:30 GMT"}], "update_date": "2014-06-20", "authors_parsed": [["AlCattan", "Rasha Fouad", ""]]}, {"id": "1406.5052", "submitter": "Uldis Boj\\=ars", "authors": "Uldis Boj\\=ars and Ren\\=ars Liepi\\c{n}\\v{s}", "title": "The State of Open Data in Latvia: 2014", "comments": "keywords: Open Data, Open Government Data, PSI, Latvia", "journal-ref": "Baltic J. Modern Computing, Vol. 2 (2014), No. 3, 160-170", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper examines the state of Open Data in Latvia at the middle of 2014.\nThe study is divided into two parts: (i) a survey of open data situation and\n(ii) an overview of available open data sets. The first part examines the\ngeneral open data climate in Latvia according to the guidelines of the OKFN\nOpen Data Index making the results comparable to those of other participants of\nthis index. The second part examines datasets made available on the Latvia Open\nData community catalogue, the only open data catalogue available in Latvia at\nthe moment. We conclude that Latvia public sector open data mostly fulfil the\nbasic criteria (e.g., data is available) of the Open Data Index but fail on\nmore advanced criteria: the majority of data considered in the study are not\npublished in machine-readable form, are not available for bulk download and\nnone of the data sources have open license statements.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2014 14:08:03 GMT"}, {"version": "v2", "created": "Wed, 24 Sep 2014 10:52:45 GMT"}], "update_date": "2014-09-25", "authors_parsed": [["Bojārs", "Uldis", ""], ["Liepiņš", "Renārs", ""]]}, {"id": "1406.5073", "submitter": "Sadi Seker E", "authors": "Sadi Evren Seker, Bilal Cankir, and Mehmet Lutfi Arslan", "title": "Information and Communication Technology Reputation for XU030 Quote\n  Companies", "comments": "5 pages 2 figure 1 table 21 refs. arXiv admin note: text overlap with\n  arXiv:1401.7547", "journal-ref": "International Journal of Innovation, Management and Technology,\n  Vol. 5, No. 3, June 2014 ISSN: 2010-0248", "doi": "10.7763/IJIMT.2014.V5.517", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  By the increasing spread of information technology and Internet improvements,\nmost of the large-scale companies are paying special attention to their\nreputation on many types of the information and communication technology. The\nincreasing developments and penetration of new technologies into daily life,\nbrings out paradigm shift on the perception of reputation and creates new\nconcepts like esocieties, techno-culture and new media. Contemporary companies\nare trying to control their reputation over the new communities who are mostly\ninteracting with social networks, web pages and electronic communication\ntechnologies. In this study, the reputation of top 30 Turkish companies, quoted\nto the Istanbul Stock Market, is studied, based on the information technology\ninterfaces between company and society, such as social networks, blogs, wikis\nand web pages. The web reputation is gathered through 17 different parameters,\ncollected from Google, Facebook, Twitter, Bing, Alexa, etc. The reputation\nindex is calculated by z-index and fscoring formulations after the min-max\nnormalization of each web reputation parameter.\n", "versions": [{"version": "v1", "created": "Tue, 17 Jun 2014 03:27:39 GMT"}], "update_date": "2014-06-20", "authors_parsed": [["Seker", "Sadi Evren", ""], ["Cankir", "Bilal", ""], ["Arslan", "Mehmet Lutfi", ""]]}, {"id": "1406.5151", "submitter": "Martha Rosa  Cordero L\\'opez", "authors": "Martha Rosa Cordero Lopez and Marco Antonio Dorantes Gonzalez", "title": "Tollan-Xicocotitlan: A reconstructed City by augmented reality", "comments": "15 pages, 12 figures, Fourth International Conference on Advances in\n  Computing and Information technology (ACITY 2014)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This project presents the analysis, design, implementation and results of\nReconstruction Xicocotitlan Tollan-through augmented reality, which will\nrelease information about the Toltec culture supplemented by presenting an\noverview of the main premises of the Xicocotitlan Tollan city supported\ndimensional models based on the augmented reality technique showing the user a\nvirtual representation of buildings in Tollan.\n", "versions": [{"version": "v1", "created": "Thu, 19 Jun 2014 18:57:03 GMT"}], "update_date": "2014-06-20", "authors_parsed": [["Lopez", "Martha Rosa Cordero", ""], ["Gonzalez", "Marco Antonio Dorantes", ""]]}, {"id": "1406.5323", "submitter": "Vinko Zlati\\'c", "authors": "Marko Popovi\\'c, Hrvoje \\v{S}tefan\\v{c}i\\'c, Borut Sluban, Petra Kralj\n  Novak, Miha Gr\\v{c}ar, Igor Mozeti\\v{c}, Michelangelo Puliga, Vinko Zlati\\'c", "title": "Extraction of Temporal Networks from Term Co-occurrences in Online\n  Textual Sources", "comments": "27 pages, 12 figures", "journal-ref": "PLoS ONE 9(12): e99515 (2014)", "doi": "10.1371/journal.pone.0099515", "report-no": null, "categories": "physics.soc-ph cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A stream of unstructured news can be a valuable source of hidden relations\nbetween different entities, such as financial institutions, countries, or\npersons. We present an approach to continuously collect online news, recognize\nrelevant entities in them, and extract time-varying networks. The nodes of the\nnetwork are the entities, and the links are their co-occurrences. We present a\nmethod to estimate the significance of co-occurrences, and a benchmark model\nagainst which their robustness is evaluated. The approach is applied to a large\nset of financial news, collected over a period of two years. The entities we\nconsider are 50 countries which issue sovereign bonds, and which are insured by\nCredit Default Swaps (CDS) in turn. We compare the country co-occurrence\nnetworks to the CDS networks constructed from the correlations between the CDS.\nThe results show relatively small, but significant overlap between the networks\nextracted from the news and those from the CDS correlations.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2014 09:07:01 GMT"}], "update_date": "2015-09-30", "authors_parsed": [["Popović", "Marko", ""], ["Štefančić", "Hrvoje", ""], ["Sluban", "Borut", ""], ["Novak", "Petra Kralj", ""], ["Grčar", "Miha", ""], ["Mozetič", "Igor", ""], ["Puliga", "Michelangelo", ""], ["Zlatić", "Vinko", ""]]}, {"id": "1406.5440", "submitter": "Johan Pouwelse", "authors": "Dinesh, Erlich, Gilfoyle, Jared, Richard, Johan Pouwelse", "title": "Operational Distributed Regulation for Bitcoin", "comments": "9 pages report by students who desire to remain anonymous", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY cs.DC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  On February 2014, $650.000.000 worth of Bitcoins disappeared. Currently it is\nunclear whether hackers or MtGox, the largest Bitcoin exchange, are to be\nblamed. In either case, the anonymous and unregulated nature of the Bitcoin\nsystem makes it practically impossible for innocent victims to get their money\nback. We have investigated the technical possibilities, solutions and\nimplications of introducing a regulatory framework based on redlisting Bitcoin\naccounts. Despite numerous proposals, the Bitcoin community has voiced a strong\nopinion against any form of regulation. However, most of the discussions were\nbased on speculations rather than facts. We strive to contribute a scientific\nfoundation to these discussions and illuminate the path to crypto-justice.\n", "versions": [{"version": "v1", "created": "Fri, 20 Jun 2014 16:06:46 GMT"}], "update_date": "2014-06-23", "authors_parsed": [["Dinesh", "", ""], ["Erlich", "", ""], ["Gilfoyle", "", ""], ["Jared", "", ""], ["Richard", "", ""], ["Pouwelse", "Johan", ""]]}, {"id": "1406.5688", "submitter": "Loet Leydesdorff", "authors": "Loet Leydesdorff", "title": "Information, Meaning, and Intellectual Organization in Networks of\n  Inter-Human Communication", "comments": "Pp. 280-303 in: Cassidy R. Sugimoto (Ed.), Theories of Informetrics\n  and Scholarly Communication, Berlin/Boston MA: De Gruyter, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DL cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Shannon-Weaver model of linear information transmission is extended with\ntwo loops potentially generating redundancies: (i) meaning is provided locally\nto the information from the perspective of hindsight, and (ii) meanings can be\ncodified differently and then refer to other horizons of meaning. Thus, three\nlayers are distinguished: variations in the communications, historical\norganization at each moment of time, and evolutionary self-organization of the\ncodes of communication over time. Furthermore, the codes of communication can\nfunctionally be different and then the system is both horizontally and\nvertically differentiated. All these subdynamics operate in parallel and\nnecessarily generate uncertainty. However, meaningful information can be\nconsidered as the specific selection of a signal from the noise; the codes of\ncommunication are social constructs that can generate redundancy by giving\ndifferent meanings to the same information. Reflexively, one can translate\namong codes in more elaborate discourses. The second (instantiating) layer can\nbe operationalized in terms of semantic maps using the vector space model; the\nthird in terms of mutual redundancy among the latent dimensions of the vector\nspace. Using Blaise Cronin's {\\oe}uvre, the different operations of the three\nlayers are demonstrated empirically.\n", "versions": [{"version": "v1", "created": "Sun, 22 Jun 2014 09:18:18 GMT"}, {"version": "v2", "created": "Sat, 13 Aug 2016 11:54:59 GMT"}, {"version": "v3", "created": "Sat, 20 Oct 2018 11:11:00 GMT"}], "update_date": "2018-10-23", "authors_parsed": [["Leydesdorff", "Loet", ""]]}, {"id": "1406.5946", "submitter": "Jan Broekaert", "authors": "Lorena P\\'erez-Garc\\'ia, Jan Broekaert and Nicole Note", "title": "Is a `Wirikuta empowerment' of the Huichol measurable on the Internet?", "comments": "14 pages, 1 figure, 4 graphs (submitted to journal)", "journal-ref": "Internet Research, 26, 5, 1269 - 1290 (2016)", "doi": "10.1108/IntR-07-2014-0185", "report-no": null, "categories": "cs.SI cs.CY cs.IR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Current social and activist movements find the opportunity in social media to\neffectively impact on the agenda of governing bodies and create `global'\nperceptions -- it is often claimed. Content related to the social and activist\nmovements is online, to be accessed, supported or disputed and distributed from\nvirtually anywhere at any time, in the public sphere of the Internet. This\nactivity allows the enlargement of social movements and would increase the\nempowerment in the concerned communities. The aim of this explorative study is\nto assess whether the temporal evolution of the Normalised Web Distance (NWD)\n--as defined by Cilibrasi & Vit\\'anyi (2007)-- between identifying terms\nconcerning this activism could be used to measure the progress or decline of\nsocial empowerment through the Internet. The NWD relies on the page count\nnumber of single and joint queries, which in our study have been registered\nusing a freely available web browser (e.g. Google Search) providing a time\nsearch window for temporal query results. To explore this meta-data technique,\nwe introduce the case of a perceived Wirikuta online movement, which originated\nin Mexico with the aim to protect the Huichols' sacred land and water resources\nfrom open mining projects for silver ore. We conducted a small scale Internet\nstudy relating the key terms `Wirikuta', `Huichol', and `Wixarika' and their\nco-occurrence with seven positive qualifiers (e.g. `sacred land'), five\nnegative qualifiers (e.g. `violence') and one neutral qualifier (`table') over\ntime, annually from 1994 till 2013. We confirm close semantic clustering over\ntime of traditional indigeneous identity terms of the Huichol, and observe a\nslight convergence of key terms to `mines' and less pronounced to `sacred land'\nand a divergence with respect to `ancestors' indicating a complex image of a\ntendency of empowerment.\n", "versions": [{"version": "v1", "created": "Mon, 23 Jun 2014 15:32:14 GMT"}], "update_date": "2016-12-07", "authors_parsed": [["Pérez-García", "Lorena", ""], ["Broekaert", "Jan", ""], ["Note", "Nicole", ""]]}, {"id": "1406.6173", "submitter": "Kirti Dhansukhbhai matliwala", "authors": "Kirti Matliwala (Education department, VNSGU, Surat)", "title": "Use of computer by secondary school students", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper reports on the outcomes of a survey implemented in secondary\nschools. The survey identified the types of access and use of computers by\nstudents. It was found that the students had significant access to computers\nbut they were not skilled in many features of computer use. Computers were used\nfor a range of activities, some educational and others recreational by some\nstudents. Gender differences in computer use were not seen. The study\nhighlights the changing scenario about uses of computer technology by students.\n", "versions": [{"version": "v1", "created": "Tue, 24 Jun 2014 09:09:50 GMT"}], "update_date": "2014-06-25", "authors_parsed": [["Matliwala", "Kirti", "", "Education department, VNSGU, Surat"]]}, {"id": "1406.6829", "submitter": "Chlo\\\"e Brown", "authors": "Chlo\\\"e Brown, Christos Efstratiou, Ilias Leontiadis, Daniele Quercia,\n  Cecilia Mascolo, James Scott, Peter Key", "title": "The architecture of innovation: Tracking face-to-face interactions with\n  ubicomp technologies", "comments": "14 pages, 9 figures. To appear in ACM International Joint Conference\n  on Pervasive and Ubiquitous Computing (Ubicomp 2014)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.HC cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The layouts of the buildings we live in shape our everyday lives. In office\nenvironments, building spaces affect employees' communication, which is crucial\nfor productivity and innovation. However, accurate measurement of how spatial\nlayouts affect interactions is a major challenge and traditional techniques may\nnot give an objective view.We measure the impact of building spaces on social\ninteractions using wearable sensing devices. We study a single organization\nthat moved between two different buildings, affording a unique opportunity to\nexamine how space alone can affect interactions. The analysis is based on two\nlarge scale deployments of wireless sensing technologies: short-range,\nlightweight RFID tags capable of detecting face-to-face interactions. We\nanalyze the traces to study the impact of the building change on social\nbehavior, which represents a first example of using ubiquitous sensing\ntechnology to study how the physical design of two workplaces combines with\norganizational structure to shape contact patterns.\n", "versions": [{"version": "v1", "created": "Thu, 26 Jun 2014 10:17:32 GMT"}], "update_date": "2014-06-27", "authors_parsed": [["Brown", "Chloë", ""], ["Efstratiou", "Christos", ""], ["Leontiadis", "Ilias", ""], ["Quercia", "Daniele", ""], ["Mascolo", "Cecilia", ""], ["Scott", "James", ""], ["Key", "Peter", ""]]}, {"id": "1406.7048", "submitter": "Victor Goh", "authors": "Ong Sing Goh", "title": "Global Internet-based Crisis Communication: A case Study on SARS", "comments": "International Journal of Intelligent Information Technologies,\n  Inaugural Issue: January 2005, Idea Group Publishing, ISSN: 1548-3657, USA", "journal-ref": null, "doi": null, "report-no": "TJ211.G64 2004", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Crisis Communication is an effective communication mechanism in the world.\nThe outbreak of the SARS disease and the way information on it was disseminated\nhas illustrated the importance of effective and efficient crisis communication\nmanagement. Consequently, we would like to highlight the viability of\nincorporating an intelligent agent software robot into a crisis communication\nportal (CCNet) to send the alert news to subscribed users via email and others\nmobile services such as SMS, MMS and GPRS.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2014 00:38:35 GMT"}], "update_date": "2014-11-06", "authors_parsed": [["Goh", "Ong Sing", ""]]}, {"id": "1406.7168", "submitter": "Amelia Carolina Sparavigna", "authors": "Amelia Carolina Sparavigna", "title": "Co-occurrence matrices of time series applied to literary works", "comments": "Literary experiments, Time series, Co-occurrence plots, Harry Potter", "journal-ref": "ijSciences, 2014, Volume 3, Issue 7, Pages: 12-18", "doi": "10.18483/ijSci.533", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recently, it has been proposed to analyse the literary works, plays or\nnovels, using graphs to display the social network of their interacting\ncharacters. In this approach, the timeline of the literary work is lost,\nbecause the storyline is projected on a planar graph. However, timelines can be\nused to build some time series and analyse the work by means of vectors and\nmatrices. These series can be used to describe the presence and relevance, not\nonly of words in the text, but also of persons and places portrayed in the\ndrama or novel. In this framework, we discuss here an approach with\nco-occurrence matrices plotted over time, concerning the presence of characters\nin the pages of a novel. These matrices are similar to those appearing in\nrecurrence plots.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2014 12:37:46 GMT"}], "update_date": "2015-08-06", "authors_parsed": [["Sparavigna", "Amelia Carolina", ""]]}, {"id": "1406.7197", "submitter": "Emilio Ferrara", "authors": "Onur Varol, Emilio Ferrara, Christine L. Ogan, Filippo Menczer,\n  Alessandro Flammini", "title": "Evolution of Online User Behavior During a Social Upheaval", "comments": "Best Paper Award at ACM Web Science 2014", "journal-ref": "Proceedings of the 2014 ACM conference on Web science, Pages 81-90", "doi": "10.1145/2615569.2615699", "report-no": null, "categories": "cs.SI cs.CY physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social media represent powerful tools of mass communication and information\ndiffusion. They played a pivotal role during recent social uprisings and\npolitical mobilizations across the world. Here we present a study of the Gezi\nPark movement in Turkey through the lens of Twitter. We analyze over 2.3\nmillion tweets produced during the 25 days of protest occurred between May and\nJune 2013. We first characterize the spatio-temporal nature of the conversation\nabout the Gezi Park demonstrations, showing that similarity in trends of\ndiscussion mirrors geographic cues. We then describe the characteristics of the\nusers involved in this conversation and what roles they played. We study how\nroles and individual influence evolved during the period of the upheaval. This\nanalysis reveals that the conversation becomes more democratic as events\nunfold, with a redistribution of influence over time in the user population. We\nconclude by observing how the online and offline worlds are tightly\nintertwined, showing that exogenous events, such as political speeches or\npolice actions, affect social media conversations and trigger changes in\nindividual behavior.\n", "versions": [{"version": "v1", "created": "Fri, 27 Jun 2014 14:39:53 GMT"}], "update_date": "2014-06-30", "authors_parsed": [["Varol", "Onur", ""], ["Ferrara", "Emilio", ""], ["Ogan", "Christine L.", ""], ["Menczer", "Filippo", ""], ["Flammini", "Alessandro", ""]]}, {"id": "1406.7437", "submitter": "Shuaibu Hassan Usman Mr", "authors": "Shuaibu Hassan Usman (Abubakar Tafawa Balewa University) and Ishaq\n  Oyebisi Oyefolahan (International Islamic University Malaysia)", "title": "Encouraging Knowledge Sharing Using Web 2.0 Technologies In Higher\n  Education: A Survey", "comments": "The article has 10 pages and 2 tables, International Journal of\n  Managing Information Technology (IJMIT), Vol.6, No.2, May 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  As the technology continuous to advance new technologies have emerged with\nthe capability to revolutionize knowledge sharing practices. Web 2.0\nexemplifies such new technologies which provides dynamic way of interactions of\npeople and businesses. In learning environment Web 2.0 technologies support and\nenhance teaching and learning of students. Therefore the main aim of this study\nfocuses on the determining the ways to encourage knowledge sharing through web\n2.0 technologies from students' point of views. A total of 287 students\nresponded to the online questionnaire in International Islamic University\nMalaysia. Descriptive statistics was used in data analysis. The results show\nthat students used web 2.0 technologies in learning and sharing knowledge among\nthem. In addition the study found eight items on ways to encourage and enhance\nknowledge sharing among students in the University. These items include Create\nAwareness Provide facilities Internet Accessibility Ease of use Encourage\nTeamwork Materials Availability Improved Responses and Motivation.\n", "versions": [{"version": "v1", "created": "Sat, 28 Jun 2014 20:10:44 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Usman", "Shuaibu Hassan", "", "Abubakar Tafawa Balewa University"], ["Oyefolahan", "Ishaq Oyebisi", "", "International Islamic University Malaysia"]]}, {"id": "1406.7438", "submitter": "Engin Bozdag", "authors": "Engin Bozdag, Qi Gao, Geert-Jan Houben, Martijn Warnier", "title": "Does Offline Political Segregation Affect the Filter Bubble? An\n  Empirical Analysis of Information Diversity for Dutch and Turkish Twitter\n  Users", "comments": "Computers in Human Behavior, 2014", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  From a liberal perspective, pluralism and viewpoint diversity are seen as a\nnecessary condition for a well-functioning democracy. Recently, there have been\nclaims that viewpoint diversity is diminishing in online social networks,\nputting users in a \"bubble\", where they receive political information which\nthey agree with. The contributions from our investigations are fivefold: (1) we\nintroduce different dimensions of the highly complex value viewpoint diversity\nusing political theory; (2) we provide an overview of the metrics used in the\nliterature of viewpoint diversity analysis; (3) we operationalize new metrics\nusing the theory and provide a framework to analyze viewpoint diversity in\nTwitter for different political cultures; (4) we share our results for a case\nstudy on minorities we performed for Turkish and Dutch Twitter users; (5) we\nshow that minority users cannot reach a large percentage of Turkish Twitter\nusers. With the last of these contributions, using theory from communication\nscholars and philosophers, we show how minority access is missing from the\ntypical dimensions of viewpoint diversity studied by computer scientists and\nthe impact it has on viewpoint diversity analysis.\n", "versions": [{"version": "v1", "created": "Sat, 28 Jun 2014 20:23:26 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Bozdag", "Engin", ""], ["Gao", "Qi", ""], ["Houben", "Geert-Jan", ""], ["Warnier", "Martijn", ""]]}, {"id": "1406.7515", "submitter": "Nurassyl Kerimbayev", "authors": "Nurassyl Kerimbayev, Aliya Akramova, Nurgul Azieva", "title": "Evaluation of educational activities ungraded school teachers:\n  development resources to improve the quality of teaching in a rural school", "comments": "the structure of the article is wrong", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The focus of this article are issues related to the assessment of the\nteacher, working in small schools. The author analyzes the educational\nactivities ungraded school teacher, as one of the factors increasing the\nquality of teaching in a rural school. We have tried to consider other\nresources to successfully solve the problem of increasing the quality of\neducation in rural schools. Teacher in a rural school is a key figure in the\ntraining, development and education of children. From his profession,\nqualification, ability to work with a small but different age student\npopulation is entirely dependent and learning outcomes of students. Therefore,\nthe educational activities of teachers of small schools should be analyzed and\nmonitored not only for assessing his work, but with the aim to provide all\npossible assistance in the specific conditions of ungraded schools.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jun 2014 15:34:37 GMT"}, {"version": "v2", "created": "Wed, 30 Nov 2016 01:58:42 GMT"}], "update_date": "2016-12-01", "authors_parsed": [["Kerimbayev", "Nurassyl", ""], ["Akramova", "Aliya", ""], ["Azieva", "Nurgul", ""]]}, {"id": "1406.7541", "submitter": "Walter S. Lasecki", "authors": "Sheen Levine, Michael Prietula", "title": "Open Collaboration for Innovation: Principles and Performance", "comments": null, "journal-ref": null, "doi": null, "report-no": "ci-2014/13", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The principles of open collaboration for innovation (and production), once\ndistinctive to open source software, are now found in many other ventures. Some\nof these ventures are internet-based: Wikipedia, online forums and communities.\nOthers are off-line: in medicine, science, and everyday life. Such ventures\nhave been affecting traditional firms, and may represent a new organizational\nform. Despite the impact of such ventures, questions remain about their\noperating principles and performance. Here we define open collaboration (OC),\nthe underlying set of principles, and propose that it is a robust engine for\ninnovation and production. First, we review multiple OC ventures and identify\nfour defining principles. In all instances, participants create goods and\nservices of economic value, they exchange and reuse each other's work, they\nlabor purposefully with just loose coordination, and they permit anyone to\ncontribute and consume. These principles distinguish OC from other\norganizational forms, such as firms or cooperatives. Next, we turn to\nperformance. To understand the performance of OC, we develop a computational\nmodel, combining innovation theory with recent evidence on human cooperation.\nWe identify and investigate three elements that affect performance: the\ncooperativeness of participants, the diversity of their needs, and the degree\nto which the goods are rival (subtractable). Through computational experiments,\nwe find that OC performs well even in seemingly harsh environments: when\ncooperators are a minority, free riders are present, diversity is lacking, or\ngoods are rival. We conclude that OC is viable and likely to expand into new\ndomains. The findings also inform the discussion on new organizational forms,\ncollaborative and communal.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jun 2014 19:31:57 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Levine", "Sheen", ""], ["Prietula", "Michael", ""]]}, {"id": "1406.7542", "submitter": "Walter S. Lasecki", "authors": "David Lee, Ashish Goel, Tanja Aitamurto, Helene Landemore", "title": "Crowdsourcing for Participatory Democracies: Efficient Elicitation of\n  Social Choice Functions", "comments": null, "journal-ref": null, "doi": null, "report-no": "ci-2014/14", "categories": "cs.MA cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present theoretical and empirical results demonstrating the usefulness of\nvoting rules for participatory democracies. We first give algorithms which\nefficiently elicit \\epsilon-approximations to two prominent voting rules: the\nBorda rule and the Condorcet winner. This result circumvents previous\nprohibitive lower bounds and is surprisingly strong: even if the number of\nideas is as large as the number of participants, each participant will only\nhave to make a logarithmic number of comparisons, an exponential improvement\nover the linear number of comparisons previously needed. We demonstrate the\napproach in an experiment in Finland's recent off-road traffic law reform,\nobserving that the total number of comparisons needed to achieve a fixed\n\\epsilon approximation is linear in the number of ideas and that the constant\nis not large.\n  Finally, we note a few other experimental observations which support the use\nof voting rules for aggregation. First, we observe that rating, one of the\ncommon alternatives to ranking, manifested effects of bias in our data. Second,\nwe show that very few of the topics lacked a Condorcet winner, one of the\nprominent negative results in voting. Finally, we show data hinting at a\npotential future direction: the use of partial rankings as opposed to pairwise\ncomparisons to further decrease the elicitation time.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jun 2014 19:34:44 GMT"}, {"version": "v2", "created": "Wed, 16 Jul 2014 05:20:59 GMT"}], "update_date": "2014-07-17", "authors_parsed": [["Lee", "David", ""], ["Goel", "Ashish", ""], ["Aitamurto", "Tanja", ""], ["Landemore", "Helene", ""]]}, {"id": "1406.7549", "submitter": "Walter S. Lasecki", "authors": "Aelita Skarzauskiene, Birute Pitrenaite-Zileniene, Edgaras Leichteris,\n  Zaneta Paunksniene, Monika Maciuliene", "title": "Social Technologies for Developing Collective Intelligence in Networked\n  Society", "comments": null, "journal-ref": null, "doi": null, "report-no": "ci-2014/25", "categories": "cs.SI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The scientific problem in our project is defined as a question: how social\ntechnologies could contribute to the development of smart and inclusive\nsociety? The subject of our research are networked projects (virtual CI\nsystems) which include collective decision making tools and innovation\nmechanisms allowing and encouraging individual and team creativity,\nentrepreneurship, online collaboration, new forms of self-regulation and\nself-governance, self-configuration of communities by considering these\nprojects as being catalyst for emergence of CI. The answers to these\ntheoretical questions could have huge practical implications by influencing\nmore reasonable and sophisticated application of social technologies in\npractice.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jun 2014 19:57:51 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Skarzauskiene", "Aelita", ""], ["Pitrenaite-Zileniene", "Birute", ""], ["Leichteris", "Edgaras", ""], ["Paunksniene", "Zaneta", ""], ["Maciuliene", "Monika", ""]]}, {"id": "1406.7550", "submitter": "Walter S. Lasecki", "authors": "Jason Radford", "title": "Architectures of Virtual Decision-Making: The Emergence of Gender\n  Discrimination on a Crowdfunding Website", "comments": null, "journal-ref": null, "doi": null, "report-no": "ci-2014/26", "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The increasing relevance of Internet-based markets requires a sustained\ninvestigation into the relationship between design and user behavior. This\nresearch begins within the sociology of quantification and markets to\ninvestigate the impacts of basic design decisions on user behavior and\nindividual success on a widely used crowdfunding website. This study looks at\none common design feature, publishing recipients' sex, on the probability of\nreceiving funding. Following research in the sociology of gender, these effects\nare defined along individual, behavioral, and structural dimensions. The\nresults reveal that before teachers' sex was published, gender discrimination\nwas weak and inconsistent. However, afterward gender discrimination increases\nby an order of magnitude and becomes systematized. Contrary to expectation,\ndonors did not discriminate by sex category, but by teachers' structural\nposition and the kinds of language they used. Implications for research on\ngender discrimination, priming, and online behavior are discussed.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jun 2014 19:59:47 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Radford", "Jason", ""]]}, {"id": "1406.7551", "submitter": "Walter S. Lasecki", "authors": "Ramine Tinati, Elena Simperl, Markus Luczak-Roesch, Max Van Kleek,\n  Nigel Shadbolt", "title": "Collective Intelligence in Citizen Science -- A Study of Performers and\n  Talkers", "comments": null, "journal-ref": null, "doi": null, "report-no": "ci-2014/28", "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The recent emergence of online citizen science is illustrative of an\nefficient and effective means to harness the crowd in order to achieve a range\nof scientific discoveries. Fundamentally, citizen science projects draw upon\ncrowds of non-expert volunteers to complete short Tasks, which can vary in\ndomain and complexity. However, unlike most human-computational systems,\nparticipants in these systems, the `citizen scientists' are volunteers, whereby\nno incentives, financial or otherwise, are offered. Furthermore, encouraged by\ncitizen science platforms such as Zooniverse, online communities have emerged,\nproviding them with an environment to discuss, share ideas, and solve problems.\nIn fact, it is the result of these forums that has enabled a number of\nscientific discoveries to be made. In this paper we explore the phenomenon of\ncollective intelligence via the relationship between the activities of online\ncitizen science communities and the discovery of scientific knowledge. We\nperform a cross-project analysis of ten Zooniverse citizen science projects and\nanalyse the behaviour of users with regards to their Task completion activity\nand participation in discussion and discover collective behaviour amongst\nhighly active users. Whilst our findings have implications for future citizen\nscience design, we also consider the wider implications for understanding\ncollective intelligence research in general.\n", "versions": [{"version": "v1", "created": "Sun, 29 Jun 2014 20:02:18 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Tinati", "Ramine", ""], ["Simperl", "Elena", ""], ["Luczak-Roesch", "Markus", ""], ["Van Kleek", "Max", ""], ["Shadbolt", "Nigel", ""]]}, {"id": "1406.7579", "submitter": "Walter Lasecki", "authors": "Ian Miller, and Gerald Cupchik", "title": "Meme creation and sharing processes: individuals shaping the masses", "comments": null, "journal-ref": null, "doi": null, "report-no": "ci-2014/139", "categories": "cs.SI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The propagation of online memes is initially influenced by meme creators and\nsecondarily by meme consumers, whose individual sharing decisions accumulate to\ndetermine total meme propagation. We characterize this as a sender/receiver\nsequence in which the first sender is also the creator. This sequence consists\nof two distinct processes, the creation process and the sharing process. We\ninvestigated these processes separately to determine their individual influence\non sharing outcomes. Our study observed participants creating memes in the lab.\nWe then tracked the sharing of those memes, derived a model of sharing\nbehavior, and implemented our sharing model in a contagion simulation.\n  Although we assume meme consumers typically have little or no information\nabout a meme's creator when making a decision about whether to share a meme\n(and vice versa), we nevertheless ask whether consumer re-sharing behavior can\nbe predicted based on features of the creator. Using human participants, web\nlog monitoring, and statistical model fitting, the resulting Creator Model of\nRe-sharing Behavior predicts 11.5% of the variance in the behavior of\nconsumers. Even when we know nothing about re-sharers of a meme, we can predict\nsomething about their behavior by observing the creation process.\n  To investigate the individual re-sharing decisions that, together, constitute\na meme's total consumer response, we built a statistical model from human\nobservation. Receivers make their decision to share as a function of the meme's\ncontent and their reaction to it, which we model as a consumer's decision to\nshare. The resulting Consumer Model of Sharing Decisions describes 37.5% of the\nvariance in this decision making process.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2014 02:25:33 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Miller", "Ian", ""], ["Cupchik", "Gerald", ""]]}, {"id": "1406.7588", "submitter": "Walter Lasecki", "authors": "Matthew Staffelbach, Peter Sempolinski, David Hachen, Ahsan Kareem,\n  Tracy Kijewski-Correa, Douglas Thain, Daniel Wei, and Greg Madey", "title": "Lessons Learned from an Experiment in Crowdsourcing Complex Citizen\n  Engineering Tasks with Amazon Mechanical Turk", "comments": null, "journal-ref": null, "doi": null, "report-no": "ci-2014/118", "categories": "cs.SI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the feasibility of obtaining highly trustworthy results using\ncrowdsourcing on complex engineering tasks. Crowdsourcing is increasingly seen\nas a potentially powerful way of increasing the supply of labor for solving\nsociety's problems. While applications in domains such as citizen-science,\ncitizen-journalism or knowledge organization (e.g., Wikipedia) have seen many\nsuccessful applications, there have been fewer applications focused on solving\nengineering problems, especially those involving complex tasks. This may be in\npart because of concerns that low quality input into engineering analysis and\ndesign could result in failed structures leading to loss of life. We compared\nthe quality of work of the anonymous workers of Amazon Mechanical Turk (AMT),\nan online crowdsourcing service, with the quality of work of expert engineers\nin solving the complex engineering task of evaluating virtual wind tunnel data\ngraphs. On this representative complex engineering task, our results showed\nthat there was little difference between expert engineers and crowdworkers in\nthe quality of their work and explained reasons for these results. Along with\nshowing that crowdworkers are effective at completing new complex tasks our\npaper supplies a number of important lessons that were learned in the process\nof collecting this data from AMT, which may be of value to other researchers.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2014 02:56:30 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Staffelbach", "Matthew", ""], ["Sempolinski", "Peter", ""], ["Hachen", "David", ""], ["Kareem", "Ahsan", ""], ["Kijewski-Correa", "Tracy", ""], ["Thain", "Douglas", ""], ["Wei", "Daniel", ""], ["Madey", "Greg", ""]]}, {"id": "1406.7735", "submitter": "Walter Lasecki", "authors": "Haoqi Zhang, Andes Monroy-Hernandez, Aaron Shaw, Sean Munson, Liz\n  Gerber, Benjamin Mako Hill, Peter Kinnaird, Shelly Farnham, and Patrick\n  Minder", "title": "WeDo: Exploring Participatory, End-To-End Collective Action", "comments": null, "journal-ref": null, "doi": null, "report-no": "ci-2014/95", "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many celebrate the Internet's ability to connect individuals and facilitate\ncollective action toward a common goal. While numerous systems have been\ndesigned to support particular aspects of collective action, few systems\nsupport participatory, end-to-end collective action in which a crowd or\ncommunity identifies opportunities, formulates goals, brainstorms ideas,\ndevelops plans, mobilizes, and takes action. To explore the possibilities and\nbarriers in supporting such interactions, we have developed WeDo, a system\naimed at promoting simple forms of participatory, end-to-end collective action.\nPilot deployments of WeDo illustrate that sociotechnical systems can support\nautomated transitions through different phases of end-to-end collective action,\nbut that challenges, such as the elicitation of leadership and the\naccommodation of existing group norms, remain.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2014 13:48:42 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Zhang", "Haoqi", ""], ["Monroy-Hernandez", "Andes", ""], ["Shaw", "Aaron", ""], ["Munson", "Sean", ""], ["Gerber", "Liz", ""], ["Hill", "Benjamin Mako", ""], ["Kinnaird", "Peter", ""], ["Farnham", "Shelly", ""], ["Minder", "Patrick", ""]]}, {"id": "1406.7751", "submitter": "Emilio Ferrara", "authors": "Emilio Ferrara, Roberto Interdonato, Andrea Tagarelli", "title": "Online Popularity and Topical Interests through the Lens of Instagram", "comments": "11 pages, 11 figures, Proceedings of ACM Hypertext 2014", "journal-ref": "Proceedings of the 25th ACM conference on Hypertext and social\n  media (pp. 24-34). ACM. 2014", "doi": "10.1145/2631775.2631808", "report-no": null, "categories": "cs.SI cs.CY physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Online socio-technical systems can be studied as proxy of the real world to\ninvestigate human behavior and social interactions at scale. Here we focus on\nInstagram, a media-sharing online platform whose popularity has been rising up\nto gathering hundred millions users. Instagram exhibits a mixture of features\nincluding social structure, social tagging and media sharing. The network of\nsocial interactions among users models various dynamics including\nfollower/followee relations and users' communication by means of\nposts/comments. Users can upload and tag media such as photos and pictures, and\nthey can \"like\" and comment each piece of information on the platform. In this\nwork we investigate three major aspects on our Instagram dataset: (i) the\nstructural characteristics of its network of heterogeneous interactions, to\nunveil the emergence of self organization and topically-induced community\nstructure; (ii) the dynamics of content production and consumption, to\nunderstand how global trends and popular users emerge; (iii) the behavior of\nusers labeling media with tags, to determine how they devote their attention\nand to explore the variety of their topical interests. Our analysis provides\nclues to understand human behavior dynamics on socio-technical systems,\nspecifically users and content popularity, the mechanisms of users'\ninteractions in online environments and how collective trends emerge from\nindividuals' topical interests.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2014 14:22:39 GMT"}], "update_date": "2017-03-07", "authors_parsed": [["Ferrara", "Emilio", ""], ["Interdonato", "Roberto", ""], ["Tagarelli", "Andrea", ""]]}, {"id": "1406.7866", "submitter": "Pece Mitrevski", "authors": "Marjan Angeleski, Pece Mitrevski, Slavica Rocheska and Ane Lashkoska", "title": "Regional Pilot Study to Evaluate e-Readiness and Local e-Government\n  Services", "comments": "10 pages, 3 figures, International Journal of Managing Public Sector\n  Information and Communication Technologies (IJMPICT), Vol. 5, No. 2, June\n  2014", "journal-ref": null, "doi": "10.5121/ijmpict.2014.5201", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of local e-Government has become a key factor for delivering\nservices in an efficient, cost effective, transparent and convenient way, in\ncircumstances where a) citizens do not have enough time available to\ncommunicate with local authorities in order to perform their responsibilities\nand needs, and b) information and communication technologies significantly\nfacilitate administrative procedures and citizens-government interaction. This\npaper aims to identify e-services that local authorities provide, and to\ninvestigate their readiness for delivering these services. A pilot research has\nbeen conducted to identify the offer of e-services by local authorities, along\nwith e-readiness in municipalities of the Pelagonia region in the Republic of\nMacedonia. The survey was carried out by means of structured interview\nquestions based on a modified model proposed by Partnership on Measuring ICT\nfor Development - web analysis of municipal websites in the region has been\nconducted, as well. The study reveals uneven distribution according to the age\ngroup of users, lack of reliability and confidence for processing the needs and\nrequests electronically by a large part of the population, and improperly\ndeveloped set of ICT tools by local governments for providing a variety of\nservices that can be fully processed electronically.\n", "versions": [{"version": "v1", "created": "Mon, 30 Jun 2014 19:41:13 GMT"}], "update_date": "2014-07-01", "authors_parsed": [["Angeleski", "Marjan", ""], ["Mitrevski", "Pece", ""], ["Rocheska", "Slavica", ""], ["Lashkoska", "Ane", ""]]}]