[{"id": "1706.00115", "submitter": "Hiroki Sayama", "authors": "Hiroki Sayama, Catherine Cramer, Lori Sheetz, Stephen Uzzo", "title": "NetSciEd: Network Science and Education for the Interconnected World", "comments": "15 pages, 4 figures, 3 tables", "journal-ref": "Complicity: An International Journal of Complexity and Education,\n  14 (2), 104-115, 2017", "doi": null, "report-no": null, "categories": "cs.CY physics.ed-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This short article presents a summary of the NetSciEd (Network Science and\nEducation) initiative that aims to address the need for curricula, resources,\naccessible materials, and tools for introducing K-12 students and the general\npublic to the concept of networks, a crucial framework in understanding\ncomplexity. NetSciEd activities include (1) the NetSci High educational\noutreach program (since 2010), which connects high school students and their\nteachers with regional university research labs and provides them with the\nopportunity to work on network science research projects; (2) the NetSciEd\nsymposium series (since 2012), which brings network science researchers and\neducators together to discuss how network science can help and be integrated\ninto formal and informal education; and (3) the Network Literacy: Essential\nConcepts and Core Ideas booklet (since 2014), which was created collaboratively\nand subsequently translated into 18 languages by an extensive group of network\nscience researchers and educators worldwide.\n", "versions": [{"version": "v1", "created": "Wed, 31 May 2017 22:30:24 GMT"}, {"version": "v2", "created": "Wed, 5 Jul 2017 22:47:19 GMT"}], "update_date": "2017-09-21", "authors_parsed": [["Sayama", "Hiroki", ""], ["Cramer", "Catherine", ""], ["Sheetz", "Lori", ""], ["Uzzo", "Stephen", ""]]}, {"id": "1706.00487", "submitter": "You Chen", "authors": "You Chen, Abel N. Kho, David Liebovitz, Catherine Ivory, Sarah\n  Osmundson, Jiang Bian, and Bradley A. Malin", "title": "Learning Bundled Care Opportunities from Electronic Medical Records", "comments": "27 pages, 3 figures, 3 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Objectives: The fee-for-service approach to healthcare leads to the\nmanagement of a patient's conditions in an independent manner, inducing various\nnegative consequences. It is recognized that a bundled care approach to\nhealthcare-one that manages a collection of health conditions together-may\nenable greater efficacy and cost savings. However, it is not always evident\nwhich sets of conditions should be managed in a bundled program. Study Design:\nRetrospective inference of clusters of health conditions from an electronic\nmedical record (EMR) system. A survey of healthcare experts to ascertain the\nplausibility of the clusters for bundled care programs. Methods: We designed a\ndata-driven framework to infer clusters of health conditions via their shared\nclinical workflows according to EMR utilization by healthcare employees. We\nevaluated the framework with approximately 16,500 inpatient stays from a large\nmedical center. The plausibility of the clusters for bundled care was assessed\nthrough a survey of a panel of healthcare experts using an analysis of variance\n(ANOVA) under a 95% confidence interval. Results: The framework inferred four\ncondition clusters: 1) fetal abnormalities, 2) late pregnancies, 3) prostate\nproblems, and 4) chronic diseases (with congestive heart failure featuring\nprominently). Each cluster was deemed plausible by the experts for bundled\ncare. Conclusions: The findings suggest that data from EMRs may provide a basis\nfor discovering new directions in bundled care. Still, translating such\nfindings into actual care management will require further refinement,\nimplementation, and evaluation.\n", "versions": [{"version": "v1", "created": "Fri, 26 May 2017 22:21:57 GMT"}], "update_date": "2017-06-05", "authors_parsed": [["Chen", "You", ""], ["Kho", "Abel N.", ""], ["Liebovitz", "David", ""], ["Ivory", "Catherine", ""], ["Osmundson", "Sarah", ""], ["Bian", "Jiang", ""], ["Malin", "Bradley A.", ""]]}, {"id": "1706.00497", "submitter": "Mark Yampolskiy", "authors": "Gregory Pope, Mark Yampolskiy", "title": "A Hazard Analysis Technique for Additive Manufacturing", "comments": "Better Software East Conference, 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The promise of Additive Manufacturing (AM) includes reduced transportation\nand warehousing costs, reduction of source material waste, and reduced\nenvironmental impact. AM is extremely useful for making prototypes and has\ndemonstrated the ability to manufacture complex parts not possible (or\nprohibitively expensive) with conventional machining. Scientists and\nmanufactures are finding increased uses for AM in creation of all types of\nfinished products including those built from polymers, biological material, and\nmetals. Although companies such as GE have been using 3D printing for Additive\nManufacturing for over thirty years to make mandrels for light bulb\nmanufacturing, application areas of Additive Manufacturing have increased\nsubstantially in recent years, particularly due to the reduction in cost of 3D\nprinters. Like most emergent technologies, there are bound to be growing pains\nwith AM. This paper looks at the software that supports AM and 3D printing and\ntheir vulnerability to cyber-attacks, intellectual property theft, defect rates\nof AM software (which can cause undesired consequences themselves and also\ncreate vulnerabilities that a hacker may exploit), part reliability and safety\nof devices incorporating 3D printed parts (when making mission critical parts),\nand security/throughput issues of computer networks. Literature searches,\nconsulting with technical experts and a relatively new hazard analysis\ntechnique will be used, one especially developed for software intensive systems\ncalled Systemic Theoretic Process Analysis (STPA). The purpose of this white\npaper is to identify risks (or hazards for mission critical parts) for AM in\nthis emergent stage so that mitigations can be applied before accidents occur.\nA second purpose of this white paper is to evaluate the effectiveness of STPA\nas a hazard analysis technique in a field that is still relatively new.\n", "versions": [{"version": "v1", "created": "Mon, 29 May 2017 20:00:09 GMT"}], "update_date": "2017-06-05", "authors_parsed": [["Pope", "Gregory", ""], ["Yampolskiy", "Mark", ""]]}, {"id": "1706.00498", "submitter": "Karan Maheshwari", "authors": "Karan Maheshwari, Nalini N", "title": "Facial Recognition Enabled Smart Door Using Microsoft Face API", "comments": "4 pages, 5 figures, published with International Journal of\n  Engineering Trends and Applications", "journal-ref": "IJETA V4(3): Page(1-4) May - Jun 2017. ISSN: 2393-9516\n  http://www.ijetajournal.org. Published by Eighth Sense Research Group", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Privacy and Security are two universal rights and, to ensure that in our\ndaily life we are secure, a lot of research is going on in the field of home\nsecurity, and IoT is the turning point for the industry, where we connect\neveryday objects to share data for our betterment. Facial recognition is a\nwell-established process in which the face is detected and identified out of\nthe image. We aim to create a smart door, which secures the gateway on the\nbasis of who we are. In our proof of concept of a smart door we have used a\nlive HD camera on the front side of setup attached to a display monitor\nconnected to the camera to show who is standing in front of the door, also the\nwhole system will be able to give voice outputs by processing text them on the\nRaspberry Pi ARM processor used and show the answers as output on the screen.\nWe are using a set of electromagnets controlled by the microcontroller, which\nwill act as a lock. So a person can open the smart door with the help of facial\nrecognition and at the same time also be able to interact with it. The facial\nrecognition is done by Microsoft face API but our state of the art desktop\napplication operating over Microsoft Visual Studio IDE reduces the\ncomputational time by detecting the face out of the photo and giving that as\nthe output to Microsoft Face API, which is hosted over Microsoft Azure cloud\nsupport.\n", "versions": [{"version": "v1", "created": "Mon, 29 May 2017 16:29:09 GMT"}], "update_date": "2017-06-05", "authors_parsed": [["Maheshwari", "Karan", ""], ["N", "Nalini", ""]]}, {"id": "1706.00682", "submitter": "Zongtao Liu", "authors": "Yang Yang, Chenhao Tan, Zongtao Liu, Fei Wu and Yueting Zhuang", "title": "Urban Dreams of Migrants: A Case Study of Migrant Integration in\n  Shanghai", "comments": "A modified version. The paper was accepted by AAAI 2018", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Unprecedented human mobility has driven the rapid urbanization around the\nworld. In China, the fraction of population dwelling in cities increased from\n17.9% to 52.6% between 1978 and 2012. Such large-scale migration poses\nchallenges for policymakers and important questions for researchers. To\ninvestigate the process of migrant integration, we employ a one-month complete\ndataset of telecommunication metadata in Shanghai with 54 million users and 698\nmillion call logs. We find systematic differences between locals and migrants\nin their mobile communication networks and geographical locations. For\ninstance, migrants have more diverse contacts and move around the city with a\nlarger radius than locals after they settle down. By distinguishing new\nmigrants (who recently moved to Shanghai) from settled migrants (who have been\nin Shanghai for a while), we demonstrate the integration process of new\nmigrants in their first three weeks. Moreover, we formulate classification\nproblems to predict whether a person is a migrant. Our classifier is able to\nachieve an F1-score of 0.82 when distinguishing settled migrants from locals,\nbut it remains challenging to identify new migrants because of class imbalance.\nThis classification setup holds promise for identifying new migrants who will\nsuccessfully integrate into locals (new migrants that misclassified as locals).\n", "versions": [{"version": "v1", "created": "Fri, 2 Jun 2017 13:24:37 GMT"}, {"version": "v2", "created": "Wed, 7 Jun 2017 14:57:13 GMT"}, {"version": "v3", "created": "Thu, 8 Jun 2017 03:11:34 GMT"}, {"version": "v4", "created": "Tue, 21 Nov 2017 05:54:00 GMT"}, {"version": "v5", "created": "Wed, 22 Nov 2017 07:40:00 GMT"}], "update_date": "2017-11-27", "authors_parsed": [["Yang", "Yang", ""], ["Tan", "Chenhao", ""], ["Liu", "Zongtao", ""], ["Wu", "Fei", ""], ["Zhuang", "Yueting", ""]]}, {"id": "1706.00887", "submitter": "Xintao Wu", "authors": "Shuhan Yuan, Panpan Zheng, Xintao Wu, Yang Xiang", "title": "Wikipedia Vandal Early Detection: from User Behavior to User Embedding", "comments": "14 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CL cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Wikipedia is the largest online encyclopedia that allows anyone to edit\narticles. In this paper, we propose the use of deep learning to detect vandals\nbased on their edit history. In particular, we develop a multi-source\nlong-short term memory network (M-LSTM) to model user behaviors by using a\nvariety of user edit aspects as inputs, including the history of edit reversion\ninformation, edit page titles and categories. With M-LSTM, we can encode each\nuser into a low dimensional real vector, called user embedding. Meanwhile, as a\nsequential model, M-LSTM updates the user embedding each time after the user\ncommits a new edit. Thus, we can predict whether a user is benign or vandal\ndynamically based on the up-to-date user embedding. Furthermore, those user\nembeddings are crucial to discover collaborative vandals.\n", "versions": [{"version": "v1", "created": "Sat, 3 Jun 2017 02:42:40 GMT"}], "update_date": "2017-06-06", "authors_parsed": [["Yuan", "Shuhan", ""], ["Zheng", "Panpan", ""], ["Wu", "Xintao", ""], ["Xiang", "Yang", ""]]}, {"id": "1706.01136", "submitter": "Rania Almajalid", "authors": "Rania Almajalid", "title": "A Survey on the Adoption of Cloud Computing in Education Sector", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Education is a key factor in ensuring economic growth, especially for\ncountries with growing economies. Today, students have become more\ntechnologically savvy as teaching and learning uses more advance technology day\nin, day out. Due to virtualize resources through the Internet, as well as\ndynamic scalability, cloud computing has continued to be adopted by more\norganizations. Despite the looming financial crisis, there has been increasing\npressure for educational institutions to deliver better services using minimal\nresources. Leaning institutions, both public and private can utilize the\npotential advantage of cloud computing to ensure high quality service\nregardless of the minimal resources available. Cloud computing is taking a\ncenter stage in academia because of its various benefits. Various learning\ninstitutions use different cloud-based applications provided by the service\nproviders to ensure that their students and other users can perform both\nacademic as well as business-related tasks. Thus, this research will seek to\nestablish the benefits associated with the use of cloud computing in learning\ninstitutions. The solutions provided by the cloud technology ensure that the\nresearch and development, as well as the teaching is more sustainable and\nefficient, thus positively influencing the quality of learning and teaching\nwithin educational institutions. This has led to various learning institutions\nadopting cloud technology as a solution to various technological challenges\nthey face on a daily routine.\n", "versions": [{"version": "v1", "created": "Sun, 4 Jun 2017 19:44:29 GMT"}], "update_date": "2017-06-06", "authors_parsed": [["Almajalid", "Rania", ""]]}, {"id": "1706.01303", "submitter": "Roman Yampolskiy", "authors": "Roman V. Yampolskiy", "title": "The Singularity May Be Near", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Toby Walsh in 'The Singularity May Never Be Near' gives six arguments to\nsupport his point of view that technological singularity may happen but that it\nis unlikely. In this paper, we provide analysis of each one of his arguments\nand arrive at similar conclusions, but with more weight given to the 'likely to\nhappen' probability.\n", "versions": [{"version": "v1", "created": "Wed, 31 May 2017 19:42:06 GMT"}], "update_date": "2017-06-06", "authors_parsed": [["Yampolskiy", "Roman V.", ""]]}, {"id": "1706.01513", "submitter": "Keith Feldman", "authors": "Keith Feldman, Louis Faust, Xian Wu, Chao Huang, and Nitesh V. Chawla", "title": "Beyond Volume: The Impact of Complex Healthcare Data on the Machine\n  Learning Pipeline", "comments": "Healthcare Informatics, Machine Learning, Knowledge Discovery: 20\n  Pages, 1 Figure", "journal-ref": "Towards Integrative Machine Learning and Knowledge Extraction,\n  LNCS vol 10344 (2017) 150-169", "doi": "10.1007/978-3-319-69775-8_9", "report-no": null, "categories": "cs.CY cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  From medical charts to national census, healthcare has traditionally operated\nunder a paper-based paradigm. However, the past decade has marked a long and\narduous transformation bringing healthcare into the digital age. Ranging from\nelectronic health records, to digitized imaging and laboratory reports, to\npublic health datasets, today, healthcare now generates an incredible amount of\ndigital information. Such a wealth of data presents an exciting opportunity for\nintegrated machine learning solutions to address problems across multiple\nfacets of healthcare practice and administration. Unfortunately, the ability to\nderive accurate and informative insights requires more than the ability to\nexecute machine learning models. Rather, a deeper understanding of the data on\nwhich the models are run is imperative for their success. While a significant\neffort has been undertaken to develop models able to process the volume of data\nobtained during the analysis of millions of digitalized patient records, it is\nimportant to remember that volume represents only one aspect of the data. In\nfact, drawing on data from an increasingly diverse set of sources, healthcare\ndata presents an incredibly complex set of attributes that must be accounted\nfor throughout the machine learning pipeline. This chapter focuses on\nhighlighting such challenges, and is broken down into three distinct\ncomponents, each representing a phase of the pipeline. We begin with attributes\nof the data accounted for during preprocessing, then move to considerations\nduring model building, and end with challenges to the interpretation of model\noutput. For each component, we present a discussion around data as it relates\nto the healthcare domain and offer insight into the challenges each may impose\non the efficiency of machine learning techniques.\n", "versions": [{"version": "v1", "created": "Thu, 1 Jun 2017 20:34:41 GMT"}, {"version": "v2", "created": "Fri, 26 Jan 2018 15:05:34 GMT"}], "update_date": "2018-01-29", "authors_parsed": [["Feldman", "Keith", ""], ["Faust", "Louis", ""], ["Wu", "Xian", ""], ["Huang", "Chao", ""], ["Chawla", "Nitesh V.", ""]]}, {"id": "1706.01720", "submitter": "Muhammad Ahmad", "authors": "Muhammad Ahmad, Adil Mehmood Khan, Manuel Mazzara, Salvatore Distefano", "title": "Seeking Optimum System Settings for Physical Activity Recognition on\n  Smartwatches", "comments": "15 pages, 2 figures, Accepted in CVC'19", "journal-ref": "Computer Vision Conference (CVC'19), 2019", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Physical activity recognition (PAR) using wearable devices can provide valued\ninformation regarding an individual's degree of functional ability and\nlifestyle. In this regards, smartphone-based physical activity recognition is a\nwell-studied area. Research on smartwatch-based PAR, on the other hand, is\nstill in its infancy. Through a large-scale exploratory study, this work aims\nto investigate the smartwatch-based PAR domain. A detailed analysis of various\nfeature banks and classification methods are carried out to find the optimum\nsystem settings for the best performance of any smartwatch-based PAR system for\nboth personal and impersonal models. To further validate our hypothesis for\nboth personal (The classifier is built using the data only from one specific\nuser) and impersonal (The classifier is built using the data from every user\nexcept the one under study) models, we tested single subject validation process\nfor smartwatch-based activity recognition.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 12:02:43 GMT"}, {"version": "v2", "created": "Sun, 21 Apr 2019 07:49:04 GMT"}], "update_date": "2019-04-23", "authors_parsed": [["Ahmad", "Muhammad", ""], ["Khan", "Adil Mehmood", ""], ["Mazzara", "Manuel", ""], ["Distefano", "Salvatore", ""]]}, {"id": "1706.01739", "submitter": "Muhammad Ahmad", "authors": "Muhammad Ahmad, Ali Kashif Bashir, Adil Mehmood Khan, Manuel Mazzara,\n  Salvatore Distefano, Shahzad Sarfraz", "title": "Multi Sensor-based Implicit User Identification", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Smartphones have ubiquitously integrated into our home and work environments,\nhowever, users normally rely on explicit but inefficient identification\nprocesses in a controlled environment. Therefore, when a device is stolen, a\nthief can have access to the owner's personal information and services against\nthe stored passwords. As a result of this potential scenario, this work\nproposes an automatic legitimate user identification system based on gait\nbiometrics extracted from user walking patterns captured by a smartphone. A set\nof preprocessing schemes is applied to calibrate noisy and invalid samples and\naugment the gait-induced time and frequency domain features, then further\noptimized using a non-linear unsupervised feature selection method. The\nselected features create an underlying gait biometric representation able to\ndiscriminate among individuals and identify them uniquely. Different\nclassifiers (i.e. Support Vector Machine (SVM), K-Nearest Neighbors (KNN),\nBagging, and Extreme Learning Machine (ELM)) are adopted to achieve accurate\nlegitimate user identification. Extensive experiments on a group of $16$\nindividuals in an indoor environment show the effectiveness of the proposed\nsolution: with $5$ to $70$ samples per window, KNN and bagging classifiers\nachieve $87-99\\%$ accuracy, $82-98\\%$ for ELM, and $81-94\\%$ for SVM. The\nproposed pipeline achieves a $100\\%$ true positive and $0\\%$ false-negative\nrate for almost all classifiers.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 13:10:37 GMT"}, {"version": "v2", "created": "Fri, 30 Nov 2018 15:25:36 GMT"}, {"version": "v3", "created": "Thu, 24 Sep 2020 15:45:59 GMT"}], "update_date": "2020-09-25", "authors_parsed": [["Ahmad", "Muhammad", ""], ["Bashir", "Ali Kashif", ""], ["Khan", "Adil Mehmood", ""], ["Mazzara", "Manuel", ""], ["Distefano", "Salvatore", ""], ["Sarfraz", "Shahzad", ""]]}, {"id": "1706.01875", "submitter": "Rishab Nithyanand", "authors": "Rishab Nithyanand, Brian Schaffner, Phillipa Gill", "title": "Measuring Offensive Speech in Online Political Discourse", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CL cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The Internet and online forums such as Reddit have become an increasingly\npopular medium for citizens to engage in political conversations. However, the\nonline disinhibition effect resulting from the ability to use pseudonymous\nidentities may manifest in the form of offensive speech, consequently making\npolitical discussions more aggressive and polarizing than they already are.\nSuch environments may result in harassment and self-censorship from its\ntargets. In this paper, we present preliminary results from a large-scale\ntemporal measurement aimed at quantifying offensiveness in online political\ndiscussions.\n  To enable our measurements, we develop and evaluate an offensive speech\nclassifier. We then use this classifier to quantify and compare offensiveness\nin the political and general contexts. We perform our study using a database of\nover 168M Reddit comments made by over 7M pseudonyms between January 2015 and\nJanuary 2017 -- a period covering several divisive political events including\nthe 2016 US presidential elections.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 21:29:23 GMT"}, {"version": "v2", "created": "Wed, 19 Jul 2017 17:24:51 GMT"}], "update_date": "2017-07-20", "authors_parsed": [["Nithyanand", "Rishab", ""], ["Schaffner", "Brian", ""], ["Gill", "Phillipa", ""]]}, {"id": "1706.01985", "submitter": "Cynthia Dwork", "authors": "Cynthia Dwork and George J. Pappas", "title": "Privacy in Information-Rich Intelligent Infrastructure", "comments": "A Computing Community Consortium (CCC) white paper, 5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Intelligent infrastructure will critically rely on the dense instrumentation\nof sensors and actuators that constantly transmit streaming data to cloud-based\nanalytics for real-time monitoring. For example, driverless cars communicate\nreal-time location and other data to companies like Google, which aggregate\nregional data in order to provide real-time traffic maps. Such traffic maps can\nbe extremely useful to the driver (for optimal travel routing), as well as to\ncity transportation administrators for real-time accident response that can\nhave an impact on traffic capacity. Intelligent infrastructure monitoring\ncompromises the privacy of drivers who continuously share their location to\ncloud aggregators, with unpredictable consequences.\n  Without a framework for protecting the privacy of the driver's data, drivers\nmay be very conservative about sharing their data with cloud-based analytics\nthat will be responsible for adding the intelligence to intelligent\ninfrastructure. In the energy sector, the Smart Grid revolution relies\ncritically on real-time metering of energy supply and demand with very high\ngranularity. This is turn enables real-time demand response and creates a new\nenergy market that can incorporate unpredictable renewable energy sources while\nensuring grid stability and reliability. However, real-time streaming data\ncaptured by smart meters contain a lot of private information, such as our home\nactivities or lack of, which can be easily inferred by anyone that has access\nto the smart meter data, resulting not only in loss of privacy but potentially\nalso putting us at risk.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 21:16:32 GMT"}], "update_date": "2017-06-08", "authors_parsed": [["Dwork", "Cynthia", ""], ["Pappas", "George J.", ""]]}, {"id": "1706.02153", "submitter": "Edwin Henneken", "authors": "Edwin A. Henneken, Michael J. Kurtz", "title": "Usage Bibliometrics as a Tool to Measure Research Activity", "comments": "25 pages, 11 figures, accepted for publication in Handbook of\n  Quantitative Science and Technology Research, Springer", "journal-ref": null, "doi": "10.1007/978-3-030-02511-3_32", "report-no": null, "categories": "cs.DL astro-ph.IM cs.CY cs.IR physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Measures for research activity and impact have become an integral ingredient\nin the assessment of a wide range of entities (individual researchers,\norganizations, instruments, regions, disciplines). Traditional bibliometric\nindicators, like publication and citation based indicators, provide an\nessential part of this picture, but cannot describe the complete picture. Since\nreading scholarly publications is an essential part of the research life cycle,\nit is only natural to introduce measures for this activity in attempts to\nquantify the efficiency, productivity and impact of an entity. Citations and\nreads are significantly different signals, so taken together, they provide a\nmore complete picture of research activity. Most scholarly publications are now\naccessed online, making the study of reads and their patterns possible.\nClick-stream logs allow us to follow information access by the entire research\ncommunity, real-time. Publication and citation datasets just reflect activity\nby authors. In addition, download statistics will help us identify publications\nwith significant impact, but which do not attract many citations. Click-stream\nsignals are arguably more complex than, say, citation signals. For one, they\nare a superposition of different classes of readers. Systematic downloads by\ncrawlers also contaminate the signal, as does browsing behavior. We discuss the\ncomplexities associated with clickstream data and how, with proper filtering,\nstatistically significant relations and conclusions can be inferred from\ndownload statistics. We describe how download statistics can be used to\ndescribe research activity at different levels of aggregation, ranging from\norganizations to countries. These statistics show a correlation with\nsocio-economic indicators. A comparison will be made with traditional\nbibliometric indicators. We will argue that astronomy is representative of more\ngeneral trends.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jun 2017 12:33:13 GMT"}], "update_date": "2020-04-22", "authors_parsed": [["Henneken", "Edwin A.", ""], ["Kurtz", "Michael J.", ""]]}, {"id": "1706.02192", "submitter": "Pavan Ravikanth Kondamudi", "authors": "Pavan Ravikanth Kondamudi, Bradley Protono, Hamed Alhoori", "title": "Pok\\'emon Go: Impact on Yelp Restaurant Reviews", "comments": null, "journal-ref": null, "doi": "10.1145/3091478.3098861", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Pok\\'emon Go, the popular Augmented Reality based mobile application,\nlaunched in July of 2016. The game's meteoric rise in usage since that time has\nhad an impact on not just the mobile gaming industry, but also the physical\nactivity of players, where they travel, where they spend their money, and\npossibly how they interact with other social media applications. In this paper,\nwe studied the impact of Pok\\'emon Go on Yelp reviews. For restaurants near\nPok\\'eStops, we found a slight drop in the number of online reviews.\n", "versions": [{"version": "v1", "created": "Wed, 7 Jun 2017 13:58:51 GMT"}], "update_date": "2017-06-08", "authors_parsed": [["Kondamudi", "Pavan Ravikanth", ""], ["Protono", "Bradley", ""], ["Alhoori", "Hamed", ""]]}, {"id": "1706.02557", "submitter": "Yoji Yamato", "authors": "Yoji Yamato", "title": "Study of Vital Data Analysis Platform Using Wearable Sensor", "comments": "5 pages, 2 figures, IEICE Technical Report, SC2016-34, Mar. 2017.\n  arXiv admin note: substantial text overlap with arXiv:1704.05573", "journal-ref": "IEICE Technical Report, SC2016-34, Mar. 2017. (c) 2017 IEICE", "doi": null, "report-no": null, "categories": "cs.DC cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a vital data analysis platform which resolves\nexisting problems to utilize vital data for real-time actions. Recently, IoT\ntechnologies have been progressed but in the healthcare area, real-time actions\nbased on analyzed vital data are not considered sufficiently yet. The causes\nare proper use of analyzing methods of stream / micro batch processing and\nnetwork cost. To resolve existing problems, we propose our vital data analysis\nplatform. Our platform collects vital data of Electrocardiograph and\nacceleration using an example of wearable vital sensor and analyzes them to\nextract posture, fatigue and relaxation in smart phones or cloud. Our platform\ncan show analyzed dangerous posture or fatigue level change. We implemented the\nplatform and we are now preparing a field test.\n", "versions": [{"version": "v1", "created": "Tue, 6 Jun 2017 23:37:07 GMT"}], "update_date": "2018-09-17", "authors_parsed": [["Yamato", "Yoji", ""]]}, {"id": "1706.02744", "submitter": "Niki Kilbertus", "authors": "Niki Kilbertus, Mateo Rojas-Carulla, Giambattista Parascandolo, Moritz\n  Hardt, Dominik Janzing, Bernhard Sch\\\"olkopf", "title": "Avoiding Discrimination through Causal Reasoning", "comments": "Advances in Neural Information Processing Systems 30, 2017\n  http://papers.nips.cc/paper/6668-avoiding-discrimination-through-causal-reasoning", "journal-ref": "Advances in Neural Information Processing Systems 30, 2017, p.\n  656--666", "doi": null, "report-no": null, "categories": "stat.ML cs.CY cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Recent work on fairness in machine learning has focused on various\nstatistical discrimination criteria and how they trade off. Most of these\ncriteria are observational: They depend only on the joint distribution of\npredictor, protected attribute, features, and outcome. While convenient to work\nwith, observational criteria have severe inherent limitations that prevent them\nfrom resolving matters of fairness conclusively.\n  Going beyond observational criteria, we frame the problem of discrimination\nbased on protected attributes in the language of causal reasoning. This\nviewpoint shifts attention from \"What is the right fairness criterion?\" to\n\"What do we want to assume about the causal data generating process?\" Through\nthe lens of causality, we make several contributions. First, we crisply\narticulate why and when observational criteria fail, thus formalizing what was\nbefore a matter of opinion. Second, our approach exposes previously ignored\nsubtleties and why they are fundamental to the problem. Finally, we put forward\nnatural causal non-discrimination criteria and develop algorithms that satisfy\nthem.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jun 2017 19:50:56 GMT"}, {"version": "v2", "created": "Sun, 21 Jan 2018 16:39:51 GMT"}], "update_date": "2018-01-23", "authors_parsed": [["Kilbertus", "Niki", ""], ["Rojas-Carulla", "Mateo", ""], ["Parascandolo", "Giambattista", ""], ["Hardt", "Moritz", ""], ["Janzing", "Dominik", ""], ["Schölkopf", "Bernhard", ""]]}, {"id": "1706.02777", "submitter": "R.Stuart Geiger", "authors": "R. Stuart Geiger", "title": "Summary Analysis of the 2017 GitHub Open Source Survey", "comments": "58 pages", "journal-ref": null, "doi": "10.17605/OSF.IO/ENRQ5", "report-no": null, "categories": "cs.CY cs.SE cs.SI", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This report is a high-level summary analysis of the 2017 GitHub Open Source\nSurvey dataset, presenting frequency counts, proportions, and frequency or\nproportion bar plots for every question asked in the survey.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jun 2017 21:29:00 GMT"}], "update_date": "2017-06-14", "authors_parsed": [["Geiger", "R. Stuart", ""]]}, {"id": "1706.02796", "submitter": "Victor Silva", "authors": "Mirna Paula Silva, Victor do Nascimento Silva and Luiz Chaimowicz", "title": "Dynamic Difficulty Adjustment on MOBA Games", "comments": "103-123", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper addresses the dynamic difficulty adjustment on MOBA games as a way\nto improve the player's entertainment. Although MOBA is currently one of the\nmost played genres around the world, it is known as a game that offer less\nautonomy, more challenges and consequently more frustration. Due to these\ncharacteristics, the use of a mechanism that performs the difficulty balance\ndynamically seems to be an interesting alternative to minimize and/or avoid\nthat players experience such frustrations. In this sense, this paper presents a\ndynamic difficulty adjustment mechanism for MOBA games. The main idea is to\ncreate a computer controlled opponent that adapts dynamically to the player\nperformance, trying to offer to the player a better game experience. This is\ndone by evaluating the performance of the player using a metric based on some\ngame features and switching the difficulty of the opponent's artificial\nintelligence behavior accordingly. Quantitative and qualitative experiments\nwere performed and the results showed that the system is capable of adapting\ndynamically to the opponent's skills. In spite of that, the qualitative\nexperiments with users showed that the player's expertise has a greater\ninfluence on the perception of the difficulty level and dynamic adaptation.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jun 2017 23:45:07 GMT"}], "update_date": "2017-06-12", "authors_parsed": [["Silva", "Mirna Paula", ""], ["Silva", "Victor do Nascimento", ""], ["Chaimowicz", "Luiz", ""]]}, {"id": "1706.02832", "submitter": "Victor Silva", "authors": "Victor do Nascimento Silva and Luiz Chaimowicz", "title": "A Tutor Agent for MOBA Games", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Digital games have become a key player in the entertainment industry,\nattracting millions of new players each year. In spite of that, novice players\nmay have a hard time when playing certain types of games, such as MOBAs and\nMMORPGs, due to their steep learning curves and not so friendly online\ncommunities. In this paper, we present an approach to help novice players in\nMOBA games overcome these problems. An artificial intelligence agent plays\nalongside the player analyzing his/her performance and giving tips about the\ngame. Experiments performed with the game {\\em League of Legends} show the\npotential of this approach.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jun 2017 04:33:58 GMT"}], "update_date": "2017-06-12", "authors_parsed": [["Silva", "Victor do Nascimento", ""], ["Chaimowicz", "Luiz", ""]]}, {"id": "1706.03021", "submitter": "Utku Kose", "authors": "Alice Pavaloiu, Utku Kose", "title": "Ethical Artificial Intelligence - An Open Question", "comments": "13 pages, 3 figures", "journal-ref": "Journal of Multidisciplinary Developments, 2(2), 2017, 15-27", "doi": null, "report-no": null, "categories": "cs.AI cs.CY", "license": "http://creativecommons.org/licenses/by-sa/4.0/", "abstract": "  Artificial Intelligence (AI) is an effective science which employs strong\nenough approaches, methods, and techniques to solve unsolvable real world based\nproblems. Because of its unstoppable rise towards the future, there are also\nsome discussions about its ethics and safety. Shaping an AI friendly\nenvironment for people and a people friendly environment for AI can be a\npossible answer for finding a shared context of values for both humans and\nrobots. In this context, objective of this paper is to address the ethical\nissues of AI and explore the moral dilemmas that arise from ethical algorithms,\nfrom pre set or acquired values. In addition, the paper will also focus on the\nsubject of AI safety. As general, the paper will briefly analyze the concerns\nand potential solutions to solving the ethical issues presented and increase\nreaders awareness on AI safety as another related research interest.\n", "versions": [{"version": "v1", "created": "Tue, 16 May 2017 20:57:36 GMT"}], "update_date": "2017-06-12", "authors_parsed": [["Pavaloiu", "Alice", ""], ["Kose", "Utku", ""]]}, {"id": "1706.03102", "submitter": "Solon Barocas", "authors": "Solon Barocas, Elizabeth Bradley, Vasant Honavar, and Foster Provost", "title": "Big Data, Data Science, and Civil Rights", "comments": "A Computing Community Consortium (CCC) white paper, 8 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Advances in data analytics bring with them civil rights implications.\nData-driven and algorithmic decision making increasingly determine how\nbusinesses target advertisements to consumers, how police departments monitor\nindividuals or groups, how banks decide who gets a loan and who does not, how\nemployers hire, how colleges and universities make admissions and financial aid\ndecisions, and much more. As data-driven decisions increasingly affect every\ncorner of our lives, there is an urgent need to ensure they do not become\ninstruments of discrimination, barriers to equality, threats to social justice,\nand sources of unfairness. In this paper, we argue for a concrete research\nagenda aimed at addressing these concerns, comprising five areas of emphasis:\n(i) Determining if models and modeling procedures exhibit objectionable bias;\n(ii) Building awareness of fairness into machine learning methods; (iii)\nImproving the transparency and control of data- and model-driven decision\nmaking; (iv) Looking beyond the algorithm(s) for sources of bias and\nunfairness-in the myriad human decisions made during the problem formulation\nand modeling process; and (v) Supporting the cross-disciplinary scholarship\nnecessary to do all of that well.\n", "versions": [{"version": "v1", "created": "Fri, 9 Jun 2017 19:45:28 GMT"}], "update_date": "2017-06-13", "authors_parsed": [["Barocas", "Solon", ""], ["Bradley", "Elizabeth", ""], ["Honavar", "Vasant", ""], ["Provost", "Foster", ""]]}, {"id": "1706.03407", "submitter": "Vena Pearl Bongolan Dr.", "authors": "Vena Pearl Bo\\~ngolan, Oreste Terranova, Edward Nataniel Apostol,\n  Joshua Kevin Cruz", "title": "Scenario and Sensitivity Analysis for Flooding Vulnerability using\n  Genetic Algorithms", "comments": "17 pages, 6 figures, three tables. Work has been presented at the\n  European Geoscience Union General Assembly, Vienna, April 2013 and at the\n  Asia Oceania Geoscience Society, Singapore, 2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We try to answer the question: \"can we 'modify' our neighborhoods to make\nthem less vulnerable to flooding?\" We minimize flooding vulnerability for a\ncity in the central plain of Luzon, by modeling the city as a biological\norganism with 'traits', and try to 'breed' a 'champion' city (with a low\nflooding vulnerability) via a genetic algorithm. The result is a description of\nthe traits the barangays (neighborhoods) should have (the 'design' of the\ncity). As far as we can tell, this kind of modeling has not been attempted\nbefore. The different components of flooding vulnerability were investigated,\nand each was given a weight, which allows us to express vulnerability as a\nweighted sum; this serves as the fitness function for the genetic algorithm. We\nalso allowed non-linear interactions among related but independent components,\nviz, poverty and mortality rate, and literacy and radio/TV penetration. The\ntwo-table system we used to prioritize the components of vulnerability is prone\nto subjectivity, a common problem in analyses of vulnerability. Thus, a\nsensitivity analysis was done, which gave a design with a 24% decrease in\nvulnerability alongside a 14% percent decrease in cost, a significant\nimprovement over this initial scenario analysis, where the proposed design had\na 12% decrease in vulnerability with a one percent increase in cost.\n", "versions": [{"version": "v1", "created": "Sun, 11 Jun 2017 21:17:43 GMT"}], "update_date": "2017-06-13", "authors_parsed": [["Boñgolan", "Vena Pearl", ""], ["Terranova", "Oreste", ""], ["Apostol", "Edward Nataniel", ""], ["Cruz", "Joshua Kevin", ""]]}, {"id": "1706.03699", "submitter": "Bartlomiej Placzek", "authors": "Bartlomiej Placzek, Jolnta Golosz", "title": "The in-town monitoring system for ambulance dispatch centre", "comments": "6 pages, 6 figures", "journal-ref": "Journal of Medical Informatics & Technologies, vol. 5, MI101--106,\n  2003", "doi": null, "report-no": null, "categories": "cs.CY cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The paper presents the vehicles integrated monitoring system giving\npriorities for emergency vehicles. The described system exploits the data\ngathered by: geographical positioning systems and geographical information\nsystems. The digital maps and roadside cameras provide the dispatchers with\naims for in town ambulances traffic management. The method of vehicles\npositioning in the city network and algorithms for ambulances recognition by\nimage processing techniques have been discussed in the paper. These priorities\nare needed for an efficient life-saving actions that require the real-time\ncontrolling strategies.\n", "versions": [{"version": "v1", "created": "Wed, 31 May 2017 22:21:06 GMT"}], "update_date": "2017-06-13", "authors_parsed": [["Placzek", "Bartlomiej", ""], ["Golosz", "Jolnta", ""]]}, {"id": "1706.03700", "submitter": "Peng Zhang", "authors": "Peng Zhang, Jules White, Douglas C. Schmidt, Gunther Lenz", "title": "Applying Software Patterns to Address Interoperability in\n  Blockchain-based Healthcare Apps", "comments": "submitted to the 24th Pattern Languages of Programming conference,\n  October 22-25, 2017, Vancouver, Canada", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Since the inception of the Bitcoin technology, its underlying data\nstructure--the blockchain--has garnered much attention due to properties such\nas decentralization, transparency, and immutability. These properties make\nblockchains suitable for apps that require disintermediation through trustless\nexchange, consistent and incorruptible transaction records, and operational\nmodels beyond cryptocurrency. In particular, blockchain and its smart contract\ncapabilities have the potential to address healthcare interoperability issues,\nsuch as enabling effective interactions between users and medical applications,\ndelivering patient data securely to a variety of organizations and devices, and\nimproving the overall efficiency of medical practice workflow. Despite the\ninterest in using blockchain for healthcare interoperability, however, little\ninformation is available on the concrete architectural styles and patterns for\napplying blockchain to healthcare apps. This paper provides an initial step in\nfilling this gap by showing: (1) the features and implementation challenges in\nhealthcare interoperability, (2) an end-to-end case study of a blockchain-based\nhealthcare app we are developing, and (3) how applying foundational software\npatterns can help address common interoperability challenges faced by\nblockchain-based healthcare apps.\n", "versions": [{"version": "v1", "created": "Mon, 5 Jun 2017 18:37:47 GMT"}], "update_date": "2017-06-13", "authors_parsed": [["Zhang", "Peng", ""], ["White", "Jules", ""], ["Schmidt", "Douglas C.", ""], ["Lenz", "Gunther", ""]]}, {"id": "1706.03701", "submitter": "Eiman Kanjo Dr", "authors": "Eiman Kanjo, Daria Kuss, Chee Siang Ang", "title": "NotiMind: Utilizing Responses to Smart Phone Notifications as Affective\n  sensors", "comments": null, "journal-ref": null, "doi": "10.1109/ACCESS.2017.2755661", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Today's mobile phone users are faced with large numbers of notifications on\nsocial media, ranging from new followers on Twitter and emails to messages\nreceived from WhatsApp and Facebook. These digital alerts continuously disrupt\nactivities through instant calls for attention. This paper examines closely the\nway everyday users interact with notifications and their impact on users'\nemotion. Fifty users were recruited to download our application NotiMind and\nuse it over a five-week period. Users' phones collected thousands of social and\nsystem notifications along with affect data collected via self-reported PANAS\ntests three times a day. Results showed a noticeable correlation between\npositive affective measures and keyboard activities. When large numbers of Post\nand Remove notifications occur, a corresponding increase in negative affective\nmeasures is detected. Our predictive model has achieved a good accuracy level\nusing three different classifiers \"in the wild\" (F-measure 74-78%\nwithin-subject model, 72-76% global model). Our findings show that it is\npossible to automatically predict when people are experiencing positive,\nneutral or negative affective states based on interactions with notifications.\nWe also show how our findings open the door to a wide range of applications in\nrelation to emotion awareness on social and mobile communication.\n", "versions": [{"version": "v1", "created": "Thu, 8 Jun 2017 00:20:22 GMT"}], "update_date": "2017-09-26", "authors_parsed": [["Kanjo", "Eiman", ""], ["Kuss", "Daria", ""], ["Ang", "Chee Siang", ""]]}, {"id": "1706.03848", "submitter": "Olga Zagovora", "authors": "Olga Zagovora (1), Fabian Fl\\\"ock (1), Claudia Wagner (1 and 2) ((1)\n  GESIS - Leibniz Institute for the Social Sciences, (2) University of\n  Koblenz-Landau)", "title": "\"(Weitergeleitet von Journalistin)\": The Gendered Presentation of\n  Professions on Wikipedia", "comments": "In the 9th International ACM Web Science Conference 2017 (WebSci'17),\n  June 25-28, 2017, Troy, NY, USA. Based on the results of the thesis:\n  arXiv:1702.00829", "journal-ref": null, "doi": "10.1145/3091478.3091488", "report-no": null, "categories": "cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Previous research has shown the existence of gender biases in the depiction\nof professions and occupations in search engine results. Such an unbalanced\npresentation might just as likely occur on Wikipedia, one of the most popular\nknowledge resources on the Web, since the encyclopedia has already been found\nto exhibit such tendencies in past studies. Under this premise, our work\nassesses gender bias with respect to the content of German Wikipedia articles\nabout professions and occupations along three dimensions: used male vs. female\ntitles (and redirects), included images of persons, and names of professionals\nmentioned in the articles. We further use German labor market data to assess\nthe potential misrepresentation of a gender for each specific profession. Our\nfindings in fact provide evidence for systematic over-representation of men on\nall three dimensions. For instance, for professional fields dominated by\nfemales, the respective articles on average still feature almost two times more\nimages of men; and in the mean, 83% of the mentioned names of professionals\nwere male and only 17% female.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jun 2017 20:49:42 GMT"}], "update_date": "2018-02-04", "authors_parsed": [["Zagovora", "Olga", "", "1 and 2"], ["Flöck", "Fabian", "", "1 and 2"], ["Wagner", "Claudia", "", "1 and 2"]]}, {"id": "1706.03859", "submitter": "Carlos Ernesto Laciana", "authors": "Carlos E. Laciana, Gustavo Pereyra, Santiago L. Rovere", "title": "Size invariance sector for an agent-based innovation diffusion model", "comments": "10 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is shown that under certain conditions it is possible to model a complex\nsystem in a way that leads to results that do not depend on system size. As an\nexample of complex system an innovation diffusion model is considered. In that\nmodel a set of individuals (the agents), which are interconnected, must decide\nif adopt or not an innovation. The agents are connected in a member of the\nnetworks family known as small worlds networks (SWN). It is found that for a\nsubfamily of the SWN the saturation time and the form of the adoption curve are\ninvariants respect to the change in the size of the system.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jun 2017 21:27:17 GMT"}, {"version": "v2", "created": "Wed, 14 Jun 2017 16:49:57 GMT"}, {"version": "v3", "created": "Thu, 27 Jul 2017 17:44:23 GMT"}], "update_date": "2017-07-28", "authors_parsed": [["Laciana", "Carlos E.", ""], ["Pereyra", "Gustavo", ""], ["Rovere", "Santiago L.", ""]]}, {"id": "1706.03944", "submitter": "Julia Sidorova", "authors": "J. Sidorova, L. Skold, O. Rosander, L. Lundberg", "title": "Recommendations for Marketing Campaigns in Telecommunication Business\n  based on the footprint analysis", "comments": "conference", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A major investment made by a telecom operator goes into the infrastructure\nand its maintenance, while business revenues are proportional to how big and\ngood the customer base is. We present a data-driven analytic strategy based on\ncombinatorial optimization and analysis of historical data. The data cover\nhistorical mobility of the users in one region of Sweden during a week.\nApplying the proposed method to the case study, we have identified the optimal\nproportion of geo-demographic segments in the customer base, developed a\nfunctionality to assess the potential of a planned marketing campaign, and\nexplored the problem of an optimal number and types of the geo-demographic\nsegments to target through marketing campaigns. With the help of fuzzy logic,\nthe conclusions of data analysis are automatically translated into\ncomprehensible recommendations in a natural language.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jun 2017 08:08:11 GMT"}], "update_date": "2017-06-14", "authors_parsed": [["Sidorova", "J.", ""], ["Skold", "L.", ""], ["Rosander", "O.", ""], ["Lundberg", "L.", ""]]}, {"id": "1706.04047", "submitter": "Mikko Rinne", "authors": "Mikko Rinne, Mehrdad Bagheri, Tuukka Tolvanen", "title": "Automatic Recognition of Public Transport Trips from Mobile Device\n  Sensor Data and Transport Infrastructure Information", "comments": "22 pages, 7 figures, 10 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Automatic detection of public transport (PT) usage has important applications\nfor intelligent transport systems. It is crucial for understanding the\ncommuting habits of passengers at large and over longer periods of time. It\nalso enables compilation of door-to-door trip chains, which in turn can assist\npublic transport providers in improved optimisation of their transport\nnetworks. In addition, predictions of future trips based on past activities can\nbe used to assist passengers with targeted information. This article documents\na dataset compiled from a day of active commuting by a small group of people\nusing different means of PT in the Helsinki region. Mobility data was collected\nby two means: (a) manually written details of each PT trip during the day, and\n(b) measurements using sensors of travellers' mobile devices. The manual log is\nused to cross-check and verify the results derived from automatic measurements.\nThe mobile client application used for our data collection provides a fully\nautomated measurement service and implements a set of algorithms for decreasing\nbattery consumption. The live locations of some of the public transport\nvehicles in the region were made available by the local transport provider and\nsampled with a 30-second interval. The stopping times of local trains at\nstations during the day were retrieved from the railway operator. The static\ntimetable information of all the PT vehicles operating in the area is made\navailable by the transport provider, and linked to our dataset. The challenge\nis to correctly detect as many manually logged trips as possible by using the\nautomatically collected data. This paper includes an analysis of challenges due\nto missing or partially sampled information in the data, and initial results\nfrom automatic recognition using a set of algorithms. Improvement of correct\nrecognitions is left as an ongoing challenge.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jun 2017 13:19:43 GMT"}], "update_date": "2017-06-14", "authors_parsed": [["Rinne", "Mikko", ""], ["Bagheri", "Mehrdad", ""], ["Tolvanen", "Tuukka", ""]]}, {"id": "1706.04109", "submitter": "Fran Casino", "authors": "Fran Casino, Constantinos Patsakis, Antoni Martinez-Balleste, Frederic\n  Borras, Edgar Batista", "title": "Technical Report: Implementation and Validation of a Smart Health\n  Application", "comments": "4-page Tech Report", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.AI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this article, we explain in detail the internal structures and databases\nof a smart health application. Moreover, we describe how to generate a\nstatistically sound synthetic dataset using real-world medical data.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jun 2017 14:58:41 GMT"}], "update_date": "2017-06-14", "authors_parsed": [["Casino", "Fran", ""], ["Patsakis", "Constantinos", ""], ["Martinez-Balleste", "Antoni", ""], ["Borras", "Frederic", ""], ["Batista", "Edgar", ""]]}, {"id": "1706.04301", "submitter": "Akira Ishii Prof.", "authors": "Yasuko Kawahata, Takayuki Mizuno and Akira Ishii", "title": "Measurement of human activity using velocity GPS data obtained from\n  mobile phones", "comments": "9 pages, 8 figures, submitted to the 9th International Conference on\n  Social Informatics (SocInfo 2017) to Oxford, UK, in September 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.soc-ph cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Human movement is used as an indicator of human activity in modern society.\nThe velocity of moving humans is calculated based on position information\nobtained from mobile phones. The level of human activity, as recorded by\nvelocity, varies throughout the day. Therefore, velocity can be used to\nidentify the intervals of highest and lowest activity. More specifically, we\nobtained mobile-phone GPS data from the people around Shibuya station in Tokyo,\nwhich has the highest population density in Japan. From these data, we observe\nthat velocity tends to consistently increase with the changes in social\nactivities. For example, during the earthquake in Kumamoto Prefecture in April\n2016, the activity on that day was much lower than usual. In this research, we\nfocus on natural disasters such as earthquakes owing to their significant\neffects on human activities in developed countries like Japan. In the event of\na natural disaster in another developed country, considering the change in\nhuman behavior at the time of the disaster (e.g., the 2016 Kumamoto Great\nEarthquake) from the viewpoint of velocity allows us to improve our planning\nfor mitigation measures. Thus, we analyze the changes in human activity through\nvelocity calculations in Shibuya, Tokyo, and compare times of disasters with\nnormal times.\n", "versions": [{"version": "v1", "created": "Wed, 14 Jun 2017 02:46:16 GMT"}], "update_date": "2017-06-15", "authors_parsed": [["Kawahata", "Yasuko", ""], ["Mizuno", "Takayuki", ""], ["Ishii", "Akira", ""]]}, {"id": "1706.04595", "submitter": "Yoji Yamato", "authors": "Yoji Yamato, Yoshifumi Fukumoto and Hiroki Kumazaki", "title": "Security Camera Movie and ERP Data Matching System to Prevent Theft", "comments": "2 pages, 2 figures, IEEE Consumer Communications and Networking\n  Conference (CCNC2017), pp.1021-1022, Jan. 2017", "journal-ref": "IEEE Consumer Communications and Networking Conference (CCNC2017),\n  pp.1021-1022, Jan. 2017", "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we propose a SaaS service which prevents shoplifting using\nimage analysis and ERP. In Japan, total damage of shoplifting reaches 450\nbillion yen. Based on cloud and data analysis technology, we propose a\nshoplifting prevention service with image analysis of security camera and ERP\ndata check for small shops. We evaluated movie analysis.\n", "versions": [{"version": "v1", "created": "Mon, 12 Jun 2017 08:27:29 GMT"}, {"version": "v2", "created": "Tue, 20 Jun 2017 03:13:13 GMT"}], "update_date": "2018-09-20", "authors_parsed": [["Yamato", "Yoji", ""], ["Fukumoto", "Yoshifumi", ""], ["Kumazaki", "Hiroki", ""]]}, {"id": "1706.04722", "submitter": "Hung Cao", "authors": "Hung Cao and Monica Wachowicz", "title": "The design of a streaming analytical workflow for processing massive\n  transit feeds", "comments": "data ingestion, data contextualization, Hadoop MapReduce, transit\n  networks, streaming data analytics, mobility context. Present at the 2nd\n  International Symposium on Spatiotemporal Computing August 7-9 2017 at\n  Harvard University, Cambridge, Massachusetts", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.DC cs.DS", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Retrieving and analyzing transit feeds relies on working with analytical\nworkflows that can handle the massive volume of data streams that are relevant\nto understand the dynamics of transit networks which are entirely deterministic\nin the geographical space in which they takes place. In this paper, we consider\nthe fundamental issues in developing a streaming analytical workflow for\nanalyzing the continuous arrival of multiple, unbounded transit data feeds for\nautomatically processing and enriching them with additional information\ncontaining higher level concepts accordingly to a particular mobility context.\nThis workflow consists of three tasks: (1) stream data retrieval for creating\ntime windows; (2) data cleaning for handling missing data, overlap data or\nredundant data; and (3) data contextualization for computing actual arrival and\ndeparture times as well as the stops and moves during a bus trip, and also\nperforming mobility context computation. The workflow was implemented in a\nHadoop cloud ecosystem using data streams from the CODIAC Transit System of the\ncity of Moncton, NB. The Map() function of MapReduce is used to retrieve and\nbundle data streams into numerous clusters which are subsequently handled in a\nparallel manner by the Reduce() function in order to execute the data\ncontextualization step. The results validate the need for cloud computing for\nachieving high performance and scalability, however, due to the delay in\ncomputing and networking, it is clear that data cleaning tasks should not only\nbe deployed using a cloud environment, paving the way to combine it with fog\ncomputing in the near future.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jun 2017 02:23:51 GMT"}, {"version": "v2", "created": "Fri, 8 Jun 2018 16:36:17 GMT"}], "update_date": "2018-06-11", "authors_parsed": [["Cao", "Hung", ""], ["Wachowicz", "Monica", ""]]}, {"id": "1706.05011", "submitter": "Piotr Sapiezynski", "authors": "Anik\\'o Hann\\'ak, Piotr Sapie\\.zy\\'nski, Arash Molavi Khaki, David\n  Lazer, Alan Mislove, Christo Wilson", "title": "Measuring Personalization of Web Search", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Web search is an integral part of our daily lives. Recently, there has been a\ntrend of personalization in Web search, where different users receive different\nresults for the same search query. The increasing level of personalization is\nleading to concerns about Filter Bubble effects, where certain users are simply\nunable to access information that the search engines' algorithm decides is\nirrelevant. Despite these concerns, there has been little quantification of the\nextent of personalization in Web search today, or the user attributes that\ncause it.\n  In light of this situation, we make three contributions. First, we develop a\nmethodology for measuring personalization in Web search results. While\nconceptually simple, there are numerous details that our methodology must\nhandle in order to accurately attribute differences in search results to\npersonalization. Second, we apply our methodology to 200 users on Google Web\nSearch and 100 users on Bing. We find that, on average, 11.7% of results show\ndifferences due to personalization on Google, while 15.8% of results are\npersonalized on Bing, but that this varies widely by search query and by result\nranking. Third, we investigate the user features used to personalize on Google\nWeb Search and Bing. Surprisingly, we only find measurable personalization as a\nresult of searching with a logged in account and the IP address of the\nsearching user. Our results are a first step towards understanding the extent\nand effects of personalization on Web search engines today.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jun 2017 18:00:05 GMT"}], "update_date": "2017-06-19", "authors_parsed": [["Hannák", "Anikó", ""], ["Sapieżyński", "Piotr", ""], ["Khaki", "Arash Molavi", ""], ["Lazer", "David", ""], ["Mislove", "Alan", ""], ["Wilson", "Christo", ""]]}, {"id": "1706.05090", "submitter": "Pedro Saleiro", "authors": "Jo\\~ao Pereira, Arian Pasquali, Pedro Saleiro, Rosaldo Rossetti", "title": "Transportation in Social Media: an automatic classifier for\n  travel-related tweets", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the last years researchers in the field of intelligent transportation\nsystems have made several efforts to extract valuable information from social\nmedia streams. However, collecting domain-specific data from any social media\nis a challenging task demanding appropriate and robust classification methods.\nIn this work we focus on exploring geo-located tweets in order to create a\ntravel-related tweet classifier using a combination of bag-of-words and word\nembeddings. The resulting classification makes possible the identification of\ninteresting spatio-temporal relations in S\\~ao Paulo and Rio de Janeiro.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jun 2017 20:53:16 GMT"}], "update_date": "2017-06-19", "authors_parsed": [["Pereira", "João", ""], ["Pasquali", "Arian", ""], ["Saleiro", "Pedro", ""], ["Rossetti", "Rosaldo", ""]]}, {"id": "1706.05100", "submitter": "Piotr Sapiezynski", "authors": "Ioanna Psylla, Piotr Sapiezynski, Enys Mones, Sune Lehmann", "title": "The Role of Gender in Social Network Organization", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0189873", "report-no": null, "categories": "cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The digital traces we leave behind when engaging with the modern world offer\nan interesting lens through which we study behavioral patterns as expression of\ngender. Although gender differentiation has been observed in a number of\nsettings, the majority of studies focus on a single data stream in isolation.\nHere we use a dataset of high resolution data collected using mobile phones, as\nwell as detailed questionnaires, to study gender differences in a large cohort.\n  We consider mobility behavior and individual personality traits among a group\nof more than $800$ university students. We also investigate interactions among\nthem expressed via person-to-person contacts, interactions on online social\nnetworks, and telecommunication. Thus, we are able to study the differences\nbetween male and female behavior captured through a multitude of channels for a\nsingle cohort. We find that while the two genders are similar in a number of\naspects, there are robust deviations that include multiple facets of social\ninteractions, suggesting the existence of inherent behavioral differences.\nFinally, we quantify how aspects of an individual's characteristics and social\nbehavior reveals their gender by posing it as a classification problem. We ask:\nHow well can we distinguish between male and female study participants based on\nbehavior alone? Which behavioral features are most predictive?\n", "versions": [{"version": "v1", "created": "Thu, 15 Jun 2017 21:41:00 GMT"}], "update_date": "2018-02-07", "authors_parsed": [["Psylla", "Ioanna", ""], ["Sapiezynski", "Piotr", ""], ["Mones", "Enys", ""], ["Lehmann", "Sune", ""]]}, {"id": "1706.05143", "submitter": "Terrence Adams", "authors": "Terrence Adams", "title": "AI-Powered Social Bots", "comments": "2 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.AI cs.CY cs.MM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper gives an overview of impersonation bots that generate output in\none, or possibly, multiple modalities. We also discuss rapidly advancing areas\nof machine learning and artificial intelligence that could lead to\nfrighteningly powerful new multi-modal social bots. Our main conclusion is that\nmost commonly known bots are one dimensional (i.e., chatterbot), and far from\ndeceiving serious interrogators. However, using recent advances in machine\nlearning, it is possible to unleash incredibly powerful, human-like armies of\nsocial bots, in potentially well coordinated campaigns of deception and\ninfluence.\n", "versions": [{"version": "v1", "created": "Fri, 16 Jun 2017 04:54:47 GMT"}], "update_date": "2017-06-19", "authors_parsed": [["Adams", "Terrence", ""]]}, {"id": "1706.05254", "submitter": "Margaretha Gansterer", "authors": "Margaretha Gansterer and Richard F. Hartl", "title": "Collaborative vehicle routing: a survey", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.MA cs.AI cs.CY math.OC physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In horizontal collaborations, carriers form coalitions in order to perform\nparts of their logistics operations jointly. By exchanging transportation\nrequests among each other, they can operate more efficiently and in a more\nsustainable way. Collaborative vehicle routing has been extensively discussed\nin the literature. We identify three major streams of research: (i) centralized\ncollaborative planning, (ii) decentralized planning without auctions, and (ii)\nauction-based decentralized planning. For each of them we give a structured\noverview on the state of knowledge and discuss future research directions.\n", "versions": [{"version": "v1", "created": "Tue, 13 Jun 2017 20:21:00 GMT"}], "update_date": "2017-06-19", "authors_parsed": [["Gansterer", "Margaretha", ""], ["Hartl", "Richard F.", ""]]}, {"id": "1706.05288", "submitter": "Mohammad Hosseini", "authors": "Mohammad Hosseini, Yu Jiang, Ali Yekkehkhany, Richard R. Berlin, Lui\n  Sha", "title": "A Mobile Geo-Communication Dataset for Physiology-Aware DASH in Rural\n  Ambulance Transport", "comments": "Proceedings of the 8th ACM on Multimedia Systems Conference\n  (MMSys'17), Pages 158-163, Taipei, Taiwan, June 20 - 23, 2017", "journal-ref": null, "doi": "10.1145/3083187.3083211", "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Use of telecommunication technologies for remote, continuous monitoring of\npatients can enhance effectiveness of emergency ambulance care during transport\nfrom rural areas to a regional center hospital. However, the communication\nalong the various routes in rural areas may have wide bandwidth ranges from 2G\nto 4G; some regions may have only lower satellite bandwidth available.\nBandwidth fluctuation together with real-time communication of various clinical\nmultimedia pose a major challenge during rural patient ambulance transport.;\nAB@The availability of a pre-transport route-dependent communication bandwidth\ndatabase is an important resource in remote monitoring and clinical multimedia\ntransmission in rural ambulance transport. Here, we present a geo-communication\ndataset from extensive profiling of 4 major US mobile carriers in Illinois,\nfrom the rural location of Hoopeston to the central referral hospital center at\nUrbana. In collaboration with Carle Foundation Hospital, we developed a\nprofiler, and collected various geographical and communication traces for\nrealistic emergency rural ambulance transport scenarios. Our dataset is to\nsupport our ongoing work of proposing \"physiology-aware DASH\", which is\nparticularly useful for adaptive remote monitoring of critically ill patients\nin emergency rural ambulance transport. It provides insights on ensuring higher\nQuality of Service (QoS) for most critical clinical multimedia in response to\nchanges in patients' physiological states and bandwidth conditions. Our dataset\nis available online for research community.\n", "versions": [{"version": "v1", "created": "Fri, 16 Jun 2017 14:28:53 GMT"}], "update_date": "2017-06-19", "authors_parsed": [["Hosseini", "Mohammad", ""], ["Jiang", "Yu", ""], ["Yekkehkhany", "Ali", ""], ["Berlin", "Richard R.", ""], ["Sha", "Lui", ""]]}, {"id": "1706.05402", "submitter": "Ikuesan R. Adeyemi Mr.", "authors": "Ikuesan Richard Adeyemi, Shukor Abd Razak, Mazleena Salleh", "title": "A Conceptual Model for Holistic Classification of Insider", "comments": null, "journal-ref": "Asian J. Applied Sci., 7: 343-359 (2014)", "doi": "10.3923/ajaps.2014.343.359", "report-no": null, "categories": "cs.CY stat.AP", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  The process through which an insider to an organization can be described or\nclassified is lined within the orthodox paradigm of classification in which an\norganization considers only subject with requisite employee criterion as an\ninsider to that organization. This is further clouded with the relative\nrigidity in operational security policies being implemented in organizations.\nEstablishing investigation process in instances of misuse occurrence and or\nascertaining the efficiency of staff member using such archaic paradigm is\nmaligned with endless possibilities of uncertainties. This study, therefore,\nproposes a holistic model for which insider classification can be crystallized\nusing the combination of qualitative research process and analysis of moment\nstructure evaluation process. A full comprehension of this proposition could\nserve as a hinge through which insider misuse investigation can be thoroughly\ncarried out. In addition, integrating this paradigm into existing operational\nsecurity policies could serve as a metric upon which an organization can\nunderstand insider dynamics, in order to prevent misuses, and enhance staff\nmanagement.\n", "versions": [{"version": "v1", "created": "Fri, 16 Jun 2017 18:38:37 GMT"}], "update_date": "2017-06-20", "authors_parsed": [["Adeyemi", "Ikuesan Richard", ""], ["Razak", "Shukor Abd", ""], ["Salleh", "Mazleena", ""]]}, {"id": "1706.05432", "submitter": "Malte M\\\"oser", "authors": "Arvind Narayanan and Malte M\\\"oser", "title": "Obfuscation in Bitcoin: Techniques and Politics", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In the cryptographic currency Bitcoin, all transactions are recorded in the\nblockchain - a public, global, and immutable ledger. Because transactions are\npublic, Bitcoin and its users employ obfuscation to maintain a degree of\nfinancial privacy. Critically, and in contrast to typical uses of obfuscation,\nin Bitcoin obfuscation is not aimed against the system designer but is instead\nenabled by design. We map sixteen proposed privacy-preserving techniques for\nBitcoin on an obfuscation-vs.-cryptography axis, and find that those that are\nused in practice tend toward obfuscation. We argue that this has led to a\nbalance between privacy and regulatory acceptance.\n", "versions": [{"version": "v1", "created": "Fri, 16 Jun 2017 21:15:46 GMT"}, {"version": "v2", "created": "Thu, 29 Jun 2017 15:03:16 GMT"}], "update_date": "2017-06-30", "authors_parsed": [["Narayanan", "Arvind", ""], ["Möser", "Malte", ""]]}, {"id": "1706.05924", "submitter": "Manoel Horta Ribeiro", "authors": "Manoel Horta Ribeiro, Pedro H. Calais, Virg\\'ilio A. F. Almeida,\n  Wagner Meira Jr", "title": "\"Everything I Disagree With is #FakeNews\": Correlating Political\n  Polarization and Spread of Misinformation", "comments": "8 pages, 10 figures, to be presented at DS+J Workshop @ KDD'17", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An important challenge in the process of tracking and detecting the\ndissemination of misinformation is to understand the political gap between\npeople that engage with the so called \"fake news\". A possible factor\nresponsible for this gap is opinion polarization, which may prompt the general\npublic to classify content that they disagree or want to discredit as fake. In\nthis work, we study the relationship between political polarization and content\nreported by Twitter users as related to \"fake news\". We investigate how\npolarization may create distinct narratives on what misinformation actually is.\nWe perform our study based on two datasets collected from Twitter. The first\ndataset contains tweets about US politics in general, from which we compute the\ndegree of polarization of each user towards the Republican and Democratic\nParty. In the second dataset, we collect tweets and URLs that co-occurred with\n\"fake news\" related keywords and hashtags, such as #FakeNews and\n#AlternativeFact, as well as reactions towards such tweets and URLs. We then\nanalyze the relationship between polarization and what is perceived as\nmisinformation, and whether users are designating information that they\ndisagree as fake. Our results show an increase in the polarization of users and\nURLs associated with fake-news keywords and hashtags, when compared to\ninformation not labeled as \"fake news\". We discuss the impact of our findings\non the challenges of tracking \"fake news\" in the ongoing battle against\nmisinformation.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jun 2017 13:26:41 GMT"}, {"version": "v2", "created": "Mon, 17 Jul 2017 17:17:37 GMT"}], "update_date": "2017-07-18", "authors_parsed": [["Ribeiro", "Manoel Horta", ""], ["Calais", "Pedro H.", ""], ["Almeida", "Virgílio A. F.", ""], ["Meira", "Wagner", "Jr"]]}, {"id": "1706.06134", "submitter": "Lawrence Phillips", "authors": "Lawrence Phillips, Chase Dowling, Kyle Shaffer, Nathan Hodas and\n  Svitlana Volkova", "title": "Using Social Media to Predict the Future: A Systematic Literature Review", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Social media (SM) data provides a vast record of humanity's everyday\nthoughts, feelings, and actions at a resolution previously unimaginable.\nBecause user behavior on SM is a reflection of events in the real world,\nresearchers have realized they can use SM in order to forecast, making\npredictions about the future. The advantage of SM data is its relative ease of\nacquisition, large quantity, and ability to capture socially relevant\ninformation, which may be difficult to gather from other data sources.\nPromising results exist across a wide variety of domains, but one will find\nlittle consensus regarding best practices in either methodology or evaluation.\nIn this systematic review, we examine relevant literature over the past decade,\ntabulate mixed results across a number of scientific disciplines, and identify\ncommon pitfalls and best practices. We find that SM forecasting is limited by\ndata biases, noisy data, lack of generalizable results, a lack of\ndomain-specific theory, and underlying complexity in many prediction tasks. But\ndespite these shortcomings, recurring findings and promising results continue\nto galvanize researchers and demand continued investigation. Based on the\nexisting literature, we identify research practices which lead to success,\nciting specific examples in each case and making recommendations for best\npractices. These recommendations will help researchers take advantage of the\nexciting possibilities offered by SM platforms.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jun 2017 18:49:25 GMT"}], "update_date": "2017-06-21", "authors_parsed": [["Phillips", "Lawrence", ""], ["Dowling", "Chase", ""], ["Shaffer", "Kyle", ""], ["Hodas", "Nathan", ""], ["Volkova", "Svitlana", ""]]}, {"id": "1706.06253", "submitter": "Carlos Sarraute", "authors": "Carlos Sarraute, Jorge Brea, Javier Burroni, Klaus Wehmuth, Artur\n  Ziviani, J.I. Alvarez-Hamelin", "title": "Social Events in a Time-Varying Mobile Phone Graph", "comments": "Published in NetMob 2015 (Fourth Conference on the Scientific\n  Analysis of Mobile Phone Datasets), MIT Media Lab, Cambridge, USA, 8-10 April\n  2015", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.soc-ph", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The large-scale study of human mobility has been significantly enhanced over\nthe last decade by the massive use of mobile phones in urban populations.\nStudying the activity of mobile phones allows us, not only to infer social\nnetworks between individuals, but also to observe the movements of these\nindividuals in space and time. In this work, we investigate how these two\nrelated sources of information can be integrated within the context of\ndetecting and analyzing large social events. We show that large social events\ncan be characterized not only by an anomalous increase in activity of the\nantennas in the neighborhood of the event, but also by an increase in social\nrelationships of the attendants present in the event. Moreover, having detected\na large social event via increased antenna activity, we can use the network\nconnections to infer whether an unobserved user was present at the event. More\nprecisely, we address the following three challenges: (i) automatically\ndetecting large social events via increased antenna activity; (ii)\ncharacterizing the social cohesion of the detected event; and (iii) analyzing\nthe feasibility of inferring whether unobserved users were in the event.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jun 2017 03:19:33 GMT"}], "update_date": "2017-06-21", "authors_parsed": [["Sarraute", "Carlos", ""], ["Brea", "Jorge", ""], ["Burroni", "Javier", ""], ["Wehmuth", "Klaus", ""], ["Ziviani", "Artur", ""], ["Alvarez-Hamelin", "J. I.", ""]]}, {"id": "1706.06368", "submitter": "Carlos Castillo", "authors": "Meike Zehlike, Francesco Bonchi, Carlos Castillo, Sara Hajian, Mohamed\n  Megahed, Ricardo Baeza-Yates", "title": "FA*IR: A Fair Top-k Ranking Algorithm", "comments": "In Proceedings of the 26th ACM International Conference on\n  Information and Knowledge Management (CIKM'17). This version corrects an\n  error on Table 4", "journal-ref": null, "doi": "10.1145/3132847.3132938", "report-no": null, "categories": "cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this work, we define and solve the Fair Top-k Ranking problem, in which we\nwant to determine a subset of k candidates from a large pool of n >> k\ncandidates, maximizing utility (i.e., select the \"best\" candidates) subject to\ngroup fairness criteria. Our ranked group fairness definition extends group\nfairness using the standard notion of protected groups and is based on ensuring\nthat the proportion of protected candidates in every prefix of the top-k\nranking remains statistically above or indistinguishable from a given minimum.\n  Utility is operationalized in two ways: (i) every candidate included in the\ntop-$k$ should be more qualified than every candidate not included; and (ii)\nfor every pair of candidates in the top-k, the more qualified candidate should\nbe ranked above. An efficient algorithm is presented for producing the Fair\nTop-k Ranking, and tested experimentally on existing datasets as well as new\ndatasets released with this paper, showing that our approach yields small\ndistortions with respect to rankings that maximize utility without considering\nfairness criteria.\n  To the best of our knowledge, this is the first algorithm grounded in\nstatistical tests that can mitigate biases in the representation of an\nunder-represented group along a ranked list.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jun 2017 11:20:12 GMT"}, {"version": "v2", "created": "Mon, 4 Sep 2017 10:45:32 GMT"}, {"version": "v3", "created": "Mon, 2 Jul 2018 12:58:10 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Zehlike", "Meike", ""], ["Bonchi", "Francesco", ""], ["Castillo", "Carlos", ""], ["Hajian", "Sara", ""], ["Megahed", "Mohamed", ""], ["Baeza-Yates", "Ricardo", ""]]}, {"id": "1706.06535", "submitter": "Hung Cao", "authors": "Ikechukwu Maduako, Hung Cao, Lilian Hernandez, Monica Wachowicz", "title": "Combining edge and cloud computing for mobility analytics", "comments": "Edge Computing, Cloud Computing, Mobility Analytics, Internet of\n  Mobile Things, Edge Fog Fabric", "journal-ref": null, "doi": "10.1145/3132211.3132452", "report-no": null, "categories": "cs.DC cs.CY cs.NI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Mobility analytics using data generated from the Internet of Mobile Things\n(IoMT) is facing many challenges which range from the ingestion of data streams\ncoming from a vast number of fog nodes and IoMT devices to avoiding overflowing\nthe cloud with useless massive data streams that can trigger bottlenecks [1].\nManaging data flow is becoming an important part of the IoMT because it will\ndictate in which platform analytical tasks should run in the future. Data flows\nare usually a sequence of out-of-order tuples with a high data input rate, and\nmobility analytics requires a real-time flow of data in both directions, from\nthe edge to the cloud, and vice-versa. Before pulling the data streams to the\ncloud, edge data stream processing is needed for detecting missing, broken, and\nduplicated tuples in addition to recognize tuples whose arrival time is out of\norder. Analytical tasks such as data filtering, data cleaning and low-level\ndata contextualization can be executed at the edge of a network. In contrast,\nmore complex analytical tasks such as graph processing can be deployed in the\ncloud, and the results of ad-hoc queries and streaming graph analytics can be\npushed to the edge as needed by a user application. Graphs are efficient\nrepresentations used in mobility analytics because they unify knowledge about\nconnectivity, proximity and interaction among moving things. This poster\ndescribes the preliminary results from our experimental prototype developed for\nsupporting transit systems, in which edge and cloud computing are combined to\nprocess transit data streams forwarded from fog nodes into a cloud. The\nmotivation of this research is to understand how to perform meaningfulness\nmobility analytics on transit feeds by combining cloud and fog computing\narchitectures in order to improve fleet management, mass transit and remote\nasset monitoring\n", "versions": [{"version": "v1", "created": "Tue, 20 Jun 2017 16:18:07 GMT"}], "update_date": "2018-03-13", "authors_parsed": [["Maduako", "Ikechukwu", ""], ["Cao", "Hung", ""], ["Hernandez", "Lilian", ""], ["Wachowicz", "Monica", ""]]}, {"id": "1706.06690", "submitter": "Michael (Micky) Fire", "authors": "Michael Fire and Carlos Guestrin", "title": "The Rise and Fall of Network Stars: Analyzing 2.5 million graphs to\n  reveal how high-degree vertices emerge over time", "comments": "Keywords: Complex Systems; Dynamic Systems; Network Science; Big\n  Data; Complex Network Evolution; Network Datasets;Social Networks", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY physics.data-an physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Trends change rapidly in today's world, prompting this key question: What is\nthe mechanism behind the emergence of new trends? By representing real-world\ndynamic systems as complex networks, the emergence of new trends can be\nsymbolized by vertices that \"shine.\" That is, at a specific time interval in a\nnetwork's life, certain vertices become increasingly connected to other\nvertices. This process creates new high-degree vertices, i.e., network stars.\nThus, to study trends, we must look at how networks evolve over time and\ndetermine how the stars behave. In our research, we constructed the largest\npublicly available network evolution dataset to date, which contains 38,000\nreal-world networks and 2.5 million graphs. Then, we performed the first\nprecise wide-scale analysis of the evolution of networks with various scales.\nThree primary observations resulted: (a) links are most prevalent among\nvertices that join a network at a similar time; (b) the rate that new vertices\njoin a network is a central factor in molding a network's topology; and (c) the\nemergence of network stars (high-degree vertices) is correlated with\nfast-growing networks. We applied our learnings to develop a flexible\nnetwork-generation model based on large-scale, real-world data. This model\ngives a better understanding of how stars rise and fall within networks, and is\napplicable to dynamic systems both in nature and society.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jun 2017 22:28:49 GMT"}, {"version": "v2", "created": "Tue, 23 Jan 2018 14:04:39 GMT"}, {"version": "v3", "created": "Sat, 13 Oct 2018 18:55:27 GMT"}], "update_date": "2018-10-16", "authors_parsed": [["Fire", "Michael", ""], ["Guestrin", "Carlos", ""]]}, {"id": "1706.06701", "submitter": "Denis Parra", "authors": "Felipe del-Rio and Denis Parra and Jovan Kuzmicic and Erick Svec", "title": "Towards a Recommender System for Undergraduate Research", "comments": "3 pages, submitted to RecSys 2017 posters", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.IR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Several studies indicate that attracting students to research careers\nrequires to engage them from early undergraduate years. Following this\nparadigm, our Engineering School has developed an undergraduate research\nprogram that allows students to enroll in research in exchange for course\ncredits. Moreover, we developed a web portal to inform students about the\nprogram and the opportunities, but participation remains lower than expected.\nIn order to promote student engagement, we attempt to build a personalized\nrecommender system of research opportunities to undergraduates. With this goal\nin mind we investigate two tasks. First, one that identifies students that are\nmore willing to participate on this kind of program. A second task is\ngenerating a personalized list of recommendations of research opportunities for\neach student. To evaluate our approach, we perform a simulated prediction\nexperiment with data from our School, which has more than 4,000 active\nundergraduate students nowadays. Our results indicate that there is a big\npotential to create a personalized recommender system for this purpose. Our\nresults can be used as a baseline for colleges seeking strategies to encourage\nresearch activities within undergraduate students.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jun 2017 23:17:16 GMT"}], "update_date": "2017-06-22", "authors_parsed": [["del-Rio", "Felipe", ""], ["Parra", "Denis", ""], ["Kuzmicic", "Jovan", ""], ["Svec", "Erick", ""]]}, {"id": "1706.06734", "submitter": "Boleslaw Szymanski", "authors": "Xin Lin, Alaa Moussawi, Gyorgy Korniss, Jonathan Z. Bakdash, and\n  Boleslaw K. Szymanski", "title": "Limits of Risk Predictability in a Cascading Alternating Renewal Process\n  Model", "comments": "12 pages 6 figures", "journal-ref": "Scientific Reports 7, Article number: 6699 (2017)", "doi": "10.1038/s41598-017-06873-x", "report-no": null, "categories": "physics.soc-ph cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most risk analysis models systematically underestimate the probability and\nimpact of catastrophic events (e.g., economic crises, natural disasters, and\nterrorism) by not taking into account interconnectivity and interdependence of\nrisks. To address this weakness, we propose the Cascading Alternating Renewal\nProcess (CARP) to forecast interconnected global risks. However, assessments of\nthe model's prediction precision are limited by lack of sufficient ground truth\ndata. Here, we establish prediction precision as a function of input data size\nby using alternative long ground truth data generated by simulations of the\nCARP model with known parameters. We illustrate the approach on a model of\nfires in artificial cities assembled from basic city blocks with diverse\nhousing. The results confirm that parameter recovery variance exhibits power\nlaw decay as a function of the length of available ground truth data. Using\nCARP, we also demonstrate estimation using a disparate dataset that also has\ndependencies: real-world prediction precision for the global risk model based\non the World Economic Forum Global Risk Report. We conclude that the CARP model\nis an efficient method for predicting catastrophic cascading events with\npotential applications to emerging local and global interconnected risks.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jun 2017 04:06:46 GMT"}], "update_date": "2017-10-17", "authors_parsed": [["Lin", "Xin", ""], ["Moussawi", "Alaa", ""], ["Korniss", "Gyorgy", ""], ["Bakdash", "Jonathan Z.", ""], ["Szymanski", "Boleslaw K.", ""]]}, {"id": "1706.07140", "submitter": "Jieun Kim", "authors": "Jieun Kim and Christopher L. Magee", "title": "Dynamic patterns of knowledge flows across technological domains:\n  empirical results and link prediction", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY cs.DL physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The purpose of this study is to investigate the structure and evolution of\nknowledge spillovers across technological domains. Specifically, dynamic\npatterns of knowledge flow among 29 technological domains, measured by patent\ncitations for eight distinct periods, are identified and link prediction is\ntested for capability for forecasting the evolution in these cross-domain\npatent networks. The overall success of the predictions using the Katz metric\nimplies that there is a tendency to generate increased knowledge flows mostly\nwithin the set of previously linked technological domains. This study\ncontributes to innovation studies by characterizing the structural change and\nevolutionary behaviors in dynamic technology networks and by offering the basis\nfor predicting the emergence of future technological knowledge flows.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jun 2017 23:48:02 GMT"}], "update_date": "2017-06-23", "authors_parsed": [["Kim", "Jieun", ""], ["Magee", "Christopher L.", ""]]}, {"id": "1706.07196", "submitter": "Daniel M\\'endez Fern\\'andez", "authors": "Lutz Prechelt, Daniel Graziotin, Daniel M\\'endez Fern\\'andez", "title": "A Community's Perspective on the Status and Future of Peer Review in\n  Software Engineering", "comments": "14 pages, 4 figures. Accepted for publication, Open data at this url:\n  https://doi.org/10.6084/m9.figshare.5086357", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SE cs.CY cs.DL", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Context: Pre-publication peer review of scientific articles is considered a\nkey element of the research process in software engineering, yet it is often\nperceived as not to work fully well.\n  Objective: We aim at understanding the perceptions of and attitudes towards\npeer review of authors and reviewers at one of software engineering's most\nprestigious venues, the International Conference on Software Engineering\n(ICSE).\n  Method: We invited 932 ICSE 2014/15/16 authors and reviewers to participate\nin a survey with 10 closed and 9 open questions.\n  Results: We present a multitude of results, such as: Respondents perceive\nonly one third of all reviews to be good, yet one third as useless or\nmisleading; they propose double-blind or zero-blind reviewing regimes for\nimprovement; they would like to see showable proofs of (good) reviewing work be\nintroduced; attitude change trends are weak.\n  Conclusion: The perception of the current state of software engineering peer\nreview is fairly negative. Also, we found hardly any trend that suggests\nreviewing will improve by itself over time; the community will have to make\nexplicit efforts. Fortunately, our (mostly senior) respondents appear more open\nfor trying different peer reviewing regimes than we had expected.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 07:50:56 GMT"}, {"version": "v2", "created": "Mon, 30 Oct 2017 10:58:02 GMT"}], "update_date": "2017-10-31", "authors_parsed": [["Prechelt", "Lutz", ""], ["Graziotin", "Daniel", ""], ["Fernández", "Daniel Méndez", ""]]}, {"id": "1706.07202", "submitter": "Philipp Schaer", "authors": "Philipp Schaer", "title": "Living Labs - An Ethical Challenge for Researchers and Platform\n  Providers", "comments": "to appear in: Zimmer, M., & Kinder-Kurlanda, K. (Eds.): Internet\n  Research Ethics for the Social Age: New Challenges, Cases, and Contexts.\n  Peter Lang (2017)", "journal-ref": null, "doi": "10.3726/b11077", "report-no": null, "categories": "cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The infamous Facebook emotion contagion experiment is one of the most\nprominent and best-known online experiments based on the concept of what we\nhere call \"living labs\". In these kinds of experiments, real-world applications\nsuch as social web platforms trigger experimental switches inside their system\nto present experimental changes to their users - most of the time without the\nusers being aware of their role as virtual guinea pigs. In the Facebook example\nthe researches changed the way users' personal timeline was compiled to test\nthe influence on the users' moods and feelings. The reactions to these\nexperiments showed the inherent ethical issues such living labs settings bring\nup, mainly the study's lack of informed consent procedures, as well as a more\ngeneral critique of the flaws in the experimental design.\n  In this chapter, we describe additional use cases: The so-called living labs\nthat focus on experimentation with information systems such as search engines\nand wikis and especially on their real-world usage. The living labs paradigm\nallows researchers to conduct research in real-world environments or systems.\nIn the field of information science and especially information retrieval -\nwhich is the scientific discipline that is concerned with the research of\nsearch engines, information systems, and search related algorithms and\ntechniques - it is still common practice to perform in vitro or offline\nevaluations using static test collections. Living labs are widely unknown or\nunavailable to academic researchers in these fields. A main benefit of living\nlabs is their potential to offer new ways and possibilities to experiment with\ninformation systems and especially their users, but on the other hand they\nintroduce a whole set of ethical issues that we would like to address in this\nchapter.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 08:09:34 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Schaer", "Philipp", ""]]}, {"id": "1706.07332", "submitter": "Maximilian Alexander W\\\"achter", "authors": "Maximilian Alexander W\\\"achter, Anja Faulhaber, Felix Blind, Silja\n  Timm, Anke Dittmer, Leon Ren\\'e S\\\"utfeld, Achim Stephan, Gordon Pipa, Peter\n  K\\\"onig", "title": "Human decisions in moral dilemmas are largely described by\n  Utilitarianism: virtual car driving study provides guidelines for ADVs", "comments": "24 pages, 7 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Ethical thought experiments such as the trolley dilemma have been\ninvestigated extensively in the past, showing that humans act in a utilitarian\nway, trying to cause as little overall damage as possible. These trolley\ndilemmas have gained renewed attention over the past years; especially due to\nthe necessity of implementing moral decisions in autonomous driving vehicles.\nWe conducted a set of experiments in which participants experienced modified\ntrolley dilemmas as the driver in a virtual reality environment. Participants\nhad to make decisionsbetween two discrete options: driving on one of two lanes\nwhere different obstacles came into view. Obstacles included a variety of\nhuman-like avatars of different ages and group sizes. Furthermore, we tested\nthe influence of a sidewalk as a potential safe harbor and a condition\nimplicating a self-sacrifice. Results showed that subjects, in general, decided\nin a utilitarian manner, sparing the highest number of avatars possible with a\nlimited influence of the other variables. Our findings support that human\nbehavior is in line with the utilitarian approach to moral decision making.\nThis may serve as a guideline for the implementation of moral decisions in\nADVs.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 14:10:39 GMT"}, {"version": "v2", "created": "Fri, 23 Jun 2017 14:12:37 GMT"}], "update_date": "2017-06-26", "authors_parsed": [["Wächter", "Maximilian Alexander", ""], ["Faulhaber", "Anja", ""], ["Blind", "Felix", ""], ["Timm", "Silja", ""], ["Dittmer", "Anke", ""], ["Sütfeld", "Leon René", ""], ["Stephan", "Achim", ""], ["Pipa", "Gordon", ""], ["König", "Peter", ""]]}, {"id": "1706.07363", "submitter": "Mary Ann Weitnauer", "authors": "Mary Ann Weitnauer, Jennifer Rexford, Nicholas Laneman, Matthieu\n  Bloch, Santiago Griljava, Catherine Ross, and Gee-Kung Chang", "title": "Smart Wireless Communication is the Cornerstone of Smart Infrastructures", "comments": "A Computing Community Consortium (CCC) white paper, 5 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Emerging smart infrastructures, such as Smart City, Smart Grid, Smart Health,\nand Smart Transportation, need smart wireless connectivity. However, the\nrequirements of these smart infrastructures cannot be met with today's wireless\nnetworks. A new wireless infrastructure is needed to meet unprecedented needs\nin terms of agility, reliability, security, scalability, and partnerships.\n  We are at the beginning of a revolution in how we live with technology,\nresulting from a convergence of machine learning (ML), the Internet-of-Things\n(IoT), and robotics. A smart infrastructure monitors and processes a vast\namount of data, collected from a dense and wide distribution of heterogeneous\nsensors (e.g., the IoT), as well as from web applications like social media. In\nreal time, using machine learning, patterns and relationships in the data over\nspace, time, and application can be detected and predictions can be made; on\nthe basis of these, resources can be managed, decisions can be made, and\ndevices can be actuated to optimize metrics, such as cost, health, safety, and\nconvenience.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 15:19:16 GMT"}], "update_date": "2017-06-23", "authors_parsed": [["Weitnauer", "Mary Ann", ""], ["Rexford", "Jennifer", ""], ["Laneman", "Nicholas", ""], ["Bloch", "Matthieu", ""], ["Griljava", "Santiago", ""], ["Ross", "Catherine", ""], ["Chang", "Gee-Kung", ""]]}, {"id": "1706.07597", "submitter": "Brian Pickering", "authors": "Paul Walland and J. Brian Pickering", "title": "Mediated behavioural change in human-machine networks: exploring network\n  characteristics, trust and motivation", "comments": "Paper submitted to SocInfo, organised by the Oxford Internet\n  Institute, September 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Human-machine networks pervade much of contemporary life. Network change is\nthe product of structural modifications along with differences in participant\nbe-havior. If we assume that behavioural change in a human-machine network is\nthe result of changing the attitudes of participants in the network, then the\nquestion arises whether network structure can affect participant attitude.\nTaking citizen par-ticipation as an example, engagement with relevant\nstakeholders reveals trust and motivation to be the major objectives for the\nnetwork. Using a typology to de-scribe network state based on multiple\ncharacteristic or dimensions, we can pre-dict possible behavioural outcomes in\nthe network. However, this has to be medi-ated via attitude change. Motivation\nfor the citizen participation network can only increase in line with enhanced\ntrust. The focus for changing network dynamics, therefore, shifts to the\ndimensional changes needed to encourage increased trust. It turns out that the\ncoordinated manipulation of multiple dimensions is needed to bring about the\ndesired shift in attitude.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jun 2017 08:33:21 GMT"}], "update_date": "2017-06-26", "authors_parsed": [["Walland", "Paul", ""], ["Pickering", "J. Brian", ""]]}, {"id": "1706.07643", "submitter": "Tobias Kuhn", "authors": "Benjamin Timmermans, Tobias Kuhn, Kaspar Beelen, Lora Aroyo", "title": "Computational Controversy", "comments": "In Proceedings of the 9th International Conference on Social\n  Informatics (SocInfo) 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Climate change, vaccination, abortion, Trump: Many topics are surrounded by\nfierce controversies. The nature of such heated debates and their elements have\nbeen studied extensively in the social science literature. More recently,\nvarious computational approaches to controversy analysis have appeared, using\nnew data sources such as Wikipedia, which help us now better understand these\nphenomena. However, compared to what social sciences have discovered about such\ndebates, the existing computational approaches mostly focus on just a few of\nthe many important aspects around the concept of controversies. In order to\nlink the two strands, we provide and evaluate here a controversy model that is\nboth, rooted in the findings of the social science literature and at the same\ntime strongly linked to computational methods. We show how this model can lead\nto computational controversy analytics that have full coverage over all the\ncrucial aspects that make up a controversy.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jun 2017 11:41:06 GMT"}, {"version": "v2", "created": "Wed, 30 Aug 2017 09:35:05 GMT"}], "update_date": "2017-08-31", "authors_parsed": [["Timmermans", "Benjamin", ""], ["Kuhn", "Tobias", ""], ["Beelen", "Kaspar", ""], ["Aroyo", "Lora", ""]]}, {"id": "1706.07748", "submitter": "Nalin Asanka Gamagedara Arachchilage", "authors": "Nalin Asanka Gamagedara Arachchilage and Mumtaz Abdul Hameed", "title": "Integrating self-efficacy into a gamified approach to thwart phishing\n  attacks", "comments": "6 pages, 3 figures, 5th International Conference on Cybercrime and\n  Computer Forensics (ICCCF), IEEE, Sofitel Gold Coast Broadbeach on 16-18 July\n  2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Security exploits can include cyber threats such as computer programs that\ncan disturb the normal behavior of computer systems (viruses), unsolicited\ne-mail (spam), malicious software (malware), monitoring software (spyware),\nattempting to make computer resources unavailable to their intended users\n(Distributed Denial-of-Service or DDoS attack), the social engineering, and\nonline identity theft (phishing). One such cyber threat, which is particularly\ndangerous to computer users is phishing. Phishing is well known as online\nidentity theft, which targets to steal victims' sensitive information such as\nusername, password and online banking details. This paper focuses on designing\nan innovative and gamified approach to educate individuals about phishing\nattacks. The study asks how one can integrate self-efficacy, which has a\nco-relation with the user's knowledge, into an anti-phishing educational game\nto thwart phishing attacks? One of the main reasons would appear to be a lack\nof user knowledge to prevent from phishing attacks. Therefore, this research\ninvestigates the elements that influence (in this case, either conceptual or\nprocedural knowledge or their interaction effect) and then integrate them into\nan anti-phishing educational game to enhance people's phishing prevention\nbehaviour through their motivation.\n", "versions": [{"version": "v1", "created": "Fri, 23 Jun 2017 15:31:42 GMT"}], "update_date": "2017-06-26", "authors_parsed": [["Arachchilage", "Nalin Asanka Gamagedara", ""], ["Hameed", "Mumtaz Abdul", ""]]}, {"id": "1706.07911", "submitter": "Yi Zhu", "authors": "Yi Zhu, Sen Liu, Shawn Newsam", "title": "Large-Scale Mapping of Human Activity using Geo-Tagged Videos", "comments": "Accepted at ACM SIGSPATIAL 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CV cs.CY cs.MM cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper is the first work to perform spatio-temporal mapping of human\nactivity using the visual content of geo-tagged videos. We utilize a recent\ndeep-learning based video analysis framework, termed hidden two-stream\nnetworks, to recognize a range of activities in YouTube videos. This framework\nis efficient and can run in real time or faster which is important for\nrecognizing events as they occur in streaming video or for reducing latency in\nanalyzing already captured video. This is, in turn, important for using video\nin smart-city applications. We perform a series of experiments to show our\napproach is able to accurately map activities both spatially and temporally. We\nalso demonstrate the advantages of using the visual content over the\ntags/titles.\n", "versions": [{"version": "v1", "created": "Sat, 24 Jun 2017 05:59:37 GMT"}, {"version": "v2", "created": "Sat, 1 Jul 2017 18:24:56 GMT"}, {"version": "v3", "created": "Tue, 28 Nov 2017 19:05:37 GMT"}], "update_date": "2017-11-30", "authors_parsed": [["Zhu", "Yi", ""], ["Liu", "Sen", ""], ["Newsam", "Shawn", ""]]}, {"id": "1706.07972", "submitter": "Didier A. Vega-Oliveros", "authors": "Didier A. Vega-Oliveros, Lilian Berton, Federico Vazquez, Francisco A.\n  Rodrigues", "title": "The Impact of Social Curiosity on Information Spreading on Networks", "comments": "8 pages, 5 figures", "journal-ref": null, "doi": "10.1145/3110025.3110039", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Most information spreading models consider that all individuals are identical\npsychologically. They ignore, for instance, the curiosity level of people,\nwhich may indicate that they can be influenced to seek for information given\ntheir interest. For example, the game Pok\\'emon GO spread rapidly because of\nthe aroused curiosity among users. This paper proposes an information\npropagation model considering the curiosity level of each individual, which is\na dynamical parameter that evolves over time. We evaluate the efficiency of our\nmodel in contrast to traditional information propagation models, like SIR or\nIC, and perform analysis on different types of artificial and real-world\nnetworks, like Google+, Facebook, and the United States roads map. We present a\nmean-field approach that reproduces with a good accuracy the evolution of\nmacroscopic quantities, such as the density of stiflers, for the system's\nbehavior with the curiosity. We also obtain an analytical solution of the\nmean-field equations that allows to predicts a transition from a phase where\nthe information remains confined to a small number of users to a phase where it\nspreads over a large fraction of the population. The results indicate that the\ncuriosity increases the information spreading in all networks as compared with\nthe spreading without curiosity, and that this increase is larger in spatial\nnetworks than in social networks. When the curiosity is taken into account, the\nmaximum number of informed individuals is reached close to the transition\npoint. Since curious people are more open to a new product, concepts, and\nideas, this is an important factor to be considered in propagation modeling.\nOur results contribute to the understanding of the interplay between diffusion\nprocess and dynamical heterogeneous transmission in social networks.\n", "versions": [{"version": "v1", "created": "Sat, 24 Jun 2017 15:20:12 GMT"}], "update_date": "2017-06-27", "authors_parsed": [["Vega-Oliveros", "Didier A.", ""], ["Berton", "Lilian", ""], ["Vazquez", "Federico", ""], ["Rodrigues", "Francisco A.", ""]]}, {"id": "1706.08043", "submitter": "Ali Dehghantanha", "authors": "Lek Christopher, Kim-Kwang Raymond Choo, Ali Dehghantanha", "title": "Honeypots for employee information security awareness and education\n  training: A conceptual EASY training model", "comments": "20pages, book chapter", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CR cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The increasing pervasiveness of internet-connected systems means that such\nsystems will continue to be exploited for criminal purposes by cybercriminals\n(including malicious insiders such as employees and vendors). The importance of\nprotecting corporate system and intellectual property, and the escalating\ncomplexities of the online environment underscore the need for ongoing\ninformation security awareness and education training and the promotion of a\nculture of security among employees. Two honeypots were deployed at a private\nuniversity based in Singapore. Findings from the analysis of the honeypot data\nare presented in this paper. This paper then examines how analysis of honeypot\ndata can be used in employee information security awareness and education\ntraining. Adapting the Routine Activity Theory, a criminology theory widely\nused in the study of cybercrime, this paper proposes a conceptual Engaging\nStakeholders, Acceptable Behavior, Simple Teaching method, Yardstick (EASY)\ntraining model, and explains how the model can be used to design employee\ninformation security awareness and education training. Future research\ndirections are also outlined in this paper.\n", "versions": [{"version": "v1", "created": "Sun, 25 Jun 2017 07:08:38 GMT"}], "update_date": "2017-06-27", "authors_parsed": [["Christopher", "Lek", ""], ["Choo", "Kim-Kwang Raymond", ""], ["Dehghantanha", "Ali", ""]]}, {"id": "1706.08436", "submitter": "Juan Garcia Torres", "authors": "Juan Garcia-Torres, Diana Caro-Prieto", "title": "Image Processing in Floriculture Using a robotic Mobile Platform", "comments": "4 Pages, Paper made at Fundacion Universitaria Agraria de Colombia", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.CV", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Colombia has a privileged geographical location which makes it a cornerstone\nand equidistant point to all regional markets. The country has a great\necological diversity and it is one of the largest suppliers of flowers for US.\nColombian flower companies have made innovations in the marketing process,\nusing methods to reach all conditions for final consumers. This article\ndevelops a monitoring system for floriculture industries. The system was\nimplemented in a robotic platform. This device has the ability to be programmed\nin different programming languages. The robot takes the necessary environment\ninformation from its camera. The algorithm of the monitoring system was\ndeveloped with the image processing toolbox on Matlab. The implemented\nalgorithm acquires images through its camera, it performs a preprocessing of\nthe image, noise filter, enhancing of the color and adjusting the dimension in\norder to increase processing speed. Then, the image is segmented by color and\nwith the binarized version of the image using morphological operations (erosion\nand dilation), extract relevant features such as centroid, perimeter and area.\nThe data obtained from the image processing helps the robot with the automatic\nidentification of objectives, orientation and move towards them. Also, the\nresults generate a diagnostic quality of each object scanned.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jun 2017 15:21:44 GMT"}], "update_date": "2017-06-27", "authors_parsed": [["Garcia-Torres", "Juan", ""], ["Caro-Prieto", "Diana", ""]]}, {"id": "1706.08519", "submitter": "Ruofei Zhao", "authors": "Ya'acov Ritov, Yuekai Sun, Ruofei Zhao", "title": "On conditional parity as a notion of non-discrimination in machine\n  learning", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "stat.ML cs.CY cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We identify conditional parity as a general notion of non-discrimination in\nmachine learning. In fact, several recently proposed notions of\nnon-discrimination, including a few counterfactual notions, are instances of\nconditional parity. We show that conditional parity is amenable to statistical\nanalysis by studying randomization as a general mechanism for achieving\nconditional parity and a kernel-based test of conditional parity.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jun 2017 17:41:20 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Ritov", "Ya'acov", ""], ["Sun", "Yuekai", ""], ["Zhao", "Ruofei", ""]]}, {"id": "1706.08597", "submitter": "Luis Ceze", "authors": "Luis Ceze, Mark D. Hill, Karthikeyan Sankaralingam, and Thomas F.\n  Wenisch", "title": "Democratizing Design for Future Computing Platforms", "comments": "A Computing Community Consortium (CCC) white paper, 4 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Information and communications technology can continue to change our world.\nThese advances will partially depend upon designs that synergistically combine\nsoftware with specialized hardware. Today open-source software incubates rapid\nsoftware-only innovation. The government can unleash software-hardware\ninnovation with programs to develop open hardware components, tools, and design\nflows that simplify and reduce the cost of hardware design. Such programs will\nspeed development for startup companies, established industry leaders,\neducation, scientific research, and for government intelligence and defense\nplatforms.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jun 2017 21:10:03 GMT"}], "update_date": "2017-06-28", "authors_parsed": [["Ceze", "Luis", ""], ["Hill", "Mark D.", ""], ["Sankaralingam", "Karthikeyan", ""], ["Wenisch", "Thomas F.", ""]]}, {"id": "1706.09094", "submitter": "Rommel Salas", "authors": "Rommel Salas", "title": "Antropologia de la Informatica Social: Teoria de la Convergencia\n  Tecno-Social", "comments": "in Spanish", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  The traditional humanism of the twentieth century, inspired by the culture of\nthe book, systematically distanced itself from the new society of digital\ninformation; the Internet and tools of information processing revolutionized\nthe world, society during this period developed certain adaptive\ncharacteristics based on coexistence (Human - Machine), this transformation\nsets based on the impact of three technology segments: devices, applications\nand infrastructure of social communication, which are involved in various\nphysical, behavioural and cognitive changes of the human being; and the\nemergence of new models of influence and social control through the new\nubiquitous communication; however in this new process of conviviality new\nmodels like the \"collaborative thinking\" and \"InfoSharing\" develop; managing\nsocial information under three Human ontological dimensions (h) - Information\n(i) - Machine (m), which is the basis of a new physical-cyber ecosystem, where\nthey coexist and develop new social units called \"virtual communities \". This\nnew communication infrastructure and social management of information given\ndiscovered areas of vulnerability \"social perspective of risk\", impacting all\nsocial units through massive impact vector (i); The virtual environment \"H + i\n+ M\"; and its components, as well as the life cycle management of social\ninformation allows us to understand the path of integration \"Techno - Social\"\nand setting a new contribution to cybernetics, within the convergence of\ntechnology with society and the new challenges of coexistence, aimed at a new\nholistic and not pragmatic vision, as the human component (h) in the virtual\nenvironment is the precursor of the future and needs to be studied not as an\napplication, but as the hub of a new society.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jun 2017 01:29:57 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Salas", "Rommel", ""]]}, {"id": "1706.09096", "submitter": "Rommel Salas", "authors": "Rommel Salas", "title": "Modelo de Aprendizaje Biocibernetico BLM", "comments": "in Spanish", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Education in the digital period in which we live, is reaching challenges\nnever before seen, preceded by phenomena that involve not only traditional\nsocial units, but also new virtual communities; Innovating is difficult, it is\na challenge, however, we must think of new teaching methods that impact the\ncurrent generation of students, who arrive with new needs and expectations. The\nconstruction of knowledge from the subject and the virtual world that surrounds\nit, establishes the basis for the development of a new model of teaching, where\nthe classroom is the particular representation of a new physical-cybernetic\necosystem composed of the three large dimensions. Which are part of this new\ntechno-social convergence (human - information - machine); Allowing an\ninterrelation between the student, information, machine and the teacher; Using\nBiocybernetic methods of influence, control and replication, by means of the\nmassive impact vector (i); In addition, the development of new strategies\nassisted by cybernetics and the updating of academic content according to the\nnew teaching environment. Hence the importance of this study, which leads us to\nthe need for a new model of transforming academic instruction, which is not\nbased on a conglomerate of technological tools, but establishes a new\neducational and transformative model, based on \"Collaborative Thinking\" and the\nubiquity of information, thus establishing the relationship between the subject\nand object of study, thus allowing us to establish the new Biocybernetic\neducational paradigm in the digital period.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jun 2017 01:47:37 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Salas", "Rommel", ""]]}, {"id": "1706.09243", "submitter": "Biswarup Bhattacharya", "authors": "Somnath Basu Roy Chowdhury, Biswarup Bhattacharya, Sumit Agarwal", "title": "Location Optimization of ATM Networks", "comments": "5 pages; 2 figures; 2 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  ATMs enable the public to perform financial transactions. Banks try to\nstrategically position their ATMs in order to maximize transactions and\nrevenue. In this paper, we introduce a model which provides a score to an ATM\nlocation, which serves as an indicator of its relative likelihood of\ntransactions. In order to efficiently capture the spatially dynamic features,\nwe utilize two concurrent prediction models: the local model which encodes the\nspatial variance by considering highly energetic features in a given location,\nand the global model which enforces the dominant trends in the entire data and\nserves as a feedback to the local model to prevent overfitting. The major\nchallenge in learning the model parameters is the lack of an objective\nfunction. The model is trained using a synthetic objective function using the\ndominant features returned from the k-means clustering algorithm in the local\nmodel. The results obtained from the energetic features using the models are\nencouraging.\n", "versions": [{"version": "v1", "created": "Mon, 26 Jun 2017 05:24:48 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Chowdhury", "Somnath Basu Roy", ""], ["Bhattacharya", "Biswarup", ""], ["Agarwal", "Sumit", ""]]}, {"id": "1706.09244", "submitter": "Juste Raimbault", "authors": "Juste Raimbault", "title": "An Applied Knowledge Framework to Study Complex Systems", "comments": "13 pages, 2 figures. Forthcoming in CSD&M2017 proceedings", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The complexity of knowledge production on complex systems is well-known, but\nthere still lacks knowledge framework that would both account for a certain\nstructure of knowledge production at an epistemological level and be directly\napplicable to the study and management of complex systems. We set a basis for\nsuch a framework, by first analyzing in detail a case study of the construction\nof a geographical theory of complex territorial systems, through mixed methods,\nnamely qualitative interview analysis and quantitative citation network\nanalysis. We can therethrough inductively build a framework that considers\nknowledge entreprises as perspectives, with co-evolving components within\ncomplementary knowledge domains. We finally discuss potential applications and\ndevelopments.\n", "versions": [{"version": "v1", "created": "Thu, 22 Jun 2017 19:08:50 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Raimbault", "Juste", ""]]}, {"id": "1706.09245", "submitter": "Valentin Kassarnig", "authors": "Valentin Kassarnig, Enys Mones, Andreas Bjerre-Nielsen, Piotr\n  Sapiezynski, David Dreyer Lassen, Sune Lehmann", "title": "Academic Performance and Behavioral Patterns", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Identifying the factors that influence academic performance is an essential\npart of educational research. Previous studies have documented the importance\nof personality traits, class attendance, and social network structure. Because\nmost of these analyses were based on a single behavioral aspect and/or small\nsample sizes, there is currently no quantification of the interplay of these\nfactors. Here, we study the academic performance among a cohort of 538\nundergraduate students forming a single, densely connected social network. Our\nwork is based on data collected using smartphones, which the students used as\ntheir primary phones for two years. The availability of multi-channel data from\na single population allows us to directly compare the explanatory power of\nindividual and social characteristics. We find that the most informative\nindicators of performance are based on social ties and that network indicators\nresult in better model performance than individual characteristics (including\nboth personality and class attendance). We confirm earlier findings that class\nattendance is the most important predictor among individual characteristics.\nFinally, our results suggest the presence of strong homophily and/or peer\neffects among university students.\n", "versions": [{"version": "v1", "created": "Wed, 21 Jun 2017 11:15:01 GMT"}, {"version": "v2", "created": "Mon, 9 Apr 2018 12:04:07 GMT"}], "update_date": "2018-04-10", "authors_parsed": [["Kassarnig", "Valentin", ""], ["Mones", "Enys", ""], ["Bjerre-Nielsen", "Andreas", ""], ["Sapiezynski", "Piotr", ""], ["Lassen", "David Dreyer", ""], ["Lehmann", "Sune", ""]]}, {"id": "1706.09247", "submitter": "Saurabh Bagchi", "authors": "Naixing Wang, Edgardo Barsallo Yi, Saurabh Bagchi", "title": "On Reliability of Android Wearable Health Devices", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Wearable devices are increasingly being used for monitoring health signals\nand for fitness purposes with typical uses being calorie tracker, workout\nassistant, and step counter. Even though these wearables can measure many\nhealth signals (e.g. heart rate), they are still not perceived as highly\naccurate, relative to clinical monitoring devices. In this paper, we\ninvestigate the accuracy of heart monitor as included in two popular wearables\nMotorola Moto 360 and the Apple Watch. We analyze the accuracy from a hardware\nand a software perspective and show the effects of body motion on the heart\nrate monitors based on the use of photoplethysmography (PPG) signals used in\nAndroid wearables. We then do a software reliability study of the Android Wear\nOS, on which many wearables are based, using fuzz testing.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jun 2017 16:34:05 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Wang", "Naixing", ""], ["Yi", "Edgardo Barsallo", ""], ["Bagchi", "Saurabh", ""]]}, {"id": "1706.09248", "submitter": "Claudia Schulz", "authors": "Timothy Yuen, Maritz Reyes and Yuanlin Zhang", "title": "Logic Programming for an Introductory Computer Science Course for High\n  School Students", "comments": "Proceedings of the 2nd International Workshop on User-Oriented Logic\n  Paradigms (IULP 2017), Editors: Claudia Schulz and Stefan Ellmauthaler", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper investigates how high school students approach computing through\nan introductory computer science course situated in the Logic Programming (LP)\nparadigm. This study shows how novice students operate within the LP paradigm\nwhile engaging in foundational computing concepts and skills, and presents a\ncase for LP as a viable paradigm choice for introductory CS courses.\n", "versions": [{"version": "v1", "created": "Tue, 20 Jun 2017 12:18:33 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Yuen", "Timothy", ""], ["Reyes", "Maritz", ""], ["Zhang", "Yuanlin", ""]]}, {"id": "1706.09249", "submitter": "Michael Veale", "authors": "Michael Veale", "title": "Logics and practices of transparency and opacity in real-world\n  applications of public sector machine learning", "comments": "5 pages, 0 figures, presented as a talk at the 2017 Workshop on\n  Fairness, Accountability, and Transparency in Machine Learning (FAT/ML 2017),\n  Halifax, Canada, August 14, 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine learning systems are increasingly used to support public sector\ndecision-making across a variety of sectors. Given concerns around\naccountability in these domains, and amidst accusations of intentional or\nunintentional bias, there have been increased calls for transparency of these\ntechnologies. Few, however, have considered how logics and practices concerning\ntransparency have been understood by those involved in the machine learning\nsystems already being piloted and deployed in public bodies today. This short\npaper distils insights about transparency on the ground from interviews with 27\nsuch actors, largely public servants and relevant contractors, across 5 OECD\ncountries. Considering transparency and opacity in relation to trust and\nbuy-in, better decision-making, and the avoidance of gaming, it seeks to\nprovide useful insights for those hoping to develop socio-technical approaches\nto transparency that might be useful to practitioners on-the-ground.\n  An extended, archival version of this paper is available as Veale M., Van\nKleek M., & Binns R. (2018). `Fairness and accountability design needs for\nalgorithmic support in high-stakes public sector decision-making' Proceedings\nof the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18),\nhttp://doi.org/10.1145/3173574.3174014.\n", "versions": [{"version": "v1", "created": "Mon, 19 Jun 2017 16:32:20 GMT"}, {"version": "v2", "created": "Thu, 6 Jul 2017 08:46:37 GMT"}, {"version": "v3", "created": "Mon, 5 Nov 2018 09:56:12 GMT"}], "update_date": "2018-11-06", "authors_parsed": [["Veale", "Michael", ""]]}, {"id": "1706.09266", "submitter": "Cristina Turcu", "authors": "Cristina Elena Turcu, Corneliu Octavian Turcu, Evelyne Graur", "title": "A Web-based Application for the Management of Seminar Assignments", "comments": "The Second International Scientific and Practical Conference \"Modern\n  Trends in Using Computer Techniques in Teaching Foreign Languages\", 2004,\n  Luhansk, Ukraine, Pag: 51-58", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Seminar activities never occur randomly or in a vacuum. Carefully planned and\nwell-organized thematically, they allow both undergraduates and graduates to\nexplore in (more) detail various subject areas of particular interest to every\nindividual or group. Discussion and participation characterize this form of\nlearning, which is often supplemented by in-class presentations of previously\nassigned tasks. The preparation of assignments often presupposes a lot of\nself-study and research; it is desirable that the student group enrolled in the\nsame seminar be able to share all points of view, results and conclusions. The\npresent paper presents an information system designed to manage the assignments\nproposed in a seminar and balance students' individual study load. The system\nwas developed in PHP language with all editable features stored in MySQL\ndatabase for the best speed and performance results. With a modular\norganization, the system relies on various entities such as Student, Theme,\nKeyword, Reference, etc. The implemented procedures are enhanced by a\nuser-friendly graphic interface (this will be described in another paper). The\nsystem is easy to use; it eliminates appointment dysfunctions, allows students\nto have their say in selecting/accepting a task and even to correlate their\ndecision with the proposed date for presentation.\n", "versions": [{"version": "v1", "created": "Sat, 27 May 2017 11:09:19 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Turcu", "Cristina Elena", ""], ["Turcu", "Corneliu Octavian", ""], ["Graur", "Evelyne", ""]]}, {"id": "1706.09268", "submitter": "Frank Johan Blaauw", "authors": "F. J. Blaauw, L. van der Krieke, A. C. Emerencia, M. Aiello, and P. de\n  Jonge", "title": "Personalized advice for enhancing well-being using automated impulse\n  response analysis --- AIRA", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The attention for personalized mental health care is thriving. Research data\nspecific to the individual, such as time series sensor data or data from\nintensive longitudinal studies, is relevant from a research perspective, as\nanalyses on these data can reveal the heterogeneity among the participants and\nprovide more precise and individualized results than with group-based methods.\nHowever, using this data for self-management and to help the individual to\nimprove his or her mental health has proven to be challenging.\n  The present work describes a novel approach to automatically generate\npersonalized advice for the improvement of the well-being of individuals by\nusing time series data from intensive longitudinal studies: Automated Impulse\nResponse Analysis (AIRA). AIRA analyzes vector autoregression models of\nwell-being by generating impulse response functions. These impulse response\nfunctions are used in simulations to determine which variables in the model\nhave the largest influence on the other variables and thus on the well-being of\nthe participant. The effects found can be used to support self-management.\n  We demonstrate the practical usefulness of AIRA by performing analysis on\nlongitudinal self-reported data about psychological variables. To evaluate its\neffectiveness and efficacy, we ran its algorithms on two data sets ($N=4$ and\n$N=5$), and discuss the results. Furthermore, we compare AIRA's output to the\nresults of a previously published study and show that the results are\ncomparable. By automating Impulse Response Function Analysis, AIRA fulfills the\nneed for accurate individualized models of health outcomes at a low resource\ncost with the potential for upscaling.\n", "versions": [{"version": "v1", "created": "Thu, 15 Jun 2017 08:07:20 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Blaauw", "F. J.", ""], ["van der Krieke", "L.", ""], ["Emerencia", "A. C.", ""], ["Aiello", "M.", ""], ["de Jonge", "P.", ""]]}, {"id": "1706.09269", "submitter": "Wen Shen", "authors": "Bradley Quadros, Ronit Kadam, Kartik Saxena, Wen Shen and Alfred Kobsa", "title": "Dashbell: A Low-cost Smart Doorbell System for Home Use", "comments": "Accepted by IEEE PerCom 2016", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  Smart doorbells allow home owners to receive alerts when a visitor is at the\ndoor, see who the guest is, and communicate with the visitor from a smart\ndevice. They greatly improve people's life quality and contribute to the\nevolution of smart homes. However, the commercial smart doorbells are quite\nexpensive, usually cost more than 190 US dollars, which is a substantial\nimpediment on the pervasiveness of smart doorbells. To solve this problem, we\nintroduce the Dashbell-a budget smart doorbell system for home use. It connects\na WiFi-enabled device, the Amazon Dash Button, to a network and enables the\nhome owner to answer the bell triggered by the dash button using a smartphone.\nThe Dashbell system also enables fast fault detection and diagnosis due to its\ndistributed framework.\n", "versions": [{"version": "v1", "created": "Fri, 16 Jun 2017 23:26:03 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Quadros", "Bradley", ""], ["Kadam", "Ronit", ""], ["Saxena", "Kartik", ""], ["Shen", "Wen", ""], ["Kobsa", "Alfred", ""]]}, {"id": "1706.09372", "submitter": "Elizabeth Mynatt", "authors": "Elizabeth Mynatt, Gregory D. Hager, Santosh Kumar, Ming Lin, Shwetak\n  Patel, Jack Stankovic, and Helen Wright", "title": "Research Opportunities and Visions for Smart and Pervasive Health", "comments": "A Computing Community Consortium (CCC) white paper, 12 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Improving the health of the nation's population and increasing the\ncapabilities of the US healthcare system to support diagnosis, treatment, and\nprevention of disease is a critical national and societal priority. In the past\ndecade, tremendous advances in expanding computing capabilities--sensors, data\nanalytics, networks, advanced imaging, and cyber-physical systems--have, and\nwill continue to, enhance healthcare and health research, with resulting\nimprovements in health and wellness. However, the cost and complexity of\nhealthcare continues to rise alongside the impact of poor health on\nproductivity and quality of life. What is lacking are transformative\ncapabilities that address significant health and healthcare trends: the growing\ndemands and costs of chronic disease, the greater responsibility placed on\npatients and informal caregivers, and the increasing complexity of health\nchallenges in the US, including mental health, that are deeply rooted in a\nperson's social and environmental context.\n", "versions": [{"version": "v1", "created": "Wed, 28 Jun 2017 17:21:50 GMT"}], "update_date": "2017-06-29", "authors_parsed": [["Mynatt", "Elizabeth", ""], ["Hager", "Gregory D.", ""], ["Kumar", "Santosh", ""], ["Lin", "Ming", ""], ["Patel", "Shwetak", ""], ["Stankovic", "Jack", ""], ["Wright", "Helen", ""]]}, {"id": "1706.09407", "submitter": "Venet Osmani", "authors": "Venet Osmani, Stefano Forti, Oscar Mayora, Diego Conforti", "title": "Enabling Prescription-based Health Apps", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe an innovative framework for prescription of personalised health\napps by integrating Personal Health Records (PHR) with disease-specific mobile\napplications for managing medical conditions and the communication with\nclinical professionals. The prescribed apps record multiple variables including\nmedical history enriched with innovative features such as integration with\nmedical monitoring devices and wellbeing trackers to provide patients and\nclinicians with a personalised support on disease management. Our framework is\nbased on an existing PHR ecosystem called TreC, uniquely positioned between\nhealthcare provider and the patients, which is being used by over 70.000\npatients in Trentino region in Northern Italy. We also describe three important\naspects of health app prescription and how medical information is automatically\nencoded through the TreC framework and is prescribed as a personalised app,\nready to be installed in the patients' smartphone.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 14:26:23 GMT"}], "update_date": "2017-06-30", "authors_parsed": [["Osmani", "Venet", ""], ["Forti", "Stefano", ""], ["Mayora", "Oscar", ""], ["Conforti", "Diego", ""]]}, {"id": "1706.09711", "submitter": "Swasti Khuntia", "authors": "Swasti R. Khuntia, Jose L. Rueda, and Mart A.M.M. van der Meijden", "title": "Smart Asset Management for Electric Utilities: Big Data and Future", "comments": "13 pages, 3 figures, Proceedings of 12th World Congress on\n  Engineering Asset Management (WCEAM) 2017", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This paper discusses about future challenges in terms of big data and new\ntechnologies. Utilities have been collecting data in large amounts but they are\nhardly utilized because they are huge in amount and also there is uncertainty\nassociated with it. Condition monitoring of assets collects large amounts of\ndata during daily operations. The question arises \"How to extract information\nfrom large chunk of data?\" The concept of \"rich data and poor information\" is\nbeing challenged by big data analytics with advent of machine learning\ntechniques. Along with technological advancements like Internet of Things\n(IoT), big data analytics will play an important role for electric utilities.\nIn this paper, challenges are answered by pathways and guidelines to make the\ncurrent asset management practices smarter for the future.\n", "versions": [{"version": "v1", "created": "Sun, 18 Jun 2017 14:59:06 GMT"}, {"version": "v2", "created": "Sat, 17 Feb 2018 13:33:27 GMT"}], "update_date": "2018-02-20", "authors_parsed": [["Khuntia", "Swasti R.", ""], ["Rueda", "Jose L.", ""], ["van der Meijden", "Mart A. M. M.", ""]]}, {"id": "1706.09749", "submitter": "Rex Bringula", "authors": "Rex P. Bringula, Rex P. Bringula, Rex P. Bringula, Mikael Manuel,\n  Katrina Panganiban", "title": "Pattern of Internet Usage in Cyber Cafes in Manila: An Exploratory Study", "comments": null, "journal-ref": null, "doi": "10.7903/ijcse.1102", "report-no": null, "categories": "cs.CY", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This study determined the profile and pattern of Internet usage of\nrespondents in cyber cafes in Manila. The study employed an\nexploratory-descriptive design in which a validated descriptive-survey form was\nused as the research instrument. Forty-seven cyber cafes in 14 districts in the\nCity of Manila were randomly selected. There were 545 respondents. It was found\nthat most of the respondents were Manila settlers (f = 368, 70%), students (f =\n382, 73%), pursuing or had attained a college degree (f = 374, 72%), male (f =\n356, 68%), young (19 and below) (f = 314, 60%), Roman Catholic (f = 423, 81%),\nsingle (f = 470, 90%), had a computer at home (f = 269, 51%), belonged to the\nmiddle-income class (f = 334, 64%), and used the Internet in the afternoon (f =\n274, 50.3%,chi^2 = 113.98, DF = 2, p < 0.01) once to twice a week (f = 193,\n36.9%, chi^2 = 90.04, DF = 3, p < 0.01). Frequency of visit of Internet users\nwas not equally distributed during the week and Internet users showed the\ntendency to visit cyber cafes at a particular time of the day when grouped\naccording to profile. The first hypothesis stated that frequency of visiting a\ncyber cafe would not be equally distributed during the week when grouped\naccording to profile was accepted. The second hypothesis, which stated that\nrespondents would not show a tendency to use the internet in a cyber cafe at a\nparticular time of the day was rejected. The study also discusses the\nlimitations and implications of the findings.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 13:34:00 GMT"}], "update_date": "2017-06-30", "authors_parsed": [["Bringula", "Rex P.", ""], ["Bringula", "Rex P.", ""], ["Bringula", "Rex P.", ""], ["Manuel", "Mikael", ""], ["Panganiban", "Katrina", ""]]}, {"id": "1706.09773", "submitter": "Osbert Bastani", "authors": "Osbert Bastani and Carolyn Kim and Hamsa Bastani", "title": "Interpretability via Model Extraction", "comments": "Presented as a poster at the 2017 Workshop on Fairness,\n  Accountability, and Transparency in Machine Learning (FAT/ML 2017)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.LG cs.CY stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ability to interpret machine learning models has become increasingly\nimportant now that machine learning is used to inform consequential decisions.\nWe propose an approach called model extraction for interpreting complex,\nblackbox models. Our approach approximates the complex model using a much more\ninterpretable model; as long as the approximation quality is good, then\nstatistical properties of the complex model are reflected in the interpretable\nmodel. We show how model extraction can be used to understand and debug random\nforests and neural nets trained on several datasets from the UCI Machine\nLearning Repository, as well as control policies learned for several classical\nreinforcement learning problems.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 14:30:40 GMT"}, {"version": "v2", "created": "Fri, 30 Jun 2017 02:02:44 GMT"}, {"version": "v3", "created": "Sun, 11 Mar 2018 02:08:24 GMT"}, {"version": "v4", "created": "Tue, 13 Mar 2018 00:56:59 GMT"}], "update_date": "2018-03-14", "authors_parsed": [["Bastani", "Osbert", ""], ["Kim", "Carolyn", ""], ["Bastani", "Hamsa", ""]]}, {"id": "1706.09838", "submitter": "Sirui Yao", "authors": "Sirui Yao, Bert Huang", "title": "New Fairness Metrics for Recommendation that Embrace Differences", "comments": "Presented as a poster at the 2017 Workshop on Fairness,\n  Accountability, and Transparency in Machine Learning (FAT/ML 2017)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY cs.AI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study fairness in collaborative-filtering recommender systems, which are\nsensitive to discrimination that exists in historical data. Biased data can\nlead collaborative filtering methods to make unfair predictions against\nminority groups of users. We identify the insufficiency of existing fairness\nmetrics and propose four new metrics that address different forms of\nunfairness. These fairness metrics can be optimized by adding fairness terms to\nthe learning objective. Experiments on synthetic and real data show that our\nnew metrics can better measure fairness than the baseline, and that the\nfairness objectives effectively help reduce unfairness.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 16:32:12 GMT"}, {"version": "v2", "created": "Wed, 13 Dec 2017 19:00:37 GMT"}], "update_date": "2017-12-15", "authors_parsed": [["Yao", "Sirui", ""], ["Huang", "Bert", ""]]}, {"id": "1706.09847", "submitter": "Suresh Venkatasubramanian", "authors": "Danielle Ensign, Sorelle A. Friedler, Scott Neville, Carlos\n  Scheidegger and Suresh Venkatasubramanian", "title": "Runaway Feedback Loops in Predictive Policing", "comments": "Extended version accepted to the 1st Conference on Fairness,\n  Accountability and Transparency, 2018. Adds further treatment of reported as\n  well as discovered incidents", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Predictive policing systems are increasingly used to determine how to\nallocate police across a city in order to best prevent crime. Discovered crime\ndata (e.g., arrest counts) are used to help update the model, and the process\nis repeated. Such systems have been empirically shown to be susceptible to\nrunaway feedback loops, where police are repeatedly sent back to the same\nneighborhoods regardless of the true crime rate.\n  In response, we develop a mathematical model of predictive policing that\nproves why this feedback loop occurs, show empirically that this model exhibits\nsuch problems, and demonstrate how to change the inputs to a predictive\npolicing system (in a black-box manner) so the runaway feedback loop does not\noccur, allowing the true crime rate to be learned. Our results are\nquantitative: we can establish a link (in our model) between the degree to\nwhich runaway feedback causes problems and the disparity in crime rates between\nareas. Moreover, we can also demonstrate the way in which \\emph{reported}\nincidents of crime (those reported by residents) and \\emph{discovered}\nincidents of crime (i.e. those directly observed by police officers dispatched\nas a result of the predictive policing algorithm) interact: in brief, while\nreported incidents can attenuate the degree of runaway feedback, they cannot\nentirely remove it without the interventions we suggest.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 16:50:22 GMT"}, {"version": "v2", "created": "Tue, 4 Jul 2017 00:06:15 GMT"}, {"version": "v3", "created": "Fri, 22 Dec 2017 04:49:24 GMT"}], "update_date": "2017-12-25", "authors_parsed": [["Ensign", "Danielle", ""], ["Friedler", "Sorelle A.", ""], ["Neville", "Scott", ""], ["Scheidegger", "Carlos", ""], ["Venkatasubramanian", "Suresh", ""]]}, {"id": "1706.09865", "submitter": "C.H. Bryan Liu", "authors": "C.H. Bryan Liu, Benjamin Paul Chamberlain, Duncan A. Little, Angelo\n  Cardoso", "title": "Generalising Random Forest Parameter Optimisation to Include Stability\n  and Cost", "comments": "To appear in ECML-PKDD 2017", "journal-ref": "Machine Learning and Knowledge Discovery in Databases. ECML PKDD\n  2017. LNCS vol 10536, pp. 102-113 (2017)", "doi": "10.1007/978-3-319-71273-4_9", "report-no": null, "categories": "stat.ML cs.CY cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Random forests are among the most popular classification and regression\nmethods used in industrial applications. To be effective, the parameters of\nrandom forests must be carefully tuned. This is usually done by choosing values\nthat minimize the prediction error on a held out dataset. We argue that error\nreduction is only one of several metrics that must be considered when\noptimizing random forest parameters for commercial applications. We propose a\nnovel metric that captures the stability of random forests predictions, which\nwe argue is key for scenarios that require successive predictions. We motivate\nthe need for multi-criteria optimization by showing that in practical\napplications, simply choosing the parameters that lead to the lowest error can\nintroduce unnecessary costs and produce predictions that are not stable across\nindependent runs. To optimize this multi-criteria trade-off, we present a new\nframework that efficiently finds a principled balance between these three\nconsiderations using Bayesian optimisation. The pitfalls of optimising forest\nparameters purely for error reduction are demonstrated using two publicly\navailable real world datasets. We show that our framework leads to parameter\nsettings that are markedly different from the values discovered by error\nreduction metrics.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 17:23:44 GMT"}, {"version": "v2", "created": "Thu, 13 Jul 2017 15:43:33 GMT"}], "update_date": "2018-07-03", "authors_parsed": [["Liu", "C. H. Bryan", ""], ["Chamberlain", "Benjamin Paul", ""], ["Little", "Duncan A.", ""], ["Cardoso", "Angelo", ""]]}, {"id": "1706.09976", "submitter": "Michael Skirpan", "authors": "Michael Skirpan and Micha Gorelick", "title": "The Authority of \"Fair\" in Machine Learning", "comments": "Presented as a talk at the 2017 Workshop on Fairness, Accountability,\n  and Transparency in Machine Learning (FAT/ML 2017)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we argue for the adoption of a normative definition of\nfairness within the machine learning community. After characterizing this\ndefinition, we review the current literature of Fair ML in light of its\nimplications. We end by suggesting ways to incorporate a broader community and\ngenerate further debate around how to decide what is fair in ML.\n", "versions": [{"version": "v1", "created": "Thu, 29 Jun 2017 23:37:34 GMT"}, {"version": "v2", "created": "Fri, 7 Jul 2017 17:54:48 GMT"}], "update_date": "2017-07-10", "authors_parsed": [["Skirpan", "Michael", ""], ["Gorelick", "Micha", ""]]}, {"id": "1706.10050", "submitter": "Belete Biazen Bezabeh", "authors": "Belete Biazen Bezabeh", "title": "The application of data mining techniques to support customer\n  relationship management: the case of ethiopian revenue and customs authority", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The application of data mining technique has been widely applied in different\nbusiness areas such as health, education and finance for the purpose of data\nanalysis and then to support and maximizes the organizations customer\nsatisfaction in an effort to increase loyalty and retain customers business\nover their lifetimes . The researchers primary objective, in this paper is to\nclassify customers based on their common attributes since customer grouping is\nthe main part of customer relationship management. In this study, different\ncharacteristics of the ERCA customers data were collected from the customs\ndatabase called ASYCUDA. Once the customers data were collected, the necessary\ndata preparation steps were conducted on it and finally a data set consisting\nof 46748 records was attained. The classification modeling was built by using\nJ48 decision tree and multi layer perceptron ANN algorithms with 10-fold\ncross-validation and splitting (70% training and 30% testing) techniques. Among\nthese models, a model which was built using J48 decision tree algorithm with\ndefault 10-fold cross-validation outperforms 99.95% of overall accuracy rate;\nwhile the classification accuracy of ANN is 99.71%. So decision tree has better\naccuracy than ANN for classifying ERCA customers data.\n", "versions": [{"version": "v1", "created": "Fri, 30 Jun 2017 08:03:27 GMT"}], "update_date": "2017-07-03", "authors_parsed": [["Bezabeh", "Belete Biazen", ""]]}, {"id": "1706.10063", "submitter": "Radoslaw Nielek", "authors": "Radoslaw Nielek, Miroslaw Ciastek, Wieslaw Kopec", "title": "Emotions make cities live. Towards mapping emotions of older adults on\n  urban space", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Understanding of interaction between people and urban spaces is crucial for\ninclusive decision making process. Smartphones and social media can be a rich\nsource of behavioral and declarative data about urban space, but it threatens\nto exclude voice of older adults. The platform proposed in the paper attempts\nto address this issue. A universal tagging mechanism based on the Pluchik Wheel\nof Emotion is proposed. Usability of the platform was tested and prospect\nstudies are proposed.\n", "versions": [{"version": "v1", "created": "Fri, 30 Jun 2017 08:41:51 GMT"}], "update_date": "2017-07-03", "authors_parsed": [["Nielek", "Radoslaw", ""], ["Ciastek", "Miroslaw", ""], ["Kopec", "Wieslaw", ""]]}, {"id": "1706.10076", "submitter": "Pavel Kucherbaev", "authors": "Pavel Kucherbaev, Achilleas Psyllidis, Alessandro Bozzon", "title": "Chatbots as Conversational Recommender Systems in Urban Contexts", "comments": "2 pages, 1 figure, 1 table", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.SI cs.CY cs.IR", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we outline the vision of chatbots that facilitate the\ninteraction between citizens and policy-makers at the city scale. We report the\nresults of a co-design session attended by more than 60 participants. We give\nan outlook of how some challenges associated with such chatbot systems could be\naddressed in the future.\n", "versions": [{"version": "v1", "created": "Fri, 30 Jun 2017 09:24:39 GMT"}, {"version": "v2", "created": "Wed, 9 Aug 2017 09:03:49 GMT"}], "update_date": "2017-08-10", "authors_parsed": [["Kucherbaev", "Pavel", ""], ["Psyllidis", "Achilleas", ""], ["Bozzon", "Alessandro", ""]]}, {"id": "1706.10237", "submitter": "Eva Garc\\'ia-Mart\\'in", "authors": "Eva Garc\\'ia-Mart\\'in, Niklas Lavesson", "title": "Is it ethical to avoid error analysis?", "comments": "Presented as a poster at the 2017 Workshop on Fairness,\n  Accountability, and Transparency in Machine Learning (FAT/ML 2017)", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Machine learning algorithms tend to create more accurate models with the\navailability of large datasets. In some cases, highly accurate models can hide\nthe presence of bias in the data. There are several studies published that\ntackle the development of discriminatory-aware machine learning algorithms. We\ncenter on the further evaluation of machine learning models by doing error\nanalysis, to understand under what conditions the model is not working as\nexpected. We focus on the ethical implications of avoiding error analysis, from\na falsification of results and discrimination perspective. Finally, we show\ndifferent ways to approach error analysis in non-interpretable machine learning\nalgorithms such as deep learning.\n", "versions": [{"version": "v1", "created": "Fri, 30 Jun 2017 15:24:42 GMT"}], "update_date": "2017-07-03", "authors_parsed": [["García-Martín", "Eva", ""], ["Lavesson", "Niklas", ""]]}, {"id": "1706.10267", "submitter": "Tom Conte", "authors": "Thomas M. Conte, Erik P. Debenedictis, R. Stanley Williams, and Mark\n  D. Hill", "title": "Challenges to Keeping the Computer Industry Centered in the US", "comments": "A Computing Community Consortium (CCC) white paper, 3 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is undeniable that the worldwide computer industry's center is the US,\nspecifically in Silicon Valley. Much of the reason for the success of Silicon\nValley had to do with Moore's Law: the observation by Intel co-founder Gordon\nMoore that the number of transistors on a microchip doubled at a rate of\napproximately every two years. According to the International Technology\nRoadmap for Semiconductors, Moore's Law will end in 2021. How can we rethink\ncomputing technology to restart the historic explosive performance growth?\nSince 2012, the IEEE Rebooting Computing Initiative (IEEE RCI) has been working\nwith industry and the US government to find new computing approaches to answer\nthis question. In parallel, the CCC has held a number of workshops addressing\nsimilar questions. This whitepaper summarizes some of the IEEE RCI and CCC\nfindings. The challenge for the US is to lead this new era of computing. Our\ninternational competitors are not sitting still: China has invested\nsignificantly in a variety of approaches such as neuromorphic computing, chip\nfabrication facilities, computer architecture, and high-performance simulation\nand data analytics computing, for example. We must act now, otherwise, the\ncenter of the computer industry will move from Silicon Valley and likely move\noff shore entirely.\n", "versions": [{"version": "v1", "created": "Fri, 30 Jun 2017 16:47:06 GMT"}], "update_date": "2017-07-03", "authors_parsed": [["Conte", "Thomas M.", ""], ["Debenedictis", "Erik P.", ""], ["Williams", "R. Stanley", ""], ["Hill", "Mark D.", ""]]}]