[{"id": "1107.1437", "submitter": "Richard Formato", "authors": "Richard A. Formato", "title": "A novel methodology for antenna design and optimization: Variable Zo", "comments": "Ver. 2 (14 July 2011). Adds Yagi-Uda array design example. Updates\n  source code", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes \"Variable Zo,\" a novel and proprietary approach to\nantenna design and optimization. The new methodology is illustrated by applying\nit to the design of a resistively-loaded bowtie antenna and to two broadband\nYagi-Uda arrays. Variable Zo is applicable to any antenna design or\noptimization methodology. Using it will result in generally better antenna\ndesigns across any user-specified set of performance objectives.\n", "versions": [{"version": "v1", "created": "Thu, 7 Jul 2011 16:01:42 GMT"}, {"version": "v2", "created": "Thu, 14 Jul 2011 15:34:48 GMT"}], "update_date": "2011-07-15", "authors_parsed": [["Formato", "Richard A.", ""]]}, {"id": "1107.3217", "submitter": "Dimple Juneja Dr.", "authors": "Harjit Singh Lamba and Gurdev Singh", "title": "Cloud Computing Future Framework for e-management of NGO's", "comments": "Eight pages,Three figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  Cloud computing is an emerging new computing paradigm for delivering\ncomputing services. This computing approach relies on a number of existing\ntechnologies, e.g., the Internet, virtualization, grid computing, Web services,\netc. Cloud Computing aims to provide scalable and inexpensive on-demand\ncomputing infrastructures with good quality of service levels. It represents a\nshift away from computing as a product that is purchased, to computing as a\nservice that is delivered to consumers from the cloud. It helps an organization\nin saving costs and creating new business opportunities.This paper provides a\nframework, Education Cloud for the e- management of NGO's. The Education Cloud\ncan transform a nonprofit, or an entire sector of nonprofits, achieves its\nmission and creates lasting impact in its communities. This paper also presents\nthe case study of Kalgidhar trust, Baru Sahib, Himachal Pradesh, NGO which is\nusing the education as the tool to solve the social issues.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jul 2011 10:16:36 GMT"}], "update_date": "2011-07-19", "authors_parsed": [["Lamba", "Harjit Singh", ""], ["Singh", "Gurdev", ""]]}, {"id": "1107.3229", "submitter": "Sylvain Lavernhe", "authors": "David Pr\\'evost (LURPA), Sylvain Lavernhe (LURPA), Claire Lartigue\n  (LURPA), Didier Dumur", "title": "Feed drive modelling for the simulation of tool path tracking in\n  multi-axis High Speed Machining", "comments": null, "journal-ref": "International Journal of Mechatronics and Manufacturing Systems 4,\n  3-4 (2011) 266-284", "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Within the context of High Speed Machining, it is essential to manage the\ntrajectory generation to achieve both high surface quality and high\nproductivity. As feed drives are one part of the set Machine tool - Numerical\nController, it is necessary to improve their performances to optimize feed\ndrive dynamics during trajectory follow up. Hence, this paper deals with the\nmodelling of the feed drive in the case of multi axis machining. This model can\nbe used for the simulation of axis dynamics and tool-path tracking to tune\nparameters and optimize new frameworks of command strategies. A procedure of\nidentification based on modern NC capabilities is presented and applied to\nindustrial HSM centres. Efficiency of this modelling is assessed by\nexperimental verifications on various representative trajectories. After\nimplementing a Generalized Predictive Control, reliable simulations are\nperformed thanks to the model. These simulations can then be used to tune\nparameters of this new framework according to the tool-path geometry.\n", "versions": [{"version": "v1", "created": "Sat, 16 Jul 2011 12:58:50 GMT"}], "update_date": "2011-07-19", "authors_parsed": [["Prévost", "David", "", "LURPA"], ["Lavernhe", "Sylvain", "", "LURPA"], ["Lartigue", "Claire", "", "LURPA"], ["Dumur", "Didier", ""]]}, {"id": "1107.3541", "submitter": "Sylvain Lavernhe", "authors": "Lo\\\"ic Andolfatto (LURPA), Sylvain Lavernhe (LURPA), Ren\\'e Mayer\n  (LRFV)", "title": "Evaluation of servo, geometric and dynamic error sources on five axis\n  high-speed machine tool", "comments": "13 pages; International Journal of Machine Tools and Manufacture\n  (2011) pp XX-XX", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.OH", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Many sources of errors exist in the manufacturing process of complex shapes.\nSome approximations occur at each step from the design geometry to the machined\npart. The aim of the paper is to present a method to evaluate the effect of\nhigh speed and high dynamic load on volumetric errors at the tool center point.\nThe interpolator output signals and the machine encoder signals are recorded\nand compared to evaluate the contouring errors resulting from each axis\nfollow-up error. The machine encoder signals are also compared to the actual\ntool center point position as recorded with a non-contact measuring instrument\ncalled CapBall to evaluate the total geometric errors. The novelty of the work\nlies in the method that is proposed to decompose the geometric errors in two\ncategories: the quasi-static geometric errors independent from the speed of the\ntrajectory and the dynamic geometric errors, dependent on the programmed feed\nrate and resulting from the machine structure deflection during the\nacceleration of its axes. The evolution of the respective contributions for\ncontouring errors, quasi-static geometric errors and dynamic geomet- ric errors\nis experimentally evaluated and a relation between programmed feed rate and\ndynamic errors is highlighted.\n", "versions": [{"version": "v1", "created": "Mon, 18 Jul 2011 19:44:52 GMT"}], "update_date": "2011-07-19", "authors_parsed": [["Andolfatto", "Loïc", "", "LURPA"], ["Lavernhe", "Sylvain", "", "LURPA"], ["Mayer", "René", "", "LRFV"]]}]