[{"id": "2002.00525", "submitter": "Shuvodeep De", "authors": "Shuvodeep De, Rakesh K. Kapania", "title": "Algorithms for 2D Mesh Decomposition in Distributed Design Optimization", "comments": "17 Pages, 11 figures, Parts presented in WCCM XIII", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.CE cs.NA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Optimization of thin-walled structures like an aircraft wing, aircraft\nfuselage or submarine hull often involves dividing the shell surface into\nnumerous localized panels, each characterized by its own set of design\nvariables. The process of extracting information about a localized panel (nodal\ncoordinates, mesh connectivity) from a finite element model, input file is\nusually a problem-specific task. In this work, a generalized process to extract\nlocalized panels from the two-dimensional (2D) mesh is discussed. The process\nemploys set operations on elemental connectivity information and is independent\nof nodal coordinates. Thus, it is capable of extracting panel of any shape\ngiven the boundary and thus can be used during optimization of a wide range of\nstructures. A method to create stiffeners on the resulting local panels is also\npresented, and the effect of stiffener element size on buckling is studied. The\nlocal panel extraction process is demonstrated by integrating it into a\ndistributed MDO framework for optimization of an aircraft wing having\ncurvilinear spars and ribs (SpaRibs). A range of examples is included wherein\nthe process is used to create panels on the wing-skin, bounded by adjacent\nSpaRibs.\n", "versions": [{"version": "v1", "created": "Mon, 3 Feb 2020 01:21:40 GMT"}, {"version": "v2", "created": "Wed, 5 Feb 2020 22:11:51 GMT"}, {"version": "v3", "created": "Thu, 22 Apr 2021 08:33:01 GMT"}], "update_date": "2021-04-23", "authors_parsed": [["De", "Shuvodeep", ""], ["Kapania", "Rakesh K.", ""]]}, {"id": "2002.00885", "submitter": "Alexis Arnaudon Dr", "authors": "Alexis Arnaudon, Frank van der Meulen, Moritz Schauer, Stefan Sommer", "title": "Diffusion bridges for stochastic Hamiltonian systems and shape\n  evolutions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.NA cs.CE cs.NA physics.comp-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Stochastically evolving geometric systems are studied in shape analysis and\ncomputational anatomy for modelling stochastic evolution of human organ shapes,\nand in geometric mechanics for modelling turbulence parts of multi-scale fluid\nflows. Recently introduced models involve stochastic differential equations\nthat govern the dynamics of a diffusion process $X$ where, in applications, $X$\nis only partially observed at times $0$ and $T>0$. Conditional on these\nobservations, the challenge is to infer parameters of the dynamics of the\ndiffusion and to reconstruct the path $(X_t,\\, t\\in [0,T])$. The latter problem\nis known as bridge simulation. We develop a general scheme for bridge\nsimulation in the case of finite dimensional systems of shape landmarks and\nsingular solutions in fluid dynamics. The scheme allows for subsequent\nstatistical inference of properties of the evolution of the shapes. We show how\nthe approach covers stochastic landmark models for which no suitable simulation\nmethod has been proposed in the literature; that it removes restrictions of\nearlier approaches; that it improves the handling of the nonlinearity of the\nconfiguration space leading to more effective sampling schemes; and that it\nallows to generalise the common inexact matching scheme to the stochastic\nsetting.\n", "versions": [{"version": "v1", "created": "Mon, 3 Feb 2020 16:57:02 GMT"}, {"version": "v2", "created": "Tue, 4 Feb 2020 16:42:59 GMT"}, {"version": "v3", "created": "Tue, 30 Mar 2021 20:09:09 GMT"}], "update_date": "2021-04-01", "authors_parsed": [["Arnaudon", "Alexis", ""], ["van der Meulen", "Frank", ""], ["Schauer", "Moritz", ""], ["Sommer", "Stefan", ""]]}, {"id": "2002.01234", "submitter": "Felix Fritzen", "authors": "Mauricio Fern\\'andez, Felix Fritzen", "title": "On the generation of periodic discrete structures with identical\n  two-point correlation", "comments": "28 pages", "journal-ref": null, "doi": "10.1098/rspa.2020.0568", "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Strategies for the generation of periodic discrete structures with identical\ntwo-point correlation are developed. Starting from a pair of root structures,\nwhich are not related by translation, phase inversion or axis reflections,\nchild structures of arbitrary resolution (i.e., pixel or voxel numbers) and\nnumber of phases (i.e., material phases/species) can be generated by means of\ntrivial embedding based phase extension, application of kernels and/or phase\ncoalescence, such that the generated structures inherit the\ntwo-point-correlation equivalence. Proofs of the inheritance property are\nprovided by means of the Discrete Fourier Transform theory. A Python 3\nimplementation of the results is offered by the authors through the Github\nrepository https://github.com/DataAnalyticsEngineering/EQ2PC in order to make\nthe provided results reproducible and useful for all interested readers.\nExamples for the generation of structures are demonstrated, together with\napplications in the homogenization theory of periodic media.\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2020 11:35:29 GMT"}], "update_date": "2021-03-17", "authors_parsed": [["Fernández", "Mauricio", ""], ["Fritzen", "Felix", ""]]}, {"id": "2002.01804", "submitter": "Jan Eli\\'a\\v{s}", "authors": "Jan Eli\\'a\\v{s} and Miroslav Vo\\v{r}echovsk\\'y", "title": "Fracture in random quasibrittle media: I. Discrete mesoscale simulations\n  of load capacity and fracture process zone", "comments": "26 pages, 16 figures, 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cond-mat.mtrl-sci", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Numerical simulations of concrete fracture performed with a probabilistic\nmesoscale discrete model are presented. The model represents a substantial part\nof material randomness by assigning random locations to the largest aggregates.\nThe remaining part of randomness is introduced by causing material parameters\nto fluctuate randomly via a homogeneous random field. An extensive numerical\nstudy performed with the model considers prisms loaded in uniaxial tension with\nboth fixed and rotating platens, and also beams with and without a notch loaded\nin three point bending. The results show the nontrivial effect of (i)\nautocorrelation length and (ii) variance of the random field on the fracture\nbehavior of the model. Statistics of the peak load are presented as well as the\nsize and shape of the fracture process zone at the moment when the maximum load\nis attained. Local averaging within the fracture process zone and weakest-link\nare identified as underlying mechanisms explaining the reported results. The\ncompanion paper, Part II [64], introduces an analytical model capable of\npredicting the distribution of the peak load obtained with the probabilistic\ndiscrete model via the simple estimation of extremes of a random field obtained\nas moving average of local strength.\n", "versions": [{"version": "v1", "created": "Wed, 5 Feb 2020 14:24:14 GMT"}, {"version": "v2", "created": "Sun, 14 Jun 2020 09:10:07 GMT"}], "update_date": "2020-06-23", "authors_parsed": [["Eliáš", "Jan", ""], ["Vořechovský", "Miroslav", ""]]}, {"id": "2002.01893", "submitter": "Houpu Yao", "authors": "Houpu Yao, Yi Gao, Yongming Liu", "title": "FEA-Net: A Physics-guided Data-driven Model for Efficient Mechanical\n  Response Prediction", "comments": null, "journal-ref": null, "doi": "10.1016/j.cma.2020.112892", "report-no": null, "categories": "cs.CE cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An innovative physics-guided learning algorithm for predicting the mechanical\nresponse of materials and structures is proposed in this paper. The key concept\nof the proposed study is based on the fact that physics models are governed by\nPartial Differential Equation (PDE), and its loading/ response mapping can be\nsolved using Finite Element Analysis (FEA). Based on this, a special type of\ndeep convolutional neural network (DCNN) is proposed that takes advantage of\nour prior knowledge in physics to build data-driven models whose architectures\nare of physics meaning. This type of network is named as FEA-Net and is used to\nsolve the mechanical response under external loading. Thus, the identification\nof a mechanical system parameters and the computation of its responses are\ntreated as the learning and inference of FEA-Net, respectively. Case studies on\nmulti-physics (e.g., coupled mechanical-thermal analysis) and multi-phase\nproblems (e.g., composite materials with random micro-structures) are used to\ndemonstrate and verify the theoretical and computational advantages of the\nproposed method.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2020 09:37:44 GMT"}], "update_date": "2020-04-22", "authors_parsed": [["Yao", "Houpu", ""], ["Gao", "Yi", ""], ["Liu", "Yongming", ""]]}, {"id": "2002.01894", "submitter": "Yichao Zhu", "authors": "Dingchuan Xue, Yichao Zhu, Xu Guo", "title": "Generation of smoothly-varying infill configurations from a continuous\n  menu of cell patterns and the asymptotic analysis of its mechanical behaviour", "comments": null, "journal-ref": null, "doi": "10.1016/j.cma.2020.113037", "report-no": null, "categories": "cs.CE physics.app-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We here introduce a novel scheme for generating smoothly-varying infill\ngraded microstructural (IGM) configurations from a given menu of generating\ncells. The scheme was originally proposed for essentially improving the variety\nof describable configurations in a modified asymptotic homogenisation-based\ntopology optimisation framework [1] for fast IGM design. But the proposed\nscheme, after modification, also demonstrates its unique values in two aspects\nof applications. First, it provides a fairly simple way of generating an IGM\nconfiguration continuously patching any given cell configurations. Second, it\ntenders a straightforward mean for decorating microstructures on a given\nmanifold. We will further show that the form of topology description function\ngiven here effectively offers a platform for unifying most existing approaches\nfor IGM generation. Fuelled by asymptotic analysis of the mechanical behaviour\nof the resulting IGM configurations, a topology optimisation scheme for\ncompliance minimisation is introduced. We will finally show that, the use of\nthe present scheme helps reduce the compliance value of an optimised structure\nby nearly a half, if compared with that from the original framework [1].\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2020 03:07:00 GMT"}, {"version": "v2", "created": "Sat, 8 Feb 2020 01:40:57 GMT"}], "update_date": "2020-05-20", "authors_parsed": [["Xue", "Dingchuan", ""], ["Zhu", "Yichao", ""], ["Guo", "Xu", ""]]}, {"id": "2002.01896", "submitter": "Diab Abueidda", "authors": "Diab W. Abueidda, Seid Koric, Nahil A. Sobh", "title": "Topology optimization of 2D structures with nonlinearities using deep\n  learning", "comments": null, "journal-ref": null, "doi": "10.1016/j.compstruc.2020.106283", "report-no": null, "categories": "cs.CE cs.LG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The field of optimal design of linear elastic structures has seen many\nexciting successes that resulted in new architected materials and structural\ndesigns. With the availability of cloud computing, including high-performance\ncomputing, machine learning, and simulation, searching for optimal nonlinear\nstructures is now within reach. In this study, we develop convolutional neural\nnetwork models to predict optimized designs for a given set of boundary\nconditions, loads, and optimization constraints. We have considered the case of\nmaterials with a linear elastic response with and without stress constraint.\nAlso, we have considered the case of materials with a hyperelastic response,\nwhere material and geometric nonlinearities are involved. For the nonlinear\nelastic case, the neo-Hookean model is utilized. For this purpose, we generate\ndatasets composed of the optimized designs paired with the corresponding\nboundary conditions, loads, and constraints, using a topology optimization\nframework to train and validate the neural network models. The developed models\nare capable of accurately predicting the optimized designs without requiring an\niterative scheme and with negligible inference computational time. The\nsuggested pipeline can be generalized to other nonlinear mechanics scenarios\nand design domains.\n", "versions": [{"version": "v1", "created": "Fri, 31 Jan 2020 12:36:17 GMT"}, {"version": "v2", "created": "Thu, 6 Feb 2020 12:10:23 GMT"}, {"version": "v3", "created": "Tue, 17 Mar 2020 23:19:51 GMT"}, {"version": "v4", "created": "Mon, 13 Apr 2020 18:51:11 GMT"}], "update_date": "2021-02-09", "authors_parsed": [["Abueidda", "Diab W.", ""], ["Koric", "Seid", ""], ["Sobh", "Nahil A.", ""]]}, {"id": "2002.01927", "submitter": "Changyu Deng", "authors": "Changyu Deng, Yizhou Wang, Can Qin, Wei Lu", "title": "Self-Directed Online Machine Learning for Topology Optimization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.LG stat.ML", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Topology optimization by optimally distributing materials in a given domain\nrequires gradient-free optimizers to solve highly complicated problems.\nHowever, with hundreds of design variables or more involved, solving such\nproblems would require millions of Finite Element Method (FEM) calculations\nwhose computational cost is huge and impractical. Here we report a\nSelf-directed Online Learning Optimization (SOLO) which integrates Deep Neural\nNetwork (DNN) with FEM calculations. A DNN learns and substitutes the objective\nas a function of design variables. A small amount of training data is generated\ndynamically based on the DNN's prediction of the global optimum. The DNN adapts\nto the new training data and gives better prediction in the region of interest\nuntil convergence. Our algorithm was tested by compliance minimization problems\nand fluid-structure optimization problems. It reduced the computational time by\n2~5 orders of magnitude compared with directly using heuristic methods, and\noutperformed all state-of-the-art algorithms tested in our experiments. This\napproach enables solving large multi-dimensional optimization problems.\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2020 20:00:28 GMT"}, {"version": "v2", "created": "Mon, 20 Apr 2020 21:25:57 GMT"}, {"version": "v3", "created": "Wed, 22 Apr 2020 14:40:54 GMT"}, {"version": "v4", "created": "Sat, 12 Sep 2020 18:58:11 GMT"}, {"version": "v5", "created": "Tue, 15 Sep 2020 00:53:37 GMT"}, {"version": "v6", "created": "Mon, 4 Jan 2021 16:12:25 GMT"}], "update_date": "2021-01-05", "authors_parsed": [["Deng", "Changyu", ""], ["Wang", "Yizhou", ""], ["Qin", "Can", ""], ["Lu", "Wei", ""]]}, {"id": "2002.02105", "submitter": "Jingxiao Liu", "authors": "Jingxiao Liu, Bingqing Chen, Siheng Chen, Mario Berges, Jacobo Bielak,\n  HaeYoung Noh", "title": "Damage-sensitive and domain-invariant feature extraction for\n  vehicle-vibration-based bridge health monitoring", "comments": "To appear in Proc. ICASSP2020, May 04-08, 2020, Barcelona, Spain.\n  IEEE", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.LG eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We introduce a physics-guided signal processing approach to extract a\ndamage-sensitive and domain-invariant (DS & DI) feature from acceleration\nresponse data of a vehicle traveling over a bridge to assess bridge health.\nMotivated by indirect sensing methods' benefits, such as low-cost and\nlow-maintenance, vehicle-vibration-based bridge health monitoring has been\nstudied to efficiently monitor bridges in real-time. Yet applying this approach\nis challenging because 1) physics-based features extracted manually are\ngenerally not damage-sensitive, and 2) features from machine learning\ntechniques are often not applicable to different bridges. Thus, we formulate a\nvehicle bridge interaction system model and find a physics-guided DS & DI\nfeature, which can be extracted using the synchrosqueezed wavelet transform\nrepresenting non-stationary signals as intrinsic-mode-type components. We\nvalidate the effectiveness of the proposed feature with simulated experiments.\nCompared to conventional time- and frequency-domain features, our feature\nprovides the best damage quantification and localization results across\ndifferent bridges in five of six experiments.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2020 05:45:39 GMT"}], "update_date": "2020-02-07", "authors_parsed": [["Liu", "Jingxiao", ""], ["Chen", "Bingqing", ""], ["Chen", "Siheng", ""], ["Berges", "Mario", ""], ["Bielak", "Jacobo", ""], ["Noh", "HaeYoung", ""]]}, {"id": "2002.03715", "submitter": "Armin Galetzka", "authors": "Herbert De Gersem, Armin Galetzka, Ion Gabriel Ion, Dimitrios\n  Loukrezis, Ulrich R\\\"omer", "title": "Magnetic Field Simulation with Data-Driven Material Modeling", "comments": "6 pages, 5 figures", "journal-ref": null, "doi": "10.1109/TMAG.2020.3002092", "report-no": null, "categories": "physics.comp-ph cs.CE", "license": "http://creativecommons.org/licenses/by-nc-sa/4.0/", "abstract": "  This paper developes a data-driven magnetostatic finite-element (FE) solver\nwhich directly exploits measured material data instead of a material curve\nconstructed from it. The distances between the field solution and the\nmeasurement points are minimized while enforcing Maxwell's equations. The\nminimization problem is solved by employing the Lagrange multiplier approach.\nThe procedure wraps the FE method within an outer data-driven iteration. The\nmethod is capable of considering anisotropic materials and is adapted to deal\nwith models featuring a combination of exact material knowledge and measured\nmaterial data. Thereto, three approaches with an increasing level of\nintrusivity according to the FE formulation are proposed. The numerical results\nfor a quadrupole-magnet model show that data-driven field simulation is\nfeasible and affordable and overcomes the need of modeling the material law.\n", "versions": [{"version": "v1", "created": "Mon, 10 Feb 2020 13:19:11 GMT"}, {"version": "v2", "created": "Mon, 15 Jun 2020 12:23:25 GMT"}], "update_date": "2020-06-16", "authors_parsed": [["De Gersem", "Herbert", ""], ["Galetzka", "Armin", ""], ["Ion", "Ion Gabriel", ""], ["Loukrezis", "Dimitrios", ""], ["Römer", "Ulrich", ""]]}, {"id": "2002.03770", "submitter": "Saumik Dana", "authors": "Saumik Dana and Mary F Wheeler", "title": "An efficient algorithm for numerical homogenization of fluid filled\n  porous solids: part-I", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The concept of representative volume element or RVE is invoked to develop an\nalgorithm for numerical homogenization of fluid filled porous solids. RVE based\nmethods decouple analysis of a composite material into analyses at the local\nand global levels. The local level analysis models the microstructural details\nto determine effective properties by applying boundary conditions to the RVE\nand solving the resultant boundary value problem. The composite structure is\nthen replaced by an equivalent homogeneous material having the calculated\neffective properties. We combine the features of two techniques: one is the\ndefinition of a displacement field for the fluid phase to allow for a\ndefinition of a continuous displacement field across the microstructure and the\nother is the $FE^2$ numerical homogenization that couples the macroscale with\nthe RVE scale via gauss points.\n", "versions": [{"version": "v1", "created": "Mon, 3 Feb 2020 21:42:47 GMT"}, {"version": "v2", "created": "Wed, 28 Jul 2021 14:10:31 GMT"}], "update_date": "2021-07-29", "authors_parsed": [["Dana", "Saumik", ""], ["Wheeler", "Mary F", ""]]}, {"id": "2002.03789", "submitter": "Tobias Scheuermann", "authors": "Tobias M. Scheuermann and Paul Kotyczka and Christian Martens and\n  Haithem Louati and Bernhard Maschke and Marie-Line Zanota and Isabelle\n  Pitault", "title": "An Object-Oriented Library for Heat Transfer Modelling and Simulation in\n  Open Cell Foams", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Metallic open cell foams have multiple applications in industry, e. g. as\ncatalyst supports in chemical processes. Their regular or heterogeneous\nmicroscopic structure determines the macroscopic thermodynamic and chemical\nproperties. We present an object-oriented python library that generates state\nspace models for simulation and control from the microscopic foam data, which\ncan be imported from the image processing tool iMorph. The foam topology and\nthe 3D geometric data are the basis for discrete modeling of the balance laws\nusing the cell method. While the material structure imposes a primal chain\ncomplex to define discrete thermodynamic driving forces, the internal energy\nbalance is evaluated on a second chain complex, which is constructed by\ntopological duality. The heat exchange between the solid and the fluid phase is\ndescribed based on the available surface data. We illustrate in detail the\nconstruction of the dual chain complexes, and we show how the structured\ndiscrete model directly maps to the software objects of the python code. As a\ntest case, we present simulation results for a foam with a Kelvin cell\nstructure, and compare them to a surrogate finite element model with\nhomogeneous parameters.\n", "versions": [{"version": "v1", "created": "Thu, 6 Feb 2020 10:29:45 GMT"}], "update_date": "2020-02-11", "authors_parsed": [["Scheuermann", "Tobias M.", ""], ["Kotyczka", "Paul", ""], ["Martens", "Christian", ""], ["Louati", "Haithem", ""], ["Maschke", "Bernhard", ""], ["Zanota", "Marie-Line", ""], ["Pitault", "Isabelle", ""]]}, {"id": "2002.04519", "submitter": "Ot\\'avio Beruski", "authors": "O. Beruski, I. Korkischko, T. Lopes, F. C. Fonseca", "title": "Progress Report on Numerical Modeling of a Prototype Fuel Cell", "comments": "87 pages, 30 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Progress on the numerical modeling of a prototype fuel cell is reported. Some\nknown limitations of the previously published Alpha model are addressed, and\nthe numerical uncertainty due to discretization of the improved model, Beta,\nwas estimated. In Part 1, the Beta model is compared to Alpha, where\nsignificant albeit small differences are seen. Shortcomings of the improved\nmodel are discussed, paving the way forward, while a discrepancy with previous\nresults is addressed, further suggesting the use of the Darcy-Brinkman over\nStokes-Darcy formulation for free and porous media flow. Furthermore, a\nparametric study is carried out, constraining plausible values of the reaction\nrate constants identifying additional opportunities for validation. In Part 2,\na mesh convergence study is carried out to estimate the discretization error of\nBeta model. A reduced, proxy geometry and two extrapolation schemes are used to\nestimate the exact solution, which is then used to estimate the model's\nuncertainty through the Grid Convergence Index framework. Error estimates are\non average $\\sim 10\\%$ for the flow rate range simulated, larger than\nexperimental ones available. Results suggest a difficulty in achieving mesh\nconvergence in fuel cell-like models, even in simpler cases. Caution is thus\nsuggested during validation or when devising predictions from numerical models.\nFinally, given the uncertainties in the numerical data and the available\nexperimental data, the results lack validation power, highlighting the need for\nadditional experimental data and improved precision for the numerical data.\n", "versions": [{"version": "v1", "created": "Fri, 7 Feb 2020 19:29:52 GMT"}, {"version": "v2", "created": "Tue, 24 Mar 2020 17:22:59 GMT"}, {"version": "v3", "created": "Fri, 13 Nov 2020 14:30:34 GMT"}], "update_date": "2020-11-16", "authors_parsed": [["Beruski", "O.", ""], ["Korkischko", "I.", ""], ["Lopes", "T.", ""], ["Fonseca", "F. C.", ""]]}, {"id": "2002.04526", "submitter": "Alexandra Tzella", "authors": "Yahya Farah, Daniel Loghin, Alexandra Tzella and Jacques Vanneste", "title": "Diffusion in arrays of obstacles: beyond homogenisation", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE physics.class-ph physics.comp-ph physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We revisit the classical problem of diffusion of a scalar (or heat) released\nin a two-dimensional medium with an embedded periodic array of impermeable\nobstacles such as perforations. Homogenisation theory provides a coarse-grained\ndescription of the scalar at large times and predicts that it diffuses with a\ncertain effective diffusivity, so the concentration is approximately Gaussian.\nWe improve on this by developing a large-deviation approximation which also\ncaptures the non-Gaussian tails of the concentration through a rate function\nobtained by solving a family of eigenvalue problems. We focus on cylindrical\nobstacles and on the dense limit, when the obstacles occupy a large area\nfraction and non-Gaussianity is most marked. We derive an asymptotic\napproximation for the rate function in this limit, valid uniformly over a wide\nrange of distances. We use finite-element implementations to solve the\neigenvalue problems yielding the rate function for arbitrary obstacle area\nfractions and an elliptic boundary-value problem arising in the asymptotics\ncalculation. Comparison between numerical results and asymptotic predictions\nconfirm the validity of the latter.\n", "versions": [{"version": "v1", "created": "Tue, 4 Feb 2020 18:18:08 GMT"}, {"version": "v2", "created": "Mon, 16 Nov 2020 22:12:53 GMT"}], "update_date": "2020-11-18", "authors_parsed": [["Farah", "Yahya", ""], ["Loghin", "Daniel", ""], ["Tzella", "Alexandra", ""], ["Vanneste", "Jacques", ""]]}, {"id": "2002.05018", "submitter": "Javad Moshfegh", "authors": "Javad Moshfegh and Marinos N. Vouvakis", "title": "Direct Domain Decomposition Method (D3M) for Finite Element\n  Electromagnetic Computations", "comments": "3 pages, 3 figures, 2016 IEEE APS/URSI", "journal-ref": "In 2016 IEEE International Symposium on Antennas and Propagation\n  (APSURSI) (pp. 1127-1128). IEEE", "doi": null, "report-no": null, "categories": "cs.CE cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  An exact arithmetic, memory efficient direct solution method for finite\nelement method (FEM) computations is outlined. Unlike conventional black-box or\nlow-rank direct solvers that are opaque to the underlying physical problem, the\nproposed method leverages physical insights at every stage of the development\nthrough a new symmetric domain decomposition method (DDM) with one set of\nLagrange multipliers. Comparisons with state-of-the-art exact direct solvers on\nelectrically large problems suggest up to 10 times less memory and better\nrun-time complexity while maintaining the same accuracy.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2020 18:01:56 GMT"}], "update_date": "2020-02-13", "authors_parsed": [["Moshfegh", "Javad", ""], ["Vouvakis", "Marinos N.", ""]]}, {"id": "2002.05019", "submitter": "Javad Moshfegh", "authors": "Javad Moshfegh and Marinos N. Vouvakis", "title": "Direct Solution of FEM Models: Are Sparse Direct Solvers the Best\n  Strategy?", "comments": "3 pages, 3 figures, 2017 ICEAA", "journal-ref": "In 2017 International Conference on Electromagnetics in Advanced\n  Applications (ICEAA) (pp. 1636-1638). IEEE", "doi": null, "report-no": null, "categories": "cs.CE cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A brief summary of direct solution approaches for finite element methods\n(FEM) in computational electromagnetics (CEM) is given along with an\nalternative direct solution based on domain decomposition (DD). Unlike recent\ntrends in approximate/low-rank solvers, this work focuses on `numerically\nexact' solution methods as they are more reliable for complex `real-life'\nmodels. Preliminary studies on general three dimensional geometries with\nunstructured FEM meshes suggest that the proposed direct DD methodology offers\nsignificant memory advantages over highly optimized, high-performance sparse\ndirect solver libraries, while maintaining approximately comparable or slightly\nslower serial serial execution speed but with significantly better parallel and\nGPU processing prospects.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2020 17:55:28 GMT"}], "update_date": "2020-02-13", "authors_parsed": [["Moshfegh", "Javad", ""], ["Vouvakis", "Marinos N.", ""]]}, {"id": "2002.05026", "submitter": "Javad Moshfegh", "authors": "Javad Moshfegh, Dimitrios G. Makris, and Marinos N. Vouvakis", "title": "Parallel Direct Domain Decomposition Methods (D3M) for Finite Elements", "comments": "3 pages, 4 figures, 2019 IEEE International Symposium on Antennas and\n  Propagation and USNC-URSI Radio Science Meeting. IEEE, 2019", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.DC cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A parallel direct solution approach based on domain decomposition method\n(DDM) and directed acyclic graph (DAG) scheduling is outlined. Computations are\nrepresented as a sequence of small tasks that operate on domains of DDM or\ndense matrix blocks of a reduced matrix. These tasks can be statically\nscheduled for parallel execution using their DAG dependencies and weights that\ndepend on estimates of computation and communication costs. Performance\ncomparison with MUMPS 5.1.2 on electrically large problems suggest up to 20%\nbetter parallel efficiency, 30% less memory and slightly faster in run-time,\nwhile maintaining the same accuracy.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2020 17:38:43 GMT"}], "update_date": "2020-02-13", "authors_parsed": [["Moshfegh", "Javad", ""], ["Makris", "Dimitrios G.", ""], ["Vouvakis", "Marinos N.", ""]]}, {"id": "2002.05346", "submitter": "Roy Dong", "authors": "Roy Dong, Erik Miehling, Cedric Langbort", "title": "Protecting Consumers Against Personalized Pricing: A Stopping Time\n  Approach", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The widespread availability of behavioral data has led to the development of\ndata-driven personalized pricing algorithms: sellers attempt to maximize their\nrevenue by estimating the consumer's willingness-to-pay and pricing\naccordingly. Our objective is to develop algorithms that protect consumer\ninterests against personalized pricing schemes. In this paper, we consider a\nconsumer who learns more and more about a potential purchase across time, while\nsimultaneously revealing more and more information about herself to a potential\nseller. We formalize a strategic consumer's purchasing decision when\ninteracting with a seller who uses personalized pricing algorithms, and\ncontextualize this problem among the existing literature in optimal stopping\ntime theory and computational finance. We provide an algorithm that consumers\ncan use to protect their own interests against personalized pricing algorithms.\nThis algorithmic stopping method uses sample paths to train estimates of the\noptimal stopping time. To the best of our knowledge, this is one of the first\nworks that provides computational methods for the consumer to maximize her\nutility when decision making under surveillance. We demonstrate the efficacy of\nthe algorithmic stopping method using a numerical simulation, where the seller\nuses a Kalman filter to approximate the consumer's valuation and sets prices\nbased on myopic expected revenue maximization. Compared to a myopic purchasing\nstrategy, we demonstrate increased payoffs for the consumer in expectation.\n", "versions": [{"version": "v1", "created": "Wed, 12 Feb 2020 02:28:30 GMT"}], "update_date": "2020-02-14", "authors_parsed": [["Dong", "Roy", ""], ["Miehling", "Erik", ""], ["Langbort", "Cedric", ""]]}, {"id": "2002.05699", "submitter": "Saeed Sharifi-Malvajerdi", "authors": "Emily Diana, Hadi Elzayn, Michael Kearns, Aaron Roth, Saeed\n  Sharifi-Malvajerdi, Juba Ziani", "title": "Differentially Private Call Auctions and Market Impact", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.GT cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose and analyze differentially private (DP) mechanisms for call\nauctions as an alternative to the complex and ad-hoc privacy efforts that are\ncommon in modern electronic markets. We prove that the number of shares cleared\nin the DP mechanisms compares favorably to the non-private optimal and provide\na matching lower bound. We analyze the incentive properties of our mechanisms\nand their behavior under natural no-regret learning dynamics by market\nparticipants. We include simulation results and connections to the finance\nliterature on market impact.\n", "versions": [{"version": "v1", "created": "Thu, 13 Feb 2020 18:40:17 GMT"}], "update_date": "2020-02-14", "authors_parsed": [["Diana", "Emily", ""], ["Elzayn", "Hadi", ""], ["Kearns", "Michael", ""], ["Roth", "Aaron", ""], ["Sharifi-Malvajerdi", "Saeed", ""], ["Ziani", "Juba", ""]]}, {"id": "2002.06206", "submitter": "Keiji Onishi", "authors": "Keiji Onishi and Makoto Tsubokura", "title": "Topology-free immersed boundary method for incompressible turbulence\n  flows: An aerodynamic simulation for 'dirty' CAD geometry", "comments": "33 pages, 23 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE physics.comp-ph physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  To design a method to solve the issues of handling 'dirty' and highly complex\ngeometries, the topology-free method combined with the immersed boundary method\nis presented for viscous and incompressible flows at a high Reynolds number.\nThe method simultaneously employs a ghost-cell technique and distributed\nforcing technique to impose the boundary conditions. An axis-projected\ninterpolation scheme is used to avoid searching failures during fluid and solid\nidentification. This method yields a topology-free immersed boundary, which\nparticularly suits flow simulations of highly complex geometries. Difficulties\ngenerally arise when generating the calculation grid for these scenarios. This\nmethod allows dirty data to be handled without any preparatory treatment work\nto simplify or clean-up the geometry. This method is also applicable to the\ncoherent structural turbulence model employed in this study. The verification\ncases, used in conjunction with the second-order central-difference scheme,\nresulted in first-order accuracy at finer resolution, although the coarser\nresolution retained second-order accuracy. This method is fully parallelized\nfor distributed memory platforms. In this study, the accuracy and fidelity of\nthis method were examined by simulating the flow around the bluff body, past a\nflat plate, and past dirty spheres. These simulations were compared with\nexperimental data and other established results. Finally, results from the\nsimulation of practical applications demonstrate the ability of the method to\nmodel highly complex, non-canonical three-dimensional flows. The countermeasure\nbased on the accurate classification of geometric features has provided a\nrobust and reasonable solution.\n", "versions": [{"version": "v1", "created": "Sat, 15 Feb 2020 08:30:35 GMT"}], "update_date": "2020-02-18", "authors_parsed": [["Onishi", "Keiji", ""], ["Tsubokura", "Makoto", ""]]}, {"id": "2002.06842", "submitter": "Yongbo Deng Dr.", "authors": "Yongbo Deng, Weihong Zhang, Jihong Zhu, Junqiang Bai, Zhenyu Liu, Jan\n  G. Korvink", "title": "Topology optimization of surface flows", "comments": "Need further revision", "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.comp-ph cs.CE physics.flu-dyn", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents a topology optimization approach for surface flows, which\ncan represent the viscous and incompressible fluidic motions at the\nsolid/liquid and liquid/vapor interfaces. The fluidic motions on such material\ninterfaces can be described by the surface Navier-Stokes equations defined on\n2-manifolds or two-dimensional manifolds, where the elementary tangential\ncalculus is implemented in terms of exterior differential operators expressed\nin a Cartesian system. Based on the topology optimization model for fluidic\nflows with porous medium filling the design domain, an artificial Darcy\nfriction is added to the area force term of the surface Navier-Stokes equations\nand the physical area forces are penalized to eliminate their existence in the\nfluidic regions and to avoid the invalidity of the porous medium model.\nTopology optimization for steady and unsteady surface flows can be implemented\nby iteratively evolving the impermeability of the porous medium on the\n2-manifolds, where the impermeability is interpolated by the material density\nderived from a design variable. The related partial differential equations are\nsolved by using the surface finite element method. Numerical examples have been\nprovided to demonstrate this topology optimization approach for surface flows,\nincluding the boundary velocity driven flows, area force driven flows and\nconvection-diffusion flows.\n", "versions": [{"version": "v1", "created": "Mon, 17 Feb 2020 08:56:33 GMT"}, {"version": "v2", "created": "Sat, 22 Feb 2020 11:18:41 GMT"}, {"version": "v3", "created": "Mon, 16 Mar 2020 19:52:06 GMT"}, {"version": "v4", "created": "Sat, 28 Mar 2020 18:52:48 GMT"}, {"version": "v5", "created": "Mon, 11 May 2020 15:37:32 GMT"}, {"version": "v6", "created": "Tue, 12 May 2020 08:55:16 GMT"}, {"version": "v7", "created": "Mon, 11 May 2020 12:35:42 GMT"}, {"version": "v8", "created": "Fri, 15 May 2020 00:29:57 GMT"}], "update_date": "2020-05-18", "authors_parsed": [["Deng", "Yongbo", ""], ["Zhang", "Weihong", ""], ["Zhu", "Jihong", ""], ["Bai", "Junqiang", ""], ["Liu", "Zhenyu", ""], ["Korvink", "Jan G.", ""]]}, {"id": "2002.07595", "submitter": "Chenye Wu", "authors": "Jian Sun and Chenye Wu", "title": "Market Power in Convex Hull Pricing", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CE econ.GN q-fin.EC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The start up costs in many kinds of generators lead to complex cost\nstructures, which in turn yield severe market loopholes in the locational\nmarginal price (LMP) scheme. Convex hull pricing (a.k.a. extended LMP) is\nproposed to improve the market efficiency by providing the minimal uplift\npayment to the generators. In this letter, we consider a stylized model where\nall generators share the same generation capacity. We analyze the generators'\npossible strategic behaviors in such a setting, and then propose an index for\nmarket power quantification in the convex hull pricing schemes.\n", "versions": [{"version": "v1", "created": "Sat, 15 Feb 2020 09:10:06 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Sun", "Jian", ""], ["Wu", "Chenye", ""]]}, {"id": "2002.07600", "submitter": "Chengping Rao", "authors": "Chengping Rao and Yang Liu", "title": "Three-dimensional convolutional neural network (3D-CNN) for\n  heterogeneous material homogenization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Homogenization is a technique commonly used in multiscale computational\nscience and engineering for predicting collective response of heterogeneous\nmaterials and extracting effective mechanical properties. In this paper, a\nthree-dimensional deep convolutional neural network (3D-CNN) is proposed to\npredict the effective material properties for representative volume elements\n(RVEs) with random spherical inclusions. The high-fidelity dataset generated by\na computational homogenization approach is used for training the 3D-CNN models.\nThe inference results of the trained networks on unseen data indicate that the\nnetwork is capable of capturing the microstructural features of RVEs and\nproduces an accurate prediction of effective stiffness and Poisson's ratio. The\nbenefits of the 3D-CNN over conventional finite-element-based homogenization\nwith regard to computational efficiency, uncertainty quantification and model's\ntransferability are discussed in sequence. We find the salient features of the\n3D-CNN approach make it a potentially suitable alternative for facilitating\nmaterial design with fast product design iteration and efficient uncertainty\nquantification.\n", "versions": [{"version": "v1", "created": "Fri, 14 Feb 2020 17:52:48 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Rao", "Chengping", ""], ["Liu", "Yang", ""]]}, {"id": "2002.07602", "submitter": "Gabriele Boncoraglio", "authors": "Gabriele Boncoraglio, Charbel Farhat and Charbel Bou-Mosleh", "title": "Model Reduction Framework with a New Take on Active Subspaces for\n  Optimization Problems with Linearized Fluid-Structure Interaction Constraints", "comments": null, "journal-ref": null, "doi": "10.1002/nme.6376", "report-no": null, "categories": "math.NA cs.CE cs.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, a new take on the concept of an active subspace for reducing\nthe dimension of the design parameter space in a multidisciplinary analysis and\noptimization (MDAO) problem is proposed. The new approach is intertwined with\nthe concepts of adaptive parameter sampling, projection-based model order\nreduction, and a database of linear, projection-based reduced-order models\nequipped with interpolation on matrix manifolds, in order to construct an\nefficient computational framework for MDAO. The framework is fully developed\nfor MDAO problems with linearized fluid-structure interaction constraints. It\nis applied to the aeroelastic tailoring, under flutter constraints, of two\ndifferent flight systems: a flexible configuration of NASA's Common Research\nModel; and NASA's Aeroelastic Research Wing #2 (ARW-2). The obtained results\nillustrate the feasibility of the computational framework for realistic MDAO\nproblems and highlight the benefits of the new approach for constructing an\nactive subspace in both terms of solution optimality and wall-clock time\nreduction\n", "versions": [{"version": "v1", "created": "Fri, 14 Feb 2020 02:52:26 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Boncoraglio", "Gabriele", ""], ["Farhat", "Charbel", ""], ["Bou-Mosleh", "Charbel", ""]]}, {"id": "2002.07627", "submitter": "Amir M. Mirzendehdel", "authors": "Amir M. Mirzendehdel, Morad Behandish, and Saigopal Nelaturi", "title": "Topology Optimization with Accessibility Constraint for Multi-Axis\n  Machining", "comments": null, "journal-ref": null, "doi": "10.1016/j.cad.2020.102825", "report-no": null, "categories": "cs.CE cs.CG", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper, we present a topology optimization (TO) framework to enable\nautomated design of mechanical components while ensuring the result can be\nmanufactured using multi-axis machining. Although TO improves the part's\nperformance, the as-designed model is often geometrically too complex to be\nmachined and the as-manufactured model can significantly vary due to machining\nconstraints that are not accounted for during TO. In other words, many of the\noptimized design features cannot be accessed by a machine tool without\ncolliding with the part (or fixtures). The subsequent post-processing to make\nthe part machinable with the given setup requires trial-and-error without\nguarantees on preserving the optimized performance. Our proposed approach is\nbased on the well-established accessibility analysis formulation using\nconvolutions in configuration space that is extensively used in spatial\nplanning and robotics. We define an 'inaccessibility measure field' (IMF) over\nthe design domain to identify non-manufacturable features and quantify their\ncontribution to non-manufacturability. The IMF is used to penalize the\nsensitivity field of performance objectives and constraints to prevent\nformation of inaccessible regions. Unlike existing discrete formulations, our\nIMF provides a continuous spatial field that is desirable for TO convergence.\nOur approach applies to arbitrary geometric complexity of the part, tools, and\nfixtures, and is highly parallelizable on multi-core architecture. We\ndemonstrate the effectiveness of our framework on benchmark and realistic\nexamples in 2D and 3D. We also show that it is possible to directly construct\nmanufacturing plans for the optimized designs based on the accessibility\ninformation.\n", "versions": [{"version": "v1", "created": "Sun, 16 Feb 2020 18:54:45 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Mirzendehdel", "Amir M.", ""], ["Behandish", "Morad", ""], ["Nelaturi", "Saigopal", ""]]}, {"id": "2002.07741", "submitter": "P\\'al Andr\\'as Papp", "authors": "P\\'al Andr\\'as Papp, Roger Wattenhofer", "title": "Default Ambiguity: Finding the Best Solution to the Clearing Problem", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cs.CC q-fin.MF", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study financial networks with debt contracts and credit default swaps\nbetween specific pairs of banks. Given such a financial system, we want to\ndecide which of the banks are in default, and how much of their liabilities\nthese defaulting banks can pay. There can easily be multiple different\nsolutions to this problem, leading to a situation of default ambiguity and a\nrange of possible solutions to implement for a financial authority.\n  In this paper, we study the general properties of the solution space of such\nfinancial systems, and analyze a wide range of reasonable objective functions\nfor selecting from the set of solutions. Examples of such objective functions\ninclude minimizing the number of defaulting banks, minimizing the amount of\nunpaid debt, maximizing the number of satisfied banks, maximizing the equity of\na specific bank, finding the most balanced distribution of equity, and many\nothers. We show that for all of these objective functions, it is not only\nNP-hard to find the optimal solution, but it is also NP-hard to approximate\nthis optimum: for each objective function, we show an inapproximability either\nto an $n^{1/2-\\epsilon}$ or to an $n^{1/4-\\epsilon}$ factor for any\n$\\epsilon>0$, with $n$ denoting the number of banks in the system. Thus even if\nan authority has clear criteria to select a solution in case of default\nambiguity, it is computationally intractable to find a solution that is\nreasonably good in terms of this criteria. We also show that our hardness\nresults hold in a wide range of different model variants.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 17:17:15 GMT"}], "update_date": "2020-02-19", "authors_parsed": [["Papp", "Pál András", ""], ["Wattenhofer", "Roger", ""]]}, {"id": "2002.08235", "submitter": "Teeratorn Kadeethum", "authors": "Teeratorn Kadeethum, Thomas M Jorgensen, Hamidreza M Nick", "title": "Physics-informed Neural Networks for Solving Nonlinear Diffusivity and\n  Biot's equations", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0232683", "report-no": null, "categories": "cs.CE cs.LG cs.NA math.NA", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper presents the potential of applying physics-informed neural\nnetworks for solving nonlinear multiphysics problems, which are essential to\nmany fields such as biomedical engineering, earthquake prediction, and\nunderground energy harvesting. Specifically, we investigate how to extend the\nmethodology of physics-informed neural networks to solve both the forward and\ninverse problems in relation to the nonlinear diffusivity and Biot's equations.\nWe explore the accuracy of the physics-informed neural networks with different\ntraining example sizes and choices of hyperparameters. The impacts of the\nstochastic variations between various training realizations are also\ninvestigated. In the inverse case, we also study the effects of noisy\nmeasurements. Furthermore, we address the challenge of selecting the\nhyperparameters of the inverse model and illustrate how this challenge is\nlinked to the hyperparameters selection performed for the forward one.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2020 15:22:26 GMT"}], "update_date": "2020-07-01", "authors_parsed": [["Kadeethum", "Teeratorn", ""], ["Jorgensen", "Thomas M", ""], ["Nick", "Hamidreza M", ""]]}, {"id": "2002.08672", "submitter": "Michael Stiglmayr", "authors": "Jan Backhaus, Matthias Bolten, Onur Tanil Doganay, Matthias Ehrhardt,\n  Benedikt Engel, Christian Frey, Hanno Gottschalk, Michael G\\\"unther, Camilla\n  Hahn, Jens J\\\"aschke, Peter Jaksch, Kathrin Klamroth, Alexander Liefke,\n  Daniel Luft, Lucas M\\\"ade, Vincent Marciniak, Marco Reese, Johanna Schultes,\n  Volker Schulz, Sebastian Schmitz, Johannes Steiner, and Michael Stiglmayr", "title": "GivEn -- Shape Optimization for Gas Turbines in Volatile Energy Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "math.OC cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper describes the project GivEn that develops a novel multicriteria\noptimization process for gas turbine blades and vanes using modern \"adjoint\"\nshape optimization algorithms. Given the many start and shut-down processes of\ngas power plants in volatile energy grids, besides optimizing gas turbine\ngeometries for efficiency, the durability understood as minimization of the\nprobability of failure is a design objective of increasing importance. We also\ndescribe the underlying coupling structure of the multiphysical simulations and\nuse modern, gradient based multicriteria optimization procedures to enhance the\nexploration of Pareto-optimal solutions.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 11:03:01 GMT"}], "update_date": "2020-02-24", "authors_parsed": [["Backhaus", "Jan", ""], ["Bolten", "Matthias", ""], ["Doganay", "Onur Tanil", ""], ["Ehrhardt", "Matthias", ""], ["Engel", "Benedikt", ""], ["Frey", "Christian", ""], ["Gottschalk", "Hanno", ""], ["Günther", "Michael", ""], ["Hahn", "Camilla", ""], ["Jäschke", "Jens", ""], ["Jaksch", "Peter", ""], ["Klamroth", "Kathrin", ""], ["Liefke", "Alexander", ""], ["Luft", "Daniel", ""], ["Mäde", "Lucas", ""], ["Marciniak", "Vincent", ""], ["Reese", "Marco", ""], ["Schultes", "Johanna", ""], ["Schulz", "Volker", ""], ["Schmitz", "Sebastian", ""], ["Steiner", "Johannes", ""], ["Stiglmayr", "Michael", ""]]}, {"id": "2002.09515", "submitter": "Thibaut Astic", "authors": "Thibaut Astic, Lindsey J. Heagy, and Douglas W. Oldenburg", "title": "Petrophysically and geologically guided multi-physics inversion using a\n  dynamic Gaussian mixture model", "comments": "47 pages in one column format; 14 figures; to be published in\n  Geophysical Journal International", "journal-ref": null, "doi": "10.1093/gji/ggaa378", "report-no": null, "categories": "physics.geo-ph cs.CE stat.AP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In a previous paper, we introduced a framework for carrying out\npetrophysically and geologically guided geophysical inversions. In that\nframework, petrophysical and geological information is modelled with a Gaussian\nMixture Model (GMM). In the inversion, the GMM serves as a prior for the\ngeophysical model. The formulation was confined to problems in which a single\nphysical property model was sought, with a single geophysical dataset. In this\npaper, we extend that framework to jointly invert multiple geophysical datasets\nthat depend on multiple physical properties. The petrophysical and geological\ninformation is used to couple geophysical surveys that, otherwise, rely on\nindependent physics. This requires advancements in two areas. First, an\nextension from a univariate to a multivariate analysis of the petrophysical\ndata, and their inclusion within the inverse problem, is necessary. Second, we\naddress the practical issues of simultaneously inverting data from multiple\nsurveys and finding a solution that acceptably reproduces each one, along with\nthe petrophysical and geological information. To illustrate the efficacy of our\napproach and the advantages of carrying out multi-physics inversions, we invert\nsynthetic gravity and magnetic data associated with a kimberlite deposit. The\nkimberlite pipe contains two distinct facies embedded in a host rock. Inverting\nthe datasets individually leads to a binary geological model: background or\nkimberlite. A multi-physics inversion, with petrophysical information,\ndifferentiates between the two main kimberlite facies of the pipe. Through this\nexample, we also highlight the capabilities of our framework to work with\ninterpretive geologic assumptions when minimal quantitative information is\navailable. In those cases, the dynamic updates of the Gaussian Mixture Model\nallow us to perform multi-physics inversions by learning a petrophysical model.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2020 19:20:17 GMT"}, {"version": "v2", "created": "Tue, 23 Jun 2020 19:54:14 GMT"}, {"version": "v3", "created": "Mon, 19 Oct 2020 03:50:04 GMT"}], "update_date": "2020-10-20", "authors_parsed": [["Astic", "Thibaut", ""], ["Heagy", "Lindsey J.", ""], ["Oldenburg", "Douglas W.", ""]]}, {"id": "2002.10231", "submitter": "Matthew R Kuhn", "authors": "Matthew R. Kuhn, Kiichi Suzuki, Ali Daouadji", "title": "Linear-frictional contact model for 3D discrete element simulations of\n  granular systems", "comments": "6 figures", "journal-ref": "Int J Numer Methods Eng. 2020, 121(3), 560-569", "doi": "10.1002/nme.6216", "report-no": null, "categories": "cs.CE cond-mat.soft", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The linear-frictional contact model is the most commonly used contact\nmechanism for discrete element (DEM) simulations of granular materials. Linear\nsprings with a frictional slider are used for modeling interactions in\ndirections normal and tangential to the contact surface. Although the model is\nsimple in two dimensions, its implementation in 3D faces certain subtle\nchallenges, and the particle interactions that occur within a single time-step\nrequire careful modeling with a robust algorithm. The paper details a 3D\nalgorithm that accounts for the changing direction of the tangential force\nwithin a time-step, the transition from elastic to slip behavior within a\ntime-step, possible contact sliding during only part of a time-step, and\ntwirling and rotation of the tangential force during a time-step. Without three\nof these adjustments, errors are introduced in the incremental stiffness of an\nassembly. Without the fourth adjustment, the resulting stress tensor is not\nonly incorrect, it is no longer a tensor. The algorithm also computes the work\nincrements during a time-step, both elastic and dissipative.\n", "versions": [{"version": "v1", "created": "Thu, 9 Jan 2020 00:09:53 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Kuhn", "Matthew R.", ""], ["Suzuki", "Kiichi", ""], ["Daouadji", "Ali", ""]]}, {"id": "2002.10244", "submitter": "Sai Sidhardh", "authors": "Sansit Patnaik, Sai Sidhardh, Fabio Semperlotti", "title": "Fractional-Order Models for the Static and Dynamic Analysis of Nonlocal\n  Plates", "comments": "26 pages, 3 figures, 13 Tables. arXiv admin note: text overlap with\n  arXiv:2001.06885, arXiv:2002.07148", "journal-ref": null, "doi": "10.1016/j.cnsns.2020.105601", "report-no": null, "categories": "cs.CE cs.NA math.AP math.DS math.NA", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  This study presents the analytical formulation and the finite element\nsolution of fractional order nonlocal plates under both Mindlin and Kirchoff\nformulations. By employing consistent definitions for fractional-order\nkinematic relations, the governing equations and the associated boundary\nconditions are derived based on variational principles. Remarkably, the\nfractional-order nonlocal model gives rise to a self-adjoint and\npositive-definite system that accepts a unique solution. Further, owing to the\ndifficulty in obtaining analytical solutions to this fractional-order\ndiffer-integral problem, a 2D finite element model for the fractional-order\ngoverning equations is presented. Following a thorough validation with\nbenchmark problems, the 2D fractional finite element model is used to study the\nstatic as well as the free dynamic response of fractional-order plates subject\nto various loading and boundary conditions. It is established that the\nfractional-order nonlocality leads to a reduction in the stiffness of the plate\nstructure thereby increasing the displacements and reducing the natural\nfrequency of vibration of the plates. Further, it is seen that the effect of\nnonlocality is stronger on the higher modes of vibration when compared to the\nfundamental mode. These effects of the fractional-order nonlocality are noted\nirrespective of the nature of the boundary conditions. More specifically, the\nfractional-order model of nonlocal plates is free from boundary effects that\nlead to paradoxical predictions such as hardening and absence of nonlocal\neffects in classical integral approaches to nonlocal elasticity. This\nconsistency in the predictions is a result of the well-posed nature of the\nfractional-order governing equations that accept a unique solution.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2020 22:01:46 GMT"}], "update_date": "2021-02-03", "authors_parsed": [["Patnaik", "Sansit", ""], ["Sidhardh", "Sai", ""], ["Semperlotti", "Fabio", ""]]}, {"id": "2002.10246", "submitter": "Nigel Morris", "authors": "Nigel Morris, Adrian Butscher and Francesco Iorio", "title": "A subtractive manufacturing constraint for level set topology\n  optimization", "comments": null, "journal-ref": "Structural and Multidisciplinary Optimization (2020)", "doi": "10.1007/s00158-019-02436-y", "report-no": null, "categories": "cs.CE math.OC", "license": "http://creativecommons.org/publicdomain/zero/1.0/", "abstract": "  We present a method for enforcing manufacturability constraints in generated\nparts such that they will be automatically ready for fabrication using a\nsubtractive approach. We primarily target multi-axis CNC milling approaches but\nthe method should generalize to other subtractive methods as well. To this end,\nwe take as user input: the radius of curvature of the tool bit, a coarse model\nof the tool head and optionally a set of milling directions. This allows us to\nenforce the following manufacturability conditions: 1) surface smoothness such\nthat the radius of curvature of the part does not exceed the milling bit\nradius, 2) orientation such that every part of the surface to be milled is\nvisible from at least one milling direction, 3) accessibility such that every\nsurface patch can be reached by the tool bit without interference with the tool\nor head mount. We will show how to efficiently enforce the constraint during\nlevel set-based topology optimization modifying the advection velocity such\nthat at each iteration the topology optimization maintains a descent\noptimization direction and does not violate any of the manufacturability\nconditions. This approach models the actual subtractive process by carving away\nmaterial accessible to the machine at each iteration until a local optimum is\nachieved.\n", "versions": [{"version": "v1", "created": "Wed, 19 Feb 2020 19:28:11 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Morris", "Nigel", ""], ["Butscher", "Adrian", ""], ["Iorio", "Francesco", ""]]}, {"id": "2002.10253", "submitter": "Ruiyang Zhang", "authors": "Ruiyang Zhang, Yang Liu, Hao Sun", "title": "Physics-Informed Multi-LSTM Networks for Metamodeling of Nonlinear\n  Structures", "comments": "21 pages, 13 figures", "journal-ref": null, "doi": "10.1016/j.cma.2020.113226", "report-no": null, "categories": "cs.CE eess.SP", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper introduces an innovative physics-informed deep learning framework\nfor metamodeling of nonlinear structural systems with scarce data. The basic\nconcept is to incorporate physics knowledge (e.g., laws of physics, scientific\nprinciples) into deep long short-term memory (LSTM) networks, which boosts the\nlearning within a feasible solution space. The physics constraints are embedded\nin the loss function to enforce the model training which can accurately capture\nlatent system nonlinearity even with very limited available training datasets.\nSpecifically for dynamic structures, physical laws of equation of motion, state\ndependency and hysteretic constitutive relationship are considered to construct\nthe physics loss. In particular, two physics-informed multi-LSTM network\narchitectures are proposed for structural metamodeling. The satisfactory\nperformance of the proposed framework is successfully demonstrated through two\nillustrative examples (e.g., nonlinear structures subjected to ground motion\nexcitation). It turns out that the embedded physics can alleviate overfitting\nissues, reduce the need of big training datasets, and improve the robustness of\nthe trained model for more reliable prediction. As a result, the\nphysics-informed deep learning paradigm outperforms classical\nnon-physics-guided data-driven neural networks.\n", "versions": [{"version": "v1", "created": "Tue, 18 Feb 2020 10:35:02 GMT"}], "update_date": "2020-07-15", "authors_parsed": [["Zhang", "Ruiyang", ""], ["Liu", "Yang", ""], ["Sun", "Hao", ""]]}, {"id": "2002.10255", "submitter": "Jorge Luis Barrera Cruz", "authors": "Jorge L. Barrera, Kurt Maute", "title": "Ambiguous phase assignment of discretized 3D geometries in topology\n  optimization", "comments": null, "journal-ref": null, "doi": "10.1016/j.cma.2020.113201", "report-no": null, "categories": "cs.CE math.OC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Level set-based immersed boundary techniques operate on nonconforming meshes\nwhile providing a crisp definition of interface and external boundaries. In\nsuch techniques, an isocontour of a level set field interpolated from nodal\nlevel set values defines a problem's geometry. If the interface is explicitly\ntracked, the intersected elements are typically divided into sub-elements to\nwhich a phase needs to be assigned. Due to loss of information in the\ndiscretization of the level set field, certain geometrical configurations allow\nfor ambiguous phase assignment of sub-elements, and thus ambiguous definition\nof the interface. The study presented here focuses on analyzing these\ntopological ambiguities in embedded geometries constructed from discretized\nlevel set fields on hexahedral meshes. The analysis is performed on\nthree-dimensional problems where several intersection configurations can\nsignificantly affect the problem's topology. This is in contrast to\ntwo-dimensional problems where ambiguous topological features exist only in one\nintersection configuration and identifying and resolving them is\nstraightforward. A set of rules that resolve these ambiguities for two-phase\nproblems is proposed, and algorithms for their implementations are provided.\nThe influence of these rules on the evolution of the geometry in the\noptimization process is investigated with linear elastic topology optimization\nproblems. These problems are solved by an explicit level set topology\noptimization framework that uses the extended finite element method to predict\nphysical responses. This study shows that the choice of a rule to resolve\ntopological features can result in drastically different final geometries.\nHowever, for the problems studied in this paper, the performances of the\noptimized design do not differ.\n", "versions": [{"version": "v1", "created": "Thu, 20 Feb 2020 17:49:21 GMT"}], "update_date": "2020-07-15", "authors_parsed": [["Barrera", "Jorge L.", ""], ["Maute", "Kurt", ""]]}, {"id": "2002.10401", "submitter": "Subramanian Sankaranarayanan", "authors": "Henry Chan, Badri Narayanan, Mathew Cherukara, Troy D. Loeffler,\n  Michael G. Sternberg, Anthony Avarca, and Subramanian K. R. S.\n  Sankaranarayanan", "title": "BLAST: Bridging Length/time scales via Atomistic Simulation Toolkit", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE cond-mat.mes-hall cond-mat.mtrl-sci", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ever-increasing power of supercomputers coupled with highly scalable\nsimulation codes have made molecular dynamics an indispensable tool in\napplications ranging from predictive modeling of materials to computational\ndesign and discovery of new materials for a broad range of applications.\nMulti-fidelity scale bridging between the various flavors of molecular dynamics\ni.e. ab-initio, classical and coarse-grained models has remained a\nlong-standing challenge. Here, we introduce our framework BLAST (Bridging\nLength/time scales via Atomistic Simulation Toolkit) that leverages machine\nlearning principles to address this challenge. BLAST is a multi-fidelity scale\nbridging framework that provide users with the capabilities to train and\ndevelop their own classical atomistic and coarse-grained interatomic potentials\n(force fields) for molecular simulations. BLAST is designed to address several\nlong-standing problems in the molecular simulations community, such as\nunintended misuse of existing force fields due to knowledge gap between\ndevelopers and users, bottlenecks in traditional force field development\napproaches, and other issues relating to the accuracy, efficiency, and\ntransferability of force fields. Here, we discuss several important aspects in\nforce field development and highlight features in BLAST that enable its\nfunctionalities and ease of use.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2020 12:47:57 GMT"}], "update_date": "2020-02-25", "authors_parsed": [["Chan", "Henry", ""], ["Narayanan", "Badri", ""], ["Cherukara", "Mathew", ""], ["Loeffler", "Troy D.", ""], ["Sternberg", "Michael G.", ""], ["Avarca", "Anthony", ""], ["Sankaranarayanan", "Subramanian K. R. S.", ""]]}, {"id": "2002.10706", "submitter": "Amal Alghamdi", "authors": "Amal Alghamdi, Marc A. Hesse, Jingyi Chen, Omar Ghattas", "title": "Bayesian Poroelastic Aquifer Characterization from InSAR Surface\n  Deformation Data. Part I: Maximum A Posteriori Estimate", "comments": null, "journal-ref": null, "doi": "10.1029/2020WR027391", "report-no": null, "categories": "physics.geo-ph cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Characterizing the properties of groundwater aquifers is essential for\npredicting aquifer response and managing groundwater resources. In this work,\nwe develop a high-dimensional scalable Bayesian inversion framework governed by\na three-dimensional quasi-static linear poroelastic model to characterize\nlateral permeability variations in groundwater aquifers. We determine the\nmaximum a posteriori (MAP) point of the posterior permeability distribution\nfrom centimeter-level surface deformation measurements obtained from\nInterferometric Synthetic Aperture Radar (InSAR). The scalability of our method\nto high parameter dimension is achieved through the use of adjoint-based\nderivatives, inexact Newton methods to determine the MAP point, and a Mat\\'ern\nclass sparse prior precision operator. Together, these guarantee that the MAP\npoint is found at a cost, measured in number of forward/adjoint poroelasticity\nsolves, that is independent of the parameter dimension. We apply our\nmethodology to a test case for a municipal well in Mesquite, Nevada, in which\nInSAR and GPS surface deformation data are available. We solve problems with up\nto 320,824 state variable degrees of freedom (DOFs) and 16,896 parameter DOFs.\nA consistent treatment of noise level is employed so that the aquifer\ncharacterization result does not depend on the pixel spacing of surface\ndeformation data. Our results show that the use of InSAR data significantly\nimproves characterization of lateral aquifer heterogeneity, and the InSAR-based\naquifer characterization recovers complex lateral displacement trends observed\nby independent daily GPS measurements.\n", "versions": [{"version": "v1", "created": "Tue, 25 Feb 2020 07:30:18 GMT"}], "update_date": "2020-12-02", "authors_parsed": [["Alghamdi", "Amal", ""], ["Hesse", "Marc A.", ""], ["Chen", "Jingyi", ""], ["Ghattas", "Omar", ""]]}, {"id": "2002.11479", "submitter": "Francesca Fantoni", "authors": "Francesca Fantoni and Andrea Bacigalupo", "title": "Wave propagation modeling in periodic elasto-thermo-diffusive materials\n  via multifield asymptotic homogenization", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "physics.flu-dyn cond-mat.mtrl-sci cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A multifield asymptotic homogenization technique for periodic\nthermo-diffusive elastic materials is provided in the present study. Field\nequations for the first-order equivalent medium are derived and overall\nconstitutive tensors are obtained in closed form. These lasts depend upon the\nmicro constitutive properties of the different phases composing the composite\nmaterial and upon periodic perturbation functions, which allow taking into\naccount the effects of microstructural heterogeneities. Perturbation functions\nare determined as solutions of recursive non homogeneous cell problems emanated\nfrom the substitution of asymptotic expansions of the micro fields in powers of\nthe microstructural characteristic size into local balance equations. Average\nfield equations of infinite order are also provided, whose formal solution can\nbe obtained through asymptotic expansions of the macrofields. With the aim of\ninvestigating dispersion properties of waves propagating inside the medium,\nproper integral transforms are applied to governing field equations of the\nhomogenized medium. A quadratic generalized eigenvalue problem is thus\nobtained, whose solution characterizes the complex valued frequency band\nstructure of the first-order equivalent material. The validity of the proposed\ntechnique has been confirmed by the very good matching obtained between\ndispersion curves of the homogenized medium and the lowest frequency ones\nrelative to the heterogeneous material. These lasts are computed from the\nresolution of a quadratic generalized eigenvalue problem over the periodic cell\nsubjected to Floquet-Bloch boundary conditions. An illustrative benchmark is\nconducted referring to a Solid Oxide Fuel Cell (SOFC)-like material, whose\nmicrostructure can be modeled through the spatial tessellation of the domain\nwith a periodic cell subjected to thermo-diffusive phenomena.\n", "versions": [{"version": "v1", "created": "Tue, 11 Feb 2020 15:31:35 GMT"}], "update_date": "2020-02-27", "authors_parsed": [["Fantoni", "Francesca", ""], ["Bacigalupo", "Andrea", ""]]}, {"id": "2002.11523", "submitter": "Evgeny Ponomarev", "authors": "Evgeny Ponomarev, Ivan Oseledets, Andrzej Cichocki", "title": "Using Reinforcement Learning in the Algorithmic Trading Problem", "comments": null, "journal-ref": "ISSN 1064-2269, Journal of Communications Technology and\n  Electronics, 2019, Vol. 64, No. 12, pp. 1450-1457", "doi": "10.1134/S1064226919120131", "report-no": null, "categories": "q-fin.TR cs.CE cs.NE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The development of reinforced learning methods has extended application to\nmany areas including algorithmic trading. In this paper trading on the stock\nexchange is interpreted into a game with a Markov property consisting of\nstates, actions, and rewards. A system for trading the fixed volume of a\nfinancial instrument is proposed and experimentally tested; this is based on\nthe asynchronous advantage actor-critic method with the use of several neural\nnetwork architectures. The application of recurrent layers in this approach is\ninvestigated. The experiments were performed on real anonymized data. The best\narchitecture demonstrated a trading strategy for the RTS Index futures\n(MOEX:RTSI) with a profitability of 66% per annum accounting for commission.\nThe project source code is available via the following link:\nhttp://github.com/evgps/a3c_trading.\n", "versions": [{"version": "v1", "created": "Wed, 26 Feb 2020 14:30:18 GMT"}], "update_date": "2020-02-28", "authors_parsed": [["Ponomarev", "Evgeny", ""], ["Oseledets", "Ivan", ""], ["Cichocki", "Andrzej", ""]]}, {"id": "2002.11612", "submitter": "Cecilia Hern\\'andez", "authors": "Daniel Inostroza, Cecilia Hern\\'andez, Diego Seco, Gonzalo Navarro,\n  and Alvaro Olivera-Nappa", "title": "Cell cycle and protein complex dynamics in discovering signaling\n  pathways", "comments": null, "journal-ref": "Journal of Bioinformatics and Computational Biology 2019", "doi": "10.1142/S0219720019500112", "report-no": null, "categories": "q-bio.MN cs.CE q-bio.QM", "license": "http://creativecommons.org/licenses/by/4.0/", "abstract": "  Signaling pathways are responsible for the regulation of cell processes, such\nas monitoring the external environment, transmitting information across\nmembranes, and making cell fate decisions. Given the increasing amount of\nbiological data available and the recent discoveries showing that many diseases\nare related to the disruption of cellular signal transduction cascades, in\nsilico discovery of signaling pathways in cell biology has become an active\nresearch topic in past years. However, reconstruction of signaling pathways\nremains a challenge mainly because of the need for systematic approaches for\npredicting causal relationships, like edge direction and activation/inhibition\namong interacting proteins in the signal flow. We propose an approach for\npredicting signaling pathways that integrates protein interactions, gene\nexpression, phenotypes, and protein complex information. Our method first finds\ncandidate pathways using a directed-edge-based algorithm and then defines a\ngraph model to include causal activation relationships among proteins, in\ncandidate pathways using cell cycle gene expression and phenotypes to infer\nconsistent pathways in yeast. Then, we incorporate protein complex coverage\ninformation for deciding on the final predicted signaling pathways. We show\nthat our approach improves the predictive results of the state of the art using\ndifferent ranking metrics.\n", "versions": [{"version": "v1", "created": "Wed, 26 Feb 2020 16:55:24 GMT"}, {"version": "v2", "created": "Mon, 6 Apr 2020 17:07:05 GMT"}], "update_date": "2020-04-07", "authors_parsed": [["Inostroza", "Daniel", ""], ["Hernández", "Cecilia", ""], ["Seco", "Diego", ""], ["Navarro", "Gonzalo", ""], ["Olivera-Nappa", "Alvaro", ""]]}, {"id": "2002.12142", "submitter": "Riya Aggarwal", "authors": "Riya Aggarwal, Mike Meylan, Bishnu Lamichhane, and Chris Wensrich", "title": "Energy Resolved Neutron Imaging for Strain Reconstruction using the\n  Finite Element Method", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A pulsed neutron imaging technique is used to reconstruct the residual strain\nwithin a polycrystalline material from Bragg edge strain images. This technique\noffers the possibility of a nondestructive analysis of strain fields with a\nhigh spatial resolution. A finite element approach is used to reconstruct the\nstrain using the least square method constrained by the conditions of\nequilibrium. The procedure is developed and verified by validating for a\ncantilevered beam problem. It is subsequently demonstrated by reconstructing\nthe strain from experimental data for a ring-and-plug sample, measured at the\nspallation neutron source RADEN at J-PARC in Japan. The reconstruction is\nvalidated by comparison with conventional constant wavelength strain\nmeasurements on the KOWARI diffractometer at ANSTO in Australia. It is also\nshown that the addition of a simple Tikhonov regularization can improve the\nreconstruction.\n", "versions": [{"version": "v1", "created": "Fri, 21 Feb 2020 07:01:08 GMT"}], "update_date": "2020-02-28", "authors_parsed": [["Aggarwal", "Riya", ""], ["Meylan", "Mike", ""], ["Lamichhane", "Bishnu", ""], ["Wensrich", "Chris", ""]]}, {"id": "2002.12401", "submitter": "Saipraneeth Gouravaraju", "authors": "Saipraneeth Gouravaraju, Roger A. Sauer, Sachin Singh Gautam", "title": "On the presence of a critical detachment angle in gecko spatula peeling\n  -- A numerical investigation using an adhesive friction model", "comments": "18 pages, 13 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.soft cs.CE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  A continuum-based computational contact model is employed to study coupled\nadhesion and friction in gecko spatulae. Nonlinear finite element analysis is\ncarried out to simulate spatula peeling from a rigid substrate. It is shown\nthat the \"frictional adhesion\" behavior, until now only observed from seta to\ntoe levels, is also present at the spatula level. It is shown that for\nsufficiently small spatula pad thickness, the spatula detaches at a constant\nangle known as the critical detachment angle irrespective of the peeling and\nshaft angles. The spatula reaches the same energy states at the jump-off\ncontact point, which directly relates to the invariance of the critical\ndetachment angle. This study also reveals that there is an optimum pad\nthickness associated with the invariance of the critical detachment angle. It\nis further observed that the sliding of the spatula pad is essential for the\ninvariance of the critical detachment angle.\n", "versions": [{"version": "v1", "created": "Thu, 27 Feb 2020 19:32:43 GMT"}], "update_date": "2020-03-02", "authors_parsed": [["Gouravaraju", "Saipraneeth", ""], ["Sauer", "Roger A.", ""], ["Gautam", "Sachin Singh", ""]]}, {"id": "2002.12846", "submitter": "Yibo Yang", "authors": "Songsong Ji, Gang Pang, Jiwei Zhang, Yibo Yang, Paris Perdikaris", "title": "Exact artificial boundary conditions of 1D semi-discretized peridynamics", "comments": "21 pages, 14 figures", "journal-ref": null, "doi": "10.1098/rspa.2021.0229", "report-no": null, "categories": "cs.CE cs.SY eess.SY", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The peridynamic theory reformulates the equations of continuum mechanics in\nterms of integro-differential equations instead of partial differential\nequations. It is not trivial to directly apply naive approach in artificial\nboundary conditions for continua to peridynamics modeling, because it usually\ninvolves semi-discretization scheme. In this paper, we present a new way to\nconstruct exact boundary conditions for semi-discretized peridynamics using\nkernel functions and recursive relations. Specially, kernel functions are used\nto characterize one single source are combined to construct the exact boundary\nconditions. The recursive relationships between the kernel functions are\nproposed, therefore the kernel functions can be computed through the ordinary\ndifferential system and integral system with high precision. The numerical\nresults demonstrate that the boundary condition has high accuracy. The proposed\nmethod can be applied to modeling of wave propagation of other nonlocal\ntheories and high dimensional cases.\n", "versions": [{"version": "v1", "created": "Tue, 25 Feb 2020 03:48:17 GMT"}], "update_date": "2021-07-07", "authors_parsed": [["Ji", "Songsong", ""], ["Pang", "Gang", ""], ["Zhang", "Jiwei", ""], ["Yang", "Yibo", ""], ["Perdikaris", "Paris", ""]]}]