[{"id": "0711.0455", "submitter": "Jacob Bock Axelsen", "authors": "Jacob Bock Axelsen, Sandeep Krishna and Kim Sneppen", "title": "Cost and Capacity of Signaling in the Escherichia coli Protein Reaction\n  Network", "comments": "21 pages, 6 figures", "journal-ref": "Axelsen JB, Krishna S & Sneppen K, Stat. Mech. (2008) P01018", "doi": "10.1088/1742-5468/2008/01/P01018", "report-no": null, "categories": "q-bio.MN cond-mat.soft", "license": null, "abstract": "  In systems biology new ways are required to analyze the large amount of\nexisting data on regulation of cellular processes. Recent work can be roughly\nclassified into either dynamical models of well-described subsystems, or\ncoarse-grained descriptions of the topology of the molecular networks at the\nscale of the whole organism. In order to bridge these two disparate approaches\none needs to develop simplified descriptions of dynamics and topological\nmeasures which address the propagation of signals in molecular networks. Here,\nwe consider the directed network of protein regulation in E. coli,\ncharacterizing its modularity in terms of its potential to transmit signals. We\ndemonstrate that the simplest measure based on identifying sub-networks of\nstrong components, within which each node could send a signal to every other\nnode, indeed partitions the network into functional modules. We then suggest\nmeasures to quantify the cost and spread associated with sending a signal\nbetween any particular pair of proteins. Thereby, we address the signalling\nspecificity within and between modules, and show that in the regulation of\nE.coli there is a systematic reduction of the cost and spread for signals\ntraveling over more than two intermediate reactions.\n", "versions": [{"version": "v1", "created": "Sat, 3 Nov 2007 14:05:15 GMT"}], "update_date": "2008-02-01", "authors_parsed": [["Axelsen", "Jacob Bock", ""], ["Krishna", "Sandeep", ""], ["Sneppen", "Kim", ""]]}, {"id": "0711.0554", "submitter": "Inbal Hecht", "authors": "Inbal Hecht (1), Eshel Ben-Jacob (1, 2), and Herbert Levine (1) ((1)\n  Center for Theoretical Biological Physics, University of California at San\n  Diego, La Jolla, CA, (2) School of Physics and Astronomy, Tel-Aviv\n  University, Israel)", "title": "Correlated Phenotypic Transitions to Competence in Bacterial Colonies", "comments": null, "journal-ref": null, "doi": "10.1103/PhysRevE.76.040901", "report-no": null, "categories": "q-bio.MN cond-mat.other", "license": null, "abstract": "  Genetic competence is a phenotypic state of a bacterial cell in which it is\ncapable of importing DNA, presumably to hasten its exploration of alternate\ngenes in its quest for survival under stress. Recently, it was proposed that\nthis transition is uncorrelated among different cells in the colony. Motivated\nby several discovered signaling mechanisms which create colony-level responses,\nwe present a model for the influence of quorum-sensing signals on a colony of\nB. Subtilis cells during the transition to genetic competence. Coupling to the\nexternal signal creates an effective inhibitory mechanism, which results in\nanti-correlation between the cycles of adjacent cells. We show that this\nscenario is consistent with the specific experimental measurement, which fails\nto detect some underlying collective signaling mechanisms. Rather, we suggest\nother parameters that should be used to verify the role of a quorum-sensing\nsignal. We also study the conditions under which phenotypic spatial patterns\nmay emerge.\n", "versions": [{"version": "v1", "created": "Sun, 4 Nov 2007 23:12:03 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Hecht", "Inbal", ""], ["Ben-Jacob", "Eshel", ""], ["Levine", "Herbert", ""]]}, {"id": "0711.1522", "submitter": "Volkan Sevim", "authors": "Volkan Sevim, Per Arne Rikvold", "title": "Chaotic Gene Regulatory Networks Can Be Robust Against Mutations and\n  Noise", "comments": "JTB accepted", "journal-ref": "J. Theor. Biol. 253, 323-332 (2008)", "doi": "10.1016/j.jtbi.2008.03.003", "report-no": null, "categories": "q-bio.MN", "license": null, "abstract": "  Robustness to mutations and noise has been shown to evolve through\nstabilizing selection for optimal phenotypes in model gene regulatory networks.\nThe ability to evolve robust mutants is known to depend on the network\narchitecture. How do the dynamical properties and state-space structures of\nnetworks with high and low robustness differ? Does selection operate on the\nglobal dynamical behavior of the networks? What kind of state-space structures\nare favored by selection? We provide damage propagation analysis and an\nextensive statistical analysis of state spaces of these model networks to show\nthat the change in their dynamical properties due to stabilizing selection for\noptimal phenotypes is minor. Most notably, the networks that are most robust to\nboth mutations and noise are highly chaotic. Certain properties of chaotic\nnetworks, such as being able to produce large attractor basins, can be useful\nfor maintaining a stable gene-expression pattern. Our findings indicate that\nconventional measures of stability, such as the damage-propagation rate, do not\nprovide much information about robustness to mutations or noise in model gene\nregulatory networks.\n", "versions": [{"version": "v1", "created": "Fri, 9 Nov 2007 18:44:46 GMT"}, {"version": "v2", "created": "Mon, 17 Mar 2008 16:42:53 GMT"}], "update_date": "2008-07-07", "authors_parsed": [["Sevim", "Volkan", ""], ["Rikvold", "Per Arne", ""]]}, {"id": "0711.2208", "submitter": "Jacob Bock Axelsen", "authors": "Jacob Bock Axelsen, Sebastian Bernhardsson, Kim Sneppen", "title": "One Hub-One Process: A Tool Based View on Regulatory Network Topology", "comments": "18 pages, 3 figures, 5 supplementary figures", "journal-ref": "BMC Systems Biology 2008, 2:25", "doi": "10.1186/1752-0509-2-25", "report-no": null, "categories": "q-bio.MN cond-mat.soft", "license": null, "abstract": "  The relationship between the regulatory design and the functionality of\nmolecular networks is a key issue in biology. Modules and motifs have been\nassociated to various cellular processes, thereby providing anecdotal evidence\nfor performance based localization on molecular networks. To quantify\nstructure-function relationship we investigate similarities of proteins which\nare close in the regulatory network of the yeast Saccharomyces Cerevisiae. We\nfind that the topology of the regulatory network show weak remnants of its\nhistory of network reorganizations, but strong features of co-regulated\nproteins associated to similar tasks. This suggests that local topological\nfeatures of regulatory networks, including broad degree distributions, emerge\nas an implicit result of matching a number of needed processes to a finite\ntoolbox of proteins.\n", "versions": [{"version": "v1", "created": "Wed, 14 Nov 2007 14:16:39 GMT"}, {"version": "v2", "created": "Thu, 29 Nov 2007 15:02:23 GMT"}], "update_date": "2008-03-04", "authors_parsed": [["Axelsen", "Jacob Bock", ""], ["Bernhardsson", "Sebastian", ""], ["Sneppen", "Kim", ""]]}, {"id": "0711.2497", "submitter": "Pankaj Mehta", "authors": "Pankaj Mehta, Ranjan Mukhopadhyay, Ned S. Wingreen", "title": "Exponential sensitivity of noise-driven switching in genetic networks", "comments": "5 pages, 3 figures", "journal-ref": "Physical Biology 5, 026005 (2008)", "doi": "10.1088/1478-3975/5/2/026005", "report-no": null, "categories": "q-bio.MN cond-mat.stat-mech q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cells are known to utilize biochemical noise to probabilistically switch\nbetween distinct gene expression states. We demonstrate that such noise-driven\nswitching is dominated by tails of probability distributions and is therefore\nexponentially sensitive to changes in physiological parameters such as\ntranscription and translation rates. However, provided mRNA lifetimes are\nshort, switching can still be accurately simulated using protein-only models of\ngene expression. Exponential sensitivity limits the robustness of noise-driven\nswitching, suggesting cells may use other mechanisms in order to switch\nreliably.\n", "versions": [{"version": "v1", "created": "Thu, 15 Nov 2007 20:04:50 GMT"}, {"version": "v2", "created": "Tue, 2 Sep 2008 21:27:06 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Mehta", "Pankaj", ""], ["Mukhopadhyay", "Ranjan", ""], ["Wingreen", "Ned S.", ""]]}, {"id": "0711.2616", "submitter": "Ganesh Bagler Dr", "authors": "Ganesh Bagler (Centre for Cellular and Molecular Biology, Hyderabad,\n  India)", "title": "Modeling Protein Contact Networks", "comments": "Ph.D. thesis. 118 pages including 12 tables and 37 figures. LaTeX\n  source with included style files. Presently at National Centre for Biological\n  Sciences, Tata Institute of Fundamantal Research, Bangalore, India", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.BM", "license": null, "abstract": "  Proteins are an important class of biomolecules that serve as essential\nbuilding blocks of the cells. Their three-dimensional structures are\nresponsible for their functions. In this thesis we have investigated the\nprotein structures using a network theoretical approach. While doing so we used\na coarse-grained method, viz., complex network analysis. We model protein\nstructures at two length scales as Protein Contact Networks (PCN) and as\nLong-range Interaction Networks (LINs). We found that proteins by virtue of\nbeing characterised by high amount of clustering, are small-world networks.\nApart from the small-world nature, we found that proteins have another general\nproperty, viz., assortativity. This is an interesting and exceptional finding\nas all other complex networks (except for social networks) are known to be\ndisassortative. Importantly, we could identify one of the major topological\ndeterminant of assortativity by building appropriate controls.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2007 05:19:25 GMT"}], "update_date": "2007-11-19", "authors_parsed": [["Bagler", "Ganesh", "", "Centre for Cellular and Molecular Biology, Hyderabad,\n  India"]]}, {"id": "0711.2687", "submitter": "Steffen Waldherr", "authors": "Steffen Waldherr and Frank Allgower", "title": "A feedback approach to bifurcation analysis in biochemical networks with\n  many parameters", "comments": null, "journal-ref": "In Proceedings of the 2nd Foundations of Systems Biology in\n  Engineering (FOSBE) 2007, pp. 479-484, Fraunhofer IRB Verlag Stuttgart, ISBN\n  978-3-8167-7436-5", "doi": null, "report-no": null, "categories": "q-bio.MN", "license": null, "abstract": "  Feedback circuits in biochemical networks which underly cellular signaling\npathways are important elements in creating complex behavior. A specific aspect\nthereof is how stability of equilibrium points depends on model parameters. For\nbiochemical networks, which are modelled using many parameters, it is typically\nvery difficult to estimate the influence of parameters on stability. Finding\nparameters which result in a change in stability is a key step for a meaningful\nbifurcation analysis. We describe a method based on well known approaches from\ncontrol theory, which can locate parameters leading to a change in stability.\nThe method considers a feedback circuit in the biochemical network and relates\nstability properties to the control system obtained by loop--breaking. The\nmethod is applied to a model of a MAPK cascade as an illustrative example.\n", "versions": [{"version": "v1", "created": "Fri, 16 Nov 2007 22:11:36 GMT"}], "update_date": "2007-11-20", "authors_parsed": [["Waldherr", "Steffen", ""], ["Allgower", "Frank", ""]]}, {"id": "0711.2723", "submitter": "Ganesh Bagler Dr", "authors": "Ganesh Bagler and Somdatta Sinha", "title": "Assortative mixing in Protein Contact Networks and protein folding\n  kinetics", "comments": "Published in Bioinformatics", "journal-ref": "Bioinformatics, vol. 23, no. 14, 1760--1767 (2007)", "doi": "10.1093/bioinformatics/btm257", "report-no": null, "categories": "q-bio.MN q-bio.BM", "license": null, "abstract": "  Starting from linear chains of amino acids, the spontaneous folding of\nproteins into their elaborate three-dimensional structures is one of the\nremarkable examples of biological self-organization. We investigated native\nstate structures of 30 single-domain, two-state proteins, from complex networks\nperspective, to understand the role of topological parameters in proteins'\nfolding kinetics, at two length scales-- as ``Protein Contact Networks (PCNs)''\nand their corresponding ``Long-range Interaction Networks (LINs)'' constructed\nby ignoring the short-range interactions. Our results show that, both PCNs and\nLINs exhibit the exceptional topological property of ``assortative mixing''\nthat is absent in all other biological and technological networks studied so\nfar. We show that the degree distribution of these contact networks is partly\nresponsible for the observed assortativity. The coefficient of assortativity\nalso shows a positive correlation with the rate of protein folding at both\nshort and long contact scale, whereas, the clustering coefficients of only the\nLINs exhibit a negative correlation. The results indicate that the general\ntopological parameters of these naturally-evolved protein networks can\neffectively represent the structural and functional properties required for\nfast information transfer among the residues facilitating biochemical/kinetic\nfunctions, such as, allostery, stability, and the rate of folding.\n", "versions": [{"version": "v1", "created": "Sat, 17 Nov 2007 08:45:23 GMT"}], "update_date": "2007-11-20", "authors_parsed": [["Bagler", "Ganesh", ""], ["Sinha", "Somdatta", ""]]}, {"id": "0711.2799", "submitter": "German Andres Enciso", "authors": "German A. Enciso and Winfried Just", "title": "Large attractors in cooperative bi-quadratic Boolean networks. Part I", "comments": "13 pages, 2 figures resubmission with additional references", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": null, "abstract": "  Boolean networks have been the object of much attention, especially since S.\nKauffman proposed them in the 1960's as models for gene regulatory networks.\nThese systems are characterized by being defined on a Boolean state space and\nby simultaneous updating at discrete time steps. Of particular importance for\nbiological applications are networks in which the indegree for each variable is\nbounded by a fixed constant, as was stressed by Kauffman in his original\npapers.\n  An important question is which conditions on the network topology can rule\nout exponentially long periodic orbits in the system. In this paper, we\nconsider systems with positive feedback interconnections among all variables\n(known as cooperative systems), which in a continuous setting guarantees a very\nstable dynamics. We show that for an arbitrary constant 0<c<2 and sufficiently\nlarge n there exist n-dimensional cooperative Boolean networks in which both\nthe indegree and outdegree of each variable is bounded by two, and which\nnevertheless contain periodic orbits of length at least c^n. In Part II of this\npaper we will prove an inverse result showing that any system with such a\ndynamic behavior must in a sense be similar to the example described.\n", "versions": [{"version": "v1", "created": "Sun, 18 Nov 2007 17:04:01 GMT"}, {"version": "v2", "created": "Wed, 21 Nov 2007 17:50:40 GMT"}], "update_date": "2007-11-21", "authors_parsed": [["Enciso", "German A.", ""], ["Just", "Winfried", ""]]}, {"id": "0711.3812", "submitter": "Sorin Tanase-Nicola", "authors": "Sorin Tanase-Nicola and Pieter Rein ten Wolde", "title": "Regulatory control and the costs and benefits of biochemical noise", "comments": "Revised manuscript;35 pages, 4 figures, REVTeX4; to appear in PLoS\n  Computational Biology", "journal-ref": null, "doi": "10.1371/journal.pcbi.1000125", "report-no": null, "categories": "q-bio.MN q-bio.PE", "license": null, "abstract": "  Experiments in recent years have vividly demonstrated that gene expression\ncan be highly stochastic. How protein concentration fluctuations affect the\ngrowth rate of a population of cells, is, however, a wide open question. We\npresent a mathematical model that makes it possible to quantify the effect of\nprotein concentration fluctuations on the growth rate of a population of\ngenetically identical cells. The model predicts that the population's growth\nrate depends on how the growth rate of a single cell varies with protein\nconcentration, the variance of the protein concentration fluctuations, and the\ncorrelation time of these fluctuations. The model also predicts that when the\naverage concentration of a protein is close to the value that maximizes the\ngrowth rate, fluctuations in its concentration always reduce the growth rate.\nHowever, when the average protein concentration deviates sufficiently from the\noptimal level, fluctuations can enhance the growth rate of the population, even\nwhen the growth rate of a cell depends linearly on the protein concentration.\nThe model also shows that the ensemble or population average of a quantity,\nsuch as the average protein expression level or its variance, is in general not\nequal to its time average as obtained from tracing a single cell and its\ndescendants. We apply our model to perform a cost-benefit analysis of gene\nregulatory control. Our analysis predicts that the optimal expression level of\na gene regulatory protein is determined by the trade-off between the cost of\nsynthesizing the regulatory protein and the benefit of minimizing the\nfluctuations in the expression of its target gene. We discuss possible\nexperiments that could test our predictions.\n", "versions": [{"version": "v1", "created": "Sat, 24 Nov 2007 03:52:14 GMT"}, {"version": "v2", "created": "Sun, 4 May 2008 02:42:45 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Tanase-Nicola", "Sorin", ""], ["Wolde", "Pieter Rein ten", ""]]}, {"id": "0711.4476", "submitter": "Marco Morelli", "authors": "M. J. Morelli, S. Tanase-Nicola, R.J. Allen, P.R. ten Wolde", "title": "Reaction coordinates for the flipping of genetic switches", "comments": "24 pages, 7 figures", "journal-ref": null, "doi": "10.1529/biophysj.107.116699", "report-no": null, "categories": "q-bio.MN q-bio.QM", "license": null, "abstract": "  We present a detailed analysis, based on the Forward Flux Sampling (FFS)\nsimulation method, of the switching dynamics and stability of two models of\ngenetic toggle switches, consisting of two mutually-repressing genes encoding\ntranscription factors (TFs); in one model (the exclusive switch), they mutually\nexclude each other's binding, while in the other model (general switch) the two\ntranscription factors can bind simultaneously to the shared operator region. We\nassess the role of two pairs of reactions that influence the stability of these\nswitches: TF-TF homodimerisation and TF-DNA association/dissociation. We\nfactorise the flipping rate k into the product of the probability rho(q*) of\nfinding the system at the dividing surface (separatrix) between the two stable\nstates, and a kinetic prefactor R. In the case of the exclusive switch, the\nrate of TF-operator binding affects both rho(q*) and R, while the rate of TF\ndimerisation affects only R. In the case of the general switch both TF-operator\nbinding and TF dimerisation affect k, R and rho(q*). To elucidate this, we\nanalyse the transition state ensemble (TSE). For the exclusive switch, varying\nthe rate of TF-operator binding can drastically change the pathway of\nswitching, while changing the rate of dimerisation changes the switching rate\nwithout altering the mechanism. The switching pathways of the general switch\nare highly robust to changes in the rate constants of both TF-operator and\nTF-TF binding, even though these rate constants do affect the flipping rate;\nthis feature is unique for non-equilibrium systems.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2007 12:55:21 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Morelli", "M. J.", ""], ["Tanase-Nicola", "S.", ""], ["Allen", "R. J.", ""], ["Wolde", "P. R. ten", ""]]}, {"id": "0711.4512", "submitter": "Marco Morelli", "authors": "M.J. Morelli, R.J. Allen, S. Tanase-Nicola, P.R. ten Wolde", "title": "Eliminating fast reactions in stochastic simulations of biochemical\n  networks: a bistable genetic switch", "comments": "46 pages, 5 figures", "journal-ref": null, "doi": "10.1063/1.2821957", "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": null, "abstract": "  In many stochastic simulations of biochemical reaction networks, it is\ndesirable to ``coarse-grain'' the reaction set, removing fast reactions while\nretaining the correct system dynamics. Various coarse-graining methods have\nbeen proposed, but it remains unclear which methods are reliable and which\nreactions can safely be eliminated. We address these issues for a model gene\nregulatory network that is particularly sensitive to dynamical fluctuations: a\nbistable genetic switch. We remove protein-DNA and/or protein-protein\nassociation-dissociation reactions from the reaction set, using various\ncoarse-graining strategies. We determine the effects on the steady-state\nprobability distribution function and on the rate of fluctuation-driven switch\nflipping transitions. We find that protein-protein interactions may be safely\neliminated from the reaction set, but protein-DNA interactions may not. We also\nfind that it is important to use the chemical master equation rather than\nmacroscopic rate equations to compute effective propensity functions for the\ncoarse-grained reactions.\n", "versions": [{"version": "v1", "created": "Wed, 28 Nov 2007 14:36:40 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Morelli", "M. J.", ""], ["Allen", "R. J.", ""], ["Tanase-Nicola", "S.", ""], ["Wolde", "P. R. ten", ""]]}, {"id": "0711.4775", "submitter": "Stefan Thurner", "authors": "Dejan Stokic, Rudolf Hanel, Stefan Thurner", "title": "The window at the edge of chaos in a simple model of gene interaction\n  networks", "comments": "6 pages, eps figures", "journal-ref": null, "doi": "10.1103/PhysRevE.77.061917", "report-no": null, "categories": "q-bio.MN", "license": null, "abstract": "  As a model for gene and protein interactions we study a set for molecular\ncatalytic reactions. The model is based on experimentally motivated interaction\nnetwork topologies, and is designed to capture some key statistics of gene\nexpression statistics. We impose a non-linearity to the system by a boundary\ncondition which guarantees non-negative concentrations of chemical\nconcentrations and study the system stability quantified by maximum Lyapunov\nexponents. We find that the non-negativity constraint leads to a drastic\ninflation of those regions in parameter space where the Lyapunov exponent\nexactly vanishes. We explain the finding as a self-organized critical\nphenomenon. The robustness of this finding with respect to different network\ntopologies and the role of intrinsic molecular- and external noise is\ndiscussed. We argue that systems with inflated 'edges of chaos' could be much\nmore easily favored by natural selection than systems where the Lyapunov\nexponent vanishes only on a parameter set of measure zero.\n", "versions": [{"version": "v1", "created": "Thu, 29 Nov 2007 16:51:06 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Stokic", "Dejan", ""], ["Hanel", "Rudolf", ""], ["Thurner", "Stefan", ""]]}, {"id": "0711.4937", "submitter": "Azi Lipshtat", "authors": "Azi Lipshtat, Sudarshan P. Purushothaman, Ravi Iyengar, Avi Ma'ayan", "title": "Functions of Bifans in Context of Multiple Regulatory Motifs in\n  Signaling Networks", "comments": "Accepted for publication in the Biophysical Journal", "journal-ref": null, "doi": "10.1529/biophysj.107.116673", "report-no": null, "categories": "q-bio.MN q-bio.QM q-bio.SC", "license": null, "abstract": "  Representation of intracellular signaling networks as directed graphs allows\nfor the identification of regulatory motifs. Regulatory motifs are groups of\nnodes with the same connectivity structure, capable of processing information.\nThe bifan motif, made of two source nodes directly cross-regulating two target\nnodes, is an over-represented motif in a mammalian cell signaling network and\nin transcriptional networks. One example of a bifan is the two MAP-kinases, p38\nand JNK that phosphorylate and activate the two transcription factors ATF2 and\nElk-1. We have used a system of coupled ordinary differential equations to\nanalyze the regulatory capability of this bifan motif by itself, and when it\ninteracts with other motifs such as positive and negative feedback loops. Our\nresults indicate that bifans provide temporal regulation of signal propagation\nand act as signal sorters, filters, and synchronizers. Bifans that have OR gate\nconfigurations show rapid responses while AND gate bifans can introduce delays\nand allow prolongation of signal outputs. Bifans that are AND gates can filter\nnoisy signal inputs. The p38/JNK-ATF2/Elk-1bifan synchronizes the output of\nactivated transcription factors. Synchronization is a robust property of bifans\nand is exhibited even when the bifan is adjacent to a positive feedback loop.\nThe presence of the bifan promotes the transcription and translation of the\ndual specificity protein phosphatase MKP-1 that inhibits p38 and JNK thus\nenabling a negative feedback loop. These results indicate that bifan motifs in\ncell signaling networks can contribute to signal processing capability both\nintrinsically and by enabling the functions of other regulatory motifs.\n", "versions": [{"version": "v1", "created": "Fri, 30 Nov 2007 14:15:37 GMT"}], "update_date": "2009-11-13", "authors_parsed": [["Lipshtat", "Azi", ""], ["Purushothaman", "Sudarshan P.", ""], ["Iyengar", "Ravi", ""], ["Ma'ayan", "Avi", ""]]}]