[{"id": "0903.0031", "submitter": "Alexander Spirov", "authors": "Alexander V. Spirov", "title": "Design of a dynamic model of genes with multiple autonomous regulatory\n  modules by evolution in silico", "comments": "24 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  New approach to design a dynamic model of genes with multiple autonomous\nregulatory modules by evolution in silico is proposed. The approach is based on\nGenetic Algorithms, enforced by new crossover operators, especially worked out\nfor these purposes. The approach exploits the subbasin-portal architecture of\nthe fitness functions suitable for this kind of evolutionary modeling. The\neffectiveness of the approach is demonstrated on a series of benchmark tests.\n", "versions": [{"version": "v1", "created": "Sat, 28 Feb 2009 01:35:32 GMT"}], "update_date": "2009-03-03", "authors_parsed": [["Spirov", "Alexander V.", ""]]}, {"id": "0903.0662", "submitter": "Giovanni Paternostro", "authors": "Jacob D. Feala, Jorge Cortes, Phillip M. Duxbury, Carlo Piermarocchi,\n  Andrew D. McCulloch, Giovanni Paternostro", "title": "Systems approaches and algorithms for discovery of combinatorial\n  therapies", "comments": "25 pages", "journal-ref": "WIREs Syst Biol Med 2009", "doi": "10.1002/wsbm.51", "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Effective therapy of complex diseases requires control of highly non-linear\ncomplex networks that remain incompletely characterized. In particular, drug\nintervention can be seen as control of signaling in cellular networks.\nIdentification of control parameters presents an extreme challenge due to the\ncombinatorial explosion of control possibilities in combination therapy and to\nthe incomplete knowledge of the systems biology of cells. In this review paper\nwe describe the main current and proposed approaches to the design of\ncombinatorial therapies, including the empirical methods used now by clinicians\nand alternative approaches suggested recently by several authors. New\napproaches for designing combinations arising from systems biology are\ndescribed. We discuss in special detail the design of algorithms that identify\noptimal control parameters in cellular networks based on a quantitative\ncharacterization of control landscapes, maximizing utilization of incomplete\nknowledge of the state and structure of intracellular networks. The use of new\ntechnology for high-throughput measurements is key to these new approaches to\ncombination therapy and essential for the characterization of control\nlandscapes and implementation of the algorithms. Combinatorial optimization in\nmedical therapy is also compared with the combinatorial optimization of\nengineering and materials science and similarities and differences are\ndelineated.\n", "versions": [{"version": "v1", "created": "Wed, 4 Mar 2009 00:14:33 GMT"}], "update_date": "2009-09-03", "authors_parsed": [["Feala", "Jacob D.", ""], ["Cortes", "Jorge", ""], ["Duxbury", "Phillip M.", ""], ["Piermarocchi", "Carlo", ""], ["McCulloch", "Andrew D.", ""], ["Paternostro", "Giovanni", ""]]}, {"id": "0903.1969", "submitter": "Etienne Farcot", "authors": "Etienne Farcot (VP), Jean-Luc Gouz\\'e (INRIA Sophia Antipolis)", "title": "Limit cycles in piecewise-affine gene network models with multiple\n  interaction loops", "comments": null, "journal-ref": null, "doi": null, "report-no": "RR-6875", "categories": "math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we consider piecewise affine differential equations modeling\ngene networks. We work with arbitrary decay rates, and under a local hypothesis\nexpressed as an alignment condition of successive focal points. The interaction\ngraph of the system may be rather complex (multiple intricate loops of any\nsign, multiple thresholds...). Our main result is an alternative theorem\nshowing that, if a sequence of region is periodically visited by trajectories,\nthen under our hypotheses, there exists either a unique stable periodic\nsolution, or the origin attracts all trajectories in this sequence of regions.\nThis result extends greatly our previous work on a single negative feedback\nloop. We give several examples and simulations illustrating different cases.\n", "versions": [{"version": "v1", "created": "Wed, 11 Mar 2009 13:24:10 GMT"}], "update_date": "2009-03-12", "authors_parsed": [["Farcot", "Etienne", "", "VP"], ["Gouzé", "Jean-Luc", "", "INRIA Sophia Antipolis"]]}, {"id": "0903.2883", "submitter": "Kazuhiro Takemoto", "authors": "Kazuhiro Takemoto, Masanori Arita", "title": "Heterogeneous distribution of metabolites across plant species", "comments": "16 pages, 7 figures, 1 table", "journal-ref": "Physica A 388, 2771 (2009)", "doi": "10.1016/j.physa.2009.03.011", "report-no": null, "categories": "q-bio.MN physics.data-an q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We investigate the distribution of flavonoids, a major category of plant\nsecondary metabolites, across species. Flavonoids are known to show high\nspecies specificity, and were once considered as chemical markers for\nunderstanding adaptive evolution and characterization of living organisms. We\ninvestigate the distribution among species using bipartite networks, and find\nthat two heterogeneous distributions are conserved among several families: the\npower-law distributions of the number of flavonoids in a species and the number\nof shared species of a particular flavonoid. In order to explain the possible\norigin of the heterogeneity, we propose a simple model with, essentially, a\nsingle parameter. As a result, we show that two respective power-law statistics\nemerge from simple evolutionary mechanisms based on a multiplicative process.\nThese findings provide insights into the evolution of metabolite diversity and\ncharacterization of living organisms that defy genome sequence analysis for\ndifferent reasons.\n", "versions": [{"version": "v1", "created": "Tue, 17 Mar 2009 00:19:04 GMT"}, {"version": "v2", "created": "Fri, 27 Mar 2009 07:42:33 GMT"}], "update_date": "2009-04-23", "authors_parsed": [["Takemoto", "Kazuhiro", ""], ["Arita", "Masanori", ""]]}, {"id": "0903.3719", "submitter": "Zhou Tianshou", "authors": "Jiajun Zhang, Zhanjiang Yuan, Tianshou Zhou", "title": "Cis-Regulatory Modules Drive Dynamic Patterns of a Multicellular System", "comments": "4 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  How intracellular and extracellular signals are integrated by transcription\nfactors is essential for understanding complex cellular patterns at the\npopulation level. In this Letter, by using a synthetic genetic oscillator\ncoupled to a quorum-sensing apparatus, we propose an experimentally feasible\ncis-regulatory module (CRM) which performs four possible logic operations\n(ANDN, ORN, NOR and NAND) of input signals. We show both numerically and\ntheoretically that these different CRMs drive fundamentally different dynamic\npatterns, such as synchronization, clustering and splay state.\n", "versions": [{"version": "v1", "created": "Sun, 22 Mar 2009 12:57:30 GMT"}], "update_date": "2009-03-24", "authors_parsed": [["Zhang", "Jiajun", ""], ["Yuan", "Zhanjiang", ""], ["Zhou", "Tianshou", ""]]}, {"id": "0903.4215", "submitter": "David Foster", "authors": "David V. Foster, Jacob G. Foster, Sui Huang, Stuart A. Kauffman", "title": "A Model of Sequential Branching in Hierarchical Cell Fate Determination", "comments": "10 pages, 7 figures", "journal-ref": "Journal of Theoretical Biology 260 (2009) pp. 589-597", "doi": "10.1016/j.jtbi.2009.07.005", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Multipotent stem or progenitor cells undergo a sequential series of binary\nfate decisions, which ultimately generate the diversity of differentiated\ncells. Efforts to understand cell fate control have focused on simple gene\nregulatory circuits that predict the presence of multiple stable states,\nbifurcations and switch-like transitions. However, existing gene network models\ndo not explain more complex properties of cell fate dynamics such as the\nhierarchical branching of developmental paths. Here, we construct a generic\nminimal model of the genetic regulatory network controlling cell fate\ndetermination, which exhibits five elementary characteristics of cell\ndifferentiation: stability, directionality, branching, exclusivity, and\npromiscuous expression. We argue that a modular architecture comprising\nrepeated network elements reproduces these features of differentiation by\nsequentially repressing selected modules and hence restricting the dynamics to\nlower dimensional subspaces of the high-dimensional state space. We implement\nour model both with ordinary differential equations (ODEs), to explore the role\nof bifurcations in producing the one-way character of differentiation, and with\nstochastic differential equations (SDEs), to demonstrate the effect of noise on\nthe system. We further argue that binary cell fate decisions are prevalent in\ncell differentiation due to general features of the underlying dynamical\nsystem. This minimal model makes testable predictions about the structural\nbasis for directional, discrete and diversifying cell phenotype development and\nthus can guide the evaluation of real gene regulatory networks that govern\ndifferentiation.\n", "versions": [{"version": "v1", "created": "Wed, 25 Mar 2009 00:03:06 GMT"}, {"version": "v2", "created": "Sun, 12 Apr 2009 01:54:14 GMT"}, {"version": "v3", "created": "Mon, 14 Sep 2009 21:42:01 GMT"}], "update_date": "2009-09-15", "authors_parsed": [["Foster", "David V.", ""], ["Foster", "Jacob G.", ""], ["Huang", "Sui", ""], ["Kauffman", "Stuart A.", ""]]}, {"id": "0903.4219", "submitter": "Ali Navid", "authors": "Ali Navid, Eivind Almaas", "title": "Genome-scale reconstruction of the metabolic network in Yersinia pestis,\n  strain 91001", "comments": "27 pages, 4 figures, 3 tables", "journal-ref": "Molecular Biosystems 5 (2009) 368-375", "doi": "10.1039/b818710j", "report-no": null, "categories": "q-bio.MN q-bio.CB q-bio.GN q-bio.SC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The gram-negative bacterium Yersinia pestis, the aetiological agent of\nbubonic plague, is one the deadliest pathogens known to man. Despite its\nhistorical reputation, plague is a modern disease which annually afflicts\nthousands of people. Public safety considerations greatly limit clinical\nexperimentation on this organism and thus development of theoretical tools to\nanalyze the capabilities of this pathogen is of utmost importance. Here, we\nreport the first genome-scale metabolic model of Yersinia pestis biovar\nMediaevalis based both on its recently annotated genome, and physiological and\nbiochemical data from literature. Our model demonstrates excellent agreement\nwith Y. pestis known metabolic needs and capabilities. Since Y. pestis is a\nmeiotrophic organism, we have developed CryptFind, a systematic approach to\nidentify all candidate cryptic genes responsible for known and theoretical\nmeiotrophic phenomena. In addition to uncovering every known cryptic gene for\nY. pestis, our analysis of the rhamnose fermentation pathway suggests that betB\nis the responsible cryptic gene. Despite all of our medical advances, we still\ndo not have a vaccine for bubonic plague. Recent discoveries of antibiotic\nresistant strains of Yersinia pestis coupled with the threat of plague being\nused as a bioterrorism weapon compel us to develop new tools for studying the\nphysiology of this deadly pathogen. Using our theoretical model, we can study\nthe cells phenotypic behavior under different circumstances and identify\nmetabolic weaknesses which may be harnessed for the development of\ntherapeutics. Additionally, the automatic identification of cryptic genes\nexpands the usage of genomic data for pharmaceutical purposes.\n", "versions": [{"version": "v1", "created": "Wed, 25 Mar 2009 01:01:27 GMT"}], "update_date": "2009-03-26", "authors_parsed": [["Navid", "Ali", ""], ["Almaas", "Eivind", ""]]}, {"id": "0903.4491", "submitter": "Aleksandra Walczak", "authors": "Gasper Tkacik, Aleksandra M. Walczak, and William Bialek", "title": "Optimizing information flow in small genetic networks. I", "comments": null, "journal-ref": "Phys. Rev. E 80, 031920 (2009)", "doi": "10.1103/PhysRevE.80.031920", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In order to survive, reproduce and (in multicellular organisms)\ndifferentiate, cells must control the concentrations of the myriad different\nproteins that are encoded in the genome. The precision of this control is\nlimited by the inevitable randomness of individual molecular events. Here we\nexplore how cells can maximize their control power in the presence of these\nphysical limits; formally, we solve the theoretical problem of maximizing the\ninformation transferred from inputs to outputs when the number of available\nmolecules is held fixed. We start with the simplest version of the problem, in\nwhich a single transcription factor protein controls the readout of one or more\ngenes by binding to DNA. We further simplify by assuming that this regulatory\nnetwork operates in steady state, that the noise is small relative to the\navailable dynamic range, and that the target genes do not interact. Even in\nthis simple limit, we find a surprisingly rich set of optimal solutions.\nImportantly, for each locally optimal regulatory network, all parameters are\ndetermined once the physical constraints on the number of available molecules\nare specified. Although we are solving an over--simplified version of the\nproblem facing real cells, we see parallels between the structure of these\noptimal solutions and the behavior of actual genetic regulatory networks.\nSubsequent papers will discuss more complete versions of the problem.\n", "versions": [{"version": "v1", "created": "Thu, 26 Mar 2009 00:12:20 GMT"}, {"version": "v2", "created": "Sun, 1 Nov 2009 22:39:25 GMT"}], "update_date": "2013-08-01", "authors_parsed": [["Tkacik", "Gasper", ""], ["Walczak", "Aleksandra M.", ""], ["Bialek", "William", ""]]}]