[{"id": "0906.0114", "submitter": "Deepak Chandran", "authors": "Deepak Chandran and Herbert M. Sauro", "title": "An Optimization Algorithm for Finding Parameters for Bistability", "comments": "5 pages, 4 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.CB", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Many biochemical pathways are known, but the numerous parameters\nrequired to correctly explore the dynamics of the pathways are not known. For\nthis reason, algorithms that can make inferences by looking at the topology of\na network are desirable. In this work, we are particular interested in the\nquestion of whether a given pathway can potentially harbor multiple stable\nsteady states. In other words, the challenge is to find the set of parameters\nsuch that the dynamical system defined by a set of ordinary differential\nequations will contain multiple stable steady states. Being able to find\nparameters that cause a network to be bistable may also be benefitial for\nengineering synthetic bistable systems where the engineer needs to know a\nworking set of parameters.\n  Result: We have developed an algorithm that optimizes the parameters of a\ndynamical system so that the system will contain at least one saddle or\nunstable point. The algorithm then looks at trajectories around this saddle or\nunstable point to see whether the different trajectories converge to different\nstable points. The algorithm returns the parameters that causes the system to\nexhibit multiple stable points. Since this is an optimization algorithm, it is\nnot quaranteed to find a solution. Repeated runs are often required to find a\nsolution for systems where only a narrow set of parameters exhibit bistability.\n  Availability: The C code for the algorithm is available at\nhttp://tinkercell.googlecode.com\n", "versions": [{"version": "v1", "created": "Sat, 30 May 2009 21:33:08 GMT"}, {"version": "v2", "created": "Thu, 23 Jul 2009 15:59:43 GMT"}], "update_date": "2009-07-23", "authors_parsed": [["Chandran", "Deepak", ""], ["Sauro", "Herbert M.", ""]]}, {"id": "0906.0125", "submitter": "Vesna Memisevic", "authors": "Vesna Memisevic, Tijana Milenkovic, and Natasa Przulj", "title": "An integrative approach to modeling biological networks", "comments": "10 pages, 3 tables, 4 figures", "journal-ref": "Vesna Memisevic, Tijana Milenkovic and Natasa Przulj. An\n  integrative approach to modeling biological networks. Journal of Integrative\n  Bioinformatics, 7(3):120, 2010.", "doi": "10.2390/biecoll-jib-2010-120", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Since proteins carry out biological processes by interacting with other\nproteins, analyzing the structure of protein-protein interaction (PPI) networks\ncould explain complex biological mechanisms, evolution, and disease. Similarly,\nstudying protein structure networks, residue interaction graphs (RIGs), might\nprovide insights into protein folding, stability, and function. The first step\ntowards understanding these networks is finding an adequate network model that\nclosely replicates their structure. Evaluating the fit of a model to the data\nrequires comparing the model with real-world networks. Since network\ncomparisons are computationally infeasible, they rely on heuristics, or\n\"network properties.\" We show that it is difficult to assess the reliability of\nthe fit of a model with any individual network property. Thus, our approach\nintegrates a variety of network properties and further combines these with a\nseries of probabilistic methods to predict an appropriate network model for\nbiological networks. We find geometric random graphs, that model spatial\nrelationships between objects, to be the best-fitting model for RIGs. This\nvalidates the correctness of our method, since RIGs have previously been shown\nto be geometric. We apply our approach to noisy PPI networks and demonstrate\nthat their structure is also consistent with geometric random graphs.\n", "versions": [{"version": "v1", "created": "Sun, 31 May 2009 00:32:57 GMT"}, {"version": "v2", "created": "Thu, 24 Sep 2009 06:10:06 GMT"}], "update_date": "2010-04-22", "authors_parsed": [["Memisevic", "Vesna", ""], ["Milenkovic", "Tijana", ""], ["Przulj", "Natasa", ""]]}, {"id": "0906.0274", "submitter": "Andrea Rocco", "authors": "Andrea Rocco", "title": "Stochastic Control of Metabolic Pathways", "comments": "14 pages, 3 figures", "journal-ref": "Phys. Biol. 6 (2009) 016002", "doi": "10.1088/1478-3975/6/1/016002", "report-no": null, "categories": "q-bio.SC q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study the effect of extrinsic noise in metabolic networks. We introduce\nexternal random fluctuations at the kinetic level, and show how these lead to a\nstochastic generalization of standard Metabolic Control Analysis. While\nSummation and Connectivity Theorems hold true in presence of extrinsic noise,\ncontrol coefficients incorporate its effect through an explicit dependency on\nthe noise intensity. New elasticities and response coefficients are also\ndefined. Accordingly, the concept of control by noise is introduced as a way of\ntuning the systemic behaviour of metabolisms. We argue that this framework\nholds for intrinsic noise too, when time-scale separation is present in the\nsystem.\n", "versions": [{"version": "v1", "created": "Mon, 1 Jun 2009 13:00:31 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Rocco", "Andrea", ""]]}, {"id": "0906.3364", "submitter": "Chetan Gadgil", "authors": "Kartik Subramanian and Chetan Gadgil", "title": "Robustness of the Drosophila segment polarity network to transient\n  perturbations", "comments": "13 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.CB q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Continuous and Boolean models for the Drosophila segment polarity network\nhave shown that the system is able to maintain the wild-type pattern when\nsubjected to sustained changes in the interaction parameters and initial\nconditions. Embryo development is likely to occur under fluctuating\nenvironmental conditions. We use a well-established Boolean model to explore\nthe ability of the segment polarity network to resist transient changes. We\nidentify paths along which alternate unviable states are reached, and hence\ncritical nodes whose state changes lead the system away from the wild-type\nstate. We find that the system appears to be more sensitive to changes that\ninvolve activation of normally inactive nodes. Through a simulation of the heat\nshock response, we show how a localized perturbation in one parasegment is more\ndeleterious than a global perturbation affecting all parasegments. We identify\nthe sequence of events involved in the recovery of the system from a global\ntransient heat shock condition. Finally we discuss these results in terms of\nthe robustness of the system response.\n", "versions": [{"version": "v1", "created": "Thu, 18 Jun 2009 07:27:45 GMT"}], "update_date": "2009-06-19", "authors_parsed": [["Subramanian", "Kartik", ""], ["Gadgil", "Chetan", ""]]}, {"id": "0906.3912", "submitter": "Vladimir Privman", "authors": "Vladimir Privman, Valber Pedrosa, Dmitriy Melnikov, Marcos Pita,\n  Aleksandr Simonian, Evgeny Katz", "title": "Enzymatic AND-Gate Based on Electrode-Immobilized Glucose-6-Phosphate\n  Dehydrogenase: Towards Digital Biosensors and Biochemical Logic Systems with\n  Low Noise", "comments": null, "journal-ref": "Biosens. Bioelectron. 25, 695-701 (2009)", "doi": "10.1016/j.bios.2009.08.014", "report-no": null, "categories": "q-bio.MN cond-mat.soft q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Electrode-immobilized glucose-6-phosphate dehydrogenase is used to catalyze\nan enzymatic reaction which carries out the AND logic gate. This logic function\nis considered here in the context of biocatalytic processes utilized for the\nbiocomputing applications for \"digital\" (threshold) sensing/actuation. We\noutline the response functions desirable for such applications and report the\nfirst experimental realization of a sigmoid-shape response in one of the\ninputs. A kinetic model is developed and utilized to evaluate the extent to\nwhich the experimentally realized gate is close to optimal.\n", "versions": [{"version": "v1", "created": "Mon, 22 Jun 2009 03:26:34 GMT"}], "update_date": "2010-10-12", "authors_parsed": [["Privman", "Vladimir", ""], ["Pedrosa", "Valber", ""], ["Melnikov", "Dmitriy", ""], ["Pita", "Marcos", ""], ["Simonian", "Aleksandr", ""], ["Katz", "Evgeny", ""]]}, {"id": "0906.4279", "submitter": "Vasily Ogryzko V", "authors": "Vasily Ogryzko", "title": "Quantum information processing at the cellular level. Euclidean approach", "comments": "82 pages. The part on decoherence and enzymatic mechanism has been\n  improved", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.soft quant-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Application of quantum principles to living cells requires a new\napproximation of the full quantum mechanical description of intracellular\ndynamics. We discuss what principal elements any such good approximation should\ncontain. As one such element, the notion of \"Catalytic force\" Cf is introduced.\nCf is the effect of the molecular target of catalysis on the catalytic\nmicroenvironment that adjusts the microenvironment towards a state that\nfacilitates the catalytic act. This phenomenon is experimentally testable and\nhas an intriguing implication for biological organization and evolution, as it\namounts to \"optimization without natural selection of replicators\". Unlike the\nstatistical-mechanical approaches to self-organization, the Cf principle does\nnot encounter the problem of \"tradeoff between stability and complexity\" at the\nlevel of individual cell. Physically, the Cf is considered as a harmonic-like\nforce of reaction, which keeps the state of the cell close to the ground state,\ndefined here as a state where enzymatic acts work most efficiently. Ground\nstate is subject to unitary evolution, and serves as a starting point in a\ngeneral strategy of quantum description of intracellular processes, termed here\n\"Euclidean approach\". The next step of this strategy is transition from the\ndescription of ground state to that one of growing state, and we suggest how it\ncan be accomplished using arguments from the fluctuation-dissipation theorem.\nFinally, given that the most reliable and informative observable of an\nindividual cell is the sequence of its genome, we propose that the\nnon-classical correlations between individual molecular events at the single\ncell level could be easiest to detect using high throughput DNA sequencing.\n", "versions": [{"version": "v1", "created": "Tue, 23 Jun 2009 14:49:17 GMT"}, {"version": "v2", "created": "Wed, 7 Oct 2009 14:43:26 GMT"}, {"version": "v3", "created": "Sun, 22 Nov 2009 18:36:32 GMT"}], "update_date": "2009-11-22", "authors_parsed": [["Ogryzko", "Vasily", ""]]}, {"id": "0906.5280", "submitter": "Jayajit Das", "authors": "Jayajit Das, Mehran Kardar, Arup K. Chakraborty", "title": "Positive Feedback Regulation Results in Spatial Clustering and Fast\n  Spreading of Active Signaling Molecules on a Cell Membrane", "comments": "37 pages, 8 figures. Journal of Chemical Physics (in press)", "journal-ref": null, "doi": "10.1063/1.3149861", "report-no": null, "categories": "cond-mat.soft physics.chem-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Positive feedback regulation is ubiquitous in cell signaling networks, often\nleading to binary outcomes in response to graded stimuli. However, the role of\nsuch feedbacks in clustering, and in spatial spreading of activated molecules,\nhas come to be appreciated only recently. We focus on the latter, using a\nsimple model developed in the context of Ras activation with competing negative\nand positive feedback mechanisms. We find that positive feedback, in the\npresence of slow diffusion, results in clustering of activated molecules on the\nplasma membrane, and rapid spatial spreading as the front of the cluster\npropagates with a constant velocity (dependent on the feedback strength). The\nadvancing fronts of the clusters of the activated species are rough, with\nscaling consistent with the Kardar-Parisi-Zhang (KPZ) equation in one\ndimension. Our minimal model is general enough to describe signal transduction\nin a wide variety of biological networks where activity in the\nmembrane-proximal region is subject to feedback regulation.\n", "versions": [{"version": "v1", "created": "Mon, 29 Jun 2009 14:36:48 GMT"}], "update_date": "2015-05-13", "authors_parsed": [["Das", "Jayajit", ""], ["Kardar", "Mehran", ""], ["Chakraborty", "Arup K.", ""]]}]