[{"id": "1008.0427", "submitter": "Elisenda Feliu", "authors": "Elisenda Feliu, Lars N. Andersen, Michael Knudsen and Carsten Wiuf", "title": "A General Mathematical Framework Suitable for Studying Signaling\n  Cascades", "comments": "This paper has been withdrawn by the author due to a few inaccuracies\n  in the text. An improved version of the results of this paper can be found in\n  arXiv:1107.3531 [q-bio.MN]", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define a general mathematical framework for studying post-translational\nmodification processes under the assumption of mass action kinetics.\n", "versions": [{"version": "v1", "created": "Tue, 3 Aug 2010 00:14:46 GMT"}, {"version": "v2", "created": "Tue, 13 Dec 2011 12:12:12 GMT"}], "update_date": "2011-12-14", "authors_parsed": [["Feliu", "Elisenda", ""], ["Andersen", "Lars N.", ""], ["Knudsen", "Michael", ""], ["Wiuf", "Carsten", ""]]}, {"id": "1008.0431", "submitter": "Carsten Wiuf", "authors": "Elisenda Feliu, Michael Knudsen, Lars N. Andersen and Carsten Wiuf", "title": "An Algebraic Approach to Signaling Cascades with n Layers", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Posttranslational modification of proteins is key in transmission of signals\nin cells. Many signaling pathways contain several layers of modification cycles\nthat mediate and change the signal through the pathway. Here, we study a simple\nsignaling cascade consisting of n layers of modification cycles, such that the\nmodified protein of one layer acts as modifier in the next layer. Assuming\nmass-action kinetics and taking the formation of intermediate complexes into\naccount, we show that the steady states are solutions to a polynomial in one\nvariable, and in fact that there is exactly one steady state for any given\ntotal amounts of substrates and enzymes.\n  We demonstrate that many steady state concentrations are related through\nrational functions, which can be found recursively. For example,\nstimulus-response curves arise as inverse functions to explicit rational\nfunctions. We show that the stimulus-response curves of the modified substrates\nare shifted to the left as we move down the cascade. Further, our approach\nallows us to study enzyme competition, sequestration and how the steady state\nchanges in response to changes in the total amount of substrates.\n  Our approach is essentially algebraic and follows recent trends in the study\nof posttranslational modification systems.\n", "versions": [{"version": "v1", "created": "Tue, 3 Aug 2010 00:37:02 GMT"}, {"version": "v2", "created": "Sat, 18 Dec 2010 18:31:23 GMT"}], "update_date": "2010-12-21", "authors_parsed": [["Feliu", "Elisenda", ""], ["Knudsen", "Michael", ""], ["Andersen", "Lars N.", ""], ["Wiuf", "Carsten", ""]]}, {"id": "1008.0576", "submitter": "Wiet de Ronde", "authors": "Wiet de Ronde and Filipe Tostevin and Pieter Rein ten Wolde", "title": "Multiplexing Biochemical Signals", "comments": "4 pages, 4 figures", "journal-ref": "Phys. Rev. Lett. 107, 048101 (2011)", "doi": "10.1103/PhysRevLett.107.048101", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we show that living cells can multiplex biochemical signals,\ni.e. transmit multiple signals through the same signaling pathway\nsimultaneously, and yet respond to them very specifically. We demonstrate how\ntwo binary input signals can be encoded in the concentration of a common\nsignaling protein, which is then decoded such that each of the two output\nsignals provides reliable information about one corresponding input. Under\nbiologically relevant conditions the network can reach the maximum amount of\ninformation that can be transmitted, which is 2 bits.\n", "versions": [{"version": "v1", "created": "Tue, 3 Aug 2010 15:31:06 GMT"}], "update_date": "2012-06-01", "authors_parsed": [["de Ronde", "Wiet", ""], ["Tostevin", "Filipe", ""], ["Wolde", "Pieter Rein ten", ""]]}, {"id": "1008.0717", "submitter": "Tsvi Tlusty", "authors": "Arbel D. Tadmor, Tsvi Tlusty", "title": "A Coarse-Grained Biophysical Model of E. coli and Its Application to\n  Perturbation of the rRNA Operon Copy Number", "comments": null, "journal-ref": "PLoS Comput Biol. 2008 May 2;4(4):e1000038", "doi": "10.1371/journal.pcbi.1000038", "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We propose a biophysical model of Escherichia coli that predicts growth rate\nand an effective cellular composition from an effective, coarse-grained\nrepresentation of its genome. We assume that E. coli is in a state of balanced\nexponential steadystate growth, growing in a temporally and spatially constant\nenvironment, rich in resources. We apply this model to a series of past\nmeasurements, where the growth rate and rRNA-to-protein ratio have been\nmeasured for seven E. coli strains with an rRNA operon copy number ranging from\none to seven (the wild-type copy number). These experiments show that growth\nrate markedly decreases for strains with fewer than six copies. Using the\nmodel, we were able to reproduce these measurements. We show that the model\nthat best fits these data suggests that the volume fraction of macromolecules\ninside E. coli is not fixed when the rRNA operon copy number is varied.\nMoreover, the model predicts that increasing the copy number beyond seven\nresults in a cytoplasm densely packed with ribosomes and proteins. Assuming\nthat under such overcrowded conditions prolonged diffusion times tend to weaken\nbinding affinities, the model predicts that growth rate will not increase\nsubstantially beyond the wild-type growth rate, as indicated by other\nexperiments. Our model therefore suggests that changing the rRNA operon copy\nnumber of wild-type E. coli cells growing in a constant rich environment does\nnot substantially increase their growth rate. Other observations regarding\nstrains with an altered rRNA operon copy number, such as nucleoid compaction\nand the rRNA operon feedback response, appear to be qualitatively consistent\nwith this model. In addition, we discuss possible design principles suggested\nby the model and propose further experiments to test its validity.\n", "versions": [{"version": "v1", "created": "Wed, 4 Aug 2010 08:47:56 GMT"}], "update_date": "2010-08-05", "authors_parsed": [["Tadmor", "Arbel D.", ""], ["Tlusty", "Tsvi", ""]]}, {"id": "1008.1273", "submitter": "Anyou Wang", "authors": "Anyou Wang, Hong Li", "title": "A Systemic Receptor Network Triggered by Human cytomegalovirus Entry", "comments": "26 pages", "journal-ref": "Advances in Virology Volume 2011 (2011), Article ID 262080, 11\n  pages", "doi": "10.1155/2011/262080", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Virus entry is a multistep process that triggers a variety of cellular\npathways interconnecting into a complex network, yet the molecular complexity\nof this network remains largely unsolved. Here, by employing systems biology\napproach, we reveal a systemic virus-entry network initiated by human\ncytomegalovirus (HCMV), a widespread opportunistic pathogen. This network\ncontains all known interactions and functional modules (i.e. groups of\nproteins) coordinately responding to HCMV entry. The number of both genes and\nfunctional modules activated in this network dramatically declines shortly,\nwithin 25 min post-infection. While modules annotated as receptor system, ion\ntransport, and immune response are continuously activated during the entire\nprocess of HCMV entry, those for cell adhesion and skeletal movement are\nspecifically activated during viral early attachment, and those for immune\nresponse during virus entry. HCMV entry requires a complex receptor network\ninvolving different cellular components, comprising not only cell surface\nreceptors, but also pathway components in signal transduction, skeletal\ndevelopment, immune response, endocytosis, ion transport, macromolecule\nmetabolism and chromatin remodeling. Interestingly, genes that function in\nchromatin remodeling are the most abundant in this receptor system, suggesting\nthat global modulation of transcriptions is one of the most important events in\nHCMV entry. Results of in silico knock out further reveal that this entire\nreceptor network is primarily controlled by multiple elements, such as EGFR\n(Epidermal Growth Factor) and SLC10A1 (sodium/bile acid cotransporter family,\nmember 1). Thus, our results demonstrate that a complex systemic network, in\nwhich components coordinating efficiently in time and space contributes to\nvirus entry.\n", "versions": [{"version": "v1", "created": "Fri, 6 Aug 2010 20:16:33 GMT"}], "update_date": "2011-05-17", "authors_parsed": [["Wang", "Anyou", ""], ["Li", "Hong", ""]]}, {"id": "1008.1932", "submitter": "Alvaro Sanchez", "authors": "Alvaro Sanchez, Hernan Garcia, Daniel Jones, Rob Phillips and Jane'\n  Kondev", "title": "Effect of promoter architecture on the cell-to-cell variability in gene\n  expression", "comments": "35 pages, 6 figures, Submitted", "journal-ref": null, "doi": "10.1371/journal.pcbi.1001100", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  According to recent experimental evidence, the architecture of a promoter,\ndefined as the number, strength and regulatory role of the operators that\ncontrol the promoter, plays a major role in determining the level of\ncell-to-cell variability in gene expression. These quantitative experiments\ncall for a corresponding modeling effort that addresses the question of how\nchanges in promoter architecture affect noise in gene expression in a\nsystematic rather than case-by-case fashion. In this article, we make such a\nsystematic investigation, based on a simple microscopic model of gene\nregulation that incorporates stochastic effects. In particular, we show how\noperator strength and operator multiplicity affect this variability. We examine\ndifferent modes of transcription factor binding to complex promoters\n(cooperative, independent, simultaneous) and how each of these affects the\nlevel of variability in transcription product from cell-to-cell. We propose\nthat direct comparison between in vivo single-cell experiments and theoretical\npredictions for the moments of the probability distribution of mRNA number per\ncell can discriminate between different kinetic models of gene regulation.\n", "versions": [{"version": "v1", "created": "Wed, 11 Aug 2010 15:01:04 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Sanchez", "Alvaro", ""], ["Garcia", "Hernan", ""], ["Jones", "Daniel", ""], ["Phillips", "Rob", ""], ["Kondev", "Jane'", ""]]}, {"id": "1008.3166", "submitter": "M. Angeles Serrano", "authors": "M. \\'Angeles Serrano and Francesc Sagu\\'es", "title": "Network-based confidence scoring system for genome-scale metabolic\n  reconstructions", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN cond-mat.dis-nn physics.soc-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Reliability on complex biological networks reconstructions remains a concern.\nAlthough observations are getting more and more precise, the data collection\nprocess is yet error prone and the proofs display uneven certitude. In the case\nof metabolic networks, the currently employed confidence scoring system rates\nreactions according to a discretized small set of labels denoting different\nlevels of experimental evidence or model-based likelihood. Here, we propose a\ncomputational network-based system of reaction scoring that exploits the\ncomplex hierarchical structure and the statistical regularities of the\nmetabolic network as a bipartite graph. We use the example of Escherichia coli\nmetabolism to illustrate our methodology. Our model is adjusted to the\nobservations in order to derive connection probabilities between individual\nmetabolite-reaction pairs and, after validation, we integrate individual link\ninformation to assess the reliability of each reaction in probabilistic terms.\nThis network-based scoring system breaks the degeneracy of currently employed\nscores, enables further confirmation of modeling results, uncovers very\nspecific reactions that could be functionally or evolutionary important, and\nidentifies prominent experimental targets for further verification. We foresee\na wide range of potential applications of our approach given the natural\nnetwork bipartivity of many biological interactions.\n", "versions": [{"version": "v1", "created": "Wed, 18 Aug 2010 20:03:51 GMT"}], "update_date": "2010-08-20", "authors_parsed": [["Serrano", "M. Ángeles", ""], ["Sagués", "Francesc", ""]]}, {"id": "1008.3851", "submitter": "Konstantin Klemm", "authors": "Thomas Skodawessely, Konstantin Klemm", "title": "Finding attractors in asynchronous Boolean dynamics", "comments": "5 pages, 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "cond-mat.dis-nn q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We present a computational method for finding attractors (ergodic sets of\nstates) of Boolean networks under asynchronous update. The approach is based on\na systematic removal of state transitions to render the state transition graph\nacyclic. In this reduced state transition graph, all attractors are fixed\npoints that can be enumerated with little effort in most instances. This\nattractor set is then extended to the attractor set of the original dynamics.\nOur numerical tests on standard Kauffman networks indicate that the method is\nefficient in the sense that the total number of state vectors visited grows\nmoderately with the number of states contained in attractors.\n", "versions": [{"version": "v1", "created": "Mon, 23 Aug 2010 16:24:20 GMT"}], "update_date": "2010-08-24", "authors_parsed": [["Skodawessely", "Thomas", ""], ["Klemm", "Konstantin", ""]]}, {"id": "1008.4025", "submitter": "Peter Csermely", "authors": "Tamas Korcsmaros, Illes J. Farkas, Mat\\'e S. Szalay, Petra Rovo, David\n  Fazekas, Zoltan Spiro, Csaba Bode, Katalin Lenti, Tibor Vellai and Peter\n  Csermely", "title": "Uniformly curated signaling pathways reveal tissue-specific cross-talks\n  and support drug target discovery", "comments": "9 pages, 4 figures, 2 tables and a supplementary info with 5 Figures\n  and 13 Tables", "journal-ref": "Bioinformatics 26, 2042-2050 (2010)", "doi": "10.1093/bioinformatics/btq310", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Motivation: Signaling pathways control a large variety of cellular processes.\nHowever, currently, even within the same database signaling pathways are often\ncurated at different levels of detail. This makes comparative and cross-talk\nanalyses difficult. Results: We present SignaLink, a database containing 8\nmajor signaling pathways from Caenorhabditis elegans, Drosophila melanogaster,\nand humans. Based on 170 review and approx. 800 research articles, we have\ncompiled pathways with semi-automatic searches and uniform, well-documented\ncuration rules. We found that in humans any two of the 8 pathways can\ncross-talk. We quantified the possible tissue- and cancer-specific activity of\ncross-talks and found pathway-specific expression profiles. In addition, we\nidentified 327 proteins relevant for drug target discovery. Conclusions: We\nprovide a novel resource for comparative and cross-talk analyses of signaling\npathways. The identified multi-pathway and tissue-specific cross-talks\ncontribute to the understanding of the signaling complexity in health and\ndisease and underscore its importance in network-based drug target selection.\nAvailability: http://SignaLink.org\n", "versions": [{"version": "v1", "created": "Tue, 24 Aug 2010 12:18:00 GMT"}], "update_date": "2010-08-25", "authors_parsed": [["Korcsmaros", "Tamas", ""], ["Farkas", "Illes J.", ""], ["Szalay", "Maté S.", ""], ["Rovo", "Petra", ""], ["Fazekas", "David", ""], ["Spiro", "Zoltan", ""], ["Bode", "Csaba", ""], ["Lenti", "Katalin", ""], ["Vellai", "Tibor", ""], ["Csermely", "Peter", ""]]}, {"id": "1008.5166", "submitter": "Saket Navlakha", "authors": "Saket Navlakha and Carl Kingsford", "title": "Network Archaeology: Uncovering Ancient Networks from Present-day\n  Interactions", "comments": "16 pages, 10 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1001119", "report-no": null, "categories": "q-bio.MN cs.SI", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Often questions arise about old or extinct networks. What proteins interacted\nin a long-extinct ancestor species of yeast? Who were the central players in\nthe Last.fm social network 3 years ago? Our ability to answer such questions\nhas been limited by the unavailability of past versions of networks. To\novercome these limitations, we propose several algorithms for reconstructing a\nnetwork's history of growth given only the network as it exists today and a\ngenerative model by which the network is believed to have evolved. Our\nlikelihood-based method finds a probable previous state of the network by\nreversing the forward growth model. This approach retains node identities so\nthat the history of individual nodes can be tracked. We apply these algorithms\nto uncover older, non-extant biological and social networks believed to have\ngrown via several models, including duplication-mutation with complementarity,\nforest fire, and preferential attachment. Through experiments on both synthetic\nand real-world data, we find that our algorithms can estimate node arrival\ntimes, identify anchor nodes from which new nodes copy links, and can reveal\nsignificant features of networks that have long since disappeared.\n", "versions": [{"version": "v1", "created": "Mon, 30 Aug 2010 21:00:27 GMT"}], "update_date": "2015-05-19", "authors_parsed": [["Navlakha", "Saket", ""], ["Kingsford", "Carl", ""]]}, {"id": "1008.5359", "submitter": "Eugene Lerman", "authors": "R. E. Lee DeVille and Eugene Lerman", "title": "Dynamics on networks I. Combinatorial categories of modular\n  continuous-time systems", "comments": "59 pages. (v2): abstract and introduction re-written, examples added", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS physics.soc-ph q-bio.MN q-bio.NC", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We develop a new framework for the study of complex continuous time dynamical\nsystems based on viewing them as collections of interacting control modules.\nThis framework is inspired by and builds upon the groupoid formalism of\nGolubitsky, Stewart and their collaborators. Our approach uses the tools and\n--- more importantly ---the stance of category theory. This enables us to put\nthe groupoid formalism in a coordinate-free setting and to extend it from\nordinary differential equations to vector fields on manifolds. In particular,\nwe construct combinatorial models for categories of modular continuous time\ndynamical systems. Each such model, as a category, is a fibration over an\nappropriate category of labeled directed graphs. This makes precise the\nrelation between dynamical systems living on networks and the combinatorial\nstructure of the underlying directed graphs, allowing us to exploit the\nrelation in new and interesting ways.\n", "versions": [{"version": "v1", "created": "Tue, 31 Aug 2010 16:49:33 GMT"}, {"version": "v2", "created": "Tue, 5 Apr 2011 21:27:14 GMT"}], "update_date": "2011-04-07", "authors_parsed": [["DeVille", "R. E. Lee", ""], ["Lerman", "Eugene", ""]]}]