[{"id": "1108.0209", "submitter": "David Murrugarra", "authors": "Reinhard Laubenbacher, David Murrugarra, and Alan Veliz-Cuba", "title": "Structure and Dynamics of Polynomial Dynamical Systems", "comments": "10 pages, 3 figures. NSF CMMI Research and Innovation Conference 2011", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.PE", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Discrete models have a long tradition in engineering, including finite state\nmachines, Boolean networks, Petri nets, and agent-based models. Of particular\nimportance is the question of how the model structure constrains its dynamics.\nThis paper discusses an algebraic framework to study such questions. The\nsystems discussed here are given by mappings on an affine space over a finite\nfield, whose coordinate functions are polynomials. They form a general class of\nmodels which can represent many discrete model types. Assigning to such a\nsystem its dependency graph, that is, the directed graph that indicates the\nvariable dependencies, provides a mapping from systems to graphs. A basic\nproperty of this mapping is derived and used to prove that dynamical systems\nwith an acyclic dependency graph can only have a unique fixed point in their\nphase space and no periodic orbits. This result is then applied to a published\nmodel of in vitro virus competition.\n", "versions": [{"version": "v1", "created": "Sun, 31 Jul 2011 22:21:14 GMT"}], "update_date": "2011-08-02", "authors_parsed": [["Laubenbacher", "Reinhard", ""], ["Murrugarra", "David", ""], ["Veliz-Cuba", "Alan", ""]]}, {"id": "1108.0736", "submitter": "Ilya M. Nemenman", "authors": "Ilya Nemenman", "title": "Gain control in molecular information processing: Lessons from\n  neuroscience", "comments": "10 pages, 5 figures", "journal-ref": "Phys. Biol. 9 026003, 2012", "doi": "10.1088/1478-3975/9/2/026003", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Statistical properties of environments experienced by biological signaling\nsystems in the real world change, which necessitate adaptive responses to\nachieve high fidelity information transmission. One form of such adaptive\nresponse is gain control. Here we argue that a certain simple mechanism of gain\ncontrol, understood well in the context of systems neuroscience, also works for\nmolecular signaling. The mechanism allows to transmit more than one bit (on or\noff) of information about the signal independently of the signal variance. It\ndoes not require additional molecular circuitry beyond that already present in\nmany molecular systems, and, in particular, it does not depend on existence of\nfeedback loops. The mechanism provides a potential explanation for abundance of\nultrasensitive response curves in biological regulatory networks.\n", "versions": [{"version": "v1", "created": "Wed, 3 Aug 2011 04:35:52 GMT"}], "update_date": "2012-05-01", "authors_parsed": [["Nemenman", "Ilya", ""]]}, {"id": "1108.2091", "submitter": "Subhadip Raychaudhuri", "authors": "Subhadip Raychaudhuri", "title": "Low probability Bid-Bax reaction generates heterogeneity in apoptosis\n  resistance of cancer and cancer stem cells", "comments": "17 pages, 5 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph physics.med-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Variability in the tumorigenic potential among cancer cells within a tumor\npopulation is an unresolved fundamental issue in cancer biology. It is\nimportant to know whether cancer cells with higher tumorigenic potential, such\nas cancer stem cells, are only a small subpopulation. We attempt to address the\nquestion of variability in tumorigenic potential based on the heterogeneity in\napoptosis resistance of cancer cells. We use stochastic differential equations\nand kinetic Monte Carlo simulations to explore the mechanisms that generate\ncell-to-cell variability in apoptosis resistance of cancer cells. In our model,\na simplified scheme of apoptosis signaling reactions is developed focusing on\nthe proapoptotic Bid-Bax reaction and its inhibition by Bcl-2 like\nantiapoptotic proteins. We show how a combination of low probability Bid-Bax\nreaction along with overexpressed reactant molecules allows specific killing of\ncancer cells, especially under targeted therapy such as Bcl-2 inhibition. This\nlow probability Bid-Bax reaction protects normal cells from accidental\napoptosis but generates cell-to-cell stochastic variability in apoptotic\nactivation of cells equipped with overexpressed Bid and Bax molecules. We\nfurther demonstrate that cellular variations in Bcl-2 / Bax ratio, within a\ncancer cell population, can affect the intrinsic fluctuations arising from the\nstochastic Bid-Bax reaction and thereby provides a mechanism for origin of\ncells with higher tumorigenic potential. We discuss the implications of our\nresults for cancer therapy, such as, optimal strategies to minimize stochastic\nfluctuations in cancer cell death.\n", "versions": [{"version": "v1", "created": "Wed, 10 Aug 2011 03:58:28 GMT"}], "update_date": "2011-11-30", "authors_parsed": [["Raychaudhuri", "Subhadip", ""]]}, {"id": "1108.2538", "submitter": "Dionysios Barmpoutis", "authors": "Dionysios Barmpoutis and Richard M. Murray", "title": "Noise Propagation in Biological and Chemical Reaction Networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN physics.bio-ph q-bio.QM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We describe how noise propagates through a network by calculating the\nvariance of the outputs. Using stochastic calculus and dynamical systems\ntheory, we study the network topologies that accentuate or alleviate the effect\nof random variance in the network for both directed and undirected graphs.\nGiven a linear tree network, the variance in the output is a convex function of\nthe poles of the individual nodes. Cycles create correlations which in turn\nincrease the variance in the output. Feedforward and feedback have a limited\neffect on noise propagation when the respective cycles is sufficiently long.\nCrosstalk between the elements of different pathways helps reduce the output\nnoise, but makes the network slower. Next, we study the differences between\ndisturbances in the inputs and disturbances in the network parameters, and how\nthey propagate to the outputs. Finally, we show how noise correlations can\naffect the steady state of the system in chemical reaction networks with\nreactions of two or more reactants, each of which may be affected by\nindependent or correlated noise sources.\n", "versions": [{"version": "v1", "created": "Thu, 11 Aug 2011 23:53:48 GMT"}], "update_date": "2011-08-15", "authors_parsed": [["Barmpoutis", "Dionysios", ""], ["Murray", "Richard M.", ""]]}, {"id": "1108.2588", "submitter": "Kazuhiro Takemoto", "authors": "Kazuhiro Takemoto, Takeyuki Tamura, Yang Cong, Wai-Ki Ching,\n  Jean-Philippe Vert, Tatsuya Akutsu", "title": "Analysis of the impact degree distribution in metabolic networks using\n  branching process approximation", "comments": "17 pages, 4 figures, 4 tables", "journal-ref": "Physica A 391, 379 (2012)", "doi": "10.1016/j.physa.2011.08.011", "report-no": null, "categories": "q-bio.MN physics.data-an", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Theoretical frameworks to estimate the tolerance of metabolic networks to\nvarious failures are important to evaluate the robustness of biological complex\nsystems in systems biology. In this paper, we focus on a measure for robustness\nin metabolic networks, namely, the impact degree, and propose an approximation\nmethod to predict the probability distribution of impact degrees from metabolic\nnetwork structures using the theory of branching process. We demonstrate the\nrelevance of this method by testing it on real-world metabolic networks.\nAlthough the approximation method possesses a few limitations, it may be a\npowerful tool for evaluating metabolic robustness.\n", "versions": [{"version": "v1", "created": "Fri, 12 Aug 2011 08:49:10 GMT"}], "update_date": "2011-10-18", "authors_parsed": [["Takemoto", "Kazuhiro", ""], ["Tamura", "Takeyuki", ""], ["Cong", "Yang", ""], ["Ching", "Wai-Ki", ""], ["Vert", "Jean-Philippe", ""], ["Akutsu", "Tatsuya", ""]]}, {"id": "1108.3589", "submitter": "Eugene Koonin", "authors": "Eugene V. Koonin", "title": "Are there laws of genome evolution?", "comments": "17 pages, 2 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1002173", "report-no": null, "categories": "q-bio.PE q-bio.GN q-bio.MN", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Research in quantitative evolutionary genomics and systems biology led to the\ndiscovery of several universal regularities connecting genomic and molecular\nphenomic variables. These universals include the log-normal distribution of the\nevolutionary rates of orthologous genes; the power law-like distributions of\nparalogous family size and node degree in various biological networks; the\nnegative correlation between a gene's sequence evolution rate and expression\nlevel; and differential scaling of functional classes of genes with genome\nsize. The universals of genome evolution can be accounted for by simple\nmathematical models similar to those used in statistical physics, such as the\nbirth-death-innovation model. These models do not explicitly incorporate\nselection, therefore the observed universal regularities do not appear to be\nshaped by selection but rather are emergent properties of gene ensembles.\nAlthough a complete physical theory of evolutionary biology is inconceivable,\nthe universals of genome evolution might qualify as 'laws of evolutionary\ngenomics' in the same sense 'law' is understood in modern physics.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 22:19:54 GMT"}], "update_date": "2015-05-30", "authors_parsed": [["Koonin", "Eugene V.", ""]]}, {"id": "1108.3590", "submitter": "Eugene Koonin", "authors": "Alexander E. Lobkovsky, Yuri I. Wolf, Eugene V. Koonin", "title": "Predictability of evolutionary trajectories in fitness landscapes", "comments": "14 pages, 7 figures", "journal-ref": null, "doi": "10.1371/journal.pcbi.1002302", "report-no": null, "categories": "q-bio.PE q-bio.BM q-bio.MN", "license": "http://creativecommons.org/licenses/publicdomain/", "abstract": "  Experimental studies on enzyme evolution show that only a small fraction of\nall possible mutation trajectories are accessible to evolution. However, these\nexperiments deal with individual enzymes and explore a tiny part of the fitness\nlandscape. We report an exhaustive analysis of fitness landscapes constructed\nwith an off-lattice model of protein folding where fitness is equated with\nrobustness to misfolding. This model mimics the essential features of the\ninteractions between amino acids, is consistent with the key paradigms of\nprotein folding and reproduces the universal distribution of evolutionary rates\namong orthologous proteins. We introduce mean path divergence as a quantitative\nmeasure of the degree to which the starting and ending points determine the\npath of evolution in fitness landscapes. Global measures of landscape roughness\nare good predictors of path divergence in all studied landscapes: the mean path\ndivergence is greater in smooth landscapes than in rough ones. The\nmodel-derived and experimental landscapes are significantly smoother than\nrandom landscapes and resemble additive landscapes perturbed with moderate\namounts of noise; thus, these landscapes are substantially robust to mutation.\nThe model landscapes show a deficit of suboptimal peaks even compared with\nnoisy additive landscapes with similar overall roughness. We suggest that\nsmoothness and the substantial deficit of peaks in the fitness landscapes of\nprotein evolution are fundamental consequences of the physics of protein\nfolding.\n", "versions": [{"version": "v1", "created": "Wed, 17 Aug 2011 22:23:03 GMT"}], "update_date": "2015-05-30", "authors_parsed": [["Lobkovsky", "Alexander E.", ""], ["Wolf", "Yuri I.", ""], ["Koonin", "Eugene V.", ""]]}, {"id": "1108.4329", "submitter": "Tiago Peixoto", "authors": "Tiago P. Peixoto", "title": "The behavior of noise-resilient Boolean networks with diverse topologies", "comments": "17 pages, 7 figures", "journal-ref": "J. Stat. Mech. (2012) P01006", "doi": "10.1088/1742-5468/2012/01/P01006", "report-no": null, "categories": "cond-mat.dis-nn physics.bio-ph q-bio.MN", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  The dynamics of noise-resilient Boolean networks with majority functions and\ndiverse topologies is investigated. A wide class of possible topological\nconfigurations is parametrized as a stochastic blockmodel. For this class of\nnetworks, the dynamics always undergoes a phase transition from a non-ergodic\nregime, where a memory of its past states is preserved, to an ergodic regime,\nwhere no such memory exists and every microstate is equally probable. Both the\naverage error on the network, as well as the critical value of noise where the\ntransition occurs are investigated analytically, and compared to numerical\nsimulations. The results for \"partially dense\" networks, comprised of\nrelatively few, but dynamically important nodes, which have a number of inputs\nwhich greatly exceeds the average for the entire network, give very general\nupper bounds on the maximum resilience against noise attainable on globally\nsparse systems.\n", "versions": [{"version": "v1", "created": "Mon, 22 Aug 2011 14:35:37 GMT"}, {"version": "v2", "created": "Tue, 23 Aug 2011 07:02:00 GMT"}, {"version": "v3", "created": "Thu, 6 Oct 2011 13:34:34 GMT"}, {"version": "v4", "created": "Tue, 10 Jan 2012 17:31:09 GMT"}], "update_date": "2012-01-11", "authors_parsed": [["Peixoto", "Tiago P.", ""]]}, {"id": "1108.4341", "submitter": "Tiago Peixoto", "authors": "Tiago P. Peixoto", "title": "Emergence of robustness against noise: A structural phase transition in\n  evolved models of gene regulatory networks", "comments": "12 pages, 10 figures", "journal-ref": "Phys. Rev. E 85, 041908 (2012)", "doi": "10.1103/PhysRevE.85.041908", "report-no": null, "categories": "cond-mat.dis-nn physics.bio-ph q-bio.MN q-bio.PE", "license": "http://creativecommons.org/licenses/by/3.0/", "abstract": "  We investigate the evolution of Boolean networks subject to a selective\npressure which favors robustness against noise, as a model of evolved genetic\nregulatory systems. By mapping the evolutionary process into a statistical\nensemble and minimizing its associated free energy, we find the structural\nproperties which emerge as the selective pressure is increased and identify a\nphase transition from a random topology to a \"segregated core\" structure, where\na smaller and more densely connected subset of the nodes is responsible for\nmost of the regulation in the network. This segregated structure is very\nsimilar qualitatively to what is found in gene regulatory networks, where only\na much smaller subset of genes --- those responsible for transcription factors\n--- is responsible for global regulation. We obtain the full phase diagram of\nthe evolutionary process as a function of selective pressure and the average\nnumber of inputs per node. We compare the theoretical predictions with Monte\nCarlo simulations of evolved networks and with empirical data for Saccharomyces\ncerevisiae and Escherichia coli.\n", "versions": [{"version": "v1", "created": "Mon, 22 Aug 2011 15:11:50 GMT"}, {"version": "v2", "created": "Tue, 23 Aug 2011 07:54:52 GMT"}, {"version": "v3", "created": "Thu, 6 Oct 2011 13:29:45 GMT"}, {"version": "v4", "created": "Tue, 10 Apr 2012 16:49:08 GMT"}], "update_date": "2012-04-11", "authors_parsed": [["Peixoto", "Tiago P.", ""]]}, {"id": "1108.4951", "submitter": "Areejit Samal", "authors": "Areejit Samal, Andreas Wagner and Olivier C. Martin", "title": "Environmental versatility promotes modularity in genome-scale metabolic\n  networks", "comments": "34 pages, 4 main figures, 7 additional figures, 2 additional tables", "journal-ref": "BMC Systems Biology, 5:135 (2011)", "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The ubiquity of modules in biological networks may result from an\nevolutionary benefit of a modular organization. For instance, modularity may\nincrease the rate of adaptive evolution, because modules can be easily combined\ninto new arrangements that may benefit their carrier. Conversely, modularity\nmay emerge as a by-product of some trait. We here ask whether this last\nscenario may play a role in genome-scale metabolic networks that need to\nsustain life in one or more chemical environments. For such networks, we define\na network module as a maximal set of reactions that are fully coupled, i.e.,\nwhose fluxes can only vary in fixed proportions. This definition overcomes\nlimitations of purely graph based analyses of metabolism by exploiting the\nfunctional links between reactions. We call a metabolic network viable in a\ngiven chemical environment if it can synthesize all of an organism's biomass\ncompounds from nutrients in this environment. An organism's metabolism is\nhighly versatile if it can sustain life in many different chemical\nenvironments. We here ask whether versatility affects the modularity of\nmetabolic networks.\n", "versions": [{"version": "v1", "created": "Wed, 24 Aug 2011 20:50:27 GMT"}], "update_date": "2011-08-26", "authors_parsed": [["Samal", "Areejit", ""], ["Wagner", "Andreas", ""], ["Martin", "Olivier C.", ""]]}, {"id": "1108.5238", "submitter": "Anne Shiu", "authors": "Badal Joshi and Anne Shiu", "title": "Atoms of multistationarity in chemical reaction networks", "comments": "Theorem 3.1 updated to allow general kinetics, conjecture now proven\n  (Theorem 4.2), 3 figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Chemical reaction systems are dynamical systems that arise in chemical\nengineering and systems biology. In this work, we consider the question of\nwhether the minimal (in a precise sense) multistationary chemical reaction\nnetworks, which we propose to call `atoms of multistationarity,' characterize\nthe entire set of multistationary networks. Our main result states that the\nanswer to this question is `yes' in the context of fully open continuous-flow\nstirred-tank reactors (CFSTRs), which are networks in which all chemical\nspecies take part in the inflow and outflow. In order to prove this result, we\nshow that if a subnetwork admits multiple steady states, then these steady\nstates can be lifted to a larger network, provided that the two networks share\nthe same stoichiometric subspace. We also prove an analogous result when a\nsmaller network is obtained from a larger network by `removing species.' Our\nresults provide the mathematical foundation for a technique used by\nSiegal-Gaskins et al. of establishing bistability by way of `network ancestry.'\nAdditionally, our work provides sufficient conditions for establishing\nmultistationarity by way of atoms and moreover reduces the problem of\nclassifying multistationary CFSTRs to that of cataloging atoms of\nmultistationarity. As an application, we enumerate and classify all 386\nbimolecular and reversible two-reaction networks. Of these, exactly 35 admit\nmultiple positive steady states. Moreover, each admits a unique minimal\nmultistationary subnetwork, and these subnetworks form a poset (with respect to\nthe relation of `removing species') which has 11 minimal elements (the atoms of\nmultistationarity).\n", "versions": [{"version": "v1", "created": "Fri, 26 Aug 2011 04:43:54 GMT"}, {"version": "v2", "created": "Mon, 9 Jul 2012 17:57:32 GMT"}], "update_date": "2012-07-10", "authors_parsed": [["Joshi", "Badal", ""], ["Shiu", "Anne", ""]]}, {"id": "1108.5399", "submitter": "Domenico Napoletani", "authors": "D. Napoletani, E. Petricoin, D. C. Struppa", "title": "Geometric Path Integrals. A Language for Multiscale Biology and Systems\n  Robustness", "comments": null, "journal-ref": "The Mathematical Legacy of Leon Ehrenpreis, Springer Proceedings\n  in Mathematics, Volume 16, 2012, pp 247-260", "doi": "10.1007/978-88-470-1947-8_16", "report-no": null, "categories": "q-bio.MN physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  In this paper we suggest that, under suitable conditions, supervised learning\ncan provide the basis to formulate at the microscopic level quantitative\nquestions on the phenotype structure of multicellular organisms. The problem of\nexplaining the robustness of the phenotype structure is rephrased as a real\ngeometrical problem on a fixed domain. We further suggest a generalization of\npath integrals that reduces the problem of deciding whether a given molecular\nnetwork can generate specific phenotypes to a numerical property of a\nrobustness function with complex output, for which we give heuristic\njustification. Finally, we use our formalism to interpret a pointedly\nquantitative developmental biology problem on the allowed number of pairs of\nlegs in centipedes.\n", "versions": [{"version": "v1", "created": "Fri, 26 Aug 2011 21:50:41 GMT"}], "update_date": "2012-06-14", "authors_parsed": [["Napoletani", "D.", ""], ["Petricoin", "E.", ""], ["Struppa", "D. C.", ""]]}, {"id": "1108.5657", "submitter": "Vasily Ogryzko V", "authors": "Arman Kulyyassov, Muhammad Shoaib, Andrei Pichugin, Patricia\n  Kannouche, Erlan Ramanculov, Marc Lipinski and Vasily Ogryzko", "title": "PUB-MS - a mass-spectrometry-based method to monitor protein-protein\n  proximity in vivo", "comments": "46 pages, 5 main Figures and 7 supplementary Figures", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The common techniques to study protein-protein proximity in vivo are not\nwell-adapted to the capabilities and the expertise of a standard proteomics\nlaboratory, typically based on the use of mass spectrometry. With the aim of\nclosing this gap, we have developed PUB-MS (for Proximity Utilizing\nBiotinylation and Mass Spectrometry), an approach to monitor protein-protein\nproximity, based on biotinylation of a protein fused to a biotin-acceptor\npeptide (BAP) by a biotin-ligase, BirA, fused to its interaction partner. The\nbiotinylation status of the BAP can be further detected by either Western\nanalysis or mass spectrometry. The BAP sequence was redesigned for easy\nmonitoring of the biotinylation status by LC-MS/MS. In several experimental\nmodels, we demonstrate that the biotinylation in vivo is specifically enhanced\nwhen the BAP- and BirA- fused proteins are in proximity to each other. The\nadvantage of mass spectrometry is demonstrated by using BAPs with different\nsequences in a single experiment (allowing multiplex analysis) and by the use\nof stable isotopes. Finally, we show that our methodology can be also used to\nstudy a specific subfraction of a protein of interest that was in proximity\nwith another protein at a predefined time before the analysis.\n", "versions": [{"version": "v1", "created": "Mon, 29 Aug 2011 17:10:27 GMT"}], "update_date": "2011-08-30", "authors_parsed": [["Kulyyassov", "Arman", ""], ["Shoaib", "Muhammad", ""], ["Pichugin", "Andrei", ""], ["Kannouche", "Patricia", ""], ["Ramanculov", "Erlan", ""], ["Lipinski", "Marc", ""], ["Ogryzko", "Vasily", ""]]}, {"id": "1108.6062", "submitter": "Konstantin Klemm", "authors": "Gunnar Boldhaus, Florian Greil, Konstantin Klemm", "title": "Prediction of lethal and synthetically lethal knock-outs in regulatory\n  networks", "comments": "published version, 10 pages, 6 figures, 2 tables; supplement at\n  http://www.bioinf.uni-leipzig.de/publications/supplements/11-018", "journal-ref": "Theory in Biosciences 132, 17-25 (2013)", "doi": "10.1007/s12064-012-0164-1", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The complex interactions involved in regulation of a cell's function are\ncaptured by its interaction graph. More often than not, detailed knowledge\nabout enhancing or suppressive regulatory influences and cooperative effects is\nlacking and merely the presence or absence of directed interactions is known.\nHere we investigate to which extent such reduced information allows to forecast\nthe effect of a knock-out or a combination of knock-outs. Specifically we ask\nin how far the lethality of eliminating nodes may be predicted by their network\ncentrality, such as degree and betweenness, without knowing the function of the\nsystem. The function is taken as the ability to reproduce a fixed point under a\ndiscrete Boolean dynamics. We investigate two types of stochastically generated\nnetworks: fully random networks and structures grown with a mechanism of node\nduplication and subsequent divergence of interactions. On all networks we find\nthat the out-degree is a good predictor of the lethality of a single node\nknock-out. For knock-outs of node pairs, the fraction of successors shared\nbetween the two knocked-out nodes (out-overlap) is a good predictor of\nsynthetic lethality. Out-degree and out-overlap are locally defined and\ncomputationally simple centrality measures that provide a predictive power\nclose to the optimal predictor.\n", "versions": [{"version": "v1", "created": "Tue, 30 Aug 2011 20:00:58 GMT"}, {"version": "v2", "created": "Thu, 14 Feb 2013 14:45:41 GMT"}], "update_date": "2013-02-15", "authors_parsed": [["Boldhaus", "Gunnar", ""], ["Greil", "Florian", ""], ["Klemm", "Konstantin", ""]]}, {"id": "1108.6113", "submitter": "Bhaskar DasGupta", "authors": "Reka Albert, Bhaskar DasGupta, Anthony Gitter, Gamze Gursoy, Rashmi\n  Hegde, Pradyut Paul, Gowri Sangeetha Sivanathan, Eduardo Sontag", "title": "A New Computationally Efficient Measure of Topological Redundancy of\n  Biological and Social Networks", "comments": "18 pages", "journal-ref": "Physical Review E, 84 (3), 036117, 2011", "doi": "10.1103/PhysRevE.84.036117", "report-no": null, "categories": "physics.soc-ph cs.DM cs.SI math.DS q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  It is well-known that biological and social interaction networks have a\nvarying degree of redundancy, though a consensus of the precise cause of this\nis so far lacking. In this paper, we introduce a topological redundancy measure\nfor labeled directed networks that is formal, computationally efficient and\napplicable to a variety of directed networks such as cellular signaling,\nmetabolic and social interaction networks. We demonstrate the computational\nefficiency of our measure by computing its value and statistical significance\non a number of biological and social networks with up to several thousands of\nnodes and edges. Our results suggest a number of interesting observations: (1)\nsocial networks are more redundant that their biological counterparts, (2)\ntranscriptional networks are less redundant than signaling networks, (3) the\ntopological redundancy of the C. elegans metabolic network is largely due to\nits inclusion of currency metabolites, and (4) the redundancy of signaling\nnetworks is highly (negatively) correlated with the monotonicity of their\ndynamics.\n", "versions": [{"version": "v1", "created": "Wed, 31 Aug 2011 02:13:48 GMT"}, {"version": "v2", "created": "Sat, 5 Nov 2011 20:42:03 GMT"}], "update_date": "2015-05-30", "authors_parsed": [["Albert", "Reka", ""], ["DasGupta", "Bhaskar", ""], ["Gitter", "Anthony", ""], ["Gursoy", "Gamze", ""], ["Hegde", "Rashmi", ""], ["Paul", "Pradyut", ""], ["Sivanathan", "Gowri Sangeetha", ""], ["Sontag", "Eduardo", ""]]}]