[{"id": "1306.0322", "submitter": "Hector Zenil", "authors": "Hector Zenil, Fernando Soler-Toscano, Kamaludin Dingle and Ard A.\n  Louis", "title": "Correlation of Automorphism Group Size and Topological Properties with\n  Program-size Complexity Evaluations of Graphs and Complex Networks", "comments": "15 2-column pages, 20 figures. Forthcoming in Physica A: Statistical\n  Mechanics and its Applications", "journal-ref": null, "doi": "10.1016/j.physa.2014.02.060", "report-no": null, "categories": "cs.IT cs.CC cs.CG math.IT q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We show that numerical approximations of Kolmogorov complexity (K) applied to\ngraph adjacency matrices capture some group-theoretic and topological\nproperties of graphs and empirical networks ranging from metabolic to social\nnetworks. That K and the size of the group of automorphisms of a graph are\ncorrelated opens up interesting connections to problems in computational\ngeometry, and thus connects several measures and concepts from complexity\nscience. We show that approximations of K characterise synthetic and natural\nnetworks by their generating mechanisms, assigning lower algorithmic randomness\nto complex network models (Watts-Strogatz and Barabasi-Albert networks) and\nhigh Kolmogorov complexity to (random) Erdos-Renyi graphs. We derive these\nresults via two different Kolmogorov complexity approximation methods applied\nto the adjacency matrices of the graphs and networks. The methods used are the\ntraditional lossless compression approach to Kolmogorov complexity, and a\nnormalised version of a Block Decomposition Method (BDM) measure, based on\nalgorithmic probability theory.\n", "versions": [{"version": "v1", "created": "Mon, 3 Jun 2013 08:36:11 GMT"}, {"version": "v2", "created": "Mon, 17 Jun 2013 11:32:00 GMT"}, {"version": "v3", "created": "Sun, 23 Feb 2014 01:42:27 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Zenil", "Hector", ""], ["Soler-Toscano", "Fernando", ""], ["Dingle", "Kamaludin", ""], ["Louis", "Ard A.", ""]]}, {"id": "1306.1390", "submitter": "Sarbaz H. A. Khoshnaw", "authors": "Sarbaz H. A. Khoshnaw", "title": "Reduction of Mathematical Models of Nuclear Receptor Binding to Promoter\n  Regions", "comments": "23 pages, 6 figures and 4 tables", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.QM q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We study kinetic model of Nuclear Receptor Binding to Promoter Regions. This\nmodel is written as a system of ordinary differential equations. Model\nreduction techniques have been used to simplify chemical kinetics.In this case\nstudy, the technique of Pseudo-first order approximation is applied to simplify\nthe reaction rates. CellDesigner has been used to draw the structures of\nchemical reactions of Nuclear Receptor Binding to Promoter Regions. After model\nreduction, the general analytical solution for reduced model is given and the\nnumber of species and reactions are reduced from 9 species and 6 reactions to 6\nspecies and 5 reactions.\n", "versions": [{"version": "v1", "created": "Thu, 6 Jun 2013 12:21:19 GMT"}, {"version": "v2", "created": "Sat, 10 Aug 2013 18:51:00 GMT"}], "update_date": "2013-08-13", "authors_parsed": [["Khoshnaw", "Sarbaz H. A.", ""]]}, {"id": "1306.1904", "submitter": "Chris Oates", "authors": "Chris J Oates, Bryan T Hennessy, Yiling Lu, Gordon B Mills and Sach\n  Mukherjee", "title": "Network Inference Using Steady State Data and Goldbeter-Koshland\n  Kinetics", "comments": "Preprint", "journal-ref": "Bioinformatics (2012) 28(18):2342-2348", "doi": "10.1093/bioinformatics/bts459", "report-no": null, "categories": "stat.AP q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Network inference approaches are widely used to shed light on regulatory\ninterplay between molecular players such as genes and proteins. Biochemical\nprocesses underlying networks of interest (e.g. gene regulatory or protein\nsignalling networks) are generally nonlinear. In many settings, knowledge is\navailable concerning relevant chemical kinetics. However, existing network\ninference methods for continuous, steady-state data are typically rooted in\nstatistical formulations, which do not exploit chemical kinetics to guide\ninference. Herein, we present an approach to network inference for steady-state\ndata that is rooted in non-linear descriptions of biochemical mechanism. We use\nequilibrium analysis of chemical kinetics to obtain functional forms that are\nin turn used to infer networks using steady-state data. The approach we propose\nis directly applicable to conventional steady-state gene expression or\nproteomic data and does not require knowledge of either network topology or any\nkinetic parameters. We illustrate the approach in the context of protein\nphosphorylation networks, using data simulated from a recent mechanistic model\nand proteomic data from cancer cell lines. In the former, the true network is\nknown and used for assessment, whereas in the latter, results are compared\nagainst known biochemistry. We find that the proposed methodology is more\neffective at estimating network topology than methods based on linear models.\n", "versions": [{"version": "v1", "created": "Sat, 8 Jun 2013 10:43:23 GMT"}], "update_date": "2014-06-03", "authors_parsed": [["Oates", "Chris J", ""], ["Hennessy", "Bryan T", ""], ["Lu", "Yiling", ""], ["Mills", "Gordon B", ""], ["Mukherjee", "Sach", ""]]}, {"id": "1306.2244", "submitter": "Susan Khor", "authors": "Susan Khor", "title": "Local search on protein residue networks", "comments": null, "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.MN q-bio.BM", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Self-avoiding random walks were performed on protein residue networks.\nCompared with protein residue networks with randomized links, the probability\nof a walk being successful is lower and the length of successful walks shorter\nin (non-randomized) protein residue networks. Fewer successful walks and\nshorter successful walks point to higher communication specificity between\nprotein residues, a conceivably favourable attribute for proteins to have. The\nuse of random walks instead of shortest paths also produced lower node\ncentrality, lower edge betweeness and lower edge load for (non-randomized)\nprotein residue networks than in their respective randomized counterparts. The\nimplications of these properties for protein residue networks are discussed in\nterms of communication congestion and network vulnerability. The randomized\nprotein residue networks have lower network clustering than the\n(non-randomized) protein residue networks. Hence, our findings also shed light\non a hitherto neglected aspect: the importance of high network clustering in\nprotein residue networks. High clustering increases navigability of a network\nfor local search and the combination of a local search process on a highly\nclustered small-world network topology such as protein residue networks reduces\ncommunication congestion and network vulnerability.\n", "versions": [{"version": "v1", "created": "Mon, 10 Jun 2013 16:29:10 GMT"}], "update_date": "2013-06-11", "authors_parsed": [["Khor", "Susan", ""]]}, {"id": "1306.2480", "submitter": "Federico Ricci-Tersenghi", "authors": "Alessandro Seganti, Andrea De Martino, Federico Ricci-Tersenghi", "title": "Boolean constraint satisfaction problems for reaction networks", "comments": "16 pages (incl. appendix)", "journal-ref": "J. Stat. Mech. (2013) P09009", "doi": "10.1088/1742-5468/2013/09/P09009", "report-no": null, "categories": "q-bio.MN cond-mat.dis-nn cond-mat.stat-mech", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  We define and study a class of (random) Boolean constraint satisfaction\nproblems representing minimal feasibility constraints for networks of chemical\nreactions. The constraints we consider encode, respectively, for hard\nmass-balance conditions (where the consumption and production fluxes of each\nchemical species are matched) and for soft mass-balance conditions (where a net\nproduction of compounds is in principle allowed). We solve these constraint\nsatisfaction problems under the Bethe approximation and derive the\ncorresponding Belief Propagation equations, that involve 8 different messages.\nThe statistical properties of ensembles of random problems are studied via the\npopulation dynamics methods. By varying a chemical potential attached to the\nactivity of reactions, we find first order transitions and strong hysteresis,\nsuggesting a non-trivial structure in the space of feasible solutions.\n", "versions": [{"version": "v1", "created": "Tue, 11 Jun 2013 10:31:58 GMT"}, {"version": "v2", "created": "Mon, 13 Oct 2014 13:40:26 GMT"}], "update_date": "2014-10-14", "authors_parsed": [["Seganti", "Alessandro", ""], ["De Martino", "Andrea", ""], ["Ricci-Tersenghi", "Federico", ""]]}, {"id": "1306.2605", "submitter": "Sayak Mukherjee", "authors": "Sayak Mukherjee, Sang-Cheol Seok, Veronica J. Vieland, and Jayajit Das", "title": "Cell responses only partially shape cell-to-cell variations in protein\n  abundances in Escherichia coli chemotaxis", "comments": "51 Pages, 18 Figures", "journal-ref": "PNAS epub, October 28, 2013", "doi": "10.1073/pnas.1311069110", "report-no": null, "categories": "q-bio.CB cond-mat.stat-mech q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Cell-to-cell variations in protein abundance in clonal cell populations are\nubiquitous in living systems. Since protein composition determines responses in\nindividual cells, it stands to reason that the variations themselves are\nsubject to selective pressures. But the functional role of these cell-to-cell\ndifferences is not well understood. One way to tackle questions regarding\nrelationships between form and function is to perturb the form (e.g., change\nthe protein abundances) and observe the resulting changes in some function.\nHere we take on the form-function relationship from the inverse perspective,\nasking instead what specific constraints on cell-to-cell variations in protein\nabundance are imposed by a given functional phenotype. We develop a maximum\nentropy (MaxEnt) based approach to posing questions of this type, and\nillustrate the method by application to the well characterized chemotactic\nresponse in Escherichia coli (E. coli). We find that full determination of\nobserved cell-to-cell variations in protein abundances is not inherent in\nchemotaxis itself, but in fact appears to be jointly imposed by the chemotaxis\nprogram in conjunction with other factors, e.g., the protein synthesis\nmachinery and/or additional non-chemotactic cell functions such as cell\nmetabolism. These results illustrate the power of MaxEnt as a tool for the\ninvestigation of relationships between biological form and function.\n", "versions": [{"version": "v1", "created": "Tue, 11 Jun 2013 18:36:34 GMT"}, {"version": "v2", "created": "Tue, 29 Oct 2013 20:23:18 GMT"}], "update_date": "2013-11-01", "authors_parsed": [["Mukherjee", "Sayak", ""], ["Seok", "Sang-Cheol", ""], ["Vieland", "Veronica J.", ""], ["Das", "Jayajit", ""]]}, {"id": "1306.3312", "submitter": "Yen-yu Chen", "authors": "Yan Yu Chen, Chun-Cheih Chao, Fu-Chen Liu, Po-Chen Hsu, Hsueh-Fen\n  Chen, Shih-Chi Peng, Yung-Jen Chuang, Chung-Yu Lan, Wen-Ping Hsieh, David\n  Shan Hill Wong", "title": "Dynamic Transcript Profiling of Candida Albicans Infection in Zebrafish:\n  a Pathogen-Host Interaction Study", "comments": null, "journal-ref": null, "doi": "10.1371/journal.pone.0072483", "report-no": null, "categories": "q-bio.GN q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Candida albicans is responsible for a number of life-threatening infections\nand causes considerable morbidity and mortality in immunocompromised patients.\nPrevious studies of C. albicans pathogenesis have suggested several steps must\noccur before virulent infection, including early adhesion, invasion, and late\ntissue damage. However, the mechanism that triggers C. albicans transformation\nfrom yeast to hyphae form during infection has yet to be fully elucidated. This\nstudy used a systems biology approach to investigate C. albicans infection in\nzebrafish. The surviving fish were sampled at different post-infection time\npoints to obtain time-lapsed, genome-wide transcriptomic data from both\norganisms, which were accompanied with in sync histological analyses. Principal\ncomponent analysis (PCA) was used to analyze the dynamic gene expression\nprofiles of significant variations in both C. albicans and zebrafish. The\nresults categorized C. albicans infection into three progressing phases:\nadhesion, invasion, and damage. Such findings were highly supported by the\ncorresponding histological analysis. Furthermore, the dynamic interspecies\ntranscript profiling revealed that C. albicans activated its filamentous\nformation during invasion and the iron scavenging functions during the damage\nphases, whereas zebrafish ceased its iron homeostasis function following\nmassive hemorrhage during the later stages of infection. This was followed by\nmassive hemorrhaging toward the end stage of infection. Most of the immune\nrelated genes were expressed as the infection progressed from invasion to the\ndamage phase. Such global, inter-species evidence of virulence-immune and iron\ncompetition dynamics during C. albicans infection could be crucial in\nunderstanding control fungal pathogenesis.\n", "versions": [{"version": "v1", "created": "Fri, 14 Jun 2013 07:10:45 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Chen", "Yan Yu", ""], ["Chao", "Chun-Cheih", ""], ["Liu", "Fu-Chen", ""], ["Hsu", "Po-Chen", ""], ["Chen", "Hsueh-Fen", ""], ["Peng", "Shih-Chi", ""], ["Chuang", "Yung-Jen", ""], ["Lan", "Chung-Yu", ""], ["Hsieh", "Wen-Ping", ""], ["Wong", "David Shan Hill", ""]]}, {"id": "1306.3371", "submitter": "Peter Csermely", "authors": "David M. Gyurko, Daniel V. Veres, Dezso Modos, Katalin Lenti, Tamas\n  Korcsmaros and Peter Csermely", "title": "Adaptation and learning of molecular networks as a description of cancer\n  development at the systems-level: Potential use in anti-cancer therapies", "comments": "8 pages,2 figures, 1 table, 98 references", "journal-ref": "Seminars in Cancer Biology 23 (2013) 262-269", "doi": "10.1016/j.semcancer.2013.06.005", "report-no": null, "categories": "q-bio.MN nlin.AO physics.bio-ph", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  There is a widening recognition that cancer cells are products of complex\ndevelopmental processes. Carcinogenesis and metastasis formation are\nincreasingly described as systems-level, network phenomena. Here we propose\nthat malignant transformation is a two-phase process, where an initial increase\nof system plasticity is followed by a decrease of plasticity at late stages of\ncarcinogenesis as a model of cellular learning. We describe the hallmarks of\nincreased system plasticity of early, tumor initiating cells, such as increased\nnoise, entropy, conformational and phenotypic plasticity, physical\ndeformability, cell heterogeneity and network rearrangements. Finally, we argue\nthat the large structural changes of molecular networks during cancer\ndevelopment necessitate a rather different targeting strategy in early and late\nphase of carcinogenesis. Plastic networks of early phase cancer development\nneed a central hit, while rigid networks of late stage primary tumors or\nestablished metastases should be attacked by the network influence strategy,\nsuch as by edgetic, multi-target, or allo-network drugs. Cancer stem cells need\nspecial diagnosis and targeting, since their dormant and rapidly proliferating\nforms may have more rigid, or more plastic networks, respectively. The\nextremely high ability to change their rigidity/plasticity may be a key\ndifferentiating hallmark of cancer stem cells. The application of early\nstage-optimized anti-cancer drugs to late-stage patients may be a reason of\nmany failures in anti-cancer therapies. Our hypotheses presented here underlie\nthe need for patient-specific multi-target therapies applying the correct ratio\nof central hits and network influences -- in an optimized sequence.\n", "versions": [{"version": "v1", "created": "Fri, 14 Jun 2013 11:57:44 GMT"}, {"version": "v2", "created": "Tue, 17 Sep 2013 05:37:04 GMT"}], "update_date": "2013-09-18", "authors_parsed": [["Gyurko", "David M.", ""], ["Veres", "Daniel V.", ""], ["Modos", "Dezso", ""], ["Lenti", "Katalin", ""], ["Korcsmaros", "Tamas", ""], ["Csermely", "Peter", ""]]}, {"id": "1306.4793", "submitter": "Larry Bull", "authors": "Larry Bull", "title": "Evolving Boolean Regulatory Networks with Epigenetic Control", "comments": "18 pages, 10 figures. arXiv admin note: substantial text overlap with\n  arXiv:1303.7220", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.NE q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The significant role of epigenetic mechanisms within natural systems has\nbecome increasingly clear. This paper uses a recently presented abstract,\ntunable Boolean genetic regulatory network model to explore aspects of\nepigenetics. It is shown how dynamically controlling transcription via a DNA\nmethylation-inspired mechanism can be selected for by simulated evolution under\nvarious single and multiple cell scenarios. Further, it is shown that the\neffects of such control can be inherited without detriment to fitness.\n", "versions": [{"version": "v1", "created": "Thu, 20 Jun 2013 09:00:40 GMT"}], "update_date": "2013-06-21", "authors_parsed": [["Bull", "Larry", ""]]}, {"id": "1306.5355", "submitter": "Davit Potoyan", "authors": "D. A. Potoyan and P. G. Wolynes", "title": "On the dephasing of genetic oscillations", "comments": null, "journal-ref": null, "doi": "10.1073/pnas.1323433111", "report-no": null, "categories": "q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The digital nature of genes combined with the associated low copy numbers of\nproteins regulating them is a significant source of stochasticity, which\naffects the phase of biochemical oscillations. We provide a theoretical\nframework for understanding the dephasing evolution of genetic oscillations by\ncombining the phenomenological stochastic limit cycle dynamics and the discrete\nMarkov state models that describe the genetic oscillations. Through simulations\nof the realistic model of the NF\\kappa B/I\\kappa B network we illustrate the\ndephasing phenomena which are important for reconciling single cell and\npopulation based experiments on this system.\n", "versions": [{"version": "v1", "created": "Sat, 22 Jun 2013 21:26:38 GMT"}], "update_date": "2014-06-03", "authors_parsed": [["Potoyan", "D. A.", ""], ["Wolynes", "P. G.", ""]]}, {"id": "1306.5533", "submitter": "Larry Bull", "authors": "Larry Bull and Andrew Adamatzky", "title": "Evolving Gene Regulatory Networks with Mobile DNA Mechanisms", "comments": "7 pages, 8 figures. arXiv admin note: substantial text overlap with\n  arXiv:1303.7220", "journal-ref": null, "doi": null, "report-no": null, "categories": "cs.CE nlin.AO q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  This paper uses a recently presented abstract, tuneable Boolean regulatory\nnetwork model extended to consider aspects of mobile DNA, such as transposons.\nThe significant role of mobile DNA in the evolution of natural systems is\nbecoming increasingly clear. This paper shows how dynamically controlling\nnetwork node connectivity and function via transposon-inspired mechanisms can\nbe selected for in computational intelligence tasks to give improved\nperformance. The designs of dynamical networks intended for implementation\nwithin the slime mould Physarum polycephalum and for the distributed control of\na smart surface are considered.\n", "versions": [{"version": "v1", "created": "Mon, 24 Jun 2013 07:53:25 GMT"}], "update_date": "2013-06-25", "authors_parsed": [["Bull", "Larry", ""], ["Adamatzky", "Andrew", ""]]}, {"id": "1306.6129", "submitter": "Taichi Haruna", "authors": "Taichi Haruna", "title": "Robustness and Directed Structures in Ecological Flow Networks", "comments": "7 pages", "journal-ref": null, "doi": null, "report-no": null, "categories": "q-bio.PE nlin.AO physics.soc-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  Robustness of ecological flow networks under random failure of arcs is\nconsidered with respect to two different functionalities: coherence and\ncirculation. In our previous work, we showed that each functionality is\nassociated with a natural path notion: lateral path for the former and directed\npath for the latter. Robustness of a network is measured in terms of the size\nof the giant laterally connected arc component and that of the giant strongly\nconnected arc component, respectively. We study how realistic structures of\necological flow networks affect the robustness with respect to each\nfunctionality. To quantify the impact of realistic network structures, two null\nmodels are considered for a given real ecological flow network: one is random\nnetworks with the same degree distribution and the other is those with the same\naverage degree. Robustness of the null models is calculated by theoretically\nsolving the size of giant components for the configuration model. We show that\nrealistic network structures have positive effect on robustness for coherence,\nwhereas they have negative effect on robustness for circulation.\n", "versions": [{"version": "v1", "created": "Wed, 26 Jun 2013 05:00:52 GMT"}], "update_date": "2013-06-27", "authors_parsed": [["Haruna", "Taichi", ""]]}, {"id": "1306.6318", "submitter": "Yamir Moreno Vega", "authors": "Joaqu\\'in Sanz, Emanuele Cozzo and Yamir Moreno", "title": "Data reliability in complex directed networks", "comments": "Submitted for publication", "journal-ref": null, "doi": "10.1088/1742-5468/2013/12/P12008", "report-no": null, "categories": "physics.soc-ph cond-mat.stat-mech physics.bio-ph q-bio.MN", "license": "http://arxiv.org/licenses/nonexclusive-distrib/1.0/", "abstract": "  The availability of data from many different sources and fields of science\nhas made it possible to map out an increasing number of networks of contacts\nand interactions. However, quantifying how reliable these data are remains an\nopen problem. From Biology to Sociology and Economy, the identification of\nfalse and missing positives has become a problem that calls for a solution. In\nthis work we extend one of newest, best performing models -due to Guimera and\nSales-Pardo in 2009- to directed networks. The new methodology is able to\nidentify missing and spurious directed interactions, which renders it\nparticularly useful to analyze data reliability in systems like trophic webs,\ngene regulatory networks, communication patterns and social systems. We also\nshow, using real-world networks, how the method can be employed to help\nsearching for new interactions in an efficient way.\n", "versions": [{"version": "v1", "created": "Wed, 26 Jun 2013 19:06:31 GMT"}, {"version": "v2", "created": "Thu, 27 Jun 2013 00:12:22 GMT"}], "update_date": "2015-06-16", "authors_parsed": [["Sanz", "Joaquín", ""], ["Cozzo", "Emanuele", ""], ["Moreno", "Yamir", ""]]}]